{
  "title":"How to Bake a Steak",
  "url":"https://www.wikihow.com/Bake-a-Steak",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb",
    "Steak Dishes"
  ],
  "methods":[
    {
      "name":"Making Steak with a Broiler",
      "steps":[
        {
          "headline":"Let the steak sit at room temperature for 30 to 60 minutes.",
          "description":"This will help the steak cook more evenly and prevents the meat from seizing, which makes it tougher. Place the steak on the kitchen counter, for instance, to let it warm up before you bake it. This is especially important for thicker cuts of meat, so the center doesn’t end up undercooked while the edges are overcooked. Don’t let the steak sit out for more than 2 hours or it will go bad. How to Choose a Steak\nIf you're on a budget, pick a cheaper cut, like tri-tips, top blade, or bottom sirloin. If you're looking for the most flavor, opt for a steak that's on the bone. Bone-in meat tends to be more flavorful and juicy. For that perfect steakhouse taste, choose a strip, rib eye, porterhouse or T-bone steak. These are the most popular among chefs. For the best quality, buy your meat from a butcher or the butcher's section of the grocery store. Avoid pre-packaged or frozen steak."
        },
        {
          "headline":"Preheat the oven broiler.",
          "description":"The broiler in your oven is a way of cooking food by exposing it to very high heat. Unlike the traditional bake setting, which requires a specific temperature, broilers only have 2 options: on or off. Turn yours on and let it preheat while you prepare the steak. An oven will heat much faster on the broil setting. It typically only takes about 5 to 10 minutes. In most ovens, the broiler is in the main compartment. However, in older gas ovens, there may be a separate broiler drawer. Check the oven manual if you aren’t sure where yours is or how to use it."
        },
        {
          "headline":"Place your empty skillet inside the oven while it preheats.",
          "description":"Warming up your pan ahead of time ensures a better sear on your steak. Make sure you choose an oven-safe skillet, like a cast iron, aluminum, or stainless steel one. If you aren’t sure if your pan can go in the oven, check the bottom to see if it says “oven-safe” or “safe for oven use.”\nYou can also preheat your pan on the stove. Set the skillet on a burner and turn it to high heat for 5 minutes."
        },
        {
          "headline":"Blot the steak with paper towels to remove excess moisture.",
          "description":"Lightly dab the meat to dry it and soak up any water. Be careful not to press too hard, or you’ll absorb some of the steak juices, too. You can use a cloth towel instead of paper towels if you’d like. Wash it immediately after using it on the meat to kill any bacteria."
        },
        {
          "headline":"Brush 2 US tbsp (30 ml) of oil onto the steak, then rub in salt and pepper.",
          "description":"Use a pastry brush to coat both sides of the steak. Then sprinkle on the salt and pepper and rub it into the meat with your hands, pressing firmly so the seasoning can penetrate the steak. Add as much or as little seasoning as you want. Get creative with your rub! Mix in garlic powder, paprika, thyme, or seasoned salt, for example. You can use any type of oil, like olive or vegetable oil, depending on your preferences or what you have in the pantry. Always wash your hands with soap and warm water after touching raw meat. Steak Rub Options\nFor a citrus flavor, combine grated lemon peel, rosemary, and salt. If you're craving Mexican food, try dried ancho pepper, chili powder, cilantro, and a touch of lime. If you like the combo of sweet and salty, add brown sugar to salt and black pepper. For Montreal steak seasoning, rub in garlic powder, onion powder, paprika, salt, coriander, dill, and red pepper flakes."
        },
        {
          "headline":"Set the skillet on the stove over high heat.",
          "description":"Carefully remove the pan from the oven and transfer it to a burner. Be sure to use an oven mitt or hot pad since the pan will be very hot. Turn the stove to a high heat setting. On stoves that use numbers on the dials, high heat is considered 6 to 9 on one that goes from 1 to 9."
        },
        {
          "headline":"Sear the steak in the skillet for 30 seconds on each side.",
          "description":"You should hear the steak sizzle when you place it in the pan. Gently press down on the meat with a spatula to ensure the entire bottom surface is touching the pan and being cooked. If there’s a lot of steam or smoke, turn on the exhaust fan above the stove. The center of the pan will be the hottest spot and is ideal for searing."
        },
        {
          "headline":"Place the pan in the oven to broil the steak for 2 minutes.",
          "description":"Avoid the urge to open the oven door to check on the steak during the 2 minutes. This lets heat escape and affects how the meat is cooked. Set a kitchen timer or use the clock app on your phone to keep track of the time. Thinner cuts of steak may require less time, while thicker cuts may need longer than 2 minutes."
        },
        {
          "headline":"Flip the steak over and let it broil for another 2 minutes.",
          "description":"Use tongs to turn the steak onto the other side so it cooks evenly. Your steak will now be a medium-rare temperature. If you want a medium steak, add 2 minutes so it cooks for a total of 4 minutes on the 2nd side. Use a meat thermometer to check the temperature if you can’t tell by the color of the steak or if you don’t want to rely on the timing alone. Different Temperatures for Steak\nRare: 125 °F (52 °C)\nMedium-rare: 135 °F (57 °C)\nMedium: 145 °F (63 °C)\nMedium-well: 150 °F (66 °C)\nWell done: 160 °F (71 °C)"
        },
        {
          "headline":"Remove the pan from the oven and let the steak rest for 5 minutes.",
          "description":"Allowing meat to rest before you eat it lets it re-absorb any moisture and juices that may have escaped while cooking. If you cut into the steak immediately after taking it out of the oven, the juices will run out and you’ll end up with a dry piece of meat. You can leave the steak in the pan to rest or move it to a clean cutting board or dish. Store leftover steak in the fridge in an airtight container for up to 4 days."
        }
      ]
    },
    {
      "name":"Cooking Steak in Foil Packs",
      "steps":[
        {
          "headline":"Preheat the oven to 400 °F (204 °C).",
          "description":"This typically takes about 20 to 30 minutes. Turn the oven on while you make the foil packs so it’s at the right temperature when you’re ready to place the steak inside. To preheat the oven faster, turn on the broiler first. Then switch it to the bake setting before you use it."
        },
        {
          "headline":"Lay out two 12 by 12 in (30 by 30 cm) sheets of aluminum foil.",
          "description":"Tear off your sheets and place them side by side on a flat surface. Smooth out any wrinkles with the palm of your hand so they’re completely flat. If you want to divide the steak into more than 2 servings, use smaller pieces of aluminum foil. For example, rip off 4 6 by 6 in (15 by 15 cm) sheets. For extra protection, you can place the aluminum foil on a cutting board. If any stray pieces of steak or juice comes off the foil, it won’t contaminate the counter."
        },
        {
          "headline":"Cut the steak into even strips that are at least 2 in (5.1 cm) thick.",
          "description":"This will give you steak that’s cooked medium-well. If you cut strips that are thinner than 2 inches (5.1 cm), the steak will likely be dry and overcooked. Use a sharp knife to slice the 1 lb (0.45 kg) top sirloin steak on a cutting board, making sure the strips are all approximately the same thickness. The thicker the strips are, the more rare your steak will be. Don't cut pieces thicker than 4 inches (10 cm). Otherwise, your steak will be undercooked. Skirt, hanger, or flank steak cuts work best for these packets. They're tender, easy to cut, and soak up marinade well. If you don't want to spend a lot of money, pick a cheaper cut like tri-tips, bottom sirloin, or top blade."
        },
        {
          "headline":"Place half of the steak strips in the center of each foil sheet.",
          "description":"Grouping the meat as close to the center of the foil will make it easier to close up the packs. Keep the amounts on each sheet even so one pack isn’t much larger than the other. If you used more than 2 sheets of foil, divide up your steak accordingly. Wash your hands with soap and warm water after handling the raw meat so you don’t spread bacteria."
        },
        {
          "headline":"Season the steak with the olive oil, salt, and pepper.",
          "description":"Drizzle 2 tablespoons (30 ml) of olive oil over both piles of meat, then sprinkle salt and pepper on top. Add as much seasoning as you’d like. Feel free to add other spices and herbs, like dried rosemary, garlic salt, or curry powder, for extra flavor. You can also chop up veggies or potatoes to cook with the steak in the packs. Substitute any type of oil for the olive oil if you prefer a different taste."
        },
        {
          "headline":"Seal the aluminum foil around the steak, forming a pack.",
          "description":"Gather the edges of the foil sheet and squeeze them together in the center, wrapping up the steak. Try to avoid leaving any gaps where moisture could escape. The tighter you seal the packs, the juicier the meat will be. If you rip the foil, transfer the steak to a new sheet and wrap it again."
        },
        {
          "headline":"Place the packs in the oven to cook for 30 minutes.",
          "description":"Set the packs directly on the oven rack, making sure the side with the sealed edges is facing up. The best spot is the center rack, which is where the hot air circulates best and cooks your meat more evenly. To avoid a mess, you can place the packs on a baking sheet to catch any juice that may leak out of the foil. Use your phone’s clock app or a kitchen timer so you don’t forget to take the packs out after 30 minutes."
        },
        {
          "headline":"Remove the packs from the oven and let them rest for 5 minutes.",
          "description":"When steak cooks, the moisture spreads to the outside of the meat. Letting it rest before you eat it allows the steak to soak back up the juices so it’s not dry. Store any leftover steak in an airtight container in the refrigerator for no more than 4 days. How to Use Leftover Steak\nCut the steak into strips for fajitas or tacos. Slice it thinly to use on sandwiches, like a Philly cheesesteak. Toss strips of steak with green salad for a filling lunch. Dice it up to add to soups or stews. Serve steak with eggs for a hearty breakfast."
        }
      ]
    }
  ],
  "text":" Making Steak with a Broiler Let the steak sit at room temperature for 30 to 60 minutes. This will help the steak cook more evenly and prevents the meat from seizing, which makes it tougher. Place the steak on the kitchen counter, for instance, to let it warm up before you bake it. This is especially important for thicker cuts of meat, so the center doesn’t end up undercooked while the edges are overcooked. Don’t let the steak sit out for more than 2 hours or it will go bad. How to Choose a Steak\nIf you're on a budget, pick a cheaper cut, like tri-tips, top blade, or bottom sirloin. If you're looking for the most flavor, opt for a steak that's on the bone. Bone-in meat tends to be more flavorful and juicy. For that perfect steakhouse taste, choose a strip, rib eye, porterhouse or T-bone steak. These are the most popular among chefs. For the best quality, buy your meat from a butcher or the butcher's section of the grocery store. Avoid pre-packaged or frozen steak. Preheat the oven broiler. The broiler in your oven is a way of cooking food by exposing it to very high heat. Unlike the traditional bake setting, which requires a specific temperature, broilers only have 2 options: on or off. Turn yours on and let it preheat while you prepare the steak. An oven will heat much faster on the broil setting. It typically only takes about 5 to 10 minutes. In most ovens, the broiler is in the main compartment. However, in older gas ovens, there may be a separate broiler drawer. Check the oven manual if you aren’t sure where yours is or how to use it. Place your empty skillet inside the oven while it preheats. Warming up your pan ahead of time ensures a better sear on your steak. Make sure you choose an oven-safe skillet, like a cast iron, aluminum, or stainless steel one. If you aren’t sure if your pan can go in the oven, check the bottom to see if it says “oven-safe” or “safe for oven use.”\nYou can also preheat your pan on the stove. Set the skillet on a burner and turn it to high heat for 5 minutes. Blot the steak with paper towels to remove excess moisture. Lightly dab the meat to dry it and soak up any water. Be careful not to press too hard, or you’ll absorb some of the steak juices, too. You can use a cloth towel instead of paper towels if you’d like. Wash it immediately after using it on the meat to kill any bacteria. Brush 2 US tbsp (30 ml) of oil onto the steak, then rub in salt and pepper. Use a pastry brush to coat both sides of the steak. Then sprinkle on the salt and pepper and rub it into the meat with your hands, pressing firmly so the seasoning can penetrate the steak. Add as much or as little seasoning as you want. Get creative with your rub! Mix in garlic powder, paprika, thyme, or seasoned salt, for example. You can use any type of oil, like olive or vegetable oil, depending on your preferences or what you have in the pantry. Always wash your hands with soap and warm water after touching raw meat. Steak Rub Options\nFor a citrus flavor, combine grated lemon peel, rosemary, and salt. If you're craving Mexican food, try dried ancho pepper, chili powder, cilantro, and a touch of lime. If you like the combo of sweet and salty, add brown sugar to salt and black pepper. For Montreal steak seasoning, rub in garlic powder, onion powder, paprika, salt, coriander, dill, and red pepper flakes. Set the skillet on the stove over high heat. Carefully remove the pan from the oven and transfer it to a burner. Be sure to use an oven mitt or hot pad since the pan will be very hot. Turn the stove to a high heat setting. On stoves that use numbers on the dials, high heat is considered 6 to 9 on one that goes from 1 to 9. Sear the steak in the skillet for 30 seconds on each side. You should hear the steak sizzle when you place it in the pan. Gently press down on the meat with a spatula to ensure the entire bottom surface is touching the pan and being cooked. If there’s a lot of steam or smoke, turn on the exhaust fan above the stove. The center of the pan will be the hottest spot and is ideal for searing. Place the pan in the oven to broil the steak for 2 minutes. Avoid the urge to open the oven door to check on the steak during the 2 minutes. This lets heat escape and affects how the meat is cooked. Set a kitchen timer or use the clock app on your phone to keep track of the time. Thinner cuts of steak may require less time, while thicker cuts may need longer than 2 minutes. Flip the steak over and let it broil for another 2 minutes. Use tongs to turn the steak onto the other side so it cooks evenly. Your steak will now be a medium-rare temperature. If you want a medium steak, add 2 minutes so it cooks for a total of 4 minutes on the 2nd side. Use a meat thermometer to check the temperature if you can’t tell by the color of the steak or if you don’t want to rely on the timing alone. Different Temperatures for Steak\nRare: 125 °F (52 °C)\nMedium-rare: 135 °F (57 °C)\nMedium: 145 °F (63 °C)\nMedium-well: 150 °F (66 °C)\nWell done: 160 °F (71 °C) Remove the pan from the oven and let the steak rest for 5 minutes. Allowing meat to rest before you eat it lets it re-absorb any moisture and juices that may have escaped while cooking. If you cut into the steak immediately after taking it out of the oven, the juices will run out and you’ll end up with a dry piece of meat. You can leave the steak in the pan to rest or move it to a clean cutting board or dish. Store leftover steak in the fridge in an airtight container for up to 4 days. Cooking Steak in Foil Packs Preheat the oven to 400 °F (204 °C). This typically takes about 20 to 30 minutes. Turn the oven on while you make the foil packs so it’s at the right temperature when you’re ready to place the steak inside. To preheat the oven faster, turn on the broiler first. Then switch it to the bake setting before you use it. Lay out two 12 by 12 in (30 by 30 cm) sheets of aluminum foil. Tear off your sheets and place them side by side on a flat surface. Smooth out any wrinkles with the palm of your hand so they’re completely flat. If you want to divide the steak into more than 2 servings, use smaller pieces of aluminum foil. For example, rip off 4 6 by 6 in (15 by 15 cm) sheets. For extra protection, you can place the aluminum foil on a cutting board. If any stray pieces of steak or juice comes off the foil, it won’t contaminate the counter. Cut the steak into even strips that are at least 2 in (5.1 cm) thick. This will give you steak that’s cooked medium-well. If you cut strips that are thinner than 2 inches (5.1 cm), the steak will likely be dry and overcooked. Use a sharp knife to slice the 1 lb (0.45 kg) top sirloin steak on a cutting board, making sure the strips are all approximately the same thickness. The thicker the strips are, the more rare your steak will be. Don't cut pieces thicker than 4 inches (10 cm). Otherwise, your steak will be undercooked. Skirt, hanger, or flank steak cuts work best for these packets. They're tender, easy to cut, and soak up marinade well. If you don't want to spend a lot of money, pick a cheaper cut like tri-tips, bottom sirloin, or top blade. Place half of the steak strips in the center of each foil sheet. Grouping the meat as close to the center of the foil will make it easier to close up the packs. Keep the amounts on each sheet even so one pack isn’t much larger than the other. If you used more than 2 sheets of foil, divide up your steak accordingly. Wash your hands with soap and warm water after handling the raw meat so you don’t spread bacteria. Season the steak with the olive oil, salt, and pepper. Drizzle 2 tablespoons (30 ml) of olive oil over both piles of meat, then sprinkle salt and pepper on top. Add as much seasoning as you’d like. Feel free to add other spices and herbs, like dried rosemary, garlic salt, or curry powder, for extra flavor. You can also chop up veggies or potatoes to cook with the steak in the packs. Substitute any type of oil for the olive oil if you prefer a different taste. Seal the aluminum foil around the steak, forming a pack. Gather the edges of the foil sheet and squeeze them together in the center, wrapping up the steak. Try to avoid leaving any gaps where moisture could escape. The tighter you seal the packs, the juicier the meat will be. If you rip the foil, transfer the steak to a new sheet and wrap it again. Place the packs in the oven to cook for 30 minutes. Set the packs directly on the oven rack, making sure the side with the sealed edges is facing up. The best spot is the center rack, which is where the hot air circulates best and cooks your meat more evenly. To avoid a mess, you can place the packs on a baking sheet to catch any juice that may leak out of the foil. Use your phone’s clock app or a kitchen timer so you don’t forget to take the packs out after 30 minutes. Remove the packs from the oven and let them rest for 5 minutes. When steak cooks, the moisture spreads to the outside of the meat. Letting it rest before you eat it allows the steak to soak back up the juices so it’s not dry. Store any leftover steak in an airtight container in the refrigerator for no more than 4 days. How to Use Leftover Steak\nCut the steak into strips for fajitas or tacos. Slice it thinly to use on sandwiches, like a Philly cheesesteak. Toss strips of steak with green salad for a filling lunch. Dice it up to add to soups or stews. Serve steak with eggs for a hearty breakfast.",
  "sentences":[
    " Making Steak with a Broiler Let the steak sit at room temperature for 30 to 60 minutes.",
    "This will help the steak cook more evenly and prevents the meat from seizing, which makes it tougher.",
    "Place the steak on the kitchen counter, for instance, to let it warm up before you bake it.",
    "This is especially important for thicker cuts of meat, so the center doesn’t end up undercooked while the edges are overcooked.",
    "Don’t let the steak sit out for more than 2 hours or it will go bad.",
    "How to Choose a Steak\nIf you're on a budget, pick a cheaper cut, like tri-tips, top blade, or bottom sirloin.",
    "If you're looking for the most flavor, opt for a steak that's on the bone.",
    "Bone-in meat tends to be more flavorful and juicy.",
    "For that perfect steakhouse taste, choose a strip, rib eye, porterhouse or T-bone steak.",
    "These are the most popular among chefs.",
    "For the best quality, buy your meat from a butcher or the butcher's section of the grocery store.",
    "Avoid pre-packaged or frozen steak.",
    "Preheat the oven broiler.",
    "The broiler in your oven is a way of cooking food by exposing it to very high heat.",
    "Unlike the traditional bake setting, which requires a specific temperature, broilers only have 2 options: on or off.",
    "Turn yours on and let it preheat while you prepare the steak.",
    "An oven will heat much faster on the broil setting.",
    "It typically only takes about 5 to 10 minutes.",
    "In most ovens, the broiler is in the main compartment.",
    "However, in older gas ovens, there may be a separate broiler drawer.",
    "Check the oven manual if you aren’t sure where yours is or how to use it.",
    "Place your empty skillet inside the oven while it preheats.",
    "Warming up your pan ahead of time ensures a better sear on your steak.",
    "Make sure you choose an oven-safe skillet, like a cast iron, aluminum, or stainless steel one.",
    "If you aren’t sure if your pan can go in the oven, check the bottom to see if it says “oven-safe” or “safe for oven use.”\nYou can also preheat your pan on the stove.",
    "Set the skillet on a burner and turn it to high heat for 5 minutes.",
    "Blot the steak with paper towels to remove excess moisture.",
    "Lightly dab the meat to dry it and soak up any water.",
    "Be careful not to press too hard, or you’ll absorb some of the steak juices, too.",
    "You can use a cloth towel instead of paper towels if you’d like.",
    "Wash it immediately after using it on the meat to kill any bacteria.",
    "Brush 2 US tbsp (30 ml) of oil onto the steak, then rub in salt and pepper.",
    "Use a pastry brush to coat both sides of the steak.",
    "Then sprinkle on the salt and pepper and rub it into the meat with your hands, pressing firmly so the seasoning can penetrate the steak.",
    "Add as much or as little seasoning as you want.",
    "Get creative with your rub!",
    "Mix in garlic powder, paprika, thyme, or seasoned salt, for example.",
    "You can use any type of oil, like olive or vegetable oil, depending on your preferences or what you have in the pantry.",
    "Always wash your hands with soap and warm water after touching raw meat.",
    "Steak Rub Options\nFor a citrus flavor, combine grated lemon peel, rosemary, and salt.",
    "If you're craving Mexican food, try dried ancho pepper, chili powder, cilantro, and a touch of lime.",
    "If you like the combo of sweet and salty, add brown sugar to salt and black pepper.",
    "For Montreal steak seasoning, rub in garlic powder, onion powder, paprika, salt, coriander, dill, and red pepper flakes.",
    "Set the skillet on the stove over high heat.",
    "Carefully remove the pan from the oven and transfer it to a burner.",
    "Be sure to use an oven mitt or hot pad since the pan will be very hot.",
    "Turn the stove to a high heat setting.",
    "On stoves that use numbers on the dials, high heat is considered 6 to 9 on one that goes from 1 to 9.",
    "Sear the steak in the skillet for 30 seconds on each side.",
    "You should hear the steak sizzle when you place it in the pan.",
    "Gently press down on the meat with a spatula to ensure the entire bottom surface is touching the pan and being cooked.",
    "If there’s a lot of steam or smoke, turn on the exhaust fan above the stove.",
    "The center of the pan will be the hottest spot and is ideal for searing.",
    "Place the pan in the oven to broil the steak for 2 minutes.",
    "Avoid the urge to open the oven door to check on the steak during the 2 minutes.",
    "This lets heat escape and affects how the meat is cooked.",
    "Set a kitchen timer or use the clock app on your phone to keep track of the time.",
    "Thinner cuts of steak may require less time, while thicker cuts may need longer than 2 minutes.",
    "Flip the steak over and let it broil for another 2 minutes.",
    "Use tongs to turn the steak onto the other side so it cooks evenly.",
    "Your steak will now be a medium-rare temperature.",
    "If you want a medium steak, add 2 minutes so it cooks for a total of 4 minutes on the 2nd side.",
    "Use a meat thermometer to check the temperature if you can’t tell by the color of the steak or if you don’t want to rely on the timing alone.",
    "Different Temperatures for Steak\nRare: 125 °F (52 °C)\nMedium-rare: 135 °F (57 °C)\nMedium: 145 °F (63 °C)\nMedium-well: 150 °F (66 °C)\nWell done: 160 °F (71 °C) Remove the pan from the oven and let the steak rest for 5 minutes.",
    "Allowing meat to rest before you eat it lets it re-absorb any moisture and juices that may have escaped while cooking.",
    "If you cut into the steak immediately after taking it out of the oven, the juices will run out and you’ll end up with a dry piece of meat.",
    "You can leave the steak in the pan to rest or move it to a clean cutting board or dish.",
    "Store leftover steak in the fridge in an airtight container for up to 4 days.",
    "Cooking Steak in Foil Packs Preheat the oven to 400 °F (204 °C).",
    "This typically takes about 20 to 30 minutes.",
    "Turn the oven on while you make the foil packs so it’s at the right temperature when you’re ready to place the steak inside.",
    "To preheat the oven faster, turn on the broiler first.",
    "Then switch it to the bake setting before you use it.",
    "Lay out two 12 by 12 in (30 by 30 cm) sheets of aluminum foil.",
    "Tear off your sheets and place them side by side on a flat surface.",
    "Smooth out any wrinkles with the palm of your hand so they’re completely flat.",
    "If you want to divide the steak into more than 2 servings, use smaller pieces of aluminum foil.",
    "For example, rip off 4 6 by 6 in (15 by 15 cm) sheets.",
    "For extra protection, you can place the aluminum foil on a cutting board.",
    "If any stray pieces of steak or juice comes off the foil, it won’t contaminate the counter.",
    "Cut the steak into even strips that are at least 2 in (5.1 cm) thick.",
    "This will give you steak that’s cooked medium-well.",
    "If you cut strips that are thinner than 2 inches (5.1 cm), the steak will likely be dry and overcooked.",
    "Use a sharp knife to slice the 1 lb (0.45 kg) top sirloin steak on a cutting board, making sure the strips are all approximately the same thickness.",
    "The thicker the strips are, the more rare your steak will be.",
    "Don't cut pieces thicker than 4 inches (10 cm).",
    "Otherwise, your steak will be undercooked.",
    "Skirt, hanger, or flank steak cuts work best for these packets.",
    "They're tender, easy to cut, and soak up marinade well.",
    "If you don't want to spend a lot of money, pick a cheaper cut like tri-tips, bottom sirloin, or top blade.",
    "Place half of the steak strips in the center of each foil sheet.",
    "Grouping the meat as close to the center of the foil will make it easier to close up the packs.",
    "Keep the amounts on each sheet even so one pack isn’t much larger than the other.",
    "If you used more than 2 sheets of foil, divide up your steak accordingly.",
    "Wash your hands with soap and warm water after handling the raw meat so you don’t spread bacteria.",
    "Season the steak with the olive oil, salt, and pepper.",
    "Drizzle 2 tablespoons (30 ml) of olive oil over both piles of meat, then sprinkle salt and pepper on top.",
    "Add as much seasoning as you’d like.",
    "Feel free to add other spices and herbs, like dried rosemary, garlic salt, or curry powder, for extra flavor.",
    "You can also chop up veggies or potatoes to cook with the steak in the packs.",
    "Substitute any type of oil for the olive oil if you prefer a different taste.",
    "Seal the aluminum foil around the steak, forming a pack.",
    "Gather the edges of the foil sheet and squeeze them together in the center, wrapping up the steak.",
    "Try to avoid leaving any gaps where moisture could escape.",
    "The tighter you seal the packs, the juicier the meat will be.",
    "If you rip the foil, transfer the steak to a new sheet and wrap it again.",
    "Place the packs in the oven to cook for 30 minutes.",
    "Set the packs directly on the oven rack, making sure the side with the sealed edges is facing up.",
    "The best spot is the center rack, which is where the hot air circulates best and cooks your meat more evenly.",
    "To avoid a mess, you can place the packs on a baking sheet to catch any juice that may leak out of the foil.",
    "Use your phone’s clock app or a kitchen timer so you don’t forget to take the packs out after 30 minutes.",
    "Remove the packs from the oven and let them rest for 5 minutes.",
    "When steak cooks, the moisture spreads to the outside of the meat.",
    "Letting it rest before you eat it allows the steak to soak back up the juices so it’s not dry.",
    "Store any leftover steak in an airtight container in the refrigerator for no more than 4 days.",
    "How to Use Leftover Steak\nCut the steak into strips for fajitas or tacos.",
    "Slice it thinly to use on sandwiches, like a Philly cheesesteak.",
    "Toss strips of steak with green salad for a filling lunch.",
    "Dice it up to add to soups or stews.",
    "Serve steak with eggs for a hearty breakfast."
  ],
  "tyn_section":[
    "Broiled Steak",
    "Oven-safe skillet",
    "Pastry brush",
    "Oven mitt or hot pad",
    "Spatula",
    "Tongs",
    "Paper towels",
    "Meat thermometer (optional)",
    "Airtight container (optional)",
    "Steak Foil Packs",
    "Aluminum foil",
    "Cutting board",
    "Knife",
    "Baking sheet (optional)"
  ],
  "tyn_model":[
    "oven",
    "foil",
    "broiler",
    "skillet",
    "salt",
    "stove",
    "aluminum foil",
    "olive oil",
    "steak",
    "paper towels",
    "oil",
    "salt and pepper",
    "paprika",
    "water",
    "pan",
    "kitchen timer",
    "airtight container",
    "pepper",
    "rib eye",
    "oven broiler",
    "broilers",
    "broil",
    "oven manual",
    "“oven",
    "” or",
    "“safe",
    "”\n",
    "pastry brush",
    "garlic",
    "thyme",
    "seasoned salt",
    "olive or vegetable oil",
    "rosemary",
    "ancho pepper",
    "chili powder",
    "cilantro",
    "lime",
    "brown sugar",
    "black pepper",
    "garlic powder",
    "onion powder",
    "coriander",
    "dill",
    "red pepper",
    "oven mitt",
    "spatula",
    "meat thermometer",
    "foil packs",
    "sharp knife",
    "sirloin steak",
    "cutting board",
    "tri-tips",
    "garlic salt",
    "curry powder",
    "baking sheet",
    "refrigerator",
    "green salad",
    "eggs"
  ],
  "simple_metrics":{
    "r":0.3571428571,
    "p":0.0862068966,
    "f1":0.1388888889,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.224137931,
    "f1":0.3553530752
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9285714286,
    "p":0.2586206897,
    "f1":0.4045643154
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6428571429,
    "p":0.1551724138,
    "f1":0.25
  }
}