{
  "title":"How to Chug a Beer",
  "url":"https://www.wikihow.com/Chug-a-Beer",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Beer and Cider"
  ],
  "methods":[
    {
      "name":"Drinking from a Glass",
      "steps":[
        {
          "headline":"Pour the beer into a glass and wait for the foam to dissipate.",
          "description":"Chugging a bubbly, foamy beer can cause stomach pain, gas, and nausea, so wait for the bubbles to go away before you start. Waiting also gives the beer a chance to warm up a bit, which can help prevent brain freeze after you chug! The shape of the glass can affect how well you’re able to chug your beer. A beer mug is much easier to chug than a snifter.Tip: Choose a lighter beer to chug. You won’t taste the beer much anyway, but a light beer will settle in your stomach better than a full-bodied Guinness or a bitter stout."
        },
        {
          "headline":"Hit the bottom of the glass on a table to release CO2.",
          "description":"The carbonation in your beer is caused by carbon dioxide (CO2). All that extra gas pumped into your stomach can cause discomfort and possibly nausea. An easy way to release some of that CO2 into the air rather than your stomach is to knock the bottom of the glass on a table or solid structure before you chug it. Don’t slam your glass on the table, just knock it to shake some of the bubbles loose."
        },
        {
          "headline":"Take a deep breath, and lean your head back slightly.",
          "description":"Before you actually start to chug your beer, take a big breath to prepare yourself for what lies ahead. Moving your head into position ahead of time will streamline the process and make it easy to dump the contents of your glass right into your belly. Make sure you’ve got a good grip on the glass as well."
        },
        {
          "headline":"Bring the glass to your lips and tilt it up quickly.",
          "description":"After you’ve taken a breath and steeled your resolve, move the glass to your mouth and place your lips around the edge of the glass. In one swift motion, turn the glass up to pour the contents into your mouth. Don’t sip or gulp the beer or the liquid may spill out of the edges of your mouth. Be careful not to knock the glass against your teeth and risk chipping a tooth."
        },
        {
          "headline":"Relax your throat and hold your breath.",
          "description":"As the contents of your glass enter your mouth, do not swallow. Instead, allow your throat to relax and the beer to flow directly into your stomach. Let gravity do the work for you. Be sure to hold your breath and don’t stop the flow of beer to take a breath as this will slow you down and possibly cause you to spill precious drops of beer. Imagine you are pouring a glass of water down an open drain."
        },
        {
          "headline":"Finish chugging the entire glass of beer.",
          "description":"You’ve made it this far, don’t stop now! Keep your throat relaxed as the beer flows out of the glass. Tilt the glass further and further up to finish draining it. When the beer is gone, resume breathing, and bask in the glory of your achievement. There’s still plenty of CO2 in the beer, so if you need to expel any of the gasses in your stomach, a solid belch should do the trick."
        }
      ]
    },
    {
      "name":"Chugging from a Can",
      "steps":[
        {
          "headline":"Use a knife to cut a small hole in the top of the can to create a vent.",
          "description":"Place the tip of the knife on the top of the can near the pull tab, holding it in an upright position. Make sure the hold the can and knife firmly to prevent the tip of the knife from slipping as you slowly apply light pressure to puncture the can. Make sure the hole doesn’t have any jagged edges that could potentially cut you when you chug your beer. You can use a knife, a key, or any other sharp object. The hole should be about the size of pencil tip, it doesn’t have to be a huge, gaping hole.Tip: Shotgunning is another method of chugging a beer from a can quickly and involves cutting a hole at the bottom of the can and tilting the can upright to use gravity to help the beer flow."
        },
        {
          "headline":"Cover the hole with the index finger of the hand that is holding the can.",
          "description":"Grab the can in your dominant hand, and position your finger over the hole until you are ready to chug. The hole you made is sometimes called a carburetor and acts like a vent to allow air to enter the can. The extra air helps the beer to flow out of the can quicker and easier. You could also hold the can in your non-dominant hand to leave your dominant hand free to fist-bump your friends during or after your chug."
        },
        {
          "headline":"Open the beer and begin to drink it normally.",
          "description":"With the carburetor still covered with your finger, open up the beer. Bring it to your mouth and drink it as you normally would. Starting the flow of liquid before you open up the vent will cause the beer to flow faster and make it easier to chug."
        },
        {
          "headline":"Take a breath and uncover the carburetor as you tilt back your head.",
          "description":"When you’re ready to chug your beer, take a deep breath to prepare yourself and so you don't need to take a breath later. Remove your finger that has been covering the vent and tilt the can as the beer flows out of the can. Keep tilting the can higher and higher as the beer empties to keep the flow smooth and even for easier chugging."
        },
        {
          "headline":"Relax your throat and allow the beer to flow freely until the can is empty.",
          "description":"As you’re chugging the beer, do not take large gulps in an attempt to empty the contents of the can. Instead, relax your throat the allow the beer to simply fall down your esophagus directly into your stomach. Hold your breath as you chug the beer. Consider crushing the can in your hand and throwing it on the ground after you chug your beer to impress all of your friends with your victory. Please don’t litter and pick up your can afterwards."
        }
      ]
    },
    {
      "name":"Using a Straw in a Bottle",
      "steps":[
        {
          "headline":"Open the bottle and allow it to sit to release CO2 and warm up a little.",
          "description":"Chugging ice cold beer can give you brain freeze and potentially hurt your stomach. Additionally, dumping that much carbonation into your stomach can cause discomfort and nausea, and make the beer more difficult to chug. Letting the open bottle sit for a few moments can release some of the carbon dioxide into the air instead of your belly, and warm up the beer a little bit. You only need to wait a few moments, you don’t have to wait for the beer to reach room temperature. Don’t knock the bottom of the bottle against a table to release extra CO2 because it could cause the beer to foam up and spill out of the bottle."
        },
        {
          "headline":"Insert a flexible straw into the bottle and bend it.",
          "description":"The straw will act as a vent or a carburetor to allow the beer to flow out of the bottle faster. The faster the beer flows, the quicker and easier it is for you to chug. Make sure the bent end of the straw is sticking out of the top of the bottle. Don’t drop the straw into the bottle! It can be really difficult to get out without spilling beer."
        },
        {
          "headline":"Hold the straw in place with the opening pointing away from your face.",
          "description":"Use a finger to hold the bent straw in place with the tip of the straw facing away from you. That way it won’t get in the way when you go to chug it. Rest the bend of the straw on the lip of the bottle."
        },
        {
          "headline":"Bring the bottle to your lips and take a deep breath.",
          "description":"Get into position to chug the beer by pressing the opening of the bottle against your lips. Visualize success and take a deep breath to prepare yourself. The deep breath will also save you from having to take a breath later on while you’re chugging your beer."
        },
        {
          "headline":"Lean your head back and tilt the bottle upright.",
          "description":"After you’ve taken your breath, sharply tilt the bottle up and lean your head back. This will start the flow of beer. Keep the straw held in place with your finger to let it work it’s venting magic.Warning: Be careful not to jam the end of the bottle into your mouth when you tilt it up or you could chip a tooth!"
        },
        {
          "headline":"Allow the beer to flow down your throat until the bottle is empty.",
          "description":"The beer will flow so fast that it will hit the back of your throat as soon as you tilt the bottle up. Keep your throat open and relaxed to let the beer slide right past it on its way to your stomach. The vent created by the straw will force air into the bottle which will propel the liquid to its final destination in your stomach."
        }
      ]
    }
  ],
  "text":" Drinking from a Glass Pour the beer into a glass and wait for the foam to dissipate. Chugging a bubbly, foamy beer can cause stomach pain, gas, and nausea, so wait for the bubbles to go away before you start. Waiting also gives the beer a chance to warm up a bit, which can help prevent brain freeze after you chug! The shape of the glass can affect how well you’re able to chug your beer. A beer mug is much easier to chug than a snifter.Tip: Choose a lighter beer to chug. You won’t taste the beer much anyway, but a light beer will settle in your stomach better than a full-bodied Guinness or a bitter stout. Hit the bottom of the glass on a table to release CO2. The carbonation in your beer is caused by carbon dioxide (CO2). All that extra gas pumped into your stomach can cause discomfort and possibly nausea. An easy way to release some of that CO2 into the air rather than your stomach is to knock the bottom of the glass on a table or solid structure before you chug it. Don’t slam your glass on the table, just knock it to shake some of the bubbles loose. Take a deep breath, and lean your head back slightly. Before you actually start to chug your beer, take a big breath to prepare yourself for what lies ahead. Moving your head into position ahead of time will streamline the process and make it easy to dump the contents of your glass right into your belly. Make sure you’ve got a good grip on the glass as well. Bring the glass to your lips and tilt it up quickly. After you’ve taken a breath and steeled your resolve, move the glass to your mouth and place your lips around the edge of the glass. In one swift motion, turn the glass up to pour the contents into your mouth. Don’t sip or gulp the beer or the liquid may spill out of the edges of your mouth. Be careful not to knock the glass against your teeth and risk chipping a tooth. Relax your throat and hold your breath. As the contents of your glass enter your mouth, do not swallow. Instead, allow your throat to relax and the beer to flow directly into your stomach. Let gravity do the work for you. Be sure to hold your breath and don’t stop the flow of beer to take a breath as this will slow you down and possibly cause you to spill precious drops of beer. Imagine you are pouring a glass of water down an open drain. Finish chugging the entire glass of beer. You’ve made it this far, don’t stop now! Keep your throat relaxed as the beer flows out of the glass. Tilt the glass further and further up to finish draining it. When the beer is gone, resume breathing, and bask in the glory of your achievement. There’s still plenty of CO2 in the beer, so if you need to expel any of the gasses in your stomach, a solid belch should do the trick. Chugging from a Can Use a knife to cut a small hole in the top of the can to create a vent. Place the tip of the knife on the top of the can near the pull tab, holding it in an upright position. Make sure the hold the can and knife firmly to prevent the tip of the knife from slipping as you slowly apply light pressure to puncture the can. Make sure the hole doesn’t have any jagged edges that could potentially cut you when you chug your beer. You can use a knife, a key, or any other sharp object. The hole should be about the size of pencil tip, it doesn’t have to be a huge, gaping hole.Tip: Shotgunning is another method of chugging a beer from a can quickly and involves cutting a hole at the bottom of the can and tilting the can upright to use gravity to help the beer flow. Cover the hole with the index finger of the hand that is holding the can. Grab the can in your dominant hand, and position your finger over the hole until you are ready to chug. The hole you made is sometimes called a carburetor and acts like a vent to allow air to enter the can. The extra air helps the beer to flow out of the can quicker and easier. You could also hold the can in your non-dominant hand to leave your dominant hand free to fist-bump your friends during or after your chug. Open the beer and begin to drink it normally. With the carburetor still covered with your finger, open up the beer. Bring it to your mouth and drink it as you normally would. Starting the flow of liquid before you open up the vent will cause the beer to flow faster and make it easier to chug. Take a breath and uncover the carburetor as you tilt back your head. When you’re ready to chug your beer, take a deep breath to prepare yourself and so you don't need to take a breath later. Remove your finger that has been covering the vent and tilt the can as the beer flows out of the can. Keep tilting the can higher and higher as the beer empties to keep the flow smooth and even for easier chugging. Relax your throat and allow the beer to flow freely until the can is empty. As you’re chugging the beer, do not take large gulps in an attempt to empty the contents of the can. Instead, relax your throat the allow the beer to simply fall down your esophagus directly into your stomach. Hold your breath as you chug the beer. Consider crushing the can in your hand and throwing it on the ground after you chug your beer to impress all of your friends with your victory. Please don’t litter and pick up your can afterwards. Using a Straw in a Bottle Open the bottle and allow it to sit to release CO2 and warm up a little. Chugging ice cold beer can give you brain freeze and potentially hurt your stomach. Additionally, dumping that much carbonation into your stomach can cause discomfort and nausea, and make the beer more difficult to chug. Letting the open bottle sit for a few moments can release some of the carbon dioxide into the air instead of your belly, and warm up the beer a little bit. You only need to wait a few moments, you don’t have to wait for the beer to reach room temperature. Don’t knock the bottom of the bottle against a table to release extra CO2 because it could cause the beer to foam up and spill out of the bottle. Insert a flexible straw into the bottle and bend it. The straw will act as a vent or a carburetor to allow the beer to flow out of the bottle faster. The faster the beer flows, the quicker and easier it is for you to chug. Make sure the bent end of the straw is sticking out of the top of the bottle. Don’t drop the straw into the bottle! It can be really difficult to get out without spilling beer. Hold the straw in place with the opening pointing away from your face. Use a finger to hold the bent straw in place with the tip of the straw facing away from you. That way it won’t get in the way when you go to chug it. Rest the bend of the straw on the lip of the bottle. Bring the bottle to your lips and take a deep breath. Get into position to chug the beer by pressing the opening of the bottle against your lips. Visualize success and take a deep breath to prepare yourself. The deep breath will also save you from having to take a breath later on while you’re chugging your beer. Lean your head back and tilt the bottle upright. After you’ve taken your breath, sharply tilt the bottle up and lean your head back. This will start the flow of beer. Keep the straw held in place with your finger to let it work it’s venting magic.Warning: Be careful not to jam the end of the bottle into your mouth when you tilt it up or you could chip a tooth! Allow the beer to flow down your throat until the bottle is empty. The beer will flow so fast that it will hit the back of your throat as soon as you tilt the bottle up. Keep your throat open and relaxed to let the beer slide right past it on its way to your stomach. The vent created by the straw will force air into the bottle which will propel the liquid to its final destination in your stomach.",
  "sentences":[
    " Drinking from a Glass Pour the beer into a glass and wait for the foam to dissipate.",
    "Chugging a bubbly, foamy beer can cause stomach pain, gas, and nausea, so wait for the bubbles to go away before you start.",
    "Waiting also gives the beer a chance to warm up a bit, which can help prevent brain freeze after you chug!",
    "The shape of the glass can affect how well you’re able to chug your beer.",
    "A beer mug is much easier to chug than a snifter.Tip: Choose a lighter beer to chug.",
    "You won’t taste the beer much anyway, but a light beer will settle in your stomach better than a full-bodied Guinness or a bitter stout.",
    "Hit the bottom of the glass on a table to release CO2.",
    "The carbonation in your beer is caused by carbon dioxide (CO2).",
    "All that extra gas pumped into your stomach can cause discomfort and possibly nausea.",
    "An easy way to release some of that CO2 into the air rather than your stomach is to knock the bottom of the glass on a table or solid structure before you chug it.",
    "Don’t slam your glass on the table, just knock it to shake some of the bubbles loose.",
    "Take a deep breath, and lean your head back slightly.",
    "Before you actually start to chug your beer, take a big breath to prepare yourself for what lies ahead.",
    "Moving your head into position ahead of time will streamline the process and make it easy to dump the contents of your glass right into your belly.",
    "Make sure you’ve got a good grip on the glass as well.",
    "Bring the glass to your lips and tilt it up quickly.",
    "After you’ve taken a breath and steeled your resolve, move the glass to your mouth and place your lips around the edge of the glass.",
    "In one swift motion, turn the glass up to pour the contents into your mouth.",
    "Don’t sip or gulp the beer or the liquid may spill out of the edges of your mouth.",
    "Be careful not to knock the glass against your teeth and risk chipping a tooth.",
    "Relax your throat and hold your breath.",
    "As the contents of your glass enter your mouth, do not swallow.",
    "Instead, allow your throat to relax and the beer to flow directly into your stomach.",
    "Let gravity do the work for you.",
    "Be sure to hold your breath and don’t stop the flow of beer to take a breath as this will slow you down and possibly cause you to spill precious drops of beer.",
    "Imagine you are pouring a glass of water down an open drain.",
    "Finish chugging the entire glass of beer.",
    "You’ve made it this far, don’t stop now!",
    "Keep your throat relaxed as the beer flows out of the glass.",
    "Tilt the glass further and further up to finish draining it.",
    "When the beer is gone, resume breathing, and bask in the glory of your achievement.",
    "There’s still plenty of CO2 in the beer, so if you need to expel any of the gasses in your stomach, a solid belch should do the trick.",
    "Chugging from a Can Use a knife to cut a small hole in the top of the can to create a vent.",
    "Place the tip of the knife on the top of the can near the pull tab, holding it in an upright position.",
    "Make sure the hold the can and knife firmly to prevent the tip of the knife from slipping as you slowly apply light pressure to puncture the can.",
    "Make sure the hole doesn’t have any jagged edges that could potentially cut you when you chug your beer.",
    "You can use a knife, a key, or any other sharp object.",
    "The hole should be about the size of pencil tip, it doesn’t have to be a huge, gaping hole.Tip: Shotgunning is another method of chugging a beer from a can quickly and involves cutting a hole at the bottom of the can and tilting the can upright to use gravity to help the beer flow.",
    "Cover the hole with the index finger of the hand that is holding the can.",
    "Grab the can in your dominant hand, and position your finger over the hole until you are ready to chug.",
    "The hole you made is sometimes called a carburetor and acts like a vent to allow air to enter the can.",
    "The extra air helps the beer to flow out of the can quicker and easier.",
    "You could also hold the can in your non-dominant hand to leave your dominant hand free to fist-bump your friends during or after your chug.",
    "Open the beer and begin to drink it normally.",
    "With the carburetor still covered with your finger, open up the beer.",
    "Bring it to your mouth and drink it as you normally would.",
    "Starting the flow of liquid before you open up the vent will cause the beer to flow faster and make it easier to chug.",
    "Take a breath and uncover the carburetor as you tilt back your head.",
    "When you’re ready to chug your beer, take a deep breath to prepare yourself and so you don't need to take a breath later.",
    "Remove your finger that has been covering the vent and tilt the can as the beer flows out of the can.",
    "Keep tilting the can higher and higher as the beer empties to keep the flow smooth and even for easier chugging.",
    "Relax your throat and allow the beer to flow freely until the can is empty.",
    "As you’re chugging the beer, do not take large gulps in an attempt to empty the contents of the can.",
    "Instead, relax your throat the allow the beer to simply fall down your esophagus directly into your stomach.",
    "Hold your breath as you chug the beer.",
    "Consider crushing the can in your hand and throwing it on the ground after you chug your beer to impress all of your friends with your victory.",
    "Please don’t litter and pick up your can afterwards.",
    "Using a Straw in a Bottle Open the bottle and allow it to sit to release CO2 and warm up a little.",
    "Chugging ice cold beer can give you brain freeze and potentially hurt your stomach.",
    "Additionally, dumping that much carbonation into your stomach can cause discomfort and nausea, and make the beer more difficult to chug.",
    "Letting the open bottle sit for a few moments can release some of the carbon dioxide into the air instead of your belly, and warm up the beer a little bit.",
    "You only need to wait a few moments, you don’t have to wait for the beer to reach room temperature.",
    "Don’t knock the bottom of the bottle against a table to release extra CO2 because it could cause the beer to foam up and spill out of the bottle.",
    "Insert a flexible straw into the bottle and bend it.",
    "The straw will act as a vent or a carburetor to allow the beer to flow out of the bottle faster.",
    "The faster the beer flows, the quicker and easier it is for you to chug.",
    "Make sure the bent end of the straw is sticking out of the top of the bottle.",
    "Don’t drop the straw into the bottle!",
    "It can be really difficult to get out without spilling beer.",
    "Hold the straw in place with the opening pointing away from your face.",
    "Use a finger to hold the bent straw in place with the tip of the straw facing away from you.",
    "That way it won’t get in the way when you go to chug it.",
    "Rest the bend of the straw on the lip of the bottle.",
    "Bring the bottle to your lips and take a deep breath.",
    "Get into position to chug the beer by pressing the opening of the bottle against your lips.",
    "Visualize success and take a deep breath to prepare yourself.",
    "The deep breath will also save you from having to take a breath later on while you’re chugging your beer.",
    "Lean your head back and tilt the bottle upright.",
    "After you’ve taken your breath, sharply tilt the bottle up and lean your head back.",
    "This will start the flow of beer.",
    "Keep the straw held in place with your finger to let it work it’s venting magic.Warning: Be careful not to jam the end of the bottle into your mouth when you tilt it up or you could chip a tooth!",
    "Allow the beer to flow down your throat until the bottle is empty.",
    "The beer will flow so fast that it will hit the back of your throat as soon as you tilt the bottle up.",
    "Keep your throat open and relaxed to let the beer slide right past it on its way to your stomach.",
    "The vent created by the straw will force air into the bottle which will propel the liquid to its final destination in your stomach."
  ],
  "tyn_section":[
    "Beer",
    "A glass",
    "Knife (for a can)",
    "Straw (for a bottle)",
    "Chutzpah (for glory)"
  ],
  "tyn_model":[
    "beer",
    "glass",
    "straw",
    "bottle",
    "knife",
    "beer mug",
    "snifter",
    "water",
    "can",
    "carburetor"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.1,
    "f1":0.1333333333,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.3,
    "f1":0.3428571429
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.3,
    "f1":0.3428571429
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.1,
    "f1":0.1333333333
  }
}