{
  "title":"How to Make a Crystal Radio",
  "url":"https://www.wikihow.com/Make-a-Crystal-Radio",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "parts":[
    {
      "name":"Making the Capacitor",
      "steps":[
        {
          "headline":"Gather your materials:",
          "description":"Empty, clean paper towel roll Two 6-inch-by-6-inch pieces of aluminum foil One piece of 7-inch-by-7-inch white paper (printer paper will do) Two 1-foot-long pieces of wire Masking (or some other non-conductive) tape X-ACTO blade or wire strippers Scissors"
        },
        {
          "headline":"Cut two 6-inch-by-6-inch pieces of aluminum foil.",
          "description":"Use a felt pen and ruler to draw the 6-by-6 squares on the foil before cutting them out."
        },
        {
          "headline":"Fasten one foil square around an empty paper towel tube.",
          "description":"Start about a half an inch up from the bottom of the tube. Wrap the foil around the tube and fasten it with masking tape. If you don’t have masking tape, you can use any other type of tape as long as it isn’t electrically conductive. Electrical tape is another safe bet."
        },
        {
          "headline":"Fasten the other foil square to to a piece of white paper.",
          "description":"The paper should measure 7 inches by 7 inches, and the foil square should sit right in the center or it, so that it looks like a silver square inside of a white one. Use masking tape to fasten the foil square to the white paper. Tape all around the foil square to ensure it sits smoothly against the paper."
        },
        {
          "headline":"Fasten the paper-foil square around the paper towel roll.",
          "description":"Wrap the square around the roll with the aluminum side facing out, and tape it to create a tube. The paper-foil square should form a tube that’s slightly larger than the paper towel roll. The fit should be snug, but not so snug that you can’t easily move the paper towel roll in and out of the paper-foil tube. Be sure to have the aluminum foil facing out, so that the paper touches the roll. You want to insulate the two foil squares from each other, so make sure they don’t touch."
        },
        {
          "headline":"Strip the last inch of insulation from both foot-long wire pieces.",
          "description":"You can use an X-ACTO blade to gently cut around and strip the insulation from the wire. Be sure that you don’t damage the bare wire. If you have them, you can also use wire strippers to strip the insulation from the wire."
        },
        {
          "headline":"Bend the bare wire ends at 90-degree angles.",
          "description":"Take the bare ends of both pieces of wire and bend them at 90-degree angles. This should be easy to do with just your fingers."
        },
        {
          "headline":"Attach one wire to the paper-foil tube.",
          "description":"Tape one of the bare wire ends to the top corner of the free-moving free-moving aluminum foil/paper tube (the one that you’ve placed over the paper towel tube). Use a few pieces of tape to ensure that the wire is well-attached to the foil. It must touch the foil, as that is what will conduct electricity."
        },
        {
          "headline":"Attach the other piece of wire to the foil on the paper towel tube.",
          "description":"Tape the bare end of the other one-foot length of wire to the top corner of the foil square that’s on the paper towel tube. The wires should sit across from one another, so that you could draw a line between them, along the length of the tube."
        },
        {
          "headline":"Move on to your coils.",
          "description":"Now that your capacitor is complete, you can move on to making your coils."
        }
      ]
    },
    {
      "name":"Making the Coils",
      "steps":[
        {
          "headline":"Gather your materials:",
          "description":"One toilet paper roll Insulated Wire (most will do, 26-gauge enamelled magnet wire recommended) Masking (or other non-conductive) tape Sandpaper"
        },
        {
          "headline":"Ensure that the toilet paper roll is free of debris.",
          "description":"Make sure it has no glue or left-over bits of toilet paper stuck to it before you begin."
        },
        {
          "headline":"Place two pieces of masking tape along the length of the toilet paper roll.",
          "description":"Place one piece of tape along the length of the toilet paper roll, and then cover that piece of tape with another piece of tape. The second piece of tape should exactly cover the first one. Let a piece of the second piece of tape hang over the end of the roll, as you’ll need to lift this back up as you add wire to your coils."
        },
        {
          "headline":"Be sure to leave a foot of wire at each end of both coils.",
          "description":"Leave a foot-long piece of wire sticking out from each end of each coil. These should be at both the top and bottom of each coil. These pieces are what you will use to connect the coil to other wires. You’ll have 4 one-foot-long pieces of wire sticking out in total: one at the top and bottom of each of the two coils."
        },
        {
          "headline":"Start your primary, 25-turn coil.",
          "description":"Peel back the second layer of masking tape and place a piece of wire beneath it, then close the tape over it to anchor the wire there. Wind the wire around the toilet paper roll 25 times, being sure to make tight, close winds. Don't forget to leave a foot-long piece of wire at both the start and finish of your coil. 25 turns will work out to roughly 13 feet (4 m) of enamelled wire. Enamelled wires are ideal for the coils because their coating is easier to remove once they’re coiled, and you will need to remove some of the coating in order for the tuning bar to work with the coil (we’ll come to this later)."
        },
        {
          "headline":"Finish the primary, 25-turn coil.",
          "description":"Lift up the second strip of tape, place the wire beneath it, and place tape back down to fasten the wire there. Be sure to leave a foot of wire free when you cut the end of the coil."
        },
        {
          "headline":"Start your secondary, 90-turn coil.",
          "description":"Lift up the tape and place another piece of wire beneath it, roughly 1/8th of an inch down from the end of the primary coil. Fasten the wire to the roll by closing the tape over it, and then wrap the wire 90 times around the roll. As with the primary, 25-turn coil, make sure that the wire is wrapped in tight, close turns. 90 turns will work out to roughly 42 feet (13 m) of enamelled wire."
        },
        {
          "headline":"Finish the secondary coil.",
          "description":"Lift up the second layer of tape and secure the final turn of wire beneath it. Clip the wire off, leaving a foot of wire free. Don’t forget to leave a foot of wire on each end of the coil for connecting to other wires."
        },
        {
          "headline":"Lightly sand the surface of the secondary (90-turn) coil.",
          "description":"You only need to sand a small amount of the surface — roughly a half inch to an inch at the top of the coil will do. Be very gentle and be careful not to sand between the wires. Sanding between the wires will cause them to short into each other, and will make your coil ineffective."
        },
        {
          "headline":"Bare the ends of the 4 pieces of wire sticking out from the coils.",
          "description":"Each coil will have a foot of wire hanging from its top and bottom. Remove the enamel/insulation from these ends so that you can connect them with other wires. If the wires are enamelled, you can sand them, scrape them, or dip them in nail polish remover to bare them."
        }
      ]
    },
    {
      "name":"Making a Holder",
      "steps":[
        {
          "headline":"Gather your materials (note that you can use scraps for the wood and metal pieces):",
          "description":"One piece of wood for the base (at least 8 inches wide by 12 inches long) Two pieces of wood to hold the capacitor (at least 6 inches long, and roughly 1.5 inches wide (needs to fit inside capacitor)) One small piece of wood to mount tuning bar on (around 1 inch thick by 2 inches long will do), the height should be the diameter of your finished coil Piece of metal for tuning bar (strip from paint can works) Pliers to help bend metal Screws to connect wooden pieces together Screwdriver Your homemade capacitor Your homemade double-coil toilet paper roll Masking (or other non-conductive) tape"
        },
        {
          "headline":"Screw together the capacitor holder.",
          "description":"Take the two pieces of wood that are roughly 1.5 inches wide by 6 or more inches long, and screw them together to form an L shape. These pieces of wood do not have to be the exact same length. Many people use scrap wood to construct the base, so if you have other sizes lying around, you are welcome to use those. Just make sure that the piece of wood on which you’ll mount the capacitor is small enough to fit inside the capacitor."
        },
        {
          "headline":"Attach the capacitor holder to the right side of the base.",
          "description":"Place the base down flat in front of you. Use screws to fasten the holder to the top right corner of the base, on the longer side (so if the base is 8 by 12 inches, do this on the corner edge of the 12-inch side). The bottom of the L should be lined up with, and perpendicular to, the right end of the base. The top of the L (the longer side of the L) should be parallel with the base. Once fastened, it should look like a rectangle with one invisible side, or like a horizontal toilet paper roll holder, which is essentially what it is."
        },
        {
          "headline":"Place the capacitor on the mount.",
          "description":"Ensure that the movable paper-foil tube side is facing outward so that you can easily adjust the size (volume) of the capacitor. Use a thumbtack to fasten the other (paper towel roll) side of the capacitor to the mount."
        },
        {
          "headline":"Attach the tuning bar mount to the base.",
          "description":"It should sit on the right side of the base, across from the capacitor mount, roughly 3 or 4 inches in from the right end of the base. Leave room (2.5 to 3 inches at least) between the tuning bar mount and the capacitor. You’ll be placing the toilet paper roll double-coil in this space. If the base’s bottom is quite thick, you can use strong glue to connect the tuning bar mount to the base instead of screws."
        },
        {
          "headline":"Make the tuning bar.",
          "description":"Cut a thin strip of metal and bend it lengthwise so that it makes a V shape. Keep the last half-inch or so of the tuning bar flat. This is the side that you’ll attach to the mount. The bottom point of the V is what you’ll place on the secondary coil in order to tune your radio."
        },
        {
          "headline":"Attach the tuning bar to the tuning bar mount.",
          "description":"Puncture the flat end of the tuning bar and use a screw to attach it to the end of the mount that’s closest to the capacitor mount. Be sure to firmly but gently screw the tuning bar in so that you can still move it around. Make sure it’s not too lose, as you'll be tuning the radio with it and need it to stay where you put it."
        },
        {
          "headline":"Fasten the coil to the base, in front of the tuning bar.",
          "description":"Exactly where you place the coil will depend on the length of the tuning bar. Place the coil at a distance from the tuning bar that allows the bar to sit on top of the coil. You need to be able to move the tuning bar back and forth over the secondary coil, much like a windshield wiper moves across a car window. You can use masking tape to fasten the coil to the base. Just place a strip on the inside of either side of the coil and connect it to the base."
        }
      ]
    },
    {
      "name":"Connecting it All",
      "steps":[
        {
          "headline":"Gather your materials:Long wire for antenna (15 to 20 feet at least, 50ft or longer in weaker areas)",
          "description":"Germanium diode (1N34, 1N34A or equivalent, can be purchased at electronics store) High impedance ear piece (piezo ear piece)/high impedance headphones (at least 2000 Ohms) (an earpiece from an antique telephone will do) Ground wire (any long wire will do) Ground connection (metal posts or pipes that go down to the ground — for example, under your sink, radiator) Wire for tuning bar (12 inches will be more than enough)"
        },
        {
          "headline":"Know how to connect wires.",
          "description":"To connect wires to each other, twist the bare (uninsulated) parts together tightly. If you have several wires to connect, do the same as you would with one wire, but with all of them. You can do them one at a time or take all the wires you need and twist them all together at once, whichever you find easiest. It is easier to twist smaller wires onto thicker wires than the other way round."
        },
        {
          "headline":"Connect a wire to a ground source to make your ground wire.",
          "description":"You’ll need to connect a bare part of your wire to a piece of clean, bare metal that goes down to the ground. Common sources of this include cold water pipes, faucets, and steel support beams. If you use pipes, go close to the wall to find ones that aren’t insulated or enamelled. You may have to scratch them up a bit to bare some metal and make the pipes more conductive."
        },
        {
          "headline":"Tape the ground wire in place on the left side of the base.",
          "description":"This will be connected to the adjustable side of the capacitor, as well as the wires coming from the right ends of the 25- and 90-turn coils. So keep that in mind while placing it on the base."
        },
        {
          "headline":"Attach a wire to the tuning bar.",
          "description":"Loosen the screw holding the tuning bar to its mount, wrap the bare end of a wire around the screw, and then gently retighten the screw. Make sure that the wire touches the tuning bar. Both ends of this wire need to be bare, as they will conduct energy from the tuning bar to the ground wire."
        },
        {
          "headline":"Connect the following capacitor and coil wires to the ground wire.",
          "description":"Twist them all together tightly. Wire on the adjustable paper-foil side of the capacitor (should be on the left side of the base)\nWire on the right (bottom) end of the primary, 25-turn coil\nWire on the right (bottom) end of the secondary, 90-turn coil\nWire attached to the tuning bar"
        },
        {
          "headline":"Tape the antenna wire in place on the left side of the base.",
          "description":"It will be connected to the top (left end) of the primary, 25-turn coil, so keep that in mind while placing the antenna on the base. The antenna can be any wire, insulated or bare, although insulated is recommended. Most important is that the antenna is as high and long as possible, and that it is not grounded (i.e. connected to any ground sources such as basement floors or pipes. If tying to a tree, metal post, etc, use a short piece of plastic rope)."
        },
        {
          "headline":"Attach the top, left end of the 25-turn coil to the antenna.",
          "description":"Twist the two wires together tightly."
        },
        {
          "headline":"Fasten the germanium diode to the right side of the base.",
          "description":"You can do this with masking tape. Ensure that the grey stripe on the diode is facing up and outwards, towards the edge of the base instead of the coils. Make sure the diode’s wires are sticking out from under the tape, as you’ll be connecting them to other wires. Place the diode in line with the right end of the capacitor (the paper towel side that can’t be extended), as this is the wire you’ll be attaching it to."
        },
        {
          "headline":"Attach the following wires to the top diode wire.",
          "description":"These wires will attach to the side of the diode that doesn’t have the grey line on it:\nWire on the right (unmovable) side of the capacitor\nWire from the top, left side of the secondary, 90-turn coil"
        },
        {
          "headline":"Attach earpiece to the ground and diode wires.",
          "description":"Attach one wire of the earpiece to the ground wire grouping, and the other end of the earpiece to the wire of the diode that remains free (i.e. the one that isn’t already attached to the 90-turn coil and the capacitor). You’ll be attaching the earpiece to the side of the diode that has the grey line closer to it."
        },
        {
          "headline":"Listen to the radio!",
          "description":"You will likely need to adjust the tuning wand and capacitor before you hear anything. Start with adjusting the wand, and then gently pull out the paper-foil side of the capacitor to increase the volume."
        }
      ]
    },
    {
      "name":"Troubleshooting",
      "steps":[
        {
          "headline":"Don’t over-sand your tuning coil.",
          "description":"If you over-sand your tuning coil it could cause each wire turn to become electrically connected, which will cause the coil to be ineffective. Remember to be careful when sanding the coils that you only lightly sand the surface, not between the coils."
        },
        {
          "headline":"Ensure that your tuning bar is not insulated.",
          "description":"Depending on what material you’re using, your tuning bar could have a coating on it that prevents it from being conductive. If you’re having trouble picking up anything when you test your radio, try sanding the bottom point of the tuning bar, where it would hit the coil, to make it more conductive. Also try sanding the part of the tuning bar that is under the screw."
        },
        {
          "headline":"Use a high impedance ear piece/speaker.",
          "description":"Low impedance speakers (4-8 Ohms), head phones (8 Ohms) and earbuds (32 Ohms) do not work with a crystal radio. Old fashioned high impedance (2000 Ohms) headphones from 1940s-1950s are suitable, but are rare, therefore expensive. Piezo ear pieces are good because they have a high impedance of 6k- 10k Ohms. Old telephone ear pieces that are 150 Ohms are not suitable. Note that impedance is not the same as DC resistance and needs specialized equipment to measure."
        },
        {
          "headline":"Check to make sure you have a good-quality ground.",
          "description":"Another possibility if your radio isn’t working is that your ground is not of a high enough quality. Try a different pipe in the house — make sure it extends to the ground. Good grounds include a steel rod for your house wiring (check below your electric meter and ask an experienced adult to connect this), a cold water pipe, sink faucet as long as piping is metal, or a steel beam house support. Decent but less effective grounds include a heating or air-conditioner register, metal window frame, a longer 20-foot ground wire laid on the floor, or a ground wire wrapped around a metal drain pipe or water pipe."
        },
        {
          "headline":"Check your antenna.",
          "description":"The most effective antenna would be a wire run out an upper floor window to a nearby tree branch — the higher and longer your wire is, the better.Other suitable choices include a wire run along the ceiling of an upper floor room or hallway, or a wire run along a basement ceiling. Avoid running your antenna along basement floor or inside any metal buildings. This would work well for a ground, but not for an antenna. Make sure that the wire does not run close to anything that is conductive: metal roofs, chain link fences, etc."
        }
      ]
    }
  ],
  "text":" Making the Capacitor Gather your materials: Empty, clean paper towel roll Two 6-inch-by-6-inch pieces of aluminum foil One piece of 7-inch-by-7-inch white paper (printer paper will do) Two 1-foot-long pieces of wire Masking (or some other non-conductive) tape X-ACTO blade or wire strippers Scissors Cut two 6-inch-by-6-inch pieces of aluminum foil. Use a felt pen and ruler to draw the 6-by-6 squares on the foil before cutting them out. Fasten one foil square around an empty paper towel tube. Start about a half an inch up from the bottom of the tube. Wrap the foil around the tube and fasten it with masking tape. If you don’t have masking tape, you can use any other type of tape as long as it isn’t electrically conductive. Electrical tape is another safe bet. Fasten the other foil square to to a piece of white paper. The paper should measure 7 inches by 7 inches, and the foil square should sit right in the center or it, so that it looks like a silver square inside of a white one. Use masking tape to fasten the foil square to the white paper. Tape all around the foil square to ensure it sits smoothly against the paper. Fasten the paper-foil square around the paper towel roll. Wrap the square around the roll with the aluminum side facing out, and tape it to create a tube. The paper-foil square should form a tube that’s slightly larger than the paper towel roll. The fit should be snug, but not so snug that you can’t easily move the paper towel roll in and out of the paper-foil tube. Be sure to have the aluminum foil facing out, so that the paper touches the roll. You want to insulate the two foil squares from each other, so make sure they don’t touch. Strip the last inch of insulation from both foot-long wire pieces. You can use an X-ACTO blade to gently cut around and strip the insulation from the wire. Be sure that you don’t damage the bare wire. If you have them, you can also use wire strippers to strip the insulation from the wire. Bend the bare wire ends at 90-degree angles. Take the bare ends of both pieces of wire and bend them at 90-degree angles. This should be easy to do with just your fingers. Attach one wire to the paper-foil tube. Tape one of the bare wire ends to the top corner of the free-moving free-moving aluminum foil/paper tube (the one that you’ve placed over the paper towel tube). Use a few pieces of tape to ensure that the wire is well-attached to the foil. It must touch the foil, as that is what will conduct electricity. Attach the other piece of wire to the foil on the paper towel tube. Tape the bare end of the other one-foot length of wire to the top corner of the foil square that’s on the paper towel tube. The wires should sit across from one another, so that you could draw a line between them, along the length of the tube. Move on to your coils. Now that your capacitor is complete, you can move on to making your coils. Making the Coils Gather your materials: One toilet paper roll Insulated Wire (most will do, 26-gauge enamelled magnet wire recommended) Masking (or other non-conductive) tape Sandpaper Ensure that the toilet paper roll is free of debris. Make sure it has no glue or left-over bits of toilet paper stuck to it before you begin. Place two pieces of masking tape along the length of the toilet paper roll. Place one piece of tape along the length of the toilet paper roll, and then cover that piece of tape with another piece of tape. The second piece of tape should exactly cover the first one. Let a piece of the second piece of tape hang over the end of the roll, as you’ll need to lift this back up as you add wire to your coils. Be sure to leave a foot of wire at each end of both coils. Leave a foot-long piece of wire sticking out from each end of each coil. These should be at both the top and bottom of each coil. These pieces are what you will use to connect the coil to other wires. You’ll have 4 one-foot-long pieces of wire sticking out in total: one at the top and bottom of each of the two coils. Start your primary, 25-turn coil. Peel back the second layer of masking tape and place a piece of wire beneath it, then close the tape over it to anchor the wire there. Wind the wire around the toilet paper roll 25 times, being sure to make tight, close winds. Don't forget to leave a foot-long piece of wire at both the start and finish of your coil. 25 turns will work out to roughly 13 feet (4 m) of enamelled wire. Enamelled wires are ideal for the coils because their coating is easier to remove once they’re coiled, and you will need to remove some of the coating in order for the tuning bar to work with the coil (we’ll come to this later). Finish the primary, 25-turn coil. Lift up the second strip of tape, place the wire beneath it, and place tape back down to fasten the wire there. Be sure to leave a foot of wire free when you cut the end of the coil. Start your secondary, 90-turn coil. Lift up the tape and place another piece of wire beneath it, roughly 1/8th of an inch down from the end of the primary coil. Fasten the wire to the roll by closing the tape over it, and then wrap the wire 90 times around the roll. As with the primary, 25-turn coil, make sure that the wire is wrapped in tight, close turns. 90 turns will work out to roughly 42 feet (13 m) of enamelled wire. Finish the secondary coil. Lift up the second layer of tape and secure the final turn of wire beneath it. Clip the wire off, leaving a foot of wire free. Don’t forget to leave a foot of wire on each end of the coil for connecting to other wires. Lightly sand the surface of the secondary (90-turn) coil. You only need to sand a small amount of the surface — roughly a half inch to an inch at the top of the coil will do. Be very gentle and be careful not to sand between the wires. Sanding between the wires will cause them to short into each other, and will make your coil ineffective. Bare the ends of the 4 pieces of wire sticking out from the coils. Each coil will have a foot of wire hanging from its top and bottom. Remove the enamel/insulation from these ends so that you can connect them with other wires. If the wires are enamelled, you can sand them, scrape them, or dip them in nail polish remover to bare them. Making a Holder Gather your materials (note that you can use scraps for the wood and metal pieces): One piece of wood for the base (at least 8 inches wide by 12 inches long) Two pieces of wood to hold the capacitor (at least 6 inches long, and roughly 1.5 inches wide (needs to fit inside capacitor)) One small piece of wood to mount tuning bar on (around 1 inch thick by 2 inches long will do), the height should be the diameter of your finished coil Piece of metal for tuning bar (strip from paint can works) Pliers to help bend metal Screws to connect wooden pieces together Screwdriver Your homemade capacitor Your homemade double-coil toilet paper roll Masking (or other non-conductive) tape Screw together the capacitor holder. Take the two pieces of wood that are roughly 1.5 inches wide by 6 or more inches long, and screw them together to form an L shape. These pieces of wood do not have to be the exact same length. Many people use scrap wood to construct the base, so if you have other sizes lying around, you are welcome to use those. Just make sure that the piece of wood on which you’ll mount the capacitor is small enough to fit inside the capacitor. Attach the capacitor holder to the right side of the base. Place the base down flat in front of you. Use screws to fasten the holder to the top right corner of the base, on the longer side (so if the base is 8 by 12 inches, do this on the corner edge of the 12-inch side). The bottom of the L should be lined up with, and perpendicular to, the right end of the base. The top of the L (the longer side of the L) should be parallel with the base. Once fastened, it should look like a rectangle with one invisible side, or like a horizontal toilet paper roll holder, which is essentially what it is. Place the capacitor on the mount. Ensure that the movable paper-foil tube side is facing outward so that you can easily adjust the size (volume) of the capacitor. Use a thumbtack to fasten the other (paper towel roll) side of the capacitor to the mount. Attach the tuning bar mount to the base. It should sit on the right side of the base, across from the capacitor mount, roughly 3 or 4 inches in from the right end of the base. Leave room (2.5 to 3 inches at least) between the tuning bar mount and the capacitor. You’ll be placing the toilet paper roll double-coil in this space. If the base’s bottom is quite thick, you can use strong glue to connect the tuning bar mount to the base instead of screws. Make the tuning bar. Cut a thin strip of metal and bend it lengthwise so that it makes a V shape. Keep the last half-inch or so of the tuning bar flat. This is the side that you’ll attach to the mount. The bottom point of the V is what you’ll place on the secondary coil in order to tune your radio. Attach the tuning bar to the tuning bar mount. Puncture the flat end of the tuning bar and use a screw to attach it to the end of the mount that’s closest to the capacitor mount. Be sure to firmly but gently screw the tuning bar in so that you can still move it around. Make sure it’s not too lose, as you'll be tuning the radio with it and need it to stay where you put it. Fasten the coil to the base, in front of the tuning bar. Exactly where you place the coil will depend on the length of the tuning bar. Place the coil at a distance from the tuning bar that allows the bar to sit on top of the coil. You need to be able to move the tuning bar back and forth over the secondary coil, much like a windshield wiper moves across a car window. You can use masking tape to fasten the coil to the base. Just place a strip on the inside of either side of the coil and connect it to the base. Connecting it All Gather your materials:Long wire for antenna (15 to 20 feet at least, 50ft or longer in weaker areas) Germanium diode (1N34, 1N34A or equivalent, can be purchased at electronics store) High impedance ear piece (piezo ear piece)/high impedance headphones (at least 2000 Ohms) (an earpiece from an antique telephone will do) Ground wire (any long wire will do) Ground connection (metal posts or pipes that go down to the ground — for example, under your sink, radiator) Wire for tuning bar (12 inches will be more than enough) Know how to connect wires. To connect wires to each other, twist the bare (uninsulated) parts together tightly. If you have several wires to connect, do the same as you would with one wire, but with all of them. You can do them one at a time or take all the wires you need and twist them all together at once, whichever you find easiest. It is easier to twist smaller wires onto thicker wires than the other way round. Connect a wire to a ground source to make your ground wire. You’ll need to connect a bare part of your wire to a piece of clean, bare metal that goes down to the ground. Common sources of this include cold water pipes, faucets, and steel support beams. If you use pipes, go close to the wall to find ones that aren’t insulated or enamelled. You may have to scratch them up a bit to bare some metal and make the pipes more conductive. Tape the ground wire in place on the left side of the base. This will be connected to the adjustable side of the capacitor, as well as the wires coming from the right ends of the 25- and 90-turn coils. So keep that in mind while placing it on the base. Attach a wire to the tuning bar. Loosen the screw holding the tuning bar to its mount, wrap the bare end of a wire around the screw, and then gently retighten the screw. Make sure that the wire touches the tuning bar. Both ends of this wire need to be bare, as they will conduct energy from the tuning bar to the ground wire. Connect the following capacitor and coil wires to the ground wire. Twist them all together tightly. Wire on the adjustable paper-foil side of the capacitor (should be on the left side of the base)\nWire on the right (bottom) end of the primary, 25-turn coil\nWire on the right (bottom) end of the secondary, 90-turn coil\nWire attached to the tuning bar Tape the antenna wire in place on the left side of the base. It will be connected to the top (left end) of the primary, 25-turn coil, so keep that in mind while placing the antenna on the base. The antenna can be any wire, insulated or bare, although insulated is recommended. Most important is that the antenna is as high and long as possible, and that it is not grounded (i.e. connected to any ground sources such as basement floors or pipes. If tying to a tree, metal post, etc, use a short piece of plastic rope). Attach the top, left end of the 25-turn coil to the antenna. Twist the two wires together tightly. Fasten the germanium diode to the right side of the base. You can do this with masking tape. Ensure that the grey stripe on the diode is facing up and outwards, towards the edge of the base instead of the coils. Make sure the diode’s wires are sticking out from under the tape, as you’ll be connecting them to other wires. Place the diode in line with the right end of the capacitor (the paper towel side that can’t be extended), as this is the wire you’ll be attaching it to. Attach the following wires to the top diode wire. These wires will attach to the side of the diode that doesn’t have the grey line on it:\nWire on the right (unmovable) side of the capacitor\nWire from the top, left side of the secondary, 90-turn coil Attach earpiece to the ground and diode wires. Attach one wire of the earpiece to the ground wire grouping, and the other end of the earpiece to the wire of the diode that remains free (i.e. the one that isn’t already attached to the 90-turn coil and the capacitor). You’ll be attaching the earpiece to the side of the diode that has the grey line closer to it. Listen to the radio! You will likely need to adjust the tuning wand and capacitor before you hear anything. Start with adjusting the wand, and then gently pull out the paper-foil side of the capacitor to increase the volume. Troubleshooting Don’t over-sand your tuning coil. If you over-sand your tuning coil it could cause each wire turn to become electrically connected, which will cause the coil to be ineffective. Remember to be careful when sanding the coils that you only lightly sand the surface, not between the coils. Ensure that your tuning bar is not insulated. Depending on what material you’re using, your tuning bar could have a coating on it that prevents it from being conductive. If you’re having trouble picking up anything when you test your radio, try sanding the bottom point of the tuning bar, where it would hit the coil, to make it more conductive. Also try sanding the part of the tuning bar that is under the screw. Use a high impedance ear piece/speaker. Low impedance speakers (4-8 Ohms), head phones (8 Ohms) and earbuds (32 Ohms) do not work with a crystal radio. Old fashioned high impedance (2000 Ohms) headphones from 1940s-1950s are suitable, but are rare, therefore expensive. Piezo ear pieces are good because they have a high impedance of 6k- 10k Ohms. Old telephone ear pieces that are 150 Ohms are not suitable. Note that impedance is not the same as DC resistance and needs specialized equipment to measure. Check to make sure you have a good-quality ground. Another possibility if your radio isn’t working is that your ground is not of a high enough quality. Try a different pipe in the house — make sure it extends to the ground. Good grounds include a steel rod for your house wiring (check below your electric meter and ask an experienced adult to connect this), a cold water pipe, sink faucet as long as piping is metal, or a steel beam house support. Decent but less effective grounds include a heating or air-conditioner register, metal window frame, a longer 20-foot ground wire laid on the floor, or a ground wire wrapped around a metal drain pipe or water pipe. Check your antenna. The most effective antenna would be a wire run out an upper floor window to a nearby tree branch — the higher and longer your wire is, the better.Other suitable choices include a wire run along the ceiling of an upper floor room or hallway, or a wire run along a basement ceiling. Avoid running your antenna along basement floor or inside any metal buildings. This would work well for a ground, but not for an antenna. Make sure that the wire does not run close to anything that is conductive: metal roofs, chain link fences, etc.",
  "sentences":[
    " Making the Capacitor Gather your materials: Empty, clean paper towel roll Two 6-inch-by-6-inch pieces of aluminum foil One piece of 7-inch-by-7-inch white paper (printer paper will do) Two 1-foot-long pieces of wire Masking (or some other non-conductive) tape X-ACTO blade or wire strippers Scissors Cut two 6-inch-by-6-inch pieces of aluminum foil.",
    "Use a felt pen and ruler to draw the 6-by-6 squares on the foil before cutting them out.",
    "Fasten one foil square around an empty paper towel tube.",
    "Start about a half an inch up from the bottom of the tube.",
    "Wrap the foil around the tube and fasten it with masking tape.",
    "If you don’t have masking tape, you can use any other type of tape as long as it isn’t electrically conductive.",
    "Electrical tape is another safe bet.",
    "Fasten the other foil square to to a piece of white paper.",
    "The paper should measure 7 inches by 7 inches, and the foil square should sit right in the center or it, so that it looks like a silver square inside of a white one.",
    "Use masking tape to fasten the foil square to the white paper.",
    "Tape all around the foil square to ensure it sits smoothly against the paper.",
    "Fasten the paper-foil square around the paper towel roll.",
    "Wrap the square around the roll with the aluminum side facing out, and tape it to create a tube.",
    "The paper-foil square should form a tube that’s slightly larger than the paper towel roll.",
    "The fit should be snug, but not so snug that you can’t easily move the paper towel roll in and out of the paper-foil tube.",
    "Be sure to have the aluminum foil facing out, so that the paper touches the roll.",
    "You want to insulate the two foil squares from each other, so make sure they don’t touch.",
    "Strip the last inch of insulation from both foot-long wire pieces.",
    "You can use an X-ACTO blade to gently cut around and strip the insulation from the wire.",
    "Be sure that you don’t damage the bare wire.",
    "If you have them, you can also use wire strippers to strip the insulation from the wire.",
    "Bend the bare wire ends at 90-degree angles.",
    "Take the bare ends of both pieces of wire and bend them at 90-degree angles.",
    "This should be easy to do with just your fingers.",
    "Attach one wire to the paper-foil tube.",
    "Tape one of the bare wire ends to the top corner of the free-moving free-moving aluminum foil/paper tube (the one that you’ve placed over the paper towel tube).",
    "Use a few pieces of tape to ensure that the wire is well-attached to the foil.",
    "It must touch the foil, as that is what will conduct electricity.",
    "Attach the other piece of wire to the foil on the paper towel tube.",
    "Tape the bare end of the other one-foot length of wire to the top corner of the foil square that’s on the paper towel tube.",
    "The wires should sit across from one another, so that you could draw a line between them, along the length of the tube.",
    "Move on to your coils.",
    "Now that your capacitor is complete, you can move on to making your coils.",
    "Making the Coils Gather your materials: One toilet paper roll Insulated Wire (most will do, 26-gauge enamelled magnet wire recommended) Masking (or other non-conductive) tape Sandpaper Ensure that the toilet paper roll is free of debris.",
    "Make sure it has no glue or left-over bits of toilet paper stuck to it before you begin.",
    "Place two pieces of masking tape along the length of the toilet paper roll.",
    "Place one piece of tape along the length of the toilet paper roll, and then cover that piece of tape with another piece of tape.",
    "The second piece of tape should exactly cover the first one.",
    "Let a piece of the second piece of tape hang over the end of the roll, as you’ll need to lift this back up as you add wire to your coils.",
    "Be sure to leave a foot of wire at each end of both coils.",
    "Leave a foot-long piece of wire sticking out from each end of each coil.",
    "These should be at both the top and bottom of each coil.",
    "These pieces are what you will use to connect the coil to other wires.",
    "You’ll have 4 one-foot-long pieces of wire sticking out in total: one at the top and bottom of each of the two coils.",
    "Start your primary, 25-turn coil.",
    "Peel back the second layer of masking tape and place a piece of wire beneath it, then close the tape over it to anchor the wire there.",
    "Wind the wire around the toilet paper roll 25 times, being sure to make tight, close winds.",
    "Don't forget to leave a foot-long piece of wire at both the start and finish of your coil.",
    "25 turns will work out to roughly 13 feet (4 m) of enamelled wire.",
    "Enamelled wires are ideal for the coils because their coating is easier to remove once they’re coiled, and you will need to remove some of the coating in order for the tuning bar to work with the coil (we’ll come to this later).",
    "Finish the primary, 25-turn coil.",
    "Lift up the second strip of tape, place the wire beneath it, and place tape back down to fasten the wire there.",
    "Be sure to leave a foot of wire free when you cut the end of the coil.",
    "Start your secondary, 90-turn coil.",
    "Lift up the tape and place another piece of wire beneath it, roughly 1/8th of an inch down from the end of the primary coil.",
    "Fasten the wire to the roll by closing the tape over it, and then wrap the wire 90 times around the roll.",
    "As with the primary, 25-turn coil, make sure that the wire is wrapped in tight, close turns.",
    "90 turns will work out to roughly 42 feet (13 m) of enamelled wire.",
    "Finish the secondary coil.",
    "Lift up the second layer of tape and secure the final turn of wire beneath it.",
    "Clip the wire off, leaving a foot of wire free.",
    "Don’t forget to leave a foot of wire on each end of the coil for connecting to other wires.",
    "Lightly sand the surface of the secondary (90-turn) coil.",
    "You only need to sand a small amount of the surface — roughly a half inch to an inch at the top of the coil will do.",
    "Be very gentle and be careful not to sand between the wires.",
    "Sanding between the wires will cause them to short into each other, and will make your coil ineffective.",
    "Bare the ends of the 4 pieces of wire sticking out from the coils.",
    "Each coil will have a foot of wire hanging from its top and bottom.",
    "Remove the enamel/insulation from these ends so that you can connect them with other wires.",
    "If the wires are enamelled, you can sand them, scrape them, or dip them in nail polish remover to bare them.",
    "Making a Holder Gather your materials (note that you can use scraps for the wood and metal pieces): One piece of wood for the base (at least 8 inches wide by 12 inches long) Two pieces of wood to hold the capacitor (at least 6 inches long, and roughly 1.5 inches wide (needs to fit inside capacitor)) One small piece of wood to mount tuning bar on (around 1 inch thick by 2 inches long will do), the height should be the diameter of your finished coil Piece of metal for tuning bar (strip from paint can works) Pliers to help bend metal Screws to connect wooden pieces together Screwdriver Your homemade capacitor Your homemade double-coil toilet paper roll Masking (or other non-conductive) tape Screw together the capacitor holder.",
    "Take the two pieces of wood that are roughly 1.5 inches wide by 6 or more inches long, and screw them together to form an L shape.",
    "These pieces of wood do not have to be the exact same length.",
    "Many people use scrap wood to construct the base, so if you have other sizes lying around, you are welcome to use those.",
    "Just make sure that the piece of wood on which you’ll mount the capacitor is small enough to fit inside the capacitor.",
    "Attach the capacitor holder to the right side of the base.",
    "Place the base down flat in front of you.",
    "Use screws to fasten the holder to the top right corner of the base, on the longer side (so if the base is 8 by 12 inches, do this on the corner edge of the 12-inch side).",
    "The bottom of the L should be lined up with, and perpendicular to, the right end of the base.",
    "The top of the L (the longer side of the L) should be parallel with the base.",
    "Once fastened, it should look like a rectangle with one invisible side, or like a horizontal toilet paper roll holder, which is essentially what it is.",
    "Place the capacitor on the mount.",
    "Ensure that the movable paper-foil tube side is facing outward so that you can easily adjust the size (volume) of the capacitor.",
    "Use a thumbtack to fasten the other (paper towel roll) side of the capacitor to the mount.",
    "Attach the tuning bar mount to the base.",
    "It should sit on the right side of the base, across from the capacitor mount, roughly 3 or 4 inches in from the right end of the base.",
    "Leave room (2.5 to 3 inches at least) between the tuning bar mount and the capacitor.",
    "You’ll be placing the toilet paper roll double-coil in this space.",
    "If the base’s bottom is quite thick, you can use strong glue to connect the tuning bar mount to the base instead of screws.",
    "Make the tuning bar.",
    "Cut a thin strip of metal and bend it lengthwise so that it makes a V shape.",
    "Keep the last half-inch or so of the tuning bar flat.",
    "This is the side that you’ll attach to the mount.",
    "The bottom point of the V is what you’ll place on the secondary coil in order to tune your radio.",
    "Attach the tuning bar to the tuning bar mount.",
    "Puncture the flat end of the tuning bar and use a screw to attach it to the end of the mount that’s closest to the capacitor mount.",
    "Be sure to firmly but gently screw the tuning bar in so that you can still move it around.",
    "Make sure it’s not too lose, as you'll be tuning the radio with it and need it to stay where you put it.",
    "Fasten the coil to the base, in front of the tuning bar.",
    "Exactly where you place the coil will depend on the length of the tuning bar.",
    "Place the coil at a distance from the tuning bar that allows the bar to sit on top of the coil.",
    "You need to be able to move the tuning bar back and forth over the secondary coil, much like a windshield wiper moves across a car window.",
    "You can use masking tape to fasten the coil to the base.",
    "Just place a strip on the inside of either side of the coil and connect it to the base.",
    "Connecting it All Gather your materials:Long wire for antenna (15 to 20 feet at least, 50ft or longer in weaker areas) Germanium diode (1N34, 1N34A or equivalent, can be purchased at electronics store) High impedance ear piece (piezo ear piece)/high impedance headphones (at least 2000 Ohms) (an earpiece from an antique telephone will do) Ground wire (any long wire will do) Ground connection (metal posts or pipes that go down to the ground — for example, under your sink, radiator) Wire for tuning bar (12 inches will be more than enough) Know how to connect wires.",
    "To connect wires to each other, twist the bare (uninsulated) parts together tightly.",
    "If you have several wires to connect, do the same as you would with one wire, but with all of them.",
    "You can do them one at a time or take all the wires you need and twist them all together at once, whichever you find easiest.",
    "It is easier to twist smaller wires onto thicker wires than the other way round.",
    "Connect a wire to a ground source to make your ground wire.",
    "You’ll need to connect a bare part of your wire to a piece of clean, bare metal that goes down to the ground.",
    "Common sources of this include cold water pipes, faucets, and steel support beams.",
    "If you use pipes, go close to the wall to find ones that aren’t insulated or enamelled.",
    "You may have to scratch them up a bit to bare some metal and make the pipes more conductive.",
    "Tape the ground wire in place on the left side of the base.",
    "This will be connected to the adjustable side of the capacitor, as well as the wires coming from the right ends of the 25- and 90-turn coils.",
    "So keep that in mind while placing it on the base.",
    "Attach a wire to the tuning bar.",
    "Loosen the screw holding the tuning bar to its mount, wrap the bare end of a wire around the screw, and then gently retighten the screw.",
    "Make sure that the wire touches the tuning bar.",
    "Both ends of this wire need to be bare, as they will conduct energy from the tuning bar to the ground wire.",
    "Connect the following capacitor and coil wires to the ground wire.",
    "Twist them all together tightly.",
    "Wire on the adjustable paper-foil side of the capacitor (should be on the left side of the base)\nWire on the right (bottom) end of the primary, 25-turn coil\nWire on the right (bottom) end of the secondary, 90-turn coil\nWire attached to the tuning bar Tape the antenna wire in place on the left side of the base.",
    "It will be connected to the top (left end) of the primary, 25-turn coil, so keep that in mind while placing the antenna on the base.",
    "The antenna can be any wire, insulated or bare, although insulated is recommended.",
    "Most important is that the antenna is as high and long as possible, and that it is not grounded (i.e.",
    "connected to any ground sources such as basement floors or pipes.",
    "If tying to a tree, metal post, etc, use a short piece of plastic rope).",
    "Attach the top, left end of the 25-turn coil to the antenna.",
    "Twist the two wires together tightly.",
    "Fasten the germanium diode to the right side of the base.",
    "You can do this with masking tape.",
    "Ensure that the grey stripe on the diode is facing up and outwards, towards the edge of the base instead of the coils.",
    "Make sure the diode’s wires are sticking out from under the tape, as you’ll be connecting them to other wires.",
    "Place the diode in line with the right end of the capacitor (the paper towel side that can’t be extended), as this is the wire you’ll be attaching it to.",
    "Attach the following wires to the top diode wire.",
    "These wires will attach to the side of the diode that doesn’t have the grey line on it:\nWire on the right (unmovable) side of the capacitor\nWire from the top, left side of the secondary, 90-turn coil Attach earpiece to the ground and diode wires.",
    "Attach one wire of the earpiece to the ground wire grouping, and the other end of the earpiece to the wire of the diode that remains free (i.e.",
    "the one that isn’t already attached to the 90-turn coil and the capacitor).",
    "You’ll be attaching the earpiece to the side of the diode that has the grey line closer to it.",
    "Listen to the radio!",
    "You will likely need to adjust the tuning wand and capacitor before you hear anything.",
    "Start with adjusting the wand, and then gently pull out the paper-foil side of the capacitor to increase the volume.",
    "Troubleshooting Don’t over-sand your tuning coil.",
    "If you over-sand your tuning coil it could cause each wire turn to become electrically connected, which will cause the coil to be ineffective.",
    "Remember to be careful when sanding the coils that you only lightly sand the surface, not between the coils.",
    "Ensure that your tuning bar is not insulated.",
    "Depending on what material you’re using, your tuning bar could have a coating on it that prevents it from being conductive.",
    "If you’re having trouble picking up anything when you test your radio, try sanding the bottom point of the tuning bar, where it would hit the coil, to make it more conductive.",
    "Also try sanding the part of the tuning bar that is under the screw.",
    "Use a high impedance ear piece/speaker.",
    "Low impedance speakers (4-8 Ohms), head phones (8 Ohms) and earbuds (32 Ohms) do not work with a crystal radio.",
    "Old fashioned high impedance (2000 Ohms) headphones from 1940s-1950s are suitable, but are rare, therefore expensive.",
    "Piezo ear pieces are good because they have a high impedance of 6k- 10k Ohms.",
    "Old telephone ear pieces that are 150 Ohms are not suitable.",
    "Note that impedance is not the same as DC resistance and needs specialized equipment to measure.",
    "Check to make sure you have a good-quality ground.",
    "Another possibility if your radio isn’t working is that your ground is not of a high enough quality.",
    "Try a different pipe in the house — make sure it extends to the ground.",
    "Good grounds include a steel rod for your house wiring (check below your electric meter and ask an experienced adult to connect this), a cold water pipe, sink faucet as long as piping is metal, or a steel beam house support.",
    "Decent but less effective grounds include a heating or air-conditioner register, metal window frame, a longer 20-foot ground wire laid on the floor, or a ground wire wrapped around a metal drain pipe or water pipe.",
    "Check your antenna.",
    "The most effective antenna would be a wire run out an upper floor window to a nearby tree branch — the higher and longer your wire is, the better.Other suitable choices include a wire run along the ceiling of an upper floor room or hallway, or a wire run along a basement ceiling.",
    "Avoid running your antenna along basement floor or inside any metal buildings.",
    "This would work well for a ground, but not for an antenna.",
    "Make sure that the wire does not run close to anything that is conductive: metal roofs, chain link fences, etc."
  ],
  "tyn_section":[
    "Empty, clean paper towel roll",
    "Two 6-inch-by-6-inch pieces of aluminum foil",
    "One piece of 7-inch-by-7-inch white paper (printer paper will do)",
    "Two 1-foot-long pieces of wire",
    "Masking (or some other non-conductive) tape",
    "X-ACTO blade or wire strippers",
    "Scissors",
    "One toilet paper roll",
    "Wire (60 ft of 26-gauge enamelled magnet wire or similar recommended)",
    "Masking (or other non-conductive) tape",
    "Sandpaper",
    "One piece of wood for the base (at least 8 inches wide by 12 inches long)",
    "Two pieces of wood to hold the capacitor (at least 6 inches long, and roughly 1.5 inches wide (needs to fit inside capacitor))",
    "One small piece of wood to mount tuning bar on (around 1 inch thick by 2 inches long will do)",
    "Piece of metal for tuning bar (strip from paint can works)",
    "Pliers to help bend metal",
    "Screws to connect wooden pieces together",
    "Screwdriver",
    "Insulated wire for antenna (15 to 20 feet at least, 50 ft or longer in weaker areas)",
    "High impedance ear piece (piezo ear piece)/high impedance headphones (at least 2000 Ohms) (an earpiece from an antique telephone will do)",
    "Germanium diode (1N34, 1N34A, 1N60, 1N91, 1N119, 1N270, 1N277, or 1N283 will work)",
    "[10]",
    "X",
    "Research source",
    "Ground wire (any long wire will do)",
    "Wire for tuning bar (12 inches will be more than enough)"
  ],
  "tyn_model":[
    "wire",
    "tape",
    "tuning bar",
    "capacitor",
    "paper towel",
    "masking tape",
    "radio",
    "antenna",
    "aluminum foil",
    "foil",
    "toilet paper roll",
    "toilet paper",
    "earpiece",
    "paper",
    "wires",
    "wire strippers",
    "white paper",
    "paper-",
    "insulation",
    "enamelled wire",
    "screws",
    "germanium diode",
    "ground wire",
    "printer paper",
    "felt pen",
    "ruler",
    "electrical tape",
    "x-acto blade",
    "paper-foil",
    "enamelled wires",
    "— roughly",
    "sand",
    "nail polish remover",
    "pliers",
    "screwdriver",
    "capacitor holder",
    "holder",
    "toilet paper roll holder",
    "glue",
    "screw",
    "coil",
    "— for",
    "cold water pipes",
    "pipes",
    "coil wires",
    "adjustable paper-foil",
    "antenna wire",
    "tuning coil",
    "speaker",
    "speakers",
    "headphones",
    "— make",
    "electric meter",
    "cold water",
    "— the",
    "chain link fences"
  ],
  "simple_metrics":{
    "r":0.0384615385,
    "p":0.0178571429,
    "f1":0.0243902439,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0769230769,
    "p":0.0714285714,
    "f1":0.0740740741
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3076923077,
    "p":0.1785714286,
    "f1":0.2259887006
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0769230769,
    "p":0.0357142857,
    "f1":0.0487804878
  }
}