{
  "title":"How to Make Your Room Look Like an Apartment",
  "url":"https://www.wikihow.com/Make-Your-Room-Look-Like-an-Apartment",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Ask your parent's permission.",
          "description":"If you live at home, make sure your plans are okay with them. This is important as your room belongs to them as does the furniture you'll be wanting to use."
        },
        {
          "headline":"Clear out the room.",
          "description":"At this point you may also wish to vacuum and clean or paint walls. Remember, you may need permission to paint the wall. Take any posters down and remove tacks from the walls. Strip the room entirely."
        },
        {
          "headline":"Make a plan.",
          "description":"Decide which areas of your room are going to act as the rooms of your apartment. You might want a lounge, dining area, hall, bathroom, kitchen or just some of these."
        }
      ]
    },
    {
      "name":"Creating a Front Door Area",
      "steps":[
        {
          "headline":"Pretend your bedroom door is the front door of your apartment.",
          "description":"Put up a doorbell, attach numbers to your door if you like."
        },
        {
          "headline":"Add decoration outside your door.",
          "description":"Put a potted plant outside your door or a chair if you prefer. Many actual apartments have plants or chairs by their front doors."
        },
        {
          "headline":"Add a little mailbox for letters.",
          "description":"You can even use a painted cardboard box. Someone might want to write a letter to you in your room that looks like a an apartment."
        }
      ]
    },
    {
      "name":"Creating a Hall",
      "steps":[
        {
          "headline":"Simulate a hall area.",
          "description":"Set up a coat rack and a shoe rack. Remember to have storage for the coats and shoes of your visitors, as well as your own."
        },
        {
          "headline":"Lay down a door mat by the door.",
          "description":"Have one that says welcome if you like. Make sure that it doesn't impede the door opening and closing."
        },
        {
          "headline":"Place a small table in your hall area.",
          "description":"Put some flowers and a phone with a cord on the table. Don't leave your mobile phone on this table, that won't make your room look like an apartment at all. You can put anything else you liked on the table, keys, a vase, loose change, etc. Add what is usually on a hall table."
        },
        {
          "headline":"Put a mirror on the wall.",
          "description":"You may have a mirror in your bedroom area or bathroom area too but nothing is stopping you from putting one in your fake hall too."
        }
      ]
    },
    {
      "name":"Setting Up a Living Room",
      "steps":[
        {
          "headline":"Put a couch in the corner of the room.",
          "description":"Alternatively use a large armchair or even just a big mattress with one of the horizontal sides propped up on the wall. Get a throw pillow or cushion and put it on the armrest of your sofa, armchair or propped up mattress."
        },
        {
          "headline":"Put a coffee table in front of the couch.",
          "description":"You can put whatever you want on this table, such as magazines or a bowl of fruit."
        },
        {
          "headline":"Try to get a small TV for your living room.",
          "description":"Add a DVD, VCR or Blu Ray player."
        },
        {
          "headline":"Put a small waste can next to your couch for any garbage.",
          "description":"You need a place to put rubbish, you don't want your room that looks like an apartment to get messy."
        }
      ]
    },
    {
      "name":"Organize a Bedroom Area",
      "steps":[
        {
          "headline":"Put your bed in a corner of the room.",
          "description":"Make sure it is neatly made and has fresh bed clothes that match the colour scheme of your 'apartment'."
        },
        {
          "headline":"Add a wardrobe and a chest of drawers for clothing.",
          "description":"If you have a built in wardrobe, you can keep using that, or, use that space as a different area of your apartment and add a free standing wardrobe."
        },
        {
          "headline":"Add a nightstand to your room.",
          "description":"Place it by the bed. You can place on it your alarm clock and maybe a lamp for reading in bed. Also keep this aiming toward to color scheme. Add a small bookcase for some of your favorite books, alternatively, you could put your bookcase in your lounge area, next to the propped up mattress."
        }
      ]
    },
    {
      "name":"Simulating a Kitchen",
      "steps":[
        {
          "headline":"Add table and some chairs.",
          "description":"Four chairs might be over the top, one will probably suffice. You can use beanbags and a small table, if you prefer."
        },
        {
          "headline":"Add a mini fridge and a kitchen cart.",
          "description":"Buy a toaster or borrow one from elsewhere in the house. If you're allowed, and it's not a fire risk, put a microwave in your kitchen area. This will make cooking and preparing food easier in your bedroom."
        },
        {
          "headline":"Obtain some dishes and cutlery.",
          "description":"Get plates, bowls and cutlery for your mini kitchen and a place to store them."
        }
      ]
    },
    {
      "name":"Organizing a Bathroom",
      "steps":[
        {
          "headline":"Get a basin, a table and your bathroom supplies.",
          "description":"You may not be able to plumb in a basin. A large bowl might have to suffice which you'll need to fill from the nearest tap, or you could put a pitcher a washbowl set in the bathroom area of your room. This is more for washing than doing business, whatever business you might want to do. Make sure you can clean yourself, your dishes and your clothes in this if you want or need to."
        },
        {
          "headline":"Put the basin on a table.",
          "description":"Put a mirror on the wall behind the table with a basin on it."
        },
        {
          "headline":"Use the other table space for towels.",
          "description":"You can also put toothbrushes and personal hygienic products."
        }
      ]
    },
    {
      "name":"Setting Up a Laundry Room",
      "steps":[
        {
          "headline":"Create a laundry room.",
          "description":"You can just put a basket and clothes rack in whatever space is not taken up already by your other rooms."
        },
        {
          "headline":"Put the clothes rack beside your basket.",
          "description":""
        },
        {
          "headline":"Be sure to label your dirty clothes basket.",
          "description":"This is so people don't put rubbish in your laundry basket."
        }
      ]
    },
    {
      "name":"Incorporating a Study",
      "steps":[
        {
          "headline":"Manoeuvre a desk into your room.",
          "description":"You can also added a bookcase if you would like to and there isn't one already place in your bedroom or lounge area."
        },
        {
          "headline":"Put your computer on the desk.",
          "description":"If not use a drawing pad or notebook instead of a computer or laptop."
        },
        {
          "headline":"Add organizational tools.",
          "description":"Use pencil holders, paper, desk ornaments, whatever you like, to your desk."
        }
      ]
    },
    {
      "name":"Organizing a Toy Room",
      "steps":[
        {
          "headline":"Place storage boxes and an armchair in the room.",
          "description":"A table will work well too."
        },
        {
          "headline":"Gather all your toys and sort them out.",
          "description":"Place figurines in one drawer and play-doh in the other drawer of whatever item of furniture you have that has drawers. If you have other toys, you can do whatever you like with them when you are making your look like an apartment."
        },
        {
          "headline":"Arrange your toys in your toy room.",
          "description":"Keep them neat and tidy though!"
        }
      ]
    },
    {
      "name":"Setting Up a Pet Area",
      "steps":[
        {
          "headline":"Create a pet area, if you have one.",
          "description":"Add a pet bed or create a place where your pet could sleep."
        },
        {
          "headline":"Feed your pet in your room.",
          "description":"You'll need an appropriate bowl and some pet food and water."
        },
        {
          "headline":"Have newspapers or a litterbox handy.",
          "description":"You don't want your room to be messy. Clean up your pet's messes on a regular basis daily."
        },
        {
          "headline":"Set up an area for a cage.",
          "description":"If you have a small caged pet or fish in a tank, just put its cage or tank on another table in your room."
        }
      ]
    },
    {
      "name":"Plant a Garden",
      "steps":[
        {
          "headline":"Create a garden area inside your room.",
          "description":"Few apartments have gardens but you can simulate a garden area in your room. Add a window box or ask for a small space of land outside your window or if you have a balcony that would work. Fence the area if you want. Measure the window box(es) or land you have."
        },
        {
          "headline":"Create a window box.",
          "description":"Here are the steps\nPaint your window box with bright paint. Plant some vegetables. Plant all different flowers. Repeat some or all steps if there is more than one window box."
        },
        {
          "headline":"Adding small touches.",
          "description":"In small areas, you can:\nPlant flowers and get a deck chair or bench. Put up a bird house and bird feeder if you want. Try putting up a small washing line to dry clothes. Get garden toys such as a hula hoop, small paddling pool, a ball etc."
        },
        {
          "headline":"Create balcony steps.",
          "description":"Get some potted plants. Get two chairs and a table. Consider putting up a small washing line on your balcony to dry clothes."
        }
      ]
    }
  ],
  "text":" Steps Ask your parent's permission. If you live at home, make sure your plans are okay with them. This is important as your room belongs to them as does the furniture you'll be wanting to use. Clear out the room. At this point you may also wish to vacuum and clean or paint walls. Remember, you may need permission to paint the wall. Take any posters down and remove tacks from the walls. Strip the room entirely. Make a plan. Decide which areas of your room are going to act as the rooms of your apartment. You might want a lounge, dining area, hall, bathroom, kitchen or just some of these. Creating a Front Door Area Pretend your bedroom door is the front door of your apartment. Put up a doorbell, attach numbers to your door if you like. Add decoration outside your door. Put a potted plant outside your door or a chair if you prefer. Many actual apartments have plants or chairs by their front doors. Add a little mailbox for letters. You can even use a painted cardboard box. Someone might want to write a letter to you in your room that looks like a an apartment. Creating a Hall Simulate a hall area. Set up a coat rack and a shoe rack. Remember to have storage for the coats and shoes of your visitors, as well as your own. Lay down a door mat by the door. Have one that says welcome if you like. Make sure that it doesn't impede the door opening and closing. Place a small table in your hall area. Put some flowers and a phone with a cord on the table. Don't leave your mobile phone on this table, that won't make your room look like an apartment at all. You can put anything else you liked on the table, keys, a vase, loose change, etc. Add what is usually on a hall table. Put a mirror on the wall. You may have a mirror in your bedroom area or bathroom area too but nothing is stopping you from putting one in your fake hall too. Setting Up a Living Room Put a couch in the corner of the room. Alternatively use a large armchair or even just a big mattress with one of the horizontal sides propped up on the wall. Get a throw pillow or cushion and put it on the armrest of your sofa, armchair or propped up mattress. Put a coffee table in front of the couch. You can put whatever you want on this table, such as magazines or a bowl of fruit. Try to get a small TV for your living room. Add a DVD, VCR or Blu Ray player. Put a small waste can next to your couch for any garbage. You need a place to put rubbish, you don't want your room that looks like an apartment to get messy. Organize a Bedroom Area Put your bed in a corner of the room. Make sure it is neatly made and has fresh bed clothes that match the colour scheme of your 'apartment'. Add a wardrobe and a chest of drawers for clothing. If you have a built in wardrobe, you can keep using that, or, use that space as a different area of your apartment and add a free standing wardrobe. Add a nightstand to your room. Place it by the bed. You can place on it your alarm clock and maybe a lamp for reading in bed. Also keep this aiming toward to color scheme. Add a small bookcase for some of your favorite books, alternatively, you could put your bookcase in your lounge area, next to the propped up mattress. Simulating a Kitchen Add table and some chairs. Four chairs might be over the top, one will probably suffice. You can use beanbags and a small table, if you prefer. Add a mini fridge and a kitchen cart. Buy a toaster or borrow one from elsewhere in the house. If you're allowed, and it's not a fire risk, put a microwave in your kitchen area. This will make cooking and preparing food easier in your bedroom. Obtain some dishes and cutlery. Get plates, bowls and cutlery for your mini kitchen and a place to store them. Organizing a Bathroom Get a basin, a table and your bathroom supplies. You may not be able to plumb in a basin. A large bowl might have to suffice which you'll need to fill from the nearest tap, or you could put a pitcher a washbowl set in the bathroom area of your room. This is more for washing than doing business, whatever business you might want to do. Make sure you can clean yourself, your dishes and your clothes in this if you want or need to. Put the basin on a table. Put a mirror on the wall behind the table with a basin on it. Use the other table space for towels. You can also put toothbrushes and personal hygienic products. Setting Up a Laundry Room Create a laundry room. You can just put a basket and clothes rack in whatever space is not taken up already by your other rooms. Put the clothes rack beside your basket.  Be sure to label your dirty clothes basket. This is so people don't put rubbish in your laundry basket. Incorporating a Study Manoeuvre a desk into your room. You can also added a bookcase if you would like to and there isn't one already place in your bedroom or lounge area. Put your computer on the desk. If not use a drawing pad or notebook instead of a computer or laptop. Add organizational tools. Use pencil holders, paper, desk ornaments, whatever you like, to your desk. Organizing a Toy Room Place storage boxes and an armchair in the room. A table will work well too. Gather all your toys and sort them out. Place figurines in one drawer and play-doh in the other drawer of whatever item of furniture you have that has drawers. If you have other toys, you can do whatever you like with them when you are making your look like an apartment. Arrange your toys in your toy room. Keep them neat and tidy though! Setting Up a Pet Area Create a pet area, if you have one. Add a pet bed or create a place where your pet could sleep. Feed your pet in your room. You'll need an appropriate bowl and some pet food and water. Have newspapers or a litterbox handy. You don't want your room to be messy. Clean up your pet's messes on a regular basis daily. Set up an area for a cage. If you have a small caged pet or fish in a tank, just put its cage or tank on another table in your room. Plant a Garden Create a garden area inside your room. Few apartments have gardens but you can simulate a garden area in your room. Add a window box or ask for a small space of land outside your window or if you have a balcony that would work. Fence the area if you want. Measure the window box(es) or land you have. Create a window box. Here are the steps\nPaint your window box with bright paint. Plant some vegetables. Plant all different flowers. Repeat some or all steps if there is more than one window box. Adding small touches. In small areas, you can:\nPlant flowers and get a deck chair or bench. Put up a bird house and bird feeder if you want. Try putting up a small washing line to dry clothes. Get garden toys such as a hula hoop, small paddling pool, a ball etc. Create balcony steps. Get some potted plants. Get two chairs and a table. Consider putting up a small washing line on your balcony to dry clothes.",
  "sentences":[
    " Steps Ask your parent's permission.",
    "If you live at home, make sure your plans are okay with them.",
    "This is important as your room belongs to them as does the furniture you'll be wanting to use.",
    "Clear out the room.",
    "At this point you may also wish to vacuum and clean or paint walls.",
    "Remember, you may need permission to paint the wall.",
    "Take any posters down and remove tacks from the walls.",
    "Strip the room entirely.",
    "Make a plan.",
    "Decide which areas of your room are going to act as the rooms of your apartment.",
    "You might want a lounge, dining area, hall, bathroom, kitchen or just some of these.",
    "Creating a Front Door Area Pretend your bedroom door is the front door of your apartment.",
    "Put up a doorbell, attach numbers to your door if you like.",
    "Add decoration outside your door.",
    "Put a potted plant outside your door or a chair if you prefer.",
    "Many actual apartments have plants or chairs by their front doors.",
    "Add a little mailbox for letters.",
    "You can even use a painted cardboard box.",
    "Someone might want to write a letter to you in your room that looks like a an apartment.",
    "Creating a Hall Simulate a hall area.",
    "Set up a coat rack and a shoe rack.",
    "Remember to have storage for the coats and shoes of your visitors, as well as your own.",
    "Lay down a door mat by the door.",
    "Have one that says welcome if you like.",
    "Make sure that it doesn't impede the door opening and closing.",
    "Place a small table in your hall area.",
    "Put some flowers and a phone with a cord on the table.",
    "Don't leave your mobile phone on this table, that won't make your room look like an apartment at all.",
    "You can put anything else you liked on the table, keys, a vase, loose change, etc.",
    "Add what is usually on a hall table.",
    "Put a mirror on the wall.",
    "You may have a mirror in your bedroom area or bathroom area too but nothing is stopping you from putting one in your fake hall too.",
    "Setting Up a Living Room Put a couch in the corner of the room.",
    "Alternatively use a large armchair or even just a big mattress with one of the horizontal sides propped up on the wall.",
    "Get a throw pillow or cushion and put it on the armrest of your sofa, armchair or propped up mattress.",
    "Put a coffee table in front of the couch.",
    "You can put whatever you want on this table, such as magazines or a bowl of fruit.",
    "Try to get a small TV for your living room.",
    "Add a DVD, VCR or Blu Ray player.",
    "Put a small waste can next to your couch for any garbage.",
    "You need a place to put rubbish, you don't want your room that looks like an apartment to get messy.",
    "Organize a Bedroom Area Put your bed in a corner of the room.",
    "Make sure it is neatly made and has fresh bed clothes that match the colour scheme of your 'apartment'.",
    "Add a wardrobe and a chest of drawers for clothing.",
    "If you have a built in wardrobe, you can keep using that, or, use that space as a different area of your apartment and add a free standing wardrobe.",
    "Add a nightstand to your room.",
    "Place it by the bed.",
    "You can place on it your alarm clock and maybe a lamp for reading in bed.",
    "Also keep this aiming toward to color scheme.",
    "Add a small bookcase for some of your favorite books, alternatively, you could put your bookcase in your lounge area, next to the propped up mattress.",
    "Simulating a Kitchen Add table and some chairs.",
    "Four chairs might be over the top, one will probably suffice.",
    "You can use beanbags and a small table, if you prefer.",
    "Add a mini fridge and a kitchen cart.",
    "Buy a toaster or borrow one from elsewhere in the house.",
    "If you're allowed, and it's not a fire risk, put a microwave in your kitchen area.",
    "This will make cooking and preparing food easier in your bedroom.",
    "Obtain some dishes and cutlery.",
    "Get plates, bowls and cutlery for your mini kitchen and a place to store them.",
    "Organizing a Bathroom Get a basin, a table and your bathroom supplies.",
    "You may not be able to plumb in a basin.",
    "A large bowl might have to suffice which you'll need to fill from the nearest tap, or you could put a pitcher a washbowl set in the bathroom area of your room.",
    "This is more for washing than doing business, whatever business you might want to do.",
    "Make sure you can clean yourself, your dishes and your clothes in this if you want or need to.",
    "Put the basin on a table.",
    "Put a mirror on the wall behind the table with a basin on it.",
    "Use the other table space for towels.",
    "You can also put toothbrushes and personal hygienic products.",
    "Setting Up a Laundry Room Create a laundry room.",
    "You can just put a basket and clothes rack in whatever space is not taken up already by your other rooms.",
    "Put the clothes rack beside your basket.",
    "Be sure to label your dirty clothes basket.",
    "This is so people don't put rubbish in your laundry basket.",
    "Incorporating a Study Manoeuvre a desk into your room.",
    "You can also added a bookcase if you would like to and there isn't one already place in your bedroom or lounge area.",
    "Put your computer on the desk.",
    "If not use a drawing pad or notebook instead of a computer or laptop.",
    "Add organizational tools.",
    "Use pencil holders, paper, desk ornaments, whatever you like, to your desk.",
    "Organizing a Toy Room Place storage boxes and an armchair in the room.",
    "A table will work well too.",
    "Gather all your toys and sort them out.",
    "Place figurines in one drawer and play-doh in the other drawer of whatever item of furniture you have that has drawers.",
    "If you have other toys, you can do whatever you like with them when you are making your look like an apartment.",
    "Arrange your toys in your toy room.",
    "Keep them neat and tidy though!",
    "Setting Up a Pet Area Create a pet area, if you have one.",
    "Add a pet bed or create a place where your pet could sleep.",
    "Feed your pet in your room.",
    "You'll need an appropriate bowl and some pet food and water.",
    "Have newspapers or a litterbox handy.",
    "You don't want your room to be messy.",
    "Clean up your pet's messes on a regular basis daily.",
    "Set up an area for a cage.",
    "If you have a small caged pet or fish in a tank, just put its cage or tank on another table in your room.",
    "Plant a Garden Create a garden area inside your room.",
    "Few apartments have gardens but you can simulate a garden area in your room.",
    "Add a window box or ask for a small space of land outside your window or if you have a balcony that would work.",
    "Fence the area if you want.",
    "Measure the window box(es) or land you have.",
    "Create a window box.",
    "Here are the steps\nPaint your window box with bright paint.",
    "Plant some vegetables.",
    "Plant all different flowers.",
    "Repeat some or all steps if there is more than one window box.",
    "Adding small touches.",
    "In small areas, you can:\nPlant flowers and get a deck chair or bench.",
    "Put up a bird house and bird feeder if you want.",
    "Try putting up a small washing line to dry clothes.",
    "Get garden toys such as a hula hoop, small paddling pool, a ball etc.",
    "Create balcony steps.",
    "Get some potted plants.",
    "Get two chairs and a table.",
    "Consider putting up a small washing line on your balcony to dry clothes."
  ],
  "tyn_section":[
    "Furniture",
    "Paint"
  ],
  "tyn_model":[
    "basin",
    "mirror",
    "chairs",
    "cutlery",
    "bowl",
    "clothes rack",
    "toys",
    "vacuum",
    "posters",
    "potted plant",
    "chair",
    "plants",
    "coat rack",
    "door mat",
    "flowers",
    "phone",
    "vase",
    "couch",
    "throw pillow",
    "coffee table",
    "tv",
    "bed",
    "wardrobe",
    "lamp",
    "mini fridge",
    "kitchen cart",
    "toaster",
    "microwave",
    "dishes",
    "plates",
    "bowls",
    "table",
    "pitcher",
    "towels",
    "toothbrushes",
    "basket",
    "laundry basket",
    "desk",
    "bookcase",
    "computer",
    "organizational tools",
    "pencil holders",
    "play-doh",
    "pet food",
    "water",
    "newspapers",
    "fish",
    "bright paint",
    "vegetables",
    "deck chair",
    "bird feeder",
    "washing line",
    "garden toys",
    "hula hoop"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.0185185185,
    "f1":0.0357142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.0185185185,
    "f1":0.0357142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}