{
  "title":"How to Make a Towel Chicken",
  "url":"https://www.wikihow.com/Make-a-Towel-Chicken",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "steps":[
    {
      "headline":"Lay the towel in a landscape format and roll the left and right ends to the middle",
      "description":""
    },
    {
      "headline":"Fold the towel in half with the rolls facing out",
      "description":""
    },
    {
      "headline":"Pull the center of the rolled ends out slightly so that the corners of the towel are exposed",
      "description":""
    },
    {
      "headline":"Pinch the ends of two corners opposite each other (opposite ends of the towel in step one).",
      "description":""
    },
    {
      "headline":"Pinch the other two ends as well",
      "description":""
    },
    {
      "headline":"Pull apart, and you're finished!",
      "description":""
    }
  ],
  "text":" Lay the towel in a landscape format and roll the left and right ends to the middle  Fold the towel in half with the rolls facing out  Pull the center of the rolled ends out slightly so that the corners of the towel are exposed  Pinch the ends of two corners opposite each other (opposite ends of the towel in step one).  Pinch the other two ends as well  Pull apart, and you're finished! ",
  "sentences":[
    " Lay the towel in a landscape format and roll the left and right ends to the middle  Fold the towel in half with the rolls facing out  Pull the center of the rolled ends out slightly so that the corners of the towel are exposed  Pinch the ends of two corners opposite each other (opposite ends of the towel in step one).",
    "Pinch the other two ends as well  Pull apart, and you're finished!"
  ],
  "tyn_section":[
    "A towel"
  ],
  "tyn_model":[
    "towel"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":1.0,
    "f1":1.0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":1.0,
    "f1":1.0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}