{
  "title":"How to Create a Paper Helicopter",
  "url":"https://www.wikihow.com/Create-a-Paper-Helicopter",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft"
  ],
  "parts":[
    {
      "name":"Making a Paper Helicopter",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"You will need a piece of paper, a paper clip, and some scissors. Large index cards, usually 5 inches by 7 inches, work really well for this project. Use one if you already have some at home."
        },
        {
          "headline":"Cut your piece of paper to size.",
          "description":"It should be a rectangle approximately 2 1/2 inches wide and 7 inches long. These measurements do not need to be totally exact, so don't worry if you are a little bit off. What matters is that the paper is much longer than it is wide."
        },
        {
          "headline":"Draw the design for your helicopter on the paper, if you like.",
          "description":"Draw a line down the middle of the paper lengthwise and a line down the middle of the paper widthwise. These lines will guide the cuts and folds required to make your helicopter. This is not totally necessary but may help you to make a good helicopter."
        },
        {
          "headline":"Fold your paper in half lengthwise.",
          "description":"Once you have creased it, unfold the paper and lay it flat."
        },
        {
          "headline":"Cut a little less than halfway down the crease that you folded down the length of your paper.",
          "description":"This will create two flaps that will eventually become the wings of your helicopter. If you drew the guide lines on your paper, be sure to stop cutting at least a half an inch before you get to the middle line. This will assure that you do not accidentally cut too far."
        },
        {
          "headline":"Make two small cuts in toward the center line halfway down the length of the paper.",
          "description":"These cuts should be positioned about half an inch below where your first cut ends. The cuts will be at opposite sides on the length of the paper but will not reach each other. Be careful that they don't connect, as you don't want to cut all the way through the paper. Once again, the guide lines you might have drawn on your paper may help you. When cutting these horizontal cuts, be sure not to cut so far that you reach the middle line. It's best to only cut halfway to the middle line on both sides you are cutting. This will assure that the bottom of your helicopter doesn't get cut off!"
        },
        {
          "headline":"Fold both of the bottom sections.",
          "description":"The whole area directly below the horizontal cuts you just made in towards the center line should be folded in towards the center. Once you have folded the flaps in, you will then refold the center crease that runs the length of the paper that you made earlier. These folds will form the bottom of your helicopter, eventually being held flat by the paper clip."
        },
        {
          "headline":"Fold the top flaps you made when you cut your paper almost halfway down lengthwise.",
          "description":"They should both be folded down but in opposite directions, so that there is one flap on either side of the paper. Once you have folded and creased them, open these flaps up halfway. They have now formed the wings of your helicopter."
        },
        {
          "headline":"Add a paperclip on the very bottom of the helicopter.",
          "description":"It is there to hold the bottom flaps closed and to add a little weight to the helicopter. You're done making your helicopter!"
        },
        {
          "headline":"Drop your helicopter from a variety of heights.",
          "description":"It should spin gracefully to the ground. Experiment by dropping it from different heights. See if the way it flies changes. Use various sizes of paperclips, see which works best. You can also cut the wings, so they are thinner or thicker, to get the best flight."
        }
      ]
    },
    {
      "name":"Making a Really Simple Small Paper Helicopter",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"You will only need one 5 inch by 7 inch index card and one paper clip."
        },
        {
          "headline":"Fold your index card in half lengthwise.",
          "description":"Crease the fold with your finger or the edge of your paperclip. Then fold it in half lengthwise again, remembering to crease this fold as well. The width of your index card will now be one quarter what it was to begin with."
        },
        {
          "headline":"Fold your paper in half the opposite way as the previous folds.",
          "description":"In essence you will be folding the length of the index card in half. Make sure to really crease the fold well."
        },
        {
          "headline":"Fold each of the loose ends down one inch.",
          "description":"You will be folding the ends of the long dimension of your original index card. Fold one side first and then flip the paper over so you can fold the other side. Once both sides are folded, open them both up halfway. These folds have now formed the wings of your helicopter."
        },
        {
          "headline":"Attach the paperclip to the bottom of your helicopter.",
          "description":"It should go over where you folded the length of your index card in half. Just slip it securely on the end. The paper clip is attached in order to give your helicopter a little weight."
        },
        {
          "headline":"Drop your helicopter from at least a few feet off the ground.",
          "description":"It should gracefully spin to the ground, just like a helicopter"
        }
      ]
    }
  ],
  "text":" Making a Paper Helicopter Gather your materials. You will need a piece of paper, a paper clip, and some scissors. Large index cards, usually 5 inches by 7 inches, work really well for this project. Use one if you already have some at home. Cut your piece of paper to size. It should be a rectangle approximately 2 1/2 inches wide and 7 inches long. These measurements do not need to be totally exact, so don't worry if you are a little bit off. What matters is that the paper is much longer than it is wide. Draw the design for your helicopter on the paper, if you like. Draw a line down the middle of the paper lengthwise and a line down the middle of the paper widthwise. These lines will guide the cuts and folds required to make your helicopter. This is not totally necessary but may help you to make a good helicopter. Fold your paper in half lengthwise. Once you have creased it, unfold the paper and lay it flat. Cut a little less than halfway down the crease that you folded down the length of your paper. This will create two flaps that will eventually become the wings of your helicopter. If you drew the guide lines on your paper, be sure to stop cutting at least a half an inch before you get to the middle line. This will assure that you do not accidentally cut too far. Make two small cuts in toward the center line halfway down the length of the paper. These cuts should be positioned about half an inch below where your first cut ends. The cuts will be at opposite sides on the length of the paper but will not reach each other. Be careful that they don't connect, as you don't want to cut all the way through the paper. Once again, the guide lines you might have drawn on your paper may help you. When cutting these horizontal cuts, be sure not to cut so far that you reach the middle line. It's best to only cut halfway to the middle line on both sides you are cutting. This will assure that the bottom of your helicopter doesn't get cut off! Fold both of the bottom sections. The whole area directly below the horizontal cuts you just made in towards the center line should be folded in towards the center. Once you have folded the flaps in, you will then refold the center crease that runs the length of the paper that you made earlier. These folds will form the bottom of your helicopter, eventually being held flat by the paper clip. Fold the top flaps you made when you cut your paper almost halfway down lengthwise. They should both be folded down but in opposite directions, so that there is one flap on either side of the paper. Once you have folded and creased them, open these flaps up halfway. They have now formed the wings of your helicopter. Add a paperclip on the very bottom of the helicopter. It is there to hold the bottom flaps closed and to add a little weight to the helicopter. You're done making your helicopter! Drop your helicopter from a variety of heights. It should spin gracefully to the ground. Experiment by dropping it from different heights. See if the way it flies changes. Use various sizes of paperclips, see which works best. You can also cut the wings, so they are thinner or thicker, to get the best flight. Making a Really Simple Small Paper Helicopter Gather your materials. You will only need one 5 inch by 7 inch index card and one paper clip. Fold your index card in half lengthwise. Crease the fold with your finger or the edge of your paperclip. Then fold it in half lengthwise again, remembering to crease this fold as well. The width of your index card will now be one quarter what it was to begin with. Fold your paper in half the opposite way as the previous folds. In essence you will be folding the length of the index card in half. Make sure to really crease the fold well. Fold each of the loose ends down one inch. You will be folding the ends of the long dimension of your original index card. Fold one side first and then flip the paper over so you can fold the other side. Once both sides are folded, open them both up halfway. These folds have now formed the wings of your helicopter. Attach the paperclip to the bottom of your helicopter. It should go over where you folded the length of your index card in half. Just slip it securely on the end. The paper clip is attached in order to give your helicopter a little weight. Drop your helicopter from at least a few feet off the ground. It should gracefully spin to the ground, just like a helicopter",
  "sentences":[
    " Making a Paper Helicopter Gather your materials.",
    "You will need a piece of paper, a paper clip, and some scissors.",
    "Large index cards, usually 5 inches by 7 inches, work really well for this project.",
    "Use one if you already have some at home.",
    "Cut your piece of paper to size.",
    "It should be a rectangle approximately 2 1/2 inches wide and 7 inches long.",
    "These measurements do not need to be totally exact, so don't worry if you are a little bit off.",
    "What matters is that the paper is much longer than it is wide.",
    "Draw the design for your helicopter on the paper, if you like.",
    "Draw a line down the middle of the paper lengthwise and a line down the middle of the paper widthwise.",
    "These lines will guide the cuts and folds required to make your helicopter.",
    "This is not totally necessary but may help you to make a good helicopter.",
    "Fold your paper in half lengthwise.",
    "Once you have creased it, unfold the paper and lay it flat.",
    "Cut a little less than halfway down the crease that you folded down the length of your paper.",
    "This will create two flaps that will eventually become the wings of your helicopter.",
    "If you drew the guide lines on your paper, be sure to stop cutting at least a half an inch before you get to the middle line.",
    "This will assure that you do not accidentally cut too far.",
    "Make two small cuts in toward the center line halfway down the length of the paper.",
    "These cuts should be positioned about half an inch below where your first cut ends.",
    "The cuts will be at opposite sides on the length of the paper but will not reach each other.",
    "Be careful that they don't connect, as you don't want to cut all the way through the paper.",
    "Once again, the guide lines you might have drawn on your paper may help you.",
    "When cutting these horizontal cuts, be sure not to cut so far that you reach the middle line.",
    "It's best to only cut halfway to the middle line on both sides you are cutting.",
    "This will assure that the bottom of your helicopter doesn't get cut off!",
    "Fold both of the bottom sections.",
    "The whole area directly below the horizontal cuts you just made in towards the center line should be folded in towards the center.",
    "Once you have folded the flaps in, you will then refold the center crease that runs the length of the paper that you made earlier.",
    "These folds will form the bottom of your helicopter, eventually being held flat by the paper clip.",
    "Fold the top flaps you made when you cut your paper almost halfway down lengthwise.",
    "They should both be folded down but in opposite directions, so that there is one flap on either side of the paper.",
    "Once you have folded and creased them, open these flaps up halfway.",
    "They have now formed the wings of your helicopter.",
    "Add a paperclip on the very bottom of the helicopter.",
    "It is there to hold the bottom flaps closed and to add a little weight to the helicopter.",
    "You're done making your helicopter!",
    "Drop your helicopter from a variety of heights.",
    "It should spin gracefully to the ground.",
    "Experiment by dropping it from different heights.",
    "See if the way it flies changes.",
    "Use various sizes of paperclips, see which works best.",
    "You can also cut the wings, so they are thinner or thicker, to get the best flight.",
    "Making a Really Simple Small Paper Helicopter Gather your materials.",
    "You will only need one 5 inch by 7 inch index card and one paper clip.",
    "Fold your index card in half lengthwise.",
    "Crease the fold with your finger or the edge of your paperclip.",
    "Then fold it in half lengthwise again, remembering to crease this fold as well.",
    "The width of your index card will now be one quarter what it was to begin with.",
    "Fold your paper in half the opposite way as the previous folds.",
    "In essence you will be folding the length of the index card in half.",
    "Make sure to really crease the fold well.",
    "Fold each of the loose ends down one inch.",
    "You will be folding the ends of the long dimension of your original index card.",
    "Fold one side first and then flip the paper over so you can fold the other side.",
    "Once both sides are folded, open them both up halfway.",
    "These folds have now formed the wings of your helicopter.",
    "Attach the paperclip to the bottom of your helicopter.",
    "It should go over where you folded the length of your index card in half.",
    "Just slip it securely on the end.",
    "The paper clip is attached in order to give your helicopter a little weight.",
    "Drop your helicopter from at least a few feet off the ground.",
    "It should gracefully spin to the ground, just like a helicopter"
  ],
  "tyn_section":[
    "Pair of scissors",
    "Piece or paper or an index card",
    "Paper clip"
  ],
  "tyn_model":[
    "paper",
    "helicopter",
    "paperclip",
    "paper clip",
    "scissors",
    "index cards",
    "paperclips",
    "index card"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.125,
    "f1":0.1818181818,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.25,
    "f1":0.2857142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.5,
    "f1":0.6666666667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.125,
    "f1":0.1818181818
  }
}