{
  "title":"How to Draw an Eagle",
  "url":"https://www.wikihow.com/Draw-an-Eagle",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "methods":[
    {
      "name":"An Eagle Sitting on a Branch",
      "steps":[
        {
          "headline":"Make an outline for the head and the body of the eagle.",
          "description":"Draw a circle for the head, an upright quadrilateral for the neck and a big oblong for the body. As for the beak, attach a smaller quadrilateral on the head and a slanted triangle."
        },
        {
          "headline":"Draw an outline of a branch below the oblong.",
          "description":""
        },
        {
          "headline":"Attach two smaller oblongs on the branch.",
          "description":"They will serve as the eagle’s feet. Add a rectangle below the body to make the tail."
        },
        {
          "headline":"Draw details on the head, like the eyes and feathers.",
          "description":""
        },
        {
          "headline":"Sketch the wings on the body of the eagle delicately.",
          "description":""
        },
        {
          "headline":"Add claws to the eagle’s feet.",
          "description":""
        },
        {
          "headline":"Draw feathers on the tail.",
          "description":""
        },
        {
          "headline":"Erase unnecessary lines and color as desired.",
          "description":""
        }
      ]
    },
    {
      "name":"A Flying Eagle",
      "steps":[
        {
          "headline":"Draw the body of the eagle.",
          "description":"Make a small circle for the head and attach an oblong to the circle to serve as the body. Insert a pentagon in between the two shapes. Add a small quadrilateral and a little triangle to the head to represent the beak."
        },
        {
          "headline":"Draw two slanted shapes on each side of the body for the wings.",
          "description":""
        },
        {
          "headline":"Add more detailed shapes on each of the wings to make them more elaborate.",
          "description":""
        },
        {
          "headline":"Draw three quadrilaterals, one slightly bigger than the other two.",
          "description":"Add two small circles for the feet."
        },
        {
          "headline":"Add details to the head, like eyes and feathers.",
          "description":"The feathers can be outlined using zigzag lines."
        },
        {
          "headline":"Add details to the wings.",
          "description":"This time make softer curved lines instead of zigzag lines for the feathers."
        },
        {
          "headline":"Add more feathers to the wings.",
          "description":""
        },
        {
          "headline":"Sketch feathers to the body and tail.",
          "description":""
        },
        {
          "headline":"Add claws to the feet.",
          "description":""
        },
        {
          "headline":"Erase unnecessary lines and colour as desired.",
          "description":""
        }
      ]
    },
    {
      "name":"A Cartoon Eagle",
      "steps":[
        {
          "headline":"Draw a circle-oval for the head.",
          "description":""
        },
        {
          "headline":"Draw an inverted triangle and a small circle beside it for the beak.",
          "description":"Then, add an oval-shaped body."
        },
        {
          "headline":"Draw a large oval with the top wider than the bottom for the body.",
          "description":"Then, draw two small ovals below it for the legs."
        },
        {
          "headline":"Draw two curves connecting the head to the body.",
          "description":""
        },
        {
          "headline":"Draw a triangle for the right wing and a large trapezoid for the left wing.",
          "description":""
        },
        {
          "headline":"Draw a series of ovals for the feet.",
          "description":"Add pointed lines in the edges of the ovals to make the claws."
        },
        {
          "headline":"Draw an irregular diamond below the body for the tail.",
          "description":""
        },
        {
          "headline":"Based on the outlines, draw the head and beak along with the eyes.",
          "description":"Make pointed curves below the head to complete it."
        },
        {
          "headline":"Complete the body and feet based from the outlines, darken necessary outlines and draw details.",
          "description":""
        },
        {
          "headline":"Complete the wings and tail based on the outline.",
          "description":"Draw curves inside and on the edges of the wings and tail to simulate the feathers."
        },
        {
          "headline":"Delete the unnecessary outlines.",
          "description":""
        },
        {
          "headline":"Color your eagle!",
          "description":""
        }
      ]
    },
    {
      "name":"A Traditional Eagle",
      "steps":[
        {
          "headline":"Draw an oval to outline the body.",
          "description":""
        },
        {
          "headline":"Draw a circle for the head and draw two curves connecting the head and body.",
          "description":""
        },
        {
          "headline":"Draw an irregular rectangle in the right side of the head.",
          "description":""
        },
        {
          "headline":"Draw a two ovals for the legs and two circles for the feet.",
          "description":""
        },
        {
          "headline":"Draw two lines above the body for the wing outline and a trapezoid on the left part for the tail.",
          "description":""
        },
        {
          "headline":"Complete the wing outline by drawing curves from the edge of the wings connecting to the body.",
          "description":""
        },
        {
          "headline":"Complete the head, body, and feet based on the outlines, darken the necessary outlines and draw the details.",
          "description":""
        },
        {
          "headline":"Complete the wings and tail based  on the outlines.",
          "description":"Draw sharp curves in the edges to simulate the feathers."
        },
        {
          "headline":"Erase unnecessary outlines.",
          "description":""
        },
        {
          "headline":"Draw additional details.",
          "description":""
        },
        {
          "headline":"Color your eagle.",
          "description":""
        }
      ]
    }
  ],
  "text":" An Eagle Sitting on a Branch Make an outline for the head and the body of the eagle. Draw a circle for the head, an upright quadrilateral for the neck and a big oblong for the body. As for the beak, attach a smaller quadrilateral on the head and a slanted triangle. Draw an outline of a branch below the oblong.  Attach two smaller oblongs on the branch. They will serve as the eagle’s feet. Add a rectangle below the body to make the tail. Draw details on the head, like the eyes and feathers.  Sketch the wings on the body of the eagle delicately.  Add claws to the eagle’s feet.  Draw feathers on the tail.  Erase unnecessary lines and color as desired.  A Flying Eagle Draw the body of the eagle. Make a small circle for the head and attach an oblong to the circle to serve as the body. Insert a pentagon in between the two shapes. Add a small quadrilateral and a little triangle to the head to represent the beak. Draw two slanted shapes on each side of the body for the wings.  Add more detailed shapes on each of the wings to make them more elaborate.  Draw three quadrilaterals, one slightly bigger than the other two. Add two small circles for the feet. Add details to the head, like eyes and feathers. The feathers can be outlined using zigzag lines. Add details to the wings. This time make softer curved lines instead of zigzag lines for the feathers. Add more feathers to the wings.  Sketch feathers to the body and tail.  Add claws to the feet.  Erase unnecessary lines and colour as desired.  A Cartoon Eagle Draw a circle-oval for the head.  Draw an inverted triangle and a small circle beside it for the beak. Then, add an oval-shaped body. Draw a large oval with the top wider than the bottom for the body. Then, draw two small ovals below it for the legs. Draw two curves connecting the head to the body.  Draw a triangle for the right wing and a large trapezoid for the left wing.  Draw a series of ovals for the feet. Add pointed lines in the edges of the ovals to make the claws. Draw an irregular diamond below the body for the tail.  Based on the outlines, draw the head and beak along with the eyes. Make pointed curves below the head to complete it. Complete the body and feet based from the outlines, darken necessary outlines and draw details.  Complete the wings and tail based on the outline. Draw curves inside and on the edges of the wings and tail to simulate the feathers. Delete the unnecessary outlines.  Color your eagle!  A Traditional Eagle Draw an oval to outline the body.  Draw a circle for the head and draw two curves connecting the head and body.  Draw an irregular rectangle in the right side of the head.  Draw a two ovals for the legs and two circles for the feet.  Draw two lines above the body for the wing outline and a trapezoid on the left part for the tail.  Complete the wing outline by drawing curves from the edge of the wings connecting to the body.  Complete the head, body, and feet based on the outlines, darken the necessary outlines and draw the details.  Complete the wings and tail based  on the outlines. Draw sharp curves in the edges to simulate the feathers. Erase unnecessary outlines.  Draw additional details.  Color your eagle. ",
  "sentences":[
    " An Eagle Sitting on a Branch Make an outline for the head and the body of the eagle.",
    "Draw a circle for the head, an upright quadrilateral for the neck and a big oblong for the body.",
    "As for the beak, attach a smaller quadrilateral on the head and a slanted triangle.",
    "Draw an outline of a branch below the oblong.",
    "Attach two smaller oblongs on the branch.",
    "They will serve as the eagle’s feet.",
    "Add a rectangle below the body to make the tail.",
    "Draw details on the head, like the eyes and feathers.",
    "Sketch the wings on the body of the eagle delicately.",
    "Add claws to the eagle’s feet.",
    "Draw feathers on the tail.",
    "Erase unnecessary lines and color as desired.",
    "A Flying Eagle Draw the body of the eagle.",
    "Make a small circle for the head and attach an oblong to the circle to serve as the body.",
    "Insert a pentagon in between the two shapes.",
    "Add a small quadrilateral and a little triangle to the head to represent the beak.",
    "Draw two slanted shapes on each side of the body for the wings.",
    "Add more detailed shapes on each of the wings to make them more elaborate.",
    "Draw three quadrilaterals, one slightly bigger than the other two.",
    "Add two small circles for the feet.",
    "Add details to the head, like eyes and feathers.",
    "The feathers can be outlined using zigzag lines.",
    "Add details to the wings.",
    "This time make softer curved lines instead of zigzag lines for the feathers.",
    "Add more feathers to the wings.",
    "Sketch feathers to the body and tail.",
    "Add claws to the feet.",
    "Erase unnecessary lines and colour as desired.",
    "A Cartoon Eagle Draw a circle-oval for the head.",
    "Draw an inverted triangle and a small circle beside it for the beak.",
    "Then, add an oval-shaped body.",
    "Draw a large oval with the top wider than the bottom for the body.",
    "Then, draw two small ovals below it for the legs.",
    "Draw two curves connecting the head to the body.",
    "Draw a triangle for the right wing and a large trapezoid for the left wing.",
    "Draw a series of ovals for the feet.",
    "Add pointed lines in the edges of the ovals to make the claws.",
    "Draw an irregular diamond below the body for the tail.",
    "Based on the outlines, draw the head and beak along with the eyes.",
    "Make pointed curves below the head to complete it.",
    "Complete the body and feet based from the outlines, darken necessary outlines and draw details.",
    "Complete the wings and tail based on the outline.",
    "Draw curves inside and on the edges of the wings and tail to simulate the feathers.",
    "Delete the unnecessary outlines.",
    "Color your eagle!",
    "A Traditional Eagle Draw an oval to outline the body.",
    "Draw a circle for the head and draw two curves connecting the head and body.",
    "Draw an irregular rectangle in the right side of the head.",
    "Draw a two ovals for the legs and two circles for the feet.",
    "Draw two lines above the body for the wing outline and a trapezoid on the left part for the tail.",
    "Complete the wing outline by drawing curves from the edge of the wings connecting to the body.",
    "Complete the head, body, and feet based on the outlines, darken the necessary outlines and draw the details.",
    "Complete the wings and tail based  on the outlines.",
    "Draw sharp curves in the edges to simulate the feathers.",
    "Erase unnecessary outlines.",
    "Draw additional details.",
    "Color your eagle."
  ],
  "tyn_section":[
    "Paper or canvas",
    "Pencil sharpener",
    "Good eraser",
    "Pencils & colored pencils, crayons, markers or watercolors"
  ],
  "tyn_model":[
    "eagle",
    "feathers",
    "branch",
    "claws",
    "flying eagle",
    "oblong"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}