{
  "title":"How to Get Rid of Fruit Flies",
  "url":"https://www.wikihow.com/Get-Rid-of-Fruit-Flies",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Fly Control"
  ],
  "methods":[
    {
      "name":"Trapping Fruit Flies with a Paper Funnel",
      "steps":[
        {
          "headline":"Choose a tall jar, wine bottle, old soda bottle or vase to serve as the base of the trap.",
          "description":"Almost any jar will work in a pinch. This method is probably the most effective, efficient way to trap a larger number of fruit flies."
        },
        {
          "headline":"Add fruit fly bait.",
          "description":"Fruit flies feed on anything sugary, so you have a lot of options at your disposal. Any type of fruit, juice, soda, or other sweet item will provide a great incentive for fruit flies to fly into your trap. Try one of these bait ideas ranked from most to least effective:\nChopped up pieces of over ripe or rotting fruit. For example, a few slices of bruised banana, a soft strawberry or squishy peach will work great. Honey, maple syrup or corn syrup. Any flavor of fruit juice or soda. Make sure to use the regular kind; diet soda won't work. Apple cider vinegar or soy sauce. The dregs from a wine or beer bottle can work in a pinch. Fruit flies are attracted to the sugars in alcoholic beverages."
        },
        {
          "headline":"Roll a piece of paper to create a funnel and put it on the container.",
          "description":"A funnel with a small hole will allow the flies to enter the jar, but they won't be smart enough to fly back out. Tape the funnel so that it keeps its shape. Rest the funnel inside the mouth of the container so that the narrow side is pointing down. The tip of the funnel should not touch the bait. Any piece of scrap paper or a page ripped from a magazine can easily be made into a paper funnel. You can also make a funnel by using a toothpick to poke a hole in the bottom of a coffee filter."
        },
        {
          "headline":"Set the trap in a fruit fly-infested area.",
          "description":"Put it near the kitchen sink, the garbage can, or the fruit bowl. If you're dealing with fruit flies in multiple parts of the kitchen, you might want to make more traps to set out. Leave the traps out overnight. By the next day, you should see fruit flies happily eating the bait. If you didn't trap any flies, try new bait and make sure the hole is big enough to let the flies into the trap."
        },
        {
          "headline":"Kill the trapped fruit flies.",
          "description":"Pour a mixture of warm water and dish soap into the container. The soap works to reduce the surface tension of the water and cause the flies to drown. Wait a minute or two, then discard the contents of the jar. If the trap is still buzzing with fruit flies, take the trap outside before removing the funnel. Rinse the jar thoroughly with hot water when you're finished. You can reuse it to make a new trap."
        },
        {
          "headline":"Repeat until the trap remains empty.",
          "description":"Fruit flies tend to multiply quickly. Their life cycle can be as short as eight days. It's likely that you'll have to repeat the trapping process several times to fully rid your kitchen of adult fruit flies. Fruit fly eggs hatch eight to ten days after they are laid, so you may need to use the trapping process every day for a week or two. You can stop when you no longer see flies in your trap after leaving it out for several hours. To fully rid your kitchen of fruit flies as fast as possible, take measures to get rid of the eggs, too. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKevin Carrillo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMMPC, Pest Control Specialist\t\t\t\t\t\t\t\tKevin Carrillo is a Pest Control Specialist and the Senior Project Manager for MMPC, a pest control service and certified Minority-owned Business Enterprise (MBE) based in the New York City area. MMPC is certified by the industry’s leading codes and practices, including the National Pest Management Association (NPMA), QualityPro, GreenPro, and The New York Pest Management Association (NYPMA). MMPC's work has been featured in CNN, NPR, and ABC News. Kevin Carrillo\t\t\tMMPC, Pest Control Specialist\t\t\t\tHow do fruit flies enter my home? Fruit flies typically enter your house on the produce you buy. The fruit you bring inside, especially tropical fruit, usually has fruit fly eggs already on it. To prevent the eggs from hatching, scrub your fruit under running water with a brush to destroy the eggs. Or, you can keep the fruit in your fridge."
        }
      ]
    },
    {
      "name":"Trapping Fruit Flies with Bowl Traps",
      "steps":[
        {
          "headline":"Start by getting a large or medium bowl.",
          "description":"Although not quite as effective as the paper funnel method, this method utilizes the same approach: lure the fruit flies into the trap with a small opening and make it hard for them to exit."
        },
        {
          "headline":"Add sweet bait to the bottom of a medium or large bowl.",
          "description":"The type of bait doesn't matter as much as the quantity; you probably want at least an inch of sweet liquid covering the bottom of the bowl. Here are some suggestions for sweet concoctions that work well as bait:\nPut a piece of old, skinless fruit, such as an orange or a banana, along with some balsamic vinegar in a bowl. Experiment with a mix of white wine and coriander seeds. This mixture seems to work well. Add a bit of white wine vinegar to make the concoction even more pungent. A mix of honey, sugar, and balsamic vinegar also works in a pinch."
        },
        {
          "headline":"Cover the bowl tightly with plastic wrap.",
          "description":"Use a large sheet of plastic wrap to completely cover the bowl. Try to get the plastic wrap as taught as possible."
        },
        {
          "headline":"Poke numerous small holes in the plastic with a fork or another implement.",
          "description":"Try to keep the holes as small as possible; large holes can let the flies escape back out again. The point is to lure the fruit flies into the bowl and make it extremely hard to get back out. If using a fork makes the holes in the plastic wrap too big, try switching to a sharp toothpick in order to prick small holes in the plastic wrap."
        },
        {
          "headline":"Set the trap in a fruit fly-infested area and leave the trap out overnight.",
          "description":"Come the next day, you should see fruit flies caught inside the plastic wrap, happily feasting on the bait. If you haven't managed to trap any flies, check to make sure the holes in your plastic wrap aren't too big."
        },
        {
          "headline":"Dispose of the trapped fruit flies.",
          "description":"It's probably best to take the trap outside before killing the fruit flies so that any escapees don't reinfest your kitchen. Take off the plastic wrap and kill the fruit flies inside by pouring a mixture of warm water and dish soap into the container. The soap works to reduce the surface tension of the water and cause the flies to drown. Wait a minute or two, then discard the contents of the jar. When you're finished flushing the fruit flies, rinse the jar with hot water and reuse it to make a new trap."
        }
      ]
    },
    {
      "name":"Trapping and Freezing Fruit Flies",
      "steps":[
        {
          "headline":"Get two glass jars.",
          "description":"Smaller jars are easier to deal with than larger jars."
        },
        {
          "headline":"Put some fruit scraps, such as rinds or peels, into each jar as bait.",
          "description":""
        },
        {
          "headline":"Discard the jar lids.",
          "description":"Secure the jar openings instead with clear stretchy plastic wrap."
        },
        {
          "headline":"Press down in the middle of the plastic wrap with your fingertip.",
          "description":"Make a dent or funnel shape in the plastic going down into the jars."
        },
        {
          "headline":"Poke a roughly 1 mm hole into the center of the dents.",
          "description":"It seems like one tiny hole would not be enough to trap all your flies. It actually is."
        },
        {
          "headline":"Wait for flies to be trapped.",
          "description":"When you notice flies in one jar, put it in the freezer to kill them and their eggs. When you notice flies in the other jar, put it in the freezer and set out the one that has been in the freezer for a while. Just keep rotating the two jars in and out of your freezer. You never have to deal with cleaning the trap out outside or trying to kill the flies with vinegar!"
        }
      ]
    },
    {
      "name":"Killing Them With Sprays and Other Products",
      "steps":[
        {
          "headline":"Make fruit fly spray.",
          "description":"Fill a fine misting spray bottle with 70% rubbing alcohol. Spray it on the hovering fruit flies. They'll fall to the floor and you can sweep them up and dispose of them. You can also spray 91% rubbing alcohol in the air and to saturate any eggs. This stronger alcohol kills them immediately and serves as a very effective disinfectant. The stronger alcohol option can cost as much as .50-$1.00 more per container. It is much more powerful than traditional 70% rubbing alcohol . One should take precautionary measures such as ventilating the area and wearing gloves. 91% rubbing alcohol is far less poisonous, caustic, or dangerous than an insecticide or pesticide. Windex is another instant killer of most small bugs. If you find a patch of fruit flies in an area you are willing to get wet, give them a few quick sprays of Windex and watch them suffer. Another spray method is to use Clorox cleaning spray. Wipe down surfaces and dead flies afterwards. However, you'll need to ventilate the room you're spraying because the smell can be somewhat overwhelming; not recommended if you're worried about toxic indoor air or you're spraying near food preparation surfaces. You can even use a fine mist bottle to spray mobs of flies with plain water; they will drop to the surface below. Because their wings are damp, they will be momentarily unable to fly, so you can easily squash them and clean them up."
        },
        {
          "headline":"Use pyrethrin spray.",
          "description":"Pyrethrin is an insecticide that effectively kills adult fruit flies, but not their eggs. Be sure to use it according to the instructions. Avoid directly spraying it over fruit or in food preparation areas. This product comes in an aerosol can that can be used to spray fruit flies as you see them. It kills them on contact. You can buy an automatic pyrethrin dispenser to deal with high volumes of fruit flies in one area."
        },
        {
          "headline":"Treat your drain with gel.",
          "description":"There are several drain gels on the market that are formulated to fruit flies and eggs infesting kitchen drains. If boiling water and soap don't do the trick, consider trying a gel. Follow the manufacturer's instructions for treating your drain. You may have to repeat more than once to completely get rid of the flies."
        },
        {
          "headline":"Try a professional-grade treatment.",
          "description":"If you have a fruit fly infestation that you can't get under control, you can have your home treated with a residual insecticide that you spray where fruit flies tend to land and congregate. If you properly store produce and keep your kitchen clean, this measure is not usually necessary. Call a pest control company for further information if you want to have your home sprayed for fruit flies."
        }
      ]
    },
    {
      "name":"Getting Rid of the Eggs",
      "steps":[
        {
          "headline":"Figure out where they're breeding.",
          "description":"Fruit flies lay their eggs places that provide food and moisture, such as rotting fruit and dank sinks or garbage cans. To get rid of the eggs, you'll need to figure out where the flies' food sources are in your kitchen. Bowls or bags of aging fruit are an obvious culprit. Even if your fruit is brand new, the container you're storing it in might have residue from old produce that's still attracting fruit flies. If you keep compost in your kitchen, that may be a food source for fruit flies. An open bag of recyclables can be attractive to fruit flies, especially if it contains un-rinsed beer or soda cans. When did you last wash your garbage can? Even if you take out the trash frequently, the receptacle itself could be the source of the problem. Kitchen sink drains often harbor fruit flies, since food bits can get trapped in there and start to rot. Damp sponges and mops can also be breeding grounds for fruit flies."
        },
        {
          "headline":"Store your produce carefully.",
          "description":"When you have a fruit fly problem, don't leave fruit exposed at room temperature in your kitchen. Store it in a closed brown bag or keep it in the refrigerator until you've taken care of the fruit flies. One piece of overripe fruit can perpetuate the infestation by providing a great place for fruit flies to breed. Don't throw fruit scraps in the trash. Unless you take your trash out daily, avoid throwing peach pits, apple cores and other fruit scraps in the trash in your kitchen, since they'll end up as breeding grounds for fruit flies. Take scraps directly outside to a compost pile or outdoor bin."
        },
        {
          "headline":"Wash your waste receptacles.",
          "description":"Your trash can, recycling bin, and compost bin could be harboring fruit fly eggs. Any waste receptacle you keep indoors should be cleaned with hot, soapy water as soon as you notice the infestation. Take out your trash, recycling or compost often to prevent the problem from recurring. Continue washing the containers every week or so, especially during the late summer months when fruit fly populations are high. Rinse bottles and other containers with hot water before you throw them in the bin. Residue from these items can spill on your trash receptacles and make the fruit fly problem worse. You should also make sure all of your waste receptacles have tight-fitting lids."
        },
        {
          "headline":"Clean your drain.",
          "description":"You can check to see if your drain is a fruit fly breeding ground by covering it with a piece of plastic wrap spread with a thin layer of honey. Place it over the drain honey-side down, then come back in an hour or so. If you see fruit flies stuck to the honey, your drain is part of the problem. Make sure your drain is operating properly. If it's backed up, or if your garbage disposal isn't working, you might have bits of rotting fruit attracting flies down there. To kill eggs, pour a pot of boiling soapy water down the drain. Use a brush to scrub around the sides of the drain. Don't pour bleach down your drain. It doesn't work, and it's harmful to the environment."
        },
        {
          "headline":"Throw out other potential breeding sources.",
          "description":"Old sponges, damp mops, old rags, and any other items you use to wipe your counters and floors might contain fruit fly eggs. Throw them away or wash them using the hot cycle on your washing machine."
        },
        {
          "headline":"Wipe down the surfaces in your kitchen.",
          "description":"Use hot, soapy water to clean your countertops. Make sure you get all the cracks and crevices where fruit flies might like to congregate. Clean your cabinets, pantry, and any other places where you've stored fruit, juices, or other sugary items. Check the floor, too. If a drink got spilled under the refrigerator, for instance, that might be part of the problem. Clean any areas that feel sticky. Keep kitchen surfaces clean every day. Make sure everything is wiped down as part of your cleanup after each meal. Wash all dishes after use. Avoid leaving dishes just sitting around dirty (if you have a dishwasher, pop them in there and shut the door to await a wash)."
        }
      ]
    },
    {
      "name":"Keeping Fruit Flies From Returning",
      "steps":[
        {
          "headline":"Inspect fruit that you bring into your kitchen.",
          "description":"Pick through berries, cherries, and other fruits that you bring inside. Any damaged fruit should be discarded outdoors, since you could bring fruit fly eggs in from the grocery store or farmer's market. Wash your fresh fruit carefully with water and dry it completely before storing."
        },
        {
          "headline":"Keep a maintenance trap near your fruit bowl.",
          "description":"Any small container with a teaspoon of cider vinegar, 2 tablespoons of water, and a drop of two of dish soap will attract and drown fruit flies. This will help keep the population down. Rinse out the bowl and fill it with fresh mixture every day during fruit fly season."
        },
        {
          "headline":"Use screens to cover your doors and windows.",
          "description":"Fruit flies enjoy outdoor food sources as well. Covering entrances to your home with screens will help prevent them from coming into your kitchen. This is especially important if you have fruit trees in your yard."
        },
        {
          "headline":"Deal with outdoor fruit fly attractants.",
          "description":"If you have fruit trees, pick fruit when it's ready rather than leaving it to rot on the branch or beneath the tree. Pick up or rake away a glut of fruit that has fallen to the ground beneath the tree, to discourage fruit fly infestation. You can also slip an exclusion bag over the branches of the tree that are fruiting. The bag should allow light to continue to reach the fruit and air to circulate without allowing the fruit flies access to the fruit. Such bags can usually be obtained from places that supply organic growers. Purchase organic fruit fly sprays from a garden center or organic growing supplier. Such sprays will need to be reapplied regularly, due to their organic nature but this is the best non-toxic approach to growing healthy fruit."
        },
        {
          "headline":"Deter fruit flies with essential oils.",
          "description":"Fruit flies are deterred by the smell of certain essential oils that are pleasing to humans. The oils won't kill the flies, but they will keep flies from accumulating. Fill a spray bottle with a cup of water and five to ten drops of lemongrass, eucalyptus or peppermint essential oil. Spritz areas of the kitchen that tend to attract fruit flies, like near the sink and trash can."
        }
      ]
    }
  ],
  "text":" Trapping Fruit Flies with a Paper Funnel Choose a tall jar, wine bottle, old soda bottle or vase to serve as the base of the trap. Almost any jar will work in a pinch. This method is probably the most effective, efficient way to trap a larger number of fruit flies. Add fruit fly bait. Fruit flies feed on anything sugary, so you have a lot of options at your disposal. Any type of fruit, juice, soda, or other sweet item will provide a great incentive for fruit flies to fly into your trap. Try one of these bait ideas ranked from most to least effective:\nChopped up pieces of over ripe or rotting fruit. For example, a few slices of bruised banana, a soft strawberry or squishy peach will work great. Honey, maple syrup or corn syrup. Any flavor of fruit juice or soda. Make sure to use the regular kind; diet soda won't work. Apple cider vinegar or soy sauce. The dregs from a wine or beer bottle can work in a pinch. Fruit flies are attracted to the sugars in alcoholic beverages. Roll a piece of paper to create a funnel and put it on the container. A funnel with a small hole will allow the flies to enter the jar, but they won't be smart enough to fly back out. Tape the funnel so that it keeps its shape. Rest the funnel inside the mouth of the container so that the narrow side is pointing down. The tip of the funnel should not touch the bait. Any piece of scrap paper or a page ripped from a magazine can easily be made into a paper funnel. You can also make a funnel by using a toothpick to poke a hole in the bottom of a coffee filter. Set the trap in a fruit fly-infested area. Put it near the kitchen sink, the garbage can, or the fruit bowl. If you're dealing with fruit flies in multiple parts of the kitchen, you might want to make more traps to set out. Leave the traps out overnight. By the next day, you should see fruit flies happily eating the bait. If you didn't trap any flies, try new bait and make sure the hole is big enough to let the flies into the trap. Kill the trapped fruit flies. Pour a mixture of warm water and dish soap into the container. The soap works to reduce the surface tension of the water and cause the flies to drown. Wait a minute or two, then discard the contents of the jar. If the trap is still buzzing with fruit flies, take the trap outside before removing the funnel. Rinse the jar thoroughly with hot water when you're finished. You can reuse it to make a new trap. Repeat until the trap remains empty. Fruit flies tend to multiply quickly. Their life cycle can be as short as eight days. It's likely that you'll have to repeat the trapping process several times to fully rid your kitchen of adult fruit flies. Fruit fly eggs hatch eight to ten days after they are laid, so you may need to use the trapping process every day for a week or two. You can stop when you no longer see flies in your trap after leaving it out for several hours. To fully rid your kitchen of fruit flies as fast as possible, take measures to get rid of the eggs, too. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKevin Carrillo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMMPC, Pest Control Specialist\t\t\t\t\t\t\t\tKevin Carrillo is a Pest Control Specialist and the Senior Project Manager for MMPC, a pest control service and certified Minority-owned Business Enterprise (MBE) based in the New York City area. MMPC is certified by the industry’s leading codes and practices, including the National Pest Management Association (NPMA), QualityPro, GreenPro, and The New York Pest Management Association (NYPMA). MMPC's work has been featured in CNN, NPR, and ABC News. Kevin Carrillo\t\t\tMMPC, Pest Control Specialist\t\t\t\tHow do fruit flies enter my home? Fruit flies typically enter your house on the produce you buy. The fruit you bring inside, especially tropical fruit, usually has fruit fly eggs already on it. To prevent the eggs from hatching, scrub your fruit under running water with a brush to destroy the eggs. Or, you can keep the fruit in your fridge. Trapping Fruit Flies with Bowl Traps Start by getting a large or medium bowl. Although not quite as effective as the paper funnel method, this method utilizes the same approach: lure the fruit flies into the trap with a small opening and make it hard for them to exit. Add sweet bait to the bottom of a medium or large bowl. The type of bait doesn't matter as much as the quantity; you probably want at least an inch of sweet liquid covering the bottom of the bowl. Here are some suggestions for sweet concoctions that work well as bait:\nPut a piece of old, skinless fruit, such as an orange or a banana, along with some balsamic vinegar in a bowl. Experiment with a mix of white wine and coriander seeds. This mixture seems to work well. Add a bit of white wine vinegar to make the concoction even more pungent. A mix of honey, sugar, and balsamic vinegar also works in a pinch. Cover the bowl tightly with plastic wrap. Use a large sheet of plastic wrap to completely cover the bowl. Try to get the plastic wrap as taught as possible. Poke numerous small holes in the plastic with a fork or another implement. Try to keep the holes as small as possible; large holes can let the flies escape back out again. The point is to lure the fruit flies into the bowl and make it extremely hard to get back out. If using a fork makes the holes in the plastic wrap too big, try switching to a sharp toothpick in order to prick small holes in the plastic wrap. Set the trap in a fruit fly-infested area and leave the trap out overnight. Come the next day, you should see fruit flies caught inside the plastic wrap, happily feasting on the bait. If you haven't managed to trap any flies, check to make sure the holes in your plastic wrap aren't too big. Dispose of the trapped fruit flies. It's probably best to take the trap outside before killing the fruit flies so that any escapees don't reinfest your kitchen. Take off the plastic wrap and kill the fruit flies inside by pouring a mixture of warm water and dish soap into the container. The soap works to reduce the surface tension of the water and cause the flies to drown. Wait a minute or two, then discard the contents of the jar. When you're finished flushing the fruit flies, rinse the jar with hot water and reuse it to make a new trap. Trapping and Freezing Fruit Flies Get two glass jars. Smaller jars are easier to deal with than larger jars. Put some fruit scraps, such as rinds or peels, into each jar as bait.  Discard the jar lids. Secure the jar openings instead with clear stretchy plastic wrap. Press down in the middle of the plastic wrap with your fingertip. Make a dent or funnel shape in the plastic going down into the jars. Poke a roughly 1 mm hole into the center of the dents. It seems like one tiny hole would not be enough to trap all your flies. It actually is. Wait for flies to be trapped. When you notice flies in one jar, put it in the freezer to kill them and their eggs. When you notice flies in the other jar, put it in the freezer and set out the one that has been in the freezer for a while. Just keep rotating the two jars in and out of your freezer. You never have to deal with cleaning the trap out outside or trying to kill the flies with vinegar! Killing Them With Sprays and Other Products Make fruit fly spray. Fill a fine misting spray bottle with 70% rubbing alcohol. Spray it on the hovering fruit flies. They'll fall to the floor and you can sweep them up and dispose of them. You can also spray 91% rubbing alcohol in the air and to saturate any eggs. This stronger alcohol kills them immediately and serves as a very effective disinfectant. The stronger alcohol option can cost as much as .50-$1.00 more per container. It is much more powerful than traditional 70% rubbing alcohol . One should take precautionary measures such as ventilating the area and wearing gloves. 91% rubbing alcohol is far less poisonous, caustic, or dangerous than an insecticide or pesticide. Windex is another instant killer of most small bugs. If you find a patch of fruit flies in an area you are willing to get wet, give them a few quick sprays of Windex and watch them suffer. Another spray method is to use Clorox cleaning spray. Wipe down surfaces and dead flies afterwards. However, you'll need to ventilate the room you're spraying because the smell can be somewhat overwhelming; not recommended if you're worried about toxic indoor air or you're spraying near food preparation surfaces. You can even use a fine mist bottle to spray mobs of flies with plain water; they will drop to the surface below. Because their wings are damp, they will be momentarily unable to fly, so you can easily squash them and clean them up. Use pyrethrin spray. Pyrethrin is an insecticide that effectively kills adult fruit flies, but not their eggs. Be sure to use it according to the instructions. Avoid directly spraying it over fruit or in food preparation areas. This product comes in an aerosol can that can be used to spray fruit flies as you see them. It kills them on contact. You can buy an automatic pyrethrin dispenser to deal with high volumes of fruit flies in one area. Treat your drain with gel. There are several drain gels on the market that are formulated to fruit flies and eggs infesting kitchen drains. If boiling water and soap don't do the trick, consider trying a gel. Follow the manufacturer's instructions for treating your drain. You may have to repeat more than once to completely get rid of the flies. Try a professional-grade treatment. If you have a fruit fly infestation that you can't get under control, you can have your home treated with a residual insecticide that you spray where fruit flies tend to land and congregate. If you properly store produce and keep your kitchen clean, this measure is not usually necessary. Call a pest control company for further information if you want to have your home sprayed for fruit flies. Getting Rid of the Eggs Figure out where they're breeding. Fruit flies lay their eggs places that provide food and moisture, such as rotting fruit and dank sinks or garbage cans. To get rid of the eggs, you'll need to figure out where the flies' food sources are in your kitchen. Bowls or bags of aging fruit are an obvious culprit. Even if your fruit is brand new, the container you're storing it in might have residue from old produce that's still attracting fruit flies. If you keep compost in your kitchen, that may be a food source for fruit flies. An open bag of recyclables can be attractive to fruit flies, especially if it contains un-rinsed beer or soda cans. When did you last wash your garbage can? Even if you take out the trash frequently, the receptacle itself could be the source of the problem. Kitchen sink drains often harbor fruit flies, since food bits can get trapped in there and start to rot. Damp sponges and mops can also be breeding grounds for fruit flies. Store your produce carefully. When you have a fruit fly problem, don't leave fruit exposed at room temperature in your kitchen. Store it in a closed brown bag or keep it in the refrigerator until you've taken care of the fruit flies. One piece of overripe fruit can perpetuate the infestation by providing a great place for fruit flies to breed. Don't throw fruit scraps in the trash. Unless you take your trash out daily, avoid throwing peach pits, apple cores and other fruit scraps in the trash in your kitchen, since they'll end up as breeding grounds for fruit flies. Take scraps directly outside to a compost pile or outdoor bin. Wash your waste receptacles. Your trash can, recycling bin, and compost bin could be harboring fruit fly eggs. Any waste receptacle you keep indoors should be cleaned with hot, soapy water as soon as you notice the infestation. Take out your trash, recycling or compost often to prevent the problem from recurring. Continue washing the containers every week or so, especially during the late summer months when fruit fly populations are high. Rinse bottles and other containers with hot water before you throw them in the bin. Residue from these items can spill on your trash receptacles and make the fruit fly problem worse. You should also make sure all of your waste receptacles have tight-fitting lids. Clean your drain. You can check to see if your drain is a fruit fly breeding ground by covering it with a piece of plastic wrap spread with a thin layer of honey. Place it over the drain honey-side down, then come back in an hour or so. If you see fruit flies stuck to the honey, your drain is part of the problem. Make sure your drain is operating properly. If it's backed up, or if your garbage disposal isn't working, you might have bits of rotting fruit attracting flies down there. To kill eggs, pour a pot of boiling soapy water down the drain. Use a brush to scrub around the sides of the drain. Don't pour bleach down your drain. It doesn't work, and it's harmful to the environment. Throw out other potential breeding sources. Old sponges, damp mops, old rags, and any other items you use to wipe your counters and floors might contain fruit fly eggs. Throw them away or wash them using the hot cycle on your washing machine. Wipe down the surfaces in your kitchen. Use hot, soapy water to clean your countertops. Make sure you get all the cracks and crevices where fruit flies might like to congregate. Clean your cabinets, pantry, and any other places where you've stored fruit, juices, or other sugary items. Check the floor, too. If a drink got spilled under the refrigerator, for instance, that might be part of the problem. Clean any areas that feel sticky. Keep kitchen surfaces clean every day. Make sure everything is wiped down as part of your cleanup after each meal. Wash all dishes after use. Avoid leaving dishes just sitting around dirty (if you have a dishwasher, pop them in there and shut the door to await a wash). Keeping Fruit Flies From Returning Inspect fruit that you bring into your kitchen. Pick through berries, cherries, and other fruits that you bring inside. Any damaged fruit should be discarded outdoors, since you could bring fruit fly eggs in from the grocery store or farmer's market. Wash your fresh fruit carefully with water and dry it completely before storing. Keep a maintenance trap near your fruit bowl. Any small container with a teaspoon of cider vinegar, 2 tablespoons of water, and a drop of two of dish soap will attract and drown fruit flies. This will help keep the population down. Rinse out the bowl and fill it with fresh mixture every day during fruit fly season. Use screens to cover your doors and windows. Fruit flies enjoy outdoor food sources as well. Covering entrances to your home with screens will help prevent them from coming into your kitchen. This is especially important if you have fruit trees in your yard. Deal with outdoor fruit fly attractants. If you have fruit trees, pick fruit when it's ready rather than leaving it to rot on the branch or beneath the tree. Pick up or rake away a glut of fruit that has fallen to the ground beneath the tree, to discourage fruit fly infestation. You can also slip an exclusion bag over the branches of the tree that are fruiting. The bag should allow light to continue to reach the fruit and air to circulate without allowing the fruit flies access to the fruit. Such bags can usually be obtained from places that supply organic growers. Purchase organic fruit fly sprays from a garden center or organic growing supplier. Such sprays will need to be reapplied regularly, due to their organic nature but this is the best non-toxic approach to growing healthy fruit. Deter fruit flies with essential oils. Fruit flies are deterred by the smell of certain essential oils that are pleasing to humans. The oils won't kill the flies, but they will keep flies from accumulating. Fill a spray bottle with a cup of water and five to ten drops of lemongrass, eucalyptus or peppermint essential oil. Spritz areas of the kitchen that tend to attract fruit flies, like near the sink and trash can.",
  "sentences":[
    " Trapping Fruit Flies with a Paper Funnel Choose a tall jar, wine bottle, old soda bottle or vase to serve as the base of the trap.",
    "Almost any jar will work in a pinch.",
    "This method is probably the most effective, efficient way to trap a larger number of fruit flies.",
    "Add fruit fly bait.",
    "Fruit flies feed on anything sugary, so you have a lot of options at your disposal.",
    "Any type of fruit, juice, soda, or other sweet item will provide a great incentive for fruit flies to fly into your trap.",
    "Try one of these bait ideas ranked from most to least effective:\nChopped up pieces of over ripe or rotting fruit.",
    "For example, a few slices of bruised banana, a soft strawberry or squishy peach will work great.",
    "Honey, maple syrup or corn syrup.",
    "Any flavor of fruit juice or soda.",
    "Make sure to use the regular kind; diet soda won't work.",
    "Apple cider vinegar or soy sauce.",
    "The dregs from a wine or beer bottle can work in a pinch.",
    "Fruit flies are attracted to the sugars in alcoholic beverages.",
    "Roll a piece of paper to create a funnel and put it on the container.",
    "A funnel with a small hole will allow the flies to enter the jar, but they won't be smart enough to fly back out.",
    "Tape the funnel so that it keeps its shape.",
    "Rest the funnel inside the mouth of the container so that the narrow side is pointing down.",
    "The tip of the funnel should not touch the bait.",
    "Any piece of scrap paper or a page ripped from a magazine can easily be made into a paper funnel.",
    "You can also make a funnel by using a toothpick to poke a hole in the bottom of a coffee filter.",
    "Set the trap in a fruit fly-infested area.",
    "Put it near the kitchen sink, the garbage can, or the fruit bowl.",
    "If you're dealing with fruit flies in multiple parts of the kitchen, you might want to make more traps to set out.",
    "Leave the traps out overnight.",
    "By the next day, you should see fruit flies happily eating the bait.",
    "If you didn't trap any flies, try new bait and make sure the hole is big enough to let the flies into the trap.",
    "Kill the trapped fruit flies.",
    "Pour a mixture of warm water and dish soap into the container.",
    "The soap works to reduce the surface tension of the water and cause the flies to drown.",
    "Wait a minute or two, then discard the contents of the jar.",
    "If the trap is still buzzing with fruit flies, take the trap outside before removing the funnel.",
    "Rinse the jar thoroughly with hot water when you're finished.",
    "You can reuse it to make a new trap.",
    "Repeat until the trap remains empty.",
    "Fruit flies tend to multiply quickly.",
    "Their life cycle can be as short as eight days.",
    "It's likely that you'll have to repeat the trapping process several times to fully rid your kitchen of adult fruit flies.",
    "Fruit fly eggs hatch eight to ten days after they are laid, so you may need to use the trapping process every day for a week or two.",
    "You can stop when you no longer see flies in your trap after leaving it out for several hours.",
    "To fully rid your kitchen of fruit flies as fast as possible, take measures to get rid of the eggs, too.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKevin Carrillo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMMPC, Pest Control Specialist\t\t\t\t\t\t\t\tKevin Carrillo is a Pest Control Specialist and the Senior Project Manager for MMPC, a pest control service and certified Minority-owned Business Enterprise (MBE) based in the New York City area.",
    "MMPC is certified by the industry’s leading codes and practices, including the National Pest Management Association (NPMA), QualityPro, GreenPro, and The New York Pest Management Association (NYPMA).",
    "MMPC's work has been featured in CNN, NPR, and ABC News.",
    "Kevin Carrillo\t\t\tMMPC, Pest Control Specialist\t\t\t\tHow do fruit flies enter my home?",
    "Fruit flies typically enter your house on the produce you buy.",
    "The fruit you bring inside, especially tropical fruit, usually has fruit fly eggs already on it.",
    "To prevent the eggs from hatching, scrub your fruit under running water with a brush to destroy the eggs.",
    "Or, you can keep the fruit in your fridge.",
    "Trapping Fruit Flies with Bowl Traps Start by getting a large or medium bowl.",
    "Although not quite as effective as the paper funnel method, this method utilizes the same approach: lure the fruit flies into the trap with a small opening and make it hard for them to exit.",
    "Add sweet bait to the bottom of a medium or large bowl.",
    "The type of bait doesn't matter as much as the quantity; you probably want at least an inch of sweet liquid covering the bottom of the bowl.",
    "Here are some suggestions for sweet concoctions that work well as bait:\nPut a piece of old, skinless fruit, such as an orange or a banana, along with some balsamic vinegar in a bowl.",
    "Experiment with a mix of white wine and coriander seeds.",
    "This mixture seems to work well.",
    "Add a bit of white wine vinegar to make the concoction even more pungent.",
    "A mix of honey, sugar, and balsamic vinegar also works in a pinch.",
    "Cover the bowl tightly with plastic wrap.",
    "Use a large sheet of plastic wrap to completely cover the bowl.",
    "Try to get the plastic wrap as taught as possible.",
    "Poke numerous small holes in the plastic with a fork or another implement.",
    "Try to keep the holes as small as possible; large holes can let the flies escape back out again.",
    "The point is to lure the fruit flies into the bowl and make it extremely hard to get back out.",
    "If using a fork makes the holes in the plastic wrap too big, try switching to a sharp toothpick in order to prick small holes in the plastic wrap.",
    "Set the trap in a fruit fly-infested area and leave the trap out overnight.",
    "Come the next day, you should see fruit flies caught inside the plastic wrap, happily feasting on the bait.",
    "If you haven't managed to trap any flies, check to make sure the holes in your plastic wrap aren't too big.",
    "Dispose of the trapped fruit flies.",
    "It's probably best to take the trap outside before killing the fruit flies so that any escapees don't reinfest your kitchen.",
    "Take off the plastic wrap and kill the fruit flies inside by pouring a mixture of warm water and dish soap into the container.",
    "The soap works to reduce the surface tension of the water and cause the flies to drown.",
    "Wait a minute or two, then discard the contents of the jar.",
    "When you're finished flushing the fruit flies, rinse the jar with hot water and reuse it to make a new trap.",
    "Trapping and Freezing Fruit Flies Get two glass jars.",
    "Smaller jars are easier to deal with than larger jars.",
    "Put some fruit scraps, such as rinds or peels, into each jar as bait.",
    "Discard the jar lids.",
    "Secure the jar openings instead with clear stretchy plastic wrap.",
    "Press down in the middle of the plastic wrap with your fingertip.",
    "Make a dent or funnel shape in the plastic going down into the jars.",
    "Poke a roughly 1 mm hole into the center of the dents.",
    "It seems like one tiny hole would not be enough to trap all your flies.",
    "It actually is.",
    "Wait for flies to be trapped.",
    "When you notice flies in one jar, put it in the freezer to kill them and their eggs.",
    "When you notice flies in the other jar, put it in the freezer and set out the one that has been in the freezer for a while.",
    "Just keep rotating the two jars in and out of your freezer.",
    "You never have to deal with cleaning the trap out outside or trying to kill the flies with vinegar!",
    "Killing Them With Sprays and Other Products Make fruit fly spray.",
    "Fill a fine misting spray bottle with 70% rubbing alcohol.",
    "Spray it on the hovering fruit flies.",
    "They'll fall to the floor and you can sweep them up and dispose of them.",
    "You can also spray 91% rubbing alcohol in the air and to saturate any eggs.",
    "This stronger alcohol kills them immediately and serves as a very effective disinfectant.",
    "The stronger alcohol option can cost as much as .50-$1.00 more per container.",
    "It is much more powerful than traditional 70% rubbing alcohol .",
    "One should take precautionary measures such as ventilating the area and wearing gloves.",
    "91% rubbing alcohol is far less poisonous, caustic, or dangerous than an insecticide or pesticide.",
    "Windex is another instant killer of most small bugs.",
    "If you find a patch of fruit flies in an area you are willing to get wet, give them a few quick sprays of Windex and watch them suffer.",
    "Another spray method is to use Clorox cleaning spray.",
    "Wipe down surfaces and dead flies afterwards.",
    "However, you'll need to ventilate the room you're spraying because the smell can be somewhat overwhelming; not recommended if you're worried about toxic indoor air or you're spraying near food preparation surfaces.",
    "You can even use a fine mist bottle to spray mobs of flies with plain water; they will drop to the surface below.",
    "Because their wings are damp, they will be momentarily unable to fly, so you can easily squash them and clean them up.",
    "Use pyrethrin spray.",
    "Pyrethrin is an insecticide that effectively kills adult fruit flies, but not their eggs.",
    "Be sure to use it according to the instructions.",
    "Avoid directly spraying it over fruit or in food preparation areas.",
    "This product comes in an aerosol can that can be used to spray fruit flies as you see them.",
    "It kills them on contact.",
    "You can buy an automatic pyrethrin dispenser to deal with high volumes of fruit flies in one area.",
    "Treat your drain with gel.",
    "There are several drain gels on the market that are formulated to fruit flies and eggs infesting kitchen drains.",
    "If boiling water and soap don't do the trick, consider trying a gel.",
    "Follow the manufacturer's instructions for treating your drain.",
    "You may have to repeat more than once to completely get rid of the flies.",
    "Try a professional-grade treatment.",
    "If you have a fruit fly infestation that you can't get under control, you can have your home treated with a residual insecticide that you spray where fruit flies tend to land and congregate.",
    "If you properly store produce and keep your kitchen clean, this measure is not usually necessary.",
    "Call a pest control company for further information if you want to have your home sprayed for fruit flies.",
    "Getting Rid of the Eggs Figure out where they're breeding.",
    "Fruit flies lay their eggs places that provide food and moisture, such as rotting fruit and dank sinks or garbage cans.",
    "To get rid of the eggs, you'll need to figure out where the flies' food sources are in your kitchen.",
    "Bowls or bags of aging fruit are an obvious culprit.",
    "Even if your fruit is brand new, the container you're storing it in might have residue from old produce that's still attracting fruit flies.",
    "If you keep compost in your kitchen, that may be a food source for fruit flies.",
    "An open bag of recyclables can be attractive to fruit flies, especially if it contains un-rinsed beer or soda cans.",
    "When did you last wash your garbage can?",
    "Even if you take out the trash frequently, the receptacle itself could be the source of the problem.",
    "Kitchen sink drains often harbor fruit flies, since food bits can get trapped in there and start to rot.",
    "Damp sponges and mops can also be breeding grounds for fruit flies.",
    "Store your produce carefully.",
    "When you have a fruit fly problem, don't leave fruit exposed at room temperature in your kitchen.",
    "Store it in a closed brown bag or keep it in the refrigerator until you've taken care of the fruit flies.",
    "One piece of overripe fruit can perpetuate the infestation by providing a great place for fruit flies to breed.",
    "Don't throw fruit scraps in the trash.",
    "Unless you take your trash out daily, avoid throwing peach pits, apple cores and other fruit scraps in the trash in your kitchen, since they'll end up as breeding grounds for fruit flies.",
    "Take scraps directly outside to a compost pile or outdoor bin.",
    "Wash your waste receptacles.",
    "Your trash can, recycling bin, and compost bin could be harboring fruit fly eggs.",
    "Any waste receptacle you keep indoors should be cleaned with hot, soapy water as soon as you notice the infestation.",
    "Take out your trash, recycling or compost often to prevent the problem from recurring.",
    "Continue washing the containers every week or so, especially during the late summer months when fruit fly populations are high.",
    "Rinse bottles and other containers with hot water before you throw them in the bin.",
    "Residue from these items can spill on your trash receptacles and make the fruit fly problem worse.",
    "You should also make sure all of your waste receptacles have tight-fitting lids.",
    "Clean your drain.",
    "You can check to see if your drain is a fruit fly breeding ground by covering it with a piece of plastic wrap spread with a thin layer of honey.",
    "Place it over the drain honey-side down, then come back in an hour or so.",
    "If you see fruit flies stuck to the honey, your drain is part of the problem.",
    "Make sure your drain is operating properly.",
    "If it's backed up, or if your garbage disposal isn't working, you might have bits of rotting fruit attracting flies down there.",
    "To kill eggs, pour a pot of boiling soapy water down the drain.",
    "Use a brush to scrub around the sides of the drain.",
    "Don't pour bleach down your drain.",
    "It doesn't work, and it's harmful to the environment.",
    "Throw out other potential breeding sources.",
    "Old sponges, damp mops, old rags, and any other items you use to wipe your counters and floors might contain fruit fly eggs.",
    "Throw them away or wash them using the hot cycle on your washing machine.",
    "Wipe down the surfaces in your kitchen.",
    "Use hot, soapy water to clean your countertops.",
    "Make sure you get all the cracks and crevices where fruit flies might like to congregate.",
    "Clean your cabinets, pantry, and any other places where you've stored fruit, juices, or other sugary items.",
    "Check the floor, too.",
    "If a drink got spilled under the refrigerator, for instance, that might be part of the problem.",
    "Clean any areas that feel sticky.",
    "Keep kitchen surfaces clean every day.",
    "Make sure everything is wiped down as part of your cleanup after each meal.",
    "Wash all dishes after use.",
    "Avoid leaving dishes just sitting around dirty (if you have a dishwasher, pop them in there and shut the door to await a wash).",
    "Keeping Fruit Flies From Returning Inspect fruit that you bring into your kitchen.",
    "Pick through berries, cherries, and other fruits that you bring inside.",
    "Any damaged fruit should be discarded outdoors, since you could bring fruit fly eggs in from the grocery store or farmer's market.",
    "Wash your fresh fruit carefully with water and dry it completely before storing.",
    "Keep a maintenance trap near your fruit bowl.",
    "Any small container with a teaspoon of cider vinegar, 2 tablespoons of water, and a drop of two of dish soap will attract and drown fruit flies.",
    "This will help keep the population down.",
    "Rinse out the bowl and fill it with fresh mixture every day during fruit fly season.",
    "Use screens to cover your doors and windows.",
    "Fruit flies enjoy outdoor food sources as well.",
    "Covering entrances to your home with screens will help prevent them from coming into your kitchen.",
    "This is especially important if you have fruit trees in your yard.",
    "Deal with outdoor fruit fly attractants.",
    "If you have fruit trees, pick fruit when it's ready rather than leaving it to rot on the branch or beneath the tree.",
    "Pick up or rake away a glut of fruit that has fallen to the ground beneath the tree, to discourage fruit fly infestation.",
    "You can also slip an exclusion bag over the branches of the tree that are fruiting.",
    "The bag should allow light to continue to reach the fruit and air to circulate without allowing the fruit flies access to the fruit.",
    "Such bags can usually be obtained from places that supply organic growers.",
    "Purchase organic fruit fly sprays from a garden center or organic growing supplier.",
    "Such sprays will need to be reapplied regularly, due to their organic nature but this is the best non-toxic approach to growing healthy fruit.",
    "Deter fruit flies with essential oils.",
    "Fruit flies are deterred by the smell of certain essential oils that are pleasing to humans.",
    "The oils won't kill the flies, but they will keep flies from accumulating.",
    "Fill a spray bottle with a cup of water and five to ten drops of lemongrass, eucalyptus or peppermint essential oil.",
    "Spritz areas of the kitchen that tend to attract fruit flies, like near the sink and trash can."
  ],
  "tyn_section":[
    "Container",
    "Bait",
    "Funnel",
    "Soapy water",
    "Apple cider vinegar"
  ],
  "tyn_model":[
    "fruit flies",
    "water",
    "plastic wrap",
    "fruit fly",
    "bowl",
    "funnel",
    "honey",
    "dish soap",
    "soap",
    "hot water",
    "flies",
    "freezer",
    "rubbing alcohol",
    "banana",
    "fruit bowl",
    "pest control specialist",
    "balsamic vinegar",
    "fork",
    "windex",
    "compost",
    "refrigerator",
    "essential oils",
    "wine bottle",
    "soda bottle",
    "fruit fly bait",
    "maple syrup",
    "corn syrup",
    "fruit juice",
    "diet soda",
    "apple cider vinegar",
    "paper",
    "container",
    "jar",
    "pest control service",
    "pest management association",
    "pest control specialist\t\t\t\thow",
    "bowl traps",
    "sweet bait",
    "sweet liquid",
    "white wine",
    "coriander",
    "white wine vinegar",
    "sugar",
    "glass jars",
    "plastic",
    "vinegar",
    "fruit fly spray",
    "fine misting spray bottle",
    "70% rubbing alcohol",
    "clorox cleaning",
    "fine mist bottle",
    "pyrethrin spray",
    "pyrethrin",
    "pyrethrin dispenser",
    "gel",
    "drain gels",
    "eggs",
    "pest control company",
    "garbage can",
    "fruit",
    "peach pits",
    "apple cores",
    "compost pile",
    "trash can",
    "compost bin",
    "hot, soapy water",
    "garbage disposal",
    "soapy water",
    "bleach",
    "sponges",
    "washing machine",
    "berries",
    "cherries",
    "fruit fly eggs",
    "cider vinegar",
    "fruit fly season",
    "screens",
    "fruit fly attractants",
    "fruit fly sprays",
    "garden center or organic growing supplier",
    "spray bottle",
    "lemongrass,",
    "essential oil"
  ],
  "simple_metrics":{
    "r":0.8,
    "p":0.0481927711,
    "f1":0.0909090909,
    "avg_pos":0.3734939759
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.0963855422,
    "f1":0.1758241758
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.1325301205,
    "f1":0.2340425532
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8,
    "p":0.0722891566,
    "f1":0.1325966851
  }
}