{
  "title":"How to Make Chili",
  "url":"https://www.wikihow.com/Make-Chili",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Chili Dishes"
  ],
  "methods":[
    {
      "name":"Preparing Classic Chili with Ground Beef",
      "steps":[
        {
          "headline":"Saute the peppers, onions, and celery until tender.",
          "description":"Add 1 tablespoon (15 ml) of vegetable oil to a Dutch oven or large soup pot. Heat it on medium heat for 3 to 5 minutes, and then add 1 chopped medium green pepper, 2 chopped medium onions, and ½ cup (115 g) of chopped celery to the pot. Cook the vegetables until they are tender, which should take approximately 5 minutes. Stir the veggies frequently to prevent them from sticking. You can substitute olive or canola oil for the vegetable if you prefer."
        },
        {
          "headline":"Mix in the ground beef and cook until it is browned.",
          "description":"After you’ve sauteed the vegetables for several minutes, add 2 pounds (907 g) of ground beef to the pot. Allow the mixture to cook until the beef is completely browned, which should take 5 to 10 minutes. Drain off the excess fat when the meat is finished cooking. For the best results, use extra-lean ground beef. You can substitute another ground meat, such as ground turkey or chicken, for the beef if you prefer. Just make sure that the meat is cooked through before moving onto the next step."
        },
        {
          "headline":"Stir in tomatoes, tomato sauce, water, Worcestershire sauce, and seasonings.",
          "description":"Once the meat is browned and you’ve drained the fat from the pan, add two 28-ounce (794 g) cans of diced tomatoes with the juice, an 8-ounce (227 g) can of tomato sauce, 1 cup (237 ml) of water, 2 tablespoons (30 ml) of Worcestershire sauce, 1 to 2 tablespoons (8 to 16 g) of chili powder, 1 teaspoon (3 g) of garlic powder, 1 teaspoon (2 g) of ground oregano, 1 teaspoon (2 g) of ground cumin, 1 teaspoon (6 g) of salt, and ½ teaspoon (1 g) of pepper to the pot. Mix the ingredients well to ensure that they’re fully incorporated. You can adjust the amount of the chili powder depending on your personal tastes. Instead of using the individual spices, you can also use a premixed chili seasoning packet from the grocery store, which typically contains chili powder, garlic powder, oregano, cumin, and other spices."
        },
        {
          "headline":"Bring the mixture to a boil.",
          "description":"After you’ve mixed all of the ingredients together, raise the heat to medium-high. Allow the mixture to come to a boil, which should take approximately 5 to 10 minutes. Leave the pot uncovered as you bring it to a boil. Stir the pot regularly as you heat it to ensure that none of the ingredients stick to the bottom or sides."
        },
        {
          "headline":"Cover the pot and simmer for an hour and a half.",
          "description":"When the pot reaches a boil, lower the heat to medium-low or low. Place the lid on the pot, and let it simmer for an hour and a half. If you don’t have a lid for your pot, you can cover it with a piece of foil or a flat baking sheet. Stir the mixture periodically to ensure that it’s cooking evenly."
        },
        {
          "headline":"Add the kidney beans and simmer again.",
          "description":"Once the mixture has simmered for an hour and a half, pour 2 15.5-ounce (439 g) cans of kidney beans that have been rinsed and drained to the pot. Mix them into the chili well, and let it simmer for another 10 minutes. Don’t cover the pot when you simmer the chili with the beans added."
        },
        {
          "headline":"Spoon the chili into bowls and serve.",
          "description":"When the chili has been simmered for another 10 minutes with the beans, remove it from the heat. Use a ladle to place it into individual bowls and serve. Classic chili is often served with toppings such as shredded cheddar cheese, sour cream, chopped onions, and tortilla chips. Store any uneaten chili in the refrigerator. It should keep for 3 to 4 days in an airtight container. You can freeze the chili if you don’t eat all of it. Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely. It will usually keep for 4 to 6 months in the freezer."
        }
      ]
    },
    {
      "name":"Whipping Up Vegetarian Chili",
      "steps":[
        {
          "headline":"Heat the oil.",
          "description":"Add 3 tablespoons (45 ml) of olive oil to a large, heavy pot on the stove. Turn the heat to medium-high, and allow the oil to heat until it begins to shimmer, which should take approximately 5 minutes. You can substitute canola oil for the olive oil if you prefer."
        },
        {
          "headline":"Saute the garlic and onion until tender and fragrant.",
          "description":"Once the olive oil is heated, add 1 large, coarsely chopped onion and 6 large, minced garlic cloves to the pot. Cook the onion and garlic until the onion is tender and the garlic becomes fragrant, which should take approximately 5 minutes. Stir the veggies frequently to prevent them from sticking. You can mix chopped celery in to saute with the onion and garlic if you like."
        },
        {
          "headline":"Mix in the tomatoes, green chilies, and seasonings and cook.",
          "description":"After the onion and garlic have cooked for several minutes, add three 14.5-ounce (411 g) cans of diced tomatoes with the juice, a 4-ounce (113 g) can of diced mild green chilies, 3 tablespoons (24 g) of chili powder, 1 tablespoon (6 g) of ground cumin, and 1 tablespoon (6 g) of dried oregano. Stir well to ensure that the ingredients are fully combined and allow the mixture to cook for 10 minutes so the flavors have time to meld. You can adjust the amount of chili powder to taste."
        },
        {
          "headline":"Stir in the beans, peppers, and corn.",
          "description":"Once the mixture has cooked for another 10 minutes, add a 15.5-ounce (439 g) can of rinsed and drained kidney beans, a 15.5-ounce (439 g) can of rinsed and drained black beans, 1 chopped green bell pepper, 1 yellow bell pepper, and a 10-ounce (284 g) package of frozen corn kernels to the pot. Mix well so all of the ingredients are combined. You can use any combination of green and yellow peppers that you like. You can also substitute red for one of the peppers."
        },
        {
          "headline":"Reduce the heat and simmer until the chili thickens.",
          "description":"When all of the ingredients are mixed in the pot, lower the heat to medium-low. Allow the chili to simmer for approximately 35 minutes, or until it is thick. Keep the lid off of the pot to help the chili thicken as it simmers. Make sure to stir the chili occasionally so it cooks evenly."
        },
        {
          "headline":"Season the chili with salt and pepper and serve.",
          "description":"After the chili has simmered for a half hour or so, taste it. Add salt and black pepper to taste, and spoon it into individual bowls to serve. You can top the chili with shredded cheddar cheese and sour cream if you like. It is also delicious spooned over rice. Store any uneaten chili in the refrigerator. It should keep for 3 to 4 days in an airtight container. You can freeze the chili if you don’t eat all of it. Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely. It will usually keep for 4 to 6 months in the freezer."
        }
      ]
    },
    {
      "name":"Cooking Texas Style Chili",
      "steps":[
        {
          "headline":"Toast the chiles in a pan.",
          "description":"Add 6 to 8 dried, whole New Mexico chiles to a large, straight-sided skillet. Heat the chiles over medium-low to gently toast them until they become fragrant. It should take approximately 2 to 3 minutes on each side of the chiles. You can substitute guajillo or pasilla chiles for the New Mexico. You can also use any combination of the three. Make sure not to let the chiles burn or they will become bitter."
        },
        {
          "headline":"Soak the toasted chilies in water.",
          "description":"After the chiles are toasted, transfer them to a bowl. Cover them with very hot water, and allow the chiles to soak for 15 to 45 minutes or until they are soft. The water that you soak the chiles in doesn’t have to be boiling. Use the water from your tap’s hottest setting to soak them."
        },
        {
          "headline":"Drain the chilies and remove the seeds and stems.",
          "description":"Once the chiles are soft, remove them from the water. Use a sharp knife to cut off the stems and split the chiles open to take out the seeds. Handling hot chiles can irritate your skin and eyes. It’s a good idea to wear rubber gloves when cutting the chiles open. Running the chiles under water can help rinse out the seeds. Be careful not to rinse away any of the flesh, though."
        },
        {
          "headline":"Combine the chilies, cumin, black pepper, some salt, and some water in a blender.",
          "description":"After you’ve removed the stems and seeds, add the chiles to a blender with 1 ½ teaspoons (3 g) of ground cumin, ½ teaspoon (1 g) of freshly ground black pepper, 1 tablespoon (18 g) of kosher salt, and ¼ cup (59 ml) of water. Puree the mixture until it forms a smooth, slightly liquid-y paste. Set the paste aside. If the mixture is too thick, you can gradually mix more water into the paste. You may need to scrape down the sides of the blender’s pitcher with a spatula to ensure that all of the ingredients are fully blended."
        },
        {
          "headline":"Heat the oil and brown the beef in two batches.",
          "description":"Heat 2 tablespoons (30 ml) of vegetable oil in the skillet over medium-high heat. Add half of 2 ½ pounds (1.1 kg) of boneless beef chuck that’s been trimmed and cut into ¾-inch (19-mm) cubes, and lightly brown the meat on at least two sides, which should take about 3 minutes per side. Transfer the cooked meat to a bowl, and repeat the process with another 2 tablespoons (30 ml) of the oil and the rest of the meat. Transfer the cooked meat to a bowl. Make sure to swirl the oil throughout the skillet so it is fully greased. Be careful not the burn the meat. If you suspect that it might be cooking too quickly, lower the heat."
        },
        {
          "headline":"Saute the onion and garlic.",
          "description":"Allow the skillet to cool for 5 to 10 minutes before returning it to the stove on medium low heat. Add the remaining 1 tablespoon (15 ml) of oil, ⅓ cup (50 g) of finely chopped onion, and 3 large, minced cloves of garlic to the skillet, and saute the onion and garlic for 3 to 4 minutes. Stir the onion and garlic periodically as you saute them to ensure that they cook evenly."
        },
        {
          "headline":"Stir in in the stock, water, and masa harina.",
          "description":"Once the onion and garlic have sauteed for several minutes, add 2 cups (473 ml) of beef stock, 2 cups (473 ml) of water, and 2 tablespoons (14 g) of masa harina to the skillet. Whisk the ingredients together to ensure that there are no lumps. Masa harina is a finely ground corn flour. You can usually find it in the Mexican or international foods aisle at the grocery store."
        },
        {
          "headline":"Mix in the chile paste and cooked beef and simmer.",
          "description":"After you’ve mixed in the stock, water, and masa harina, add the chile paste that you made earlier and the cooked beef to the skillet. Raise the heat to high, and bring the mixture to a simmer. If there are any juices in the bowl with the cooked beef, add them to the skillet as well. As you stir the chile paste and meat into the skillet, make sure to scrape the bottom to lift any browned bits and mix them in as well."
        },
        {
          "headline":"Reduce heat and cook the mixture for 2 hours.",
          "description":"When the mixture begins to simmer, turn the heat down to low. Allow the mixture to cook for about two hours or until the meat is tender but still slightly firm. Keep the lid off to allow some of the liquid to evaporate. This will help the chili thicken. Stir the mixture periodically as it simmers to ensure that it cooks evenly."
        },
        {
          "headline":"Add the brown sugar, vinegar, and salt to taste and simmer again with the lid off.",
          "description":"After the mixture has simmered for a couple of hours, mix 1 tablespoon (13 g) of firmly packed dark brown sugar, 1 ½ tablespoons (22 ½ ml) of distilled white vinegar, and more salt to taste into the skillet. Allow the mixture to simmer for another 10 minutes. It’s normal for the chili to appear to have too much sauce even after simmering. The next step will help absorb some of it."
        },
        {
          "headline":"Remove the chili from heat and allow it to stand.",
          "description":"When the chili has finished simmering, turn off the heat. Let it stand for about 30 minutes, or until the meat absorbs approximately half of the sauce in the pan."
        },
        {
          "headline":"Adjust the consistency and seasonings of the chili if necessary.",
          "description":"After the chili has had a chance to stand for a half hour, stir it to determine if the consistency is right. Taste it as well to see if you want to add more of any of the seasonings. If the chili seems too dry, mix in more broth and/or water. If the chili seems too liquidy, turn the heat back on and allow it to simmer until it thickens further. Mix in additional salt, brown sugar, and/or vinegar to suit your taste."
        },
        {
          "headline":"Reheat the chili and ladle it into bowls to serve.",
          "description":"Turn the heat back on under the skillet to low or medium-low and reheat the chili gently. When it’s warmed through, transfer it into individual bowls and serve the chili with a lime wedge and spoonful of sour cream. Store any uneaten chili in the refrigerator. It should keep for 3 to 4 days in an airtight container. You can freeze the chili if you don’t eat all of it. Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely. It will usually keep for 4 to 6 months in the freezer."
        }
      ]
    },
    {
      "name":"Putting Together White Chili",
      "steps":[
        {
          "headline":"Saute the onions until they are tender.",
          "description":"Pour 1 tablespoon (15 ml) of olive oil into a large heavy-bottomed pot, and heat it on medium-high heat. Add 1 medium chopped onion, and cook it until it is tender, which should take approximately 4 to 5 minutes. Stir the veggies frequently to prevent them from sticking. You can substitute canola oil for the olive oil if you prefer."
        },
        {
          "headline":"Mix in the garlic, cumin, cloves, and cayenne.",
          "description":"After you’ve sauteed the onion, add 1 minced clove of garlic, ¼ teaspoon (½ g) of cayenne pepper, ⅛ teaspoon (¼ g) of ground cloves, and 2 teaspoons (6 g) ground cumin to the pot. Let the mixture cook for another minute. You can add more cayenne pepper if you would like the chili to have more of a spicy kick."
        },
        {
          "headline":"Stir in the green chilies, dried oregano, and jalapeno.",
          "description":"When you’ve cooked the onion mixture for another minute, add two 4-ounce (113 g) cans of chopped green chilies, 1 ½ teaspoons (3 g) of dried oregano, and 1 finely chopped jalapeno pepper to the pot. Mix well so the ingredients are fully incorporated. You can substitute a serrano pepper for the jalapeno if you prefer."
        },
        {
          "headline":"Add the chicken and chicken stock and bring to a simmer.",
          "description":"After you’ve mixed in the chiles and oregano, stir 3 cups (375 g) of diced, cooked chicken and 3 cups (709 ml) of chicken stock into the pot. Raise the heat to high, and allow the mixture to come to a simmer. If you don’t want to cook your own chicken, you can use a rotisserie chicken from the grocery store. Remove it from the bone and dice or shred it before mixing it in."
        },
        {
          "headline":"Lower the heat and simmer for another 5 minutes.",
          "description":"Once the mixture comes to a simmer, reduce the heat to low and place a lid on the pot. Allow the chili to cook for another 5 to 10 minutes or until the chicken is warmed through."
        },
        {
          "headline":"Mix in the beans and cook for another 15 minutes.",
          "description":"When the chili has simmered with the chicken mixed in, add two 15.5-ounce (439 g) cans of white beans that have been drained. Allow the mixture to cook for another 15 minutes. You can leave the lid off the pot when you simmer the chili for the final time."
        },
        {
          "headline":"Season the chili to taste and top with the cheese to serve.",
          "description":"After you’ve simmered the beans with the chili, taste it. Add in more salt and pepper if necessary before ladling the chili into bowls. Top the bowls with some shredded Monterey Jack cheese, and serve. You can also top the chili with chopped tomato, chopped scallions, cilantro, guacamole, and/or tortilla chips. Store any uneaten chili in the refrigerator. It should keep for 3 to 4 days in an airtight container. You can freeze the chili if you don’t eat all of it. Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely. It will usually keep for 4 to 6 months in the freezer."
        }
      ]
    }
  ],
  "text":" Preparing Classic Chili with Ground Beef Saute the peppers, onions, and celery until tender. Add 1 tablespoon (15 ml) of vegetable oil to a Dutch oven or large soup pot. Heat it on medium heat for 3 to 5 minutes, and then add 1 chopped medium green pepper, 2 chopped medium onions, and ½ cup (115 g) of chopped celery to the pot. Cook the vegetables until they are tender, which should take approximately 5 minutes. Stir the veggies frequently to prevent them from sticking. You can substitute olive or canola oil for the vegetable if you prefer. Mix in the ground beef and cook until it is browned. After you’ve sauteed the vegetables for several minutes, add 2 pounds (907 g) of ground beef to the pot. Allow the mixture to cook until the beef is completely browned, which should take 5 to 10 minutes. Drain off the excess fat when the meat is finished cooking. For the best results, use extra-lean ground beef. You can substitute another ground meat, such as ground turkey or chicken, for the beef if you prefer. Just make sure that the meat is cooked through before moving onto the next step. Stir in tomatoes, tomato sauce, water, Worcestershire sauce, and seasonings. Once the meat is browned and you’ve drained the fat from the pan, add two 28-ounce (794 g) cans of diced tomatoes with the juice, an 8-ounce (227 g) can of tomato sauce, 1 cup (237 ml) of water, 2 tablespoons (30 ml) of Worcestershire sauce, 1 to 2 tablespoons (8 to 16 g) of chili powder, 1 teaspoon (3 g) of garlic powder, 1 teaspoon (2 g) of ground oregano, 1 teaspoon (2 g) of ground cumin, 1 teaspoon (6 g) of salt, and ½ teaspoon (1 g) of pepper to the pot. Mix the ingredients well to ensure that they’re fully incorporated. You can adjust the amount of the chili powder depending on your personal tastes. Instead of using the individual spices, you can also use a premixed chili seasoning packet from the grocery store, which typically contains chili powder, garlic powder, oregano, cumin, and other spices. Bring the mixture to a boil. After you’ve mixed all of the ingredients together, raise the heat to medium-high. Allow the mixture to come to a boil, which should take approximately 5 to 10 minutes. Leave the pot uncovered as you bring it to a boil. Stir the pot regularly as you heat it to ensure that none of the ingredients stick to the bottom or sides. Cover the pot and simmer for an hour and a half. When the pot reaches a boil, lower the heat to medium-low or low. Place the lid on the pot, and let it simmer for an hour and a half. If you don’t have a lid for your pot, you can cover it with a piece of foil or a flat baking sheet. Stir the mixture periodically to ensure that it’s cooking evenly. Add the kidney beans and simmer again. Once the mixture has simmered for an hour and a half, pour 2 15.5-ounce (439 g) cans of kidney beans that have been rinsed and drained to the pot. Mix them into the chili well, and let it simmer for another 10 minutes. Don’t cover the pot when you simmer the chili with the beans added. Spoon the chili into bowls and serve. When the chili has been simmered for another 10 minutes with the beans, remove it from the heat. Use a ladle to place it into individual bowls and serve. Classic chili is often served with toppings such as shredded cheddar cheese, sour cream, chopped onions, and tortilla chips. Store any uneaten chili in the refrigerator. It should keep for 3 to 4 days in an airtight container. You can freeze the chili if you don’t eat all of it. Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely. It will usually keep for 4 to 6 months in the freezer. Whipping Up Vegetarian Chili Heat the oil. Add 3 tablespoons (45 ml) of olive oil to a large, heavy pot on the stove. Turn the heat to medium-high, and allow the oil to heat until it begins to shimmer, which should take approximately 5 minutes. You can substitute canola oil for the olive oil if you prefer. Saute the garlic and onion until tender and fragrant. Once the olive oil is heated, add 1 large, coarsely chopped onion and 6 large, minced garlic cloves to the pot. Cook the onion and garlic until the onion is tender and the garlic becomes fragrant, which should take approximately 5 minutes. Stir the veggies frequently to prevent them from sticking. You can mix chopped celery in to saute with the onion and garlic if you like. Mix in the tomatoes, green chilies, and seasonings and cook. After the onion and garlic have cooked for several minutes, add three 14.5-ounce (411 g) cans of diced tomatoes with the juice, a 4-ounce (113 g) can of diced mild green chilies, 3 tablespoons (24 g) of chili powder, 1 tablespoon (6 g) of ground cumin, and 1 tablespoon (6 g) of dried oregano. Stir well to ensure that the ingredients are fully combined and allow the mixture to cook for 10 minutes so the flavors have time to meld. You can adjust the amount of chili powder to taste. Stir in the beans, peppers, and corn. Once the mixture has cooked for another 10 minutes, add a 15.5-ounce (439 g) can of rinsed and drained kidney beans, a 15.5-ounce (439 g) can of rinsed and drained black beans, 1 chopped green bell pepper, 1 yellow bell pepper, and a 10-ounce (284 g) package of frozen corn kernels to the pot. Mix well so all of the ingredients are combined. You can use any combination of green and yellow peppers that you like. You can also substitute red for one of the peppers. Reduce the heat and simmer until the chili thickens. When all of the ingredients are mixed in the pot, lower the heat to medium-low. Allow the chili to simmer for approximately 35 minutes, or until it is thick. Keep the lid off of the pot to help the chili thicken as it simmers. Make sure to stir the chili occasionally so it cooks evenly. Season the chili with salt and pepper and serve. After the chili has simmered for a half hour or so, taste it. Add salt and black pepper to taste, and spoon it into individual bowls to serve. You can top the chili with shredded cheddar cheese and sour cream if you like. It is also delicious spooned over rice. Store any uneaten chili in the refrigerator. It should keep for 3 to 4 days in an airtight container. You can freeze the chili if you don’t eat all of it. Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely. It will usually keep for 4 to 6 months in the freezer. Cooking Texas Style Chili Toast the chiles in a pan. Add 6 to 8 dried, whole New Mexico chiles to a large, straight-sided skillet. Heat the chiles over medium-low to gently toast them until they become fragrant. It should take approximately 2 to 3 minutes on each side of the chiles. You can substitute guajillo or pasilla chiles for the New Mexico. You can also use any combination of the three. Make sure not to let the chiles burn or they will become bitter. Soak the toasted chilies in water. After the chiles are toasted, transfer them to a bowl. Cover them with very hot water, and allow the chiles to soak for 15 to 45 minutes or until they are soft. The water that you soak the chiles in doesn’t have to be boiling. Use the water from your tap’s hottest setting to soak them. Drain the chilies and remove the seeds and stems. Once the chiles are soft, remove them from the water. Use a sharp knife to cut off the stems and split the chiles open to take out the seeds. Handling hot chiles can irritate your skin and eyes. It’s a good idea to wear rubber gloves when cutting the chiles open. Running the chiles under water can help rinse out the seeds. Be careful not to rinse away any of the flesh, though. Combine the chilies, cumin, black pepper, some salt, and some water in a blender. After you’ve removed the stems and seeds, add the chiles to a blender with 1 ½ teaspoons (3 g) of ground cumin, ½ teaspoon (1 g) of freshly ground black pepper, 1 tablespoon (18 g) of kosher salt, and ¼ cup (59 ml) of water. Puree the mixture until it forms a smooth, slightly liquid-y paste. Set the paste aside. If the mixture is too thick, you can gradually mix more water into the paste. You may need to scrape down the sides of the blender’s pitcher with a spatula to ensure that all of the ingredients are fully blended. Heat the oil and brown the beef in two batches. Heat 2 tablespoons (30 ml) of vegetable oil in the skillet over medium-high heat. Add half of 2 ½ pounds (1.1 kg) of boneless beef chuck that’s been trimmed and cut into ¾-inch (19-mm) cubes, and lightly brown the meat on at least two sides, which should take about 3 minutes per side. Transfer the cooked meat to a bowl, and repeat the process with another 2 tablespoons (30 ml) of the oil and the rest of the meat. Transfer the cooked meat to a bowl. Make sure to swirl the oil throughout the skillet so it is fully greased. Be careful not the burn the meat. If you suspect that it might be cooking too quickly, lower the heat. Saute the onion and garlic. Allow the skillet to cool for 5 to 10 minutes before returning it to the stove on medium low heat. Add the remaining 1 tablespoon (15 ml) of oil, ⅓ cup (50 g) of finely chopped onion, and 3 large, minced cloves of garlic to the skillet, and saute the onion and garlic for 3 to 4 minutes. Stir the onion and garlic periodically as you saute them to ensure that they cook evenly. Stir in in the stock, water, and masa harina. Once the onion and garlic have sauteed for several minutes, add 2 cups (473 ml) of beef stock, 2 cups (473 ml) of water, and 2 tablespoons (14 g) of masa harina to the skillet. Whisk the ingredients together to ensure that there are no lumps. Masa harina is a finely ground corn flour. You can usually find it in the Mexican or international foods aisle at the grocery store. Mix in the chile paste and cooked beef and simmer. After you’ve mixed in the stock, water, and masa harina, add the chile paste that you made earlier and the cooked beef to the skillet. Raise the heat to high, and bring the mixture to a simmer. If there are any juices in the bowl with the cooked beef, add them to the skillet as well. As you stir the chile paste and meat into the skillet, make sure to scrape the bottom to lift any browned bits and mix them in as well. Reduce heat and cook the mixture for 2 hours. When the mixture begins to simmer, turn the heat down to low. Allow the mixture to cook for about two hours or until the meat is tender but still slightly firm. Keep the lid off to allow some of the liquid to evaporate. This will help the chili thicken. Stir the mixture periodically as it simmers to ensure that it cooks evenly. Add the brown sugar, vinegar, and salt to taste and simmer again with the lid off. After the mixture has simmered for a couple of hours, mix 1 tablespoon (13 g) of firmly packed dark brown sugar, 1 ½ tablespoons (22 ½ ml) of distilled white vinegar, and more salt to taste into the skillet. Allow the mixture to simmer for another 10 minutes. It’s normal for the chili to appear to have too much sauce even after simmering. The next step will help absorb some of it. Remove the chili from heat and allow it to stand. When the chili has finished simmering, turn off the heat. Let it stand for about 30 minutes, or until the meat absorbs approximately half of the sauce in the pan. Adjust the consistency and seasonings of the chili if necessary. After the chili has had a chance to stand for a half hour, stir it to determine if the consistency is right. Taste it as well to see if you want to add more of any of the seasonings. If the chili seems too dry, mix in more broth and/or water. If the chili seems too liquidy, turn the heat back on and allow it to simmer until it thickens further. Mix in additional salt, brown sugar, and/or vinegar to suit your taste. Reheat the chili and ladle it into bowls to serve. Turn the heat back on under the skillet to low or medium-low and reheat the chili gently. When it’s warmed through, transfer it into individual bowls and serve the chili with a lime wedge and spoonful of sour cream. Store any uneaten chili in the refrigerator. It should keep for 3 to 4 days in an airtight container. You can freeze the chili if you don’t eat all of it. Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely. It will usually keep for 4 to 6 months in the freezer. Putting Together White Chili Saute the onions until they are tender. Pour 1 tablespoon (15 ml) of olive oil into a large heavy-bottomed pot, and heat it on medium-high heat. Add 1 medium chopped onion, and cook it until it is tender, which should take approximately 4 to 5 minutes. Stir the veggies frequently to prevent them from sticking. You can substitute canola oil for the olive oil if you prefer. Mix in the garlic, cumin, cloves, and cayenne. After you’ve sauteed the onion, add 1 minced clove of garlic, ¼ teaspoon (½ g) of cayenne pepper, ⅛ teaspoon (¼ g) of ground cloves, and 2 teaspoons (6 g) ground cumin to the pot. Let the mixture cook for another minute. You can add more cayenne pepper if you would like the chili to have more of a spicy kick. Stir in the green chilies, dried oregano, and jalapeno. When you’ve cooked the onion mixture for another minute, add two 4-ounce (113 g) cans of chopped green chilies, 1 ½ teaspoons (3 g) of dried oregano, and 1 finely chopped jalapeno pepper to the pot. Mix well so the ingredients are fully incorporated. You can substitute a serrano pepper for the jalapeno if you prefer. Add the chicken and chicken stock and bring to a simmer. After you’ve mixed in the chiles and oregano, stir 3 cups (375 g) of diced, cooked chicken and 3 cups (709 ml) of chicken stock into the pot. Raise the heat to high, and allow the mixture to come to a simmer. If you don’t want to cook your own chicken, you can use a rotisserie chicken from the grocery store. Remove it from the bone and dice or shred it before mixing it in. Lower the heat and simmer for another 5 minutes. Once the mixture comes to a simmer, reduce the heat to low and place a lid on the pot. Allow the chili to cook for another 5 to 10 minutes or until the chicken is warmed through. Mix in the beans and cook for another 15 minutes. When the chili has simmered with the chicken mixed in, add two 15.5-ounce (439 g) cans of white beans that have been drained. Allow the mixture to cook for another 15 minutes. You can leave the lid off the pot when you simmer the chili for the final time. Season the chili to taste and top with the cheese to serve. After you’ve simmered the beans with the chili, taste it. Add in more salt and pepper if necessary before ladling the chili into bowls. Top the bowls with some shredded Monterey Jack cheese, and serve. You can also top the chili with chopped tomato, chopped scallions, cilantro, guacamole, and/or tortilla chips. Store any uneaten chili in the refrigerator. It should keep for 3 to 4 days in an airtight container. You can freeze the chili if you don’t eat all of it. Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely. It will usually keep for 4 to 6 months in the freezer.",
  "sentences":[
    " Preparing Classic Chili with Ground Beef Saute the peppers, onions, and celery until tender.",
    "Add 1 tablespoon (15 ml) of vegetable oil to a Dutch oven or large soup pot.",
    "Heat it on medium heat for 3 to 5 minutes, and then add 1 chopped medium green pepper, 2 chopped medium onions, and ½ cup (115 g) of chopped celery to the pot.",
    "Cook the vegetables until they are tender, which should take approximately 5 minutes.",
    "Stir the veggies frequently to prevent them from sticking.",
    "You can substitute olive or canola oil for the vegetable if you prefer.",
    "Mix in the ground beef and cook until it is browned.",
    "After you’ve sauteed the vegetables for several minutes, add 2 pounds (907 g) of ground beef to the pot.",
    "Allow the mixture to cook until the beef is completely browned, which should take 5 to 10 minutes.",
    "Drain off the excess fat when the meat is finished cooking.",
    "For the best results, use extra-lean ground beef.",
    "You can substitute another ground meat, such as ground turkey or chicken, for the beef if you prefer.",
    "Just make sure that the meat is cooked through before moving onto the next step.",
    "Stir in tomatoes, tomato sauce, water, Worcestershire sauce, and seasonings.",
    "Once the meat is browned and you’ve drained the fat from the pan, add two 28-ounce (794 g) cans of diced tomatoes with the juice, an 8-ounce (227 g) can of tomato sauce, 1 cup (237 ml) of water, 2 tablespoons (30 ml) of Worcestershire sauce, 1 to 2 tablespoons (8 to 16 g) of chili powder, 1 teaspoon (3 g) of garlic powder, 1 teaspoon (2 g) of ground oregano, 1 teaspoon (2 g) of ground cumin, 1 teaspoon (6 g) of salt, and ½ teaspoon (1 g) of pepper to the pot.",
    "Mix the ingredients well to ensure that they’re fully incorporated.",
    "You can adjust the amount of the chili powder depending on your personal tastes.",
    "Instead of using the individual spices, you can also use a premixed chili seasoning packet from the grocery store, which typically contains chili powder, garlic powder, oregano, cumin, and other spices.",
    "Bring the mixture to a boil.",
    "After you’ve mixed all of the ingredients together, raise the heat to medium-high.",
    "Allow the mixture to come to a boil, which should take approximately 5 to 10 minutes.",
    "Leave the pot uncovered as you bring it to a boil.",
    "Stir the pot regularly as you heat it to ensure that none of the ingredients stick to the bottom or sides.",
    "Cover the pot and simmer for an hour and a half.",
    "When the pot reaches a boil, lower the heat to medium-low or low.",
    "Place the lid on the pot, and let it simmer for an hour and a half.",
    "If you don’t have a lid for your pot, you can cover it with a piece of foil or a flat baking sheet.",
    "Stir the mixture periodically to ensure that it’s cooking evenly.",
    "Add the kidney beans and simmer again.",
    "Once the mixture has simmered for an hour and a half, pour 2 15.5-ounce (439 g) cans of kidney beans that have been rinsed and drained to the pot.",
    "Mix them into the chili well, and let it simmer for another 10 minutes.",
    "Don’t cover the pot when you simmer the chili with the beans added.",
    "Spoon the chili into bowls and serve.",
    "When the chili has been simmered for another 10 minutes with the beans, remove it from the heat.",
    "Use a ladle to place it into individual bowls and serve.",
    "Classic chili is often served with toppings such as shredded cheddar cheese, sour cream, chopped onions, and tortilla chips.",
    "Store any uneaten chili in the refrigerator.",
    "It should keep for 3 to 4 days in an airtight container.",
    "You can freeze the chili if you don’t eat all of it.",
    "Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely.",
    "It will usually keep for 4 to 6 months in the freezer.",
    "Whipping Up Vegetarian Chili Heat the oil.",
    "Add 3 tablespoons (45 ml) of olive oil to a large, heavy pot on the stove.",
    "Turn the heat to medium-high, and allow the oil to heat until it begins to shimmer, which should take approximately 5 minutes.",
    "You can substitute canola oil for the olive oil if you prefer.",
    "Saute the garlic and onion until tender and fragrant.",
    "Once the olive oil is heated, add 1 large, coarsely chopped onion and 6 large, minced garlic cloves to the pot.",
    "Cook the onion and garlic until the onion is tender and the garlic becomes fragrant, which should take approximately 5 minutes.",
    "Stir the veggies frequently to prevent them from sticking.",
    "You can mix chopped celery in to saute with the onion and garlic if you like.",
    "Mix in the tomatoes, green chilies, and seasonings and cook.",
    "After the onion and garlic have cooked for several minutes, add three 14.5-ounce (411 g) cans of diced tomatoes with the juice, a 4-ounce (113 g) can of diced mild green chilies, 3 tablespoons (24 g) of chili powder, 1 tablespoon (6 g) of ground cumin, and 1 tablespoon (6 g) of dried oregano.",
    "Stir well to ensure that the ingredients are fully combined and allow the mixture to cook for 10 minutes so the flavors have time to meld.",
    "You can adjust the amount of chili powder to taste.",
    "Stir in the beans, peppers, and corn.",
    "Once the mixture has cooked for another 10 minutes, add a 15.5-ounce (439 g) can of rinsed and drained kidney beans, a 15.5-ounce (439 g) can of rinsed and drained black beans, 1 chopped green bell pepper, 1 yellow bell pepper, and a 10-ounce (284 g) package of frozen corn kernels to the pot.",
    "Mix well so all of the ingredients are combined.",
    "You can use any combination of green and yellow peppers that you like.",
    "You can also substitute red for one of the peppers.",
    "Reduce the heat and simmer until the chili thickens.",
    "When all of the ingredients are mixed in the pot, lower the heat to medium-low.",
    "Allow the chili to simmer for approximately 35 minutes, or until it is thick.",
    "Keep the lid off of the pot to help the chili thicken as it simmers.",
    "Make sure to stir the chili occasionally so it cooks evenly.",
    "Season the chili with salt and pepper and serve.",
    "After the chili has simmered for a half hour or so, taste it.",
    "Add salt and black pepper to taste, and spoon it into individual bowls to serve.",
    "You can top the chili with shredded cheddar cheese and sour cream if you like.",
    "It is also delicious spooned over rice.",
    "Store any uneaten chili in the refrigerator.",
    "It should keep for 3 to 4 days in an airtight container.",
    "You can freeze the chili if you don’t eat all of it.",
    "Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely.",
    "It will usually keep for 4 to 6 months in the freezer.",
    "Cooking Texas Style Chili Toast the chiles in a pan.",
    "Add 6 to 8 dried, whole New Mexico chiles to a large, straight-sided skillet.",
    "Heat the chiles over medium-low to gently toast them until they become fragrant.",
    "It should take approximately 2 to 3 minutes on each side of the chiles.",
    "You can substitute guajillo or pasilla chiles for the New Mexico.",
    "You can also use any combination of the three.",
    "Make sure not to let the chiles burn or they will become bitter.",
    "Soak the toasted chilies in water.",
    "After the chiles are toasted, transfer them to a bowl.",
    "Cover them with very hot water, and allow the chiles to soak for 15 to 45 minutes or until they are soft.",
    "The water that you soak the chiles in doesn’t have to be boiling.",
    "Use the water from your tap’s hottest setting to soak them.",
    "Drain the chilies and remove the seeds and stems.",
    "Once the chiles are soft, remove them from the water.",
    "Use a sharp knife to cut off the stems and split the chiles open to take out the seeds.",
    "Handling hot chiles can irritate your skin and eyes.",
    "It’s a good idea to wear rubber gloves when cutting the chiles open.",
    "Running the chiles under water can help rinse out the seeds.",
    "Be careful not to rinse away any of the flesh, though.",
    "Combine the chilies, cumin, black pepper, some salt, and some water in a blender.",
    "After you’ve removed the stems and seeds, add the chiles to a blender with 1 ½ teaspoons (3 g) of ground cumin, ½ teaspoon (1 g) of freshly ground black pepper, 1 tablespoon (18 g) of kosher salt, and ¼ cup (59 ml) of water.",
    "Puree the mixture until it forms a smooth, slightly liquid-y paste.",
    "Set the paste aside.",
    "If the mixture is too thick, you can gradually mix more water into the paste.",
    "You may need to scrape down the sides of the blender’s pitcher with a spatula to ensure that all of the ingredients are fully blended.",
    "Heat the oil and brown the beef in two batches.",
    "Heat 2 tablespoons (30 ml) of vegetable oil in the skillet over medium-high heat.",
    "Add half of 2 ½ pounds (1.1 kg) of boneless beef chuck that’s been trimmed and cut into ¾-inch (19-mm) cubes, and lightly brown the meat on at least two sides, which should take about 3 minutes per side.",
    "Transfer the cooked meat to a bowl, and repeat the process with another 2 tablespoons (30 ml) of the oil and the rest of the meat.",
    "Transfer the cooked meat to a bowl.",
    "Make sure to swirl the oil throughout the skillet so it is fully greased.",
    "Be careful not the burn the meat.",
    "If you suspect that it might be cooking too quickly, lower the heat.",
    "Saute the onion and garlic.",
    "Allow the skillet to cool for 5 to 10 minutes before returning it to the stove on medium low heat.",
    "Add the remaining 1 tablespoon (15 ml) of oil, ⅓ cup (50 g) of finely chopped onion, and 3 large, minced cloves of garlic to the skillet, and saute the onion and garlic for 3 to 4 minutes.",
    "Stir the onion and garlic periodically as you saute them to ensure that they cook evenly.",
    "Stir in in the stock, water, and masa harina.",
    "Once the onion and garlic have sauteed for several minutes, add 2 cups (473 ml) of beef stock, 2 cups (473 ml) of water, and 2 tablespoons (14 g) of masa harina to the skillet.",
    "Whisk the ingredients together to ensure that there are no lumps.",
    "Masa harina is a finely ground corn flour.",
    "You can usually find it in the Mexican or international foods aisle at the grocery store.",
    "Mix in the chile paste and cooked beef and simmer.",
    "After you’ve mixed in the stock, water, and masa harina, add the chile paste that you made earlier and the cooked beef to the skillet.",
    "Raise the heat to high, and bring the mixture to a simmer.",
    "If there are any juices in the bowl with the cooked beef, add them to the skillet as well.",
    "As you stir the chile paste and meat into the skillet, make sure to scrape the bottom to lift any browned bits and mix them in as well.",
    "Reduce heat and cook the mixture for 2 hours.",
    "When the mixture begins to simmer, turn the heat down to low.",
    "Allow the mixture to cook for about two hours or until the meat is tender but still slightly firm.",
    "Keep the lid off to allow some of the liquid to evaporate.",
    "This will help the chili thicken.",
    "Stir the mixture periodically as it simmers to ensure that it cooks evenly.",
    "Add the brown sugar, vinegar, and salt to taste and simmer again with the lid off.",
    "After the mixture has simmered for a couple of hours, mix 1 tablespoon (13 g) of firmly packed dark brown sugar, 1 ½ tablespoons (22 ½ ml) of distilled white vinegar, and more salt to taste into the skillet.",
    "Allow the mixture to simmer for another 10 minutes.",
    "It’s normal for the chili to appear to have too much sauce even after simmering.",
    "The next step will help absorb some of it.",
    "Remove the chili from heat and allow it to stand.",
    "When the chili has finished simmering, turn off the heat.",
    "Let it stand for about 30 minutes, or until the meat absorbs approximately half of the sauce in the pan.",
    "Adjust the consistency and seasonings of the chili if necessary.",
    "After the chili has had a chance to stand for a half hour, stir it to determine if the consistency is right.",
    "Taste it as well to see if you want to add more of any of the seasonings.",
    "If the chili seems too dry, mix in more broth and/or water.",
    "If the chili seems too liquidy, turn the heat back on and allow it to simmer until it thickens further.",
    "Mix in additional salt, brown sugar, and/or vinegar to suit your taste.",
    "Reheat the chili and ladle it into bowls to serve.",
    "Turn the heat back on under the skillet to low or medium-low and reheat the chili gently.",
    "When it’s warmed through, transfer it into individual bowls and serve the chili with a lime wedge and spoonful of sour cream.",
    "Store any uneaten chili in the refrigerator.",
    "It should keep for 3 to 4 days in an airtight container.",
    "You can freeze the chili if you don’t eat all of it.",
    "Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely.",
    "It will usually keep for 4 to 6 months in the freezer.",
    "Putting Together White Chili Saute the onions until they are tender.",
    "Pour 1 tablespoon (15 ml) of olive oil into a large heavy-bottomed pot, and heat it on medium-high heat.",
    "Add 1 medium chopped onion, and cook it until it is tender, which should take approximately 4 to 5 minutes.",
    "Stir the veggies frequently to prevent them from sticking.",
    "You can substitute canola oil for the olive oil if you prefer.",
    "Mix in the garlic, cumin, cloves, and cayenne.",
    "After you’ve sauteed the onion, add 1 minced clove of garlic, ¼ teaspoon (½ g) of cayenne pepper, ⅛ teaspoon (¼ g) of ground cloves, and 2 teaspoons (6 g) ground cumin to the pot.",
    "Let the mixture cook for another minute.",
    "You can add more cayenne pepper if you would like the chili to have more of a spicy kick.",
    "Stir in the green chilies, dried oregano, and jalapeno.",
    "When you’ve cooked the onion mixture for another minute, add two 4-ounce (113 g) cans of chopped green chilies, 1 ½ teaspoons (3 g) of dried oregano, and 1 finely chopped jalapeno pepper to the pot.",
    "Mix well so the ingredients are fully incorporated.",
    "You can substitute a serrano pepper for the jalapeno if you prefer.",
    "Add the chicken and chicken stock and bring to a simmer.",
    "After you’ve mixed in the chiles and oregano, stir 3 cups (375 g) of diced, cooked chicken and 3 cups (709 ml) of chicken stock into the pot.",
    "Raise the heat to high, and allow the mixture to come to a simmer.",
    "If you don’t want to cook your own chicken, you can use a rotisserie chicken from the grocery store.",
    "Remove it from the bone and dice or shred it before mixing it in.",
    "Lower the heat and simmer for another 5 minutes.",
    "Once the mixture comes to a simmer, reduce the heat to low and place a lid on the pot.",
    "Allow the chili to cook for another 5 to 10 minutes or until the chicken is warmed through.",
    "Mix in the beans and cook for another 15 minutes.",
    "When the chili has simmered with the chicken mixed in, add two 15.5-ounce (439 g) cans of white beans that have been drained.",
    "Allow the mixture to cook for another 15 minutes.",
    "You can leave the lid off the pot when you simmer the chili for the final time.",
    "Season the chili to taste and top with the cheese to serve.",
    "After you’ve simmered the beans with the chili, taste it.",
    "Add in more salt and pepper if necessary before ladling the chili into bowls.",
    "Top the bowls with some shredded Monterey Jack cheese, and serve.",
    "You can also top the chili with chopped tomato, chopped scallions, cilantro, guacamole, and/or tortilla chips.",
    "Store any uneaten chili in the refrigerator.",
    "It should keep for 3 to 4 days in an airtight container.",
    "You can freeze the chili if you don’t eat all of it.",
    "Place it in freezer-safe containers, such as plastic freezer bags, in individual serving sizes after it’s cooled completely.",
    "It will usually keep for 4 to 6 months in the freezer."
  ],
  "tyn_section":[
    "Classic Chili with Ground Beef",
    "Large Dutch oven or pot with a lid",
    "Wooden spoon",
    "Vegetarian Chili",
    "Large, heavy pot",
    "Texas Chili",
    "Large, straight-sided skillet",
    "Small bowl",
    "Knife",
    "Blender",
    "White Chili",
    "Large, heavy-bottomed pot with a lid"
  ],
  "tyn_model":[
    "pot",
    "water",
    "garlic",
    "onion",
    "skillet",
    "chili",
    "salt",
    "oil",
    "chili powder",
    "cumin",
    "olive oil",
    "chicken",
    "ground beef",
    "peppers",
    "refrigerator",
    "airtight container",
    "bowl",
    "masa harina",
    "celery",
    "canola oil",
    "seasonings",
    "kidney beans",
    "sour cream",
    "green chilies",
    "dried oregano",
    "blender",
    "onions",
    "vegetable oil",
    "tomatoes",
    "tomato sauce",
    "worcestershire sauce",
    "diced tomatoes",
    "garlic powder",
    "oregano",
    "bowls",
    "cheddar cheese",
    "tortilla chips",
    "stove",
    "beans",
    "salt and pepper",
    "black pepper",
    "stock",
    "beef",
    "brown sugar",
    "vinegar",
    "cayenne pepper",
    "jalapeno",
    "chicken stock",
    "dutch oven",
    "large soup pot",
    "medium green pepper",
    "medium onions",
    "olive or",
    "vegetables",
    "ground turkey",
    "ground oregano,",
    "ground cumin,",
    "pepper",
    "chili seasoning",
    "foil",
    "baking sheet",
    "ladle",
    "mild green chilies",
    "ground cumin",
    "corn",
    "black beans",
    "green bell pepper",
    "yellow bell pepper",
    "frozen corn kernels",
    "rice",
    "pan",
    "large, straight-sided skillet",
    "chilies",
    "freshly ground black pepper",
    "kosher salt",
    "spatula",
    "⅓ cup",
    "beef stock",
    "corn flour",
    "chile paste",
    "chile",
    "dark brown sugar",
    "distilled white vinegar",
    "broth",
    "lime wedge",
    "white chili",
    "heavy-bottomed pot",
    "cloves",
    "cayenne",
    "⅛ teaspoon",
    "ground cloves",
    "jalapeno pepper",
    "serrano pepper",
    "chiles",
    "rotisserie chicken",
    "white beans",
    "monterey jack cheese",
    "tomato",
    "scallions",
    "cilantro",
    "guacamole",
    "freezer bags",
    "freezer"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0291262136,
    "f1":0.052173913,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.0485436893,
    "f1":0.0884955752
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.1165048544,
    "f1":0.2016806723
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0291262136,
    "f1":0.052173913
  }
}