{
  "title":"How to Draw a Cheetah Print",
  "url":"https://www.wikihow.com/Draw-a-Cheetah-Print",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Shapes",
    "Drawing Patterns and Prints"
  ],
  "methods":[
    {
      "name":"A Furry Cheetah Print",
      "steps":[
        {
          "headline":"Draw small circles, irregular ovals or spots that are evenly spaced from each other.",
          "description":""
        },
        {
          "headline":"Color the spots with a shade of gray or black, and the spaces orange.",
          "description":""
        },
        {
          "headline":"Draw or color details for the fur that overlaps the spots a little – use orange color.",
          "description":""
        },
        {
          "headline":"Draw or color details for effects around the spots – use dark color or shade of black at the other side of the spots.",
          "description":""
        }
      ]
    },
    {
      "name":"A Cartoon Cheetah Print",
      "steps":[
        {
          "headline":"Draw small circles, irregular ovals or spots that are evenly spaced from each other.",
          "description":"Color the spots with shades of black of gray."
        },
        {
          "headline":"Color the spaces with orange and draw or color strokes of light yellow.",
          "description":""
        },
        {
          "headline":"Draw or color with additional yellow strokes to create effects of fur.",
          "description":""
        },
        {
          "headline":"Refine the drawing and add color effects.",
          "description":""
        }
      ]
    },
    {
      "name":"Round Black Spots",
      "steps":[
        {
          "headline":"Color all of the work area with beige.",
          "description":"Then use a lighter color and apply small strokes to simulate fur."
        },
        {
          "headline":"Plot out black spots.",
          "description":"Make sure the spots are solid black so that the print won't be confused with a leopard print."
        },
        {
          "headline":"Add some lighter color of beige over the first 2 layers avoiding but also painting over the edges of some spots to give it a natural look.",
          "description":""
        }
      ]
    },
    {
      "name":"Blotchy Lighter Spots",
      "steps":[
        {
          "headline":"Sketch out several spots.",
          "description":"Make them uneven so that they look natural."
        },
        {
          "headline":"Blacken out the sketched spots.",
          "description":""
        },
        {
          "headline":"Erase the outer edges of the spots to make them look a bit jagged.",
          "description":""
        },
        {
          "headline":"Copy the pattern made until it covers the whole work space.",
          "description":""
        },
        {
          "headline":"Add any shade of yellow to brown to the background.",
          "description":"And there you have it, a finished cheetah print."
        }
      ]
    }
  ],
  "text":" A Furry Cheetah Print Draw small circles, irregular ovals or spots that are evenly spaced from each other.  Color the spots with a shade of gray or black, and the spaces orange.  Draw or color details for the fur that overlaps the spots a little – use orange color.  Draw or color details for effects around the spots – use dark color or shade of black at the other side of the spots.  A Cartoon Cheetah Print Draw small circles, irregular ovals or spots that are evenly spaced from each other. Color the spots with shades of black of gray. Color the spaces with orange and draw or color strokes of light yellow.  Draw or color with additional yellow strokes to create effects of fur.  Refine the drawing and add color effects.  Round Black Spots Color all of the work area with beige. Then use a lighter color and apply small strokes to simulate fur. Plot out black spots. Make sure the spots are solid black so that the print won't be confused with a leopard print. Add some lighter color of beige over the first 2 layers avoiding but also painting over the edges of some spots to give it a natural look.  Blotchy Lighter Spots Sketch out several spots. Make them uneven so that they look natural. Blacken out the sketched spots.  Erase the outer edges of the spots to make them look a bit jagged.  Copy the pattern made until it covers the whole work space.  Add any shade of yellow to brown to the background. And there you have it, a finished cheetah print.",
  "sentences":[
    " A Furry Cheetah Print Draw small circles, irregular ovals or spots that are evenly spaced from each other.",
    "Color the spots with a shade of gray or black, and the spaces orange.",
    "Draw or color details for the fur that overlaps the spots a little – use orange color.",
    "Draw or color details for effects around the spots – use dark color or shade of black at the other side of the spots.",
    "A Cartoon Cheetah Print Draw small circles, irregular ovals or spots that are evenly spaced from each other.",
    "Color the spots with shades of black of gray.",
    "Color the spaces with orange and draw or color strokes of light yellow.",
    "Draw or color with additional yellow strokes to create effects of fur.",
    "Refine the drawing and add color effects.",
    "Round Black Spots Color all of the work area with beige.",
    "Then use a lighter color and apply small strokes to simulate fur.",
    "Plot out black spots.",
    "Make sure the spots are solid black so that the print won't be confused with a leopard print.",
    "Add some lighter color of beige over the first 2 layers avoiding but also painting over the edges of some spots to give it a natural look.",
    "Blotchy Lighter Spots Sketch out several spots.",
    "Make them uneven so that they look natural.",
    "Blacken out the sketched spots.",
    "Erase the outer edges of the spots to make them look a bit jagged.",
    "Copy the pattern made until it covers the whole work space.",
    "Add any shade of yellow to brown to the background.",
    "And there you have it, a finished cheetah print."
  ],
  "tyn_section":[
    "Paper",
    "Pencil",
    "Pencil sharpener",
    "Eraser gum",
    "Colored pencils, crayons, markers or watercolors",
    "your hand"
  ],
  "tyn_model":[
    "– use",
    "furry cheetah",
    "fur",
    "beige"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}