{
  "title":"How to Make Homemade Nutella",
  "url":"https://www.wikihow.com/Make-Homemade-Nutella",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Making Chocolate"
  ],
  "parts":[
    {
      "name":"Preparing the Chocolate",
      "steps":[
        {
          "headline":"Choose the type of chocolate you want to use in your spread.",
          "description":"Look for a high-quality chocolate bar or discs (chips have less cocoa butter and are harder to melt). Different types of chocolate will have different percentages of milk and cacao, which will affect the taste and appearance of your hazelnut spread. Milk chocolate has a low percentage of cocoa solids and has a very sweet flavor. It is used in many popular candy bars. This is a good choice if you want your chocolate spread to be sweet, mellow, and not too chocolatey. Semi-sweet chocolate is most often used in chocolate chip cookies. It has less sugar and higher percentage of cocoa solids (40%-60%) than milk chocolate and will give you a rich chocolate flavor. Higher percentages can have a slightly bitter taste. Bittersweet chocolate can have a similar flavor to semi-sweet. It contains little sugar but more chocolate liquor. It usually contains between 60%-85% cocoa solids. This is a good choice if you want a spread that is less sweet, slightly bitter, and very chocolatey. Avoid unsweetened chocolate, which should only be used for baking."
        },
        {
          "headline":"Break the chocolate into pieces and rough chop it.",
          "description":"This makes it easier to melt the chocolate later. Always use a sharp knife (more accidents occur with dull knives)."
        },
        {
          "headline":"Collect the chopped chocolate into a small bowl.",
          "description":"If you plan to melt the chocolate in the microwave, make sure it is a microwave-safe bowl. Set the bowl aside to melt when after the hazelnuts are toasted--this will take some time and your chocolate will probably harden again if you melt it now."
        }
      ]
    },
    {
      "name":"Toasting the Hazelnuts",
      "steps":[
        {
          "headline":"Preheat the oven to 350ºF (176ºC).",
          "description":"If you don't have an oven, it is possible to toast the hazelnuts on a stovetop. Heat a large frying pan on medium-high heat. Add the nuts (don't use any oil or spray, as the nuts are naturally oily) and stir constantly with a spatula until golden brown."
        },
        {
          "headline":"Spread 1 cup hazelnuts on a baking sheet lined with parchment paper.",
          "description":"The hazelnuts should fit on the sheet in a single layer--they should not overlap or sit on top of each other or they may bake unevenly or steam instead of toast. You can also line the baking pan with a silicone sheet, which is reusable and easy to clean. Use a rimmed baking sheet so the hazelnuts don't roll off as you put them in the oven."
        },
        {
          "headline":"Toast the hazelnuts in the oven for 10-12 minutes.The skins should be browned and slightly blistered when done.",
          "description":"Remove them from the oven and allow them to cool slightly. If you don't have the time or means to toast the hazelnuts, you can purchase dry roasted, unsalted hazelnuts at some grocery stores and use them instead."
        },
        {
          "headline":"Remove the skins from the toasted hazelnuts.",
          "description":"One way to do this is by wrapping the nuts into a kitchen towel or tea towel (make sure it's one you don't mind possibly staining). Rub the wrapped nuts vigorously. This should remove most of the skins (it's okay if some skin remains). Remove the hazelnuts from the towel, leaving the skins behind, and allow them to cool. You can also put the hazelnuts in a mesh bag (the kind in which bulk citrus is sold) and use your hands to rub them together over a sink. The hazelnuts will stay in the bag while most of the skins will fall through the mesh and into the sink. A more time-consuming method is to peel off the skins by hand. Again, don't worry if you don't get every single scrap of skin."
        }
      ]
    },
    {
      "name":"Melting the Chocolate",
      "steps":[
        {
          "headline":"Prepare a bain marie (double boiler).",
          "description":"This is when you have one pot of boiling water and fit another pot on top. The top pot is where you will put your chocolate. This method heats the chocolate gradually and keeps it from burning. You can also heat the chocolate in a microwave. In a microwave-safe bowl, heat the chocolate in 15-second intervals, stirring in between. Heat and stir until the chocolate completely smooth."
        },
        {
          "headline":"Pour the chopped chocolate into the top part of the bain marie.",
          "description":"Though the bain marie should keep the chocolate from burning, chocolate can overheat and burn very easily. Keep an eye on the chocolate, stirring until it is smooth and melted, with no little lumps. Remove the bowl of chocolate from the heat once melted. Set it aside and allow it to cool."
        }
      ]
    },
    {
      "name":"Creating the Chocolate-Hazelnut Spread",
      "steps":[
        {
          "headline":"Use a food processor to grind the hazelnuts into a paste.",
          "description":"Grind the nuts in 1-minute increments to prevent your machine from overheating. The hazelnuts will first become a powder and then, as the natural oils are released, it will form into a paste. Make sure you stop to constantly scrape the sides of the bowl. If you don't have a food processor, you can use a high-powered blender."
        },
        {
          "headline":"Add 2 tbsp oil, 3 tablespoon (44.4 ml) sugar, 2 tbsp cocoa powder, 3/4 tsp salt and 1/2 tsp vanilla extract.",
          "description":"Continue processing in 1-minute increments until the mixture is completely smooth. Some people like a little texture in their hazelnut spread, so if you like it crunchy make sure you don't blend out all of the chunks of hazelnut. Make sure your vegetable oil is relatively flavorless--like canola or grapeseed oil. Or, if you want to add some complexity to the taste, you can use coconut or peanut oil. If you like your spread a little on the salty side, add another pinch of salt to the mix."
        },
        {
          "headline":"Pour the melted chocolate into the nut butter.",
          "description":"Process until well combined, pausing to scrape the sides to make sure the chocolate is completely incorporated.You may want to taste it at this point to decide if you want to add more salt or sugar. The mixture may be quite thing and runny at this point, but don't worry--it will thicken up as it cools."
        },
        {
          "headline":"Strain the mixture if you want your chocolate hazelnut spread to be super smooth.",
          "description":"If you prefer your spread to be chunky or don't mind a little grittiness, then you can skip this step. Otherwise, hold a fine sieve over a bowl and carefully pour the mixture through (you might want to get someone to hold the sieve so you don't spill any of the delicious spread). If your spread seems to thick, you can add a little extra oil to make it more spreadable."
        },
        {
          "headline":"Pour the still-warm chocolate hazelnut spread into your storage jar.",
          "description":"Allow the spread to completely cool to room temperature before covering. Store in the refrigerator or on the counter at room-temperature. It may last longer in the refrigerator, but may need to be warmed before use to get the right consistency. If you live in a warmer climate, store it in the refrigerator. Consider pouring the spread into several small jars and giving them as gifts to your friends."
        }
      ]
    }
  ],
  "text":" Preparing the Chocolate Choose the type of chocolate you want to use in your spread. Look for a high-quality chocolate bar or discs (chips have less cocoa butter and are harder to melt). Different types of chocolate will have different percentages of milk and cacao, which will affect the taste and appearance of your hazelnut spread. Milk chocolate has a low percentage of cocoa solids and has a very sweet flavor. It is used in many popular candy bars. This is a good choice if you want your chocolate spread to be sweet, mellow, and not too chocolatey. Semi-sweet chocolate is most often used in chocolate chip cookies. It has less sugar and higher percentage of cocoa solids (40%-60%) than milk chocolate and will give you a rich chocolate flavor. Higher percentages can have a slightly bitter taste. Bittersweet chocolate can have a similar flavor to semi-sweet. It contains little sugar but more chocolate liquor. It usually contains between 60%-85% cocoa solids. This is a good choice if you want a spread that is less sweet, slightly bitter, and very chocolatey. Avoid unsweetened chocolate, which should only be used for baking. Break the chocolate into pieces and rough chop it. This makes it easier to melt the chocolate later. Always use a sharp knife (more accidents occur with dull knives). Collect the chopped chocolate into a small bowl. If you plan to melt the chocolate in the microwave, make sure it is a microwave-safe bowl. Set the bowl aside to melt when after the hazelnuts are toasted--this will take some time and your chocolate will probably harden again if you melt it now. Toasting the Hazelnuts Preheat the oven to 350ºF (176ºC). If you don't have an oven, it is possible to toast the hazelnuts on a stovetop. Heat a large frying pan on medium-high heat. Add the nuts (don't use any oil or spray, as the nuts are naturally oily) and stir constantly with a spatula until golden brown. Spread 1 cup hazelnuts on a baking sheet lined with parchment paper. The hazelnuts should fit on the sheet in a single layer--they should not overlap or sit on top of each other or they may bake unevenly or steam instead of toast. You can also line the baking pan with a silicone sheet, which is reusable and easy to clean. Use a rimmed baking sheet so the hazelnuts don't roll off as you put them in the oven. Toast the hazelnuts in the oven for 10-12 minutes.The skins should be browned and slightly blistered when done. Remove them from the oven and allow them to cool slightly. If you don't have the time or means to toast the hazelnuts, you can purchase dry roasted, unsalted hazelnuts at some grocery stores and use them instead. Remove the skins from the toasted hazelnuts. One way to do this is by wrapping the nuts into a kitchen towel or tea towel (make sure it's one you don't mind possibly staining). Rub the wrapped nuts vigorously. This should remove most of the skins (it's okay if some skin remains). Remove the hazelnuts from the towel, leaving the skins behind, and allow them to cool. You can also put the hazelnuts in a mesh bag (the kind in which bulk citrus is sold) and use your hands to rub them together over a sink. The hazelnuts will stay in the bag while most of the skins will fall through the mesh and into the sink. A more time-consuming method is to peel off the skins by hand. Again, don't worry if you don't get every single scrap of skin. Melting the Chocolate Prepare a bain marie (double boiler). This is when you have one pot of boiling water and fit another pot on top. The top pot is where you will put your chocolate. This method heats the chocolate gradually and keeps it from burning. You can also heat the chocolate in a microwave. In a microwave-safe bowl, heat the chocolate in 15-second intervals, stirring in between. Heat and stir until the chocolate completely smooth. Pour the chopped chocolate into the top part of the bain marie. Though the bain marie should keep the chocolate from burning, chocolate can overheat and burn very easily. Keep an eye on the chocolate, stirring until it is smooth and melted, with no little lumps. Remove the bowl of chocolate from the heat once melted. Set it aside and allow it to cool. Creating the Chocolate-Hazelnut Spread Use a food processor to grind the hazelnuts into a paste. Grind the nuts in 1-minute increments to prevent your machine from overheating. The hazelnuts will first become a powder and then, as the natural oils are released, it will form into a paste. Make sure you stop to constantly scrape the sides of the bowl. If you don't have a food processor, you can use a high-powered blender. Add 2 tbsp oil, 3 tablespoon (44.4 ml) sugar, 2 tbsp cocoa powder, 3/4 tsp salt and 1/2 tsp vanilla extract. Continue processing in 1-minute increments until the mixture is completely smooth. Some people like a little texture in their hazelnut spread, so if you like it crunchy make sure you don't blend out all of the chunks of hazelnut. Make sure your vegetable oil is relatively flavorless--like canola or grapeseed oil. Or, if you want to add some complexity to the taste, you can use coconut or peanut oil. If you like your spread a little on the salty side, add another pinch of salt to the mix. Pour the melted chocolate into the nut butter. Process until well combined, pausing to scrape the sides to make sure the chocolate is completely incorporated.You may want to taste it at this point to decide if you want to add more salt or sugar. The mixture may be quite thing and runny at this point, but don't worry--it will thicken up as it cools. Strain the mixture if you want your chocolate hazelnut spread to be super smooth. If you prefer your spread to be chunky or don't mind a little grittiness, then you can skip this step. Otherwise, hold a fine sieve over a bowl and carefully pour the mixture through (you might want to get someone to hold the sieve so you don't spill any of the delicious spread). If your spread seems to thick, you can add a little extra oil to make it more spreadable. Pour the still-warm chocolate hazelnut spread into your storage jar. Allow the spread to completely cool to room temperature before covering. Store in the refrigerator or on the counter at room-temperature. It may last longer in the refrigerator, but may need to be warmed before use to get the right consistency. If you live in a warmer climate, store it in the refrigerator. Consider pouring the spread into several small jars and giving them as gifts to your friends.",
  "sentences":[
    " Preparing the Chocolate Choose the type of chocolate you want to use in your spread.",
    "Look for a high-quality chocolate bar or discs (chips have less cocoa butter and are harder to melt).",
    "Different types of chocolate will have different percentages of milk and cacao, which will affect the taste and appearance of your hazelnut spread.",
    "Milk chocolate has a low percentage of cocoa solids and has a very sweet flavor.",
    "It is used in many popular candy bars.",
    "This is a good choice if you want your chocolate spread to be sweet, mellow, and not too chocolatey.",
    "Semi-sweet chocolate is most often used in chocolate chip cookies.",
    "It has less sugar and higher percentage of cocoa solids (40%-60%) than milk chocolate and will give you a rich chocolate flavor.",
    "Higher percentages can have a slightly bitter taste.",
    "Bittersweet chocolate can have a similar flavor to semi-sweet.",
    "It contains little sugar but more chocolate liquor.",
    "It usually contains between 60%-85% cocoa solids.",
    "This is a good choice if you want a spread that is less sweet, slightly bitter, and very chocolatey.",
    "Avoid unsweetened chocolate, which should only be used for baking.",
    "Break the chocolate into pieces and rough chop it.",
    "This makes it easier to melt the chocolate later.",
    "Always use a sharp knife (more accidents occur with dull knives).",
    "Collect the chopped chocolate into a small bowl.",
    "If you plan to melt the chocolate in the microwave, make sure it is a microwave-safe bowl.",
    "Set the bowl aside to melt when after the hazelnuts are toasted--this will take some time and your chocolate will probably harden again if you melt it now.",
    "Toasting the Hazelnuts Preheat the oven to 350ºF (176ºC).",
    "If you don't have an oven, it is possible to toast the hazelnuts on a stovetop.",
    "Heat a large frying pan on medium-high heat.",
    "Add the nuts (don't use any oil or spray, as the nuts are naturally oily) and stir constantly with a spatula until golden brown.",
    "Spread 1 cup hazelnuts on a baking sheet lined with parchment paper.",
    "The hazelnuts should fit on the sheet in a single layer--they should not overlap or sit on top of each other or they may bake unevenly or steam instead of toast.",
    "You can also line the baking pan with a silicone sheet, which is reusable and easy to clean.",
    "Use a rimmed baking sheet so the hazelnuts don't roll off as you put them in the oven.",
    "Toast the hazelnuts in the oven for 10-12 minutes.The skins should be browned and slightly blistered when done.",
    "Remove them from the oven and allow them to cool slightly.",
    "If you don't have the time or means to toast the hazelnuts, you can purchase dry roasted, unsalted hazelnuts at some grocery stores and use them instead.",
    "Remove the skins from the toasted hazelnuts.",
    "One way to do this is by wrapping the nuts into a kitchen towel or tea towel (make sure it's one you don't mind possibly staining).",
    "Rub the wrapped nuts vigorously.",
    "This should remove most of the skins (it's okay if some skin remains).",
    "Remove the hazelnuts from the towel, leaving the skins behind, and allow them to cool.",
    "You can also put the hazelnuts in a mesh bag (the kind in which bulk citrus is sold) and use your hands to rub them together over a sink.",
    "The hazelnuts will stay in the bag while most of the skins will fall through the mesh and into the sink.",
    "A more time-consuming method is to peel off the skins by hand.",
    "Again, don't worry if you don't get every single scrap of skin.",
    "Melting the Chocolate Prepare a bain marie (double boiler).",
    "This is when you have one pot of boiling water and fit another pot on top.",
    "The top pot is where you will put your chocolate.",
    "This method heats the chocolate gradually and keeps it from burning.",
    "You can also heat the chocolate in a microwave.",
    "In a microwave-safe bowl, heat the chocolate in 15-second intervals, stirring in between.",
    "Heat and stir until the chocolate completely smooth.",
    "Pour the chopped chocolate into the top part of the bain marie.",
    "Though the bain marie should keep the chocolate from burning, chocolate can overheat and burn very easily.",
    "Keep an eye on the chocolate, stirring until it is smooth and melted, with no little lumps.",
    "Remove the bowl of chocolate from the heat once melted.",
    "Set it aside and allow it to cool.",
    "Creating the Chocolate-Hazelnut Spread Use a food processor to grind the hazelnuts into a paste.",
    "Grind the nuts in 1-minute increments to prevent your machine from overheating.",
    "The hazelnuts will first become a powder and then, as the natural oils are released, it will form into a paste.",
    "Make sure you stop to constantly scrape the sides of the bowl.",
    "If you don't have a food processor, you can use a high-powered blender.",
    "Add 2 tbsp oil, 3 tablespoon (44.4 ml) sugar, 2 tbsp cocoa powder, 3/4 tsp salt and 1/2 tsp vanilla extract.",
    "Continue processing in 1-minute increments until the mixture is completely smooth.",
    "Some people like a little texture in their hazelnut spread, so if you like it crunchy make sure you don't blend out all of the chunks of hazelnut.",
    "Make sure your vegetable oil is relatively flavorless--like canola or grapeseed oil.",
    "Or, if you want to add some complexity to the taste, you can use coconut or peanut oil.",
    "If you like your spread a little on the salty side, add another pinch of salt to the mix.",
    "Pour the melted chocolate into the nut butter.",
    "Process until well combined, pausing to scrape the sides to make sure the chocolate is completely incorporated.You may want to taste it at this point to decide if you want to add more salt or sugar.",
    "The mixture may be quite thing and runny at this point, but don't worry--it will thicken up as it cools.",
    "Strain the mixture if you want your chocolate hazelnut spread to be super smooth.",
    "If you prefer your spread to be chunky or don't mind a little grittiness, then you can skip this step.",
    "Otherwise, hold a fine sieve over a bowl and carefully pour the mixture through (you might want to get someone to hold the sieve so you don't spill any of the delicious spread).",
    "If your spread seems to thick, you can add a little extra oil to make it more spreadable.",
    "Pour the still-warm chocolate hazelnut spread into your storage jar.",
    "Allow the spread to completely cool to room temperature before covering.",
    "Store in the refrigerator or on the counter at room-temperature.",
    "It may last longer in the refrigerator, but may need to be warmed before use to get the right consistency.",
    "If you live in a warmer climate, store it in the refrigerator.",
    "Consider pouring the spread into several small jars and giving them as gifts to your friends."
  ],
  "tyn_section":[
    "Cutting board and sharp kitchen knife",
    "Small bowl",
    "Bain marie (double boiler) or microwave",
    "Food processor or high-powered blender",
    "Wooden spoon",
    "Baking sheet",
    "Oven",
    "Parchment paper or silicone baking sheet",
    "Clean storage jar"
  ],
  "tyn_model":[
    "chocolate",
    "hazelnuts",
    "bowl",
    "oven",
    "salt",
    "refrigerator",
    "milk chocolate",
    "microwave",
    "nuts",
    "baking sheet",
    "food processor",
    "oil",
    "sugar",
    "chocolate hazelnut",
    "sieve",
    "chocolate bar",
    "candy bars",
    "chocolate chip cookies",
    "bittersweet chocolate",
    "chocolate liquor",
    "large frying pan",
    "spatula",
    "parchment paper",
    "baking pan",
    "silicone sheet",
    "kitchen towel",
    "tea towel",
    "towel",
    "mesh bag",
    "citrus",
    "double boiler",
    "water",
    "microwave-safe bowl",
    "blender",
    "cocoa powder",
    "vanilla extract",
    "vegetable oil",
    "canola or",
    "grapeseed oil",
    "coconut or",
    "nut butter"
  ],
  "simple_metrics":{
    "r":0.2222222222,
    "p":0.0487804878,
    "f1":0.08,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0731707317,
    "f1":0.12
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5555555556,
    "p":0.1951219512,
    "f1":0.2888086643
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2222222222,
    "p":0.0487804878,
    "f1":0.08
  }
}