{
  "title":"How to Make Cake Mix Cookies",
  "url":"https://www.wikihow.com/Make-Cake-Mix-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Butter Cookies and Biscuits"
  ],
  "methods":[
    {
      "name":"Baking Classic Cake Mix Cookies",
      "steps":[
        {
          "headline":"Preheat the oven to 350 °F (177 °C).",
          "description":"An oven typically takes about 20 to 30 minutes to heat up. Turn it on before you start preparing the cookies so that it’s at the right temperature when you’re ready for it. If you want to warm up your oven faster, turn it on the broil setting first, which creates super intense heat. Then switch it to the regular bake setting before you put the cookies in."
        },
        {
          "headline":"Combine the box of cake mix, vegetable oil, and eggs in a mixing bowl.",
          "description":"Using a spoon or an electric mixer, blend the 1 18.25 ounces (517 g) box of cake mix, ⁄2 cup (120 ml) of vegetable oil, and 2 eggs together until they’re completely combined. Make sure there aren’t any clumps of cake mix left. For an alternative to vegetable oil, melt 1/2 cup (115 g) of butter. You can also substitute a different type of oil, like olive or canola oil. If you want a lower fat option, use ⁄2 cup (120 ml) of applesauce instead of the oil. How to Choose a Cake Mix\nIf you want cookies that taste like birthday cake, go with a funfetti or vanilla mix. If you love chocolate, use devil’s food or dark chocolate cake mix. If you want something a little fancier, opt for a box of red velvet cake mix. If you’re craving fruity flavors, try strawberry or lemon cake mix. If you like cinnamon, nutmeg, and cloves, make your cookies with carrot cake or spice cake mix. If you want to use your favorite cake mix, go for it! You can pick any flavor or brand of cake mix you'd like."
        },
        {
          "headline":"Stir in 1 cup (175 g) of add-ins, like chocolate chips, if you’re using them.",
          "description":"If you’d like to add mix-ins like chocolate chips or chopped nuts, fold them into the batter now. Start with 1 cup (175 g) of the ingredient of your choice, then add more to taste if necessary. Continue stirring until the ingredient is spread evenly throughout the batter. You can choose any mix-ins based on your taste preferences. What You Can Use for Mix-Ins\nChocolate chipsButterscotch chipsM&Ms or other small candiesDried fruit, like cranberries or raisinsPretzel piecesPeanut butter cupsShredded coconut"
        },
        {
          "headline":"Scoop 1 in (2.5 cm) mounds of dough onto an ungreased baking sheet.",
          "description":"Place the scoops of dough about 1.5 inches (3.8 cm) apart on a 18 by 26 in (46 by 66 cm) sheet. This gives the cookies room to spread without running into each other while they bake. If you want to help your cookies bake more evenly, lay a piece of parchment paper over the baking sheet before you put the dough on top. You can use a spoon or a cookie scoop to transfer the dough onto the sheet."
        },
        {
          "headline":"Place the cookies in the oven to bake for 8 to 10 minutes.",
          "description":"Set the sheet on the middle rack, where the hot air can circulate best, to bake all of your cookies evenly. You’ll know they’re finished cooking when the edges of the cookies are firm but the centers are still slightly soft. If you made vanilla or another light-colored mix, the cookies will be a golden-brown color when they’re done. Use a kitchen timer or the clock app on your phone to keep track of the time."
        },
        {
          "headline":"Remove the cookies from the oven and take them off the sheet to cool.",
          "description":"Once your cookies have finished baking, take them out of the oven. Use a spatula to lift each cookie off the sheet and set them on a paper towel or wire cooling rack. If you leave the cookies on the baking sheet, the heat of the pan will continue to cook them and they could become overdone or burnt. After your cookies have cooled, you can decorate them or add toppings. Store any leftover cookies in an airtight container or resealable bag at room temperature for up to 2 weeks. If you want to keep them longer, place the container in the freezer for up to 3 months. Topping Ideas for Cake Mix Cookies\nIce them with frosting. Drizzle melted chocolate over top of the cookies. Add sprinkles for a festive touch. Make a cookie sandwich by smearing a layer of frosting between 2 cookies."
        }
      ]
    },
    {
      "name":"Making Cream Cheese Frosting for Cookies",
      "steps":[
        {
          "headline":"Melt the butter and white chocolate together in the microwave.",
          "description":"Place 6 tablespoons (85 g) of butter and 1/2 cup (113 g) of chopped white chocolate in a microwave-safe bowl. Heat the mixture in 1-minute intervals, stirring it after each minute. Continue microwaving it until the ingredients are completely smooth and blended without any chunks. You can chop up a bar of white chocolate or use white chocolate chips. Take the butter out of the refrigerator 30 minutes beforehand if you want it to melt faster. Set it somewhere at room temperature to soften."
        },
        {
          "headline":"Beat together the cream cheese, confectioners’ sugar, and vanilla extract.",
          "description":"Using a spoon or electric mixer, combine 1 cup (225 g) of softened cream cheese, 1/2 cup (57 g) of confectioners’ sugar, and 1 teaspoon (4.9 ml) of vanilla extract in a mixing bowl. Stir them together until the mixture is smooth. Let the cream cheese sit at room temperature for 20 to 30 minutes before you start baking in order to let it soften. For a lower-fat frosting, you can substitute 1 cup (225 g) of Neufchatel cheese for the cream cheese."
        },
        {
          "headline":"Blend the melted chocolate and butter into the cream cheese mixture.",
          "description":"Pour the chocolate and butter into the mixing bowl along with the other ingredients. Beat all of the contents of the bowl together to form a smooth frosting. If you want to make colorful cookies, add 2 to 3 drops of food coloring to the icing and stir it until it’s blended with no streaks. To thicken up your frosting if necessary, you can add in more powdered sugar until it’s the consistency you like."
        },
        {
          "headline":"Spread the frosting on the cookies once they’ve cooled.",
          "description":"Scoop 1 tablespoon (15 g) of icing onto the center of each cookie. Use a butter knife to gently spread the icing over the top of the cookie in an even layer. To make fancy decorations or designs, put the frosting into a piping bag and then pipe it onto the cookie in the pattern of your choice. Make sure the cookies are completely cooled before you begin frosting them. Otherwise, the icing will melt and run off. If you aren’t using the frosting right away, keep it in an airtight container in the refrigerator for up to 2 weeks or in the freezer for up to 6 months."
        }
      ]
    }
  ],
  "text":" Baking Classic Cake Mix Cookies Preheat the oven to 350 °F (177 °C). An oven typically takes about 20 to 30 minutes to heat up. Turn it on before you start preparing the cookies so that it’s at the right temperature when you’re ready for it. If you want to warm up your oven faster, turn it on the broil setting first, which creates super intense heat. Then switch it to the regular bake setting before you put the cookies in. Combine the box of cake mix, vegetable oil, and eggs in a mixing bowl. Using a spoon or an electric mixer, blend the 1 18.25 ounces (517 g) box of cake mix, ⁄2 cup (120 ml) of vegetable oil, and 2 eggs together until they’re completely combined. Make sure there aren’t any clumps of cake mix left. For an alternative to vegetable oil, melt 1/2 cup (115 g) of butter. You can also substitute a different type of oil, like olive or canola oil. If you want a lower fat option, use ⁄2 cup (120 ml) of applesauce instead of the oil. How to Choose a Cake Mix\nIf you want cookies that taste like birthday cake, go with a funfetti or vanilla mix. If you love chocolate, use devil’s food or dark chocolate cake mix. If you want something a little fancier, opt for a box of red velvet cake mix. If you’re craving fruity flavors, try strawberry or lemon cake mix. If you like cinnamon, nutmeg, and cloves, make your cookies with carrot cake or spice cake mix. If you want to use your favorite cake mix, go for it! You can pick any flavor or brand of cake mix you'd like. Stir in 1 cup (175 g) of add-ins, like chocolate chips, if you’re using them. If you’d like to add mix-ins like chocolate chips or chopped nuts, fold them into the batter now. Start with 1 cup (175 g) of the ingredient of your choice, then add more to taste if necessary. Continue stirring until the ingredient is spread evenly throughout the batter. You can choose any mix-ins based on your taste preferences. What You Can Use for Mix-Ins\nChocolate chipsButterscotch chipsM&Ms or other small candiesDried fruit, like cranberries or raisinsPretzel piecesPeanut butter cupsShredded coconut Scoop 1 in (2.5 cm) mounds of dough onto an ungreased baking sheet. Place the scoops of dough about 1.5 inches (3.8 cm) apart on a 18 by 26 in (46 by 66 cm) sheet. This gives the cookies room to spread without running into each other while they bake. If you want to help your cookies bake more evenly, lay a piece of parchment paper over the baking sheet before you put the dough on top. You can use a spoon or a cookie scoop to transfer the dough onto the sheet. Place the cookies in the oven to bake for 8 to 10 minutes. Set the sheet on the middle rack, where the hot air can circulate best, to bake all of your cookies evenly. You’ll know they’re finished cooking when the edges of the cookies are firm but the centers are still slightly soft. If you made vanilla or another light-colored mix, the cookies will be a golden-brown color when they’re done. Use a kitchen timer or the clock app on your phone to keep track of the time. Remove the cookies from the oven and take them off the sheet to cool. Once your cookies have finished baking, take them out of the oven. Use a spatula to lift each cookie off the sheet and set them on a paper towel or wire cooling rack. If you leave the cookies on the baking sheet, the heat of the pan will continue to cook them and they could become overdone or burnt. After your cookies have cooled, you can decorate them or add toppings. Store any leftover cookies in an airtight container or resealable bag at room temperature for up to 2 weeks. If you want to keep them longer, place the container in the freezer for up to 3 months. Topping Ideas for Cake Mix Cookies\nIce them with frosting. Drizzle melted chocolate over top of the cookies. Add sprinkles for a festive touch. Make a cookie sandwich by smearing a layer of frosting between 2 cookies. Making Cream Cheese Frosting for Cookies Melt the butter and white chocolate together in the microwave. Place 6 tablespoons (85 g) of butter and 1/2 cup (113 g) of chopped white chocolate in a microwave-safe bowl. Heat the mixture in 1-minute intervals, stirring it after each minute. Continue microwaving it until the ingredients are completely smooth and blended without any chunks. You can chop up a bar of white chocolate or use white chocolate chips. Take the butter out of the refrigerator 30 minutes beforehand if you want it to melt faster. Set it somewhere at room temperature to soften. Beat together the cream cheese, confectioners’ sugar, and vanilla extract. Using a spoon or electric mixer, combine 1 cup (225 g) of softened cream cheese, 1/2 cup (57 g) of confectioners’ sugar, and 1 teaspoon (4.9 ml) of vanilla extract in a mixing bowl. Stir them together until the mixture is smooth. Let the cream cheese sit at room temperature for 20 to 30 minutes before you start baking in order to let it soften. For a lower-fat frosting, you can substitute 1 cup (225 g) of Neufchatel cheese for the cream cheese. Blend the melted chocolate and butter into the cream cheese mixture. Pour the chocolate and butter into the mixing bowl along with the other ingredients. Beat all of the contents of the bowl together to form a smooth frosting. If you want to make colorful cookies, add 2 to 3 drops of food coloring to the icing and stir it until it’s blended with no streaks. To thicken up your frosting if necessary, you can add in more powdered sugar until it’s the consistency you like. Spread the frosting on the cookies once they’ve cooled. Scoop 1 tablespoon (15 g) of icing onto the center of each cookie. Use a butter knife to gently spread the icing over the top of the cookie in an even layer. To make fancy decorations or designs, put the frosting into a piping bag and then pipe it onto the cookie in the pattern of your choice. Make sure the cookies are completely cooled before you begin frosting them. Otherwise, the icing will melt and run off. If you aren’t using the frosting right away, keep it in an airtight container in the refrigerator for up to 2 weeks or in the freezer for up to 6 months.",
  "sentences":[
    " Baking Classic Cake Mix Cookies Preheat the oven to 350 °F (177 °C).",
    "An oven typically takes about 20 to 30 minutes to heat up.",
    "Turn it on before you start preparing the cookies so that it’s at the right temperature when you’re ready for it.",
    "If you want to warm up your oven faster, turn it on the broil setting first, which creates super intense heat.",
    "Then switch it to the regular bake setting before you put the cookies in.",
    "Combine the box of cake mix, vegetable oil, and eggs in a mixing bowl.",
    "Using a spoon or an electric mixer, blend the 1 18.25 ounces (517 g) box of cake mix, ⁄2 cup (120 ml) of vegetable oil, and 2 eggs together until they’re completely combined.",
    "Make sure there aren’t any clumps of cake mix left.",
    "For an alternative to vegetable oil, melt 1/2 cup (115 g) of butter.",
    "You can also substitute a different type of oil, like olive or canola oil.",
    "If you want a lower fat option, use ⁄2 cup (120 ml) of applesauce instead of the oil.",
    "How to Choose a Cake Mix\nIf you want cookies that taste like birthday cake, go with a funfetti or vanilla mix.",
    "If you love chocolate, use devil’s food or dark chocolate cake mix.",
    "If you want something a little fancier, opt for a box of red velvet cake mix.",
    "If you’re craving fruity flavors, try strawberry or lemon cake mix.",
    "If you like cinnamon, nutmeg, and cloves, make your cookies with carrot cake or spice cake mix.",
    "If you want to use your favorite cake mix, go for it!",
    "You can pick any flavor or brand of cake mix you'd like.",
    "Stir in 1 cup (175 g) of add-ins, like chocolate chips, if you’re using them.",
    "If you’d like to add mix-ins like chocolate chips or chopped nuts, fold them into the batter now.",
    "Start with 1 cup (175 g) of the ingredient of your choice, then add more to taste if necessary.",
    "Continue stirring until the ingredient is spread evenly throughout the batter.",
    "You can choose any mix-ins based on your taste preferences.",
    "What You Can Use for Mix-Ins\nChocolate chipsButterscotch chipsM&Ms or other small candiesDried fruit, like cranberries or raisinsPretzel piecesPeanut butter cupsShredded coconut Scoop 1 in (2.5 cm) mounds of dough onto an ungreased baking sheet.",
    "Place the scoops of dough about 1.5 inches (3.8 cm) apart on a 18 by 26 in (46 by 66 cm) sheet.",
    "This gives the cookies room to spread without running into each other while they bake.",
    "If you want to help your cookies bake more evenly, lay a piece of parchment paper over the baking sheet before you put the dough on top.",
    "You can use a spoon or a cookie scoop to transfer the dough onto the sheet.",
    "Place the cookies in the oven to bake for 8 to 10 minutes.",
    "Set the sheet on the middle rack, where the hot air can circulate best, to bake all of your cookies evenly.",
    "You’ll know they’re finished cooking when the edges of the cookies are firm but the centers are still slightly soft.",
    "If you made vanilla or another light-colored mix, the cookies will be a golden-brown color when they’re done.",
    "Use a kitchen timer or the clock app on your phone to keep track of the time.",
    "Remove the cookies from the oven and take them off the sheet to cool.",
    "Once your cookies have finished baking, take them out of the oven.",
    "Use a spatula to lift each cookie off the sheet and set them on a paper towel or wire cooling rack.",
    "If you leave the cookies on the baking sheet, the heat of the pan will continue to cook them and they could become overdone or burnt.",
    "After your cookies have cooled, you can decorate them or add toppings.",
    "Store any leftover cookies in an airtight container or resealable bag at room temperature for up to 2 weeks.",
    "If you want to keep them longer, place the container in the freezer for up to 3 months.",
    "Topping Ideas for Cake Mix Cookies\nIce them with frosting.",
    "Drizzle melted chocolate over top of the cookies.",
    "Add sprinkles for a festive touch.",
    "Make a cookie sandwich by smearing a layer of frosting between 2 cookies.",
    "Making Cream Cheese Frosting for Cookies Melt the butter and white chocolate together in the microwave.",
    "Place 6 tablespoons (85 g) of butter and 1/2 cup (113 g) of chopped white chocolate in a microwave-safe bowl.",
    "Heat the mixture in 1-minute intervals, stirring it after each minute.",
    "Continue microwaving it until the ingredients are completely smooth and blended without any chunks.",
    "You can chop up a bar of white chocolate or use white chocolate chips.",
    "Take the butter out of the refrigerator 30 minutes beforehand if you want it to melt faster.",
    "Set it somewhere at room temperature to soften.",
    "Beat together the cream cheese, confectioners’ sugar, and vanilla extract.",
    "Using a spoon or electric mixer, combine 1 cup (225 g) of softened cream cheese, 1/2 cup (57 g) of confectioners’ sugar, and 1 teaspoon (4.9 ml) of vanilla extract in a mixing bowl.",
    "Stir them together until the mixture is smooth.",
    "Let the cream cheese sit at room temperature for 20 to 30 minutes before you start baking in order to let it soften.",
    "For a lower-fat frosting, you can substitute 1 cup (225 g) of Neufchatel cheese for the cream cheese.",
    "Blend the melted chocolate and butter into the cream cheese mixture.",
    "Pour the chocolate and butter into the mixing bowl along with the other ingredients.",
    "Beat all of the contents of the bowl together to form a smooth frosting.",
    "If you want to make colorful cookies, add 2 to 3 drops of food coloring to the icing and stir it until it’s blended with no streaks.",
    "To thicken up your frosting if necessary, you can add in more powdered sugar until it’s the consistency you like.",
    "Spread the frosting on the cookies once they’ve cooled.",
    "Scoop 1 tablespoon (15 g) of icing onto the center of each cookie.",
    "Use a butter knife to gently spread the icing over the top of the cookie in an even layer.",
    "To make fancy decorations or designs, put the frosting into a piping bag and then pipe it onto the cookie in the pattern of your choice.",
    "Make sure the cookies are completely cooled before you begin frosting them.",
    "Otherwise, the icing will melt and run off.",
    "If you aren’t using the frosting right away, keep it in an airtight container in the refrigerator for up to 2 weeks or in the freezer for up to 6 months."
  ],
  "tyn_section":[
    "Classic Cake Mix Cookies",
    "Mixing bowl",
    "Spoon or electric mixer",
    "Baking sheet",
    "Paper towel or wire rack",
    "Parchment paper (optional)",
    "Cookie scoop (optional)",
    "Airtight container (optional)",
    "Cream Cheese Frosting",
    "Microwave-safe bowl",
    "Spoon",
    "Butter knife",
    "Electric mixer (optional)",
    "Piping bag (optional)"
  ],
  "tyn_model":[
    "cake mix",
    "oven",
    "butter",
    "cream cheese",
    "vegetable oil",
    "mixing bowl",
    "baking sheet",
    "chocolate",
    "white chocolate",
    "icing",
    "eggs",
    "spoon",
    "chocolate chips",
    "refrigerator",
    "confectioners’ sugar",
    "vanilla extract",
    "broil",
    "electric mixer",
    "olive or canola oil",
    "applesauce",
    "oil",
    "funfetti or vanilla mix",
    "red velvet cake mix",
    "lemon cake mix",
    "carrot cake",
    "spice cake mix",
    "nuts",
    "coconut",
    "parchment paper",
    "cookie scoop",
    "vanilla",
    "kitchen timer",
    "spatula",
    "paper towel",
    "airtight container",
    "resealable bag",
    "freezer",
    "cake mix cookies",
    "frosting",
    "cream cheese frosting",
    "microwave",
    "microwave-safe bowl",
    "white chocolate chips",
    "spoon or electric mixer",
    "neufchatel cheese",
    "bowl",
    "food coloring",
    "powdered sugar",
    "butter knife",
    "piping bag"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.14,
    "f1":0.21875,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.9285714286,
    "p":0.34,
    "f1":0.4977477477
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.44,
    "f1":0.6111111111
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.9285714286,
    "p":0.28,
    "f1":0.4302600473
  }
}