{
  "title":"How to Paint Basement Stairs",
  "url":"https://www.wikihow.com/Paint-Basement-Stairs",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs"
  ],
  "steps":[
    {
      "headline":"Remove any carpet or overlaid material from your basement stairs.",
      "description":"Remove staples left from the carpet installation with pliers. Look over all areas of the stairs to find holes and deep scratches."
    },
    {
      "headline":"Use putty or wood filler and a putty knife to fill in holes.",
      "description":"If you have a cement staircase, you will want to fill holes with epoxy. Before buying, ensure that it is specially formulated for filling small holes in concrete."
    },
    {
      "headline":"Decide if you want an unconventional design on your stairs.",
      "description":"You can simply paint your stairs in a single color, or you can paint the riser a different color than the top of the step. The following are new styles of stair painting:\nPaint the front of the stair and the top in a single color. Stencil a number onto the front of the stair, so that you can see all the numbers when you stand at the bottom. This is a great idea for houses with small children, because they have a reminder every time they use the stairs. Paint the stair tops. Then, use paint samples to paint each stair front a different color. You can also alternate between 2 or 3 colors that match your basement décor. Paint the top of the step. Put up colorful, patterned wallpaper on the risers. This part of the stair will have less wear and tear than the top of the step, so the wallpaper will last a long time with some strong glue. Save extra sections of wallpaper to do repairs in the future. Paint a runner into the stairs. Use a different color for the outside edges of the stair top and riser than the inside portion. Use painter's tape to keep these sections separate. Paint the top of the stair. Use bead board on the riser. Bead board is a classic style that adds a professional touch if your basement stairs connect to a well-used section of your house. Allow your kids to paint the risers. Give them acrylic paints and allow them to come up with their own designs. Protect the risers as you paint the tops of the steps."
    },
    {
      "headline":"Choose your stair colors.",
      "description":"Visit a home improvement store and bring home paint chips. Once you have decided on the color scheme you would like to use, you can ask the store to prepare the paint."
    },
    {
      "headline":"Buy porch and floor paint.",
      "description":"Mix your colors in this formula because it will be more durable. It comes in satin and high gloss, some of which are oil-based paints. If you are painting the walls around your stairs, buy wall paint instead of using the porch and floor paint. Your hardware store should be able to match colors and finishes."
    },
    {
      "headline":"Sweep, vacuum and wash your stairs.",
      "description":"If you have concrete stairs, you will want to wash them with a detergent, like TSP. If you have wooden stairs, sweep them, sand them, if necessary, and run a tack cloth over the surfaces."
    },
    {
      "headline":"Ask the hardware store to add a slip-resistant additive, like Shark Grip, to your paint.",
      "description":"They can mix this well with their paint mixer. You can also mix it using a stir stick at home. However, it may not be as uniform."
    },
    {
      "headline":"Tape the walls, and any areas of the stairs that will be painted a different color.",
      "description":"Use painter's tape so you don't rip away any of the paint."
    },
    {
      "headline":"Apply paint to every other stair.",
      "description":"You may choose to use a large bristle brush with wood stairs, so that you can follow the grain. You can use a roller or a foam brush on cement stairs. Painting every other stair allows you to sit on 1 stair while you paint others. It also allows you to exit the area in either direction during your project."
    },
    {
      "headline":"Allow the first set of stairs to dry.",
      "description":"Apply a second coat for increased durability. Allow it to dry well before returning to paint the remaining stairs."
    },
    {
      "headline":"Paint the remaining stairs with 2 coats of porch and floor paint.",
      "description":"Wear socks or clean shoes to step on your newly painted stairs while they cure."
    }
  ],
  "text":" Remove any carpet or overlaid material from your basement stairs. Remove staples left from the carpet installation with pliers. Look over all areas of the stairs to find holes and deep scratches. Use putty or wood filler and a putty knife to fill in holes. If you have a cement staircase, you will want to fill holes with epoxy. Before buying, ensure that it is specially formulated for filling small holes in concrete. Decide if you want an unconventional design on your stairs. You can simply paint your stairs in a single color, or you can paint the riser a different color than the top of the step. The following are new styles of stair painting:\nPaint the front of the stair and the top in a single color. Stencil a number onto the front of the stair, so that you can see all the numbers when you stand at the bottom. This is a great idea for houses with small children, because they have a reminder every time they use the stairs. Paint the stair tops. Then, use paint samples to paint each stair front a different color. You can also alternate between 2 or 3 colors that match your basement décor. Paint the top of the step. Put up colorful, patterned wallpaper on the risers. This part of the stair will have less wear and tear than the top of the step, so the wallpaper will last a long time with some strong glue. Save extra sections of wallpaper to do repairs in the future. Paint a runner into the stairs. Use a different color for the outside edges of the stair top and riser than the inside portion. Use painter's tape to keep these sections separate. Paint the top of the stair. Use bead board on the riser. Bead board is a classic style that adds a professional touch if your basement stairs connect to a well-used section of your house. Allow your kids to paint the risers. Give them acrylic paints and allow them to come up with their own designs. Protect the risers as you paint the tops of the steps. Choose your stair colors. Visit a home improvement store and bring home paint chips. Once you have decided on the color scheme you would like to use, you can ask the store to prepare the paint. Buy porch and floor paint. Mix your colors in this formula because it will be more durable. It comes in satin and high gloss, some of which are oil-based paints. If you are painting the walls around your stairs, buy wall paint instead of using the porch and floor paint. Your hardware store should be able to match colors and finishes. Sweep, vacuum and wash your stairs. If you have concrete stairs, you will want to wash them with a detergent, like TSP. If you have wooden stairs, sweep them, sand them, if necessary, and run a tack cloth over the surfaces. Ask the hardware store to add a slip-resistant additive, like Shark Grip, to your paint. They can mix this well with their paint mixer. You can also mix it using a stir stick at home. However, it may not be as uniform. Tape the walls, and any areas of the stairs that will be painted a different color. Use painter's tape so you don't rip away any of the paint. Apply paint to every other stair. You may choose to use a large bristle brush with wood stairs, so that you can follow the grain. You can use a roller or a foam brush on cement stairs. Painting every other stair allows you to sit on 1 stair while you paint others. It also allows you to exit the area in either direction during your project. Allow the first set of stairs to dry. Apply a second coat for increased durability. Allow it to dry well before returning to paint the remaining stairs. Paint the remaining stairs with 2 coats of porch and floor paint. Wear socks or clean shoes to step on your newly painted stairs while they cure.",
  "sentences":[
    " Remove any carpet or overlaid material from your basement stairs.",
    "Remove staples left from the carpet installation with pliers.",
    "Look over all areas of the stairs to find holes and deep scratches.",
    "Use putty or wood filler and a putty knife to fill in holes.",
    "If you have a cement staircase, you will want to fill holes with epoxy.",
    "Before buying, ensure that it is specially formulated for filling small holes in concrete.",
    "Decide if you want an unconventional design on your stairs.",
    "You can simply paint your stairs in a single color, or you can paint the riser a different color than the top of the step.",
    "The following are new styles of stair painting:\nPaint the front of the stair and the top in a single color.",
    "Stencil a number onto the front of the stair, so that you can see all the numbers when you stand at the bottom.",
    "This is a great idea for houses with small children, because they have a reminder every time they use the stairs.",
    "Paint the stair tops.",
    "Then, use paint samples to paint each stair front a different color.",
    "You can also alternate between 2 or 3 colors that match your basement décor.",
    "Paint the top of the step.",
    "Put up colorful, patterned wallpaper on the risers.",
    "This part of the stair will have less wear and tear than the top of the step, so the wallpaper will last a long time with some strong glue.",
    "Save extra sections of wallpaper to do repairs in the future.",
    "Paint a runner into the stairs.",
    "Use a different color for the outside edges of the stair top and riser than the inside portion.",
    "Use painter's tape to keep these sections separate.",
    "Paint the top of the stair.",
    "Use bead board on the riser.",
    "Bead board is a classic style that adds a professional touch if your basement stairs connect to a well-used section of your house.",
    "Allow your kids to paint the risers.",
    "Give them acrylic paints and allow them to come up with their own designs.",
    "Protect the risers as you paint the tops of the steps.",
    "Choose your stair colors.",
    "Visit a home improvement store and bring home paint chips.",
    "Once you have decided on the color scheme you would like to use, you can ask the store to prepare the paint.",
    "Buy porch and floor paint.",
    "Mix your colors in this formula because it will be more durable.",
    "It comes in satin and high gloss, some of which are oil-based paints.",
    "If you are painting the walls around your stairs, buy wall paint instead of using the porch and floor paint.",
    "Your hardware store should be able to match colors and finishes.",
    "Sweep, vacuum and wash your stairs.",
    "If you have concrete stairs, you will want to wash them with a detergent, like TSP.",
    "If you have wooden stairs, sweep them, sand them, if necessary, and run a tack cloth over the surfaces.",
    "Ask the hardware store to add a slip-resistant additive, like Shark Grip, to your paint.",
    "They can mix this well with their paint mixer.",
    "You can also mix it using a stir stick at home.",
    "However, it may not be as uniform.",
    "Tape the walls, and any areas of the stairs that will be painted a different color.",
    "Use painter's tape so you don't rip away any of the paint.",
    "Apply paint to every other stair.",
    "You may choose to use a large bristle brush with wood stairs, so that you can follow the grain.",
    "You can use a roller or a foam brush on cement stairs.",
    "Painting every other stair allows you to sit on 1 stair while you paint others.",
    "It also allows you to exit the area in either direction during your project.",
    "Allow the first set of stairs to dry.",
    "Apply a second coat for increased durability.",
    "Allow it to dry well before returning to paint the remaining stairs.",
    "Paint the remaining stairs with 2 coats of porch and floor paint.",
    "Wear socks or clean shoes to step on your newly painted stairs while they cure."
  ],
  "tyn_section":[
    "Pliers",
    "Wood/epoxy filler",
    "Putty knife",
    "Paint chips",
    "Porch and floor paint",
    "Wall paint (optional)",
    "Slip resistant additive",
    "Broom",
    "Vacuum",
    "TSP/detergent",
    "Water",
    "Tack cloths",
    "Painter's tape",
    "Ventilation",
    "Work clothes/clean shoes"
  ],
  "tyn_model":[
    "paint",
    "wallpaper",
    "painter's tape",
    "bead board",
    "pliers",
    "putty or",
    "wood filler",
    "putty knife",
    "epoxy",
    "stair painting",
    "glue",
    "acrylic paints",
    "home improvement store",
    "paint chips",
    "oil-based paints",
    "wall paint",
    "shark grip",
    "paint mixer",
    "stir stick",
    "roller",
    "foam brush",
    "porch and floor paint"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.2272727273,
    "f1":0.2702702703,
    "avg_pos":0.1818181818
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.3181818182,
    "f1":0.3544303797
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4666666667,
    "p":0.4545454545,
    "f1":0.4605263158
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.2727272727,
    "f1":0.3243243243
  }
}