{
  "title":"How to Make a Pumpkin Spice Latte",
  "url":"https://www.wikihow.com/Make-a-Pumpkin-Spice-Latte",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Espresso Based Coffee",
    "Latte"
  ],
  "methods":[
    {
      "name":"Simple Pumpkin Spice Latte",
      "steps":[
        {
          "headline":"Combine the milk, pumpkin puree, and sugar.",
          "description":"Pour the milk into a 2-quart (2-liter) saucepan. Whisk in the pumpkin puree and the sugar. Keep whisking until the pumpkin puree is completely mixed in. Make sure that you are using plain pumpkin puree and not the pumpkin pie blend. The pumpkin pie blend contains additional ingredients that won't work in a latte."
        },
        {
          "headline":"Heat the milk mixture over medium heat.",
          "description":"Place the saucepan on the stove and turn the heat up to medium. Let the milk heat up until it starts to steam. Stir it constantly and don't let it come to a boil."
        },
        {
          "headline":"Add in the pumpkin pie spice, vanilla extract, and coffee.",
          "description":"The coffee must be strong, otherwise the latte will taste too milky. You can use freshly-brewed coffee from the coffee maker, or you can use instant coffee instead. For a more traditional latte, use 1 to 2 shots of espresso (about 30 to 60 milliliters) instead."
        },
        {
          "headline":"Stir everything together once more.",
          "description":"If you want to, you can pulse the mixture with a handheld blender to make the milk more frothy."
        },
        {
          "headline":"Divide the latte between two mugs.",
          "description":"Top each one off with whipped cream and a dash of pumpkin pie spice. You can also use cinnamon or nutmeg instead."
        }
      ]
    },
    {
      "name":"Gourmet Pumpkin Spice Latte",
      "steps":[
        {
          "headline":"Heat the pumpkin puree and pumpkin pie spice in a small saucepan.",
          "description":"Combine the pumpkin puree and the pumpkin pie spice in a small saucepan. Cook them over medium heat for 2 minutes, stirring constantly. The mixture is ready when it turns fragrant. For extra flavor, add in some freshly-ground black pepper. Make sure that you are using plain pumpkin puree and not the pumpkin pie blend."
        },
        {
          "headline":"Mix in the sugar.",
          "description":"Keep stirring until the mixture turns thick and syrupy. If you want a less-sweet latte, you can use less sugar."
        },
        {
          "headline":"Stir in the milk and the vanilla extract.",
          "description":"Allow the mixture to heat back up, but don't let it come to a boil. This will make the latte taste more syrupy, like what you'd find in a coffee shop. For something less sweet, use only 1 tablespoon (15 milliliters) of vanilla extract. Stir the ingredients continuously to prevent the milk from scalding. The type of milk you use is up to you. Whole milk will produce the most rich taste and the most froth, but nonfat milk will also become frothy enough to work with and will produce a slightly healthier drink."
        },
        {
          "headline":"Blend the two together with a handheld blender.",
          "description":"Keep blending until the mixture turns foamy. This will take about 15 to 30 seconds. You can also use a regular blender or food processor, but be sure to hold the lid down tightly and to wrap towels around it. If you don't do this, the mixture will leak out. If you don't have any kind of blender, process the mixture with a whisk. It won't be as smooth, however, and you may still have some pumpkin puree in the finished drink. The mixture should become very foamy. Expect more foam if you used whole milk and less if you used low-fat or nonfat milk."
        },
        {
          "headline":"Divide the espresso between two mugs.",
          "description":"If you don't have an espresso machine, you can try making it using an instant espresso powder instead. You can also brew ½ cup (120 milliliters) of strong, black coffee, and use that instead. If you are using coffee, make sure that it is strong, otherwise the latte will taste too milky."
        },
        {
          "headline":"Pour the milk mixture into the mugs.",
          "description":"The milk and espresso should mix together on their own, but if they don't, give each latte a quick stir. If your milk mixture still has too much pulp in it from the puree, consider pouring it through a fine mesh strainer."
        },
        {
          "headline":"Prepare the whipped cream.",
          "description":"Pour ¼ cup (60 milliliters) of heavy cream into a mixer or a food processor fitted with whisks. Beat it until it forms stiff peaks. You can use store-bought whipped cream instead and skip this step."
        },
        {
          "headline":"Garnish the lattes with the whipped cream.",
          "description":"Use a wide spoon or a rubber spatula to carefully scoop the whipped cream onto each latte. You can garnish the lattes further with a sprinkle of cinnamon, nutmeg, or more pumpkin pie spice."
        }
      ]
    },
    {
      "name":"Microwave Pumpkin Spice Latte",
      "steps":[
        {
          "headline":"Mix all of the ingredients, except for the coffee and cream.",
          "description":"Pour the milk into a microwave-safe bowl. Whisk in the pumpkin puree, sugar, pumpkin pie spice, and vanilla. For a more subtle pumpkin flavor, reduce the pumpkin puree to 1 tablespoon (15 grams). Make sure that you are using plain pumpkin puree. The pumpkin pie blend has too many additional ingredients."
        },
        {
          "headline":"Cover the bowl with a sheet of plastic wrap.",
          "description":"Poke a vent hole in the middle with a fork or skewer. This will allow the steam to escape."
        },
        {
          "headline":"Microwave the mixture until it is hot.",
          "description":"How long this takes depends on the strength of your microwave. For most microwaves, however, this should take only 1 to 2 minutes."
        },
        {
          "headline":"Whisk the milk until it turns foamy.",
          "description":"You can do this with a handheld mixer or with a standard whisk. It will take about 30 seconds."
        },
        {
          "headline":"Pour the brewed coffee into a large mug.",
          "description":"You can used freshly-brewed coffee or instant coffee, but make sure that it is strong. If you use regular coffee, the latte will be too milky. You can also use 1 to 2 shots of espresso instead."
        },
        {
          "headline":"Pour the milk mixture into the mug.",
          "description":"If you need to, give it quick stir with a spoon."
        },
        {
          "headline":"Garnish the latte with whipped cream.",
          "description":"For an extra burst of flavor, top it off with a sprinkle of pumpkin pie spice. You can also use nutmeg or cinnamon instead."
        }
      ]
    },
    {
      "name":"Slow Cooker Pumpkin Spice Latte",
      "steps":[
        {
          "headline":"Pour the strong, brewed coffee into a large, slow cooker.",
          "description":"The slow cooker needs to be large enough to hold at least 10 cups (2.4 liters). Make sure that the coffee is very strong. If you use regular coffee, the lattes will turn out too milky."
        },
        {
          "headline":"Add the milk and heavy whipping cream.",
          "description":"Whole milk will be better, but you can also use 2% or skim as well. For an extra-rich latte, add ½ cup (120 milliliters) of heavy whipping cream. For a less-rich latte, add another ½ cup (120 milliliters) of milk (the same type as you used before)."
        },
        {
          "headline":"Stir in the pumpkin puree, sugar, vanilla, and pumpkin pie spice.",
          "description":"Keep whisking until the color and texture are consistent, and the pumpkin puree is dissolved. Make sure that you are using regular pumpkin puree, and not the pumpkin pie kind. The pumpkin pie puree has too many added ingredients, which will affect the entire recipe."
        },
        {
          "headline":"Cook the latte on HIGH for 2 hours.",
          "description":"Keep the slow cooker covered during this time. After 1 hour, give the latte a brisk stir with a whisk."
        },
        {
          "headline":"Serve the lattes in large mugs.",
          "description":"Garnish each one with whipped cream and a sprinkle of pumpkin pie spice."
        }
      ]
    }
  ],
  "text":" Simple Pumpkin Spice Latte Combine the milk, pumpkin puree, and sugar. Pour the milk into a 2-quart (2-liter) saucepan. Whisk in the pumpkin puree and the sugar. Keep whisking until the pumpkin puree is completely mixed in. Make sure that you are using plain pumpkin puree and not the pumpkin pie blend. The pumpkin pie blend contains additional ingredients that won't work in a latte. Heat the milk mixture over medium heat. Place the saucepan on the stove and turn the heat up to medium. Let the milk heat up until it starts to steam. Stir it constantly and don't let it come to a boil. Add in the pumpkin pie spice, vanilla extract, and coffee. The coffee must be strong, otherwise the latte will taste too milky. You can use freshly-brewed coffee from the coffee maker, or you can use instant coffee instead. For a more traditional latte, use 1 to 2 shots of espresso (about 30 to 60 milliliters) instead. Stir everything together once more. If you want to, you can pulse the mixture with a handheld blender to make the milk more frothy. Divide the latte between two mugs. Top each one off with whipped cream and a dash of pumpkin pie spice. You can also use cinnamon or nutmeg instead. Gourmet Pumpkin Spice Latte Heat the pumpkin puree and pumpkin pie spice in a small saucepan. Combine the pumpkin puree and the pumpkin pie spice in a small saucepan. Cook them over medium heat for 2 minutes, stirring constantly. The mixture is ready when it turns fragrant. For extra flavor, add in some freshly-ground black pepper. Make sure that you are using plain pumpkin puree and not the pumpkin pie blend. Mix in the sugar. Keep stirring until the mixture turns thick and syrupy. If you want a less-sweet latte, you can use less sugar. Stir in the milk and the vanilla extract. Allow the mixture to heat back up, but don't let it come to a boil. This will make the latte taste more syrupy, like what you'd find in a coffee shop. For something less sweet, use only 1 tablespoon (15 milliliters) of vanilla extract. Stir the ingredients continuously to prevent the milk from scalding. The type of milk you use is up to you. Whole milk will produce the most rich taste and the most froth, but nonfat milk will also become frothy enough to work with and will produce a slightly healthier drink. Blend the two together with a handheld blender. Keep blending until the mixture turns foamy. This will take about 15 to 30 seconds. You can also use a regular blender or food processor, but be sure to hold the lid down tightly and to wrap towels around it. If you don't do this, the mixture will leak out. If you don't have any kind of blender, process the mixture with a whisk. It won't be as smooth, however, and you may still have some pumpkin puree in the finished drink. The mixture should become very foamy. Expect more foam if you used whole milk and less if you used low-fat or nonfat milk. Divide the espresso between two mugs. If you don't have an espresso machine, you can try making it using an instant espresso powder instead. You can also brew ½ cup (120 milliliters) of strong, black coffee, and use that instead. If you are using coffee, make sure that it is strong, otherwise the latte will taste too milky. Pour the milk mixture into the mugs. The milk and espresso should mix together on their own, but if they don't, give each latte a quick stir. If your milk mixture still has too much pulp in it from the puree, consider pouring it through a fine mesh strainer. Prepare the whipped cream. Pour ¼ cup (60 milliliters) of heavy cream into a mixer or a food processor fitted with whisks. Beat it until it forms stiff peaks. You can use store-bought whipped cream instead and skip this step. Garnish the lattes with the whipped cream. Use a wide spoon or a rubber spatula to carefully scoop the whipped cream onto each latte. You can garnish the lattes further with a sprinkle of cinnamon, nutmeg, or more pumpkin pie spice. Microwave Pumpkin Spice Latte Mix all of the ingredients, except for the coffee and cream. Pour the milk into a microwave-safe bowl. Whisk in the pumpkin puree, sugar, pumpkin pie spice, and vanilla. For a more subtle pumpkin flavor, reduce the pumpkin puree to 1 tablespoon (15 grams). Make sure that you are using plain pumpkin puree. The pumpkin pie blend has too many additional ingredients. Cover the bowl with a sheet of plastic wrap. Poke a vent hole in the middle with a fork or skewer. This will allow the steam to escape. Microwave the mixture until it is hot. How long this takes depends on the strength of your microwave. For most microwaves, however, this should take only 1 to 2 minutes. Whisk the milk until it turns foamy. You can do this with a handheld mixer or with a standard whisk. It will take about 30 seconds. Pour the brewed coffee into a large mug. You can used freshly-brewed coffee or instant coffee, but make sure that it is strong. If you use regular coffee, the latte will be too milky. You can also use 1 to 2 shots of espresso instead. Pour the milk mixture into the mug. If you need to, give it quick stir with a spoon. Garnish the latte with whipped cream. For an extra burst of flavor, top it off with a sprinkle of pumpkin pie spice. You can also use nutmeg or cinnamon instead. Slow Cooker Pumpkin Spice Latte Pour the strong, brewed coffee into a large, slow cooker. The slow cooker needs to be large enough to hold at least 10 cups (2.4 liters). Make sure that the coffee is very strong. If you use regular coffee, the lattes will turn out too milky. Add the milk and heavy whipping cream. Whole milk will be better, but you can also use 2% or skim as well. For an extra-rich latte, add ½ cup (120 milliliters) of heavy whipping cream. For a less-rich latte, add another ½ cup (120 milliliters) of milk (the same type as you used before). Stir in the pumpkin puree, sugar, vanilla, and pumpkin pie spice. Keep whisking until the color and texture are consistent, and the pumpkin puree is dissolved. Make sure that you are using regular pumpkin puree, and not the pumpkin pie kind. The pumpkin pie puree has too many added ingredients, which will affect the entire recipe. Cook the latte on HIGH for 2 hours. Keep the slow cooker covered during this time. After 1 hour, give the latte a brisk stir with a whisk. Serve the lattes in large mugs. Garnish each one with whipped cream and a sprinkle of pumpkin pie spice.",
  "sentences":[
    " Simple Pumpkin Spice Latte Combine the milk, pumpkin puree, and sugar.",
    "Pour the milk into a 2-quart (2-liter) saucepan.",
    "Whisk in the pumpkin puree and the sugar.",
    "Keep whisking until the pumpkin puree is completely mixed in.",
    "Make sure that you are using plain pumpkin puree and not the pumpkin pie blend.",
    "The pumpkin pie blend contains additional ingredients that won't work in a latte.",
    "Heat the milk mixture over medium heat.",
    "Place the saucepan on the stove and turn the heat up to medium.",
    "Let the milk heat up until it starts to steam.",
    "Stir it constantly and don't let it come to a boil.",
    "Add in the pumpkin pie spice, vanilla extract, and coffee.",
    "The coffee must be strong, otherwise the latte will taste too milky.",
    "You can use freshly-brewed coffee from the coffee maker, or you can use instant coffee instead.",
    "For a more traditional latte, use 1 to 2 shots of espresso (about 30 to 60 milliliters) instead.",
    "Stir everything together once more.",
    "If you want to, you can pulse the mixture with a handheld blender to make the milk more frothy.",
    "Divide the latte between two mugs.",
    "Top each one off with whipped cream and a dash of pumpkin pie spice.",
    "You can also use cinnamon or nutmeg instead.",
    "Gourmet Pumpkin Spice Latte Heat the pumpkin puree and pumpkin pie spice in a small saucepan.",
    "Combine the pumpkin puree and the pumpkin pie spice in a small saucepan.",
    "Cook them over medium heat for 2 minutes, stirring constantly.",
    "The mixture is ready when it turns fragrant.",
    "For extra flavor, add in some freshly-ground black pepper.",
    "Make sure that you are using plain pumpkin puree and not the pumpkin pie blend.",
    "Mix in the sugar.",
    "Keep stirring until the mixture turns thick and syrupy.",
    "If you want a less-sweet latte, you can use less sugar.",
    "Stir in the milk and the vanilla extract.",
    "Allow the mixture to heat back up, but don't let it come to a boil.",
    "This will make the latte taste more syrupy, like what you'd find in a coffee shop.",
    "For something less sweet, use only 1 tablespoon (15 milliliters) of vanilla extract.",
    "Stir the ingredients continuously to prevent the milk from scalding.",
    "The type of milk you use is up to you.",
    "Whole milk will produce the most rich taste and the most froth, but nonfat milk will also become frothy enough to work with and will produce a slightly healthier drink.",
    "Blend the two together with a handheld blender.",
    "Keep blending until the mixture turns foamy.",
    "This will take about 15 to 30 seconds.",
    "You can also use a regular blender or food processor, but be sure to hold the lid down tightly and to wrap towels around it.",
    "If you don't do this, the mixture will leak out.",
    "If you don't have any kind of blender, process the mixture with a whisk.",
    "It won't be as smooth, however, and you may still have some pumpkin puree in the finished drink.",
    "The mixture should become very foamy.",
    "Expect more foam if you used whole milk and less if you used low-fat or nonfat milk.",
    "Divide the espresso between two mugs.",
    "If you don't have an espresso machine, you can try making it using an instant espresso powder instead.",
    "You can also brew ½ cup (120 milliliters) of strong, black coffee, and use that instead.",
    "If you are using coffee, make sure that it is strong, otherwise the latte will taste too milky.",
    "Pour the milk mixture into the mugs.",
    "The milk and espresso should mix together on their own, but if they don't, give each latte a quick stir.",
    "If your milk mixture still has too much pulp in it from the puree, consider pouring it through a fine mesh strainer.",
    "Prepare the whipped cream.",
    "Pour ¼ cup (60 milliliters) of heavy cream into a mixer or a food processor fitted with whisks.",
    "Beat it until it forms stiff peaks.",
    "You can use store-bought whipped cream instead and skip this step.",
    "Garnish the lattes with the whipped cream.",
    "Use a wide spoon or a rubber spatula to carefully scoop the whipped cream onto each latte.",
    "You can garnish the lattes further with a sprinkle of cinnamon, nutmeg, or more pumpkin pie spice.",
    "Microwave Pumpkin Spice Latte Mix all of the ingredients, except for the coffee and cream.",
    "Pour the milk into a microwave-safe bowl.",
    "Whisk in the pumpkin puree, sugar, pumpkin pie spice, and vanilla.",
    "For a more subtle pumpkin flavor, reduce the pumpkin puree to 1 tablespoon (15 grams).",
    "Make sure that you are using plain pumpkin puree.",
    "The pumpkin pie blend has too many additional ingredients.",
    "Cover the bowl with a sheet of plastic wrap.",
    "Poke a vent hole in the middle with a fork or skewer.",
    "This will allow the steam to escape.",
    "Microwave the mixture until it is hot.",
    "How long this takes depends on the strength of your microwave.",
    "For most microwaves, however, this should take only 1 to 2 minutes.",
    "Whisk the milk until it turns foamy.",
    "You can do this with a handheld mixer or with a standard whisk.",
    "It will take about 30 seconds.",
    "Pour the brewed coffee into a large mug.",
    "You can used freshly-brewed coffee or instant coffee, but make sure that it is strong.",
    "If you use regular coffee, the latte will be too milky.",
    "You can also use 1 to 2 shots of espresso instead.",
    "Pour the milk mixture into the mug.",
    "If you need to, give it quick stir with a spoon.",
    "Garnish the latte with whipped cream.",
    "For an extra burst of flavor, top it off with a sprinkle of pumpkin pie spice.",
    "You can also use nutmeg or cinnamon instead.",
    "Slow Cooker Pumpkin Spice Latte Pour the strong, brewed coffee into a large, slow cooker.",
    "The slow cooker needs to be large enough to hold at least 10 cups (2.4 liters).",
    "Make sure that the coffee is very strong.",
    "If you use regular coffee, the lattes will turn out too milky.",
    "Add the milk and heavy whipping cream.",
    "Whole milk will be better, but you can also use 2% or skim as well.",
    "For an extra-rich latte, add ½ cup (120 milliliters) of heavy whipping cream.",
    "For a less-rich latte, add another ½ cup (120 milliliters) of milk (the same type as you used before).",
    "Stir in the pumpkin puree, sugar, vanilla, and pumpkin pie spice.",
    "Keep whisking until the color and texture are consistent, and the pumpkin puree is dissolved.",
    "Make sure that you are using regular pumpkin puree, and not the pumpkin pie kind.",
    "The pumpkin pie puree has too many added ingredients, which will affect the entire recipe.",
    "Cook the latte on HIGH for 2 hours.",
    "Keep the slow cooker covered during this time.",
    "After 1 hour, give the latte a brisk stir with a whisk.",
    "Serve the lattes in large mugs.",
    "Garnish each one with whipped cream and a sprinkle of pumpkin pie spice."
  ],
  "tyn_section":[
    "Making a Simple Pumpkin Spice Latte",
    "Saucepan",
    "Whisk",
    "Mugs",
    "Making a Gourmet Pumpkin Spice Latte",
    "Handheld blender",
    "Using a Microwave",
    "Microwave-safe bowl",
    "Plastic wrap",
    "Whisk or handheld blender",
    "Using a Slow-Cooker",
    "Large slow-cooker"
  ],
  "tyn_model":[
    "milk",
    "pumpkin puree",
    "pumpkin pie spice",
    "coffee",
    "whipped cream",
    "sugar",
    "vanilla extract",
    "espresso",
    "whisk",
    "slow cooker",
    "pumpkin spice latte",
    "pumpkin pie",
    "pumpkin pie blend",
    "blender",
    "cinnamon",
    "nutmeg",
    "small saucepan",
    "food processor",
    "vanilla",
    "heavy whipping cream",
    "2-quart (2-liter) saucepan",
    "saucepan",
    "stove",
    "coffee maker",
    "black pepper",
    "handheld blender",
    "regular blender",
    "espresso machine",
    "instant espresso powder",
    "fine mesh strainer",
    "heavy cream",
    "mixer",
    "wide spoon",
    "rubber spatula",
    "microwave pumpkin spice latte",
    "cream",
    "microwave-safe bowl",
    "bowl",
    "plastic wrap",
    "fork",
    "microwave",
    "large mug",
    "mug",
    "spoon",
    "large, slow cooker",
    "pumpkin pie kind",
    "pumpkin pie puree"
  ],
  "simple_metrics":{
    "r":0.4166666667,
    "p":0.1063829787,
    "f1":0.1694915254,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.1914893617,
    "f1":0.2975206612
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.2978723404,
    "f1":0.4388714734
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4166666667,
    "p":0.1063829787,
    "f1":0.1694915254
  }
}