{
  "title":"How to Make Sourdough Starter",
  "url":"https://www.wikihow.com/Make-Sourdough-Starter",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Bread Making Tips"
  ],
  "methods":[
    {
      "name":"A Simple Starter",
      "steps":[
        {
          "headline":"Get a container.",
          "description":"You'll need some sort of container to provide a home for your starter. Use a small mixing bowl that will hold between 2 to 4 cups (500 to 1000 ml). You can use almost any type of container made for food; however, it is recommended to use a non-reactive container such as glass or plastic. Plan to cover your container with plastic wrap or a clean cloth."
        },
        {
          "headline":"Mix up the starter.",
          "description":"Mix 1/4 cup (50 ml) of water with 1/2 cup (50 g) of whole grain flour. If you're weighing your ingredients, use 50 grams each of flour and water. Mix the ingredients until thoroughly-combined and cover with plastic wrap. Once you've stirred the starter, scrape down the sides of the container. You want to make sure you don't leave \"food\" on the side of the container to feed mold growth."
        },
        {
          "headline":"Find a home for your starter.",
          "description":"You want a place where the starter isn't likely to be disturbed (dogs, children, curious husbands) and where you can maintain the temperature within the 65° to 85°F (18° to 30°C) range. If you need a warmer area, turning on the light in an oven (but not turning the oven on) will often get you the temperature you need. Similarly, the top of many refrigerators is also a literal hot spot."
        },
        {
          "headline":"Wait.",
          "description":"Sourdough is all about patience. What are you waiting for exactly? You want the starter to become active and start bubbling. In time it'll rise and grow like it's alive. How long are you waiting? 12 hours is usually enough for the starter to become active, so definitely make other plans. Bubbling can begin a few hours into the wait, or it can take as long as 24 hours -- it all depends on the ingredients you used and the environment it's in. If the starter is not active in 12 hours, give it another 12 hours for good measure. If it still isn't active, give it another 12 hours. And if it's not active after 36 hours, check the steps above to make sure you did them right. If everything was right, throw it out and try again -- it's probably not going to happen. If you've tried twice with no results, try a different brand of flour or type of water."
        },
        {
          "headline":"Feed the starter.",
          "description":"When the starter is active, you have to feed it. Add another 1/4 cup (50 ml) of water and stir the starter. Then add 1/2 cup (50 grams) of whole grain flour and stir again until well-combined. Wait again. You are (once more) waiting for the starter to rise. Usually, the starter will double in size in 12 hours or less. Sometimes it takes 24 hours though, so don't freak out after 12 if it's not looking big enough. If you get good bubbling and the starter doesn't double, that's okay, too."
        },
        {
          "headline":"Feed the starter again.",
          "description":"However, this time discard half the starter first. Add 1/4 cup (50 ml) of water and stir the starter. What's next? You guessed it: Add 1/2 cup (50 grams) of whole grain flour and stir again. Getting the routine down yet? And yes, it is very important to discard 1/2 the starter at each feeding at this stage. You don't want a flour monster taking over your kitchen counter. Feeding the starter should double its size. If you don't discard the starter you'll have far too much starter than what you actually need. Later in the process you can save the starter, but at this stage the starter isn't stable enough to warrant saving."
        },
        {
          "headline":"Wait some more.",
          "description":"Again, you want to see the starter bubble and (like clockwork) double in size between feedings at this point. When the starter is established, regular feedings are very important, but don't get over-eager: Feeding the starter too soon could keep the culture from reaching the critical threshold it needs to stay alive. Each feeding dilutes the culture; if you dilute it too much, it'll die. If at any feeding it doesn't double, give it some more time. When a starter is starting, it is unstable. Repeat the two steps above until the starter reliably doubles in size between feedings."
        },
        {
          "headline":"Switch to unbleached all-purpose flour.",
          "description":"The point of this step is to get rid of unwanted micro-organisms; the whole grain flour keeps adding more of them. Once the sourdough starter is stable, you can switch back to whole grain flour if you'd like. If you see the starter slow down when you make the switch, don't worry; that's normal. Wait until the starter is active (this may take up to 36 hours) to let it recover from the shock of switching to white flour. You can ease the transition by not going cold turkey. Make the transition to white flour in 3 rounds, decreasing the amount of whole grain flour a bit more each time. Start by using about 1 part white flour and 3 parts whole grain. For the next feeding, use half white flour and half whole grain. For the feeding after that, use 3 parts white flour and 1 part whole grain. And the next feeding, and subsequent feedings, can be all white flour."
        },
        {
          "headline":"Feed the starter yet again.",
          "description":"This is the exact same protocol as last time -- discard half the starter, add 1/4 cup (50 ml) water and stir. Then add 1/2 cup (50 grams) all-purpose flour and stir again. Now that the starter is stable you can start saving the discarded part in another container for other projects (it makes a great gift). If you do decide to keep it, put it in the fridge to prolong its life."
        },
        {
          "headline":"Wait some more.",
          "description":"As mentioned previously, the starter may slow down for a feeding or so as it grows. Don't jump to any conclusions; it just needs time. When it seems to be active and stable, you should be feeding it every 12 hours or so. A starter (at room temperature) should be fed no less than twice a day. Repeat the two steps above. At this time, the starter is reaching its full potential and growing in strength and maturity. Though it may be tempting, don't try it out until it's about a week old and doubles with each feeding. Most sourdough experts think a starter can continue growing between 30 and 90 days, though ultimately it's unclear. After about a week, your starter is ready to use!"
        }
      ]
    },
    {
      "name":"With Grapes",
      "steps":[
        {
          "headline":"Combine the flour and water.",
          "description":"Stir 1 1/2 cups flour (150 g) and 2 cups (500 ml) mineral water or spring water together in a large plastic or earthenware bowl. If your tap water tastes fine and doesn't have an odor, it should be effective to use, too. Many people believe that chlorinated water is a starter's death warrant, but start experimenting and use your own experience to judge what gives you the best results."
        },
        {
          "headline":"Add the bunch of grapes, pushing it into the batter.",
          "description":"Do not mash the grapes or otherwise think their juices need to seep into the batter; it's just the fruit that needs to be present. You may use plums, or any other fruit that has a natural \"bloom\" of yeast on the skin surface."
        },
        {
          "headline":"Cover the bowl lightly with a clean dish towel or cheesecloth.",
          "description":"The starter needs to get air but no dust or bugs. Set it on your counter top, preferably in a warm place. If you put a lid on too tightly, you risk it building up pressure and exploding. Not too warm. On top of the refrigerator is a nice spot."
        },
        {
          "headline":"Every day, stir in a tablespoon of water and a tablespoon of flour.",
          "description":"This is called \"feeding\" the sourdough batter. In a couple days there should be signs of \"starting\"; namely, bubbling a bit as the yeasts feed on the starch and sugar. If this doesn't happen within 48 hours, discard the batch and begin again."
        },
        {
          "headline":"Continue feeding every day.",
          "description":"Don't worry if the batter separates; this means the water rises and the flour sinks. This is normal. After 5 or 6 days the starter will develop a good, yet slightly sour, smell. It is yeasty and not unpleasant. Some schools of thought say that feeding it twice a day is ideal. Experiment to see which method warrants you the best results."
        },
        {
          "headline":"Feed it for a couple more days.",
          "description":"Do this at least once a day! You'll get a consistency similar to thick drippy pancake batter. After this time, remove and discard the grapes."
        },
        {
          "headline":"Cover the starter and refrigerate it.",
          "description":"You'll need to feed and stir it every day to keep it healthy. If you begin to get too much batter (say to a gallon), discard the excess."
        },
        {
          "headline":"Take the starter out of refrigeration the evening before you use it.",
          "description":"It takes four cups starter to make two loaves of bread. Every time you use the starter, replenish it like this:\nFor each cup starter you remove, stir in 1/2 cup flour and 1/2 cup cool water. If you don't use the starter every few days, keep it in the fridge and feed it at least once weekly or it will die. If it gets very yellow and doesn't \"rise\" before baking, discard and start again. Starters have been continued for decades. It is possible (though not always recommended) to freeze your starter and revive it at a later date."
        }
      ]
    },
    {
      "name":"Maintaining & Using Your Starter",
      "steps":[
        {
          "headline":"Keep your starter at slightly above room temperature.",
          "description":"This is while it's growing. You may move it to the fridge eventually, but if it's still gaining speed, keep it above the fridge or in the oven with the light on."
        },
        {
          "headline":"Feed it regularly.",
          "description":"If your starter is too thin, increase the amount of flour in each feeding by a couple of tablespoons. But know that thick starters are harder to work with and only experienced bakers generally see good results with them. A thin starter works too quickly, so a few missed feedings can be catastrophic. Many bakers use a very thick starter and for good reason: These starters develop more flavor, seem to have more strength, are more active than their thinner counterparts and are much more tolerant of a missed feeding. However, a very thick starter can be very difficult for new bakers to work with and maintain. Get the basics down before you go thick."
        },
        {
          "headline":"Look for little cracks in the surface of the batter.",
          "description":"As the starter runs out of food, the gas production declines, and the starter begins to fall again, resulting in the drying and cracks. As the starter falls, you may see little ravine-like cracks form on the surface -- believe it or not, this is actually a good thing. The starter is active and at its peak when it just barely has started to fall. If you're wondering when to use it, it's now."
        },
        {
          "headline":"Convert other recipes.",
          "description":"Don't be shy -- sourdough can be used for pretty much anything. To convert any recipe to sourdough, start by replacing each packet of yeast (about a teaspoon or 6 grams) with a cup (240 grams) of active sourdough starter. Adjust the recipe to accommodate for the water and flour in the starter already. If the sourdough taste is too strong for the flavor the bread should be, use more starter next time. And if the bread isn't sourdough-y enough, use less sourdough starter in the future. One of the best ways to get more flavor out of the starter is to use less of it. Definitely counter-intuitive. But the reason behind that is with less, it takes longer to raise the bread. If you use more starter, you'll get a fast rise, less time for the flavor to soak in, and therefore less sourdough flavor."
        }
      ]
    },
    {
      "name":"Storing & Reviving Your Starter",
      "steps":[
        {
          "headline":"Be careful when refrigerating your starter.",
          "description":"Some people believe that if a starter gets below 46°F, you shouldn't bother working with it and it should be discarded promptly -- others disagree. If you do store it, it should be at least 30 days old and able to withstand the cooler temperature. Feed your starter just before you refrigerate it. This seems to help it bounce back faster when you go to use it in the future. A starter that was mature when stored can be very difficult to bring back to life."
        },
        {
          "headline":"Don't put the lid on too tightly.",
          "description":"Air pressure will build and possibly explode (or at the very least curb the growing process) the container. Place the lid on, but don't make it air-tight. Glass is generally a safe bet. Plastic scratches easily and metal will give the starter a metallic-y taste if left in it too long."
        },
        {
          "headline":"If the starter has been in storage less than a week, use as normal.",
          "description":"Measure out what you need and put the unused storage starter back in the refrigerator, no harm done. Let the starter you are going to use come to room temperature before you use it, however. Remember that a starter at room temperature needs to be fed twice a day (even after refrigeration), so don't leave it out without feeding it! It has been going through its stores of starch in the starter while in the refrigerator and if it's going to sit a while, it needs a real feeding."
        },
        {
          "headline":"If the starter has been in storage more than a week, revive it.",
          "description":"Feed the starter for at least three days (twice a day) before using it or putting it back in the refrigerator. Use the same precautions you took when you were growing it (temperature, etc.). Start the discarding process as normal. Discard 1/2 the starter and then feed another 1/4 cup (50 g) water and 1/2 cup (50 g) flour every 12 hours or so, like you used to in the good ol' days. When the starter is doubling nicely between feedings (good and actively stable), feed it one more time. Clean out your storage container, put the freshly revived starter back in, and then put it back into the fridge to be revived again later. Again, the keys to a successful starter are to feed the starter until it is doubling consistently between feedings, to fill the cleaned jar no more than 1/2 full (it needs air), and to refrigerate immediately after you feed the starter (once it's mature, of course)."
        }
      ]
    }
  ],
  "text":" A Simple Starter Get a container. You'll need some sort of container to provide a home for your starter. Use a small mixing bowl that will hold between 2 to 4 cups (500 to 1000 ml). You can use almost any type of container made for food; however, it is recommended to use a non-reactive container such as glass or plastic. Plan to cover your container with plastic wrap or a clean cloth. Mix up the starter. Mix 1/4 cup (50 ml) of water with 1/2 cup (50 g) of whole grain flour. If you're weighing your ingredients, use 50 grams each of flour and water. Mix the ingredients until thoroughly-combined and cover with plastic wrap. Once you've stirred the starter, scrape down the sides of the container. You want to make sure you don't leave \"food\" on the side of the container to feed mold growth. Find a home for your starter. You want a place where the starter isn't likely to be disturbed (dogs, children, curious husbands) and where you can maintain the temperature within the 65° to 85°F (18° to 30°C) range. If you need a warmer area, turning on the light in an oven (but not turning the oven on) will often get you the temperature you need. Similarly, the top of many refrigerators is also a literal hot spot. Wait. Sourdough is all about patience. What are you waiting for exactly? You want the starter to become active and start bubbling. In time it'll rise and grow like it's alive. How long are you waiting? 12 hours is usually enough for the starter to become active, so definitely make other plans. Bubbling can begin a few hours into the wait, or it can take as long as 24 hours -- it all depends on the ingredients you used and the environment it's in. If the starter is not active in 12 hours, give it another 12 hours for good measure. If it still isn't active, give it another 12 hours. And if it's not active after 36 hours, check the steps above to make sure you did them right. If everything was right, throw it out and try again -- it's probably not going to happen. If you've tried twice with no results, try a different brand of flour or type of water. Feed the starter. When the starter is active, you have to feed it. Add another 1/4 cup (50 ml) of water and stir the starter. Then add 1/2 cup (50 grams) of whole grain flour and stir again until well-combined. Wait again. You are (once more) waiting for the starter to rise. Usually, the starter will double in size in 12 hours or less. Sometimes it takes 24 hours though, so don't freak out after 12 if it's not looking big enough. If you get good bubbling and the starter doesn't double, that's okay, too. Feed the starter again. However, this time discard half the starter first. Add 1/4 cup (50 ml) of water and stir the starter. What's next? You guessed it: Add 1/2 cup (50 grams) of whole grain flour and stir again. Getting the routine down yet? And yes, it is very important to discard 1/2 the starter at each feeding at this stage. You don't want a flour monster taking over your kitchen counter. Feeding the starter should double its size. If you don't discard the starter you'll have far too much starter than what you actually need. Later in the process you can save the starter, but at this stage the starter isn't stable enough to warrant saving. Wait some more. Again, you want to see the starter bubble and (like clockwork) double in size between feedings at this point. When the starter is established, regular feedings are very important, but don't get over-eager: Feeding the starter too soon could keep the culture from reaching the critical threshold it needs to stay alive. Each feeding dilutes the culture; if you dilute it too much, it'll die. If at any feeding it doesn't double, give it some more time. When a starter is starting, it is unstable. Repeat the two steps above until the starter reliably doubles in size between feedings. Switch to unbleached all-purpose flour. The point of this step is to get rid of unwanted micro-organisms; the whole grain flour keeps adding more of them. Once the sourdough starter is stable, you can switch back to whole grain flour if you'd like. If you see the starter slow down when you make the switch, don't worry; that's normal. Wait until the starter is active (this may take up to 36 hours) to let it recover from the shock of switching to white flour. You can ease the transition by not going cold turkey. Make the transition to white flour in 3 rounds, decreasing the amount of whole grain flour a bit more each time. Start by using about 1 part white flour and 3 parts whole grain. For the next feeding, use half white flour and half whole grain. For the feeding after that, use 3 parts white flour and 1 part whole grain. And the next feeding, and subsequent feedings, can be all white flour. Feed the starter yet again. This is the exact same protocol as last time -- discard half the starter, add 1/4 cup (50 ml) water and stir. Then add 1/2 cup (50 grams) all-purpose flour and stir again. Now that the starter is stable you can start saving the discarded part in another container for other projects (it makes a great gift). If you do decide to keep it, put it in the fridge to prolong its life. Wait some more. As mentioned previously, the starter may slow down for a feeding or so as it grows. Don't jump to any conclusions; it just needs time. When it seems to be active and stable, you should be feeding it every 12 hours or so. A starter (at room temperature) should be fed no less than twice a day. Repeat the two steps above. At this time, the starter is reaching its full potential and growing in strength and maturity. Though it may be tempting, don't try it out until it's about a week old and doubles with each feeding. Most sourdough experts think a starter can continue growing between 30 and 90 days, though ultimately it's unclear. After about a week, your starter is ready to use! With Grapes Combine the flour and water. Stir 1 1/2 cups flour (150 g) and 2 cups (500 ml) mineral water or spring water together in a large plastic or earthenware bowl. If your tap water tastes fine and doesn't have an odor, it should be effective to use, too. Many people believe that chlorinated water is a starter's death warrant, but start experimenting and use your own experience to judge what gives you the best results. Add the bunch of grapes, pushing it into the batter. Do not mash the grapes or otherwise think their juices need to seep into the batter; it's just the fruit that needs to be present. You may use plums, or any other fruit that has a natural \"bloom\" of yeast on the skin surface. Cover the bowl lightly with a clean dish towel or cheesecloth. The starter needs to get air but no dust or bugs. Set it on your counter top, preferably in a warm place. If you put a lid on too tightly, you risk it building up pressure and exploding. Not too warm. On top of the refrigerator is a nice spot. Every day, stir in a tablespoon of water and a tablespoon of flour. This is called \"feeding\" the sourdough batter. In a couple days there should be signs of \"starting\"; namely, bubbling a bit as the yeasts feed on the starch and sugar. If this doesn't happen within 48 hours, discard the batch and begin again. Continue feeding every day. Don't worry if the batter separates; this means the water rises and the flour sinks. This is normal. After 5 or 6 days the starter will develop a good, yet slightly sour, smell. It is yeasty and not unpleasant. Some schools of thought say that feeding it twice a day is ideal. Experiment to see which method warrants you the best results. Feed it for a couple more days. Do this at least once a day! You'll get a consistency similar to thick drippy pancake batter. After this time, remove and discard the grapes. Cover the starter and refrigerate it. You'll need to feed and stir it every day to keep it healthy. If you begin to get too much batter (say to a gallon), discard the excess. Take the starter out of refrigeration the evening before you use it. It takes four cups starter to make two loaves of bread. Every time you use the starter, replenish it like this:\nFor each cup starter you remove, stir in 1/2 cup flour and 1/2 cup cool water. If you don't use the starter every few days, keep it in the fridge and feed it at least once weekly or it will die. If it gets very yellow and doesn't \"rise\" before baking, discard and start again. Starters have been continued for decades. It is possible (though not always recommended) to freeze your starter and revive it at a later date. Maintaining & Using Your Starter Keep your starter at slightly above room temperature. This is while it's growing. You may move it to the fridge eventually, but if it's still gaining speed, keep it above the fridge or in the oven with the light on. Feed it regularly. If your starter is too thin, increase the amount of flour in each feeding by a couple of tablespoons. But know that thick starters are harder to work with and only experienced bakers generally see good results with them. A thin starter works too quickly, so a few missed feedings can be catastrophic. Many bakers use a very thick starter and for good reason: These starters develop more flavor, seem to have more strength, are more active than their thinner counterparts and are much more tolerant of a missed feeding. However, a very thick starter can be very difficult for new bakers to work with and maintain. Get the basics down before you go thick. Look for little cracks in the surface of the batter. As the starter runs out of food, the gas production declines, and the starter begins to fall again, resulting in the drying and cracks. As the starter falls, you may see little ravine-like cracks form on the surface -- believe it or not, this is actually a good thing. The starter is active and at its peak when it just barely has started to fall. If you're wondering when to use it, it's now. Convert other recipes. Don't be shy -- sourdough can be used for pretty much anything. To convert any recipe to sourdough, start by replacing each packet of yeast (about a teaspoon or 6 grams) with a cup (240 grams) of active sourdough starter. Adjust the recipe to accommodate for the water and flour in the starter already. If the sourdough taste is too strong for the flavor the bread should be, use more starter next time. And if the bread isn't sourdough-y enough, use less sourdough starter in the future. One of the best ways to get more flavor out of the starter is to use less of it. Definitely counter-intuitive. But the reason behind that is with less, it takes longer to raise the bread. If you use more starter, you'll get a fast rise, less time for the flavor to soak in, and therefore less sourdough flavor. Storing & Reviving Your Starter Be careful when refrigerating your starter. Some people believe that if a starter gets below 46°F, you shouldn't bother working with it and it should be discarded promptly -- others disagree. If you do store it, it should be at least 30 days old and able to withstand the cooler temperature. Feed your starter just before you refrigerate it. This seems to help it bounce back faster when you go to use it in the future. A starter that was mature when stored can be very difficult to bring back to life. Don't put the lid on too tightly. Air pressure will build and possibly explode (or at the very least curb the growing process) the container. Place the lid on, but don't make it air-tight. Glass is generally a safe bet. Plastic scratches easily and metal will give the starter a metallic-y taste if left in it too long. If the starter has been in storage less than a week, use as normal. Measure out what you need and put the unused storage starter back in the refrigerator, no harm done. Let the starter you are going to use come to room temperature before you use it, however. Remember that a starter at room temperature needs to be fed twice a day (even after refrigeration), so don't leave it out without feeding it! It has been going through its stores of starch in the starter while in the refrigerator and if it's going to sit a while, it needs a real feeding. If the starter has been in storage more than a week, revive it. Feed the starter for at least three days (twice a day) before using it or putting it back in the refrigerator. Use the same precautions you took when you were growing it (temperature, etc.). Start the discarding process as normal. Discard 1/2 the starter and then feed another 1/4 cup (50 g) water and 1/2 cup (50 g) flour every 12 hours or so, like you used to in the good ol' days. When the starter is doubling nicely between feedings (good and actively stable), feed it one more time. Clean out your storage container, put the freshly revived starter back in, and then put it back into the fridge to be revived again later. Again, the keys to a successful starter are to feed the starter until it is doubling consistently between feedings, to fill the cleaned jar no more than 1/2 full (it needs air), and to refrigerate immediately after you feed the starter (once it's mature, of course).",
  "sentences":[
    " A Simple Starter Get a container.",
    "You'll need some sort of container to provide a home for your starter.",
    "Use a small mixing bowl that will hold between 2 to 4 cups (500 to 1000 ml).",
    "You can use almost any type of container made for food; however, it is recommended to use a non-reactive container such as glass or plastic.",
    "Plan to cover your container with plastic wrap or a clean cloth.",
    "Mix up the starter.",
    "Mix 1/4 cup (50 ml) of water with 1/2 cup (50 g) of whole grain flour.",
    "If you're weighing your ingredients, use 50 grams each of flour and water.",
    "Mix the ingredients until thoroughly-combined and cover with plastic wrap.",
    "Once you've stirred the starter, scrape down the sides of the container.",
    "You want to make sure you don't leave \"food\" on the side of the container to feed mold growth.",
    "Find a home for your starter.",
    "You want a place where the starter isn't likely to be disturbed (dogs, children, curious husbands) and where you can maintain the temperature within the 65° to 85°F (18° to 30°C) range.",
    "If you need a warmer area, turning on the light in an oven (but not turning the oven on) will often get you the temperature you need.",
    "Similarly, the top of many refrigerators is also a literal hot spot.",
    "Wait.",
    "Sourdough is all about patience.",
    "What are you waiting for exactly?",
    "You want the starter to become active and start bubbling.",
    "In time it'll rise and grow like it's alive.",
    "How long are you waiting?",
    "12 hours is usually enough for the starter to become active, so definitely make other plans.",
    "Bubbling can begin a few hours into the wait, or it can take as long as 24 hours -- it all depends on the ingredients you used and the environment it's in.",
    "If the starter is not active in 12 hours, give it another 12 hours for good measure.",
    "If it still isn't active, give it another 12 hours.",
    "And if it's not active after 36 hours, check the steps above to make sure you did them right.",
    "If everything was right, throw it out and try again -- it's probably not going to happen.",
    "If you've tried twice with no results, try a different brand of flour or type of water.",
    "Feed the starter.",
    "When the starter is active, you have to feed it.",
    "Add another 1/4 cup (50 ml) of water and stir the starter.",
    "Then add 1/2 cup (50 grams) of whole grain flour and stir again until well-combined.",
    "Wait again.",
    "You are (once more) waiting for the starter to rise.",
    "Usually, the starter will double in size in 12 hours or less.",
    "Sometimes it takes 24 hours though, so don't freak out after 12 if it's not looking big enough.",
    "If you get good bubbling and the starter doesn't double, that's okay, too.",
    "Feed the starter again.",
    "However, this time discard half the starter first.",
    "Add 1/4 cup (50 ml) of water and stir the starter.",
    "What's next?",
    "You guessed it: Add 1/2 cup (50 grams) of whole grain flour and stir again.",
    "Getting the routine down yet?",
    "And yes, it is very important to discard 1/2 the starter at each feeding at this stage.",
    "You don't want a flour monster taking over your kitchen counter.",
    "Feeding the starter should double its size.",
    "If you don't discard the starter you'll have far too much starter than what you actually need.",
    "Later in the process you can save the starter, but at this stage the starter isn't stable enough to warrant saving.",
    "Wait some more.",
    "Again, you want to see the starter bubble and (like clockwork) double in size between feedings at this point.",
    "When the starter is established, regular feedings are very important, but don't get over-eager: Feeding the starter too soon could keep the culture from reaching the critical threshold it needs to stay alive.",
    "Each feeding dilutes the culture; if you dilute it too much, it'll die.",
    "If at any feeding it doesn't double, give it some more time.",
    "When a starter is starting, it is unstable.",
    "Repeat the two steps above until the starter reliably doubles in size between feedings.",
    "Switch to unbleached all-purpose flour.",
    "The point of this step is to get rid of unwanted micro-organisms; the whole grain flour keeps adding more of them.",
    "Once the sourdough starter is stable, you can switch back to whole grain flour if you'd like.",
    "If you see the starter slow down when you make the switch, don't worry; that's normal.",
    "Wait until the starter is active (this may take up to 36 hours) to let it recover from the shock of switching to white flour.",
    "You can ease the transition by not going cold turkey.",
    "Make the transition to white flour in 3 rounds, decreasing the amount of whole grain flour a bit more each time.",
    "Start by using about 1 part white flour and 3 parts whole grain.",
    "For the next feeding, use half white flour and half whole grain.",
    "For the feeding after that, use 3 parts white flour and 1 part whole grain.",
    "And the next feeding, and subsequent feedings, can be all white flour.",
    "Feed the starter yet again.",
    "This is the exact same protocol as last time -- discard half the starter, add 1/4 cup (50 ml) water and stir.",
    "Then add 1/2 cup (50 grams) all-purpose flour and stir again.",
    "Now that the starter is stable you can start saving the discarded part in another container for other projects (it makes a great gift).",
    "If you do decide to keep it, put it in the fridge to prolong its life.",
    "Wait some more.",
    "As mentioned previously, the starter may slow down for a feeding or so as it grows.",
    "Don't jump to any conclusions; it just needs time.",
    "When it seems to be active and stable, you should be feeding it every 12 hours or so.",
    "A starter (at room temperature) should be fed no less than twice a day.",
    "Repeat the two steps above.",
    "At this time, the starter is reaching its full potential and growing in strength and maturity.",
    "Though it may be tempting, don't try it out until it's about a week old and doubles with each feeding.",
    "Most sourdough experts think a starter can continue growing between 30 and 90 days, though ultimately it's unclear.",
    "After about a week, your starter is ready to use!",
    "With Grapes Combine the flour and water.",
    "Stir 1 1/2 cups flour (150 g) and 2 cups (500 ml) mineral water or spring water together in a large plastic or earthenware bowl.",
    "If your tap water tastes fine and doesn't have an odor, it should be effective to use, too.",
    "Many people believe that chlorinated water is a starter's death warrant, but start experimenting and use your own experience to judge what gives you the best results.",
    "Add the bunch of grapes, pushing it into the batter.",
    "Do not mash the grapes or otherwise think their juices need to seep into the batter; it's just the fruit that needs to be present.",
    "You may use plums, or any other fruit that has a natural \"bloom\" of yeast on the skin surface.",
    "Cover the bowl lightly with a clean dish towel or cheesecloth.",
    "The starter needs to get air but no dust or bugs.",
    "Set it on your counter top, preferably in a warm place.",
    "If you put a lid on too tightly, you risk it building up pressure and exploding.",
    "Not too warm.",
    "On top of the refrigerator is a nice spot.",
    "Every day, stir in a tablespoon of water and a tablespoon of flour.",
    "This is called \"feeding\" the sourdough batter.",
    "In a couple days there should be signs of \"starting\"; namely, bubbling a bit as the yeasts feed on the starch and sugar.",
    "If this doesn't happen within 48 hours, discard the batch and begin again.",
    "Continue feeding every day.",
    "Don't worry if the batter separates; this means the water rises and the flour sinks.",
    "This is normal.",
    "After 5 or 6 days the starter will develop a good, yet slightly sour, smell.",
    "It is yeasty and not unpleasant.",
    "Some schools of thought say that feeding it twice a day is ideal.",
    "Experiment to see which method warrants you the best results.",
    "Feed it for a couple more days.",
    "Do this at least once a day!",
    "You'll get a consistency similar to thick drippy pancake batter.",
    "After this time, remove and discard the grapes.",
    "Cover the starter and refrigerate it.",
    "You'll need to feed and stir it every day to keep it healthy.",
    "If you begin to get too much batter (say to a gallon), discard the excess.",
    "Take the starter out of refrigeration the evening before you use it.",
    "It takes four cups starter to make two loaves of bread.",
    "Every time you use the starter, replenish it like this:\nFor each cup starter you remove, stir in 1/2 cup flour and 1/2 cup cool water.",
    "If you don't use the starter every few days, keep it in the fridge and feed it at least once weekly or it will die.",
    "If it gets very yellow and doesn't \"rise\" before baking, discard and start again.",
    "Starters have been continued for decades.",
    "It is possible (though not always recommended) to freeze your starter and revive it at a later date.",
    "Maintaining & Using Your Starter Keep your starter at slightly above room temperature.",
    "This is while it's growing.",
    "You may move it to the fridge eventually, but if it's still gaining speed, keep it above the fridge or in the oven with the light on.",
    "Feed it regularly.",
    "If your starter is too thin, increase the amount of flour in each feeding by a couple of tablespoons.",
    "But know that thick starters are harder to work with and only experienced bakers generally see good results with them.",
    "A thin starter works too quickly, so a few missed feedings can be catastrophic.",
    "Many bakers use a very thick starter and for good reason: These starters develop more flavor, seem to have more strength, are more active than their thinner counterparts and are much more tolerant of a missed feeding.",
    "However, a very thick starter can be very difficult for new bakers to work with and maintain.",
    "Get the basics down before you go thick.",
    "Look for little cracks in the surface of the batter.",
    "As the starter runs out of food, the gas production declines, and the starter begins to fall again, resulting in the drying and cracks.",
    "As the starter falls, you may see little ravine-like cracks form on the surface -- believe it or not, this is actually a good thing.",
    "The starter is active and at its peak when it just barely has started to fall.",
    "If you're wondering when to use it, it's now.",
    "Convert other recipes.",
    "Don't be shy -- sourdough can be used for pretty much anything.",
    "To convert any recipe to sourdough, start by replacing each packet of yeast (about a teaspoon or 6 grams) with a cup (240 grams) of active sourdough starter.",
    "Adjust the recipe to accommodate for the water and flour in the starter already.",
    "If the sourdough taste is too strong for the flavor the bread should be, use more starter next time.",
    "And if the bread isn't sourdough-y enough, use less sourdough starter in the future.",
    "One of the best ways to get more flavor out of the starter is to use less of it.",
    "Definitely counter-intuitive.",
    "But the reason behind that is with less, it takes longer to raise the bread.",
    "If you use more starter, you'll get a fast rise, less time for the flavor to soak in, and therefore less sourdough flavor.",
    "Storing & Reviving Your Starter Be careful when refrigerating your starter.",
    "Some people believe that if a starter gets below 46°F, you shouldn't bother working with it and it should be discarded promptly -- others disagree.",
    "If you do store it, it should be at least 30 days old and able to withstand the cooler temperature.",
    "Feed your starter just before you refrigerate it.",
    "This seems to help it bounce back faster when you go to use it in the future.",
    "A starter that was mature when stored can be very difficult to bring back to life.",
    "Don't put the lid on too tightly.",
    "Air pressure will build and possibly explode (or at the very least curb the growing process) the container.",
    "Place the lid on, but don't make it air-tight.",
    "Glass is generally a safe bet.",
    "Plastic scratches easily and metal will give the starter a metallic-y taste if left in it too long.",
    "If the starter has been in storage less than a week, use as normal.",
    "Measure out what you need and put the unused storage starter back in the refrigerator, no harm done.",
    "Let the starter you are going to use come to room temperature before you use it, however.",
    "Remember that a starter at room temperature needs to be fed twice a day (even after refrigeration), so don't leave it out without feeding it!",
    "It has been going through its stores of starch in the starter while in the refrigerator and if it's going to sit a while, it needs a real feeding.",
    "If the starter has been in storage more than a week, revive it.",
    "Feed the starter for at least three days (twice a day) before using it or putting it back in the refrigerator.",
    "Use the same precautions you took when you were growing it (temperature, etc.).",
    "Start the discarding process as normal.",
    "Discard 1/2 the starter and then feed another 1/4 cup (50 g) water and 1/2 cup (50 g) flour every 12 hours or so, like you used to in the good ol' days.",
    "When the starter is doubling nicely between feedings (good and actively stable), feed it one more time.",
    "Clean out your storage container, put the freshly revived starter back in, and then put it back into the fridge to be revived again later.",
    "Again, the keys to a successful starter are to feed the starter until it is doubling consistently between feedings, to fill the cleaned jar no more than 1/2 full (it needs air), and to refrigerate immediately after you feed the starter (once it's mature, of course)."
  ],
  "tyn_section":[
    "Bowl - plastic, ceramic or earthenware",
    "Wooden spoon (no metal!)",
    "Dish towel or cheesecloth",
    "Tablespoon (plastic, melamine etc., ",
    "not",
    " metal)",
    "Container for storage",
    "Plastic wrap"
  ],
  "tyn_model":[
    "starter",
    "water",
    "flour",
    "container",
    "whole grain flour",
    "white flour",
    "fridge",
    "refrigerator",
    "sourdough",
    "sourdough starter",
    "grapes",
    "plastic wrap",
    "oven",
    "all-purpose flour",
    "yeast",
    "starters",
    "mixing bowl",
    "sourdough experts",
    "mineral water",
    "spring water",
    "large plastic or earthenware bowl",
    "tap water",
    "plums",
    "bowl",
    "dish towel",
    "sourdough batter",
    "sugar",
    "bread",
    "cool water",
    "bakers",
    "food",
    "sourdough flavor",
    "glass",
    "jar"
  ],
  "simple_metrics":{
    "r":0.125,
    "p":0.0294117647,
    "f1":0.0476190476,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.0588235294,
    "f1":0.0952380952
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.1176470588,
    "f1":0.1904761905
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.125,
    "p":0.0294117647,
    "f1":0.0476190476
  }
}