{
  "title":"How to Make Fire Without Matches or a Lighter",
  "url":"https://www.wikihow.com/Make-Fire-Without-Matches-or-a-Lighter",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Fire",
    "Fire Making"
  ],
  "methods":[
    {
      "name":"Getting Started",
      "steps":[
        {
          "headline":"Learn how to make tinder for a fire and have your tinder nest ready.",
          "description":"For all of the methods below, you will need a tinder nest to nurture the sparks and/or embers you create into a flame."
        },
        {
          "headline":"Gather dry wood.",
          "description":"In order to create friction and maintain a flame, you will need to use dry wood, as best as you can get. Dry wood hiding places. If the area is damp, you may have to check the interior of logs, under ledges, and other places that are protected from wetness. Know your trees. Not all wood ignites equally. Depending on your locality, some particular trees start fires more readily. For instance, paper birch yields paper-like bark that, even when wet, often makes an excellent tinder. Look beyond wood. Although fire-building is usually taught in the spirit of building a fire in the wilderness, you may have to adapt. In an urban situation there may be no trees, so you may have to look at things like old books, wooden pallets, furniture, and the like to get a fire started."
        }
      ]
    },
    {
      "name":"Using Batteries and Steel Wool",
      "steps":[
        {
          "headline":"Make a tinder nest out of any dry plant material that easily catches fire.",
          "description":"You can use dry grass, leaves, small sticks, and bark. This nest will be used to create a flame out of the spark you create with the battery and steel wool."
        },
        {
          "headline":"Find a battery and locate the battery terminals.",
          "description":"The terminals are the two circular receiving prongs located on the top of the battery. Any battery voltage will work, but 9-volt batteries will ignite the quickest."
        },
        {
          "headline":"Take your steel wool and rub it on the battery terminals.",
          "description":"The finer the steel wool, the better for this process."
        },
        {
          "headline":"Continue to create friction by rubbing the steel wool on the batteries.",
          "description":"This process works by creating a current through the tiny steel wires that then heat up and ignite. Another way to do this is to take a 9-volt battery and a metal paperclip and rub the paperclip on both battery terminals at the same time to create sparks. This is similar to how the wires in light bulbs and toasters ovens operate."
        },
        {
          "headline":"Blow gently on the steel wool as it starts to glow.",
          "description":"This helps nurture the flame and encourages it to spread."
        },
        {
          "headline":"Transfer the steel wool to your tinder nest quickly, once the steel wool is glowing brightly, continuing to blow lightly on the nest until the tinder ignites, creating a flame.",
          "description":""
        },
        {
          "headline":"Add increasingly larger pieces of dry wood to build your fire once the tinder nest has ignited into a flame and enjoy your fire!",
          "description":""
        }
      ]
    },
    {
      "name":"Using Flint and Steel",
      "steps":[
        {
          "headline":"Again, build a tinder nest using dry plant material.",
          "description":""
        },
        {
          "headline":"Take your flint rock (a rock that emits sparks) and hold it between your thumb and forefinger.",
          "description":"Allow about two or three inches of flint to extend past your grasp."
        },
        {
          "headline":"Grab a piece of char cloth between your thumb and the flint.",
          "description":"Char cloths are small squares of cloth that have been turned into easily combustible charcoal pieces. If you do not have any char cloth on hand, you can also use lightweight tree fungus."
        },
        {
          "headline":"Take the back of a steel striker or the back of a knife blade (depending on which you have handy) and quickly scrape the steel against the flint.",
          "description":"Continue to strike until sparks begin to form."
        },
        {
          "headline":"Catch the sparks with your char cloth and continue the process until the cloth glows like an ember.",
          "description":"Char cloths are specially designed to hold a glow without catching fire."
        },
        {
          "headline":"Transfer the glowing char cloth to your tinder nest and gently blow on it to induce a flame.",
          "description":""
        },
        {
          "headline":"Begin to add increasingly larger pieces of wood to grow your flame into a fire.",
          "description":""
        }
      ]
    },
    {
      "name":"Using a Magnifying Glass",
      "steps":[
        {
          "headline":"Notice whether or not there is enough sunlight to create a fire using this method.",
          "description":"You generally need the sun to be unobstructed by clouds in order to utilize it with your magnifying glass. If you do not have a magnifying glass, eye glass lenses and binocular lenses work as well. Adding water to the lens allows you to create a more intense, focused beam of light."
        },
        {
          "headline":"Build a tinder nest out of dry material and set it on the ground.",
          "description":""
        },
        {
          "headline":"Tilt the lens toward the sun until the lens creates a small circle of focused light on the tinder nest.",
          "description":"You'll probably have to test out holding the lens at different angles to create the most focused beam of light possible."
        },
        {
          "headline":"Hold the lens in place until the tinder begins to smoke and flame.",
          "description":"Blow lightly on the tinder nest to nurture the flame."
        },
        {
          "headline":"Begin to add increasingly larger pieces of dry wood to your tinder nest to create the fire size you desire.",
          "description":""
        }
      ]
    },
    {
      "name":"Fashioning a Hand Drill",
      "steps":[
        {
          "headline":"Build a tinder nest out of any dry plant material.",
          "description":"Again, be sure that the material can catch fire easily."
        },
        {
          "headline":"Find a piece of wood to use as the base of your hand drill, otherwise known as a fire board.",
          "description":"You will drill on this wood piece to create friction."
        },
        {
          "headline":"Use a knife or any sharp object to cut a small, V-shaped notch in the center of your fire board.",
          "description":"Make sure that your notch is just big enough to hold your spindle stick."
        },
        {
          "headline":"Place small pieces of bark underneath the notch.",
          "description":"The bark will be used to catch an ember from the friction between the spindle and fire board."
        },
        {
          "headline":"Take your spindle stick, which should be a thin stick about two feet long and half an inch in diameter, and place it in the V-shaped notch in the center of your fire board.",
          "description":""
        },
        {
          "headline":"Hold the spindle stick between your two flat palms and begin to roll the spindle back and forth.",
          "description":"Be sure to push the spindle stick firmly down into the fire board."
        },
        {
          "headline":"Continue to roll the spindle quickly between your hands, pushing one hand forward and then the other, until an ember is formed on the fire board.",
          "description":""
        },
        {
          "headline":"Transfer the glowing embers to a small piece of bark.",
          "description":"You should have already placed a few small pieces of bark next to the notch for this purpose."
        },
        {
          "headline":"Place the bark containing the ember onto your tinder nest.",
          "description":"Continue to blow gently on the tinder nest to fully transfer the ember and create a flame."
        },
        {
          "headline":"Begin to add increasingly larger pieces of wood to maintain a larger fire.",
          "description":"Be advised that this method takes a while to create a fire, and requires physical as well as mental determination."
        }
      ]
    },
    {
      "name":"Making a Bow Drill",
      "steps":[
        {
          "headline":"Again, make a tinder nest.",
          "description":"Use any dry plant material you can gather."
        },
        {
          "headline":"Find an object to use as a socket such as a stone or a heavy piece of wood.",
          "description":"The socket will be used to put pressure on the spindle."
        },
        {
          "headline":"Find a long, flexible piece of wood about the length of your arm.",
          "description":"It is best if this piece of wood has a slight curve in it. This will serve as the handle of your bow."
        },
        {
          "headline":"Make the string of the bow using any strong, abrasive material that can withstand a lot of friction.",
          "description":"You might want to use a shoelace, a thin rope or string, paracord, or a strip of rawhide."
        },
        {
          "headline":"Tie the string as tight as possible to each end of the bow handle.",
          "description":"If there are not already natural notches in the bow wood to anchor the string, whittle small, straight notches into the wood in order to act as a groove for the string."
        },
        {
          "headline":"Find a piece of wood to use as the base of your hand drill, otherwise known as a fire board, and cut a small V-shaped notch into the center using a knife or other sharp object.",
          "description":""
        },
        {
          "headline":"Place your tinder nest underneath the V-shaped notch.",
          "description":"You want to have the tinder right next to base of the spindle so that you can easily create flames."
        },
        {
          "headline":"Loop the bow string around your spindle stick one time.",
          "description":"Make sure you do so in the middle of the bow string to create enough space to roll the string back and forth."
        },
        {
          "headline":"Whittle one end of the spindle into a point, to reduce friction in the socket.",
          "description":"Once a char starts on this end, avoid cutting it off to make the spindle last longer."
        },
        {
          "headline":"Place one end of the spindle in the V-shaped notch in your fire board and then stack the socket on the top end of the spindle.",
          "description":"Hold the socket with your non-dominant hand."
        },
        {
          "headline":"Begin sawing the bow quickly back and forth, holding the curved, wooden part of the bow in your dominant hand.",
          "description":"This will cause the spindle to spin (hence the name \"spindle\") and create heat at the base of the fire board."
        },
        {
          "headline":"Continue to saw back and forth until you create an ember where the spindle meets the fire board.",
          "description":"Make sure your tinder nest is close by."
        },
        {
          "headline":"Gather the ember you created onto a piece of scrap wood and drop it into your tinder nest.",
          "description":"You may just be able to slide the ember off of the fire board into your tinder nest."
        },
        {
          "headline":"Blow on your tinder nest as you gradually add increasingly larger pieces of dry wood to create a fire.",
          "description":""
        }
      ]
    }
  ],
  "text":" Getting Started Learn how to make tinder for a fire and have your tinder nest ready. For all of the methods below, you will need a tinder nest to nurture the sparks and/or embers you create into a flame. Gather dry wood. In order to create friction and maintain a flame, you will need to use dry wood, as best as you can get. Dry wood hiding places. If the area is damp, you may have to check the interior of logs, under ledges, and other places that are protected from wetness. Know your trees. Not all wood ignites equally. Depending on your locality, some particular trees start fires more readily. For instance, paper birch yields paper-like bark that, even when wet, often makes an excellent tinder. Look beyond wood. Although fire-building is usually taught in the spirit of building a fire in the wilderness, you may have to adapt. In an urban situation there may be no trees, so you may have to look at things like old books, wooden pallets, furniture, and the like to get a fire started. Using Batteries and Steel Wool Make a tinder nest out of any dry plant material that easily catches fire. You can use dry grass, leaves, small sticks, and bark. This nest will be used to create a flame out of the spark you create with the battery and steel wool. Find a battery and locate the battery terminals. The terminals are the two circular receiving prongs located on the top of the battery. Any battery voltage will work, but 9-volt batteries will ignite the quickest. Take your steel wool and rub it on the battery terminals. The finer the steel wool, the better for this process. Continue to create friction by rubbing the steel wool on the batteries. This process works by creating a current through the tiny steel wires that then heat up and ignite. Another way to do this is to take a 9-volt battery and a metal paperclip and rub the paperclip on both battery terminals at the same time to create sparks. This is similar to how the wires in light bulbs and toasters ovens operate. Blow gently on the steel wool as it starts to glow. This helps nurture the flame and encourages it to spread. Transfer the steel wool to your tinder nest quickly, once the steel wool is glowing brightly, continuing to blow lightly on the nest until the tinder ignites, creating a flame.  Add increasingly larger pieces of dry wood to build your fire once the tinder nest has ignited into a flame and enjoy your fire!  Using Flint and Steel Again, build a tinder nest using dry plant material.  Take your flint rock (a rock that emits sparks) and hold it between your thumb and forefinger. Allow about two or three inches of flint to extend past your grasp. Grab a piece of char cloth between your thumb and the flint. Char cloths are small squares of cloth that have been turned into easily combustible charcoal pieces. If you do not have any char cloth on hand, you can also use lightweight tree fungus. Take the back of a steel striker or the back of a knife blade (depending on which you have handy) and quickly scrape the steel against the flint. Continue to strike until sparks begin to form. Catch the sparks with your char cloth and continue the process until the cloth glows like an ember. Char cloths are specially designed to hold a glow without catching fire. Transfer the glowing char cloth to your tinder nest and gently blow on it to induce a flame.  Begin to add increasingly larger pieces of wood to grow your flame into a fire.  Using a Magnifying Glass Notice whether or not there is enough sunlight to create a fire using this method. You generally need the sun to be unobstructed by clouds in order to utilize it with your magnifying glass. If you do not have a magnifying glass, eye glass lenses and binocular lenses work as well. Adding water to the lens allows you to create a more intense, focused beam of light. Build a tinder nest out of dry material and set it on the ground.  Tilt the lens toward the sun until the lens creates a small circle of focused light on the tinder nest. You'll probably have to test out holding the lens at different angles to create the most focused beam of light possible. Hold the lens in place until the tinder begins to smoke and flame. Blow lightly on the tinder nest to nurture the flame. Begin to add increasingly larger pieces of dry wood to your tinder nest to create the fire size you desire.  Fashioning a Hand Drill Build a tinder nest out of any dry plant material. Again, be sure that the material can catch fire easily. Find a piece of wood to use as the base of your hand drill, otherwise known as a fire board. You will drill on this wood piece to create friction. Use a knife or any sharp object to cut a small, V-shaped notch in the center of your fire board. Make sure that your notch is just big enough to hold your spindle stick. Place small pieces of bark underneath the notch. The bark will be used to catch an ember from the friction between the spindle and fire board. Take your spindle stick, which should be a thin stick about two feet long and half an inch in diameter, and place it in the V-shaped notch in the center of your fire board.  Hold the spindle stick between your two flat palms and begin to roll the spindle back and forth. Be sure to push the spindle stick firmly down into the fire board. Continue to roll the spindle quickly between your hands, pushing one hand forward and then the other, until an ember is formed on the fire board.  Transfer the glowing embers to a small piece of bark. You should have already placed a few small pieces of bark next to the notch for this purpose. Place the bark containing the ember onto your tinder nest. Continue to blow gently on the tinder nest to fully transfer the ember and create a flame. Begin to add increasingly larger pieces of wood to maintain a larger fire. Be advised that this method takes a while to create a fire, and requires physical as well as mental determination. Making a Bow Drill Again, make a tinder nest. Use any dry plant material you can gather. Find an object to use as a socket such as a stone or a heavy piece of wood. The socket will be used to put pressure on the spindle. Find a long, flexible piece of wood about the length of your arm. It is best if this piece of wood has a slight curve in it. This will serve as the handle of your bow. Make the string of the bow using any strong, abrasive material that can withstand a lot of friction. You might want to use a shoelace, a thin rope or string, paracord, or a strip of rawhide. Tie the string as tight as possible to each end of the bow handle. If there are not already natural notches in the bow wood to anchor the string, whittle small, straight notches into the wood in order to act as a groove for the string. Find a piece of wood to use as the base of your hand drill, otherwise known as a fire board, and cut a small V-shaped notch into the center using a knife or other sharp object.  Place your tinder nest underneath the V-shaped notch. You want to have the tinder right next to base of the spindle so that you can easily create flames. Loop the bow string around your spindle stick one time. Make sure you do so in the middle of the bow string to create enough space to roll the string back and forth. Whittle one end of the spindle into a point, to reduce friction in the socket. Once a char starts on this end, avoid cutting it off to make the spindle last longer. Place one end of the spindle in the V-shaped notch in your fire board and then stack the socket on the top end of the spindle. Hold the socket with your non-dominant hand. Begin sawing the bow quickly back and forth, holding the curved, wooden part of the bow in your dominant hand. This will cause the spindle to spin (hence the name \"spindle\") and create heat at the base of the fire board. Continue to saw back and forth until you create an ember where the spindle meets the fire board. Make sure your tinder nest is close by. Gather the ember you created onto a piece of scrap wood and drop it into your tinder nest. You may just be able to slide the ember off of the fire board into your tinder nest. Blow on your tinder nest as you gradually add increasingly larger pieces of dry wood to create a fire. ",
  "sentences":[
    " Getting Started Learn how to make tinder for a fire and have your tinder nest ready.",
    "For all of the methods below, you will need a tinder nest to nurture the sparks and/or embers you create into a flame.",
    "Gather dry wood.",
    "In order to create friction and maintain a flame, you will need to use dry wood, as best as you can get.",
    "Dry wood hiding places.",
    "If the area is damp, you may have to check the interior of logs, under ledges, and other places that are protected from wetness.",
    "Know your trees.",
    "Not all wood ignites equally.",
    "Depending on your locality, some particular trees start fires more readily.",
    "For instance, paper birch yields paper-like bark that, even when wet, often makes an excellent tinder.",
    "Look beyond wood.",
    "Although fire-building is usually taught in the spirit of building a fire in the wilderness, you may have to adapt.",
    "In an urban situation there may be no trees, so you may have to look at things like old books, wooden pallets, furniture, and the like to get a fire started.",
    "Using Batteries and Steel Wool Make a tinder nest out of any dry plant material that easily catches fire.",
    "You can use dry grass, leaves, small sticks, and bark.",
    "This nest will be used to create a flame out of the spark you create with the battery and steel wool.",
    "Find a battery and locate the battery terminals.",
    "The terminals are the two circular receiving prongs located on the top of the battery.",
    "Any battery voltage will work, but 9-volt batteries will ignite the quickest.",
    "Take your steel wool and rub it on the battery terminals.",
    "The finer the steel wool, the better for this process.",
    "Continue to create friction by rubbing the steel wool on the batteries.",
    "This process works by creating a current through the tiny steel wires that then heat up and ignite.",
    "Another way to do this is to take a 9-volt battery and a metal paperclip and rub the paperclip on both battery terminals at the same time to create sparks.",
    "This is similar to how the wires in light bulbs and toasters ovens operate.",
    "Blow gently on the steel wool as it starts to glow.",
    "This helps nurture the flame and encourages it to spread.",
    "Transfer the steel wool to your tinder nest quickly, once the steel wool is glowing brightly, continuing to blow lightly on the nest until the tinder ignites, creating a flame.",
    "Add increasingly larger pieces of dry wood to build your fire once the tinder nest has ignited into a flame and enjoy your fire!",
    "Using Flint and Steel Again, build a tinder nest using dry plant material.",
    "Take your flint rock (a rock that emits sparks) and hold it between your thumb and forefinger.",
    "Allow about two or three inches of flint to extend past your grasp.",
    "Grab a piece of char cloth between your thumb and the flint.",
    "Char cloths are small squares of cloth that have been turned into easily combustible charcoal pieces.",
    "If you do not have any char cloth on hand, you can also use lightweight tree fungus.",
    "Take the back of a steel striker or the back of a knife blade (depending on which you have handy) and quickly scrape the steel against the flint.",
    "Continue to strike until sparks begin to form.",
    "Catch the sparks with your char cloth and continue the process until the cloth glows like an ember.",
    "Char cloths are specially designed to hold a glow without catching fire.",
    "Transfer the glowing char cloth to your tinder nest and gently blow on it to induce a flame.",
    "Begin to add increasingly larger pieces of wood to grow your flame into a fire.",
    "Using a Magnifying Glass Notice whether or not there is enough sunlight to create a fire using this method.",
    "You generally need the sun to be unobstructed by clouds in order to utilize it with your magnifying glass.",
    "If you do not have a magnifying glass, eye glass lenses and binocular lenses work as well.",
    "Adding water to the lens allows you to create a more intense, focused beam of light.",
    "Build a tinder nest out of dry material and set it on the ground.",
    "Tilt the lens toward the sun until the lens creates a small circle of focused light on the tinder nest.",
    "You'll probably have to test out holding the lens at different angles to create the most focused beam of light possible.",
    "Hold the lens in place until the tinder begins to smoke and flame.",
    "Blow lightly on the tinder nest to nurture the flame.",
    "Begin to add increasingly larger pieces of dry wood to your tinder nest to create the fire size you desire.",
    "Fashioning a Hand Drill Build a tinder nest out of any dry plant material.",
    "Again, be sure that the material can catch fire easily.",
    "Find a piece of wood to use as the base of your hand drill, otherwise known as a fire board.",
    "You will drill on this wood piece to create friction.",
    "Use a knife or any sharp object to cut a small, V-shaped notch in the center of your fire board.",
    "Make sure that your notch is just big enough to hold your spindle stick.",
    "Place small pieces of bark underneath the notch.",
    "The bark will be used to catch an ember from the friction between the spindle and fire board.",
    "Take your spindle stick, which should be a thin stick about two feet long and half an inch in diameter, and place it in the V-shaped notch in the center of your fire board.",
    "Hold the spindle stick between your two flat palms and begin to roll the spindle back and forth.",
    "Be sure to push the spindle stick firmly down into the fire board.",
    "Continue to roll the spindle quickly between your hands, pushing one hand forward and then the other, until an ember is formed on the fire board.",
    "Transfer the glowing embers to a small piece of bark.",
    "You should have already placed a few small pieces of bark next to the notch for this purpose.",
    "Place the bark containing the ember onto your tinder nest.",
    "Continue to blow gently on the tinder nest to fully transfer the ember and create a flame.",
    "Begin to add increasingly larger pieces of wood to maintain a larger fire.",
    "Be advised that this method takes a while to create a fire, and requires physical as well as mental determination.",
    "Making a Bow Drill Again, make a tinder nest.",
    "Use any dry plant material you can gather.",
    "Find an object to use as a socket such as a stone or a heavy piece of wood.",
    "The socket will be used to put pressure on the spindle.",
    "Find a long, flexible piece of wood about the length of your arm.",
    "It is best if this piece of wood has a slight curve in it.",
    "This will serve as the handle of your bow.",
    "Make the string of the bow using any strong, abrasive material that can withstand a lot of friction.",
    "You might want to use a shoelace, a thin rope or string, paracord, or a strip of rawhide.",
    "Tie the string as tight as possible to each end of the bow handle.",
    "If there are not already natural notches in the bow wood to anchor the string, whittle small, straight notches into the wood in order to act as a groove for the string.",
    "Find a piece of wood to use as the base of your hand drill, otherwise known as a fire board, and cut a small V-shaped notch into the center using a knife or other sharp object.",
    "Place your tinder nest underneath the V-shaped notch.",
    "You want to have the tinder right next to base of the spindle so that you can easily create flames.",
    "Loop the bow string around your spindle stick one time.",
    "Make sure you do so in the middle of the bow string to create enough space to roll the string back and forth.",
    "Whittle one end of the spindle into a point, to reduce friction in the socket.",
    "Once a char starts on this end, avoid cutting it off to make the spindle last longer.",
    "Place one end of the spindle in the V-shaped notch in your fire board and then stack the socket on the top end of the spindle.",
    "Hold the socket with your non-dominant hand.",
    "Begin sawing the bow quickly back and forth, holding the curved, wooden part of the bow in your dominant hand.",
    "This will cause the spindle to spin (hence the name \"spindle\") and create heat at the base of the fire board.",
    "Continue to saw back and forth until you create an ember where the spindle meets the fire board.",
    "Make sure your tinder nest is close by.",
    "Gather the ember you created onto a piece of scrap wood and drop it into your tinder nest.",
    "You may just be able to slide the ember off of the fire board into your tinder nest.",
    "Blow on your tinder nest as you gradually add increasingly larger pieces of dry wood to create a fire."
  ],
  "tyn_section":[
    "For the Battery and Steel Wool Method",
    "Steel wool (or a paper clip)",
    "A battery",
    "Tinder nest",
    "Dry wood",
    "For the Flint and Steel Method",
    "A Flint",
    "Steel",
    "Char cloth",
    "For the Magnifying Glass Method",
    "Magnifying lens or other useful lens",
    "Water (optional)",
    "For the Hand Drill Method",
    "Spindle stick",
    "Fire board",
    "Knife or sharp object",
    "Small bark pieces",
    "For the Bow Drill Method",
    "Socket",
    "Bow",
    "String"
  ],
  "tyn_model":[
    "fire board",
    "steel wool",
    "spindle",
    "bark",
    "tinder",
    "char cloth",
    "magnifying glass",
    "lens",
    "hand drill",
    "battery",
    "flint",
    "char cloths",
    "knife",
    "tinder nest",
    "logs",
    "paper birch",
    "fire",
    "trees",
    "batteries",
    "9-volt battery",
    "toasters ovens",
    "flint rock",
    "tree fungus",
    "steel striker",
    "knife blade",
    "eye glass lenses",
    "binocular lenses",
    "water",
    "drill",
    "spindle stick",
    "stone",
    "shoelace",
    "string",
    "paracord",
    "rawhide",
    "bow string",
    "saw"
  ],
  "simple_metrics":{
    "r":0.2380952381,
    "p":0.1351351351,
    "f1":0.1724137931,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4761904762,
    "p":0.3783783784,
    "f1":0.421686747
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.5405405405,
    "f1":0.5970149254
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2380952381,
    "p":0.1351351351,
    "f1":0.1724137931
  }
}