{
  "title":"How to Make Roti with Electronic Roti Maker",
  "url":"https://www.wikihow.com/Make-Roti-with-Electronic-Roti-Maker",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Breads"
  ],
  "parts":[
    {
      "name":"Making the Roti Dough",
      "steps":[
        {
          "headline":"Combine the flour and salt in a medium-sized mixing bowl.",
          "description":"Use 2 cups (250 grams) of bread flour and 1 teaspoon (5.6 grams) of salt. Measure the ingredients into the same bowl, and then use a fork to combine them. If you don’t have bread flour, you could also use all-purpose flour."
        },
        {
          "headline":"Add 2 tablespoons (30 mL) of melted butter to the flour mixture.",
          "description":"Drizzle the butter over the flour, and then use a fork to roughly mix things together. Stop once the mixture is crumbly. If you don’t want to use butter, sub it out for the same amount of vegetable oil."
        },
        {
          "headline":"Pour the water into the bowl, and mix everything together by hand.",
          "description":"Use 1 and ⁄3 cup (237 and 79 mL) of water for the roti. Scrape the sides of the bowl with your fingers as you mix everything to make sure all the flour is incorporated into the dough. Keep mixing the dough until there are no more pockets of dry flour. Make sure to wash your hands before you start mixing the dough, and take off any rings so they don’t get messy from the dough. The dough for an electronic roti maker will be wetter than traditional roti dough. The excessive wetness makes the dough easier to press down in the roti maker, which will give you a more consistent roti."
        },
        {
          "headline":"Knead the dough for about 5 minutes.",
          "description":"Keep the dough in the bowl, and continue to scrape around the sides as you work if pieces of dough come loose from the main ball. Pick the dough up, throw it back down, and press into it with your palms to really ensure everything is mixed together. This process knocks out air bubbles and distributes the ingredients evenly throughout the dough, which will give you a lighter, fluffier roti. Traditional roti bread would become smooth as you kneaded it, but this dough will remain sticky and wet. Your fingers will get clumpy from the dough, and it won’t have a smooth exterior when you’re done."
        },
        {
          "headline":"Cover the dough with a damp paper towel and let it rest for 30 minutes.",
          "description":"Wet a paper towel, wring it out so it’s not dripping wet, and lay it over the dough. Set a timer for 30 minutes, and let the dough rest. The moisture from the paper towel keeps the dough from getting hard or forming crusty areas."
        },
        {
          "headline":"Divide the dough into 18 equal sections after it has finished resting.",
          "description":"Lightly sprinkle about 1 teaspoon (3.3 grams) of flour over the dough to make it easier to work with. Pinch golfball-sized sections off of the big ball of dough, and set each section on a plate dusted with flour. The flour dusting on the plate isn’t necessary if you think the dough won’t stick to the plate."
        },
        {
          "headline":"Roll each section of dough into a ball the size of a golfball.",
          "description":"After the dough has been divided out, take each section and roll it between your palms to create a rounded shape. After each ball is formed, put it back on the plate. It’s okay if the sizes are slightly off from ball to ball, but try to keep them as equal as you can."
        }
      ]
    },
    {
      "name":"Using the Electronic Roti Maker",
      "steps":[
        {
          "headline":"Place the roti maker on a secure surface and turn it on.",
          "description":"If you have something like a dish-drying mat, place your roti maker on top of it. Turn on the roti maker and wait to use it until the indicator light shows it has finished heating up. The dish-drying mat keeps the roti maker from slipping or scratching the counter. If your roti maker comes with slip-free feet, you don’t need to worry about setting it on top of anything else. Always use a clean roti maker. If there are crumbs, dust, or grease on it, wipe it off with a wet paper towel before making your roti."
        },
        {
          "headline":"Place one dough ball in the machine between the middle and the top.",
          "description":"Instead of setting the dough right in the middle of the roti maker, place it closer to the hinge of the machine. Right in the middle of the top half section is the best place for it, so that the dough doesn’t get squeezed out around the sides. You can always experiment with the dough placement to see which position works best for you!"
        },
        {
          "headline":"Close the roti maker and press the top handle down to secure it.",
          "description":"The roti maker is comprised of 3 parts: the base, a hinged top, and a handle. Close the hinged top, and then press the handle to compress the roti dough in the machine. The handle is essential to getting your dough really flat to achieve that classic roti look."
        },
        {
          "headline":"Press the roti for 30 to 45 seconds, then open the roti maker back up.",
          "description":"Keep the handle pressed down as you count to 30. After the time has passed, release the handle and flip back the hinged top. If you need to, slide the roti to the middle of the machine with your fingertips. The roti will be hot, but you should still be able to gently touch the top and move it around without burning yourself. If the roti is too hot for you, use a damp paper towel or a pair of tongs to move the roti. Most roti makers are non-stick, making the roti super easy to turn and reposition as needed."
        },
        {
          "headline":"Cook the roti for 15 seconds, or until bubbles start to form.",
          "description":"Let the roti continue to cook on the base. Turn the roti every few seconds to keep it cooking evenly. Don’t flip the roti over until you notice bubbles, even if it takes an extra 10 seconds or so. If you do, the roti may not be cooked all the way through."
        },
        {
          "headline":"Flip the roti over carefully and cook it for an additional 10 to 15 seconds.",
          "description":"Use your hands or a pair of tongs to flip the roti over. Let the other side cook for 10 to 15 seconds, or until you notice the roti is starting to puff up in the middle. You’ll know the roti is done when you see its characteristic puff. The dough will spread out, creating a big, round ball, and then it will collapse down again into a flat pita shape."
        },
        {
          "headline":"Close the lid gently on the roti, but don’t secure the clasp.",
          "description":"Once the roti starts to puff, very gently set the hinged lid back down on top of it. Don’t press it down hard, and don’t use the handle at all. This step finalizes the cooking process and gives each side one more blast of heat."
        },
        {
          "headline":"Remove the roti from the machine after it puffs and pushes the lid open.",
          "description":"Watch the lid of the roti maker. The roti itself will puff out and become very large, pushing the top of the machine back up. When you see this happen, wait until the roti deflates and becomes flat again, and then remove it from the machine. Some people are able to get the big puff without closing the lid again, but the most reliable method is to use the heat from the lid to create the puff."
        },
        {
          "headline":"Repeat the cooking process for the rest of your roti dough balls.",
          "description":"Set each cooked roti to the side, and continue cooking until all the dough balls have been pressed. Roti dough does need to be cooked the same day it’s made, so don’t set any of the dough aside to make later."
        },
        {
          "headline":"Let the cooked roti rest for 10 minutes, then wrap them in foil.",
          "description":"After you’re done cooking them, set a time for 10 minutes. Once the time is up, wrap the roti up in aluminum foil until you’re ready to eat them. The roti can all be stored together. You don’t have to wrap each one individually. If you don’t let the roti rest before wrapping them up, the heat will make them stick to one another and they’ll be hard to separate later."
        },
        {
          "headline":"Keep leftover roti in the fridge in a resealable bag for 1 to 2 days.",
          "description":"Roti is best enjoyed immediately. If you do have leftovers, put them into a plastic bag and keep them in the fridge. Reheat them on the stovetop or in the microwave for 10 to 20 seconds. Roti turn hard quickly and aren’t good for long-term enjoyment."
        }
      ]
    }
  ],
  "text":" Making the Roti Dough Combine the flour and salt in a medium-sized mixing bowl. Use 2 cups (250 grams) of bread flour and 1 teaspoon (5.6 grams) of salt. Measure the ingredients into the same bowl, and then use a fork to combine them. If you don’t have bread flour, you could also use all-purpose flour. Add 2 tablespoons (30 mL) of melted butter to the flour mixture. Drizzle the butter over the flour, and then use a fork to roughly mix things together. Stop once the mixture is crumbly. If you don’t want to use butter, sub it out for the same amount of vegetable oil. Pour the water into the bowl, and mix everything together by hand. Use 1 and ⁄3 cup (237 and 79 mL) of water for the roti. Scrape the sides of the bowl with your fingers as you mix everything to make sure all the flour is incorporated into the dough. Keep mixing the dough until there are no more pockets of dry flour. Make sure to wash your hands before you start mixing the dough, and take off any rings so they don’t get messy from the dough. The dough for an electronic roti maker will be wetter than traditional roti dough. The excessive wetness makes the dough easier to press down in the roti maker, which will give you a more consistent roti. Knead the dough for about 5 minutes. Keep the dough in the bowl, and continue to scrape around the sides as you work if pieces of dough come loose from the main ball. Pick the dough up, throw it back down, and press into it with your palms to really ensure everything is mixed together. This process knocks out air bubbles and distributes the ingredients evenly throughout the dough, which will give you a lighter, fluffier roti. Traditional roti bread would become smooth as you kneaded it, but this dough will remain sticky and wet. Your fingers will get clumpy from the dough, and it won’t have a smooth exterior when you’re done. Cover the dough with a damp paper towel and let it rest for 30 minutes. Wet a paper towel, wring it out so it’s not dripping wet, and lay it over the dough. Set a timer for 30 minutes, and let the dough rest. The moisture from the paper towel keeps the dough from getting hard or forming crusty areas. Divide the dough into 18 equal sections after it has finished resting. Lightly sprinkle about 1 teaspoon (3.3 grams) of flour over the dough to make it easier to work with. Pinch golfball-sized sections off of the big ball of dough, and set each section on a plate dusted with flour. The flour dusting on the plate isn’t necessary if you think the dough won’t stick to the plate. Roll each section of dough into a ball the size of a golfball. After the dough has been divided out, take each section and roll it between your palms to create a rounded shape. After each ball is formed, put it back on the plate. It’s okay if the sizes are slightly off from ball to ball, but try to keep them as equal as you can. Using the Electronic Roti Maker Place the roti maker on a secure surface and turn it on. If you have something like a dish-drying mat, place your roti maker on top of it. Turn on the roti maker and wait to use it until the indicator light shows it has finished heating up. The dish-drying mat keeps the roti maker from slipping or scratching the counter. If your roti maker comes with slip-free feet, you don’t need to worry about setting it on top of anything else. Always use a clean roti maker. If there are crumbs, dust, or grease on it, wipe it off with a wet paper towel before making your roti. Place one dough ball in the machine between the middle and the top. Instead of setting the dough right in the middle of the roti maker, place it closer to the hinge of the machine. Right in the middle of the top half section is the best place for it, so that the dough doesn’t get squeezed out around the sides. You can always experiment with the dough placement to see which position works best for you! Close the roti maker and press the top handle down to secure it. The roti maker is comprised of 3 parts: the base, a hinged top, and a handle. Close the hinged top, and then press the handle to compress the roti dough in the machine. The handle is essential to getting your dough really flat to achieve that classic roti look. Press the roti for 30 to 45 seconds, then open the roti maker back up. Keep the handle pressed down as you count to 30. After the time has passed, release the handle and flip back the hinged top. If you need to, slide the roti to the middle of the machine with your fingertips. The roti will be hot, but you should still be able to gently touch the top and move it around without burning yourself. If the roti is too hot for you, use a damp paper towel or a pair of tongs to move the roti. Most roti makers are non-stick, making the roti super easy to turn and reposition as needed. Cook the roti for 15 seconds, or until bubbles start to form. Let the roti continue to cook on the base. Turn the roti every few seconds to keep it cooking evenly. Don’t flip the roti over until you notice bubbles, even if it takes an extra 10 seconds or so. If you do, the roti may not be cooked all the way through. Flip the roti over carefully and cook it for an additional 10 to 15 seconds. Use your hands or a pair of tongs to flip the roti over. Let the other side cook for 10 to 15 seconds, or until you notice the roti is starting to puff up in the middle. You’ll know the roti is done when you see its characteristic puff. The dough will spread out, creating a big, round ball, and then it will collapse down again into a flat pita shape. Close the lid gently on the roti, but don’t secure the clasp. Once the roti starts to puff, very gently set the hinged lid back down on top of it. Don’t press it down hard, and don’t use the handle at all. This step finalizes the cooking process and gives each side one more blast of heat. Remove the roti from the machine after it puffs and pushes the lid open. Watch the lid of the roti maker. The roti itself will puff out and become very large, pushing the top of the machine back up. When you see this happen, wait until the roti deflates and becomes flat again, and then remove it from the machine. Some people are able to get the big puff without closing the lid again, but the most reliable method is to use the heat from the lid to create the puff. Repeat the cooking process for the rest of your roti dough balls. Set each cooked roti to the side, and continue cooking until all the dough balls have been pressed. Roti dough does need to be cooked the same day it’s made, so don’t set any of the dough aside to make later. Let the cooked roti rest for 10 minutes, then wrap them in foil. After you’re done cooking them, set a time for 10 minutes. Once the time is up, wrap the roti up in aluminum foil until you’re ready to eat them. The roti can all be stored together. You don’t have to wrap each one individually. If you don’t let the roti rest before wrapping them up, the heat will make them stick to one another and they’ll be hard to separate later. Keep leftover roti in the fridge in a resealable bag for 1 to 2 days. Roti is best enjoyed immediately. If you do have leftovers, put them into a plastic bag and keep them in the fridge. Reheat them on the stovetop or in the microwave for 10 to 20 seconds. Roti turn hard quickly and aren’t good for long-term enjoyment.",
  "sentences":[
    " Making the Roti Dough Combine the flour and salt in a medium-sized mixing bowl.",
    "Use 2 cups (250 grams) of bread flour and 1 teaspoon (5.6 grams) of salt.",
    "Measure the ingredients into the same bowl, and then use a fork to combine them.",
    "If you don’t have bread flour, you could also use all-purpose flour.",
    "Add 2 tablespoons (30 mL) of melted butter to the flour mixture.",
    "Drizzle the butter over the flour, and then use a fork to roughly mix things together.",
    "Stop once the mixture is crumbly.",
    "If you don’t want to use butter, sub it out for the same amount of vegetable oil.",
    "Pour the water into the bowl, and mix everything together by hand.",
    "Use 1 and ⁄3 cup (237 and 79 mL) of water for the roti.",
    "Scrape the sides of the bowl with your fingers as you mix everything to make sure all the flour is incorporated into the dough.",
    "Keep mixing the dough until there are no more pockets of dry flour.",
    "Make sure to wash your hands before you start mixing the dough, and take off any rings so they don’t get messy from the dough.",
    "The dough for an electronic roti maker will be wetter than traditional roti dough.",
    "The excessive wetness makes the dough easier to press down in the roti maker, which will give you a more consistent roti.",
    "Knead the dough for about 5 minutes.",
    "Keep the dough in the bowl, and continue to scrape around the sides as you work if pieces of dough come loose from the main ball.",
    "Pick the dough up, throw it back down, and press into it with your palms to really ensure everything is mixed together.",
    "This process knocks out air bubbles and distributes the ingredients evenly throughout the dough, which will give you a lighter, fluffier roti.",
    "Traditional roti bread would become smooth as you kneaded it, but this dough will remain sticky and wet.",
    "Your fingers will get clumpy from the dough, and it won’t have a smooth exterior when you’re done.",
    "Cover the dough with a damp paper towel and let it rest for 30 minutes.",
    "Wet a paper towel, wring it out so it’s not dripping wet, and lay it over the dough.",
    "Set a timer for 30 minutes, and let the dough rest.",
    "The moisture from the paper towel keeps the dough from getting hard or forming crusty areas.",
    "Divide the dough into 18 equal sections after it has finished resting.",
    "Lightly sprinkle about 1 teaspoon (3.3 grams) of flour over the dough to make it easier to work with.",
    "Pinch golfball-sized sections off of the big ball of dough, and set each section on a plate dusted with flour.",
    "The flour dusting on the plate isn’t necessary if you think the dough won’t stick to the plate.",
    "Roll each section of dough into a ball the size of a golfball.",
    "After the dough has been divided out, take each section and roll it between your palms to create a rounded shape.",
    "After each ball is formed, put it back on the plate.",
    "It’s okay if the sizes are slightly off from ball to ball, but try to keep them as equal as you can.",
    "Using the Electronic Roti Maker Place the roti maker on a secure surface and turn it on.",
    "If you have something like a dish-drying mat, place your roti maker on top of it.",
    "Turn on the roti maker and wait to use it until the indicator light shows it has finished heating up.",
    "The dish-drying mat keeps the roti maker from slipping or scratching the counter.",
    "If your roti maker comes with slip-free feet, you don’t need to worry about setting it on top of anything else.",
    "Always use a clean roti maker.",
    "If there are crumbs, dust, or grease on it, wipe it off with a wet paper towel before making your roti.",
    "Place one dough ball in the machine between the middle and the top.",
    "Instead of setting the dough right in the middle of the roti maker, place it closer to the hinge of the machine.",
    "Right in the middle of the top half section is the best place for it, so that the dough doesn’t get squeezed out around the sides.",
    "You can always experiment with the dough placement to see which position works best for you!",
    "Close the roti maker and press the top handle down to secure it.",
    "The roti maker is comprised of 3 parts: the base, a hinged top, and a handle.",
    "Close the hinged top, and then press the handle to compress the roti dough in the machine.",
    "The handle is essential to getting your dough really flat to achieve that classic roti look.",
    "Press the roti for 30 to 45 seconds, then open the roti maker back up.",
    "Keep the handle pressed down as you count to 30.",
    "After the time has passed, release the handle and flip back the hinged top.",
    "If you need to, slide the roti to the middle of the machine with your fingertips.",
    "The roti will be hot, but you should still be able to gently touch the top and move it around without burning yourself.",
    "If the roti is too hot for you, use a damp paper towel or a pair of tongs to move the roti.",
    "Most roti makers are non-stick, making the roti super easy to turn and reposition as needed.",
    "Cook the roti for 15 seconds, or until bubbles start to form.",
    "Let the roti continue to cook on the base.",
    "Turn the roti every few seconds to keep it cooking evenly.",
    "Don’t flip the roti over until you notice bubbles, even if it takes an extra 10 seconds or so.",
    "If you do, the roti may not be cooked all the way through.",
    "Flip the roti over carefully and cook it for an additional 10 to 15 seconds.",
    "Use your hands or a pair of tongs to flip the roti over.",
    "Let the other side cook for 10 to 15 seconds, or until you notice the roti is starting to puff up in the middle.",
    "You’ll know the roti is done when you see its characteristic puff.",
    "The dough will spread out, creating a big, round ball, and then it will collapse down again into a flat pita shape.",
    "Close the lid gently on the roti, but don’t secure the clasp.",
    "Once the roti starts to puff, very gently set the hinged lid back down on top of it.",
    "Don’t press it down hard, and don’t use the handle at all.",
    "This step finalizes the cooking process and gives each side one more blast of heat.",
    "Remove the roti from the machine after it puffs and pushes the lid open.",
    "Watch the lid of the roti maker.",
    "The roti itself will puff out and become very large, pushing the top of the machine back up.",
    "When you see this happen, wait until the roti deflates and becomes flat again, and then remove it from the machine.",
    "Some people are able to get the big puff without closing the lid again, but the most reliable method is to use the heat from the lid to create the puff.",
    "Repeat the cooking process for the rest of your roti dough balls.",
    "Set each cooked roti to the side, and continue cooking until all the dough balls have been pressed.",
    "Roti dough does need to be cooked the same day it’s made, so don’t set any of the dough aside to make later.",
    "Let the cooked roti rest for 10 minutes, then wrap them in foil.",
    "After you’re done cooking them, set a time for 10 minutes.",
    "Once the time is up, wrap the roti up in aluminum foil until you’re ready to eat them.",
    "The roti can all be stored together.",
    "You don’t have to wrap each one individually.",
    "If you don’t let the roti rest before wrapping them up, the heat will make them stick to one another and they’ll be hard to separate later.",
    "Keep leftover roti in the fridge in a resealable bag for 1 to 2 days.",
    "Roti is best enjoyed immediately.",
    "If you do have leftovers, put them into a plastic bag and keep them in the fridge.",
    "Reheat them on the stovetop or in the microwave for 10 to 20 seconds.",
    "Roti turn hard quickly and aren’t good for long-term enjoyment."
  ],
  "tyn_section":[
    "Electronic roti maker",
    "Measuring cups and spoons",
    "Fork",
    "Plate",
    "Mixing bowl",
    "Paper towels",
    "Resealable plastic bag",
    "Aluminium foil"
  ],
  "tyn_model":[
    "roti maker",
    "flour",
    "roti dough",
    "plate",
    "butter",
    "bowl",
    "salt",
    "bread flour",
    "fork",
    "water",
    "dish-drying mat",
    "roti",
    "medium-sized mixing bowl",
    "all-purpose flour",
    "vegetable oil",
    "roti bread",
    "paper",
    "paper towel",
    "electronic roti maker",
    "tongs",
    "roti makers",
    "machine",
    "foil",
    "aluminum foil",
    "resealable bag",
    "plastic bag",
    "microwave"
  ],
  "simple_metrics":{
    "r":0.375,
    "p":0.1111111111,
    "f1":0.1714285714,
    "avg_pos":0.6666666667
  },
  "jacc_metrics_0.5":{
    "r":0.875,
    "p":0.3703703704,
    "f1":0.5204460967
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.4814814815,
    "f1":0.6211604096
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.2592592593,
    "f1":0.3664921466
  }
}