{
  "title":"How to Preserve Fall Leaves",
  "url":"https://www.wikihow.com/Preserve-Fall-Leaves",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Decoupaging Leaves",
      "steps":[
        {
          "headline":"Select vibrant leaves.",
          "description":"Harvest freshly fallen leaves that are bright in color and fairly supple. The leaves can be somewhat dry, but they should not be so dry that they are brittle or turning up at the ends. Avoid leaves with rips or rotten spots."
        },
        {
          "headline":"Coat both sides of each leaf in decoupage.",
          "description":"Decoupage is a white, gluey substance that turns clear when it dries. You can find it at your local craft store. Use a foam brush to carefully apply a liberal coat of decoupage to one side of each leaf. Set them to dry on a piece of newspaper. In most cases, you should apply the decoupage to the leaves the same day you collect them. If you wait too long, the leaves will dry out, becoming brown and brittle. If the leaves are very moist, however, or if you plucked them directly off the tree instead of waiting for them to drop, you can dry them out slightly by pressing them in between the pages of a heavy book for a few days."
        },
        {
          "headline":"Allow the decoupage to completely dry.",
          "description":"It will turn clear and will no longer be sticky."
        },
        {
          "headline":"Repeat on the other side.",
          "description":"Turn the leaf and apply the decoupage to the other side. When the second side is dry, the leaves are ready to use. This method preserves the color and form of the leaves for an extended period of time."
        }
      ]
    },
    {
      "name":"Coating Leaves With Paraffin Wax",
      "steps":[
        {
          "headline":"Choose fresh leaves.",
          "description":"Start out with leaves that are vibrant, and newly fallen. Coating the leaves with paraffin wax will preserve them at the height of their brilliant color. Dry them off with paper towels before you begin."
        },
        {
          "headline":"Melt paraffin wax in a disposable pan.",
          "description":"You can buy a a 16-oz (453 g) box of paraffin wax at your local craft or grocery store. Melt it in a disposable cake pan by heating the pan on your stove over low heat. To make the paraffin wax melt more quickly, slice it into thick chunks and spread them evenly along the bottom of the disposable pan. If you do not use a disposable pan, use a cake pan that you do not plan on using for cooking anymore. The wax can ruin the pan, so you should not use a pan that you frequently use for cooking and baking."
        },
        {
          "headline":"Remove the melted wax from the stove.",
          "description":"Exercise caution, since melted wax is very hot. Transfer it carefully from the burner to your work table. Pay close attention to it to make sure that it does not get knocked over, especially if you have pets or small children."
        },
        {
          "headline":"Dip each leaf into the melted wax.",
          "description":"Hold a leaf at the tip of the stem and dunk it into the liquified wax several times. Make sure both sides of the leaf get coated in wax. Avoid getting your fingers too close to the wax. Repeat with the remaining leaves."
        },
        {
          "headline":"Lay the leaves out to dry.",
          "description":"Lay each wax-covered leaf out on wax paper until the wax hardens. Let the leaves dry in draft-free area for several hours. Once dried, they should lift off the wax paper easily. This method preserves the form and color of the leaves for a long time. To be extra safe, line the counters with newsprint before lining them with a layer of wax paper. The double-layer minimizes the risk of getting wax drippings on the counter. If they get on the counter, wax drippings can be extremely difficult to scrape off."
        }
      ]
    },
    {
      "name":"Using a Glycerin Bath",
      "steps":[
        {
          "headline":"Select fresh leaves or a small branch with leaves attached.",
          "description":"If you would like to preserve an entire branch of fall leaves, this preservation method is easier to use than wax. Choose a branch with leaves that are vibrant and firmly attached. This method will make the colors more vibrant. Yellows become more intense, and reds and oranges become a vibrant ruddy color. Look for sprigs that have fallen off the tree on their own instead of breaking them off the tree yourself. Removing a branch from a tree can damage it. Do not choose branches that have diseased leaves or those that have gone through a frost. This method does not work on leaves that have already gone through a frost."
        },
        {
          "headline":"Open up the end of each branch.",
          "description":"Strike the end of each branch with a hammer to split it open, exposing the live portion of the wood. This exposes the live wood of the branch so that it can absorb the glycerin solution properly. Otherwise, the solution will not be able to reach the leaves. If you're just preserving individual leaves, you can skip this step."
        },
        {
          "headline":"Mix up a glycerin solution.",
          "description":"You can find vegetable glycerin in your local craft or grocery store. To make a solution, add 17 oz (530 ml) of liquid vegetable glycerin to half a gallon (2 liters) of water in a large bucket or vase. Glycerin is a natural product derived from vegetables, making this a fairly organic option to preserve your leaves. If you're preserving a large, woody branch, mix in four to five drops of mild liquid dish soap. The dish soap acts as a surfactant, breaking the surface tension of the glycerin so that the molecules can penetrate the wood more easily. For best results, use a mild dish soap with no added colors or scents. You could also use liquid surfactant, which is available at most gardening stores."
        },
        {
          "headline":"Stand the branch in the solution for three to five days.",
          "description":"Allow the branches and leaves to absorb the glycerin for at least three to five days. Store the bucket in a shaded place during the absorption process. If you're preserving individual leaves, you'll need to weight them so they stay submerged. Pour the solution into a flat pan, place the leaves in the solution, and cover them with a plate or lid to hold them down."
        },
        {
          "headline":"Remove the branch and leaves from the solution.",
          "description":"The color will look brighter, and the leaves should feel supple. You can use the whole preserved branch in your crafts or you can pluck the leaves off and use them separately."
        }
      ]
    },
    {
      "name":"Drying Leaves in the Microwave",
      "steps":[
        {
          "headline":"Sandwich fresh leaves between paper towels.",
          "description":"This is a great way to dry leaves for crafts, but some color fading will occur. Place fresh leaves on top of two paper towels. Cover them with another single layer of paper towel. Use freshly fallen leaves that are still vibrant and pliable. Avoid leaves that are curling at the ends or those that have rips or rotted spots. For best results, leave a little space in between each leaf to prevent them from sticking together as they dry."
        },
        {
          "headline":"Microwave the leaves to dry them out.",
          "description":"Place the leaves in the microwave and heat them for 30 seconds. Afterward, continue microwaving the leaves in 5-second intervals. Autumn leaves will generally need to be microwaved 30 to 180 seconds before they are sufficiently dry. Be very attentive when microwaving leaves. If cooked too long, leaves can actually catch fire. Leaves that appear scorched have been microwaved too long. Leaves that curl at the ends after being removed from the microwave have not been microwaved long enough."
        },
        {
          "headline":"Let the leaves sit out overnight.",
          "description":"Store the leaves in a draft-free, shady area. Leave them there overnight, at minimum, or for two days, at maximum. If you notice a change in color, the leaves should be sealed immediately."
        },
        {
          "headline":"Seal the leaves with craft spray.",
          "description":"Spray both sides of each leaf with clear acrylic craft spray to preserve the remaining color. Let the leaves dry before using them as decorations or for crafts."
        }
      ]
    },
    {
      "name":"Drying Leaves With a Book",
      "steps":[
        {
          "headline":"Place the leaves between two sheets of paper.",
          "description":"This preservation dries leaves, but does not preserve their color. Sandwich your fall leaves in between two clean sheets of heavy white typing paper. Use paper that is at least as heavy as typing paper, rather than something thin like tracing paper. Otherwise, the leaves may bleed through and create stains. Lay the leaves out in a single layer. Do not stack or overlap the leaves since doing so will cause them to stick together. Choose leaves that are in good shape. They should be recently fallen and moist. The tips should not be dried or turned up."
        },
        {
          "headline":"Lay a heavy book over the paper.",
          "description":"A large, heavy book should work. To reduce the risk of staining the book or other pressing object, as well as the work surface, place sheets of blotting paper or paper towels in between the typing paper and the book. This will help to absorb the moisture from the leaves."
        },
        {
          "headline":"Alternative pressing with a book: Press the leaves directly inside the book.",
          "description":"Use an old book that you do not mind staining just in case the leaves damage the pages. Simply tuck the leaves away into the pages of the book. Allow at least 20 pages in between leaves for best results. Telephone directories work very well, if you have one available. Put weight on top of the book. The pressing helps press out moisture as well as keep the leaf flat. This can be other books, bricks, or any object with some heft."
        },
        {
          "headline":"Check your progress after one week.",
          "description":"They should be dried; if they are still pliable, press them for another few days."
        }
      ]
    },
    {
      "name":"Pressing Leaves with Wax Paper",
      "steps":[
        {
          "headline":"Choose fresh leaves.",
          "description":"Start out with leaves that are moist, vibrant, and newly fallen. Pressing the leaves with wax will preserve them at the height of their brilliant color."
        },
        {
          "headline":"Dry the leaves.",
          "description":"Place the leaves in a single layer in between two paper towels to dry them if they're wet. Make sure they aren't overlapping, since this will cause the leaves to stick together. Use a medium-hot iron to iron each side. Iron each side for three to five minutes to absorb extra moisture. Drying the leaves out beforehand will allow them to retain their color and quality after being sealed into the wax paper. Do not use a steam setting on your iron, since steam will keep the leaves moist. Only use a dry setting. Feel the leaves after ironing them for 3 to 5 minutes. If a leaf does not feel dry, iron both sides for a few more minutes."
        },
        {
          "headline":"Place the leaves between two sheets of wax paper.",
          "description":"It does not matter which side of the wax paper faces the leaves, since both sides are waxed. Arrange the dried leaves in a single layer in between the wax paper sheets. Leave a little space around each leaf. The wax paper will need to be able to adhere to itself."
        },
        {
          "headline":"Sandwich the wax paper between two pieces of typing paper.",
          "description":"You can also use brown paper bag material or another thick paper. Make sure all of the wax paper is covered by regular paper, so the iron won't stick to the wax. Make sure that the leaves remain spaced apart and in a single layer."
        },
        {
          "headline":"Seal the wax paper with your iron.",
          "description":"With the iron on a medium-hot setting, iron both sides of the paper to seal the wax together. Keep the iron constantly moving so it won't burn the wax. Heat the first side for three minutes, then flip the paper, wax and leaves over carefully and repeat on the other side. Do not use a steam setting on your iron; only use a dry setting. Handle the hot paper carefully. If your skin is sensitive, you may want to wear gloves to protect your hands."
        },
        {
          "headline":"Let the wax cool.",
          "description":"The wax will have slightly melted around the leaves, and as it cools it will adhere to them. Wait until the wax is cool before handling it."
        },
        {
          "headline":"Cut around the leaves.",
          "description":"After the whole thing has cooled to the touch, remove the paper sheets from the wax paper. Carefully cut around each leaf using scissors or a sharp craft blade. Leave a small border of wax paper around the edge of each leaf so that the leaf remains securely sealed in between the layers of wax paper. You could also try to peel the wax paper off the leaves instead of cutting them out. A coating of wax should remain on the leaves, and it may be enough to keep the leaves preserved."
        }
      ]
    }
  ],
  "text":" Decoupaging Leaves Select vibrant leaves. Harvest freshly fallen leaves that are bright in color and fairly supple. The leaves can be somewhat dry, but they should not be so dry that they are brittle or turning up at the ends. Avoid leaves with rips or rotten spots. Coat both sides of each leaf in decoupage. Decoupage is a white, gluey substance that turns clear when it dries. You can find it at your local craft store. Use a foam brush to carefully apply a liberal coat of decoupage to one side of each leaf. Set them to dry on a piece of newspaper. In most cases, you should apply the decoupage to the leaves the same day you collect them. If you wait too long, the leaves will dry out, becoming brown and brittle. If the leaves are very moist, however, or if you plucked them directly off the tree instead of waiting for them to drop, you can dry them out slightly by pressing them in between the pages of a heavy book for a few days. Allow the decoupage to completely dry. It will turn clear and will no longer be sticky. Repeat on the other side. Turn the leaf and apply the decoupage to the other side. When the second side is dry, the leaves are ready to use. This method preserves the color and form of the leaves for an extended period of time. Coating Leaves With Paraffin Wax Choose fresh leaves. Start out with leaves that are vibrant, and newly fallen. Coating the leaves with paraffin wax will preserve them at the height of their brilliant color. Dry them off with paper towels before you begin. Melt paraffin wax in a disposable pan. You can buy a a 16-oz (453 g) box of paraffin wax at your local craft or grocery store. Melt it in a disposable cake pan by heating the pan on your stove over low heat. To make the paraffin wax melt more quickly, slice it into thick chunks and spread them evenly along the bottom of the disposable pan. If you do not use a disposable pan, use a cake pan that you do not plan on using for cooking anymore. The wax can ruin the pan, so you should not use a pan that you frequently use for cooking and baking. Remove the melted wax from the stove. Exercise caution, since melted wax is very hot. Transfer it carefully from the burner to your work table. Pay close attention to it to make sure that it does not get knocked over, especially if you have pets or small children. Dip each leaf into the melted wax. Hold a leaf at the tip of the stem and dunk it into the liquified wax several times. Make sure both sides of the leaf get coated in wax. Avoid getting your fingers too close to the wax. Repeat with the remaining leaves. Lay the leaves out to dry. Lay each wax-covered leaf out on wax paper until the wax hardens. Let the leaves dry in draft-free area for several hours. Once dried, they should lift off the wax paper easily. This method preserves the form and color of the leaves for a long time. To be extra safe, line the counters with newsprint before lining them with a layer of wax paper. The double-layer minimizes the risk of getting wax drippings on the counter. If they get on the counter, wax drippings can be extremely difficult to scrape off. Using a Glycerin Bath Select fresh leaves or a small branch with leaves attached. If you would like to preserve an entire branch of fall leaves, this preservation method is easier to use than wax. Choose a branch with leaves that are vibrant and firmly attached. This method will make the colors more vibrant. Yellows become more intense, and reds and oranges become a vibrant ruddy color. Look for sprigs that have fallen off the tree on their own instead of breaking them off the tree yourself. Removing a branch from a tree can damage it. Do not choose branches that have diseased leaves or those that have gone through a frost. This method does not work on leaves that have already gone through a frost. Open up the end of each branch. Strike the end of each branch with a hammer to split it open, exposing the live portion of the wood. This exposes the live wood of the branch so that it can absorb the glycerin solution properly. Otherwise, the solution will not be able to reach the leaves. If you're just preserving individual leaves, you can skip this step. Mix up a glycerin solution. You can find vegetable glycerin in your local craft or grocery store. To make a solution, add 17 oz (530 ml) of liquid vegetable glycerin to half a gallon (2 liters) of water in a large bucket or vase. Glycerin is a natural product derived from vegetables, making this a fairly organic option to preserve your leaves. If you're preserving a large, woody branch, mix in four to five drops of mild liquid dish soap. The dish soap acts as a surfactant, breaking the surface tension of the glycerin so that the molecules can penetrate the wood more easily. For best results, use a mild dish soap with no added colors or scents. You could also use liquid surfactant, which is available at most gardening stores. Stand the branch in the solution for three to five days. Allow the branches and leaves to absorb the glycerin for at least three to five days. Store the bucket in a shaded place during the absorption process. If you're preserving individual leaves, you'll need to weight them so they stay submerged. Pour the solution into a flat pan, place the leaves in the solution, and cover them with a plate or lid to hold them down. Remove the branch and leaves from the solution. The color will look brighter, and the leaves should feel supple. You can use the whole preserved branch in your crafts or you can pluck the leaves off and use them separately. Drying Leaves in the Microwave Sandwich fresh leaves between paper towels. This is a great way to dry leaves for crafts, but some color fading will occur. Place fresh leaves on top of two paper towels. Cover them with another single layer of paper towel. Use freshly fallen leaves that are still vibrant and pliable. Avoid leaves that are curling at the ends or those that have rips or rotted spots. For best results, leave a little space in between each leaf to prevent them from sticking together as they dry. Microwave the leaves to dry them out. Place the leaves in the microwave and heat them for 30 seconds. Afterward, continue microwaving the leaves in 5-second intervals. Autumn leaves will generally need to be microwaved 30 to 180 seconds before they are sufficiently dry. Be very attentive when microwaving leaves. If cooked too long, leaves can actually catch fire. Leaves that appear scorched have been microwaved too long. Leaves that curl at the ends after being removed from the microwave have not been microwaved long enough. Let the leaves sit out overnight. Store the leaves in a draft-free, shady area. Leave them there overnight, at minimum, or for two days, at maximum. If you notice a change in color, the leaves should be sealed immediately. Seal the leaves with craft spray. Spray both sides of each leaf with clear acrylic craft spray to preserve the remaining color. Let the leaves dry before using them as decorations or for crafts. Drying Leaves With a Book Place the leaves between two sheets of paper. This preservation dries leaves, but does not preserve their color. Sandwich your fall leaves in between two clean sheets of heavy white typing paper. Use paper that is at least as heavy as typing paper, rather than something thin like tracing paper. Otherwise, the leaves may bleed through and create stains. Lay the leaves out in a single layer. Do not stack or overlap the leaves since doing so will cause them to stick together. Choose leaves that are in good shape. They should be recently fallen and moist. The tips should not be dried or turned up. Lay a heavy book over the paper. A large, heavy book should work. To reduce the risk of staining the book or other pressing object, as well as the work surface, place sheets of blotting paper or paper towels in between the typing paper and the book. This will help to absorb the moisture from the leaves. Alternative pressing with a book: Press the leaves directly inside the book. Use an old book that you do not mind staining just in case the leaves damage the pages. Simply tuck the leaves away into the pages of the book. Allow at least 20 pages in between leaves for best results. Telephone directories work very well, if you have one available. Put weight on top of the book. The pressing helps press out moisture as well as keep the leaf flat. This can be other books, bricks, or any object with some heft. Check your progress after one week. They should be dried; if they are still pliable, press them for another few days. Pressing Leaves with Wax Paper Choose fresh leaves. Start out with leaves that are moist, vibrant, and newly fallen. Pressing the leaves with wax will preserve them at the height of their brilliant color. Dry the leaves. Place the leaves in a single layer in between two paper towels to dry them if they're wet. Make sure they aren't overlapping, since this will cause the leaves to stick together. Use a medium-hot iron to iron each side. Iron each side for three to five minutes to absorb extra moisture. Drying the leaves out beforehand will allow them to retain their color and quality after being sealed into the wax paper. Do not use a steam setting on your iron, since steam will keep the leaves moist. Only use a dry setting. Feel the leaves after ironing them for 3 to 5 minutes. If a leaf does not feel dry, iron both sides for a few more minutes. Place the leaves between two sheets of wax paper. It does not matter which side of the wax paper faces the leaves, since both sides are waxed. Arrange the dried leaves in a single layer in between the wax paper sheets. Leave a little space around each leaf. The wax paper will need to be able to adhere to itself. Sandwich the wax paper between two pieces of typing paper. You can also use brown paper bag material or another thick paper. Make sure all of the wax paper is covered by regular paper, so the iron won't stick to the wax. Make sure that the leaves remain spaced apart and in a single layer. Seal the wax paper with your iron. With the iron on a medium-hot setting, iron both sides of the paper to seal the wax together. Keep the iron constantly moving so it won't burn the wax. Heat the first side for three minutes, then flip the paper, wax and leaves over carefully and repeat on the other side. Do not use a steam setting on your iron; only use a dry setting. Handle the hot paper carefully. If your skin is sensitive, you may want to wear gloves to protect your hands. Let the wax cool. The wax will have slightly melted around the leaves, and as it cools it will adhere to them. Wait until the wax is cool before handling it. Cut around the leaves. After the whole thing has cooled to the touch, remove the paper sheets from the wax paper. Carefully cut around each leaf using scissors or a sharp craft blade. Leave a small border of wax paper around the edge of each leaf so that the leaf remains securely sealed in between the layers of wax paper. You could also try to peel the wax paper off the leaves instead of cutting them out. A coating of wax should remain on the leaves, and it may be enough to keep the leaves preserved.",
  "sentences":[
    " Decoupaging Leaves Select vibrant leaves.",
    "Harvest freshly fallen leaves that are bright in color and fairly supple.",
    "The leaves can be somewhat dry, but they should not be so dry that they are brittle or turning up at the ends.",
    "Avoid leaves with rips or rotten spots.",
    "Coat both sides of each leaf in decoupage.",
    "Decoupage is a white, gluey substance that turns clear when it dries.",
    "You can find it at your local craft store.",
    "Use a foam brush to carefully apply a liberal coat of decoupage to one side of each leaf.",
    "Set them to dry on a piece of newspaper.",
    "In most cases, you should apply the decoupage to the leaves the same day you collect them.",
    "If you wait too long, the leaves will dry out, becoming brown and brittle.",
    "If the leaves are very moist, however, or if you plucked them directly off the tree instead of waiting for them to drop, you can dry them out slightly by pressing them in between the pages of a heavy book for a few days.",
    "Allow the decoupage to completely dry.",
    "It will turn clear and will no longer be sticky.",
    "Repeat on the other side.",
    "Turn the leaf and apply the decoupage to the other side.",
    "When the second side is dry, the leaves are ready to use.",
    "This method preserves the color and form of the leaves for an extended period of time.",
    "Coating Leaves With Paraffin Wax Choose fresh leaves.",
    "Start out with leaves that are vibrant, and newly fallen.",
    "Coating the leaves with paraffin wax will preserve them at the height of their brilliant color.",
    "Dry them off with paper towels before you begin.",
    "Melt paraffin wax in a disposable pan.",
    "You can buy a a 16-oz (453 g) box of paraffin wax at your local craft or grocery store.",
    "Melt it in a disposable cake pan by heating the pan on your stove over low heat.",
    "To make the paraffin wax melt more quickly, slice it into thick chunks and spread them evenly along the bottom of the disposable pan.",
    "If you do not use a disposable pan, use a cake pan that you do not plan on using for cooking anymore.",
    "The wax can ruin the pan, so you should not use a pan that you frequently use for cooking and baking.",
    "Remove the melted wax from the stove.",
    "Exercise caution, since melted wax is very hot.",
    "Transfer it carefully from the burner to your work table.",
    "Pay close attention to it to make sure that it does not get knocked over, especially if you have pets or small children.",
    "Dip each leaf into the melted wax.",
    "Hold a leaf at the tip of the stem and dunk it into the liquified wax several times.",
    "Make sure both sides of the leaf get coated in wax.",
    "Avoid getting your fingers too close to the wax.",
    "Repeat with the remaining leaves.",
    "Lay the leaves out to dry.",
    "Lay each wax-covered leaf out on wax paper until the wax hardens.",
    "Let the leaves dry in draft-free area for several hours.",
    "Once dried, they should lift off the wax paper easily.",
    "This method preserves the form and color of the leaves for a long time.",
    "To be extra safe, line the counters with newsprint before lining them with a layer of wax paper.",
    "The double-layer minimizes the risk of getting wax drippings on the counter.",
    "If they get on the counter, wax drippings can be extremely difficult to scrape off.",
    "Using a Glycerin Bath Select fresh leaves or a small branch with leaves attached.",
    "If you would like to preserve an entire branch of fall leaves, this preservation method is easier to use than wax.",
    "Choose a branch with leaves that are vibrant and firmly attached.",
    "This method will make the colors more vibrant.",
    "Yellows become more intense, and reds and oranges become a vibrant ruddy color.",
    "Look for sprigs that have fallen off the tree on their own instead of breaking them off the tree yourself.",
    "Removing a branch from a tree can damage it.",
    "Do not choose branches that have diseased leaves or those that have gone through a frost.",
    "This method does not work on leaves that have already gone through a frost.",
    "Open up the end of each branch.",
    "Strike the end of each branch with a hammer to split it open, exposing the live portion of the wood.",
    "This exposes the live wood of the branch so that it can absorb the glycerin solution properly.",
    "Otherwise, the solution will not be able to reach the leaves.",
    "If you're just preserving individual leaves, you can skip this step.",
    "Mix up a glycerin solution.",
    "You can find vegetable glycerin in your local craft or grocery store.",
    "To make a solution, add 17 oz (530 ml) of liquid vegetable glycerin to half a gallon (2 liters) of water in a large bucket or vase.",
    "Glycerin is a natural product derived from vegetables, making this a fairly organic option to preserve your leaves.",
    "If you're preserving a large, woody branch, mix in four to five drops of mild liquid dish soap.",
    "The dish soap acts as a surfactant, breaking the surface tension of the glycerin so that the molecules can penetrate the wood more easily.",
    "For best results, use a mild dish soap with no added colors or scents.",
    "You could also use liquid surfactant, which is available at most gardening stores.",
    "Stand the branch in the solution for three to five days.",
    "Allow the branches and leaves to absorb the glycerin for at least three to five days.",
    "Store the bucket in a shaded place during the absorption process.",
    "If you're preserving individual leaves, you'll need to weight them so they stay submerged.",
    "Pour the solution into a flat pan, place the leaves in the solution, and cover them with a plate or lid to hold them down.",
    "Remove the branch and leaves from the solution.",
    "The color will look brighter, and the leaves should feel supple.",
    "You can use the whole preserved branch in your crafts or you can pluck the leaves off and use them separately.",
    "Drying Leaves in the Microwave Sandwich fresh leaves between paper towels.",
    "This is a great way to dry leaves for crafts, but some color fading will occur.",
    "Place fresh leaves on top of two paper towels.",
    "Cover them with another single layer of paper towel.",
    "Use freshly fallen leaves that are still vibrant and pliable.",
    "Avoid leaves that are curling at the ends or those that have rips or rotted spots.",
    "For best results, leave a little space in between each leaf to prevent them from sticking together as they dry.",
    "Microwave the leaves to dry them out.",
    "Place the leaves in the microwave and heat them for 30 seconds.",
    "Afterward, continue microwaving the leaves in 5-second intervals.",
    "Autumn leaves will generally need to be microwaved 30 to 180 seconds before they are sufficiently dry.",
    "Be very attentive when microwaving leaves.",
    "If cooked too long, leaves can actually catch fire.",
    "Leaves that appear scorched have been microwaved too long.",
    "Leaves that curl at the ends after being removed from the microwave have not been microwaved long enough.",
    "Let the leaves sit out overnight.",
    "Store the leaves in a draft-free, shady area.",
    "Leave them there overnight, at minimum, or for two days, at maximum.",
    "If you notice a change in color, the leaves should be sealed immediately.",
    "Seal the leaves with craft spray.",
    "Spray both sides of each leaf with clear acrylic craft spray to preserve the remaining color.",
    "Let the leaves dry before using them as decorations or for crafts.",
    "Drying Leaves With a Book Place the leaves between two sheets of paper.",
    "This preservation dries leaves, but does not preserve their color.",
    "Sandwich your fall leaves in between two clean sheets of heavy white typing paper.",
    "Use paper that is at least as heavy as typing paper, rather than something thin like tracing paper.",
    "Otherwise, the leaves may bleed through and create stains.",
    "Lay the leaves out in a single layer.",
    "Do not stack or overlap the leaves since doing so will cause them to stick together.",
    "Choose leaves that are in good shape.",
    "They should be recently fallen and moist.",
    "The tips should not be dried or turned up.",
    "Lay a heavy book over the paper.",
    "A large, heavy book should work.",
    "To reduce the risk of staining the book or other pressing object, as well as the work surface, place sheets of blotting paper or paper towels in between the typing paper and the book.",
    "This will help to absorb the moisture from the leaves.",
    "Alternative pressing with a book: Press the leaves directly inside the book.",
    "Use an old book that you do not mind staining just in case the leaves damage the pages.",
    "Simply tuck the leaves away into the pages of the book.",
    "Allow at least 20 pages in between leaves for best results.",
    "Telephone directories work very well, if you have one available.",
    "Put weight on top of the book.",
    "The pressing helps press out moisture as well as keep the leaf flat.",
    "This can be other books, bricks, or any object with some heft.",
    "Check your progress after one week.",
    "They should be dried; if they are still pliable, press them for another few days.",
    "Pressing Leaves with Wax Paper Choose fresh leaves.",
    "Start out with leaves that are moist, vibrant, and newly fallen.",
    "Pressing the leaves with wax will preserve them at the height of their brilliant color.",
    "Dry the leaves.",
    "Place the leaves in a single layer in between two paper towels to dry them if they're wet.",
    "Make sure they aren't overlapping, since this will cause the leaves to stick together.",
    "Use a medium-hot iron to iron each side.",
    "Iron each side for three to five minutes to absorb extra moisture.",
    "Drying the leaves out beforehand will allow them to retain their color and quality after being sealed into the wax paper.",
    "Do not use a steam setting on your iron, since steam will keep the leaves moist.",
    "Only use a dry setting.",
    "Feel the leaves after ironing them for 3 to 5 minutes.",
    "If a leaf does not feel dry, iron both sides for a few more minutes.",
    "Place the leaves between two sheets of wax paper.",
    "It does not matter which side of the wax paper faces the leaves, since both sides are waxed.",
    "Arrange the dried leaves in a single layer in between the wax paper sheets.",
    "Leave a little space around each leaf.",
    "The wax paper will need to be able to adhere to itself.",
    "Sandwich the wax paper between two pieces of typing paper.",
    "You can also use brown paper bag material or another thick paper.",
    "Make sure all of the wax paper is covered by regular paper, so the iron won't stick to the wax.",
    "Make sure that the leaves remain spaced apart and in a single layer.",
    "Seal the wax paper with your iron.",
    "With the iron on a medium-hot setting, iron both sides of the paper to seal the wax together.",
    "Keep the iron constantly moving so it won't burn the wax.",
    "Heat the first side for three minutes, then flip the paper, wax and leaves over carefully and repeat on the other side.",
    "Do not use a steam setting on your iron; only use a dry setting.",
    "Handle the hot paper carefully.",
    "If your skin is sensitive, you may want to wear gloves to protect your hands.",
    "Let the wax cool.",
    "The wax will have slightly melted around the leaves, and as it cools it will adhere to them.",
    "Wait until the wax is cool before handling it.",
    "Cut around the leaves.",
    "After the whole thing has cooled to the touch, remove the paper sheets from the wax paper.",
    "Carefully cut around each leaf using scissors or a sharp craft blade.",
    "Leave a small border of wax paper around the edge of each leaf so that the leaf remains securely sealed in between the layers of wax paper.",
    "You could also try to peel the wax paper off the leaves instead of cutting them out.",
    "A coating of wax should remain on the leaves, and it may be enough to keep the leaves preserved."
  ],
  "tyn_section":[
    "Wax Paper Pressing",
    "Fresh fall leaves",
    "Wax paper",
    "Paper towels",
    "Brown paper bag material",
    "Iron",
    "Scissors",
    "Coating With Paraffin Wax",
    "Paraffin wax",
    "Disposable cake pan",
    "Stove",
    "Newsprint",
    "Fresh fall leaves or branch with leaves",
    "Liquid glycerin",
    "Water",
    "Liquid dish soap",
    "Hammer",
    "Large bucket or vase",
    "Decoupaging",
    "Decoupage",
    "Sponge brush",
    "Microwaving",
    "Microwave",
    "Acrylic craft spray",
    "Book Drying",
    "2 sheets of typing paper",
    "2 sheets of paper towels or blotting paper",
    "Large book or other heavy object"
  ],
  "tyn_model":[
    "wax paper",
    "wax",
    "iron",
    "paraffin wax",
    "paper towels",
    "paper",
    "decoupage",
    "glycerin",
    "dish soap",
    "microwave",
    "cake pan",
    "typing paper",
    "book",
    "decoupaging leaves",
    "foam brush",
    "newspaper",
    "disposable pan",
    "stove",
    "burner",
    "glycerin bath",
    "hammer",
    "vegetable glycerin",
    "liquid vegetable glycerin",
    "water",
    "liquid surfactant",
    "gardening stores",
    "bucket",
    "plate",
    "paper towel",
    "leaves",
    "craft spray",
    "clear acrylic craft spray",
    "tracing paper",
    "blotting paper",
    "telephone directories",
    "brown paper bag",
    "scissors"
  ],
  "simple_metrics":{
    "r":0.3571428571,
    "p":0.2702702703,
    "f1":0.3076923077,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6785714286,
    "p":0.5945945946,
    "f1":0.6338134951
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7857142857,
    "p":0.8378378378,
    "f1":0.8109393579
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.4594594595,
    "f1":0.5093632959
  }
}