{
  "title":"How to Slip Stitch",
  "url":"https://www.wikihow.com/Slip-Stitch",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework"
  ],
  "methods":[
    {
      "name":"Knitting",
      "steps":[
        {
          "headline":"Know whether to slip the stitch knit-wise or purl-wise.",
          "description":"You can slip a stitch knit-wise or purl-wise. (If no method is indicated, assume purl-wise. )To slip a stitch knit-wise, insert the right needle into the next stitch from left to right, as if you were going to knit. Don't put the yarn over your needle, though; simply move the stitch from the left needle to the right needle. This method is more visible. To slip a stitch purl-wise, insert the right needle into the next stitch from right to left, as if you were going to purl. Simply move the stitch from the left needle to the right needle. This method is nearly invisible."
        },
        {
          "headline":"Put your yarn in front, or keep it in back.",
          "description":"Another variable to slipping stitches while knitting is whether your unknitted yarn stays in back (from where it is usually worked) or moves in front of the work. If you need to do a slip stitch \"wyif\" (with yarn in front), move the yarn such that it is between your needles and in front of the work. After the slip stitch, return it to the back position. If not otherwise noted, assume the slip stitch is \"wyib\" (with yarn in back)."
        }
      ]
    },
    {
      "name":"Crocheting",
      "steps":[
        {
          "headline":"Know the end result.",
          "description":"After a crocheting slip stitch, you should only have one loop on your hook."
        },
        {
          "headline":"Put the hook through the stitch indicated.",
          "description":""
        },
        {
          "headline":"Yarn over the hook.",
          "description":""
        },
        {
          "headline":"Pull the last loop (the yarn over) through all the stitches on the hook.",
          "description":"You should be left with only one loop on your hook."
        }
      ]
    },
    {
      "name":"Hand Sewing",
      "steps":[
        {
          "headline":"Pin your hem.",
          "description":"Slip stitches are generally used to sew hems such that there is not a line of visible stitches on the outside (or inside) of the garment. Pin your hem first to ensure that you'll sew in a straight line. Your hem should have a \"fold\" inside of it; i.e., it should look something like you folded the bottom of the fabric up an inch or so, then folded that another inch (or whatever hem width you're using)."
        },
        {
          "headline":"Tie a knot at the end of the thread.",
          "description":""
        },
        {
          "headline":"Slip the needle into the fold, then draw up through the top crease.",
          "description":""
        },
        {
          "headline":"Using the end of the needle, grab a few threads of the fabric just above the fold.",
          "description":"Don't put the needle all the way through the fabric and then bring it back, as you would in traditional sewing. Instead, guide the tip of the needle under three or four of the textile's threads. Weaving the stitch this way will prevent obvious bunching or pulling on the outside of the garment."
        },
        {
          "headline":"Put the needle back into the fold.",
          "description":"Close to where you drew the needle out of the fold, point it back in, keeping the needle parallel to the fold. You'll be moving lengthwise along the fold as you continue."
        },
        {
          "headline":"Draw the needle back out of the fold.",
          "description":"Again, grab a few threads of the fabric just above the point where the needle exited."
        },
        {
          "headline":"Repeat Steps 2 through 4 as many times as needed.",
          "description":""
        },
        {
          "headline":"Tie off.",
          "description":"When you're finished sewing the hem, tie off such that the knot is located inside the fold."
        }
      ]
    }
  ],
  "text":" Knitting Know whether to slip the stitch knit-wise or purl-wise. You can slip a stitch knit-wise or purl-wise. (If no method is indicated, assume purl-wise. )To slip a stitch knit-wise, insert the right needle into the next stitch from left to right, as if you were going to knit. Don't put the yarn over your needle, though; simply move the stitch from the left needle to the right needle. This method is more visible. To slip a stitch purl-wise, insert the right needle into the next stitch from right to left, as if you were going to purl. Simply move the stitch from the left needle to the right needle. This method is nearly invisible. Put your yarn in front, or keep it in back. Another variable to slipping stitches while knitting is whether your unknitted yarn stays in back (from where it is usually worked) or moves in front of the work. If you need to do a slip stitch \"wyif\" (with yarn in front), move the yarn such that it is between your needles and in front of the work. After the slip stitch, return it to the back position. If not otherwise noted, assume the slip stitch is \"wyib\" (with yarn in back). Crocheting Know the end result. After a crocheting slip stitch, you should only have one loop on your hook. Put the hook through the stitch indicated.  Yarn over the hook.  Pull the last loop (the yarn over) through all the stitches on the hook. You should be left with only one loop on your hook. Hand Sewing Pin your hem. Slip stitches are generally used to sew hems such that there is not a line of visible stitches on the outside (or inside) of the garment. Pin your hem first to ensure that you'll sew in a straight line. Your hem should have a \"fold\" inside of it; i.e., it should look something like you folded the bottom of the fabric up an inch or so, then folded that another inch (or whatever hem width you're using). Tie a knot at the end of the thread.  Slip the needle into the fold, then draw up through the top crease.  Using the end of the needle, grab a few threads of the fabric just above the fold. Don't put the needle all the way through the fabric and then bring it back, as you would in traditional sewing. Instead, guide the tip of the needle under three or four of the textile's threads. Weaving the stitch this way will prevent obvious bunching or pulling on the outside of the garment. Put the needle back into the fold. Close to where you drew the needle out of the fold, point it back in, keeping the needle parallel to the fold. You'll be moving lengthwise along the fold as you continue. Draw the needle back out of the fold. Again, grab a few threads of the fabric just above the point where the needle exited. Repeat Steps 2 through 4 as many times as needed.  Tie off. When you're finished sewing the hem, tie off such that the knot is located inside the fold.",
  "sentences":[
    " Knitting Know whether to slip the stitch knit-wise or purl-wise.",
    "You can slip a stitch knit-wise or purl-wise.",
    "(If no method is indicated, assume purl-wise.",
    ")To slip a stitch knit-wise, insert the right needle into the next stitch from left to right, as if you were going to knit.",
    "Don't put the yarn over your needle, though; simply move the stitch from the left needle to the right needle.",
    "This method is more visible.",
    "To slip a stitch purl-wise, insert the right needle into the next stitch from right to left, as if you were going to purl.",
    "Simply move the stitch from the left needle to the right needle.",
    "This method is nearly invisible.",
    "Put your yarn in front, or keep it in back.",
    "Another variable to slipping stitches while knitting is whether your unknitted yarn stays in back (from where it is usually worked) or moves in front of the work.",
    "If you need to do a slip stitch \"wyif\" (with yarn in front), move the yarn such that it is between your needles and in front of the work.",
    "After the slip stitch, return it to the back position.",
    "If not otherwise noted, assume the slip stitch is \"wyib\" (with yarn in back).",
    "Crocheting Know the end result.",
    "After a crocheting slip stitch, you should only have one loop on your hook.",
    "Put the hook through the stitch indicated.",
    "Yarn over the hook.",
    "Pull the last loop (the yarn over) through all the stitches on the hook.",
    "You should be left with only one loop on your hook.",
    "Hand Sewing Pin your hem.",
    "Slip stitches are generally used to sew hems such that there is not a line of visible stitches on the outside (or inside) of the garment.",
    "Pin your hem first to ensure that you'll sew in a straight line.",
    "Your hem should have a \"fold\" inside of it; i.e., it should look something like you folded the bottom of the fabric up an inch or so, then folded that another inch (or whatever hem width you're using).",
    "Tie a knot at the end of the thread.",
    "Slip the needle into the fold, then draw up through the top crease.",
    "Using the end of the needle, grab a few threads of the fabric just above the fold.",
    "Don't put the needle all the way through the fabric and then bring it back, as you would in traditional sewing.",
    "Instead, guide the tip of the needle under three or four of the textile's threads.",
    "Weaving the stitch this way will prevent obvious bunching or pulling on the outside of the garment.",
    "Put the needle back into the fold.",
    "Close to where you drew the needle out of the fold, point it back in, keeping the needle parallel to the fold.",
    "You'll be moving lengthwise along the fold as you continue.",
    "Draw the needle back out of the fold.",
    "Again, grab a few threads of the fabric just above the point where the needle exited.",
    "Repeat Steps 2 through 4 as many times as needed.",
    "Tie off.",
    "When you're finished sewing the hem, tie off such that the knot is located inside the fold."
  ],
  "tyn_section":[
    "Crochet hook",
    "Knitting: Knitwise",
    "Knitting needles",
    "Knitting: Purlwise",
    "Sewing needle",
    "Sewing thread"
  ],
  "tyn_model":[
    "yarn",
    "needle",
    "fabric",
    "crocheting",
    "thread",
    "textile"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}