{
  "title":"How to Make a Bowl",
  "url":"https://www.wikihow.com/Make-a-Bowl",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Clay coil bowl",
      "steps":[
        {
          "headline":"Purchase some craft clay that can self-harden.",
          "description":"Ask at your local craft store for appropriate suggestions."
        },
        {
          "headline":"Roll a small but decent-sized lump of the clay into a ball.",
          "description":""
        },
        {
          "headline":"Continue to roll this ball into a fat sausage shape.",
          "description":""
        },
        {
          "headline":"Keep rolling until you have a long and thin sausage shape.",
          "description":"This should be an even width all the way along its length."
        },
        {
          "headline":"Starting at one end of the sausage, coil into a spiral.",
          "description":"Keep the coil tight and fitted together."
        },
        {
          "headline":"Coil around and around until the sausage length ends.",
          "description":"This should be sufficient for the base."
        },
        {
          "headline":"Make more long sausage lengths from the clay.",
          "description":"Each length made should be long enough to do one circle of the bowl from this point on."
        },
        {
          "headline":"Add the next length on top of the coiled base.",
          "description":"To join, simply attach where the last coil ended and blend in the join with your fingers or a small clay spatula. After adding each new coil, check that it is firmly stuck to the coil below."
        },
        {
          "headline":"Keep adding a new length on top of the old length, coiling until the bowl is the height you'd like it to be.",
          "description":"Finish the end by blending into the top coil neatly."
        },
        {
          "headline":"Either leave natural clay color or paint with a suitable paint.",
          "description":"If adding a pattern, choose something that fits your décor or represents something meaningful for a gift recipient. Another alternative is to smooth over the outside of the bowl until you can no longer see the coils, then paint over it. Make sure that you do this before the coils dry."
        }
      ]
    },
    {
      "name":"Recycled packaging papier-mâché bowl",
      "steps":[
        {
          "headline":"Choose a suitable bowl.",
          "description":"A plastic bowl is lightest and probably easiest to work with but you can also cover a glass or ceramic bowl provided it doesn't have a crack in it (even hairline cracks can break without notice and spoil this project)."
        },
        {
          "headline":"Choose the cover design for the bowl.",
          "description":"Labels from food cans or packages, magazine images, candy wrappers, tickets, or other items of nostalgic value or fun interest can be attached as the final layer of the bowl. Make sure that whatever you choose is enough to cover the inside and outside of the bowl. Labels, wrappers, etc. that are crinkled need to be ironed first. Do this by laying the paper items on the ironing board, then placing a thin towel over the top. Iron on low heat, especially if the items contain plastic of any kind."
        },
        {
          "headline":"Cover the outside of the bowl with plastic kitchen wrap.",
          "description":"Overlap the rim."
        },
        {
          "headline":"Tip the bowl upside down over a stand.",
          "description":"A pitcher, jug, heavy glass, etc. can all serve as a suitable stand to hold the bowl aloft while you work on it."
        },
        {
          "headline":"Prepare the first layers of the bowl.",
          "description":"Tear lots of small pieces of newspaper and add to a pile. You'll need enough to cover the bowl 5-6 times."
        },
        {
          "headline":"Mix PVA glue with water, the ratio being half of each.",
          "description":"Dip the pieces of newspaper into the glue mix and smooth them all over the bowl, both inside and out. Let the first layer dry."
        },
        {
          "headline":"Repeat with up to five more layers.",
          "description":"Let dry between each layer."
        },
        {
          "headline":"Remove the real bowl from the papier-mâché bowl.",
          "description":"Hold the edges of the plastic wrap to help ease the paper bowl away from the real bowl. Set the real bowl aside to wash later."
        },
        {
          "headline":"Trim the edges of the bowl to neaten.",
          "description":"Paint the bowl one neutral color (white is an easy choice) to provide a neat background. Allow to dry."
        },
        {
          "headline":"Glue the paper decoration items on the bowl.",
          "description":"You can glue them in a pattern or simply add them at random. If creating a pattern, it's a good idea to sketch this out on paper first so that you have a guide to follow before sticking the pieces in place. Be prepared to cut the paper decorations to fit your intended design. Overlapping them is also another option."
        },
        {
          "headline":"Finish by brushing over a layer of the PVA glue mixture.",
          "description":"Let dry. Once dry, it is ready for display."
        }
      ]
    },
    {
      "name":"Pulp paper bowl",
      "steps":[
        {
          "headline":"Make the paper pulp.",
          "description":"Tear strips of newspaper into small pieces. Fill a bucket about a quarter of the way with the pieces. Add hot water to cover the pieces. Let cool. Once cooled, mash with a wooden spoon until the pulp turns mushy. Process in the food processor in small batches. Each processing should end in a smooth pulp. Place the processed pulp into a sieve. Press down hard to remove all liquid. Add one cup of PVA glue to the pulp in a bowl. Mix well. The pulp will keep in a sealed container in the refrigerator for a few days."
        },
        {
          "headline":"Choose a medium sized plastic or ceramic bowl.",
          "description":"Cover the bowl with plastic kitchen wrap. Be sure to continue the wrap over the rim of the bowl."
        },
        {
          "headline":"Turn the bowl over.",
          "description":"If possible, place on a stand, such as a pitcher or jug."
        },
        {
          "headline":"Spread the pulp over the outside of the bowl.",
          "description":"Make sure it covers every part of the bowl. Aim to keep the layer even all over, at least 1cm/1/2 inch thick."
        },
        {
          "headline":"Set aside to dry in a warm place.",
          "description":"Leave for at least 2 days, possibly longer in a more humid environment."
        },
        {
          "headline":"Once you're sure the bowl is dry, separate it from the bowl mold.",
          "description":"Peel off the kitchen plastic wrap."
        },
        {
          "headline":"Paint the bowl in a decorative color.",
          "description":"Add patterns if wished. The bowl is ready for display once it has dried. As with a papier-mâché bowl, this bowl is suitable only for display or holding objects, not for eating from."
        }
      ]
    },
    {
      "name":"Fruit bowl from found objects",
      "steps":[
        {
          "headline":"Find a suitable bowl shaped object.",
          "description":"Here there are limitless possibilities, so it's difficult to suggest any one thing. But some ideas include pan or pot lids, the cover of an old round fan, packaging, lids off household objects, lampshades, toys, etc. Rummage around and be creative in your choices."
        },
        {
          "headline":"Find a suitable stand.",
          "description":"The bowl-like object will usually be best placed on some sort of a stand to keep it up off the display surface. Again, many things could work but some ideas include old cups and glasses, pencil holders, packaging, poster tubes cut down, toys, unwanted gadgets, etc."
        },
        {
          "headline":"Glue the bowl object to the stand object.",
          "description":"In some cases, it may be best to screw the two objects together for best stability. Always check that the items sit together without rocking before attaching."
        },
        {
          "headline":"Place on display.",
          "description":"It's something odd to be admired!"
        }
      ]
    },
    {
      "name":"Doily or fabric bowl",
      "steps":[
        {
          "headline":"Find a large unwanted doily.",
          "description":"It should be in very good to excellent condition––if it's stained, pass on it. Doilies can be purchased from thrift stores, antique dealers and many online auction sellers."
        },
        {
          "headline":"Cover a bowl in plastic kitchen wrap, ensuring that it goes over the rim.",
          "description":"Before finalizing the bowl choice, check that the doily sits over it well. If not, choose one of a better size. Turn the bowl upside down in readiness for covering with the doily."
        },
        {
          "headline":"Choose between fabric stiffener or sugar water to stiffen the bowl.",
          "description":"Either will work, choose according to whatever you have available. Note that sugar water may attract insects if stored for a long period of time. In each case, work over a surface where drips won't be a problem. Pour fabric stiffener into another bowl or basin. Dip the doily into this bowl or basin. Make sugar water. Dissolve 3-5 tablespoons of sugar in boiling water. Heat without boiling, until all of the granules disappear. Dip the doily into this mixture. Make sure it is thoroughly covered."
        },
        {
          "headline":"Place the dipped, wet doily over the bowl.",
          "description":"Adjust to ensure that it is sitting evenly around the bowl––if not, you'll end up with a lopsided doily bowl shape."
        },
        {
          "headline":"Set aside in a warm, dry place.",
          "description":"Let dry for approximately 48 hours. Don't touch until at least 24 hours have passed by."
        },
        {
          "headline":"Lift the bowl gently, using the kitchen plastic wrap to help lever it off the molding bowl.",
          "description":"Let stand until you're absolutely sure the whole surface of the doily is completely dry. Trim off any plastic wrap or fabric stiffener that is stuck to the doily."
        },
        {
          "headline":"Use.",
          "description":"Add candies, sewing bits and pieces (a few old wooden cotton reels look superb) or a pile of ribbons. It's a lovely item just by itself on display too."
        }
      ]
    }
  ],
  "text":" Clay coil bowl Purchase some craft clay that can self-harden. Ask at your local craft store for appropriate suggestions. Roll a small but decent-sized lump of the clay into a ball.  Continue to roll this ball into a fat sausage shape.  Keep rolling until you have a long and thin sausage shape. This should be an even width all the way along its length. Starting at one end of the sausage, coil into a spiral. Keep the coil tight and fitted together. Coil around and around until the sausage length ends. This should be sufficient for the base. Make more long sausage lengths from the clay. Each length made should be long enough to do one circle of the bowl from this point on. Add the next length on top of the coiled base. To join, simply attach where the last coil ended and blend in the join with your fingers or a small clay spatula. After adding each new coil, check that it is firmly stuck to the coil below. Keep adding a new length on top of the old length, coiling until the bowl is the height you'd like it to be. Finish the end by blending into the top coil neatly. Either leave natural clay color or paint with a suitable paint. If adding a pattern, choose something that fits your décor or represents something meaningful for a gift recipient. Another alternative is to smooth over the outside of the bowl until you can no longer see the coils, then paint over it. Make sure that you do this before the coils dry. Recycled packaging papier-mâché bowl Choose a suitable bowl. A plastic bowl is lightest and probably easiest to work with but you can also cover a glass or ceramic bowl provided it doesn't have a crack in it (even hairline cracks can break without notice and spoil this project). Choose the cover design for the bowl. Labels from food cans or packages, magazine images, candy wrappers, tickets, or other items of nostalgic value or fun interest can be attached as the final layer of the bowl. Make sure that whatever you choose is enough to cover the inside and outside of the bowl. Labels, wrappers, etc. that are crinkled need to be ironed first. Do this by laying the paper items on the ironing board, then placing a thin towel over the top. Iron on low heat, especially if the items contain plastic of any kind. Cover the outside of the bowl with plastic kitchen wrap. Overlap the rim. Tip the bowl upside down over a stand. A pitcher, jug, heavy glass, etc. can all serve as a suitable stand to hold the bowl aloft while you work on it. Prepare the first layers of the bowl. Tear lots of small pieces of newspaper and add to a pile. You'll need enough to cover the bowl 5-6 times. Mix PVA glue with water, the ratio being half of each. Dip the pieces of newspaper into the glue mix and smooth them all over the bowl, both inside and out. Let the first layer dry. Repeat with up to five more layers. Let dry between each layer. Remove the real bowl from the papier-mâché bowl. Hold the edges of the plastic wrap to help ease the paper bowl away from the real bowl. Set the real bowl aside to wash later. Trim the edges of the bowl to neaten. Paint the bowl one neutral color (white is an easy choice) to provide a neat background. Allow to dry. Glue the paper decoration items on the bowl. You can glue them in a pattern or simply add them at random. If creating a pattern, it's a good idea to sketch this out on paper first so that you have a guide to follow before sticking the pieces in place. Be prepared to cut the paper decorations to fit your intended design. Overlapping them is also another option. Finish by brushing over a layer of the PVA glue mixture. Let dry. Once dry, it is ready for display. Pulp paper bowl Make the paper pulp. Tear strips of newspaper into small pieces. Fill a bucket about a quarter of the way with the pieces. Add hot water to cover the pieces. Let cool. Once cooled, mash with a wooden spoon until the pulp turns mushy. Process in the food processor in small batches. Each processing should end in a smooth pulp. Place the processed pulp into a sieve. Press down hard to remove all liquid. Add one cup of PVA glue to the pulp in a bowl. Mix well. The pulp will keep in a sealed container in the refrigerator for a few days. Choose a medium sized plastic or ceramic bowl. Cover the bowl with plastic kitchen wrap. Be sure to continue the wrap over the rim of the bowl. Turn the bowl over. If possible, place on a stand, such as a pitcher or jug. Spread the pulp over the outside of the bowl. Make sure it covers every part of the bowl. Aim to keep the layer even all over, at least 1cm/1/2 inch thick. Set aside to dry in a warm place. Leave for at least 2 days, possibly longer in a more humid environment. Once you're sure the bowl is dry, separate it from the bowl mold. Peel off the kitchen plastic wrap. Paint the bowl in a decorative color. Add patterns if wished. The bowl is ready for display once it has dried. As with a papier-mâché bowl, this bowl is suitable only for display or holding objects, not for eating from. Fruit bowl from found objects Find a suitable bowl shaped object. Here there are limitless possibilities, so it's difficult to suggest any one thing. But some ideas include pan or pot lids, the cover of an old round fan, packaging, lids off household objects, lampshades, toys, etc. Rummage around and be creative in your choices. Find a suitable stand. The bowl-like object will usually be best placed on some sort of a stand to keep it up off the display surface. Again, many things could work but some ideas include old cups and glasses, pencil holders, packaging, poster tubes cut down, toys, unwanted gadgets, etc. Glue the bowl object to the stand object. In some cases, it may be best to screw the two objects together for best stability. Always check that the items sit together without rocking before attaching. Place on display. It's something odd to be admired! Doily or fabric bowl Find a large unwanted doily. It should be in very good to excellent condition––if it's stained, pass on it. Doilies can be purchased from thrift stores, antique dealers and many online auction sellers. Cover a bowl in plastic kitchen wrap, ensuring that it goes over the rim. Before finalizing the bowl choice, check that the doily sits over it well. If not, choose one of a better size. Turn the bowl upside down in readiness for covering with the doily. Choose between fabric stiffener or sugar water to stiffen the bowl. Either will work, choose according to whatever you have available. Note that sugar water may attract insects if stored for a long period of time. In each case, work over a surface where drips won't be a problem. Pour fabric stiffener into another bowl or basin. Dip the doily into this bowl or basin. Make sugar water. Dissolve 3-5 tablespoons of sugar in boiling water. Heat without boiling, until all of the granules disappear. Dip the doily into this mixture. Make sure it is thoroughly covered. Place the dipped, wet doily over the bowl. Adjust to ensure that it is sitting evenly around the bowl––if not, you'll end up with a lopsided doily bowl shape. Set aside in a warm, dry place. Let dry for approximately 48 hours. Don't touch until at least 24 hours have passed by. Lift the bowl gently, using the kitchen plastic wrap to help lever it off the molding bowl. Let stand until you're absolutely sure the whole surface of the doily is completely dry. Trim off any plastic wrap or fabric stiffener that is stuck to the doily. Use. Add candies, sewing bits and pieces (a few old wooden cotton reels look superb) or a pile of ribbons. It's a lovely item just by itself on display too.",
  "sentences":[
    " Clay coil bowl Purchase some craft clay that can self-harden.",
    "Ask at your local craft store for appropriate suggestions.",
    "Roll a small but decent-sized lump of the clay into a ball.",
    "Continue to roll this ball into a fat sausage shape.",
    "Keep rolling until you have a long and thin sausage shape.",
    "This should be an even width all the way along its length.",
    "Starting at one end of the sausage, coil into a spiral.",
    "Keep the coil tight and fitted together.",
    "Coil around and around until the sausage length ends.",
    "This should be sufficient for the base.",
    "Make more long sausage lengths from the clay.",
    "Each length made should be long enough to do one circle of the bowl from this point on.",
    "Add the next length on top of the coiled base.",
    "To join, simply attach where the last coil ended and blend in the join with your fingers or a small clay spatula.",
    "After adding each new coil, check that it is firmly stuck to the coil below.",
    "Keep adding a new length on top of the old length, coiling until the bowl is the height you'd like it to be.",
    "Finish the end by blending into the top coil neatly.",
    "Either leave natural clay color or paint with a suitable paint.",
    "If adding a pattern, choose something that fits your décor or represents something meaningful for a gift recipient.",
    "Another alternative is to smooth over the outside of the bowl until you can no longer see the coils, then paint over it.",
    "Make sure that you do this before the coils dry.",
    "Recycled packaging papier-mâché bowl Choose a suitable bowl.",
    "A plastic bowl is lightest and probably easiest to work with but you can also cover a glass or ceramic bowl provided it doesn't have a crack in it (even hairline cracks can break without notice and spoil this project).",
    "Choose the cover design for the bowl.",
    "Labels from food cans or packages, magazine images, candy wrappers, tickets, or other items of nostalgic value or fun interest can be attached as the final layer of the bowl.",
    "Make sure that whatever you choose is enough to cover the inside and outside of the bowl.",
    "Labels, wrappers, etc.",
    "that are crinkled need to be ironed first.",
    "Do this by laying the paper items on the ironing board, then placing a thin towel over the top.",
    "Iron on low heat, especially if the items contain plastic of any kind.",
    "Cover the outside of the bowl with plastic kitchen wrap.",
    "Overlap the rim.",
    "Tip the bowl upside down over a stand.",
    "A pitcher, jug, heavy glass, etc.",
    "can all serve as a suitable stand to hold the bowl aloft while you work on it.",
    "Prepare the first layers of the bowl.",
    "Tear lots of small pieces of newspaper and add to a pile.",
    "You'll need enough to cover the bowl 5-6 times.",
    "Mix PVA glue with water, the ratio being half of each.",
    "Dip the pieces of newspaper into the glue mix and smooth them all over the bowl, both inside and out.",
    "Let the first layer dry.",
    "Repeat with up to five more layers.",
    "Let dry between each layer.",
    "Remove the real bowl from the papier-mâché bowl.",
    "Hold the edges of the plastic wrap to help ease the paper bowl away from the real bowl.",
    "Set the real bowl aside to wash later.",
    "Trim the edges of the bowl to neaten.",
    "Paint the bowl one neutral color (white is an easy choice) to provide a neat background.",
    "Allow to dry.",
    "Glue the paper decoration items on the bowl.",
    "You can glue them in a pattern or simply add them at random.",
    "If creating a pattern, it's a good idea to sketch this out on paper first so that you have a guide to follow before sticking the pieces in place.",
    "Be prepared to cut the paper decorations to fit your intended design.",
    "Overlapping them is also another option.",
    "Finish by brushing over a layer of the PVA glue mixture.",
    "Let dry.",
    "Once dry, it is ready for display.",
    "Pulp paper bowl Make the paper pulp.",
    "Tear strips of newspaper into small pieces.",
    "Fill a bucket about a quarter of the way with the pieces.",
    "Add hot water to cover the pieces.",
    "Let cool.",
    "Once cooled, mash with a wooden spoon until the pulp turns mushy.",
    "Process in the food processor in small batches.",
    "Each processing should end in a smooth pulp.",
    "Place the processed pulp into a sieve.",
    "Press down hard to remove all liquid.",
    "Add one cup of PVA glue to the pulp in a bowl.",
    "Mix well.",
    "The pulp will keep in a sealed container in the refrigerator for a few days.",
    "Choose a medium sized plastic or ceramic bowl.",
    "Cover the bowl with plastic kitchen wrap.",
    "Be sure to continue the wrap over the rim of the bowl.",
    "Turn the bowl over.",
    "If possible, place on a stand, such as a pitcher or jug.",
    "Spread the pulp over the outside of the bowl.",
    "Make sure it covers every part of the bowl.",
    "Aim to keep the layer even all over, at least 1cm/1/2 inch thick.",
    "Set aside to dry in a warm place.",
    "Leave for at least 2 days, possibly longer in a more humid environment.",
    "Once you're sure the bowl is dry, separate it from the bowl mold.",
    "Peel off the kitchen plastic wrap.",
    "Paint the bowl in a decorative color.",
    "Add patterns if wished.",
    "The bowl is ready for display once it has dried.",
    "As with a papier-mâché bowl, this bowl is suitable only for display or holding objects, not for eating from.",
    "Fruit bowl from found objects Find a suitable bowl shaped object.",
    "Here there are limitless possibilities, so it's difficult to suggest any one thing.",
    "But some ideas include pan or pot lids, the cover of an old round fan, packaging, lids off household objects, lampshades, toys, etc.",
    "Rummage around and be creative in your choices.",
    "Find a suitable stand.",
    "The bowl-like object will usually be best placed on some sort of a stand to keep it up off the display surface.",
    "Again, many things could work but some ideas include old cups and glasses, pencil holders, packaging, poster tubes cut down, toys, unwanted gadgets, etc.",
    "Glue the bowl object to the stand object.",
    "In some cases, it may be best to screw the two objects together for best stability.",
    "Always check that the items sit together without rocking before attaching.",
    "Place on display.",
    "It's something odd to be admired!",
    "Doily or fabric bowl Find a large unwanted doily.",
    "It should be in very good to excellent condition––if it's stained, pass on it.",
    "Doilies can be purchased from thrift stores, antique dealers and many online auction sellers.",
    "Cover a bowl in plastic kitchen wrap, ensuring that it goes over the rim.",
    "Before finalizing the bowl choice, check that the doily sits over it well.",
    "If not, choose one of a better size.",
    "Turn the bowl upside down in readiness for covering with the doily.",
    "Choose between fabric stiffener or sugar water to stiffen the bowl.",
    "Either will work, choose according to whatever you have available.",
    "Note that sugar water may attract insects if stored for a long period of time.",
    "In each case, work over a surface where drips won't be a problem.",
    "Pour fabric stiffener into another bowl or basin.",
    "Dip the doily into this bowl or basin.",
    "Make sugar water.",
    "Dissolve 3-5 tablespoons of sugar in boiling water.",
    "Heat without boiling, until all of the granules disappear.",
    "Dip the doily into this mixture.",
    "Make sure it is thoroughly covered.",
    "Place the dipped, wet doily over the bowl.",
    "Adjust to ensure that it is sitting evenly around the bowl––if not, you'll end up with a lopsided doily bowl shape.",
    "Set aside in a warm, dry place.",
    "Let dry for approximately 48 hours.",
    "Don't touch until at least 24 hours have passed by.",
    "Lift the bowl gently, using the kitchen plastic wrap to help lever it off the molding bowl.",
    "Let stand until you're absolutely sure the whole surface of the doily is completely dry.",
    "Trim off any plastic wrap or fabric stiffener that is stuck to the doily.",
    "Use.",
    "Add candies, sewing bits and pieces (a few old wooden cotton reels look superb) or a pile of ribbons.",
    "It's a lovely item just by itself on display too."
  ],
  "tyn_section":[
    "Suitable bowl for a mold in some projects",
    "Most items listed within methods"
  ],
  "tyn_model":[
    "bowl",
    "clay",
    "paint",
    "papier-mâché bowl",
    "newspaper",
    "pva glue",
    "doily",
    "sugar water",
    "pitcher",
    "jug",
    "water",
    "glue",
    "plastic wrap",
    "paper",
    "kitchen plastic wrap",
    "fabric stiffener",
    "clay coil bowl",
    "small clay spatula",
    "ironing board",
    "towel",
    "iron",
    "paper bowl",
    "pulp paper",
    "bucket",
    "hot water",
    "wooden spoon",
    "food processor",
    "sieve",
    "refrigerator",
    "plastic kitchen wrap",
    "bowl mold",
    "fruit bowl",
    "toys",
    "fabric bowl",
    "doilies",
    "sugar",
    "doily bowl",
    "candies",
    "ribbons"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}