{
  "title":"How to Melt Carob Chips",
  "url":"https://www.wikihow.com/Melt-Carob-Chips",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Melting Carob Chips in the Microwave",
      "steps":[
        {
          "headline":"Place ½ cup (78 g) of carob chips in a microwave-safe bowl.",
          "description":"Measure out the amount of carob chips you need for the recipe you're making. Transfer the chips to a glass or plastic bowl that can be safely heated in the microwave. Leave the bowl uncovered. If you're not working with a recipe and don’t know how many carob chips you need, start with ½ cup (78 g). Avoid melting more than 1 cup (155 g) of carob chips at a time; otherwise, they won’t melt evenly."
        },
        {
          "headline":"Microwave the chips on medium for 30 seconds.",
          "description":"Place the bowl of carob chips in the microwave and close the door. Set the microwave to the medium power setting, set the time for half a minute, and press the start button to cook the chips. It’s important to cook the chips in short increments and medium power; otherwise, they might dry out or burn instead of melting. If your microwave doesn’t have a medium setting, use the lowest setting possible, or use your regular power setting with 15 second increments."
        },
        {
          "headline":"Stir the carob chips.",
          "description":"Remove the bowl from the microwave and use a wooden spoon or rubber spatula to stir the chips. Don’t worry if they still hold their shapes. The chips will eventually melt evenly into a thick liquid."
        },
        {
          "headline":"Continue microwaving in 30-second increments.",
          "description":"After stirring, return the carob chips to the microwave and cook them for another half-minute on medium powder. After 30 seconds, remove the chips from the microwave and stir them again. If the chips are melted and smooth, they're done. If they're not, return the chips to the microwave for one final 30-second increment."
        },
        {
          "headline":"Whisk in 1 tablespoon (15 ml) of oil.",
          "description":"Remove the chips from the microwave. Pour in some canola or coconut oil and whisk the mixture vigorously until it becomes smooth and glossy. The oil will remove the graininess from the carob and produce a smoother, more chocolate-like mixture. You can whisk in another 1 tablespoon (15 ml) of oil if necessary to make the melted carob easier to pour or drizzle. You can also stir in 1 ounce (28 g) of paramount crystals in place of the oil. Paramount crystals are a combination of palm kernel oil and soy lecithin, and they're used to thin out chocolate and candy coatings and make them creamier."
        }
      ]
    },
    {
      "name":"Melting Carob Chips in a Double Boiler",
      "steps":[
        {
          "headline":"Place ½ cup (78 g) of carob chips into a glass bowl.",
          "description":"Choose a large heat-proof glass bowl that will fit inside a medium saucepan without touching the bottom of the pan. Measure out your carob chips and transfer them to the bowl. If you have a proper double boiler, place the carob chips in the shallow upper pan. A double boiler is good for cooking things on indirect heat. Indirect heat is ideal for carob chips, because they can burn easily if they're exposed to direct heat."
        },
        {
          "headline":"Add 1 tablespoon (15 ml) of oil.",
          "description":"Use canola or coconut oil, and add it to the bowl with the carob chips. Instead of the oil, you can use 1 ounce (28 g) of paramount crystals per ½ cup (78 g) of carob chips."
        },
        {
          "headline":"Fill a medium saucepan with 1 inch (2.5 cm) of water.",
          "description":"Or, if you're using a double boiler, fill the deeper bottom saucepan with the water. Don’t add more than 1 inch (2.5 cm) of water, or the top of the double boiler may touch the water, and that means you'll be cooking with direct heat."
        },
        {
          "headline":"Place the bowl on top of the saucepan.",
          "description":"The water can be close to the bowl, but the bottom of the bowl shouldn’t actually touch the water. Remove the bowl and dump out some of the water if the bowl is touching the water. With a proper double boiler, place the shallow saucepan on top of the lower saucepan."
        },
        {
          "headline":"Heat the water to melt the chips.",
          "description":"Turn the heat to medium-low to bring the water to a slow simmer. Keep the heat low to prevent the carob from becoming grainy. Stir the carob chips and oil constantly with a wooden spoon. As the carob chips heat up and mix with the oil, they’ll begin to melt."
        },
        {
          "headline":"Whisk the carob until smooth.",
          "description":"When the carob chips have started to melt and lose their shape, switch to a whisk. Continue heating the carob in the double boiler and whisking vigorously until the carob is completely melted and smooth, about a minute. If the melted carob is too thick to drizzle, whisk in another 1 tablespoon (15 ml) of oil to make it pourable."
        }
      ]
    },
    {
      "name":"Using Melted Carob Chips",
      "steps":[
        {
          "headline":"Drizzle the sauce over baked goods or desserts.",
          "description":"Carob’s natural sweetness makes it a perfect finish for baked goods like cookies and cakes, but you can also use it like a chocolate-type sauce for ice cream and other treats. Drizzle 1 to 2 tablespoons (15 to 30 ml) of melted carob over individual desserts like cupcakes, or use a whole cup (235 ml) of melted carob for an entire dessert, like a cake. Use the carob chips immediately after you melt them -- they will start to harden when the mixture cools down."
        },
        {
          "headline":"Use it as a fondue-style dip.",
          "description":"Melted carob can also be used in place of chocolate in a fondue. Place the bowl of melted carob on the table, along with whole strawberries, chopped bananas, slices of apple, and other favorite fruits. Use skewers or toothpicks to grab individual pieces of fruit and dip them in the carob. Use the chips immediately after melting -- they will harden as the mixture cools down."
        },
        {
          "headline":"Use it to coat dog treats.",
          "description":"Dogs like carob, so it makes a great addition to homemade biscuits and treats. Unlike chocolate, carob is totally safe for dogs. Next time you make a batch of dog biscuits, allow the cookies to cool completely and then dip each one in the melted carob. Set the cookies aside on a piece of parchment paper and allow the carob to harden before serving. It will take the melted chips about 30 minutes to an hour to harden at room temperature."
        },
        {
          "headline":"Pour it into molds to make chocolate alternatives.",
          "description":"Melted carob can also be used as a substitute for making homemade chocolates. Once the carob has been melted, portion it into individual molds. Set the carob aside on the counter to cool, and then transfer it to the refrigerator to harden. It will take the melted chips 15-20 minutes to harden in the fridge."
        },
        {
          "headline":"Make a warm drink.",
          "description":"Combine 1 cup (235 ml) of milk or non-dairy milk and 2 tablespoons (19 g) of melted carob in a saucepan. Add up to 1 tablespoon (14 g) of sugar, to taste, to sweeten the drink if you like. Whisk the milk and carob together and heat the mixture over medium heat until it’s hot."
        },
        {
          "headline":"Add it to smoothies.",
          "description":"Carob makes a great addition to smoothies. In a blender, combine a handful of your favorite fruits and ½ cup (118 ml) of milk, non-dairy milk, juice, or yogurt. Add 1 to 2 tablespoons (9.5 to 19 g) of melted carob and blend the mixture until smooth."
        },
        {
          "headline":"Drizzle it on oatmeal.",
          "description":"Because carob has a hint of sweetness, it makes a great addition to breakfast foods like oatmeal. Drizzle 1 tablespoon (9.5 g) of melted carob over your hot oatmeal before serving to liven up your breakfast."
        }
      ]
    }
  ],
  "text":" Melting Carob Chips in the Microwave Place ½ cup (78 g) of carob chips in a microwave-safe bowl. Measure out the amount of carob chips you need for the recipe you're making. Transfer the chips to a glass or plastic bowl that can be safely heated in the microwave. Leave the bowl uncovered. If you're not working with a recipe and don’t know how many carob chips you need, start with ½ cup (78 g). Avoid melting more than 1 cup (155 g) of carob chips at a time; otherwise, they won’t melt evenly. Microwave the chips on medium for 30 seconds. Place the bowl of carob chips in the microwave and close the door. Set the microwave to the medium power setting, set the time for half a minute, and press the start button to cook the chips. It’s important to cook the chips in short increments and medium power; otherwise, they might dry out or burn instead of melting. If your microwave doesn’t have a medium setting, use the lowest setting possible, or use your regular power setting with 15 second increments. Stir the carob chips. Remove the bowl from the microwave and use a wooden spoon or rubber spatula to stir the chips. Don’t worry if they still hold their shapes. The chips will eventually melt evenly into a thick liquid. Continue microwaving in 30-second increments. After stirring, return the carob chips to the microwave and cook them for another half-minute on medium powder. After 30 seconds, remove the chips from the microwave and stir them again. If the chips are melted and smooth, they're done. If they're not, return the chips to the microwave for one final 30-second increment. Whisk in 1 tablespoon (15 ml) of oil. Remove the chips from the microwave. Pour in some canola or coconut oil and whisk the mixture vigorously until it becomes smooth and glossy. The oil will remove the graininess from the carob and produce a smoother, more chocolate-like mixture. You can whisk in another 1 tablespoon (15 ml) of oil if necessary to make the melted carob easier to pour or drizzle. You can also stir in 1 ounce (28 g) of paramount crystals in place of the oil. Paramount crystals are a combination of palm kernel oil and soy lecithin, and they're used to thin out chocolate and candy coatings and make them creamier. Melting Carob Chips in a Double Boiler Place ½ cup (78 g) of carob chips into a glass bowl. Choose a large heat-proof glass bowl that will fit inside a medium saucepan without touching the bottom of the pan. Measure out your carob chips and transfer them to the bowl. If you have a proper double boiler, place the carob chips in the shallow upper pan. A double boiler is good for cooking things on indirect heat. Indirect heat is ideal for carob chips, because they can burn easily if they're exposed to direct heat. Add 1 tablespoon (15 ml) of oil. Use canola or coconut oil, and add it to the bowl with the carob chips. Instead of the oil, you can use 1 ounce (28 g) of paramount crystals per ½ cup (78 g) of carob chips. Fill a medium saucepan with 1 inch (2.5 cm) of water. Or, if you're using a double boiler, fill the deeper bottom saucepan with the water. Don’t add more than 1 inch (2.5 cm) of water, or the top of the double boiler may touch the water, and that means you'll be cooking with direct heat. Place the bowl on top of the saucepan. The water can be close to the bowl, but the bottom of the bowl shouldn’t actually touch the water. Remove the bowl and dump out some of the water if the bowl is touching the water. With a proper double boiler, place the shallow saucepan on top of the lower saucepan. Heat the water to melt the chips. Turn the heat to medium-low to bring the water to a slow simmer. Keep the heat low to prevent the carob from becoming grainy. Stir the carob chips and oil constantly with a wooden spoon. As the carob chips heat up and mix with the oil, they’ll begin to melt. Whisk the carob until smooth. When the carob chips have started to melt and lose their shape, switch to a whisk. Continue heating the carob in the double boiler and whisking vigorously until the carob is completely melted and smooth, about a minute. If the melted carob is too thick to drizzle, whisk in another 1 tablespoon (15 ml) of oil to make it pourable. Using Melted Carob Chips Drizzle the sauce over baked goods or desserts. Carob’s natural sweetness makes it a perfect finish for baked goods like cookies and cakes, but you can also use it like a chocolate-type sauce for ice cream and other treats. Drizzle 1 to 2 tablespoons (15 to 30 ml) of melted carob over individual desserts like cupcakes, or use a whole cup (235 ml) of melted carob for an entire dessert, like a cake. Use the carob chips immediately after you melt them -- they will start to harden when the mixture cools down. Use it as a fondue-style dip. Melted carob can also be used in place of chocolate in a fondue. Place the bowl of melted carob on the table, along with whole strawberries, chopped bananas, slices of apple, and other favorite fruits. Use skewers or toothpicks to grab individual pieces of fruit and dip them in the carob. Use the chips immediately after melting -- they will harden as the mixture cools down. Use it to coat dog treats. Dogs like carob, so it makes a great addition to homemade biscuits and treats. Unlike chocolate, carob is totally safe for dogs. Next time you make a batch of dog biscuits, allow the cookies to cool completely and then dip each one in the melted carob. Set the cookies aside on a piece of parchment paper and allow the carob to harden before serving. It will take the melted chips about 30 minutes to an hour to harden at room temperature. Pour it into molds to make chocolate alternatives. Melted carob can also be used as a substitute for making homemade chocolates. Once the carob has been melted, portion it into individual molds. Set the carob aside on the counter to cool, and then transfer it to the refrigerator to harden. It will take the melted chips 15-20 minutes to harden in the fridge. Make a warm drink. Combine 1 cup (235 ml) of milk or non-dairy milk and 2 tablespoons (19 g) of melted carob in a saucepan. Add up to 1 tablespoon (14 g) of sugar, to taste, to sweeten the drink if you like. Whisk the milk and carob together and heat the mixture over medium heat until it’s hot. Add it to smoothies. Carob makes a great addition to smoothies. In a blender, combine a handful of your favorite fruits and ½ cup (118 ml) of milk, non-dairy milk, juice, or yogurt. Add 1 to 2 tablespoons (9.5 to 19 g) of melted carob and blend the mixture until smooth. Drizzle it on oatmeal. Because carob has a hint of sweetness, it makes a great addition to breakfast foods like oatmeal. Drizzle 1 tablespoon (9.5 g) of melted carob over your hot oatmeal before serving to liven up your breakfast.",
  "sentences":[
    " Melting Carob Chips in the Microwave Place ½ cup (78 g) of carob chips in a microwave-safe bowl.",
    "Measure out the amount of carob chips you need for the recipe you're making.",
    "Transfer the chips to a glass or plastic bowl that can be safely heated in the microwave.",
    "Leave the bowl uncovered.",
    "If you're not working with a recipe and don’t know how many carob chips you need, start with ½ cup (78 g).",
    "Avoid melting more than 1 cup (155 g) of carob chips at a time; otherwise, they won’t melt evenly.",
    "Microwave the chips on medium for 30 seconds.",
    "Place the bowl of carob chips in the microwave and close the door.",
    "Set the microwave to the medium power setting, set the time for half a minute, and press the start button to cook the chips.",
    "It’s important to cook the chips in short increments and medium power; otherwise, they might dry out or burn instead of melting.",
    "If your microwave doesn’t have a medium setting, use the lowest setting possible, or use your regular power setting with 15 second increments.",
    "Stir the carob chips.",
    "Remove the bowl from the microwave and use a wooden spoon or rubber spatula to stir the chips.",
    "Don’t worry if they still hold their shapes.",
    "The chips will eventually melt evenly into a thick liquid.",
    "Continue microwaving in 30-second increments.",
    "After stirring, return the carob chips to the microwave and cook them for another half-minute on medium powder.",
    "After 30 seconds, remove the chips from the microwave and stir them again.",
    "If the chips are melted and smooth, they're done.",
    "If they're not, return the chips to the microwave for one final 30-second increment.",
    "Whisk in 1 tablespoon (15 ml) of oil.",
    "Remove the chips from the microwave.",
    "Pour in some canola or coconut oil and whisk the mixture vigorously until it becomes smooth and glossy.",
    "The oil will remove the graininess from the carob and produce a smoother, more chocolate-like mixture.",
    "You can whisk in another 1 tablespoon (15 ml) of oil if necessary to make the melted carob easier to pour or drizzle.",
    "You can also stir in 1 ounce (28 g) of paramount crystals in place of the oil.",
    "Paramount crystals are a combination of palm kernel oil and soy lecithin, and they're used to thin out chocolate and candy coatings and make them creamier.",
    "Melting Carob Chips in a Double Boiler Place ½ cup (78 g) of carob chips into a glass bowl.",
    "Choose a large heat-proof glass bowl that will fit inside a medium saucepan without touching the bottom of the pan.",
    "Measure out your carob chips and transfer them to the bowl.",
    "If you have a proper double boiler, place the carob chips in the shallow upper pan.",
    "A double boiler is good for cooking things on indirect heat.",
    "Indirect heat is ideal for carob chips, because they can burn easily if they're exposed to direct heat.",
    "Add 1 tablespoon (15 ml) of oil.",
    "Use canola or coconut oil, and add it to the bowl with the carob chips.",
    "Instead of the oil, you can use 1 ounce (28 g) of paramount crystals per ½ cup (78 g) of carob chips.",
    "Fill a medium saucepan with 1 inch (2.5 cm) of water.",
    "Or, if you're using a double boiler, fill the deeper bottom saucepan with the water.",
    "Don’t add more than 1 inch (2.5 cm) of water, or the top of the double boiler may touch the water, and that means you'll be cooking with direct heat.",
    "Place the bowl on top of the saucepan.",
    "The water can be close to the bowl, but the bottom of the bowl shouldn’t actually touch the water.",
    "Remove the bowl and dump out some of the water if the bowl is touching the water.",
    "With a proper double boiler, place the shallow saucepan on top of the lower saucepan.",
    "Heat the water to melt the chips.",
    "Turn the heat to medium-low to bring the water to a slow simmer.",
    "Keep the heat low to prevent the carob from becoming grainy.",
    "Stir the carob chips and oil constantly with a wooden spoon.",
    "As the carob chips heat up and mix with the oil, they’ll begin to melt.",
    "Whisk the carob until smooth.",
    "When the carob chips have started to melt and lose their shape, switch to a whisk.",
    "Continue heating the carob in the double boiler and whisking vigorously until the carob is completely melted and smooth, about a minute.",
    "If the melted carob is too thick to drizzle, whisk in another 1 tablespoon (15 ml) of oil to make it pourable.",
    "Using Melted Carob Chips Drizzle the sauce over baked goods or desserts.",
    "Carob’s natural sweetness makes it a perfect finish for baked goods like cookies and cakes, but you can also use it like a chocolate-type sauce for ice cream and other treats.",
    "Drizzle 1 to 2 tablespoons (15 to 30 ml) of melted carob over individual desserts like cupcakes, or use a whole cup (235 ml) of melted carob for an entire dessert, like a cake.",
    "Use the carob chips immediately after you melt them -- they will start to harden when the mixture cools down.",
    "Use it as a fondue-style dip.",
    "Melted carob can also be used in place of chocolate in a fondue.",
    "Place the bowl of melted carob on the table, along with whole strawberries, chopped bananas, slices of apple, and other favorite fruits.",
    "Use skewers or toothpicks to grab individual pieces of fruit and dip them in the carob.",
    "Use the chips immediately after melting -- they will harden as the mixture cools down.",
    "Use it to coat dog treats.",
    "Dogs like carob, so it makes a great addition to homemade biscuits and treats.",
    "Unlike chocolate, carob is totally safe for dogs.",
    "Next time you make a batch of dog biscuits, allow the cookies to cool completely and then dip each one in the melted carob.",
    "Set the cookies aside on a piece of parchment paper and allow the carob to harden before serving.",
    "It will take the melted chips about 30 minutes to an hour to harden at room temperature.",
    "Pour it into molds to make chocolate alternatives.",
    "Melted carob can also be used as a substitute for making homemade chocolates.",
    "Once the carob has been melted, portion it into individual molds.",
    "Set the carob aside on the counter to cool, and then transfer it to the refrigerator to harden.",
    "It will take the melted chips 15-20 minutes to harden in the fridge.",
    "Make a warm drink.",
    "Combine 1 cup (235 ml) of milk or non-dairy milk and 2 tablespoons (19 g) of melted carob in a saucepan.",
    "Add up to 1 tablespoon (14 g) of sugar, to taste, to sweeten the drink if you like.",
    "Whisk the milk and carob together and heat the mixture over medium heat until it’s hot.",
    "Add it to smoothies.",
    "Carob makes a great addition to smoothies.",
    "In a blender, combine a handful of your favorite fruits and ½ cup (118 ml) of milk, non-dairy milk, juice, or yogurt.",
    "Add 1 to 2 tablespoons (9.5 to 19 g) of melted carob and blend the mixture until smooth.",
    "Drizzle it on oatmeal.",
    "Because carob has a hint of sweetness, it makes a great addition to breakfast foods like oatmeal.",
    "Drizzle 1 tablespoon (9.5 g) of melted carob over your hot oatmeal before serving to liven up your breakfast."
  ],
  "tyn_section":[
    "Using a Microwave",
    "Microwave-safe bowl",
    "Wooden spoon or rubber spatula",
    "Whisk",
    "Using a Double Boiler",
    "Double boiler or heat-proof glass bowl that will fit inside a medium saucepan",
    "Medium saucepan",
    "Wooden spoon"
  ],
  "tyn_model":[
    "carob",
    "bowl",
    "microwave",
    "water",
    "oil",
    "carob chips",
    "double boiler",
    "saucepan",
    "milk",
    "whisk",
    "oatmeal",
    "wooden spoon",
    "canola or",
    "coconut oil",
    "chocolate",
    "microwave-safe bowl",
    "glass or plastic bowl",
    "rubber spatula",
    "palm kernel oil",
    "soy lecithin",
    "glass bowl",
    "melted carob chips",
    "baked goods",
    "fondue-style dip",
    "fondue",
    "strawberries",
    "bananas",
    "apple",
    "skewers",
    "parchment paper",
    "chocolates",
    "refrigerator",
    "fridge",
    "sugar",
    "blender",
    "yogurt"
  ],
  "simple_metrics":{
    "r":0.375,
    "p":0.0833333333,
    "f1":0.1363636364,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.1666666667,
    "f1":0.2631578947
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.25,
    "f1":0.3888888889
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.0833333333,
    "f1":0.1363636364
  }
}