{
  "title":"How to Make Homemade Strawberry Frosting",
  "url":"https://www.wikihow.com/Make-Homemade-Strawberry-Frosting",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Making Strawberry Buttercream Frosting",
      "steps":[
        {
          "headline":"Cook the strawberries, sugar, and water in a medium-sized saucepan for 10 minutes.",
          "description":"Place 2 cups (400 grams) of fresh, sliced strawberries, ½ cup (115 grams) of granulated white sugar, and ½ cup (120 milliliters) of water into a saucepan. Bring the mixture to a boil over medium-low heat, then reduce the heat to low, and simmer for 10 minutes."
        },
        {
          "headline":"Purée the strawberry mixture.",
          "description":"Pour the strawberry mixture into a blender or food processor, and purée until smooth, about 10 seconds. From time to time, pause the blender/food processor, and use a rubber spatula to push any lumps or clumps down towards the bottom. The smoother the purée is, the smoother your buttercream will be."
        },
        {
          "headline":"Chill the strawberry syrup in the fridge for at least 20 minutes.",
          "description":"Pour the syrup into a bowl, and cover it with a sheet of plastic wrap. Put it into the fridge, and leave it there for at least 20 minutes."
        },
        {
          "headline":"Set aside 4 tablespoons of the strawberry syrup, and store the rest in the fridge.",
          "description":"Keep the leftover strawberry syrup in a jar or bottle with a tight-fitting lid, and use it within one week. You can use it on top of ice cream, waffles, pancakes, and other desserts."
        },
        {
          "headline":"Beat the butter and ½ cup (65 grams) of the powdered sugar.",
          "description":"You can do this using a handheld mixer, a stand mixer, or a food processor fitted with whisks. Be sure to scrape the bottom and sides of the bowl. The more sugar you add, the stiffer your buttercream will be."
        },
        {
          "headline":"Add 1 tablespoon (15 milliliters) of the strawberry syrup and beat again.",
          "description":"Keep adding the sugar and strawberry syrup a little bit at a time until you have used up all of your sugar. Remember, you are only using 4 tablespoons (60 milliliters) of the strawberry syrup."
        },
        {
          "headline":"Add the vanilla extract.",
          "description":"Beat it in using a high speed setting for 20 seconds. This will lighten the frosting. Vanilla extract can change the color of frosting slightly. If this bothers you, use the clear, colorless kind."
        },
        {
          "headline":"Beat in the half-and-half, 1 tablespoon (15 milliliters) at a time.",
          "description":"Keep adding the half-and-half until the buttercream holds its shape. You may not need to use all of it."
        },
        {
          "headline":"Beat in the pinch of salt.",
          "description":"Use a high speed setting, and beat it for only 20 seconds. This will help cut the sweetness a little while lightening the frosting up further."
        },
        {
          "headline":"Use the frosting right away, or cover it and keep it in the fridge for up to three days.",
          "description":"If you need to use refrigerated buttercream, let it sit on the counter until it reaches room temperature, then beat it on low speed until it turns smooth. If you'd like a thicker, stiffer buttercream, refrigerate the buttercream for 40 to 45 minutes. Be sure to cover it with a sheet of plastic wrap so that it doesn't dry out."
        }
      ]
    },
    {
      "name":"Making Strawberry Cream Cheese Frosting",
      "steps":[
        {
          "headline":"Purée the strawberries and the sugar.",
          "description":"Add 1¼ cups (250 grams) of fresh, chopped strawberries and 1 tablespoon (15 grams) of granulated white sugar into a blender or food processor. Purée until smooth, about 10 seconds. From time to time, pause the blender/food processor, and scrape any large clumps down towards the bottom with a rubber spatula."
        },
        {
          "headline":"Pour the purée through a fine, mesh sieve into a medium-sized saucepan.",
          "description":"Discard anything that gets caught in the sieve. You will end up with about ½ cup (120 milliliters) of strawberry purée."
        },
        {
          "headline":"Cook the strawberry purée for 10 to 15 minutes.",
          "description":"Bring the strawberry purée to a boil over medium heat, then reduce the heat to low. Let the purée simmer for 10 to 15 minutes, or until it thickens. You will end up with about 3 to 4 tablespoons (50 to 60 milliliters) of strawberry purée."
        },
        {
          "headline":"Chill the strawberry purée, then set aside 3 tablespoons (45 milliliters) for your frosting.",
          "description":"Pour the strawberry purée into a bowl, and let it reach room temperature before chilling it in the fridge for at least 20 minutes. Once the purée has chilled, measure out 3 tablespoons (45 milliliters). If you have any left over, you can store them in the fridge in a small bottle or jar."
        },
        {
          "headline":"Cream the butter and cream cheese together until smooth, about 30 seconds.",
          "description":"You can do this in a bowl using a handheld mixer. You can also use a stand mixer or a food processor fitted with whisks."
        },
        {
          "headline":"Beat in the powdered sugar, ½ cup (65 grams) at a time.",
          "description":"You will end up using 3 to 4 cups (375 to 400 grams) of powdered sugar. The more sugar you add, the stiffer your frosting will be."
        },
        {
          "headline":"Add the salt, then beat until the frosting is light and fluffy.",
          "description":"This will take about 3 to 5 minutes. Be sure to scrape the bottom and sides of the bowl, especially if you are using a handheld mixer."
        },
        {
          "headline":"Add in the strawberry purée and vanilla extract, and beat again until evenly combined.",
          "description":"Vanilla extract can change the color of frosting. If this is an issue for you, use clear vanilla extract instead."
        },
        {
          "headline":"Use the frosting right away, or refrigerate it.",
          "description":"If the frosting is too soft for you, cover it with a sheet of plastic wrap, and stick it in the fridge until it reaches the consistency you need. Check on it every 15 minutes. Store any unused frosting in the fridge, covered, for up to 1 week. Let it sit at room temperature for 15 to 30 minutes before you use it."
        }
      ]
    },
    {
      "name":"Making Strawberry Whipped Cream Frosting",
      "steps":[
        {
          "headline":"Start with cold mixing equipment.",
          "description":"Place your bowl and whisk in the freezer for 15 to 30 minutes. If you are using a stand mixer or a food processor, see if you can detach the bowl, and put it into the freezer. If you can't, then don't worry about it. Working with cold equipment prevents the whipped cream from getting too soft."
        },
        {
          "headline":"Beat the cold, heavy whipping cream, vanilla extract, and granulated white sugar until soft peaks form.",
          "description":"Place everything, except for the strawberry purée/jam into the bowl of your mixer. Beat the ingredients together until they get soft peaks."
        },
        {
          "headline":"Add ⅓ cup (80 milliliters) of chilled strawberry purée or strawberry jam.",
          "description":"You can use something that you bought from the store, or you can make your own."
        },
        {
          "headline":"Beat everything together until stiff peaks form.",
          "description":"You want the color and texture to be even and consistent. If you are using a handheld mixer, be sure to scrape the bottom and sides of the bowl."
        },
        {
          "headline":"Taste your whipped cream and make any necessary adjustments.",
          "description":"At this point, your whipped cream is ready to use. It may not be perfect to your liking, however, so give it a taste, and add more sugar, cream, or purée/jam. Be sure to beat the frosting well after each addition. If it is too thin or not sweet enough, add more sugar. If you want more of a strawberry flavor, add more strawberry purée or strawberry jam. If it is too thick, add more heavy whipping cream."
        },
        {
          "headline":"Use the frosting immediately, or cover it and store it in the fridge.",
          "description":"Use the frosting within 3 days."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Strawberry Buttercream Frosting Cook the strawberries, sugar, and water in a medium-sized saucepan for 10 minutes. Place 2 cups (400 grams) of fresh, sliced strawberries, ½ cup (115 grams) of granulated white sugar, and ½ cup (120 milliliters) of water into a saucepan. Bring the mixture to a boil over medium-low heat, then reduce the heat to low, and simmer for 10 minutes. Purée the strawberry mixture. Pour the strawberry mixture into a blender or food processor, and purée until smooth, about 10 seconds. From time to time, pause the blender/food processor, and use a rubber spatula to push any lumps or clumps down towards the bottom. The smoother the purée is, the smoother your buttercream will be. Chill the strawberry syrup in the fridge for at least 20 minutes. Pour the syrup into a bowl, and cover it with a sheet of plastic wrap. Put it into the fridge, and leave it there for at least 20 minutes. Set aside 4 tablespoons of the strawberry syrup, and store the rest in the fridge. Keep the leftover strawberry syrup in a jar or bottle with a tight-fitting lid, and use it within one week. You can use it on top of ice cream, waffles, pancakes, and other desserts. Beat the butter and ½ cup (65 grams) of the powdered sugar. You can do this using a handheld mixer, a stand mixer, or a food processor fitted with whisks. Be sure to scrape the bottom and sides of the bowl. The more sugar you add, the stiffer your buttercream will be. Add 1 tablespoon (15 milliliters) of the strawberry syrup and beat again. Keep adding the sugar and strawberry syrup a little bit at a time until you have used up all of your sugar. Remember, you are only using 4 tablespoons (60 milliliters) of the strawberry syrup. Add the vanilla extract. Beat it in using a high speed setting for 20 seconds. This will lighten the frosting. Vanilla extract can change the color of frosting slightly. If this bothers you, use the clear, colorless kind. Beat in the half-and-half, 1 tablespoon (15 milliliters) at a time. Keep adding the half-and-half until the buttercream holds its shape. You may not need to use all of it. Beat in the pinch of salt. Use a high speed setting, and beat it for only 20 seconds. This will help cut the sweetness a little while lightening the frosting up further. Use the frosting right away, or cover it and keep it in the fridge for up to three days. If you need to use refrigerated buttercream, let it sit on the counter until it reaches room temperature, then beat it on low speed until it turns smooth. If you'd like a thicker, stiffer buttercream, refrigerate the buttercream for 40 to 45 minutes. Be sure to cover it with a sheet of plastic wrap so that it doesn't dry out. Making Strawberry Cream Cheese Frosting Purée the strawberries and the sugar. Add 1¼ cups (250 grams) of fresh, chopped strawberries and 1 tablespoon (15 grams) of granulated white sugar into a blender or food processor. Purée until smooth, about 10 seconds. From time to time, pause the blender/food processor, and scrape any large clumps down towards the bottom with a rubber spatula. Pour the purée through a fine, mesh sieve into a medium-sized saucepan. Discard anything that gets caught in the sieve. You will end up with about ½ cup (120 milliliters) of strawberry purée. Cook the strawberry purée for 10 to 15 minutes. Bring the strawberry purée to a boil over medium heat, then reduce the heat to low. Let the purée simmer for 10 to 15 minutes, or until it thickens. You will end up with about 3 to 4 tablespoons (50 to 60 milliliters) of strawberry purée. Chill the strawberry purée, then set aside 3 tablespoons (45 milliliters) for your frosting. Pour the strawberry purée into a bowl, and let it reach room temperature before chilling it in the fridge for at least 20 minutes. Once the purée has chilled, measure out 3 tablespoons (45 milliliters). If you have any left over, you can store them in the fridge in a small bottle or jar. Cream the butter and cream cheese together until smooth, about 30 seconds. You can do this in a bowl using a handheld mixer. You can also use a stand mixer or a food processor fitted with whisks. Beat in the powdered sugar, ½ cup (65 grams) at a time. You will end up using 3 to 4 cups (375 to 400 grams) of powdered sugar. The more sugar you add, the stiffer your frosting will be. Add the salt, then beat until the frosting is light and fluffy. This will take about 3 to 5 minutes. Be sure to scrape the bottom and sides of the bowl, especially if you are using a handheld mixer. Add in the strawberry purée and vanilla extract, and beat again until evenly combined. Vanilla extract can change the color of frosting. If this is an issue for you, use clear vanilla extract instead. Use the frosting right away, or refrigerate it. If the frosting is too soft for you, cover it with a sheet of plastic wrap, and stick it in the fridge until it reaches the consistency you need. Check on it every 15 minutes. Store any unused frosting in the fridge, covered, for up to 1 week. Let it sit at room temperature for 15 to 30 minutes before you use it. Making Strawberry Whipped Cream Frosting Start with cold mixing equipment. Place your bowl and whisk in the freezer for 15 to 30 minutes. If you are using a stand mixer or a food processor, see if you can detach the bowl, and put it into the freezer. If you can't, then don't worry about it. Working with cold equipment prevents the whipped cream from getting too soft. Beat the cold, heavy whipping cream, vanilla extract, and granulated white sugar until soft peaks form. Place everything, except for the strawberry purée/jam into the bowl of your mixer. Beat the ingredients together until they get soft peaks. Add ⅓ cup (80 milliliters) of chilled strawberry purée or strawberry jam. You can use something that you bought from the store, or you can make your own. Beat everything together until stiff peaks form. You want the color and texture to be even and consistent. If you are using a handheld mixer, be sure to scrape the bottom and sides of the bowl. Taste your whipped cream and make any necessary adjustments. At this point, your whipped cream is ready to use. It may not be perfect to your liking, however, so give it a taste, and add more sugar, cream, or purée/jam. Be sure to beat the frosting well after each addition. If it is too thin or not sweet enough, add more sugar. If you want more of a strawberry flavor, add more strawberry purée or strawberry jam. If it is too thick, add more heavy whipping cream. Use the frosting immediately, or cover it and store it in the fridge. Use the frosting within 3 days. Finished. ",
  "sentences":[
    " Making Strawberry Buttercream Frosting Cook the strawberries, sugar, and water in a medium-sized saucepan for 10 minutes.",
    "Place 2 cups (400 grams) of fresh, sliced strawberries, ½ cup (115 grams) of granulated white sugar, and ½ cup (120 milliliters) of water into a saucepan.",
    "Bring the mixture to a boil over medium-low heat, then reduce the heat to low, and simmer for 10 minutes.",
    "Purée the strawberry mixture.",
    "Pour the strawberry mixture into a blender or food processor, and purée until smooth, about 10 seconds.",
    "From time to time, pause the blender/food processor, and use a rubber spatula to push any lumps or clumps down towards the bottom.",
    "The smoother the purée is, the smoother your buttercream will be.",
    "Chill the strawberry syrup in the fridge for at least 20 minutes.",
    "Pour the syrup into a bowl, and cover it with a sheet of plastic wrap.",
    "Put it into the fridge, and leave it there for at least 20 minutes.",
    "Set aside 4 tablespoons of the strawberry syrup, and store the rest in the fridge.",
    "Keep the leftover strawberry syrup in a jar or bottle with a tight-fitting lid, and use it within one week.",
    "You can use it on top of ice cream, waffles, pancakes, and other desserts.",
    "Beat the butter and ½ cup (65 grams) of the powdered sugar.",
    "You can do this using a handheld mixer, a stand mixer, or a food processor fitted with whisks.",
    "Be sure to scrape the bottom and sides of the bowl.",
    "The more sugar you add, the stiffer your buttercream will be.",
    "Add 1 tablespoon (15 milliliters) of the strawberry syrup and beat again.",
    "Keep adding the sugar and strawberry syrup a little bit at a time until you have used up all of your sugar.",
    "Remember, you are only using 4 tablespoons (60 milliliters) of the strawberry syrup.",
    "Add the vanilla extract.",
    "Beat it in using a high speed setting for 20 seconds.",
    "This will lighten the frosting.",
    "Vanilla extract can change the color of frosting slightly.",
    "If this bothers you, use the clear, colorless kind.",
    "Beat in the half-and-half, 1 tablespoon (15 milliliters) at a time.",
    "Keep adding the half-and-half until the buttercream holds its shape.",
    "You may not need to use all of it.",
    "Beat in the pinch of salt.",
    "Use a high speed setting, and beat it for only 20 seconds.",
    "This will help cut the sweetness a little while lightening the frosting up further.",
    "Use the frosting right away, or cover it and keep it in the fridge for up to three days.",
    "If you need to use refrigerated buttercream, let it sit on the counter until it reaches room temperature, then beat it on low speed until it turns smooth.",
    "If you'd like a thicker, stiffer buttercream, refrigerate the buttercream for 40 to 45 minutes.",
    "Be sure to cover it with a sheet of plastic wrap so that it doesn't dry out.",
    "Making Strawberry Cream Cheese Frosting Purée the strawberries and the sugar.",
    "Add 1¼ cups (250 grams) of fresh, chopped strawberries and 1 tablespoon (15 grams) of granulated white sugar into a blender or food processor.",
    "Purée until smooth, about 10 seconds.",
    "From time to time, pause the blender/food processor, and scrape any large clumps down towards the bottom with a rubber spatula.",
    "Pour the purée through a fine, mesh sieve into a medium-sized saucepan.",
    "Discard anything that gets caught in the sieve.",
    "You will end up with about ½ cup (120 milliliters) of strawberry purée.",
    "Cook the strawberry purée for 10 to 15 minutes.",
    "Bring the strawberry purée to a boil over medium heat, then reduce the heat to low.",
    "Let the purée simmer for 10 to 15 minutes, or until it thickens.",
    "You will end up with about 3 to 4 tablespoons (50 to 60 milliliters) of strawberry purée.",
    "Chill the strawberry purée, then set aside 3 tablespoons (45 milliliters) for your frosting.",
    "Pour the strawberry purée into a bowl, and let it reach room temperature before chilling it in the fridge for at least 20 minutes.",
    "Once the purée has chilled, measure out 3 tablespoons (45 milliliters).",
    "If you have any left over, you can store them in the fridge in a small bottle or jar.",
    "Cream the butter and cream cheese together until smooth, about 30 seconds.",
    "You can do this in a bowl using a handheld mixer.",
    "You can also use a stand mixer or a food processor fitted with whisks.",
    "Beat in the powdered sugar, ½ cup (65 grams) at a time.",
    "You will end up using 3 to 4 cups (375 to 400 grams) of powdered sugar.",
    "The more sugar you add, the stiffer your frosting will be.",
    "Add the salt, then beat until the frosting is light and fluffy.",
    "This will take about 3 to 5 minutes.",
    "Be sure to scrape the bottom and sides of the bowl, especially if you are using a handheld mixer.",
    "Add in the strawberry purée and vanilla extract, and beat again until evenly combined.",
    "Vanilla extract can change the color of frosting.",
    "If this is an issue for you, use clear vanilla extract instead.",
    "Use the frosting right away, or refrigerate it.",
    "If the frosting is too soft for you, cover it with a sheet of plastic wrap, and stick it in the fridge until it reaches the consistency you need.",
    "Check on it every 15 minutes.",
    "Store any unused frosting in the fridge, covered, for up to 1 week.",
    "Let it sit at room temperature for 15 to 30 minutes before you use it.",
    "Making Strawberry Whipped Cream Frosting Start with cold mixing equipment.",
    "Place your bowl and whisk in the freezer for 15 to 30 minutes.",
    "If you are using a stand mixer or a food processor, see if you can detach the bowl, and put it into the freezer.",
    "If you can't, then don't worry about it.",
    "Working with cold equipment prevents the whipped cream from getting too soft.",
    "Beat the cold, heavy whipping cream, vanilla extract, and granulated white sugar until soft peaks form.",
    "Place everything, except for the strawberry purée/jam into the bowl of your mixer.",
    "Beat the ingredients together until they get soft peaks.",
    "Add ⅓ cup (80 milliliters) of chilled strawberry purée or strawberry jam.",
    "You can use something that you bought from the store, or you can make your own.",
    "Beat everything together until stiff peaks form.",
    "You want the color and texture to be even and consistent.",
    "If you are using a handheld mixer, be sure to scrape the bottom and sides of the bowl.",
    "Taste your whipped cream and make any necessary adjustments.",
    "At this point, your whipped cream is ready to use.",
    "It may not be perfect to your liking, however, so give it a taste, and add more sugar, cream, or purée/jam.",
    "Be sure to beat the frosting well after each addition.",
    "If it is too thin or not sweet enough, add more sugar.",
    "If you want more of a strawberry flavor, add more strawberry purée or strawberry jam.",
    "If it is too thick, add more heavy whipping cream.",
    "Use the frosting immediately, or cover it and store it in the fridge.",
    "Use the frosting within 3 days.",
    "Finished."
  ],
  "tyn_section":[
    "Saucepan",
    "Blender or food processor",
    "Electric mixer",
    "Mixing bowl",
    "Plastic wrap",
    "Jar or bottle (to store excess strawberry syrup)",
    "Fine, mesh sieve"
  ],
  "tyn_model":[
    "strawberry purée",
    "bowl",
    "sugar",
    "food processor",
    "buttercream",
    "strawberry syrup",
    "vanilla extract",
    "strawberries",
    "blender",
    "granulated white sugar",
    "plastic wrap",
    "powdered sugar",
    "stand mixer",
    "mixer",
    "whipped cream",
    "water",
    "medium-sized saucepan",
    "rubber spatula",
    "butter",
    "salt",
    "sieve",
    "freezer",
    "strawberry jam",
    "making strawberry buttercream frosting",
    "saucepan",
    "ice cream",
    "half-and-half",
    "strawberry cream cheese",
    "cream cheese",
    "fridge",
    "strawberry whipped cream frosting",
    "cold mixing equipment",
    "whisk",
    "whipping cream",
    "⅓ cup",
    "cream",
    "heavy whipping cream"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0540540541,
    "f1":0.0909090909,
    "avg_pos":0.6486486486
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.1621621622,
    "f1":0.2643171806
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.2162162162,
    "f1":0.345323741
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.0540540541,
    "f1":0.0909090909
  }
}