{
  "title":"How to Make a Potato Gun",
  "url":"https://www.wikihow.com/Make-a-Potato-Gun",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Wargaming",
    "Toy Weaponry",
    "Toy Guns",
    "Potato Guns"
  ],
  "parts":[
    {
      "name":"Getting the Pipes Ready",
      "steps":[
        {
          "headline":"Get all your parts ready for assembly.",
          "description":"All the parts necessary for this project can be bought at your local hardware store if you don’t already have them at home. Some hardware stores may even cut the PVC pipe you’ll need for this project to length as a free service or for a minor fee. You'll need a 4-in (10.1-cm) wide PVC pipe that's 2 feet (61 cm) long and a 2-in (5-cm) wide PVC pipe that is 5 feet (1.5 m) long. Only use Schedule 40 PVC pipe. \"Schedule\" refers to the thickness of the pipe's walls. Pipe thinner than Sch 40 will be unsafe and could burst under high pressure."
        },
        {
          "headline":"Measure and mark your PVC pieces, if necessary.",
          "description":"If your PVC pipes weren’t cut for you, you’ll need to do it yourself. Use a felt tipped marker to mark the PVC at the following lengths so they’re ready to be cut:\n4-in (10.1-cm) wide PVC marked at 2 feet (61 cm)\n2-in (5-cm) wide PVC marked at 5 feet (1.5 m)"
        },
        {
          "headline":"Cut the pipes along the mark using a hacksaw.",
          "description":"It may help to clamp the pipes down to a work bench or have someone hold the pipe on a flat surface as you saw. The cuts don’t need to be perfect. Once you’re finished, remove plastic burrs by rubbing the cut edges with a medium grit sandpaper."
        },
        {
          "headline":"Clean the PVC pipes with a rag.",
          "description":"Grit or plastic shavings from cutting the PVC can negatively impact the seal of parts when fitted together. Take a clean rag and wipe all parts of the PVC clean. If there are a lot of shavings, use a vacuum cleaner."
        }
      ]
    },
    {
      "name":"Gluing the Launcher",
      "steps":[
        {
          "headline":"Assemble one end of the 4-in wide PVC segment.",
          "description":"Screw a 4-in wide PVC plug into place on the threaded end of the female adapter. On one end of the 4-in segment, liberally apply PVC cement around the outer lip. Repeat this process to the inner lip of the PVC female adapter. Fit the adapter onto the end of the segment. When you glue the PVC pieces together, hold them together firmly for at least 60 seconds so the glue bonds. Twist each glue joint a quarter-turn as you are pushing it together. This will encourage a better seal. Whenever PVC pieces are glued together, be sure to use a clean towel to wipe away excess glue. The 4-in wide PVC segment will eventually become the combustion chamber for the launcher."
        },
        {
          "headline":"Attach the coupler to the 4-in wide PVC segment at the opposite end.",
          "description":"Apply PVC cement around the outer lip of the segment and the inner lip of the PVC coupler. Slide the coupler into place on the end of segment with nothing attached."
        },
        {
          "headline":"Glue the reducer in the coupler.",
          "description":"Apply more PVC cement to the inner lip of the coupler and below the outward flanging collar of the 4- to 2-in reducer. Nest the reducer in the coupler until the collar of the reducer meets the end of the coupler."
        },
        {
          "headline":"Add the barrel of the launcher.",
          "description":"The barrel of the launcher will be made up of the 2-in wide PVC segment. Spread the PVC cement on the inner lip of the reducer and the outer lip of one end of the 2-in wide PVC segment. Slide the barrel into the reducer until it is about even with the base of the coupler."
        },
        {
          "headline":"Wait 24 hours for the PVC cement to harden and cure.",
          "description":"If you use your potato launcher before the PVC cement has enough time to harden, the launcher may explode. Explosive force in the combustion chamber puts stress on the PVC when you shoot an item."
        }
      ]
    },
    {
      "name":"Adding a Spark Generator",
      "steps":[
        {
          "headline":"Drill holes in the combustion chamber for your spark generator.",
          "description":"Most spark generators simply emit a spark at one end when a button is pressed. Drill a hole in the combustion chamber just large enough to fit the sparking components of your generator. Some generators may have two prongs across which a spark jumps, or a single double-pronged extension. Many generators require spark-emitting prongs to be within ⁄5 inch (1.0 cm) of each other."
        },
        {
          "headline":"Insert the spark generator and attach it with electrical tape.",
          "description":"Press the spark emitting parts of the generator into the holes you’ve drilled. Attach the button/trigger for the generator to the combustion chamber with electrical tape, then hook up the leads from the spark generator to the trigger. Connect positive leads (+) to positive terminals on the generator and negative leads ( - ) to the negative terminals. Once the leads and terminals are attached, prevent accidental shocks by covering any bare wiring or components with electrical tape. Check your spark generator by unscrewing the PVC plug from the female adapter. While looking inside the combustion chamber, press the generator trigger several times. If you see a spark, it works."
        },
        {
          "headline":"Create a guard for the spark generator.",
          "description":"The electrical components of the spark generator can be easily damaged. Make a guard for the generator by cutting a scrap piece of PVC down the middle with a hack saw. Sand away PVC burrs with medium grit sandpaper, then attach the guard over the spark generator with PVC cement or tape. Your guard can be cut short so it only protects the sparking components or longer to cover the leads up to the trigger."
        }
      ]
    },
    {
      "name":"Firing the Launcher",
      "steps":[
        {
          "headline":"Insert a spud and open the end PVC plug.",
          "description":"Press a spud into the barrel end of the launcher so it fits snugly. Use a stick to push the potato into the base of the barrel. After that, turn over the launcher and unscrew the end PVC plug from the female adaptor. Old fashioned firearms used \"wadding,\" or cloth wrapped around projectiles, to create a better barrel seal and more power. This can also be done with potato guns. A screw inserted into the barrel where it connects to the combustion chamber will prevent the ammunition from being rammed too far and falling into the chamber."
        },
        {
          "headline":"Spray propellant into the combustion chamber and reseal the plug.",
          "description":"Almost all hairspray will work as a propellant for your launcher. Spray the hairspray into the chamber for about seven seconds and your launcher is primed and ready to go. Reseal the plug quickly and get ready to take aim. Too much propellant is as bad as not enough. If there’s not enough oxygen, ignition will not occur. Trial and error will teach the optimum amount of propellant to use in your individual design."
        },
        {
          "headline":"Aim away from people and click the trigger.",
          "description":"It may take a few clicks of the trigger before the spark ignites, but when it does the hairspray will explode. This will force the potato out the barrel of the launcher. Now it’s time for target practice. Always operate your potato launcher with caution. Improper or reckless usage could cause harm or property damage."
        }
      ]
    }
  ],
  "text":" Getting the Pipes Ready Get all your parts ready for assembly. All the parts necessary for this project can be bought at your local hardware store if you don’t already have them at home. Some hardware stores may even cut the PVC pipe you’ll need for this project to length as a free service or for a minor fee. You'll need a 4-in (10.1-cm) wide PVC pipe that's 2 feet (61 cm) long and a 2-in (5-cm) wide PVC pipe that is 5 feet (1.5 m) long. Only use Schedule 40 PVC pipe. \"Schedule\" refers to the thickness of the pipe's walls. Pipe thinner than Sch 40 will be unsafe and could burst under high pressure. Measure and mark your PVC pieces, if necessary. If your PVC pipes weren’t cut for you, you’ll need to do it yourself. Use a felt tipped marker to mark the PVC at the following lengths so they’re ready to be cut:\n4-in (10.1-cm) wide PVC marked at 2 feet (61 cm)\n2-in (5-cm) wide PVC marked at 5 feet (1.5 m) Cut the pipes along the mark using a hacksaw. It may help to clamp the pipes down to a work bench or have someone hold the pipe on a flat surface as you saw. The cuts don’t need to be perfect. Once you’re finished, remove plastic burrs by rubbing the cut edges with a medium grit sandpaper. Clean the PVC pipes with a rag. Grit or plastic shavings from cutting the PVC can negatively impact the seal of parts when fitted together. Take a clean rag and wipe all parts of the PVC clean. If there are a lot of shavings, use a vacuum cleaner. Gluing the Launcher Assemble one end of the 4-in wide PVC segment. Screw a 4-in wide PVC plug into place on the threaded end of the female adapter. On one end of the 4-in segment, liberally apply PVC cement around the outer lip. Repeat this process to the inner lip of the PVC female adapter. Fit the adapter onto the end of the segment. When you glue the PVC pieces together, hold them together firmly for at least 60 seconds so the glue bonds. Twist each glue joint a quarter-turn as you are pushing it together. This will encourage a better seal. Whenever PVC pieces are glued together, be sure to use a clean towel to wipe away excess glue. The 4-in wide PVC segment will eventually become the combustion chamber for the launcher. Attach the coupler to the 4-in wide PVC segment at the opposite end. Apply PVC cement around the outer lip of the segment and the inner lip of the PVC coupler. Slide the coupler into place on the end of segment with nothing attached. Glue the reducer in the coupler. Apply more PVC cement to the inner lip of the coupler and below the outward flanging collar of the 4- to 2-in reducer. Nest the reducer in the coupler until the collar of the reducer meets the end of the coupler. Add the barrel of the launcher. The barrel of the launcher will be made up of the 2-in wide PVC segment. Spread the PVC cement on the inner lip of the reducer and the outer lip of one end of the 2-in wide PVC segment. Slide the barrel into the reducer until it is about even with the base of the coupler. Wait 24 hours for the PVC cement to harden and cure. If you use your potato launcher before the PVC cement has enough time to harden, the launcher may explode. Explosive force in the combustion chamber puts stress on the PVC when you shoot an item. Adding a Spark Generator Drill holes in the combustion chamber for your spark generator. Most spark generators simply emit a spark at one end when a button is pressed. Drill a hole in the combustion chamber just large enough to fit the sparking components of your generator. Some generators may have two prongs across which a spark jumps, or a single double-pronged extension. Many generators require spark-emitting prongs to be within ⁄5 inch (1.0 cm) of each other. Insert the spark generator and attach it with electrical tape. Press the spark emitting parts of the generator into the holes you’ve drilled. Attach the button/trigger for the generator to the combustion chamber with electrical tape, then hook up the leads from the spark generator to the trigger. Connect positive leads (+) to positive terminals on the generator and negative leads ( - ) to the negative terminals. Once the leads and terminals are attached, prevent accidental shocks by covering any bare wiring or components with electrical tape. Check your spark generator by unscrewing the PVC plug from the female adapter. While looking inside the combustion chamber, press the generator trigger several times. If you see a spark, it works. Create a guard for the spark generator. The electrical components of the spark generator can be easily damaged. Make a guard for the generator by cutting a scrap piece of PVC down the middle with a hack saw. Sand away PVC burrs with medium grit sandpaper, then attach the guard over the spark generator with PVC cement or tape. Your guard can be cut short so it only protects the sparking components or longer to cover the leads up to the trigger. Firing the Launcher Insert a spud and open the end PVC plug. Press a spud into the barrel end of the launcher so it fits snugly. Use a stick to push the potato into the base of the barrel. After that, turn over the launcher and unscrew the end PVC plug from the female adaptor. Old fashioned firearms used \"wadding,\" or cloth wrapped around projectiles, to create a better barrel seal and more power. This can also be done with potato guns. A screw inserted into the barrel where it connects to the combustion chamber will prevent the ammunition from being rammed too far and falling into the chamber. Spray propellant into the combustion chamber and reseal the plug. Almost all hairspray will work as a propellant for your launcher. Spray the hairspray into the chamber for about seven seconds and your launcher is primed and ready to go. Reseal the plug quickly and get ready to take aim. Too much propellant is as bad as not enough. If there’s not enough oxygen, ignition will not occur. Trial and error will teach the optimum amount of propellant to use in your individual design. Aim away from people and click the trigger. It may take a few clicks of the trigger before the spark ignites, but when it does the hairspray will explode. This will force the potato out the barrel of the launcher. Now it’s time for target practice. Always operate your potato launcher with caution. Improper or reckless usage could cause harm or property damage.",
  "sentences":[
    " Getting the Pipes Ready Get all your parts ready for assembly.",
    "All the parts necessary for this project can be bought at your local hardware store if you don’t already have them at home.",
    "Some hardware stores may even cut the PVC pipe you’ll need for this project to length as a free service or for a minor fee.",
    "You'll need a 4-in (10.1-cm) wide PVC pipe that's 2 feet (61 cm) long and a 2-in (5-cm) wide PVC pipe that is 5 feet (1.5 m) long.",
    "Only use Schedule 40 PVC pipe.",
    "\"Schedule\" refers to the thickness of the pipe's walls.",
    "Pipe thinner than Sch 40 will be unsafe and could burst under high pressure.",
    "Measure and mark your PVC pieces, if necessary.",
    "If your PVC pipes weren’t cut for you, you’ll need to do it yourself.",
    "Use a felt tipped marker to mark the PVC at the following lengths so they’re ready to be cut:\n4-in (10.1-cm) wide PVC marked at 2 feet (61 cm)\n2-in (5-cm) wide PVC marked at 5 feet (1.5 m) Cut the pipes along the mark using a hacksaw.",
    "It may help to clamp the pipes down to a work bench or have someone hold the pipe on a flat surface as you saw.",
    "The cuts don’t need to be perfect.",
    "Once you’re finished, remove plastic burrs by rubbing the cut edges with a medium grit sandpaper.",
    "Clean the PVC pipes with a rag.",
    "Grit or plastic shavings from cutting the PVC can negatively impact the seal of parts when fitted together.",
    "Take a clean rag and wipe all parts of the PVC clean.",
    "If there are a lot of shavings, use a vacuum cleaner.",
    "Gluing the Launcher Assemble one end of the 4-in wide PVC segment.",
    "Screw a 4-in wide PVC plug into place on the threaded end of the female adapter.",
    "On one end of the 4-in segment, liberally apply PVC cement around the outer lip.",
    "Repeat this process to the inner lip of the PVC female adapter.",
    "Fit the adapter onto the end of the segment.",
    "When you glue the PVC pieces together, hold them together firmly for at least 60 seconds so the glue bonds.",
    "Twist each glue joint a quarter-turn as you are pushing it together.",
    "This will encourage a better seal.",
    "Whenever PVC pieces are glued together, be sure to use a clean towel to wipe away excess glue.",
    "The 4-in wide PVC segment will eventually become the combustion chamber for the launcher.",
    "Attach the coupler to the 4-in wide PVC segment at the opposite end.",
    "Apply PVC cement around the outer lip of the segment and the inner lip of the PVC coupler.",
    "Slide the coupler into place on the end of segment with nothing attached.",
    "Glue the reducer in the coupler.",
    "Apply more PVC cement to the inner lip of the coupler and below the outward flanging collar of the 4- to 2-in reducer.",
    "Nest the reducer in the coupler until the collar of the reducer meets the end of the coupler.",
    "Add the barrel of the launcher.",
    "The barrel of the launcher will be made up of the 2-in wide PVC segment.",
    "Spread the PVC cement on the inner lip of the reducer and the outer lip of one end of the 2-in wide PVC segment.",
    "Slide the barrel into the reducer until it is about even with the base of the coupler.",
    "Wait 24 hours for the PVC cement to harden and cure.",
    "If you use your potato launcher before the PVC cement has enough time to harden, the launcher may explode.",
    "Explosive force in the combustion chamber puts stress on the PVC when you shoot an item.",
    "Adding a Spark Generator Drill holes in the combustion chamber for your spark generator.",
    "Most spark generators simply emit a spark at one end when a button is pressed.",
    "Drill a hole in the combustion chamber just large enough to fit the sparking components of your generator.",
    "Some generators may have two prongs across which a spark jumps, or a single double-pronged extension.",
    "Many generators require spark-emitting prongs to be within ⁄5 inch (1.0 cm) of each other.",
    "Insert the spark generator and attach it with electrical tape.",
    "Press the spark emitting parts of the generator into the holes you’ve drilled.",
    "Attach the button/trigger for the generator to the combustion chamber with electrical tape, then hook up the leads from the spark generator to the trigger.",
    "Connect positive leads (+) to positive terminals on the generator and negative leads ( - ) to the negative terminals.",
    "Once the leads and terminals are attached, prevent accidental shocks by covering any bare wiring or components with electrical tape.",
    "Check your spark generator by unscrewing the PVC plug from the female adapter.",
    "While looking inside the combustion chamber, press the generator trigger several times.",
    "If you see a spark, it works.",
    "Create a guard for the spark generator.",
    "The electrical components of the spark generator can be easily damaged.",
    "Make a guard for the generator by cutting a scrap piece of PVC down the middle with a hack saw.",
    "Sand away PVC burrs with medium grit sandpaper, then attach the guard over the spark generator with PVC cement or tape.",
    "Your guard can be cut short so it only protects the sparking components or longer to cover the leads up to the trigger.",
    "Firing the Launcher Insert a spud and open the end PVC plug.",
    "Press a spud into the barrel end of the launcher so it fits snugly.",
    "Use a stick to push the potato into the base of the barrel.",
    "After that, turn over the launcher and unscrew the end PVC plug from the female adaptor.",
    "Old fashioned firearms used \"wadding,\" or cloth wrapped around projectiles, to create a better barrel seal and more power.",
    "This can also be done with potato guns.",
    "A screw inserted into the barrel where it connects to the combustion chamber will prevent the ammunition from being rammed too far and falling into the chamber.",
    "Spray propellant into the combustion chamber and reseal the plug.",
    "Almost all hairspray will work as a propellant for your launcher.",
    "Spray the hairspray into the chamber for about seven seconds and your launcher is primed and ready to go.",
    "Reseal the plug quickly and get ready to take aim.",
    "Too much propellant is as bad as not enough.",
    "If there’s not enough oxygen, ignition will not occur.",
    "Trial and error will teach the optimum amount of propellant to use in your individual design.",
    "Aim away from people and click the trigger.",
    "It may take a few clicks of the trigger before the spark ignites, but when it does the hairspray will explode.",
    "This will force the potato out the barrel of the launcher.",
    "Now it’s time for target practice.",
    "Always operate your potato launcher with caution.",
    "Improper or reckless usage could cause harm or property damage."
  ],
  "tyn_section":[
    "2-in wide PVC 5 feet (1.5 m) long",
    "4-in wide female PVC adapter",
    "4-in wide PVC coupler",
    "4-in wide threaded PVC plug",
    "4-in to 2-in PVC reducer",
    "4-in wide PVC 2 feet (61 cm) long",
    "Electrical tape",
    "Hacksaw",
    "Hairspray",
    "Power drill (and drill bits)",
    "PVC cement",
    "Sandpaper (medium grit)",
    "Spark generator (available at  most hardware stores)",
    "Vacuum (optional)"
  ],
  "tyn_model":[
    "pvc",
    "pvc cement",
    "spark generator",
    "pvc pipe",
    "glue",
    "electrical tape",
    "hairspray",
    "pvc pipes",
    "medium grit sandpaper",
    "rag",
    "coupler",
    "potato launcher",
    "generator",
    "generators",
    "potato",
    "propellant",
    "felt tipped marker",
    "hacksaw",
    "vacuum cleaner",
    "pvc coupler",
    "spark generators",
    "hack saw",
    "potato guns",
    "oxygen"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.1666666667,
    "f1":0.2105263158,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3571428571,
    "p":0.25,
    "f1":0.2941176471
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4285714286,
    "p":0.375,
    "f1":0.4
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.1666666667,
    "f1":0.2105263158
  }
}