{
  "title":"How to Make Italian Sausage",
  "url":"https://www.wikihow.com/Make-Italian-Sausage",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Sausage"
  ],
  "parts":[
    {
      "name":"Buying Ingredients",
      "steps":[
        {
          "headline":"Buy 5 lbs.",
          "description":"(2.2kg) of pork shoulder. Cut it away from the bone if it is not cut already. You can also make Italian sausage that is part beef and part pork. Replace 2 lbs. (0.9kg) of pork shoulder with ground beef to adjust the recipe."
        },
        {
          "headline":"Buy sausage casings.",
          "description":"Ask whether the casings should be soaked beforehand or not. If the sausage casings require soaking, place them in a bowl of orange juice and salt for 1 hour. Keep them moistened before using them."
        }
      ]
    },
    {
      "name":"Mincing the Meat",
      "steps":[
        {
          "headline":"Cut the 5 lbs (2.2kg) of pork shoulder into small pieces.",
          "description":"Grind the pork (and beef) together using a meat grinder or a meat grinder attachment on your stand mixer."
        },
        {
          "headline":"Place the ground meat in a large bowl.",
          "description":"Add the beef, if you are doing a mixed meat sausage."
        },
        {
          "headline":"Add your spices to the meat.",
          "description":"You will need to decide if you want a sweet or hot Italian sausage. If you want to make a traditional hot Italian sausage then add 2 tsp. (4g) of crushed fennel seed, 1 tbsp. (18g) salt, 1 tbsp. (6.9g) of black pepper, 2 tbsp. (10.8g) of hot pepper flakes and/or cayenne pepper, 1 tbsp. (1.9g) of parsley leaves and 2 to 3 tbsp. (13.8 to 20.7g) of paprika. If you want to make a sweet Italian sausage, then do not add hot pepper flakes, cayenne pepper or the whole measure of black pepper. Add the full 3 tbsp. (20.7g) of paprika."
        },
        {
          "headline":"Put on plastic gloves.",
          "description":"Knead the spices into the meat until it is well combined."
        },
        {
          "headline":"Put plastic wrap over the top of the bowl.",
          "description":"Refrigerate for at least 1 hour."
        }
      ]
    },
    {
      "name":"Making Sausages",
      "steps":[
        {
          "headline":"Coat your sausage stuffing attachment with shortening.",
          "description":"This will help to make the meat move evenly through the attachment."
        },
        {
          "headline":"Tie the end of your casing.",
          "description":"Place it at the bottom of your stuffing attachment."
        },
        {
          "headline":"This portion of the process is best if done by more than 1 person, so that you can load the attachment, twist the sausage and have a smoother process.",
          "description":""
        },
        {
          "headline":"Fill the casing until it is firm.",
          "description":"Try to fill well, so that there are not too many air bubbles."
        },
        {
          "headline":"Tie off the end of the casing when you have only 3 inches (7.6cm) left.",
          "description":"If you are using a traditional intestinal casing, you may want to tie with a string."
        },
        {
          "headline":"Return to the beginning of the casing.",
          "description":"Twist the sausage several times at intervals between 3 and 8 inches (7.6 to 20cm), depending upon how large you want your sausages to be."
        },
        {
          "headline":"Prick each sausage with a pin to remove air bubbles.",
          "description":""
        },
        {
          "headline":"Place sausages in airtight plastic baggies.",
          "description":"Freeze them immediately. Make sure you cook your sausages well before eating, since they are not pre-cooked like many store-bought varieties. Boil them for 10 minutes or grill until the internal temperature is 150 degrees Fahrenheit (65.5 degrees Celsius)."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Buying Ingredients Buy 5 lbs. (2.2kg) of pork shoulder. Cut it away from the bone if it is not cut already. You can also make Italian sausage that is part beef and part pork. Replace 2 lbs. (0.9kg) of pork shoulder with ground beef to adjust the recipe. Buy sausage casings. Ask whether the casings should be soaked beforehand or not. If the sausage casings require soaking, place them in a bowl of orange juice and salt for 1 hour. Keep them moistened before using them. Mincing the Meat Cut the 5 lbs (2.2kg) of pork shoulder into small pieces. Grind the pork (and beef) together using a meat grinder or a meat grinder attachment on your stand mixer. Place the ground meat in a large bowl. Add the beef, if you are doing a mixed meat sausage. Add your spices to the meat. You will need to decide if you want a sweet or hot Italian sausage. If you want to make a traditional hot Italian sausage then add 2 tsp. (4g) of crushed fennel seed, 1 tbsp. (18g) salt, 1 tbsp. (6.9g) of black pepper, 2 tbsp. (10.8g) of hot pepper flakes and/or cayenne pepper, 1 tbsp. (1.9g) of parsley leaves and 2 to 3 tbsp. (13.8 to 20.7g) of paprika. If you want to make a sweet Italian sausage, then do not add hot pepper flakes, cayenne pepper or the whole measure of black pepper. Add the full 3 tbsp. (20.7g) of paprika. Put on plastic gloves. Knead the spices into the meat until it is well combined. Put plastic wrap over the top of the bowl. Refrigerate for at least 1 hour. Making Sausages Coat your sausage stuffing attachment with shortening. This will help to make the meat move evenly through the attachment. Tie the end of your casing. Place it at the bottom of your stuffing attachment. This portion of the process is best if done by more than 1 person, so that you can load the attachment, twist the sausage and have a smoother process.  Fill the casing until it is firm. Try to fill well, so that there are not too many air bubbles. Tie off the end of the casing when you have only 3 inches (7.6cm) left. If you are using a traditional intestinal casing, you may want to tie with a string. Return to the beginning of the casing. Twist the sausage several times at intervals between 3 and 8 inches (7.6 to 20cm), depending upon how large you want your sausages to be. Prick each sausage with a pin to remove air bubbles.  Place sausages in airtight plastic baggies. Freeze them immediately. Make sure you cook your sausages well before eating, since they are not pre-cooked like many store-bought varieties. Boil them for 10 minutes or grill until the internal temperature is 150 degrees Fahrenheit (65.5 degrees Celsius). Finished. ",
  "sentences":[
    " Buying Ingredients Buy 5 lbs.",
    "(2.2kg) of pork shoulder.",
    "Cut it away from the bone if it is not cut already.",
    "You can also make Italian sausage that is part beef and part pork.",
    "Replace 2 lbs.",
    "(0.9kg) of pork shoulder with ground beef to adjust the recipe.",
    "Buy sausage casings.",
    "Ask whether the casings should be soaked beforehand or not.",
    "If the sausage casings require soaking, place them in a bowl of orange juice and salt for 1 hour.",
    "Keep them moistened before using them.",
    "Mincing the Meat Cut the 5 lbs (2.2kg) of pork shoulder into small pieces.",
    "Grind the pork (and beef) together using a meat grinder or a meat grinder attachment on your stand mixer.",
    "Place the ground meat in a large bowl.",
    "Add the beef, if you are doing a mixed meat sausage.",
    "Add your spices to the meat.",
    "You will need to decide if you want a sweet or hot Italian sausage.",
    "If you want to make a traditional hot Italian sausage then add 2 tsp.",
    "(4g) of crushed fennel seed, 1 tbsp.",
    "(18g) salt, 1 tbsp.",
    "(6.9g) of black pepper, 2 tbsp.",
    "(10.8g) of hot pepper flakes and/or cayenne pepper, 1 tbsp.",
    "(1.9g) of parsley leaves and 2 to 3 tbsp.",
    "(13.8 to 20.7g) of paprika.",
    "If you want to make a sweet Italian sausage, then do not add hot pepper flakes, cayenne pepper or the whole measure of black pepper.",
    "Add the full 3 tbsp.",
    "(20.7g) of paprika.",
    "Put on plastic gloves.",
    "Knead the spices into the meat until it is well combined.",
    "Put plastic wrap over the top of the bowl.",
    "Refrigerate for at least 1 hour.",
    "Making Sausages Coat your sausage stuffing attachment with shortening.",
    "This will help to make the meat move evenly through the attachment.",
    "Tie the end of your casing.",
    "Place it at the bottom of your stuffing attachment.",
    "This portion of the process is best if done by more than 1 person, so that you can load the attachment, twist the sausage and have a smoother process.",
    "Fill the casing until it is firm.",
    "Try to fill well, so that there are not too many air bubbles.",
    "Tie off the end of the casing when you have only 3 inches (7.6cm) left.",
    "If you are using a traditional intestinal casing, you may want to tie with a string.",
    "Return to the beginning of the casing.",
    "Twist the sausage several times at intervals between 3 and 8 inches (7.6 to 20cm), depending upon how large you want your sausages to be.",
    "Prick each sausage with a pin to remove air bubbles.",
    "Place sausages in airtight plastic baggies.",
    "Freeze them immediately.",
    "Make sure you cook your sausages well before eating, since they are not pre-cooked like many store-bought varieties.",
    "Boil them for 10 minutes or grill until the internal temperature is 150 degrees Fahrenheit (65.5 degrees Celsius).",
    "Finished."
  ],
  "tyn_section":[
    "Pork shoulder",
    "Ground beef (optional)",
    "Sausage casings",
    "Orange juice",
    "Water",
    "Salt",
    "Red pepper flakes",
    "Black pepper",
    "Fennel seed",
    "Paprika",
    "Parsley",
    "Meat grinder",
    "Knife",
    "Stuffing attachment (for mixer or meat grinder)",
    "Measuring spoons",
    "Bowl",
    "Plastic gloves",
    "Plastic wrap",
    "Freezer bags",
    "Pin",
    "String"
  ],
  "tyn_model":[
    "pork shoulder",
    "salt",
    "beef",
    "meat grinder",
    "spices",
    "black pepper",
    "hot pepper",
    "cayenne pepper",
    "paprika",
    "sausage",
    "ground beef",
    "sausage casings",
    "orange juice",
    "pork",
    "stand mixer",
    "large bowl",
    "fennel seed",
    "parsley",
    "plastic gloves",
    "plastic wrap",
    "bowl",
    "sausage stuffing",
    "shortening",
    "string",
    "airtight plastic baggies",
    "grill"
  ],
  "simple_metrics":{
    "r":0.619047619,
    "p":0.5,
    "f1":0.5531914894,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.6538461538,
    "f1":0.6601941748
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.8076923077,
    "f1":0.7304347826
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.5384615385,
    "f1":0.5957446809
  }
}