{
  "title":"How to Use Fondant",
  "url":"https://www.wikihow.com/Use-Fondant",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Covering a Cake with Fondant",
      "steps":[
        {
          "headline":"Apply a crumb coat to the cake so that the fondant sticks to the surface.",
          "description":"Make the icing as even as possible, keeping the coating around ⁄4–⁄2 inch (0.64–1.27 cm) thick on the top and sides of the cake. Try to make the icing as smooth as you can so that there are no bumps or ridges when you add the fondant. In general, the icing doesn’t have to look perfect, since people won’t really be able to see it when they look at the cake. As long as it tastes yummy, your cake will be great!"
        },
        {
          "headline":"Knead the fondant until it’s soft and pliable.",
          "description":"Work the dusted fondant between your hands and the surface of the counter. Press, pull, squeeze, and roll the dough to warm it up and make it easier to use. If you’re using store bought fondant, check the packaging to see approximately how long you should knead the icing. When the fondant is ready, it will be warm and easy to stretch. If it’s soft and sticky, let it harden and try kneading it again to get it to the perfect consistency."
        },
        {
          "headline":"Roll out the fondant with a rolling pin.",
          "description":"When your fondant is pliable, roll it out into a sheet that is large enough to cover the top and sides of the cake. Make the sheet around ⁄4 inch (1.9 cm) thick so that it won’t tear or crack when you handle it. Remember to flip the fondant over and roll both sides to ensure that it’s smooth. If you want to ensure that your fondant is an even width, use a spacer attachment on your rolling pin, or set up spacer bars on your workspace before you begin rolling it out. These will keep your rolling pin at a level height and prevent dents and dips in the icing."
        },
        {
          "headline":"Rest the fondant sheet over the rolling pin to transport it.",
          "description":"Make sure the cake is completely cool, and then use your hands to carefully lift the fondant over your rolling pin. Try to wrap it around the rolling pin slightly, if possible, so that it doesn’t rip or wrinkle. Hold the rolling pin with one hand and support the hanging edges of the fondant with the other. Using a rolling pin will make applying the fondant to the cake easier. If you don’t have a rolling pin available, you can use any smooth, cylindrical object, like a tall vase or cup."
        },
        {
          "headline":"Drape the fondant over the top of the cake.",
          "description":"Hold the rolling pin at the side of the top of the cake so that some of the fondant is hanging over one side of the cake. Then, slowly roll the pin to the uncovered side of the cake, unrolling the fondant so that it loosely covers the sides and top all around the cake. When you drape it, the fondant should be smooth along the top and looser around the sides of the cake."
        },
        {
          "headline":"Use your hands and a smoother to adhere the fondant to the icing.",
          "description":"Starting at the top of the cake, rub the smoother along the fondant with light pressure to remove any bubbles and ensure that it’s stuck to the icing. Then, gently pull the fondant away from the sides of the cake, and use your hands to smooth it around the sides so that there are no creases or ridges. Remember to go around the sides of the cake with the smoothing tool to make sure everything is flat. Be careful not to pull too hard on the fondant, or it can rip. Stretch the fondant gently so that you can carefully smooth it down without creasing."
        },
        {
          "headline":"Trim the excess fondant around the base of the cake.",
          "description":"Use a specialty fondant trimmer or pizza cutter to roll around the bottom edge of the cake. Pull away the excess fondant so you have a clean, smooth line where the sides of the cake meet the tray or plate. Work in small sections at a time to ensure you don’t pull the fondant away from the icing. If you have some creasing at the bottom edge of the cake, you can carefully smooth it out with your fingers."
        }
      ]
    },
    {
      "name":"Decorating with Fondant",
      "steps":[
        {
          "headline":"Use a cookie cutter to make simple shapes, like hearts and flowers.",
          "description":"Once you have a sheet of fondant, simply press the cookie cutter into the sheet and lift it up gently. Try to space your cookie cutter shapes as close together as possible to avoid wasting fondant, working in rows to use as much as possible. If the shape is inside of the cutter, gently press it out onto the counter using your fingers or the back of a paintbrush. If the shape is still in the fondant, lift the fondant and pick up the shape to set it aside. These shapes are ideal for decorating the surface of a cake. Simple Cutouts for Decorating\nCelestial shapes: Moon, sun, stars and rainbows. Animals: Rabbits, cats, dogs, sheep, cows, horses, chickens, rabbits. Plants: Flowers, trees, grass, vines. Geometric shapes: Triangles, squares, circles, hexagons."
        },
        {
          "headline":"Roll fondant into 3D shapes in your hands to make figures.",
          "description":"Tear or cut off a piece of your kneaded fondant, and use your hands to shape it. Try making a simple ball for the base of the shape, and working around the ball to add more shapes to form the figure. Use tools to add texture to make it realistic. With a little practice, it’s fairly easy to make fondant flowers and even animals or cartoon people. Basic 3D Shapes\nTeardrop: Roll one end of a ball back and forth until it becomes elongated and thinner than the other end. Cone: Make a teardrop shape and then cut off the rounded end of the ball or flatten it against a hard surface. Cylinder: Roll the ball back and forth between your hands, pressing on the sides until they flatten slightly. Then, cut off the rounded ends or press them against a hard surface."
        },
        {
          "headline":"Press fondant into molds to make uniform 3D shapes.",
          "description":"Roll the fondant until it is approximately the same size and shape as the mold that you’re using. Then, push the fondant firmly into the mold and smooth the back. Carefully use a knife to cut off any excess icing and make the fondant flush with the mold. To remove it, push on the outside of the mold or tap the mold on the table. If your fondant is sticky, dust the inside of the mold with powdered sugar to make it easier to remove the shape."
        },
        {
          "headline":"Brush vodka on the cake so the fondant sticks to the desired area.",
          "description":"While fondant is naturally sticky, vodka helps the icing to stay in place. Use a clean paint brush to apply small dabs to the areas where you’ll be sticking the fondant decorations just before placing them on the cake. Even if your cake already has a crumb coating of icing or other decorations, this will help the fondant stay in place for as long as you need. If you don’t want to use alcohol to make the fondant stick, you can use small dabs of clear gel icing or water."
        }
      ]
    },
    {
      "name":"Avoiding Common Problems",
      "steps":[
        {
          "headline":"Coat your hands in cornstarch before handling fondant so you don't leave fingerprints.",
          "description":"If you don’t have cornstarch available, use powdered sugar instead. Then, use your hands to smooth and shape the fondant without leaving fingerprints. After you’ve smoothed the fondant, you can dust off the cornstarch with a clean paper towel or even a soft, dry paint brush."
        },
        {
          "headline":"Dust your fondant with powdered sugar to keep it from sticking to surfaces.",
          "description":"Pour a small amount of powdered sugar over the fondant, and spread a light coating over your work surface. Use a brush or your hands to coat the ball of fondant and the counter. Fondant is made of sugar, so adding a bit more won’t change the flavor or texture. If you find that the fondant sticks to the surface as you’re working, you can add more powdered sugar. Alternatively, you can use a light dusting of corn starch for the same effect. However, you won’t be able to apply more cornstarch after the initial application, since it can give the fondant a gritty texture."
        },
        {
          "headline":"Keep excess fondant wrapped in plastic to prevent drying and crumbling.",
          "description":"If fondant is left in the air for too long, it will harden and go bad. Only knead as much fondant as you can use within 30-45 minutes, and wrap the remainder in plastic to keep it moist and clean. Once the fondant hardens, you won’t be able to use it. Some people keep their fondant in airtight containers and store them in the refrigerator while they work. If you do this, you may have to knead for a longer period of time."
        },
        {
          "headline":"Repair small tears in the fondant by rubbing shortening on the area.",
          "description":"Coat 1-2 fingers in a small amount of shortening, and then run them along the tear. Use your fingers to slightly pinch the fondant together and smooth it out. This will help repair the hole and keep it from tearing further. Never use water to fix a tear, as it can cause the sugar in the fondant to dissolve, making the tear worse."
        }
      ]
    }
  ],
  "text":" Covering a Cake with Fondant Apply a crumb coat to the cake so that the fondant sticks to the surface. Make the icing as even as possible, keeping the coating around ⁄4–⁄2 inch (0.64–1.27 cm) thick on the top and sides of the cake. Try to make the icing as smooth as you can so that there are no bumps or ridges when you add the fondant. In general, the icing doesn’t have to look perfect, since people won’t really be able to see it when they look at the cake. As long as it tastes yummy, your cake will be great! Knead the fondant until it’s soft and pliable. Work the dusted fondant between your hands and the surface of the counter. Press, pull, squeeze, and roll the dough to warm it up and make it easier to use. If you’re using store bought fondant, check the packaging to see approximately how long you should knead the icing. When the fondant is ready, it will be warm and easy to stretch. If it’s soft and sticky, let it harden and try kneading it again to get it to the perfect consistency. Roll out the fondant with a rolling pin. When your fondant is pliable, roll it out into a sheet that is large enough to cover the top and sides of the cake. Make the sheet around ⁄4 inch (1.9 cm) thick so that it won’t tear or crack when you handle it. Remember to flip the fondant over and roll both sides to ensure that it’s smooth. If you want to ensure that your fondant is an even width, use a spacer attachment on your rolling pin, or set up spacer bars on your workspace before you begin rolling it out. These will keep your rolling pin at a level height and prevent dents and dips in the icing. Rest the fondant sheet over the rolling pin to transport it. Make sure the cake is completely cool, and then use your hands to carefully lift the fondant over your rolling pin. Try to wrap it around the rolling pin slightly, if possible, so that it doesn’t rip or wrinkle. Hold the rolling pin with one hand and support the hanging edges of the fondant with the other. Using a rolling pin will make applying the fondant to the cake easier. If you don’t have a rolling pin available, you can use any smooth, cylindrical object, like a tall vase or cup. Drape the fondant over the top of the cake. Hold the rolling pin at the side of the top of the cake so that some of the fondant is hanging over one side of the cake. Then, slowly roll the pin to the uncovered side of the cake, unrolling the fondant so that it loosely covers the sides and top all around the cake. When you drape it, the fondant should be smooth along the top and looser around the sides of the cake. Use your hands and a smoother to adhere the fondant to the icing. Starting at the top of the cake, rub the smoother along the fondant with light pressure to remove any bubbles and ensure that it’s stuck to the icing. Then, gently pull the fondant away from the sides of the cake, and use your hands to smooth it around the sides so that there are no creases or ridges. Remember to go around the sides of the cake with the smoothing tool to make sure everything is flat. Be careful not to pull too hard on the fondant, or it can rip. Stretch the fondant gently so that you can carefully smooth it down without creasing. Trim the excess fondant around the base of the cake. Use a specialty fondant trimmer or pizza cutter to roll around the bottom edge of the cake. Pull away the excess fondant so you have a clean, smooth line where the sides of the cake meet the tray or plate. Work in small sections at a time to ensure you don’t pull the fondant away from the icing. If you have some creasing at the bottom edge of the cake, you can carefully smooth it out with your fingers. Decorating with Fondant Use a cookie cutter to make simple shapes, like hearts and flowers. Once you have a sheet of fondant, simply press the cookie cutter into the sheet and lift it up gently. Try to space your cookie cutter shapes as close together as possible to avoid wasting fondant, working in rows to use as much as possible. If the shape is inside of the cutter, gently press it out onto the counter using your fingers or the back of a paintbrush. If the shape is still in the fondant, lift the fondant and pick up the shape to set it aside. These shapes are ideal for decorating the surface of a cake. Simple Cutouts for Decorating\nCelestial shapes: Moon, sun, stars and rainbows. Animals: Rabbits, cats, dogs, sheep, cows, horses, chickens, rabbits. Plants: Flowers, trees, grass, vines. Geometric shapes: Triangles, squares, circles, hexagons. Roll fondant into 3D shapes in your hands to make figures. Tear or cut off a piece of your kneaded fondant, and use your hands to shape it. Try making a simple ball for the base of the shape, and working around the ball to add more shapes to form the figure. Use tools to add texture to make it realistic. With a little practice, it’s fairly easy to make fondant flowers and even animals or cartoon people. Basic 3D Shapes\nTeardrop: Roll one end of a ball back and forth until it becomes elongated and thinner than the other end. Cone: Make a teardrop shape and then cut off the rounded end of the ball or flatten it against a hard surface. Cylinder: Roll the ball back and forth between your hands, pressing on the sides until they flatten slightly. Then, cut off the rounded ends or press them against a hard surface. Press fondant into molds to make uniform 3D shapes. Roll the fondant until it is approximately the same size and shape as the mold that you’re using. Then, push the fondant firmly into the mold and smooth the back. Carefully use a knife to cut off any excess icing and make the fondant flush with the mold. To remove it, push on the outside of the mold or tap the mold on the table. If your fondant is sticky, dust the inside of the mold with powdered sugar to make it easier to remove the shape. Brush vodka on the cake so the fondant sticks to the desired area. While fondant is naturally sticky, vodka helps the icing to stay in place. Use a clean paint brush to apply small dabs to the areas where you’ll be sticking the fondant decorations just before placing them on the cake. Even if your cake already has a crumb coating of icing or other decorations, this will help the fondant stay in place for as long as you need. If you don’t want to use alcohol to make the fondant stick, you can use small dabs of clear gel icing or water. Avoiding Common Problems Coat your hands in cornstarch before handling fondant so you don't leave fingerprints. If you don’t have cornstarch available, use powdered sugar instead. Then, use your hands to smooth and shape the fondant without leaving fingerprints. After you’ve smoothed the fondant, you can dust off the cornstarch with a clean paper towel or even a soft, dry paint brush. Dust your fondant with powdered sugar to keep it from sticking to surfaces. Pour a small amount of powdered sugar over the fondant, and spread a light coating over your work surface. Use a brush or your hands to coat the ball of fondant and the counter. Fondant is made of sugar, so adding a bit more won’t change the flavor or texture. If you find that the fondant sticks to the surface as you’re working, you can add more powdered sugar. Alternatively, you can use a light dusting of corn starch for the same effect. However, you won’t be able to apply more cornstarch after the initial application, since it can give the fondant a gritty texture. Keep excess fondant wrapped in plastic to prevent drying and crumbling. If fondant is left in the air for too long, it will harden and go bad. Only knead as much fondant as you can use within 30-45 minutes, and wrap the remainder in plastic to keep it moist and clean. Once the fondant hardens, you won’t be able to use it. Some people keep their fondant in airtight containers and store them in the refrigerator while they work. If you do this, you may have to knead for a longer period of time. Repair small tears in the fondant by rubbing shortening on the area. Coat 1-2 fingers in a small amount of shortening, and then run them along the tear. Use your fingers to slightly pinch the fondant together and smooth it out. This will help repair the hole and keep it from tearing further. Never use water to fix a tear, as it can cause the sugar in the fondant to dissolve, making the tear worse.",
  "sentences":[
    " Covering a Cake with Fondant Apply a crumb coat to the cake so that the fondant sticks to the surface.",
    "Make the icing as even as possible, keeping the coating around ⁄4–⁄2 inch (0.64–1.27 cm) thick on the top and sides of the cake.",
    "Try to make the icing as smooth as you can so that there are no bumps or ridges when you add the fondant.",
    "In general, the icing doesn’t have to look perfect, since people won’t really be able to see it when they look at the cake.",
    "As long as it tastes yummy, your cake will be great!",
    "Knead the fondant until it’s soft and pliable.",
    "Work the dusted fondant between your hands and the surface of the counter.",
    "Press, pull, squeeze, and roll the dough to warm it up and make it easier to use.",
    "If you’re using store bought fondant, check the packaging to see approximately how long you should knead the icing.",
    "When the fondant is ready, it will be warm and easy to stretch.",
    "If it’s soft and sticky, let it harden and try kneading it again to get it to the perfect consistency.",
    "Roll out the fondant with a rolling pin.",
    "When your fondant is pliable, roll it out into a sheet that is large enough to cover the top and sides of the cake.",
    "Make the sheet around ⁄4 inch (1.9 cm) thick so that it won’t tear or crack when you handle it.",
    "Remember to flip the fondant over and roll both sides to ensure that it’s smooth.",
    "If you want to ensure that your fondant is an even width, use a spacer attachment on your rolling pin, or set up spacer bars on your workspace before you begin rolling it out.",
    "These will keep your rolling pin at a level height and prevent dents and dips in the icing.",
    "Rest the fondant sheet over the rolling pin to transport it.",
    "Make sure the cake is completely cool, and then use your hands to carefully lift the fondant over your rolling pin.",
    "Try to wrap it around the rolling pin slightly, if possible, so that it doesn’t rip or wrinkle.",
    "Hold the rolling pin with one hand and support the hanging edges of the fondant with the other.",
    "Using a rolling pin will make applying the fondant to the cake easier.",
    "If you don’t have a rolling pin available, you can use any smooth, cylindrical object, like a tall vase or cup.",
    "Drape the fondant over the top of the cake.",
    "Hold the rolling pin at the side of the top of the cake so that some of the fondant is hanging over one side of the cake.",
    "Then, slowly roll the pin to the uncovered side of the cake, unrolling the fondant so that it loosely covers the sides and top all around the cake.",
    "When you drape it, the fondant should be smooth along the top and looser around the sides of the cake.",
    "Use your hands and a smoother to adhere the fondant to the icing.",
    "Starting at the top of the cake, rub the smoother along the fondant with light pressure to remove any bubbles and ensure that it’s stuck to the icing.",
    "Then, gently pull the fondant away from the sides of the cake, and use your hands to smooth it around the sides so that there are no creases or ridges.",
    "Remember to go around the sides of the cake with the smoothing tool to make sure everything is flat.",
    "Be careful not to pull too hard on the fondant, or it can rip.",
    "Stretch the fondant gently so that you can carefully smooth it down without creasing.",
    "Trim the excess fondant around the base of the cake.",
    "Use a specialty fondant trimmer or pizza cutter to roll around the bottom edge of the cake.",
    "Pull away the excess fondant so you have a clean, smooth line where the sides of the cake meet the tray or plate.",
    "Work in small sections at a time to ensure you don’t pull the fondant away from the icing.",
    "If you have some creasing at the bottom edge of the cake, you can carefully smooth it out with your fingers.",
    "Decorating with Fondant Use a cookie cutter to make simple shapes, like hearts and flowers.",
    "Once you have a sheet of fondant, simply press the cookie cutter into the sheet and lift it up gently.",
    "Try to space your cookie cutter shapes as close together as possible to avoid wasting fondant, working in rows to use as much as possible.",
    "If the shape is inside of the cutter, gently press it out onto the counter using your fingers or the back of a paintbrush.",
    "If the shape is still in the fondant, lift the fondant and pick up the shape to set it aside.",
    "These shapes are ideal for decorating the surface of a cake.",
    "Simple Cutouts for Decorating\nCelestial shapes: Moon, sun, stars and rainbows.",
    "Animals: Rabbits, cats, dogs, sheep, cows, horses, chickens, rabbits.",
    "Plants: Flowers, trees, grass, vines.",
    "Geometric shapes: Triangles, squares, circles, hexagons.",
    "Roll fondant into 3D shapes in your hands to make figures.",
    "Tear or cut off a piece of your kneaded fondant, and use your hands to shape it.",
    "Try making a simple ball for the base of the shape, and working around the ball to add more shapes to form the figure.",
    "Use tools to add texture to make it realistic.",
    "With a little practice, it’s fairly easy to make fondant flowers and even animals or cartoon people.",
    "Basic 3D Shapes\nTeardrop: Roll one end of a ball back and forth until it becomes elongated and thinner than the other end.",
    "Cone: Make a teardrop shape and then cut off the rounded end of the ball or flatten it against a hard surface.",
    "Cylinder: Roll the ball back and forth between your hands, pressing on the sides until they flatten slightly.",
    "Then, cut off the rounded ends or press them against a hard surface.",
    "Press fondant into molds to make uniform 3D shapes.",
    "Roll the fondant until it is approximately the same size and shape as the mold that you’re using.",
    "Then, push the fondant firmly into the mold and smooth the back.",
    "Carefully use a knife to cut off any excess icing and make the fondant flush with the mold.",
    "To remove it, push on the outside of the mold or tap the mold on the table.",
    "If your fondant is sticky, dust the inside of the mold with powdered sugar to make it easier to remove the shape.",
    "Brush vodka on the cake so the fondant sticks to the desired area.",
    "While fondant is naturally sticky, vodka helps the icing to stay in place.",
    "Use a clean paint brush to apply small dabs to the areas where you’ll be sticking the fondant decorations just before placing them on the cake.",
    "Even if your cake already has a crumb coating of icing or other decorations, this will help the fondant stay in place for as long as you need.",
    "If you don’t want to use alcohol to make the fondant stick, you can use small dabs of clear gel icing or water.",
    "Avoiding Common Problems Coat your hands in cornstarch before handling fondant so you don't leave fingerprints.",
    "If you don’t have cornstarch available, use powdered sugar instead.",
    "Then, use your hands to smooth and shape the fondant without leaving fingerprints.",
    "After you’ve smoothed the fondant, you can dust off the cornstarch with a clean paper towel or even a soft, dry paint brush.",
    "Dust your fondant with powdered sugar to keep it from sticking to surfaces.",
    "Pour a small amount of powdered sugar over the fondant, and spread a light coating over your work surface.",
    "Use a brush or your hands to coat the ball of fondant and the counter.",
    "Fondant is made of sugar, so adding a bit more won’t change the flavor or texture.",
    "If you find that the fondant sticks to the surface as you’re working, you can add more powdered sugar.",
    "Alternatively, you can use a light dusting of corn starch for the same effect.",
    "However, you won’t be able to apply more cornstarch after the initial application, since it can give the fondant a gritty texture.",
    "Keep excess fondant wrapped in plastic to prevent drying and crumbling.",
    "If fondant is left in the air for too long, it will harden and go bad.",
    "Only knead as much fondant as you can use within 30-45 minutes, and wrap the remainder in plastic to keep it moist and clean.",
    "Once the fondant hardens, you won’t be able to use it.",
    "Some people keep their fondant in airtight containers and store them in the refrigerator while they work.",
    "If you do this, you may have to knead for a longer period of time.",
    "Repair small tears in the fondant by rubbing shortening on the area.",
    "Coat 1-2 fingers in a small amount of shortening, and then run them along the tear.",
    "Use your fingers to slightly pinch the fondant together and smooth it out.",
    "This will help repair the hole and keep it from tearing further.",
    "Never use water to fix a tear, as it can cause the sugar in the fondant to dissolve, making the tear worse."
  ],
  "tyn_section":[
    "Fondant (any variety)",
    "Powdered sugar or cornstarch",
    "Vodka",
    "Rolling pin",
    "Fondant trimmer or pizza cutter",
    "Cookie cutter (optional)",
    "Shortening",
    "Paint brush or knife",
    "Cake or pastry"
  ],
  "tyn_model":[
    "fondant",
    "rolling pin",
    "icing",
    "cake",
    "powdered sugar",
    "cookie cutter",
    "vodka",
    "water",
    "cornstarch",
    "sugar",
    "crumb coat",
    "smoother",
    "smoothing tool",
    "pizza cutter",
    "tray",
    "plate",
    "rabbits",
    "cylinder",
    "knife",
    "fondant decorations",
    "alcohol",
    "clear gel icing",
    "paint brush",
    "corn starch",
    "plastic",
    "shortening"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.1153846154,
    "f1":0.1714285714,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.2307692308,
    "f1":0.3428571429
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.3461538462,
    "f1":0.5142857143
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4444444444,
    "p":0.1538461538,
    "f1":0.2285714286
  }
}