{
  "title":"How to Make Juice Recipes",
  "url":"https://www.wikihow.com/Make-Juice-Recipes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Juice"
  ],
  "methods":[
    {
      "name":"Preparing Green Goddess Juice",
      "steps":[
        {
          "headline":"Cut the cucumber, apple, and pear.",
          "description":"For the juice, you’ll need 3 celery stalks, ½ large cucumber, 1 medium green apple, and 1 medium pear. To fit them through the juicer easier, it helps to cut them. Use a sharp knife to cut the cucumber into quarters, the apple cut into eighths, and the pear into eighths. It usually isn’t necessary to cut the celery stalks before you add them to the juicer, but you can chop them into smaller pieces if you prefer."
        },
        {
          "headline":"Run all of the ingredients through your juicer.",
          "description":"After you’ve cut up the produce, turn your juicer on. Process the celery stalks, cucumber, apple, and pear through the juicer according to the manufacturer’s instructions in succession so all of the juices are combined. While the juices will be combined in the juicer’s receptacle, it’s a good idea to stir the mixture with a spoon to ensure that they’re completely blended."
        },
        {
          "headline":"Serve the juice at room temperature or chilled.",
          "description":"When all of the juices are blended, pour the mixture into a glass and drink at room temperature. If you prefer, you can chill the juice in the fridge before drinking. The recipe makes 12 ounces (355 ml) so make sure that you have a large enough glass or cup."
        }
      ]
    },
    {
      "name":"Whipping Up Pomegranate-Citrus Juice",
      "steps":[
        {
          "headline":"Juice the grapefruits, oranges, tangerines, and lime.",
          "description":"For the juice, you’ll need 2 small grapefruits, 2 oranges, 2 tangerines, and half a lime. Run the fruits through a juicer according to the manufacturer's instructions in succession so all of the juices are combined. Stir the mixture with a spoon to ensure that all of the juices are combined. If you don’t have a juicer, you can use a citrus press to juice the grapefruit, oranges, tangerines, and lime."
        },
        {
          "headline":"Expel the juice from the pomegranates into a separate bowl.",
          "description":"After you’ve juiced the citrus fruits, run 2 pomegranates through the juicer. Make sure to expel the juice into a separate container from the bowl that’s holding the citrus juices, though."
        },
        {
          "headline":"Pour the citrus juice into glasses and top with the pomegranate juice.",
          "description":"After you’ve juiced all of the fruits, divide the citrus juice evenly between three glasses. Next, pour some of the pomegranate juice into each glass, where it will sink to the bottom. Serve the juice at room temperature. If you prefer, you can chill the juices for an hour or two in the refrigerator before combining them."
        }
      ]
    },
    {
      "name":"Mixing Up Cilantro Apple Green Juice",
      "steps":[
        {
          "headline":"Cut the apples and cucumber.",
          "description":"For the juice, you’ll need 2 green apples, 2 stalks of celery, 2 large kale leaves, 1 medium cucumber, ¼ cup (15 g) fresh cilantro, and half a peeled lemon. To make it easier to run them through the juicer, use a sharp knife to cut the apples into eighths and the cucumber into quarters. It’s not necessary, but you can also roughly chop the kale and fresh cilantro if you prefer."
        },
        {
          "headline":"Process each ingredient through the juicer separately.",
          "description":"After you’ve cut the apples and cucumbers, run each ingredient through the juicer separately according to the manufacturer’s instructions. Make sure that you have separate containers for each juice."
        },
        {
          "headline":"Pour the juices together and stir well.",
          "description":"Once you’ve juiced all of the ingredients, pour all of the juices into a large measuring cup. Use a spoon to stir all of them together so they’re fully blended. If you like, you can chill the juice after you’ve mixed them together."
        },
        {
          "headline":"Serve the juice immediately.",
          "description":"When the juice is fully mixed, pour it into a large glass. Drink the glass at room temperature or chilled depending on your preference."
        }
      ]
    },
    {
      "name":"Creating Antioxidant Blast Juice",
      "steps":[
        {
          "headline":"Cut the beets into quarters.",
          "description":"For the juice, you’ll need 2 medium beets, 1 cup (100 g) of blueberries, and 1 cup (100 g) of halved, hulled strawberries. To make it easier to run them through the juicer, though, use a sharp knife to quarter the beets. If the strawberries are large, you may want to cut them into quarters as well."
        },
        {
          "headline":"Run all of the ingredients through a juicer.",
          "description":"After you’ve cut the beets, run them through a juicer according to the manufacturer’s instructions. Juice the blueberries and strawberries immediately afterward, collecting the juice in the same container. While the juices will be combined in the juicer’s receptacle, it’s a good idea to stir them with a spoon to ensure that they’re fully mixed."
        },
        {
          "headline":"Chill the juice for an hour before serving.",
          "description":"Once all of the juices are combined, cover the container and chill in the refrigerator for an hour. Next, pour the juice into a large glass and serve."
        }
      ]
    },
    {
      "name":"Making Vegetable Juice",
      "steps":[
        {
          "headline":"Run the tomatoes, celery, carrots, and horseradish through a juicer.",
          "description":"For the juice, you’ll need 3 medium tomatoes that are cut into large chunks, 7 celery stalks cut into 3-inch (7.5-cm) pieces, ½ pound (225 g) of carrots that are cut into 3-inch (7.5-cm) pieces, and a piece of fresh horseradish that’s 2 ½ by ¼ inches (64 by 6 millimeters). Juice all of the ingredients into a single container according to your juicer’s manufacturer instructions. Stir all of the juices together with a spoon to ensure that they’re fully blended."
        },
        {
          "headline":"Mix in the salt and lemon juice.",
          "description":"Once the juices are mixed, add ¼ teaspoon (1 ½ g) of coarse salt and 2 ½ teaspoons (12 ½ ml) of freshly squeezed lemon juice into the container. Stir well to ensure that the salt and juice are fully incorporated. You can adjust the amount of salt and lemon juice to suit your tastes."
        },
        {
          "headline":"Strain the juice.",
          "description":"After all of the ingredients are mixed, pour the mixture through a fine mesh sieve into a large pitcher. Shake the sieve well to ensure you get all of the juice separated from any solid pieces."
        },
        {
          "headline":"Pour the juice into glasses and garnish with lemon wedges.",
          "description":"When the juice is strained, divide it evenly between two glasses. Press a lemon wedge onto the side of each glass and serve. You can float the lemon wedge in the juice if you prefer."
        }
      ]
    }
  ],
  "text":" Preparing Green Goddess Juice Cut the cucumber, apple, and pear. For the juice, you’ll need 3 celery stalks, ½ large cucumber, 1 medium green apple, and 1 medium pear. To fit them through the juicer easier, it helps to cut them. Use a sharp knife to cut the cucumber into quarters, the apple cut into eighths, and the pear into eighths. It usually isn’t necessary to cut the celery stalks before you add them to the juicer, but you can chop them into smaller pieces if you prefer. Run all of the ingredients through your juicer. After you’ve cut up the produce, turn your juicer on. Process the celery stalks, cucumber, apple, and pear through the juicer according to the manufacturer’s instructions in succession so all of the juices are combined. While the juices will be combined in the juicer’s receptacle, it’s a good idea to stir the mixture with a spoon to ensure that they’re completely blended. Serve the juice at room temperature or chilled. When all of the juices are blended, pour the mixture into a glass and drink at room temperature. If you prefer, you can chill the juice in the fridge before drinking. The recipe makes 12 ounces (355 ml) so make sure that you have a large enough glass or cup. Whipping Up Pomegranate-Citrus Juice Juice the grapefruits, oranges, tangerines, and lime. For the juice, you’ll need 2 small grapefruits, 2 oranges, 2 tangerines, and half a lime. Run the fruits through a juicer according to the manufacturer's instructions in succession so all of the juices are combined. Stir the mixture with a spoon to ensure that all of the juices are combined. If you don’t have a juicer, you can use a citrus press to juice the grapefruit, oranges, tangerines, and lime. Expel the juice from the pomegranates into a separate bowl. After you’ve juiced the citrus fruits, run 2 pomegranates through the juicer. Make sure to expel the juice into a separate container from the bowl that’s holding the citrus juices, though. Pour the citrus juice into glasses and top with the pomegranate juice. After you’ve juiced all of the fruits, divide the citrus juice evenly between three glasses. Next, pour some of the pomegranate juice into each glass, where it will sink to the bottom. Serve the juice at room temperature. If you prefer, you can chill the juices for an hour or two in the refrigerator before combining them. Mixing Up Cilantro Apple Green Juice Cut the apples and cucumber. For the juice, you’ll need 2 green apples, 2 stalks of celery, 2 large kale leaves, 1 medium cucumber, ¼ cup (15 g) fresh cilantro, and half a peeled lemon. To make it easier to run them through the juicer, use a sharp knife to cut the apples into eighths and the cucumber into quarters. It’s not necessary, but you can also roughly chop the kale and fresh cilantro if you prefer. Process each ingredient through the juicer separately. After you’ve cut the apples and cucumbers, run each ingredient through the juicer separately according to the manufacturer’s instructions. Make sure that you have separate containers for each juice. Pour the juices together and stir well. Once you’ve juiced all of the ingredients, pour all of the juices into a large measuring cup. Use a spoon to stir all of them together so they’re fully blended. If you like, you can chill the juice after you’ve mixed them together. Serve the juice immediately. When the juice is fully mixed, pour it into a large glass. Drink the glass at room temperature or chilled depending on your preference. Creating Antioxidant Blast Juice Cut the beets into quarters. For the juice, you’ll need 2 medium beets, 1 cup (100 g) of blueberries, and 1 cup (100 g) of halved, hulled strawberries. To make it easier to run them through the juicer, though, use a sharp knife to quarter the beets. If the strawberries are large, you may want to cut them into quarters as well. Run all of the ingredients through a juicer. After you’ve cut the beets, run them through a juicer according to the manufacturer’s instructions. Juice the blueberries and strawberries immediately afterward, collecting the juice in the same container. While the juices will be combined in the juicer’s receptacle, it’s a good idea to stir them with a spoon to ensure that they’re fully mixed. Chill the juice for an hour before serving. Once all of the juices are combined, cover the container and chill in the refrigerator for an hour. Next, pour the juice into a large glass and serve. Making Vegetable Juice Run the tomatoes, celery, carrots, and horseradish through a juicer. For the juice, you’ll need 3 medium tomatoes that are cut into large chunks, 7 celery stalks cut into 3-inch (7.5-cm) pieces, ½ pound (225 g) of carrots that are cut into 3-inch (7.5-cm) pieces, and a piece of fresh horseradish that’s 2 ½ by ¼ inches (64 by 6 millimeters). Juice all of the ingredients into a single container according to your juicer’s manufacturer instructions. Stir all of the juices together with a spoon to ensure that they’re fully blended. Mix in the salt and lemon juice. Once the juices are mixed, add ¼ teaspoon (1 ½ g) of coarse salt and 2 ½ teaspoons (12 ½ ml) of freshly squeezed lemon juice into the container. Stir well to ensure that the salt and juice are fully incorporated. You can adjust the amount of salt and lemon juice to suit your tastes. Strain the juice. After all of the ingredients are mixed, pour the mixture through a fine mesh sieve into a large pitcher. Shake the sieve well to ensure you get all of the juice separated from any solid pieces. Pour the juice into glasses and garnish with lemon wedges. When the juice is strained, divide it evenly between two glasses. Press a lemon wedge onto the side of each glass and serve. You can float the lemon wedge in the juice if you prefer.",
  "sentences":[
    " Preparing Green Goddess Juice Cut the cucumber, apple, and pear.",
    "For the juice, you’ll need 3 celery stalks, ½ large cucumber, 1 medium green apple, and 1 medium pear.",
    "To fit them through the juicer easier, it helps to cut them.",
    "Use a sharp knife to cut the cucumber into quarters, the apple cut into eighths, and the pear into eighths.",
    "It usually isn’t necessary to cut the celery stalks before you add them to the juicer, but you can chop them into smaller pieces if you prefer.",
    "Run all of the ingredients through your juicer.",
    "After you’ve cut up the produce, turn your juicer on.",
    "Process the celery stalks, cucumber, apple, and pear through the juicer according to the manufacturer’s instructions in succession so all of the juices are combined.",
    "While the juices will be combined in the juicer’s receptacle, it’s a good idea to stir the mixture with a spoon to ensure that they’re completely blended.",
    "Serve the juice at room temperature or chilled.",
    "When all of the juices are blended, pour the mixture into a glass and drink at room temperature.",
    "If you prefer, you can chill the juice in the fridge before drinking.",
    "The recipe makes 12 ounces (355 ml) so make sure that you have a large enough glass or cup.",
    "Whipping Up Pomegranate-Citrus Juice Juice the grapefruits, oranges, tangerines, and lime.",
    "For the juice, you’ll need 2 small grapefruits, 2 oranges, 2 tangerines, and half a lime.",
    "Run the fruits through a juicer according to the manufacturer's instructions in succession so all of the juices are combined.",
    "Stir the mixture with a spoon to ensure that all of the juices are combined.",
    "If you don’t have a juicer, you can use a citrus press to juice the grapefruit, oranges, tangerines, and lime.",
    "Expel the juice from the pomegranates into a separate bowl.",
    "After you’ve juiced the citrus fruits, run 2 pomegranates through the juicer.",
    "Make sure to expel the juice into a separate container from the bowl that’s holding the citrus juices, though.",
    "Pour the citrus juice into glasses and top with the pomegranate juice.",
    "After you’ve juiced all of the fruits, divide the citrus juice evenly between three glasses.",
    "Next, pour some of the pomegranate juice into each glass, where it will sink to the bottom.",
    "Serve the juice at room temperature.",
    "If you prefer, you can chill the juices for an hour or two in the refrigerator before combining them.",
    "Mixing Up Cilantro Apple Green Juice Cut the apples and cucumber.",
    "For the juice, you’ll need 2 green apples, 2 stalks of celery, 2 large kale leaves, 1 medium cucumber, ¼ cup (15 g) fresh cilantro, and half a peeled lemon.",
    "To make it easier to run them through the juicer, use a sharp knife to cut the apples into eighths and the cucumber into quarters.",
    "It’s not necessary, but you can also roughly chop the kale and fresh cilantro if you prefer.",
    "Process each ingredient through the juicer separately.",
    "After you’ve cut the apples and cucumbers, run each ingredient through the juicer separately according to the manufacturer’s instructions.",
    "Make sure that you have separate containers for each juice.",
    "Pour the juices together and stir well.",
    "Once you’ve juiced all of the ingredients, pour all of the juices into a large measuring cup.",
    "Use a spoon to stir all of them together so they’re fully blended.",
    "If you like, you can chill the juice after you’ve mixed them together.",
    "Serve the juice immediately.",
    "When the juice is fully mixed, pour it into a large glass.",
    "Drink the glass at room temperature or chilled depending on your preference.",
    "Creating Antioxidant Blast Juice Cut the beets into quarters.",
    "For the juice, you’ll need 2 medium beets, 1 cup (100 g) of blueberries, and 1 cup (100 g) of halved, hulled strawberries.",
    "To make it easier to run them through the juicer, though, use a sharp knife to quarter the beets.",
    "If the strawberries are large, you may want to cut them into quarters as well.",
    "Run all of the ingredients through a juicer.",
    "After you’ve cut the beets, run them through a juicer according to the manufacturer’s instructions.",
    "Juice the blueberries and strawberries immediately afterward, collecting the juice in the same container.",
    "While the juices will be combined in the juicer’s receptacle, it’s a good idea to stir them with a spoon to ensure that they’re fully mixed.",
    "Chill the juice for an hour before serving.",
    "Once all of the juices are combined, cover the container and chill in the refrigerator for an hour.",
    "Next, pour the juice into a large glass and serve.",
    "Making Vegetable Juice Run the tomatoes, celery, carrots, and horseradish through a juicer.",
    "For the juice, you’ll need 3 medium tomatoes that are cut into large chunks, 7 celery stalks cut into 3-inch (7.5-cm) pieces, ½ pound (225 g) of carrots that are cut into 3-inch (7.5-cm) pieces, and a piece of fresh horseradish that’s 2 ½ by ¼ inches (64 by 6 millimeters).",
    "Juice all of the ingredients into a single container according to your juicer’s manufacturer instructions.",
    "Stir all of the juices together with a spoon to ensure that they’re fully blended.",
    "Mix in the salt and lemon juice.",
    "Once the juices are mixed, add ¼ teaspoon (1 ½ g) of coarse salt and 2 ½ teaspoons (12 ½ ml) of freshly squeezed lemon juice into the container.",
    "Stir well to ensure that the salt and juice are fully incorporated.",
    "You can adjust the amount of salt and lemon juice to suit your tastes.",
    "Strain the juice.",
    "After all of the ingredients are mixed, pour the mixture through a fine mesh sieve into a large pitcher.",
    "Shake the sieve well to ensure you get all of the juice separated from any solid pieces.",
    "Pour the juice into glasses and garnish with lemon wedges.",
    "When the juice is strained, divide it evenly between two glasses.",
    "Press a lemon wedge onto the side of each glass and serve.",
    "You can float the lemon wedge in the juice if you prefer."
  ],
  "tyn_section":[
    "Green Goddess Juice",
    "Knife",
    "Electric juicer",
    "Glass",
    "Pomegranate-Citrus Juice",
    "2 bowls",
    "3 glasses",
    "Cilantro Apple Green Juice",
    "6 bowls",
    "Spoon",
    "Antioxidant Blast Juice",
    "Vegetable Juice",
    "Bowl",
    "Fine mesh sieve",
    "2 glasses"
  ],
  "tyn_model":[
    "juicer",
    "cucumber",
    "celery",
    "lemon",
    "spoon",
    "pear",
    "apple",
    "sharp knife",
    "glass",
    "oranges",
    "tangerines",
    "lime",
    "apples",
    "strawberries",
    "salt",
    "pomegranate",
    "grapefruits",
    "pomegranates",
    "bowl",
    "citrus juice",
    "refrigerator",
    "kale",
    "cilantro",
    "beets",
    "blueberries",
    "tomatoes",
    "carrots",
    "horseradish",
    "green goddess juice",
    "green apple",
    "citrus press",
    "grapefruit",
    "citrus fruits",
    "citrus juices",
    "pomegranate juice",
    "green apples",
    "cucumbers",
    "large measuring cup",
    "large glass",
    "container",
    "vegetable juice",
    "coarse salt",
    "lemon juice",
    "fine mesh sieve",
    "large pitcher",
    "sieve"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1304347826,
    "f1":0.1967213115,
    "avg_pos":0.6086956522
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.2173913043,
    "f1":0.3191489362
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.3043478261,
    "f1":0.4179104478
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.1304347826,
    "f1":0.1967213115
  }
}