{
  "title":"How to Make Oliebollen (Dutch New Year's Doughnuts)",
  "url":"https://www.wikihow.com/Make-Oliebollen-(Dutch-New-Year%27s-Doughnuts)",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "steps":[
    {
      "headline":"Mix the yeast with the tepid water.",
      "description":"Ensure that the water isn't too hot for the yeast before using."
    },
    {
      "headline":"Add the flour to the watery yeast.",
      "description":"Mix the batter briefly, using the lowest setting on the blender."
    },
    {
      "headline":"Add the salt and the sugar.",
      "description":"Mix in quickly."
    },
    {
      "headline":"Leave the batter to rise for 45 minutes in a warm place.",
      "description":""
    },
    {
      "headline":"Use a large bucket to let the batter rise.",
      "description":"To prevent the batter from dehydrating, lay a damp tea towel over the batter."
    },
    {
      "headline":"After the dough has risen, start making doughnuts.",
      "description":"Heat the oil to a temperature from about 180ºC / 350ºF. Use a sauce (gravy) spoon to spoon the batter into the oil. Take a small or medium sized soup ladle, dip it in the hot oil briefly, scoop up some batter, then lower the ladle in the oil. The oliebol will float out of the ladle. Don't fry too many at once––3 or 4 is the limit for most pans. Use peanut oil and change the oil regularly."
    },
    {
      "headline":"Fry the Dutch doughnuts about six minutes.",
      "description":"When they are half cooked, they will turn over by themselves, sometimes they need a little nudge to turn."
    },
    {
      "headline":"Remove from the oil using the ladle or slotted spoon.",
      "description":"Lay a piece of kitchen paper into a bowl or deep plate and put each of the cooked Dutch doughnuts on it. The kitchen paper soaks up most of the oil."
    },
    {
      "headline":"Before you serve the Dutch doughnuts, sprinkle them with powered sugar.",
      "description":""
    }
  ],
  "text":" Mix the yeast with the tepid water. Ensure that the water isn't too hot for the yeast before using. Add the flour to the watery yeast. Mix the batter briefly, using the lowest setting on the blender. Add the salt and the sugar. Mix in quickly. Leave the batter to rise for 45 minutes in a warm place.  Use a large bucket to let the batter rise. To prevent the batter from dehydrating, lay a damp tea towel over the batter. After the dough has risen, start making doughnuts. Heat the oil to a temperature from about 180ºC / 350ºF. Use a sauce (gravy) spoon to spoon the batter into the oil. Take a small or medium sized soup ladle, dip it in the hot oil briefly, scoop up some batter, then lower the ladle in the oil. The oliebol will float out of the ladle. Don't fry too many at once––3 or 4 is the limit for most pans. Use peanut oil and change the oil regularly. Fry the Dutch doughnuts about six minutes. When they are half cooked, they will turn over by themselves, sometimes they need a little nudge to turn. Remove from the oil using the ladle or slotted spoon. Lay a piece of kitchen paper into a bowl or deep plate and put each of the cooked Dutch doughnuts on it. The kitchen paper soaks up most of the oil. Before you serve the Dutch doughnuts, sprinkle them with powered sugar. ",
  "sentences":[
    " Mix the yeast with the tepid water.",
    "Ensure that the water isn't too hot for the yeast before using.",
    "Add the flour to the watery yeast.",
    "Mix the batter briefly, using the lowest setting on the blender.",
    "Add the salt and the sugar.",
    "Mix in quickly.",
    "Leave the batter to rise for 45 minutes in a warm place.",
    "Use a large bucket to let the batter rise.",
    "To prevent the batter from dehydrating, lay a damp tea towel over the batter.",
    "After the dough has risen, start making doughnuts.",
    "Heat the oil to a temperature from about 180ºC / 350ºF.",
    "Use a sauce (gravy) spoon to spoon the batter into the oil.",
    "Take a small or medium sized soup ladle, dip it in the hot oil briefly, scoop up some batter, then lower the ladle in the oil.",
    "The oliebol will float out of the ladle.",
    "Don't fry too many at once––3 or 4 is the limit for most pans.",
    "Use peanut oil and change the oil regularly.",
    "Fry the Dutch doughnuts about six minutes.",
    "When they are half cooked, they will turn over by themselves, sometimes they need a little nudge to turn.",
    "Remove from the oil using the ladle or slotted spoon.",
    "Lay a piece of kitchen paper into a bowl or deep plate and put each of the cooked Dutch doughnuts on it.",
    "The kitchen paper soaks up most of the oil.",
    "Before you serve the Dutch doughnuts, sprinkle them with powered sugar."
  ],
  "tyn_section":[
    "Bowl",
    "Tea towel",
    "Blender",
    "Sauce spoon (gravy spoon)",
    "Ladle",
    "Bowl or deep plate",
    "Kitchen paper",
    "Deep fryer"
  ],
  "tyn_model":[
    "oil",
    "water",
    "sugar",
    "dutch doughnuts",
    "kitchen paper",
    "flour",
    "blender",
    "salt",
    "tea towel",
    "soup ladle",
    "hot oil",
    "oliebol",
    "peanut oil",
    "ladle",
    "slotted spoon",
    "bowl"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.3125,
    "f1":0.4166666667,
    "avg_pos":0.9375
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.375,
    "f1":0.46875
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.375,
    "f1":0.46875
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.3125,
    "f1":0.4166666667
  }
}