{
  "title":"How to Make a Plaster Mask",
  "url":"https://www.wikihow.com/Make-a-Plaster-Mask",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Clay Projects"
  ],
  "parts":[
    {
      "name":"Preparing to Make the Mask",
      "steps":[
        {
          "headline":"Create a work area with newspapers and a drop cloth.",
          "description":"Choose a room where you have a lot of space to spread out, such as your living room, a craft room, or your kitchen counter. Lay newspapers or a drop cloth on the floor to protect it. Have paper towels handy in case a stray drip lands outside the covered area."
        },
        {
          "headline":"Find a face model.",
          "description":"You will need someone to act as a face model so you can mold the mask properly. Pick someone who does not mind being still for at least 30 minutes to one hour. Ask them to lay on the ground on their back or sit in a straight-backed chair with their face tilted upward. You can use your own face as a model for the mask, though this may be a little tricky to maneuver if you’re making a plaster mask for the first time. You may want to work in front of a mirror to make it easier to apply the strips to your face."
        },
        {
          "headline":"Put an old shirt and a headband on the person.",
          "description":"You can also use pins to pull the person’s hair away from their face. Wrap a towel around their neck and shoulders to keep plaster off of these areas."
        },
        {
          "headline":"Cut the bandage plaster into strips with scissors.",
          "description":"The strips should be about 2 to 4 inches (5.1 to 10.2 cm) wide by 3 inches (7.6 cm) long. Make some of the strips shorter than others so you have a variety of strips to use. Cut about 10-15 strips so you have enough to cover the person’s face in two layers of plaster. When you are finishing cutting the plaster strips, place them in a bowl."
        },
        {
          "headline":"Rub petroleum jelly on the person’s face.",
          "description":"This will make removing the dried mask easier. Rub the jelly in well at their hairline, on their eyebrows, and around the sides of their nose. Cover their eyelids and their lips as well as their jawline and under their chin."
        }
      ]
    },
    {
      "name":"Constructing the Mask",
      "steps":[
        {
          "headline":"Dip the strips into a bowl of warm water, one at a time.",
          "description":"Take a strip with clean fingers and place it in the bowl of water. Use your finger to run excess water off the strip. You want the strip to be wet, but not soaking."
        },
        {
          "headline":"Cover the person’s forehead.",
          "description":"Use your fingers to smooth out any creases so the strip lies flat."
        },
        {
          "headline":"Apply strips to their cheeks and chin.",
          "description":"Work down from the person’s forehead, around their cheeks, and then their chin. Make sure the strips touch each other on the person’s face. Smooth the strips with your fingers as you apply them so they dry flat."
        },
        {
          "headline":"Use smaller strips for their nose and upper lip.",
          "description":"Save the inner areas of their face for last. Be careful when applying the strips to the person’s nose and upper lip, as these can be sensitive areas. Make sure you do not cover the person’s nostrils with plaster, so they can breathe. Leave a ⁄2 inch (1.3 cm) gap around the nostrils."
        },
        {
          "headline":"Cover their eyes and mouth with plaster if desired.",
          "description":"Let your model know that you are going to be covering these areas so they are prepared. Ask them to close their eyes and then use smaller strips to cover them entirely, pressing the strip into the contours of their eyes. Then, ask them to close their mouth and use a strip to cover their mouth. Covering the eyes and mouth is optional, based on the person’s preference. You may keep the mouth uncovered if you want the person to be able to speak clearly to others while wearing the mask. You may keep the eyeholes uncovered so the person can see while wearing the mask."
        },
        {
          "headline":"Do at least two layers of plaster.",
          "description":"After you have covered the person’s face once with plaster strips, repeat the same process one more time. Make sure the strips touch each other and lay flat. Doing two layers of plaster will make the mask more sturdy."
        },
        {
          "headline":"Smooth any gaps with wet fingers.",
          "description":"Once you have finished the second layer, stand back and look over the mask. Dip your fingers in the water, which should now be a bit sticky with plaster. Then, gently smooth any gaps or creases on the plaster with your wet fingers."
        }
      ]
    },
    {
      "name":"Drying and Removing the Mask",
      "steps":[
        {
          "headline":"Wait 12 to 15 minutes.",
          "description":"Ask the person to remain still so the mask can air dry. As it starts to set, it may feel hard or a bit itchy. This is to be expected. Do not apply a hairdryer or a fan to the mask to speed up drying, as this can cause it to crack. It can also put your model’s skin at risk."
        },
        {
          "headline":"Have the person move their mouth and jaw to help loosen the mask.",
          "description":"Touch the mask to confirm it is dry to the touch. Then, ask the person to wiggle their mouth and jaw. They can also lift their eyebrows and crinkle their nose. This will help to loosen the mask."
        },
        {
          "headline":"Pull the mask slowly from their face.",
          "description":"Once the mask has been loosened, hold your two hands out in front of the person’s face. Grip the sides of the mask and slowly lift it away. Move your fingers toward the center of the mask as you lift it off. Do not pull or yank the mask off, as this can lead to injury. The mask should come off easily, partly due to the petroleum jelly on the person’s face."
        }
      ]
    },
    {
      "name":"Decorating the Mask",
      "steps":[
        {
          "headline":"Put ties on the mask.",
          "description":"Use a hole punch to make one hole on either side of the mask, just below the eyes. Then, tie a thick ribbon or string to either hole. You can then secure the mask to your face, or someone else’s face, by tying the two ribbons or strings together at the back of the head."
        },
        {
          "headline":"Add a beak, horns, or bumps to the mask.",
          "description":"Use any remaining plaster strips, or cut new ones, to make a beak on the nose of the mask. This is a good option if you want to decorate the mask like a bird’s head. You can also add horns to the top of the mask for a devil costume. Put large bumps and raised spots on the mask for a scary look."
        },
        {
          "headline":"Paint the mask.",
          "description":"Apply a coat of gesso on the mask to smooth it out. Then, decorate it with acrylic paints or water-based paints. Add a design around the eyes and mouth. Put a pattern all over the mask. If you have plastered over the eyes and mouth on the mask, you may paint eyes and a mouth on the mask to give it a distinct look. You can then use a sealer over the mask once it has been painted to protect it and give it a glossy finish."
        },
        {
          "headline":"Add feathers, glitter, or sequins to the mask.",
          "description":"Use craft glue to attach different colored feathers to the mask for a festive look. You can also put glue on the mask and dip it in glitter for a sparkly look. Sequins are also a fun option."
        },
        {
          "headline":"Let the decorated mask dry overnight.",
          "description":"Once you have decorated the mask creatively, let it dry on a flat surface overnight. Then, wear it to a party, to an event, or just for fun."
        }
      ]
    }
  ],
  "text":" Preparing to Make the Mask Create a work area with newspapers and a drop cloth. Choose a room where you have a lot of space to spread out, such as your living room, a craft room, or your kitchen counter. Lay newspapers or a drop cloth on the floor to protect it. Have paper towels handy in case a stray drip lands outside the covered area. Find a face model. You will need someone to act as a face model so you can mold the mask properly. Pick someone who does not mind being still for at least 30 minutes to one hour. Ask them to lay on the ground on their back or sit in a straight-backed chair with their face tilted upward. You can use your own face as a model for the mask, though this may be a little tricky to maneuver if you’re making a plaster mask for the first time. You may want to work in front of a mirror to make it easier to apply the strips to your face. Put an old shirt and a headband on the person. You can also use pins to pull the person’s hair away from their face. Wrap a towel around their neck and shoulders to keep plaster off of these areas. Cut the bandage plaster into strips with scissors. The strips should be about 2 to 4 inches (5.1 to 10.2 cm) wide by 3 inches (7.6 cm) long. Make some of the strips shorter than others so you have a variety of strips to use. Cut about 10-15 strips so you have enough to cover the person’s face in two layers of plaster. When you are finishing cutting the plaster strips, place them in a bowl. Rub petroleum jelly on the person’s face. This will make removing the dried mask easier. Rub the jelly in well at their hairline, on their eyebrows, and around the sides of their nose. Cover their eyelids and their lips as well as their jawline and under their chin. Constructing the Mask Dip the strips into a bowl of warm water, one at a time. Take a strip with clean fingers and place it in the bowl of water. Use your finger to run excess water off the strip. You want the strip to be wet, but not soaking. Cover the person’s forehead. Use your fingers to smooth out any creases so the strip lies flat. Apply strips to their cheeks and chin. Work down from the person’s forehead, around their cheeks, and then their chin. Make sure the strips touch each other on the person’s face. Smooth the strips with your fingers as you apply them so they dry flat. Use smaller strips for their nose and upper lip. Save the inner areas of their face for last. Be careful when applying the strips to the person’s nose and upper lip, as these can be sensitive areas. Make sure you do not cover the person’s nostrils with plaster, so they can breathe. Leave a ⁄2 inch (1.3 cm) gap around the nostrils. Cover their eyes and mouth with plaster if desired. Let your model know that you are going to be covering these areas so they are prepared. Ask them to close their eyes and then use smaller strips to cover them entirely, pressing the strip into the contours of their eyes. Then, ask them to close their mouth and use a strip to cover their mouth. Covering the eyes and mouth is optional, based on the person’s preference. You may keep the mouth uncovered if you want the person to be able to speak clearly to others while wearing the mask. You may keep the eyeholes uncovered so the person can see while wearing the mask. Do at least two layers of plaster. After you have covered the person’s face once with plaster strips, repeat the same process one more time. Make sure the strips touch each other and lay flat. Doing two layers of plaster will make the mask more sturdy. Smooth any gaps with wet fingers. Once you have finished the second layer, stand back and look over the mask. Dip your fingers in the water, which should now be a bit sticky with plaster. Then, gently smooth any gaps or creases on the plaster with your wet fingers. Drying and Removing the Mask Wait 12 to 15 minutes. Ask the person to remain still so the mask can air dry. As it starts to set, it may feel hard or a bit itchy. This is to be expected. Do not apply a hairdryer or a fan to the mask to speed up drying, as this can cause it to crack. It can also put your model’s skin at risk. Have the person move their mouth and jaw to help loosen the mask. Touch the mask to confirm it is dry to the touch. Then, ask the person to wiggle their mouth and jaw. They can also lift their eyebrows and crinkle their nose. This will help to loosen the mask. Pull the mask slowly from their face. Once the mask has been loosened, hold your two hands out in front of the person’s face. Grip the sides of the mask and slowly lift it away. Move your fingers toward the center of the mask as you lift it off. Do not pull or yank the mask off, as this can lead to injury. The mask should come off easily, partly due to the petroleum jelly on the person’s face. Decorating the Mask Put ties on the mask. Use a hole punch to make one hole on either side of the mask, just below the eyes. Then, tie a thick ribbon or string to either hole. You can then secure the mask to your face, or someone else’s face, by tying the two ribbons or strings together at the back of the head. Add a beak, horns, or bumps to the mask. Use any remaining plaster strips, or cut new ones, to make a beak on the nose of the mask. This is a good option if you want to decorate the mask like a bird’s head. You can also add horns to the top of the mask for a devil costume. Put large bumps and raised spots on the mask for a scary look. Paint the mask. Apply a coat of gesso on the mask to smooth it out. Then, decorate it with acrylic paints or water-based paints. Add a design around the eyes and mouth. Put a pattern all over the mask. If you have plastered over the eyes and mouth on the mask, you may paint eyes and a mouth on the mask to give it a distinct look. You can then use a sealer over the mask once it has been painted to protect it and give it a glossy finish. Add feathers, glitter, or sequins to the mask. Use craft glue to attach different colored feathers to the mask for a festive look. You can also put glue on the mask and dip it in glitter for a sparkly look. Sequins are also a fun option. Let the decorated mask dry overnight. Once you have decorated the mask creatively, let it dry on a flat surface overnight. Then, wear it to a party, to an event, or just for fun.",
  "sentences":[
    " Preparing to Make the Mask Create a work area with newspapers and a drop cloth.",
    "Choose a room where you have a lot of space to spread out, such as your living room, a craft room, or your kitchen counter.",
    "Lay newspapers or a drop cloth on the floor to protect it.",
    "Have paper towels handy in case a stray drip lands outside the covered area.",
    "Find a face model.",
    "You will need someone to act as a face model so you can mold the mask properly.",
    "Pick someone who does not mind being still for at least 30 minutes to one hour.",
    "Ask them to lay on the ground on their back or sit in a straight-backed chair with their face tilted upward.",
    "You can use your own face as a model for the mask, though this may be a little tricky to maneuver if you’re making a plaster mask for the first time.",
    "You may want to work in front of a mirror to make it easier to apply the strips to your face.",
    "Put an old shirt and a headband on the person.",
    "You can also use pins to pull the person’s hair away from their face.",
    "Wrap a towel around their neck and shoulders to keep plaster off of these areas.",
    "Cut the bandage plaster into strips with scissors.",
    "The strips should be about 2 to 4 inches (5.1 to 10.2 cm) wide by 3 inches (7.6 cm) long.",
    "Make some of the strips shorter than others so you have a variety of strips to use.",
    "Cut about 10-15 strips so you have enough to cover the person’s face in two layers of plaster.",
    "When you are finishing cutting the plaster strips, place them in a bowl.",
    "Rub petroleum jelly on the person’s face.",
    "This will make removing the dried mask easier.",
    "Rub the jelly in well at their hairline, on their eyebrows, and around the sides of their nose.",
    "Cover their eyelids and their lips as well as their jawline and under their chin.",
    "Constructing the Mask Dip the strips into a bowl of warm water, one at a time.",
    "Take a strip with clean fingers and place it in the bowl of water.",
    "Use your finger to run excess water off the strip.",
    "You want the strip to be wet, but not soaking.",
    "Cover the person’s forehead.",
    "Use your fingers to smooth out any creases so the strip lies flat.",
    "Apply strips to their cheeks and chin.",
    "Work down from the person’s forehead, around their cheeks, and then their chin.",
    "Make sure the strips touch each other on the person’s face.",
    "Smooth the strips with your fingers as you apply them so they dry flat.",
    "Use smaller strips for their nose and upper lip.",
    "Save the inner areas of their face for last.",
    "Be careful when applying the strips to the person’s nose and upper lip, as these can be sensitive areas.",
    "Make sure you do not cover the person’s nostrils with plaster, so they can breathe.",
    "Leave a ⁄2 inch (1.3 cm) gap around the nostrils.",
    "Cover their eyes and mouth with plaster if desired.",
    "Let your model know that you are going to be covering these areas so they are prepared.",
    "Ask them to close their eyes and then use smaller strips to cover them entirely, pressing the strip into the contours of their eyes.",
    "Then, ask them to close their mouth and use a strip to cover their mouth.",
    "Covering the eyes and mouth is optional, based on the person’s preference.",
    "You may keep the mouth uncovered if you want the person to be able to speak clearly to others while wearing the mask.",
    "You may keep the eyeholes uncovered so the person can see while wearing the mask.",
    "Do at least two layers of plaster.",
    "After you have covered the person’s face once with plaster strips, repeat the same process one more time.",
    "Make sure the strips touch each other and lay flat.",
    "Doing two layers of plaster will make the mask more sturdy.",
    "Smooth any gaps with wet fingers.",
    "Once you have finished the second layer, stand back and look over the mask.",
    "Dip your fingers in the water, which should now be a bit sticky with plaster.",
    "Then, gently smooth any gaps or creases on the plaster with your wet fingers.",
    "Drying and Removing the Mask Wait 12 to 15 minutes.",
    "Ask the person to remain still so the mask can air dry.",
    "As it starts to set, it may feel hard or a bit itchy.",
    "This is to be expected.",
    "Do not apply a hairdryer or a fan to the mask to speed up drying, as this can cause it to crack.",
    "It can also put your model’s skin at risk.",
    "Have the person move their mouth and jaw to help loosen the mask.",
    "Touch the mask to confirm it is dry to the touch.",
    "Then, ask the person to wiggle their mouth and jaw.",
    "They can also lift their eyebrows and crinkle their nose.",
    "This will help to loosen the mask.",
    "Pull the mask slowly from their face.",
    "Once the mask has been loosened, hold your two hands out in front of the person’s face.",
    "Grip the sides of the mask and slowly lift it away.",
    "Move your fingers toward the center of the mask as you lift it off.",
    "Do not pull or yank the mask off, as this can lead to injury.",
    "The mask should come off easily, partly due to the petroleum jelly on the person’s face.",
    "Decorating the Mask Put ties on the mask.",
    "Use a hole punch to make one hole on either side of the mask, just below the eyes.",
    "Then, tie a thick ribbon or string to either hole.",
    "You can then secure the mask to your face, or someone else’s face, by tying the two ribbons or strings together at the back of the head.",
    "Add a beak, horns, or bumps to the mask.",
    "Use any remaining plaster strips, or cut new ones, to make a beak on the nose of the mask.",
    "This is a good option if you want to decorate the mask like a bird’s head.",
    "You can also add horns to the top of the mask for a devil costume.",
    "Put large bumps and raised spots on the mask for a scary look.",
    "Paint the mask.",
    "Apply a coat of gesso on the mask to smooth it out.",
    "Then, decorate it with acrylic paints or water-based paints.",
    "Add a design around the eyes and mouth.",
    "Put a pattern all over the mask.",
    "If you have plastered over the eyes and mouth on the mask, you may paint eyes and a mouth on the mask to give it a distinct look.",
    "You can then use a sealer over the mask once it has been painted to protect it and give it a glossy finish.",
    "Add feathers, glitter, or sequins to the mask.",
    "Use craft glue to attach different colored feathers to the mask for a festive look.",
    "You can also put glue on the mask and dip it in glitter for a sparkly look.",
    "Sequins are also a fun option.",
    "Let the decorated mask dry overnight.",
    "Once you have decorated the mask creatively, let it dry on a flat surface overnight.",
    "Then, wear it to a party, to an event, or just for fun."
  ],
  "tyn_section":[
    "Bandage plaster",
    "Water",
    "Two bowls",
    "Newspaper or drop cloth",
    "Vaseline or petroleum jelly",
    "String or ribbon",
    "Gesso, if painting the mask",
    "Paints, feathers, glitter, sequins"
  ],
  "tyn_model":[
    "plaster",
    "water",
    "bowl",
    "mask",
    "newspapers",
    "drop cloth",
    "petroleum jelly",
    "feathers",
    "glitter",
    "sequins",
    "paper towels",
    "mirror",
    "pins",
    "towel",
    "bandage plaster",
    "scissors",
    "jelly",
    "hairdryer",
    "fan",
    "ribbon",
    "string",
    "ribbons",
    "horns",
    "gesso",
    "acrylic paints",
    "water-based paints",
    "sealer",
    "craft glue",
    "glue"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0689655172,
    "f1":0.1081081081,
    "avg_pos":0.4827586207
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1724137931,
    "f1":0.2564102564
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.2413793103,
    "f1":0.3482587065
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0689655172,
    "f1":0.1081081081
  }
}