{
  "title":"How to Clean a Grill",
  "url":"https://www.wikihow.com/Clean-a-Grill",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "methods":[
    {
      "name":"Scraping Cooking Surfaces on a Gas Grill",
      "steps":[
        {
          "headline":"Turn the grill on the highest heat setting for 10-15 minutes.",
          "description":"Remove any pans or foil from the grill surface and close the hood. Turn your burners on and leave your grill alone to burn off any larger pieces of food residue and make the initial cleaning easier. You can choose to wear rubber gloves while cleaning your grill if you want to keep your hands completely clean, but they aren’t necessary."
        },
        {
          "headline":"Shut off the gas source and scrub the grate.",
          "description":"Turn the heat off and shut off your propane or natural gas by closing the valve. Use a grill brush or plastic scraper to remove initial layers of residue by scrubbing vertically along the cooking grid in aggressive up-and-down strokes. Let the grill cool.Tip: You can use a specialized grill cleaning chemical if you’d like, but even if you clean your grill thoroughly it can leave behind a residue that gets into your food. It will also remove a lot of the natural seasoning and oil that’s soaked into your grates, which help make food tastier and give it the smoky flavor associated with grilling. Don’t touch the grill directly until you’ve let it cool for 20-30 minutes after you’ve cleaned it. The cooking grid, or grate, is the metal surface where you place your food when you’re grilling."
        },
        {
          "headline":"Scrape the roof of your lid with a plastic scraper.",
          "description":"With the lid of your grill raised, use your plastic scraper to scrub the residue off of the roof of your grill. Scrub away from you so that you don’t hurt yourself if the scraper slips. Let all of the debris, grime, and dirt fall to the bottom of the lifted lid."
        },
        {
          "headline":"Use the hose on a vacuum to remove the debris and residue.",
          "description":"After you’ve scraped the roof of your grill, there will be a lot of dirt and grime piled up at the bottom of your lifted lid. Turn a vacuum on to the highest suction setting and use the vacuum’s hose to remove larger pieces from the bottom of your lid. Wipe the roof of the lid with a damp cloth. Vacuuming the residue from the bottom of your lid will keep it from falling into the body of the grill when you close your lid."
        },
        {
          "headline":"Remove the grill base to dump out old ash and residue.",
          "description":"Take your grates out and set them aside. Depending on the brand and style of your grill, the base can either be removed by reaching in the grill and lifting it out, or by sliding a tray out of the side of the grill. You may need to disassemble your burners by unscrewing each gas line where it attaches to the body before you can get your base out. Once removed, dump the ash and residue into a non-combustible trash receptacle. Set the grill base aside. Make sure that you aren’t dumping any hot materials into the garbage. Wait for your grill to cool before doing this if it’s still hot."
        }
      ]
    },
    {
      "name":"Scrubbing the Interior Body of a Gas Grill",
      "steps":[
        {
          "headline":"Scrub the interior body of your grill with a scraper and nylon brush.",
          "description":"Scrape large, flat sections of your grill’s interior with your scraper. Depending on your grill, your burners may still be attached. If they are, scrub over them in the same direction as the gas slits with a nylon scrub brush. After you’ve scraped flat surfaces, scrub each exposed area with your nylon brush in aggressive back-and-forth strokes. If you scrub your burners perpendicular to the slits, you could accidentally knock debris into the holes. If your grill has burner covers, leave them on. They’re there to protect your burners and keep sensitive parts from getting damaged. They also keep grease and dirt off of the burners, so you won’t need to scrub them anyway."
        },
        {
          "headline":"Empty your grease pan or bottom tray and wipe it.",
          "description":"At the very bottom of your grill’s body, there will be a removable pan or tray that is designed to catch debris, residue, or grease. Once you’ve scraped the body of the grill, remove the grease pan or bottom tray and empty it in a noncombustible trash bin. Wipe the tray or pan down with a warm, damp cloth and let it air dry before returning it.Tip: The grease pan or bottom tray is normally going to be made of a heavy-duty material like porcelain, ceramic, or a hard metal. It should be relatively easy to wipe down. If it’s rusty or looks worn down, consider replacing it."
        },
        {
          "headline":"Use steel wool and warm water to scrub down the heat deflector.",
          "description":"Some grills have a heat deflector at the bottom of the exhaust or burner system that deflects heat away from the grill. It’s usually a flat piece of thin metal with a ridge in the middle, and they usually have thin slits across them to let excess heat out. Lift this piece out if you have one and soak it in warm water before aggressively scrubbing it with steel wool. This part doesn’t really need to look like new when you’re done, since it doesn’t influence the flavor of food."
        },
        {
          "headline":"Vacuum the inside and wipe down all exterior surfaces with a damp cloth.",
          "description":"Use a vacuum with a hose to pull out any remaining debris or residue that you’ve scraped off from the inside of the grill. Once the interior surfaces of your grill have been cleaned, you can wipe down the outside of the grill with a damp microfiber cloth. Rinse your cloth in warm water and then wring it out before wiping down the exterior of your grill in soft circular motions. Cover each portion of the grill to lift up any grime and remove any food stains. Put your grill cover over the grill after you’re done to protect it from the elements."
        }
      ]
    },
    {
      "name":"Maintaining a Charcoal Grill",
      "steps":[
        {
          "headline":"Light a fire in your charcoal grill and let it burn.",
          "description":"Let your fire run for 10-15 minutes. This will burn off any residue or grime that hasn’t been heated yet. Let your fire burn out and wait for your grill to cool before removing the lid. Depending on how much charcoal you’re using, it could take a few hours for your grill to cool."
        },
        {
          "headline":"Wipe the lid down with a sponge and dish soap.",
          "description":"Use a well-soaped sponge and warm water to scrub the roof of your lid. Scrub hard in a circular motion and cover each part of the lid twice. Rinse your lid in warm water and dry it with a clean cloth. Most charcoal grill lids are coated in an enamel that make it easy to clean. If your grill’s lid is difficult to clean, it may be a sign that you need a new grill."
        },
        {
          "headline":"Scrub the grill grates aggressively with a grill brush.",
          "description":"Scrape vertically, going parallel to the cooking grid. You may need to scrape 4-5 times along each section of the grid to fully remove and food residue or charcoal dust. Flip your grill grates over and scrape the bottom of the grates as well. Rinse them under cold water when you’re done. If you have a lot of residue that you’re struggling to remove, you can add dish soap to the tips of your grill brush. You’ll have to rinse the grates multiple times afterwards though to ensure that you don’t get any soap residue on your food in the future."
        },
        {
          "headline":"Empty your coals and wash the inside bowl.",
          "description":"Put on a pair of rubber gloves. Dump out the charcoal ashes into a nonflammable trash receptacle. Use a steel wool pad to scrape the inside of your charcoal grill’s bowl. Scrape aggressively in back-and-forth strokes until all of the gunk and grease is removed. Rinse it with a wet sponge and pat them dry with paper towels or a clean rag.Tip: If your charcoal grill has an ash tray at the bottom you can wipe it down with water and a sponge. The ash tray just catches debris and doesn’t come in contact with food, so you don’t need it to be sparkly clean. Cover your grill when you’re done."
        }
      ]
    },
    {
      "name":"Cleaning an Indoor Electric Grill",
      "steps":[
        {
          "headline":"Unplug the grill and wait for it to cool.",
          "description":"It’s best to clean an electric grill after you’ve recently used it. Before you do start the cleaning process, unplug the grill and let it cool for 1-1.5 hours. Remove the electronic thermostat and set it aside while you’re waiting for it to cool. Hand wipe the thermostat with a microfiber cloth or paper towel. You don’t want to get any electric components of the thermostat wet, so use a dry cloth or towel."
        },
        {
          "headline":"Remove the grill’s heating surface and dishwash it if you can.",
          "description":"Some electronic grills have a removable heating plate. If you can remove your heating plate, take it out and dishwash it with normal detergent. If you don’t have a dishwasher, you can scrub it with a sponge and dish soap before rinsing it. Let the heating surface air dry."
        },
        {
          "headline":"Wipe the heating surface with dish soap if it can’t be removed.",
          "description":"If you can’t take the heating surface of the grill off, take a sponge and add a drop of dish soap. Run the sponge through warm water and wring it out. Scrub the heating surface with your sponge by scrubbing in gentle, circular motions. Run your sponge through warm water again and wring it out repeatedly until the soap is removed. Scrub your heating surface a second time. You may need to rinse the sponge multiple times to get the soap out, and the surface may need to be scrubbed more than once to remove grime or dirt."
        },
        {
          "headline":"Clean the body of the grill with a sponge or microfiber cloth.",
          "description":"Run a sponge or cloth under warm water and wring it out. Run your sponge and cloth along the exterior surfaces of the grill. Clean in circular motions so that you don’t leave water stains. Dry the body of the grill with paper towels or a dry cloth."
        },
        {
          "headline":"Use a chemical cleaner if you want to remove discoloration.",
          "description":"Put on rubber gloves and preheat your grill to 225 °F (107 °C). Combine 1 cup (240 mL) of hot water and 1 tablespoon (15 mL) of commercial chemical grill cleaner in a bowl. Pour the solution over the heating surface and scrub with a wire brush that has a long handle. Scrub quickly and aggressively until the discoloration is removed. Rinse the heating surface with dish soap and warm water before letting it air dry.Warning: Only clean a grill with chemical cleaners once in a while. The cleaner will leave a residue behind if you don’t properly rinse your grill, which can change the flavor of your food in the future."
        },
        {
          "headline":"Wipe the surface of your grill with cooking oil.",
          "description":"Let your grill cool for 30-45 minutes. After using a chemical cleaner to remove discoloration, wipe the surface of your grill with a dollop of cooking oil and a paper towel. This will ensure that your grill doesn’t discolor in the future."
        }
      ]
    }
  ],
  "text":" Scraping Cooking Surfaces on a Gas Grill Turn the grill on the highest heat setting for 10-15 minutes. Remove any pans or foil from the grill surface and close the hood. Turn your burners on and leave your grill alone to burn off any larger pieces of food residue and make the initial cleaning easier. You can choose to wear rubber gloves while cleaning your grill if you want to keep your hands completely clean, but they aren’t necessary. Shut off the gas source and scrub the grate. Turn the heat off and shut off your propane or natural gas by closing the valve. Use a grill brush or plastic scraper to remove initial layers of residue by scrubbing vertically along the cooking grid in aggressive up-and-down strokes. Let the grill cool.Tip: You can use a specialized grill cleaning chemical if you’d like, but even if you clean your grill thoroughly it can leave behind a residue that gets into your food. It will also remove a lot of the natural seasoning and oil that’s soaked into your grates, which help make food tastier and give it the smoky flavor associated with grilling. Don’t touch the grill directly until you’ve let it cool for 20-30 minutes after you’ve cleaned it. The cooking grid, or grate, is the metal surface where you place your food when you’re grilling. Scrape the roof of your lid with a plastic scraper. With the lid of your grill raised, use your plastic scraper to scrub the residue off of the roof of your grill. Scrub away from you so that you don’t hurt yourself if the scraper slips. Let all of the debris, grime, and dirt fall to the bottom of the lifted lid. Use the hose on a vacuum to remove the debris and residue. After you’ve scraped the roof of your grill, there will be a lot of dirt and grime piled up at the bottom of your lifted lid. Turn a vacuum on to the highest suction setting and use the vacuum’s hose to remove larger pieces from the bottom of your lid. Wipe the roof of the lid with a damp cloth. Vacuuming the residue from the bottom of your lid will keep it from falling into the body of the grill when you close your lid. Remove the grill base to dump out old ash and residue. Take your grates out and set them aside. Depending on the brand and style of your grill, the base can either be removed by reaching in the grill and lifting it out, or by sliding a tray out of the side of the grill. You may need to disassemble your burners by unscrewing each gas line where it attaches to the body before you can get your base out. Once removed, dump the ash and residue into a non-combustible trash receptacle. Set the grill base aside. Make sure that you aren’t dumping any hot materials into the garbage. Wait for your grill to cool before doing this if it’s still hot. Scrubbing the Interior Body of a Gas Grill Scrub the interior body of your grill with a scraper and nylon brush. Scrape large, flat sections of your grill’s interior with your scraper. Depending on your grill, your burners may still be attached. If they are, scrub over them in the same direction as the gas slits with a nylon scrub brush. After you’ve scraped flat surfaces, scrub each exposed area with your nylon brush in aggressive back-and-forth strokes. If you scrub your burners perpendicular to the slits, you could accidentally knock debris into the holes. If your grill has burner covers, leave them on. They’re there to protect your burners and keep sensitive parts from getting damaged. They also keep grease and dirt off of the burners, so you won’t need to scrub them anyway. Empty your grease pan or bottom tray and wipe it. At the very bottom of your grill’s body, there will be a removable pan or tray that is designed to catch debris, residue, or grease. Once you’ve scraped the body of the grill, remove the grease pan or bottom tray and empty it in a noncombustible trash bin. Wipe the tray or pan down with a warm, damp cloth and let it air dry before returning it.Tip: The grease pan or bottom tray is normally going to be made of a heavy-duty material like porcelain, ceramic, or a hard metal. It should be relatively easy to wipe down. If it’s rusty or looks worn down, consider replacing it. Use steel wool and warm water to scrub down the heat deflector. Some grills have a heat deflector at the bottom of the exhaust or burner system that deflects heat away from the grill. It’s usually a flat piece of thin metal with a ridge in the middle, and they usually have thin slits across them to let excess heat out. Lift this piece out if you have one and soak it in warm water before aggressively scrubbing it with steel wool. This part doesn’t really need to look like new when you’re done, since it doesn’t influence the flavor of food. Vacuum the inside and wipe down all exterior surfaces with a damp cloth. Use a vacuum with a hose to pull out any remaining debris or residue that you’ve scraped off from the inside of the grill. Once the interior surfaces of your grill have been cleaned, you can wipe down the outside of the grill with a damp microfiber cloth. Rinse your cloth in warm water and then wring it out before wiping down the exterior of your grill in soft circular motions. Cover each portion of the grill to lift up any grime and remove any food stains. Put your grill cover over the grill after you’re done to protect it from the elements. Maintaining a Charcoal Grill Light a fire in your charcoal grill and let it burn. Let your fire run for 10-15 minutes. This will burn off any residue or grime that hasn’t been heated yet. Let your fire burn out and wait for your grill to cool before removing the lid. Depending on how much charcoal you’re using, it could take a few hours for your grill to cool. Wipe the lid down with a sponge and dish soap. Use a well-soaped sponge and warm water to scrub the roof of your lid. Scrub hard in a circular motion and cover each part of the lid twice. Rinse your lid in warm water and dry it with a clean cloth. Most charcoal grill lids are coated in an enamel that make it easy to clean. If your grill’s lid is difficult to clean, it may be a sign that you need a new grill. Scrub the grill grates aggressively with a grill brush. Scrape vertically, going parallel to the cooking grid. You may need to scrape 4-5 times along each section of the grid to fully remove and food residue or charcoal dust. Flip your grill grates over and scrape the bottom of the grates as well. Rinse them under cold water when you’re done. If you have a lot of residue that you’re struggling to remove, you can add dish soap to the tips of your grill brush. You’ll have to rinse the grates multiple times afterwards though to ensure that you don’t get any soap residue on your food in the future. Empty your coals and wash the inside bowl. Put on a pair of rubber gloves. Dump out the charcoal ashes into a nonflammable trash receptacle. Use a steel wool pad to scrape the inside of your charcoal grill’s bowl. Scrape aggressively in back-and-forth strokes until all of the gunk and grease is removed. Rinse it with a wet sponge and pat them dry with paper towels or a clean rag.Tip: If your charcoal grill has an ash tray at the bottom you can wipe it down with water and a sponge. The ash tray just catches debris and doesn’t come in contact with food, so you don’t need it to be sparkly clean. Cover your grill when you’re done. Cleaning an Indoor Electric Grill Unplug the grill and wait for it to cool. It’s best to clean an electric grill after you’ve recently used it. Before you do start the cleaning process, unplug the grill and let it cool for 1-1.5 hours. Remove the electronic thermostat and set it aside while you’re waiting for it to cool. Hand wipe the thermostat with a microfiber cloth or paper towel. You don’t want to get any electric components of the thermostat wet, so use a dry cloth or towel. Remove the grill’s heating surface and dishwash it if you can. Some electronic grills have a removable heating plate. If you can remove your heating plate, take it out and dishwash it with normal detergent. If you don’t have a dishwasher, you can scrub it with a sponge and dish soap before rinsing it. Let the heating surface air dry. Wipe the heating surface with dish soap if it can’t be removed. If you can’t take the heating surface of the grill off, take a sponge and add a drop of dish soap. Run the sponge through warm water and wring it out. Scrub the heating surface with your sponge by scrubbing in gentle, circular motions. Run your sponge through warm water again and wring it out repeatedly until the soap is removed. Scrub your heating surface a second time. You may need to rinse the sponge multiple times to get the soap out, and the surface may need to be scrubbed more than once to remove grime or dirt. Clean the body of the grill with a sponge or microfiber cloth. Run a sponge or cloth under warm water and wring it out. Run your sponge and cloth along the exterior surfaces of the grill. Clean in circular motions so that you don’t leave water stains. Dry the body of the grill with paper towels or a dry cloth. Use a chemical cleaner if you want to remove discoloration. Put on rubber gloves and preheat your grill to 225 °F (107 °C). Combine 1 cup (240 mL) of hot water and 1 tablespoon (15 mL) of commercial chemical grill cleaner in a bowl. Pour the solution over the heating surface and scrub with a wire brush that has a long handle. Scrub quickly and aggressively until the discoloration is removed. Rinse the heating surface with dish soap and warm water before letting it air dry.Warning: Only clean a grill with chemical cleaners once in a while. The cleaner will leave a residue behind if you don’t properly rinse your grill, which can change the flavor of your food in the future. Wipe the surface of your grill with cooking oil. Let your grill cool for 30-45 minutes. After using a chemical cleaner to remove discoloration, wipe the surface of your grill with a dollop of cooking oil and a paper towel. This will ensure that your grill doesn’t discolor in the future.",
  "sentences":[
    " Scraping Cooking Surfaces on a Gas Grill Turn the grill on the highest heat setting for 10-15 minutes.",
    "Remove any pans or foil from the grill surface and close the hood.",
    "Turn your burners on and leave your grill alone to burn off any larger pieces of food residue and make the initial cleaning easier.",
    "You can choose to wear rubber gloves while cleaning your grill if you want to keep your hands completely clean, but they aren’t necessary.",
    "Shut off the gas source and scrub the grate.",
    "Turn the heat off and shut off your propane or natural gas by closing the valve.",
    "Use a grill brush or plastic scraper to remove initial layers of residue by scrubbing vertically along the cooking grid in aggressive up-and-down strokes.",
    "Let the grill cool.Tip: You can use a specialized grill cleaning chemical if you’d like, but even if you clean your grill thoroughly it can leave behind a residue that gets into your food.",
    "It will also remove a lot of the natural seasoning and oil that’s soaked into your grates, which help make food tastier and give it the smoky flavor associated with grilling.",
    "Don’t touch the grill directly until you’ve let it cool for 20-30 minutes after you’ve cleaned it.",
    "The cooking grid, or grate, is the metal surface where you place your food when you’re grilling.",
    "Scrape the roof of your lid with a plastic scraper.",
    "With the lid of your grill raised, use your plastic scraper to scrub the residue off of the roof of your grill.",
    "Scrub away from you so that you don’t hurt yourself if the scraper slips.",
    "Let all of the debris, grime, and dirt fall to the bottom of the lifted lid.",
    "Use the hose on a vacuum to remove the debris and residue.",
    "After you’ve scraped the roof of your grill, there will be a lot of dirt and grime piled up at the bottom of your lifted lid.",
    "Turn a vacuum on to the highest suction setting and use the vacuum’s hose to remove larger pieces from the bottom of your lid.",
    "Wipe the roof of the lid with a damp cloth.",
    "Vacuuming the residue from the bottom of your lid will keep it from falling into the body of the grill when you close your lid.",
    "Remove the grill base to dump out old ash and residue.",
    "Take your grates out and set them aside.",
    "Depending on the brand and style of your grill, the base can either be removed by reaching in the grill and lifting it out, or by sliding a tray out of the side of the grill.",
    "You may need to disassemble your burners by unscrewing each gas line where it attaches to the body before you can get your base out.",
    "Once removed, dump the ash and residue into a non-combustible trash receptacle.",
    "Set the grill base aside.",
    "Make sure that you aren’t dumping any hot materials into the garbage.",
    "Wait for your grill to cool before doing this if it’s still hot.",
    "Scrubbing the Interior Body of a Gas Grill Scrub the interior body of your grill with a scraper and nylon brush.",
    "Scrape large, flat sections of your grill’s interior with your scraper.",
    "Depending on your grill, your burners may still be attached.",
    "If they are, scrub over them in the same direction as the gas slits with a nylon scrub brush.",
    "After you’ve scraped flat surfaces, scrub each exposed area with your nylon brush in aggressive back-and-forth strokes.",
    "If you scrub your burners perpendicular to the slits, you could accidentally knock debris into the holes.",
    "If your grill has burner covers, leave them on.",
    "They’re there to protect your burners and keep sensitive parts from getting damaged.",
    "They also keep grease and dirt off of the burners, so you won’t need to scrub them anyway.",
    "Empty your grease pan or bottom tray and wipe it.",
    "At the very bottom of your grill’s body, there will be a removable pan or tray that is designed to catch debris, residue, or grease.",
    "Once you’ve scraped the body of the grill, remove the grease pan or bottom tray and empty it in a noncombustible trash bin.",
    "Wipe the tray or pan down with a warm, damp cloth and let it air dry before returning it.Tip: The grease pan or bottom tray is normally going to be made of a heavy-duty material like porcelain, ceramic, or a hard metal.",
    "It should be relatively easy to wipe down.",
    "If it’s rusty or looks worn down, consider replacing it.",
    "Use steel wool and warm water to scrub down the heat deflector.",
    "Some grills have a heat deflector at the bottom of the exhaust or burner system that deflects heat away from the grill.",
    "It’s usually a flat piece of thin metal with a ridge in the middle, and they usually have thin slits across them to let excess heat out.",
    "Lift this piece out if you have one and soak it in warm water before aggressively scrubbing it with steel wool.",
    "This part doesn’t really need to look like new when you’re done, since it doesn’t influence the flavor of food.",
    "Vacuum the inside and wipe down all exterior surfaces with a damp cloth.",
    "Use a vacuum with a hose to pull out any remaining debris or residue that you’ve scraped off from the inside of the grill.",
    "Once the interior surfaces of your grill have been cleaned, you can wipe down the outside of the grill with a damp microfiber cloth.",
    "Rinse your cloth in warm water and then wring it out before wiping down the exterior of your grill in soft circular motions.",
    "Cover each portion of the grill to lift up any grime and remove any food stains.",
    "Put your grill cover over the grill after you’re done to protect it from the elements.",
    "Maintaining a Charcoal Grill Light a fire in your charcoal grill and let it burn.",
    "Let your fire run for 10-15 minutes.",
    "This will burn off any residue or grime that hasn’t been heated yet.",
    "Let your fire burn out and wait for your grill to cool before removing the lid.",
    "Depending on how much charcoal you’re using, it could take a few hours for your grill to cool.",
    "Wipe the lid down with a sponge and dish soap.",
    "Use a well-soaped sponge and warm water to scrub the roof of your lid.",
    "Scrub hard in a circular motion and cover each part of the lid twice.",
    "Rinse your lid in warm water and dry it with a clean cloth.",
    "Most charcoal grill lids are coated in an enamel that make it easy to clean.",
    "If your grill’s lid is difficult to clean, it may be a sign that you need a new grill.",
    "Scrub the grill grates aggressively with a grill brush.",
    "Scrape vertically, going parallel to the cooking grid.",
    "You may need to scrape 4-5 times along each section of the grid to fully remove and food residue or charcoal dust.",
    "Flip your grill grates over and scrape the bottom of the grates as well.",
    "Rinse them under cold water when you’re done.",
    "If you have a lot of residue that you’re struggling to remove, you can add dish soap to the tips of your grill brush.",
    "You’ll have to rinse the grates multiple times afterwards though to ensure that you don’t get any soap residue on your food in the future.",
    "Empty your coals and wash the inside bowl.",
    "Put on a pair of rubber gloves.",
    "Dump out the charcoal ashes into a nonflammable trash receptacle.",
    "Use a steel wool pad to scrape the inside of your charcoal grill’s bowl.",
    "Scrape aggressively in back-and-forth strokes until all of the gunk and grease is removed.",
    "Rinse it with a wet sponge and pat them dry with paper towels or a clean rag.Tip: If your charcoal grill has an ash tray at the bottom you can wipe it down with water and a sponge.",
    "The ash tray just catches debris and doesn’t come in contact with food, so you don’t need it to be sparkly clean.",
    "Cover your grill when you’re done.",
    "Cleaning an Indoor Electric Grill Unplug the grill and wait for it to cool.",
    "It’s best to clean an electric grill after you’ve recently used it.",
    "Before you do start the cleaning process, unplug the grill and let it cool for 1-1.5 hours.",
    "Remove the electronic thermostat and set it aside while you’re waiting for it to cool.",
    "Hand wipe the thermostat with a microfiber cloth or paper towel.",
    "You don’t want to get any electric components of the thermostat wet, so use a dry cloth or towel.",
    "Remove the grill’s heating surface and dishwash it if you can.",
    "Some electronic grills have a removable heating plate.",
    "If you can remove your heating plate, take it out and dishwash it with normal detergent.",
    "If you don’t have a dishwasher, you can scrub it with a sponge and dish soap before rinsing it.",
    "Let the heating surface air dry.",
    "Wipe the heating surface with dish soap if it can’t be removed.",
    "If you can’t take the heating surface of the grill off, take a sponge and add a drop of dish soap.",
    "Run the sponge through warm water and wring it out.",
    "Scrub the heating surface with your sponge by scrubbing in gentle, circular motions.",
    "Run your sponge through warm water again and wring it out repeatedly until the soap is removed.",
    "Scrub your heating surface a second time.",
    "You may need to rinse the sponge multiple times to get the soap out, and the surface may need to be scrubbed more than once to remove grime or dirt.",
    "Clean the body of the grill with a sponge or microfiber cloth.",
    "Run a sponge or cloth under warm water and wring it out.",
    "Run your sponge and cloth along the exterior surfaces of the grill.",
    "Clean in circular motions so that you don’t leave water stains.",
    "Dry the body of the grill with paper towels or a dry cloth.",
    "Use a chemical cleaner if you want to remove discoloration.",
    "Put on rubber gloves and preheat your grill to 225 °F (107 °C).",
    "Combine 1 cup (240 mL) of hot water and 1 tablespoon (15 mL) of commercial chemical grill cleaner in a bowl.",
    "Pour the solution over the heating surface and scrub with a wire brush that has a long handle.",
    "Scrub quickly and aggressively until the discoloration is removed.",
    "Rinse the heating surface with dish soap and warm water before letting it air dry.Warning: Only clean a grill with chemical cleaners once in a while.",
    "The cleaner will leave a residue behind if you don’t properly rinse your grill, which can change the flavor of your food in the future.",
    "Wipe the surface of your grill with cooking oil.",
    "Let your grill cool for 30-45 minutes.",
    "After using a chemical cleaner to remove discoloration, wipe the surface of your grill with a dollop of cooking oil and a paper towel.",
    "This will ensure that your grill doesn’t discolor in the future."
  ],
  "tyn_section":[
    "Grill brush",
    "Nylon scrub brush",
    "Plastic scraper",
    "Microfiber cloth",
    "Vacuum with hose",
    "Steel wool",
    "Bucket",
    "Soap",
    "Sponge",
    "Rubber gloves",
    "Paper towels or rag",
    "Dish soap",
    "Measuring cup",
    "Chemical cleaner",
    "Wire brush with handle"
  ],
  "tyn_model":[
    "grill",
    "sponge",
    "water",
    "dish soap",
    "vacuum",
    "charcoal grill",
    "rubber gloves",
    "grill brush",
    "plastic scraper",
    "scraper",
    "grease pan",
    "microfiber cloth",
    "gas grill",
    "nylon brush",
    "steel wool",
    "charcoal",
    "grill grates",
    "paper towels",
    "chemical cleaner",
    "cooking oil",
    "pans",
    "propane",
    "natural gas",
    "grill cleaning chemical",
    "hose",
    "grates",
    "tray",
    "nylon scrub brush",
    "burner",
    "grills",
    "grill cover",
    "charcoal dust",
    "coals",
    "steel wool pad",
    "electric grill",
    "electronic thermostat",
    "normal detergent",
    "soap",
    "dry cloth",
    "hot water",
    "grill cleaner",
    "bowl",
    "wire brush",
    "chemical cleaners",
    "paper towel"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.2222222222,
    "f1":0.3333333333,
    "avg_pos":0.1555555556
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.3555555556,
    "f1":0.4923076923
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8666666667,
    "p":0.5777777778,
    "f1":0.6933333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.2666666667,
    "f1":0.380952381
  }
}