{
  "title":"How to Acquire the Taste for Wine",
  "url":"https://www.wikihow.com/Acquire-the-Taste-for-Wine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "methods":[
    {
      "name":"Tasting Wine Correctly",
      "steps":[
        {
          "headline":"Pour a glass of wine and let it sit for 5 to 30 minutes.",
          "description":"Newly opened wine needs to be exposed to air so that it oxidizes and produces a more mellow and pleasant beverage. Drinking wine as soon as the bottle is opened may give the wine a thin body rather than a fuller taste. Expert Answer\t\t\t\t\t\tQ\t\t\t\tWhen asked how someone should taste wine...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSamuel Bogue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWine Director & Consultant\t\t\t\t\t\t\t\t\t\tSamuel Bogue is the Wine Director of the Ne Timeas Restaurant Group in San Francisco, California. He gained his Sommelier certification in 2013, is a Zagat \"30 Under 30\" award winner, and is a wine consultant for the San Francisco Bay Area's top restaurants. EXPERT ADVICE\t\t\t\t...Sam Bogue, a sommelier, says: \"Start by looking at the wine. Pay attention to the color, and whether it's transparent or opaque. Then, I like to smell the wine, then swirl it in the glass, then smell it again. I think you get a little bit of a different aroma before you aerate the wine. Try to think about what fruits, spices, or herbs the smell reminds you of.\""
        },
        {
          "headline":"Use a proper wine glass.",
          "description":"The classic wine glass traps the aromas of the wine so that you can smell it more accurately. Some wine aficionados even put their noses into the glass to capture all of the smells. You may experience smells that resemble cut fruit, minced herbs, or even hot tea."
        },
        {
          "headline":"Swirl the wine in your glass.",
          "description":"Observe how the wine sticks to the side of the glass or if it sloshes around quickly. Additionally, look at the color of the wine. Experts can tell how a wine will taste just by looking at it. For now, you want to pay attention to how the wine behaves compared with how it tastes. When a wine has “legs,” that means it sticks to the side of the glass and contains lots of fruit juice. The darker and deeper the color of a wine, the bolder the taste should be."
        },
        {
          "headline":"Take a sip of wine.",
          "description":"Make sure it flows over the tip of your tongue, both sides, underneath, and into the back of your mouth. After noticing the tastes, either swallow or spit out the wine, then breathe in through your mouth drawing air over all those parts of your tongue again. This will cause the tastes from the wine to change, sometimes quite suddenly and sharply. Tasting notes are the individual flavors you can pick out of the overall experience of a certain wine. At first you might not be able to pick out flavors like chocolate or oak, but practice will train your tastebuds to recognize unusual tastes. You can cheat by looking at the bottle's label or asking someone else what they taste until you can start picking out specific notes on your own."
        },
        {
          "headline":"Develop your palate.",
          "description":"Keep track of what you taste in certain wines and what you like and don’t like. Write down your impressions of each wine. This way you can go back and reference past tastings and look for patterns in your preferences. Wines have four basic components: taste, tannins, alcohol, and acidity. Each of these components ranges in intensity in different wines and will affect whether you like a certain wine or not. As you continue to try different wines, you may find that dry red wines are not your favorite, but you enjoy a dry and tart white wine variety."
        }
      ]
    },
    {
      "name":"Trying Different Varieties",
      "steps":[
        {
          "headline":"Try different kinds of wine.",
          "description":"You may think you dislike wine because the ones you've tried aren't compatible with your preferences. But by exposing yourself to a wide variety of wines, you’ll increase the likelihood that you'll find at least one kind that you truly enjoy."
        },
        {
          "headline":"Narrow things down by starting with one type of wine.",
          "description":"Don’t be overwhelmed by the amount of wines that are available. The easiest way to break them down is into white and red categories. From there, you can begin testing your palate on blends, ages, and even individual vineyards. Sweeter white wines like Viognier or Riesling may be easier for a novice to appreciate than a very dry Sauvignon Blanc or an oaky Chardonnay. Similarly for red wines, Zinfandels with more pronounced fruit flavors may be more accessible than drier wines such as Cabernet or Pinot Noir. Different blends of wine combine the characteristics of varietal grapes to create balanced and complex flavors. There is more to wines than simply red or white. Blushes, ice wines, sparkling wines, madeiras, ports, and sherries are all different methods to process the fruit, juice, or the wine."
        },
        {
          "headline":"Experiment with wines from different countries.",
          "description":"Depending on where a wine is sourced will determine how it smells and taste. Some of the most popular and accessible wines come from France, Italy, Spain, Argentina, and the United States. Different countries will vary in soil types as well as production methods. This creates a whole new world of options to try. In general, new world wines from California and South America have more pronounced fruit flavors and are less dry than wines from France or Italy."
        },
        {
          "headline":"Compare old wine and new wines.",
          "description":"The age of a wine will also determine its taste and aroma nuances. Try both young and old wines, and if possible purchase a batch of the same wine and drink one from each year to experience the subtle changes a wine goes through as it changes over time."
        },
        {
          "headline":"Mix wine with other ingredients.",
          "description":"Wine snobs turn up their noses at the idea of mixing wine with other things, but wine on ice, mixed with fruit juices, mixed with liquors or liqueurs, or other things often results in great tasting beverages. Add ice, especially with heavier, sweeter, or very rich wines. The coldness of the ice slightly numbs your taste buds, easing the strength (and the astringent qualities) of some wines, especially reds."
        }
      ]
    },
    {
      "name":"Exploring Wine with Others",
      "steps":[
        {
          "headline":"Go to a wine tasting.",
          "description":"The best way to learn more is to attend wine tastings with friends at local wine shops, bars, or even art galleries. The advantage of going to a wine tasting is that you can try several kinds of wines without committing to buying a bottle you may not enjoy. Some wine tastings have small refreshments for cleansing your palate in between wines as well as buckets for spitting out wine so you don’t accidentally drink the equivalent of a whole bottle. Don’t take advantage of your host. The goal is to taste new wines, not get drunk."
        },
        {
          "headline":"Visit a vineyard and take a tour.",
          "description":"Wine tours are popular throughout the world and they’re a great way to learn about the process of making wine and all of the details that go into a simple glass. Come prepared to walk the grounds of the vineyard and remember to stay hydrated. Look into the fees and prices. Sometimes if you buy a bottle during the tour, some of the costs may be waived. Go with a group. It can be more fun and may be cheaper as well."
        },
        {
          "headline":"Pair different wines with different foods at meals.",
          "description":"Oftentimes a review or the wine bottle label will recommend different cheeses or meats to consume with the wine you’re drinking. Eating and cooking is simply balancing the aspects of fats, acids, salt, and sweet tastes. Wine pairings are a great excuse to make a meal centered around a certain red wine and steak and inviting your friends over to try it. Some wines are best paired with foods from the same region. For example, a wine from Northern Italy may pair best with a goat cheese from a farm in the upper regions of Italy. Pairings are helpful because you may not like wine for its acidity, but if you know that eating a sweet fruit with it helps to balance the flavors, you may enjoy it more."
        },
        {
          "headline":"Listen to how other people talk about wine.",
          "description":"You don’t have to learn all of the lingo that wine experts use, but pay attention to how they talk about a wine’s aromas and tastes. Just by listening you might gain a deeper appreciation for a certain variety or grape or production method. Your friends and family are also good gauges. If you share similar tastes, ask them for a recommendation and why they prefer a particular type. At the very least, learn to pronounce the names of the various types of wines."
        },
        {
          "headline":"Drink wines in various settings and occasions.",
          "description":"Wine is appropriate for all sorts of events and places and different wines suit different settings and even seasons of the year. You may find that you prefer to drink wine instead of a beer at sporting events or enjoy wine with dessert only. A sparkly or sweet wine may be best for a celebration and a dark red might better suit an evening at home with a good book. Some people agree that chilled wines are best for warm summer days and warm, mulled wines are best for long nights in the winter."
        },
        {
          "headline":"Continue to try different wines.",
          "description":"Your taste buds change all the time and you may find that a wine you couldn’t stand before is now your favorite. There are so many different options for wine that you almost can’t exhaust your options. So be patient and keep exploring."
        }
      ]
    }
  ],
  "text":" Tasting Wine Correctly Pour a glass of wine and let it sit for 5 to 30 minutes. Newly opened wine needs to be exposed to air so that it oxidizes and produces a more mellow and pleasant beverage. Drinking wine as soon as the bottle is opened may give the wine a thin body rather than a fuller taste. Expert Answer\t\t\t\t\t\tQ\t\t\t\tWhen asked how someone should taste wine...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSamuel Bogue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWine Director & Consultant\t\t\t\t\t\t\t\t\t\tSamuel Bogue is the Wine Director of the Ne Timeas Restaurant Group in San Francisco, California. He gained his Sommelier certification in 2013, is a Zagat \"30 Under 30\" award winner, and is a wine consultant for the San Francisco Bay Area's top restaurants. EXPERT ADVICE\t\t\t\t...Sam Bogue, a sommelier, says: \"Start by looking at the wine. Pay attention to the color, and whether it's transparent or opaque. Then, I like to smell the wine, then swirl it in the glass, then smell it again. I think you get a little bit of a different aroma before you aerate the wine. Try to think about what fruits, spices, or herbs the smell reminds you of.\" Use a proper wine glass. The classic wine glass traps the aromas of the wine so that you can smell it more accurately. Some wine aficionados even put their noses into the glass to capture all of the smells. You may experience smells that resemble cut fruit, minced herbs, or even hot tea. Swirl the wine in your glass. Observe how the wine sticks to the side of the glass or if it sloshes around quickly. Additionally, look at the color of the wine. Experts can tell how a wine will taste just by looking at it. For now, you want to pay attention to how the wine behaves compared with how it tastes. When a wine has “legs,” that means it sticks to the side of the glass and contains lots of fruit juice. The darker and deeper the color of a wine, the bolder the taste should be. Take a sip of wine. Make sure it flows over the tip of your tongue, both sides, underneath, and into the back of your mouth. After noticing the tastes, either swallow or spit out the wine, then breathe in through your mouth drawing air over all those parts of your tongue again. This will cause the tastes from the wine to change, sometimes quite suddenly and sharply. Tasting notes are the individual flavors you can pick out of the overall experience of a certain wine. At first you might not be able to pick out flavors like chocolate or oak, but practice will train your tastebuds to recognize unusual tastes. You can cheat by looking at the bottle's label or asking someone else what they taste until you can start picking out specific notes on your own. Develop your palate. Keep track of what you taste in certain wines and what you like and don’t like. Write down your impressions of each wine. This way you can go back and reference past tastings and look for patterns in your preferences. Wines have four basic components: taste, tannins, alcohol, and acidity. Each of these components ranges in intensity in different wines and will affect whether you like a certain wine or not. As you continue to try different wines, you may find that dry red wines are not your favorite, but you enjoy a dry and tart white wine variety. Trying Different Varieties Try different kinds of wine. You may think you dislike wine because the ones you've tried aren't compatible with your preferences. But by exposing yourself to a wide variety of wines, you’ll increase the likelihood that you'll find at least one kind that you truly enjoy. Narrow things down by starting with one type of wine. Don’t be overwhelmed by the amount of wines that are available. The easiest way to break them down is into white and red categories. From there, you can begin testing your palate on blends, ages, and even individual vineyards. Sweeter white wines like Viognier or Riesling may be easier for a novice to appreciate than a very dry Sauvignon Blanc or an oaky Chardonnay. Similarly for red wines, Zinfandels with more pronounced fruit flavors may be more accessible than drier wines such as Cabernet or Pinot Noir. Different blends of wine combine the characteristics of varietal grapes to create balanced and complex flavors. There is more to wines than simply red or white. Blushes, ice wines, sparkling wines, madeiras, ports, and sherries are all different methods to process the fruit, juice, or the wine. Experiment with wines from different countries. Depending on where a wine is sourced will determine how it smells and taste. Some of the most popular and accessible wines come from France, Italy, Spain, Argentina, and the United States. Different countries will vary in soil types as well as production methods. This creates a whole new world of options to try. In general, new world wines from California and South America have more pronounced fruit flavors and are less dry than wines from France or Italy. Compare old wine and new wines. The age of a wine will also determine its taste and aroma nuances. Try both young and old wines, and if possible purchase a batch of the same wine and drink one from each year to experience the subtle changes a wine goes through as it changes over time. Mix wine with other ingredients. Wine snobs turn up their noses at the idea of mixing wine with other things, but wine on ice, mixed with fruit juices, mixed with liquors or liqueurs, or other things often results in great tasting beverages. Add ice, especially with heavier, sweeter, or very rich wines. The coldness of the ice slightly numbs your taste buds, easing the strength (and the astringent qualities) of some wines, especially reds. Exploring Wine with Others Go to a wine tasting. The best way to learn more is to attend wine tastings with friends at local wine shops, bars, or even art galleries. The advantage of going to a wine tasting is that you can try several kinds of wines without committing to buying a bottle you may not enjoy. Some wine tastings have small refreshments for cleansing your palate in between wines as well as buckets for spitting out wine so you don’t accidentally drink the equivalent of a whole bottle. Don’t take advantage of your host. The goal is to taste new wines, not get drunk. Visit a vineyard and take a tour. Wine tours are popular throughout the world and they’re a great way to learn about the process of making wine and all of the details that go into a simple glass. Come prepared to walk the grounds of the vineyard and remember to stay hydrated. Look into the fees and prices. Sometimes if you buy a bottle during the tour, some of the costs may be waived. Go with a group. It can be more fun and may be cheaper as well. Pair different wines with different foods at meals. Oftentimes a review or the wine bottle label will recommend different cheeses or meats to consume with the wine you’re drinking. Eating and cooking is simply balancing the aspects of fats, acids, salt, and sweet tastes. Wine pairings are a great excuse to make a meal centered around a certain red wine and steak and inviting your friends over to try it. Some wines are best paired with foods from the same region. For example, a wine from Northern Italy may pair best with a goat cheese from a farm in the upper regions of Italy. Pairings are helpful because you may not like wine for its acidity, but if you know that eating a sweet fruit with it helps to balance the flavors, you may enjoy it more. Listen to how other people talk about wine. You don’t have to learn all of the lingo that wine experts use, but pay attention to how they talk about a wine’s aromas and tastes. Just by listening you might gain a deeper appreciation for a certain variety or grape or production method. Your friends and family are also good gauges. If you share similar tastes, ask them for a recommendation and why they prefer a particular type. At the very least, learn to pronounce the names of the various types of wines. Drink wines in various settings and occasions. Wine is appropriate for all sorts of events and places and different wines suit different settings and even seasons of the year. You may find that you prefer to drink wine instead of a beer at sporting events or enjoy wine with dessert only. A sparkly or sweet wine may be best for a celebration and a dark red might better suit an evening at home with a good book. Some people agree that chilled wines are best for warm summer days and warm, mulled wines are best for long nights in the winter. Continue to try different wines. Your taste buds change all the time and you may find that a wine you couldn’t stand before is now your favorite. There are so many different options for wine that you almost can’t exhaust your options. So be patient and keep exploring.",
  "sentences":[
    " Tasting Wine Correctly Pour a glass of wine and let it sit for 5 to 30 minutes.",
    "Newly opened wine needs to be exposed to air so that it oxidizes and produces a more mellow and pleasant beverage.",
    "Drinking wine as soon as the bottle is opened may give the wine a thin body rather than a fuller taste.",
    "Expert Answer\t\t\t\t\t\tQ\t\t\t\tWhen asked how someone should taste wine...\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSamuel Bogue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWine Director & Consultant\t\t\t\t\t\t\t\t\t\tSamuel Bogue is the Wine Director of the Ne Timeas Restaurant Group in San Francisco, California.",
    "He gained his Sommelier certification in 2013, is a Zagat \"30 Under 30\" award winner, and is a wine consultant for the San Francisco Bay Area's top restaurants.",
    "EXPERT ADVICE\t\t\t\t...Sam Bogue, a sommelier, says: \"Start by looking at the wine.",
    "Pay attention to the color, and whether it's transparent or opaque.",
    "Then, I like to smell the wine, then swirl it in the glass, then smell it again.",
    "I think you get a little bit of a different aroma before you aerate the wine.",
    "Try to think about what fruits, spices, or herbs the smell reminds you of.\"",
    "Use a proper wine glass.",
    "The classic wine glass traps the aromas of the wine so that you can smell it more accurately.",
    "Some wine aficionados even put their noses into the glass to capture all of the smells.",
    "You may experience smells that resemble cut fruit, minced herbs, or even hot tea.",
    "Swirl the wine in your glass.",
    "Observe how the wine sticks to the side of the glass or if it sloshes around quickly.",
    "Additionally, look at the color of the wine.",
    "Experts can tell how a wine will taste just by looking at it.",
    "For now, you want to pay attention to how the wine behaves compared with how it tastes.",
    "When a wine has “legs,” that means it sticks to the side of the glass and contains lots of fruit juice.",
    "The darker and deeper the color of a wine, the bolder the taste should be.",
    "Take a sip of wine.",
    "Make sure it flows over the tip of your tongue, both sides, underneath, and into the back of your mouth.",
    "After noticing the tastes, either swallow or spit out the wine, then breathe in through your mouth drawing air over all those parts of your tongue again.",
    "This will cause the tastes from the wine to change, sometimes quite suddenly and sharply.",
    "Tasting notes are the individual flavors you can pick out of the overall experience of a certain wine.",
    "At first you might not be able to pick out flavors like chocolate or oak, but practice will train your tastebuds to recognize unusual tastes.",
    "You can cheat by looking at the bottle's label or asking someone else what they taste until you can start picking out specific notes on your own.",
    "Develop your palate.",
    "Keep track of what you taste in certain wines and what you like and don’t like.",
    "Write down your impressions of each wine.",
    "This way you can go back and reference past tastings and look for patterns in your preferences.",
    "Wines have four basic components: taste, tannins, alcohol, and acidity.",
    "Each of these components ranges in intensity in different wines and will affect whether you like a certain wine or not.",
    "As you continue to try different wines, you may find that dry red wines are not your favorite, but you enjoy a dry and tart white wine variety.",
    "Trying Different Varieties Try different kinds of wine.",
    "You may think you dislike wine because the ones you've tried aren't compatible with your preferences.",
    "But by exposing yourself to a wide variety of wines, you’ll increase the likelihood that you'll find at least one kind that you truly enjoy.",
    "Narrow things down by starting with one type of wine.",
    "Don’t be overwhelmed by the amount of wines that are available.",
    "The easiest way to break them down is into white and red categories.",
    "From there, you can begin testing your palate on blends, ages, and even individual vineyards.",
    "Sweeter white wines like Viognier or Riesling may be easier for a novice to appreciate than a very dry Sauvignon Blanc or an oaky Chardonnay.",
    "Similarly for red wines, Zinfandels with more pronounced fruit flavors may be more accessible than drier wines such as Cabernet or Pinot Noir.",
    "Different blends of wine combine the characteristics of varietal grapes to create balanced and complex flavors.",
    "There is more to wines than simply red or white.",
    "Blushes, ice wines, sparkling wines, madeiras, ports, and sherries are all different methods to process the fruit, juice, or the wine.",
    "Experiment with wines from different countries.",
    "Depending on where a wine is sourced will determine how it smells and taste.",
    "Some of the most popular and accessible wines come from France, Italy, Spain, Argentina, and the United States.",
    "Different countries will vary in soil types as well as production methods.",
    "This creates a whole new world of options to try.",
    "In general, new world wines from California and South America have more pronounced fruit flavors and are less dry than wines from France or Italy.",
    "Compare old wine and new wines.",
    "The age of a wine will also determine its taste and aroma nuances.",
    "Try both young and old wines, and if possible purchase a batch of the same wine and drink one from each year to experience the subtle changes a wine goes through as it changes over time.",
    "Mix wine with other ingredients.",
    "Wine snobs turn up their noses at the idea of mixing wine with other things, but wine on ice, mixed with fruit juices, mixed with liquors or liqueurs, or other things often results in great tasting beverages.",
    "Add ice, especially with heavier, sweeter, or very rich wines.",
    "The coldness of the ice slightly numbs your taste buds, easing the strength (and the astringent qualities) of some wines, especially reds.",
    "Exploring Wine with Others Go to a wine tasting.",
    "The best way to learn more is to attend wine tastings with friends at local wine shops, bars, or even art galleries.",
    "The advantage of going to a wine tasting is that you can try several kinds of wines without committing to buying a bottle you may not enjoy.",
    "Some wine tastings have small refreshments for cleansing your palate in between wines as well as buckets for spitting out wine so you don’t accidentally drink the equivalent of a whole bottle.",
    "Don’t take advantage of your host.",
    "The goal is to taste new wines, not get drunk.",
    "Visit a vineyard and take a tour.",
    "Wine tours are popular throughout the world and they’re a great way to learn about the process of making wine and all of the details that go into a simple glass.",
    "Come prepared to walk the grounds of the vineyard and remember to stay hydrated.",
    "Look into the fees and prices.",
    "Sometimes if you buy a bottle during the tour, some of the costs may be waived.",
    "Go with a group.",
    "It can be more fun and may be cheaper as well.",
    "Pair different wines with different foods at meals.",
    "Oftentimes a review or the wine bottle label will recommend different cheeses or meats to consume with the wine you’re drinking.",
    "Eating and cooking is simply balancing the aspects of fats, acids, salt, and sweet tastes.",
    "Wine pairings are a great excuse to make a meal centered around a certain red wine and steak and inviting your friends over to try it.",
    "Some wines are best paired with foods from the same region.",
    "For example, a wine from Northern Italy may pair best with a goat cheese from a farm in the upper regions of Italy.",
    "Pairings are helpful because you may not like wine for its acidity, but if you know that eating a sweet fruit with it helps to balance the flavors, you may enjoy it more.",
    "Listen to how other people talk about wine.",
    "You don’t have to learn all of the lingo that wine experts use, but pay attention to how they talk about a wine’s aromas and tastes.",
    "Just by listening you might gain a deeper appreciation for a certain variety or grape or production method.",
    "Your friends and family are also good gauges.",
    "If you share similar tastes, ask them for a recommendation and why they prefer a particular type.",
    "At the very least, learn to pronounce the names of the various types of wines.",
    "Drink wines in various settings and occasions.",
    "Wine is appropriate for all sorts of events and places and different wines suit different settings and even seasons of the year.",
    "You may find that you prefer to drink wine instead of a beer at sporting events or enjoy wine with dessert only.",
    "A sparkly or sweet wine may be best for a celebration and a dark red might better suit an evening at home with a good book.",
    "Some people agree that chilled wines are best for warm summer days and warm, mulled wines are best for long nights in the winter.",
    "Continue to try different wines.",
    "Your taste buds change all the time and you may find that a wine you couldn’t stand before is now your favorite.",
    "There are so many different options for wine that you almost can’t exhaust your options.",
    "So be patient and keep exploring."
  ],
  "tyn_section":[
    "Wine",
    "Glass",
    "Decanter (optional)"
  ],
  "tyn_model":[
    "wine",
    "wines",
    "sommelier",
    "glass",
    "wine glass",
    "ice",
    "herbs",
    "“legs",
    "” that",
    "fruit juice",
    "alcohol",
    "cabernet",
    "pinot noir",
    "blushes",
    "ports",
    "wine tasting",
    "steak",
    "goat cheese"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1111111111,
    "f1":0.1904761905,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.2222222222,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.2222222222,
    "f1":0.3333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1111111111,
    "f1":0.1904761905
  }
}