{
  "title":"How to Make Carrot Cake",
  "url":"https://www.wikihow.com/Make-Carrot-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Vegetable Cakes"
  ],
  "parts":[
    {
      "name":"Making Simple Carrot Cake",
      "steps":[
        {
          "headline":"Preheat the oven to 350 °F (177 °C) and grease a baking pan.",
          "description":"If you'd like to make a large, single layer cake, spray a 9 x 13 (22 x 33 cm) cake pan with cooking spray. For a round, double-layered cake, spray 2 9-in (22 cm) cake pans. Set the prepared pan(s) aside while you make the cake batter. For the best results, use pans that are metal instead of glass or ceramic."
        },
        {
          "headline":"Mix the sugar, oil, eggs, and vanilla together.",
          "description":"Measure 2 cups (400 g) of granulated sugar into a large mixing bowl along with 1 ⁄3 cups (320 ml) vegetable oil, and 3 extra-large eggs that are at room temperature. Beat them on medium speed for about 1 minute and then beat in 1 teaspoon (4.9 ml) vanilla extract. If you don't have an electric mixer, beat the mixture with a spoon or whisk until it's pale yellow."
        },
        {
          "headline":"Whisk together the flour, cinnamon, baking soda, and salt.",
          "description":"Get out another mixing bowl and put 2 1/2 cups (300 g) of the flour into it. Add 2 teaspoons (4 g) of ground cinnamon, 2 teaspoons (12 g) of baking soda, and 1 1/2 teaspoons (8 g) of kosher salt. Use a whisk to combine the ingredients for about 30 seconds."
        },
        {
          "headline":"Add the dry ingredients to the wet ingredients.",
          "description":"Scoop the dry mixture into the bowl with the wet ingredients. Use a rubber spatula or spoon to stir the mixtures together until they're completely combined. Avoid stirring the batter too much or it will become tough and dense."
        },
        {
          "headline":"Coat the raisins and walnuts with the rest of the flour.",
          "description":"Put 1 cup (150 g) of raisins and 1 cup (125 g) of chopped walnuts into a bowl. Add the remaining 1 tablespoon (14.8 ml) (8 g) of flour and use your fingers or a spoon to coat the raisins and walnuts. Coating the walnuts and raisins with flour will prevent them from sinking to the bottom of the cake as it bakes."
        },
        {
          "headline":"Grate 1 pound (450 g) of carrots and add it to the bowl with the batter.",
          "description":"Rinse the carrots and grate them against the large-holed side of a box grater. Transfer the grated carrots to the bowl with the batter. Trim and discard the tops and ends of the carrots."
        },
        {
          "headline":"Fold in the grated carrots, pineapple, raisins, and walnuts.",
          "description":"Scoop the flour-coated raisins and walnuts into the bowl with the batter. Measure and add 1/2 cup (115 g) of diced pineapple as well. Use a rubber spatula to gently fold the ingredients into the batter until they're just incorporated."
        },
        {
          "headline":"Spread the batter in the prepared baking pan.",
          "description":"If you're using the larger pan, spread all of the batter into it. If you're using the prepared round pans, divide the batter equally between them. Consider using an offset spatula or the back of a spoon to smooth the batter into an even layer."
        },
        {
          "headline":"Bake the carrot cake for 55 to 60 minutes.",
          "description":"The cake should become golden brown and spring back if you touch the center. To ensure the cake is finished baking, insert a toothpick or skewer into the center. If it's finished, the toothpick will come out clean. If the toothpick comes out with batter on it, bake the cake for another 5 minutes and check again."
        },
        {
          "headline":"Cool the carrot cake on a wire rack for at least 1 hour.",
          "description":"Turn off the oven and remove the cake from the oven. Turn the cake out of the pan and onto a wire rack. Let the cake cool completely before you frost it. If you'd like to bake the cake in advance, wrap the cooled cake with plastic wrap and keep it at room temperature for up to 1 day before frosting it. If you prefer, freeze the unfrosted cake for up to 3 months."
        }
      ]
    },
    {
      "name":"Making the Easy Cream Cheese Frosting",
      "steps":[
        {
          "headline":"Put the cream cheese, butter, and vanilla in a mixing bowl.",
          "description":"Bring the ⁄4 pound (340 g) of cream cheese and ⁄2 pound (230 g) of butter to room temperature so they're very soft. Place them in a large mixing bowl along with 1 teaspoon (4.9 ml) of vanilla extract. If the cream cheese and butter are cold, the frosting will be lumpy."
        },
        {
          "headline":"Mix the cream cheese, butter, and vanilla.",
          "description":"If you're using a stand mixer, use the paddle attachment on medium speed to combine the frosting ingredients. Mix the frosting until it's just combined. You can also use an electric mixer or beat the frosting by hand."
        },
        {
          "headline":"Stir in the 4 1/2 cups (562 g) of sifted powdered sugar.",
          "description":"Turn off the mixer when you add the powdered sugar to the bowl. Then turn it on to low and slowly mix in the powdered sugar until it's incorporated. The frosting should be completely smooth."
        },
        {
          "headline":"Frost the cooled carrot cake.",
          "description":"Spread all of the frosting across the top of the 9 x 13 in (22 x 33 cm) cake. If you made 2 round cakes, set 1 of the cakes with the flat-side up on a cake plate. Spread 1/3 of the frosting on top and then set the other cake on it. Use the rest of the frosting to cover the top and sides of the cake. Place the leftover frosted cake in an airtight cake container and refrigerate it for up to 5 days. Set the cake out to come to room temperature before you serve it again."
        }
      ]
    }
  ],
  "text":" Making Simple Carrot Cake Preheat the oven to 350 °F (177 °C) and grease a baking pan. If you'd like to make a large, single layer cake, spray a 9 x 13 (22 x 33 cm) cake pan with cooking spray. For a round, double-layered cake, spray 2 9-in (22 cm) cake pans. Set the prepared pan(s) aside while you make the cake batter. For the best results, use pans that are metal instead of glass or ceramic. Mix the sugar, oil, eggs, and vanilla together. Measure 2 cups (400 g) of granulated sugar into a large mixing bowl along with 1 ⁄3 cups (320 ml) vegetable oil, and 3 extra-large eggs that are at room temperature. Beat them on medium speed for about 1 minute and then beat in 1 teaspoon (4.9 ml) vanilla extract. If you don't have an electric mixer, beat the mixture with a spoon or whisk until it's pale yellow. Whisk together the flour, cinnamon, baking soda, and salt. Get out another mixing bowl and put 2 1/2 cups (300 g) of the flour into it. Add 2 teaspoons (4 g) of ground cinnamon, 2 teaspoons (12 g) of baking soda, and 1 1/2 teaspoons (8 g) of kosher salt. Use a whisk to combine the ingredients for about 30 seconds. Add the dry ingredients to the wet ingredients. Scoop the dry mixture into the bowl with the wet ingredients. Use a rubber spatula or spoon to stir the mixtures together until they're completely combined. Avoid stirring the batter too much or it will become tough and dense. Coat the raisins and walnuts with the rest of the flour. Put 1 cup (150 g) of raisins and 1 cup (125 g) of chopped walnuts into a bowl. Add the remaining 1 tablespoon (14.8 ml) (8 g) of flour and use your fingers or a spoon to coat the raisins and walnuts. Coating the walnuts and raisins with flour will prevent them from sinking to the bottom of the cake as it bakes. Grate 1 pound (450 g) of carrots and add it to the bowl with the batter. Rinse the carrots and grate them against the large-holed side of a box grater. Transfer the grated carrots to the bowl with the batter. Trim and discard the tops and ends of the carrots. Fold in the grated carrots, pineapple, raisins, and walnuts. Scoop the flour-coated raisins and walnuts into the bowl with the batter. Measure and add 1/2 cup (115 g) of diced pineapple as well. Use a rubber spatula to gently fold the ingredients into the batter until they're just incorporated. Spread the batter in the prepared baking pan. If you're using the larger pan, spread all of the batter into it. If you're using the prepared round pans, divide the batter equally between them. Consider using an offset spatula or the back of a spoon to smooth the batter into an even layer. Bake the carrot cake for 55 to 60 minutes. The cake should become golden brown and spring back if you touch the center. To ensure the cake is finished baking, insert a toothpick or skewer into the center. If it's finished, the toothpick will come out clean. If the toothpick comes out with batter on it, bake the cake for another 5 minutes and check again. Cool the carrot cake on a wire rack for at least 1 hour. Turn off the oven and remove the cake from the oven. Turn the cake out of the pan and onto a wire rack. Let the cake cool completely before you frost it. If you'd like to bake the cake in advance, wrap the cooled cake with plastic wrap and keep it at room temperature for up to 1 day before frosting it. If you prefer, freeze the unfrosted cake for up to 3 months. Making the Easy Cream Cheese Frosting Put the cream cheese, butter, and vanilla in a mixing bowl. Bring the ⁄4 pound (340 g) of cream cheese and ⁄2 pound (230 g) of butter to room temperature so they're very soft. Place them in a large mixing bowl along with 1 teaspoon (4.9 ml) of vanilla extract. If the cream cheese and butter are cold, the frosting will be lumpy. Mix the cream cheese, butter, and vanilla. If you're using a stand mixer, use the paddle attachment on medium speed to combine the frosting ingredients. Mix the frosting until it's just combined. You can also use an electric mixer or beat the frosting by hand. Stir in the 4 1/2 cups (562 g) of sifted powdered sugar. Turn off the mixer when you add the powdered sugar to the bowl. Then turn it on to low and slowly mix in the powdered sugar until it's incorporated. The frosting should be completely smooth. Frost the cooled carrot cake. Spread all of the frosting across the top of the 9 x 13 in (22 x 33 cm) cake. If you made 2 round cakes, set 1 of the cakes with the flat-side up on a cake plate. Spread 1/3 of the frosting on top and then set the other cake on it. Use the rest of the frosting to cover the top and sides of the cake. Place the leftover frosted cake in an airtight cake container and refrigerate it for up to 5 days. Set the cake out to come to room temperature before you serve it again.",
  "sentences":[
    " Making Simple Carrot Cake Preheat the oven to 350 °F (177 °C) and grease a baking pan.",
    "If you'd like to make a large, single layer cake, spray a 9 x 13 (22 x 33 cm) cake pan with cooking spray.",
    "For a round, double-layered cake, spray 2 9-in (22 cm) cake pans.",
    "Set the prepared pan(s) aside while you make the cake batter.",
    "For the best results, use pans that are metal instead of glass or ceramic.",
    "Mix the sugar, oil, eggs, and vanilla together.",
    "Measure 2 cups (400 g) of granulated sugar into a large mixing bowl along with 1 ⁄3 cups (320 ml) vegetable oil, and 3 extra-large eggs that are at room temperature.",
    "Beat them on medium speed for about 1 minute and then beat in 1 teaspoon (4.9 ml) vanilla extract.",
    "If you don't have an electric mixer, beat the mixture with a spoon or whisk until it's pale yellow.",
    "Whisk together the flour, cinnamon, baking soda, and salt.",
    "Get out another mixing bowl and put 2 1/2 cups (300 g) of the flour into it.",
    "Add 2 teaspoons (4 g) of ground cinnamon, 2 teaspoons (12 g) of baking soda, and 1 1/2 teaspoons (8 g) of kosher salt.",
    "Use a whisk to combine the ingredients for about 30 seconds.",
    "Add the dry ingredients to the wet ingredients.",
    "Scoop the dry mixture into the bowl with the wet ingredients.",
    "Use a rubber spatula or spoon to stir the mixtures together until they're completely combined.",
    "Avoid stirring the batter too much or it will become tough and dense.",
    "Coat the raisins and walnuts with the rest of the flour.",
    "Put 1 cup (150 g) of raisins and 1 cup (125 g) of chopped walnuts into a bowl.",
    "Add the remaining 1 tablespoon (14.8 ml) (8 g) of flour and use your fingers or a spoon to coat the raisins and walnuts.",
    "Coating the walnuts and raisins with flour will prevent them from sinking to the bottom of the cake as it bakes.",
    "Grate 1 pound (450 g) of carrots and add it to the bowl with the batter.",
    "Rinse the carrots and grate them against the large-holed side of a box grater.",
    "Transfer the grated carrots to the bowl with the batter.",
    "Trim and discard the tops and ends of the carrots.",
    "Fold in the grated carrots, pineapple, raisins, and walnuts.",
    "Scoop the flour-coated raisins and walnuts into the bowl with the batter.",
    "Measure and add 1/2 cup (115 g) of diced pineapple as well.",
    "Use a rubber spatula to gently fold the ingredients into the batter until they're just incorporated.",
    "Spread the batter in the prepared baking pan.",
    "If you're using the larger pan, spread all of the batter into it.",
    "If you're using the prepared round pans, divide the batter equally between them.",
    "Consider using an offset spatula or the back of a spoon to smooth the batter into an even layer.",
    "Bake the carrot cake for 55 to 60 minutes.",
    "The cake should become golden brown and spring back if you touch the center.",
    "To ensure the cake is finished baking, insert a toothpick or skewer into the center.",
    "If it's finished, the toothpick will come out clean.",
    "If the toothpick comes out with batter on it, bake the cake for another 5 minutes and check again.",
    "Cool the carrot cake on a wire rack for at least 1 hour.",
    "Turn off the oven and remove the cake from the oven.",
    "Turn the cake out of the pan and onto a wire rack.",
    "Let the cake cool completely before you frost it.",
    "If you'd like to bake the cake in advance, wrap the cooled cake with plastic wrap and keep it at room temperature for up to 1 day before frosting it.",
    "If you prefer, freeze the unfrosted cake for up to 3 months.",
    "Making the Easy Cream Cheese Frosting Put the cream cheese, butter, and vanilla in a mixing bowl.",
    "Bring the ⁄4 pound (340 g) of cream cheese and ⁄2 pound (230 g) of butter to room temperature so they're very soft.",
    "Place them in a large mixing bowl along with 1 teaspoon (4.9 ml) of vanilla extract.",
    "If the cream cheese and butter are cold, the frosting will be lumpy.",
    "Mix the cream cheese, butter, and vanilla.",
    "If you're using a stand mixer, use the paddle attachment on medium speed to combine the frosting ingredients.",
    "Mix the frosting until it's just combined.",
    "You can also use an electric mixer or beat the frosting by hand.",
    "Stir in the 4 1/2 cups (562 g) of sifted powdered sugar.",
    "Turn off the mixer when you add the powdered sugar to the bowl.",
    "Then turn it on to low and slowly mix in the powdered sugar until it's incorporated.",
    "The frosting should be completely smooth.",
    "Frost the cooled carrot cake.",
    "Spread all of the frosting across the top of the 9 x 13 in (22 x 33 cm) cake.",
    "If you made 2 round cakes, set 1 of the cakes with the flat-side up on a cake plate.",
    "Spread 1/3 of the frosting on top and then set the other cake on it.",
    "Use the rest of the frosting to cover the top and sides of the cake.",
    "Place the leftover frosted cake in an airtight cake container and refrigerate it for up to 5 days.",
    "Set the cake out to come to room temperature before you serve it again."
  ],
  "tyn_section":[
    "Large mixing bowls",
    "Hand mixer or wooden spoon",
    "Whisk",
    "Measuring cups and spoons",
    "9 x 13 (22 x 33 cm) cake pan or 2 9-in (22 cm) cake pans",
    "Cooking spray",
    "Offset spatula",
    "Cake plate or stand",
    "Spatula",
    "Toothpick or skewer",
    "Wire rack"
  ],
  "tyn_model":[
    "flour",
    "bowl",
    "walnuts",
    "raisins",
    "carrots",
    "cream cheese",
    "spoon",
    "butter",
    "oven",
    "vanilla",
    "mixing bowl",
    "carrot cake",
    "powdered sugar",
    "baking pan",
    "vanilla extract",
    "electric mixer",
    "whisk",
    "baking soda",
    "rubber spatula",
    "pineapple",
    "cake pan",
    "cooking spray",
    "cake pans",
    "cake batter",
    "pans",
    "sugar",
    "oil",
    "eggs",
    "granulated sugar",
    "vegetable oil",
    "extra-large eggs",
    "cinnamon",
    "salt",
    "ground cinnamon",
    "kosher salt",
    "box grater",
    "spatula",
    "toothpick",
    "wire rack",
    "plastic wrap",
    "large mixing bowl",
    "stand mixer",
    "mixer",
    "cake plate",
    "airtight cake container"
  ],
  "simple_metrics":{
    "r":0.3636363636,
    "p":0.0888888889,
    "f1":0.1428571429,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6363636364,
    "p":0.1555555556,
    "f1":0.25
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7272727273,
    "p":0.1777777778,
    "f1":0.2857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3636363636,
    "p":0.0888888889,
    "f1":0.1428571429
  }
}