{
  "title":"How to Eat Crabs",
  "url":"https://www.wikihow.com/Eat-Crabs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Crab"
  ],
  "methods":[
    {
      "name":"Preparation",
      "steps":[
        {
          "headline":"Prepare your table.",
          "description":"Eating crabs is messy, so the table needs to be readied for splashes and leftovers. Lay down some newspaper or heavy-duty paper to protect the table, to absorb the juices, and to make clean up easier."
        },
        {
          "headline":"Gather a crab mallet, dull knife, and a claw cracker if desired.",
          "description":""
        },
        {
          "headline":"If you haven't already cooked the crabs, do so.",
          "description":"Steam the crabs; blue ones will usually turn deep red. Normally crabs are steamed with a layer of seasoning. For some ideas on how to cook crabs, see further: How to cook crabs, How to steam crabs and How to season crab legs."
        }
      ]
    },
    {
      "name":"Eating the Crab",
      "steps":[
        {
          "headline":"Pull off all the legs and claws with a twisting motion.",
          "description":"You can use a dull knife inserted into the joint to make removal easier. Sometimes a little meat will come out with the leg. Eat it."
        },
        {
          "headline":"Toss the legs (fins) and save the claws.",
          "description":"(You will get to them in a minute.)"
        },
        {
          "headline":"Turn the crab over on its back.",
          "description":"Open the apron––the apron looks like a tab."
        },
        {
          "headline":"Take the top half and the bottom half in each hand, as if you are opening a peanut butter and jelly sandwich.",
          "description":"Pull off the top shell. Take care and do this slowly. Toss the top shell. You will have cleaned out the crab and have removed the gills to show the shell."
        },
        {
          "headline":"Take this bottom half and break it in half.",
          "description":"Now take one of the halves and with a knife (or your hands) cut it in half. If you are using your hands, press down to break the chambers and then pull apart. Now you should have the meat exposed. Use your fingers to pull the meat out and enjoy! Use your knife to get the meat out of the smaller chambers."
        },
        {
          "headline":"Pick away all the chunks of meat in the body.",
          "description":"Start with the claws."
        },
        {
          "headline":"Crack the claws by using the hinged cracker, hitting them with the crab mallet, or using your knife.",
          "description":"The most efficient way to open a claw:\nLay your knife, sharp side down, on the middle of the red side of the claw. Then use the crab mallet to gently hit the knife, until the knife is halfway through the claw. Finally, pivot the knife to the side. That will open the claw and make it easier to eat. Then snap the shell open and eat the meat, avoiding the cartilage."
        }
      ]
    }
  ],
  "text":" Preparation Prepare your table. Eating crabs is messy, so the table needs to be readied for splashes and leftovers. Lay down some newspaper or heavy-duty paper to protect the table, to absorb the juices, and to make clean up easier. Gather a crab mallet, dull knife, and a claw cracker if desired.  If you haven't already cooked the crabs, do so. Steam the crabs; blue ones will usually turn deep red. Normally crabs are steamed with a layer of seasoning. For some ideas on how to cook crabs, see further: How to cook crabs, How to steam crabs and How to season crab legs. Eating the Crab Pull off all the legs and claws with a twisting motion. You can use a dull knife inserted into the joint to make removal easier. Sometimes a little meat will come out with the leg. Eat it. Toss the legs (fins) and save the claws. (You will get to them in a minute.) Turn the crab over on its back. Open the apron––the apron looks like a tab. Take the top half and the bottom half in each hand, as if you are opening a peanut butter and jelly sandwich. Pull off the top shell. Take care and do this slowly. Toss the top shell. You will have cleaned out the crab and have removed the gills to show the shell. Take this bottom half and break it in half. Now take one of the halves and with a knife (or your hands) cut it in half. If you are using your hands, press down to break the chambers and then pull apart. Now you should have the meat exposed. Use your fingers to pull the meat out and enjoy! Use your knife to get the meat out of the smaller chambers. Pick away all the chunks of meat in the body. Start with the claws. Crack the claws by using the hinged cracker, hitting them with the crab mallet, or using your knife. The most efficient way to open a claw:\nLay your knife, sharp side down, on the middle of the red side of the claw. Then use the crab mallet to gently hit the knife, until the knife is halfway through the claw. Finally, pivot the knife to the side. That will open the claw and make it easier to eat. Then snap the shell open and eat the meat, avoiding the cartilage.",
  "sentences":[
    " Preparation Prepare your table.",
    "Eating crabs is messy, so the table needs to be readied for splashes and leftovers.",
    "Lay down some newspaper or heavy-duty paper to protect the table, to absorb the juices, and to make clean up easier.",
    "Gather a crab mallet, dull knife, and a claw cracker if desired.",
    "If you haven't already cooked the crabs, do so.",
    "Steam the crabs; blue ones will usually turn deep red.",
    "Normally crabs are steamed with a layer of seasoning.",
    "For some ideas on how to cook crabs, see further: How to cook crabs, How to steam crabs and How to season crab legs.",
    "Eating the Crab Pull off all the legs and claws with a twisting motion.",
    "You can use a dull knife inserted into the joint to make removal easier.",
    "Sometimes a little meat will come out with the leg.",
    "Eat it.",
    "Toss the legs (fins) and save the claws.",
    "(You will get to them in a minute.)",
    "Turn the crab over on its back.",
    "Open the apron––the apron looks like a tab.",
    "Take the top half and the bottom half in each hand, as if you are opening a peanut butter and jelly sandwich.",
    "Pull off the top shell.",
    "Take care and do this slowly.",
    "Toss the top shell.",
    "You will have cleaned out the crab and have removed the gills to show the shell.",
    "Take this bottom half and break it in half.",
    "Now take one of the halves and with a knife (or your hands) cut it in half.",
    "If you are using your hands, press down to break the chambers and then pull apart.",
    "Now you should have the meat exposed.",
    "Use your fingers to pull the meat out and enjoy!",
    "Use your knife to get the meat out of the smaller chambers.",
    "Pick away all the chunks of meat in the body.",
    "Start with the claws.",
    "Crack the claws by using the hinged cracker, hitting them with the crab mallet, or using your knife.",
    "The most efficient way to open a claw:\nLay your knife, sharp side down, on the middle of the red side of the claw.",
    "Then use the crab mallet to gently hit the knife, until the knife is halfway through the claw.",
    "Finally, pivot the knife to the side.",
    "That will open the claw and make it easier to eat.",
    "Then snap the shell open and eat the meat, avoiding the cartilage."
  ],
  "tyn_section":[
    "Crab (steamed & seasoned)",
    "Crab mallet (looks like a small wooden hammer)",
    "Knife",
    "Crab cracker or metal nutcracker (optional)"
  ],
  "tyn_model":[
    "knife",
    "crabs",
    "crab mallet",
    "crab",
    "dull knife",
    "claw cracker",
    "seasoning",
    "crab legs",
    "peanut butter and jelly",
    "hinged cracker"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.1,
    "f1":0.1428571429,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.2,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.2,
    "f1":0.2222222222
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.1,
    "f1":0.1428571429
  }
}