{
  "title":"How to Construct a 90 Degrees Angle Using Compass and Ruler",
  "url":"https://www.wikihow.com/Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler",
  "category_hierarchy":[
    "Home and Garden",
    "Tools",
    "Measuring and Marking Tools"
  ],
  "methods":[
    {
      "name":"At the End of a Line Segment",
      "steps":[
        {
          "headline":"Mark the vertex of your angle anywhere on the paper.",
          "description":"Let us name this point as M."
        },
        {
          "headline":"Draw a ray MN, extending in any direction and of any length.",
          "description":"This will be one of the arms of our angle."
        },
        {
          "headline":"Place tip of the compass on point M and draw a circle cutting the ray MN at some point (say P).",
          "description":""
        },
        {
          "headline":"Keep the width of the compass the same.",
          "description":"Then place its tip on P and draw an arc cutting the circle at some point (say Q)."
        },
        {
          "headline":"Keep the width of the compass the same.",
          "description":"Place its tip on Q and draw another arc cutting the circle at another point (say R)."
        },
        {
          "headline":"Keep the tip of the compass still on Q.",
          "description":"Draw another arc somewhere outside the circle. For carrying out this step, you can set the width of the compass to any measure."
        },
        {
          "headline":"Keep the same width of the compass (as set in the previous step).",
          "description":"Now place its tip on R and draw another arc which cuts the arc drawn in the previous step at some point (say S)."
        },
        {
          "headline":"Connect the points M and S with a straight line.",
          "description":"Extend it to form a ray ML. The measure of the angle LMN is 90. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7b\\/Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\\/v4-460px-Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7b\\/Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\\/v4-760px-Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        }
      ]
    },
    {
      "name":"Through the Middle of a Line Segment",
      "steps":[
        {
          "headline":"Draw a straight line.",
          "description":"On a piece of paper, draw a line segment of any convenient length. Make it horizontal for the sake of simplicity, but it could be at any angle. Label the line segment AB."
        },
        {
          "headline":"Pick any point on AB.",
          "description":"Mark it, and label it O. O can be anywhere on the line segment, including at either end point (A or B). For convenience, let's put O somewhere near the middle of AB. The line segment could now be referred to as AOB."
        },
        {
          "headline":"Grab a compass.",
          "description":"Open the compass to a radius a little shorter than either AO or OB. Now place the compass point at O. Strike short arcs through AB on either side of O. The two arcs should have the same radius. Label those two points of intersection C and D. Now the line segment could be referred to as ACODB."
        },
        {
          "headline":"Strike two more arcs.",
          "description":"Place the compass point at C, and strike an arc to one side of the line segment. Then place the compass point at D, and strike a second arc of the same radius and on the same side of the line segment. Make sure those two arcs intersect. Call that point of intersection E."
        },
        {
          "headline":"Draw the 90° angle.",
          "description":"Draw a straight line from E to O. Line segment EO forms a 90° angle with line segment AB. It actually forms two 90° angles at O. If you were to extend EO beyond AB, you would form four 90° angles at O.Note that you can draw a 90° angle at either end of line segment AB if you want to (in other words at point A or point B). Simply extend AB beyond A or beyond B, and then follow the above steps. Point A (or point B) would serve as point O in the above instructions. This is essentially the same method featured in How to Construct a Perpendicular Line to a Given Line Through Point on the Line, Method 2."
        }
      ]
    }
  ],
  "text":" At the End of a Line Segment Mark the vertex of your angle anywhere on the paper. Let us name this point as M. Draw a ray MN, extending in any direction and of any length. This will be one of the arms of our angle. Place tip of the compass on point M and draw a circle cutting the ray MN at some point (say P).  Keep the width of the compass the same. Then place its tip on P and draw an arc cutting the circle at some point (say Q). Keep the width of the compass the same. Place its tip on Q and draw another arc cutting the circle at another point (say R). Keep the tip of the compass still on Q. Draw another arc somewhere outside the circle. For carrying out this step, you can set the width of the compass to any measure. Keep the same width of the compass (as set in the previous step). Now place its tip on R and draw another arc which cuts the arc drawn in the previous step at some point (say S). Connect the points M and S with a straight line. Extend it to form a ray ML. The measure of the angle LMN is 90. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7b\\/Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\\/v4-460px-Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7b\\/Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\\/v4-760px-Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Through the Middle of a Line Segment Draw a straight line. On a piece of paper, draw a line segment of any convenient length. Make it horizontal for the sake of simplicity, but it could be at any angle. Label the line segment AB. Pick any point on AB. Mark it, and label it O. O can be anywhere on the line segment, including at either end point (A or B). For convenience, let's put O somewhere near the middle of AB. The line segment could now be referred to as AOB. Grab a compass. Open the compass to a radius a little shorter than either AO or OB. Now place the compass point at O. Strike short arcs through AB on either side of O. The two arcs should have the same radius. Label those two points of intersection C and D. Now the line segment could be referred to as ACODB. Strike two more arcs. Place the compass point at C, and strike an arc to one side of the line segment. Then place the compass point at D, and strike a second arc of the same radius and on the same side of the line segment. Make sure those two arcs intersect. Call that point of intersection E. Draw the 90° angle. Draw a straight line from E to O. Line segment EO forms a 90° angle with line segment AB. It actually forms two 90° angles at O. If you were to extend EO beyond AB, you would form four 90° angles at O.Note that you can draw a 90° angle at either end of line segment AB if you want to (in other words at point A or point B). Simply extend AB beyond A or beyond B, and then follow the above steps. Point A (or point B) would serve as point O in the above instructions. This is essentially the same method featured in How to Construct a Perpendicular Line to a Given Line Through Point on the Line, Method 2.",
  "sentences":[
    " At the End of a Line Segment Mark the vertex of your angle anywhere on the paper.",
    "Let us name this point as M. Draw a ray MN, extending in any direction and of any length.",
    "This will be one of the arms of our angle.",
    "Place tip of the compass on point M and draw a circle cutting the ray MN at some point (say P).",
    "Keep the width of the compass the same.",
    "Then place its tip on P and draw an arc cutting the circle at some point (say Q).",
    "Keep the width of the compass the same.",
    "Place its tip on Q and draw another arc cutting the circle at another point (say R).",
    "Keep the tip of the compass still on Q.",
    "Draw another arc somewhere outside the circle.",
    "For carrying out this step, you can set the width of the compass to any measure.",
    "Keep the same width of the compass (as set in the previous step).",
    "Now place its tip on R and draw another arc which cuts the arc drawn in the previous step at some point (say S).",
    "Connect the points M and S with a straight line.",
    "Extend it to form a ray ML.",
    "The measure of the angle LMN is 90.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7b\\/Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\\/v4-460px-Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7b\\/Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\\/v4-760px-Construct-a-90-Degrees-Angle-Using-Compass-and-Ruler-Step-8Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Through the Middle of a Line Segment Draw a straight line.",
    "On a piece of paper, draw a line segment of any convenient length.",
    "Make it horizontal for the sake of simplicity, but it could be at any angle.",
    "Label the line segment AB.",
    "Pick any point on AB.",
    "Mark it, and label it O. O can be anywhere on the line segment, including at either end point (A or B).",
    "For convenience, let's put O somewhere near the middle of AB.",
    "The line segment could now be referred to as AOB.",
    "Grab a compass.",
    "Open the compass to a radius a little shorter than either AO or OB.",
    "Now place the compass point at O.",
    "Strike short arcs through AB on either side of O.",
    "The two arcs should have the same radius.",
    "Label those two points of intersection C and D. Now the line segment could be referred to as ACODB.",
    "Strike two more arcs.",
    "Place the compass point at C, and strike an arc to one side of the line segment.",
    "Then place the compass point at D, and strike a second arc of the same radius and on the same side of the line segment.",
    "Make sure those two arcs intersect.",
    "Call that point of intersection E. Draw the 90° angle.",
    "Draw a straight line from E to O.",
    "Line segment EO forms a 90° angle with line segment AB.",
    "It actually forms two 90° angles at O.",
    "If you were to extend EO beyond AB, you would form four 90° angles at O.Note that you can draw a 90° angle at either end of line segment AB if you want to (in other words at point A or point B).",
    "Simply extend AB beyond A or beyond B, and then follow the above steps.",
    "Point A (or point B) would serve as point O in the above instructions.",
    "This is essentially the same method featured in How to Construct a Perpendicular Line to a Given Line Through Point on the Line, Method 2."
  ],
  "tyn_section":[
    "Paper",
    "Pen or pencil",
    "Ruler or another straightedge",
    "Compass"
  ],
  "tyn_model":[
    "compass",
    "ruler",
    "paper",
    "parser"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.5,
    "f1":0.5,
    "avg_pos":0.5
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.5,
    "f1":0.5
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.5,
    "f1":0.5
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.5,
    "f1":0.5
  }
}