{
  "title":"How to Make Candy",
  "url":"https://www.wikihow.com/Make-Candy",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy"
  ],
  "methods":[
    {
      "name":"Making Simple Candy",
      "steps":[
        {
          "headline":"Make sugar candy.",
          "description":"This is a very simple candy that only requires sugar and water. Not so great for the teeth, this is best left for an occasional treat. Some variations on the basic sugar candy include maple sugar candy, sparkly sugar candy and Sweet and Low™ sugar candy."
        },
        {
          "headline":"Make rock or crystallized candy.",
          "description":"Rock or crystallized candy is a prettier version of sugar candy that requires a little extra effort but not much! This type of candy is a great one for parties and school fairs. Note––this form of candy is not to be confused with pulled rock candy (see below)."
        },
        {
          "headline":"Make toffee.",
          "description":"Toffee is another simple sugar treat that can be eaten plain or can be changed into many different flavors through the addition of flavoring extracts, nuts or fruit, and other items. There are quite a few possibilities here, including:\nEnglish toffee\nAlmond toffee\nMarshmallow toffee\nBacon toffee\n\nToffee apple."
        },
        {
          "headline":"Make cotton candy (also known as fairy floss).",
          "description":"This is a favorite treat for those attending fairs, showgrounds and sideshows. It's a little messy to make at home but it still tastes great!"
        },
        {
          "headline":"Make marshmallow.",
          "description":"A perennial favorite for many, marshmallows are fun snack foods, at home, for camping and hiking and when stuck in the office all day!"
        }
      ]
    },
    {
      "name":"Making Pulled Candy",
      "steps":[
        {
          "headline":"Make taffy.",
          "description":"Taffy is a well-known form of pulled candy."
        },
        {
          "headline":"Make boiled sweets.",
          "description":"Many boiled sweets are made using the pulling method. This type of traditional candy formed in the days when people had more time to be fussing about with candy making and there is an infinite variety of boiled sweet types and shapes that can be made. Typical pulled candies include humbugs and rock candy. See How to make old fashioned hard candy for a range of different boiled sweet types."
        }
      ]
    },
    {
      "name":"Making caramel candies",
      "steps":[
        {
          "headline":"Make caramel cream candies or basic caramels.",
          "description":"The basic caramel cream candies are vanilla flavored and allow the creaminess to take center stage above the flavor."
        },
        {
          "headline":"Try variations on the basic caramel theme.",
          "description":"There are many possibilities for changing the flavor and texture of caramels. Here are just a few examples of what you can make:\nPlain chocolate caramels\nChocolate nut caramels\nBacon caramels\nRibbon caramels\n\nVegan caramels."
        }
      ]
    },
    {
      "name":"Making Nutty Candy",
      "steps":[
        {
          "headline":"Use almonds for candy.",
          "description":"Almonds have a wonderful shape that is just perfect for turning into candies, and the flavor is liked by many. Here are some suggestions:\nMake candied almonds\n\nMake sugar or Jordan almonds – these are often used for wedding favors; they can be made plain white or can be colored to suit a theme\nMake almond bark\n\nChocolate coated almonds."
        },
        {
          "headline":"Use peanuts for candy.",
          "description":"Peanuts are a popular inclusion in many candies. Here are just a few ideas:\n\nPeanut brittle and chocolate peanut brittle\n\nHomemade versions of Reese's peanut butter bars"
        },
        {
          "headline":"Try walnuts for candies.",
          "description":"Walnut flavor and texture are ideal for candies. Try some of these recipes:\nMake candied walnuts\n\nChocolate caramel walnuts."
        },
        {
          "headline":"Use other nuts in candies.",
          "description":"Brazil nuts, pecans and hazelnuts are just some of the other nuts that are used frequently to turn into candies. Pecan brittle\n\nCashew brittle."
        }
      ]
    },
    {
      "name":"Making Fudge",
      "steps":[
        {
          "headline":"Make basic fudge.",
          "description":"Fudge can be very simple without much flavoring added and it still tastes terrific."
        },
        {
          "headline":"Make fudge varieties.",
          "description":"There are probably more fudge varieties than anyone can possibly ever name and likely even more yet to be invented! Categorized by type, here are a few fudge suggestions to get you started:\nChocolate fudge: Cocoa fudge, chocolate fudge, etc. Nut fudge: Peanut butter and marshmallow fudge, Snickers fudge, etc. Fun fudge: Cookies and cream fudge, fantasy fudge, etc. Fruit fudge: Orange fudge, apricot fudge, Coconut fudge, etc."
        }
      ]
    },
    {
      "name":"Making Fondant and Marzipan Candy",
      "steps":[
        {
          "headline":"Use marzipan to make candies.",
          "description":"Making marzipan is something you can do at home, or you can buy it pre-packaged. Typical marzipan candy shapes are fruit shapes––little apples, oranges, pears, lemons, strawberries, etc. Flowers are another ideal way to shape marzipan. Marzipan candies include using marzipan as a stuffing inside dried fruit pieces or between two nuts. Some more ideas include: Marzipan bunnies, marzipan toadstools and Christmas candy."
        },
        {
          "headline":"Use fondant to make candies.",
          "description":"Again, you can make fondant at home or buy it already made. Be aware that there are different types of fondant available, with varying levels of sugar and other ingredients, which affects softness, taste and durability. Ask the retailer for advice. Some may be more suited to covering cake than shaping as candies. Typical fondant candies include round balls or cookie cutter shapes. Fondant candies are often flavored and may be covered in chocolate to form chocolate creams of varying flavors."
        },
        {
          "headline":"Note that both marzipan and fondant can use the same shaping techniques.",
          "description":"Refer to the instructions of particular recipes for certainty; in some cases, the exact type of fondant (candy or cake) will impact whether it can be shaped."
        }
      ]
    },
    {
      "name":"Making Truffles",
      "steps":[
        {
          "headline":"Make basic chocolate truffles.",
          "description":"The natural flavor for a truffle is chocolate, so this is a good place to start! Variations on chocolate truffles include chocolate rum truffles and white chocolate truffles."
        },
        {
          "headline":"Branch out into different varieties of truffles.",
          "description":"There are many different choices possible, here are just a few suggestions:\nStrawberry balsamic truffles\nMint truffles\nChristmas pudding truffles\nOreo truffles\n\nPumpkin truffles."
        }
      ]
    }
  ],
  "text":" Making Simple Candy Make sugar candy. This is a very simple candy that only requires sugar and water. Not so great for the teeth, this is best left for an occasional treat. Some variations on the basic sugar candy include maple sugar candy, sparkly sugar candy and Sweet and Low™ sugar candy. Make rock or crystallized candy. Rock or crystallized candy is a prettier version of sugar candy that requires a little extra effort but not much! This type of candy is a great one for parties and school fairs. Note––this form of candy is not to be confused with pulled rock candy (see below). Make toffee. Toffee is another simple sugar treat that can be eaten plain or can be changed into many different flavors through the addition of flavoring extracts, nuts or fruit, and other items. There are quite a few possibilities here, including:\nEnglish toffee\nAlmond toffee\nMarshmallow toffee\nBacon toffee\n\nToffee apple. Make cotton candy (also known as fairy floss). This is a favorite treat for those attending fairs, showgrounds and sideshows. It's a little messy to make at home but it still tastes great! Make marshmallow. A perennial favorite for many, marshmallows are fun snack foods, at home, for camping and hiking and when stuck in the office all day! Making Pulled Candy Make taffy. Taffy is a well-known form of pulled candy. Make boiled sweets. Many boiled sweets are made using the pulling method. This type of traditional candy formed in the days when people had more time to be fussing about with candy making and there is an infinite variety of boiled sweet types and shapes that can be made. Typical pulled candies include humbugs and rock candy. See How to make old fashioned hard candy for a range of different boiled sweet types. Making caramel candies Make caramel cream candies or basic caramels. The basic caramel cream candies are vanilla flavored and allow the creaminess to take center stage above the flavor. Try variations on the basic caramel theme. There are many possibilities for changing the flavor and texture of caramels. Here are just a few examples of what you can make:\nPlain chocolate caramels\nChocolate nut caramels\nBacon caramels\nRibbon caramels\n\nVegan caramels. Making Nutty Candy Use almonds for candy. Almonds have a wonderful shape that is just perfect for turning into candies, and the flavor is liked by many. Here are some suggestions:\nMake candied almonds\n\nMake sugar or Jordan almonds – these are often used for wedding favors; they can be made plain white or can be colored to suit a theme\nMake almond bark\n\nChocolate coated almonds. Use peanuts for candy. Peanuts are a popular inclusion in many candies. Here are just a few ideas:\n\nPeanut brittle and chocolate peanut brittle\n\nHomemade versions of Reese's peanut butter bars Try walnuts for candies. Walnut flavor and texture are ideal for candies. Try some of these recipes:\nMake candied walnuts\n\nChocolate caramel walnuts. Use other nuts in candies. Brazil nuts, pecans and hazelnuts are just some of the other nuts that are used frequently to turn into candies. Pecan brittle\n\nCashew brittle. Making Fudge Make basic fudge. Fudge can be very simple without much flavoring added and it still tastes terrific. Make fudge varieties. There are probably more fudge varieties than anyone can possibly ever name and likely even more yet to be invented! Categorized by type, here are a few fudge suggestions to get you started:\nChocolate fudge: Cocoa fudge, chocolate fudge, etc. Nut fudge: Peanut butter and marshmallow fudge, Snickers fudge, etc. Fun fudge: Cookies and cream fudge, fantasy fudge, etc. Fruit fudge: Orange fudge, apricot fudge, Coconut fudge, etc. Making Fondant and Marzipan Candy Use marzipan to make candies. Making marzipan is something you can do at home, or you can buy it pre-packaged. Typical marzipan candy shapes are fruit shapes––little apples, oranges, pears, lemons, strawberries, etc. Flowers are another ideal way to shape marzipan. Marzipan candies include using marzipan as a stuffing inside dried fruit pieces or between two nuts. Some more ideas include: Marzipan bunnies, marzipan toadstools and Christmas candy. Use fondant to make candies. Again, you can make fondant at home or buy it already made. Be aware that there are different types of fondant available, with varying levels of sugar and other ingredients, which affects softness, taste and durability. Ask the retailer for advice. Some may be more suited to covering cake than shaping as candies. Typical fondant candies include round balls or cookie cutter shapes. Fondant candies are often flavored and may be covered in chocolate to form chocolate creams of varying flavors. Note that both marzipan and fondant can use the same shaping techniques. Refer to the instructions of particular recipes for certainty; in some cases, the exact type of fondant (candy or cake) will impact whether it can be shaped. Making Truffles Make basic chocolate truffles. The natural flavor for a truffle is chocolate, so this is a good place to start! Variations on chocolate truffles include chocolate rum truffles and white chocolate truffles. Branch out into different varieties of truffles. There are many different choices possible, here are just a few suggestions:\nStrawberry balsamic truffles\nMint truffles\nChristmas pudding truffles\nOreo truffles\n\nPumpkin truffles.",
  "sentences":[
    " Making Simple Candy Make sugar candy.",
    "This is a very simple candy that only requires sugar and water.",
    "Not so great for the teeth, this is best left for an occasional treat.",
    "Some variations on the basic sugar candy include maple sugar candy, sparkly sugar candy and Sweet and Low™ sugar candy.",
    "Make rock or crystallized candy.",
    "Rock or crystallized candy is a prettier version of sugar candy that requires a little extra effort but not much!",
    "This type of candy is a great one for parties and school fairs.",
    "Note––this form of candy is not to be confused with pulled rock candy (see below).",
    "Make toffee.",
    "Toffee is another simple sugar treat that can be eaten plain or can be changed into many different flavors through the addition of flavoring extracts, nuts or fruit, and other items.",
    "There are quite a few possibilities here, including:\nEnglish toffee\nAlmond toffee\nMarshmallow toffee\nBacon toffee\n\nToffee apple.",
    "Make cotton candy (also known as fairy floss).",
    "This is a favorite treat for those attending fairs, showgrounds and sideshows.",
    "It's a little messy to make at home but it still tastes great!",
    "Make marshmallow.",
    "A perennial favorite for many, marshmallows are fun snack foods, at home, for camping and hiking and when stuck in the office all day!",
    "Making Pulled Candy Make taffy.",
    "Taffy is a well-known form of pulled candy.",
    "Make boiled sweets.",
    "Many boiled sweets are made using the pulling method.",
    "This type of traditional candy formed in the days when people had more time to be fussing about with candy making and there is an infinite variety of boiled sweet types and shapes that can be made.",
    "Typical pulled candies include humbugs and rock candy.",
    "See How to make old fashioned hard candy for a range of different boiled sweet types.",
    "Making caramel candies Make caramel cream candies or basic caramels.",
    "The basic caramel cream candies are vanilla flavored and allow the creaminess to take center stage above the flavor.",
    "Try variations on the basic caramel theme.",
    "There are many possibilities for changing the flavor and texture of caramels.",
    "Here are just a few examples of what you can make:\nPlain chocolate caramels\nChocolate nut caramels\nBacon caramels\nRibbon caramels\n\nVegan caramels.",
    "Making Nutty Candy Use almonds for candy.",
    "Almonds have a wonderful shape that is just perfect for turning into candies, and the flavor is liked by many.",
    "Here are some suggestions:\nMake candied almonds\n\nMake sugar or Jordan almonds – these are often used for wedding favors; they can be made plain white or can be colored to suit a theme\nMake almond bark\n\nChocolate coated almonds.",
    "Use peanuts for candy.",
    "Peanuts are a popular inclusion in many candies.",
    "Here are just a few ideas:\n\nPeanut brittle and chocolate peanut brittle\n\nHomemade versions of Reese's peanut butter bars Try walnuts for candies.",
    "Walnut flavor and texture are ideal for candies.",
    "Try some of these recipes:\nMake candied walnuts\n\nChocolate caramel walnuts.",
    "Use other nuts in candies.",
    "Brazil nuts, pecans and hazelnuts are just some of the other nuts that are used frequently to turn into candies.",
    "Pecan brittle\n\nCashew brittle.",
    "Making Fudge Make basic fudge.",
    "Fudge can be very simple without much flavoring added and it still tastes terrific.",
    "Make fudge varieties.",
    "There are probably more fudge varieties than anyone can possibly ever name and likely even more yet to be invented!",
    "Categorized by type, here are a few fudge suggestions to get you started:\nChocolate fudge: Cocoa fudge, chocolate fudge, etc.",
    "Nut fudge: Peanut butter and marshmallow fudge, Snickers fudge, etc.",
    "Fun fudge: Cookies and cream fudge, fantasy fudge, etc.",
    "Fruit fudge: Orange fudge, apricot fudge, Coconut fudge, etc.",
    "Making Fondant and Marzipan Candy Use marzipan to make candies.",
    "Making marzipan is something you can do at home, or you can buy it pre-packaged.",
    "Typical marzipan candy shapes are fruit shapes––little apples, oranges, pears, lemons, strawberries, etc.",
    "Flowers are another ideal way to shape marzipan.",
    "Marzipan candies include using marzipan as a stuffing inside dried fruit pieces or between two nuts.",
    "Some more ideas include: Marzipan bunnies, marzipan toadstools and Christmas candy.",
    "Use fondant to make candies.",
    "Again, you can make fondant at home or buy it already made.",
    "Be aware that there are different types of fondant available, with varying levels of sugar and other ingredients, which affects softness, taste and durability.",
    "Ask the retailer for advice.",
    "Some may be more suited to covering cake than shaping as candies.",
    "Typical fondant candies include round balls or cookie cutter shapes.",
    "Fondant candies are often flavored and may be covered in chocolate to form chocolate creams of varying flavors.",
    "Note that both marzipan and fondant can use the same shaping techniques.",
    "Refer to the instructions of particular recipes for certainty; in some cases, the exact type of fondant (candy or cake) will impact whether it can be shaped.",
    "Making Truffles Make basic chocolate truffles.",
    "The natural flavor for a truffle is chocolate, so this is a good place to start!",
    "Variations on chocolate truffles include chocolate rum truffles and white chocolate truffles.",
    "Branch out into different varieties of truffles.",
    "There are many different choices possible, here are just a few suggestions:\nStrawberry balsamic truffles\nMint truffles\nChristmas pudding truffles\nOreo truffles\n\nPumpkin truffles."
  ],
  "tyn_section":[
    "Candy thermometer - this can be crucial for some candies, so it's a worthwhile investment",
    "Suitable candy making equipment - many candy making enthusiasts reserve special bowls, spoons, etc. just for making candies with",
    "Boxes, linings, bags, etc. for gifting candies",
    "Airtight storage containers, usually the best for keeping candies longer"
  ],
  "tyn_model":[
    "almonds",
    "marzipan",
    "fondant",
    "sugar candy",
    "nuts",
    "toffee",
    "taffy",
    "candy",
    "caramel cream candies",
    "sugar",
    "walnuts",
    "fudge",
    "maple sugar candy",
    "sweet and low™ sugar candy",
    "toffee apple",
    "cotton candy",
    "marshmallow",
    "marshmallows",
    "rock candy",
    "caramel candies",
    "caramels",
    "– these",
    "almond bark",
    "peanuts",
    "peanut brittle",
    "chocolate peanut brittle",
    "reese's peanut butter bars",
    "walnut",
    "pecans",
    "hazelnuts",
    "pecan brittle",
    "chocolate fudge",
    "peanut butter and marshmallow fudge",
    "snickers fudge",
    "cookies and cream fudge",
    "apricot fudge",
    "marzipan candy",
    "oranges",
    "lemons",
    "strawberries",
    "flowers",
    "marzipan bunnies",
    "marzipan toadstools",
    "fondant candies",
    "cookie cutter",
    "chocolate",
    "cake",
    "chocolate rum"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}