{
  "title":"How to Paint an Xbox 360 Controller",
  "url":"https://www.wikihow.com/Paint-an-Xbox-360-Controller",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Xbox 360"
  ],
  "steps":[
    {
      "headline":"Read \"How to Open a Wireless Xbox 360 controller.\"",
      "description":""
    },
    {
      "headline":"Empty ALL parts from your controller cases.",
      "description":"There are two parts."
    },
    {
      "headline":"Go to the back of the back piece, if you plan on painting here.",
      "description":"Remove all the stickers and labels."
    },
    {
      "headline":"For a good finish, clean your entire controller case using rubbing alcohol after sanding all parts of the controller you plan on painting with a fine grit sandpaper.",
      "description":"(NOTE: Make sure to get all the corners, crevices, etc. If not, you will paint over the dirt, and the dirt will fall off taking the paint with it.)"
    },
    {
      "headline":"This step is the most time consuming.",
      "description":"If not done right, your buttons will not fit back into place properly, and may stick. Start with one of the Analog stick holes. Go from the inside and tape up the hole. This will make it so you do not get any paint on the inside, and only the visible parts. Make sure it is perfectly even all the way around, or else the paint will be crooked. Do this for the other Analog Stick hole, and the D-pad hole if you wish, but they are by no means required."
    },
    {
      "headline":"The Start, Back, A, B, X, Y, and Guide buttons are the hardest, in that order.",
      "description":"This requires VERY narrow pieces of tape. Take a sliver, about an inch long, and put it on one of the walls, so that it completely goes all the way up and down. Go all the way around until all the walls are covered. Now, take the outside pieces that are sticking up, and make a cone so they won't get in your way. Do this for the rest of the buttons. (NOTE: Wrapping the tape inside-out on a standard nail can help greatly with this step)"
    },
    {
      "headline":"Once all those holes are blocked up, now is the time to cover up the trigger holes.",
      "description":"Take a piece of tape, and rip it so that it is a little bit bigger than the trigger hole, and put the tape on it from the inside of the controller."
    },
    {
      "headline":"Once all your controller's holes are covered or filled properly, lay down your cardboard and place the toothpicks in the cardboard about 2 inches (5.1 cm) from each other and place the Start, Back, 2 Bumpers, Triggers, Center Top Piece, and Center Bottom Piece on the tooth picks.",
      "description":"Most of the Buttons will sit fairly well on the toothpicks, some will require 2 toothpicks to make stand correctly."
    },
    {
      "headline":"With all your pieces mounted on toothpicks and your front and back covers laid out on the cardboard, you can now start painting.",
      "description":"Follow basic spray painting instructions in order to get a smooth coat and even paint color. Putting a 2nd coat on the controller is recommended, but I'd suggest waiting for 24 hours after the 1st coat has dried."
    }
  ],
  "text":" Read \"How to Open a Wireless Xbox 360 controller.\"  Empty ALL parts from your controller cases. There are two parts. Go to the back of the back piece, if you plan on painting here. Remove all the stickers and labels. For a good finish, clean your entire controller case using rubbing alcohol after sanding all parts of the controller you plan on painting with a fine grit sandpaper. (NOTE: Make sure to get all the corners, crevices, etc. If not, you will paint over the dirt, and the dirt will fall off taking the paint with it.) This step is the most time consuming. If not done right, your buttons will not fit back into place properly, and may stick. Start with one of the Analog stick holes. Go from the inside and tape up the hole. This will make it so you do not get any paint on the inside, and only the visible parts. Make sure it is perfectly even all the way around, or else the paint will be crooked. Do this for the other Analog Stick hole, and the D-pad hole if you wish, but they are by no means required. The Start, Back, A, B, X, Y, and Guide buttons are the hardest, in that order. This requires VERY narrow pieces of tape. Take a sliver, about an inch long, and put it on one of the walls, so that it completely goes all the way up and down. Go all the way around until all the walls are covered. Now, take the outside pieces that are sticking up, and make a cone so they won't get in your way. Do this for the rest of the buttons. (NOTE: Wrapping the tape inside-out on a standard nail can help greatly with this step) Once all those holes are blocked up, now is the time to cover up the trigger holes. Take a piece of tape, and rip it so that it is a little bit bigger than the trigger hole, and put the tape on it from the inside of the controller. Once all your controller's holes are covered or filled properly, lay down your cardboard and place the toothpicks in the cardboard about 2 inches (5.1 cm) from each other and place the Start, Back, 2 Bumpers, Triggers, Center Top Piece, and Center Bottom Piece on the tooth picks. Most of the Buttons will sit fairly well on the toothpicks, some will require 2 toothpicks to make stand correctly. With all your pieces mounted on toothpicks and your front and back covers laid out on the cardboard, you can now start painting. Follow basic spray painting instructions in order to get a smooth coat and even paint color. Putting a 2nd coat on the controller is recommended, but I'd suggest waiting for 24 hours after the 1st coat has dried.",
  "sentences":[
    " Read \"How to Open a Wireless Xbox 360 controller.\"",
    "Empty ALL parts from your controller cases.",
    "There are two parts.",
    "Go to the back of the back piece, if you plan on painting here.",
    "Remove all the stickers and labels.",
    "For a good finish, clean your entire controller case using rubbing alcohol after sanding all parts of the controller you plan on painting with a fine grit sandpaper.",
    "(NOTE: Make sure to get all the corners, crevices, etc.",
    "If not, you will paint over the dirt, and the dirt will fall off taking the paint with it.)",
    "This step is the most time consuming.",
    "If not done right, your buttons will not fit back into place properly, and may stick.",
    "Start with one of the Analog stick holes.",
    "Go from the inside and tape up the hole.",
    "This will make it so you do not get any paint on the inside, and only the visible parts.",
    "Make sure it is perfectly even all the way around, or else the paint will be crooked.",
    "Do this for the other Analog Stick hole, and the D-pad hole if you wish, but they are by no means required.",
    "The Start, Back, A, B, X, Y, and Guide buttons are the hardest, in that order.",
    "This requires VERY narrow pieces of tape.",
    "Take a sliver, about an inch long, and put it on one of the walls, so that it completely goes all the way up and down.",
    "Go all the way around until all the walls are covered.",
    "Now, take the outside pieces that are sticking up, and make a cone so they won't get in your way.",
    "Do this for the rest of the buttons.",
    "(NOTE: Wrapping the tape inside-out on a standard nail can help greatly with this step) Once all those holes are blocked up, now is the time to cover up the trigger holes.",
    "Take a piece of tape, and rip it so that it is a little bit bigger than the trigger hole, and put the tape on it from the inside of the controller.",
    "Once all your controller's holes are covered or filled properly, lay down your cardboard and place the toothpicks in the cardboard about 2 inches (5.1 cm) from each other and place the Start, Back, 2 Bumpers, Triggers, Center Top Piece, and Center Bottom Piece on the tooth picks.",
    "Most of the Buttons will sit fairly well on the toothpicks, some will require 2 toothpicks to make stand correctly.",
    "With all your pieces mounted on toothpicks and your front and back covers laid out on the cardboard, you can now start painting.",
    "Follow basic spray painting instructions in order to get a smooth coat and even paint color.",
    "Putting a 2nd coat on the controller is recommended, but I'd suggest waiting for 24 hours after the 1st coat has dried."
  ],
  "tyn_section":[
    "Painters Tape (or masking tape if you lack Painters Tape)",
    "1 Nail (any standard wood nail will work)",
    "Rubbing Alcohol & A Small Cloth",
    "A Decent Sized Piece of Cardboard",
    "10 or so Toothpicks",
    "Spray Paint (Either 1 or 2 Colors Work Best)",
    "Small piece of fine grit sandpaper"
  ],
  "tyn_model":[
    "paint",
    "tape",
    "cardboard",
    "xbox 360 controller",
    "rubbing alcohol",
    "fine grit sandpaper",
    "analog stick",
    "tooth picks",
    "spray painting"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.1428571429,
    "p":0.1111111111,
    "f1":0.125
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.2857142857,
    "p":0.2222222222,
    "f1":0.25
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}