{
  "title":"How to Cook Frozen Lobster Tails",
  "url":"https://www.wikihow.com/Cook-Frozen-Lobster-Tails",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Lobster"
  ],
  "methods":[
    {
      "name":"Defrosting and Preparing the Lobster Tails",
      "steps":[
        {
          "headline":"Get your lobster tails out of the freezer 1 day before you want to cook them.",
          "description":"Take out as many tails as you plan on cooking. Keep in mind that by defrosting them in the fridge, you can always refreeze them again if you change your mind and need to hold off on cooking them. Variation: If you're short on time, put the tails into a sealable plastic bag. Seal the bag shut and submerge it in cold water for 30 minutes. Change the water every 30 minutes until the tails are totally defrosted. You'll need to cook the tails right after they've finished thawing. Look at the seafood section of grocery store's freezer aisles for lobster tails. Some meat counter might have them in a case nearby."
        },
        {
          "headline":"Arrange the tails on a plate in a single layer and cover them.",
          "description":"Place the tails on a plate or in a bowl so they're not stacked. Then, wrap them with plastic wrap so they don't absorb flavors in the fridge as they defrost. If the tails are already in a single layer and in a package, you can leave them in the package. The wrapper will prevent juices from leaking in your fridge as the tails thaw."
        },
        {
          "headline":"Refrigerate the tails for 24 hours or until they're completely thawed.",
          "description":"Check on the lobster tails after you've defrosted them for 1 day. Remove the wrapping and try to bend a tail. If it's defrosted completely, it should be flexible and will bend easily. If the tail is still stiff or icy, refrigerate it for another 2 hours and check it again."
        },
        {
          "headline":"Use kitchen shears to cut through the top shell of each tail.",
          "description":"Place the defrosted tails on your work surface and get out a clean pair of kitchen shears. Hold 1 tail firmly while you cut lengthwise through the shell. Try to avoid cutting the meat so it remains in a single piece and stop cutting before you get to the tail fin. If you don't have kitchen shears, you can carefully use a sharp knife."
        },
        {
          "headline":"Pull open each shell to expose the meat.",
          "description":"Use your fingers to gently pull apart the sides of the shells you just cut. You should be able to see the meat of the lobster, but you don't want to pull so hard that you tear the shell off. The meat should look like it's sitting on top of the shell, which will protect the meat as it cooks."
        }
      ]
    },
    {
      "name":"Broiled Lobster Tails with Garlic and Paprika",
      "steps":[
        {
          "headline":"Adjust your oven rack and turn the broiler to \"high.\"",
          "description":"Move your oven or broiler rack so it's about 3 inches (7.6 cm) below the broiler element. Then, turn the broiler on to its highest setting."
        },
        {
          "headline":"Mix the garlic powder, smoked paprika, and white pepper in a small bowl.",
          "description":"Put 1 teaspoon (2 g) of garlic powder, 1 teaspoon (2 g) of smoked paprika, and 1/2 teaspoon (1 g) of white pepper into the bowl and stir until the spices are incorporated.Tip: If you prefer, you can use 2 1/2 (5 g) of your favorite dry spice seasoning instead. For example, try Old Bay or cajun seasoning. It's important to use garlic powder instead of minced garlic since the fresh garlic would burn under the broiler."
        },
        {
          "headline":"Place 2 tails on a sheet and season them with the spices and butter.",
          "description":"Lay the tails on a baking sheet or oven-safe dish and sprinkle the spice mix over them. Then, cut 1 1/2 (21 g) tablespoons of butter into 2 pieces and put 1 small piece of butter on each tail. The butter will melt and flavor the lobster tail."
        },
        {
          "headline":"Broil the lobster tails for 8 to 10 minutes.",
          "description":"Set the sheet of seasoned lobster tails on the rack that's 3 inches (7.6 cm) below the broiler element. Cook the tails until the meat is completely white. To test if the tails have finished cooking, stick a skewer into the meat. It should be tender and you should be able to slide the skewer out easily."
        },
        {
          "headline":"Serve the broiled lobster tails with clarified butter.",
          "description":"Turn off the broiler and wear oven mitts to remove the baking sheet. Use tongs to transfer the hot lobster tails to plates and serve them with clarified butter. You may want to sprinkle a little salt over the tails according to your taste. Store leftover broiled tails in an airtight container in the refrigerator and use them within 4 days."
        }
      ]
    },
    {
      "name":"Grilling Lobster Tails with Herb Butter",
      "steps":[
        {
          "headline":"Heat a charcoal or gas grill to medium-high heat.",
          "description":"Turn the burners of a gas grill on to medium-high. If you're using a charcoal grill, fill a chimney with briquettes and light them. Once the coals are hot and lightly ashy, dump them on the grill grate."
        },
        {
          "headline":"Mix the butter, herbs, garlic, hot sauce, and pepper in a bowl.",
          "description":"While the grill is heating, put 8 tablespoons (112 g) of softened salted butter into a bowl and mix in 2 tablespoons (6 g) of chopped chives, 1 tablespoon (2 g) of chopped fresh tarragon leaves, 1 minced clove of garlic, 1 dash of hot sauce, and freshly ground black pepper to taste. You can cover the bowl with a plate or plastic wrap and set it aside at room temperature while the lobster tails cook."
        },
        {
          "headline":"Stick a skewer through each of the tails and brush them with olive oil.",
          "description":"Get out 4 thawed lobster tails and insert a metal skewer through the length of each tail. Then, brush a little olive oil over the meat of each lobster tail and sprinkle them with salt according to your taste.Tip: If you don't have metal skewers, soak wooden skewers in water for 10 minutes before using them. The skewers will prevent the tails from curling as the lobster cooks on the grill. The olive oil will stop the lobster tail meat from sticking to the grill."
        },
        {
          "headline":"Grill the lobster tails for 9 to 10 minutes.",
          "description":"Lay the tails meat-side down on the grill and cover the grill. Cook the tails until the shells turn bright red. At the halfway cooking point, use tongs to carefully flip them over and brush some of herb butter onto the meat. The meat should be completely white and tender once it's finished cooking."
        },
        {
          "headline":"Take the tails off of the grill and serve them with the herb butter.",
          "description":"Use tongs to transfer the tails to a serving plate. Set out wedges of fresh lemon and the herb butter that you mixed earlier. The grilled lobster is great served with grilled vegetables, such as asparagus or peppers. Refrigerate leftover tails in an airtight container for up to 4 days."
        }
      ]
    },
    {
      "name":"Boiling Lobster Tails with Pepper Butter",
      "steps":[
        {
          "headline":"Bring a large pot of water to a boil and add salt.",
          "description":"Set a large pot on the stove and fill it 3/4 full with water. Put a lid on the pot and turn the burner to high. Heat the water until it begins to boil and you see steam escaping from under the lid. Then, wear oven mitts to carefully remove the lid and add salt to season the water. Plan on using about 1 tablespoon (17 g) of salt for every 4 cups (0.95 L) of water you add to the pot."
        },
        {
          "headline":"Add 4 tails and boil them for 3 to 10 minutes.",
          "description":"Slowly lower 4 thawed lobster tails into the boiling water so they don't splash you. Keep the lid off of the pot and boil the tails until they turn bright red. If you stick a skewer into a tail, the meat should be tender once it's finished cooking. You'll need to boil the tails according to how much they weigh:Variation: If you have no time to defrost the tails, you can drop the frozen tails into a pot of boiling water. Simmer the tails for 15 minutes or until they turn bright red. Keep in mind that this method isn't preferred since the meat may become mushy or stick to the shells. 3 to 5 minutes for 3 to 6 ounce (85 to 170 g) tails\n5 to 6 minutes for 6 to 7 ounce (170 to 198 g) tails\n6 to 8 minutes for 8 to 10 ounce (226 to 283 g) tails\n8 to 10 minutes for 10 to 16 ounce (283 to 453 g) tails\n10 minutes for 16 to 20 ounce (453 to 566 g) tails"
        },
        {
          "headline":"Heat the butter with lemon juice, parsley, salt, and pepper in a separate pot.",
          "description":"While the tails are boiling, you can make a simple dipping sauce. Melt 8 tablespoons (112 g) of unsalted butter in a small pot on the stove. Then, turn off the burner and stir in:\n\n4 ⁄2 teaspoons (22 ml) of lemon juice\n1/4 cup (5 g) of chopped fresh parsley\n1 teaspoon (5.5 g) of salt\n2 teaspoons (4 g) of freshly ground black pepper"
        },
        {
          "headline":"Use tongs to remove the tails and serve them with the pepper butter.",
          "description":"Turn off the burner for the boiling pot of water and use tongs to take each tail out. Set them on a serving platter along with the pepper butter and your choice of sides. You could serve the tails with wedges of lemon, baked potatoes, or steamed broccoli, for instance. Refrigerate leftover lobster tails in an airtight container for up to 4 days."
        }
      ]
    }
  ],
  "text":" Defrosting and Preparing the Lobster Tails Get your lobster tails out of the freezer 1 day before you want to cook them. Take out as many tails as you plan on cooking. Keep in mind that by defrosting them in the fridge, you can always refreeze them again if you change your mind and need to hold off on cooking them. Variation: If you're short on time, put the tails into a sealable plastic bag. Seal the bag shut and submerge it in cold water for 30 minutes. Change the water every 30 minutes until the tails are totally defrosted. You'll need to cook the tails right after they've finished thawing. Look at the seafood section of grocery store's freezer aisles for lobster tails. Some meat counter might have them in a case nearby. Arrange the tails on a plate in a single layer and cover them. Place the tails on a plate or in a bowl so they're not stacked. Then, wrap them with plastic wrap so they don't absorb flavors in the fridge as they defrost. If the tails are already in a single layer and in a package, you can leave them in the package. The wrapper will prevent juices from leaking in your fridge as the tails thaw. Refrigerate the tails for 24 hours or until they're completely thawed. Check on the lobster tails after you've defrosted them for 1 day. Remove the wrapping and try to bend a tail. If it's defrosted completely, it should be flexible and will bend easily. If the tail is still stiff or icy, refrigerate it for another 2 hours and check it again. Use kitchen shears to cut through the top shell of each tail. Place the defrosted tails on your work surface and get out a clean pair of kitchen shears. Hold 1 tail firmly while you cut lengthwise through the shell. Try to avoid cutting the meat so it remains in a single piece and stop cutting before you get to the tail fin. If you don't have kitchen shears, you can carefully use a sharp knife. Pull open each shell to expose the meat. Use your fingers to gently pull apart the sides of the shells you just cut. You should be able to see the meat of the lobster, but you don't want to pull so hard that you tear the shell off. The meat should look like it's sitting on top of the shell, which will protect the meat as it cooks. Broiled Lobster Tails with Garlic and Paprika Adjust your oven rack and turn the broiler to \"high.\" Move your oven or broiler rack so it's about 3 inches (7.6 cm) below the broiler element. Then, turn the broiler on to its highest setting. Mix the garlic powder, smoked paprika, and white pepper in a small bowl. Put 1 teaspoon (2 g) of garlic powder, 1 teaspoon (2 g) of smoked paprika, and 1/2 teaspoon (1 g) of white pepper into the bowl and stir until the spices are incorporated.Tip: If you prefer, you can use 2 1/2 (5 g) of your favorite dry spice seasoning instead. For example, try Old Bay or cajun seasoning. It's important to use garlic powder instead of minced garlic since the fresh garlic would burn under the broiler. Place 2 tails on a sheet and season them with the spices and butter. Lay the tails on a baking sheet or oven-safe dish and sprinkle the spice mix over them. Then, cut 1 1/2 (21 g) tablespoons of butter into 2 pieces and put 1 small piece of butter on each tail. The butter will melt and flavor the lobster tail. Broil the lobster tails for 8 to 10 minutes. Set the sheet of seasoned lobster tails on the rack that's 3 inches (7.6 cm) below the broiler element. Cook the tails until the meat is completely white. To test if the tails have finished cooking, stick a skewer into the meat. It should be tender and you should be able to slide the skewer out easily. Serve the broiled lobster tails with clarified butter. Turn off the broiler and wear oven mitts to remove the baking sheet. Use tongs to transfer the hot lobster tails to plates and serve them with clarified butter. You may want to sprinkle a little salt over the tails according to your taste. Store leftover broiled tails in an airtight container in the refrigerator and use them within 4 days. Grilling Lobster Tails with Herb Butter Heat a charcoal or gas grill to medium-high heat. Turn the burners of a gas grill on to medium-high. If you're using a charcoal grill, fill a chimney with briquettes and light them. Once the coals are hot and lightly ashy, dump them on the grill grate. Mix the butter, herbs, garlic, hot sauce, and pepper in a bowl. While the grill is heating, put 8 tablespoons (112 g) of softened salted butter into a bowl and mix in 2 tablespoons (6 g) of chopped chives, 1 tablespoon (2 g) of chopped fresh tarragon leaves, 1 minced clove of garlic, 1 dash of hot sauce, and freshly ground black pepper to taste. You can cover the bowl with a plate or plastic wrap and set it aside at room temperature while the lobster tails cook. Stick a skewer through each of the tails and brush them with olive oil. Get out 4 thawed lobster tails and insert a metal skewer through the length of each tail. Then, brush a little olive oil over the meat of each lobster tail and sprinkle them with salt according to your taste.Tip: If you don't have metal skewers, soak wooden skewers in water for 10 minutes before using them. The skewers will prevent the tails from curling as the lobster cooks on the grill. The olive oil will stop the lobster tail meat from sticking to the grill. Grill the lobster tails for 9 to 10 minutes. Lay the tails meat-side down on the grill and cover the grill. Cook the tails until the shells turn bright red. At the halfway cooking point, use tongs to carefully flip them over and brush some of herb butter onto the meat. The meat should be completely white and tender once it's finished cooking. Take the tails off of the grill and serve them with the herb butter. Use tongs to transfer the tails to a serving plate. Set out wedges of fresh lemon and the herb butter that you mixed earlier. The grilled lobster is great served with grilled vegetables, such as asparagus or peppers. Refrigerate leftover tails in an airtight container for up to 4 days. Boiling Lobster Tails with Pepper Butter Bring a large pot of water to a boil and add salt. Set a large pot on the stove and fill it 3/4 full with water. Put a lid on the pot and turn the burner to high. Heat the water until it begins to boil and you see steam escaping from under the lid. Then, wear oven mitts to carefully remove the lid and add salt to season the water. Plan on using about 1 tablespoon (17 g) of salt for every 4 cups (0.95 L) of water you add to the pot. Add 4 tails and boil them for 3 to 10 minutes. Slowly lower 4 thawed lobster tails into the boiling water so they don't splash you. Keep the lid off of the pot and boil the tails until they turn bright red. If you stick a skewer into a tail, the meat should be tender once it's finished cooking. You'll need to boil the tails according to how much they weigh:Variation: If you have no time to defrost the tails, you can drop the frozen tails into a pot of boiling water. Simmer the tails for 15 minutes or until they turn bright red. Keep in mind that this method isn't preferred since the meat may become mushy or stick to the shells. 3 to 5 minutes for 3 to 6 ounce (85 to 170 g) tails\n5 to 6 minutes for 6 to 7 ounce (170 to 198 g) tails\n6 to 8 minutes for 8 to 10 ounce (226 to 283 g) tails\n8 to 10 minutes for 10 to 16 ounce (283 to 453 g) tails\n10 minutes for 16 to 20 ounce (453 to 566 g) tails Heat the butter with lemon juice, parsley, salt, and pepper in a separate pot. While the tails are boiling, you can make a simple dipping sauce. Melt 8 tablespoons (112 g) of unsalted butter in a small pot on the stove. Then, turn off the burner and stir in:\n\n4 ⁄2 teaspoons (22 ml) of lemon juice\n1/4 cup (5 g) of chopped fresh parsley\n1 teaspoon (5.5 g) of salt\n2 teaspoons (4 g) of freshly ground black pepper Use tongs to remove the tails and serve them with the pepper butter. Turn off the burner for the boiling pot of water and use tongs to take each tail out. Set them on a serving platter along with the pepper butter and your choice of sides. You could serve the tails with wedges of lemon, baked potatoes, or steamed broccoli, for instance. Refrigerate leftover lobster tails in an airtight container for up to 4 days.",
  "sentences":[
    " Defrosting and Preparing the Lobster Tails Get your lobster tails out of the freezer 1 day before you want to cook them.",
    "Take out as many tails as you plan on cooking.",
    "Keep in mind that by defrosting them in the fridge, you can always refreeze them again if you change your mind and need to hold off on cooking them.",
    "Variation: If you're short on time, put the tails into a sealable plastic bag.",
    "Seal the bag shut and submerge it in cold water for 30 minutes.",
    "Change the water every 30 minutes until the tails are totally defrosted.",
    "You'll need to cook the tails right after they've finished thawing.",
    "Look at the seafood section of grocery store's freezer aisles for lobster tails.",
    "Some meat counter might have them in a case nearby.",
    "Arrange the tails on a plate in a single layer and cover them.",
    "Place the tails on a plate or in a bowl so they're not stacked.",
    "Then, wrap them with plastic wrap so they don't absorb flavors in the fridge as they defrost.",
    "If the tails are already in a single layer and in a package, you can leave them in the package.",
    "The wrapper will prevent juices from leaking in your fridge as the tails thaw.",
    "Refrigerate the tails for 24 hours or until they're completely thawed.",
    "Check on the lobster tails after you've defrosted them for 1 day.",
    "Remove the wrapping and try to bend a tail.",
    "If it's defrosted completely, it should be flexible and will bend easily.",
    "If the tail is still stiff or icy, refrigerate it for another 2 hours and check it again.",
    "Use kitchen shears to cut through the top shell of each tail.",
    "Place the defrosted tails on your work surface and get out a clean pair of kitchen shears.",
    "Hold 1 tail firmly while you cut lengthwise through the shell.",
    "Try to avoid cutting the meat so it remains in a single piece and stop cutting before you get to the tail fin.",
    "If you don't have kitchen shears, you can carefully use a sharp knife.",
    "Pull open each shell to expose the meat.",
    "Use your fingers to gently pull apart the sides of the shells you just cut.",
    "You should be able to see the meat of the lobster, but you don't want to pull so hard that you tear the shell off.",
    "The meat should look like it's sitting on top of the shell, which will protect the meat as it cooks.",
    "Broiled Lobster Tails with Garlic and Paprika Adjust your oven rack and turn the broiler to \"high.\"",
    "Move your oven or broiler rack so it's about 3 inches (7.6 cm) below the broiler element.",
    "Then, turn the broiler on to its highest setting.",
    "Mix the garlic powder, smoked paprika, and white pepper in a small bowl.",
    "Put 1 teaspoon (2 g) of garlic powder, 1 teaspoon (2 g) of smoked paprika, and 1/2 teaspoon (1 g) of white pepper into the bowl and stir until the spices are incorporated.Tip: If you prefer, you can use 2 1/2 (5 g) of your favorite dry spice seasoning instead.",
    "For example, try Old Bay or cajun seasoning.",
    "It's important to use garlic powder instead of minced garlic since the fresh garlic would burn under the broiler.",
    "Place 2 tails on a sheet and season them with the spices and butter.",
    "Lay the tails on a baking sheet or oven-safe dish and sprinkle the spice mix over them.",
    "Then, cut 1 1/2 (21 g) tablespoons of butter into 2 pieces and put 1 small piece of butter on each tail.",
    "The butter will melt and flavor the lobster tail.",
    "Broil the lobster tails for 8 to 10 minutes.",
    "Set the sheet of seasoned lobster tails on the rack that's 3 inches (7.6 cm) below the broiler element.",
    "Cook the tails until the meat is completely white.",
    "To test if the tails have finished cooking, stick a skewer into the meat.",
    "It should be tender and you should be able to slide the skewer out easily.",
    "Serve the broiled lobster tails with clarified butter.",
    "Turn off the broiler and wear oven mitts to remove the baking sheet.",
    "Use tongs to transfer the hot lobster tails to plates and serve them with clarified butter.",
    "You may want to sprinkle a little salt over the tails according to your taste.",
    "Store leftover broiled tails in an airtight container in the refrigerator and use them within 4 days.",
    "Grilling Lobster Tails with Herb Butter Heat a charcoal or gas grill to medium-high heat.",
    "Turn the burners of a gas grill on to medium-high.",
    "If you're using a charcoal grill, fill a chimney with briquettes and light them.",
    "Once the coals are hot and lightly ashy, dump them on the grill grate.",
    "Mix the butter, herbs, garlic, hot sauce, and pepper in a bowl.",
    "While the grill is heating, put 8 tablespoons (112 g) of softened salted butter into a bowl and mix in 2 tablespoons (6 g) of chopped chives, 1 tablespoon (2 g) of chopped fresh tarragon leaves, 1 minced clove of garlic, 1 dash of hot sauce, and freshly ground black pepper to taste.",
    "You can cover the bowl with a plate or plastic wrap and set it aside at room temperature while the lobster tails cook.",
    "Stick a skewer through each of the tails and brush them with olive oil.",
    "Get out 4 thawed lobster tails and insert a metal skewer through the length of each tail.",
    "Then, brush a little olive oil over the meat of each lobster tail and sprinkle them with salt according to your taste.Tip: If you don't have metal skewers, soak wooden skewers in water for 10 minutes before using them.",
    "The skewers will prevent the tails from curling as the lobster cooks on the grill.",
    "The olive oil will stop the lobster tail meat from sticking to the grill.",
    "Grill the lobster tails for 9 to 10 minutes.",
    "Lay the tails meat-side down on the grill and cover the grill.",
    "Cook the tails until the shells turn bright red.",
    "At the halfway cooking point, use tongs to carefully flip them over and brush some of herb butter onto the meat.",
    "The meat should be completely white and tender once it's finished cooking.",
    "Take the tails off of the grill and serve them with the herb butter.",
    "Use tongs to transfer the tails to a serving plate.",
    "Set out wedges of fresh lemon and the herb butter that you mixed earlier.",
    "The grilled lobster is great served with grilled vegetables, such as asparagus or peppers.",
    "Refrigerate leftover tails in an airtight container for up to 4 days.",
    "Boiling Lobster Tails with Pepper Butter Bring a large pot of water to a boil and add salt.",
    "Set a large pot on the stove and fill it 3/4 full with water.",
    "Put a lid on the pot and turn the burner to high.",
    "Heat the water until it begins to boil and you see steam escaping from under the lid.",
    "Then, wear oven mitts to carefully remove the lid and add salt to season the water.",
    "Plan on using about 1 tablespoon (17 g) of salt for every 4 cups (0.95 L) of water you add to the pot.",
    "Add 4 tails and boil them for 3 to 10 minutes.",
    "Slowly lower 4 thawed lobster tails into the boiling water so they don't splash you.",
    "Keep the lid off of the pot and boil the tails until they turn bright red.",
    "If you stick a skewer into a tail, the meat should be tender once it's finished cooking.",
    "You'll need to boil the tails according to how much they weigh:Variation: If you have no time to defrost the tails, you can drop the frozen tails into a pot of boiling water.",
    "Simmer the tails for 15 minutes or until they turn bright red.",
    "Keep in mind that this method isn't preferred since the meat may become mushy or stick to the shells.",
    "3 to 5 minutes for 3 to 6 ounce (85 to 170 g) tails\n5 to 6 minutes for 6 to 7 ounce (170 to 198 g) tails\n6 to 8 minutes for 8 to 10 ounce (226 to 283 g) tails\n8 to 10 minutes for 10 to 16 ounce (283 to 453 g) tails\n10 minutes for 16 to 20 ounce (453 to 566 g) tails Heat the butter with lemon juice, parsley, salt, and pepper in a separate pot.",
    "While the tails are boiling, you can make a simple dipping sauce.",
    "Melt 8 tablespoons (112 g) of unsalted butter in a small pot on the stove.",
    "Then, turn off the burner and stir in:\n\n4 ⁄2 teaspoons (22 ml) of lemon juice\n1/4 cup (5 g) of chopped fresh parsley\n1 teaspoon (5.5 g) of salt\n2 teaspoons (4 g) of freshly ground black pepper Use tongs to remove the tails and serve them with the pepper butter.",
    "Turn off the burner for the boiling pot of water and use tongs to take each tail out.",
    "Set them on a serving platter along with the pepper butter and your choice of sides.",
    "You could serve the tails with wedges of lemon, baked potatoes, or steamed broccoli, for instance.",
    "Refrigerate leftover lobster tails in an airtight container for up to 4 days."
  ],
  "tyn_section":[
    "Plate",
    "Plastic wrap",
    "Kitchen shears",
    "Baking sheet or oven-safe dish",
    "Measuring spoons",
    "Small bowl",
    "Spoon",
    "Baking sheet",
    "Oven mitts",
    "Tongs",
    "Grilled Lobster Tails with Herb Butter",
    "Knife and cutting board",
    "Metal skewers",
    "Gas or charcoal grill",
    "Serving plate",
    "Boiled Lobster Tails with Pepper Butter",
    "Large pot with a lid",
    "Small pot",
    "Measuring cups and spoons"
  ],
  "tyn_model":[
    "water",
    "salt",
    "broiler",
    "butter",
    "grill",
    "bowl",
    "garlic",
    "herb butter",
    "lobster tails",
    "plate",
    "kitchen shears",
    "lobster",
    "garlic powder",
    "airtight container",
    "olive oil",
    "pot",
    "plastic wrap",
    "smoked paprika",
    "white pepper",
    "clarified butter",
    "oven mitts",
    "hot sauce",
    "pepper",
    "freshly ground black pepper",
    "stove",
    "lemon juice",
    "pepper butter",
    "fridge",
    "sealable plastic bag",
    "meat",
    "sharp knife",
    "oven",
    "oven or broiler",
    "small bowl",
    "dry spice seasoning",
    "old bay",
    "cajun seasoning",
    "baking sheet or oven-safe dish",
    "spice mix",
    "refrigerator",
    "charcoal or gas grill",
    "gas grill",
    "charcoal grill",
    "grill grate",
    "herbs",
    "salted butter",
    "chives",
    "tarragon",
    "skewer",
    "lobster tail",
    "serving plate",
    "fresh lemon",
    "grilled lobster",
    "peppers",
    "large pot",
    "burner",
    "boiling",
    "parsley",
    "unsalted butter",
    "small pot",
    "fresh parsley",
    "lemon",
    "baked potatoes"
  ],
  "simple_metrics":{
    "r":0.4210526316,
    "p":0.126984127,
    "f1":0.1951219512,
    "avg_pos":0.1428571429
  },
  "jacc_metrics_0.5":{
    "r":0.4736842105,
    "p":0.2222222222,
    "f1":0.3025210084
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6842105263,
    "p":0.3015873016,
    "f1":0.4186440678
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4736842105,
    "p":0.1428571429,
    "f1":0.2195121951
  }
}