{
  "title":"How to Harvest Rosemary",
  "url":"https://www.wikihow.com/Harvest-Rosemary",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "parts":[
    {
      "name":"Cutting Rosemary",
      "steps":[
        {
          "headline":"Wait until spring or summer to harvest rosemary.",
          "description":"Rosemary grows most actively during the spring and summer, so this is the best time to harvest, as the sprigs you cut off will grow back more rapidly. Trim some of the plant off daily or weekly to encourage its growth. If you are planning on drying the rosemary, wait until the bush begins to bloom to harvest. This is when the leaves contain the most oil and flavor."
        },
        {
          "headline":"Select which branches of the rosemary to harvest.",
          "description":"Look for branches that are at least 8 inches (20 cm) long. Don’t harvest from newly growing branches. Keep several plants at once to ensure you always have some mature branches from which to harvest. The number of plants you’ll need varies on their size, but 2-3 should be fine for most people."
        },
        {
          "headline":"Cut off the top 2 inches (5 cm) of each sprig with shears or scissors.",
          "description":"Don’t cut the plant too close and be sure to leave some green leaves on each branch. Put the clipped rosemary sprigs in a basket or bowl. If you just want to use a small amount of fresh rosemary at a time, you can pick off a few of the leaves whenever you need it from the top parts of the sprigs. Don’t cut more rosemary than you need at once."
        },
        {
          "headline":"Don’t harvest more than 1/4 of a rosemary bush at one time.",
          "description":"Leave at least 3/4 of the plant to ensure that it will continue to thrive and produce new sprigs. Let the rosemary plant grow back before you harvest more of it. Even if you are not harvesting it to use, you should prune rosemary several times a year to encourage healthy growth. Remember not to harvest rosemary too close to winter because it will not grow back very fast. Perform your last harvest at least 2 weeks before the first frost so it has time to grow back before winter sets in. Bigger, fuller rosemary bushes are able to survive winter better."
        }
      ]
    },
    {
      "name":"Storing Rosemary",
      "steps":[
        {
          "headline":"Hang bundles of fresh rosemary to dry for 10 days.",
          "description":"Tie together evenly sized sprigs of rosemary and hang them to dry in a dark, well-ventilated, and dry area. Take down the rosemary when it is completely dry, after about 10 days, and strip off the leaves to store them. Store the dried rosemary leaves in airtight containers or jars in your cupboards or pantry. Use twine or rubber bands to hold the bundles of rosemary together. Dried rosemary will last forever, but it has the best flavor within a year."
        },
        {
          "headline":"Store fresh rosemary in airtight containers or bags in the fridge or freezer.",
          "description":"Wash the rosemary sprigs, then let them air dry on a clean towel or paper towel. Strip off the leaves, place them into a ziploc bag or tupperware, and put it in the fridge or freezer. Storing rosemary in the fridge or freezer will retain more of the flavor than dried rosemary, but less than fresh rosemary. Rosemary stored in the freezer will last longer than in the fridge, but the rosemary in the fridge will have a stronger flavor. Use rosemary that you keep in the fridge within 1-2 weeks for best results."
        },
        {
          "headline":"Freeze rosemary in an ice cube tray.",
          "description":"Strip off the leaves of your harvested rosemary sprigs and freeze them in water or olive oil in an ice cube tray. Use these cubes in sauces or soups to easily get a fresh rosemary taste in your recipes. The amount of leaves you freeze per cube is up to you. Check how much rosemary a common recipe you might make requires, and freeze that amount in one cube. Once the rosemary is frozen, you can empty the ice cube tray and store the cubes in an airtight container or ziploc bag in the freezer. Choose water or olive oil depending on what types of recipes you plan to use the ice cubes in. If you don’t know, then you can do some of each. Rosemary stored in the freezer will last indefinitely. If it starts to noticeably lose its flavor, then make a new batch."
        },
        {
          "headline":"Put fresh rosemary in a bottle of vinegar or olive oil.",
          "description":"Wash and air dry fresh harvested rosemary sprigs and place them directly into a bottle of vinegar, like white or balsamic, or olive oil to create a flavorful infusion. Use rosemary oil or vinegar in recipes, or combine them in a dish to create a dipping sauce for bread. Add other ingredients to the oil or vinegar infusions such as fresh garlic, peppercorns, or chili peppers for more flavor! Rosemary oil or vinegar will last as long as the rosemary stays covered by the oil or vinegar. If it becomes exposed to the air it can develop mold."
        }
      ]
    }
  ],
  "text":" Cutting Rosemary Wait until spring or summer to harvest rosemary. Rosemary grows most actively during the spring and summer, so this is the best time to harvest, as the sprigs you cut off will grow back more rapidly. Trim some of the plant off daily or weekly to encourage its growth. If you are planning on drying the rosemary, wait until the bush begins to bloom to harvest. This is when the leaves contain the most oil and flavor. Select which branches of the rosemary to harvest. Look for branches that are at least 8 inches (20 cm) long. Don’t harvest from newly growing branches. Keep several plants at once to ensure you always have some mature branches from which to harvest. The number of plants you’ll need varies on their size, but 2-3 should be fine for most people. Cut off the top 2 inches (5 cm) of each sprig with shears or scissors. Don’t cut the plant too close and be sure to leave some green leaves on each branch. Put the clipped rosemary sprigs in a basket or bowl. If you just want to use a small amount of fresh rosemary at a time, you can pick off a few of the leaves whenever you need it from the top parts of the sprigs. Don’t cut more rosemary than you need at once. Don’t harvest more than 1/4 of a rosemary bush at one time. Leave at least 3/4 of the plant to ensure that it will continue to thrive and produce new sprigs. Let the rosemary plant grow back before you harvest more of it. Even if you are not harvesting it to use, you should prune rosemary several times a year to encourage healthy growth. Remember not to harvest rosemary too close to winter because it will not grow back very fast. Perform your last harvest at least 2 weeks before the first frost so it has time to grow back before winter sets in. Bigger, fuller rosemary bushes are able to survive winter better. Storing Rosemary Hang bundles of fresh rosemary to dry for 10 days. Tie together evenly sized sprigs of rosemary and hang them to dry in a dark, well-ventilated, and dry area. Take down the rosemary when it is completely dry, after about 10 days, and strip off the leaves to store them. Store the dried rosemary leaves in airtight containers or jars in your cupboards or pantry. Use twine or rubber bands to hold the bundles of rosemary together. Dried rosemary will last forever, but it has the best flavor within a year. Store fresh rosemary in airtight containers or bags in the fridge or freezer. Wash the rosemary sprigs, then let them air dry on a clean towel or paper towel. Strip off the leaves, place them into a ziploc bag or tupperware, and put it in the fridge or freezer. Storing rosemary in the fridge or freezer will retain more of the flavor than dried rosemary, but less than fresh rosemary. Rosemary stored in the freezer will last longer than in the fridge, but the rosemary in the fridge will have a stronger flavor. Use rosemary that you keep in the fridge within 1-2 weeks for best results. Freeze rosemary in an ice cube tray. Strip off the leaves of your harvested rosemary sprigs and freeze them in water or olive oil in an ice cube tray. Use these cubes in sauces or soups to easily get a fresh rosemary taste in your recipes. The amount of leaves you freeze per cube is up to you. Check how much rosemary a common recipe you might make requires, and freeze that amount in one cube. Once the rosemary is frozen, you can empty the ice cube tray and store the cubes in an airtight container or ziploc bag in the freezer. Choose water or olive oil depending on what types of recipes you plan to use the ice cubes in. If you don’t know, then you can do some of each. Rosemary stored in the freezer will last indefinitely. If it starts to noticeably lose its flavor, then make a new batch. Put fresh rosemary in a bottle of vinegar or olive oil. Wash and air dry fresh harvested rosemary sprigs and place them directly into a bottle of vinegar, like white or balsamic, or olive oil to create a flavorful infusion. Use rosemary oil or vinegar in recipes, or combine them in a dish to create a dipping sauce for bread. Add other ingredients to the oil or vinegar infusions such as fresh garlic, peppercorns, or chili peppers for more flavor! Rosemary oil or vinegar will last as long as the rosemary stays covered by the oil or vinegar. If it becomes exposed to the air it can develop mold.",
  "sentences":[
    " Cutting Rosemary Wait until spring or summer to harvest rosemary.",
    "Rosemary grows most actively during the spring and summer, so this is the best time to harvest, as the sprigs you cut off will grow back more rapidly.",
    "Trim some of the plant off daily or weekly to encourage its growth.",
    "If you are planning on drying the rosemary, wait until the bush begins to bloom to harvest.",
    "This is when the leaves contain the most oil and flavor.",
    "Select which branches of the rosemary to harvest.",
    "Look for branches that are at least 8 inches (20 cm) long.",
    "Don’t harvest from newly growing branches.",
    "Keep several plants at once to ensure you always have some mature branches from which to harvest.",
    "The number of plants you’ll need varies on their size, but 2-3 should be fine for most people.",
    "Cut off the top 2 inches (5 cm) of each sprig with shears or scissors.",
    "Don’t cut the plant too close and be sure to leave some green leaves on each branch.",
    "Put the clipped rosemary sprigs in a basket or bowl.",
    "If you just want to use a small amount of fresh rosemary at a time, you can pick off a few of the leaves whenever you need it from the top parts of the sprigs.",
    "Don’t cut more rosemary than you need at once.",
    "Don’t harvest more than 1/4 of a rosemary bush at one time.",
    "Leave at least 3/4 of the plant to ensure that it will continue to thrive and produce new sprigs.",
    "Let the rosemary plant grow back before you harvest more of it.",
    "Even if you are not harvesting it to use, you should prune rosemary several times a year to encourage healthy growth.",
    "Remember not to harvest rosemary too close to winter because it will not grow back very fast.",
    "Perform your last harvest at least 2 weeks before the first frost so it has time to grow back before winter sets in.",
    "Bigger, fuller rosemary bushes are able to survive winter better.",
    "Storing Rosemary Hang bundles of fresh rosemary to dry for 10 days.",
    "Tie together evenly sized sprigs of rosemary and hang them to dry in a dark, well-ventilated, and dry area.",
    "Take down the rosemary when it is completely dry, after about 10 days, and strip off the leaves to store them.",
    "Store the dried rosemary leaves in airtight containers or jars in your cupboards or pantry.",
    "Use twine or rubber bands to hold the bundles of rosemary together.",
    "Dried rosemary will last forever, but it has the best flavor within a year.",
    "Store fresh rosemary in airtight containers or bags in the fridge or freezer.",
    "Wash the rosemary sprigs, then let them air dry on a clean towel or paper towel.",
    "Strip off the leaves, place them into a ziploc bag or tupperware, and put it in the fridge or freezer.",
    "Storing rosemary in the fridge or freezer will retain more of the flavor than dried rosemary, but less than fresh rosemary.",
    "Rosemary stored in the freezer will last longer than in the fridge, but the rosemary in the fridge will have a stronger flavor.",
    "Use rosemary that you keep in the fridge within 1-2 weeks for best results.",
    "Freeze rosemary in an ice cube tray.",
    "Strip off the leaves of your harvested rosemary sprigs and freeze them in water or olive oil in an ice cube tray.",
    "Use these cubes in sauces or soups to easily get a fresh rosemary taste in your recipes.",
    "The amount of leaves you freeze per cube is up to you.",
    "Check how much rosemary a common recipe you might make requires, and freeze that amount in one cube.",
    "Once the rosemary is frozen, you can empty the ice cube tray and store the cubes in an airtight container or ziploc bag in the freezer.",
    "Choose water or olive oil depending on what types of recipes you plan to use the ice cubes in.",
    "If you don’t know, then you can do some of each.",
    "Rosemary stored in the freezer will last indefinitely.",
    "If it starts to noticeably lose its flavor, then make a new batch.",
    "Put fresh rosemary in a bottle of vinegar or olive oil.",
    "Wash and air dry fresh harvested rosemary sprigs and place them directly into a bottle of vinegar, like white or balsamic, or olive oil to create a flavorful infusion.",
    "Use rosemary oil or vinegar in recipes, or combine them in a dish to create a dipping sauce for bread.",
    "Add other ingredients to the oil or vinegar infusions such as fresh garlic, peppercorns, or chili peppers for more flavor!",
    "Rosemary oil or vinegar will last as long as the rosemary stays covered by the oil or vinegar.",
    "If it becomes exposed to the air it can develop mold."
  ],
  "tyn_section":[
    "Scissors or shears",
    "Twine or rubber bands",
    "Bowl or basket",
    "Airtight containers or plastic bags"
  ],
  "tyn_model":[
    "rosemary",
    "vinegar",
    "olive oil",
    "ice cube tray",
    "ziploc bag",
    "water",
    "rosemary oil",
    "shears",
    "scissors",
    "basket",
    "bowl",
    "rosemary bush",
    "airtight containers",
    "twine",
    "airtight container",
    "ice cubes",
    "balsamic",
    "garlic",
    "chili peppers",
    "oil"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.25,
    "f1":0.375
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}