{
  "title":"How to Poach Pears",
  "url":"https://www.wikihow.com/Poach-Pears",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Traditional Poached Pears",
      "steps":[
        {
          "headline":"Peel the pears.",
          "description":"Slice in half and de-seed. You can use a melon baller or just a spoon to scoop out the seeds. You can also quarter the pears instead of halving them if you prefer. You can really use any type of pear you like, though some pears are better than others for poaching because they tend to keep their shape better instead of falling apart. Pears that are great for poaching include Beurre Bosc pears, Conference pears, Tiny Seckel pears, and Winter Nellis. Pears like the Anjou, Comice, or Bartlett tend to fall apart when you poach them."
        },
        {
          "headline":"Prepare the syrup.",
          "description":"Bring a pan of water to the boil, then add 1/2 cup of granulated sugar and 2 drops of vanilla essence. Heat until the mixture is warm and all of the sugar is dissolved in the water. For additional flavor, you can add any of the following: 1/2 cinnamon stick, 1 tsp. whole cloves, 1 lemon quarter, black peppercorns, 1-2 star anise, and 3-4 slices ginger. If you prefer, you can add 1/2 a cup of honey instead of sugar for a thicker flavor. If you'd like more flavor in the syrup, you can make the water mixture half water and half white wine, or 1/4 water and 3/4 red wine."
        },
        {
          "headline":"Poach the pears.",
          "description":"Carefully spoon the pear halves into the boiling water and leave to poach for 15-20 minutes. Keep your liquid boiling on low, so the pears are simmering as they cook. You don't want them to fall apart in the water. For an extra precaution, you can cut a piece of parchment paper with a large hole in the center to help keep the pears from floating up and poaching unevenly. Make sure to keep the poaches submerged in the liquid."
        },
        {
          "headline":"Check the pears are soft by sticking a knife into them gently.",
          "description":"You can also use a fork instead. If you stick the fork in the pears and they easily slide off, then they are ready. Leave to poach for a little longer if they feel too hard. Once the pears are done, you can add 1/4 cup of sour cherries, cranberries, or raisins to the liquid."
        },
        {
          "headline":"Spoon the poached pears into a serving bowl.",
          "description":"You can pour some of the syrup over the pears, or even reduce it (by boiling it for an additional 10-15 minutes to thicken it) first and then pour it over the pears. Let them cool in their liquid for at least 10 minutes."
        },
        {
          "headline":"Add a topping or side of your choice.",
          "description":"You can also serve the pears with cream, a scoop of vanilla ice cream and dark chocolate sauce, chocolate ice cream, fresh raspberries, blackberries, or blueberries, a spoonful of crème fraîche, or even next to gingerbread or a spice cake."
        }
      ]
    },
    {
      "name":"Oven-Poached Pears",
      "steps":[
        {
          "headline":"Preheat your oven to 400°F (204°C).",
          "description":"Place a large baking sheet in the oven to heat it up."
        },
        {
          "headline":"Peel, core, and slice your pears.",
          "description":"Peel the skin off your pears, core them, and slice each pear into 12 wedges."
        },
        {
          "headline":"Prepare your foil.",
          "description":"Cut 4 sheets of foil, about 12 inches (30.5 cm) long each, and place 1 of the sheets on a work surface."
        },
        {
          "headline":"Arrange the pear wedges on 1/2 of the foil.",
          "description":"Place 6 of the wedges (from one half of a pear) on half of the foil, making them overlap slightly."
        },
        {
          "headline":"Add the other ingredients.",
          "description":"Drizzle 1 tbsp. honey over the pears, and sprinkle them with 1 tsp. currants, 1/4 tsp. lemon peel, and a pinch of nutmeg. Then, fold the foil over the pears so they are completely enclosed in it. You can crimp the edges to seal the pears fully."
        },
        {
          "headline":"Repeat with the remaining pear wedges and ingredients.",
          "description":"Continue placing the rest of the pear wedges on the foil, covering them in the ingredients, and wrapping them in the foil."
        },
        {
          "headline":"Place the pears on the baking sheet and bake for 5 minutes.",
          "description":"Cook them until they are tender, and wait for them to cool completely, which should take at least 15 minutes."
        },
        {
          "headline":"Remove the pears from the foil packets.",
          "description":"Open the packets over four bowls to keep the juices that the pears were cooked in."
        },
        {
          "headline":"Serve.",
          "description":"Serve the pears in their juices along with 3 tbsp. of vanilla yogurt."
        }
      ]
    }
  ],
  "text":" Traditional Poached Pears Peel the pears. Slice in half and de-seed. You can use a melon baller or just a spoon to scoop out the seeds. You can also quarter the pears instead of halving them if you prefer. You can really use any type of pear you like, though some pears are better than others for poaching because they tend to keep their shape better instead of falling apart. Pears that are great for poaching include Beurre Bosc pears, Conference pears, Tiny Seckel pears, and Winter Nellis. Pears like the Anjou, Comice, or Bartlett tend to fall apart when you poach them. Prepare the syrup. Bring a pan of water to the boil, then add 1/2 cup of granulated sugar and 2 drops of vanilla essence. Heat until the mixture is warm and all of the sugar is dissolved in the water. For additional flavor, you can add any of the following: 1/2 cinnamon stick, 1 tsp. whole cloves, 1 lemon quarter, black peppercorns, 1-2 star anise, and 3-4 slices ginger. If you prefer, you can add 1/2 a cup of honey instead of sugar for a thicker flavor. If you'd like more flavor in the syrup, you can make the water mixture half water and half white wine, or 1/4 water and 3/4 red wine. Poach the pears. Carefully spoon the pear halves into the boiling water and leave to poach for 15-20 minutes. Keep your liquid boiling on low, so the pears are simmering as they cook. You don't want them to fall apart in the water. For an extra precaution, you can cut a piece of parchment paper with a large hole in the center to help keep the pears from floating up and poaching unevenly. Make sure to keep the poaches submerged in the liquid. Check the pears are soft by sticking a knife into them gently. You can also use a fork instead. If you stick the fork in the pears and they easily slide off, then they are ready. Leave to poach for a little longer if they feel too hard. Once the pears are done, you can add 1/4 cup of sour cherries, cranberries, or raisins to the liquid. Spoon the poached pears into a serving bowl. You can pour some of the syrup over the pears, or even reduce it (by boiling it for an additional 10-15 minutes to thicken it) first and then pour it over the pears. Let them cool in their liquid for at least 10 minutes. Add a topping or side of your choice. You can also serve the pears with cream, a scoop of vanilla ice cream and dark chocolate sauce, chocolate ice cream, fresh raspberries, blackberries, or blueberries, a spoonful of crème fraîche, or even next to gingerbread or a spice cake. Oven-Poached Pears Preheat your oven to 400°F (204°C). Place a large baking sheet in the oven to heat it up. Peel, core, and slice your pears. Peel the skin off your pears, core them, and slice each pear into 12 wedges. Prepare your foil. Cut 4 sheets of foil, about 12 inches (30.5 cm) long each, and place 1 of the sheets on a work surface. Arrange the pear wedges on 1/2 of the foil. Place 6 of the wedges (from one half of a pear) on half of the foil, making them overlap slightly. Add the other ingredients. Drizzle 1 tbsp. honey over the pears, and sprinkle them with 1 tsp. currants, 1/4 tsp. lemon peel, and a pinch of nutmeg. Then, fold the foil over the pears so they are completely enclosed in it. You can crimp the edges to seal the pears fully. Repeat with the remaining pear wedges and ingredients. Continue placing the rest of the pear wedges on the foil, covering them in the ingredients, and wrapping them in the foil. Place the pears on the baking sheet and bake for 5 minutes. Cook them until they are tender, and wait for them to cool completely, which should take at least 15 minutes. Remove the pears from the foil packets. Open the packets over four bowls to keep the juices that the pears were cooked in. Serve. Serve the pears in their juices along with 3 tbsp. of vanilla yogurt.",
  "sentences":[
    " Traditional Poached Pears Peel the pears.",
    "Slice in half and de-seed.",
    "You can use a melon baller or just a spoon to scoop out the seeds.",
    "You can also quarter the pears instead of halving them if you prefer.",
    "You can really use any type of pear you like, though some pears are better than others for poaching because they tend to keep their shape better instead of falling apart.",
    "Pears that are great for poaching include Beurre Bosc pears, Conference pears, Tiny Seckel pears, and Winter Nellis.",
    "Pears like the Anjou, Comice, or Bartlett tend to fall apart when you poach them.",
    "Prepare the syrup.",
    "Bring a pan of water to the boil, then add 1/2 cup of granulated sugar and 2 drops of vanilla essence.",
    "Heat until the mixture is warm and all of the sugar is dissolved in the water.",
    "For additional flavor, you can add any of the following: 1/2 cinnamon stick, 1 tsp.",
    "whole cloves, 1 lemon quarter, black peppercorns, 1-2 star anise, and 3-4 slices ginger.",
    "If you prefer, you can add 1/2 a cup of honey instead of sugar for a thicker flavor.",
    "If you'd like more flavor in the syrup, you can make the water mixture half water and half white wine, or 1/4 water and 3/4 red wine.",
    "Poach the pears.",
    "Carefully spoon the pear halves into the boiling water and leave to poach for 15-20 minutes.",
    "Keep your liquid boiling on low, so the pears are simmering as they cook.",
    "You don't want them to fall apart in the water.",
    "For an extra precaution, you can cut a piece of parchment paper with a large hole in the center to help keep the pears from floating up and poaching unevenly.",
    "Make sure to keep the poaches submerged in the liquid.",
    "Check the pears are soft by sticking a knife into them gently.",
    "You can also use a fork instead.",
    "If you stick the fork in the pears and they easily slide off, then they are ready.",
    "Leave to poach for a little longer if they feel too hard.",
    "Once the pears are done, you can add 1/4 cup of sour cherries, cranberries, or raisins to the liquid.",
    "Spoon the poached pears into a serving bowl.",
    "You can pour some of the syrup over the pears, or even reduce it (by boiling it for an additional 10-15 minutes to thicken it) first and then pour it over the pears.",
    "Let them cool in their liquid for at least 10 minutes.",
    "Add a topping or side of your choice.",
    "You can also serve the pears with cream, a scoop of vanilla ice cream and dark chocolate sauce, chocolate ice cream, fresh raspberries, blackberries, or blueberries, a spoonful of crème fraîche, or even next to gingerbread or a spice cake.",
    "Oven-Poached Pears Preheat your oven to 400°F (204°C).",
    "Place a large baking sheet in the oven to heat it up.",
    "Peel, core, and slice your pears.",
    "Peel the skin off your pears, core them, and slice each pear into 12 wedges.",
    "Prepare your foil.",
    "Cut 4 sheets of foil, about 12 inches (30.5 cm) long each, and place 1 of the sheets on a work surface.",
    "Arrange the pear wedges on 1/2 of the foil.",
    "Place 6 of the wedges (from one half of a pear) on half of the foil, making them overlap slightly.",
    "Add the other ingredients.",
    "Drizzle 1 tbsp.",
    "honey over the pears, and sprinkle them with 1 tsp.",
    "currants, 1/4 tsp.",
    "lemon peel, and a pinch of nutmeg.",
    "Then, fold the foil over the pears so they are completely enclosed in it.",
    "You can crimp the edges to seal the pears fully.",
    "Repeat with the remaining pear wedges and ingredients.",
    "Continue placing the rest of the pear wedges on the foil, covering them in the ingredients, and wrapping them in the foil.",
    "Place the pears on the baking sheet and bake for 5 minutes.",
    "Cook them until they are tender, and wait for them to cool completely, which should take at least 15 minutes.",
    "Remove the pears from the foil packets.",
    "Open the packets over four bowls to keep the juices that the pears were cooked in.",
    "Serve.",
    "Serve the pears in their juices along with 3 tbsp.",
    "of vanilla yogurt."
  ],
  "tyn_section":[
    "Saucepan",
    "Peeler",
    "Cutting board",
    "Knife",
    "Spoon",
    "Serving bowls"
  ],
  "tyn_model":[
    "pears",
    "water",
    "foil",
    "pear",
    "sugar",
    "honey",
    "fork",
    "oven",
    "baking sheet",
    "melon baller",
    "spoon",
    "granulated sugar",
    "vanilla essence",
    "cinnamon",
    "lemon",
    "ginger",
    "white wine",
    "red wine",
    "parchment paper",
    "knife",
    "sour cherries",
    "cranberries",
    "raisins",
    "serving bowl",
    "cream",
    "vanilla ice cream",
    "chocolate sauce",
    "chocolate ice cream",
    "blackberries",
    "blueberries",
    "crème fraîche",
    "spice cake",
    "oven-poached pears",
    "currants",
    "lemon peel",
    "nutmeg",
    "vanilla yogurt"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0540540541,
    "f1":0.0930232558,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0540540541,
    "f1":0.0930232558
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.0810810811,
    "f1":0.1395348837
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0540540541,
    "f1":0.0930232558
  }
}