{
  "title":"How to Make Paper Cup iPhone Speakers",
  "url":"https://www.wikihow.com/Make-Paper-Cup-iPhone-Speakers",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Digital Technology Art and Craft Projects"
  ],
  "methods":[
    {
      "name":"Using Paper Cups and Paper Rolls",
      "steps":[
        {
          "headline":"Find two paper cups and an empty toilet paper roll.",
          "description":"If you can't find an empty toilet paper roll, you can use an empty paper towel roll instead. Consider cutting the paper towel roll in half to make your speakers more compact and sturdy."
        },
        {
          "headline":"Trace the base of your iPhone onto the paper roll.",
          "description":"Set the roll down horizontally in front of you. Place the base of your iPhone on top of the roll, right in the center. Make sure that your phone is facing you. Use a pen or pencil to trace around the base of your phone. When you are done, set your phone aside. This method will also work on other phones and music players, such as iPods."
        },
        {
          "headline":"Cut out the rectangle you drew partway using a craft knife or box cutter.",
          "description":"Using the knife, cut out the front and sides of the rectangle. Leave the back edge uncut."
        },
        {
          "headline":"Fold the rectangle up at a 90 degree angle.",
          "description":"This will create a sort of tab for your phone to rest against."
        },
        {
          "headline":"Use a pen or pencil and the paper roll to trace a circle onto the side of each cup.",
          "description":"Position the circles close to the base of the cup. If you make the circles too high up, the speakers won't amplify very well."
        },
        {
          "headline":"Cut the circles out using a craft knife or box cutter.",
          "description":"Try to cut just inside the lines you drew. This will allow the paper roll to fit snugly inside the holes."
        },
        {
          "headline":"Push the cups onto the ends of the paper roll.",
          "description":"Don't push the cups all the way onto the per roll. 1 to 2 inches (2.54 to 5.08 centimeters) on each side should be plenty. If the cups wobble too much on the paper tube, draw a line of hot glue around the joint/seam. This will close the gap a little, and make your speakers more stable."
        },
        {
          "headline":"Decorate your speakers, if desired.",
          "description":"Paint the speakers a solid color using spray paint or acrylic paint. Wait until the paint dries, then add more designs, if desired. You can also wrap the paper tube with colored or patterned duct tape instead."
        },
        {
          "headline":"Insert the phone into the slot.",
          "description":"If you are using another type of phone, ensure that the speaker part is inside the slot. Hit the play and speaker buttons, and enjoy the music."
        }
      ]
    },
    {
      "name":"Using a Paper Cup",
      "steps":[
        {
          "headline":"Find a paper cup wide enough to fit your iPhone.",
          "description":"You will be placing the phone towards the back of the \"speaker\" so make sure that the base of the cup is wide enough. This method will also work on other types of phones as well as iPods and similar music players."
        },
        {
          "headline":"Use a pen or pencil to trace the base of your phone onto the side of a cup.",
          "description":"Try to get as close to the bottom of the cup as you can. The back of the phone needs to be parallel to the base of the cup."
        },
        {
          "headline":"Cut the rectangle out partway using a craft knife or box cutter.",
          "description":"Cut the sides and the front of the rectangle with your knife. Leave the back edge uncut."
        },
        {
          "headline":"Fold the rectangle up at a 90 degree angle.",
          "description":"This will create a small tab for your phone to rest against. If you need to, cut a vertical slit down the center of the tab."
        },
        {
          "headline":"Place the phone into the rectangle hole, and set the cup down on its side.",
          "description":"Hold the cup steady so that your phone is standing upright."
        },
        {
          "headline":"Hot glue a pencil to either side of the cup to keep it from rolling around.",
          "description":"While holding the speaker stead, place a pencil down to either side of the cup. Push the pencils towards the cup until it no longer rolls around. Secure the pencils to the cup with a hot glue gun. When the glue sets, let go of the speaker. The pencils will hold it steady."
        },
        {
          "headline":"Decorate the speaker, if desired.",
          "description":"Paint the speaker using spray paint or acrylic paint. Wait until the paint dries before adding more designs. You can also wrap colored washi tape around the rim, or decorate the sides with stickers."
        },
        {
          "headline":"Stick the phone into the slot.",
          "description":"If you are using another type of phone, be sure that the speaker is inside the slot. Press the play and speaker buttons on your phone, and enjoy the music."
        }
      ]
    },
    {
      "name":"Using Two Paper Cups",
      "steps":[
        {
          "headline":"Find two paper cups that are the same size.",
          "description":"You will be putting the two cups together to make a tapered speaker, so they need to be the same size. If one cup is bigger than the other one, your speaker won't work."
        },
        {
          "headline":"Cut the bottom off of each cup using a craft knife or box cutter.",
          "description":"Position the knife against the side of the cup, right against the bottom edge. Poke the knife through the wall of the cup. Then, using a sawing motion, cut around the base of the cup until the bottom falls off. Do this for both cups."
        },
        {
          "headline":"Draw a rectangle onto the side of each cup, right against the bottom edge.",
          "description":"The rectangle needs to be the same thickness as your phone, but only half the width. Align one of the narrow ends of the rectangle with the bottom edge of the cup. These two rectangles will eventually make a slot for your phone to go into. This method will also work for other types of phones as well as iPods and similar music players."
        },
        {
          "headline":"Cut the rectangle.",
          "description":"You can use a craft knife, box cutter, or a pair of scissors to do this. You can cut the rectangles out a few millimeters longer than they actually are; you will be overlapping the cups later, so the slot will shrink."
        },
        {
          "headline":"Slide the bottom of one cup into the other, and align the two rectangles.",
          "description":"Overlap the twp cups by a few millimeters; if you overlap them too much, your phone may not fit inside. Twist the cups until the rectangles match up. Consider sliding your phone into the slot, to make sure it is not too small."
        },
        {
          "headline":"Secure the two cups with a piece of tape.",
          "description":"Wrap the tape all the way around the seam between the two cups. Fold the ends of the tape into the rectangle slot."
        },
        {
          "headline":"Place the speaker on the table and insert your phone into the slot.",
          "description":"If you need to, widen the slot a little with a craft knife or box cutter until the phone fits. Hold the speakers until you get the angle you like."
        },
        {
          "headline":"Glue a bottle to the front and back of the speaker to hold it steady.",
          "description":"Still holding your speaker at the angle you want, place a bottle cap in front of the speaker, and another one behind the speaker. Make sure that they are aligned with the seam. Secure the bottle caps to the speakers with hot glue. Once the glue sets, let go of the speaker. The bottle caps should now hold it steady. If you don't have bottle caps, you can use other items, such as Lego bricks or small rocks."
        },
        {
          "headline":"Decorate your speakers, if desired.",
          "description":"Paint the speakers a using spray paint or acrylic paint. Wait until the paint dries, before adding more designs. You can also wrap colored washi tape around the cup rims and slot edges. For a more playful speaker, decorate it with stickers, such as stars or lightning bolts."
        },
        {
          "headline":"Place the phone into the slot.",
          "description":"If you are using another type of phone, make sure that the speaker is inside the slit. Hit the play and speaker buttons on your phone, and enjoy the music."
        }
      ]
    }
  ],
  "text":" Using Paper Cups and Paper Rolls Find two paper cups and an empty toilet paper roll. If you can't find an empty toilet paper roll, you can use an empty paper towel roll instead. Consider cutting the paper towel roll in half to make your speakers more compact and sturdy. Trace the base of your iPhone onto the paper roll. Set the roll down horizontally in front of you. Place the base of your iPhone on top of the roll, right in the center. Make sure that your phone is facing you. Use a pen or pencil to trace around the base of your phone. When you are done, set your phone aside. This method will also work on other phones and music players, such as iPods. Cut out the rectangle you drew partway using a craft knife or box cutter. Using the knife, cut out the front and sides of the rectangle. Leave the back edge uncut. Fold the rectangle up at a 90 degree angle. This will create a sort of tab for your phone to rest against. Use a pen or pencil and the paper roll to trace a circle onto the side of each cup. Position the circles close to the base of the cup. If you make the circles too high up, the speakers won't amplify very well. Cut the circles out using a craft knife or box cutter. Try to cut just inside the lines you drew. This will allow the paper roll to fit snugly inside the holes. Push the cups onto the ends of the paper roll. Don't push the cups all the way onto the per roll. 1 to 2 inches (2.54 to 5.08 centimeters) on each side should be plenty. If the cups wobble too much on the paper tube, draw a line of hot glue around the joint/seam. This will close the gap a little, and make your speakers more stable. Decorate your speakers, if desired. Paint the speakers a solid color using spray paint or acrylic paint. Wait until the paint dries, then add more designs, if desired. You can also wrap the paper tube with colored or patterned duct tape instead. Insert the phone into the slot. If you are using another type of phone, ensure that the speaker part is inside the slot. Hit the play and speaker buttons, and enjoy the music. Using a Paper Cup Find a paper cup wide enough to fit your iPhone. You will be placing the phone towards the back of the \"speaker\" so make sure that the base of the cup is wide enough. This method will also work on other types of phones as well as iPods and similar music players. Use a pen or pencil to trace the base of your phone onto the side of a cup. Try to get as close to the bottom of the cup as you can. The back of the phone needs to be parallel to the base of the cup. Cut the rectangle out partway using a craft knife or box cutter. Cut the sides and the front of the rectangle with your knife. Leave the back edge uncut. Fold the rectangle up at a 90 degree angle. This will create a small tab for your phone to rest against. If you need to, cut a vertical slit down the center of the tab. Place the phone into the rectangle hole, and set the cup down on its side. Hold the cup steady so that your phone is standing upright. Hot glue a pencil to either side of the cup to keep it from rolling around. While holding the speaker stead, place a pencil down to either side of the cup. Push the pencils towards the cup until it no longer rolls around. Secure the pencils to the cup with a hot glue gun. When the glue sets, let go of the speaker. The pencils will hold it steady. Decorate the speaker, if desired. Paint the speaker using spray paint or acrylic paint. Wait until the paint dries before adding more designs. You can also wrap colored washi tape around the rim, or decorate the sides with stickers. Stick the phone into the slot. If you are using another type of phone, be sure that the speaker is inside the slot. Press the play and speaker buttons on your phone, and enjoy the music. Using Two Paper Cups Find two paper cups that are the same size. You will be putting the two cups together to make a tapered speaker, so they need to be the same size. If one cup is bigger than the other one, your speaker won't work. Cut the bottom off of each cup using a craft knife or box cutter. Position the knife against the side of the cup, right against the bottom edge. Poke the knife through the wall of the cup. Then, using a sawing motion, cut around the base of the cup until the bottom falls off. Do this for both cups. Draw a rectangle onto the side of each cup, right against the bottom edge. The rectangle needs to be the same thickness as your phone, but only half the width. Align one of the narrow ends of the rectangle with the bottom edge of the cup. These two rectangles will eventually make a slot for your phone to go into. This method will also work for other types of phones as well as iPods and similar music players. Cut the rectangle. You can use a craft knife, box cutter, or a pair of scissors to do this. You can cut the rectangles out a few millimeters longer than they actually are; you will be overlapping the cups later, so the slot will shrink. Slide the bottom of one cup into the other, and align the two rectangles. Overlap the twp cups by a few millimeters; if you overlap them too much, your phone may not fit inside. Twist the cups until the rectangles match up. Consider sliding your phone into the slot, to make sure it is not too small. Secure the two cups with a piece of tape. Wrap the tape all the way around the seam between the two cups. Fold the ends of the tape into the rectangle slot. Place the speaker on the table and insert your phone into the slot. If you need to, widen the slot a little with a craft knife or box cutter until the phone fits. Hold the speakers until you get the angle you like. Glue a bottle to the front and back of the speaker to hold it steady. Still holding your speaker at the angle you want, place a bottle cap in front of the speaker, and another one behind the speaker. Make sure that they are aligned with the seam. Secure the bottle caps to the speakers with hot glue. Once the glue sets, let go of the speaker. The bottle caps should now hold it steady. If you don't have bottle caps, you can use other items, such as Lego bricks or small rocks. Decorate your speakers, if desired. Paint the speakers a using spray paint or acrylic paint. Wait until the paint dries, before adding more designs. You can also wrap colored washi tape around the cup rims and slot edges. For a more playful speaker, decorate it with stickers, such as stars or lightning bolts. Place the phone into the slot. If you are using another type of phone, make sure that the speaker is inside the slit. Hit the play and speaker buttons on your phone, and enjoy the music.",
  "sentences":[
    " Using Paper Cups and Paper Rolls Find two paper cups and an empty toilet paper roll.",
    "If you can't find an empty toilet paper roll, you can use an empty paper towel roll instead.",
    "Consider cutting the paper towel roll in half to make your speakers more compact and sturdy.",
    "Trace the base of your iPhone onto the paper roll.",
    "Set the roll down horizontally in front of you.",
    "Place the base of your iPhone on top of the roll, right in the center.",
    "Make sure that your phone is facing you.",
    "Use a pen or pencil to trace around the base of your phone.",
    "When you are done, set your phone aside.",
    "This method will also work on other phones and music players, such as iPods.",
    "Cut out the rectangle you drew partway using a craft knife or box cutter.",
    "Using the knife, cut out the front and sides of the rectangle.",
    "Leave the back edge uncut.",
    "Fold the rectangle up at a 90 degree angle.",
    "This will create a sort of tab for your phone to rest against.",
    "Use a pen or pencil and the paper roll to trace a circle onto the side of each cup.",
    "Position the circles close to the base of the cup.",
    "If you make the circles too high up, the speakers won't amplify very well.",
    "Cut the circles out using a craft knife or box cutter.",
    "Try to cut just inside the lines you drew.",
    "This will allow the paper roll to fit snugly inside the holes.",
    "Push the cups onto the ends of the paper roll.",
    "Don't push the cups all the way onto the per roll.",
    "1 to 2 inches (2.54 to 5.08 centimeters) on each side should be plenty.",
    "If the cups wobble too much on the paper tube, draw a line of hot glue around the joint/seam.",
    "This will close the gap a little, and make your speakers more stable.",
    "Decorate your speakers, if desired.",
    "Paint the speakers a solid color using spray paint or acrylic paint.",
    "Wait until the paint dries, then add more designs, if desired.",
    "You can also wrap the paper tube with colored or patterned duct tape instead.",
    "Insert the phone into the slot.",
    "If you are using another type of phone, ensure that the speaker part is inside the slot.",
    "Hit the play and speaker buttons, and enjoy the music.",
    "Using a Paper Cup Find a paper cup wide enough to fit your iPhone.",
    "You will be placing the phone towards the back of the \"speaker\" so make sure that the base of the cup is wide enough.",
    "This method will also work on other types of phones as well as iPods and similar music players.",
    "Use a pen or pencil to trace the base of your phone onto the side of a cup.",
    "Try to get as close to the bottom of the cup as you can.",
    "The back of the phone needs to be parallel to the base of the cup.",
    "Cut the rectangle out partway using a craft knife or box cutter.",
    "Cut the sides and the front of the rectangle with your knife.",
    "Leave the back edge uncut.",
    "Fold the rectangle up at a 90 degree angle.",
    "This will create a small tab for your phone to rest against.",
    "If you need to, cut a vertical slit down the center of the tab.",
    "Place the phone into the rectangle hole, and set the cup down on its side.",
    "Hold the cup steady so that your phone is standing upright.",
    "Hot glue a pencil to either side of the cup to keep it from rolling around.",
    "While holding the speaker stead, place a pencil down to either side of the cup.",
    "Push the pencils towards the cup until it no longer rolls around.",
    "Secure the pencils to the cup with a hot glue gun.",
    "When the glue sets, let go of the speaker.",
    "The pencils will hold it steady.",
    "Decorate the speaker, if desired.",
    "Paint the speaker using spray paint or acrylic paint.",
    "Wait until the paint dries before adding more designs.",
    "You can also wrap colored washi tape around the rim, or decorate the sides with stickers.",
    "Stick the phone into the slot.",
    "If you are using another type of phone, be sure that the speaker is inside the slot.",
    "Press the play and speaker buttons on your phone, and enjoy the music.",
    "Using Two Paper Cups Find two paper cups that are the same size.",
    "You will be putting the two cups together to make a tapered speaker, so they need to be the same size.",
    "If one cup is bigger than the other one, your speaker won't work.",
    "Cut the bottom off of each cup using a craft knife or box cutter.",
    "Position the knife against the side of the cup, right against the bottom edge.",
    "Poke the knife through the wall of the cup.",
    "Then, using a sawing motion, cut around the base of the cup until the bottom falls off.",
    "Do this for both cups.",
    "Draw a rectangle onto the side of each cup, right against the bottom edge.",
    "The rectangle needs to be the same thickness as your phone, but only half the width.",
    "Align one of the narrow ends of the rectangle with the bottom edge of the cup.",
    "These two rectangles will eventually make a slot for your phone to go into.",
    "This method will also work for other types of phones as well as iPods and similar music players.",
    "Cut the rectangle.",
    "You can use a craft knife, box cutter, or a pair of scissors to do this.",
    "You can cut the rectangles out a few millimeters longer than they actually are; you will be overlapping the cups later, so the slot will shrink.",
    "Slide the bottom of one cup into the other, and align the two rectangles.",
    "Overlap the twp cups by a few millimeters; if you overlap them too much, your phone may not fit inside.",
    "Twist the cups until the rectangles match up.",
    "Consider sliding your phone into the slot, to make sure it is not too small.",
    "Secure the two cups with a piece of tape.",
    "Wrap the tape all the way around the seam between the two cups.",
    "Fold the ends of the tape into the rectangle slot.",
    "Place the speaker on the table and insert your phone into the slot.",
    "If you need to, widen the slot a little with a craft knife or box cutter until the phone fits.",
    "Hold the speakers until you get the angle you like.",
    "Glue a bottle to the front and back of the speaker to hold it steady.",
    "Still holding your speaker at the angle you want, place a bottle cap in front of the speaker, and another one behind the speaker.",
    "Make sure that they are aligned with the seam.",
    "Secure the bottle caps to the speakers with hot glue.",
    "Once the glue sets, let go of the speaker.",
    "The bottle caps should now hold it steady.",
    "If you don't have bottle caps, you can use other items, such as Lego bricks or small rocks.",
    "Decorate your speakers, if desired.",
    "Paint the speakers a using spray paint or acrylic paint.",
    "Wait until the paint dries, before adding more designs.",
    "You can also wrap colored washi tape around the cup rims and slot edges.",
    "For a more playful speaker, decorate it with stickers, such as stars or lightning bolts.",
    "Place the phone into the slot.",
    "If you are using another type of phone, make sure that the speaker is inside the slit.",
    "Hit the play and speaker buttons on your phone, and enjoy the music."
  ],
  "tyn_section":[
    "2 paper cups",
    "1 empty toilet paper roll/paper towel roll",
    "Craft knife or box cutter",
    "Pen or pencil",
    "Paint (optional)",
    "iPhone, iPod, or cellphone",
    "1 paper cup",
    "2 pencils or short dowels",
    "Hot glue",
    "2 identical paper cups",
    "Tape",
    "2 bottle caps"
  ],
  "tyn_model":[
    "phone",
    "craft knife",
    "box cutter",
    "knife",
    "pencil",
    "iphone",
    "pen",
    "paper",
    "spray paint",
    "acrylic paint",
    "tape",
    "bottle caps",
    "toilet paper roll",
    "hot glue",
    "washi tape",
    "speaker",
    "paper cups",
    "paper towel roll",
    "paper towel",
    "speakers",
    "duct tape",
    "cup",
    "hot glue gun",
    "scissors",
    "twp cups",
    "bottle",
    "bottle cap"
  ],
  "simple_metrics":{
    "r":0.1666666667,
    "p":0.0740740741,
    "f1":0.1025641026,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4166666667,
    "p":0.2592592593,
    "f1":0.3196347032
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.6666666667,
    "f1":0.7407407407
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.1851851852,
    "f1":0.2380952381
  }
}