{
  "title":"How to Make a Pipe from a Soda Can",
  "url":"https://www.wikihow.com/Make-a-Pipe-from-a-Soda-Can",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Making a Basic Pipe",
      "steps":[
        {
          "headline":"Get a pull-tab aluminum can.",
          "description":"A typical 12 oz soda can works fine, as well as a larger \"tallboy\" style can. Make sure all the soda or beer is out of the can and rinse it out with clean water. Let it dry before continuing with the process."
        },
        {
          "headline":"Get a needle,  pin or other sharp object.",
          "description":"The next step is to make holes in the center of the can's side. A pencil or pen is also an effective hole-poker. If nothing is available, consider breaking the can's tab in half and using the sharp point to create a series of small holes."
        },
        {
          "headline":"Make an thumb-sized indention on side of the can.",
          "description":"Since you'll want to place your smokables on the other side of the hole you'll smoke out of, make it the opposite side of the mouth of the can. Use your thumb to press in a shallow rut."
        },
        {
          "headline":"Poke small holes.",
          "description":"Use the needle, pin or other piercing implement to poke a pattern of holes over the basin formed by the indention. They don't need to be big, but the more of them you make, the better. Create a grate-like pattern."
        },
        {
          "headline":"Poke a large hole on the side.",
          "description":"Pick location which feels most natural to cover with a finger or thumb as you smoke, then use a sharpened pencil or a pen to pierce the can."
        },
        {
          "headline":"Remove the tab off the can.",
          "description":"Wiggle the tab back and forth on the can until the metal attaching it weakens and breaks away. Work carefully to avoid accidentally dropping the tab into the can."
        },
        {
          "headline":"Condition the pipe by heating the smoking area and the adjacent area of the can.",
          "description":"While there's no scientific evidence to back this claim, the general idea is that this will vaporize chemicals used to coat the interior of the can before you light up. You can also sand the paint off the indention and the adjacent area. The belief is that this removes a large part of the potentially harmful material that might be vaporized as you smoke. You can use the end of the hole-poker you used, or some sandpaper if some is available."
        },
        {
          "headline":"Smoke.",
          "description":"To smoke, place your tobacco or other smoking material on the indentation, hold you mouth to the drinking hole in the can, and cover the cab with your thumb. Inhale to fill the can with smoke and release the carb when you're ready to inhale."
        },
        {
          "headline":"Understand the health risks.",
          "description":"Heating and inhaling aluminum is commonly believed to have a link to Alzheimer's and other neurological diseases. While it's true that it's difficult to heat the aluminum to a high enough vaporization point using a simple Bic lighter, it's also inefficient and probably best to not mess with. Studies are inconclusive on whether aluminum can cause Alzheimer's. That said, the plastics used in the paint and inner lining can contain BPA, and it isn't clear that heating and sanding will remove enough of these plastics. When smoked, it's possible that they may increase your risk of cancer. The basic principle of the soda-can pipe can also be transferred to widely available things like apples, potatoes, and other things that don't have the harmful potential for side-effects. Smoke at your own risk."
        }
      ]
    },
    {
      "name":"Making a Water-Pipe With Cans",
      "steps":[
        {
          "headline":"Assemble the necessary materials.",
          "description":"If you want to make a water-pipe or bong-style pipe to smoke out of, you'll need:\nTwo 12 oz cans\nTape\nCan opener\nScissors\nA trumpet mouthpiece or glass slide\nWater"
        },
        {
          "headline":"Cut the ends off the cans.",
          "description":"After rinsing and drying two 12 ounce (340 g) cans, you'll want to use the can opener to remove both ends of one can and the top end of the other can. Use the can opener as you normally would to open a can of soup. Now, you should have one cylinder with both ends removed and one with no top which will act as the base."
        },
        {
          "headline":"Bend in the sharp edges of the top of the can with both ends cut out.",
          "description":"Cover it with tape to make sure you can't get cut on the edge. You will place your mouth on this end."
        },
        {
          "headline":"Poke a hole in the side of the can with the base.",
          "description":"On the side of the can, poke a hole large enough to fit the stem of the mouthpiece or whatever you plan on lighting your smokables in. Try to make sure you round out of the edges of the hole. You can cover it with plenty of layers of tape."
        },
        {
          "headline":"Attach the mouthpiece, so it fits snugly.",
          "description":"Connect it with tape. Spend some time building up the tape layers so it'll fit snugly."
        },
        {
          "headline":"Tape the cylinder on top of the base can.",
          "description":"Tape both cans together to create the full chamber of the water pipe."
        },
        {
          "headline":"Add water to the pipe.",
          "description":"Fill it with enough water so that the stem of the mouthpiece is slightly submerged."
        },
        {
          "headline":"Smoke.",
          "description":"To smoke, fill the mouthpiece with whatever you're planning on smoking and inhale through the top of the top can. When the chamber fills with smoke, remove the mouthpiece when you want to inhale."
        }
      ]
    }
  ],
  "text":" Making a Basic Pipe Get a pull-tab aluminum can. A typical 12 oz soda can works fine, as well as a larger \"tallboy\" style can. Make sure all the soda or beer is out of the can and rinse it out with clean water. Let it dry before continuing with the process. Get a needle,  pin or other sharp object. The next step is to make holes in the center of the can's side. A pencil or pen is also an effective hole-poker. If nothing is available, consider breaking the can's tab in half and using the sharp point to create a series of small holes. Make an thumb-sized indention on side of the can. Since you'll want to place your smokables on the other side of the hole you'll smoke out of, make it the opposite side of the mouth of the can. Use your thumb to press in a shallow rut. Poke small holes. Use the needle, pin or other piercing implement to poke a pattern of holes over the basin formed by the indention. They don't need to be big, but the more of them you make, the better. Create a grate-like pattern. Poke a large hole on the side. Pick location which feels most natural to cover with a finger or thumb as you smoke, then use a sharpened pencil or a pen to pierce the can. Remove the tab off the can. Wiggle the tab back and forth on the can until the metal attaching it weakens and breaks away. Work carefully to avoid accidentally dropping the tab into the can. Condition the pipe by heating the smoking area and the adjacent area of the can. While there's no scientific evidence to back this claim, the general idea is that this will vaporize chemicals used to coat the interior of the can before you light up. You can also sand the paint off the indention and the adjacent area. The belief is that this removes a large part of the potentially harmful material that might be vaporized as you smoke. You can use the end of the hole-poker you used, or some sandpaper if some is available. Smoke. To smoke, place your tobacco or other smoking material on the indentation, hold you mouth to the drinking hole in the can, and cover the cab with your thumb. Inhale to fill the can with smoke and release the carb when you're ready to inhale. Understand the health risks. Heating and inhaling aluminum is commonly believed to have a link to Alzheimer's and other neurological diseases. While it's true that it's difficult to heat the aluminum to a high enough vaporization point using a simple Bic lighter, it's also inefficient and probably best to not mess with. Studies are inconclusive on whether aluminum can cause Alzheimer's. That said, the plastics used in the paint and inner lining can contain BPA, and it isn't clear that heating and sanding will remove enough of these plastics. When smoked, it's possible that they may increase your risk of cancer. The basic principle of the soda-can pipe can also be transferred to widely available things like apples, potatoes, and other things that don't have the harmful potential for side-effects. Smoke at your own risk. Making a Water-Pipe With Cans Assemble the necessary materials. If you want to make a water-pipe or bong-style pipe to smoke out of, you'll need:\nTwo 12 oz cans\nTape\nCan opener\nScissors\nA trumpet mouthpiece or glass slide\nWater Cut the ends off the cans. After rinsing and drying two 12 ounce (340 g) cans, you'll want to use the can opener to remove both ends of one can and the top end of the other can. Use the can opener as you normally would to open a can of soup. Now, you should have one cylinder with both ends removed and one with no top which will act as the base. Bend in the sharp edges of the top of the can with both ends cut out. Cover it with tape to make sure you can't get cut on the edge. You will place your mouth on this end. Poke a hole in the side of the can with the base. On the side of the can, poke a hole large enough to fit the stem of the mouthpiece or whatever you plan on lighting your smokables in. Try to make sure you round out of the edges of the hole. You can cover it with plenty of layers of tape. Attach the mouthpiece, so it fits snugly. Connect it with tape. Spend some time building up the tape layers so it'll fit snugly. Tape the cylinder on top of the base can. Tape both cans together to create the full chamber of the water pipe. Add water to the pipe. Fill it with enough water so that the stem of the mouthpiece is slightly submerged. Smoke. To smoke, fill the mouthpiece with whatever you're planning on smoking and inhale through the top of the top can. When the chamber fills with smoke, remove the mouthpiece when you want to inhale.",
  "sentences":[
    " Making a Basic Pipe Get a pull-tab aluminum can.",
    "A typical 12 oz soda can works fine, as well as a larger \"tallboy\" style can.",
    "Make sure all the soda or beer is out of the can and rinse it out with clean water.",
    "Let it dry before continuing with the process.",
    "Get a needle,  pin or other sharp object.",
    "The next step is to make holes in the center of the can's side.",
    "A pencil or pen is also an effective hole-poker.",
    "If nothing is available, consider breaking the can's tab in half and using the sharp point to create a series of small holes.",
    "Make an thumb-sized indention on side of the can.",
    "Since you'll want to place your smokables on the other side of the hole you'll smoke out of, make it the opposite side of the mouth of the can.",
    "Use your thumb to press in a shallow rut.",
    "Poke small holes.",
    "Use the needle, pin or other piercing implement to poke a pattern of holes over the basin formed by the indention.",
    "They don't need to be big, but the more of them you make, the better.",
    "Create a grate-like pattern.",
    "Poke a large hole on the side.",
    "Pick location which feels most natural to cover with a finger or thumb as you smoke, then use a sharpened pencil or a pen to pierce the can.",
    "Remove the tab off the can.",
    "Wiggle the tab back and forth on the can until the metal attaching it weakens and breaks away.",
    "Work carefully to avoid accidentally dropping the tab into the can.",
    "Condition the pipe by heating the smoking area and the adjacent area of the can.",
    "While there's no scientific evidence to back this claim, the general idea is that this will vaporize chemicals used to coat the interior of the can before you light up.",
    "You can also sand the paint off the indention and the adjacent area.",
    "The belief is that this removes a large part of the potentially harmful material that might be vaporized as you smoke.",
    "You can use the end of the hole-poker you used, or some sandpaper if some is available.",
    "Smoke.",
    "To smoke, place your tobacco or other smoking material on the indentation, hold you mouth to the drinking hole in the can, and cover the cab with your thumb.",
    "Inhale to fill the can with smoke and release the carb when you're ready to inhale.",
    "Understand the health risks.",
    "Heating and inhaling aluminum is commonly believed to have a link to Alzheimer's and other neurological diseases.",
    "While it's true that it's difficult to heat the aluminum to a high enough vaporization point using a simple Bic lighter, it's also inefficient and probably best to not mess with.",
    "Studies are inconclusive on whether aluminum can cause Alzheimer's.",
    "That said, the plastics used in the paint and inner lining can contain BPA, and it isn't clear that heating and sanding will remove enough of these plastics.",
    "When smoked, it's possible that they may increase your risk of cancer.",
    "The basic principle of the soda-can pipe can also be transferred to widely available things like apples, potatoes, and other things that don't have the harmful potential for side-effects.",
    "Smoke at your own risk.",
    "Making a Water-Pipe With Cans Assemble the necessary materials.",
    "If you want to make a water-pipe or bong-style pipe to smoke out of, you'll need:\nTwo 12 oz cans\nTape\nCan opener\nScissors\nA trumpet mouthpiece or glass slide\nWater Cut the ends off the cans.",
    "After rinsing and drying two 12 ounce (340 g) cans, you'll want to use the can opener to remove both ends of one can and the top end of the other can.",
    "Use the can opener as you normally would to open a can of soup.",
    "Now, you should have one cylinder with both ends removed and one with no top which will act as the base.",
    "Bend in the sharp edges of the top of the can with both ends cut out.",
    "Cover it with tape to make sure you can't get cut on the edge.",
    "You will place your mouth on this end.",
    "Poke a hole in the side of the can with the base.",
    "On the side of the can, poke a hole large enough to fit the stem of the mouthpiece or whatever you plan on lighting your smokables in.",
    "Try to make sure you round out of the edges of the hole.",
    "You can cover it with plenty of layers of tape.",
    "Attach the mouthpiece, so it fits snugly.",
    "Connect it with tape.",
    "Spend some time building up the tape layers so it'll fit snugly.",
    "Tape the cylinder on top of the base can.",
    "Tape both cans together to create the full chamber of the water pipe.",
    "Add water to the pipe.",
    "Fill it with enough water so that the stem of the mouthpiece is slightly submerged.",
    "Smoke.",
    "To smoke, fill the mouthpiece with whatever you're planning on smoking and inhale through the top of the top can.",
    "When the chamber fills with smoke, remove the mouthpiece when you want to inhale."
  ],
  "tyn_section":[
    "Soda can",
    "Needle, pin, awl, ice pick (or similar)",
    "Sharpened pencil, pen, Phillips screwdriver (or similar)",
    "Sandpaper - fine grit",
    "Lighter"
  ],
  "tyn_model":[
    "water",
    "tape",
    "aluminum",
    "can opener",
    "needle",
    "pin",
    "water-pipe",
    "pull-tab aluminum can",
    "soda can",
    "soda",
    "pencil",
    "piercing implement",
    "sharpened pencil",
    "pen",
    "paint",
    "sandpaper",
    "tobacco",
    "bic lighter",
    "soda-can",
    "apples",
    "scissors",
    "soup",
    "can"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.0434782609,
    "f1":0.0714285714,
    "avg_pos":0.347826087
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.1739130435,
    "f1":0.2424242424
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.2173913043,
    "f1":0.2816901408
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.0434782609,
    "f1":0.0714285714
  }
}