{
  "title":"How to Make Shepherd's Pie",
  "url":"https://www.wikihow.com/Make-Shepherd%27s-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Potato Dishes"
  ],
  "methods":[
    {
      "name":"Making a Traditional Shepherd's Pie",
      "steps":[
        {
          "headline":"Add water and chopped potatoes into a large stock pot.",
          "description":"Fill the pot with water. Then, peel and chop 5 pounds (2.3 kg) of potatoes into 1–2 in (2.5–5.1 cm) slices with a sharp kitchen knife. Add the potatoes to the pot. Be sure that the potatoes are completely submerged in the water when you add them. Add some more water to the pot if needed."
        },
        {
          "headline":"Cover the pot and cook the potatoes for 20-25 minutes.",
          "description":"Place the lid on the pot and bring the water to boil over high heat. Then, reduce the heat to medium and continue cooking for about 20-25 minutes until the potatoes are tender. Use a fork to pierce a potato to check if it is tender."
        },
        {
          "headline":"Drain the potatoes and mash them with ½ cup (115 g) of butter.",
          "description":"Pour the water out of the pot in the sink, using a colander to catch the potatoes. Return the potatoes to the pot and add the butter. Mash them with a potato masher until they are as smooth as you like them. For extra smooth potatoes, you can also use a hand mixer."
        },
        {
          "headline":"Stir in the sour cream, milk, salt, pepper, seasoning salt, garlic powder, and onion powder.",
          "description":"Add ⁄2 cup (120 ml) of sour cream, ⁄3 cup (79 ml) of milk, 1 tsp (5 g) of salt, ½ tsp (1 g) of pepper, ½ tsp (2 g) of seasoning salt, ¼ tsp (1 g) of garlic powder, and ¼ tsp (1 g) of onion powder to the mashed potatoes. Stir with a wooden spoon or a whisk until the spices are evenly distributed. Cover the pot and set it aside. For extra flavor, mince two cloves of fresh garlic and add to the mixture."
        },
        {
          "headline":"Chop 1 medium onion and 5 medium carrots.",
          "description":"Use a sharp kitchen knife to peel and chop the onion into small square pieces. Then, peel the carrots. Chop off the root ends and slice them into medallions, about ⁄2 in (1.3 cm) thick. If you are in a hurry, skip peeling the carrots and simply rinse them with cold water before chopping them."
        },
        {
          "headline":"Saute the onions and carrots in ¼ cup (58 g) of melted butter for 8 minutes.",
          "description":"Set a large skillet on the stove over medium heat. Cook the butter for about 1-2 minutes until it is completely melted. Then, add the chopped onions and carrots. Check that the carrots are tender by piercing one piece with a fork. The carrots should be tender, but not mushy. The fork should go into a carrot slice easily without making it fall apart."
        },
        {
          "headline":"Add 1 ⁄2 lb (0.68 kg) of ground beef to the skillet and saute for 5-6 minutes.",
          "description":"Use a wooden spoon to gently mix the meat in with the other ingredients. Cook the meat until it is no longer pink. Then, drain the fat out of the skillet."
        },
        {
          "headline":"Add the beef broth, cornstarch, frozen peas, and Worcestershire sauce.",
          "description":"In a small bowl, mix together 1 ⁄2 cups (350 ml) of beef broth and 1 tablespoon (10 g) of cornstarch. Pour the mixture into the skillet. Then, add 1 ½ cups (225 g) of frozen peas and 1 ⁄2 teaspoons (7.4 ml) of Worcestershire sauce to the skillet."
        },
        {
          "headline":"Cook the mixture on high heat for 5 minutes.",
          "description":"Wait until the mixture boils and the sauces has thickened. Cook it until it reduces to the consistency you like. Remember it will get a little thicker after you bake it in the oven, too."
        },
        {
          "headline":"Pour the mixture into a casserole dish and top with potatoes and cheese.",
          "description":"Pour it carefully and spread it out with a wooden spoon or spatula so it covers the bottom of the casserole dish. Layer the mashed potatoes on top of the meat mixture. Use the spatula to spread them evenly as well. Finally, sprinkle 1 cup (125 g) of shredded cheddar cheese on top. If you don't have pre-shredded cheese, you can easily shred 4 ounces (110 g) of solid cheddar to make 1 cup of shredded cheese."
        },
        {
          "headline":"Bake at 350 °F (177 °C) for 30 minutes.",
          "description":"Check on the dish periodically. Keep it in the oven for at least 30 minutes until it starts to bubble. If you are in a hurry, you can bake it for 20 minutes at 375 °F (191 °C)."
        },
        {
          "headline":"Broil the dish for 2 minutes for extra crunchy cheese.",
          "description":"If you like to have your cheese extra crunchy and brown, transfer the dish to the top rack after it's done cooking. Set your oven to broil for 2 extra minutes. Be sure to keep an eye on the dish while it's broiling to make sure it doesn't burn."
        },
        {
          "headline":"Let the dish cool for 5-10 minutes before serving.",
          "description":"Use hot pads to bring the Shepherd's Pie out of the oven. After it cools, use a knife and spatula to cut and serve it."
        }
      ]
    },
    {
      "name":"Using a Skillet",
      "steps":[
        {
          "headline":"Make 3-1/2 cups (1200 g) of mashed potatoes and set them aside.",
          "description":"To do this, peel and chop 5 pounds (2.3 kg) of potatoes into 1–2 inches (2.5–5.1 cm) slices. Add them to a large pot filled with water, put a lid on the pot, and bring the water to boil. Turn the heat to medium and cook the potatoes for 20-25 minutes. Drain the potatoes and mash them with ½ cup (115 g) of butter, then mash them with a potato masher. Prepare the mashed potatoes however you like them. You can make traditional mashed potatoes with butter, or make them with roasted garlic."
        },
        {
          "headline":"Cook the beef and onions over medium heat for 5-6 minutes.",
          "description":"Chop 1 cup (150 g) of onions. Add them to the skillet along with 1 pound (0.45 kg) of ground beef. Cook on medium heat until the meat is no longer pink."
        },
        {
          "headline":"Stir in the corn, peas, ketchup, Worcestershire sauce, and garlic.",
          "description":"Add 2 cups (300 g) of frozen corn, 2 cups (300 g) of frozen peas, 2 tablespoons (30 ml) of ketchup, 1 tablespoon (15 ml) of Worcestershire sauce, and 2 cloves of minced garlic to the skillet. Stir the mixture with a wooden spoon until they are well combined. Substitute 2 tablespoons (30 ml) of tomato paste for a more hearty flavor."
        },
        {
          "headline":"Cover and cook the ingredients for 5 minutes on medium-low heat.",
          "description":"Turn the heat down to medium-low. Put a lid on the skillet and allow the ingredients to cook inside for 5 minutes."
        },
        {
          "headline":"Add the cornstarch, bouillon, and water and bring the mixture to a boil.",
          "description":"Mix together 1 tablespoon (10 g) of cornstarch, 1 beef bouillon cube, and ⁄2 cup (120 ml) of cold water in a small bowl. Then, add this mixture to the skillet. Increase the heat to high. Heat it for 2-3 minutes until it begins to boil."
        },
        {
          "headline":"Reduce the heat to medium and stir for 2 minutes.",
          "description":"Use a wooden spoon to gently stir the ingredients. Continue stirring for about 2 minutes to thicken the sauce."
        },
        {
          "headline":"Add the sour cream, mashed potatoes, and cheese on top.",
          "description":"First, stir in ⁄2 cup (120 ml) of sour cream. Next, layer 3 ½ cups (1200 g) of mashed potatoes on top of the meat mixture. Spread them out evenly using a wooden spoon. Sprinkle 1 cup (125 g) of shredded cheddar cheese on top. Buy pre-shredded cheese for a fast and easy option. You can also shred the cheese yourself. You will need 4 ounces (110 g) of cheese to make 1 cup of shredded cheese. Be careful that the mixture does not boil. You may have to reduce the heat slightly."
        },
        {
          "headline":"Cover the skillet and cook the mixture for 3-5 minutes until the cheese melts.",
          "description":"After about 3-5 minutes, when the cheese is completely melted, take the skillet off of the heat. Let it cool for 5-10 minutes. Cut the skillet Shepherd's Pie with a sharp knife and use a spatula to serve. For extra-crispy cheese, preheat your oven to 350 °F (177 °C). Place the skillet on the top rack and set the oven to broil for 2 minutes."
        }
      ]
    },
    {
      "name":"Baking a Vegan Alternative",
      "steps":[
        {
          "headline":"Boil the potatoes in a large pot for 20-30 minutes.",
          "description":"Fill a large pot with water and add 3 pounds (1.4 kg) of yukon gold potatoes. Bring them to a boil on medium-high heat. Cover the pot and cook for 20-30 minutes until they are tender. Be sure the water completely covers the potatoes."
        },
        {
          "headline":"Drain the potatoes and mash them with 4 tbsp (57 g) of vegan butter.",
          "description":"Pour the potatoes out into a colander in the kitchen sink. Return them to the pot and add the butter. Use a potato masher to mash them. Season the potatoes with salt and pepper to your liking. Cover the pot and set it aside. Using a hand mixer instead of a potato masher will make smoother mashed potatoes. You can also use vegetable oil instead of vegan butter."
        },
        {
          "headline":"Saute the onions and garlic in olive oil over medium heat.",
          "description":"Chop 1 medium onion and mince 2 garlic cloves. Add 1 tablespoon (15 ml) of olive oil to a skillet over medium heat. Then, add the onions and garlic. Cook for about 5 minutes until they are golden brown."
        },
        {
          "headline":"Add the lentils, stock, and thyme to the skillet and simmer for 35-40 minutes.",
          "description":"Pour 1 ½ cups (250 g) of uncooked lentils, 4 cups (950 ml) of vegetable stock, and 2 tsp (2 g) of fresh thyme. Use a wooden spoon to stir the mixture until it is well-combined. Cook until the lentils are tender."
        },
        {
          "headline":"Add the frozen vegetables during the last 10 minutes of cooking.",
          "description":"Pour 1 10-ounce (280 g) bag frozen mixed veggies into the pan. Stir the mixture together, then cover the skillet and let it continue cooking for the last 10 minutes."
        },
        {
          "headline":"Pour the mixture into a casserole dish and top with mashed potatoes.",
          "description":"Cover the bottom of the dish with the lentil mixture. Layer the mashed potatoes on top, smoothing them down with a wooden spoon if necessary."
        },
        {
          "headline":"Bake at 425 °F (218 °C) for 10-15 minutes.",
          "description":"Place the dish in the oven. Bake until the potatoes are golden brown."
        },
        {
          "headline":"Let the dish cool for 5-10 minutes before serving.",
          "description":"It will thicken more as it cools. Serve the pie by cutting it with a sharp knife and scooping out pieces with a spatula."
        }
      ]
    }
  ],
  "text":" Making a Traditional Shepherd's Pie Add water and chopped potatoes into a large stock pot. Fill the pot with water. Then, peel and chop 5 pounds (2.3 kg) of potatoes into 1–2 in (2.5–5.1 cm) slices with a sharp kitchen knife. Add the potatoes to the pot. Be sure that the potatoes are completely submerged in the water when you add them. Add some more water to the pot if needed. Cover the pot and cook the potatoes for 20-25 minutes. Place the lid on the pot and bring the water to boil over high heat. Then, reduce the heat to medium and continue cooking for about 20-25 minutes until the potatoes are tender. Use a fork to pierce a potato to check if it is tender. Drain the potatoes and mash them with ½ cup (115 g) of butter. Pour the water out of the pot in the sink, using a colander to catch the potatoes. Return the potatoes to the pot and add the butter. Mash them with a potato masher until they are as smooth as you like them. For extra smooth potatoes, you can also use a hand mixer. Stir in the sour cream, milk, salt, pepper, seasoning salt, garlic powder, and onion powder. Add ⁄2 cup (120 ml) of sour cream, ⁄3 cup (79 ml) of milk, 1 tsp (5 g) of salt, ½ tsp (1 g) of pepper, ½ tsp (2 g) of seasoning salt, ¼ tsp (1 g) of garlic powder, and ¼ tsp (1 g) of onion powder to the mashed potatoes. Stir with a wooden spoon or a whisk until the spices are evenly distributed. Cover the pot and set it aside. For extra flavor, mince two cloves of fresh garlic and add to the mixture. Chop 1 medium onion and 5 medium carrots. Use a sharp kitchen knife to peel and chop the onion into small square pieces. Then, peel the carrots. Chop off the root ends and slice them into medallions, about ⁄2 in (1.3 cm) thick. If you are in a hurry, skip peeling the carrots and simply rinse them with cold water before chopping them. Saute the onions and carrots in ¼ cup (58 g) of melted butter for 8 minutes. Set a large skillet on the stove over medium heat. Cook the butter for about 1-2 minutes until it is completely melted. Then, add the chopped onions and carrots. Check that the carrots are tender by piercing one piece with a fork. The carrots should be tender, but not mushy. The fork should go into a carrot slice easily without making it fall apart. Add 1 ⁄2 lb (0.68 kg) of ground beef to the skillet and saute for 5-6 minutes. Use a wooden spoon to gently mix the meat in with the other ingredients. Cook the meat until it is no longer pink. Then, drain the fat out of the skillet. Add the beef broth, cornstarch, frozen peas, and Worcestershire sauce. In a small bowl, mix together 1 ⁄2 cups (350 ml) of beef broth and 1 tablespoon (10 g) of cornstarch. Pour the mixture into the skillet. Then, add 1 ½ cups (225 g) of frozen peas and 1 ⁄2 teaspoons (7.4 ml) of Worcestershire sauce to the skillet. Cook the mixture on high heat for 5 minutes. Wait until the mixture boils and the sauces has thickened. Cook it until it reduces to the consistency you like. Remember it will get a little thicker after you bake it in the oven, too. Pour the mixture into a casserole dish and top with potatoes and cheese. Pour it carefully and spread it out with a wooden spoon or spatula so it covers the bottom of the casserole dish. Layer the mashed potatoes on top of the meat mixture. Use the spatula to spread them evenly as well. Finally, sprinkle 1 cup (125 g) of shredded cheddar cheese on top. If you don't have pre-shredded cheese, you can easily shred 4 ounces (110 g) of solid cheddar to make 1 cup of shredded cheese. Bake at 350 °F (177 °C) for 30 minutes. Check on the dish periodically. Keep it in the oven for at least 30 minutes until it starts to bubble. If you are in a hurry, you can bake it for 20 minutes at 375 °F (191 °C). Broil the dish for 2 minutes for extra crunchy cheese. If you like to have your cheese extra crunchy and brown, transfer the dish to the top rack after it's done cooking. Set your oven to broil for 2 extra minutes. Be sure to keep an eye on the dish while it's broiling to make sure it doesn't burn. Let the dish cool for 5-10 minutes before serving. Use hot pads to bring the Shepherd's Pie out of the oven. After it cools, use a knife and spatula to cut and serve it. Using a Skillet Make 3-1/2 cups (1200 g) of mashed potatoes and set them aside. To do this, peel and chop 5 pounds (2.3 kg) of potatoes into 1–2 inches (2.5–5.1 cm) slices. Add them to a large pot filled with water, put a lid on the pot, and bring the water to boil. Turn the heat to medium and cook the potatoes for 20-25 minutes. Drain the potatoes and mash them with ½ cup (115 g) of butter, then mash them with a potato masher. Prepare the mashed potatoes however you like them. You can make traditional mashed potatoes with butter, or make them with roasted garlic. Cook the beef and onions over medium heat for 5-6 minutes. Chop 1 cup (150 g) of onions. Add them to the skillet along with 1 pound (0.45 kg) of ground beef. Cook on medium heat until the meat is no longer pink. Stir in the corn, peas, ketchup, Worcestershire sauce, and garlic. Add 2 cups (300 g) of frozen corn, 2 cups (300 g) of frozen peas, 2 tablespoons (30 ml) of ketchup, 1 tablespoon (15 ml) of Worcestershire sauce, and 2 cloves of minced garlic to the skillet. Stir the mixture with a wooden spoon until they are well combined. Substitute 2 tablespoons (30 ml) of tomato paste for a more hearty flavor. Cover and cook the ingredients for 5 minutes on medium-low heat. Turn the heat down to medium-low. Put a lid on the skillet and allow the ingredients to cook inside for 5 minutes. Add the cornstarch, bouillon, and water and bring the mixture to a boil. Mix together 1 tablespoon (10 g) of cornstarch, 1 beef bouillon cube, and ⁄2 cup (120 ml) of cold water in a small bowl. Then, add this mixture to the skillet. Increase the heat to high. Heat it for 2-3 minutes until it begins to boil. Reduce the heat to medium and stir for 2 minutes. Use a wooden spoon to gently stir the ingredients. Continue stirring for about 2 minutes to thicken the sauce. Add the sour cream, mashed potatoes, and cheese on top. First, stir in ⁄2 cup (120 ml) of sour cream. Next, layer 3 ½ cups (1200 g) of mashed potatoes on top of the meat mixture. Spread them out evenly using a wooden spoon. Sprinkle 1 cup (125 g) of shredded cheddar cheese on top. Buy pre-shredded cheese for a fast and easy option. You can also shred the cheese yourself. You will need 4 ounces (110 g) of cheese to make 1 cup of shredded cheese. Be careful that the mixture does not boil. You may have to reduce the heat slightly. Cover the skillet and cook the mixture for 3-5 minutes until the cheese melts. After about 3-5 minutes, when the cheese is completely melted, take the skillet off of the heat. Let it cool for 5-10 minutes. Cut the skillet Shepherd's Pie with a sharp knife and use a spatula to serve. For extra-crispy cheese, preheat your oven to 350 °F (177 °C). Place the skillet on the top rack and set the oven to broil for 2 minutes. Baking a Vegan Alternative Boil the potatoes in a large pot for 20-30 minutes. Fill a large pot with water and add 3 pounds (1.4 kg) of yukon gold potatoes. Bring them to a boil on medium-high heat. Cover the pot and cook for 20-30 minutes until they are tender. Be sure the water completely covers the potatoes. Drain the potatoes and mash them with 4 tbsp (57 g) of vegan butter. Pour the potatoes out into a colander in the kitchen sink. Return them to the pot and add the butter. Use a potato masher to mash them. Season the potatoes with salt and pepper to your liking. Cover the pot and set it aside. Using a hand mixer instead of a potato masher will make smoother mashed potatoes. You can also use vegetable oil instead of vegan butter. Saute the onions and garlic in olive oil over medium heat. Chop 1 medium onion and mince 2 garlic cloves. Add 1 tablespoon (15 ml) of olive oil to a skillet over medium heat. Then, add the onions and garlic. Cook for about 5 minutes until they are golden brown. Add the lentils, stock, and thyme to the skillet and simmer for 35-40 minutes. Pour 1 ½ cups (250 g) of uncooked lentils, 4 cups (950 ml) of vegetable stock, and 2 tsp (2 g) of fresh thyme. Use a wooden spoon to stir the mixture until it is well-combined. Cook until the lentils are tender. Add the frozen vegetables during the last 10 minutes of cooking. Pour 1 10-ounce (280 g) bag frozen mixed veggies into the pan. Stir the mixture together, then cover the skillet and let it continue cooking for the last 10 minutes. Pour the mixture into a casserole dish and top with mashed potatoes. Cover the bottom of the dish with the lentil mixture. Layer the mashed potatoes on top, smoothing them down with a wooden spoon if necessary. Bake at 425 °F (218 °C) for 10-15 minutes. Place the dish in the oven. Bake until the potatoes are golden brown. Let the dish cool for 5-10 minutes before serving. It will thicken more as it cools. Serve the pie by cutting it with a sharp knife and scooping out pieces with a spatula.",
  "sentences":[
    " Making a Traditional Shepherd's Pie Add water and chopped potatoes into a large stock pot.",
    "Fill the pot with water.",
    "Then, peel and chop 5 pounds (2.3 kg) of potatoes into 1–2 in (2.5–5.1 cm) slices with a sharp kitchen knife.",
    "Add the potatoes to the pot.",
    "Be sure that the potatoes are completely submerged in the water when you add them.",
    "Add some more water to the pot if needed.",
    "Cover the pot and cook the potatoes for 20-25 minutes.",
    "Place the lid on the pot and bring the water to boil over high heat.",
    "Then, reduce the heat to medium and continue cooking for about 20-25 minutes until the potatoes are tender.",
    "Use a fork to pierce a potato to check if it is tender.",
    "Drain the potatoes and mash them with ½ cup (115 g) of butter.",
    "Pour the water out of the pot in the sink, using a colander to catch the potatoes.",
    "Return the potatoes to the pot and add the butter.",
    "Mash them with a potato masher until they are as smooth as you like them.",
    "For extra smooth potatoes, you can also use a hand mixer.",
    "Stir in the sour cream, milk, salt, pepper, seasoning salt, garlic powder, and onion powder.",
    "Add ⁄2 cup (120 ml) of sour cream, ⁄3 cup (79 ml) of milk, 1 tsp (5 g) of salt, ½ tsp (1 g) of pepper, ½ tsp (2 g) of seasoning salt, ¼ tsp (1 g) of garlic powder, and ¼ tsp (1 g) of onion powder to the mashed potatoes.",
    "Stir with a wooden spoon or a whisk until the spices are evenly distributed.",
    "Cover the pot and set it aside.",
    "For extra flavor, mince two cloves of fresh garlic and add to the mixture.",
    "Chop 1 medium onion and 5 medium carrots.",
    "Use a sharp kitchen knife to peel and chop the onion into small square pieces.",
    "Then, peel the carrots.",
    "Chop off the root ends and slice them into medallions, about ⁄2 in (1.3 cm) thick.",
    "If you are in a hurry, skip peeling the carrots and simply rinse them with cold water before chopping them.",
    "Saute the onions and carrots in ¼ cup (58 g) of melted butter for 8 minutes.",
    "Set a large skillet on the stove over medium heat.",
    "Cook the butter for about 1-2 minutes until it is completely melted.",
    "Then, add the chopped onions and carrots.",
    "Check that the carrots are tender by piercing one piece with a fork.",
    "The carrots should be tender, but not mushy.",
    "The fork should go into a carrot slice easily without making it fall apart.",
    "Add 1 ⁄2 lb (0.68 kg) of ground beef to the skillet and saute for 5-6 minutes.",
    "Use a wooden spoon to gently mix the meat in with the other ingredients.",
    "Cook the meat until it is no longer pink.",
    "Then, drain the fat out of the skillet.",
    "Add the beef broth, cornstarch, frozen peas, and Worcestershire sauce.",
    "In a small bowl, mix together 1 ⁄2 cups (350 ml) of beef broth and 1 tablespoon (10 g) of cornstarch.",
    "Pour the mixture into the skillet.",
    "Then, add 1 ½ cups (225 g) of frozen peas and 1 ⁄2 teaspoons (7.4 ml) of Worcestershire sauce to the skillet.",
    "Cook the mixture on high heat for 5 minutes.",
    "Wait until the mixture boils and the sauces has thickened.",
    "Cook it until it reduces to the consistency you like.",
    "Remember it will get a little thicker after you bake it in the oven, too.",
    "Pour the mixture into a casserole dish and top with potatoes and cheese.",
    "Pour it carefully and spread it out with a wooden spoon or spatula so it covers the bottom of the casserole dish.",
    "Layer the mashed potatoes on top of the meat mixture.",
    "Use the spatula to spread them evenly as well.",
    "Finally, sprinkle 1 cup (125 g) of shredded cheddar cheese on top.",
    "If you don't have pre-shredded cheese, you can easily shred 4 ounces (110 g) of solid cheddar to make 1 cup of shredded cheese.",
    "Bake at 350 °F (177 °C) for 30 minutes.",
    "Check on the dish periodically.",
    "Keep it in the oven for at least 30 minutes until it starts to bubble.",
    "If you are in a hurry, you can bake it for 20 minutes at 375 °F (191 °C).",
    "Broil the dish for 2 minutes for extra crunchy cheese.",
    "If you like to have your cheese extra crunchy and brown, transfer the dish to the top rack after it's done cooking.",
    "Set your oven to broil for 2 extra minutes.",
    "Be sure to keep an eye on the dish while it's broiling to make sure it doesn't burn.",
    "Let the dish cool for 5-10 minutes before serving.",
    "Use hot pads to bring the Shepherd's Pie out of the oven.",
    "After it cools, use a knife and spatula to cut and serve it.",
    "Using a Skillet Make 3-1/2 cups (1200 g) of mashed potatoes and set them aside.",
    "To do this, peel and chop 5 pounds (2.3 kg) of potatoes into 1–2 inches (2.5–5.1 cm) slices.",
    "Add them to a large pot filled with water, put a lid on the pot, and bring the water to boil.",
    "Turn the heat to medium and cook the potatoes for 20-25 minutes.",
    "Drain the potatoes and mash them with ½ cup (115 g) of butter, then mash them with a potato masher.",
    "Prepare the mashed potatoes however you like them.",
    "You can make traditional mashed potatoes with butter, or make them with roasted garlic.",
    "Cook the beef and onions over medium heat for 5-6 minutes.",
    "Chop 1 cup (150 g) of onions.",
    "Add them to the skillet along with 1 pound (0.45 kg) of ground beef.",
    "Cook on medium heat until the meat is no longer pink.",
    "Stir in the corn, peas, ketchup, Worcestershire sauce, and garlic.",
    "Add 2 cups (300 g) of frozen corn, 2 cups (300 g) of frozen peas, 2 tablespoons (30 ml) of ketchup, 1 tablespoon (15 ml) of Worcestershire sauce, and 2 cloves of minced garlic to the skillet.",
    "Stir the mixture with a wooden spoon until they are well combined.",
    "Substitute 2 tablespoons (30 ml) of tomato paste for a more hearty flavor.",
    "Cover and cook the ingredients for 5 minutes on medium-low heat.",
    "Turn the heat down to medium-low.",
    "Put a lid on the skillet and allow the ingredients to cook inside for 5 minutes.",
    "Add the cornstarch, bouillon, and water and bring the mixture to a boil.",
    "Mix together 1 tablespoon (10 g) of cornstarch, 1 beef bouillon cube, and ⁄2 cup (120 ml) of cold water in a small bowl.",
    "Then, add this mixture to the skillet.",
    "Increase the heat to high.",
    "Heat it for 2-3 minutes until it begins to boil.",
    "Reduce the heat to medium and stir for 2 minutes.",
    "Use a wooden spoon to gently stir the ingredients.",
    "Continue stirring for about 2 minutes to thicken the sauce.",
    "Add the sour cream, mashed potatoes, and cheese on top.",
    "First, stir in ⁄2 cup (120 ml) of sour cream.",
    "Next, layer 3 ½ cups (1200 g) of mashed potatoes on top of the meat mixture.",
    "Spread them out evenly using a wooden spoon.",
    "Sprinkle 1 cup (125 g) of shredded cheddar cheese on top.",
    "Buy pre-shredded cheese for a fast and easy option.",
    "You can also shred the cheese yourself.",
    "You will need 4 ounces (110 g) of cheese to make 1 cup of shredded cheese.",
    "Be careful that the mixture does not boil.",
    "You may have to reduce the heat slightly.",
    "Cover the skillet and cook the mixture for 3-5 minutes until the cheese melts.",
    "After about 3-5 minutes, when the cheese is completely melted, take the skillet off of the heat.",
    "Let it cool for 5-10 minutes.",
    "Cut the skillet Shepherd's Pie with a sharp knife and use a spatula to serve.",
    "For extra-crispy cheese, preheat your oven to 350 °F (177 °C).",
    "Place the skillet on the top rack and set the oven to broil for 2 minutes.",
    "Baking a Vegan Alternative Boil the potatoes in a large pot for 20-30 minutes.",
    "Fill a large pot with water and add 3 pounds (1.4 kg) of yukon gold potatoes.",
    "Bring them to a boil on medium-high heat.",
    "Cover the pot and cook for 20-30 minutes until they are tender.",
    "Be sure the water completely covers the potatoes.",
    "Drain the potatoes and mash them with 4 tbsp (57 g) of vegan butter.",
    "Pour the potatoes out into a colander in the kitchen sink.",
    "Return them to the pot and add the butter.",
    "Use a potato masher to mash them.",
    "Season the potatoes with salt and pepper to your liking.",
    "Cover the pot and set it aside.",
    "Using a hand mixer instead of a potato masher will make smoother mashed potatoes.",
    "You can also use vegetable oil instead of vegan butter.",
    "Saute the onions and garlic in olive oil over medium heat.",
    "Chop 1 medium onion and mince 2 garlic cloves.",
    "Add 1 tablespoon (15 ml) of olive oil to a skillet over medium heat.",
    "Then, add the onions and garlic.",
    "Cook for about 5 minutes until they are golden brown.",
    "Add the lentils, stock, and thyme to the skillet and simmer for 35-40 minutes.",
    "Pour 1 ½ cups (250 g) of uncooked lentils, 4 cups (950 ml) of vegetable stock, and 2 tsp (2 g) of fresh thyme.",
    "Use a wooden spoon to stir the mixture until it is well-combined.",
    "Cook until the lentils are tender.",
    "Add the frozen vegetables during the last 10 minutes of cooking.",
    "Pour 1 10-ounce (280 g) bag frozen mixed veggies into the pan.",
    "Stir the mixture together, then cover the skillet and let it continue cooking for the last 10 minutes.",
    "Pour the mixture into a casserole dish and top with mashed potatoes.",
    "Cover the bottom of the dish with the lentil mixture.",
    "Layer the mashed potatoes on top, smoothing them down with a wooden spoon if necessary.",
    "Bake at 425 °F (218 °C) for 10-15 minutes.",
    "Place the dish in the oven.",
    "Bake until the potatoes are golden brown.",
    "Let the dish cool for 5-10 minutes before serving.",
    "It will thicken more as it cools.",
    "Serve the pie by cutting it with a sharp knife and scooping out pieces with a spatula."
  ],
  "tyn_section":[
    "Sharp kitchen knife",
    "Large stock pot",
    "Potato masher or hand mixer",
    "Wooden spoon",
    "Whisk",
    "Vegetable peeler",
    "Skillet",
    "Grater (optional)",
    "Large skillet with a lid",
    "Creating a Vegan Alternative"
  ],
  "tyn_model":[
    "potatoes",
    "skillet",
    "water",
    "pot",
    "wooden spoon",
    "butter",
    "carrots",
    "oven",
    "onions",
    "spatula",
    "potato masher",
    "sour cream",
    "cornstarch",
    "worcestershire sauce",
    "mashed potatoes",
    "garlic",
    "fork",
    "onion",
    "frozen peas",
    "cheese",
    "large pot",
    "lentils",
    "kitchen knife",
    "colander",
    "hand mixer",
    "milk",
    "salt",
    "pepper",
    "seasoning salt",
    "garlic powder",
    "onion powder",
    "ground beef",
    "beef broth",
    "small bowl",
    "casserole dish",
    "shredded cheddar cheese",
    "shredded cheese",
    "ketchup",
    "sharp knife",
    "vegan butter",
    "olive oil",
    "large stock pot",
    "whisk",
    "fresh garlic",
    "large skillet",
    "carrot",
    "meat",
    "cheddar",
    "dish",
    "shepherd's pie",
    "knife",
    "roasted garlic",
    "beef",
    "corn",
    "peas",
    "frozen corn",
    "minced garlic",
    "tomato paste",
    "cold water",
    "salt and pepper",
    "vegetable oil",
    "stock",
    "thyme",
    "vegetable stock",
    "fresh thyme",
    "frozen vegetables",
    "frozen mixed veggies",
    "lentil"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.0588235294,
    "f1":0.1025641026,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1176470588,
    "f1":0.1904761905
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.2205882353,
    "f1":0.3458213256
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1029411765,
    "f1":0.1707317073
  }
}