{
  "title":"How to Make Pudding",
  "url":"https://www.wikihow.com/Make-Pudding",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Puddings"
  ],
  "methods":[
    {
      "name":"Making American Pudding",
      "steps":[
        {
          "headline":"Use this method to make a cold American pudding.",
          "description":"Pudding is still consumed in many varieties across the Commonwealth, but people in the United States have simplified the term to mean a cold, custard-like dessert. This recipe is streamlined to be as simple as possible without sacrificing deliciousness, but there are dozens of alternate methods out there if you decide to explore variations in texture or flavor. This recipe can be made with or without melted chocolate. If you decide to skip the chocolate you may wish to up the vanilla extract to 2 tsp (10 mL) for a stronger flavor. This pudding will take at least an hour to chill and thicken. Allowing at least four hours is recommended if you plan on serving it as dessert, as individual variation can cause some puddings to take longer."
        },
        {
          "headline":"Decide whether to use cornstarch or egg yolks.",
          "description":"You only need one of these ingredients to thicken the pudding. Cornstarch is easy to use, and a great option for beginner or time-pressed chefs. Egg yolks are finicky and can ruin a pudding if overcooked, but will provide a richer texture. Both methods are described in this section."
        },
        {
          "headline":"Mix together sugar, salt, and cornstarch.",
          "description":"Use a saucepan, but leave it off the heat for now. Combine ½ cup (100 g) sugar and ⅛ tsp (a small pinch) salt. If you are using cornstarch, mix in ¼ cup (30 g) of this as well. Use a whisk if you have one, since it will be useful in the next step. While cornstarch is sold as \"cornflour\" outside the U.S., do not confuse it with actual flour made from corn! You're looking for pure starch, an almost tasteless, white powder."
        },
        {
          "headline":"Slowly whisk in the milk.",
          "description":"Pour in about ¼ cup (60 mL) of the milk in a thin stream to avoid forming lumps, whisking it in with the dry ingredients. Once the mixture has no lumps, pour in the remaining 2 ¾ cups (660 mL) milk and whisk until smooth. If you have a food processor, you can pulse this mixture until smooth instead."
        },
        {
          "headline":"Beat the egg yolks in a separate bowl.",
          "description":"If you are using two egg yolks, separate them from the egg whites, then beat for 30–60 seconds in a separate, large bowl. Remember, there is no need for egg yolks if using cornstarch."
        },
        {
          "headline":"Heat slowly until simmering, then add chocolate.",
          "description":"Heat the mixture over medium-low heat on the stove top. Stir and scrape the sides occasionally, to avoid forming a skin or burning the milk. After approximately ten minutes, the mixture should be thick enough to coat the back of your stirring spoon. If you want to add 6 ounces (170 g) chocolate, do so and continue to heat and stir until smooth. Otherwise, just continue to the next step."
        },
        {
          "headline":"Continue to heat, depending on the recipe.",
          "description":"This step varies depending on which thickener you are using:\n\nIf using cornstarch, continue to heat and stir until boiling. Reduce heat and simmer for two or three minutes or until slightly thickened, then remove from heat. If using egg yolk, remove the milk from heat once thickened, then add it in a very thin stream to the egg mixture, whisking constantly. If you add too much of the hot mixture, or stop stirring, the egg will cook — and no one wants scrambled eggs in their dessert. Once all the ingredients are combined, return them to the saucepan and heat until thick, but do not allow to boil."
        },
        {
          "headline":"Remove from heat and stir in vanilla.",
          "description":"1 tsp (5 mL) vanilla extract will add a nice flavor, whether or not you are using chocolate. Stir it in well, as the stirring will also prevent skin from forming while the mixture is still hot."
        },
        {
          "headline":"Chill until ready to eat.",
          "description":"Spoon the pudding into a large bowl or individual custard ramekins, or simply leave it in the saucepan. Refrigerate for one to three hours before eating, or until thick. Keep it in the refrigerator until ready to eat. Optionally, stretch plastic wrap over the surface to prevent a skin from forming."
        }
      ]
    },
    {
      "name":"Making British Summer Pudding",
      "steps":[
        {
          "headline":"Use this method to make a simple, fruit dessert.",
          "description":"The British Isles are the world capitol of pudding recipes, and hundreds of these have become popular dishes across former British territories. While the section on other pudding recipes contains links to many of these, this method covers a classic, easy to make dessert: the summer pudding. This pudding is best when chilled for at least four to six hours, although it can be eaten earlier."
        },
        {
          "headline":"Cut the bread slices into certain shapes.",
          "description":"This bread will be used to create a dome shape for the pudding. Cut the slices into \"wonky rectangles\" with one end wider than the other to make this easier. A few triangular pieces the same length as the rectangles will also be useful. You may also cut a large circle of bread out to serve as the base of the domed pudding, but you can use spare wedges instead."
        },
        {
          "headline":"Toast fresh bread to dry it out.",
          "description":"You'll want slightly stale white bread for this recipe, as this will soak up the fruit juice faster. If you're cursed by a breadbox full of freshly baked loaves, toast the slices in a 350ºF (175ºC) oven for 15–20 minutes or until dry and slightly brown."
        },
        {
          "headline":"Prepare berries, then heat sugar and water.",
          "description":"Wash and dry the berries, and defrost frozen berries before using. Once the berries are ready, add ¾ cup (175g) golden caster sugar and 3 tbsp (45 mL) water to a saucepan. Heat over low heat, stirring occasionally, until the sugar is melted and boils for approximately 60 seconds. Golden caster sugar is ideal for this recipe, but is not widely available outside the UK and some Commonwealth countries. Superfine sugar is the best substitute."
        },
        {
          "headline":"Add the berries.",
          "description":"Add the 2 lb 12 oz (1¼ kg) berries to the saucepan. Heating them will bring out the juices that will soak into the bread. You only need to cook this for another two or three minutes, stirring occasionally. Remove from heat. If using strawberries, you can optionally keep these at room temperature and add later to preserve their firm texture. Remove stems from currants before using."
        },
        {
          "headline":"Stir in the liqueur (optional).",
          "description":"Blackcurrant liqueur adds a rich flavor, if you don't mind making your pudding alcoholic. Stir in ¼ cup (60 mL) for a strong flavor, or less if you prefer just a hint."
        },
        {
          "headline":"Dip the bread in juice and place in a large, plastic-lined bowl.",
          "description":"Line a large, 1.75 quarts (1.75 liters) bowl with strong plastic wrap to make it easy to flip the pudding right-side-up later. Dip each slice of bread into the juice mixture for a few seconds, arranging them around the bowl. Alternate the rectangular and triangular slices as needed to make a relatively tight-fitting \"bowl\" of bread, with no gaps. Cut slices into new shapes if necessary to fill gaps."
        },
        {
          "headline":"Pour in fruit and top with bread.",
          "description":"Spoon in all the remaining juice and fruit into the bread bowl. Finish by topping with a circle of bread or a layer of bread slices, soaking them first as before."
        },
        {
          "headline":"Chill and flip before serving.",
          "description":"The flavors will mingle best if allowed to chill for several hours, or even overnight. Keep it in the refrigerator with a plate on top of the pudding, weighing down the plate with any heavy object. Before serving, flip the pudding over carefully onto a plate, grasping the cling wrap to keep it together. Remove the plastic, trim off any unsightly bread overhang, and serve plain or with cream."
        }
      ]
    },
    {
      "name":"Exploring Other Pudding Recipes",
      "steps":[
        {
          "headline":"Choose a baked pudding if you want a pudding that is quick and filling.",
          "description":"Usually, this style of pudding must be served as soon as it has been baked, unless the recipe states otherwise. Many of the self-saucing puddings fall into the baked pudding category; these are puddings that form a sweet sauce over the \"top\" when turned out of the pudding basin. The lemon delicious pudding is the self-saucing citrus pudding par excellence. Chocolate bread pudding and other bread puddings are easy to make, and can be served hot or cold. American variations include New England's Indian pudding, and the Thanksgiving baked pumpkin pudding dish. There are many variations on fruit puddings. These apple recipes can be adapted to use pears or other fruits instead: apple pudding, apple raisin bread pudding, apple crunch pudding and apple and almond pudding."
        },
        {
          "headline":"Choose a steamed pudding if you want a moist and rich pudding.",
          "description":"Steamed puddings require a bit more effort than most puddings but this also ensures that they are durable (long-lasting) puddings, making them suitable for Christmas pudding styles. Dried-fruit based puddings are most often steamed but fruit or vegetable based puddings can be steamed too. Other famous steamed puddings include ginger pudding, chocolate puddings, date pudding and college pudding. If you're not familiar with Christmas pudding, have a go at this sweet dried fruit creation. Douse the result in brandy butter before eating. Sticky fig pudding, sticky date pudding and sticky date pudding are delicious and well-loved fruit puddings"
        },
        {
          "headline":"Choose a cold pudding for a summertime treat.",
          "description":"Such puddings can be served for afternoon tea or as a dessert following main course. Many milk- and cream-based pudding recipes are cold. In general, cold puddings tend to benefit from being a mold and need to be made well ahead of serving time. Besides the summer pudding recipe included on this page, cold puddings include mousse, custard, rice pudding, or the old-fashioned syllabub. Custard and other cold puddings can be used to make a trifle, or British layered dessert."
        },
        {
          "headline":"Make an American chocolate pudding.",
          "description":"In the United States, the word \"pudding\" is usually reserved for cold, custard-like dishes. A full recipe is included on this page, but there are a couple variations to try as well:\nTry this easier recipe that holds together with cream cheese instead of whisking. Vegan chocolate pudding can be made without recourse to dairy or egg products."
        },
        {
          "headline":"Create a savory pudding.",
          "description":"Introduce pudding as an entrée as well as dessert. Savory puddings range from variations on steamed desserts, such as the Savory vegetable pudding, to unique creations like the Yorkshire pudding, made from batter and meat drippings."
        }
      ]
    }
  ],
  "text":" Making American Pudding Use this method to make a cold American pudding. Pudding is still consumed in many varieties across the Commonwealth, but people in the United States have simplified the term to mean a cold, custard-like dessert. This recipe is streamlined to be as simple as possible without sacrificing deliciousness, but there are dozens of alternate methods out there if you decide to explore variations in texture or flavor. This recipe can be made with or without melted chocolate. If you decide to skip the chocolate you may wish to up the vanilla extract to 2 tsp (10 mL) for a stronger flavor. This pudding will take at least an hour to chill and thicken. Allowing at least four hours is recommended if you plan on serving it as dessert, as individual variation can cause some puddings to take longer. Decide whether to use cornstarch or egg yolks. You only need one of these ingredients to thicken the pudding. Cornstarch is easy to use, and a great option for beginner or time-pressed chefs. Egg yolks are finicky and can ruin a pudding if overcooked, but will provide a richer texture. Both methods are described in this section. Mix together sugar, salt, and cornstarch. Use a saucepan, but leave it off the heat for now. Combine ½ cup (100 g) sugar and ⅛ tsp (a small pinch) salt. If you are using cornstarch, mix in ¼ cup (30 g) of this as well. Use a whisk if you have one, since it will be useful in the next step. While cornstarch is sold as \"cornflour\" outside the U.S., do not confuse it with actual flour made from corn! You're looking for pure starch, an almost tasteless, white powder. Slowly whisk in the milk. Pour in about ¼ cup (60 mL) of the milk in a thin stream to avoid forming lumps, whisking it in with the dry ingredients. Once the mixture has no lumps, pour in the remaining 2 ¾ cups (660 mL) milk and whisk until smooth. If you have a food processor, you can pulse this mixture until smooth instead. Beat the egg yolks in a separate bowl. If you are using two egg yolks, separate them from the egg whites, then beat for 30–60 seconds in a separate, large bowl. Remember, there is no need for egg yolks if using cornstarch. Heat slowly until simmering, then add chocolate. Heat the mixture over medium-low heat on the stove top. Stir and scrape the sides occasionally, to avoid forming a skin or burning the milk. After approximately ten minutes, the mixture should be thick enough to coat the back of your stirring spoon. If you want to add 6 ounces (170 g) chocolate, do so and continue to heat and stir until smooth. Otherwise, just continue to the next step. Continue to heat, depending on the recipe. This step varies depending on which thickener you are using:\n\nIf using cornstarch, continue to heat and stir until boiling. Reduce heat and simmer for two or three minutes or until slightly thickened, then remove from heat. If using egg yolk, remove the milk from heat once thickened, then add it in a very thin stream to the egg mixture, whisking constantly. If you add too much of the hot mixture, or stop stirring, the egg will cook — and no one wants scrambled eggs in their dessert. Once all the ingredients are combined, return them to the saucepan and heat until thick, but do not allow to boil. Remove from heat and stir in vanilla. 1 tsp (5 mL) vanilla extract will add a nice flavor, whether or not you are using chocolate. Stir it in well, as the stirring will also prevent skin from forming while the mixture is still hot. Chill until ready to eat. Spoon the pudding into a large bowl or individual custard ramekins, or simply leave it in the saucepan. Refrigerate for one to three hours before eating, or until thick. Keep it in the refrigerator until ready to eat. Optionally, stretch plastic wrap over the surface to prevent a skin from forming. Making British Summer Pudding Use this method to make a simple, fruit dessert. The British Isles are the world capitol of pudding recipes, and hundreds of these have become popular dishes across former British territories. While the section on other pudding recipes contains links to many of these, this method covers a classic, easy to make dessert: the summer pudding. This pudding is best when chilled for at least four to six hours, although it can be eaten earlier. Cut the bread slices into certain shapes. This bread will be used to create a dome shape for the pudding. Cut the slices into \"wonky rectangles\" with one end wider than the other to make this easier. A few triangular pieces the same length as the rectangles will also be useful. You may also cut a large circle of bread out to serve as the base of the domed pudding, but you can use spare wedges instead. Toast fresh bread to dry it out. You'll want slightly stale white bread for this recipe, as this will soak up the fruit juice faster. If you're cursed by a breadbox full of freshly baked loaves, toast the slices in a 350ºF (175ºC) oven for 15–20 minutes or until dry and slightly brown. Prepare berries, then heat sugar and water. Wash and dry the berries, and defrost frozen berries before using. Once the berries are ready, add ¾ cup (175g) golden caster sugar and 3 tbsp (45 mL) water to a saucepan. Heat over low heat, stirring occasionally, until the sugar is melted and boils for approximately 60 seconds. Golden caster sugar is ideal for this recipe, but is not widely available outside the UK and some Commonwealth countries. Superfine sugar is the best substitute. Add the berries. Add the 2 lb 12 oz (1¼ kg) berries to the saucepan. Heating them will bring out the juices that will soak into the bread. You only need to cook this for another two or three minutes, stirring occasionally. Remove from heat. If using strawberries, you can optionally keep these at room temperature and add later to preserve their firm texture. Remove stems from currants before using. Stir in the liqueur (optional). Blackcurrant liqueur adds a rich flavor, if you don't mind making your pudding alcoholic. Stir in ¼ cup (60 mL) for a strong flavor, or less if you prefer just a hint. Dip the bread in juice and place in a large, plastic-lined bowl. Line a large, 1.75 quarts (1.75 liters) bowl with strong plastic wrap to make it easy to flip the pudding right-side-up later. Dip each slice of bread into the juice mixture for a few seconds, arranging them around the bowl. Alternate the rectangular and triangular slices as needed to make a relatively tight-fitting \"bowl\" of bread, with no gaps. Cut slices into new shapes if necessary to fill gaps. Pour in fruit and top with bread. Spoon in all the remaining juice and fruit into the bread bowl. Finish by topping with a circle of bread or a layer of bread slices, soaking them first as before. Chill and flip before serving. The flavors will mingle best if allowed to chill for several hours, or even overnight. Keep it in the refrigerator with a plate on top of the pudding, weighing down the plate with any heavy object. Before serving, flip the pudding over carefully onto a plate, grasping the cling wrap to keep it together. Remove the plastic, trim off any unsightly bread overhang, and serve plain or with cream. Exploring Other Pudding Recipes Choose a baked pudding if you want a pudding that is quick and filling. Usually, this style of pudding must be served as soon as it has been baked, unless the recipe states otherwise. Many of the self-saucing puddings fall into the baked pudding category; these are puddings that form a sweet sauce over the \"top\" when turned out of the pudding basin. The lemon delicious pudding is the self-saucing citrus pudding par excellence. Chocolate bread pudding and other bread puddings are easy to make, and can be served hot or cold. American variations include New England's Indian pudding, and the Thanksgiving baked pumpkin pudding dish. There are many variations on fruit puddings. These apple recipes can be adapted to use pears or other fruits instead: apple pudding, apple raisin bread pudding, apple crunch pudding and apple and almond pudding. Choose a steamed pudding if you want a moist and rich pudding. Steamed puddings require a bit more effort than most puddings but this also ensures that they are durable (long-lasting) puddings, making them suitable for Christmas pudding styles. Dried-fruit based puddings are most often steamed but fruit or vegetable based puddings can be steamed too. Other famous steamed puddings include ginger pudding, chocolate puddings, date pudding and college pudding. If you're not familiar with Christmas pudding, have a go at this sweet dried fruit creation. Douse the result in brandy butter before eating. Sticky fig pudding, sticky date pudding and sticky date pudding are delicious and well-loved fruit puddings Choose a cold pudding for a summertime treat. Such puddings can be served for afternoon tea or as a dessert following main course. Many milk- and cream-based pudding recipes are cold. In general, cold puddings tend to benefit from being a mold and need to be made well ahead of serving time. Besides the summer pudding recipe included on this page, cold puddings include mousse, custard, rice pudding, or the old-fashioned syllabub. Custard and other cold puddings can be used to make a trifle, or British layered dessert. Make an American chocolate pudding. In the United States, the word \"pudding\" is usually reserved for cold, custard-like dishes. A full recipe is included on this page, but there are a couple variations to try as well:\nTry this easier recipe that holds together with cream cheese instead of whisking. Vegan chocolate pudding can be made without recourse to dairy or egg products. Create a savory pudding. Introduce pudding as an entrée as well as dessert. Savory puddings range from variations on steamed desserts, such as the Savory vegetable pudding, to unique creations like the Yorkshire pudding, made from batter and meat drippings.",
  "sentences":[
    " Making American Pudding Use this method to make a cold American pudding.",
    "Pudding is still consumed in many varieties across the Commonwealth, but people in the United States have simplified the term to mean a cold, custard-like dessert.",
    "This recipe is streamlined to be as simple as possible without sacrificing deliciousness, but there are dozens of alternate methods out there if you decide to explore variations in texture or flavor.",
    "This recipe can be made with or without melted chocolate.",
    "If you decide to skip the chocolate you may wish to up the vanilla extract to 2 tsp (10 mL) for a stronger flavor.",
    "This pudding will take at least an hour to chill and thicken.",
    "Allowing at least four hours is recommended if you plan on serving it as dessert, as individual variation can cause some puddings to take longer.",
    "Decide whether to use cornstarch or egg yolks.",
    "You only need one of these ingredients to thicken the pudding.",
    "Cornstarch is easy to use, and a great option for beginner or time-pressed chefs.",
    "Egg yolks are finicky and can ruin a pudding if overcooked, but will provide a richer texture.",
    "Both methods are described in this section.",
    "Mix together sugar, salt, and cornstarch.",
    "Use a saucepan, but leave it off the heat for now.",
    "Combine ½ cup (100 g) sugar and ⅛ tsp (a small pinch) salt.",
    "If you are using cornstarch, mix in ¼ cup (30 g) of this as well.",
    "Use a whisk if you have one, since it will be useful in the next step.",
    "While cornstarch is sold as \"cornflour\" outside the U.S., do not confuse it with actual flour made from corn!",
    "You're looking for pure starch, an almost tasteless, white powder.",
    "Slowly whisk in the milk.",
    "Pour in about ¼ cup (60 mL) of the milk in a thin stream to avoid forming lumps, whisking it in with the dry ingredients.",
    "Once the mixture has no lumps, pour in the remaining 2 ¾ cups (660 mL) milk and whisk until smooth.",
    "If you have a food processor, you can pulse this mixture until smooth instead.",
    "Beat the egg yolks in a separate bowl.",
    "If you are using two egg yolks, separate them from the egg whites, then beat for 30–60 seconds in a separate, large bowl.",
    "Remember, there is no need for egg yolks if using cornstarch.",
    "Heat slowly until simmering, then add chocolate.",
    "Heat the mixture over medium-low heat on the stove top.",
    "Stir and scrape the sides occasionally, to avoid forming a skin or burning the milk.",
    "After approximately ten minutes, the mixture should be thick enough to coat the back of your stirring spoon.",
    "If you want to add 6 ounces (170 g) chocolate, do so and continue to heat and stir until smooth.",
    "Otherwise, just continue to the next step.",
    "Continue to heat, depending on the recipe.",
    "This step varies depending on which thickener you are using:\n\nIf using cornstarch, continue to heat and stir until boiling.",
    "Reduce heat and simmer for two or three minutes or until slightly thickened, then remove from heat.",
    "If using egg yolk, remove the milk from heat once thickened, then add it in a very thin stream to the egg mixture, whisking constantly.",
    "If you add too much of the hot mixture, or stop stirring, the egg will cook — and no one wants scrambled eggs in their dessert.",
    "Once all the ingredients are combined, return them to the saucepan and heat until thick, but do not allow to boil.",
    "Remove from heat and stir in vanilla.",
    "1 tsp (5 mL) vanilla extract will add a nice flavor, whether or not you are using chocolate.",
    "Stir it in well, as the stirring will also prevent skin from forming while the mixture is still hot.",
    "Chill until ready to eat.",
    "Spoon the pudding into a large bowl or individual custard ramekins, or simply leave it in the saucepan.",
    "Refrigerate for one to three hours before eating, or until thick.",
    "Keep it in the refrigerator until ready to eat.",
    "Optionally, stretch plastic wrap over the surface to prevent a skin from forming.",
    "Making British Summer Pudding Use this method to make a simple, fruit dessert.",
    "The British Isles are the world capitol of pudding recipes, and hundreds of these have become popular dishes across former British territories.",
    "While the section on other pudding recipes contains links to many of these, this method covers a classic, easy to make dessert: the summer pudding.",
    "This pudding is best when chilled for at least four to six hours, although it can be eaten earlier.",
    "Cut the bread slices into certain shapes.",
    "This bread will be used to create a dome shape for the pudding.",
    "Cut the slices into \"wonky rectangles\" with one end wider than the other to make this easier.",
    "A few triangular pieces the same length as the rectangles will also be useful.",
    "You may also cut a large circle of bread out to serve as the base of the domed pudding, but you can use spare wedges instead.",
    "Toast fresh bread to dry it out.",
    "You'll want slightly stale white bread for this recipe, as this will soak up the fruit juice faster.",
    "If you're cursed by a breadbox full of freshly baked loaves, toast the slices in a 350ºF (175ºC) oven for 15–20 minutes or until dry and slightly brown.",
    "Prepare berries, then heat sugar and water.",
    "Wash and dry the berries, and defrost frozen berries before using.",
    "Once the berries are ready, add ¾ cup (175g) golden caster sugar and 3 tbsp (45 mL) water to a saucepan.",
    "Heat over low heat, stirring occasionally, until the sugar is melted and boils for approximately 60 seconds.",
    "Golden caster sugar is ideal for this recipe, but is not widely available outside the UK and some Commonwealth countries.",
    "Superfine sugar is the best substitute.",
    "Add the berries.",
    "Add the 2 lb 12 oz (1¼ kg) berries to the saucepan.",
    "Heating them will bring out the juices that will soak into the bread.",
    "You only need to cook this for another two or three minutes, stirring occasionally.",
    "Remove from heat.",
    "If using strawberries, you can optionally keep these at room temperature and add later to preserve their firm texture.",
    "Remove stems from currants before using.",
    "Stir in the liqueur (optional).",
    "Blackcurrant liqueur adds a rich flavor, if you don't mind making your pudding alcoholic.",
    "Stir in ¼ cup (60 mL) for a strong flavor, or less if you prefer just a hint.",
    "Dip the bread in juice and place in a large, plastic-lined bowl.",
    "Line a large, 1.75 quarts (1.75 liters) bowl with strong plastic wrap to make it easy to flip the pudding right-side-up later.",
    "Dip each slice of bread into the juice mixture for a few seconds, arranging them around the bowl.",
    "Alternate the rectangular and triangular slices as needed to make a relatively tight-fitting \"bowl\" of bread, with no gaps.",
    "Cut slices into new shapes if necessary to fill gaps.",
    "Pour in fruit and top with bread.",
    "Spoon in all the remaining juice and fruit into the bread bowl.",
    "Finish by topping with a circle of bread or a layer of bread slices, soaking them first as before.",
    "Chill and flip before serving.",
    "The flavors will mingle best if allowed to chill for several hours, or even overnight.",
    "Keep it in the refrigerator with a plate on top of the pudding, weighing down the plate with any heavy object.",
    "Before serving, flip the pudding over carefully onto a plate, grasping the cling wrap to keep it together.",
    "Remove the plastic, trim off any unsightly bread overhang, and serve plain or with cream.",
    "Exploring Other Pudding Recipes Choose a baked pudding if you want a pudding that is quick and filling.",
    "Usually, this style of pudding must be served as soon as it has been baked, unless the recipe states otherwise.",
    "Many of the self-saucing puddings fall into the baked pudding category; these are puddings that form a sweet sauce over the \"top\" when turned out of the pudding basin.",
    "The lemon delicious pudding is the self-saucing citrus pudding par excellence.",
    "Chocolate bread pudding and other bread puddings are easy to make, and can be served hot or cold.",
    "American variations include New England's Indian pudding, and the Thanksgiving baked pumpkin pudding dish.",
    "There are many variations on fruit puddings.",
    "These apple recipes can be adapted to use pears or other fruits instead: apple pudding, apple raisin bread pudding, apple crunch pudding and apple and almond pudding.",
    "Choose a steamed pudding if you want a moist and rich pudding.",
    "Steamed puddings require a bit more effort than most puddings but this also ensures that they are durable (long-lasting) puddings, making them suitable for Christmas pudding styles.",
    "Dried-fruit based puddings are most often steamed but fruit or vegetable based puddings can be steamed too.",
    "Other famous steamed puddings include ginger pudding, chocolate puddings, date pudding and college pudding.",
    "If you're not familiar with Christmas pudding, have a go at this sweet dried fruit creation.",
    "Douse the result in brandy butter before eating.",
    "Sticky fig pudding, sticky date pudding and sticky date pudding are delicious and well-loved fruit puddings Choose a cold pudding for a summertime treat.",
    "Such puddings can be served for afternoon tea or as a dessert following main course.",
    "Many milk- and cream-based pudding recipes are cold.",
    "In general, cold puddings tend to benefit from being a mold and need to be made well ahead of serving time.",
    "Besides the summer pudding recipe included on this page, cold puddings include mousse, custard, rice pudding, or the old-fashioned syllabub.",
    "Custard and other cold puddings can be used to make a trifle, or British layered dessert.",
    "Make an American chocolate pudding.",
    "In the United States, the word \"pudding\" is usually reserved for cold, custard-like dishes.",
    "A full recipe is included on this page, but there are a couple variations to try as well:\nTry this easier recipe that holds together with cream cheese instead of whisking.",
    "Vegan chocolate pudding can be made without recourse to dairy or egg products.",
    "Create a savory pudding.",
    "Introduce pudding as an entrée as well as dessert.",
    "Savory puddings range from variations on steamed desserts, such as the Savory vegetable pudding, to unique creations like the Yorkshire pudding, made from batter and meat drippings."
  ],
  "tyn_section":[
    "American pudding:",
    "Saucepan",
    "Whisk or food processor",
    "Stirring spoon",
    "Serving bowl or individual custard ramekins",
    "British summer pudding:",
    "Large basin, at least 1.75 quarts (1.75 liters)"
  ],
  "tyn_model":[
    "pudding",
    "bread",
    "cornstarch",
    "chocolate",
    "saucepan",
    "milk",
    "bowl",
    "sugar",
    "berries",
    "plate",
    "salt",
    "whisk",
    "vanilla",
    "refrigerator",
    "water",
    "golden caster sugar",
    "fruit",
    "baked pudding",
    "custard",
    "chocolate pudding",
    "vanilla extract",
    "⅛ tsp",
    "flour",
    "food processor",
    "stirring spoon",
    "egg",
    "— and",
    "scrambled eggs",
    "large bowl",
    "custard ramekins",
    "plastic wrap",
    "summer pudding",
    "oven",
    "superfine sugar",
    "strawberries",
    "liqueur",
    "blackcurrant liqueur",
    "strong plastic wrap",
    "bread bowl",
    "plastic",
    "cream",
    "lemon delicious pudding",
    "citrus pudding",
    "chocolate bread pudding",
    "apple pudding",
    "apple raisin bread pudding",
    "apple crunch pudding",
    "apple and almond pudding",
    "ginger pudding",
    "date pudding",
    "christmas pudding",
    "brandy butter",
    "sticky date pudding",
    "cold pudding",
    "rice pudding",
    "cream cheese",
    "yorkshire pudding"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0350877193,
    "f1":0.0625,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4285714286,
    "p":0.0526315789,
    "f1":0.09375
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5714285714,
    "p":0.0701754386,
    "f1":0.125
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.0350877193,
    "f1":0.0625
  }
}