{
  "title":"How to Thin Out Seedlings",
  "url":"https://www.wikihow.com/Thin-Out-Seedlings",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Plant Propagation Techniques"
  ],
  "parts":[
    {
      "name":"Choosing Which Seedlings to Cut",
      "steps":[
        {
          "headline":"Thin the seedlings when they are 2–3 inches (5.1–7.6 cm) tall.",
          "description":"Monitor the growth of the seedlings closely. Don’t let the seedlings get too big, as more leaves will form, which can cause crowding. It's easiest to wait until the seedlings are tall enough to grasp."
        },
        {
          "headline":"Look for 1-2 sets of true leaves on each seedling.",
          "description":"Seed leaves are replaced by true leaves as the seedlings grow. Look for leaves that match the adults, as seed leaves are more rounded and simpler than true leaves. Waiting for the true leaves to appear helps you pinpoint the healthiest seedlings to keep."
        },
        {
          "headline":"Pick a mild day when the soil is damp.",
          "description":"Thinned seedlings have a greater survival chance if the weather is not too hot or cold. Moisten the soil with a hose or a watering can if it's too dry. It's easier to pull up roots from damp soil."
        },
        {
          "headline":"Wait until the evening to give the seedlings a good chance to adjust.",
          "description":"Only start thinning out when the temperature is cooler. The remaining seedlings need time to adjust to the extra air and light before the increased sunlight exposure during the next day. This prevents the seedlings from getting stressed and helps them to grow into healthy adults."
        },
        {
          "headline":"Locate the strongest and healthiest seedlings to keep.",
          "description":"Look for the seedlings that appear bright, healthy, and disease-free. Use thin wooden sticks like toothpicks or popsicle sticks to mark these seedlings. Check that there is only 1 seedling per cell or that you have followed the recommended spacing. Taller seedlings aren’t always stronger. Avoid choosing tall and spindly seedlings, as these may not become healthy adults."
        }
      ]
    },
    {
      "name":"Removing the Seedlings",
      "steps":[
        {
          "headline":"Aim for 1 seedling per section if they were started in cells or punnets.",
          "description":"Often several seedlings are started in the same place to make germination more likely. Leave only 1 seedling in each cell or punnet to give it the best chance of survival."
        },
        {
          "headline":"Learn the recommended spacing for seedlings that share a plot.",
          "description":"Read the seed packet to find the spacing for thinning out your particular plant. Follow the recommended guidelines so that the remaining seedlings have the best chance to grow. If the spacing is too small you may need to thin out the seedlings again later. The recommended spacing varies between plants. For example, for beans it's 4 in (10 cm) and for corn it's 1–1.5 ft (30–46 cm)."
        },
        {
          "headline":"Pull up leafy seedlings from the ground.",
          "description":"Grasp firmly where the shoots meet the soil. Gently pull the seedling upwards to pull out the roots. Leafy seedlings are easy to remove with your hands. Press your fingers on the soil around each desired seedling when you remove the neighbors if you are worried about disturbing the roots. Discard the seedlings when you are done. Alternatively, you can wash the microgreens and use them in a salad!"
        },
        {
          "headline":"Cut the seedlings at soil level to thin root vegetables.",
          "description":"Use a small pair of scissors to cut the shoots off the seedlings you aren’t keeping. Do this for vegetables like beetroot, carrot, parsnip, and potato. This is because pulling up root vegetables can easily disturb neighboring plants. You can thin out any seedlings with scissors if you are worried about damaging the roots of the desired plants. However, it takes longer than simply pulling up the roots."
        },
        {
          "headline":"Water the remaining seedlings to settle the soil.",
          "description":"Water the seedlings lightly after thinning them out using a watering case or a hose with a fine-spray nozzle. Keep the seedlings well-watered to help them grow into healthy adults!"
        }
      ]
    }
  ],
  "text":" Choosing Which Seedlings to Cut Thin the seedlings when they are 2–3 inches (5.1–7.6 cm) tall. Monitor the growth of the seedlings closely. Don’t let the seedlings get too big, as more leaves will form, which can cause crowding. It's easiest to wait until the seedlings are tall enough to grasp. Look for 1-2 sets of true leaves on each seedling. Seed leaves are replaced by true leaves as the seedlings grow. Look for leaves that match the adults, as seed leaves are more rounded and simpler than true leaves. Waiting for the true leaves to appear helps you pinpoint the healthiest seedlings to keep. Pick a mild day when the soil is damp. Thinned seedlings have a greater survival chance if the weather is not too hot or cold. Moisten the soil with a hose or a watering can if it's too dry. It's easier to pull up roots from damp soil. Wait until the evening to give the seedlings a good chance to adjust. Only start thinning out when the temperature is cooler. The remaining seedlings need time to adjust to the extra air and light before the increased sunlight exposure during the next day. This prevents the seedlings from getting stressed and helps them to grow into healthy adults. Locate the strongest and healthiest seedlings to keep. Look for the seedlings that appear bright, healthy, and disease-free. Use thin wooden sticks like toothpicks or popsicle sticks to mark these seedlings. Check that there is only 1 seedling per cell or that you have followed the recommended spacing. Taller seedlings aren’t always stronger. Avoid choosing tall and spindly seedlings, as these may not become healthy adults. Removing the Seedlings Aim for 1 seedling per section if they were started in cells or punnets. Often several seedlings are started in the same place to make germination more likely. Leave only 1 seedling in each cell or punnet to give it the best chance of survival. Learn the recommended spacing for seedlings that share a plot. Read the seed packet to find the spacing for thinning out your particular plant. Follow the recommended guidelines so that the remaining seedlings have the best chance to grow. If the spacing is too small you may need to thin out the seedlings again later. The recommended spacing varies between plants. For example, for beans it's 4 in (10 cm) and for corn it's 1–1.5 ft (30–46 cm). Pull up leafy seedlings from the ground. Grasp firmly where the shoots meet the soil. Gently pull the seedling upwards to pull out the roots. Leafy seedlings are easy to remove with your hands. Press your fingers on the soil around each desired seedling when you remove the neighbors if you are worried about disturbing the roots. Discard the seedlings when you are done. Alternatively, you can wash the microgreens and use them in a salad! Cut the seedlings at soil level to thin root vegetables. Use a small pair of scissors to cut the shoots off the seedlings you aren’t keeping. Do this for vegetables like beetroot, carrot, parsnip, and potato. This is because pulling up root vegetables can easily disturb neighboring plants. You can thin out any seedlings with scissors if you are worried about damaging the roots of the desired plants. However, it takes longer than simply pulling up the roots. Water the remaining seedlings to settle the soil. Water the seedlings lightly after thinning them out using a watering case or a hose with a fine-spray nozzle. Keep the seedlings well-watered to help them grow into healthy adults!",
  "sentences":[
    " Choosing Which Seedlings to Cut Thin the seedlings when they are 2–3 inches (5.1–7.6 cm) tall.",
    "Monitor the growth of the seedlings closely.",
    "Don’t let the seedlings get too big, as more leaves will form, which can cause crowding.",
    "It's easiest to wait until the seedlings are tall enough to grasp.",
    "Look for 1-2 sets of true leaves on each seedling.",
    "Seed leaves are replaced by true leaves as the seedlings grow.",
    "Look for leaves that match the adults, as seed leaves are more rounded and simpler than true leaves.",
    "Waiting for the true leaves to appear helps you pinpoint the healthiest seedlings to keep.",
    "Pick a mild day when the soil is damp.",
    "Thinned seedlings have a greater survival chance if the weather is not too hot or cold.",
    "Moisten the soil with a hose or a watering can if it's too dry.",
    "It's easier to pull up roots from damp soil.",
    "Wait until the evening to give the seedlings a good chance to adjust.",
    "Only start thinning out when the temperature is cooler.",
    "The remaining seedlings need time to adjust to the extra air and light before the increased sunlight exposure during the next day.",
    "This prevents the seedlings from getting stressed and helps them to grow into healthy adults.",
    "Locate the strongest and healthiest seedlings to keep.",
    "Look for the seedlings that appear bright, healthy, and disease-free.",
    "Use thin wooden sticks like toothpicks or popsicle sticks to mark these seedlings.",
    "Check that there is only 1 seedling per cell or that you have followed the recommended spacing.",
    "Taller seedlings aren’t always stronger.",
    "Avoid choosing tall and spindly seedlings, as these may not become healthy adults.",
    "Removing the Seedlings Aim for 1 seedling per section if they were started in cells or punnets.",
    "Often several seedlings are started in the same place to make germination more likely.",
    "Leave only 1 seedling in each cell or punnet to give it the best chance of survival.",
    "Learn the recommended spacing for seedlings that share a plot.",
    "Read the seed packet to find the spacing for thinning out your particular plant.",
    "Follow the recommended guidelines so that the remaining seedlings have the best chance to grow.",
    "If the spacing is too small you may need to thin out the seedlings again later.",
    "The recommended spacing varies between plants.",
    "For example, for beans it's 4 in (10 cm) and for corn it's 1–1.5 ft (30–46 cm).",
    "Pull up leafy seedlings from the ground.",
    "Grasp firmly where the shoots meet the soil.",
    "Gently pull the seedling upwards to pull out the roots.",
    "Leafy seedlings are easy to remove with your hands.",
    "Press your fingers on the soil around each desired seedling when you remove the neighbors if you are worried about disturbing the roots.",
    "Discard the seedlings when you are done.",
    "Alternatively, you can wash the microgreens and use them in a salad!",
    "Cut the seedlings at soil level to thin root vegetables.",
    "Use a small pair of scissors to cut the shoots off the seedlings you aren’t keeping.",
    "Do this for vegetables like beetroot, carrot, parsnip, and potato.",
    "This is because pulling up root vegetables can easily disturb neighboring plants.",
    "You can thin out any seedlings with scissors if you are worried about damaging the roots of the desired plants.",
    "However, it takes longer than simply pulling up the roots.",
    "Water the remaining seedlings to settle the soil.",
    "Water the seedlings lightly after thinning them out using a watering case or a hose with a fine-spray nozzle.",
    "Keep the seedlings well-watered to help them grow into healthy adults!"
  ],
  "tyn_section":[
    "Seedlings",
    "Watering can or hose with a fine-spray nozzle",
    "Wooden sticks",
    "Scissors"
  ],
  "tyn_model":[
    "hose",
    "vegetables",
    "scissors",
    "water",
    "watering can",
    "seedlings",
    "popsicle sticks",
    "corn",
    "carrot",
    "parsnip",
    "potato",
    "watering case",
    "fine-spray nozzle"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1538461538,
    "f1":0.2352941176,
    "avg_pos":0.3846153846
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1538461538,
    "f1":0.2352941176
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2307692308,
    "f1":0.3529411765
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1538461538,
    "f1":0.2352941176
  }
}