{
  "title":"How to Make Healthy Christmas Cake",
  "url":"https://www.wikihow.com/Make-Healthy-Christmas-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Low-Fat Christmas Cake",
      "steps":[
        {
          "headline":"Pour 1/3 of the herbal tea or rum over the dried fruit and soak for 1 hour.",
          "description":"Place 14 oz (400 g) of mixed dried fruit (not the dates) into a large glass bowl. Measure out 3.5  fl oz (100 mL) of herbal tea, such as rooibos or a spiced Christmas tea. Or, if you prefer, you can use 3.5  fl oz (100 mL) of rum or brandy and pour it over the dried fruit and dates. Tea is a great option for adding flavor without the extra calories. However, using rum or brandy might result in a richer tasting Christmas cake."
        },
        {
          "headline":"Simmer the remaining tea, dates, and allspice in a pan.",
          "description":"Measure out 14 oz (400 g) of chopped, dried dates and place them into a sauce pan. Pour the remaining tea or rum (about 6.5  fl oz (190 mL)) over the dates and add in 1 tbsp (3 g) of allspice. Use a whisk or fork to stir the spices in with the liquid as it warms up. Bring the liquid to a low boil and then turn off the heat. Let the dates soak for 1 hour. Make sure to use a heat-proof whisk to stir the liquid as it warms up."
        },
        {
          "headline":"Puree the cooled dates, liquid, banana, and vanilla extract.",
          "description":"Once the dates and liquid have cooled to room temperature, add them to a food processor or blender. Then, add in 1 large banana broken into chunks and 1 tsp (5 mL) of vanilla or almond extract. Cover the food processor and turn it on. Puree until the ingredients are all well combined. Make sure to keep 1 hand on the lid as the ingredients blend. This will help to prevent the lid from flying off, which could cause a mess."
        },
        {
          "headline":"Stir together the polenta, baking powder, cocoa powder (if using).",
          "description":"Measure out 4 oz (110 g) of fine polenta, 2 tsp (2 g) of baking powder, and 2 tbsp (6 g) of cocoa powder (if you want to make a chocolate flavored cake) and add them to a large mixing bowl. Use a fork or spoon to stir the dry ingredients together. If you don't want your cake to have a chocolate flavor to it, just leave the cocoa powder out."
        },
        {
          "headline":"Combine the dry ingredients with the puree and 2 egg whites.",
          "description":"Pour the puree into the bowl with the dry ingredients. Then, add the egg whites to the bowl and use a hand mixer or whisk to combine everything. Continue to mix until a batter forms and there are no lumps of polenta visible."
        },
        {
          "headline":"Pour off the excess liquid and fold in the dried fruit.",
          "description":"Strain the dried fruit through a colander to remove the excess liquid. Then, add the dried fruit to the batter and fold it in with a spoon. Stir the batter gently to distribute the fruit in the batter."
        },
        {
          "headline":"Transfer the batter to a parchment-lined cake pan.",
          "description":"Place a sheet of parchment paper into a cake pan and press it down around the sides to keep it in the pan. Then, pour the batter onto the parchment paper. If needed, use a spatula to spread the batter around the pan."
        },
        {
          "headline":"Bake the cake at 350 °F (177 °C) for 1 hour.",
          "description":"Place the Christmas cake in the oven and set a timer for 1 hour. Check the cake by inserting a butter knife into it after 1 hour. If the knife comes out clean, then the cake is done. If it comes out with batter on it, bake the cake for another 10 minutes and check again. After the cake is done, remove it from the oven. Then, set it on a potholder or trivet to cool. Invert the cake onto a plate and remove the parchment paper when it is cool.Warning: Always wear oven mitts when you remove a cake from the oven! The pan will be hot and this can cause severe burns if you touch it with bare hands."
        }
      ]
    },
    {
      "name":"Low-Carb Christmas Cake",
      "steps":[
        {
          "headline":"Pour the rum over the dried fruit and soak it for 1 hour.",
          "description":"This is the amount of time it will take to soften up the fruit and imbue it with the alcohol. You can use rum, brandy, gin, vodka, or any other type of spirit you like. If you prefer not to use alcohol in the cake, substitute the alcohol with an equal amount of fresh brewed tea."
        },
        {
          "headline":"Combine the almond meal, stevia, spices, baking soda, and cocoa powder.",
          "description":"Measure out 1 1/2 cups (150 g) of almond meal, 1 tbsp (3 g) of stevia or other sugar-free sweetener, 1 tsp (1 g) of allspice, 1 tsp (1 g) of cinnamon, 1/4 tsp (0.25) of ginger, 1/2 tsp (0.5 g) of baking soda, and  2 tbsp (6 g) of cocoa powder (if using) and pour them into a large mixing bowl. Stir them with a spoon or fork to combine them. If you do not want your cake to have a chocolate flavor to it, then omit the cocoa powder."
        },
        {
          "headline":"Cream in the butter, extracts, and eggs.",
          "description":"Get 1/4 cup (55 g) of butter (softened at room temperature), 1 tsp (5 mL) of vanilla extract, 1 tbsp (15 mL) of almond extract, and 4 eggs. You can also use more vanilla extract if you don't have almond extract. Add these ingredients to the dry ingredients. Then, use a hand mixer to combine the wet and dry ingredients until a batter forms. Mix until there are no visible clumps of spices or almond meal left."
        },
        {
          "headline":"Add the fruit and nuts to the batter.",
          "description":"Drain the excess liquid from the dried fruit by pouring the fruit into a colander. Then, add the alcohol-soaked fruit and 1/2 cup (170 g) of the nuts of your choice. Use a fork or spoon to gently stir the fruit and nuts into the batter. You can use chopped walnuts, pecans, almonds, macadamias, pistachios, or a mixture of these nuts."
        },
        {
          "headline":"Pour the batter into a parchment-lined cake pan.",
          "description":"Place a sheet of parchment paper into the cake pan. Press it into the sides of the pan to help keep it in place. Then, pour all of the batter into the pan. Use a spatula to spread the batter around and make it even, if needed."
        },
        {
          "headline":"Bake the cake at 350 °F (177 °C) for 1 hour.",
          "description":"Put the pan into the oven and set a timer for 1 hour. Check the cake after 1 hour to see if it is done by inserting a butter knife into the center. If the knife comes out with batter on it, then bake the cake for another 10 minutes. If it comes out clean, then the cake is done.Tip: Store the cake at room temperature for up to 24 hours or in your refrigerator for up to 3 days before serving. To freeze the cake, wrap it in 2 layers of foil. Keep it in the freezer for up to 3 months."
        }
      ]
    },
    {
      "name":"Healthy Christmas Cake Toppings",
      "steps":[
        {
          "headline":"Pour 1 to 4 tbsp (60 mL) rum or brandy over the cooled cake.",
          "description":"A simple way to finish your Christmas cake is by pouring more alcohol over it. Use rum, brandy, gin, vodka, or whatever spirit you like. Distribute it evenly over the top of the cake just before serving. Make sure to refrigerate the cake until serving if you pour alcohol over it."
        },
        {
          "headline":"Combine mascarpone cheese and brandy for a low-carb frosting.",
          "description":"Mix together 1/2 cup (110 g) of mascarpone cheese and 1 tbsp (15 mL) of rum or brandy with a hand mixer or strong fork. This will create a rich, lightly flavored low-carb frosting that you can spread over the top of the cake. Make sure to refrigerate the cake if you frost it with mascarpone. Tip: If you want a low-fat frosting, substitute light cream cheese and 1 tbsp (3 g) of stevia or a similar sweetener for the mascarpone."
        },
        {
          "headline":"Top the cake with slices of fresh or dried fruit.",
          "description":"A simple way to make your cake even healthier is to add a few slices of fresh or dried fruit to the top of it before serving. For example, you could top the cake with fresh or dried apple, pineapple, or mango. Or, top the cake with a ½ cup (200 g) of the same type of dried fruit you used in the cake. Be sure to refrigerate your cake if you top it with fresh fruit."
        },
        {
          "headline":"Sprinkle powdered sugar over the cooled cake.",
          "description":"Powdered sugar is simple, festive topping for a Christmas cake. You can simply sprinkle about 1/2 cup (120 g) over the top of the cake. The powdered sugar will look like fresh fallen snow on your healthy Christmas creation! Use a sugar sifter if you have one, or place the powdered sugar in a measuring cup and gently shake it side to side over the cake with the cup upright. This will dust the top of the cake with the powdered sugar."
        }
      ]
    }
  ],
  "text":" Low-Fat Christmas Cake Pour 1/3 of the herbal tea or rum over the dried fruit and soak for 1 hour. Place 14 oz (400 g) of mixed dried fruit (not the dates) into a large glass bowl. Measure out 3.5  fl oz (100 mL) of herbal tea, such as rooibos or a spiced Christmas tea. Or, if you prefer, you can use 3.5  fl oz (100 mL) of rum or brandy and pour it over the dried fruit and dates. Tea is a great option for adding flavor without the extra calories. However, using rum or brandy might result in a richer tasting Christmas cake. Simmer the remaining tea, dates, and allspice in a pan. Measure out 14 oz (400 g) of chopped, dried dates and place them into a sauce pan. Pour the remaining tea or rum (about 6.5  fl oz (190 mL)) over the dates and add in 1 tbsp (3 g) of allspice. Use a whisk or fork to stir the spices in with the liquid as it warms up. Bring the liquid to a low boil and then turn off the heat. Let the dates soak for 1 hour. Make sure to use a heat-proof whisk to stir the liquid as it warms up. Puree the cooled dates, liquid, banana, and vanilla extract. Once the dates and liquid have cooled to room temperature, add them to a food processor or blender. Then, add in 1 large banana broken into chunks and 1 tsp (5 mL) of vanilla or almond extract. Cover the food processor and turn it on. Puree until the ingredients are all well combined. Make sure to keep 1 hand on the lid as the ingredients blend. This will help to prevent the lid from flying off, which could cause a mess. Stir together the polenta, baking powder, cocoa powder (if using). Measure out 4 oz (110 g) of fine polenta, 2 tsp (2 g) of baking powder, and 2 tbsp (6 g) of cocoa powder (if you want to make a chocolate flavored cake) and add them to a large mixing bowl. Use a fork or spoon to stir the dry ingredients together. If you don't want your cake to have a chocolate flavor to it, just leave the cocoa powder out. Combine the dry ingredients with the puree and 2 egg whites. Pour the puree into the bowl with the dry ingredients. Then, add the egg whites to the bowl and use a hand mixer or whisk to combine everything. Continue to mix until a batter forms and there are no lumps of polenta visible. Pour off the excess liquid and fold in the dried fruit. Strain the dried fruit through a colander to remove the excess liquid. Then, add the dried fruit to the batter and fold it in with a spoon. Stir the batter gently to distribute the fruit in the batter. Transfer the batter to a parchment-lined cake pan. Place a sheet of parchment paper into a cake pan and press it down around the sides to keep it in the pan. Then, pour the batter onto the parchment paper. If needed, use a spatula to spread the batter around the pan. Bake the cake at 350 °F (177 °C) for 1 hour. Place the Christmas cake in the oven and set a timer for 1 hour. Check the cake by inserting a butter knife into it after 1 hour. If the knife comes out clean, then the cake is done. If it comes out with batter on it, bake the cake for another 10 minutes and check again. After the cake is done, remove it from the oven. Then, set it on a potholder or trivet to cool. Invert the cake onto a plate and remove the parchment paper when it is cool.Warning: Always wear oven mitts when you remove a cake from the oven! The pan will be hot and this can cause severe burns if you touch it with bare hands. Low-Carb Christmas Cake Pour the rum over the dried fruit and soak it for 1 hour. This is the amount of time it will take to soften up the fruit and imbue it with the alcohol. You can use rum, brandy, gin, vodka, or any other type of spirit you like. If you prefer not to use alcohol in the cake, substitute the alcohol with an equal amount of fresh brewed tea. Combine the almond meal, stevia, spices, baking soda, and cocoa powder. Measure out 1 1/2 cups (150 g) of almond meal, 1 tbsp (3 g) of stevia or other sugar-free sweetener, 1 tsp (1 g) of allspice, 1 tsp (1 g) of cinnamon, 1/4 tsp (0.25) of ginger, 1/2 tsp (0.5 g) of baking soda, and  2 tbsp (6 g) of cocoa powder (if using) and pour them into a large mixing bowl. Stir them with a spoon or fork to combine them. If you do not want your cake to have a chocolate flavor to it, then omit the cocoa powder. Cream in the butter, extracts, and eggs. Get 1/4 cup (55 g) of butter (softened at room temperature), 1 tsp (5 mL) of vanilla extract, 1 tbsp (15 mL) of almond extract, and 4 eggs. You can also use more vanilla extract if you don't have almond extract. Add these ingredients to the dry ingredients. Then, use a hand mixer to combine the wet and dry ingredients until a batter forms. Mix until there are no visible clumps of spices or almond meal left. Add the fruit and nuts to the batter. Drain the excess liquid from the dried fruit by pouring the fruit into a colander. Then, add the alcohol-soaked fruit and 1/2 cup (170 g) of the nuts of your choice. Use a fork or spoon to gently stir the fruit and nuts into the batter. You can use chopped walnuts, pecans, almonds, macadamias, pistachios, or a mixture of these nuts. Pour the batter into a parchment-lined cake pan. Place a sheet of parchment paper into the cake pan. Press it into the sides of the pan to help keep it in place. Then, pour all of the batter into the pan. Use a spatula to spread the batter around and make it even, if needed. Bake the cake at 350 °F (177 °C) for 1 hour. Put the pan into the oven and set a timer for 1 hour. Check the cake after 1 hour to see if it is done by inserting a butter knife into the center. If the knife comes out with batter on it, then bake the cake for another 10 minutes. If it comes out clean, then the cake is done.Tip: Store the cake at room temperature for up to 24 hours or in your refrigerator for up to 3 days before serving. To freeze the cake, wrap it in 2 layers of foil. Keep it in the freezer for up to 3 months. Healthy Christmas Cake Toppings Pour 1 to 4 tbsp (60 mL) rum or brandy over the cooled cake. A simple way to finish your Christmas cake is by pouring more alcohol over it. Use rum, brandy, gin, vodka, or whatever spirit you like. Distribute it evenly over the top of the cake just before serving. Make sure to refrigerate the cake until serving if you pour alcohol over it. Combine mascarpone cheese and brandy for a low-carb frosting. Mix together 1/2 cup (110 g) of mascarpone cheese and 1 tbsp (15 mL) of rum or brandy with a hand mixer or strong fork. This will create a rich, lightly flavored low-carb frosting that you can spread over the top of the cake. Make sure to refrigerate the cake if you frost it with mascarpone. Tip: If you want a low-fat frosting, substitute light cream cheese and 1 tbsp (3 g) of stevia or a similar sweetener for the mascarpone. Top the cake with slices of fresh or dried fruit. A simple way to make your cake even healthier is to add a few slices of fresh or dried fruit to the top of it before serving. For example, you could top the cake with fresh or dried apple, pineapple, or mango. Or, top the cake with a ½ cup (200 g) of the same type of dried fruit you used in the cake. Be sure to refrigerate your cake if you top it with fresh fruit. Sprinkle powdered sugar over the cooled cake. Powdered sugar is simple, festive topping for a Christmas cake. You can simply sprinkle about 1/2 cup (120 g) over the top of the cake. The powdered sugar will look like fresh fallen snow on your healthy Christmas creation! Use a sugar sifter if you have one, or place the powdered sugar in a measuring cup and gently shake it side to side over the cake with the cup upright. This will dust the top of the cake with the powdered sugar.",
  "sentences":[
    " Low-Fat Christmas Cake Pour 1/3 of the herbal tea or rum over the dried fruit and soak for 1 hour.",
    "Place 14 oz (400 g) of mixed dried fruit (not the dates) into a large glass bowl.",
    "Measure out 3.5  fl oz (100 mL) of herbal tea, such as rooibos or a spiced Christmas tea.",
    "Or, if you prefer, you can use 3.5  fl oz (100 mL) of rum or brandy and pour it over the dried fruit and dates.",
    "Tea is a great option for adding flavor without the extra calories.",
    "However, using rum or brandy might result in a richer tasting Christmas cake.",
    "Simmer the remaining tea, dates, and allspice in a pan.",
    "Measure out 14 oz (400 g) of chopped, dried dates and place them into a sauce pan.",
    "Pour the remaining tea or rum (about 6.5  fl oz (190 mL)) over the dates and add in 1 tbsp (3 g) of allspice.",
    "Use a whisk or fork to stir the spices in with the liquid as it warms up.",
    "Bring the liquid to a low boil and then turn off the heat.",
    "Let the dates soak for 1 hour.",
    "Make sure to use a heat-proof whisk to stir the liquid as it warms up.",
    "Puree the cooled dates, liquid, banana, and vanilla extract.",
    "Once the dates and liquid have cooled to room temperature, add them to a food processor or blender.",
    "Then, add in 1 large banana broken into chunks and 1 tsp (5 mL) of vanilla or almond extract.",
    "Cover the food processor and turn it on.",
    "Puree until the ingredients are all well combined.",
    "Make sure to keep 1 hand on the lid as the ingredients blend.",
    "This will help to prevent the lid from flying off, which could cause a mess.",
    "Stir together the polenta, baking powder, cocoa powder (if using).",
    "Measure out 4 oz (110 g) of fine polenta, 2 tsp (2 g) of baking powder, and 2 tbsp (6 g) of cocoa powder (if you want to make a chocolate flavored cake) and add them to a large mixing bowl.",
    "Use a fork or spoon to stir the dry ingredients together.",
    "If you don't want your cake to have a chocolate flavor to it, just leave the cocoa powder out.",
    "Combine the dry ingredients with the puree and 2 egg whites.",
    "Pour the puree into the bowl with the dry ingredients.",
    "Then, add the egg whites to the bowl and use a hand mixer or whisk to combine everything.",
    "Continue to mix until a batter forms and there are no lumps of polenta visible.",
    "Pour off the excess liquid and fold in the dried fruit.",
    "Strain the dried fruit through a colander to remove the excess liquid.",
    "Then, add the dried fruit to the batter and fold it in with a spoon.",
    "Stir the batter gently to distribute the fruit in the batter.",
    "Transfer the batter to a parchment-lined cake pan.",
    "Place a sheet of parchment paper into a cake pan and press it down around the sides to keep it in the pan.",
    "Then, pour the batter onto the parchment paper.",
    "If needed, use a spatula to spread the batter around the pan.",
    "Bake the cake at 350 °F (177 °C) for 1 hour.",
    "Place the Christmas cake in the oven and set a timer for 1 hour.",
    "Check the cake by inserting a butter knife into it after 1 hour.",
    "If the knife comes out clean, then the cake is done.",
    "If it comes out with batter on it, bake the cake for another 10 minutes and check again.",
    "After the cake is done, remove it from the oven.",
    "Then, set it on a potholder or trivet to cool.",
    "Invert the cake onto a plate and remove the parchment paper when it is cool.Warning: Always wear oven mitts when you remove a cake from the oven!",
    "The pan will be hot and this can cause severe burns if you touch it with bare hands.",
    "Low-Carb Christmas Cake Pour the rum over the dried fruit and soak it for 1 hour.",
    "This is the amount of time it will take to soften up the fruit and imbue it with the alcohol.",
    "You can use rum, brandy, gin, vodka, or any other type of spirit you like.",
    "If you prefer not to use alcohol in the cake, substitute the alcohol with an equal amount of fresh brewed tea.",
    "Combine the almond meal, stevia, spices, baking soda, and cocoa powder.",
    "Measure out 1 1/2 cups (150 g) of almond meal, 1 tbsp (3 g) of stevia or other sugar-free sweetener, 1 tsp (1 g) of allspice, 1 tsp (1 g) of cinnamon, 1/4 tsp (0.25) of ginger, 1/2 tsp (0.5 g) of baking soda, and  2 tbsp (6 g) of cocoa powder (if using) and pour them into a large mixing bowl.",
    "Stir them with a spoon or fork to combine them.",
    "If you do not want your cake to have a chocolate flavor to it, then omit the cocoa powder.",
    "Cream in the butter, extracts, and eggs.",
    "Get 1/4 cup (55 g) of butter (softened at room temperature), 1 tsp (5 mL) of vanilla extract, 1 tbsp (15 mL) of almond extract, and 4 eggs.",
    "You can also use more vanilla extract if you don't have almond extract.",
    "Add these ingredients to the dry ingredients.",
    "Then, use a hand mixer to combine the wet and dry ingredients until a batter forms.",
    "Mix until there are no visible clumps of spices or almond meal left.",
    "Add the fruit and nuts to the batter.",
    "Drain the excess liquid from the dried fruit by pouring the fruit into a colander.",
    "Then, add the alcohol-soaked fruit and 1/2 cup (170 g) of the nuts of your choice.",
    "Use a fork or spoon to gently stir the fruit and nuts into the batter.",
    "You can use chopped walnuts, pecans, almonds, macadamias, pistachios, or a mixture of these nuts.",
    "Pour the batter into a parchment-lined cake pan.",
    "Place a sheet of parchment paper into the cake pan.",
    "Press it into the sides of the pan to help keep it in place.",
    "Then, pour all of the batter into the pan.",
    "Use a spatula to spread the batter around and make it even, if needed.",
    "Bake the cake at 350 °F (177 °C) for 1 hour.",
    "Put the pan into the oven and set a timer for 1 hour.",
    "Check the cake after 1 hour to see if it is done by inserting a butter knife into the center.",
    "If the knife comes out with batter on it, then bake the cake for another 10 minutes.",
    "If it comes out clean, then the cake is done.Tip: Store the cake at room temperature for up to 24 hours or in your refrigerator for up to 3 days before serving.",
    "To freeze the cake, wrap it in 2 layers of foil.",
    "Keep it in the freezer for up to 3 months.",
    "Healthy Christmas Cake Toppings Pour 1 to 4 tbsp (60 mL) rum or brandy over the cooled cake.",
    "A simple way to finish your Christmas cake is by pouring more alcohol over it.",
    "Use rum, brandy, gin, vodka, or whatever spirit you like.",
    "Distribute it evenly over the top of the cake just before serving.",
    "Make sure to refrigerate the cake until serving if you pour alcohol over it.",
    "Combine mascarpone cheese and brandy for a low-carb frosting.",
    "Mix together 1/2 cup (110 g) of mascarpone cheese and 1 tbsp (15 mL) of rum or brandy with a hand mixer or strong fork.",
    "This will create a rich, lightly flavored low-carb frosting that you can spread over the top of the cake.",
    "Make sure to refrigerate the cake if you frost it with mascarpone.",
    "Tip: If you want a low-fat frosting, substitute light cream cheese and 1 tbsp (3 g) of stevia or a similar sweetener for the mascarpone.",
    "Top the cake with slices of fresh or dried fruit.",
    "A simple way to make your cake even healthier is to add a few slices of fresh or dried fruit to the top of it before serving.",
    "For example, you could top the cake with fresh or dried apple, pineapple, or mango.",
    "Or, top the cake with a ½ cup (200 g) of the same type of dried fruit you used in the cake.",
    "Be sure to refrigerate your cake if you top it with fresh fruit.",
    "Sprinkle powdered sugar over the cooled cake.",
    "Powdered sugar is simple, festive topping for a Christmas cake.",
    "You can simply sprinkle about 1/2 cup (120 g) over the top of the cake.",
    "The powdered sugar will look like fresh fallen snow on your healthy Christmas creation!",
    "Use a sugar sifter if you have one, or place the powdered sugar in a measuring cup and gently shake it side to side over the cake with the cup upright.",
    "This will dust the top of the cake with the powdered sugar."
  ],
  "tyn_section":[
    "Mixing bowls",
    "Measuring cups and spoons",
    "Whisk or hand mixer",
    "Spoon or fork",
    "10 in (25 cm) round cake pan",
    "Parchment paper"
  ],
  "tyn_model":[
    "rum",
    "dates",
    "cocoa powder",
    "brandy",
    "powdered sugar",
    "parchment paper",
    "oven",
    "alcohol",
    "tea",
    "allspice",
    "spices",
    "vanilla extract",
    "hand mixer",
    "almond meal",
    "stevia",
    "herbal tea",
    "whisk",
    "banana",
    "food processor",
    "baking powder",
    "large mixing bowl",
    "fork",
    "bowl",
    "colander",
    "spoon",
    "parchment-lined cake pan",
    "cake pan",
    "spatula",
    "butter knife",
    "gin",
    "vodka",
    "baking soda",
    "butter",
    "eggs",
    "almond extract",
    "nuts",
    "mascarpone cheese",
    "low-carb frosting",
    "large glass bowl",
    "spiced christmas tea",
    "sauce pan",
    "heat-proof whisk",
    "blender",
    "vanilla or almond extract",
    "puree",
    "knife",
    "plate",
    "oven mitts",
    "cake",
    "fresh brewed tea",
    "sugar-free sweetener",
    "cinnamon",
    "ginger",
    "walnuts",
    "pecans",
    "almonds",
    "pistachios",
    "foil",
    "rum or brandy",
    "strong fork",
    "mascarpone",
    "cream cheese",
    "pineapple",
    "mango",
    "sugar sifter",
    "measuring cup"
  ],
  "simple_metrics":{
    "r":0.1666666667,
    "p":0.0151515152,
    "f1":0.0277777778,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0303030303,
    "f1":0.0555555556
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.0606060606,
    "f1":0.1081081081
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1666666667,
    "p":0.0151515152,
    "f1":0.0277777778
  }
}