{
  "title":"How to Make Sharpie Mugs",
  "url":"https://www.wikihow.com/Make-Sharpie-Mugs",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Clay Projects"
  ],
  "parts":[
    {
      "name":"Designing Your Sharpie Mug",
      "steps":[
        {
          "headline":"Find one or more plain white mugs with a shape you like.",
          "description":"Go on the hunt for a plain white mug with the right shape for the kind of design you wish to create. Mugs come in all different sizes, so explore your options. Think about how the shape of the mug might influence the design and vice-versa. Your mug can have a colored rim or handle, if you like, but make sure that the body is blank so that there's plenty of room to draw. Cheaper mugs tend to work best for holding the Sharpie design because they typically make use of a thinner layer of glaze covering the outside of the mug. Wash or wipe down your mug with rubbing alcohol and dry thoroughly before designing. This will get rid of any moisture, oils or fingerprint stains so that the Sharpie will draw on clean."
        },
        {
          "headline":"Buy a package of oil-based Sharpie paint markers.",
          "description":"While some people have had success making mugs with regular Sharpie markers, others have reported smudging and fading and recommend an oil-based paint marker instead. These are only slightly more expensive than regular Sharpies and will set into the ceramic surface of the mug better to produce a more durable, longer-lasting design. Sharpie is the most recognizable brand of permanent marker, but it's not your only option. Experienced crafters also recommend ArtDeco and Pebeo Porcelaine paint markers for a finish that won't smear or wash away."
        },
        {
          "headline":"Trace or free-hand a design onto the mug.",
          "description":"Once you've got an idea in mind for what you'd like your mug to look like, make it a reality. Get creative: utilize different color combinations and take liberties with the shape of the mug and the space you have to work with, or blend text with visual elements for a collage look. The possibilities are practically endless! Use masking tape to craft precise lines and angles. Get as complex or minimalistic as you want. One mug might feature a single pastel flower design, while the next may be covered in a wild tessellation of bright colors."
        },
        {
          "headline":"Allow time for the marker to dry completely.",
          "description":"You're going to want to let the marker dry completely on the surface of the mug before you cure it—this way, you'll minimize the chances of the marker failing to set up in the ceramic and coming off too easily. After you finish designing your mug, let it sit in a well-ventilated area for a couple hours. Once the marker is dry enough to where it won't smudge to the touch, it's ready to go in the oven. Mugs decorated with oil-based paint markers will probably require a little longer to dry because of the thickness of the paint."
        }
      ]
    },
    {
      "name":"Finishing and Maintaining Sharpie Mugs",
      "steps":[
        {
          "headline":"Preheat your oven to around 425 degrees.",
          "description":"Get your oven nice and hot in preparation to cure the unfinished mug. The dry heat from the oven will bake the marker or paint into the glaze of the mug, making it a permanent addition. The hotter the oven, the more thoroughly the marker will set in, but be careful not to set the oven any hotter than about 450 degrees, as this may cause the mug to crack or shatter. Put the mug in the oven before it has reached the specified temperature to allow the ceramic to warm more gradually."
        },
        {
          "headline":"Heat the mug in the oven for 20-30 minutes.",
          "description":"Stand the mug on a flat baking sheet and place it into the heated oven. It will take about half an hour in the oven for the ceramic to hold the marker. Keep an eye on the mug as it heats to ensure that it doesn't become damaged. When heating multiple mugs at once, allow ample space between each mug so that the heat circulates more evenly between them. As the mug heats up, the outer coating of glaze will soften and the ink or paint will sink in, becoming permanent once it dries again. Don't leave your mug in the over for more than 30 minutes. Heating mugs in large batches might require a little extra time, but the chances of an empty mug shattering increase the longer it is exposed to intense heat. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tClaire Donovan-Blackwood\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\t\t\t\t\tClaire Donovan-Blackwood is the owner of Heart Handmade UK, a site dedicated to living a happy, creative life. She is a 12 year blogging veteran who loves making crafting and DIY as easy as possible for others, with a focus on mindfulness in making. Claire Donovan-Blackwood\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\tTry this craft with other containers made out of oven-safe materials. You could create a decorated vase for flowers or a bowl for your kitchen table. Just make sure that whatever you're marking on is safe to put in the oven. Ceramics, most metals, and some glassware is fine, but wood, plastic, and crystal should never be put into the oven."
        },
        {
          "headline":"Let the mug set up overnight.",
          "description":"Turn the oven off and leave the mugs inside as it cools (ceramic is prone to cracking when exposed to abrupt changes in temperature). Then, find a dry, open space to leave the mugs to finish cooling and setting up overnight. By the time you wake up in the morning, the marker will have had sufficient time to fully infuse into the ceramic and the mug will be ready to use! Keep cooling mugs out of the reach of pets and children."
        },
        {
          "headline":"Wash used mugs by hand only.",
          "description":"If your mug is to be for drinking rather than display, it will need to be washed after use. This should always be done by hand rather than in the dishwasher. Simply take a small amount of dish soap and a dish scrubber or sponge and wash out the interior and rim of the mug, then dry gently with a clean towel. Some crafters claim that their mugs have held up fine under machine washing, but generally speaking the heat and pressure of dishwashers is extremely harsh on dishes with delicate designs."
        }
      ]
    },
    {
      "name":"Playing Around With Other Design Ideas",
      "steps":[
        {
          "headline":"Stencil geometrical patterns or shapes.",
          "description":"Using your masking tape and a pencil, outline and trace precise designs before painting. Give your mug vertical or horizontal stripes, zig-zags or a gridwork finish. Stenciling will allow you to create geometrical objects with much greater accuracy and neatness. Premade stencils can also be used to trace basic designs. Try monogramming your initials onto a mug you use every day to help you keep up with it at work or in a busy household."
        },
        {
          "headline":"Create an abstract finish.",
          "description":"Add an element of randomness when designing your mug for an abstract aesthetic. Don't think too much about what you're drawing, just let your hand take over for your mind. Use a variety of colors and texturing techniques like stippling and deliberate smudging to produce something entirely unique. No two abstract mugs will be the same! A little running or smudging will not matter on an abstract mug design, but make sure you still avoid washing the mug in a dishwasher, or the colors might bleed out entirely."
        },
        {
          "headline":"Add a personalized message.",
          "description":"Write out a quirky quote or slogan on a Sharpie mug for a unique handmade gift idea. Mark the mug with your own or someone else's name for personal use, or use the design to commemorate a special event, such as a birthday or bridal shower. Adding script elements gives you full control over what your mug says to people, literally. Write the names of the bridal party on oversized mugs and stuff them with treats to create fun little gift baskets for a wedding shower. A hand-designed mug bearing a personal message could be given in place of a store bought card for mom and dad on Mother's Day or Father's Day."
        },
        {
          "headline":"Draw on your favorite character.",
          "description":"Why pay for an overpriced mug from an official merchandiser when you can make an original for a fraction of the cost? Emblazon the outside of your mug with your favorite comic book superhero or Disney princess and incorporate other accents and visual features as you please. Search the internet for printable templates if you're having a hard time drawing a character on the curved mug surface."
        },
        {
          "headline":"Make a set of holiday-themed mugs.",
          "description":"Deck your Sharpie mugs out with elves and holly leaves for the Christmas season, or spooky spiders and a glowing jack-o-lantern for Halloween. Create a set of one-of-a-kind mugs that you can break out on every major decorative holiday. Make enough mugs for everyone to have one when you have company over; you can even let your guests keep the mugs as gifts. Serve hot chocolate, spiced cider or punch in your Sharpie mugs at holiday-themed parties. Your collection of holiday mugs will make great display pieces year-round, even when they're not in use for a particular season."
        }
      ]
    }
  ],
  "text":" Designing Your Sharpie Mug Find one or more plain white mugs with a shape you like. Go on the hunt for a plain white mug with the right shape for the kind of design you wish to create. Mugs come in all different sizes, so explore your options. Think about how the shape of the mug might influence the design and vice-versa. Your mug can have a colored rim or handle, if you like, but make sure that the body is blank so that there's plenty of room to draw. Cheaper mugs tend to work best for holding the Sharpie design because they typically make use of a thinner layer of glaze covering the outside of the mug. Wash or wipe down your mug with rubbing alcohol and dry thoroughly before designing. This will get rid of any moisture, oils or fingerprint stains so that the Sharpie will draw on clean. Buy a package of oil-based Sharpie paint markers. While some people have had success making mugs with regular Sharpie markers, others have reported smudging and fading and recommend an oil-based paint marker instead. These are only slightly more expensive than regular Sharpies and will set into the ceramic surface of the mug better to produce a more durable, longer-lasting design. Sharpie is the most recognizable brand of permanent marker, but it's not your only option. Experienced crafters also recommend ArtDeco and Pebeo Porcelaine paint markers for a finish that won't smear or wash away. Trace or free-hand a design onto the mug. Once you've got an idea in mind for what you'd like your mug to look like, make it a reality. Get creative: utilize different color combinations and take liberties with the shape of the mug and the space you have to work with, or blend text with visual elements for a collage look. The possibilities are practically endless! Use masking tape to craft precise lines and angles. Get as complex or minimalistic as you want. One mug might feature a single pastel flower design, while the next may be covered in a wild tessellation of bright colors. Allow time for the marker to dry completely. You're going to want to let the marker dry completely on the surface of the mug before you cure it—this way, you'll minimize the chances of the marker failing to set up in the ceramic and coming off too easily. After you finish designing your mug, let it sit in a well-ventilated area for a couple hours. Once the marker is dry enough to where it won't smudge to the touch, it's ready to go in the oven. Mugs decorated with oil-based paint markers will probably require a little longer to dry because of the thickness of the paint. Finishing and Maintaining Sharpie Mugs Preheat your oven to around 425 degrees. Get your oven nice and hot in preparation to cure the unfinished mug. The dry heat from the oven will bake the marker or paint into the glaze of the mug, making it a permanent addition. The hotter the oven, the more thoroughly the marker will set in, but be careful not to set the oven any hotter than about 450 degrees, as this may cause the mug to crack or shatter. Put the mug in the oven before it has reached the specified temperature to allow the ceramic to warm more gradually. Heat the mug in the oven for 20-30 minutes. Stand the mug on a flat baking sheet and place it into the heated oven. It will take about half an hour in the oven for the ceramic to hold the marker. Keep an eye on the mug as it heats to ensure that it doesn't become damaged. When heating multiple mugs at once, allow ample space between each mug so that the heat circulates more evenly between them. As the mug heats up, the outer coating of glaze will soften and the ink or paint will sink in, becoming permanent once it dries again. Don't leave your mug in the over for more than 30 minutes. Heating mugs in large batches might require a little extra time, but the chances of an empty mug shattering increase the longer it is exposed to intense heat. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tClaire Donovan-Blackwood\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\t\t\t\t\tClaire Donovan-Blackwood is the owner of Heart Handmade UK, a site dedicated to living a happy, creative life. She is a 12 year blogging veteran who loves making crafting and DIY as easy as possible for others, with a focus on mindfulness in making. Claire Donovan-Blackwood\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\tTry this craft with other containers made out of oven-safe materials. You could create a decorated vase for flowers or a bowl for your kitchen table. Just make sure that whatever you're marking on is safe to put in the oven. Ceramics, most metals, and some glassware is fine, but wood, plastic, and crystal should never be put into the oven. Let the mug set up overnight. Turn the oven off and leave the mugs inside as it cools (ceramic is prone to cracking when exposed to abrupt changes in temperature). Then, find a dry, open space to leave the mugs to finish cooling and setting up overnight. By the time you wake up in the morning, the marker will have had sufficient time to fully infuse into the ceramic and the mug will be ready to use! Keep cooling mugs out of the reach of pets and children. Wash used mugs by hand only. If your mug is to be for drinking rather than display, it will need to be washed after use. This should always be done by hand rather than in the dishwasher. Simply take a small amount of dish soap and a dish scrubber or sponge and wash out the interior and rim of the mug, then dry gently with a clean towel. Some crafters claim that their mugs have held up fine under machine washing, but generally speaking the heat and pressure of dishwashers is extremely harsh on dishes with delicate designs. Playing Around With Other Design Ideas Stencil geometrical patterns or shapes. Using your masking tape and a pencil, outline and trace precise designs before painting. Give your mug vertical or horizontal stripes, zig-zags or a gridwork finish. Stenciling will allow you to create geometrical objects with much greater accuracy and neatness. Premade stencils can also be used to trace basic designs. Try monogramming your initials onto a mug you use every day to help you keep up with it at work or in a busy household. Create an abstract finish. Add an element of randomness when designing your mug for an abstract aesthetic. Don't think too much about what you're drawing, just let your hand take over for your mind. Use a variety of colors and texturing techniques like stippling and deliberate smudging to produce something entirely unique. No two abstract mugs will be the same! A little running or smudging will not matter on an abstract mug design, but make sure you still avoid washing the mug in a dishwasher, or the colors might bleed out entirely. Add a personalized message. Write out a quirky quote or slogan on a Sharpie mug for a unique handmade gift idea. Mark the mug with your own or someone else's name for personal use, or use the design to commemorate a special event, such as a birthday or bridal shower. Adding script elements gives you full control over what your mug says to people, literally. Write the names of the bridal party on oversized mugs and stuff them with treats to create fun little gift baskets for a wedding shower. A hand-designed mug bearing a personal message could be given in place of a store bought card for mom and dad on Mother's Day or Father's Day. Draw on your favorite character. Why pay for an overpriced mug from an official merchandiser when you can make an original for a fraction of the cost? Emblazon the outside of your mug with your favorite comic book superhero or Disney princess and incorporate other accents and visual features as you please. Search the internet for printable templates if you're having a hard time drawing a character on the curved mug surface. Make a set of holiday-themed mugs. Deck your Sharpie mugs out with elves and holly leaves for the Christmas season, or spooky spiders and a glowing jack-o-lantern for Halloween. Create a set of one-of-a-kind mugs that you can break out on every major decorative holiday. Make enough mugs for everyone to have one when you have company over; you can even let your guests keep the mugs as gifts. Serve hot chocolate, spiced cider or punch in your Sharpie mugs at holiday-themed parties. Your collection of holiday mugs will make great display pieces year-round, even when they're not in use for a particular season.",
  "sentences":[
    " Designing Your Sharpie Mug Find one or more plain white mugs with a shape you like.",
    "Go on the hunt for a plain white mug with the right shape for the kind of design you wish to create.",
    "Mugs come in all different sizes, so explore your options.",
    "Think about how the shape of the mug might influence the design and vice-versa.",
    "Your mug can have a colored rim or handle, if you like, but make sure that the body is blank so that there's plenty of room to draw.",
    "Cheaper mugs tend to work best for holding the Sharpie design because they typically make use of a thinner layer of glaze covering the outside of the mug.",
    "Wash or wipe down your mug with rubbing alcohol and dry thoroughly before designing.",
    "This will get rid of any moisture, oils or fingerprint stains so that the Sharpie will draw on clean.",
    "Buy a package of oil-based Sharpie paint markers.",
    "While some people have had success making mugs with regular Sharpie markers, others have reported smudging and fading and recommend an oil-based paint marker instead.",
    "These are only slightly more expensive than regular Sharpies and will set into the ceramic surface of the mug better to produce a more durable, longer-lasting design.",
    "Sharpie is the most recognizable brand of permanent marker, but it's not your only option.",
    "Experienced crafters also recommend ArtDeco and Pebeo Porcelaine paint markers for a finish that won't smear or wash away.",
    "Trace or free-hand a design onto the mug.",
    "Once you've got an idea in mind for what you'd like your mug to look like, make it a reality.",
    "Get creative: utilize different color combinations and take liberties with the shape of the mug and the space you have to work with, or blend text with visual elements for a collage look.",
    "The possibilities are practically endless!",
    "Use masking tape to craft precise lines and angles.",
    "Get as complex or minimalistic as you want.",
    "One mug might feature a single pastel flower design, while the next may be covered in a wild tessellation of bright colors.",
    "Allow time for the marker to dry completely.",
    "You're going to want to let the marker dry completely on the surface of the mug before you cure it—this way, you'll minimize the chances of the marker failing to set up in the ceramic and coming off too easily.",
    "After you finish designing your mug, let it sit in a well-ventilated area for a couple hours.",
    "Once the marker is dry enough to where it won't smudge to the touch, it's ready to go in the oven.",
    "Mugs decorated with oil-based paint markers will probably require a little longer to dry because of the thickness of the paint.",
    "Finishing and Maintaining Sharpie Mugs Preheat your oven to around 425 degrees.",
    "Get your oven nice and hot in preparation to cure the unfinished mug.",
    "The dry heat from the oven will bake the marker or paint into the glaze of the mug, making it a permanent addition.",
    "The hotter the oven, the more thoroughly the marker will set in, but be careful not to set the oven any hotter than about 450 degrees, as this may cause the mug to crack or shatter.",
    "Put the mug in the oven before it has reached the specified temperature to allow the ceramic to warm more gradually.",
    "Heat the mug in the oven for 20-30 minutes.",
    "Stand the mug on a flat baking sheet and place it into the heated oven.",
    "It will take about half an hour in the oven for the ceramic to hold the marker.",
    "Keep an eye on the mug as it heats to ensure that it doesn't become damaged.",
    "When heating multiple mugs at once, allow ample space between each mug so that the heat circulates more evenly between them.",
    "As the mug heats up, the outer coating of glaze will soften and the ink or paint will sink in, becoming permanent once it dries again.",
    "Don't leave your mug in the over for more than 30 minutes.",
    "Heating mugs in large batches might require a little extra time, but the chances of an empty mug shattering increase the longer it is exposed to intense heat.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tClaire Donovan-Blackwood\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\t\t\t\t\tClaire Donovan-Blackwood is the owner of Heart Handmade UK, a site dedicated to living a happy, creative life.",
    "She is a 12 year blogging veteran who loves making crafting and DIY as easy as possible for others, with a focus on mindfulness in making.",
    "Claire Donovan-Blackwood\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\tTry this craft with other containers made out of oven-safe materials.",
    "You could create a decorated vase for flowers or a bowl for your kitchen table.",
    "Just make sure that whatever you're marking on is safe to put in the oven.",
    "Ceramics, most metals, and some glassware is fine, but wood, plastic, and crystal should never be put into the oven.",
    "Let the mug set up overnight.",
    "Turn the oven off and leave the mugs inside as it cools (ceramic is prone to cracking when exposed to abrupt changes in temperature).",
    "Then, find a dry, open space to leave the mugs to finish cooling and setting up overnight.",
    "By the time you wake up in the morning, the marker will have had sufficient time to fully infuse into the ceramic and the mug will be ready to use!",
    "Keep cooling mugs out of the reach of pets and children.",
    "Wash used mugs by hand only.",
    "If your mug is to be for drinking rather than display, it will need to be washed after use.",
    "This should always be done by hand rather than in the dishwasher.",
    "Simply take a small amount of dish soap and a dish scrubber or sponge and wash out the interior and rim of the mug, then dry gently with a clean towel.",
    "Some crafters claim that their mugs have held up fine under machine washing, but generally speaking the heat and pressure of dishwashers is extremely harsh on dishes with delicate designs.",
    "Playing Around With Other Design Ideas Stencil geometrical patterns or shapes.",
    "Using your masking tape and a pencil, outline and trace precise designs before painting.",
    "Give your mug vertical or horizontal stripes, zig-zags or a gridwork finish.",
    "Stenciling will allow you to create geometrical objects with much greater accuracy and neatness.",
    "Premade stencils can also be used to trace basic designs.",
    "Try monogramming your initials onto a mug you use every day to help you keep up with it at work or in a busy household.",
    "Create an abstract finish.",
    "Add an element of randomness when designing your mug for an abstract aesthetic.",
    "Don't think too much about what you're drawing, just let your hand take over for your mind.",
    "Use a variety of colors and texturing techniques like stippling and deliberate smudging to produce something entirely unique.",
    "No two abstract mugs will be the same!",
    "A little running or smudging will not matter on an abstract mug design, but make sure you still avoid washing the mug in a dishwasher, or the colors might bleed out entirely.",
    "Add a personalized message.",
    "Write out a quirky quote or slogan on a Sharpie mug for a unique handmade gift idea.",
    "Mark the mug with your own or someone else's name for personal use, or use the design to commemorate a special event, such as a birthday or bridal shower.",
    "Adding script elements gives you full control over what your mug says to people, literally.",
    "Write the names of the bridal party on oversized mugs and stuff them with treats to create fun little gift baskets for a wedding shower.",
    "A hand-designed mug bearing a personal message could be given in place of a store bought card for mom and dad on Mother's Day or Father's Day.",
    "Draw on your favorite character.",
    "Why pay for an overpriced mug from an official merchandiser when you can make an original for a fraction of the cost?",
    "Emblazon the outside of your mug with your favorite comic book superhero or Disney princess and incorporate other accents and visual features as you please.",
    "Search the internet for printable templates if you're having a hard time drawing a character on the curved mug surface.",
    "Make a set of holiday-themed mugs.",
    "Deck your Sharpie mugs out with elves and holly leaves for the Christmas season, or spooky spiders and a glowing jack-o-lantern for Halloween.",
    "Create a set of one-of-a-kind mugs that you can break out on every major decorative holiday.",
    "Make enough mugs for everyone to have one when you have company over; you can even let your guests keep the mugs as gifts.",
    "Serve hot chocolate, spiced cider or punch in your Sharpie mugs at holiday-themed parties.",
    "Your collection of holiday mugs will make great display pieces year-round, even when they're not in use for a particular season."
  ],
  "tyn_section":[
    "Plain white ceramic mug(s)",
    "Sharpie permanent markers",
    "Oil-based paint markers (optional)",
    "Masking tape (optional)",
    "Pencil (optional)",
    "Oven"
  ],
  "tyn_model":[
    "mug",
    "oven",
    "mugs",
    "marker",
    "masking tape",
    "paint",
    "ceramic",
    "sharpie mugs",
    "rubbing alcohol",
    "oil-based sharpie paint markers",
    "sharpie markers",
    "oil-based paint marker",
    "sharpie",
    "permanent marker",
    "paint markers",
    "—this",
    "oil-based paint markers",
    "baking sheet",
    "ink",
    "heart handmade uk",
    "containers",
    "vase",
    "bowl",
    "crystal",
    "dish soap",
    "dish scrubber",
    "sponge",
    "towel",
    "dishwashers",
    "pencil",
    "sharpie mug",
    "hot chocolate",
    "spiced cider"
  ],
  "simple_metrics":{
    "r":0.1666666667,
    "p":0.0303030303,
    "f1":0.0512820513,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.2121212121,
    "f1":0.3381642512
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.2727272727,
    "f1":0.4109589041
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1212121212,
    "f1":0.2051282051
  }
}