{
  "title":"How to Make Apple Muffins",
  "url":"https://www.wikihow.com/Make-Apple-Muffins",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Muffins"
  ],
  "methods":[
    {
      "name":"Making Basic Apple Muffins",
      "steps":[
        {
          "headline":"Preheat your oven to 375°F (190°C) and lightly grease a 12-cup muffin tin.",
          "description":""
        },
        {
          "headline":"Mix together the flour, baking powder, baking soda, and salt in a medium-sized mixing bowl.",
          "description":"Sift the flour first, to get rid of any clumps, then stir in the baking powder, baking soda, and salt. You can do this using a wooden spoon or a rubber spatula. For a more flavorful apple muffin, add 1 teaspoon of ground cinnamon and ½ teaspoon of ground nutmeg."
        },
        {
          "headline":"Cream the butter and sugar in a separate bowl.",
          "description":"Cut the butter into small cubes first, then add it into the bowl. Pour in the sugar, and beat it together with the butter. You can do this using a hand-held beater, a stand mixer, or even a food processor. For a tasty twist, use ½ cup (115 grams) of white sugar and ½ cup (100 grams) of brown sugar."
        },
        {
          "headline":"Whisk in the eggs, one by one, then stir in the vanilla extract.",
          "description":"Add the eggs, one at a time, into the butter mixture; whisk the mixture well after each egg you add. Once you can't see any more streaks of egg yolk, add the vanilla extract. If you added ground cinnamon and ground nutmeg, you might want to reduce the vanilla extract to just 1 teaspoon, otherwise the flavors might overpower the flavor of the apples."
        },
        {
          "headline":"Gently fold in the apples.",
          "description":"If you have not done so already, peel, core, and chop the apples, then gently fold them into the butter mixture with a rubber spatula. Be sure to scrape the bottom of the bowl from time to time to ensure that everything mixes in evenly. If you want the apples to distribute more evenly throughout the batter, use 1 cup (120 grams) of shredded apples, and ½ cup (60 grams) of chopped apples."
        },
        {
          "headline":"Gently fold in the flour mixture a little bit at a time.",
          "description":"Using your rubber spatula, fold in half of the flour mixture until it is completely blended in. Fold in the rest of the flour mixture, making sure to scrape the bottom of the bowl often."
        },
        {
          "headline":"Fill the muffin cups ⅔ to ¾ of the way with batter.",
          "description":"A great way to do this would be with an ice cream scoop—this way, each cup gets an equal amount of batter."
        },
        {
          "headline":"Consider making a strudel topping for the muffins.",
          "description":"While not completely necessary for this recipe, a strudel topping and really take your apple muffins to the next level. Here is how you do it:\nMix ⅓ cup (65 grams) of brown sugar with 1 tablespoon (7.5 grams) of all-purpose flour and ⅛ teaspoon of ground cinnamon. Cut in 1 tablespoon (15 grams) of butter until you get a mixture that resembles coarse crumbs. Sprinkle the mixture over the muffins."
        },
        {
          "headline":"Bake the muffins for 20 to 25 minutes.",
          "description":"They are ready when a toothpick poked into the middle comes out clean."
        },
        {
          "headline":"Let the muffins cool for 10 to 15 minutes before taking them out of the tin.",
          "description":"After that, you can serve them warm with some butter or cream, or allow them to finish cooling on a wire cooling rack."
        }
      ]
    },
    {
      "name":"Making Wholesome Apple Muffins",
      "steps":[
        {
          "headline":"Preheat your oven to 400°F (205°C), and lightly grease a 12-hole muffin tin with cooking spray.",
          "description":""
        },
        {
          "headline":"Combine the pecans, 2 tablespoons (25 grams) of brown sugar, and cinnamon in a small bowl.",
          "description":"Save the remaining ¾ cup (150 grams) of brown sugar for later."
        },
        {
          "headline":"Whisk together the flours, baking soda, and salt in a medium-sized bowl.",
          "description":"Set the flour mixture aside when you are done. You will be adding this into your wet ingredients later on. Having all of the flours mixed in together first will give you more consistent muffins."
        },
        {
          "headline":"Whisk together the oil and the rest of the brown sugar in a large bowl.",
          "description":"Keep whisking until the oil and sugar are evenly combined. If you can't find any canola oil, you can use another flavorless cooking oil, such as vegetable oil."
        },
        {
          "headline":"Add the eggs one at a time into the oil mixture.",
          "description":"Stir the mixture well with a whisk after each egg that you add. Keep whisking until the yolks break, and there are no more streaks."
        },
        {
          "headline":"Stir the applesauce and vanilla extract into the oil mixture with a whisk.",
          "description":"Make sure that you are using plain, unsweetened applesauce. If you used the flavored kind, your apple muffins may turn out too sweet!"
        },
        {
          "headline":"Alternate between stirring in the flour mixture and the buttermilk mixture.",
          "description":"Whisk in half of the flour mixture, then half of the buttermilk. Whisk in the rest of the flour mixture, and then the rest of the buttermilk. This will prevent things from clumping up too much."
        },
        {
          "headline":"Gently fold in the apple chunks.",
          "description":"If you have not yet done so, peel, core, and cut the apple into ¼-inch (0.64-centimeter) chunks. Gently fold them into the batter using a rubber spatula. Be sure to scrape the bottom of the bowl often to ensure that the apple chunks mix in evenly."
        },
        {
          "headline":"Fill each muffin cup ⅔ to ¾ of the way with batter.",
          "description":"A quick and easy way to do this is with a large spoon or an ice cream scoop; this also ensures that each cup gets the same amount of batter."
        },
        {
          "headline":"Sprinkle the pecan mixture from before on top of each muffin.",
          "description":"When you are done, gently tap the pan a few times against your counter. This will bring any air bubbles to the surface of the muffins."
        },
        {
          "headline":"Bake the muffins for 20 to 25 minutes.",
          "description":"They are done when a toothpick poked into the center comes out clean."
        },
        {
          "headline":"Let the muffins cool before serving them.",
          "description":"Let them cool on a wire rack for 15 minutes in the pan first. Then, run a butter knife around the muffins, and gently pull them out of the tin. Let the muffins finish cooling on the rack."
        }
      ]
    },
    {
      "name":"Making Apple Cinnamon Muffins",
      "steps":[
        {
          "headline":"Preheat your oven to 375°F (190°C) and lightly grease a 12-cup muffin tin.",
          "description":"If you'd like, you can lightly dust each cup with flour, but be sure to shake out any excess flour afterwards."
        },
        {
          "headline":"Prepare the floured cinnamon apples.",
          "description":"In a large bowl, mix together 2 cups (253 grams) of peeled, cored, and diced apples, with 2 teaspoons of all-purpose flour and ½ teaspoon of ground cinnamon. Set the mixture aside when you are done."
        },
        {
          "headline":"Mix together the flour, baking powder, salt, and cinnamon in a medium-sized bowl.",
          "description":"Sift the 2 cups of all-purpose flour into the bowl first to break up any clumps, then add the baking powder, salt, and cinnamon. Stir everything together until all the ingredients are well-combined. When you are done, set the flour mixture aside."
        },
        {
          "headline":"Cream the butter and sugar in a separate bowl.",
          "description":"Cut the butter into small cubes first, then add it into a bowl with the sugar. Beat the butter and sugar together using a hand-held mixer or a stand mixer for about 3 minutes. If you do not own an electric mixer, you can use a food processor instead."
        },
        {
          "headline":"Stir the eggs into the butter mixture, one egg at a time, then add the vanilla extract.",
          "description":"Beat the butter mixture well after each egg that you add. Once you have the eggs added in, stir in the vanilla extract. Be sure to blend the mixture well; you do not want to see any streaks of egg yolk."
        },
        {
          "headline":"Alternate between adding the flour mixture and the milk.",
          "description":"Fold in half of the flour mixture first, then add half of the milk. Stir everything together with a rubber spatula, then repeat with the rest of the flour mixture and milk."
        },
        {
          "headline":"Fold in the floured cinnamon apples with a rubber spatula.",
          "description":"Be sure to scrape the bottom of the bowl often, so that everything blends together evenly."
        },
        {
          "headline":"Fill the muffin cups ⅔ to ¾ of the way with the batter.",
          "description":"A simple way to do this would be with an ice cream scoop. This will ensure that each cup gets the same amount of batter."
        },
        {
          "headline":"Bake the muffins for 20 to 25 minutes.",
          "description":"They are ready when a toothpick poked into the center of a muffin comes out clean. If the muffins are underdone, bake them for another 5 minutes."
        },
        {
          "headline":"Let the muffins cool while you prepare the butter and cinnamon topping.",
          "description":"Melt ½ cup (115 grams) of butter and pour it into a bowl deep enough to dip a muffin into. In a separate bowl, stir together the ¼ cup (55 grams) of granulated sugar with ¼ cup (30 grams) of ground cinnamon. Set the bowls down side-by-side on the counter."
        },
        {
          "headline":"Take the muffins out of the tin, then dip them into the butter and cinnamon-sugar.",
          "description":"After the muffins have cooled for about 10 minutes, take all of the muffins out of the tin. Then, working one muffin at a time, dip the top of the muffin into the melted butter, then quickly dip it into the cinnamon sugar. Hold the muffin by the bottom, and rotate it slightly as you dip it into the butter and cinnamon-sugar. This way, you can ensure that the entire top of the muffin gets evenly coated."
        },
        {
          "headline":"Set the muffins down onto a plate or wire cooling rack so that they can finish cooling off.",
          "description":"They are ready to eat once the butter sets, and the cinnamon sugar hardens into a crust-like topping."
        },
        {
          "headline":"Finished.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Basic Apple Muffins Preheat your oven to 375°F (190°C) and lightly grease a 12-cup muffin tin.  Mix together the flour, baking powder, baking soda, and salt in a medium-sized mixing bowl. Sift the flour first, to get rid of any clumps, then stir in the baking powder, baking soda, and salt. You can do this using a wooden spoon or a rubber spatula. For a more flavorful apple muffin, add 1 teaspoon of ground cinnamon and ½ teaspoon of ground nutmeg. Cream the butter and sugar in a separate bowl. Cut the butter into small cubes first, then add it into the bowl. Pour in the sugar, and beat it together with the butter. You can do this using a hand-held beater, a stand mixer, or even a food processor. For a tasty twist, use ½ cup (115 grams) of white sugar and ½ cup (100 grams) of brown sugar. Whisk in the eggs, one by one, then stir in the vanilla extract. Add the eggs, one at a time, into the butter mixture; whisk the mixture well after each egg you add. Once you can't see any more streaks of egg yolk, add the vanilla extract. If you added ground cinnamon and ground nutmeg, you might want to reduce the vanilla extract to just 1 teaspoon, otherwise the flavors might overpower the flavor of the apples. Gently fold in the apples. If you have not done so already, peel, core, and chop the apples, then gently fold them into the butter mixture with a rubber spatula. Be sure to scrape the bottom of the bowl from time to time to ensure that everything mixes in evenly. If you want the apples to distribute more evenly throughout the batter, use 1 cup (120 grams) of shredded apples, and ½ cup (60 grams) of chopped apples. Gently fold in the flour mixture a little bit at a time. Using your rubber spatula, fold in half of the flour mixture until it is completely blended in. Fold in the rest of the flour mixture, making sure to scrape the bottom of the bowl often. Fill the muffin cups ⅔ to ¾ of the way with batter. A great way to do this would be with an ice cream scoop—this way, each cup gets an equal amount of batter. Consider making a strudel topping for the muffins. While not completely necessary for this recipe, a strudel topping and really take your apple muffins to the next level. Here is how you do it:\nMix ⅓ cup (65 grams) of brown sugar with 1 tablespoon (7.5 grams) of all-purpose flour and ⅛ teaspoon of ground cinnamon. Cut in 1 tablespoon (15 grams) of butter until you get a mixture that resembles coarse crumbs. Sprinkle the mixture over the muffins. Bake the muffins for 20 to 25 minutes. They are ready when a toothpick poked into the middle comes out clean. Let the muffins cool for 10 to 15 minutes before taking them out of the tin. After that, you can serve them warm with some butter or cream, or allow them to finish cooling on a wire cooling rack. Making Wholesome Apple Muffins Preheat your oven to 400°F (205°C), and lightly grease a 12-hole muffin tin with cooking spray.  Combine the pecans, 2 tablespoons (25 grams) of brown sugar, and cinnamon in a small bowl. Save the remaining ¾ cup (150 grams) of brown sugar for later. Whisk together the flours, baking soda, and salt in a medium-sized bowl. Set the flour mixture aside when you are done. You will be adding this into your wet ingredients later on. Having all of the flours mixed in together first will give you more consistent muffins. Whisk together the oil and the rest of the brown sugar in a large bowl. Keep whisking until the oil and sugar are evenly combined. If you can't find any canola oil, you can use another flavorless cooking oil, such as vegetable oil. Add the eggs one at a time into the oil mixture. Stir the mixture well with a whisk after each egg that you add. Keep whisking until the yolks break, and there are no more streaks. Stir the applesauce and vanilla extract into the oil mixture with a whisk. Make sure that you are using plain, unsweetened applesauce. If you used the flavored kind, your apple muffins may turn out too sweet! Alternate between stirring in the flour mixture and the buttermilk mixture. Whisk in half of the flour mixture, then half of the buttermilk. Whisk in the rest of the flour mixture, and then the rest of the buttermilk. This will prevent things from clumping up too much. Gently fold in the apple chunks. If you have not yet done so, peel, core, and cut the apple into ¼-inch (0.64-centimeter) chunks. Gently fold them into the batter using a rubber spatula. Be sure to scrape the bottom of the bowl often to ensure that the apple chunks mix in evenly. Fill each muffin cup ⅔ to ¾ of the way with batter. A quick and easy way to do this is with a large spoon or an ice cream scoop; this also ensures that each cup gets the same amount of batter. Sprinkle the pecan mixture from before on top of each muffin. When you are done, gently tap the pan a few times against your counter. This will bring any air bubbles to the surface of the muffins. Bake the muffins for 20 to 25 minutes. They are done when a toothpick poked into the center comes out clean. Let the muffins cool before serving them. Let them cool on a wire rack for 15 minutes in the pan first. Then, run a butter knife around the muffins, and gently pull them out of the tin. Let the muffins finish cooling on the rack. Making Apple Cinnamon Muffins Preheat your oven to 375°F (190°C) and lightly grease a 12-cup muffin tin. If you'd like, you can lightly dust each cup with flour, but be sure to shake out any excess flour afterwards. Prepare the floured cinnamon apples. In a large bowl, mix together 2 cups (253 grams) of peeled, cored, and diced apples, with 2 teaspoons of all-purpose flour and ½ teaspoon of ground cinnamon. Set the mixture aside when you are done. Mix together the flour, baking powder, salt, and cinnamon in a medium-sized bowl. Sift the 2 cups of all-purpose flour into the bowl first to break up any clumps, then add the baking powder, salt, and cinnamon. Stir everything together until all the ingredients are well-combined. When you are done, set the flour mixture aside. Cream the butter and sugar in a separate bowl. Cut the butter into small cubes first, then add it into a bowl with the sugar. Beat the butter and sugar together using a hand-held mixer or a stand mixer for about 3 minutes. If you do not own an electric mixer, you can use a food processor instead. Stir the eggs into the butter mixture, one egg at a time, then add the vanilla extract. Beat the butter mixture well after each egg that you add. Once you have the eggs added in, stir in the vanilla extract. Be sure to blend the mixture well; you do not want to see any streaks of egg yolk. Alternate between adding the flour mixture and the milk. Fold in half of the flour mixture first, then add half of the milk. Stir everything together with a rubber spatula, then repeat with the rest of the flour mixture and milk. Fold in the floured cinnamon apples with a rubber spatula. Be sure to scrape the bottom of the bowl often, so that everything blends together evenly. Fill the muffin cups ⅔ to ¾ of the way with the batter. A simple way to do this would be with an ice cream scoop. This will ensure that each cup gets the same amount of batter. Bake the muffins for 20 to 25 minutes. They are ready when a toothpick poked into the center of a muffin comes out clean. If the muffins are underdone, bake them for another 5 minutes. Let the muffins cool while you prepare the butter and cinnamon topping. Melt ½ cup (115 grams) of butter and pour it into a bowl deep enough to dip a muffin into. In a separate bowl, stir together the ¼ cup (55 grams) of granulated sugar with ¼ cup (30 grams) of ground cinnamon. Set the bowls down side-by-side on the counter. Take the muffins out of the tin, then dip them into the butter and cinnamon-sugar. After the muffins have cooled for about 10 minutes, take all of the muffins out of the tin. Then, working one muffin at a time, dip the top of the muffin into the melted butter, then quickly dip it into the cinnamon sugar. Hold the muffin by the bottom, and rotate it slightly as you dip it into the butter and cinnamon-sugar. This way, you can ensure that the entire top of the muffin gets evenly coated. Set the muffins down onto a plate or wire cooling rack so that they can finish cooling off. They are ready to eat once the butter sets, and the cinnamon sugar hardens into a crust-like topping. Finished.  Finished. ",
  "sentences":[
    " Making Basic Apple Muffins Preheat your oven to 375°F (190°C) and lightly grease a 12-cup muffin tin.",
    "Mix together the flour, baking powder, baking soda, and salt in a medium-sized mixing bowl.",
    "Sift the flour first, to get rid of any clumps, then stir in the baking powder, baking soda, and salt.",
    "You can do this using a wooden spoon or a rubber spatula.",
    "For a more flavorful apple muffin, add 1 teaspoon of ground cinnamon and ½ teaspoon of ground nutmeg.",
    "Cream the butter and sugar in a separate bowl.",
    "Cut the butter into small cubes first, then add it into the bowl.",
    "Pour in the sugar, and beat it together with the butter.",
    "You can do this using a hand-held beater, a stand mixer, or even a food processor.",
    "For a tasty twist, use ½ cup (115 grams) of white sugar and ½ cup (100 grams) of brown sugar.",
    "Whisk in the eggs, one by one, then stir in the vanilla extract.",
    "Add the eggs, one at a time, into the butter mixture; whisk the mixture well after each egg you add.",
    "Once you can't see any more streaks of egg yolk, add the vanilla extract.",
    "If you added ground cinnamon and ground nutmeg, you might want to reduce the vanilla extract to just 1 teaspoon, otherwise the flavors might overpower the flavor of the apples.",
    "Gently fold in the apples.",
    "If you have not done so already, peel, core, and chop the apples, then gently fold them into the butter mixture with a rubber spatula.",
    "Be sure to scrape the bottom of the bowl from time to time to ensure that everything mixes in evenly.",
    "If you want the apples to distribute more evenly throughout the batter, use 1 cup (120 grams) of shredded apples, and ½ cup (60 grams) of chopped apples.",
    "Gently fold in the flour mixture a little bit at a time.",
    "Using your rubber spatula, fold in half of the flour mixture until it is completely blended in.",
    "Fold in the rest of the flour mixture, making sure to scrape the bottom of the bowl often.",
    "Fill the muffin cups ⅔ to ¾ of the way with batter.",
    "A great way to do this would be with an ice cream scoop—this way, each cup gets an equal amount of batter.",
    "Consider making a strudel topping for the muffins.",
    "While not completely necessary for this recipe, a strudel topping and really take your apple muffins to the next level.",
    "Here is how you do it:\nMix ⅓ cup (65 grams) of brown sugar with 1 tablespoon (7.5 grams) of all-purpose flour and ⅛ teaspoon of ground cinnamon.",
    "Cut in 1 tablespoon (15 grams) of butter until you get a mixture that resembles coarse crumbs.",
    "Sprinkle the mixture over the muffins.",
    "Bake the muffins for 20 to 25 minutes.",
    "They are ready when a toothpick poked into the middle comes out clean.",
    "Let the muffins cool for 10 to 15 minutes before taking them out of the tin.",
    "After that, you can serve them warm with some butter or cream, or allow them to finish cooling on a wire cooling rack.",
    "Making Wholesome Apple Muffins Preheat your oven to 400°F (205°C), and lightly grease a 12-hole muffin tin with cooking spray.",
    "Combine the pecans, 2 tablespoons (25 grams) of brown sugar, and cinnamon in a small bowl.",
    "Save the remaining ¾ cup (150 grams) of brown sugar for later.",
    "Whisk together the flours, baking soda, and salt in a medium-sized bowl.",
    "Set the flour mixture aside when you are done.",
    "You will be adding this into your wet ingredients later on.",
    "Having all of the flours mixed in together first will give you more consistent muffins.",
    "Whisk together the oil and the rest of the brown sugar in a large bowl.",
    "Keep whisking until the oil and sugar are evenly combined.",
    "If you can't find any canola oil, you can use another flavorless cooking oil, such as vegetable oil.",
    "Add the eggs one at a time into the oil mixture.",
    "Stir the mixture well with a whisk after each egg that you add.",
    "Keep whisking until the yolks break, and there are no more streaks.",
    "Stir the applesauce and vanilla extract into the oil mixture with a whisk.",
    "Make sure that you are using plain, unsweetened applesauce.",
    "If you used the flavored kind, your apple muffins may turn out too sweet!",
    "Alternate between stirring in the flour mixture and the buttermilk mixture.",
    "Whisk in half of the flour mixture, then half of the buttermilk.",
    "Whisk in the rest of the flour mixture, and then the rest of the buttermilk.",
    "This will prevent things from clumping up too much.",
    "Gently fold in the apple chunks.",
    "If you have not yet done so, peel, core, and cut the apple into ¼-inch (0.64-centimeter) chunks.",
    "Gently fold them into the batter using a rubber spatula.",
    "Be sure to scrape the bottom of the bowl often to ensure that the apple chunks mix in evenly.",
    "Fill each muffin cup ⅔ to ¾ of the way with batter.",
    "A quick and easy way to do this is with a large spoon or an ice cream scoop; this also ensures that each cup gets the same amount of batter.",
    "Sprinkle the pecan mixture from before on top of each muffin.",
    "When you are done, gently tap the pan a few times against your counter.",
    "This will bring any air bubbles to the surface of the muffins.",
    "Bake the muffins for 20 to 25 minutes.",
    "They are done when a toothpick poked into the center comes out clean.",
    "Let the muffins cool before serving them.",
    "Let them cool on a wire rack for 15 minutes in the pan first.",
    "Then, run a butter knife around the muffins, and gently pull them out of the tin.",
    "Let the muffins finish cooling on the rack.",
    "Making Apple Cinnamon Muffins Preheat your oven to 375°F (190°C) and lightly grease a 12-cup muffin tin.",
    "If you'd like, you can lightly dust each cup with flour, but be sure to shake out any excess flour afterwards.",
    "Prepare the floured cinnamon apples.",
    "In a large bowl, mix together 2 cups (253 grams) of peeled, cored, and diced apples, with 2 teaspoons of all-purpose flour and ½ teaspoon of ground cinnamon.",
    "Set the mixture aside when you are done.",
    "Mix together the flour, baking powder, salt, and cinnamon in a medium-sized bowl.",
    "Sift the 2 cups of all-purpose flour into the bowl first to break up any clumps, then add the baking powder, salt, and cinnamon.",
    "Stir everything together until all the ingredients are well-combined.",
    "When you are done, set the flour mixture aside.",
    "Cream the butter and sugar in a separate bowl.",
    "Cut the butter into small cubes first, then add it into a bowl with the sugar.",
    "Beat the butter and sugar together using a hand-held mixer or a stand mixer for about 3 minutes.",
    "If you do not own an electric mixer, you can use a food processor instead.",
    "Stir the eggs into the butter mixture, one egg at a time, then add the vanilla extract.",
    "Beat the butter mixture well after each egg that you add.",
    "Once you have the eggs added in, stir in the vanilla extract.",
    "Be sure to blend the mixture well; you do not want to see any streaks of egg yolk.",
    "Alternate between adding the flour mixture and the milk.",
    "Fold in half of the flour mixture first, then add half of the milk.",
    "Stir everything together with a rubber spatula, then repeat with the rest of the flour mixture and milk.",
    "Fold in the floured cinnamon apples with a rubber spatula.",
    "Be sure to scrape the bottom of the bowl often, so that everything blends together evenly.",
    "Fill the muffin cups ⅔ to ¾ of the way with the batter.",
    "A simple way to do this would be with an ice cream scoop.",
    "This will ensure that each cup gets the same amount of batter.",
    "Bake the muffins for 20 to 25 minutes.",
    "They are ready when a toothpick poked into the center of a muffin comes out clean.",
    "If the muffins are underdone, bake them for another 5 minutes.",
    "Let the muffins cool while you prepare the butter and cinnamon topping.",
    "Melt ½ cup (115 grams) of butter and pour it into a bowl deep enough to dip a muffin into.",
    "In a separate bowl, stir together the ¼ cup (55 grams) of granulated sugar with ¼ cup (30 grams) of ground cinnamon.",
    "Set the bowls down side-by-side on the counter.",
    "Take the muffins out of the tin, then dip them into the butter and cinnamon-sugar.",
    "After the muffins have cooled for about 10 minutes, take all of the muffins out of the tin.",
    "Then, working one muffin at a time, dip the top of the muffin into the melted butter, then quickly dip it into the cinnamon sugar.",
    "Hold the muffin by the bottom, and rotate it slightly as you dip it into the butter and cinnamon-sugar.",
    "This way, you can ensure that the entire top of the muffin gets evenly coated.",
    "Set the muffins down onto a plate or wire cooling rack so that they can finish cooling off.",
    "They are ready to eat once the butter sets, and the cinnamon sugar hardens into a crust-like topping.",
    "Finished.",
    "Finished."
  ],
  "tyn_section":[
    "Basic Apple Muffins",
    "2 medium-sized mixing bowls",
    "Electric mixer",
    "Whisk",
    "Rubber spatula",
    "12-cup muffin tin",
    "Oven",
    "Wire cooling rack",
    "Wholesome Apple Muffins",
    "Small mixing bowl",
    "Medium-sized mixing bowl",
    "Large mixing bowl",
    "Apple Cinnamon Muffins",
    "3 mixing bowls",
    "2 small bowls"
  ],
  "tyn_model":[
    "butter",
    "flour",
    "bowl",
    "apples",
    "sugar",
    "cinnamon",
    "salt",
    "brown sugar",
    "eggs",
    "rubber spatula",
    "baking powder",
    "vanilla extract",
    "oil",
    "oven",
    "baking soda",
    "ground cinnamon",
    "⅔ to",
    "all-purpose flour",
    "buttermilk",
    "milk",
    "12-cup muffin tin",
    "nutmeg",
    "stand mixer",
    "food processor",
    "muffin cups",
    "ice cream",
    "medium-sized bowl",
    "whisk",
    "applesauce",
    "vanilla",
    "apple",
    "cinnamon apples",
    "cinnamon sugar",
    "medium-sized mixing bowl",
    "wooden spoon",
    "hand-held beater",
    "white sugar",
    "—this",
    "⅓ cup",
    "⅛ teaspoon",
    "cream",
    "12-hole muffin tin",
    "cooking spray",
    "pecans",
    "small bowl",
    "flours",
    "large bowl",
    "canola oil",
    "cooking oil",
    "vegetable oil",
    "large spoon",
    "pecan",
    "butter knife",
    "apple cinnamon muffins",
    "hand-held mixer",
    "electric mixer",
    "ice cream scoop",
    "granulated sugar",
    "bowls",
    "cinnamon-",
    "muffin",
    "cinnamon-sugar",
    "plate"
  ],
  "simple_metrics":{
    "r":0.4666666667,
    "p":0.1111111111,
    "f1":0.1794871795,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7333333333,
    "p":0.1746031746,
    "f1":0.2820512821
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9333333333,
    "p":0.2857142857,
    "f1":0.4375
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.1587301587,
    "f1":0.2510460251
  }
}