{
  "title":"How to Make a Frozen Margarita",
  "url":"https://www.wikihow.com/Make-a-Frozen-Margarita",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails",
    "Margaritas"
  ],
  "methods":[
    {
      "name":"Blending a Classic Frozen Margarita",
      "steps":[
        {
          "headline":"Pick a blender that is able to crush ice.",
          "description":"Using a blender that can’t crush ice could damage or even ruin the blades. Look for one that is high-powered, with at least 300 watts of blending power, and that has stainless steel blades. If you already have a blender but aren’t sure if it's safe to use with ice, check the owner manual first."
        },
        {
          "headline":"Add ice, tequila, lime juice, and orange liqueur to the blender.",
          "description":"Pour in 1 cup (217 g) of ice cubes, ⁄4 cup (59 ml) of tequila, ⁄8 cup (30 ml) of lime juice, and 1.5 tablespoons (22 ml) of orange liqueur. You can use any type of orange liqueur, like triple sec, Cointreau, or Grand Marnier. Choose whatever type or brand of tequila you prefer, too. If you don't have lime juice, you can substitute frozen limeade concentrate for it.Tip: For a sweeter margarita, add ⁄2 teaspoon (2.5 ml) of agave nectar."
        },
        {
          "headline":"Blend the ingredients together until smooth.",
          "description":"Use your blender’s highest setting, which is usually labeled “smoothie,” to puree the mixture. Stop every 30 seconds and stir it with a spoon to make sure the ice isn’t getting stuck in the blades. Continue blending for 2 to 3 minutes until there are no chunks left in the mixture. You can also use the “crush” or “liquefy” setting on your blender. Don’t over-blend the margarita mix to the point where it’s completely liquid. Stop before it gets to that point so you keep the crunchy, icy texture."
        },
        {
          "headline":"Wet the rim of a margarita glass with a lime slice, then dip the rim in salt.",
          "description":"Take the cut side of a fresh lime wedge and run it around the rim of the glass, slightly squeezing the lime while you do so to . Sprinkle some margarita or kosher salt onto a plate and set the glass, with the rim facing down, into the salt. Lightly tap off any excess before flipping the glass rightside up. Use enough pressure when rubbing with the lime so that the rim is moist, but not dripping.Tip: For extra tartness, mix a little bit of lime zest into the salt before dipping the glass."
        },
        {
          "headline":"Pour the margarita mixture into the glass and garnish it with a lime slice.",
          "description":"After you’ve salted the rim, fill the glass with your mixture, pouring it carefully into the center so you don’t mess up the salt. Add a fresh lime wedge onto the rim before drinking the margarita. To cut a lime wedge, first cut the lime in half lengthwise. Take one half and place the flat side down, then cut the lime at an angle to form a wedge."
        }
      ]
    },
    {
      "name":"Making Variations on the Classic Frozen Margarita",
      "steps":[
        {
          "headline":"Swap pureed strawberries for lime juice to make a strawberry frozen margarita.",
          "description":"Instead of lime juice, use ⁄8 cup (30 ml) of fresh or frozen strawberry puree. Blend it with 1 cup (217 g) of ice cubes, ⁄4 cup (59 ml) of tequila, and 1.5 tablespoons (22 ml) of orange liqueur. Make strawberry puree by placing strawberries in a food processor and processing them until smooth."
        },
        {
          "headline":"Opt for sparkling water and orange juice if you want a virgin frozen margarita.",
          "description":"For kids or adults who don’t want an alcoholic beverage, substitute plain sparkling water for the tequila. Then, instead of orange liqueur, pour in orange juice. Blend it all together with ice and frozen limeade concentrate. Keep in mind that without alcohol, the frozen margarita will melt faster. Did you know? You can also use lemon-lime soda instead of sparkling water for a more flavorful virgin frozen margarita."
        },
        {
          "headline":"Use pre-made margarita mix if you want an easier option.",
          "description":"Store bought mixes come in all different flavors, from mango to pineapple, and usually only require you to add tequila and ice. Follow the instructions on the back of the bottle for making frozen margaritas with that specific type and brand. You can find pre-made margarita mixes at a liquor store, grocery store, or online retailer."
        },
        {
          "headline":"Layer different flavored margaritas in a glass for a pretty party drink.",
          "description":"Blend 2 to 3 different types of frozen margaritas, like strawberry, lime, and mango, for example. Then, fill a margarita glass 1/3 of the way with 1 flavor, like strawberry, then another 1/3 of the way with the second flavor, like lime. Top the final 1/3 off with the last flavor, like mango. The result is a colorful cocktail that looks as good as it tastes! Try to pick flavors with different colors so the layers stand out. For example, lime is a pale neon green, strawberry is red, and mango is bright orange. Be careful not to stir the margarita after you pour it. Drink it immediately, too, because the colors will start to blend once it begins melting."
        }
      ]
    }
  ],
  "text":" Blending a Classic Frozen Margarita Pick a blender that is able to crush ice. Using a blender that can’t crush ice could damage or even ruin the blades. Look for one that is high-powered, with at least 300 watts of blending power, and that has stainless steel blades. If you already have a blender but aren’t sure if it's safe to use with ice, check the owner manual first. Add ice, tequila, lime juice, and orange liqueur to the blender. Pour in 1 cup (217 g) of ice cubes, ⁄4 cup (59 ml) of tequila, ⁄8 cup (30 ml) of lime juice, and 1.5 tablespoons (22 ml) of orange liqueur. You can use any type of orange liqueur, like triple sec, Cointreau, or Grand Marnier. Choose whatever type or brand of tequila you prefer, too. If you don't have lime juice, you can substitute frozen limeade concentrate for it.Tip: For a sweeter margarita, add ⁄2 teaspoon (2.5 ml) of agave nectar. Blend the ingredients together until smooth. Use your blender’s highest setting, which is usually labeled “smoothie,” to puree the mixture. Stop every 30 seconds and stir it with a spoon to make sure the ice isn’t getting stuck in the blades. Continue blending for 2 to 3 minutes until there are no chunks left in the mixture. You can also use the “crush” or “liquefy” setting on your blender. Don’t over-blend the margarita mix to the point where it’s completely liquid. Stop before it gets to that point so you keep the crunchy, icy texture. Wet the rim of a margarita glass with a lime slice, then dip the rim in salt. Take the cut side of a fresh lime wedge and run it around the rim of the glass, slightly squeezing the lime while you do so to . Sprinkle some margarita or kosher salt onto a plate and set the glass, with the rim facing down, into the salt. Lightly tap off any excess before flipping the glass rightside up. Use enough pressure when rubbing with the lime so that the rim is moist, but not dripping.Tip: For extra tartness, mix a little bit of lime zest into the salt before dipping the glass. Pour the margarita mixture into the glass and garnish it with a lime slice. After you’ve salted the rim, fill the glass with your mixture, pouring it carefully into the center so you don’t mess up the salt. Add a fresh lime wedge onto the rim before drinking the margarita. To cut a lime wedge, first cut the lime in half lengthwise. Take one half and place the flat side down, then cut the lime at an angle to form a wedge. Making Variations on the Classic Frozen Margarita Swap pureed strawberries for lime juice to make a strawberry frozen margarita. Instead of lime juice, use ⁄8 cup (30 ml) of fresh or frozen strawberry puree. Blend it with 1 cup (217 g) of ice cubes, ⁄4 cup (59 ml) of tequila, and 1.5 tablespoons (22 ml) of orange liqueur. Make strawberry puree by placing strawberries in a food processor and processing them until smooth. Opt for sparkling water and orange juice if you want a virgin frozen margarita. For kids or adults who don’t want an alcoholic beverage, substitute plain sparkling water for the tequila. Then, instead of orange liqueur, pour in orange juice. Blend it all together with ice and frozen limeade concentrate. Keep in mind that without alcohol, the frozen margarita will melt faster. Did you know? You can also use lemon-lime soda instead of sparkling water for a more flavorful virgin frozen margarita. Use pre-made margarita mix if you want an easier option. Store bought mixes come in all different flavors, from mango to pineapple, and usually only require you to add tequila and ice. Follow the instructions on the back of the bottle for making frozen margaritas with that specific type and brand. You can find pre-made margarita mixes at a liquor store, grocery store, or online retailer. Layer different flavored margaritas in a glass for a pretty party drink. Blend 2 to 3 different types of frozen margaritas, like strawberry, lime, and mango, for example. Then, fill a margarita glass 1/3 of the way with 1 flavor, like strawberry, then another 1/3 of the way with the second flavor, like lime. Top the final 1/3 off with the last flavor, like mango. The result is a colorful cocktail that looks as good as it tastes! Try to pick flavors with different colors so the layers stand out. For example, lime is a pale neon green, strawberry is red, and mango is bright orange. Be careful not to stir the margarita after you pour it. Drink it immediately, too, because the colors will start to blend once it begins melting.",
  "sentences":[
    " Blending a Classic Frozen Margarita Pick a blender that is able to crush ice.",
    "Using a blender that can’t crush ice could damage or even ruin the blades.",
    "Look for one that is high-powered, with at least 300 watts of blending power, and that has stainless steel blades.",
    "If you already have a blender but aren’t sure if it's safe to use with ice, check the owner manual first.",
    "Add ice, tequila, lime juice, and orange liqueur to the blender.",
    "Pour in 1 cup (217 g) of ice cubes, ⁄4 cup (59 ml) of tequila, ⁄8 cup (30 ml) of lime juice, and 1.5 tablespoons (22 ml) of orange liqueur.",
    "You can use any type of orange liqueur, like triple sec, Cointreau, or Grand Marnier.",
    "Choose whatever type or brand of tequila you prefer, too.",
    "If you don't have lime juice, you can substitute frozen limeade concentrate for it.Tip: For a sweeter margarita, add ⁄2 teaspoon (2.5 ml) of agave nectar.",
    "Blend the ingredients together until smooth.",
    "Use your blender’s highest setting, which is usually labeled “smoothie,” to puree the mixture.",
    "Stop every 30 seconds and stir it with a spoon to make sure the ice isn’t getting stuck in the blades.",
    "Continue blending for 2 to 3 minutes until there are no chunks left in the mixture.",
    "You can also use the “crush” or “liquefy” setting on your blender.",
    "Don’t over-blend the margarita mix to the point where it’s completely liquid.",
    "Stop before it gets to that point so you keep the crunchy, icy texture.",
    "Wet the rim of a margarita glass with a lime slice, then dip the rim in salt.",
    "Take the cut side of a fresh lime wedge and run it around the rim of the glass, slightly squeezing the lime while you do so to .",
    "Sprinkle some margarita or kosher salt onto a plate and set the glass, with the rim facing down, into the salt.",
    "Lightly tap off any excess before flipping the glass rightside up.",
    "Use enough pressure when rubbing with the lime so that the rim is moist, but not dripping.Tip: For extra tartness, mix a little bit of lime zest into the salt before dipping the glass.",
    "Pour the margarita mixture into the glass and garnish it with a lime slice.",
    "After you’ve salted the rim, fill the glass with your mixture, pouring it carefully into the center so you don’t mess up the salt.",
    "Add a fresh lime wedge onto the rim before drinking the margarita.",
    "To cut a lime wedge, first cut the lime in half lengthwise.",
    "Take one half and place the flat side down, then cut the lime at an angle to form a wedge.",
    "Making Variations on the Classic Frozen Margarita Swap pureed strawberries for lime juice to make a strawberry frozen margarita.",
    "Instead of lime juice, use ⁄8 cup (30 ml) of fresh or frozen strawberry puree.",
    "Blend it with 1 cup (217 g) of ice cubes, ⁄4 cup (59 ml) of tequila, and 1.5 tablespoons (22 ml) of orange liqueur.",
    "Make strawberry puree by placing strawberries in a food processor and processing them until smooth.",
    "Opt for sparkling water and orange juice if you want a virgin frozen margarita.",
    "For kids or adults who don’t want an alcoholic beverage, substitute plain sparkling water for the tequila.",
    "Then, instead of orange liqueur, pour in orange juice.",
    "Blend it all together with ice and frozen limeade concentrate.",
    "Keep in mind that without alcohol, the frozen margarita will melt faster.",
    "Did you know?",
    "You can also use lemon-lime soda instead of sparkling water for a more flavorful virgin frozen margarita.",
    "Use pre-made margarita mix if you want an easier option.",
    "Store bought mixes come in all different flavors, from mango to pineapple, and usually only require you to add tequila and ice.",
    "Follow the instructions on the back of the bottle for making frozen margaritas with that specific type and brand.",
    "You can find pre-made margarita mixes at a liquor store, grocery store, or online retailer.",
    "Layer different flavored margaritas in a glass for a pretty party drink.",
    "Blend 2 to 3 different types of frozen margaritas, like strawberry, lime, and mango, for example.",
    "Then, fill a margarita glass 1/3 of the way with 1 flavor, like strawberry, then another 1/3 of the way with the second flavor, like lime.",
    "Top the final 1/3 off with the last flavor, like mango.",
    "The result is a colorful cocktail that looks as good as it tastes!",
    "Try to pick flavors with different colors so the layers stand out.",
    "For example, lime is a pale neon green, strawberry is red, and mango is bright orange.",
    "Be careful not to stir the margarita after you pour it.",
    "Drink it immediately, too, because the colors will start to blend once it begins melting."
  ],
  "tyn_section":[
    "Classic Frozen Margarita",
    "Blender",
    "Spoon",
    "Airtight container",
    "Margarita glasses"
  ],
  "tyn_model":[
    "blender",
    "tequila",
    "ice",
    "lime juice",
    "orange liqueur",
    "lime",
    "salt",
    "glass",
    "margarita",
    "sparkling water",
    "ice cubes",
    "margarita mix",
    "margarita glass",
    "lime slice",
    "strawberries",
    "strawberry puree",
    "orange juice",
    "mango",
    "strawberry",
    "triple sec",
    "cointreau,",
    "grand marnier.",
    "limeade concentrate",
    "agave nectar",
    "“smoothie",
    "” to",
    "spoon",
    "“crush",
    "” or",
    "“liquefy",
    "” setting",
    "margarita or",
    "kosher salt",
    "plate",
    "lime zest",
    "lime wedge",
    "strawberry frozen margarita",
    "food processor",
    "frozen margarita",
    "frozen limeade concentrate",
    "lemon-lime soda",
    "margaritas",
    "frozen margaritas"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.0465116279,
    "f1":0.0833333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.1162790698,
    "f1":0.2030456853
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.1860465116,
    "f1":0.3018867925
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.0697674419,
    "f1":0.125
  }
}