{
  "title":"How to Get Diamonds on Hay Day",
  "url":"https://www.wikihow.com/Get-Diamonds-on-Hay-Day",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games"
  ],
  "parts":[
    {
      "name":"Game activities",
      "steps":[
        {
          "headline":"Complete tasks set from the farmhouse.",
          "description":"Click on the farmhouse to see all the tasks set; once you have made an achievement, you will win the amount of diamonds set for each level of that achievement until the achievement is exhausted."
        },
        {
          "headline":"Mine for diamonds.",
          "description":"At level 24, you'll get access to the mine. The mine allows you to dig for or use explosives to get minerals to make the metal bars needed to make jewellery. Occasionally, this will also release some diamonds, so try to mine frequently. Watch out! If you're playing without paying, your store of shovels and explosives can soon run down, so avoid selling these if at all possible, as you'll need them for your own use."
        },
        {
          "headline":"Spin the Wheel of Fortune.",
          "description":"Sometimes it will land on a diamond."
        }
      ]
    },
    {
      "name":"Lucky sources",
      "steps":[
        {
          "headline":"Wait for gifts.",
          "description":"Occasionally the game makers will gift you a few diamonds for a special occasion. This can occur during seasonal events or an internal event. The amount of diamonds retrieved in this manner can occur anywhere from 1 to 5 diamonds. Look for the gift box, usually placed near the farmhouse by the postie."
        },
        {
          "headline":"Wait for server errors.",
          "description":"When the server goes offline and players can't play, there will sometimes be an apology gift from the game makers, consisting of diamonds. Again, look for the gift box, usually placed near the farmhouse by the postie."
        },
        {
          "headline":"Find diamonds randomly.",
          "description":"Clicking on prize boxes, clicking on the red metal work box both on your own farm and on others' farms can sometimes result in gaining a diamond or more."
        }
      ]
    },
    {
      "name":"External sources of diamonds",
      "steps":[
        {
          "headline":"Follow Hay Day on Facebook.",
          "description":"This will get you one diamond. And if you log in to Hay Day using Facebook, you'll get five diamonds. If you don't use or want to use Facebook, this step is optional. If you like competitions, Supercell (the game makers) sometimes runs them from Facebook and prizes may include diamonds."
        },
        {
          "headline":"Level up.",
          "description":"At the start, leveling up isn't too hard as the amount of experience points needed isn't too high. However, as you start moving up the levels, the amount of experience points gets a lot higher and so gaining the diamonds by leveling up will be a very slow process and you don't get very many this way."
        },
        {
          "headline":"Watch the movie.",
          "description":"Find the pink movie ticket and click on it (it is just by where the newspaper is.) You will be taken to the \"movies\", either an advertisement for similar games or sometimes a movie short. Watch the short, then close the box on its X indicator. Then accept the reward, which includes both experience points and a diamond. If you're lucky, you'll get quite a run of these, which can soon add up. A recent change allows you to choose to watch a set of movies in a row, with a slight chance of getting a diamond or a bigger chance of getting something else."
        }
      ]
    }
  ],
  "text":" Game activities Complete tasks set from the farmhouse. Click on the farmhouse to see all the tasks set; once you have made an achievement, you will win the amount of diamonds set for each level of that achievement until the achievement is exhausted. Mine for diamonds. At level 24, you'll get access to the mine. The mine allows you to dig for or use explosives to get minerals to make the metal bars needed to make jewellery. Occasionally, this will also release some diamonds, so try to mine frequently. Watch out! If you're playing without paying, your store of shovels and explosives can soon run down, so avoid selling these if at all possible, as you'll need them for your own use. Spin the Wheel of Fortune. Sometimes it will land on a diamond. Lucky sources Wait for gifts. Occasionally the game makers will gift you a few diamonds for a special occasion. This can occur during seasonal events or an internal event. The amount of diamonds retrieved in this manner can occur anywhere from 1 to 5 diamonds. Look for the gift box, usually placed near the farmhouse by the postie. Wait for server errors. When the server goes offline and players can't play, there will sometimes be an apology gift from the game makers, consisting of diamonds. Again, look for the gift box, usually placed near the farmhouse by the postie. Find diamonds randomly. Clicking on prize boxes, clicking on the red metal work box both on your own farm and on others' farms can sometimes result in gaining a diamond or more. External sources of diamonds Follow Hay Day on Facebook. This will get you one diamond. And if you log in to Hay Day using Facebook, you'll get five diamonds. If you don't use or want to use Facebook, this step is optional. If you like competitions, Supercell (the game makers) sometimes runs them from Facebook and prizes may include diamonds. Level up. At the start, leveling up isn't too hard as the amount of experience points needed isn't too high. However, as you start moving up the levels, the amount of experience points gets a lot higher and so gaining the diamonds by leveling up will be a very slow process and you don't get very many this way. Watch the movie. Find the pink movie ticket and click on it (it is just by where the newspaper is.) You will be taken to the \"movies\", either an advertisement for similar games or sometimes a movie short. Watch the short, then close the box on its X indicator. Then accept the reward, which includes both experience points and a diamond. If you're lucky, you'll get quite a run of these, which can soon add up. A recent change allows you to choose to watch a set of movies in a row, with a slight chance of getting a diamond or a bigger chance of getting something else.",
  "sentences":[
    " Game activities Complete tasks set from the farmhouse.",
    "Click on the farmhouse to see all the tasks set; once you have made an achievement, you will win the amount of diamonds set for each level of that achievement until the achievement is exhausted.",
    "Mine for diamonds.",
    "At level 24, you'll get access to the mine.",
    "The mine allows you to dig for or use explosives to get minerals to make the metal bars needed to make jewellery.",
    "Occasionally, this will also release some diamonds, so try to mine frequently.",
    "Watch out!",
    "If you're playing without paying, your store of shovels and explosives can soon run down, so avoid selling these if at all possible, as you'll need them for your own use.",
    "Spin the Wheel of Fortune.",
    "Sometimes it will land on a diamond.",
    "Lucky sources Wait for gifts.",
    "Occasionally the game makers will gift you a few diamonds for a special occasion.",
    "This can occur during seasonal events or an internal event.",
    "The amount of diamonds retrieved in this manner can occur anywhere from 1 to 5 diamonds.",
    "Look for the gift box, usually placed near the farmhouse by the postie.",
    "Wait for server errors.",
    "When the server goes offline and players can't play, there will sometimes be an apology gift from the game makers, consisting of diamonds.",
    "Again, look for the gift box, usually placed near the farmhouse by the postie.",
    "Find diamonds randomly.",
    "Clicking on prize boxes, clicking on the red metal work box both on your own farm and on others' farms can sometimes result in gaining a diamond or more.",
    "External sources of diamonds Follow Hay Day on Facebook.",
    "This will get you one diamond.",
    "And if you log in to Hay Day using Facebook, you'll get five diamonds.",
    "If you don't use or want to use Facebook, this step is optional.",
    "If you like competitions, Supercell (the game makers) sometimes runs them from Facebook and prizes may include diamonds.",
    "Level up.",
    "At the start, leveling up isn't too hard as the amount of experience points needed isn't too high.",
    "However, as you start moving up the levels, the amount of experience points gets a lot higher and so gaining the diamonds by leveling up will be a very slow process and you don't get very many this way.",
    "Watch the movie.",
    "Find the pink movie ticket and click on it (it is just by where the newspaper is.)",
    "You will be taken to the \"movies\", either an advertisement for similar games or sometimes a movie short.",
    "Watch the short, then close the box on its X indicator.",
    "Then accept the reward, which includes both experience points and a diamond.",
    "If you're lucky, you'll get quite a run of these, which can soon add up.",
    "A recent change allows you to choose to watch a set of movies in a row, with a slight chance of getting a diamond or a bigger chance of getting something else."
  ],
  "tyn_section":[
    "Hay Day app"
  ],
  "tyn_model":[
    "diamonds",
    "diamond",
    "explosives",
    "minerals",
    "shovels",
    "newspaper",
    "movies"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}