{
  "title":"How to Compost Leaves",
  "url":"https://www.wikihow.com/Compost-Leaves",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Compost Mulch and Soil Preparation"
  ],
  "parts":[
    {
      "name":"Making a Compost Pile",
      "steps":[
        {
          "headline":"Gather leaves into a pile that’s at least 4 ft (1.2 m) by 3 ft (0.91 m).",
          "description":"Depending upon the size of the compost pile that you’re planning to create, you’ll need a large amount of leaves. As leaves decay, they tend to break down and shrink in size, so an amount of leaves that looks huge at first may end up losing half its size over 6 months. If you rake together a leaf pile that’s much smaller than 4 feet (1.2 m) across and 3 feet (0.91 m) tall, it won’t generate sufficient heat internally to kill off weeds and disease-causing organisms."
        },
        {
          "headline":"Include maple, poplar, and willow leaves if you have access to them.",
          "description":"These types of leaves are ideal to use in a compost pile. They have high calcium and nitrogen contents and will break down in less than 1 year. While you can make compost from any types of leaves, these varieties will break down the most quickly and yield the most nutrients for your compost. Other types of leaves that are great to use in a compost pile include:\nAsh\nCherry\nElm\nLinden"
        },
        {
          "headline":"Limit the amount of low-calcium leaves in your compost pile.",
          "description":"Leaves that have relatively little calcium (and other healthy minerals) can take as long as 2 years to break down, making them poor candidates for a compost pile. So, avoid using any thick or leathery leaves in your compost, including holly, magnolia, oak, birch, and beech. Also avoid leaves which can inhibit the growth of other plants (e.g., hackberry leaves). Oak leaves take longer to decompose than many other types of leaves. If you find that oak leaves comprise the majority of your compost pile, shred them more thoroughly than the other types of leaves to make sure they compost well. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteve Masley\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organic Gardener\t\t\t\t\t\t\t\tSteve Masley has been designing and maintaining organic vegetable gardens in the San Francisco Bay Area for over 30 years. He is a Organic Gardening Consultant and Founder of Grow-It-Organically, a website that teaches clients and students the ins and outs of organic vegetable gardening. In 2007 and 2008, Steve taught the Local Sustainable Agriculture Field Practicum at Stanford University. Steve Masley\t\t\tProfessional Organic Gardener\t\t\t\tTry to avoid using a lot of leaves with a high wax content. Pat Browne and Steve Masley of Grow it Organically say: \"If you use waxy leaves in your compost bin, your compost will shed water, rather than retaining it. That could make it hard for the plants in your garden to get the moisture they need\""
        },
        {
          "headline":"Gather leaves from neighbors’ lawns and public parks.",
          "description":"If you only have a few types of trees on your own property, visit wooded sections of your town in late fall. You’ll find large piles of leaves that will be bagged and thrown away, so you’ll do the city a favor by taking the leaves for your compost pile. Bring 4–5 large garbage bags with you and fill as many as you can. Make sure to always ask for permission from neighbors before you start raking leaves off of their lawn. Try asking neighbors that you see raking if you can bag up leaves or take their bags of weeds. Do check with city or county park officials before you start raking leaves off of public lands. Many cities have their own composting programs and will use the leaves in the city or county compost piles."
        },
        {
          "headline":"Shred your leaves with a lawnmower to help them decay quickly.",
          "description":"Leaves can take many months to decay, which isn’t great for your compost pile. To speed up this process, run a lawnmower back and forth over the leaf pile to grind the leaves into tiny pieces and slivers. Just keep in mind that the more finely shredded the leaves end up, the quicker they’ll start decaying. Shredding the leaves shouldn’t take more than 15 minutes. If you’d like to speed up the process, try working with a friend or family member. Have the other person pile the leaves while the other person grinds. If you don’t have a lawnmower—or would prefer to use a faster, more efficient tool for the job—try shredding the leaves with a leaf shredder."
        },
        {
          "headline":"Mix nitrogen-rich grass clippings into your leaf compost pile.",
          "description":"If you were to let the pile of leaves decay on its own, it would take over a year. Adding in nitrogen-rich grass clippings will speed up the process. The easiest way to add grass clippings is to take bags of grass clippings from your lawnmower and add them onto the leaf pile. Mix in grass at a 1:5 ratio: 1 measure of grass for every 5 measures of leaves."
        },
        {
          "headline":"Mix in manure as a source of nitrogen if you don’t have grass clippings.",
          "description":"Although grass clippings or grass mulch are the most accessible sources of nitrogen for many people, others may not have access to grass. In this situation, the next best option is to use manure. As with the grass clippings, add manure to your leaf pile at a 1:5 ratio. So, if you have 5 wheelbarrow loads of leaves, add in 1 wheelbarrow of manure. Purchase manure at any large landscaping or gardening-supply store. Or, if you live near a livestock farm or ranch, talk to the owners. They’ll probably be more than happy to let you cart off some of their manure."
        },
        {
          "headline":"Throw kitchen scraps into your compost pile to add richness.",
          "description":"As the grass clippings and leaves decay, you can begin adding more organic material to the pile. For example, toss a handful of vegetable peels and coffee grounds into the leaf pile once a week. Make sure to mix the new organic material in with a pitchfork so it doesn’t remain on top. Avoid adding dairy products, dense breads, or meats to your compost pile."
        }
      ]
    },
    {
      "name":"Situating the Compost Bin",
      "steps":[
        {
          "headline":"Set up a chain link wire fence section that’s 3 ft (0.91 m) across.",
          "description":"The compost pile needs to be contained within a single space, and chain link wire fencing is the ideal material to use. It will let air circulate through the composting leaves and hold the leaves closely together so that they'll stay damp and compost relatively quickly. Fill the chain bin with the ground leaves and grass bits. If you don’t have access to chain link fencing material, you can also use wooden slats, like those on a shipping crate. Nail the slats together into a 3 ft × 3 ft (0.91 m × 0.91 m) square. Either material will allow oxygen to get to your compost."
        },
        {
          "headline":"Locate the compost pile on a well-draining patch of ground.",
          "description":"If the inside of the leaf compost pile stays too wet, it may turn to mush and the compost will be ruined. So, situate the compost pile on well-draining soil so that excess moisture in the compost will drain into the ground. Before deciding on a location for the pile, make sure it won’t be in an area that’s prone to developing puddles of standing water. Never locate a compost pile on concrete, cement, or asphalt."
        },
        {
          "headline":"Situate the compost pile in a shaded area to reduce moisture loss.",
          "description":"If your compost pile is exposed to direct sunlight for more than 3–4 hours a day, much-needed moisture will evaporate from the leaves and organic matter. So, locate the pile in a location that will receive partial sun to help the compost keep its moisture. For example, this could be behind a large tree or 1 wall of a backyard shed. When you first start the pile, it will be loose and prone to blowing around the yard. If high winds are a concern in your area, place the compost pile in an area where it will not blow away. Plan to cover the compost pile with a plastic tarp, if you cannot construct a container."
        }
      ]
    },
    {
      "name":"Turning and Using Your Compost",
      "steps":[
        {
          "headline":"Keep the pile moist by sprinkling it with a hose once a week.",
          "description":"During dry weather, water your compost pile with a garden hose to keep the inside moist. Avoid creating standing pools of water. The compost should be damp enough that when you can pick up a handful of compost and squeeze, only a few drops of water drip out. If you’re in the middle of a rainy spell, you may not need to water the compost pile for 3–4 weeks at a time. Check it every few days to make sure it hasn’t dried out."
        },
        {
          "headline":"Turn your compost every 2 weeks with a shovel or a pitchfork.",
          "description":"Dig the tip of the pitchfork or shovel into the bottom of the pile of compost and turn clockwise to mix the compost. Continue mixing until the whole pile has been turned through. The top layer should be buried and the leaf compost should look fresh and wet on the top. Turning the compost pile allows the leaves to decompose uniformly and keeps a good mixture of oxygen throughout the pile. The heat that forms inside the moist pile of leaves and clippings is often called “cooking.”"
        },
        {
          "headline":"Add the finished compost to your garden soil after 4 to 9 months.",
          "description":"When the material has finished composting and is ready to use, it will have a rich, earthy smell, and should feel thick and crumbly. You should no longer be able to pick out single leaves or grass blades. To use the compost, deposit a 3–4 in (7.6–10.2 cm) layer on top of the soil in your garden or flower pots. Mix the compost in to the garden topsoil with your fingers. Although compost is a great way to increase the organic content of soil, it doesn’t quite have the same nutritional value as a store-bought fertilizer."
        }
      ]
    }
  ],
  "text":" Making a Compost Pile Gather leaves into a pile that’s at least 4 ft (1.2 m) by 3 ft (0.91 m). Depending upon the size of the compost pile that you’re planning to create, you’ll need a large amount of leaves. As leaves decay, they tend to break down and shrink in size, so an amount of leaves that looks huge at first may end up losing half its size over 6 months. If you rake together a leaf pile that’s much smaller than 4 feet (1.2 m) across and 3 feet (0.91 m) tall, it won’t generate sufficient heat internally to kill off weeds and disease-causing organisms. Include maple, poplar, and willow leaves if you have access to them. These types of leaves are ideal to use in a compost pile. They have high calcium and nitrogen contents and will break down in less than 1 year. While you can make compost from any types of leaves, these varieties will break down the most quickly and yield the most nutrients for your compost. Other types of leaves that are great to use in a compost pile include:\nAsh\nCherry\nElm\nLinden Limit the amount of low-calcium leaves in your compost pile. Leaves that have relatively little calcium (and other healthy minerals) can take as long as 2 years to break down, making them poor candidates for a compost pile. So, avoid using any thick or leathery leaves in your compost, including holly, magnolia, oak, birch, and beech. Also avoid leaves which can inhibit the growth of other plants (e.g., hackberry leaves). Oak leaves take longer to decompose than many other types of leaves. If you find that oak leaves comprise the majority of your compost pile, shred them more thoroughly than the other types of leaves to make sure they compost well. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteve Masley\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organic Gardener\t\t\t\t\t\t\t\tSteve Masley has been designing and maintaining organic vegetable gardens in the San Francisco Bay Area for over 30 years. He is a Organic Gardening Consultant and Founder of Grow-It-Organically, a website that teaches clients and students the ins and outs of organic vegetable gardening. In 2007 and 2008, Steve taught the Local Sustainable Agriculture Field Practicum at Stanford University. Steve Masley\t\t\tProfessional Organic Gardener\t\t\t\tTry to avoid using a lot of leaves with a high wax content. Pat Browne and Steve Masley of Grow it Organically say: \"If you use waxy leaves in your compost bin, your compost will shed water, rather than retaining it. That could make it hard for the plants in your garden to get the moisture they need\" Gather leaves from neighbors’ lawns and public parks. If you only have a few types of trees on your own property, visit wooded sections of your town in late fall. You’ll find large piles of leaves that will be bagged and thrown away, so you’ll do the city a favor by taking the leaves for your compost pile. Bring 4–5 large garbage bags with you and fill as many as you can. Make sure to always ask for permission from neighbors before you start raking leaves off of their lawn. Try asking neighbors that you see raking if you can bag up leaves or take their bags of weeds. Do check with city or county park officials before you start raking leaves off of public lands. Many cities have their own composting programs and will use the leaves in the city or county compost piles. Shred your leaves with a lawnmower to help them decay quickly. Leaves can take many months to decay, which isn’t great for your compost pile. To speed up this process, run a lawnmower back and forth over the leaf pile to grind the leaves into tiny pieces and slivers. Just keep in mind that the more finely shredded the leaves end up, the quicker they’ll start decaying. Shredding the leaves shouldn’t take more than 15 minutes. If you’d like to speed up the process, try working with a friend or family member. Have the other person pile the leaves while the other person grinds. If you don’t have a lawnmower—or would prefer to use a faster, more efficient tool for the job—try shredding the leaves with a leaf shredder. Mix nitrogen-rich grass clippings into your leaf compost pile. If you were to let the pile of leaves decay on its own, it would take over a year. Adding in nitrogen-rich grass clippings will speed up the process. The easiest way to add grass clippings is to take bags of grass clippings from your lawnmower and add them onto the leaf pile. Mix in grass at a 1:5 ratio: 1 measure of grass for every 5 measures of leaves. Mix in manure as a source of nitrogen if you don’t have grass clippings. Although grass clippings or grass mulch are the most accessible sources of nitrogen for many people, others may not have access to grass. In this situation, the next best option is to use manure. As with the grass clippings, add manure to your leaf pile at a 1:5 ratio. So, if you have 5 wheelbarrow loads of leaves, add in 1 wheelbarrow of manure. Purchase manure at any large landscaping or gardening-supply store. Or, if you live near a livestock farm or ranch, talk to the owners. They’ll probably be more than happy to let you cart off some of their manure. Throw kitchen scraps into your compost pile to add richness. As the grass clippings and leaves decay, you can begin adding more organic material to the pile. For example, toss a handful of vegetable peels and coffee grounds into the leaf pile once a week. Make sure to mix the new organic material in with a pitchfork so it doesn’t remain on top. Avoid adding dairy products, dense breads, or meats to your compost pile. Situating the Compost Bin Set up a chain link wire fence section that’s 3 ft (0.91 m) across. The compost pile needs to be contained within a single space, and chain link wire fencing is the ideal material to use. It will let air circulate through the composting leaves and hold the leaves closely together so that they'll stay damp and compost relatively quickly. Fill the chain bin with the ground leaves and grass bits. If you don’t have access to chain link fencing material, you can also use wooden slats, like those on a shipping crate. Nail the slats together into a 3 ft × 3 ft (0.91 m × 0.91 m) square. Either material will allow oxygen to get to your compost. Locate the compost pile on a well-draining patch of ground. If the inside of the leaf compost pile stays too wet, it may turn to mush and the compost will be ruined. So, situate the compost pile on well-draining soil so that excess moisture in the compost will drain into the ground. Before deciding on a location for the pile, make sure it won’t be in an area that’s prone to developing puddles of standing water. Never locate a compost pile on concrete, cement, or asphalt. Situate the compost pile in a shaded area to reduce moisture loss. If your compost pile is exposed to direct sunlight for more than 3–4 hours a day, much-needed moisture will evaporate from the leaves and organic matter. So, locate the pile in a location that will receive partial sun to help the compost keep its moisture. For example, this could be behind a large tree or 1 wall of a backyard shed. When you first start the pile, it will be loose and prone to blowing around the yard. If high winds are a concern in your area, place the compost pile in an area where it will not blow away. Plan to cover the compost pile with a plastic tarp, if you cannot construct a container. Turning and Using Your Compost Keep the pile moist by sprinkling it with a hose once a week. During dry weather, water your compost pile with a garden hose to keep the inside moist. Avoid creating standing pools of water. The compost should be damp enough that when you can pick up a handful of compost and squeeze, only a few drops of water drip out. If you’re in the middle of a rainy spell, you may not need to water the compost pile for 3–4 weeks at a time. Check it every few days to make sure it hasn’t dried out. Turn your compost every 2 weeks with a shovel or a pitchfork. Dig the tip of the pitchfork or shovel into the bottom of the pile of compost and turn clockwise to mix the compost. Continue mixing until the whole pile has been turned through. The top layer should be buried and the leaf compost should look fresh and wet on the top. Turning the compost pile allows the leaves to decompose uniformly and keeps a good mixture of oxygen throughout the pile. The heat that forms inside the moist pile of leaves and clippings is often called “cooking.” Add the finished compost to your garden soil after 4 to 9 months. When the material has finished composting and is ready to use, it will have a rich, earthy smell, and should feel thick and crumbly. You should no longer be able to pick out single leaves or grass blades. To use the compost, deposit a 3–4 in (7.6–10.2 cm) layer on top of the soil in your garden or flower pots. Mix the compost in to the garden topsoil with your fingers. Although compost is a great way to increase the organic content of soil, it doesn’t quite have the same nutritional value as a store-bought fertilizer.",
  "sentences":[
    " Making a Compost Pile Gather leaves into a pile that’s at least 4 ft (1.2 m) by 3 ft (0.91 m).",
    "Depending upon the size of the compost pile that you’re planning to create, you’ll need a large amount of leaves.",
    "As leaves decay, they tend to break down and shrink in size, so an amount of leaves that looks huge at first may end up losing half its size over 6 months.",
    "If you rake together a leaf pile that’s much smaller than 4 feet (1.2 m) across and 3 feet (0.91 m) tall, it won’t generate sufficient heat internally to kill off weeds and disease-causing organisms.",
    "Include maple, poplar, and willow leaves if you have access to them.",
    "These types of leaves are ideal to use in a compost pile.",
    "They have high calcium and nitrogen contents and will break down in less than 1 year.",
    "While you can make compost from any types of leaves, these varieties will break down the most quickly and yield the most nutrients for your compost.",
    "Other types of leaves that are great to use in a compost pile include:\nAsh\nCherry\nElm\nLinden Limit the amount of low-calcium leaves in your compost pile.",
    "Leaves that have relatively little calcium (and other healthy minerals) can take as long as 2 years to break down, making them poor candidates for a compost pile.",
    "So, avoid using any thick or leathery leaves in your compost, including holly, magnolia, oak, birch, and beech.",
    "Also avoid leaves which can inhibit the growth of other plants (e.g., hackberry leaves).",
    "Oak leaves take longer to decompose than many other types of leaves.",
    "If you find that oak leaves comprise the majority of your compost pile, shred them more thoroughly than the other types of leaves to make sure they compost well.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSteve Masley\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organic Gardener\t\t\t\t\t\t\t\tSteve Masley has been designing and maintaining organic vegetable gardens in the San Francisco Bay Area for over 30 years.",
    "He is a Organic Gardening Consultant and Founder of Grow-It-Organically, a website that teaches clients and students the ins and outs of organic vegetable gardening.",
    "In 2007 and 2008, Steve taught the Local Sustainable Agriculture Field Practicum at Stanford University.",
    "Steve Masley\t\t\tProfessional Organic Gardener\t\t\t\tTry to avoid using a lot of leaves with a high wax content.",
    "Pat Browne and Steve Masley of Grow it Organically say: \"If you use waxy leaves in your compost bin, your compost will shed water, rather than retaining it.",
    "That could make it hard for the plants in your garden to get the moisture they need\" Gather leaves from neighbors’ lawns and public parks.",
    "If you only have a few types of trees on your own property, visit wooded sections of your town in late fall.",
    "You’ll find large piles of leaves that will be bagged and thrown away, so you’ll do the city a favor by taking the leaves for your compost pile.",
    "Bring 4–5 large garbage bags with you and fill as many as you can.",
    "Make sure to always ask for permission from neighbors before you start raking leaves off of their lawn.",
    "Try asking neighbors that you see raking if you can bag up leaves or take their bags of weeds.",
    "Do check with city or county park officials before you start raking leaves off of public lands.",
    "Many cities have their own composting programs and will use the leaves in the city or county compost piles.",
    "Shred your leaves with a lawnmower to help them decay quickly.",
    "Leaves can take many months to decay, which isn’t great for your compost pile.",
    "To speed up this process, run a lawnmower back and forth over the leaf pile to grind the leaves into tiny pieces and slivers.",
    "Just keep in mind that the more finely shredded the leaves end up, the quicker they’ll start decaying.",
    "Shredding the leaves shouldn’t take more than 15 minutes.",
    "If you’d like to speed up the process, try working with a friend or family member.",
    "Have the other person pile the leaves while the other person grinds.",
    "If you don’t have a lawnmower—or would prefer to use a faster, more efficient tool for the job—try shredding the leaves with a leaf shredder.",
    "Mix nitrogen-rich grass clippings into your leaf compost pile.",
    "If you were to let the pile of leaves decay on its own, it would take over a year.",
    "Adding in nitrogen-rich grass clippings will speed up the process.",
    "The easiest way to add grass clippings is to take bags of grass clippings from your lawnmower and add them onto the leaf pile.",
    "Mix in grass at a 1:5 ratio: 1 measure of grass for every 5 measures of leaves.",
    "Mix in manure as a source of nitrogen if you don’t have grass clippings.",
    "Although grass clippings or grass mulch are the most accessible sources of nitrogen for many people, others may not have access to grass.",
    "In this situation, the next best option is to use manure.",
    "As with the grass clippings, add manure to your leaf pile at a 1:5 ratio.",
    "So, if you have 5 wheelbarrow loads of leaves, add in 1 wheelbarrow of manure.",
    "Purchase manure at any large landscaping or gardening-supply store.",
    "Or, if you live near a livestock farm or ranch, talk to the owners.",
    "They’ll probably be more than happy to let you cart off some of their manure.",
    "Throw kitchen scraps into your compost pile to add richness.",
    "As the grass clippings and leaves decay, you can begin adding more organic material to the pile.",
    "For example, toss a handful of vegetable peels and coffee grounds into the leaf pile once a week.",
    "Make sure to mix the new organic material in with a pitchfork so it doesn’t remain on top.",
    "Avoid adding dairy products, dense breads, or meats to your compost pile.",
    "Situating the Compost Bin Set up a chain link wire fence section that’s 3 ft (0.91 m) across.",
    "The compost pile needs to be contained within a single space, and chain link wire fencing is the ideal material to use.",
    "It will let air circulate through the composting leaves and hold the leaves closely together so that they'll stay damp and compost relatively quickly.",
    "Fill the chain bin with the ground leaves and grass bits.",
    "If you don’t have access to chain link fencing material, you can also use wooden slats, like those on a shipping crate.",
    "Nail the slats together into a 3 ft × 3 ft (0.91 m × 0.91 m) square.",
    "Either material will allow oxygen to get to your compost.",
    "Locate the compost pile on a well-draining patch of ground.",
    "If the inside of the leaf compost pile stays too wet, it may turn to mush and the compost will be ruined.",
    "So, situate the compost pile on well-draining soil so that excess moisture in the compost will drain into the ground.",
    "Before deciding on a location for the pile, make sure it won’t be in an area that’s prone to developing puddles of standing water.",
    "Never locate a compost pile on concrete, cement, or asphalt.",
    "Situate the compost pile in a shaded area to reduce moisture loss.",
    "If your compost pile is exposed to direct sunlight for more than 3–4 hours a day, much-needed moisture will evaporate from the leaves and organic matter.",
    "So, locate the pile in a location that will receive partial sun to help the compost keep its moisture.",
    "For example, this could be behind a large tree or 1 wall of a backyard shed.",
    "When you first start the pile, it will be loose and prone to blowing around the yard.",
    "If high winds are a concern in your area, place the compost pile in an area where it will not blow away.",
    "Plan to cover the compost pile with a plastic tarp, if you cannot construct a container.",
    "Turning and Using Your Compost Keep the pile moist by sprinkling it with a hose once a week.",
    "During dry weather, water your compost pile with a garden hose to keep the inside moist.",
    "Avoid creating standing pools of water.",
    "The compost should be damp enough that when you can pick up a handful of compost and squeeze, only a few drops of water drip out.",
    "If you’re in the middle of a rainy spell, you may not need to water the compost pile for 3–4 weeks at a time.",
    "Check it every few days to make sure it hasn’t dried out.",
    "Turn your compost every 2 weeks with a shovel or a pitchfork.",
    "Dig the tip of the pitchfork or shovel into the bottom of the pile of compost and turn clockwise to mix the compost.",
    "Continue mixing until the whole pile has been turned through.",
    "The top layer should be buried and the leaf compost should look fresh and wet on the top.",
    "Turning the compost pile allows the leaves to decompose uniformly and keeps a good mixture of oxygen throughout the pile.",
    "The heat that forms inside the moist pile of leaves and clippings is often called “cooking.” Add the finished compost to your garden soil after 4 to 9 months.",
    "When the material has finished composting and is ready to use, it will have a rich, earthy smell, and should feel thick and crumbly.",
    "You should no longer be able to pick out single leaves or grass blades.",
    "To use the compost, deposit a 3–4 in (7.6–10.2 cm) layer on top of the soil in your garden or flower pots.",
    "Mix the compost in to the garden topsoil with your fingers.",
    "Although compost is a great way to increase the organic content of soil, it doesn’t quite have the same nutritional value as a store-bought fertilizer."
  ],
  "tyn_section":[
    "Rake",
    "Leaves",
    "Garbage bags (optional)",
    "Lawnmower",
    "Grass trimmings",
    "Manure (optional)",
    "Wire fencing",
    "Wooden slats (optional)",
    "Pitchfork",
    "Shovel (optional)"
  ],
  "tyn_model":[
    "compost",
    "compost pile",
    "manure",
    "water",
    "nitrogen",
    "grass",
    "leaves",
    "lawnmower",
    "pitchfork",
    "shovel",
    "maple",
    "poplar",
    "ash",
    "cherry",
    "linden",
    "oak",
    "birch",
    "organic gardener",
    "organic vegetable gardens",
    "organic gardening consultant",
    "organic vegetable gardening",
    "organic gardener\t\t\t\ttry",
    "compost bin",
    "’ lawns",
    "garbage bags",
    "—or",
    "—try",
    "leaf shredder",
    "nitrogen-rich grass clippings",
    "grass mulch",
    "gardening-supply store",
    "kitchen scraps",
    "vegetable peels",
    "coffee grounds",
    "chain link wire fence",
    "chain link wire fencing",
    "chain bin",
    "chain link fencing",
    "× 3",
    "× 0.91",
    "tarp",
    "hose",
    "garden hose",
    "“cooking",
    "” add",
    "fertilizer"
  ],
  "simple_metrics":{
    "r":0.3,
    "p":0.0652173913,
    "f1":0.1071428571,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.1739130435,
    "f1":0.2857142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.1956521739,
    "f1":0.3144104803
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.0869565217,
    "f1":0.1428571429
  }
}