{
  "title":"How to Dye Buttons",
  "url":"https://www.wikihow.com/Dye-Buttons",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing",
    "Sewing Tools and Supplies",
    "Buttons"
  ],
  "methods":[
    {
      "name":"Creating Your Workspace",
      "steps":[
        {
          "headline":"Protect your workspace.",
          "description":"Because you will be working with permanent dyes, you want to use something to ensure you don’t stain the floor or table. You also want to take precaution not to stain your skin or clothing. You can use a drop cloth, layers of newspaper, plastic garbage bags, or a plastic table cloth. Whichever you choose, consider taping it down to your work area so that it stays in place while you complete your project, and make sure it isn’t thin enough that the dye could seep through it. If you are working on a table, consider also laying a drop cloth on the floor underneath you, in case the dye splashes. Wear old clothes that you don’t mind getting dye on. You can also just put a large, old T-shirt or button down over the clothes you are wearing to keep them clean. When you dye your buttons, wear rubber gloves to protect your skin."
        },
        {
          "headline":"Collect your buttons.",
          "description":"You can dye buttons that are either plastic or nylon. Use buttons that are either white or a very light color for the best color payoff. Consider trying out different shapes, sizes, and styles of buttons to see which ones come out best after you dye them. This will give you options for your project. Buttons with designs carved on them make great candidates for dying, as the color varies and gives them even more dimension."
        },
        {
          "headline":"Gather your dyeing materials.",
          "description":"You will need containers to hold your dye baths, a measuring cup and measuring spoons, a stirring spoon, and dye. You should have a bowl or plastic container for each color you plan on using. Each one should be able to hold one cup of liquid. Make sure your containers can withstand hot water. You can find dye at local hobby and craft stores in sections with other fabric craft supplies. Rit is a good all-purpose brand of dye to use for dyeing your buttons. If you choose another brand, read the label to ensure you will be able to dye your plastic buttons. It’s best to use a disposable or stainless steel spoon to stir. If you choose to dye your buttons with ink, you’ll need alcohol-based ink, q-tips, and a sealer like mod podge."
        }
      ]
    },
    {
      "name":"Dying Your Buttons with All-Purpose Dye",
      "steps":[
        {
          "headline":"Pour one cup of hot water into each of your bowls.",
          "description":"The water needs to be hot enough to dissolve the dye and set the color on your buttons. It should be about 140 degrees Fahrenheit. If your hot tap water is too cool, stick the water in your bowls in the microwave for about 30 seconds."
        },
        {
          "headline":"Add the dye to your water.",
          "description":"Add only one color in each bowl. If you’re using liquid dye, add one teaspoon per cup of water. If you’re using powdered dye, add two teaspoons. To create darker hues, add more dye to your bath. Dip a small piece of white fabric or a white paper towel into your dye bath to test the color. Add more dye if it is too light for your taste or more hot water if it becomes too dark. Use your spoon to stir the dye. It should be completely dissolved in the water, and the color should be even."
        },
        {
          "headline":"Place your buttons in the dye.",
          "description":"The buttons should be completely submerged and have room to move within the container. You don’t want the buttons to touch, as this can create uneven color. Leave the buttons in the dye for two to five minutes. The longer you leave them, the darker the color will be. Check for color by using a spoon to gently lift one of the buttons out of the water. If the button is not yet the color you’d like to achieve, you can place it back into the dye bath for additional time. If desire a very light shade, check your buttons early, at exactly two minutes."
        },
        {
          "headline":"Keep water warm for a rich, deep shade.",
          "description":"If you desire a dark color, you need to make sure your water stays around 140 °F (60 °C). To do this, use ceramic, heat-safe bowls to dye your buttons or the top of a double-boiler pot. Fill another pot with about a half inch of water, and place it on your stovetop. Heat the water on low heat. Then, place your dye bath bowl or pot overtop of this water to create indirect heat. Keep the heat on during the dyeing process. You can check the temperature of your dye bath with a candy thermometer, if you have one."
        },
        {
          "headline":"Remove the buttons from the dye and rinse them.",
          "description":"Once they reach your desired color, you want to remove the buttons from the dye bath and rinse them so that no residual color stains anything, and they stay the color you like. First, rinse the buttons with cool water. Then, gently wash them with soap and water, and place them on a paper towel to dry completely."
        },
        {
          "headline":"Wash dyeing supplies.",
          "description":"As soon as you are finished dyeing your buttons, you want to wash your bowls and spoons thoroughly with soap and water. The longer they sit with dye in them, the harder it will be to get the dye off. If you’re using disposable bowls, simply throw them away."
        }
      ]
    },
    {
      "name":"Dyeing Buttons with Alcohol Ink",
      "steps":[
        {
          "headline":"Choose your ink colors.",
          "description":"Choose colors you like, and make sure that they are alcohol-based inks. Keep in mind that with this method you can always add more or less color depending on your desired vibrancy. This method works well if you want to create buttons that are multi-colored or two-toned."
        },
        {
          "headline":"Place a few drops of ink onto your button.",
          "description":"Start with a very small amount of ink. It is easier to build up color than it is to take it away. After you drop the ink onto your button, use a q-tip to spread it around evenly across the surface of the button. Let this layer of ink dry completely before you continue with the process."
        },
        {
          "headline":"Continue adding layers of color until you get your desired shade.",
          "description":"If you want a very light shade, you may only need a single layer of color. Continue to use a dropper, and then a q-tip to spread the color evenly. You can also use a small paint brush instead of a q-tip. Wait until each layer of color dries to judge its shade, as wet ink tends to be darker than dried ink."
        },
        {
          "headline":"Get creative with your coloring.",
          "description":"With ink, you can make your buttons multi-colored. If you want, you can make each of the button’s sides a different color, or split the colors down the middle of the button. For clean lines on your button, you can use painter’s tape to tape off one side while the other dries. For two-toned buttons, start with the lighter color first. For extra embellishment after you dye your buttons, draw on designs with nail polish or colored sharpie. Use a toothpick to create designs with nail polish."
        },
        {
          "headline":"Cover your button with a sealer.",
          "description":"This will keep the color in place, and add a protective finish to each of your buttons. Mod Podge works well. You can buy Mod Podge at most craft stores. Choose whether you want to have a glossy or matte finish. In a pinch, you can use glue that dries clear as a sealer instead. Simply take a clean, small paintbrush or q-tip, and dip it into your sealer. Spread a thin, even layer on one side of your button. Make sure to get the sides of the button covered. Once the first side dries, turn the button over, and apply the sealer again. If you get your sealer into the holes of the buttons, just use something sharp like a toothpick or needle to poke back through the holes."
        }
      ]
    }
  ],
  "text":" Creating Your Workspace Protect your workspace. Because you will be working with permanent dyes, you want to use something to ensure you don’t stain the floor or table. You also want to take precaution not to stain your skin or clothing. You can use a drop cloth, layers of newspaper, plastic garbage bags, or a plastic table cloth. Whichever you choose, consider taping it down to your work area so that it stays in place while you complete your project, and make sure it isn’t thin enough that the dye could seep through it. If you are working on a table, consider also laying a drop cloth on the floor underneath you, in case the dye splashes. Wear old clothes that you don’t mind getting dye on. You can also just put a large, old T-shirt or button down over the clothes you are wearing to keep them clean. When you dye your buttons, wear rubber gloves to protect your skin. Collect your buttons. You can dye buttons that are either plastic or nylon. Use buttons that are either white or a very light color for the best color payoff. Consider trying out different shapes, sizes, and styles of buttons to see which ones come out best after you dye them. This will give you options for your project. Buttons with designs carved on them make great candidates for dying, as the color varies and gives them even more dimension. Gather your dyeing materials. You will need containers to hold your dye baths, a measuring cup and measuring spoons, a stirring spoon, and dye. You should have a bowl or plastic container for each color you plan on using. Each one should be able to hold one cup of liquid. Make sure your containers can withstand hot water. You can find dye at local hobby and craft stores in sections with other fabric craft supplies. Rit is a good all-purpose brand of dye to use for dyeing your buttons. If you choose another brand, read the label to ensure you will be able to dye your plastic buttons. It’s best to use a disposable or stainless steel spoon to stir. If you choose to dye your buttons with ink, you’ll need alcohol-based ink, q-tips, and a sealer like mod podge. Dying Your Buttons with All-Purpose Dye Pour one cup of hot water into each of your bowls. The water needs to be hot enough to dissolve the dye and set the color on your buttons. It should be about 140 degrees Fahrenheit. If your hot tap water is too cool, stick the water in your bowls in the microwave for about 30 seconds. Add the dye to your water. Add only one color in each bowl. If you’re using liquid dye, add one teaspoon per cup of water. If you’re using powdered dye, add two teaspoons. To create darker hues, add more dye to your bath. Dip a small piece of white fabric or a white paper towel into your dye bath to test the color. Add more dye if it is too light for your taste or more hot water if it becomes too dark. Use your spoon to stir the dye. It should be completely dissolved in the water, and the color should be even. Place your buttons in the dye. The buttons should be completely submerged and have room to move within the container. You don’t want the buttons to touch, as this can create uneven color. Leave the buttons in the dye for two to five minutes. The longer you leave them, the darker the color will be. Check for color by using a spoon to gently lift one of the buttons out of the water. If the button is not yet the color you’d like to achieve, you can place it back into the dye bath for additional time. If desire a very light shade, check your buttons early, at exactly two minutes. Keep water warm for a rich, deep shade. If you desire a dark color, you need to make sure your water stays around 140 °F (60 °C). To do this, use ceramic, heat-safe bowls to dye your buttons or the top of a double-boiler pot. Fill another pot with about a half inch of water, and place it on your stovetop. Heat the water on low heat. Then, place your dye bath bowl or pot overtop of this water to create indirect heat. Keep the heat on during the dyeing process. You can check the temperature of your dye bath with a candy thermometer, if you have one. Remove the buttons from the dye and rinse them. Once they reach your desired color, you want to remove the buttons from the dye bath and rinse them so that no residual color stains anything, and they stay the color you like. First, rinse the buttons with cool water. Then, gently wash them with soap and water, and place them on a paper towel to dry completely. Wash dyeing supplies. As soon as you are finished dyeing your buttons, you want to wash your bowls and spoons thoroughly with soap and water. The longer they sit with dye in them, the harder it will be to get the dye off. If you’re using disposable bowls, simply throw them away. Dyeing Buttons with Alcohol Ink Choose your ink colors. Choose colors you like, and make sure that they are alcohol-based inks. Keep in mind that with this method you can always add more or less color depending on your desired vibrancy. This method works well if you want to create buttons that are multi-colored or two-toned. Place a few drops of ink onto your button. Start with a very small amount of ink. It is easier to build up color than it is to take it away. After you drop the ink onto your button, use a q-tip to spread it around evenly across the surface of the button. Let this layer of ink dry completely before you continue with the process. Continue adding layers of color until you get your desired shade. If you want a very light shade, you may only need a single layer of color. Continue to use a dropper, and then a q-tip to spread the color evenly. You can also use a small paint brush instead of a q-tip. Wait until each layer of color dries to judge its shade, as wet ink tends to be darker than dried ink. Get creative with your coloring. With ink, you can make your buttons multi-colored. If you want, you can make each of the button’s sides a different color, or split the colors down the middle of the button. For clean lines on your button, you can use painter’s tape to tape off one side while the other dries. For two-toned buttons, start with the lighter color first. For extra embellishment after you dye your buttons, draw on designs with nail polish or colored sharpie. Use a toothpick to create designs with nail polish. Cover your button with a sealer. This will keep the color in place, and add a protective finish to each of your buttons. Mod Podge works well. You can buy Mod Podge at most craft stores. Choose whether you want to have a glossy or matte finish. In a pinch, you can use glue that dries clear as a sealer instead. Simply take a clean, small paintbrush or q-tip, and dip it into your sealer. Spread a thin, even layer on one side of your button. Make sure to get the sides of the button covered. Once the first side dries, turn the button over, and apply the sealer again. If you get your sealer into the holes of the buttons, just use something sharp like a toothpick or needle to poke back through the holes.",
  "sentences":[
    " Creating Your Workspace Protect your workspace.",
    "Because you will be working with permanent dyes, you want to use something to ensure you don’t stain the floor or table.",
    "You also want to take precaution not to stain your skin or clothing.",
    "You can use a drop cloth, layers of newspaper, plastic garbage bags, or a plastic table cloth.",
    "Whichever you choose, consider taping it down to your work area so that it stays in place while you complete your project, and make sure it isn’t thin enough that the dye could seep through it.",
    "If you are working on a table, consider also laying a drop cloth on the floor underneath you, in case the dye splashes.",
    "Wear old clothes that you don’t mind getting dye on.",
    "You can also just put a large, old T-shirt or button down over the clothes you are wearing to keep them clean.",
    "When you dye your buttons, wear rubber gloves to protect your skin.",
    "Collect your buttons.",
    "You can dye buttons that are either plastic or nylon.",
    "Use buttons that are either white or a very light color for the best color payoff.",
    "Consider trying out different shapes, sizes, and styles of buttons to see which ones come out best after you dye them.",
    "This will give you options for your project.",
    "Buttons with designs carved on them make great candidates for dying, as the color varies and gives them even more dimension.",
    "Gather your dyeing materials.",
    "You will need containers to hold your dye baths, a measuring cup and measuring spoons, a stirring spoon, and dye.",
    "You should have a bowl or plastic container for each color you plan on using.",
    "Each one should be able to hold one cup of liquid.",
    "Make sure your containers can withstand hot water.",
    "You can find dye at local hobby and craft stores in sections with other fabric craft supplies.",
    "Rit is a good all-purpose brand of dye to use for dyeing your buttons.",
    "If you choose another brand, read the label to ensure you will be able to dye your plastic buttons.",
    "It’s best to use a disposable or stainless steel spoon to stir.",
    "If you choose to dye your buttons with ink, you’ll need alcohol-based ink, q-tips, and a sealer like mod podge.",
    "Dying Your Buttons with All-Purpose Dye Pour one cup of hot water into each of your bowls.",
    "The water needs to be hot enough to dissolve the dye and set the color on your buttons.",
    "It should be about 140 degrees Fahrenheit.",
    "If your hot tap water is too cool, stick the water in your bowls in the microwave for about 30 seconds.",
    "Add the dye to your water.",
    "Add only one color in each bowl.",
    "If you’re using liquid dye, add one teaspoon per cup of water.",
    "If you’re using powdered dye, add two teaspoons.",
    "To create darker hues, add more dye to your bath.",
    "Dip a small piece of white fabric or a white paper towel into your dye bath to test the color.",
    "Add more dye if it is too light for your taste or more hot water if it becomes too dark.",
    "Use your spoon to stir the dye.",
    "It should be completely dissolved in the water, and the color should be even.",
    "Place your buttons in the dye.",
    "The buttons should be completely submerged and have room to move within the container.",
    "You don’t want the buttons to touch, as this can create uneven color.",
    "Leave the buttons in the dye for two to five minutes.",
    "The longer you leave them, the darker the color will be.",
    "Check for color by using a spoon to gently lift one of the buttons out of the water.",
    "If the button is not yet the color you’d like to achieve, you can place it back into the dye bath for additional time.",
    "If desire a very light shade, check your buttons early, at exactly two minutes.",
    "Keep water warm for a rich, deep shade.",
    "If you desire a dark color, you need to make sure your water stays around 140 °F (60 °C).",
    "To do this, use ceramic, heat-safe bowls to dye your buttons or the top of a double-boiler pot.",
    "Fill another pot with about a half inch of water, and place it on your stovetop.",
    "Heat the water on low heat.",
    "Then, place your dye bath bowl or pot overtop of this water to create indirect heat.",
    "Keep the heat on during the dyeing process.",
    "You can check the temperature of your dye bath with a candy thermometer, if you have one.",
    "Remove the buttons from the dye and rinse them.",
    "Once they reach your desired color, you want to remove the buttons from the dye bath and rinse them so that no residual color stains anything, and they stay the color you like.",
    "First, rinse the buttons with cool water.",
    "Then, gently wash them with soap and water, and place them on a paper towel to dry completely.",
    "Wash dyeing supplies.",
    "As soon as you are finished dyeing your buttons, you want to wash your bowls and spoons thoroughly with soap and water.",
    "The longer they sit with dye in them, the harder it will be to get the dye off.",
    "If you’re using disposable bowls, simply throw them away.",
    "Dyeing Buttons with Alcohol Ink Choose your ink colors.",
    "Choose colors you like, and make sure that they are alcohol-based inks.",
    "Keep in mind that with this method you can always add more or less color depending on your desired vibrancy.",
    "This method works well if you want to create buttons that are multi-colored or two-toned.",
    "Place a few drops of ink onto your button.",
    "Start with a very small amount of ink.",
    "It is easier to build up color than it is to take it away.",
    "After you drop the ink onto your button, use a q-tip to spread it around evenly across the surface of the button.",
    "Let this layer of ink dry completely before you continue with the process.",
    "Continue adding layers of color until you get your desired shade.",
    "If you want a very light shade, you may only need a single layer of color.",
    "Continue to use a dropper, and then a q-tip to spread the color evenly.",
    "You can also use a small paint brush instead of a q-tip.",
    "Wait until each layer of color dries to judge its shade, as wet ink tends to be darker than dried ink.",
    "Get creative with your coloring.",
    "With ink, you can make your buttons multi-colored.",
    "If you want, you can make each of the button’s sides a different color, or split the colors down the middle of the button.",
    "For clean lines on your button, you can use painter’s tape to tape off one side while the other dries.",
    "For two-toned buttons, start with the lighter color first.",
    "For extra embellishment after you dye your buttons, draw on designs with nail polish or colored sharpie.",
    "Use a toothpick to create designs with nail polish.",
    "Cover your button with a sealer.",
    "This will keep the color in place, and add a protective finish to each of your buttons.",
    "Mod Podge works well.",
    "You can buy Mod Podge at most craft stores.",
    "Choose whether you want to have a glossy or matte finish.",
    "In a pinch, you can use glue that dries clear as a sealer instead.",
    "Simply take a clean, small paintbrush or q-tip, and dip it into your sealer.",
    "Spread a thin, even layer on one side of your button.",
    "Make sure to get the sides of the button covered.",
    "Once the first side dries, turn the button over, and apply the sealer again.",
    "If you get your sealer into the holes of the buttons, just use something sharp like a toothpick or needle to poke back through the holes."
  ],
  "tyn_section":[
    "Liquid or powder dye",
    "White buttons",
    "Measuring cup",
    "Measuring spoons",
    "Disposable plastic containers (enough for each color)",
    "A stainless steel or plastic spoon for each container",
    "Rubber gloves",
    "Protective table covering (plastic, newspaper, cardboard, cloth, etc.)",
    "Roll of paper towels"
  ],
  "tyn_model":[
    "water",
    "ink",
    "buttons",
    "dye",
    "sealer",
    "bowls",
    "spoon",
    "mod podge",
    "q-tip",
    "drop cloth",
    "hot water",
    "soap",
    "nail polish",
    "newspaper",
    "t-shirt",
    "button",
    "rubber gloves",
    "containers",
    "measuring cup",
    "measuring spoons",
    "stirring spoon",
    "bowl",
    "rit",
    "q-tips",
    "all-purpose dye",
    "microwave",
    "dye bath",
    "container",
    "double-boiler pot",
    "dye bath bowl",
    "candy thermometer",
    "spoons",
    "alcohol ink",
    "dropper",
    "paint brush",
    "painter’s tape",
    "colored sharpie",
    "toothpick",
    "glue"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0769230769,
    "f1":0.125,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4444444444,
    "p":0.1282051282,
    "f1":0.1990049751
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4444444444,
    "p":0.1282051282,
    "f1":0.1990049751
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0769230769,
    "f1":0.125
  }
}