{
  "title":"How to Make a Tree Stump Coffee Table",
  "url":"https://www.wikihow.com/Make-a-Tree-Stump-Coffee-Table",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "parts":[
    {
      "name":"Sourcing a Good Stump",
      "steps":[
        {
          "headline":"Find a fallen tree.",
          "description":"The tree trunk should be at least 6 inches/15cm, or longer."
        },
        {
          "headline":"Cut the stump from the trunk of the fallen tree.",
          "description":"Use appropriate tools and safety precautions; if you're not sure what to do, ask someone who does to help out. Bring the stump home."
        }
      ]
    },
    {
      "name":"Preparing the Tree Stump",
      "steps":[
        {
          "headline":"Grab a 200 grit sandpaper to smooth the tree stump.",
          "description":""
        },
        {
          "headline":"Paint the tree stump white (or whatever color you prefer).",
          "description":"You can use ordinary spray paint as well as standard acrylic or other craft/wood-suitable paint. Allow to dry completely before painting a second or even third coat."
        }
      ]
    },
    {
      "name":"Adding Wheels",
      "steps":[
        {
          "headline":"Locate some wheels from a broken office chair (or from the hardware store).",
          "description":"Alternatively, if you don't want the table to roll, you can use practically any feet for this project."
        },
        {
          "headline":"Measure the placement of the wheels on the base of the stump.",
          "description":"Keep the distance between each of the wheels sufficient to ensure good balance."
        },
        {
          "headline":"Grab your drill.",
          "description":""
        },
        {
          "headline":"Make holes in the tree stump for inserting the wheels.",
          "description":""
        },
        {
          "headline":"Screw the wheels under the coffee table.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":"You now have a unique coffee table for your chic room!"
        }
      ]
    }
  ],
  "text":" Sourcing a Good Stump Find a fallen tree. The tree trunk should be at least 6 inches/15cm, or longer. Cut the stump from the trunk of the fallen tree. Use appropriate tools and safety precautions; if you're not sure what to do, ask someone who does to help out. Bring the stump home. Preparing the Tree Stump Grab a 200 grit sandpaper to smooth the tree stump.  Paint the tree stump white (or whatever color you prefer). You can use ordinary spray paint as well as standard acrylic or other craft/wood-suitable paint. Allow to dry completely before painting a second or even third coat. Adding Wheels Locate some wheels from a broken office chair (or from the hardware store). Alternatively, if you don't want the table to roll, you can use practically any feet for this project. Measure the placement of the wheels on the base of the stump. Keep the distance between each of the wheels sufficient to ensure good balance. Grab your drill.  Make holes in the tree stump for inserting the wheels.  Screw the wheels under the coffee table.  Finished. You now have a unique coffee table for your chic room!",
  "sentences":[
    " Sourcing a Good Stump Find a fallen tree.",
    "The tree trunk should be at least 6 inches/15cm, or longer.",
    "Cut the stump from the trunk of the fallen tree.",
    "Use appropriate tools and safety precautions; if you're not sure what to do, ask someone who does to help out.",
    "Bring the stump home.",
    "Preparing the Tree Stump Grab a 200 grit sandpaper to smooth the tree stump.",
    "Paint the tree stump white (or whatever color you prefer).",
    "You can use ordinary spray paint as well as standard acrylic or other craft/wood-suitable paint.",
    "Allow to dry completely before painting a second or even third coat.",
    "Adding Wheels Locate some wheels from a broken office chair (or from the hardware store).",
    "Alternatively, if you don't want the table to roll, you can use practically any feet for this project.",
    "Measure the placement of the wheels on the base of the stump.",
    "Keep the distance between each of the wheels sufficient to ensure good balance.",
    "Grab your drill.",
    "Make holes in the tree stump for inserting the wheels.",
    "Screw the wheels under the coffee table.",
    "Finished.",
    "You now have a unique coffee table for your chic room!"
  ],
  "tyn_section":[
    "Tree stump (from a local woods, forest or from a garden supply store)",
    "Saw",
    "Drill",
    "3-4 wheels",
    "Paint",
    "Paintbrush or sprayer",
    "Safety gear for sawing"
  ],
  "tyn_model":[
    "coffee table",
    "200 grit sandpaper",
    "spray paint",
    "paint",
    "drill"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.4,
    "f1":0.3333333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2857142857,
    "p":0.6,
    "f1":0.3870967742
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.2857142857,
    "p":0.6,
    "f1":0.3870967742
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.4,
    "f1":0.3333333333
  }
}