{
  "title":"How to Make a Very Easy Balloon Sword",
  "url":"https://www.wikihow.com/Make-a-Very-Easy-Balloon-Sword",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Wargaming",
    "Toy Weaponry",
    "Toy Swords"
  ],
  "steps":[
    {
      "headline":"Blow up the balloon using a balloon pump.",
      "description":"Blow until the tip just about disappears. Do not over-inflate. Each twist takes up space, so it can pop if you over-inflate."
    },
    {
      "headline":"Fold the balloon as shown in the picture.",
      "description":""
    },
    {
      "headline":"Grab the balloon with your free hand right next to the hand holding the balloon.",
      "description":"Fearlessly twist the two sections together. A double twist is standard. The loop you make should be large enough to fit the balloon through."
    },
    {
      "headline":"Push the tip of the balloon through the loop.",
      "description":""
    },
    {
      "headline":"Drag your hand over the sword, using the heat of your hand to pull the balloon straight.",
      "description":"It's now ready for a balloon sword fight!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Blow up the balloon using a balloon pump. Blow until the tip just about disappears. Do not over-inflate. Each twist takes up space, so it can pop if you over-inflate. Fold the balloon as shown in the picture.  Grab the balloon with your free hand right next to the hand holding the balloon. Fearlessly twist the two sections together. A double twist is standard. The loop you make should be large enough to fit the balloon through. Push the tip of the balloon through the loop.  Drag your hand over the sword, using the heat of your hand to pull the balloon straight. It's now ready for a balloon sword fight! Finished. ",
  "sentences":[
    " Blow up the balloon using a balloon pump.",
    "Blow until the tip just about disappears.",
    "Do not over-inflate.",
    "Each twist takes up space, so it can pop if you over-inflate.",
    "Fold the balloon as shown in the picture.",
    "Grab the balloon with your free hand right next to the hand holding the balloon.",
    "Fearlessly twist the two sections together.",
    "A double twist is standard.",
    "The loop you make should be large enough to fit the balloon through.",
    "Push the tip of the balloon through the loop.",
    "Drag your hand over the sword, using the heat of your hand to pull the balloon straight.",
    "It's now ready for a balloon sword fight!",
    "Finished."
  ],
  "tyn_section":[
    "You need a long skinny balloon known as 260Q. The letter is the company that produces them, so it can change. Qualatex is the brand used here and it is very popular with professional balloon twisters.",
    "You will need a balloon pump to blow them up. Few professionals can do it by mouth, so splurge on the pump, and don't be discouraged."
  ],
  "tyn_model":[
    "balloon",
    "balloon pump"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}