{
  "title":"How to Make Rose Petal Beads",
  "url":"https://www.wikihow.com/Make-Rose-Petal-Beads",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "methods":[
    {
      "name":"Plain Rose Petal Beads",
      "steps":[
        {
          "headline":"Gather red rose petals.",
          "description":""
        },
        {
          "headline":"Place on a rusty tin sheet in the sun for a day or so to begin to dry.",
          "description":"Alternatively, if you are familiar with oven or microwave drying, you could substitute these methods."
        },
        {
          "headline":"Wait for the petals to shrink before proceeding but not dry.",
          "description":"There needs to be a little moisture left to help with the moulding."
        },
        {
          "headline":"Put the petals through a mincer or through a blender until there is a mince of roses that appears ideal for forming into beads.",
          "description":"You can test this after each mince or blend by rolling in your hands. If the mixture stays together in a bead shape, the mixture is ready to work with."
        },
        {
          "headline":"Using your hands, roll small bead shapes with a bit of the mixture.",
          "description":"Do this firmly so that the little bead balls stick together well. Remember that the plant material will shrink as it dries to half the original size, so make account for this in your bead size. Continue until you have made as many beads as required."
        },
        {
          "headline":"Pierce a hole through the centre of each bead.",
          "description":"Use a long hat-pin, a thin skewer or a piece of wire to create a hole through each bead. Leave the beads to dry on this to ensure that the hole remains stable and of a good size as the beads dry."
        },
        {
          "headline":"Allow the beads to dry thoroughly.",
          "description":"Place in a warm, dry and well-ventilated place to dry."
        },
        {
          "headline":"Thread the necklace.",
          "description":"Take the dry beads and thread them onto a necklace thread. Intersperse with a gold or silver bead between each or every 2-3 rose beads for added effect."
        },
        {
          "headline":"Add an appropriate clasp.",
          "description":""
        },
        {
          "headline":"Store well.",
          "description":"The necklace will keep well for many years. The scent can be retained and heightened by storing the necklace in a small wooden box that is closed and fairly air-tight. Keep the lid closed when the necklace is in storage."
        }
      ]
    },
    {
      "name":"Spiced Rose Beads",
      "steps":[
        {
          "headline":"Place all of the ingredients into a bowl for mixing.",
          "description":""
        },
        {
          "headline":"Mix together to form a stiff paste.",
          "description":""
        },
        {
          "headline":"Roll the paste into small bead shapes.",
          "description":"Set the beads out to dry on a wire rack. They should not dry completely - just enough that you can handle them."
        },
        {
          "headline":"Pierce through each bead with a hot needle.",
          "description":"Allow each bead with a hole to dry completely."
        },
        {
          "headline":"Thread into a necklace.",
          "description":"See instructions above for remaining steps."
        }
      ]
    }
  ],
  "text":" Plain Rose Petal Beads Gather red rose petals.  Place on a rusty tin sheet in the sun for a day or so to begin to dry. Alternatively, if you are familiar with oven or microwave drying, you could substitute these methods. Wait for the petals to shrink before proceeding but not dry. There needs to be a little moisture left to help with the moulding. Put the petals through a mincer or through a blender until there is a mince of roses that appears ideal for forming into beads. You can test this after each mince or blend by rolling in your hands. If the mixture stays together in a bead shape, the mixture is ready to work with. Using your hands, roll small bead shapes with a bit of the mixture. Do this firmly so that the little bead balls stick together well. Remember that the plant material will shrink as it dries to half the original size, so make account for this in your bead size. Continue until you have made as many beads as required. Pierce a hole through the centre of each bead. Use a long hat-pin, a thin skewer or a piece of wire to create a hole through each bead. Leave the beads to dry on this to ensure that the hole remains stable and of a good size as the beads dry. Allow the beads to dry thoroughly. Place in a warm, dry and well-ventilated place to dry. Thread the necklace. Take the dry beads and thread them onto a necklace thread. Intersperse with a gold or silver bead between each or every 2-3 rose beads for added effect. Add an appropriate clasp.  Store well. The necklace will keep well for many years. The scent can be retained and heightened by storing the necklace in a small wooden box that is closed and fairly air-tight. Keep the lid closed when the necklace is in storage. Spiced Rose Beads Place all of the ingredients into a bowl for mixing.  Mix together to form a stiff paste.  Roll the paste into small bead shapes. Set the beads out to dry on a wire rack. They should not dry completely - just enough that you can handle them. Pierce through each bead with a hot needle. Allow each bead with a hole to dry completely. Thread into a necklace. See instructions above for remaining steps.",
  "sentences":[
    " Plain Rose Petal Beads Gather red rose petals.",
    "Place on a rusty tin sheet in the sun for a day or so to begin to dry.",
    "Alternatively, if you are familiar with oven or microwave drying, you could substitute these methods.",
    "Wait for the petals to shrink before proceeding but not dry.",
    "There needs to be a little moisture left to help with the moulding.",
    "Put the petals through a mincer or through a blender until there is a mince of roses that appears ideal for forming into beads.",
    "You can test this after each mince or blend by rolling in your hands.",
    "If the mixture stays together in a bead shape, the mixture is ready to work with.",
    "Using your hands, roll small bead shapes with a bit of the mixture.",
    "Do this firmly so that the little bead balls stick together well.",
    "Remember that the plant material will shrink as it dries to half the original size, so make account for this in your bead size.",
    "Continue until you have made as many beads as required.",
    "Pierce a hole through the centre of each bead.",
    "Use a long hat-pin, a thin skewer or a piece of wire to create a hole through each bead.",
    "Leave the beads to dry on this to ensure that the hole remains stable and of a good size as the beads dry.",
    "Allow the beads to dry thoroughly.",
    "Place in a warm, dry and well-ventilated place to dry.",
    "Thread the necklace.",
    "Take the dry beads and thread them onto a necklace thread.",
    "Intersperse with a gold or silver bead between each or every 2-3 rose beads for added effect.",
    "Add an appropriate clasp.",
    "Store well.",
    "The necklace will keep well for many years.",
    "The scent can be retained and heightened by storing the necklace in a small wooden box that is closed and fairly air-tight.",
    "Keep the lid closed when the necklace is in storage.",
    "Spiced Rose Beads Place all of the ingredients into a bowl for mixing.",
    "Mix together to form a stiff paste.",
    "Roll the paste into small bead shapes.",
    "Set the beads out to dry on a wire rack.",
    "They should not dry completely - just enough that you can handle them.",
    "Pierce through each bead with a hot needle.",
    "Allow each bead with a hole to dry completely.",
    "Thread into a necklace.",
    "See instructions above for remaining steps."
  ],
  "tyn_section":[
    "Method 1:",
    "Rose petals from true scented roses; you will need at least 2 cupfuls of petals, depending on how large a necklace you wish to produce",
    "Rusty tin sheet",
    "Mincer or blender",
    "Long hat-pin, skewer or piece of wire",
    "Gold or silver beads",
    "Necklace thread",
    "Storage box",
    "Method 2:",
    "1 oz glycerin",
    "1/2 oz oil of rose",
    "1 oz powdered gum benzoin",
    "1 oz powdered gum acacia",
    "1/2 oz finely chopped vanilla bean",
    "1/2 oz powdered orris root",
    "1/2 oz powdered cinnamon"
  ],
  "tyn_model":[
    "beads",
    "necklace",
    "thread",
    "red rose petals",
    "mincer",
    "blender",
    "roses",
    "plant",
    "wire",
    "necklace thread",
    "spiced rose beads",
    "bowl",
    "wire rack"
  ],
  "simple_metrics":{
    "r":0.0625,
    "p":0.0769230769,
    "f1":0.0689655172,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0625,
    "p":0.2307692308,
    "f1":0.0983606557
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.125,
    "p":0.3846153846,
    "f1":0.1886792453
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0625,
    "p":0.0769230769,
    "f1":0.0689655172
  }
}