{
  "title":"How to Dry Apricots",
  "url":"https://www.wikihow.com/Dry-Apricots",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques",
    "Drying Food"
  ],
  "methods":[
    {
      "name":"Drying Apricots in the Oven",
      "steps":[
        {
          "headline":"Buy or pick your apricots when they are fully ripe.Under-ripe fruit can become sour when dried.",
          "description":"If they grow locally in your area, wait for the end of the season “canning specials” when you can get ripe fruit that you can use immediately, instead of keeping it around to eat raw."
        },
        {
          "headline":"Look for big sales at your local supermarket.",
          "description":"They will be ripe in late summer, or sometime between July and September, depending upon the year."
        },
        {
          "headline":"Ripen firm apricots by placing them in a paper bag in the window.",
          "description":"If you are worried your apricots will become overripe before you have time to dry them, you can place them in the refrigerator for up to a week."
        },
        {
          "headline":"Clean your apricots thoroughly.",
          "description":"Soak them for a few minutes in water to loosen dirt and then rinse them with running water. Discard any bruised apricots."
        },
        {
          "headline":"Pit the apricots.",
          "description":"You should cut them in half along the indentation, and then you can remove the pit."
        },
        {
          "headline":"Turn the apricots inside out.",
          "description":"Push the outside center up, so that there is more flesh exposed to the air. You will dry them with the flesh facing up."
        },
        {
          "headline":"Take a baking sheet and line it with parchment paper.",
          "description":"If you have a large wire rack, place it above the rack to reduce drying times."
        },
        {
          "headline":"Lay the apricot halves on the rack, or directly on the parchment paper.",
          "description":"Make sure they are spaced evenly apart."
        },
        {
          "headline":"Preheat your oven to its lowest setting.",
          "description":"They will dry best at a warming temperature below 200 degrees (93 degrees Celsius). 175 degrees Fahrenheit (79 degrees Celsius) will work well for drying apricots."
        },
        {
          "headline":"Space the oven racks several levels apart.",
          "description":"Place the cooking sheets with racks in the oven."
        },
        {
          "headline":"Wait at least 10 to 12 hours for the apricots to dry.",
          "description":"Turn them at the halfway mark to ensure even drying. They should be slightly soft but leathery when they are done. The cooking time will vary depending upon the size of the apricots and the temperature at which you dry them. It will take less time to dry at 175 than 150 degrees."
        }
      ]
    },
    {
      "name":"Drying Apricots in a Dehydrator",
      "steps":[
        {
          "headline":"Choose your ripe apricots.",
          "description":"Clean them with fresh water, just as you did in the oven drying method."
        },
        {
          "headline":"Pit the apricots.",
          "description":"Slice them along the indentation with a paring knife. Remove the pit and discard."
        },
        {
          "headline":"Separate the halves and turn them inside out.",
          "description":"Leave the skins on. You need to press the outside center until the flesh spreads out."
        },
        {
          "headline":"Remove your dehydrator racks.",
          "description":"Spread the apricots onto the racks with the flesh facing up. Make sure there is space between each piece of fruit for increased airflow."
        },
        {
          "headline":"Replace the racks.",
          "description":"Set the dehydrator at 135 degrees Fahrenheit (57 degrees Celsius). Read your manual to determine if this is the low, medium or high setting on your dehydrator."
        },
        {
          "headline":"Wait approximately 12 hours or until the timer goes off.",
          "description":"Larger apricot halves will take longer."
        },
        {
          "headline":"Store dried apricots in sealed glass canning jars.",
          "description":"Place them in a cool, dark place, such as a pantry. They will last several months."
        }
      ]
    }
  ],
  "text":" Drying Apricots in the Oven Buy or pick your apricots when they are fully ripe.Under-ripe fruit can become sour when dried. If they grow locally in your area, wait for the end of the season “canning specials” when you can get ripe fruit that you can use immediately, instead of keeping it around to eat raw. Look for big sales at your local supermarket. They will be ripe in late summer, or sometime between July and September, depending upon the year. Ripen firm apricots by placing them in a paper bag in the window. If you are worried your apricots will become overripe before you have time to dry them, you can place them in the refrigerator for up to a week. Clean your apricots thoroughly. Soak them for a few minutes in water to loosen dirt and then rinse them with running water. Discard any bruised apricots. Pit the apricots. You should cut them in half along the indentation, and then you can remove the pit. Turn the apricots inside out. Push the outside center up, so that there is more flesh exposed to the air. You will dry them with the flesh facing up. Take a baking sheet and line it with parchment paper. If you have a large wire rack, place it above the rack to reduce drying times. Lay the apricot halves on the rack, or directly on the parchment paper. Make sure they are spaced evenly apart. Preheat your oven to its lowest setting. They will dry best at a warming temperature below 200 degrees (93 degrees Celsius). 175 degrees Fahrenheit (79 degrees Celsius) will work well for drying apricots. Space the oven racks several levels apart. Place the cooking sheets with racks in the oven. Wait at least 10 to 12 hours for the apricots to dry. Turn them at the halfway mark to ensure even drying. They should be slightly soft but leathery when they are done. The cooking time will vary depending upon the size of the apricots and the temperature at which you dry them. It will take less time to dry at 175 than 150 degrees. Drying Apricots in a Dehydrator Choose your ripe apricots. Clean them with fresh water, just as you did in the oven drying method. Pit the apricots. Slice them along the indentation with a paring knife. Remove the pit and discard. Separate the halves and turn them inside out. Leave the skins on. You need to press the outside center until the flesh spreads out. Remove your dehydrator racks. Spread the apricots onto the racks with the flesh facing up. Make sure there is space between each piece of fruit for increased airflow. Replace the racks. Set the dehydrator at 135 degrees Fahrenheit (57 degrees Celsius). Read your manual to determine if this is the low, medium or high setting on your dehydrator. Wait approximately 12 hours or until the timer goes off. Larger apricot halves will take longer. Store dried apricots in sealed glass canning jars. Place them in a cool, dark place, such as a pantry. They will last several months.",
  "sentences":[
    " Drying Apricots in the Oven Buy or pick your apricots when they are fully ripe.Under-ripe fruit can become sour when dried.",
    "If they grow locally in your area, wait for the end of the season “canning specials” when you can get ripe fruit that you can use immediately, instead of keeping it around to eat raw.",
    "Look for big sales at your local supermarket.",
    "They will be ripe in late summer, or sometime between July and September, depending upon the year.",
    "Ripen firm apricots by placing them in a paper bag in the window.",
    "If you are worried your apricots will become overripe before you have time to dry them, you can place them in the refrigerator for up to a week.",
    "Clean your apricots thoroughly.",
    "Soak them for a few minutes in water to loosen dirt and then rinse them with running water.",
    "Discard any bruised apricots.",
    "Pit the apricots.",
    "You should cut them in half along the indentation, and then you can remove the pit.",
    "Turn the apricots inside out.",
    "Push the outside center up, so that there is more flesh exposed to the air.",
    "You will dry them with the flesh facing up.",
    "Take a baking sheet and line it with parchment paper.",
    "If you have a large wire rack, place it above the rack to reduce drying times.",
    "Lay the apricot halves on the rack, or directly on the parchment paper.",
    "Make sure they are spaced evenly apart.",
    "Preheat your oven to its lowest setting.",
    "They will dry best at a warming temperature below 200 degrees (93 degrees Celsius).",
    "175 degrees Fahrenheit (79 degrees Celsius) will work well for drying apricots.",
    "Space the oven racks several levels apart.",
    "Place the cooking sheets with racks in the oven.",
    "Wait at least 10 to 12 hours for the apricots to dry.",
    "Turn them at the halfway mark to ensure even drying.",
    "They should be slightly soft but leathery when they are done.",
    "The cooking time will vary depending upon the size of the apricots and the temperature at which you dry them.",
    "It will take less time to dry at 175 than 150 degrees.",
    "Drying Apricots in a Dehydrator Choose your ripe apricots.",
    "Clean them with fresh water, just as you did in the oven drying method.",
    "Pit the apricots.",
    "Slice them along the indentation with a paring knife.",
    "Remove the pit and discard.",
    "Separate the halves and turn them inside out.",
    "Leave the skins on.",
    "You need to press the outside center until the flesh spreads out.",
    "Remove your dehydrator racks.",
    "Spread the apricots onto the racks with the flesh facing up.",
    "Make sure there is space between each piece of fruit for increased airflow.",
    "Replace the racks.",
    "Set the dehydrator at 135 degrees Fahrenheit (57 degrees Celsius).",
    "Read your manual to determine if this is the low, medium or high setting on your dehydrator.",
    "Wait approximately 12 hours or until the timer goes off.",
    "Larger apricot halves will take longer.",
    "Store dried apricots in sealed glass canning jars.",
    "Place them in a cool, dark place, such as a pantry.",
    "They will last several months."
  ],
  "tyn_section":[
    "Oven",
    "Baking sheet",
    "Parchment paper",
    "Dehydrator",
    "Paring knife",
    "Wire rack",
    "Timer",
    "Honey",
    "Lemon juice",
    "Fruit juice",
    "Water"
  ],
  "tyn_model":[
    "apricots",
    "oven",
    "water",
    "parchment paper",
    "apricot",
    "dehydrator",
    "“canning",
    "” when",
    "refrigerator",
    "running water",
    "baking sheet",
    "cooking sheets",
    "dehydrator choose",
    "oven drying",
    "paring knife",
    "dehydrator racks"
  ],
  "simple_metrics":{
    "r":0.5454545455,
    "p":0.375,
    "f1":0.4444444444,
    "avg_pos":0.0625
  },
  "jacc_metrics_0.5":{
    "r":0.5454545455,
    "p":0.625,
    "f1":0.5825242718
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5454545455,
    "p":0.625,
    "f1":0.5825242718
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5454545455,
    "p":0.375,
    "f1":0.4444444444
  }
}