{
  "title":"How to Dry Dill",
  "url":"https://www.wikihow.com/Dry-Dill",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques",
    "Drying Food"
  ],
  "methods":[
    {
      "name":"Air Drying Dill",
      "steps":[
        {
          "headline":"Water the dill plant a day before you plan to harvest it.",
          "description":"Make sure you sprinkle the plant itself to remove dirt and bugs from the plant."
        },
        {
          "headline":"Cut dill ferns in the morning, before the sun has dehydrated the leaves.",
          "description":"If you want to dry the seeds, you will want to cut all of the flower buds in addition to the ferns."
        },
        {
          "headline":"Cut the dill ferns next to the step.",
          "description":"Use sharp kitchen shears."
        },
        {
          "headline":"Rinse them thoroughly.",
          "description":"Spin them in a salad spinner, and then pat them dry with paper towels. Give them 3 minutes to air dry while spread out on a kitchen towel."
        },
        {
          "headline":"Gather small bunches of 5 to 10 dill fronds.",
          "description":"Tie them together at the base using a rubber band. Make sure you have rid the plants of excess water, or they can mold instead of drying."
        },
        {
          "headline":"Buy small brown paper bags.",
          "description":"Cut several large slits in the bottom sides of the bags so air can flow through. If you plan to hang the dill inside, you can avoid using paper bags. If it is outside, it is a good way to shelter it from the elements and avoid losing dill that dries and falls. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/52\\/Dry-Dill-Step-6Bullet1.jpg\\/v4-459px-Dry-Dill-Step-6Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/52\\/Dry-Dill-Step-6Bullet1.jpg\\/v4-759px-Dry-Dill-Step-6Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Wrap the paper bag over the dill plant and gather it by the rubber band.",
          "description":"Ensure each dill plant is upside down. The gathered dill should be away from the side of the bag to encourage airflow."
        },
        {
          "headline":"Hang the bundles in a dry, well-circulated place on your porch or in your cellar.",
          "description":"Leave them to dry for 2 weeks."
        },
        {
          "headline":"Harvest your dried dill weed when it crumbles easily.",
          "description":"Separate the dried flowers and dried ferns by hand."
        },
        {
          "headline":"Loosen the seeds from the flower buds and store them in an airtight tin.",
          "description":"Crumble the ferns into another tin. Keep them in a dark, dry place."
        }
      ]
    },
    {
      "name":"Oven Drying Dill",
      "steps":[
        {
          "headline":"Pick the fresh dill as you did in the first method.",
          "description":""
        },
        {
          "headline":"Rinse it with fresh water and dry it in a salad spinner.",
          "description":""
        },
        {
          "headline":"Preheat your oven to 110 degrees Fahrenheit (43 degrees Celsius) or less.",
          "description":"If you own a dehydrator, you can use it in place of the oven. Read the manual to determine what temperature setting should be used."
        },
        {
          "headline":"Cover a baking sheet with wax paper.",
          "description":"Spread the dill ferns in a single layer across the baking sheet."
        },
        {
          "headline":"Place the baking sheet in the oven.",
          "description":"If your oven runs hot, keep the oven door ajar. Allow the dill to dry for 2 to 4 hours."
        },
        {
          "headline":"Check your drying dill regularly.",
          "description":"When it crumbles easily, it is done."
        },
        {
          "headline":"Remove the dill from the oven and allow it to cool.",
          "description":"Crumble it into a small tin to use as dill weed. Separate seeds inside the flowers to use in making dill essential oil."
        }
      ]
    },
    {
      "name":"Microwave Drying Dill",
      "steps":[
        {
          "headline":"Rinse the dill weed ferns in running water.",
          "description":"Spin them in a salad spinner and pat them dry with a kitchen towel."
        },
        {
          "headline":"Find a large plate that will fit in your microwave.",
          "description":"Place two layers of paper towels on the plate."
        },
        {
          "headline":"Spread the dill ferns across the plate.",
          "description":"Place a layer of paper towel on top of the ferns."
        },
        {
          "headline":"Set the plate in the microwave.",
          "description":"Set for 4 minutes on high heat."
        },
        {
          "headline":"Remove it from the microwave to check if it’s dry.",
          "description":"If it’s not, return it to the microwave for 2 minutes. It is done once it crumbles to the touch."
        },
        {
          "headline":"Let it cool, crumble it and store it in an airtight container.",
          "description":"Microwave-dried dill will last 2 to 4 weeks. Oven and air-dried dill weed will last longer."
        }
      ]
    }
  ],
  "text":" Air Drying Dill Water the dill plant a day before you plan to harvest it. Make sure you sprinkle the plant itself to remove dirt and bugs from the plant. Cut dill ferns in the morning, before the sun has dehydrated the leaves. If you want to dry the seeds, you will want to cut all of the flower buds in addition to the ferns. Cut the dill ferns next to the step. Use sharp kitchen shears. Rinse them thoroughly. Spin them in a salad spinner, and then pat them dry with paper towels. Give them 3 minutes to air dry while spread out on a kitchen towel. Gather small bunches of 5 to 10 dill fronds. Tie them together at the base using a rubber band. Make sure you have rid the plants of excess water, or they can mold instead of drying. Buy small brown paper bags. Cut several large slits in the bottom sides of the bags so air can flow through. If you plan to hang the dill inside, you can avoid using paper bags. If it is outside, it is a good way to shelter it from the elements and avoid losing dill that dries and falls. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/52\\/Dry-Dill-Step-6Bullet1.jpg\\/v4-459px-Dry-Dill-Step-6Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/52\\/Dry-Dill-Step-6Bullet1.jpg\\/v4-759px-Dry-Dill-Step-6Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"} Wrap the paper bag over the dill plant and gather it by the rubber band. Ensure each dill plant is upside down. The gathered dill should be away from the side of the bag to encourage airflow. Hang the bundles in a dry, well-circulated place on your porch or in your cellar. Leave them to dry for 2 weeks. Harvest your dried dill weed when it crumbles easily. Separate the dried flowers and dried ferns by hand. Loosen the seeds from the flower buds and store them in an airtight tin. Crumble the ferns into another tin. Keep them in a dark, dry place. Oven Drying Dill Pick the fresh dill as you did in the first method.  Rinse it with fresh water and dry it in a salad spinner.  Preheat your oven to 110 degrees Fahrenheit (43 degrees Celsius) or less. If you own a dehydrator, you can use it in place of the oven. Read the manual to determine what temperature setting should be used. Cover a baking sheet with wax paper. Spread the dill ferns in a single layer across the baking sheet. Place the baking sheet in the oven. If your oven runs hot, keep the oven door ajar. Allow the dill to dry for 2 to 4 hours. Check your drying dill regularly. When it crumbles easily, it is done. Remove the dill from the oven and allow it to cool. Crumble it into a small tin to use as dill weed. Separate seeds inside the flowers to use in making dill essential oil. Microwave Drying Dill Rinse the dill weed ferns in running water. Spin them in a salad spinner and pat them dry with a kitchen towel. Find a large plate that will fit in your microwave. Place two layers of paper towels on the plate. Spread the dill ferns across the plate. Place a layer of paper towel on top of the ferns. Set the plate in the microwave. Set for 4 minutes on high heat. Remove it from the microwave to check if it’s dry. If it’s not, return it to the microwave for 2 minutes. It is done once it crumbles to the touch. Let it cool, crumble it and store it in an airtight container. Microwave-dried dill will last 2 to 4 weeks. Oven and air-dried dill weed will last longer.",
  "sentences":[
    " Air Drying Dill Water the dill plant a day before you plan to harvest it.",
    "Make sure you sprinkle the plant itself to remove dirt and bugs from the plant.",
    "Cut dill ferns in the morning, before the sun has dehydrated the leaves.",
    "If you want to dry the seeds, you will want to cut all of the flower buds in addition to the ferns.",
    "Cut the dill ferns next to the step.",
    "Use sharp kitchen shears.",
    "Rinse them thoroughly.",
    "Spin them in a salad spinner, and then pat them dry with paper towels.",
    "Give them 3 minutes to air dry while spread out on a kitchen towel.",
    "Gather small bunches of 5 to 10 dill fronds.",
    "Tie them together at the base using a rubber band.",
    "Make sure you have rid the plants of excess water, or they can mold instead of drying.",
    "Buy small brown paper bags.",
    "Cut several large slits in the bottom sides of the bags so air can flow through.",
    "If you plan to hang the dill inside, you can avoid using paper bags.",
    "If it is outside, it is a good way to shelter it from the elements and avoid losing dill that dries and falls.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/52\\/Dry-Dill-Step-6Bullet1.jpg\\/v4-459px-Dry-Dill-Step-6Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/52\\/Dry-Dill-Step-6Bullet1.jpg\\/v4-759px-Dry-Dill-Step-6Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"} Wrap the paper bag over the dill plant and gather it by the rubber band.",
    "Ensure each dill plant is upside down.",
    "The gathered dill should be away from the side of the bag to encourage airflow.",
    "Hang the bundles in a dry, well-circulated place on your porch or in your cellar.",
    "Leave them to dry for 2 weeks.",
    "Harvest your dried dill weed when it crumbles easily.",
    "Separate the dried flowers and dried ferns by hand.",
    "Loosen the seeds from the flower buds and store them in an airtight tin.",
    "Crumble the ferns into another tin.",
    "Keep them in a dark, dry place.",
    "Oven Drying Dill Pick the fresh dill as you did in the first method.",
    "Rinse it with fresh water and dry it in a salad spinner.",
    "Preheat your oven to 110 degrees Fahrenheit (43 degrees Celsius) or less.",
    "If you own a dehydrator, you can use it in place of the oven.",
    "Read the manual to determine what temperature setting should be used.",
    "Cover a baking sheet with wax paper.",
    "Spread the dill ferns in a single layer across the baking sheet.",
    "Place the baking sheet in the oven.",
    "If your oven runs hot, keep the oven door ajar.",
    "Allow the dill to dry for 2 to 4 hours.",
    "Check your drying dill regularly.",
    "When it crumbles easily, it is done.",
    "Remove the dill from the oven and allow it to cool.",
    "Crumble it into a small tin to use as dill weed.",
    "Separate seeds inside the flowers to use in making dill essential oil.",
    "Microwave Drying Dill Rinse the dill weed ferns in running water.",
    "Spin them in a salad spinner and pat them dry with a kitchen towel.",
    "Find a large plate that will fit in your microwave.",
    "Place two layers of paper towels on the plate.",
    "Spread the dill ferns across the plate.",
    "Place a layer of paper towel on top of the ferns.",
    "Set the plate in the microwave.",
    "Set for 4 minutes on high heat.",
    "Remove it from the microwave to check if it’s dry.",
    "If it’s not, return it to the microwave for 2 minutes.",
    "It is done once it crumbles to the touch.",
    "Let it cool, crumble it and store it in an airtight container.",
    "Microwave-dried dill will last 2 to 4 weeks.",
    "Oven and air-dried dill weed will last longer."
  ],
  "tyn_section":[
    "Water",
    "Kitchen shears",
    "Salad spinner",
    "Wax paper",
    "Paper bags",
    "Rubber bands",
    "Baking sheet",
    "Oven",
    "Microwave",
    "Kitchen towels/paper towels",
    "Herb tins",
    "Plate",
    "Dehydrator (optional)"
  ],
  "tyn_model":[
    "dill",
    "oven",
    "microwave",
    "dill ferns",
    "water",
    "salad spinner",
    "baking sheet",
    "paper towels",
    "kitchen towel",
    "rubber band",
    "dill plant",
    "kitchen shears",
    "paper bags",
    "parser",
    "paper bag",
    "airtight tin",
    "oven drying",
    "fresh water",
    "dehydrator",
    "wax paper",
    "dill weed",
    "dill essential oil",
    "microwave drying dill",
    "dill weed ferns",
    "large plate",
    "paper towel",
    "plate",
    "airtight container",
    "air-dried dill weed"
  ],
  "simple_metrics":{
    "r":0.6923076923,
    "p":0.3103448276,
    "f1":0.4285714286,
    "avg_pos":0.1379310345
  },
  "jacc_metrics_0.5":{
    "r":0.7692307692,
    "p":0.4482758621,
    "f1":0.5664488017
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8461538462,
    "p":0.6551724138,
    "f1":0.7385159011
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6923076923,
    "p":0.3103448276,
    "f1":0.4285714286
  }
}