{
  "title":"How to Kill a Fly Quickly",
  "url":"https://www.wikihow.com/Kill-a-Fly-Quickly",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Fly Control"
  ],
  "methods":[
    {
      "name":"Asphyxiating with Household Chemicals",
      "steps":[
        {
          "headline":"Choose your weapon.",
          "description":"Get a bottle of Formula 409, Febreze, Windex, or any noxious spray that will not damage the items in your house. Note: Febreze might provide the added benefit of acting as a fly deterrent.—No self-respecting fly will inhabit an area that smells fresh and clean, so it will vamoose out of there as quick as can be."
        },
        {
          "headline":"Check to make sure you have enough liquid to do the job (with overkill).",
          "description":"You may need five or six on-target squirts to accomplish the job, maybe even as many as twenty if you are a gung-ho, Rambo-style fly fighter. Make sure the bottle has enough spray to completely asphyxiate the fly or, failing that, drown the unfortunate victim."
        },
        {
          "headline":"Approach the fly.",
          "description":"Don't approach it from the front or from the side. Instead, creep up from behind. (Make sure to wear your \"sneakers.\" - They are quietly stealthy and will zip you out of there should your victim turn on you.)"
        },
        {
          "headline":"Spray the fly.",
          "description":"Keep spraying until you're sure the fly is completely dead."
        },
        {
          "headline":"Get a paper towel, or, better yet, a couple of index cards and lift the body from its resting place, the pool of death.",
          "description":"Remember: the deathly chemicals will need to be cleaned up as well."
        },
        {
          "headline":"Put the dead body outside or in the garbage.",
          "description":"You can give it a proper burial, but it would be inappropriate to \"fly\" a flag at half mast (unless you were creating a YouTube video and were really into hyperbole)."
        },
        {
          "headline":"Wash your hands.",
          "description":"Washing your hands is important after killing a fly because flies carry disease and germs. (That is about all they can carry.) You did know that flies are aerodynamically amazing, right? But, you have never heard tale of a fly being able to carry fifteen or twenty times its weight, have you? Nope, but they do carry germs."
        }
      ]
    },
    {
      "name":"Sniping with a Rubber Band",
      "steps":[
        {
          "headline":"Choose your weapon.",
          "description":"Get a medium width rubber band, about 3\" long (unstretched). Appropriate rubber band sizes for this dark operation are: #16, #18, #19, #31, #32, or #33."
        },
        {
          "headline":"Develop your rubber band shooting technique.",
          "description":"If need be, practice a few times before you hunt your fly, so that you can perfect your technique. You'll want to make a fist out of your forward hand with your thumb on top, flat and pointing forwards. Then place the rubber band on the tip of your thumb, so it's hooked in place, and pull the opposite side of the band back, with your other hand - a finger or a pinched finger and thumb. Ideally, everything is parallel and flat, so there's little chance for the band to hit your thumb or hand upon release. When you're ready, sight along the rubber band at the target, and release the band cleanly from the back hand, allowing it to shoot over your thumb towards the target. Once you have your aim right, you can work on increasing your power. Though you don't need fly-smashing contact, the rubber band cannot just barely get there. The speed and power need to be moderate, at least."
        },
        {
          "headline":"Stalk the fly.",
          "description":"Ninja style is great, if you are so inclined. Mimic a cat, try a nonchalant saunter, or just sidle up rustler-style."
        },
        {
          "headline":"Wait patiently until the fly lands on a stable object.",
          "description":"There should not be any delicate knick-knacks near the fly because these might get damaged by an errant shot."
        },
        {
          "headline":"Double check to make sure that nothing can get hurt (other than the fly) if your shot goes astray.",
          "description":""
        },
        {
          "headline":"Pull back the rubber band.",
          "description":"Make sure you achieve sufficient tension to shoot well past your target, but not so much as to risk breaking the rubber band (especially if you don't have a back-up weapon at hand)."
        },
        {
          "headline":"Sight along the rubber band, making sure that the rubber band will clear your knuckle.",
          "description":"The most common cause for an errant shot is that the rubber band deflects off a part of your body. Make sure you have a clear shot."
        },
        {
          "headline":"Take a deep breath and assume a Zen attitude (if you have one).",
          "description":""
        },
        {
          "headline":"Release the rubber band cleanly.",
          "description":"Zingo. The fly never saw it coming, never will. The rubber band goes too fast for any fly (unless you have encountered the Super Fly reincarnation from the '70s)."
        },
        {
          "headline":"Retrieve the rubber band.",
          "description":"Put it in your pocket if you have \"gotten your fly.\" If not, track the critter and take a second shot and a third and a... Well by that time, you should be getting the hang of shooting a rubber band. If not, put in a request for a wikiHow article titled \"How to Shoot a Rubber Band with Fly Killing Accuracy,\" wait for it to be published, then go into rubber band training or to rubber band boot camp (whichever the article suggests)."
        },
        {
          "headline":"Clean up the mess, though, after you score your \"hit.\"",
          "description":"Sometimes body parts are splattered on the window, wall or other backdrop. Spray the remnants with household cleaner and buff to a polish with a paper towel."
        },
        {
          "headline":"Dispose of the fly carcass properly.",
          "description":"The carcass should go to the sanitary landfill (You know flies are unsanitary, right?) via special transport vehicle (the garbage truck). Alternatively, just compost the carcass. Then the brothers and sisters can visit the burial ground more easily. (They are likely to be in the compost area anyway.)"
        },
        {
          "headline":"Wash your hands.",
          "description":""
        },
        {
          "headline":"Scout for victim #2.",
          "description":""
        }
      ]
    },
    {
      "name":"Immobilizing with Hair Spray",
      "steps":[
        {
          "headline":"Take the time to study the capabilities of your nemesis (the fly).",
          "description":"Watch Michael Dickinson's TED talk on how flies fly to gain awesome insight."
        },
        {
          "headline":"Realize that most of the maneuvering done by a fly hinges on the... well... uh... hinges on the hinges where the wings attach to the body.",
          "description":"If these are immobilized, the fly becomes a \"walk.\""
        },
        {
          "headline":"Know that hairspray is the ultimate stiffener.",
          "description":"Chemists all around the world have worked in labs for years— formulating, testing and refining stiffening products for the hair. Guess what? The hairspray does not know what it is stiffening. It indiscriminately stiffens everything it hits, fly wings and fly wing-hinges included."
        },
        {
          "headline":"Stalk your victim.",
          "description":"(Don't worry.— You will not get put on any lists for this kind of stalking.) Simply observe the fly and get in a good position to intercept the flight path of the proudly parading pesky pest."
        },
        {
          "headline":"Douse her (or him) with a good shot of hair spray.",
          "description":"Zing. You got a tumbler!... and a walker."
        },
        {
          "headline":"Trap the fly with a clear drinking glass.",
          "description":"Invert the glass and place it over the fly."
        },
        {
          "headline":"Slide an index card under the glass and the fly.",
          "description":""
        },
        {
          "headline":"Take the fly carrier (glass & index card assembly) into the bathroom.",
          "description":""
        },
        {
          "headline":"Dump the fly into the toilet and flush.",
          "description":"Bye, bye dead fly. Note: this burial at \"sea\" can be just as ceremonious as you want, but there is no real need to go out of your way. It is only a fly... walk... goner."
        }
      ]
    }
  ],
  "text":" Asphyxiating with Household Chemicals Choose your weapon. Get a bottle of Formula 409, Febreze, Windex, or any noxious spray that will not damage the items in your house. Note: Febreze might provide the added benefit of acting as a fly deterrent.—No self-respecting fly will inhabit an area that smells fresh and clean, so it will vamoose out of there as quick as can be. Check to make sure you have enough liquid to do the job (with overkill). You may need five or six on-target squirts to accomplish the job, maybe even as many as twenty if you are a gung-ho, Rambo-style fly fighter. Make sure the bottle has enough spray to completely asphyxiate the fly or, failing that, drown the unfortunate victim. Approach the fly. Don't approach it from the front or from the side. Instead, creep up from behind. (Make sure to wear your \"sneakers.\" - They are quietly stealthy and will zip you out of there should your victim turn on you.) Spray the fly. Keep spraying until you're sure the fly is completely dead. Get a paper towel, or, better yet, a couple of index cards and lift the body from its resting place, the pool of death. Remember: the deathly chemicals will need to be cleaned up as well. Put the dead body outside or in the garbage. You can give it a proper burial, but it would be inappropriate to \"fly\" a flag at half mast (unless you were creating a YouTube video and were really into hyperbole). Wash your hands. Washing your hands is important after killing a fly because flies carry disease and germs. (That is about all they can carry.) You did know that flies are aerodynamically amazing, right? But, you have never heard tale of a fly being able to carry fifteen or twenty times its weight, have you? Nope, but they do carry germs. Sniping with a Rubber Band Choose your weapon. Get a medium width rubber band, about 3\" long (unstretched). Appropriate rubber band sizes for this dark operation are: #16, #18, #19, #31, #32, or #33. Develop your rubber band shooting technique. If need be, practice a few times before you hunt your fly, so that you can perfect your technique. You'll want to make a fist out of your forward hand with your thumb on top, flat and pointing forwards. Then place the rubber band on the tip of your thumb, so it's hooked in place, and pull the opposite side of the band back, with your other hand - a finger or a pinched finger and thumb. Ideally, everything is parallel and flat, so there's little chance for the band to hit your thumb or hand upon release. When you're ready, sight along the rubber band at the target, and release the band cleanly from the back hand, allowing it to shoot over your thumb towards the target. Once you have your aim right, you can work on increasing your power. Though you don't need fly-smashing contact, the rubber band cannot just barely get there. The speed and power need to be moderate, at least. Stalk the fly. Ninja style is great, if you are so inclined. Mimic a cat, try a nonchalant saunter, or just sidle up rustler-style. Wait patiently until the fly lands on a stable object. There should not be any delicate knick-knacks near the fly because these might get damaged by an errant shot. Double check to make sure that nothing can get hurt (other than the fly) if your shot goes astray.  Pull back the rubber band. Make sure you achieve sufficient tension to shoot well past your target, but not so much as to risk breaking the rubber band (especially if you don't have a back-up weapon at hand). Sight along the rubber band, making sure that the rubber band will clear your knuckle. The most common cause for an errant shot is that the rubber band deflects off a part of your body. Make sure you have a clear shot. Take a deep breath and assume a Zen attitude (if you have one).  Release the rubber band cleanly. Zingo. The fly never saw it coming, never will. The rubber band goes too fast for any fly (unless you have encountered the Super Fly reincarnation from the '70s). Retrieve the rubber band. Put it in your pocket if you have \"gotten your fly.\" If not, track the critter and take a second shot and a third and a... Well by that time, you should be getting the hang of shooting a rubber band. If not, put in a request for a wikiHow article titled \"How to Shoot a Rubber Band with Fly Killing Accuracy,\" wait for it to be published, then go into rubber band training or to rubber band boot camp (whichever the article suggests). Clean up the mess, though, after you score your \"hit.\" Sometimes body parts are splattered on the window, wall or other backdrop. Spray the remnants with household cleaner and buff to a polish with a paper towel. Dispose of the fly carcass properly. The carcass should go to the sanitary landfill (You know flies are unsanitary, right?) via special transport vehicle (the garbage truck). Alternatively, just compost the carcass. Then the brothers and sisters can visit the burial ground more easily. (They are likely to be in the compost area anyway.) Wash your hands.  Scout for victim #2.  Immobilizing with Hair Spray Take the time to study the capabilities of your nemesis (the fly). Watch Michael Dickinson's TED talk on how flies fly to gain awesome insight. Realize that most of the maneuvering done by a fly hinges on the... well... uh... hinges on the hinges where the wings attach to the body. If these are immobilized, the fly becomes a \"walk.\" Know that hairspray is the ultimate stiffener. Chemists all around the world have worked in labs for years— formulating, testing and refining stiffening products for the hair. Guess what? The hairspray does not know what it is stiffening. It indiscriminately stiffens everything it hits, fly wings and fly wing-hinges included. Stalk your victim. (Don't worry.— You will not get put on any lists for this kind of stalking.) Simply observe the fly and get in a good position to intercept the flight path of the proudly parading pesky pest. Douse her (or him) with a good shot of hair spray. Zing. You got a tumbler!... and a walker. Trap the fly with a clear drinking glass. Invert the glass and place it over the fly. Slide an index card under the glass and the fly.  Take the fly carrier (glass & index card assembly) into the bathroom.  Dump the fly into the toilet and flush. Bye, bye dead fly. Note: this burial at \"sea\" can be just as ceremonious as you want, but there is no real need to go out of your way. It is only a fly... walk... goner.",
  "sentences":[
    " Asphyxiating with Household Chemicals Choose your weapon.",
    "Get a bottle of Formula 409, Febreze, Windex, or any noxious spray that will not damage the items in your house.",
    "Note: Febreze might provide the added benefit of acting as a fly deterrent.—No self-respecting fly will inhabit an area that smells fresh and clean, so it will vamoose out of there as quick as can be.",
    "Check to make sure you have enough liquid to do the job (with overkill).",
    "You may need five or six on-target squirts to accomplish the job, maybe even as many as twenty if you are a gung-ho, Rambo-style fly fighter.",
    "Make sure the bottle has enough spray to completely asphyxiate the fly or, failing that, drown the unfortunate victim.",
    "Approach the fly.",
    "Don't approach it from the front or from the side.",
    "Instead, creep up from behind.",
    "(Make sure to wear your \"sneakers.\"",
    "- They are quietly stealthy and will zip you out of there should your victim turn on you.)",
    "Spray the fly.",
    "Keep spraying until you're sure the fly is completely dead.",
    "Get a paper towel, or, better yet, a couple of index cards and lift the body from its resting place, the pool of death.",
    "Remember: the deathly chemicals will need to be cleaned up as well.",
    "Put the dead body outside or in the garbage.",
    "You can give it a proper burial, but it would be inappropriate to \"fly\" a flag at half mast (unless you were creating a YouTube video and were really into hyperbole).",
    "Wash your hands.",
    "Washing your hands is important after killing a fly because flies carry disease and germs.",
    "(That is about all they can carry.)",
    "You did know that flies are aerodynamically amazing, right?",
    "But, you have never heard tale of a fly being able to carry fifteen or twenty times its weight, have you?",
    "Nope, but they do carry germs.",
    "Sniping with a Rubber Band Choose your weapon.",
    "Get a medium width rubber band, about 3\" long (unstretched).",
    "Appropriate rubber band sizes for this dark operation are: #16, #18, #19, #31, #32, or #33.",
    "Develop your rubber band shooting technique.",
    "If need be, practice a few times before you hunt your fly, so that you can perfect your technique.",
    "You'll want to make a fist out of your forward hand with your thumb on top, flat and pointing forwards.",
    "Then place the rubber band on the tip of your thumb, so it's hooked in place, and pull the opposite side of the band back, with your other hand - a finger or a pinched finger and thumb.",
    "Ideally, everything is parallel and flat, so there's little chance for the band to hit your thumb or hand upon release.",
    "When you're ready, sight along the rubber band at the target, and release the band cleanly from the back hand, allowing it to shoot over your thumb towards the target.",
    "Once you have your aim right, you can work on increasing your power.",
    "Though you don't need fly-smashing contact, the rubber band cannot just barely get there.",
    "The speed and power need to be moderate, at least.",
    "Stalk the fly.",
    "Ninja style is great, if you are so inclined.",
    "Mimic a cat, try a nonchalant saunter, or just sidle up rustler-style.",
    "Wait patiently until the fly lands on a stable object.",
    "There should not be any delicate knick-knacks near the fly because these might get damaged by an errant shot.",
    "Double check to make sure that nothing can get hurt (other than the fly) if your shot goes astray.",
    "Pull back the rubber band.",
    "Make sure you achieve sufficient tension to shoot well past your target, but not so much as to risk breaking the rubber band (especially if you don't have a back-up weapon at hand).",
    "Sight along the rubber band, making sure that the rubber band will clear your knuckle.",
    "The most common cause for an errant shot is that the rubber band deflects off a part of your body.",
    "Make sure you have a clear shot.",
    "Take a deep breath and assume a Zen attitude (if you have one).",
    "Release the rubber band cleanly.",
    "Zingo.",
    "The fly never saw it coming, never will.",
    "The rubber band goes too fast for any fly (unless you have encountered the Super Fly reincarnation from the '70s).",
    "Retrieve the rubber band.",
    "Put it in your pocket if you have \"gotten your fly.\"",
    "If not, track the critter and take a second shot and a third and a... Well by that time, you should be getting the hang of shooting a rubber band.",
    "If not, put in a request for a wikiHow article titled \"How to Shoot a Rubber Band with Fly Killing Accuracy,\" wait for it to be published, then go into rubber band training or to rubber band boot camp (whichever the article suggests).",
    "Clean up the mess, though, after you score your \"hit.\"",
    "Sometimes body parts are splattered on the window, wall or other backdrop.",
    "Spray the remnants with household cleaner and buff to a polish with a paper towel.",
    "Dispose of the fly carcass properly.",
    "The carcass should go to the sanitary landfill (You know flies are unsanitary, right?)",
    "via special transport vehicle (the garbage truck).",
    "Alternatively, just compost the carcass.",
    "Then the brothers and sisters can visit the burial ground more easily.",
    "(They are likely to be in the compost area anyway.)",
    "Wash your hands.",
    "Scout for victim #2.",
    "Immobilizing with Hair Spray Take the time to study the capabilities of your nemesis (the fly).",
    "Watch Michael Dickinson's TED talk on how flies fly to gain awesome insight.",
    "Realize that most of the maneuvering done by a fly hinges on the... well... uh... hinges on the hinges where the wings attach to the body.",
    "If these are immobilized, the fly becomes a \"walk.\"",
    "Know that hairspray is the ultimate stiffener.",
    "Chemists all around the world have worked in labs for years— formulating, testing and refining stiffening products for the hair.",
    "Guess what?",
    "The hairspray does not know what it is stiffening.",
    "It indiscriminately stiffens everything it hits, fly wings and fly wing-hinges included.",
    "Stalk your victim.",
    "(Don't worry.— You will not get put on any lists for this kind of stalking.)",
    "Simply observe the fly and get in a good position to intercept the flight path of the proudly parading pesky pest.",
    "Douse her (or him) with a good shot of hair spray.",
    "Zing.",
    "You got a tumbler!...",
    "and a walker.",
    "Trap the fly with a clear drinking glass.",
    "Invert the glass and place it over the fly.",
    "Slide an index card under the glass and the fly.",
    "Take the fly carrier (glass & index card assembly) into the bathroom.",
    "Dump the fly into the toilet and flush.",
    "Bye, bye dead fly.",
    "Note: this burial at \"sea\" can be just as ceremonious as you want, but there is no real need to go out of your way.",
    "It is only a fly... walk... goner."
  ],
  "tyn_section":[
    "Method One: Using Household Chemicals",
    "Household chemical in a spray bottle",
    "Paper towels",
    "Index cards (optional)",
    "Method Two: Using a Rubber Band",
    "Rubber band(s)— #16, #18, #19, #31, #32, #33, or other size— ",
    "see size chart",
    "Surface cleaner",
    "Method Three: Using Hair Spray",
    "Hair spray",
    "Clear drinking glass",
    "Index card"
  ],
  "tyn_model":[
    "rubber band",
    "fly",
    "febreze",
    "paper towel",
    "flies",
    "compost",
    "hair spray",
    "hairspray",
    "index card",
    "formula 409",
    "windex",
    "liquid",
    "bottle",
    "spray",
    "sneakers",
    "index cards",
    "rubber",
    "super fly",
    "household cleaner",
    "garbage truck",
    "— formulating",
    "— you",
    "tumbler",
    "clear drinking glass",
    "fly carrier",
    "glass",
    "toilet"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.1111111111,
    "f1":0.1538461538,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1851851852,
    "f1":0.2380952381
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.3333333333,
    "f1":0.4444444444
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.1481481481,
    "f1":0.2051282051
  }
}