{
  "title":"How to Emboss Leather",
  "url":"https://www.wikihow.com/Emboss-Leather",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Leatherworking"
  ],
  "methods":[
    {
      "name":"Clamp Embossing Leather",
      "steps":[
        {
          "headline":"Purchase unfinished leather at a craft supply store.",
          "description":"Embossing doesn’t work on pre-treated clothing or accessories."
        },
        {
          "headline":"Find a sturdy metal shape or a metal leather stamp.",
          "description":"You can use a charm or purchase a leather stamp in the design of your choice online. You can order custom leather stamps through sellers on Etsy. If you use a metal charm, make sure it has cut edges, rather than a tapered design. It will make your shape appear more pronounced in the leather."
        },
        {
          "headline":"Smooth your unfinished leather section onto a worktable.",
          "description":"The front side should be facing up. It must be near the edge of a table on which you can hook a strong C-clamp."
        },
        {
          "headline":"Dampen a sponge.",
          "description":"You don’t want it to be sopping wet, so squeeze it out several times."
        },
        {
          "headline":"Brush the leather with the sponge in one even layer.",
          "description":"Move the leather so that it can fit under the clamp."
        },
        {
          "headline":"Place the flat metal stamp or metal object on the leather where you want the embossed design to be.",
          "description":""
        },
        {
          "headline":"Set the top foot of the C-clamp in the center of the metal object.",
          "description":"Crank the clamp until it is clamped as far as it will go."
        },
        {
          "headline":"Remove the C-clamp after 20 minutes.",
          "description":"Seal the leather with leather finish, if you want to improve the durability of the design and surface of the leather. Leather finish should be applied after all embossing is complete. It should also be done before you sew or complete assembly on a leather project."
        }
      ]
    },
    {
      "name":"Stamping Leather",
      "steps":[
        {
          "headline":"Purchase a leather stamping set online or at a craft store.",
          "description":"Buy 3-D stamps with a cylinder that can be inserted into any of the flat stamps. You can order custom stamps online or start with a set of alphabet stamps. Make sure the metal cylinder will match your stamps. The cylinder is the piece you use to pound the shape of the stamp into the leather."
        },
        {
          "headline":"Place your piece of unfinished leather on a flat worktable.",
          "description":"Make sure the front of the leather is facing up. Decide where you want to emboss your design."
        },
        {
          "headline":"Wipe your leather surface with a slightly damp sponge.",
          "description":"If the water changes the color of the leather drastically, wait for it to dry a little."
        },
        {
          "headline":"Place the metal stamp on your leather where you want the design to be.",
          "description":""
        },
        {
          "headline":"Insert the metal cylinder into the center of the stamp.",
          "description":"Hold it firmly with one hand."
        },
        {
          "headline":"Hit the top of the stamp several times with your wooden mallet.",
          "description":"Be careful not to move the stamp while you hit it. You can pick up the stamp, see if the impression is inlaid deep enough and align it for stamping again. It requires some practice to learn how hard to strike the stamp."
        },
        {
          "headline":"Repeat these steps with other stamps if you want to make a more intricate design.",
          "description":"Use a leather-finishing product when you have completed you embossing and before you assemble your final project. You can also apply leather paint to the embossed design to give it more flair. Any alcohol-based paint can be applied before the leather is finished."
        }
      ]
    }
  ],
  "text":" Clamp Embossing Leather Purchase unfinished leather at a craft supply store. Embossing doesn’t work on pre-treated clothing or accessories. Find a sturdy metal shape or a metal leather stamp. You can use a charm or purchase a leather stamp in the design of your choice online. You can order custom leather stamps through sellers on Etsy. If you use a metal charm, make sure it has cut edges, rather than a tapered design. It will make your shape appear more pronounced in the leather. Smooth your unfinished leather section onto a worktable. The front side should be facing up. It must be near the edge of a table on which you can hook a strong C-clamp. Dampen a sponge. You don’t want it to be sopping wet, so squeeze it out several times. Brush the leather with the sponge in one even layer. Move the leather so that it can fit under the clamp. Place the flat metal stamp or metal object on the leather where you want the embossed design to be.  Set the top foot of the C-clamp in the center of the metal object. Crank the clamp until it is clamped as far as it will go. Remove the C-clamp after 20 minutes. Seal the leather with leather finish, if you want to improve the durability of the design and surface of the leather. Leather finish should be applied after all embossing is complete. It should also be done before you sew or complete assembly on a leather project. Stamping Leather Purchase a leather stamping set online or at a craft store. Buy 3-D stamps with a cylinder that can be inserted into any of the flat stamps. You can order custom stamps online or start with a set of alphabet stamps. Make sure the metal cylinder will match your stamps. The cylinder is the piece you use to pound the shape of the stamp into the leather. Place your piece of unfinished leather on a flat worktable. Make sure the front of the leather is facing up. Decide where you want to emboss your design. Wipe your leather surface with a slightly damp sponge. If the water changes the color of the leather drastically, wait for it to dry a little. Place the metal stamp on your leather where you want the design to be.  Insert the metal cylinder into the center of the stamp. Hold it firmly with one hand. Hit the top of the stamp several times with your wooden mallet. Be careful not to move the stamp while you hit it. You can pick up the stamp, see if the impression is inlaid deep enough and align it for stamping again. It requires some practice to learn how hard to strike the stamp. Repeat these steps with other stamps if you want to make a more intricate design. Use a leather-finishing product when you have completed you embossing and before you assemble your final project. You can also apply leather paint to the embossed design to give it more flair. Any alcohol-based paint can be applied before the leather is finished.",
  "sentences":[
    " Clamp Embossing Leather Purchase unfinished leather at a craft supply store.",
    "Embossing doesn’t work on pre-treated clothing or accessories.",
    "Find a sturdy metal shape or a metal leather stamp.",
    "You can use a charm or purchase a leather stamp in the design of your choice online.",
    "You can order custom leather stamps through sellers on Etsy.",
    "If you use a metal charm, make sure it has cut edges, rather than a tapered design.",
    "It will make your shape appear more pronounced in the leather.",
    "Smooth your unfinished leather section onto a worktable.",
    "The front side should be facing up.",
    "It must be near the edge of a table on which you can hook a strong C-clamp.",
    "Dampen a sponge.",
    "You don’t want it to be sopping wet, so squeeze it out several times.",
    "Brush the leather with the sponge in one even layer.",
    "Move the leather so that it can fit under the clamp.",
    "Place the flat metal stamp or metal object on the leather where you want the embossed design to be.",
    "Set the top foot of the C-clamp in the center of the metal object.",
    "Crank the clamp until it is clamped as far as it will go.",
    "Remove the C-clamp after 20 minutes.",
    "Seal the leather with leather finish, if you want to improve the durability of the design and surface of the leather.",
    "Leather finish should be applied after all embossing is complete.",
    "It should also be done before you sew or complete assembly on a leather project.",
    "Stamping Leather Purchase a leather stamping set online or at a craft store.",
    "Buy 3-D stamps with a cylinder that can be inserted into any of the flat stamps.",
    "You can order custom stamps online or start with a set of alphabet stamps.",
    "Make sure the metal cylinder will match your stamps.",
    "The cylinder is the piece you use to pound the shape of the stamp into the leather.",
    "Place your piece of unfinished leather on a flat worktable.",
    "Make sure the front of the leather is facing up.",
    "Decide where you want to emboss your design.",
    "Wipe your leather surface with a slightly damp sponge.",
    "If the water changes the color of the leather drastically, wait for it to dry a little.",
    "Place the metal stamp on your leather where you want the design to be.",
    "Insert the metal cylinder into the center of the stamp.",
    "Hold it firmly with one hand.",
    "Hit the top of the stamp several times with your wooden mallet.",
    "Be careful not to move the stamp while you hit it.",
    "You can pick up the stamp, see if the impression is inlaid deep enough and align it for stamping again.",
    "It requires some practice to learn how hard to strike the stamp.",
    "Repeat these steps with other stamps if you want to make a more intricate design.",
    "Use a leather-finishing product when you have completed you embossing and before you assemble your final project.",
    "You can also apply leather paint to the embossed design to give it more flair.",
    "Any alcohol-based paint can be applied before the leather is finished."
  ],
  "tyn_section":[
    "Metal shape",
    "Sponge",
    "Water",
    "C-clamp",
    "Wood mallet",
    "Leather stamps",
    "Leather paint",
    "Leather finish"
  ],
  "tyn_model":[
    "sponge",
    "charm",
    "stamps",
    "stamping leather",
    "leather stamping set",
    "flat worktable.",
    "water",
    "wooden mallet",
    "leather paint",
    "paint"
  ],
  "simple_metrics":{
    "r":0.375,
    "p":0.3,
    "f1":0.3333333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.5,
    "f1":0.5
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.7,
    "f1":0.724137931
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.3,
    "f1":0.3333333333
  }
}