{
  "title":"How to Insulate Your Home",
  "url":"https://www.wikihow.com/Insulate-Your-Home",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Insulation"
  ],
  "methods":[
    {
      "name":"Installing Insulation in Exposed Walls and Attics",
      "steps":[
        {
          "headline":"Look up the minimum R-value for insulation in your area.",
          "description":"The R-value of insulation refers to the insulating power, or thermal resistance, of the insulation you’re buying. The higher the number is for the R-value, the more effective the insulation will be. The R-value you need depends on your climate, the type of heating and cooling system you have, and which part of the house you want to insulate. Look at an online guide or ask an employee at a hardware store to help you determine which insulation you need for your home. For insulating walls, you usually need insulation that’s R-13. Attics tend to need anywhere between R-30 and R-49 insulation. Basements usually require a rating between R-11 and R-25. If you want to insulate your floor, use R-12 to R-30 insulation depending on your climate zone."
        },
        {
          "headline":"Determine the area and stud distance of the area where you’re installing insulation.",
          "description":"Measure the length and height of the wall and multiply them together to find the area of the wall. Then measure the distance between 2 of the vertical studs on the wall so you know how wide your insulation needs to be. The stud distance is usually 16 or 24 inches (41 or 61 cm) apart. If you’re insulating an attic, measure the length and width of the attic’s floor instead. Rather than measuring the distance for the wall studs, find the length between 2 of the floor joists."
        },
        {
          "headline":"Choose batts or foam boards for your walls.",
          "description":"Insulation batts are thick pieces of fiberglass or natural fibers that come in rolls or pre-cut strips, and they work best for insulation walls, floors, and ceilings. Insulated foam boards are large panels that work best for foundation walls, floors, and ceilings. Choose insulation that has the R-value your home requires, and check the packaging to find out how much area a single piece covers so you can get enough for the entire area you’re insulating. You can buy insulation from home improvement stores or online. Get insulation that has vapor barriers on one side to prevent moisture from getting through the insulation and getting trapped in your walls."
        },
        {
          "headline":"Wear long sleeves, gloves, and face protection before installing insulation.",
          "description":"Most insulation is made of fiberglass, which can cause irritation if you come into contact with it. Before you start, put on pants and a long-sleeved shirt to cover as much as your skin as possible. Then wear work gloves, goggles that cover your eyes completely, and a face mask so you don’t inhale any fiberglass particles."
        },
        {
          "headline":"Cut the insulation with a utility knife so it can fit the height of your walls.",
          "description":"Unroll the insulation so the moisture vapor is face-up, and measure out the length you need with a tape measure. Lay a straightedge across the top of the insulation and press it down to compress the foam. Push the blade of a utility knife into the insulation and carefully pull it toward you to slice through it. You can also use an insulation knife to saw through the insulation. You can buy insulation knives from your local hardware store. You can also cut foam boards with a utility knife."
        },
        {
          "headline":"Push the insulation between your studs so it fits snugly.",
          "description":"Guide the insulation into the space between your studs so the vapor barrier faces the interior side of your home. Gently push the insulation into the space between your studs without compressing the foam, or else it won’t be as effective. Make sure the front of the insulation is flush with the front of the studs when you’re finished putting it in. Compressed insulation won’t work to its full thermal resistance rating. If there’s an electrical box or a fixture in the wall, cut the insulation so it fits tightly around it.Tip: When you install insulation on an attic floor, put the vapor barrier face-down or else it won’t be effective."
        },
        {
          "headline":"Staple the insulation to the sides of the studs to keep it in place.",
          "description":"Grab the edge of the insulation or moisture barrier, and hold it tightly against the side of the wall stud. Drive staples into the wall stud every 6 inches (15 cm) along the stud. Repeat the process on the other side of the insulation so it’s securely in place. Some insulation is labeled “compression-fit” and doesn’t need to be stapled. You can also staple the insulation to the front of the wall stud, but it could affect how drywall sits on it."
        }
      ]
    },
    {
      "name":"Sealing Common Problem Areas",
      "steps":[
        {
          "headline":"Put weatherstripping around doors and windows to prevent drafts.",
          "description":"Weatherstripping goes around the perimeter of your doors and windows and helps block air from coming through the seams. Look for weatherstripping with adhesive backing and cut it to the height you need for the seam of your door or window. Take the backing off of the weatherstripping and press it into place to secure it. You can buy weatherstripping from your local home improvement store. You can also purchase weatherstripping that nails or screws into the side of the door frame as well."
        },
        {
          "headline":"Add sealant around gaps in your floors and walls.",
          "description":"There are usually small cracks or gaps in the corners between your floors and walls, which could lead to heat loss. Open a tube of silicone sealant and squeeze a small line of it into the corners of your floor to fill the gap. Smooth out the silicone with your fingertip or a sealant scraper to push it further into the gap to help it seal better. You can also use caulk in the same way to seal the gaps."
        },
        {
          "headline":"Put door sweeps on exterior doors to keep air from coming in.",
          "description":"Door sweeps cover the space between your floor and the bottom of the door to prevent drafts from blowing under them. If you get a door sweep with an adhesive back, simply cut it to the width of your door, peel off the backing, and attach it to the bottom. Otherwise, you may have to nail it into the door with the provided hardware. You can buy door sweeps from your local hardware store."
        },
        {
          "headline":"Put thick curtains in front of your windows to prevent heat loss.",
          "description":"When you leave your windows uncovered, they can transfer cold air inside your home. Hang up thick, dark curtains in front of your windows and keep them closed whenever you want to keep your house warm. The curtains will block the cold air from coming in any further so it doesn’t affect the temperature of your home.Tip: Leave your curtains open when it’s sunny so the sunlight can naturally warm up your room so you don’t have to use as much energy to heat it."
        },
        {
          "headline":"Cover hard floors with rugs or carpeting so they stay warm.",
          "description":"Hard floors, such as tile, laminate, or wood, can absorb heat and make your home less efficient. Lay out rugs, carpets, or blankets to cover exposed flooring to keep the heat in your home. Pick a rug or carpet that matches the style of the rest of your room and lay it out to cover as much of the floor as you can. Uninsulated floors can cause up to 10% of your home’s heat loss."
        },
        {
          "headline":"Have double-pane windows installed to prevent air leaks.",
          "description":"Single-pane windows only have 1 piece of glass, which makes it easier for cold air to transfer inside and hot air to transfer out. Double-pane windows have a second piece of glass to the cold and hot air can’t transfer between the panes. Check the windows in your home to see if they’re single-pane and contact a window specialist to replace them for you. If can’t replace your windows, you can also get clear plastic window film that seals onto the frame to prevent heat from escaping."
        }
      ]
    },
    {
      "name":"Insulating Existing Walls",
      "steps":[
        {
          "headline":"Consider hiring a contractor to install insulation in finished walls.",
          "description":"While you can install insulation in finished walls on your own, it can be difficult since you have to cut through your existing drywall. There is also special equipment that you need to rent if you want to do it on your own. If you don’t feel comfortable cutting into your walls, find an insulation service near you and ask for a price quote to find out how much it would cost."
        },
        {
          "headline":"Inject expanding foam insulation into your wall for the most effective treatment.",
          "description":"Expanding foam increases in size once you inject it into your walls to seal the areas between the wall studs perfectly. Buy or rent an injection foam machine and wear disposable coveralls with goggles and a face mask to protect yourself. Drill a ⁄2 in (1.3 cm) hole at the top of your wall and put the machine’s hose through it. Turn the machine on to spread the foam between the studs. Continue working around your room between each of the studs. Injection foam usually requires a contractor to install safely, but you may be able to rent a machine from hardware stores to do it on your own. You can either drill through your exterior siding or your inside walls to inject the foam."
        },
        {
          "headline":"Blow in loose-fill insulation if you want to be minimally invasive.",
          "description":"Rent a blower machine from a hardware store with enough loose-fill insulation for your home. Cut holes in your wall that are large enough for the blower’s hose between each of the studs. Feed the loose-fill insulation into the machine and position the hose in the holes. Turn on the machine to blow the loose-fill into your walls until it’s tightly packed. Loose-fill insulation is made from small chunks either fiberglass or flame-retardant cellulose material that settle in your walls. Loose-fill insulation can settle and compress over time, so it may not be as effective as it gets older."
        },
        {
          "headline":"Remove the existing drywall to install rolls of fiberglass insulation.",
          "description":"Use a drywall saw or a utility knife to cut through the walls you already have and remove them completely. Get rolls of fiberglass insulation that have a vapor barrier so you have enough to insulate the room. Push the insulation into your wall so it fits snugly and sits flush with the studs. Staple the insulation in place before installing new drywall. Only tear down your existing drywall if you can’t use loose-fill or expanding foam insulation."
        }
      ]
    }
  ],
  "text":" Installing Insulation in Exposed Walls and Attics Look up the minimum R-value for insulation in your area. The R-value of insulation refers to the insulating power, or thermal resistance, of the insulation you’re buying. The higher the number is for the R-value, the more effective the insulation will be. The R-value you need depends on your climate, the type of heating and cooling system you have, and which part of the house you want to insulate. Look at an online guide or ask an employee at a hardware store to help you determine which insulation you need for your home. For insulating walls, you usually need insulation that’s R-13. Attics tend to need anywhere between R-30 and R-49 insulation. Basements usually require a rating between R-11 and R-25. If you want to insulate your floor, use R-12 to R-30 insulation depending on your climate zone. Determine the area and stud distance of the area where you’re installing insulation. Measure the length and height of the wall and multiply them together to find the area of the wall. Then measure the distance between 2 of the vertical studs on the wall so you know how wide your insulation needs to be. The stud distance is usually 16 or 24 inches (41 or 61 cm) apart. If you’re insulating an attic, measure the length and width of the attic’s floor instead. Rather than measuring the distance for the wall studs, find the length between 2 of the floor joists. Choose batts or foam boards for your walls. Insulation batts are thick pieces of fiberglass or natural fibers that come in rolls or pre-cut strips, and they work best for insulation walls, floors, and ceilings. Insulated foam boards are large panels that work best for foundation walls, floors, and ceilings. Choose insulation that has the R-value your home requires, and check the packaging to find out how much area a single piece covers so you can get enough for the entire area you’re insulating. You can buy insulation from home improvement stores or online. Get insulation that has vapor barriers on one side to prevent moisture from getting through the insulation and getting trapped in your walls. Wear long sleeves, gloves, and face protection before installing insulation. Most insulation is made of fiberglass, which can cause irritation if you come into contact with it. Before you start, put on pants and a long-sleeved shirt to cover as much as your skin as possible. Then wear work gloves, goggles that cover your eyes completely, and a face mask so you don’t inhale any fiberglass particles. Cut the insulation with a utility knife so it can fit the height of your walls. Unroll the insulation so the moisture vapor is face-up, and measure out the length you need with a tape measure. Lay a straightedge across the top of the insulation and press it down to compress the foam. Push the blade of a utility knife into the insulation and carefully pull it toward you to slice through it. You can also use an insulation knife to saw through the insulation. You can buy insulation knives from your local hardware store. You can also cut foam boards with a utility knife. Push the insulation between your studs so it fits snugly. Guide the insulation into the space between your studs so the vapor barrier faces the interior side of your home. Gently push the insulation into the space between your studs without compressing the foam, or else it won’t be as effective. Make sure the front of the insulation is flush with the front of the studs when you’re finished putting it in. Compressed insulation won’t work to its full thermal resistance rating. If there’s an electrical box or a fixture in the wall, cut the insulation so it fits tightly around it.Tip: When you install insulation on an attic floor, put the vapor barrier face-down or else it won’t be effective. Staple the insulation to the sides of the studs to keep it in place. Grab the edge of the insulation or moisture barrier, and hold it tightly against the side of the wall stud. Drive staples into the wall stud every 6 inches (15 cm) along the stud. Repeat the process on the other side of the insulation so it’s securely in place. Some insulation is labeled “compression-fit” and doesn’t need to be stapled. You can also staple the insulation to the front of the wall stud, but it could affect how drywall sits on it. Sealing Common Problem Areas Put weatherstripping around doors and windows to prevent drafts. Weatherstripping goes around the perimeter of your doors and windows and helps block air from coming through the seams. Look for weatherstripping with adhesive backing and cut it to the height you need for the seam of your door or window. Take the backing off of the weatherstripping and press it into place to secure it. You can buy weatherstripping from your local home improvement store. You can also purchase weatherstripping that nails or screws into the side of the door frame as well. Add sealant around gaps in your floors and walls. There are usually small cracks or gaps in the corners between your floors and walls, which could lead to heat loss. Open a tube of silicone sealant and squeeze a small line of it into the corners of your floor to fill the gap. Smooth out the silicone with your fingertip or a sealant scraper to push it further into the gap to help it seal better. You can also use caulk in the same way to seal the gaps. Put door sweeps on exterior doors to keep air from coming in. Door sweeps cover the space between your floor and the bottom of the door to prevent drafts from blowing under them. If you get a door sweep with an adhesive back, simply cut it to the width of your door, peel off the backing, and attach it to the bottom. Otherwise, you may have to nail it into the door with the provided hardware. You can buy door sweeps from your local hardware store. Put thick curtains in front of your windows to prevent heat loss. When you leave your windows uncovered, they can transfer cold air inside your home. Hang up thick, dark curtains in front of your windows and keep them closed whenever you want to keep your house warm. The curtains will block the cold air from coming in any further so it doesn’t affect the temperature of your home.Tip: Leave your curtains open when it’s sunny so the sunlight can naturally warm up your room so you don’t have to use as much energy to heat it. Cover hard floors with rugs or carpeting so they stay warm. Hard floors, such as tile, laminate, or wood, can absorb heat and make your home less efficient. Lay out rugs, carpets, or blankets to cover exposed flooring to keep the heat in your home. Pick a rug or carpet that matches the style of the rest of your room and lay it out to cover as much of the floor as you can. Uninsulated floors can cause up to 10% of your home’s heat loss. Have double-pane windows installed to prevent air leaks. Single-pane windows only have 1 piece of glass, which makes it easier for cold air to transfer inside and hot air to transfer out. Double-pane windows have a second piece of glass to the cold and hot air can’t transfer between the panes. Check the windows in your home to see if they’re single-pane and contact a window specialist to replace them for you. If can’t replace your windows, you can also get clear plastic window film that seals onto the frame to prevent heat from escaping. Insulating Existing Walls Consider hiring a contractor to install insulation in finished walls. While you can install insulation in finished walls on your own, it can be difficult since you have to cut through your existing drywall. There is also special equipment that you need to rent if you want to do it on your own. If you don’t feel comfortable cutting into your walls, find an insulation service near you and ask for a price quote to find out how much it would cost. Inject expanding foam insulation into your wall for the most effective treatment. Expanding foam increases in size once you inject it into your walls to seal the areas between the wall studs perfectly. Buy or rent an injection foam machine and wear disposable coveralls with goggles and a face mask to protect yourself. Drill a ⁄2 in (1.3 cm) hole at the top of your wall and put the machine’s hose through it. Turn the machine on to spread the foam between the studs. Continue working around your room between each of the studs. Injection foam usually requires a contractor to install safely, but you may be able to rent a machine from hardware stores to do it on your own. You can either drill through your exterior siding or your inside walls to inject the foam. Blow in loose-fill insulation if you want to be minimally invasive. Rent a blower machine from a hardware store with enough loose-fill insulation for your home. Cut holes in your wall that are large enough for the blower’s hose between each of the studs. Feed the loose-fill insulation into the machine and position the hose in the holes. Turn on the machine to blow the loose-fill into your walls until it’s tightly packed. Loose-fill insulation is made from small chunks either fiberglass or flame-retardant cellulose material that settle in your walls. Loose-fill insulation can settle and compress over time, so it may not be as effective as it gets older. Remove the existing drywall to install rolls of fiberglass insulation. Use a drywall saw or a utility knife to cut through the walls you already have and remove them completely. Get rolls of fiberglass insulation that have a vapor barrier so you have enough to insulate the room. Push the insulation into your wall so it fits snugly and sits flush with the studs. Staple the insulation in place before installing new drywall. Only tear down your existing drywall if you can’t use loose-fill or expanding foam insulation.",
  "sentences":[
    " Installing Insulation in Exposed Walls and Attics Look up the minimum R-value for insulation in your area.",
    "The R-value of insulation refers to the insulating power, or thermal resistance, of the insulation you’re buying.",
    "The higher the number is for the R-value, the more effective the insulation will be.",
    "The R-value you need depends on your climate, the type of heating and cooling system you have, and which part of the house you want to insulate.",
    "Look at an online guide or ask an employee at a hardware store to help you determine which insulation you need for your home.",
    "For insulating walls, you usually need insulation that’s R-13.",
    "Attics tend to need anywhere between R-30 and R-49 insulation.",
    "Basements usually require a rating between R-11 and R-25.",
    "If you want to insulate your floor, use R-12 to R-30 insulation depending on your climate zone.",
    "Determine the area and stud distance of the area where you’re installing insulation.",
    "Measure the length and height of the wall and multiply them together to find the area of the wall.",
    "Then measure the distance between 2 of the vertical studs on the wall so you know how wide your insulation needs to be.",
    "The stud distance is usually 16 or 24 inches (41 or 61 cm) apart.",
    "If you’re insulating an attic, measure the length and width of the attic’s floor instead.",
    "Rather than measuring the distance for the wall studs, find the length between 2 of the floor joists.",
    "Choose batts or foam boards for your walls.",
    "Insulation batts are thick pieces of fiberglass or natural fibers that come in rolls or pre-cut strips, and they work best for insulation walls, floors, and ceilings.",
    "Insulated foam boards are large panels that work best for foundation walls, floors, and ceilings.",
    "Choose insulation that has the R-value your home requires, and check the packaging to find out how much area a single piece covers so you can get enough for the entire area you’re insulating.",
    "You can buy insulation from home improvement stores or online.",
    "Get insulation that has vapor barriers on one side to prevent moisture from getting through the insulation and getting trapped in your walls.",
    "Wear long sleeves, gloves, and face protection before installing insulation.",
    "Most insulation is made of fiberglass, which can cause irritation if you come into contact with it.",
    "Before you start, put on pants and a long-sleeved shirt to cover as much as your skin as possible.",
    "Then wear work gloves, goggles that cover your eyes completely, and a face mask so you don’t inhale any fiberglass particles.",
    "Cut the insulation with a utility knife so it can fit the height of your walls.",
    "Unroll the insulation so the moisture vapor is face-up, and measure out the length you need with a tape measure.",
    "Lay a straightedge across the top of the insulation and press it down to compress the foam.",
    "Push the blade of a utility knife into the insulation and carefully pull it toward you to slice through it.",
    "You can also use an insulation knife to saw through the insulation.",
    "You can buy insulation knives from your local hardware store.",
    "You can also cut foam boards with a utility knife.",
    "Push the insulation between your studs so it fits snugly.",
    "Guide the insulation into the space between your studs so the vapor barrier faces the interior side of your home.",
    "Gently push the insulation into the space between your studs without compressing the foam, or else it won’t be as effective.",
    "Make sure the front of the insulation is flush with the front of the studs when you’re finished putting it in.",
    "Compressed insulation won’t work to its full thermal resistance rating.",
    "If there’s an electrical box or a fixture in the wall, cut the insulation so it fits tightly around it.Tip: When you install insulation on an attic floor, put the vapor barrier face-down or else it won’t be effective.",
    "Staple the insulation to the sides of the studs to keep it in place.",
    "Grab the edge of the insulation or moisture barrier, and hold it tightly against the side of the wall stud.",
    "Drive staples into the wall stud every 6 inches (15 cm) along the stud.",
    "Repeat the process on the other side of the insulation so it’s securely in place.",
    "Some insulation is labeled “compression-fit” and doesn’t need to be stapled.",
    "You can also staple the insulation to the front of the wall stud, but it could affect how drywall sits on it.",
    "Sealing Common Problem Areas Put weatherstripping around doors and windows to prevent drafts.",
    "Weatherstripping goes around the perimeter of your doors and windows and helps block air from coming through the seams.",
    "Look for weatherstripping with adhesive backing and cut it to the height you need for the seam of your door or window.",
    "Take the backing off of the weatherstripping and press it into place to secure it.",
    "You can buy weatherstripping from your local home improvement store.",
    "You can also purchase weatherstripping that nails or screws into the side of the door frame as well.",
    "Add sealant around gaps in your floors and walls.",
    "There are usually small cracks or gaps in the corners between your floors and walls, which could lead to heat loss.",
    "Open a tube of silicone sealant and squeeze a small line of it into the corners of your floor to fill the gap.",
    "Smooth out the silicone with your fingertip or a sealant scraper to push it further into the gap to help it seal better.",
    "You can also use caulk in the same way to seal the gaps.",
    "Put door sweeps on exterior doors to keep air from coming in.",
    "Door sweeps cover the space between your floor and the bottom of the door to prevent drafts from blowing under them.",
    "If you get a door sweep with an adhesive back, simply cut it to the width of your door, peel off the backing, and attach it to the bottom.",
    "Otherwise, you may have to nail it into the door with the provided hardware.",
    "You can buy door sweeps from your local hardware store.",
    "Put thick curtains in front of your windows to prevent heat loss.",
    "When you leave your windows uncovered, they can transfer cold air inside your home.",
    "Hang up thick, dark curtains in front of your windows and keep them closed whenever you want to keep your house warm.",
    "The curtains will block the cold air from coming in any further so it doesn’t affect the temperature of your home.Tip: Leave your curtains open when it’s sunny so the sunlight can naturally warm up your room so you don’t have to use as much energy to heat it.",
    "Cover hard floors with rugs or carpeting so they stay warm.",
    "Hard floors, such as tile, laminate, or wood, can absorb heat and make your home less efficient.",
    "Lay out rugs, carpets, or blankets to cover exposed flooring to keep the heat in your home.",
    "Pick a rug or carpet that matches the style of the rest of your room and lay it out to cover as much of the floor as you can.",
    "Uninsulated floors can cause up to 10% of your home’s heat loss.",
    "Have double-pane windows installed to prevent air leaks.",
    "Single-pane windows only have 1 piece of glass, which makes it easier for cold air to transfer inside and hot air to transfer out.",
    "Double-pane windows have a second piece of glass to the cold and hot air can’t transfer between the panes.",
    "Check the windows in your home to see if they’re single-pane and contact a window specialist to replace them for you.",
    "If can’t replace your windows, you can also get clear plastic window film that seals onto the frame to prevent heat from escaping.",
    "Insulating Existing Walls Consider hiring a contractor to install insulation in finished walls.",
    "While you can install insulation in finished walls on your own, it can be difficult since you have to cut through your existing drywall.",
    "There is also special equipment that you need to rent if you want to do it on your own.",
    "If you don’t feel comfortable cutting into your walls, find an insulation service near you and ask for a price quote to find out how much it would cost.",
    "Inject expanding foam insulation into your wall for the most effective treatment.",
    "Expanding foam increases in size once you inject it into your walls to seal the areas between the wall studs perfectly.",
    "Buy or rent an injection foam machine and wear disposable coveralls with goggles and a face mask to protect yourself.",
    "Drill a ⁄2 in (1.3 cm) hole at the top of your wall and put the machine’s hose through it.",
    "Turn the machine on to spread the foam between the studs.",
    "Continue working around your room between each of the studs.",
    "Injection foam usually requires a contractor to install safely, but you may be able to rent a machine from hardware stores to do it on your own.",
    "You can either drill through your exterior siding or your inside walls to inject the foam.",
    "Blow in loose-fill insulation if you want to be minimally invasive.",
    "Rent a blower machine from a hardware store with enough loose-fill insulation for your home.",
    "Cut holes in your wall that are large enough for the blower’s hose between each of the studs.",
    "Feed the loose-fill insulation into the machine and position the hose in the holes.",
    "Turn on the machine to blow the loose-fill into your walls until it’s tightly packed.",
    "Loose-fill insulation is made from small chunks either fiberglass or flame-retardant cellulose material that settle in your walls.",
    "Loose-fill insulation can settle and compress over time, so it may not be as effective as it gets older.",
    "Remove the existing drywall to install rolls of fiberglass insulation.",
    "Use a drywall saw or a utility knife to cut through the walls you already have and remove them completely.",
    "Get rolls of fiberglass insulation that have a vapor barrier so you have enough to insulate the room.",
    "Push the insulation into your wall so it fits snugly and sits flush with the studs.",
    "Staple the insulation in place before installing new drywall.",
    "Only tear down your existing drywall if you can’t use loose-fill or expanding foam insulation."
  ],
  "tyn_section":[
    "Insulation",
    "Sealant",
    "Double glazing",
    "Rug"
  ],
  "tyn_model":[
    "insulation",
    "utility knife",
    "curtains",
    "loose-fill insulation",
    "expanding foam",
    "goggles",
    "face mask",
    "weatherstripping",
    "rugs",
    "hose",
    "fiberglass insulation",
    "drywall",
    "foam boards",
    "insulation batts",
    "insulated foam boards",
    "tape measure",
    "insulation knife",
    "insulation knives",
    "vapor barrier",
    "staples",
    "“compression",
    "” and",
    "adhesive backing",
    "sealant",
    "silicone sealant",
    "silicone",
    "sealant scraper",
    "caulk",
    "blankets",
    "window specialist",
    "clear plastic",
    "contractor",
    "injection foam machine",
    "injection foam",
    "blower machine",
    "blower",
    "drywall saw",
    "loose-fill or"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0526315789,
    "f1":0.0952380952,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2368421053,
    "f1":0.3214285714
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.2368421053,
    "f1":0.3214285714
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0526315789,
    "f1":0.0952380952
  }
}