{
  "title":"How to Keep Cilantro Fresh",
  "url":"https://www.wikihow.com/Keep-Cilantro-Fresh",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Moist Paper Towels",
      "steps":[
        {
          "headline":"Trim the ends.",
          "description":"Use kitchen shears to trim off the dry tip from each stem of cilantro. Take this time to also remove any damaged or dying leaves, as well. To keep the end fresher and cause less shock to the plant, trim the stems under cool, running water."
        },
        {
          "headline":"Soak the cilantro.",
          "description":"Place the cilantro in a dish and cover the stems with cool water. Let them soak for five to ten minutes. Soaking the cilantro removes all dirt and debris from the leaves. Since the leaves and stems will be moist when you use this method, cleaning the leaves beforehand is not an issue. If you were using a method that required the leaves to remain dry, however, you would wait until you were ready to use the herb before cleaning it."
        },
        {
          "headline":"Remove excess water.",
          "description":"Remove the cilantro from the water and transfer the bunch into a salad spinner. Use this device to spin the wet herbs until they feel relatively dry to the touch. You can also pat the cilantro dry in between layers of clean, dry paper towels or a with a clean kitchen towel. Make sure that the leaves are almost completely dry, at least to the point that no noticeable drops of water can be spotted dripping off. You do not need to air dry the cilantro extensively for this method, though. Since you will end up wrapping the herb in damp paper towels later on, it will be exposed to a little moisture, anyway."
        },
        {
          "headline":"Wrap the cilantro in a damp paper towel.",
          "description":"Spread the cilantro out onto a sheet of mildly moist, clean paper towel. Carefully wrap the herb bunch in the paper towel so that all sides are covered. The paper towel should only be a little damp. Do not make the paper towel dripping wet."
        },
        {
          "headline":"Place the cilantro in an airtight container.",
          "description":"Transfer the wrapped cilantro to a plastic bag or plastic container with an airtight seal. Close the container and label it with the current date and contents. If placing the cilantro in a plastic bag, close the top seal, leaving only 1 inch (2.5 cm) of open space. Gently squeeze out all the air before you finish sealing the bag. If placing the cilantro into an airtight container, make sure that the lid snaps on securely and leaves no space for air to slip in or out."
        },
        {
          "headline":"Keep in the refrigerator.",
          "description":"Store the container of cilantro in your refrigerator for a week or so. Cilantro is a fairly delicate herb. As such, using this method to store fresh cilantro may not be as effective as other methods. While a damp paper towel and plastic bag work well for hardier herbs, like mint and parsley, cilantro wilts faster. According to the experiences of many home cooks, methods that allow the leaves to remain dry can actually prolong the freshness of the herb longer. Note, however, that this method is very effective if you only want to keep the cilantro fresh for five days or so. The combination of moisture and cool temperatures can keep the cilantro at optimum freshness and crispness for a few days, but if you need to keep it fresh for a longer period of time, you would be better off with another method."
        }
      ]
    },
    {
      "name":"Dry Paper Towels",
      "steps":[
        {
          "headline":"Trim the ends.",
          "description":"Cut off any dry tips from the stems of the cilantro in your bunch. You should also remove any old or damaged leaves at this time. It is also a good idea to cut off the tough stems completely for this method. The stems are not necessary since they will not be drawing in any moisture, and removing them can make it easier to fit the cilantro into a tight container."
        },
        {
          "headline":"Dry the cilantro completely.",
          "description":"If the cilantro is even a little moist, you should dry it with clean paper towels or by putting it through a spin in a salad spinner. Cilantro will go bad much faster if the leaves are still wet, so it is crucial that you get as much water off as possible. To be on the safe side, the best option is to spin the cilantro in a salad spinner and spread the stems out in a single layer on a dry kitchen towel. Place the towel in direct sunlight for a few hours to further dry the cilantro."
        },
        {
          "headline":"Layer the cilantro in between layers of dry paper towel.",
          "description":"Place a sheet of dry paper towel at the bottom of an airtight plastic container. Arrange a single layer of cilantro on top of it, then cover the cilantro with another paper towel. Repeat this pattern, alternating back and forth between cilantro and paper towel layers. If possible, only keep one layer of cilantro in a container. Crowding the container with too much of the herb can actually cause problems. Regardless of how many layers you have, the bottom and top layers should both be paper towel layers. Snap the container shut when done. Make sure that the seal is airtight. Do not use a plastic bag instead of a plastic food storage container for this method."
        },
        {
          "headline":"Keep in the refrigerator.",
          "description":"Cover the container and place it in your refrigerator. It should stay fresh for two to three weeks. Check the cilantro periodically during this time. Look through the sides of the container if using clear plastic, or quickly remove the lid and peek inside if using a container made of tinted plastic. Remove any wilted or discolored cilantro. If you notice any moisture, dry the container and send your cilantro for another spin in the salad spinner."
        }
      ]
    },
    {
      "name":"Container of Water",
      "steps":[
        {
          "headline":"Trim the ends.",
          "description":"Cut off any dry or damaged stem ends with a sharp pair of kitchen shears. At this time, you should also inspect the bunch for damaged or wilted leaves. Remove these leaves, as well. Consider trimming the stems under cool, running water. Doing so causes less shock to the herb, and since the ends will be immersed in water anyway, they can get wet without worry. Keeping the ends as fresh as possible is actually preferred since they will be able to draw up more water that way."
        },
        {
          "headline":"Dry the leaves, if necessary.",
          "description":"If the leaves have any noticeable moisture on them, you should dry them off with clean, dry paper towels or by running them through a salad spinner. Even though the stems will be wet for this method, it is important that the leaves remain dry. The cilantro will wither much quicker if you allow the leaves to remain wet. Note that for this method, it is better to clean the cilantro before you are ready to use it instead of now, when you are only trying to keep it fresh. Waiting minimizes the amount of water touching the leaves."
        },
        {
          "headline":"Fill a glass with some water and the cilantro.",
          "description":"Fill the bottom quarter of a sturdy glass jar with cool water. Arrange the cilantro inside the glass after that, making sure that all the cut stem ends are submerged. The cut ends should be submerged, but the leaves should remain above the surface of the water. If a few leaves dip under the water, either reduce the amount of water in the jar or trim off the bottom leaves."
        },
        {
          "headline":"Cover with a plastic bag.",
          "description":"Place a resealable plastic bag over the top of the cilantro. Let the opening of the bag remain loose. Do not secure the bag onto the jar with a rubber band or anything else. The opening of the bag should fall below the mouth of the glass. In other words, the leafy portion of the cilantro needs to be completely covered with the bag."
        },
        {
          "headline":"Change the water periodically.",
          "description":"You will need to change the water every few days. Knowing when to change the water is as easy as simply taking a look at the glass. As soon as the water starts to become discolored, it is time to swap it out for a fresher water supply. Check the condition of the cilantro when you change the water. Snip off any dried ends or wilting leaves before returning the cilantro to the fresh jar of water."
        },
        {
          "headline":"Keep in the refrigerator.",
          "description":"Store the glass cilantro in your refrigerator. When using this method, cilantro can stay fresh for up to two weeks, if not longer. The cold temperature is just as important to this method as the water itself, if not more important. If you leave the cilantro out at room temperature, it will only last for a week at most. Cilantro kept in this manner has been known to remain fresh for a little over four weeks when stored in the refrigerator."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Moist Paper Towels Trim the ends. Use kitchen shears to trim off the dry tip from each stem of cilantro. Take this time to also remove any damaged or dying leaves, as well. To keep the end fresher and cause less shock to the plant, trim the stems under cool, running water. Soak the cilantro. Place the cilantro in a dish and cover the stems with cool water. Let them soak for five to ten minutes. Soaking the cilantro removes all dirt and debris from the leaves. Since the leaves and stems will be moist when you use this method, cleaning the leaves beforehand is not an issue. If you were using a method that required the leaves to remain dry, however, you would wait until you were ready to use the herb before cleaning it. Remove excess water. Remove the cilantro from the water and transfer the bunch into a salad spinner. Use this device to spin the wet herbs until they feel relatively dry to the touch. You can also pat the cilantro dry in between layers of clean, dry paper towels or a with a clean kitchen towel. Make sure that the leaves are almost completely dry, at least to the point that no noticeable drops of water can be spotted dripping off. You do not need to air dry the cilantro extensively for this method, though. Since you will end up wrapping the herb in damp paper towels later on, it will be exposed to a little moisture, anyway. Wrap the cilantro in a damp paper towel. Spread the cilantro out onto a sheet of mildly moist, clean paper towel. Carefully wrap the herb bunch in the paper towel so that all sides are covered. The paper towel should only be a little damp. Do not make the paper towel dripping wet. Place the cilantro in an airtight container. Transfer the wrapped cilantro to a plastic bag or plastic container with an airtight seal. Close the container and label it with the current date and contents. If placing the cilantro in a plastic bag, close the top seal, leaving only 1 inch (2.5 cm) of open space. Gently squeeze out all the air before you finish sealing the bag. If placing the cilantro into an airtight container, make sure that the lid snaps on securely and leaves no space for air to slip in or out. Keep in the refrigerator. Store the container of cilantro in your refrigerator for a week or so. Cilantro is a fairly delicate herb. As such, using this method to store fresh cilantro may not be as effective as other methods. While a damp paper towel and plastic bag work well for hardier herbs, like mint and parsley, cilantro wilts faster. According to the experiences of many home cooks, methods that allow the leaves to remain dry can actually prolong the freshness of the herb longer. Note, however, that this method is very effective if you only want to keep the cilantro fresh for five days or so. The combination of moisture and cool temperatures can keep the cilantro at optimum freshness and crispness for a few days, but if you need to keep it fresh for a longer period of time, you would be better off with another method. Dry Paper Towels Trim the ends. Cut off any dry tips from the stems of the cilantro in your bunch. You should also remove any old or damaged leaves at this time. It is also a good idea to cut off the tough stems completely for this method. The stems are not necessary since they will not be drawing in any moisture, and removing them can make it easier to fit the cilantro into a tight container. Dry the cilantro completely. If the cilantro is even a little moist, you should dry it with clean paper towels or by putting it through a spin in a salad spinner. Cilantro will go bad much faster if the leaves are still wet, so it is crucial that you get as much water off as possible. To be on the safe side, the best option is to spin the cilantro in a salad spinner and spread the stems out in a single layer on a dry kitchen towel. Place the towel in direct sunlight for a few hours to further dry the cilantro. Layer the cilantro in between layers of dry paper towel. Place a sheet of dry paper towel at the bottom of an airtight plastic container. Arrange a single layer of cilantro on top of it, then cover the cilantro with another paper towel. Repeat this pattern, alternating back and forth between cilantro and paper towel layers. If possible, only keep one layer of cilantro in a container. Crowding the container with too much of the herb can actually cause problems. Regardless of how many layers you have, the bottom and top layers should both be paper towel layers. Snap the container shut when done. Make sure that the seal is airtight. Do not use a plastic bag instead of a plastic food storage container for this method. Keep in the refrigerator. Cover the container and place it in your refrigerator. It should stay fresh for two to three weeks. Check the cilantro periodically during this time. Look through the sides of the container if using clear plastic, or quickly remove the lid and peek inside if using a container made of tinted plastic. Remove any wilted or discolored cilantro. If you notice any moisture, dry the container and send your cilantro for another spin in the salad spinner. Container of Water Trim the ends. Cut off any dry or damaged stem ends with a sharp pair of kitchen shears. At this time, you should also inspect the bunch for damaged or wilted leaves. Remove these leaves, as well. Consider trimming the stems under cool, running water. Doing so causes less shock to the herb, and since the ends will be immersed in water anyway, they can get wet without worry. Keeping the ends as fresh as possible is actually preferred since they will be able to draw up more water that way. Dry the leaves, if necessary. If the leaves have any noticeable moisture on them, you should dry them off with clean, dry paper towels or by running them through a salad spinner. Even though the stems will be wet for this method, it is important that the leaves remain dry. The cilantro will wither much quicker if you allow the leaves to remain wet. Note that for this method, it is better to clean the cilantro before you are ready to use it instead of now, when you are only trying to keep it fresh. Waiting minimizes the amount of water touching the leaves. Fill a glass with some water and the cilantro. Fill the bottom quarter of a sturdy glass jar with cool water. Arrange the cilantro inside the glass after that, making sure that all the cut stem ends are submerged. The cut ends should be submerged, but the leaves should remain above the surface of the water. If a few leaves dip under the water, either reduce the amount of water in the jar or trim off the bottom leaves. Cover with a plastic bag. Place a resealable plastic bag over the top of the cilantro. Let the opening of the bag remain loose. Do not secure the bag onto the jar with a rubber band or anything else. The opening of the bag should fall below the mouth of the glass. In other words, the leafy portion of the cilantro needs to be completely covered with the bag. Change the water periodically. You will need to change the water every few days. Knowing when to change the water is as easy as simply taking a look at the glass. As soon as the water starts to become discolored, it is time to swap it out for a fresher water supply. Check the condition of the cilantro when you change the water. Snip off any dried ends or wilting leaves before returning the cilantro to the fresh jar of water. Keep in the refrigerator. Store the glass cilantro in your refrigerator. When using this method, cilantro can stay fresh for up to two weeks, if not longer. The cold temperature is just as important to this method as the water itself, if not more important. If you leave the cilantro out at room temperature, it will only last for a week at most. Cilantro kept in this manner has been known to remain fresh for a little over four weeks when stored in the refrigerator. Finished. ",
  "sentences":[
    " Moist Paper Towels Trim the ends.",
    "Use kitchen shears to trim off the dry tip from each stem of cilantro.",
    "Take this time to also remove any damaged or dying leaves, as well.",
    "To keep the end fresher and cause less shock to the plant, trim the stems under cool, running water.",
    "Soak the cilantro.",
    "Place the cilantro in a dish and cover the stems with cool water.",
    "Let them soak for five to ten minutes.",
    "Soaking the cilantro removes all dirt and debris from the leaves.",
    "Since the leaves and stems will be moist when you use this method, cleaning the leaves beforehand is not an issue.",
    "If you were using a method that required the leaves to remain dry, however, you would wait until you were ready to use the herb before cleaning it.",
    "Remove excess water.",
    "Remove the cilantro from the water and transfer the bunch into a salad spinner.",
    "Use this device to spin the wet herbs until they feel relatively dry to the touch.",
    "You can also pat the cilantro dry in between layers of clean, dry paper towels or a with a clean kitchen towel.",
    "Make sure that the leaves are almost completely dry, at least to the point that no noticeable drops of water can be spotted dripping off.",
    "You do not need to air dry the cilantro extensively for this method, though.",
    "Since you will end up wrapping the herb in damp paper towels later on, it will be exposed to a little moisture, anyway.",
    "Wrap the cilantro in a damp paper towel.",
    "Spread the cilantro out onto a sheet of mildly moist, clean paper towel.",
    "Carefully wrap the herb bunch in the paper towel so that all sides are covered.",
    "The paper towel should only be a little damp.",
    "Do not make the paper towel dripping wet.",
    "Place the cilantro in an airtight container.",
    "Transfer the wrapped cilantro to a plastic bag or plastic container with an airtight seal.",
    "Close the container and label it with the current date and contents.",
    "If placing the cilantro in a plastic bag, close the top seal, leaving only 1 inch (2.5 cm) of open space.",
    "Gently squeeze out all the air before you finish sealing the bag.",
    "If placing the cilantro into an airtight container, make sure that the lid snaps on securely and leaves no space for air to slip in or out.",
    "Keep in the refrigerator.",
    "Store the container of cilantro in your refrigerator for a week or so.",
    "Cilantro is a fairly delicate herb.",
    "As such, using this method to store fresh cilantro may not be as effective as other methods.",
    "While a damp paper towel and plastic bag work well for hardier herbs, like mint and parsley, cilantro wilts faster.",
    "According to the experiences of many home cooks, methods that allow the leaves to remain dry can actually prolong the freshness of the herb longer.",
    "Note, however, that this method is very effective if you only want to keep the cilantro fresh for five days or so.",
    "The combination of moisture and cool temperatures can keep the cilantro at optimum freshness and crispness for a few days, but if you need to keep it fresh for a longer period of time, you would be better off with another method.",
    "Dry Paper Towels Trim the ends.",
    "Cut off any dry tips from the stems of the cilantro in your bunch.",
    "You should also remove any old or damaged leaves at this time.",
    "It is also a good idea to cut off the tough stems completely for this method.",
    "The stems are not necessary since they will not be drawing in any moisture, and removing them can make it easier to fit the cilantro into a tight container.",
    "Dry the cilantro completely.",
    "If the cilantro is even a little moist, you should dry it with clean paper towels or by putting it through a spin in a salad spinner.",
    "Cilantro will go bad much faster if the leaves are still wet, so it is crucial that you get as much water off as possible.",
    "To be on the safe side, the best option is to spin the cilantro in a salad spinner and spread the stems out in a single layer on a dry kitchen towel.",
    "Place the towel in direct sunlight for a few hours to further dry the cilantro.",
    "Layer the cilantro in between layers of dry paper towel.",
    "Place a sheet of dry paper towel at the bottom of an airtight plastic container.",
    "Arrange a single layer of cilantro on top of it, then cover the cilantro with another paper towel.",
    "Repeat this pattern, alternating back and forth between cilantro and paper towel layers.",
    "If possible, only keep one layer of cilantro in a container.",
    "Crowding the container with too much of the herb can actually cause problems.",
    "Regardless of how many layers you have, the bottom and top layers should both be paper towel layers.",
    "Snap the container shut when done.",
    "Make sure that the seal is airtight.",
    "Do not use a plastic bag instead of a plastic food storage container for this method.",
    "Keep in the refrigerator.",
    "Cover the container and place it in your refrigerator.",
    "It should stay fresh for two to three weeks.",
    "Check the cilantro periodically during this time.",
    "Look through the sides of the container if using clear plastic, or quickly remove the lid and peek inside if using a container made of tinted plastic.",
    "Remove any wilted or discolored cilantro.",
    "If you notice any moisture, dry the container and send your cilantro for another spin in the salad spinner.",
    "Container of Water Trim the ends.",
    "Cut off any dry or damaged stem ends with a sharp pair of kitchen shears.",
    "At this time, you should also inspect the bunch for damaged or wilted leaves.",
    "Remove these leaves, as well.",
    "Consider trimming the stems under cool, running water.",
    "Doing so causes less shock to the herb, and since the ends will be immersed in water anyway, they can get wet without worry.",
    "Keeping the ends as fresh as possible is actually preferred since they will be able to draw up more water that way.",
    "Dry the leaves, if necessary.",
    "If the leaves have any noticeable moisture on them, you should dry them off with clean, dry paper towels or by running them through a salad spinner.",
    "Even though the stems will be wet for this method, it is important that the leaves remain dry.",
    "The cilantro will wither much quicker if you allow the leaves to remain wet.",
    "Note that for this method, it is better to clean the cilantro before you are ready to use it instead of now, when you are only trying to keep it fresh.",
    "Waiting minimizes the amount of water touching the leaves.",
    "Fill a glass with some water and the cilantro.",
    "Fill the bottom quarter of a sturdy glass jar with cool water.",
    "Arrange the cilantro inside the glass after that, making sure that all the cut stem ends are submerged.",
    "The cut ends should be submerged, but the leaves should remain above the surface of the water.",
    "If a few leaves dip under the water, either reduce the amount of water in the jar or trim off the bottom leaves.",
    "Cover with a plastic bag.",
    "Place a resealable plastic bag over the top of the cilantro.",
    "Let the opening of the bag remain loose.",
    "Do not secure the bag onto the jar with a rubber band or anything else.",
    "The opening of the bag should fall below the mouth of the glass.",
    "In other words, the leafy portion of the cilantro needs to be completely covered with the bag.",
    "Change the water periodically.",
    "You will need to change the water every few days.",
    "Knowing when to change the water is as easy as simply taking a look at the glass.",
    "As soon as the water starts to become discolored, it is time to swap it out for a fresher water supply.",
    "Check the condition of the cilantro when you change the water.",
    "Snip off any dried ends or wilting leaves before returning the cilantro to the fresh jar of water.",
    "Keep in the refrigerator.",
    "Store the glass cilantro in your refrigerator.",
    "When using this method, cilantro can stay fresh for up to two weeks, if not longer.",
    "The cold temperature is just as important to this method as the water itself, if not more important.",
    "If you leave the cilantro out at room temperature, it will only last for a week at most.",
    "Cilantro kept in this manner has been known to remain fresh for a little over four weeks when stored in the refrigerator.",
    "Finished."
  ],
  "tyn_section":[
    "Kitchen shears",
    "Large dish",
    "Salad spinner",
    "Paper towels",
    "Airtight plastic bag or container",
    "Clean dish towel (optional)",
    "Airtight plastic container",
    "Heavy glass or jar",
    "Plastic bag"
  ],
  "tyn_model":[
    "cilantro",
    "water",
    "paper towel",
    "refrigerator",
    "salad spinner",
    "plastic bag",
    "container",
    "glass",
    "kitchen shears",
    "moist paper towels",
    "dish",
    "airtight container",
    "airtight seal",
    "dry paper towels",
    "kitchen towel",
    "dry paper towel",
    "airtight plastic container",
    "glass jar",
    "resealable plastic bag",
    "jar",
    "rubber band"
  ],
  "simple_metrics":{
    "r":0.4444444444,
    "p":0.1904761905,
    "f1":0.2666666667,
    "avg_pos":0.380952381
  },
  "jacc_metrics_0.5":{
    "r":0.8888888889,
    "p":0.4761904762,
    "f1":0.6201550388
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.619047619,
    "f1":0.7298245614
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5555555556,
    "p":0.380952381,
    "f1":0.4519774011
  }
}