{
  "title":"How to Freeze Fresh Squash",
  "url":"https://www.wikihow.com/Freeze-Fresh-Squash",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques",
    "Freezing Food"
  ],
  "methods":[
    {
      "name":"Freezing Raw Winter Squash",
      "steps":[
        {
          "headline":"Peel the squash using a vegetable peeler or knife.",
          "description":"Set the squash on a cutting board and cut the rounded ends off of each side. Then, holding the squash in one hand, use a vegetable peeler in your dominant hand to peel strips of squash off away from you. If you're using a knife, hold the squash upright on your cutting board and slice downwards, removing the squash’s skin. Once you’ve finished one section with the vegetable peeler, rotate the squash in your non-dominant hand to peel another side. With a knife, slice just beneath the skin on one side of the squash. Then, slice all the way down the length of the squash until this strip is completely removed. Continue slicing off other strips of skin in this manner until you make it all the way around the squash."
        },
        {
          "headline":"Cut the squash into 1 inch (2.5 cm) cubes.",
          "description":"Use a serrated kitchen knife to cut the squash into evenly-sized pieces. You can technically cut the pieces into any size, but 1 inch (2.5 cm) cubes are good for freezer bags if you don’t have a specific size in mind. Use a cutting board whenever chopping vegetables."
        },
        {
          "headline":"Freeze the squash on a baking sheet for 2 hours.",
          "description":"Line a baking sheet with parchment or wax paper. Spread the pieces of squash onto the baking sheet in a single layer, without overlapping. Place this baking sheet in the freezer and allow the squash to freeze solid for around 2 hours. Freezing the pieces this way makes it less likely that the squash will stick together in long-term frozen storage."
        },
        {
          "headline":"Transfer the squash to a freezer-safe container.",
          "description":"Take the individually frozen pieces of squash and place them into a freezer-safe plastic container or plastic bag. Leave ⁄2 inch (1.3 cm)  of empty space on the top before sealing the container. Tupperware and plastic bags both make good storage solutions. If using a plastic bag, push as much air out of the bag as possible before sealing it."
        },
        {
          "headline":"Freeze the uncooked squash for up to 12 months.",
          "description":"Place the containers of squash in the freezer and store them there until you are ready to use the vegetable in a dish. Label the bag or container so you know when you put it in the freezer for storage."
        },
        {
          "headline":"Defrost the squash or add it directly to certain soups and chilis.",
          "description":"When you’re ready to use the squash, you can add the chunks directly to warm stews or you can thaw them for use in other recipes. To thaw the frozen squash, move the bag of squash from the freezer to the refrigerator overnight, or set it out on the counter for 3-4 hours. You can also roast butternut squash directly from the freezer without thawing it."
        }
      ]
    },
    {
      "name":"Cooking and Freezing Winter Squash",
      "steps":[
        {
          "headline":"Preheat the oven to 400 °F (204 °C).",
          "description":"You will be using the oven to roast the squash before freezing them. Set the oven to Bake and turn it up to 400 °F (204 °C). If you prefer, it is also possible to cook the squash in the microwave, in which case you do not need to worry about preheating the oven."
        },
        {
          "headline":"Cut the squash in half using a sharp, serrated knife.",
          "description":"Set the squash on a cutting board, and hold it steady with one hand. Using the knife, cut the squash into halves lengthwise. Set the squash halves down on the cutting board, with the flesh-side facing up. For bigger squash like butternut squash, move slowly and carefully with the knife. Squash roll, and you don’t want the knife to slip. If the squash is smaller, like an acorn squash, it will be easier to hold it steady."
        },
        {
          "headline":"Scoop out the stringy insides of the squash.",
          "description":"Using a spoon or your hands, scoop away and discard any pulp or seeds on the inside of the squash. If you have a melon baller, this is a great tool to easily scoop and discard seeds. A serrated grapefruit spoon will also help get the job done. Compost or trash the inner bits of the squash. Spoons don’t cut as well through the strings of a squash as a melon baller, due to their dull edges."
        },
        {
          "headline":"Place the squash, flesh-side up, on a baking sheet.",
          "description":"If you want to add some flavor, season the squash with salt and pepper. You can also add about 1 tbsp (15 mL) of butter or honey and 1 tbsp (14.3 g) of brown sugar to the squash at this point. If you plan to roast the squash straight out of the freezer, adding butter and brown sugar at this stage is a good idea. Otherwise, the squash will preserve better without additives, and you can just bake it as it is."
        },
        {
          "headline":"Bake the squash for 25 minutes or until it is tender.",
          "description":"Place the baking sheet in the previously preheated oven (400 °F (204 °C)) and let them bake for 25 minutes. After 25 minutes, take the baking tray out, and use a fork to check if the flesh is soft (you should be able to pierce the flesh with the fork). To microwave the squash, place the squash pieces on a piece of microwave-safe plastic wrap on top of a microwavable plate. Cook them for 15 minutes on high, checking the squash at every 5 minute interval. Continue cooking until the flesh is soft enough to scoop it out of the skin with a spoon."
        },
        {
          "headline":"Scoop out the flesh of the squash with a spoon.",
          "description":"Once the squash has cooled down sufficiently, use a metal spoon to dig out the softened insides of the squash away from its skin. Transfer the fleshy parts into a separate bowl and discard the hollowed out skin once you’re done. You can also use a serrated spoon for a bit of extra help digging out the flesh."
        },
        {
          "headline":"Puree the cooked squash.",
          "description":"A puree of winter squash will hold up well in the freezer for many months. Use a blender or a food processor to puree the winter squash until all of the lumps are gone. Cooking will have softened the squash to make this step rather easy. Alternatively, you can mash the squash with a mashing tool or even a run of the mill metal fork to achieve a similar effect."
        },
        {
          "headline":"Portion and freeze small amounts of the pureed squash.",
          "description":"Wait for the squash to cool, then portion out ⁄2 cup (120 mL) balls of the puree, placing them on a parchment-covered baking sheet or in an ice cube tray or muffin tin. Pop the tray or tin in the freezer and let the pureed squash freeze for at least four hours, or until frozen solid. Pureed squash will freeze best if it’s frozen in small portions, but if you’re in a rush, you can skip this step and transfer the puree to long-term storage immediately."
        },
        {
          "headline":"Transfer the pureed squash to the freezer for up to 3 months.",
          "description":"Once the smaller portions are frozen solid, spoon them into freezer-safe plastic containers or plastic bags. Place the containers of squash in your freezer and save until they’re ready to use. If you’re using plastic bags, remove as much air as possible from the bags before you seal them."
        },
        {
          "headline":"Defrost the puree for baking or cooking.",
          "description":"Place the puree in the refrigerator overnight to thaw it, or set it out on the counter for 3-4 hours to defrost it. You can then microwave the puree or heat it on the stovetop to add it to warm dishes. You can also add it directly to soups and chilis. Winter squash puree is a great candidate for adding to sauces, soups, dips, lasagnas, enchiladas, and baked breads or muffins."
        }
      ]
    },
    {
      "name":"Blanching and Freezing Summer Squash",
      "steps":[
        {
          "headline":"Cut the squash into rounds ⁄4 inch (0.64 cm) thick.",
          "description":"Use a sharp, heavy kitchen knife to slice off both ends of the squash, then slice your summer squash into the thin rounds. Move lengthwise down the squash, slicing every ⁄4 inch (0.64 cm). If you are freezing zucchini to make zucchini bread in the future, you should grate it instead. Use a box grater to grate the zucchini into a bowl. There is no need to peel the squash first in this method, as you are going to blanch it."
        },
        {
          "headline":"Boil 1 gallon (3.8 L) of water per 1 pound (16 oz) of summer squash.",
          "description":"Use a large stockpot over high heat. Place a wire basket or metal steamer into the stockpot. The wire basket should dip down into the water so that the squash will be completely immersed in the boiling water. You are not steaming the squash in this method. Instead, you are using the wire basket as a way to easily fish the squash out of the water when ready."
        },
        {
          "headline":"Put the squash into a wire basket and blanch them for 3 to 4 minutes.",
          "description":"Place no more than 1 lb (450 g) of squash in the boiling water at a time. Cook for roughly 3 minutes. After the pieces of squash are done, remove the squash from the stockpot using the wire basket. You can poke the squash with a fork after 3 minutes to check for tenderness. If the squash feel tender, they are ready. If you are working with grated zucchini, blanch the grated pieces in small batches for 1 to 2 minutes each, until they feel tender."
        },
        {
          "headline":"Dunk the squash in cold water or a bowl of ice for another 3 minutes.",
          "description":"If you’re using a bowl of ice, make sure you have about 1 pound (16 oz) of ice to 1 pound (16 oz) of vegetables. If you’re using liquid water, run cold tap water continuously over the squash or change it frequently so it stays cold. Ideally, the water should be 60 °F (16 °C) or below. Dunking the squash in ice water after you have blanched it will stop the cooking process, thereby preventing the enzymes from breaking down any further. As a result, you are left with squash that retains its color, flavor, and most of its texture."
        },
        {
          "headline":"Drain the squash to remove any excess water.",
          "description":"Pour the ice bucket filled with squash through a colander (or any kind of strainer) to remove excess water from the squash. This will prepare the squash for freezing. Pat the pieces dry with a paper towel after draining. You can sandwich the squash between two paper towels for about 10 minutes to make sure they have dried completely."
        },
        {
          "headline":"Freeze the blanched squash in a plastic bag for up to 6 months.",
          "description":"Fill freezer-safe plastic containers or plastic bags with the squash. If using plastic bags, you can try to push as much air as possible out of the bag before sealing. Place the containers of squash in the freezer. Keep them there until you are ready to use them. Blanched summer squash will usually stay good in a freezer for up to 6 months."
        },
        {
          "headline":"Defrost the squash and use it for cooking or baking.",
          "description":"Place the summer squash in the fridge overnight to thaw it out, or place it on the counter for 3-4 hours to defrost it. Then, use your frozen summer squash in pasta sauces, soups, casseroles, or as a side dish. Grated zucchini will work very well in risotto, soup, muffin batter, or cake batter. As a totally stand alone dish, grated squash can be sautéed in brown butter with garlic and sage."
        }
      ]
    }
  ],
  "text":" Freezing Raw Winter Squash Peel the squash using a vegetable peeler or knife. Set the squash on a cutting board and cut the rounded ends off of each side. Then, holding the squash in one hand, use a vegetable peeler in your dominant hand to peel strips of squash off away from you. If you're using a knife, hold the squash upright on your cutting board and slice downwards, removing the squash’s skin. Once you’ve finished one section with the vegetable peeler, rotate the squash in your non-dominant hand to peel another side. With a knife, slice just beneath the skin on one side of the squash. Then, slice all the way down the length of the squash until this strip is completely removed. Continue slicing off other strips of skin in this manner until you make it all the way around the squash. Cut the squash into 1 inch (2.5 cm) cubes. Use a serrated kitchen knife to cut the squash into evenly-sized pieces. You can technically cut the pieces into any size, but 1 inch (2.5 cm) cubes are good for freezer bags if you don’t have a specific size in mind. Use a cutting board whenever chopping vegetables. Freeze the squash on a baking sheet for 2 hours. Line a baking sheet with parchment or wax paper. Spread the pieces of squash onto the baking sheet in a single layer, without overlapping. Place this baking sheet in the freezer and allow the squash to freeze solid for around 2 hours. Freezing the pieces this way makes it less likely that the squash will stick together in long-term frozen storage. Transfer the squash to a freezer-safe container. Take the individually frozen pieces of squash and place them into a freezer-safe plastic container or plastic bag. Leave ⁄2 inch (1.3 cm)  of empty space on the top before sealing the container. Tupperware and plastic bags both make good storage solutions. If using a plastic bag, push as much air out of the bag as possible before sealing it. Freeze the uncooked squash for up to 12 months. Place the containers of squash in the freezer and store them there until you are ready to use the vegetable in a dish. Label the bag or container so you know when you put it in the freezer for storage. Defrost the squash or add it directly to certain soups and chilis. When you’re ready to use the squash, you can add the chunks directly to warm stews or you can thaw them for use in other recipes. To thaw the frozen squash, move the bag of squash from the freezer to the refrigerator overnight, or set it out on the counter for 3-4 hours. You can also roast butternut squash directly from the freezer without thawing it. Cooking and Freezing Winter Squash Preheat the oven to 400 °F (204 °C). You will be using the oven to roast the squash before freezing them. Set the oven to Bake and turn it up to 400 °F (204 °C). If you prefer, it is also possible to cook the squash in the microwave, in which case you do not need to worry about preheating the oven. Cut the squash in half using a sharp, serrated knife. Set the squash on a cutting board, and hold it steady with one hand. Using the knife, cut the squash into halves lengthwise. Set the squash halves down on the cutting board, with the flesh-side facing up. For bigger squash like butternut squash, move slowly and carefully with the knife. Squash roll, and you don’t want the knife to slip. If the squash is smaller, like an acorn squash, it will be easier to hold it steady. Scoop out the stringy insides of the squash. Using a spoon or your hands, scoop away and discard any pulp or seeds on the inside of the squash. If you have a melon baller, this is a great tool to easily scoop and discard seeds. A serrated grapefruit spoon will also help get the job done. Compost or trash the inner bits of the squash. Spoons don’t cut as well through the strings of a squash as a melon baller, due to their dull edges. Place the squash, flesh-side up, on a baking sheet. If you want to add some flavor, season the squash with salt and pepper. You can also add about 1 tbsp (15 mL) of butter or honey and 1 tbsp (14.3 g) of brown sugar to the squash at this point. If you plan to roast the squash straight out of the freezer, adding butter and brown sugar at this stage is a good idea. Otherwise, the squash will preserve better without additives, and you can just bake it as it is. Bake the squash for 25 minutes or until it is tender. Place the baking sheet in the previously preheated oven (400 °F (204 °C)) and let them bake for 25 minutes. After 25 minutes, take the baking tray out, and use a fork to check if the flesh is soft (you should be able to pierce the flesh with the fork). To microwave the squash, place the squash pieces on a piece of microwave-safe plastic wrap on top of a microwavable plate. Cook them for 15 minutes on high, checking the squash at every 5 minute interval. Continue cooking until the flesh is soft enough to scoop it out of the skin with a spoon. Scoop out the flesh of the squash with a spoon. Once the squash has cooled down sufficiently, use a metal spoon to dig out the softened insides of the squash away from its skin. Transfer the fleshy parts into a separate bowl and discard the hollowed out skin once you’re done. You can also use a serrated spoon for a bit of extra help digging out the flesh. Puree the cooked squash. A puree of winter squash will hold up well in the freezer for many months. Use a blender or a food processor to puree the winter squash until all of the lumps are gone. Cooking will have softened the squash to make this step rather easy. Alternatively, you can mash the squash with a mashing tool or even a run of the mill metal fork to achieve a similar effect. Portion and freeze small amounts of the pureed squash. Wait for the squash to cool, then portion out ⁄2 cup (120 mL) balls of the puree, placing them on a parchment-covered baking sheet or in an ice cube tray or muffin tin. Pop the tray or tin in the freezer and let the pureed squash freeze for at least four hours, or until frozen solid. Pureed squash will freeze best if it’s frozen in small portions, but if you’re in a rush, you can skip this step and transfer the puree to long-term storage immediately. Transfer the pureed squash to the freezer for up to 3 months. Once the smaller portions are frozen solid, spoon them into freezer-safe plastic containers or plastic bags. Place the containers of squash in your freezer and save until they’re ready to use. If you’re using plastic bags, remove as much air as possible from the bags before you seal them. Defrost the puree for baking or cooking. Place the puree in the refrigerator overnight to thaw it, or set it out on the counter for 3-4 hours to defrost it. You can then microwave the puree or heat it on the stovetop to add it to warm dishes. You can also add it directly to soups and chilis. Winter squash puree is a great candidate for adding to sauces, soups, dips, lasagnas, enchiladas, and baked breads or muffins. Blanching and Freezing Summer Squash Cut the squash into rounds ⁄4 inch (0.64 cm) thick. Use a sharp, heavy kitchen knife to slice off both ends of the squash, then slice your summer squash into the thin rounds. Move lengthwise down the squash, slicing every ⁄4 inch (0.64 cm). If you are freezing zucchini to make zucchini bread in the future, you should grate it instead. Use a box grater to grate the zucchini into a bowl. There is no need to peel the squash first in this method, as you are going to blanch it. Boil 1 gallon (3.8 L) of water per 1 pound (16 oz) of summer squash. Use a large stockpot over high heat. Place a wire basket or metal steamer into the stockpot. The wire basket should dip down into the water so that the squash will be completely immersed in the boiling water. You are not steaming the squash in this method. Instead, you are using the wire basket as a way to easily fish the squash out of the water when ready. Put the squash into a wire basket and blanch them for 3 to 4 minutes. Place no more than 1 lb (450 g) of squash in the boiling water at a time. Cook for roughly 3 minutes. After the pieces of squash are done, remove the squash from the stockpot using the wire basket. You can poke the squash with a fork after 3 minutes to check for tenderness. If the squash feel tender, they are ready. If you are working with grated zucchini, blanch the grated pieces in small batches for 1 to 2 minutes each, until they feel tender. Dunk the squash in cold water or a bowl of ice for another 3 minutes. If you’re using a bowl of ice, make sure you have about 1 pound (16 oz) of ice to 1 pound (16 oz) of vegetables. If you’re using liquid water, run cold tap water continuously over the squash or change it frequently so it stays cold. Ideally, the water should be 60 °F (16 °C) or below. Dunking the squash in ice water after you have blanched it will stop the cooking process, thereby preventing the enzymes from breaking down any further. As a result, you are left with squash that retains its color, flavor, and most of its texture. Drain the squash to remove any excess water. Pour the ice bucket filled with squash through a colander (or any kind of strainer) to remove excess water from the squash. This will prepare the squash for freezing. Pat the pieces dry with a paper towel after draining. You can sandwich the squash between two paper towels for about 10 minutes to make sure they have dried completely. Freeze the blanched squash in a plastic bag for up to 6 months. Fill freezer-safe plastic containers or plastic bags with the squash. If using plastic bags, you can try to push as much air as possible out of the bag before sealing. Place the containers of squash in the freezer. Keep them there until you are ready to use them. Blanched summer squash will usually stay good in a freezer for up to 6 months. Defrost the squash and use it for cooking or baking. Place the summer squash in the fridge overnight to thaw it out, or place it on the counter for 3-4 hours to defrost it. Then, use your frozen summer squash in pasta sauces, soups, casseroles, or as a side dish. Grated zucchini will work very well in risotto, soup, muffin batter, or cake batter. As a totally stand alone dish, grated squash can be sautéed in brown butter with garlic and sage.",
  "sentences":[
    " Freezing Raw Winter Squash Peel the squash using a vegetable peeler or knife.",
    "Set the squash on a cutting board and cut the rounded ends off of each side.",
    "Then, holding the squash in one hand, use a vegetable peeler in your dominant hand to peel strips of squash off away from you.",
    "If you're using a knife, hold the squash upright on your cutting board and slice downwards, removing the squash’s skin.",
    "Once you’ve finished one section with the vegetable peeler, rotate the squash in your non-dominant hand to peel another side.",
    "With a knife, slice just beneath the skin on one side of the squash.",
    "Then, slice all the way down the length of the squash until this strip is completely removed.",
    "Continue slicing off other strips of skin in this manner until you make it all the way around the squash.",
    "Cut the squash into 1 inch (2.5 cm) cubes.",
    "Use a serrated kitchen knife to cut the squash into evenly-sized pieces.",
    "You can technically cut the pieces into any size, but 1 inch (2.5 cm) cubes are good for freezer bags if you don’t have a specific size in mind.",
    "Use a cutting board whenever chopping vegetables.",
    "Freeze the squash on a baking sheet for 2 hours.",
    "Line a baking sheet with parchment or wax paper.",
    "Spread the pieces of squash onto the baking sheet in a single layer, without overlapping.",
    "Place this baking sheet in the freezer and allow the squash to freeze solid for around 2 hours.",
    "Freezing the pieces this way makes it less likely that the squash will stick together in long-term frozen storage.",
    "Transfer the squash to a freezer-safe container.",
    "Take the individually frozen pieces of squash and place them into a freezer-safe plastic container or plastic bag.",
    "Leave ⁄2 inch (1.3 cm)  of empty space on the top before sealing the container.",
    "Tupperware and plastic bags both make good storage solutions.",
    "If using a plastic bag, push as much air out of the bag as possible before sealing it.",
    "Freeze the uncooked squash for up to 12 months.",
    "Place the containers of squash in the freezer and store them there until you are ready to use the vegetable in a dish.",
    "Label the bag or container so you know when you put it in the freezer for storage.",
    "Defrost the squash or add it directly to certain soups and chilis.",
    "When you’re ready to use the squash, you can add the chunks directly to warm stews or you can thaw them for use in other recipes.",
    "To thaw the frozen squash, move the bag of squash from the freezer to the refrigerator overnight, or set it out on the counter for 3-4 hours.",
    "You can also roast butternut squash directly from the freezer without thawing it.",
    "Cooking and Freezing Winter Squash Preheat the oven to 400 °F (204 °C).",
    "You will be using the oven to roast the squash before freezing them.",
    "Set the oven to Bake and turn it up to 400 °F (204 °C).",
    "If you prefer, it is also possible to cook the squash in the microwave, in which case you do not need to worry about preheating the oven.",
    "Cut the squash in half using a sharp, serrated knife.",
    "Set the squash on a cutting board, and hold it steady with one hand.",
    "Using the knife, cut the squash into halves lengthwise.",
    "Set the squash halves down on the cutting board, with the flesh-side facing up.",
    "For bigger squash like butternut squash, move slowly and carefully with the knife.",
    "Squash roll, and you don’t want the knife to slip.",
    "If the squash is smaller, like an acorn squash, it will be easier to hold it steady.",
    "Scoop out the stringy insides of the squash.",
    "Using a spoon or your hands, scoop away and discard any pulp or seeds on the inside of the squash.",
    "If you have a melon baller, this is a great tool to easily scoop and discard seeds.",
    "A serrated grapefruit spoon will also help get the job done.",
    "Compost or trash the inner bits of the squash.",
    "Spoons don’t cut as well through the strings of a squash as a melon baller, due to their dull edges.",
    "Place the squash, flesh-side up, on a baking sheet.",
    "If you want to add some flavor, season the squash with salt and pepper.",
    "You can also add about 1 tbsp (15 mL) of butter or honey and 1 tbsp (14.3 g) of brown sugar to the squash at this point.",
    "If you plan to roast the squash straight out of the freezer, adding butter and brown sugar at this stage is a good idea.",
    "Otherwise, the squash will preserve better without additives, and you can just bake it as it is.",
    "Bake the squash for 25 minutes or until it is tender.",
    "Place the baking sheet in the previously preheated oven (400 °F (204 °C)) and let them bake for 25 minutes.",
    "After 25 minutes, take the baking tray out, and use a fork to check if the flesh is soft (you should be able to pierce the flesh with the fork).",
    "To microwave the squash, place the squash pieces on a piece of microwave-safe plastic wrap on top of a microwavable plate.",
    "Cook them for 15 minutes on high, checking the squash at every 5 minute interval.",
    "Continue cooking until the flesh is soft enough to scoop it out of the skin with a spoon.",
    "Scoop out the flesh of the squash with a spoon.",
    "Once the squash has cooled down sufficiently, use a metal spoon to dig out the softened insides of the squash away from its skin.",
    "Transfer the fleshy parts into a separate bowl and discard the hollowed out skin once you’re done.",
    "You can also use a serrated spoon for a bit of extra help digging out the flesh.",
    "Puree the cooked squash.",
    "A puree of winter squash will hold up well in the freezer for many months.",
    "Use a blender or a food processor to puree the winter squash until all of the lumps are gone.",
    "Cooking will have softened the squash to make this step rather easy.",
    "Alternatively, you can mash the squash with a mashing tool or even a run of the mill metal fork to achieve a similar effect.",
    "Portion and freeze small amounts of the pureed squash.",
    "Wait for the squash to cool, then portion out ⁄2 cup (120 mL) balls of the puree, placing them on a parchment-covered baking sheet or in an ice cube tray or muffin tin.",
    "Pop the tray or tin in the freezer and let the pureed squash freeze for at least four hours, or until frozen solid.",
    "Pureed squash will freeze best if it’s frozen in small portions, but if you’re in a rush, you can skip this step and transfer the puree to long-term storage immediately.",
    "Transfer the pureed squash to the freezer for up to 3 months.",
    "Once the smaller portions are frozen solid, spoon them into freezer-safe plastic containers or plastic bags.",
    "Place the containers of squash in your freezer and save until they’re ready to use.",
    "If you’re using plastic bags, remove as much air as possible from the bags before you seal them.",
    "Defrost the puree for baking or cooking.",
    "Place the puree in the refrigerator overnight to thaw it, or set it out on the counter for 3-4 hours to defrost it.",
    "You can then microwave the puree or heat it on the stovetop to add it to warm dishes.",
    "You can also add it directly to soups and chilis.",
    "Winter squash puree is a great candidate for adding to sauces, soups, dips, lasagnas, enchiladas, and baked breads or muffins.",
    "Blanching and Freezing Summer Squash Cut the squash into rounds ⁄4 inch (0.64 cm) thick.",
    "Use a sharp, heavy kitchen knife to slice off both ends of the squash, then slice your summer squash into the thin rounds.",
    "Move lengthwise down the squash, slicing every ⁄4 inch (0.64 cm).",
    "If you are freezing zucchini to make zucchini bread in the future, you should grate it instead.",
    "Use a box grater to grate the zucchini into a bowl.",
    "There is no need to peel the squash first in this method, as you are going to blanch it.",
    "Boil 1 gallon (3.8 L) of water per 1 pound (16 oz) of summer squash.",
    "Use a large stockpot over high heat.",
    "Place a wire basket or metal steamer into the stockpot.",
    "The wire basket should dip down into the water so that the squash will be completely immersed in the boiling water.",
    "You are not steaming the squash in this method.",
    "Instead, you are using the wire basket as a way to easily fish the squash out of the water when ready.",
    "Put the squash into a wire basket and blanch them for 3 to 4 minutes.",
    "Place no more than 1 lb (450 g) of squash in the boiling water at a time.",
    "Cook for roughly 3 minutes.",
    "After the pieces of squash are done, remove the squash from the stockpot using the wire basket.",
    "You can poke the squash with a fork after 3 minutes to check for tenderness.",
    "If the squash feel tender, they are ready.",
    "If you are working with grated zucchini, blanch the grated pieces in small batches for 1 to 2 minutes each, until they feel tender.",
    "Dunk the squash in cold water or a bowl of ice for another 3 minutes.",
    "If you’re using a bowl of ice, make sure you have about 1 pound (16 oz) of ice to 1 pound (16 oz) of vegetables.",
    "If you’re using liquid water, run cold tap water continuously over the squash or change it frequently so it stays cold.",
    "Ideally, the water should be 60 °F (16 °C) or below.",
    "Dunking the squash in ice water after you have blanched it will stop the cooking process, thereby preventing the enzymes from breaking down any further.",
    "As a result, you are left with squash that retains its color, flavor, and most of its texture.",
    "Drain the squash to remove any excess water.",
    "Pour the ice bucket filled with squash through a colander (or any kind of strainer) to remove excess water from the squash.",
    "This will prepare the squash for freezing.",
    "Pat the pieces dry with a paper towel after draining.",
    "You can sandwich the squash between two paper towels for about 10 minutes to make sure they have dried completely.",
    "Freeze the blanched squash in a plastic bag for up to 6 months.",
    "Fill freezer-safe plastic containers or plastic bags with the squash.",
    "If using plastic bags, you can try to push as much air as possible out of the bag before sealing.",
    "Place the containers of squash in the freezer.",
    "Keep them there until you are ready to use them.",
    "Blanched summer squash will usually stay good in a freezer for up to 6 months.",
    "Defrost the squash and use it for cooking or baking.",
    "Place the summer squash in the fridge overnight to thaw it out, or place it on the counter for 3-4 hours to defrost it.",
    "Then, use your frozen summer squash in pasta sauces, soups, casseroles, or as a side dish.",
    "Grated zucchini will work very well in risotto, soup, muffin batter, or cake batter.",
    "As a totally stand alone dish, grated squash can be sautéed in brown butter with garlic and sage."
  ],
  "tyn_section":[
    "Freezing Winter Squash Raw",
    "Vegetable peeler or smooth knife",
    "Serrated kitchen knife",
    "Baking tray",
    "Freezer-safe plastic container or plastic bag",
    "Food processor or blender",
    "Freezer-safe plastic containers or plastic bags",
    "Cooking and Freezing Summer Squash",
    "Large stockpot",
    "Wire basket or colander",
    "Large bowl of ice water",
    "Baking sheet"
  ],
  "tyn_model":[
    "squash",
    "freezer",
    "water",
    "knife",
    "baking sheet",
    "plastic bags",
    "oven",
    "wire basket",
    "summer squash",
    "vegetable peeler",
    "plastic bag",
    "microwave",
    "spoon",
    "fork",
    "bowl",
    "winter squash",
    "zucchini",
    "stockpot",
    "ice",
    "refrigerator",
    "butternut squash",
    "butter",
    "brown sugar",
    "serrated kitchen knife",
    "freezer bags",
    "parchment or wax paper",
    "freezer-safe container",
    "freezer-safe plastic container",
    "tupperware and",
    "cutting board",
    "melon baller",
    "serrated grapefruit spoon",
    "spoons",
    "salt and pepper",
    "honey",
    "baking tray",
    "microwave-safe plastic wrap",
    "microwavable plate",
    "metal spoon",
    "serrated spoon",
    "blender",
    "food processor",
    "mashing tool",
    "ice cube tray",
    "muffin tin",
    "baked breads",
    "zucchini bread",
    "box grater",
    "steamer",
    "cold water",
    "vegetables",
    "tap water",
    "ice water",
    "ice bucket",
    "colander",
    "paper towel",
    "paper towels",
    "freezer-safe plastic containers",
    "fridge",
    "brown butter",
    "garlic",
    "sage"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0483870968,
    "f1":0.0810810811,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.1451612903,
    "f1":0.2432432432
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2580645161,
    "f1":0.4102564103
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0483870968,
    "f1":0.0810810811
  }
}