{
  "title":"How to Hull Strawberries",
  "url":"https://www.wikihow.com/Hull-Strawberries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Berries"
  ],
  "methods":[
    {
      "name":"Using a Huller",
      "steps":[
        {
          "headline":"Purchase a strawberry huller.",
          "description":"They are available online, in thrift shops, at kitchen stores and in some supermarkets. If you have strawberry bushes or cook with strawberries throughout the year, the $3 purchase price will be a good value considering the time it will save."
        },
        {
          "headline":"Pick up a strawberry.",
          "description":"Hold the side of the berry between the index finger and thumb on your non-dominant hand. Keep the leaves tilted toward your other hand."
        },
        {
          "headline":"Hold the small metal huller between the thumb and forefinger on your dominant hand.",
          "description":"The sides of the huller should pinch open and release easily with a small amount of pressure."
        },
        {
          "headline":"Place the metal sides of the huller against the outer edges of the hull.",
          "description":"They should sit at the border of where the top of the strawberry turns from red to white. Insert them into the strawberry about one-quarter of an inch (0.6 cm)."
        },
        {
          "headline":"Pinch either side of the huller and twist it.",
          "description":"Pull the huller out of the strawberry. The calyx will slide out with the huller."
        },
        {
          "headline":"Discard the hull and wash the strawberries before serving.",
          "description":""
        }
      ]
    },
    {
      "name":"Using a Straw",
      "steps":[
        {
          "headline":"Find a sturdy plastic drinking straw.",
          "description":"If the straw has a bend to it, use the opposite end that is straight."
        },
        {
          "headline":"Thread the end of the straw through the bottom point of the strawberry.",
          "description":"Push it vertically until it comes out the calyx at the top. The riper the strawberry, the less force you will need to use."
        },
        {
          "headline":"Pull the straw all the way through the other end.",
          "description":"Grab the hull and discard it."
        }
      ]
    },
    {
      "name":"Using a Knife",
      "steps":[
        {
          "headline":"Find your smallest paring knife.",
          "description":"You won’t be cutting very far into the strawberry."
        },
        {
          "headline":"Hold the strawberry in your left, or non-dominant hand",
          "description":""
        },
        {
          "headline":"Insert the tip of your paring knife at a 45-degree angle, where the top of the strawberry turns white.",
          "description":"Press it about one-quarter inch (0.6 cm) toward the center. Inserting the blade of your knife at an angle toward the center will save as much of the sweet fruit as possible. Avoid simply lopping off the top third of the strawberry."
        },
        {
          "headline":"Slice in a circular motion around the diameter of the calyx, until your knife reaches your starting point.",
          "description":""
        },
        {
          "headline":"Remove the knife and discard the hull.",
          "description":""
        }
      ]
    }
  ],
  "text":" Using a Huller Purchase a strawberry huller. They are available online, in thrift shops, at kitchen stores and in some supermarkets. If you have strawberry bushes or cook with strawberries throughout the year, the $3 purchase price will be a good value considering the time it will save. Pick up a strawberry. Hold the side of the berry between the index finger and thumb on your non-dominant hand. Keep the leaves tilted toward your other hand. Hold the small metal huller between the thumb and forefinger on your dominant hand. The sides of the huller should pinch open and release easily with a small amount of pressure. Place the metal sides of the huller against the outer edges of the hull. They should sit at the border of where the top of the strawberry turns from red to white. Insert them into the strawberry about one-quarter of an inch (0.6 cm). Pinch either side of the huller and twist it. Pull the huller out of the strawberry. The calyx will slide out with the huller. Discard the hull and wash the strawberries before serving.  Using a Straw Find a sturdy plastic drinking straw. If the straw has a bend to it, use the opposite end that is straight. Thread the end of the straw through the bottom point of the strawberry. Push it vertically until it comes out the calyx at the top. The riper the strawberry, the less force you will need to use. Pull the straw all the way through the other end. Grab the hull and discard it. Using a Knife Find your smallest paring knife. You won’t be cutting very far into the strawberry. Hold the strawberry in your left, or non-dominant hand  Insert the tip of your paring knife at a 45-degree angle, where the top of the strawberry turns white. Press it about one-quarter inch (0.6 cm) toward the center. Inserting the blade of your knife at an angle toward the center will save as much of the sweet fruit as possible. Avoid simply lopping off the top third of the strawberry. Slice in a circular motion around the diameter of the calyx, until your knife reaches your starting point.  Remove the knife and discard the hull. ",
  "sentences":[
    " Using a Huller Purchase a strawberry huller.",
    "They are available online, in thrift shops, at kitchen stores and in some supermarkets.",
    "If you have strawberry bushes or cook with strawberries throughout the year, the $3 purchase price will be a good value considering the time it will save.",
    "Pick up a strawberry.",
    "Hold the side of the berry between the index finger and thumb on your non-dominant hand.",
    "Keep the leaves tilted toward your other hand.",
    "Hold the small metal huller between the thumb and forefinger on your dominant hand.",
    "The sides of the huller should pinch open and release easily with a small amount of pressure.",
    "Place the metal sides of the huller against the outer edges of the hull.",
    "They should sit at the border of where the top of the strawberry turns from red to white.",
    "Insert them into the strawberry about one-quarter of an inch (0.6 cm).",
    "Pinch either side of the huller and twist it.",
    "Pull the huller out of the strawberry.",
    "The calyx will slide out with the huller.",
    "Discard the hull and wash the strawberries before serving.",
    "Using a Straw Find a sturdy plastic drinking straw.",
    "If the straw has a bend to it, use the opposite end that is straight.",
    "Thread the end of the straw through the bottom point of the strawberry.",
    "Push it vertically until it comes out the calyx at the top.",
    "The riper the strawberry, the less force you will need to use.",
    "Pull the straw all the way through the other end.",
    "Grab the hull and discard it.",
    "Using a Knife Find your smallest paring knife.",
    "You won’t be cutting very far into the strawberry.",
    "Hold the strawberry in your left, or non-dominant hand  Insert the tip of your paring knife at a 45-degree angle, where the top of the strawberry turns white.",
    "Press it about one-quarter inch (0.6 cm) toward the center.",
    "Inserting the blade of your knife at an angle toward the center will save as much of the sweet fruit as possible.",
    "Avoid simply lopping off the top third of the strawberry.",
    "Slice in a circular motion around the diameter of the calyx, until your knife reaches your starting point.",
    "Remove the knife and discard the hull."
  ],
  "tyn_section":[
    "Fresh strawberries",
    "Paring knife",
    "Straw",
    "Strawberry huller"
  ],
  "tyn_model":[
    "strawberry",
    "straw",
    "knife",
    "huller",
    "strawberries",
    "paring knife",
    "strawberry huller",
    "drinking straw",
    "sweet fruit"
  ],
  "simple_metrics":{
    "r":0.75,
    "p":0.3333333333,
    "f1":0.4615384615,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.8888888889,
    "f1":0.9411764706
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.8888888889,
    "f1":0.9411764706
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.3333333333,
    "f1":0.4615384615
  }
}