{
  "title":"How to Make a Lockpick",
  "url":"https://www.wikihow.com/Make-a-Lockpick",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Bobby Pin Pick and Tension Wrench",
      "steps":[
        {
          "headline":"Remove the rubber tip from the straight side of the bobby pin.",
          "description":"A bobby pin has a single bend that connects 2 parallel shafts, one of them straight, the other with wavy curves in it. Both shafts have small rubber tips at the end. Pluck off the tip on the straight shaft with pliers. In a pinch, you can remove the rubber tip with your teeth, but at the risk of tooth damage and/or swallowing the rubber tip."
        },
        {
          "headline":"Straighten out the bend in the bobby pin.",
          "description":"Use your fingers to start undoing the bend in the bobby pin, and use the pliers to finish the job if necessary. Your goal is to end up with a single aligned shaft, with one end straight (and without a rubber tip) and the other end wavy. The pin doesn’t have to be perfectly straight at the bend, but the closer you can get, the better."
        },
        {
          "headline":"Create a 45-degree hook at the last 1 cm (0.39 in) of the pin’s straight end.",
          "description":"Clamp the jaws of the pliers against 1 cm (0.39 in) of the pin on the end without the rubber tip. Grip the pin with your free hand, nearly up against the jaws of the pliers. Grip tightly on the pliers and bend your wrist to bend the clamped tip of the pin at a 45-degree angle. You can bend upward or downward—just aim for 45 degrees. If you don’t have pliers but do have a lock you’re trying to pick, stick the tip of the pin into the lock and bend the pin tip at a 45-degree angle that way. You’ve now made a pick out of a bobby pin—so it’s time to move on to making the tension wrench out of a second bobby pin."
        },
        {
          "headline":"Bend an L shape in the second pin with the rubber tips at the top of the L. Grip the pliers tightly over the bent side of the second bobby pin (opposite the ends with the rubber tips)—overlap the bend by about 2.5 cm (0.98 in).",
          "description":"Use the pliers and your free hand to bend the pin at a 90-degree angle (right angle). When you’re done, the bobby pin should look like a capital L.\nWith the tension wrench now finished as well, you’re ready to pick a lock with bobby pins."
        }
      ]
    },
    {
      "name":"Paperclip Pick and Tension Wrench",
      "steps":[
        {
          "headline":"Straighten out the outermost bend of the paperclip.",
          "description":"Use your fingers to flatten out the outside curve of the paperclip. When finished, you should have a straight shaft that’s roughly equal in length to the remaining curved section of the paperclip. Use metal paperclips that are at least 4 cm (1.6 in) long (before altering them) to make both the pick and the tension wrench. Shorter clips won’t be able to access the lock’s inner workings, and plastic paperclips will simply break."
        },
        {
          "headline":"Twist the inner end of the clip around the section next to it, using pliers.",
          "description":"In the remaining curved section of the paperclip, there will be 2 bends that result in 2 sections of the clip (including one end) butting right up against each other in parallel. Use your fingers and the pliers to wrap the end section around the straight section that it butts up against. You can skip this step if you like, but it makes the clip stronger and easier to handle when you’re trying to pick a lock."
        },
        {
          "headline":"Make a 45-degree bend about 2 cm (0.79 in) from the straight end tip.",
          "description":"Clamp the jaws of your pliers tightly over the tip of the straight section of the clip. Pinch your free hand on the clip near the jaws and use the pliers to bend the tip at a 45-degree angle, either up or down. This step and the following step combine to make an M shape at the end of the pick. Many pickers believe this shape works better than a single 45-degree angle bend. However, if you want to go the simpler route, make a single, 1 cm (0.39 in) long, 45-degree bend at the tip of the straight end and skip the next step."
        },
        {
          "headline":"Create 3 more alternating bends to create an M shape at the straight end.",
          "description":"Grip the pliers about 0.5 cm (0.20 in) back from the 45-degree bend you just made, closer to the straight end tip of the clip. Make another 45-degree angle bend, but this time in the opposite direction. Repeat this process 2 more times to create an M shape (or W shape, depending on your perspective) at the end of the clip. As noted, if you want to make just a single 45-degree bend at the end of the clip, skip this step. In either case, the pick is now finished and it’s time to move on to making the tension wrench out of a second paperclip."
        },
        {
          "headline":"Unfold the second paperclip into an elongated U shape.",
          "description":"Straighten out the outermost bend of the second clip, just like you did with the first clip. Then, straighten out the innermost bend, so that you end up with 2 long, parallel shafts connected by a single U-shaped bend. The 2 straight shafts should be nearly (if not exactly) equal in length."
        },
        {
          "headline":"Use pliers to flatten the bend so the long sections of the paperclip are touching.",
          "description":"Pinch your pliers over the U-shaped curve and squash it nearly flat between the jaws. Leave just a small bit of curve—if you pinch it down too sharply, the metal may snap at the bend. The 2 straight shafts should now be running side-by-side, if not touching their entire length."
        },
        {
          "headline":"Bend the last 2.5 cm (0.98 in) of the base of the old U at a right angle.",
          "description":"Re-grip the pliers over the bend you just flattened out, so that the jaws cover about 2.5 cm (0.98 in) of both straight shafts. Use the pliers and your free hand to bend this section at a 90-degree angle (right angle), either upward or downward. The clip should now look like a capital L with an elongated vertical section."
        },
        {
          "headline":"Twist the long sections of the paperclip around each other 2-3 times with pliers.",
          "description":"Use your fingers and the pliers to wrap one of the parallel shafts over the other, then repeat the process 1-2 more times. The more wraps you make, the sturdier (and easier to grip) your tension wrench will be. However, don’t make more than 3 wraps, or you may weaken the metal and break off the end of the clip. You’re all done with your paperclip pick and tension wrench, so try picking a lock with them—just make sure you have permission to do so!"
        }
      ]
    }
  ],
  "text":" Bobby Pin Pick and Tension Wrench Remove the rubber tip from the straight side of the bobby pin. A bobby pin has a single bend that connects 2 parallel shafts, one of them straight, the other with wavy curves in it. Both shafts have small rubber tips at the end. Pluck off the tip on the straight shaft with pliers. In a pinch, you can remove the rubber tip with your teeth, but at the risk of tooth damage and/or swallowing the rubber tip. Straighten out the bend in the bobby pin. Use your fingers to start undoing the bend in the bobby pin, and use the pliers to finish the job if necessary. Your goal is to end up with a single aligned shaft, with one end straight (and without a rubber tip) and the other end wavy. The pin doesn’t have to be perfectly straight at the bend, but the closer you can get, the better. Create a 45-degree hook at the last 1 cm (0.39 in) of the pin’s straight end. Clamp the jaws of the pliers against 1 cm (0.39 in) of the pin on the end without the rubber tip. Grip the pin with your free hand, nearly up against the jaws of the pliers. Grip tightly on the pliers and bend your wrist to bend the clamped tip of the pin at a 45-degree angle. You can bend upward or downward—just aim for 45 degrees. If you don’t have pliers but do have a lock you’re trying to pick, stick the tip of the pin into the lock and bend the pin tip at a 45-degree angle that way. You’ve now made a pick out of a bobby pin—so it’s time to move on to making the tension wrench out of a second bobby pin. Bend an L shape in the second pin with the rubber tips at the top of the L. Grip the pliers tightly over the bent side of the second bobby pin (opposite the ends with the rubber tips)—overlap the bend by about 2.5 cm (0.98 in). Use the pliers and your free hand to bend the pin at a 90-degree angle (right angle). When you’re done, the bobby pin should look like a capital L.\nWith the tension wrench now finished as well, you’re ready to pick a lock with bobby pins. Paperclip Pick and Tension Wrench Straighten out the outermost bend of the paperclip. Use your fingers to flatten out the outside curve of the paperclip. When finished, you should have a straight shaft that’s roughly equal in length to the remaining curved section of the paperclip. Use metal paperclips that are at least 4 cm (1.6 in) long (before altering them) to make both the pick and the tension wrench. Shorter clips won’t be able to access the lock’s inner workings, and plastic paperclips will simply break. Twist the inner end of the clip around the section next to it, using pliers. In the remaining curved section of the paperclip, there will be 2 bends that result in 2 sections of the clip (including one end) butting right up against each other in parallel. Use your fingers and the pliers to wrap the end section around the straight section that it butts up against. You can skip this step if you like, but it makes the clip stronger and easier to handle when you’re trying to pick a lock. Make a 45-degree bend about 2 cm (0.79 in) from the straight end tip. Clamp the jaws of your pliers tightly over the tip of the straight section of the clip. Pinch your free hand on the clip near the jaws and use the pliers to bend the tip at a 45-degree angle, either up or down. This step and the following step combine to make an M shape at the end of the pick. Many pickers believe this shape works better than a single 45-degree angle bend. However, if you want to go the simpler route, make a single, 1 cm (0.39 in) long, 45-degree bend at the tip of the straight end and skip the next step. Create 3 more alternating bends to create an M shape at the straight end. Grip the pliers about 0.5 cm (0.20 in) back from the 45-degree bend you just made, closer to the straight end tip of the clip. Make another 45-degree angle bend, but this time in the opposite direction. Repeat this process 2 more times to create an M shape (or W shape, depending on your perspective) at the end of the clip. As noted, if you want to make just a single 45-degree bend at the end of the clip, skip this step. In either case, the pick is now finished and it’s time to move on to making the tension wrench out of a second paperclip. Unfold the second paperclip into an elongated U shape. Straighten out the outermost bend of the second clip, just like you did with the first clip. Then, straighten out the innermost bend, so that you end up with 2 long, parallel shafts connected by a single U-shaped bend. The 2 straight shafts should be nearly (if not exactly) equal in length. Use pliers to flatten the bend so the long sections of the paperclip are touching. Pinch your pliers over the U-shaped curve and squash it nearly flat between the jaws. Leave just a small bit of curve—if you pinch it down too sharply, the metal may snap at the bend. The 2 straight shafts should now be running side-by-side, if not touching their entire length. Bend the last 2.5 cm (0.98 in) of the base of the old U at a right angle. Re-grip the pliers over the bend you just flattened out, so that the jaws cover about 2.5 cm (0.98 in) of both straight shafts. Use the pliers and your free hand to bend this section at a 90-degree angle (right angle), either upward or downward. The clip should now look like a capital L with an elongated vertical section. Twist the long sections of the paperclip around each other 2-3 times with pliers. Use your fingers and the pliers to wrap one of the parallel shafts over the other, then repeat the process 1-2 more times. The more wraps you make, the sturdier (and easier to grip) your tension wrench will be. However, don’t make more than 3 wraps, or you may weaken the metal and break off the end of the clip. You’re all done with your paperclip pick and tension wrench, so try picking a lock with them—just make sure you have permission to do so!",
  "sentences":[
    " Bobby Pin Pick and Tension Wrench Remove the rubber tip from the straight side of the bobby pin.",
    "A bobby pin has a single bend that connects 2 parallel shafts, one of them straight, the other with wavy curves in it.",
    "Both shafts have small rubber tips at the end.",
    "Pluck off the tip on the straight shaft with pliers.",
    "In a pinch, you can remove the rubber tip with your teeth, but at the risk of tooth damage and/or swallowing the rubber tip.",
    "Straighten out the bend in the bobby pin.",
    "Use your fingers to start undoing the bend in the bobby pin, and use the pliers to finish the job if necessary.",
    "Your goal is to end up with a single aligned shaft, with one end straight (and without a rubber tip) and the other end wavy.",
    "The pin doesn’t have to be perfectly straight at the bend, but the closer you can get, the better.",
    "Create a 45-degree hook at the last 1 cm (0.39 in) of the pin’s straight end.",
    "Clamp the jaws of the pliers against 1 cm (0.39 in) of the pin on the end without the rubber tip.",
    "Grip the pin with your free hand, nearly up against the jaws of the pliers.",
    "Grip tightly on the pliers and bend your wrist to bend the clamped tip of the pin at a 45-degree angle.",
    "You can bend upward or downward—just aim for 45 degrees.",
    "If you don’t have pliers but do have a lock you’re trying to pick, stick the tip of the pin into the lock and bend the pin tip at a 45-degree angle that way.",
    "You’ve now made a pick out of a bobby pin—so it’s time to move on to making the tension wrench out of a second bobby pin.",
    "Bend an L shape in the second pin with the rubber tips at the top of the L. Grip the pliers tightly over the bent side of the second bobby pin (opposite the ends with the rubber tips)—overlap the bend by about 2.5 cm (0.98 in).",
    "Use the pliers and your free hand to bend the pin at a 90-degree angle (right angle).",
    "When you’re done, the bobby pin should look like a capital L.\nWith the tension wrench now finished as well, you’re ready to pick a lock with bobby pins.",
    "Paperclip Pick and Tension Wrench Straighten out the outermost bend of the paperclip.",
    "Use your fingers to flatten out the outside curve of the paperclip.",
    "When finished, you should have a straight shaft that’s roughly equal in length to the remaining curved section of the paperclip.",
    "Use metal paperclips that are at least 4 cm (1.6 in) long (before altering them) to make both the pick and the tension wrench.",
    "Shorter clips won’t be able to access the lock’s inner workings, and plastic paperclips will simply break.",
    "Twist the inner end of the clip around the section next to it, using pliers.",
    "In the remaining curved section of the paperclip, there will be 2 bends that result in 2 sections of the clip (including one end) butting right up against each other in parallel.",
    "Use your fingers and the pliers to wrap the end section around the straight section that it butts up against.",
    "You can skip this step if you like, but it makes the clip stronger and easier to handle when you’re trying to pick a lock.",
    "Make a 45-degree bend about 2 cm (0.79 in) from the straight end tip.",
    "Clamp the jaws of your pliers tightly over the tip of the straight section of the clip.",
    "Pinch your free hand on the clip near the jaws and use the pliers to bend the tip at a 45-degree angle, either up or down.",
    "This step and the following step combine to make an M shape at the end of the pick.",
    "Many pickers believe this shape works better than a single 45-degree angle bend.",
    "However, if you want to go the simpler route, make a single, 1 cm (0.39 in) long, 45-degree bend at the tip of the straight end and skip the next step.",
    "Create 3 more alternating bends to create an M shape at the straight end.",
    "Grip the pliers about 0.5 cm (0.20 in) back from the 45-degree bend you just made, closer to the straight end tip of the clip.",
    "Make another 45-degree angle bend, but this time in the opposite direction.",
    "Repeat this process 2 more times to create an M shape (or W shape, depending on your perspective) at the end of the clip.",
    "As noted, if you want to make just a single 45-degree bend at the end of the clip, skip this step.",
    "In either case, the pick is now finished and it’s time to move on to making the tension wrench out of a second paperclip.",
    "Unfold the second paperclip into an elongated U shape.",
    "Straighten out the outermost bend of the second clip, just like you did with the first clip.",
    "Then, straighten out the innermost bend, so that you end up with 2 long, parallel shafts connected by a single U-shaped bend.",
    "The 2 straight shafts should be nearly (if not exactly) equal in length.",
    "Use pliers to flatten the bend so the long sections of the paperclip are touching.",
    "Pinch your pliers over the U-shaped curve and squash it nearly flat between the jaws.",
    "Leave just a small bit of curve—if you pinch it down too sharply, the metal may snap at the bend.",
    "The 2 straight shafts should now be running side-by-side, if not touching their entire length.",
    "Bend the last 2.5 cm (0.98 in) of the base of the old U at a right angle.",
    "Re-grip the pliers over the bend you just flattened out, so that the jaws cover about 2.5 cm (0.98 in) of both straight shafts.",
    "Use the pliers and your free hand to bend this section at a 90-degree angle (right angle), either upward or downward.",
    "The clip should now look like a capital L with an elongated vertical section.",
    "Twist the long sections of the paperclip around each other 2-3 times with pliers.",
    "Use your fingers and the pliers to wrap one of the parallel shafts over the other, then repeat the process 1-2 more times.",
    "The more wraps you make, the sturdier (and easier to grip) your tension wrench will be.",
    "However, don’t make more than 3 wraps, or you may weaken the metal and break off the end of the clip.",
    "You’re all done with your paperclip pick and tension wrench, so try picking a lock with them—just make sure you have permission to do so!"
  ],
  "tyn_section":[
    "Pliers",
    "2 bobby pins OR 2 metal paperclips"
  ],
  "tyn_model":[
    "pliers",
    "bobby pin",
    "tension wrench",
    "paperclip",
    "—just",
    "paperclips",
    "pick",
    "pin",
    "—so",
    "bobby pins",
    "pickers",
    "—if",
    "paperclip pick"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0769230769,
    "f1":0.1333333333,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.0769230769,
    "f1":0.1333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.1538461538,
    "f1":0.2666666667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0769230769,
    "f1":0.1333333333
  }
}