{
  "title":"How to Emcee an Event",
  "url":"https://www.wikihow.com/Emcee-an-Event",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties"
  ],
  "parts":[
    {
      "name":"Researching the Event",
      "steps":[
        {
          "headline":"Meet with the planner of the event to review all the information that will be presented.",
          "description":"In some cases, the event planner is also the emcee."
        },
        {
          "headline":"Talk personally to each of the performers or presenters.",
          "description":"Ask them if they require anything special in their introduction. Ask them to pronounce their full name, so that you can say it with ease."
        },
        {
          "headline":"Research each of the people or groups you will be introducing.",
          "description":"Go to their website, listen to their music, read their blog or ask for their resume. You should be able to talk about the person in-depth and off-the-cuff."
        },
        {
          "headline":"Ask if there are any topics that are frowned upon or sensitive during this event.",
          "description":"Learning about intricacies in the event will help you stay on tone as you present."
        },
        {
          "headline":"Establish the theme of the event.",
          "description":"A theme will connect each of your introductions and improve event cohesiveness."
        },
        {
          "headline":"Write your introductions down.",
          "description":"Don’t improvise or you are likely to say the wrong thing or take up too much time. The following are good rules to follow when writing your script:\nDon’t use inside jokes. If the whole audience doesn’t get them, they can ruin the cohesive feeling in the group. Don’t use offensive language or stereotypes. If you can’t tell a joke without offending, avoid humor and be sincere. Avoid hyperbole when you explain the presenters. Don’t say “She is the best person in the world,” say, “She won the Community Leader Award for the last three years.” Let the resume speak for itself when possible. Keep it short. Spend the same amount of time and care on each presenter."
        }
      ]
    },
    {
      "name":"Preparing on Performance Day",
      "steps":[
        {
          "headline":"Get to the venue several hours in advance.",
          "description":"You need time to get comfortable, learn the layout and practice. You are the representative of the event, so it should feel like your home for the next few hours or days."
        },
        {
          "headline":"Do a stage check with the microphone, lighting and other audio/visual (AV) aids at least one hour before the guests arrive.",
          "description":"Make sure you have an AV person who will troubleshoot for you if something goes wrong."
        },
        {
          "headline":"Introduce yourself to the staff at the event.",
          "description":"This should include both the people running the venue and the event. They will be your support if something goes wrong."
        },
        {
          "headline":"Ask for emergency information.",
          "description":"You may be considered “the boss” during the event, and you must be able to direct people about how they should exit the venue."
        },
        {
          "headline":"Review the order of presenters or performers in advance and on the day.",
          "description":"If someone doesn’t show up, you will need to streamline the schedule or fill a gap. Tell the presenters their order of appearance."
        },
        {
          "headline":"Dress for success.",
          "description":"This old cliché is extremely important for an emcee because you must look professional, well groomed and poised. Establish whether you should be in formal, semi-formal or business casual clothing before the event starts."
        }
      ]
    },
    {
      "name":"Opening an Event",
      "steps":[
        {
          "headline":"Call the event to order.",
          "description":"If you are in a noisy setting, now is your chance to get people’s attention. You can do so with a carefully rehearsed shout, a clinking of a glass or an exclamation like, “Give me a thumbs up if you can hear me in the back.”"
        },
        {
          "headline":"Welcome the audience.",
          "description":"Start with a friendly and sincere tone. Answer the question, “Why are we all here?”"
        },
        {
          "headline":"Introduce yourself.",
          "description":"Feel free to start with a quick, funny anecdote to set the mood."
        },
        {
          "headline":"Introduce the people who put the event on.",
          "description":"Recognize anyone who helped put on the event. If the producers of the event want to identify big donors, now is the time to sincerely thank them."
        },
        {
          "headline":"Smile.",
          "description":"From the time you start presenting until the event finishes, you should be in good humor and have a smile."
        }
      ]
    },
    {
      "name":"Leading\\/Closing an Event",
      "steps":[
        {
          "headline":"Stay near the stage during all presentations.",
          "description":"To control the event, you will need to be at the ready. If you need water or a bathroom break, plan your timing in advance."
        },
        {
          "headline":"Keep your eye on the clock.",
          "description":"You are the timekeeper of the event. If something goes wrong, figure out ahead of time if there’s something you can cut. Have a short story you can tell if you need to fill time."
        },
        {
          "headline":"Give your grand finale some enthusiasm.",
          "description":"If people have been sitting for a while, they will take a cue off of your mood. Let them know how important a raffle, auction or presentation item is."
        },
        {
          "headline":"Thank everyone for attending.",
          "description":"Thank the organizers, presenters and staff again."
        },
        {
          "headline":"Suggest a call to action.",
          "description":"If this is a promotion or there is another event, announce it and tell people one thing they should do to get involved."
        }
      ]
    }
  ],
  "text":" Researching the Event Meet with the planner of the event to review all the information that will be presented. In some cases, the event planner is also the emcee. Talk personally to each of the performers or presenters. Ask them if they require anything special in their introduction. Ask them to pronounce their full name, so that you can say it with ease. Research each of the people or groups you will be introducing. Go to their website, listen to their music, read their blog or ask for their resume. You should be able to talk about the person in-depth and off-the-cuff. Ask if there are any topics that are frowned upon or sensitive during this event. Learning about intricacies in the event will help you stay on tone as you present. Establish the theme of the event. A theme will connect each of your introductions and improve event cohesiveness. Write your introductions down. Don’t improvise or you are likely to say the wrong thing or take up too much time. The following are good rules to follow when writing your script:\nDon’t use inside jokes. If the whole audience doesn’t get them, they can ruin the cohesive feeling in the group. Don’t use offensive language or stereotypes. If you can’t tell a joke without offending, avoid humor and be sincere. Avoid hyperbole when you explain the presenters. Don’t say “She is the best person in the world,” say, “She won the Community Leader Award for the last three years.” Let the resume speak for itself when possible. Keep it short. Spend the same amount of time and care on each presenter. Preparing on Performance Day Get to the venue several hours in advance. You need time to get comfortable, learn the layout and practice. You are the representative of the event, so it should feel like your home for the next few hours or days. Do a stage check with the microphone, lighting and other audio/visual (AV) aids at least one hour before the guests arrive. Make sure you have an AV person who will troubleshoot for you if something goes wrong. Introduce yourself to the staff at the event. This should include both the people running the venue and the event. They will be your support if something goes wrong. Ask for emergency information. You may be considered “the boss” during the event, and you must be able to direct people about how they should exit the venue. Review the order of presenters or performers in advance and on the day. If someone doesn’t show up, you will need to streamline the schedule or fill a gap. Tell the presenters their order of appearance. Dress for success. This old cliché is extremely important for an emcee because you must look professional, well groomed and poised. Establish whether you should be in formal, semi-formal or business casual clothing before the event starts. Opening an Event Call the event to order. If you are in a noisy setting, now is your chance to get people’s attention. You can do so with a carefully rehearsed shout, a clinking of a glass or an exclamation like, “Give me a thumbs up if you can hear me in the back.” Welcome the audience. Start with a friendly and sincere tone. Answer the question, “Why are we all here?” Introduce yourself. Feel free to start with a quick, funny anecdote to set the mood. Introduce the people who put the event on. Recognize anyone who helped put on the event. If the producers of the event want to identify big donors, now is the time to sincerely thank them. Smile. From the time you start presenting until the event finishes, you should be in good humor and have a smile. Leading\\/Closing an Event Stay near the stage during all presentations. To control the event, you will need to be at the ready. If you need water or a bathroom break, plan your timing in advance. Keep your eye on the clock. You are the timekeeper of the event. If something goes wrong, figure out ahead of time if there’s something you can cut. Have a short story you can tell if you need to fill time. Give your grand finale some enthusiasm. If people have been sitting for a while, they will take a cue off of your mood. Let them know how important a raffle, auction or presentation item is. Thank everyone for attending. Thank the organizers, presenters and staff again. Suggest a call to action. If this is a promotion or there is another event, announce it and tell people one thing they should do to get involved.",
  "sentences":[
    " Researching the Event Meet with the planner of the event to review all the information that will be presented.",
    "In some cases, the event planner is also the emcee.",
    "Talk personally to each of the performers or presenters.",
    "Ask them if they require anything special in their introduction.",
    "Ask them to pronounce their full name, so that you can say it with ease.",
    "Research each of the people or groups you will be introducing.",
    "Go to their website, listen to their music, read their blog or ask for their resume.",
    "You should be able to talk about the person in-depth and off-the-cuff.",
    "Ask if there are any topics that are frowned upon or sensitive during this event.",
    "Learning about intricacies in the event will help you stay on tone as you present.",
    "Establish the theme of the event.",
    "A theme will connect each of your introductions and improve event cohesiveness.",
    "Write your introductions down.",
    "Don’t improvise or you are likely to say the wrong thing or take up too much time.",
    "The following are good rules to follow when writing your script:\nDon’t use inside jokes.",
    "If the whole audience doesn’t get them, they can ruin the cohesive feeling in the group.",
    "Don’t use offensive language or stereotypes.",
    "If you can’t tell a joke without offending, avoid humor and be sincere.",
    "Avoid hyperbole when you explain the presenters.",
    "Don’t say “She is the best person in the world,” say, “She won the Community Leader Award for the last three years.” Let the resume speak for itself when possible.",
    "Keep it short.",
    "Spend the same amount of time and care on each presenter.",
    "Preparing on Performance Day Get to the venue several hours in advance.",
    "You need time to get comfortable, learn the layout and practice.",
    "You are the representative of the event, so it should feel like your home for the next few hours or days.",
    "Do a stage check with the microphone, lighting and other audio/visual (AV) aids at least one hour before the guests arrive.",
    "Make sure you have an AV person who will troubleshoot for you if something goes wrong.",
    "Introduce yourself to the staff at the event.",
    "This should include both the people running the venue and the event.",
    "They will be your support if something goes wrong.",
    "Ask for emergency information.",
    "You may be considered “the boss” during the event, and you must be able to direct people about how they should exit the venue.",
    "Review the order of presenters or performers in advance and on the day.",
    "If someone doesn’t show up, you will need to streamline the schedule or fill a gap.",
    "Tell the presenters their order of appearance.",
    "Dress for success.",
    "This old cliché is extremely important for an emcee because you must look professional, well groomed and poised.",
    "Establish whether you should be in formal, semi-formal or business casual clothing before the event starts.",
    "Opening an Event Call the event to order.",
    "If you are in a noisy setting, now is your chance to get people’s attention.",
    "You can do so with a carefully rehearsed shout, a clinking of a glass or an exclamation like, “Give me a thumbs up if you can hear me in the back.” Welcome the audience.",
    "Start with a friendly and sincere tone.",
    "Answer the question, “Why are we all here?” Introduce yourself.",
    "Feel free to start with a quick, funny anecdote to set the mood.",
    "Introduce the people who put the event on.",
    "Recognize anyone who helped put on the event.",
    "If the producers of the event want to identify big donors, now is the time to sincerely thank them.",
    "Smile.",
    "From the time you start presenting until the event finishes, you should be in good humor and have a smile.",
    "Leading\\/Closing an Event Stay near the stage during all presentations.",
    "To control the event, you will need to be at the ready.",
    "If you need water or a bathroom break, plan your timing in advance.",
    "Keep your eye on the clock.",
    "You are the timekeeper of the event.",
    "If something goes wrong, figure out ahead of time if there’s something you can cut.",
    "Have a short story you can tell if you need to fill time.",
    "Give your grand finale some enthusiasm.",
    "If people have been sitting for a while, they will take a cue off of your mood.",
    "Let them know how important a raffle, auction or presentation item is.",
    "Thank everyone for attending.",
    "Thank the organizers, presenters and staff again.",
    "Suggest a call to action.",
    "If this is a promotion or there is another event, announce it and tell people one thing they should do to get involved."
  ],
  "tyn_section":[
    "Professional clothing",
    "Microphone",
    "Clock",
    "Prompt Card"
  ],
  "tyn_model":[
    "“she",
    "humor",
    "” say",
    "” let",
    "microphone",
    "audio/visual (av",
    "“the",
    "” during",
    "emcee",
    "glass",
    "“give",
    "” welcome",
    "“why",
    "” introduce"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0714285714,
    "f1":0.1111111111,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.0714285714,
    "f1":0.1111111111
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.0714285714,
    "f1":0.1111111111
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0714285714,
    "f1":0.1111111111
  }
}