{
  "title":"How to Knit a Dishcloth",
  "url":"https://www.wikihow.com/Knit-a-Dishcloth",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Knitting",
    "Knitting Cleaning Cloths"
  ],
  "methods":[
    {
      "name":"Making a Quick and Bulky Dishcloth",
      "steps":[
        {
          "headline":"Make a slipknot with a strand of chunky or super bulky cotton yarn.",
          "description":"Wrap the yarn around your index and middle finger 2 times. Then, pull the first loop through the second loop. Slide the loop onto a US size 11 (8 mm) knitting needle, and tug on the tail to tighten the knot around the needle. This counts as your first cast on stitch. If you don't have chunky or super bulky cotton yarn, use 2 strands from 2 balls of medium-weight cotton yarn held together instead.To choose yarn colors, try seasonal colors, such as orange for fall. Or, opt for colors that match your kitchen, such grey if you have a lot of grey in your kitchen. If you can't decide, create multi-color dishcloths, such as with rainbow colors."
        },
        {
          "headline":"Cast on 19 more stitches.",
          "description":"Hold the needle with the slipknot on it in your right hand. Then, make a loop with the working yarn and slip it onto the right hand needle. Tug the yarn to tighten the loop around the needle. Repeat this until you have cast on 19 stitches for a total of 20 including the slipknot. Casting on 20 stitches will create a dishcloth that is about 8 in (20 cm) wide."
        },
        {
          "headline":"Knit 1 time into each cast on stitch in the row.",
          "description":"Insert the right-hand needle into the first cast on stitch and then loop the yarn over the needle. Pull this yarn through the stitch and let the cast on stitch slip off of the left-hand needle. Repeat this sequence to knit all the way across the row."
        },
        {
          "headline":"Turn your work and knit.",
          "description":"When you get to the end of the first row, turn your work around so that the needle with all of the stitches on it is in your left hand. Then, knit into each stitch in the row again. Make sure to turn your work around after every row."
        },
        {
          "headline":"Continue to knit for a total of 20 rows.",
          "description":"For a dishcloth that is about 8 by 8 in (20 by 20 cm), knit for 20 rows. However, you can make the washcloth shorter or longer if desired. For example, if you want the dishcloth to be longer than it is wide, then you might knit for 30 rows instead of 20."
        },
        {
          "headline":"Bind off the last row to finish the dishcloth.",
          "description":"After you have completed the last row, bind off your stitches to secure the dishcloth. Knit the first 2 stitches in the row as you normally would, and then use the left-hand needle to lift the first stitch on the right-hand needle up and over the second stitch. Then, knit 1 and lift the first up and over the new second stitch. Repeat this to the end of the row to finish binding off. Tie a knot through the last stitch and cut the excess yarn about 0.5 in (1.3 cm) from the last stitch."
        }
      ]
    },
    {
      "name":"Creating a Diagonal Pattern Dishcloth",
      "steps":[
        {
          "headline":"Make a slipknot with medium-weight cotton yarn.",
          "description":"Use a pair of US size 8 (5.5 mm) knitting needles. Wrap the yarn around your middle and index finger 2 times, and pull the first loop through the second loop. Then, slip the loop onto your right-hand knitting needle. Tug the tail to tighten the slipknot around your needle. This counts as your first cast on stitch."
        },
        {
          "headline":"Cast on 3 more stitches.",
          "description":"Loop the yarn over the end of the left-hand needle. Then, insert the right-hand needle. Yarn over the end of the needle, and pull through. Repeat this sequence to create 2 more cast on stitches. You will have a total of 4 cast on stitches on your knitting needle when you are done."
        },
        {
          "headline":"Knit 1 time into each stitch in the first row.",
          "description":"Hold the needle with the cast on stitches on it in your left hand and the empty needle in your right hand. Insert the right-hand needle into the first cast on stitch. Loop the yarn over the end of the right-hand needle, and use the needle to pull this yarn through the cast on stitch. Let the cast on stitch slip off as the new stitch replaces it. Repeat this to the end of the row."
        },
        {
          "headline":"Turn your work and knit 2.",
          "description":"Switch the needle with the stitches on it back over to your left hand and hold the empty needle in your right hand. Knit the next 2 stitches as you normally would."
        },
        {
          "headline":"Yarn over and knit to the end of the row.",
          "description":"After you knit 2 stitches, loop the yarn over the needle to make an increase stitch. Then, knit the next 2 stitches to complete the row. At the end of the row, your total stitches will have increased by 1, so instead of 4 you will have 5 stitches."
        },
        {
          "headline":"Repeat the sequence until there are 50 stitches on the needle.",
          "description":"Continue to turn your work, knit 2, yarn over, and knit to the end of the row to expand the dishcloth. The last row will be the widest part of the dishcloth (from 1 corner to the other). Keep count of your stitches so you know when you reach 50 stitches. You can use a tally to keep track of your total number of stitches. Start with 4 tally marks and make a new 1 each time you increase. There are also many stitch counting apps available that you can try."
        },
        {
          "headline":"Knit 1, knit 2 together, then knit to the end of the row.",
          "description":"Knit the first stitch in the row as usual, and then knit the next 2 stitches together. Insert your right-hand needle into the next 2 stitches at once. Yarn over the end of the needle, and then pull through both stitches. Let the old stitches slip off the left-hand needle as the new stitch replaces them. Then, knit 1 as usual to the end of the row. At the end of the row, you will have 1 less stitch than the previous row, so 49 instead of 50."
        },
        {
          "headline":"Repeat this stitch sequence until you only have 4 stitches left.",
          "description":"Repeat the decrease stitch sequence for all of the rows after this 1. Stop knitting when your dishcloth is back down to 4 stitches. Make sure to turn your work around before you start a new row."
        },
        {
          "headline":"Cast off the remaining 4 stitches.",
          "description":"Knit 2 stitches as usual. Then, use the left-hand needle to lift the first stitch on the right-hand needle up and over the second stitch. Knit 1 and then lift the new first stitch up and over the new second stitch. Repeat this 1 more time to cast off your last stitch."
        },
        {
          "headline":"Tie a knot through the last stitch and cut the excess yarn.",
          "description":"Cut the working yarn about 6 in (15 cm) from the last stitch to free it from the skein. Then, insert the end of the yarn through the loop and use it to tie a knot. Cut the excess yarn 0.5 in (1.3 cm) from the last stitch to complete the dish cloth. Cut and tie off the tail at the beginning of the washcloth in the same way. Great ways to use knit dishcloths include... Replacing non-abrasive sponges with knit dishcloths. Add a little soap and use a knit dishcloth to wash lightly soiled dishes. Substituting knit dishcloths for paper towels. Instead of shelling out a ton of money every month for paper towels, knit a few dishcloths and use these for everyday cleaning tasks instead. Making a special set for bathroom use. You can also use cotton dishcloths to clean yourself! Just make sure to keep them separate from the dishcloths you use to clean your home."
        }
      ]
    },
    {
      "name":"Knitting a Seed Stitch Dishcloth",
      "steps":[
        {
          "headline":"Make a slipknot with medium-weight cotton yarn.",
          "description":"Loop the yarn around your index and middle finger twice and pull the first loop through the second loop. Slide the loop onto a US size 8 (5.5 mm) knitting needle. Then, tug on the tail to tighten the knot around the needle. This slipknot counts as your first cast on stitch."
        },
        {
          "headline":"Cast on 39 more stitches.",
          "description":"Hold the needle with the slipknot on it in your right hand and the empty needle in your left hand. Loop the working yarn over the end of the left-hand needle. Then, insert the right-hand needle into the loop. Bring the yarn over the end of the right-hand needle, and pull this yarn through to create a cast on stitch. Repeat this sequence to create 38 more cast on stitches for a total of 40."
        },
        {
          "headline":"Knit 1 stitch as usual.",
          "description":"Insert your empty right-hand needle into the first stitch on the left-hand needle. Then, yarn over the end of the right-hand needle and pull this loop through. Repeat this sequence each time you knit a stitch."
        },
        {
          "headline":"Purl 1 as usual.",
          "description":"Insert the right-hand needle into the next stitch going from the back to the front of your work. Then, yarn over the end of the right-hand needle and pull through to purl the stitch. Repeat this each time you want to purl a stitch."
        },
        {
          "headline":"Repeat to the end of the row and for all subsequent rows.",
          "description":"Continue to alternate between knitting 1 and purling 1 to the end of the first row. Then, turn your work around and repeat the sequence again. Work this stitch sequence for 40 rows or until you are happy with the size of the dishcloth."
        },
        {
          "headline":"Bind off the last row.",
          "description":"Knit the first 2 stitches of the last row as usual. Then, insert left-hand needle into the first stitch on the right-hand needle and lift the stitch up and over the second stitch. Knit 1 and then lift the first stitch up and over the new second stitch again. Repeat this sequence to the end of the row to bind off all of your stitches. Tie a knot through the last stitch and cut the excess yarn about 0.5 in (1.3 cm) from the last stitch. Give knit dishcloths as gifts! Add a couple of rolled up dishcloths to a gift basket. Fill the basket with other homemade goodies, such as a natural cleaning spray, some potpourri, or a candle. Secure a set of 4 dishcloths with a ribbon. Wrap the dishcloths or present them like this! Give single dishcloths to people as random gifts. Give a dishcloth to a coworker, friend, family member, or stranger to brighten their day!"
        }
      ]
    }
  ],
  "text":" Making a Quick and Bulky Dishcloth Make a slipknot with a strand of chunky or super bulky cotton yarn. Wrap the yarn around your index and middle finger 2 times. Then, pull the first loop through the second loop. Slide the loop onto a US size 11 (8 mm) knitting needle, and tug on the tail to tighten the knot around the needle. This counts as your first cast on stitch. If you don't have chunky or super bulky cotton yarn, use 2 strands from 2 balls of medium-weight cotton yarn held together instead.To choose yarn colors, try seasonal colors, such as orange for fall. Or, opt for colors that match your kitchen, such grey if you have a lot of grey in your kitchen. If you can't decide, create multi-color dishcloths, such as with rainbow colors. Cast on 19 more stitches. Hold the needle with the slipknot on it in your right hand. Then, make a loop with the working yarn and slip it onto the right hand needle. Tug the yarn to tighten the loop around the needle. Repeat this until you have cast on 19 stitches for a total of 20 including the slipknot. Casting on 20 stitches will create a dishcloth that is about 8 in (20 cm) wide. Knit 1 time into each cast on stitch in the row. Insert the right-hand needle into the first cast on stitch and then loop the yarn over the needle. Pull this yarn through the stitch and let the cast on stitch slip off of the left-hand needle. Repeat this sequence to knit all the way across the row. Turn your work and knit. When you get to the end of the first row, turn your work around so that the needle with all of the stitches on it is in your left hand. Then, knit into each stitch in the row again. Make sure to turn your work around after every row. Continue to knit for a total of 20 rows. For a dishcloth that is about 8 by 8 in (20 by 20 cm), knit for 20 rows. However, you can make the washcloth shorter or longer if desired. For example, if you want the dishcloth to be longer than it is wide, then you might knit for 30 rows instead of 20. Bind off the last row to finish the dishcloth. After you have completed the last row, bind off your stitches to secure the dishcloth. Knit the first 2 stitches in the row as you normally would, and then use the left-hand needle to lift the first stitch on the right-hand needle up and over the second stitch. Then, knit 1 and lift the first up and over the new second stitch. Repeat this to the end of the row to finish binding off. Tie a knot through the last stitch and cut the excess yarn about 0.5 in (1.3 cm) from the last stitch. Creating a Diagonal Pattern Dishcloth Make a slipknot with medium-weight cotton yarn. Use a pair of US size 8 (5.5 mm) knitting needles. Wrap the yarn around your middle and index finger 2 times, and pull the first loop through the second loop. Then, slip the loop onto your right-hand knitting needle. Tug the tail to tighten the slipknot around your needle. This counts as your first cast on stitch. Cast on 3 more stitches. Loop the yarn over the end of the left-hand needle. Then, insert the right-hand needle. Yarn over the end of the needle, and pull through. Repeat this sequence to create 2 more cast on stitches. You will have a total of 4 cast on stitches on your knitting needle when you are done. Knit 1 time into each stitch in the first row. Hold the needle with the cast on stitches on it in your left hand and the empty needle in your right hand. Insert the right-hand needle into the first cast on stitch. Loop the yarn over the end of the right-hand needle, and use the needle to pull this yarn through the cast on stitch. Let the cast on stitch slip off as the new stitch replaces it. Repeat this to the end of the row. Turn your work and knit 2. Switch the needle with the stitches on it back over to your left hand and hold the empty needle in your right hand. Knit the next 2 stitches as you normally would. Yarn over and knit to the end of the row. After you knit 2 stitches, loop the yarn over the needle to make an increase stitch. Then, knit the next 2 stitches to complete the row. At the end of the row, your total stitches will have increased by 1, so instead of 4 you will have 5 stitches. Repeat the sequence until there are 50 stitches on the needle. Continue to turn your work, knit 2, yarn over, and knit to the end of the row to expand the dishcloth. The last row will be the widest part of the dishcloth (from 1 corner to the other). Keep count of your stitches so you know when you reach 50 stitches. You can use a tally to keep track of your total number of stitches. Start with 4 tally marks and make a new 1 each time you increase. There are also many stitch counting apps available that you can try. Knit 1, knit 2 together, then knit to the end of the row. Knit the first stitch in the row as usual, and then knit the next 2 stitches together. Insert your right-hand needle into the next 2 stitches at once. Yarn over the end of the needle, and then pull through both stitches. Let the old stitches slip off the left-hand needle as the new stitch replaces them. Then, knit 1 as usual to the end of the row. At the end of the row, you will have 1 less stitch than the previous row, so 49 instead of 50. Repeat this stitch sequence until you only have 4 stitches left. Repeat the decrease stitch sequence for all of the rows after this 1. Stop knitting when your dishcloth is back down to 4 stitches. Make sure to turn your work around before you start a new row. Cast off the remaining 4 stitches. Knit 2 stitches as usual. Then, use the left-hand needle to lift the first stitch on the right-hand needle up and over the second stitch. Knit 1 and then lift the new first stitch up and over the new second stitch. Repeat this 1 more time to cast off your last stitch. Tie a knot through the last stitch and cut the excess yarn. Cut the working yarn about 6 in (15 cm) from the last stitch to free it from the skein. Then, insert the end of the yarn through the loop and use it to tie a knot. Cut the excess yarn 0.5 in (1.3 cm) from the last stitch to complete the dish cloth. Cut and tie off the tail at the beginning of the washcloth in the same way. Great ways to use knit dishcloths include... Replacing non-abrasive sponges with knit dishcloths. Add a little soap and use a knit dishcloth to wash lightly soiled dishes. Substituting knit dishcloths for paper towels. Instead of shelling out a ton of money every month for paper towels, knit a few dishcloths and use these for everyday cleaning tasks instead. Making a special set for bathroom use. You can also use cotton dishcloths to clean yourself! Just make sure to keep them separate from the dishcloths you use to clean your home. Knitting a Seed Stitch Dishcloth Make a slipknot with medium-weight cotton yarn. Loop the yarn around your index and middle finger twice and pull the first loop through the second loop. Slide the loop onto a US size 8 (5.5 mm) knitting needle. Then, tug on the tail to tighten the knot around the needle. This slipknot counts as your first cast on stitch. Cast on 39 more stitches. Hold the needle with the slipknot on it in your right hand and the empty needle in your left hand. Loop the working yarn over the end of the left-hand needle. Then, insert the right-hand needle into the loop. Bring the yarn over the end of the right-hand needle, and pull this yarn through to create a cast on stitch. Repeat this sequence to create 38 more cast on stitches for a total of 40. Knit 1 stitch as usual. Insert your empty right-hand needle into the first stitch on the left-hand needle. Then, yarn over the end of the right-hand needle and pull this loop through. Repeat this sequence each time you knit a stitch. Purl 1 as usual. Insert the right-hand needle into the next stitch going from the back to the front of your work. Then, yarn over the end of the right-hand needle and pull through to purl the stitch. Repeat this each time you want to purl a stitch. Repeat to the end of the row and for all subsequent rows. Continue to alternate between knitting 1 and purling 1 to the end of the first row. Then, turn your work around and repeat the sequence again. Work this stitch sequence for 40 rows or until you are happy with the size of the dishcloth. Bind off the last row. Knit the first 2 stitches of the last row as usual. Then, insert left-hand needle into the first stitch on the right-hand needle and lift the stitch up and over the second stitch. Knit 1 and then lift the first stitch up and over the new second stitch again. Repeat this sequence to the end of the row to bind off all of your stitches. Tie a knot through the last stitch and cut the excess yarn about 0.5 in (1.3 cm) from the last stitch. Give knit dishcloths as gifts! Add a couple of rolled up dishcloths to a gift basket. Fill the basket with other homemade goodies, such as a natural cleaning spray, some potpourri, or a candle. Secure a set of 4 dishcloths with a ribbon. Wrap the dishcloths or present them like this! Give single dishcloths to people as random gifts. Give a dishcloth to a coworker, friend, family member, or stranger to brighten their day!",
  "sentences":[
    " Making a Quick and Bulky Dishcloth Make a slipknot with a strand of chunky or super bulky cotton yarn.",
    "Wrap the yarn around your index and middle finger 2 times.",
    "Then, pull the first loop through the second loop.",
    "Slide the loop onto a US size 11 (8 mm) knitting needle, and tug on the tail to tighten the knot around the needle.",
    "This counts as your first cast on stitch.",
    "If you don't have chunky or super bulky cotton yarn, use 2 strands from 2 balls of medium-weight cotton yarn held together instead.To choose yarn colors, try seasonal colors, such as orange for fall.",
    "Or, opt for colors that match your kitchen, such grey if you have a lot of grey in your kitchen.",
    "If you can't decide, create multi-color dishcloths, such as with rainbow colors.",
    "Cast on 19 more stitches.",
    "Hold the needle with the slipknot on it in your right hand.",
    "Then, make a loop with the working yarn and slip it onto the right hand needle.",
    "Tug the yarn to tighten the loop around the needle.",
    "Repeat this until you have cast on 19 stitches for a total of 20 including the slipknot.",
    "Casting on 20 stitches will create a dishcloth that is about 8 in (20 cm) wide.",
    "Knit 1 time into each cast on stitch in the row.",
    "Insert the right-hand needle into the first cast on stitch and then loop the yarn over the needle.",
    "Pull this yarn through the stitch and let the cast on stitch slip off of the left-hand needle.",
    "Repeat this sequence to knit all the way across the row.",
    "Turn your work and knit.",
    "When you get to the end of the first row, turn your work around so that the needle with all of the stitches on it is in your left hand.",
    "Then, knit into each stitch in the row again.",
    "Make sure to turn your work around after every row.",
    "Continue to knit for a total of 20 rows.",
    "For a dishcloth that is about 8 by 8 in (20 by 20 cm), knit for 20 rows.",
    "However, you can make the washcloth shorter or longer if desired.",
    "For example, if you want the dishcloth to be longer than it is wide, then you might knit for 30 rows instead of 20.",
    "Bind off the last row to finish the dishcloth.",
    "After you have completed the last row, bind off your stitches to secure the dishcloth.",
    "Knit the first 2 stitches in the row as you normally would, and then use the left-hand needle to lift the first stitch on the right-hand needle up and over the second stitch.",
    "Then, knit 1 and lift the first up and over the new second stitch.",
    "Repeat this to the end of the row to finish binding off.",
    "Tie a knot through the last stitch and cut the excess yarn about 0.5 in (1.3 cm) from the last stitch.",
    "Creating a Diagonal Pattern Dishcloth Make a slipknot with medium-weight cotton yarn.",
    "Use a pair of US size 8 (5.5 mm) knitting needles.",
    "Wrap the yarn around your middle and index finger 2 times, and pull the first loop through the second loop.",
    "Then, slip the loop onto your right-hand knitting needle.",
    "Tug the tail to tighten the slipknot around your needle.",
    "This counts as your first cast on stitch.",
    "Cast on 3 more stitches.",
    "Loop the yarn over the end of the left-hand needle.",
    "Then, insert the right-hand needle.",
    "Yarn over the end of the needle, and pull through.",
    "Repeat this sequence to create 2 more cast on stitches.",
    "You will have a total of 4 cast on stitches on your knitting needle when you are done.",
    "Knit 1 time into each stitch in the first row.",
    "Hold the needle with the cast on stitches on it in your left hand and the empty needle in your right hand.",
    "Insert the right-hand needle into the first cast on stitch.",
    "Loop the yarn over the end of the right-hand needle, and use the needle to pull this yarn through the cast on stitch.",
    "Let the cast on stitch slip off as the new stitch replaces it.",
    "Repeat this to the end of the row.",
    "Turn your work and knit 2.",
    "Switch the needle with the stitches on it back over to your left hand and hold the empty needle in your right hand.",
    "Knit the next 2 stitches as you normally would.",
    "Yarn over and knit to the end of the row.",
    "After you knit 2 stitches, loop the yarn over the needle to make an increase stitch.",
    "Then, knit the next 2 stitches to complete the row.",
    "At the end of the row, your total stitches will have increased by 1, so instead of 4 you will have 5 stitches.",
    "Repeat the sequence until there are 50 stitches on the needle.",
    "Continue to turn your work, knit 2, yarn over, and knit to the end of the row to expand the dishcloth.",
    "The last row will be the widest part of the dishcloth (from 1 corner to the other).",
    "Keep count of your stitches so you know when you reach 50 stitches.",
    "You can use a tally to keep track of your total number of stitches.",
    "Start with 4 tally marks and make a new 1 each time you increase.",
    "There are also many stitch counting apps available that you can try.",
    "Knit 1, knit 2 together, then knit to the end of the row.",
    "Knit the first stitch in the row as usual, and then knit the next 2 stitches together.",
    "Insert your right-hand needle into the next 2 stitches at once.",
    "Yarn over the end of the needle, and then pull through both stitches.",
    "Let the old stitches slip off the left-hand needle as the new stitch replaces them.",
    "Then, knit 1 as usual to the end of the row.",
    "At the end of the row, you will have 1 less stitch than the previous row, so 49 instead of 50.",
    "Repeat this stitch sequence until you only have 4 stitches left.",
    "Repeat the decrease stitch sequence for all of the rows after this 1.",
    "Stop knitting when your dishcloth is back down to 4 stitches.",
    "Make sure to turn your work around before you start a new row.",
    "Cast off the remaining 4 stitches.",
    "Knit 2 stitches as usual.",
    "Then, use the left-hand needle to lift the first stitch on the right-hand needle up and over the second stitch.",
    "Knit 1 and then lift the new first stitch up and over the new second stitch.",
    "Repeat this 1 more time to cast off your last stitch.",
    "Tie a knot through the last stitch and cut the excess yarn.",
    "Cut the working yarn about 6 in (15 cm) from the last stitch to free it from the skein.",
    "Then, insert the end of the yarn through the loop and use it to tie a knot.",
    "Cut the excess yarn 0.5 in (1.3 cm) from the last stitch to complete the dish cloth.",
    "Cut and tie off the tail at the beginning of the washcloth in the same way.",
    "Great ways to use knit dishcloths include...",
    "Replacing non-abrasive sponges with knit dishcloths.",
    "Add a little soap and use a knit dishcloth to wash lightly soiled dishes.",
    "Substituting knit dishcloths for paper towels.",
    "Instead of shelling out a ton of money every month for paper towels, knit a few dishcloths and use these for everyday cleaning tasks instead.",
    "Making a special set for bathroom use.",
    "You can also use cotton dishcloths to clean yourself!",
    "Just make sure to keep them separate from the dishcloths you use to clean your home.",
    "Knitting a Seed Stitch Dishcloth Make a slipknot with medium-weight cotton yarn.",
    "Loop the yarn around your index and middle finger twice and pull the first loop through the second loop.",
    "Slide the loop onto a US size 8 (5.5 mm) knitting needle.",
    "Then, tug on the tail to tighten the knot around the needle.",
    "This slipknot counts as your first cast on stitch.",
    "Cast on 39 more stitches.",
    "Hold the needle with the slipknot on it in your right hand and the empty needle in your left hand.",
    "Loop the working yarn over the end of the left-hand needle.",
    "Then, insert the right-hand needle into the loop.",
    "Bring the yarn over the end of the right-hand needle, and pull this yarn through to create a cast on stitch.",
    "Repeat this sequence to create 38 more cast on stitches for a total of 40.",
    "Knit 1 stitch as usual.",
    "Insert your empty right-hand needle into the first stitch on the left-hand needle.",
    "Then, yarn over the end of the right-hand needle and pull this loop through.",
    "Repeat this sequence each time you knit a stitch.",
    "Purl 1 as usual.",
    "Insert the right-hand needle into the next stitch going from the back to the front of your work.",
    "Then, yarn over the end of the right-hand needle and pull through to purl the stitch.",
    "Repeat this each time you want to purl a stitch.",
    "Repeat to the end of the row and for all subsequent rows.",
    "Continue to alternate between knitting 1 and purling 1 to the end of the first row.",
    "Then, turn your work around and repeat the sequence again.",
    "Work this stitch sequence for 40 rows or until you are happy with the size of the dishcloth.",
    "Bind off the last row.",
    "Knit the first 2 stitches of the last row as usual.",
    "Then, insert left-hand needle into the first stitch on the right-hand needle and lift the stitch up and over the second stitch.",
    "Knit 1 and then lift the first stitch up and over the new second stitch again.",
    "Repeat this sequence to the end of the row to bind off all of your stitches.",
    "Tie a knot through the last stitch and cut the excess yarn about 0.5 in (1.3 cm) from the last stitch.",
    "Give knit dishcloths as gifts!",
    "Add a couple of rolled up dishcloths to a gift basket.",
    "Fill the basket with other homemade goodies, such as a natural cleaning spray, some potpourri, or a candle.",
    "Secure a set of 4 dishcloths with a ribbon.",
    "Wrap the dishcloths or present them like this!",
    "Give single dishcloths to people as random gifts.",
    "Give a dishcloth to a coworker, friend, family member, or stranger to brighten their day!"
  ],
  "tyn_section":[
    "Chunky or super bulky cotton yarn",
    "1 pair of US size 11 (8 mm) knitting needles",
    "Scissors",
    "Medium-weight cotton yarn",
    "1 pair of US size 8 (5.5 mm) knitting needles"
  ],
  "tyn_model":[
    "yarn",
    "dishcloth",
    "dishcloths",
    "washcloth",
    "knitting needle",
    "dish cloth",
    "sponges",
    "paper towels",
    "towels",
    "slipknot",
    "natural cleaning spray",
    "potpourri",
    "candle",
    "ribbon"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.2,
    "p":0.0714285714,
    "f1":0.1052631579
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}