{
  "title":"How to Make Hillbilly Gravy for Biscuits",
  "url":"https://www.wikihow.com/Make-Hillbilly-Gravy-for-Biscuits",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Gravies"
  ],
  "steps":[
    {
      "headline":"In a large frying pan cook a pound of bacon over medium heat.",
      "description":"When the bacon is done remove from the pan, drain on a rack and save for later."
    },
    {
      "headline":"Still over medium heat,  Add 2 heaping tablespoons of all purpose flour.",
      "description":"Fry the flour in the bacon grease until it turns golden brown. If you don't fry the flour enough the gravy will taste like wallpaper paste. However try not to burn it. Variation: You may use cornmeal, flour, and extra pepper."
    },
    {
      "headline":"Slowly whisk in the whole milk, incorporating a few ounces at a time.",
      "description":"If you add the milk too quickly the gravy will not thicken properly and you will get little clumps of fried flour in some funky milk concoction which is not very appetizing. Another option is to add water (instead of milk) to the flour once it's browned. Cook to a little thicker than you want it. Remove from heat and then add evaporated milk."
    },
    {
      "headline":"Add salt and black pepper to taste.",
      "description":"(I don't add the salt until the gravy is finished cooking because it tends to cause the gravy to \"curdle\".)"
    },
    {
      "headline":"Simmer the gravy until it begins to thicken and then remove from the heat.",
      "description":""
    },
    {
      "headline":"Let the gravy stand for a few minutes of cooling.",
      "description":""
    },
    {
      "headline":"Pour over your biscuits, eggs, and bacon for a tasty breakfast.",
      "description":""
    }
  ],
  "text":" In a large frying pan cook a pound of bacon over medium heat. When the bacon is done remove from the pan, drain on a rack and save for later. Still over medium heat,  Add 2 heaping tablespoons of all purpose flour. Fry the flour in the bacon grease until it turns golden brown. If you don't fry the flour enough the gravy will taste like wallpaper paste. However try not to burn it. Variation: You may use cornmeal, flour, and extra pepper. Slowly whisk in the whole milk, incorporating a few ounces at a time. If you add the milk too quickly the gravy will not thicken properly and you will get little clumps of fried flour in some funky milk concoction which is not very appetizing. Another option is to add water (instead of milk) to the flour once it's browned. Cook to a little thicker than you want it. Remove from heat and then add evaporated milk. Add salt and black pepper to taste. (I don't add the salt until the gravy is finished cooking because it tends to cause the gravy to \"curdle\".) Simmer the gravy until it begins to thicken and then remove from the heat.  Let the gravy stand for a few minutes of cooling.  Pour over your biscuits, eggs, and bacon for a tasty breakfast. ",
  "sentences":[
    " In a large frying pan cook a pound of bacon over medium heat.",
    "When the bacon is done remove from the pan, drain on a rack and save for later.",
    "Still over medium heat,  Add 2 heaping tablespoons of all purpose flour.",
    "Fry the flour in the bacon grease until it turns golden brown.",
    "If you don't fry the flour enough the gravy will taste like wallpaper paste.",
    "However try not to burn it.",
    "Variation: You may use cornmeal, flour, and extra pepper.",
    "Slowly whisk in the whole milk, incorporating a few ounces at a time.",
    "If you add the milk too quickly the gravy will not thicken properly and you will get little clumps of fried flour in some funky milk concoction which is not very appetizing.",
    "Another option is to add water (instead of milk) to the flour once it's browned.",
    "Cook to a little thicker than you want it.",
    "Remove from heat and then add evaporated milk.",
    "Add salt and black pepper to taste.",
    "(I don't add the salt until the gravy is finished cooking because it tends to cause the gravy to \"curdle\".)",
    "Simmer the gravy until it begins to thicken and then remove from the heat.",
    "Let the gravy stand for a few minutes of cooling.",
    "Pour over your biscuits, eggs, and bacon for a tasty breakfast."
  ],
  "tyn_section":[
    "1 pound of fresh bacon (Not precooked)",
    "A Large frying pan",
    "2 heaping tablespoons of flour",
    "2-3 cups of whole milk (low-fat optional)",
    "Salt",
    "Black pepper"
  ],
  "tyn_model":[
    "milk",
    "flour",
    "bacon",
    "salt",
    "large frying pan",
    "all purpose flour",
    "bacon grease",
    "pepper",
    "water",
    "black pepper",
    "biscuits",
    "eggs"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.1666666667,
    "f1":0.2222222222,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.3333333333,
    "f1":0.4
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.3333333333,
    "f1":0.4
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333
  }
}