{
  "title":"How to Clean and Prepare a Squid to Make Calamari",
  "url":"https://www.wikihow.com/Clean-and-Prepare-a-Squid-to-Make-Calamari",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "steps":[
    {
      "headline":"Lay squid on a sheet of newspaper.",
      "description":"You will see the head, where the eyes and tentacles are, is distinctly separate from the body, or  mantle."
    },
    {
      "headline":"Put on rubber or latex gloves.",
      "description":"These are not necessary for safely handling squid, but will keep squid residue from getting on your hands and imparting a \"fishy\" smell."
    },
    {
      "headline":"Grasp  the squid's head right behind the eyes where it joins the mantle.",
      "description":"Pull gently and steadily forward, keeping a firm grasp on the head. The internal organs should slide out."
    },
    {
      "headline":"Reach into the mantle, which now resembles an empty sack.",
      "description":"Feel for a hard, fingernail like sheathing; grab this and pull it out."
    },
    {
      "headline":"Gently scrape the outer surface of the mantle with a sharp knife.",
      "description":"The speckles on the squid should peel off in a cellophane-like sheet, leaving behind slick white meat."
    },
    {
      "headline":"Cut the mantle into rings by slicing vertical to the line of the squid's back.",
      "description":"Set aside."
    },
    {
      "headline":"Fold the newspaper around the unwanted squid parts, and dispose.",
      "description":""
    }
  ],
  "text":" Lay squid on a sheet of newspaper. You will see the head, where the eyes and tentacles are, is distinctly separate from the body, or  mantle. Put on rubber or latex gloves. These are not necessary for safely handling squid, but will keep squid residue from getting on your hands and imparting a \"fishy\" smell. Grasp  the squid's head right behind the eyes where it joins the mantle. Pull gently and steadily forward, keeping a firm grasp on the head. The internal organs should slide out. Reach into the mantle, which now resembles an empty sack. Feel for a hard, fingernail like sheathing; grab this and pull it out. Gently scrape the outer surface of the mantle with a sharp knife. The speckles on the squid should peel off in a cellophane-like sheet, leaving behind slick white meat. Cut the mantle into rings by slicing vertical to the line of the squid's back. Set aside. Fold the newspaper around the unwanted squid parts, and dispose. ",
  "sentences":[
    " Lay squid on a sheet of newspaper.",
    "You will see the head, where the eyes and tentacles are, is distinctly separate from the body, or  mantle.",
    "Put on rubber or latex gloves.",
    "These are not necessary for safely handling squid, but will keep squid residue from getting on your hands and imparting a \"fishy\" smell.",
    "Grasp  the squid's head right behind the eyes where it joins the mantle.",
    "Pull gently and steadily forward, keeping a firm grasp on the head.",
    "The internal organs should slide out.",
    "Reach into the mantle, which now resembles an empty sack.",
    "Feel for a hard, fingernail like sheathing; grab this and pull it out.",
    "Gently scrape the outer surface of the mantle with a sharp knife.",
    "The speckles on the squid should peel off in a cellophane-like sheet, leaving behind slick white meat.",
    "Cut the mantle into rings by slicing vertical to the line of the squid's back.",
    "Set aside.",
    "Fold the newspaper around the unwanted squid parts, and dispose."
  ],
  "tyn_section":[
    "Squid",
    "Sharp knife",
    "Rubber Gloves",
    "Newspaper",
    "A plate or Tupperware container"
  ],
  "tyn_model":[
    "squid",
    "newspaper",
    "knife",
    "cellophane"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.5,
    "f1":0.4444444444,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.75,
    "f1":0.6666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.75,
    "f1":0.6666666667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.5,
    "f1":0.4444444444
  }
}