{
  "title":"How to Bake a Cherry Pie",
  "url":"https://www.wikihow.com/Bake-a-Cherry-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Stone Fruit"
  ],
  "methods":[
    {
      "name":"Regular Cherry Pie",
      "steps":[
        {
          "headline":"Preheat oven to 400 °F (204 °C).",
          "description":""
        },
        {
          "headline":"Prepare double pie crust for an 8-inch pie.",
          "description":""
        },
        {
          "headline":"Mix together cherries, sugar, cornstarch, almond extract and red food coloring.",
          "description":""
        },
        {
          "headline":"Pour into the prepared pie crust.",
          "description":""
        },
        {
          "headline":"Dot with butter or margarine.",
          "description":""
        },
        {
          "headline":"Top with pie crust.",
          "description":""
        },
        {
          "headline":"Crimp and seal.",
          "description":""
        },
        {
          "headline":"Cut slits in top of pie crust.",
          "description":""
        },
        {
          "headline":"Bake for 40 to 60 minutes or until light brown.",
          "description":"The pie filling will be bubbling through the slits when the pie is done baking."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    },
    {
      "name":"Cream Cheese Cherry Pie",
      "steps":[
        {
          "headline":"Place cream cheese in a bowl.",
          "description":"Beat using a hand blender or whisk until mashed and fluffy."
        },
        {
          "headline":"Slowly pour condensed milk in cream cheese and blend again.",
          "description":"Keep on blending until mixture starts feeling a littler watery. Finally, stir in the lemon juice and vanilla extract. Continue blending."
        },
        {
          "headline":"Set graham cracker crust on cooking space.",
          "description":"Add cream cheese mixture into crust and spread mixture evenly out with a rubber spatula. Have it refrigerate until it starts to set; most likely about about 2-4 hours."
        },
        {
          "headline":"Remove from fridge.",
          "description":"Add cherry filling on top and spread around with rubber spatula. Cut using a bread knife and serve with any desired toppings."
        }
      ]
    },
    {
      "name":"Washington Cherry Pie",
      "steps":[
        {
          "headline":"Preheat your oven to 425 degrees F or 220 degrees C.",
          "description":""
        },
        {
          "headline":"Set pie crust on cooking area.",
          "description":"Add pieces of butter in pie crust."
        },
        {
          "headline":"In a separate bowl, stir all ingredients up and mix with a metal spoon.",
          "description":"Have it stand for about ten to fifteen minutes."
        },
        {
          "headline":"Pour cherry filling in pie crust and spread evenly with a rubber spatula.",
          "description":"Place pastry dough on top of pie and cut any extra pieces to have the pastry fit on top."
        },
        {
          "headline":"Bake pie in oven for about 35 to 40 minutes, or until crust browns and top turns golden.",
          "description":"Serve with whipped or vanilla ice cream."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Regular Cherry Pie Preheat oven to 400 °F (204 °C).  Prepare double pie crust for an 8-inch pie.  Mix together cherries, sugar, cornstarch, almond extract and red food coloring.  Pour into the prepared pie crust.  Dot with butter or margarine.  Top with pie crust.  Crimp and seal.  Cut slits in top of pie crust.  Bake for 40 to 60 minutes or until light brown. The pie filling will be bubbling through the slits when the pie is done baking. Finished.  Cream Cheese Cherry Pie Place cream cheese in a bowl. Beat using a hand blender or whisk until mashed and fluffy. Slowly pour condensed milk in cream cheese and blend again. Keep on blending until mixture starts feeling a littler watery. Finally, stir in the lemon juice and vanilla extract. Continue blending. Set graham cracker crust on cooking space. Add cream cheese mixture into crust and spread mixture evenly out with a rubber spatula. Have it refrigerate until it starts to set; most likely about about 2-4 hours. Remove from fridge. Add cherry filling on top and spread around with rubber spatula. Cut using a bread knife and serve with any desired toppings. Washington Cherry Pie Preheat your oven to 425 degrees F or 220 degrees C.  Set pie crust on cooking area. Add pieces of butter in pie crust. In a separate bowl, stir all ingredients up and mix with a metal spoon. Have it stand for about ten to fifteen minutes. Pour cherry filling in pie crust and spread evenly with a rubber spatula. Place pastry dough on top of pie and cut any extra pieces to have the pastry fit on top. Bake pie in oven for about 35 to 40 minutes, or until crust browns and top turns golden. Serve with whipped or vanilla ice cream. Finished. ",
  "sentences":[
    " Regular Cherry Pie Preheat oven to 400 °F (204 °C).",
    "Prepare double pie crust for an 8-inch pie.",
    "Mix together cherries, sugar, cornstarch, almond extract and red food coloring.",
    "Pour into the prepared pie crust.",
    "Dot with butter or margarine.",
    "Top with pie crust.",
    "Crimp and seal.",
    "Cut slits in top of pie crust.",
    "Bake for 40 to 60 minutes or until light brown.",
    "The pie filling will be bubbling through the slits when the pie is done baking.",
    "Finished.",
    "Cream Cheese Cherry Pie Place cream cheese in a bowl.",
    "Beat using a hand blender or whisk until mashed and fluffy.",
    "Slowly pour condensed milk in cream cheese and blend again.",
    "Keep on blending until mixture starts feeling a littler watery.",
    "Finally, stir in the lemon juice and vanilla extract.",
    "Continue blending.",
    "Set graham cracker crust on cooking space.",
    "Add cream cheese mixture into crust and spread mixture evenly out with a rubber spatula.",
    "Have it refrigerate until it starts to set; most likely about about 2-4 hours.",
    "Remove from fridge.",
    "Add cherry filling on top and spread around with rubber spatula.",
    "Cut using a bread knife and serve with any desired toppings.",
    "Washington Cherry Pie Preheat your oven to 425 degrees F or 220 degrees C.  Set pie crust on cooking area.",
    "Add pieces of butter in pie crust.",
    "In a separate bowl, stir all ingredients up and mix with a metal spoon.",
    "Have it stand for about ten to fifteen minutes.",
    "Pour cherry filling in pie crust and spread evenly with a rubber spatula.",
    "Place pastry dough on top of pie and cut any extra pieces to have the pastry fit on top.",
    "Bake pie in oven for about 35 to 40 minutes, or until crust browns and top turns golden.",
    "Serve with whipped or vanilla ice cream.",
    "Finished."
  ],
  "tyn_section":[
    "Mixing bowls",
    "Measuring cups and spoons",
    "8-inch pie plate",
    "Mixing spoon"
  ],
  "tyn_model":[
    "pie crust",
    "cream cheese",
    "oven",
    "rubber spatula",
    "butter",
    "cherries",
    "sugar",
    "cornstarch",
    "almond extract",
    "red food coloring",
    "margarine",
    "bowl",
    "hand blender",
    "whisk",
    "condensed milk",
    "lemon juice",
    "vanilla extract",
    "graham cracker",
    "bread knife",
    "metal spoon",
    "cherry filling",
    "pastry dough",
    "whipped or vanilla ice cream"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.0434782609,
    "f1":0.0740740741
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}