{
  "title":"How to Install a Residential Telephone Jack",
  "url":"https://www.wikihow.com/Install-a-Residential-Telephone-Jack",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Electrical Maintenance"
  ],
  "parts":[
    {
      "name":"Install a New Jack in a Different Part of the Room",
      "steps":[
        {
          "headline":"Choose a spot for the new phone jack.",
          "description":"Keep in mind that you’ll be running phone wires from the old phone jack to the new spot you choose. Assess your room and think about the best path for the phone wires. If you need a new phone jack on the opposite side of the room from your existing jack, will it be possible to run the wires along your baseboards? You’ll want to keep your wires neat, so have a plan in mind when you make your choice. If you want to install a new wall mounted phone, it’s best to choose a spot a few feet above your existing phone jack. This way, you won’t have to run unsightly wires across your room."
        },
        {
          "headline":"Figure out how much new wire you need.",
          "description":"Measure the distance from the old jack to the spot where the new one will be installed. Include the entire path that the telephone wire will travel: the distance from the old jack to the baseboard, around the perimeter of the room, and from the baseboard to the new jack’s location. Go to the hardware store and purchase the amount of wire you will need. If your new jack is going to be located several feet from the old one, you should also buy fasteners that are made for keeping the wire in place along walls and baseboards."
        },
        {
          "headline":"Choose a new jack.",
          "description":"Baseboard jacks or wall jacks that house the phone wires in a small box, rather than inside the wall, are the easiest phone jacks to install when you’re looking for a jack for a new location. These types of jacks are simply affixed to your baseboard or wall, with minimal drilling required."
        },
        {
          "headline":"Affix the new jack to the spot you have chosen.",
          "description":"After you’ve gone outside to your NID and disconnected your phone line in preparation for your task, it’s time to begin the installation of your new jack. Some jacks come with adhesive backing and simple mounting instructions. Others may need to be screwed into the wall. Depending on the type of wall you have, this may be accomplished either with a screwdriver and a bit of muscle or with a small drill. Ensure that your jack is not installed at a crooked angle by using a level to help you line up the jack with your floor or baseboard. Make small pencil marks in the places where you’ll be screwing or drilling holes."
        },
        {
          "headline":"Attach telephone wire to the old jack.",
          "description":"Open the casing, or unscrew the plating, on the old jack. Loosen the screws that secure the red, green, yellow and black telephone wires. As necessary, trim damage from the old wires and strip the insulation from the tips. Strip the insulation from the tips of the new wires, too. Twist the tips of the new wires with the tips of the old wires according to color: red to red, green to green, yellow to yellow, and black to black. Replace the twisted portions of the wires under the screws in the jack, and tighten the screws. Thread the new wire through the hole in the phone jack casing, and screw the casing back to the wall. If the hole in the phone jack casing is too small, or if it’s difficult to thread the wires through, it may be necessary to drill or cut a larger hole for this step."
        },
        {
          "headline":"Run the wire from the old jack to the new jack.",
          "description":"Using the path you mapped out in your original plan, run the new wire to the new jack. If you are running the wire along baseboards or up walls, use the fasteners you bought at the hardware store to secure it neatly in place."
        },
        {
          "headline":"Attach telephone wire to the new jack.",
          "description":"After you’ve run the wire from the old jack to the new jack, trim the excess wire so that you have a manageable coil. Strip the insulation from the tips of the four wires. Loosen the screws on the back of the new jack, and affix the red, green, yellow, and black wires in their correct color-coded places. Tighten the screws."
        },
        {
          "headline":"Finish installing the new jack.",
          "description":"If you’re using an external jack, there will be space inside the jack to coil the remaining wire. Place the cover on the jack and screw it on."
        },
        {
          "headline":"Reconnect the phone line and test your work.",
          "description":"Return to the NID box and reconnect your phone line. Go back inside and test it by plugging in your phone or DSL cable. If you have a dial tone and your internet works, your task is complete."
        }
      ]
    },
    {
      "name":"Prepare for the Installation",
      "steps":[
        {
          "headline":"Choose a new jack.",
          "description":"Most phone jacks cost about $3.00 to $5.00 and are available at hardware stores. Find a jack that best fits your needs, whether it’s a simple flush plate, a wall mount jack, or a baseboard jack. Jacks come in several different shapes and colors, and you’ll probably want to choose one that blends in well with your room’s décor. If you’re replacing an old jack that needs repairing, the simplest choice is a new jack with the same size and shape as the old one. For example, if your old jack is a standard rectangular wall plate, it will be easiest to install a new jack that looks very similar. This way you won’t have to drill a new hole in your wall to accommodate a new jack size. If you plan to attach your telephone to the wall, make sure you buy a wall mount jack, rather than a flush jack. A wall mount jack juts out from the wall, providing a structure on which to mount your telephone. A flush jack lies flat against the wall, allowing you to plug in your phone, but not mount it. Baseboard jacks are small plastic or metal boxes that are affixed to your baseboard, with the jack opening on the bottom edge of the box. If you’re concerned about aesthetics, this may be a more discreet option than a wall plate. If you’re planning on using the jack for both a DSL internet connection and a phone line, choose a jack with two openings, often called a duplex jack, so that you can run two separate lines."
        },
        {
          "headline":"Find your home’s Network Interface Device (NID) and disconnect your phone line.",
          "description":"The NID is a device installed by the phone company that  connects your home’s electrical wiring to your telephone network. It’s a gray box that is usually mounted on the outside of your house. When you’re ready to install your new jack, it’s important to disconnect your phone line so you aren’t working with a live wire. The electrical current that runs through phone lines is not strong, but it could still give you a small shock if you aren’t careful. The NID has two sides: one for the phone company, and one for customers. Open the side that’s intended for customers (the phone company’s side is usually locked) and unplug the test jack. Now your phone line is disconnected from the outside network. If you’re working with an older interface box without a test jack, disconnect your phone line by detaching the wires, making sure to remember which wire goes where so you’ll be able to reattach them when your job is complete."
        }
      ]
    },
    {
      "name":"Replace an Old Jack With a New One",
      "steps":[
        {
          "headline":"Remove the old jack from the wall.",
          "description":"Use a screwdriver to unscrew the old jack, whether it’s a wall mount or a flush jack. Carefully pull the casing away from the wall, and you will find that the jack is attached to your home’s wiring with wires of four different colors: red, green, yellow, and black. Each wire is secured behind a screw. Use a screwdriver to loosen the screws, unsecure the four wires from behind them, and pull the old jack from the wall. If your jack is the type that is a rectangular box attached to a plate on the wall with notches, use a flathead screwdriver to pop off the top part of the case, and proceed to loosen the screws and remove the wires. Unscrew the plating and remove this from the wall as well."
        },
        {
          "headline":"Prepare the wires for your new jack.",
          "description":"If you’re replacing a jack that has been around for a long time, the four wires might need to be trimmed and stripped before you attach them to the new jack. If the exposed parts of the wires look old or brittle, use a wire cutter to trim off the damaged portions, no more than about ½” to ¾” (1.25 to 2 cm). Now use the wire cutter or a utility knife to gently strip the insulation from the tips of the wires so they may be connected to the new jack."
        },
        {
          "headline":"Attach the telephone wires to the new jack.",
          "description":"Turn the new jack over and loosen the four screws on the back. Connect each wire to the correct section of the jack, marked by color; there will be a spot for the red, green, yellow, and black wires. Secure the wires by tightening each screw."
        },
        {
          "headline":"Mount the jack.",
          "description":"Push the wires into the wall and position the jack over the hole. Line the jack’s screw holes with the holes made by the old jack. Place the new screws in the screw holes and use a screwdriver to secure the new jack to the wall. Depending on the type of jack you have, you may have a cover case that should be secured onto the wall piece to complete the process. Some types of jacks come with adhesive backing in addition to screws. You may use this to secure the jack to the wall, but it isn’t strictly necessary."
        },
        {
          "headline":"Reconnect the phone line.",
          "description":"Return to the NID on the outside of your house. Open the box and plug the test jack back in. If your NID doesn’t have a test plug, reconnect the wires you previously disconnected, making sure to screw them in securely."
        },
        {
          "headline":"Test your line.",
          "description":"Plug your telephone or DSL cable into your newly installed jack. Your phone should have a dial tone, and your internet connection should work now (as long as your computer is correctly set up for a DSL connection. If the phone line does not seem to be working, you may need to unscrew the new jack and make sure the wires are connected to the proper places and correctly screwed in. If further electrical work is required, make sure to go back to the NID and disconnect the phone line again before manipulating the wires."
        }
      ]
    }
  ],
  "text":" Install a New Jack in a Different Part of the Room Choose a spot for the new phone jack. Keep in mind that you’ll be running phone wires from the old phone jack to the new spot you choose. Assess your room and think about the best path for the phone wires. If you need a new phone jack on the opposite side of the room from your existing jack, will it be possible to run the wires along your baseboards? You’ll want to keep your wires neat, so have a plan in mind when you make your choice. If you want to install a new wall mounted phone, it’s best to choose a spot a few feet above your existing phone jack. This way, you won’t have to run unsightly wires across your room. Figure out how much new wire you need. Measure the distance from the old jack to the spot where the new one will be installed. Include the entire path that the telephone wire will travel: the distance from the old jack to the baseboard, around the perimeter of the room, and from the baseboard to the new jack’s location. Go to the hardware store and purchase the amount of wire you will need. If your new jack is going to be located several feet from the old one, you should also buy fasteners that are made for keeping the wire in place along walls and baseboards. Choose a new jack. Baseboard jacks or wall jacks that house the phone wires in a small box, rather than inside the wall, are the easiest phone jacks to install when you’re looking for a jack for a new location. These types of jacks are simply affixed to your baseboard or wall, with minimal drilling required. Affix the new jack to the spot you have chosen. After you’ve gone outside to your NID and disconnected your phone line in preparation for your task, it’s time to begin the installation of your new jack. Some jacks come with adhesive backing and simple mounting instructions. Others may need to be screwed into the wall. Depending on the type of wall you have, this may be accomplished either with a screwdriver and a bit of muscle or with a small drill. Ensure that your jack is not installed at a crooked angle by using a level to help you line up the jack with your floor or baseboard. Make small pencil marks in the places where you’ll be screwing or drilling holes. Attach telephone wire to the old jack. Open the casing, or unscrew the plating, on the old jack. Loosen the screws that secure the red, green, yellow and black telephone wires. As necessary, trim damage from the old wires and strip the insulation from the tips. Strip the insulation from the tips of the new wires, too. Twist the tips of the new wires with the tips of the old wires according to color: red to red, green to green, yellow to yellow, and black to black. Replace the twisted portions of the wires under the screws in the jack, and tighten the screws. Thread the new wire through the hole in the phone jack casing, and screw the casing back to the wall. If the hole in the phone jack casing is too small, or if it’s difficult to thread the wires through, it may be necessary to drill or cut a larger hole for this step. Run the wire from the old jack to the new jack. Using the path you mapped out in your original plan, run the new wire to the new jack. If you are running the wire along baseboards or up walls, use the fasteners you bought at the hardware store to secure it neatly in place. Attach telephone wire to the new jack. After you’ve run the wire from the old jack to the new jack, trim the excess wire so that you have a manageable coil. Strip the insulation from the tips of the four wires. Loosen the screws on the back of the new jack, and affix the red, green, yellow, and black wires in their correct color-coded places. Tighten the screws. Finish installing the new jack. If you’re using an external jack, there will be space inside the jack to coil the remaining wire. Place the cover on the jack and screw it on. Reconnect the phone line and test your work. Return to the NID box and reconnect your phone line. Go back inside and test it by plugging in your phone or DSL cable. If you have a dial tone and your internet works, your task is complete. Prepare for the Installation Choose a new jack. Most phone jacks cost about $3.00 to $5.00 and are available at hardware stores. Find a jack that best fits your needs, whether it’s a simple flush plate, a wall mount jack, or a baseboard jack. Jacks come in several different shapes and colors, and you’ll probably want to choose one that blends in well with your room’s décor. If you’re replacing an old jack that needs repairing, the simplest choice is a new jack with the same size and shape as the old one. For example, if your old jack is a standard rectangular wall plate, it will be easiest to install a new jack that looks very similar. This way you won’t have to drill a new hole in your wall to accommodate a new jack size. If you plan to attach your telephone to the wall, make sure you buy a wall mount jack, rather than a flush jack. A wall mount jack juts out from the wall, providing a structure on which to mount your telephone. A flush jack lies flat against the wall, allowing you to plug in your phone, but not mount it. Baseboard jacks are small plastic or metal boxes that are affixed to your baseboard, with the jack opening on the bottom edge of the box. If you’re concerned about aesthetics, this may be a more discreet option than a wall plate. If you’re planning on using the jack for both a DSL internet connection and a phone line, choose a jack with two openings, often called a duplex jack, so that you can run two separate lines. Find your home’s Network Interface Device (NID) and disconnect your phone line. The NID is a device installed by the phone company that  connects your home’s electrical wiring to your telephone network. It’s a gray box that is usually mounted on the outside of your house. When you’re ready to install your new jack, it’s important to disconnect your phone line so you aren’t working with a live wire. The electrical current that runs through phone lines is not strong, but it could still give you a small shock if you aren’t careful. The NID has two sides: one for the phone company, and one for customers. Open the side that’s intended for customers (the phone company’s side is usually locked) and unplug the test jack. Now your phone line is disconnected from the outside network. If you’re working with an older interface box without a test jack, disconnect your phone line by detaching the wires, making sure to remember which wire goes where so you’ll be able to reattach them when your job is complete. Replace an Old Jack With a New One Remove the old jack from the wall. Use a screwdriver to unscrew the old jack, whether it’s a wall mount or a flush jack. Carefully pull the casing away from the wall, and you will find that the jack is attached to your home’s wiring with wires of four different colors: red, green, yellow, and black. Each wire is secured behind a screw. Use a screwdriver to loosen the screws, unsecure the four wires from behind them, and pull the old jack from the wall. If your jack is the type that is a rectangular box attached to a plate on the wall with notches, use a flathead screwdriver to pop off the top part of the case, and proceed to loosen the screws and remove the wires. Unscrew the plating and remove this from the wall as well. Prepare the wires for your new jack. If you’re replacing a jack that has been around for a long time, the four wires might need to be trimmed and stripped before you attach them to the new jack. If the exposed parts of the wires look old or brittle, use a wire cutter to trim off the damaged portions, no more than about ½” to ¾” (1.25 to 2 cm). Now use the wire cutter or a utility knife to gently strip the insulation from the tips of the wires so they may be connected to the new jack. Attach the telephone wires to the new jack. Turn the new jack over and loosen the four screws on the back. Connect each wire to the correct section of the jack, marked by color; there will be a spot for the red, green, yellow, and black wires. Secure the wires by tightening each screw. Mount the jack. Push the wires into the wall and position the jack over the hole. Line the jack’s screw holes with the holes made by the old jack. Place the new screws in the screw holes and use a screwdriver to secure the new jack to the wall. Depending on the type of jack you have, you may have a cover case that should be secured onto the wall piece to complete the process. Some types of jacks come with adhesive backing in addition to screws. You may use this to secure the jack to the wall, but it isn’t strictly necessary. Reconnect the phone line. Return to the NID on the outside of your house. Open the box and plug the test jack back in. If your NID doesn’t have a test plug, reconnect the wires you previously disconnected, making sure to screw them in securely. Test your line. Plug your telephone or DSL cable into your newly installed jack. Your phone should have a dial tone, and your internet connection should work now (as long as your computer is correctly set up for a DSL connection. If the phone line does not seem to be working, you may need to unscrew the new jack and make sure the wires are connected to the proper places and correctly screwed in. If further electrical work is required, make sure to go back to the NID and disconnect the phone line again before manipulating the wires.",
  "sentences":[
    " Install a New Jack in a Different Part of the Room Choose a spot for the new phone jack.",
    "Keep in mind that you’ll be running phone wires from the old phone jack to the new spot you choose.",
    "Assess your room and think about the best path for the phone wires.",
    "If you need a new phone jack on the opposite side of the room from your existing jack, will it be possible to run the wires along your baseboards?",
    "You’ll want to keep your wires neat, so have a plan in mind when you make your choice.",
    "If you want to install a new wall mounted phone, it’s best to choose a spot a few feet above your existing phone jack.",
    "This way, you won’t have to run unsightly wires across your room.",
    "Figure out how much new wire you need.",
    "Measure the distance from the old jack to the spot where the new one will be installed.",
    "Include the entire path that the telephone wire will travel: the distance from the old jack to the baseboard, around the perimeter of the room, and from the baseboard to the new jack’s location.",
    "Go to the hardware store and purchase the amount of wire you will need.",
    "If your new jack is going to be located several feet from the old one, you should also buy fasteners that are made for keeping the wire in place along walls and baseboards.",
    "Choose a new jack.",
    "Baseboard jacks or wall jacks that house the phone wires in a small box, rather than inside the wall, are the easiest phone jacks to install when you’re looking for a jack for a new location.",
    "These types of jacks are simply affixed to your baseboard or wall, with minimal drilling required.",
    "Affix the new jack to the spot you have chosen.",
    "After you’ve gone outside to your NID and disconnected your phone line in preparation for your task, it’s time to begin the installation of your new jack.",
    "Some jacks come with adhesive backing and simple mounting instructions.",
    "Others may need to be screwed into the wall.",
    "Depending on the type of wall you have, this may be accomplished either with a screwdriver and a bit of muscle or with a small drill.",
    "Ensure that your jack is not installed at a crooked angle by using a level to help you line up the jack with your floor or baseboard.",
    "Make small pencil marks in the places where you’ll be screwing or drilling holes.",
    "Attach telephone wire to the old jack.",
    "Open the casing, or unscrew the plating, on the old jack.",
    "Loosen the screws that secure the red, green, yellow and black telephone wires.",
    "As necessary, trim damage from the old wires and strip the insulation from the tips.",
    "Strip the insulation from the tips of the new wires, too.",
    "Twist the tips of the new wires with the tips of the old wires according to color: red to red, green to green, yellow to yellow, and black to black.",
    "Replace the twisted portions of the wires under the screws in the jack, and tighten the screws.",
    "Thread the new wire through the hole in the phone jack casing, and screw the casing back to the wall.",
    "If the hole in the phone jack casing is too small, or if it’s difficult to thread the wires through, it may be necessary to drill or cut a larger hole for this step.",
    "Run the wire from the old jack to the new jack.",
    "Using the path you mapped out in your original plan, run the new wire to the new jack.",
    "If you are running the wire along baseboards or up walls, use the fasteners you bought at the hardware store to secure it neatly in place.",
    "Attach telephone wire to the new jack.",
    "After you’ve run the wire from the old jack to the new jack, trim the excess wire so that you have a manageable coil.",
    "Strip the insulation from the tips of the four wires.",
    "Loosen the screws on the back of the new jack, and affix the red, green, yellow, and black wires in their correct color-coded places.",
    "Tighten the screws.",
    "Finish installing the new jack.",
    "If you’re using an external jack, there will be space inside the jack to coil the remaining wire.",
    "Place the cover on the jack and screw it on.",
    "Reconnect the phone line and test your work.",
    "Return to the NID box and reconnect your phone line.",
    "Go back inside and test it by plugging in your phone or DSL cable.",
    "If you have a dial tone and your internet works, your task is complete.",
    "Prepare for the Installation Choose a new jack.",
    "Most phone jacks cost about $3.00 to $5.00 and are available at hardware stores.",
    "Find a jack that best fits your needs, whether it’s a simple flush plate, a wall mount jack, or a baseboard jack.",
    "Jacks come in several different shapes and colors, and you’ll probably want to choose one that blends in well with your room’s décor.",
    "If you’re replacing an old jack that needs repairing, the simplest choice is a new jack with the same size and shape as the old one.",
    "For example, if your old jack is a standard rectangular wall plate, it will be easiest to install a new jack that looks very similar.",
    "This way you won’t have to drill a new hole in your wall to accommodate a new jack size.",
    "If you plan to attach your telephone to the wall, make sure you buy a wall mount jack, rather than a flush jack.",
    "A wall mount jack juts out from the wall, providing a structure on which to mount your telephone.",
    "A flush jack lies flat against the wall, allowing you to plug in your phone, but not mount it.",
    "Baseboard jacks are small plastic or metal boxes that are affixed to your baseboard, with the jack opening on the bottom edge of the box.",
    "If you’re concerned about aesthetics, this may be a more discreet option than a wall plate.",
    "If you’re planning on using the jack for both a DSL internet connection and a phone line, choose a jack with two openings, often called a duplex jack, so that you can run two separate lines.",
    "Find your home’s Network Interface Device (NID) and disconnect your phone line.",
    "The NID is a device installed by the phone company that  connects your home’s electrical wiring to your telephone network.",
    "It’s a gray box that is usually mounted on the outside of your house.",
    "When you’re ready to install your new jack, it’s important to disconnect your phone line so you aren’t working with a live wire.",
    "The electrical current that runs through phone lines is not strong, but it could still give you a small shock if you aren’t careful.",
    "The NID has two sides: one for the phone company, and one for customers.",
    "Open the side that’s intended for customers (the phone company’s side is usually locked) and unplug the test jack.",
    "Now your phone line is disconnected from the outside network.",
    "If you’re working with an older interface box without a test jack, disconnect your phone line by detaching the wires, making sure to remember which wire goes where so you’ll be able to reattach them when your job is complete.",
    "Replace an Old Jack With a New One Remove the old jack from the wall.",
    "Use a screwdriver to unscrew the old jack, whether it’s a wall mount or a flush jack.",
    "Carefully pull the casing away from the wall, and you will find that the jack is attached to your home’s wiring with wires of four different colors: red, green, yellow, and black.",
    "Each wire is secured behind a screw.",
    "Use a screwdriver to loosen the screws, unsecure the four wires from behind them, and pull the old jack from the wall.",
    "If your jack is the type that is a rectangular box attached to a plate on the wall with notches, use a flathead screwdriver to pop off the top part of the case, and proceed to loosen the screws and remove the wires.",
    "Unscrew the plating and remove this from the wall as well.",
    "Prepare the wires for your new jack.",
    "If you’re replacing a jack that has been around for a long time, the four wires might need to be trimmed and stripped before you attach them to the new jack.",
    "If the exposed parts of the wires look old or brittle, use a wire cutter to trim off the damaged portions, no more than about ½” to ¾” (1.25 to 2 cm).",
    "Now use the wire cutter or a utility knife to gently strip the insulation from the tips of the wires so they may be connected to the new jack.",
    "Attach the telephone wires to the new jack.",
    "Turn the new jack over and loosen the four screws on the back.",
    "Connect each wire to the correct section of the jack, marked by color; there will be a spot for the red, green, yellow, and black wires.",
    "Secure the wires by tightening each screw.",
    "Mount the jack.",
    "Push the wires into the wall and position the jack over the hole.",
    "Line the jack’s screw holes with the holes made by the old jack.",
    "Place the new screws in the screw holes and use a screwdriver to secure the new jack to the wall.",
    "Depending on the type of jack you have, you may have a cover case that should be secured onto the wall piece to complete the process.",
    "Some types of jacks come with adhesive backing in addition to screws.",
    "You may use this to secure the jack to the wall, but it isn’t strictly necessary.",
    "Reconnect the phone line.",
    "Return to the NID on the outside of your house.",
    "Open the box and plug the test jack back in.",
    "If your NID doesn’t have a test plug, reconnect the wires you previously disconnected, making sure to screw them in securely.",
    "Test your line.",
    "Plug your telephone or DSL cable into your newly installed jack.",
    "Your phone should have a dial tone, and your internet connection should work now (as long as your computer is correctly set up for a DSL connection.",
    "If the phone line does not seem to be working, you may need to unscrew the new jack and make sure the wires are connected to the proper places and correctly screwed in.",
    "If further electrical work is required, make sure to go back to the NID and disconnect the phone line again before manipulating the wires."
  ],
  "tyn_section":[
    "A phone jack",
    "A good set of wire cutters (wire snips or diagonal pliers)",
    "A Phillips and flathead screwdriver",
    "New telephone wire",
    "Wire fasteners",
    "A drill"
  ],
  "tyn_model":[
    "wire",
    "phone jack",
    "phone line",
    "screwdriver",
    "insulation",
    "screws",
    "telephone wire",
    "jack",
    "telephone",
    "fasteners",
    "plating",
    "telephone wires",
    "wire cutter",
    "drill",
    "level",
    "baseboard jacks",
    "network interface device",
    "phone company",
    "electrical current",
    "plate",
    "flathead screwdriver",
    "” to",
    "” (",
    "utility knife",
    "jacks",
    "adhesive backing",
    "phone"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.1851851852,
    "f1":0.2898550725
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.3703703704,
    "f1":0.5128205128
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0740740741,
    "f1":0.1212121212
  }
}