{
  "title":"How to Make a Burger Patty",
  "url":"https://www.wikihow.com/Make-a-Burger-Patty",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "methods":[
    {
      "name":"Standard Beef Burger Patties",
      "steps":[
        {
          "headline":"Combine ground beef and spices.",
          "description":"Use your hands to mix about 1/2 tsp (2.5 ml) salt and 1/4 tsp (1.25 ml) ground black pepper into the ground beef. You can vary the amount of salt and pepper you use according to your own sense of taste. If desired, you could also add other spices and seasonings to change the flavor of the burger completely. For a quick change of pace, use 1 Tbsp (15 ml) of a pre-mixed hamburger spice blend."
        },
        {
          "headline":"Divide into serving amounts.",
          "description":"For standard, 1/4 lb (115 g) patties, separate the ground beef into four equal balls or portions. The exact amount can depend on the size burger you want. For instance, if you prefer super-thin, diet-friendly patties, you could divide the meat into as many as eight portions, creating 1/8 lb (60 g) patties. On the other hand, if you want giant patties, you could split the full amount into two portions, creating 1/2 lb (225 g) patties."
        },
        {
          "headline":"Line a burger mold with plastic wrap.",
          "description":"Use an actual burger mold, a round cookie cutter, a plastic lid, or another round container that is the right shape and size. Lay a sheet of plastic wrap over that mold. The plastic wrap will prevent the patty from sticking to the sides of the hamburger press. If using an actual press, choose one that will work for the size burger you chose based on weight. If using another item, like a can lid, instead of an actual press, choose a lid that look just a little bit bigger than the size of the hamburger bun you anticipate using."
        },
        {
          "headline":"Press the burger into the mold.",
          "description":"Place one separated portion of ground beef into the lined mold and flatten it into the mold using your hands. Carefully remove it from the mold by lifting it out with the plastic wrap. Make sure that the beef is compactly pressed into the mold to help the burger patty hold together more firmly. If necessary, add more meat or remove excess based on how much excess space is left in your mold. If the mold does not work for you at all, you can form each separate portion into a ball and use your hand to flatten it into the shape of a patty. It may not be perfectly round, but this will usually do the trick well enough as long as you aren't trying to impress anyone with perfectly formed patties."
        },
        {
          "headline":"Flatten, if desired, for thinner patties.",
          "description":"If you want the burger patties to be even flatter, you can press them down using the bottom side of a clean baking sheet. More specifically, lay the burger patties out on a clean counter, cutting board, or inverted baking sheet and cover them with plastic wrap or parchment paper. Press down on the beef patties using the bottom of a second baking sheet until they flatten to your desired thickness."
        },
        {
          "headline":"Slightly indent the center.",
          "description":"Using your thumb, gently press a small indentation into the center of each patty. The indentation should be no deeper than 1/2 inch (1.25 cm). This small indentation or “well” is important, especially for normal beef patties and thick beef patties, since it can prevent the patties from becoming too plump in their centers during the cooking process."
        },
        {
          "headline":"Store the patties until ready to use.",
          "description":"Ideally, you should wrap the patties in an airtight plastic bag or in plastic wrap and allow them to chill in the refrigerator for at least 1 hour before you cook them."
        }
      ]
    },
    {
      "name":"Slider Burger Patties",
      "steps":[
        {
          "headline":"Mix the beef and spices.",
          "description":"Use your hands to combine the ground beef with 1/2 tsp (2.5 ml) salt and 1/4 tsp (1.25 ml) ground pepper until well mixed. You can add more or less salt and pepper according to your own tastes. If you want to try something different, you could also use a pre-mixed spice blend or another set of spices and herbs that suit your liking. Vary the amount based on how strong you want the flavor to be."
        },
        {
          "headline":"Form into a rectangle.",
          "description":"Place the hamburger meat onto the center of a large sheet of parchment paper. Pat it down, using your hands, into a 6-inch (15.25-cm) by 8-inch (20.3-cm) rectangle. If you want to make the sliders more even in thickness, you could press down on the rectangle gently with the bottom of a baking pan or using a rolling pin. Cover the meat with parchment paper before using either option, however, so that the beef does not stick to the bottom of your utensil."
        },
        {
          "headline":"Cut the rectangle into squares.",
          "description":"Use a sharp knife with a smooth blade to cut the rectangular portion of beef into 12 squares, each measuring about 2 inches (5 cm) in width and length. As a side note, this technique can also be used of you want to the patties to contain a normal amount of ground beef but want them to have a square shape. Simply make sure that the size rectangle you form can be divided into evenly sized perfect squares. For instance, you could form an 8-in by 8-in (20.3-cm by 20.3-cm) square of meat and cut it evenly into four patties that are 4 inches (10 cm) long on each side."
        },
        {
          "headline":"Store the patties until ready to use.",
          "description":"Refrigerate these patties for roughly 20 minutes before you plan on cooking them. Keep them covered until you pull them out of the refrigerator. Preferably, you should use an airtight plastic bag or plastic wrap."
        }
      ]
    },
    {
      "name":"Stuffed Burger Patties",
      "steps":[
        {
          "headline":"Mix the beef and spices.",
          "description":"Using your hands, thoroughly mix the ground beef with approximately 3/4 tsp (3.75 ml) salt and 1/2 tsp (2.4 ml) ground black pepper. Add more or less salt according to taste. The same goes for the black pepper, as well. If desired, you can use a separate hamburger spice blend or other seasonings that you enjoy tasting in your burgers, like garlic powder or chili powder. Make sure that the seasonings you choose will complement both the beef and the cheese, though."
        },
        {
          "headline":"Form four balls.",
          "description":"Break the chunk of ground beef into four even, separate pieces. Roll these portions into balls. These “balls” of hamburger need to be pressed together firmly so that the meat is dense and able to adhere to itself. When using this technique, you cannot afford to have crumbly burger meat."
        },
        {
          "headline":"Create an indentation.",
          "description":"Use your thumb to indent the middle of each ball. The indentation should be deep enough to reach the center of the ball. Alternatively, you could also use the handle end of a wooden or plastic mixing spoon to form the indentation."
        },
        {
          "headline":"Pack cheese into the center and close.",
          "description":"Fill each indentation with roughly 2 Tbsp (30 ml) shredded cheddar cheese. Use your fingers to smooth the top of the beef over the exposed indentation, hiding the cheese in the center as you do so. Cheddar cheese is recommended by default, but you can get creative by trying other types of cheese, as well. You can even stick small wedges or cubes of cheese in the center of the burger as long as they fit and are roughly equivalent to 2 Tbsp (30 ml) of shredded cheese."
        },
        {
          "headline":"Flatten into patties.",
          "description":"Use your hands or a burger mold to flatten the filled burger balls into patties. For these burgers, it might be easiest to form the patties using your hands. You could still work with some sort of patty press or mold, though. Line the mold with plastic wrap, press the stuffed patty ball into it, and flatten out the meat until it fills the mold."
        },
        {
          "headline":"Store the patties until ready to use.",
          "description":"Wrap these patties in plastic wrap or an airtight plastic bag and store them in the refrigerator for a minimum of 30 minutes before taking them out and cooking them."
        }
      ]
    },
    {
      "name":"Turkey Burger Patties",
      "steps":[
        {
          "headline":"Mix the ingredients together.",
          "description":"Use your hands to combine the ground turkey with both the dry and liquid seasonings. Continue mixing until the spices and herbs seem evenly distributed and the entire mass of turkey burger meat seems sticky and compact. Ground turkey tends to be drier than ground beef, but the mayonnaise can add enough tackiness to the mixture to help hold it together better. You can vary the spices as desired. Keep in mind, though, that most turkey burger patties have more spices than most beef patties do. Turkey has a slightly blander, milder taste than beef, so the additional spices help punch up the flavor of your turkey patties."
        },
        {
          "headline":"Divide into four balls.",
          "description":"For standard size turkey burgers, separate the entire bulk of seasoned meat into four even 1/4 lb (115 g) portions. Note that you could technically form larger or smaller burger patties. Even though it's a less common practice with turkey patties than it is with beef patties, there is no reason why it should not work."
        },
        {
          "headline":"Flatten into patties.",
          "description":"Use your hands or a burger mold to form the portions of turkey meat into flat burger patties. Since these burger patties tend to be a little stickier to the touch than beef patties are, forming the patties with your hands can be easier than using a burger press. If you are comfortable enough with your patty mold, though, you can still give it a shot and likely have success. Make sure to line the mold with plastic wrap before pressing the turkey patty meat into it."
        },
        {
          "headline":"Store the patties until ready to use.",
          "description":"You could cook these turkey burger patties immediately, but if you wrap them in plastic wrap or a plastic bag and refrigerate them for 20 minutes or so, you might find that the patties cook more evenly and stick less during the cooking process."
        }
      ]
    },
    {
      "name":"Vegetable Burger Patties",
      "steps":[
        {
          "headline":"Mash the black beans.",
          "description":"Place the beans into a medium bowl and use a fork to mash them into a paste-like texture. The texture of the mashed beans should be thick and chunky. You should still see some skins in the mixture. Do not puree the black beans in a blender or food processor at this point, though, since they could become too watery to form patties if you do that."
        },
        {
          "headline":"Process the vegetables.",
          "description":"Place the green bell pepper, onion, and garlic into a food processor. Run the machine on medium speed until the vegetables are finely chopped into tiny, indistinguishable pieces. Do not allow the mixture to reach a pureed or paste-like consistency, though. Immediately after processing these vegetables, stir them into your mashed black beans until thoroughly combined."
        },
        {
          "headline":"Stir together the egg and seasonings.",
          "description":"In a separate small bowl, mix together the egg, chili powder, cumin, and chili sauce, beating them gently with a fork or whisk until combined. The yolk and white of the egg should be fairly well combined. The seasonings should also appear evenly spread out within the egg mix."
        },
        {
          "headline":"Add the egg mixture and the bean mixture, along with the bread crumbs.",
          "description":"Pour the egg mixture into the bowl with the bean mixture. Mix everything together until evenly combined. Add the bread crumbs to the same bowl and mix again, making sure that the crumbs are thoroughly combined, as well. When ready, the entire mixture should be evenly sticky and it should hold together when pressed into portions without any difficulty. Note that the eggs help bind the ingredients together. The bread crumbs add volume to the patties, and they also prevent the mixture from becoming too moist."
        },
        {
          "headline":"Divide into four patties.",
          "description":"Separate the vegetable mixture into four portions, and flatten each portion into a burger patty using your hands or a burger mold. The veggie burger mix might be easier to form into patties if you use your hands, but if you do decide to use a patty press or mold, line it with plastic wrap before use."
        },
        {
          "headline":"Store the patties until ready to use.",
          "description":"These veggie burger patties are usually cooked immediately, but if you decide to store them, wrap them in plastic wrap or a resealable plastic bag and refrigerate them until you are ready to cook the burgers."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Standard Beef Burger Patties Combine ground beef and spices. Use your hands to mix about 1/2 tsp (2.5 ml) salt and 1/4 tsp (1.25 ml) ground black pepper into the ground beef. You can vary the amount of salt and pepper you use according to your own sense of taste. If desired, you could also add other spices and seasonings to change the flavor of the burger completely. For a quick change of pace, use 1 Tbsp (15 ml) of a pre-mixed hamburger spice blend. Divide into serving amounts. For standard, 1/4 lb (115 g) patties, separate the ground beef into four equal balls or portions. The exact amount can depend on the size burger you want. For instance, if you prefer super-thin, diet-friendly patties, you could divide the meat into as many as eight portions, creating 1/8 lb (60 g) patties. On the other hand, if you want giant patties, you could split the full amount into two portions, creating 1/2 lb (225 g) patties. Line a burger mold with plastic wrap. Use an actual burger mold, a round cookie cutter, a plastic lid, or another round container that is the right shape and size. Lay a sheet of plastic wrap over that mold. The plastic wrap will prevent the patty from sticking to the sides of the hamburger press. If using an actual press, choose one that will work for the size burger you chose based on weight. If using another item, like a can lid, instead of an actual press, choose a lid that look just a little bit bigger than the size of the hamburger bun you anticipate using. Press the burger into the mold. Place one separated portion of ground beef into the lined mold and flatten it into the mold using your hands. Carefully remove it from the mold by lifting it out with the plastic wrap. Make sure that the beef is compactly pressed into the mold to help the burger patty hold together more firmly. If necessary, add more meat or remove excess based on how much excess space is left in your mold. If the mold does not work for you at all, you can form each separate portion into a ball and use your hand to flatten it into the shape of a patty. It may not be perfectly round, but this will usually do the trick well enough as long as you aren't trying to impress anyone with perfectly formed patties. Flatten, if desired, for thinner patties. If you want the burger patties to be even flatter, you can press them down using the bottom side of a clean baking sheet. More specifically, lay the burger patties out on a clean counter, cutting board, or inverted baking sheet and cover them with plastic wrap or parchment paper. Press down on the beef patties using the bottom of a second baking sheet until they flatten to your desired thickness. Slightly indent the center. Using your thumb, gently press a small indentation into the center of each patty. The indentation should be no deeper than 1/2 inch (1.25 cm). This small indentation or “well” is important, especially for normal beef patties and thick beef patties, since it can prevent the patties from becoming too plump in their centers during the cooking process. Store the patties until ready to use. Ideally, you should wrap the patties in an airtight plastic bag or in plastic wrap and allow them to chill in the refrigerator for at least 1 hour before you cook them. Slider Burger Patties Mix the beef and spices. Use your hands to combine the ground beef with 1/2 tsp (2.5 ml) salt and 1/4 tsp (1.25 ml) ground pepper until well mixed. You can add more or less salt and pepper according to your own tastes. If you want to try something different, you could also use a pre-mixed spice blend or another set of spices and herbs that suit your liking. Vary the amount based on how strong you want the flavor to be. Form into a rectangle. Place the hamburger meat onto the center of a large sheet of parchment paper. Pat it down, using your hands, into a 6-inch (15.25-cm) by 8-inch (20.3-cm) rectangle. If you want to make the sliders more even in thickness, you could press down on the rectangle gently with the bottom of a baking pan or using a rolling pin. Cover the meat with parchment paper before using either option, however, so that the beef does not stick to the bottom of your utensil. Cut the rectangle into squares. Use a sharp knife with a smooth blade to cut the rectangular portion of beef into 12 squares, each measuring about 2 inches (5 cm) in width and length. As a side note, this technique can also be used of you want to the patties to contain a normal amount of ground beef but want them to have a square shape. Simply make sure that the size rectangle you form can be divided into evenly sized perfect squares. For instance, you could form an 8-in by 8-in (20.3-cm by 20.3-cm) square of meat and cut it evenly into four patties that are 4 inches (10 cm) long on each side. Store the patties until ready to use. Refrigerate these patties for roughly 20 minutes before you plan on cooking them. Keep them covered until you pull them out of the refrigerator. Preferably, you should use an airtight plastic bag or plastic wrap. Stuffed Burger Patties Mix the beef and spices. Using your hands, thoroughly mix the ground beef with approximately 3/4 tsp (3.75 ml) salt and 1/2 tsp (2.4 ml) ground black pepper. Add more or less salt according to taste. The same goes for the black pepper, as well. If desired, you can use a separate hamburger spice blend or other seasonings that you enjoy tasting in your burgers, like garlic powder or chili powder. Make sure that the seasonings you choose will complement both the beef and the cheese, though. Form four balls. Break the chunk of ground beef into four even, separate pieces. Roll these portions into balls. These “balls” of hamburger need to be pressed together firmly so that the meat is dense and able to adhere to itself. When using this technique, you cannot afford to have crumbly burger meat. Create an indentation. Use your thumb to indent the middle of each ball. The indentation should be deep enough to reach the center of the ball. Alternatively, you could also use the handle end of a wooden or plastic mixing spoon to form the indentation. Pack cheese into the center and close. Fill each indentation with roughly 2 Tbsp (30 ml) shredded cheddar cheese. Use your fingers to smooth the top of the beef over the exposed indentation, hiding the cheese in the center as you do so. Cheddar cheese is recommended by default, but you can get creative by trying other types of cheese, as well. You can even stick small wedges or cubes of cheese in the center of the burger as long as they fit and are roughly equivalent to 2 Tbsp (30 ml) of shredded cheese. Flatten into patties. Use your hands or a burger mold to flatten the filled burger balls into patties. For these burgers, it might be easiest to form the patties using your hands. You could still work with some sort of patty press or mold, though. Line the mold with plastic wrap, press the stuffed patty ball into it, and flatten out the meat until it fills the mold. Store the patties until ready to use. Wrap these patties in plastic wrap or an airtight plastic bag and store them in the refrigerator for a minimum of 30 minutes before taking them out and cooking them. Turkey Burger Patties Mix the ingredients together. Use your hands to combine the ground turkey with both the dry and liquid seasonings. Continue mixing until the spices and herbs seem evenly distributed and the entire mass of turkey burger meat seems sticky and compact. Ground turkey tends to be drier than ground beef, but the mayonnaise can add enough tackiness to the mixture to help hold it together better. You can vary the spices as desired. Keep in mind, though, that most turkey burger patties have more spices than most beef patties do. Turkey has a slightly blander, milder taste than beef, so the additional spices help punch up the flavor of your turkey patties. Divide into four balls. For standard size turkey burgers, separate the entire bulk of seasoned meat into four even 1/4 lb (115 g) portions. Note that you could technically form larger or smaller burger patties. Even though it's a less common practice with turkey patties than it is with beef patties, there is no reason why it should not work. Flatten into patties. Use your hands or a burger mold to form the portions of turkey meat into flat burger patties. Since these burger patties tend to be a little stickier to the touch than beef patties are, forming the patties with your hands can be easier than using a burger press. If you are comfortable enough with your patty mold, though, you can still give it a shot and likely have success. Make sure to line the mold with plastic wrap before pressing the turkey patty meat into it. Store the patties until ready to use. You could cook these turkey burger patties immediately, but if you wrap them in plastic wrap or a plastic bag and refrigerate them for 20 minutes or so, you might find that the patties cook more evenly and stick less during the cooking process. Vegetable Burger Patties Mash the black beans. Place the beans into a medium bowl and use a fork to mash them into a paste-like texture. The texture of the mashed beans should be thick and chunky. You should still see some skins in the mixture. Do not puree the black beans in a blender or food processor at this point, though, since they could become too watery to form patties if you do that. Process the vegetables. Place the green bell pepper, onion, and garlic into a food processor. Run the machine on medium speed until the vegetables are finely chopped into tiny, indistinguishable pieces. Do not allow the mixture to reach a pureed or paste-like consistency, though. Immediately after processing these vegetables, stir them into your mashed black beans until thoroughly combined. Stir together the egg and seasonings. In a separate small bowl, mix together the egg, chili powder, cumin, and chili sauce, beating them gently with a fork or whisk until combined. The yolk and white of the egg should be fairly well combined. The seasonings should also appear evenly spread out within the egg mix. Add the egg mixture and the bean mixture, along with the bread crumbs. Pour the egg mixture into the bowl with the bean mixture. Mix everything together until evenly combined. Add the bread crumbs to the same bowl and mix again, making sure that the crumbs are thoroughly combined, as well. When ready, the entire mixture should be evenly sticky and it should hold together when pressed into portions without any difficulty. Note that the eggs help bind the ingredients together. The bread crumbs add volume to the patties, and they also prevent the mixture from becoming too moist. Divide into four patties. Separate the vegetable mixture into four portions, and flatten each portion into a burger patty using your hands or a burger mold. The veggie burger mix might be easier to form into patties if you use your hands, but if you do decide to use a patty press or mold, line it with plastic wrap before use. Store the patties until ready to use. These veggie burger patties are usually cooked immediately, but if you decide to store them, wrap them in plastic wrap or a resealable plastic bag and refrigerate them until you are ready to cook the burgers. Finished. ",
  "sentences":[
    " Standard Beef Burger Patties Combine ground beef and spices.",
    "Use your hands to mix about 1/2 tsp (2.5 ml) salt and 1/4 tsp (1.25 ml) ground black pepper into the ground beef.",
    "You can vary the amount of salt and pepper you use according to your own sense of taste.",
    "If desired, you could also add other spices and seasonings to change the flavor of the burger completely.",
    "For a quick change of pace, use 1 Tbsp (15 ml) of a pre-mixed hamburger spice blend.",
    "Divide into serving amounts.",
    "For standard, 1/4 lb (115 g) patties, separate the ground beef into four equal balls or portions.",
    "The exact amount can depend on the size burger you want.",
    "For instance, if you prefer super-thin, diet-friendly patties, you could divide the meat into as many as eight portions, creating 1/8 lb (60 g) patties.",
    "On the other hand, if you want giant patties, you could split the full amount into two portions, creating 1/2 lb (225 g) patties.",
    "Line a burger mold with plastic wrap.",
    "Use an actual burger mold, a round cookie cutter, a plastic lid, or another round container that is the right shape and size.",
    "Lay a sheet of plastic wrap over that mold.",
    "The plastic wrap will prevent the patty from sticking to the sides of the hamburger press.",
    "If using an actual press, choose one that will work for the size burger you chose based on weight.",
    "If using another item, like a can lid, instead of an actual press, choose a lid that look just a little bit bigger than the size of the hamburger bun you anticipate using.",
    "Press the burger into the mold.",
    "Place one separated portion of ground beef into the lined mold and flatten it into the mold using your hands.",
    "Carefully remove it from the mold by lifting it out with the plastic wrap.",
    "Make sure that the beef is compactly pressed into the mold to help the burger patty hold together more firmly.",
    "If necessary, add more meat or remove excess based on how much excess space is left in your mold.",
    "If the mold does not work for you at all, you can form each separate portion into a ball and use your hand to flatten it into the shape of a patty.",
    "It may not be perfectly round, but this will usually do the trick well enough as long as you aren't trying to impress anyone with perfectly formed patties.",
    "Flatten, if desired, for thinner patties.",
    "If you want the burger patties to be even flatter, you can press them down using the bottom side of a clean baking sheet.",
    "More specifically, lay the burger patties out on a clean counter, cutting board, or inverted baking sheet and cover them with plastic wrap or parchment paper.",
    "Press down on the beef patties using the bottom of a second baking sheet until they flatten to your desired thickness.",
    "Slightly indent the center.",
    "Using your thumb, gently press a small indentation into the center of each patty.",
    "The indentation should be no deeper than 1/2 inch (1.25 cm).",
    "This small indentation or “well” is important, especially for normal beef patties and thick beef patties, since it can prevent the patties from becoming too plump in their centers during the cooking process.",
    "Store the patties until ready to use.",
    "Ideally, you should wrap the patties in an airtight plastic bag or in plastic wrap and allow them to chill in the refrigerator for at least 1 hour before you cook them.",
    "Slider Burger Patties Mix the beef and spices.",
    "Use your hands to combine the ground beef with 1/2 tsp (2.5 ml) salt and 1/4 tsp (1.25 ml) ground pepper until well mixed.",
    "You can add more or less salt and pepper according to your own tastes.",
    "If you want to try something different, you could also use a pre-mixed spice blend or another set of spices and herbs that suit your liking.",
    "Vary the amount based on how strong you want the flavor to be.",
    "Form into a rectangle.",
    "Place the hamburger meat onto the center of a large sheet of parchment paper.",
    "Pat it down, using your hands, into a 6-inch (15.25-cm) by 8-inch (20.3-cm) rectangle.",
    "If you want to make the sliders more even in thickness, you could press down on the rectangle gently with the bottom of a baking pan or using a rolling pin.",
    "Cover the meat with parchment paper before using either option, however, so that the beef does not stick to the bottom of your utensil.",
    "Cut the rectangle into squares.",
    "Use a sharp knife with a smooth blade to cut the rectangular portion of beef into 12 squares, each measuring about 2 inches (5 cm) in width and length.",
    "As a side note, this technique can also be used of you want to the patties to contain a normal amount of ground beef but want them to have a square shape.",
    "Simply make sure that the size rectangle you form can be divided into evenly sized perfect squares.",
    "For instance, you could form an 8-in by 8-in (20.3-cm by 20.3-cm) square of meat and cut it evenly into four patties that are 4 inches (10 cm) long on each side.",
    "Store the patties until ready to use.",
    "Refrigerate these patties for roughly 20 minutes before you plan on cooking them.",
    "Keep them covered until you pull them out of the refrigerator.",
    "Preferably, you should use an airtight plastic bag or plastic wrap.",
    "Stuffed Burger Patties Mix the beef and spices.",
    "Using your hands, thoroughly mix the ground beef with approximately 3/4 tsp (3.75 ml) salt and 1/2 tsp (2.4 ml) ground black pepper.",
    "Add more or less salt according to taste.",
    "The same goes for the black pepper, as well.",
    "If desired, you can use a separate hamburger spice blend or other seasonings that you enjoy tasting in your burgers, like garlic powder or chili powder.",
    "Make sure that the seasonings you choose will complement both the beef and the cheese, though.",
    "Form four balls.",
    "Break the chunk of ground beef into four even, separate pieces.",
    "Roll these portions into balls.",
    "These “balls” of hamburger need to be pressed together firmly so that the meat is dense and able to adhere to itself.",
    "When using this technique, you cannot afford to have crumbly burger meat.",
    "Create an indentation.",
    "Use your thumb to indent the middle of each ball.",
    "The indentation should be deep enough to reach the center of the ball.",
    "Alternatively, you could also use the handle end of a wooden or plastic mixing spoon to form the indentation.",
    "Pack cheese into the center and close.",
    "Fill each indentation with roughly 2 Tbsp (30 ml) shredded cheddar cheese.",
    "Use your fingers to smooth the top of the beef over the exposed indentation, hiding the cheese in the center as you do so.",
    "Cheddar cheese is recommended by default, but you can get creative by trying other types of cheese, as well.",
    "You can even stick small wedges or cubes of cheese in the center of the burger as long as they fit and are roughly equivalent to 2 Tbsp (30 ml) of shredded cheese.",
    "Flatten into patties.",
    "Use your hands or a burger mold to flatten the filled burger balls into patties.",
    "For these burgers, it might be easiest to form the patties using your hands.",
    "You could still work with some sort of patty press or mold, though.",
    "Line the mold with plastic wrap, press the stuffed patty ball into it, and flatten out the meat until it fills the mold.",
    "Store the patties until ready to use.",
    "Wrap these patties in plastic wrap or an airtight plastic bag and store them in the refrigerator for a minimum of 30 minutes before taking them out and cooking them.",
    "Turkey Burger Patties Mix the ingredients together.",
    "Use your hands to combine the ground turkey with both the dry and liquid seasonings.",
    "Continue mixing until the spices and herbs seem evenly distributed and the entire mass of turkey burger meat seems sticky and compact.",
    "Ground turkey tends to be drier than ground beef, but the mayonnaise can add enough tackiness to the mixture to help hold it together better.",
    "You can vary the spices as desired.",
    "Keep in mind, though, that most turkey burger patties have more spices than most beef patties do.",
    "Turkey has a slightly blander, milder taste than beef, so the additional spices help punch up the flavor of your turkey patties.",
    "Divide into four balls.",
    "For standard size turkey burgers, separate the entire bulk of seasoned meat into four even 1/4 lb (115 g) portions.",
    "Note that you could technically form larger or smaller burger patties.",
    "Even though it's a less common practice with turkey patties than it is with beef patties, there is no reason why it should not work.",
    "Flatten into patties.",
    "Use your hands or a burger mold to form the portions of turkey meat into flat burger patties.",
    "Since these burger patties tend to be a little stickier to the touch than beef patties are, forming the patties with your hands can be easier than using a burger press.",
    "If you are comfortable enough with your patty mold, though, you can still give it a shot and likely have success.",
    "Make sure to line the mold with plastic wrap before pressing the turkey patty meat into it.",
    "Store the patties until ready to use.",
    "You could cook these turkey burger patties immediately, but if you wrap them in plastic wrap or a plastic bag and refrigerate them for 20 minutes or so, you might find that the patties cook more evenly and stick less during the cooking process.",
    "Vegetable Burger Patties Mash the black beans.",
    "Place the beans into a medium bowl and use a fork to mash them into a paste-like texture.",
    "The texture of the mashed beans should be thick and chunky.",
    "You should still see some skins in the mixture.",
    "Do not puree the black beans in a blender or food processor at this point, though, since they could become too watery to form patties if you do that.",
    "Process the vegetables.",
    "Place the green bell pepper, onion, and garlic into a food processor.",
    "Run the machine on medium speed until the vegetables are finely chopped into tiny, indistinguishable pieces.",
    "Do not allow the mixture to reach a pureed or paste-like consistency, though.",
    "Immediately after processing these vegetables, stir them into your mashed black beans until thoroughly combined.",
    "Stir together the egg and seasonings.",
    "In a separate small bowl, mix together the egg, chili powder, cumin, and chili sauce, beating them gently with a fork or whisk until combined.",
    "The yolk and white of the egg should be fairly well combined.",
    "The seasonings should also appear evenly spread out within the egg mix.",
    "Add the egg mixture and the bean mixture, along with the bread crumbs.",
    "Pour the egg mixture into the bowl with the bean mixture.",
    "Mix everything together until evenly combined.",
    "Add the bread crumbs to the same bowl and mix again, making sure that the crumbs are thoroughly combined, as well.",
    "When ready, the entire mixture should be evenly sticky and it should hold together when pressed into portions without any difficulty.",
    "Note that the eggs help bind the ingredients together.",
    "The bread crumbs add volume to the patties, and they also prevent the mixture from becoming too moist.",
    "Divide into four patties.",
    "Separate the vegetable mixture into four portions, and flatten each portion into a burger patty using your hands or a burger mold.",
    "The veggie burger mix might be easier to form into patties if you use your hands, but if you do decide to use a patty press or mold, line it with plastic wrap before use.",
    "Store the patties until ready to use.",
    "These veggie burger patties are usually cooked immediately, but if you decide to store them, wrap them in plastic wrap or a resealable plastic bag and refrigerate them until you are ready to cook the burgers.",
    "Finished."
  ],
  "tyn_section":[
    "Large mixing bowl",
    "Burger press or lid",
    "Plastic wrap",
    "Baking sheet (optional)",
    "Sharp kitchen knife",
    "Rolling pin or baking sheet",
    "Parchment paper",
    "Plastic wrap or plastic bag",
    "Mixing spoon with rounded handle end",
    "Patty press or mold (optional)",
    "Plastic wrap or plastic bag (optional)",
    "Fork",
    "Food processor",
    "Small mixing bowl"
  ],
  "tyn_model":[
    "plastic wrap",
    "spices",
    "ground beef",
    "salt",
    "seasonings",
    "burger mold",
    "beef",
    "cheese",
    "baking sheet",
    "parchment paper",
    "airtight plastic bag",
    "refrigerator",
    "black beans",
    "bread crumbs",
    "ground black pepper",
    "pepper",
    "hamburger spice blend",
    "herbs",
    "chili powder",
    "patty press",
    "turkey burger",
    "fork",
    "food processor",
    "egg",
    "bean",
    "bowl",
    "standard beef burger patties",
    "cookie cutter",
    "plastic lid",
    "hamburger press",
    "patty",
    "cutting board,",
    "“well",
    "” is",
    "ground pepper",
    "spice blend",
    "baking pan",
    "rolling pin",
    "sharp knife",
    "black pepper",
    "garlic powder",
    "“balls",
    "” of",
    "shredded cheddar cheese",
    "shredded cheese",
    "turkey burger patties",
    "ground turkey",
    "turkey",
    "mayonnaise",
    "burger press",
    "turkey patty",
    "plastic bag",
    "vegetable burger patties",
    "medium bowl",
    "blender",
    "vegetables",
    "green bell pepper",
    "onion",
    "garlic",
    "small bowl",
    "cumin",
    "chili sauce",
    "whisk",
    "eggs",
    "resealable plastic bag"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0615384615,
    "f1":0.1012658228,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6428571429,
    "p":0.1384615385,
    "f1":0.2278481013
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9285714286,
    "p":0.2307692308,
    "f1":0.3696682464
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1076923077,
    "f1":0.1772151899
  }
}