{
  "title":"How to Make Bibingka",
  "url":"https://www.wikihow.com/Make-Bibingka",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "methods":[
    {
      "name":"Traditional Version",
      "steps":[
        {
          "headline":"Preheat the oven to 350 degrees Fahrenheit (180 degrees Celsius).",
          "description":"Prepare four tart pans or ramekins by lining them with cut banana leaves. If you want the cakes to look as traditional as possible, bake them in 6-inch (15.25-cm) ramekins. You could use 4-oz (10-cm) ramekins, but the cakes will be thicker than usual and will also take longer to cook. Similarly, if baked in tart pans, the cakes will be a bit shallower than usual and may bake quicker. You could also use a standard 8-inch (20.3-cm) round baking pan with a depth of 3 inches (7.6 cm) if you do not have a tart pan, ramekins, or ramekin-like miniature baking pans. The banana leaves are an essential aspect of this recipe if you want it to be as traditional as possible. They add to both the appearance and fragrance of the finished cakes."
        },
        {
          "headline":"Combine the first portion of dry ingredients.",
          "description":"In a large bowl, whisk together the rice flour, baking powder, and salt until well combined. Most traditional recipes only use standard rice flour and do not used sweet or glutinous rice flour."
        },
        {
          "headline":"Create the egg mixture.",
          "description":"In a separate bowl, beat the eggs lightly with a whisk. Add the sugar and beat again. Add the melted butter and beat once more. Granulated sugar is used in most traditional recipes for bibingka, but for a slightly different taste, you could use brown sugar, instead."
        },
        {
          "headline":"Add the flour and coconut milk.",
          "description":"Alternate adding the flour mixture and coconut milk to the egg mixture, beating with a whisk after each addition. Only beat until the mixture is just blended, and avoid over-beating the batter."
        },
        {
          "headline":"Pour the batter into the prepared pans.",
          "description":"Divide the batter evenly amongst the four prepared pans, pouring it directly into the banana leaves. Traditionally, you should lay slices of salted egg on top of each cake before baking it. Duck eggs are the most traditional, but salted chicken eggs will also work."
        },
        {
          "headline":"Bake the cakes.",
          "description":"Place the cakes on the top rack of the oven and bake for 20 to 25 minutes, or until the cakes are cooked through. Check for doneness by inserting a toothpick into the center of each cake. If it comes out clean, then the cakes are fully cooked."
        },
        {
          "headline":"Brown the tops.",
          "description":"Switch the broiler on to low and broil the cakes for another 2 to 3 minutes, or until the top of each cake browns. Watch the cakes carefully during this time to prevent them from burning. Note that this step is only optional. It will have very little bearing on the taste of the cake, but it can create a more appealing appearance."
        },
        {
          "headline":"Finish and serve the cakes.",
          "description":"Remove the cakes from the oven and let cool for a few minutes. Brush them with additional melted butter, and if desired, sprinkle with additional sugar, grated coconut, and grated cheese. Serve while still warm. You could eat the cakes out of the ramekins you baked them in, but for a better presentation, you should slide them out of their baking dishes before adding the butter, sugar, coconut, and cheese. Carefully tip each ramekin onto its side and gently slide the cake and banana leaves out. Place each cake on an individual serving platter and enjoy."
        }
      ]
    },
    {
      "name":"Modern Version",
      "steps":[
        {
          "headline":"Preheat the oven to 375 degrees Fahrenheit (190 degrees Celsius).",
          "description":"Prepare a 13-inch by 18-inch by 1-inch (33-cm by 46-cm by 2.5-cm) baking sheet by lining it with parchment paper. Note that the modern version of this recipe does not use banana leaves like the traditional version uses."
        },
        {
          "headline":"Combine the milks.",
          "description":"In a large mixing bowl, combine the coconut milk, condensed milk, and melted butter using an electric mixer. Note that as you beat the ingredients together, in this step and in later steps, you should periodically scrape the sides of the bowl with a spatula to ensure that all of the ingredients are being mixed into the batter equally."
        },
        {
          "headline":"Add the eggs.",
          "description":"Add the eggs to the batter one at a time, beating after each addition until combined."
        },
        {
          "headline":"Add the macapuno strings.",
          "description":"Mix these coconut strings into the batter one can at a time. Beat after each addition to combine. Do not drain the syrup from the cans of macapuno. You should add the entire contents of the cans, syrup, coconut strings, and all."
        },
        {
          "headline":"Gradually add the sweet rice flour.",
          "description":"Add the rice flour to the batter in 1/2 cup (125 ml) amounts, beating well after each addition to combine. Do not add the mochiko flour all at once. If you do, the batter will become very clumpy, and you might not be able to smooth it out again even after prolonged beating."
        },
        {
          "headline":"Add the remaining ingredients.",
          "description":"Pour in the brown sugar and finely chopped almonds, then beat into an even consistency. When done, add the vanilla extract, and beat quickly to mix it into the rest of the batter."
        },
        {
          "headline":"Pour the batter into the prepared baking sheet.",
          "description":"Quickly inspect it to make sure that there are no air bubbles or lumps. If you notice any air bubbles, remove them by gently tapping the bottom of the pan against the counter."
        },
        {
          "headline":"Cook until done.",
          "description":"Bake the cake for roughly 45 minutes, or until it turns a light brown. Sprinkle a little cinnamon over the cake in an even pattern, then continue to bake it for another 2 to 15 minutes, or until it turns golden brown. The center of the cake should be set when it is ready to come out of the oven. Check the center by inserting a toothpick directly into the center of the cake. If it comes out clean, the cake is ready."
        },
        {
          "headline":"Cool and serve the cake.",
          "description":"Remove the cake from the oven. Lift the parchment paper off the baking sheet, lifting the cake with it, and allow the cake to cool on the parchment paper but off the baking sheet until it reaches room temperature. Cut the entire thing into 2-inch (5-cm) squares and serve. To make the cutting process easier, use a long, clean ruler and a pizza cutter. You can store the cooked bibingka in an airtight container for 1 to 2 days at room temperature. If refrigerated, you can store it for 1 to 2 weeks. The consistency of this version tends to get harder once the cake has completely cooled, so you might want to reheat it in the microwave for 20 to 30 seconds before enjoying."
        }
      ]
    },
    {
      "name":"Gourmet Version",
      "steps":[
        {
          "headline":"Preheat the oven to 350 degrees Fahrenheit (180 degrees Celsius).",
          "description":"Prepare a 13-inch by 9-inch (33-cm by 23-cm) baking pan by greasing it with butter, shortening, or nonstick cooking spray. Note that this version of the recipe does not require the use of banana leaves."
        },
        {
          "headline":"Cream together the cream cheese and 2 cups (500 ml) sugar.",
          "description":"Combine the two ingredients in a large bowl and beat them together with an electric mixer on low speed for roughly 30 seconds, or until thoroughly creamed together. Scrape the sides of the bowl to ensure that all the cream cheese and sugar have been blended in."
        },
        {
          "headline":"Stir the eggs in.",
          "description":"Add the eggs to the cream cheese mixture, stirring well enough to blend the egg in after each addition."
        },
        {
          "headline":"Mix in the remaining ingredients.",
          "description":"Add the baking powder, sweet rice flour, melted butter, vanilla, cream of coconut, milk, and crushed pineapple to the batter. Add them one at a time, stirring after each addition. When done, continue stirring until the batter is smooth. When adding the flour, you should mix it into the batter 1/2 cup (125 ml) at a time and stir after each addition. Doing so minimizes the risk of lumps forming in your batter."
        },
        {
          "headline":"Pour the batter into your prepared pan.",
          "description":"Once the batter is in the pan, sprinkle the top evenly with the brown sugar and an additional 2 Tbsp (30 ml) granulated sugar. Check the batter for lumps or air bubbles. Break up any lumps with a fork or spatula. Remove any air bubbles by gently tapping the bottom of the pan against the counter."
        },
        {
          "headline":"Bake for 1 hour.",
          "description":"The cake is done when the edges turn slightly crispy and the center is baked through. Check the center by inserting a toothpick into the cake. If it comes out clean, the cake is ready. Let the cake cool to room temperature in its pan."
        },
        {
          "headline":"Serve warm.",
          "description":"After the cake cools to room temperature, cut it into 12 to 24 even squares and remove those squares from the pan. Serve while still somewhat warm, or place the squares in an airtight container and serve later. If you plan on eating the cake in the next 1 to 2 days, you can store it at room temperature. To preserve the freshness of the cake for 1 to 2 weeks, place it in the refrigerator."
        }
      ]
    }
  ],
  "text":" Traditional Version Preheat the oven to 350 degrees Fahrenheit (180 degrees Celsius). Prepare four tart pans or ramekins by lining them with cut banana leaves. If you want the cakes to look as traditional as possible, bake them in 6-inch (15.25-cm) ramekins. You could use 4-oz (10-cm) ramekins, but the cakes will be thicker than usual and will also take longer to cook. Similarly, if baked in tart pans, the cakes will be a bit shallower than usual and may bake quicker. You could also use a standard 8-inch (20.3-cm) round baking pan with a depth of 3 inches (7.6 cm) if you do not have a tart pan, ramekins, or ramekin-like miniature baking pans. The banana leaves are an essential aspect of this recipe if you want it to be as traditional as possible. They add to both the appearance and fragrance of the finished cakes. Combine the first portion of dry ingredients. In a large bowl, whisk together the rice flour, baking powder, and salt until well combined. Most traditional recipes only use standard rice flour and do not used sweet or glutinous rice flour. Create the egg mixture. In a separate bowl, beat the eggs lightly with a whisk. Add the sugar and beat again. Add the melted butter and beat once more. Granulated sugar is used in most traditional recipes for bibingka, but for a slightly different taste, you could use brown sugar, instead. Add the flour and coconut milk. Alternate adding the flour mixture and coconut milk to the egg mixture, beating with a whisk after each addition. Only beat until the mixture is just blended, and avoid over-beating the batter. Pour the batter into the prepared pans. Divide the batter evenly amongst the four prepared pans, pouring it directly into the banana leaves. Traditionally, you should lay slices of salted egg on top of each cake before baking it. Duck eggs are the most traditional, but salted chicken eggs will also work. Bake the cakes. Place the cakes on the top rack of the oven and bake for 20 to 25 minutes, or until the cakes are cooked through. Check for doneness by inserting a toothpick into the center of each cake. If it comes out clean, then the cakes are fully cooked. Brown the tops. Switch the broiler on to low and broil the cakes for another 2 to 3 minutes, or until the top of each cake browns. Watch the cakes carefully during this time to prevent them from burning. Note that this step is only optional. It will have very little bearing on the taste of the cake, but it can create a more appealing appearance. Finish and serve the cakes. Remove the cakes from the oven and let cool for a few minutes. Brush them with additional melted butter, and if desired, sprinkle with additional sugar, grated coconut, and grated cheese. Serve while still warm. You could eat the cakes out of the ramekins you baked them in, but for a better presentation, you should slide them out of their baking dishes before adding the butter, sugar, coconut, and cheese. Carefully tip each ramekin onto its side and gently slide the cake and banana leaves out. Place each cake on an individual serving platter and enjoy. Modern Version Preheat the oven to 375 degrees Fahrenheit (190 degrees Celsius). Prepare a 13-inch by 18-inch by 1-inch (33-cm by 46-cm by 2.5-cm) baking sheet by lining it with parchment paper. Note that the modern version of this recipe does not use banana leaves like the traditional version uses. Combine the milks. In a large mixing bowl, combine the coconut milk, condensed milk, and melted butter using an electric mixer. Note that as you beat the ingredients together, in this step and in later steps, you should periodically scrape the sides of the bowl with a spatula to ensure that all of the ingredients are being mixed into the batter equally. Add the eggs. Add the eggs to the batter one at a time, beating after each addition until combined. Add the macapuno strings. Mix these coconut strings into the batter one can at a time. Beat after each addition to combine. Do not drain the syrup from the cans of macapuno. You should add the entire contents of the cans, syrup, coconut strings, and all. Gradually add the sweet rice flour. Add the rice flour to the batter in 1/2 cup (125 ml) amounts, beating well after each addition to combine. Do not add the mochiko flour all at once. If you do, the batter will become very clumpy, and you might not be able to smooth it out again even after prolonged beating. Add the remaining ingredients. Pour in the brown sugar and finely chopped almonds, then beat into an even consistency. When done, add the vanilla extract, and beat quickly to mix it into the rest of the batter. Pour the batter into the prepared baking sheet. Quickly inspect it to make sure that there are no air bubbles or lumps. If you notice any air bubbles, remove them by gently tapping the bottom of the pan against the counter. Cook until done. Bake the cake for roughly 45 minutes, or until it turns a light brown. Sprinkle a little cinnamon over the cake in an even pattern, then continue to bake it for another 2 to 15 minutes, or until it turns golden brown. The center of the cake should be set when it is ready to come out of the oven. Check the center by inserting a toothpick directly into the center of the cake. If it comes out clean, the cake is ready. Cool and serve the cake. Remove the cake from the oven. Lift the parchment paper off the baking sheet, lifting the cake with it, and allow the cake to cool on the parchment paper but off the baking sheet until it reaches room temperature. Cut the entire thing into 2-inch (5-cm) squares and serve. To make the cutting process easier, use a long, clean ruler and a pizza cutter. You can store the cooked bibingka in an airtight container for 1 to 2 days at room temperature. If refrigerated, you can store it for 1 to 2 weeks. The consistency of this version tends to get harder once the cake has completely cooled, so you might want to reheat it in the microwave for 20 to 30 seconds before enjoying. Gourmet Version Preheat the oven to 350 degrees Fahrenheit (180 degrees Celsius). Prepare a 13-inch by 9-inch (33-cm by 23-cm) baking pan by greasing it with butter, shortening, or nonstick cooking spray. Note that this version of the recipe does not require the use of banana leaves. Cream together the cream cheese and 2 cups (500 ml) sugar. Combine the two ingredients in a large bowl and beat them together with an electric mixer on low speed for roughly 30 seconds, or until thoroughly creamed together. Scrape the sides of the bowl to ensure that all the cream cheese and sugar have been blended in. Stir the eggs in. Add the eggs to the cream cheese mixture, stirring well enough to blend the egg in after each addition. Mix in the remaining ingredients. Add the baking powder, sweet rice flour, melted butter, vanilla, cream of coconut, milk, and crushed pineapple to the batter. Add them one at a time, stirring after each addition. When done, continue stirring until the batter is smooth. When adding the flour, you should mix it into the batter 1/2 cup (125 ml) at a time and stir after each addition. Doing so minimizes the risk of lumps forming in your batter. Pour the batter into your prepared pan. Once the batter is in the pan, sprinkle the top evenly with the brown sugar and an additional 2 Tbsp (30 ml) granulated sugar. Check the batter for lumps or air bubbles. Break up any lumps with a fork or spatula. Remove any air bubbles by gently tapping the bottom of the pan against the counter. Bake for 1 hour. The cake is done when the edges turn slightly crispy and the center is baked through. Check the center by inserting a toothpick into the cake. If it comes out clean, the cake is ready. Let the cake cool to room temperature in its pan. Serve warm. After the cake cools to room temperature, cut it into 12 to 24 even squares and remove those squares from the pan. Serve while still somewhat warm, or place the squares in an airtight container and serve later. If you plan on eating the cake in the next 1 to 2 days, you can store it at room temperature. To preserve the freshness of the cake for 1 to 2 weeks, place it in the refrigerator.",
  "sentences":[
    " Traditional Version Preheat the oven to 350 degrees Fahrenheit (180 degrees Celsius).",
    "Prepare four tart pans or ramekins by lining them with cut banana leaves.",
    "If you want the cakes to look as traditional as possible, bake them in 6-inch (15.25-cm) ramekins.",
    "You could use 4-oz (10-cm) ramekins, but the cakes will be thicker than usual and will also take longer to cook.",
    "Similarly, if baked in tart pans, the cakes will be a bit shallower than usual and may bake quicker.",
    "You could also use a standard 8-inch (20.3-cm) round baking pan with a depth of 3 inches (7.6 cm) if you do not have a tart pan, ramekins, or ramekin-like miniature baking pans.",
    "The banana leaves are an essential aspect of this recipe if you want it to be as traditional as possible.",
    "They add to both the appearance and fragrance of the finished cakes.",
    "Combine the first portion of dry ingredients.",
    "In a large bowl, whisk together the rice flour, baking powder, and salt until well combined.",
    "Most traditional recipes only use standard rice flour and do not used sweet or glutinous rice flour.",
    "Create the egg mixture.",
    "In a separate bowl, beat the eggs lightly with a whisk.",
    "Add the sugar and beat again.",
    "Add the melted butter and beat once more.",
    "Granulated sugar is used in most traditional recipes for bibingka, but for a slightly different taste, you could use brown sugar, instead.",
    "Add the flour and coconut milk.",
    "Alternate adding the flour mixture and coconut milk to the egg mixture, beating with a whisk after each addition.",
    "Only beat until the mixture is just blended, and avoid over-beating the batter.",
    "Pour the batter into the prepared pans.",
    "Divide the batter evenly amongst the four prepared pans, pouring it directly into the banana leaves.",
    "Traditionally, you should lay slices of salted egg on top of each cake before baking it.",
    "Duck eggs are the most traditional, but salted chicken eggs will also work.",
    "Bake the cakes.",
    "Place the cakes on the top rack of the oven and bake for 20 to 25 minutes, or until the cakes are cooked through.",
    "Check for doneness by inserting a toothpick into the center of each cake.",
    "If it comes out clean, then the cakes are fully cooked.",
    "Brown the tops.",
    "Switch the broiler on to low and broil the cakes for another 2 to 3 minutes, or until the top of each cake browns.",
    "Watch the cakes carefully during this time to prevent them from burning.",
    "Note that this step is only optional.",
    "It will have very little bearing on the taste of the cake, but it can create a more appealing appearance.",
    "Finish and serve the cakes.",
    "Remove the cakes from the oven and let cool for a few minutes.",
    "Brush them with additional melted butter, and if desired, sprinkle with additional sugar, grated coconut, and grated cheese.",
    "Serve while still warm.",
    "You could eat the cakes out of the ramekins you baked them in, but for a better presentation, you should slide them out of their baking dishes before adding the butter, sugar, coconut, and cheese.",
    "Carefully tip each ramekin onto its side and gently slide the cake and banana leaves out.",
    "Place each cake on an individual serving platter and enjoy.",
    "Modern Version Preheat the oven to 375 degrees Fahrenheit (190 degrees Celsius).",
    "Prepare a 13-inch by 18-inch by 1-inch (33-cm by 46-cm by 2.5-cm) baking sheet by lining it with parchment paper.",
    "Note that the modern version of this recipe does not use banana leaves like the traditional version uses.",
    "Combine the milks.",
    "In a large mixing bowl, combine the coconut milk, condensed milk, and melted butter using an electric mixer.",
    "Note that as you beat the ingredients together, in this step and in later steps, you should periodically scrape the sides of the bowl with a spatula to ensure that all of the ingredients are being mixed into the batter equally.",
    "Add the eggs.",
    "Add the eggs to the batter one at a time, beating after each addition until combined.",
    "Add the macapuno strings.",
    "Mix these coconut strings into the batter one can at a time.",
    "Beat after each addition to combine.",
    "Do not drain the syrup from the cans of macapuno.",
    "You should add the entire contents of the cans, syrup, coconut strings, and all.",
    "Gradually add the sweet rice flour.",
    "Add the rice flour to the batter in 1/2 cup (125 ml) amounts, beating well after each addition to combine.",
    "Do not add the mochiko flour all at once.",
    "If you do, the batter will become very clumpy, and you might not be able to smooth it out again even after prolonged beating.",
    "Add the remaining ingredients.",
    "Pour in the brown sugar and finely chopped almonds, then beat into an even consistency.",
    "When done, add the vanilla extract, and beat quickly to mix it into the rest of the batter.",
    "Pour the batter into the prepared baking sheet.",
    "Quickly inspect it to make sure that there are no air bubbles or lumps.",
    "If you notice any air bubbles, remove them by gently tapping the bottom of the pan against the counter.",
    "Cook until done.",
    "Bake the cake for roughly 45 minutes, or until it turns a light brown.",
    "Sprinkle a little cinnamon over the cake in an even pattern, then continue to bake it for another 2 to 15 minutes, or until it turns golden brown.",
    "The center of the cake should be set when it is ready to come out of the oven.",
    "Check the center by inserting a toothpick directly into the center of the cake.",
    "If it comes out clean, the cake is ready.",
    "Cool and serve the cake.",
    "Remove the cake from the oven.",
    "Lift the parchment paper off the baking sheet, lifting the cake with it, and allow the cake to cool on the parchment paper but off the baking sheet until it reaches room temperature.",
    "Cut the entire thing into 2-inch (5-cm) squares and serve.",
    "To make the cutting process easier, use a long, clean ruler and a pizza cutter.",
    "You can store the cooked bibingka in an airtight container for 1 to 2 days at room temperature.",
    "If refrigerated, you can store it for 1 to 2 weeks.",
    "The consistency of this version tends to get harder once the cake has completely cooled, so you might want to reheat it in the microwave for 20 to 30 seconds before enjoying.",
    "Gourmet Version Preheat the oven to 350 degrees Fahrenheit (180 degrees Celsius).",
    "Prepare a 13-inch by 9-inch (33-cm by 23-cm) baking pan by greasing it with butter, shortening, or nonstick cooking spray.",
    "Note that this version of the recipe does not require the use of banana leaves.",
    "Cream together the cream cheese and 2 cups (500 ml) sugar.",
    "Combine the two ingredients in a large bowl and beat them together with an electric mixer on low speed for roughly 30 seconds, or until thoroughly creamed together.",
    "Scrape the sides of the bowl to ensure that all the cream cheese and sugar have been blended in.",
    "Stir the eggs in.",
    "Add the eggs to the cream cheese mixture, stirring well enough to blend the egg in after each addition.",
    "Mix in the remaining ingredients.",
    "Add the baking powder, sweet rice flour, melted butter, vanilla, cream of coconut, milk, and crushed pineapple to the batter.",
    "Add them one at a time, stirring after each addition.",
    "When done, continue stirring until the batter is smooth.",
    "When adding the flour, you should mix it into the batter 1/2 cup (125 ml) at a time and stir after each addition.",
    "Doing so minimizes the risk of lumps forming in your batter.",
    "Pour the batter into your prepared pan.",
    "Once the batter is in the pan, sprinkle the top evenly with the brown sugar and an additional 2 Tbsp (30 ml) granulated sugar.",
    "Check the batter for lumps or air bubbles.",
    "Break up any lumps with a fork or spatula.",
    "Remove any air bubbles by gently tapping the bottom of the pan against the counter.",
    "Bake for 1 hour.",
    "The cake is done when the edges turn slightly crispy and the center is baked through.",
    "Check the center by inserting a toothpick into the cake.",
    "If it comes out clean, the cake is ready.",
    "Let the cake cool to room temperature in its pan.",
    "Serve warm.",
    "After the cake cools to room temperature, cut it into 12 to 24 even squares and remove those squares from the pan.",
    "Serve while still somewhat warm, or place the squares in an airtight container and serve later.",
    "If you plan on eating the cake in the next 1 to 2 days, you can store it at room temperature.",
    "To preserve the freshness of the cake for 1 to 2 weeks, place it in the refrigerator."
  ],
  "tyn_section":[
    "4 ramekins, 6 in (15.25 cm) or 4 oz (10 cm), ",
    "OR",
    " 8 in (20.3 cm) tart pan ",
    " 8 inch (20.3 cm) cake pan",
    "Whisk",
    "2 large mixing bowls",
    "Knife",
    "Oven",
    "Toothpick",
    "13-inch by 18-inch by 1-inch (33-cm by 46-cm by 2.5-cm) baking sheet",
    "Parchment paper",
    "Electric mixer",
    "Large mixing bowl",
    "Spatula",
    "13-inch by 9-inch (33-cm by 23-cm) baking pan",
    "Shortening or nonstick cooking spray",
    "Large bowl"
  ],
  "tyn_model":[
    "oven",
    "ramekins",
    "banana leaves",
    "eggs",
    "sugar",
    "rice flour",
    "baking sheet",
    "bowl",
    "butter",
    "brown sugar",
    "flour",
    "coconut milk",
    "toothpick",
    "cake",
    "parchment paper",
    "cream cheese",
    "tart pans",
    "baking pan",
    "baking powder",
    "whisk",
    "granulated sugar",
    "coconut",
    "melted butter",
    "electric mixer",
    "spatula",
    "coconut strings",
    "sweet rice flour",
    "airtight container",
    "tart pan",
    "ramekin-like miniature baking pans",
    "salt",
    "salted egg",
    "chicken eggs",
    "broiler",
    "grated cheese",
    "baking dishes",
    "cheese",
    "ramekin",
    "banana",
    "mixing bowl",
    "condensed milk",
    "macapuno strings",
    "macapuno",
    "syrup",
    "mochiko flour",
    "almonds",
    "vanilla extract",
    "pan",
    "cinnamon",
    "ruler",
    "pizza cutter",
    "microwave",
    "butter, shortening,",
    "nonstick cooking spray",
    "large bowl",
    "egg",
    "vanilla",
    "cream of coconut",
    "milk",
    "crushed pineapple",
    "fork",
    "refrigerator"
  ],
  "simple_metrics":{
    "r":0.4117647059,
    "p":0.1129032258,
    "f1":0.1772151899,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5294117647,
    "p":0.1612903226,
    "f1":0.2472527473
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5882352941,
    "p":0.1774193548,
    "f1":0.2726146221
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4705882353,
    "p":0.1290322581,
    "f1":0.2025316456
  }
}