{
  "title":"How to Make a Fat Origami Rabbit",
  "url":"https://www.wikihow.com/Make-a-Fat-Origami-Rabbit",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Get a piece of origami paper or cut a piece of printer or construction paper into a 5 inch by 5 inch (13cm) square.",
      "description":"Lay your paper down on a flat surface. If you have two-colored paper, the side facing down will be the outside of the rabbit."
    },
    {
      "headline":"Fold the paper diagonally, and crease the paper well.",
      "description":"Then, unfold it."
    },
    {
      "headline":"Fold, crease, and unfold the paper diagonally again, but this time the other way.",
      "description":""
    },
    {
      "headline":"Fold, crease, and unfold the paper horizontally",
      "description":""
    },
    {
      "headline":"Push the paper down in the middle, and pull the sides up a little so they're popping out a little.",
      "description":"Make the sides touch, and push down on the top."
    },
    {
      "headline":"Fold the edges of the first layer up to make a diamond.",
      "description":""
    },
    {
      "headline":"Take the sides of the diamond and fold them in so that the points are touching the center of the diamond.",
      "description":""
    },
    {
      "headline":"This is a bit tricky.",
      "description":"Take the triangles and push a bit on the side so there's a little \"pocket\". Then, take the top of the diamond and put it in the \"pocket\". Do this to both sides."
    },
    {
      "headline":"Flip over the paper.",
      "description":""
    },
    {
      "headline":"Fold the corners up to make a diamond.",
      "description":""
    },
    {
      "headline":"Flip the right flap of the diamond over so that it's laying on the left side of the diamond.",
      "description":""
    },
    {
      "headline":"Fold the point of the right side until it reaches the crease.",
      "description":""
    },
    {
      "headline":"Flip the right side back over to the right.",
      "description":""
    },
    {
      "headline":"Take the left flap and flip it to the right side.",
      "description":""
    },
    {
      "headline":"Take the point of the left flap and fold it until it reaches the center crease.",
      "description":""
    },
    {
      "headline":"Flip the left flap of the rabbit back over so you are on the same side you were on earlier.",
      "description":"The rabbit should be symmetrical."
    },
    {
      "headline":"Take the first layer and fold both sides until they touch the crease.",
      "description":""
    },
    {
      "headline":"Push open the first layers and push down the tops to make a triangle.",
      "description":""
    },
    {
      "headline":"Look at the front of the rabbit.",
      "description":"There should be a hole that looks in at the inside of the rabbit. Put your mouth on it and blow. This should inflate the rabbit."
    },
    {
      "headline":"Draw some eyes, whiskers, a nose, and a smile for your rabbit's face.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Get a piece of origami paper or cut a piece of printer or construction paper into a 5 inch by 5 inch (13cm) square. Lay your paper down on a flat surface. If you have two-colored paper, the side facing down will be the outside of the rabbit. Fold the paper diagonally, and crease the paper well. Then, unfold it. Fold, crease, and unfold the paper diagonally again, but this time the other way.  Fold, crease, and unfold the paper horizontally  Push the paper down in the middle, and pull the sides up a little so they're popping out a little. Make the sides touch, and push down on the top. Fold the edges of the first layer up to make a diamond.  Take the sides of the diamond and fold them in so that the points are touching the center of the diamond.  This is a bit tricky. Take the triangles and push a bit on the side so there's a little \"pocket\". Then, take the top of the diamond and put it in the \"pocket\". Do this to both sides. Flip over the paper.  Fold the corners up to make a diamond.  Flip the right flap of the diamond over so that it's laying on the left side of the diamond.  Fold the point of the right side until it reaches the crease.  Flip the right side back over to the right.  Take the left flap and flip it to the right side.  Take the point of the left flap and fold it until it reaches the center crease.  Flip the left flap of the rabbit back over so you are on the same side you were on earlier. The rabbit should be symmetrical. Take the first layer and fold both sides until they touch the crease.  Push open the first layers and push down the tops to make a triangle.  Look at the front of the rabbit. There should be a hole that looks in at the inside of the rabbit. Put your mouth on it and blow. This should inflate the rabbit. Draw some eyes, whiskers, a nose, and a smile for your rabbit's face.  Finished. ",
  "sentences":[
    " Get a piece of origami paper or cut a piece of printer or construction paper into a 5 inch by 5 inch (13cm) square.",
    "Lay your paper down on a flat surface.",
    "If you have two-colored paper, the side facing down will be the outside of the rabbit.",
    "Fold the paper diagonally, and crease the paper well.",
    "Then, unfold it.",
    "Fold, crease, and unfold the paper diagonally again, but this time the other way.",
    "Fold, crease, and unfold the paper horizontally  Push the paper down in the middle, and pull the sides up a little so they're popping out a little.",
    "Make the sides touch, and push down on the top.",
    "Fold the edges of the first layer up to make a diamond.",
    "Take the sides of the diamond and fold them in so that the points are touching the center of the diamond.",
    "This is a bit tricky.",
    "Take the triangles and push a bit on the side so there's a little \"pocket\".",
    "Then, take the top of the diamond and put it in the \"pocket\".",
    "Do this to both sides.",
    "Flip over the paper.",
    "Fold the corners up to make a diamond.",
    "Flip the right flap of the diamond over so that it's laying on the left side of the diamond.",
    "Fold the point of the right side until it reaches the crease.",
    "Flip the right side back over to the right.",
    "Take the left flap and flip it to the right side.",
    "Take the point of the left flap and fold it until it reaches the center crease.",
    "Flip the left flap of the rabbit back over so you are on the same side you were on earlier.",
    "The rabbit should be symmetrical.",
    "Take the first layer and fold both sides until they touch the crease.",
    "Push open the first layers and push down the tops to make a triangle.",
    "Look at the front of the rabbit.",
    "There should be a hole that looks in at the inside of the rabbit.",
    "Put your mouth on it and blow.",
    "This should inflate the rabbit.",
    "Draw some eyes, whiskers, a nose, and a smile for your rabbit's face.",
    "Finished."
  ],
  "tyn_section":[
    "Origami paper or a 5 by 5 piece of printer paper or construction paper",
    "A Sharpie permanent marker"
  ],
  "tyn_model":[
    "paper",
    "rabbit",
    "origami paper",
    "printer or construction paper",
    "triangles"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.2,
    "f1":0.2857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}