{
  "title":"How to Get the Real Megabuster on Deadrising",
  "url":"https://www.wikihow.com/Get-the-Real-Megabuster-on-Deadrising",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Dead Rising"
  ],
  "steps":[
    {
      "headline":"Head straight for the parking lot in Leisure Park.",
      "description":"Which is in the North West area of the park."
    },
    {
      "headline":"Take the red Sports Car from the parking lot and drive it into the tunnels.",
      "description":"Which will be just to the left."
    },
    {
      "headline":"Drive to the white/grey car.",
      "description":"First go right, then take the first left. Take the second right and follow the tunnel round the bend and head straight all the way to the end."
    },
    {
      "headline":"Take the white/grey car.",
      "description":""
    },
    {
      "headline":"Drive the white/grey car to the van.",
      "description":"Head straight back the way you came and back round the bend. Take the first left and then head right when you can. You will come to the entrance to the tunnels but just continue past and follow the tunnel all the way to the end."
    },
    {
      "headline":"Take the van.",
      "description":""
    },
    {
      "headline":"Drive the van back to either the red or white car.",
      "description":""
    },
    {
      "headline":"Repeat until you have the \"Zombie Genocider\" achievement for 53,594 kills.",
      "description":""
    },
    {
      "headline":"Play the rest of the game normally and get any ending- if you quit after getting the achievement, you will NOT be able to get the Megabuster.",
      "description":""
    },
    {
      "headline":"The Real Megabuster will now spawn in the Security Room.",
      "description":""
    }
  ],
  "text":" Head straight for the parking lot in Leisure Park. Which is in the North West area of the park. Take the red Sports Car from the parking lot and drive it into the tunnels. Which will be just to the left. Drive to the white/grey car. First go right, then take the first left. Take the second right and follow the tunnel round the bend and head straight all the way to the end. Take the white/grey car.  Drive the white/grey car to the van. Head straight back the way you came and back round the bend. Take the first left and then head right when you can. You will come to the entrance to the tunnels but just continue past and follow the tunnel all the way to the end. Take the van.  Drive the van back to either the red or white car.  Repeat until you have the \"Zombie Genocider\" achievement for 53,594 kills.  Play the rest of the game normally and get any ending- if you quit after getting the achievement, you will NOT be able to get the Megabuster.  The Real Megabuster will now spawn in the Security Room. ",
  "sentences":[
    " Head straight for the parking lot in Leisure Park.",
    "Which is in the North West area of the park.",
    "Take the red Sports Car from the parking lot and drive it into the tunnels.",
    "Which will be just to the left.",
    "Drive to the white/grey car.",
    "First go right, then take the first left.",
    "Take the second right and follow the tunnel round the bend and head straight all the way to the end.",
    "Take the white/grey car.",
    "Drive the white/grey car to the van.",
    "Head straight back the way you came and back round the bend.",
    "Take the first left and then head right when you can.",
    "You will come to the entrance to the tunnels but just continue past and follow the tunnel all the way to the end.",
    "Take the van.",
    "Drive the van back to either the red or white car.",
    "Repeat until you have the \"Zombie Genocider\" achievement for 53,594 kills.",
    "Play the rest of the game normally and get any ending- if you quit after getting the achievement, you will NOT be able to get the Megabuster.",
    "The Real Megabuster will now spawn in the Security Room."
  ],
  "tyn_section":[
    "Xbox 360 console",
    "Dead Rising",
    "4- 5 hours",
    "Xbox controller"
  ],
  "tyn_model":[
    "van",
    "megabuster",
    "leisure park",
    "sports car"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}