{
  "title":"How to Make Parsley Soup",
  "url":"https://www.wikihow.com/Make-Parsley-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "parts":[
    {
      "name":"Preparing the Parsley",
      "steps":[
        {
          "headline":"Boil a large saucepan of water.",
          "description":"Fill a 6 quart (6 L) saucepan approximately ¾ full with cold water, and place it on the stove. Set the heat to high, and allow the water to come to a full boil. The pot will boil more quickly if you place a lid on it."
        },
        {
          "headline":"Cook the parsley for 1 minute.",
          "description":"Once the water is boiling, place 1 pound (450 g) of fresh parsley in the pan. Allow the parsley to cook until the leaves become bright green and wilted. That should take approximately 30 seconds to 1 minute. Keep a careful eye on the parsley so you know when it’s done. If you cook it too long, you may dilute some of its flavor."
        },
        {
          "headline":"Drain the parsley and set it in cold water.",
          "description":"When the parsley is finished cooking, transfer it immediately to a colander to drain it. Next, place it in a bowl of ice cold water. Let it sit for approximately 1 minute to stop the cooking process. Drain it in the colander a final time to remove the water. While you’re draining the cold water from the parsley, it’s a good idea to give the leaves a squeeze with a towel or spin them in a salad spinner to ensure that you get rid of any excess moisture."
        },
        {
          "headline":"Chop the parsley.",
          "description":"When the parsley is dry, gather all of the leaves in a pile. Use a sharp knife to give them a rough chop. Be careful not to press on the parsley too hard with the knife or you may bruise the leaves. There’s no need to remove the stems from the parsley. The stems actually have a nice, sharp flavor that works well in the soup, and because it’s eventually pureed, the stems won’t ruin the texture of the soup either."
        }
      ]
    },
    {
      "name":"Combining the Garlic, Onion, Stock, and Cream",
      "steps":[
        {
          "headline":"Melt the butter in a saucepan.",
          "description":"Place a 4 quart (4 L) saucepan on the stove, and add 3 tablespoons (43 g) of unsalted butter. Turn the heat to medium, and allow the butter to warm until it melts completely, which should take approximately 3 to 5 minutes. Cutting the butter in pieces before you place it in the pan can help it melt more quickly. Make sure to stir the butter as it’s melting to ensure that it’s heating evenly."
        },
        {
          "headline":"Add the garlic, onions, salt and pepper and cook until the onions are soft.",
          "description":"Once the butter is fully melted, mix in 2 cloves of garlic that have been minced, 1 large yellow onion that’s been thinly sliced, and kosher salt and freshly ground black pepper to taste. Allow the mixture to cook on medium heat for approximately 6 minutes or until the onions are soft. Use a wooden spoon to stir the garlic and onions as you heat them to ensure that they cook evenly. Avoid browning the onions; you just want them to be tender, not caramelized."
        },
        {
          "headline":"Stir in the stock and heavy cream and simmer until the mixture thickens.",
          "description":"When the onions are soft, mix 4 cups (950 ml) of chicken stock and 1 cup (240 ml) of heavy cream into the pan. Bring the mixture to a simmer over medium low heat for approximately 15 to 20 minutes or until it thickens slightly. Stir the mixture occasionally to ensure that it doesn’t scorch on the bottom. If you want the soup to be vegetarian, you can substitute vegetable stock for the chicken stock."
        }
      ]
    },
    {
      "name":"Adding the Parsley to the Soup",
      "steps":[
        {
          "headline":"Mix the parsley into the pan, and cook until warmed.",
          "description":"After the chicken stock, cream, onion, and garlic mixture has thickened a bit, add the cooked parsley to the pan, along with additional salt and pepper to taste. Let the mixture cook on medium for approximately 5 minutes or until it is heated through."
        },
        {
          "headline":"Pour the soup into a blender and puree with the lemon juice.",
          "description":"Once the soup is warmed through, pour it from the pan into the pitcher of a blender. Add the juice from 1 lemon to the soup, and then puree the mixture until it is smooth. If you have a stick blender, you can puree the soup directly in the saucepan."
        },
        {
          "headline":"Strain the soup.",
          "description":"To ensure that the soup is as smooth as you’d like it, place a fine mesh sieve over the saucepan and strain it. Use a spoon to press the soup through to get rid of any lumps. If the soup has cooled at all during the pureeing and straining, you can return it to the stove and heat it on low again"
        },
        {
          "headline":"Place in bowls and serve.",
          "description":"When you’re happy with how smooth the soup is, give it a taste to see if you want to add any more salt and pepper. Next, pour the soup into bowls and serve. If you want to add a little spice to the soup, garnish it with freshly grated horseradish."
        }
      ]
    }
  ],
  "text":" Preparing the Parsley Boil a large saucepan of water. Fill a 6 quart (6 L) saucepan approximately ¾ full with cold water, and place it on the stove. Set the heat to high, and allow the water to come to a full boil. The pot will boil more quickly if you place a lid on it. Cook the parsley for 1 minute. Once the water is boiling, place 1 pound (450 g) of fresh parsley in the pan. Allow the parsley to cook until the leaves become bright green and wilted. That should take approximately 30 seconds to 1 minute. Keep a careful eye on the parsley so you know when it’s done. If you cook it too long, you may dilute some of its flavor. Drain the parsley and set it in cold water. When the parsley is finished cooking, transfer it immediately to a colander to drain it. Next, place it in a bowl of ice cold water. Let it sit for approximately 1 minute to stop the cooking process. Drain it in the colander a final time to remove the water. While you’re draining the cold water from the parsley, it’s a good idea to give the leaves a squeeze with a towel or spin them in a salad spinner to ensure that you get rid of any excess moisture. Chop the parsley. When the parsley is dry, gather all of the leaves in a pile. Use a sharp knife to give them a rough chop. Be careful not to press on the parsley too hard with the knife or you may bruise the leaves. There’s no need to remove the stems from the parsley. The stems actually have a nice, sharp flavor that works well in the soup, and because it’s eventually pureed, the stems won’t ruin the texture of the soup either. Combining the Garlic, Onion, Stock, and Cream Melt the butter in a saucepan. Place a 4 quart (4 L) saucepan on the stove, and add 3 tablespoons (43 g) of unsalted butter. Turn the heat to medium, and allow the butter to warm until it melts completely, which should take approximately 3 to 5 minutes. Cutting the butter in pieces before you place it in the pan can help it melt more quickly. Make sure to stir the butter as it’s melting to ensure that it’s heating evenly. Add the garlic, onions, salt and pepper and cook until the onions are soft. Once the butter is fully melted, mix in 2 cloves of garlic that have been minced, 1 large yellow onion that’s been thinly sliced, and kosher salt and freshly ground black pepper to taste. Allow the mixture to cook on medium heat for approximately 6 minutes or until the onions are soft. Use a wooden spoon to stir the garlic and onions as you heat them to ensure that they cook evenly. Avoid browning the onions; you just want them to be tender, not caramelized. Stir in the stock and heavy cream and simmer until the mixture thickens. When the onions are soft, mix 4 cups (950 ml) of chicken stock and 1 cup (240 ml) of heavy cream into the pan. Bring the mixture to a simmer over medium low heat for approximately 15 to 20 minutes or until it thickens slightly. Stir the mixture occasionally to ensure that it doesn’t scorch on the bottom. If you want the soup to be vegetarian, you can substitute vegetable stock for the chicken stock. Adding the Parsley to the Soup Mix the parsley into the pan, and cook until warmed. After the chicken stock, cream, onion, and garlic mixture has thickened a bit, add the cooked parsley to the pan, along with additional salt and pepper to taste. Let the mixture cook on medium for approximately 5 minutes or until it is heated through. Pour the soup into a blender and puree with the lemon juice. Once the soup is warmed through, pour it from the pan into the pitcher of a blender. Add the juice from 1 lemon to the soup, and then puree the mixture until it is smooth. If you have a stick blender, you can puree the soup directly in the saucepan. Strain the soup. To ensure that the soup is as smooth as you’d like it, place a fine mesh sieve over the saucepan and strain it. Use a spoon to press the soup through to get rid of any lumps. If the soup has cooled at all during the pureeing and straining, you can return it to the stove and heat it on low again Place in bowls and serve. When you’re happy with how smooth the soup is, give it a taste to see if you want to add any more salt and pepper. Next, pour the soup into bowls and serve. If you want to add a little spice to the soup, garnish it with freshly grated horseradish.",
  "sentences":[
    " Preparing the Parsley Boil a large saucepan of water.",
    "Fill a 6 quart (6 L) saucepan approximately ¾ full with cold water, and place it on the stove.",
    "Set the heat to high, and allow the water to come to a full boil.",
    "The pot will boil more quickly if you place a lid on it.",
    "Cook the parsley for 1 minute.",
    "Once the water is boiling, place 1 pound (450 g) of fresh parsley in the pan.",
    "Allow the parsley to cook until the leaves become bright green and wilted.",
    "That should take approximately 30 seconds to 1 minute.",
    "Keep a careful eye on the parsley so you know when it’s done.",
    "If you cook it too long, you may dilute some of its flavor.",
    "Drain the parsley and set it in cold water.",
    "When the parsley is finished cooking, transfer it immediately to a colander to drain it.",
    "Next, place it in a bowl of ice cold water.",
    "Let it sit for approximately 1 minute to stop the cooking process.",
    "Drain it in the colander a final time to remove the water.",
    "While you’re draining the cold water from the parsley, it’s a good idea to give the leaves a squeeze with a towel or spin them in a salad spinner to ensure that you get rid of any excess moisture.",
    "Chop the parsley.",
    "When the parsley is dry, gather all of the leaves in a pile.",
    "Use a sharp knife to give them a rough chop.",
    "Be careful not to press on the parsley too hard with the knife or you may bruise the leaves.",
    "There’s no need to remove the stems from the parsley.",
    "The stems actually have a nice, sharp flavor that works well in the soup, and because it’s eventually pureed, the stems won’t ruin the texture of the soup either.",
    "Combining the Garlic, Onion, Stock, and Cream Melt the butter in a saucepan.",
    "Place a 4 quart (4 L) saucepan on the stove, and add 3 tablespoons (43 g) of unsalted butter.",
    "Turn the heat to medium, and allow the butter to warm until it melts completely, which should take approximately 3 to 5 minutes.",
    "Cutting the butter in pieces before you place it in the pan can help it melt more quickly.",
    "Make sure to stir the butter as it’s melting to ensure that it’s heating evenly.",
    "Add the garlic, onions, salt and pepper and cook until the onions are soft.",
    "Once the butter is fully melted, mix in 2 cloves of garlic that have been minced, 1 large yellow onion that’s been thinly sliced, and kosher salt and freshly ground black pepper to taste.",
    "Allow the mixture to cook on medium heat for approximately 6 minutes or until the onions are soft.",
    "Use a wooden spoon to stir the garlic and onions as you heat them to ensure that they cook evenly.",
    "Avoid browning the onions; you just want them to be tender, not caramelized.",
    "Stir in the stock and heavy cream and simmer until the mixture thickens.",
    "When the onions are soft, mix 4 cups (950 ml) of chicken stock and 1 cup (240 ml) of heavy cream into the pan.",
    "Bring the mixture to a simmer over medium low heat for approximately 15 to 20 minutes or until it thickens slightly.",
    "Stir the mixture occasionally to ensure that it doesn’t scorch on the bottom.",
    "If you want the soup to be vegetarian, you can substitute vegetable stock for the chicken stock.",
    "Adding the Parsley to the Soup Mix the parsley into the pan, and cook until warmed.",
    "After the chicken stock, cream, onion, and garlic mixture has thickened a bit, add the cooked parsley to the pan, along with additional salt and pepper to taste.",
    "Let the mixture cook on medium for approximately 5 minutes or until it is heated through.",
    "Pour the soup into a blender and puree with the lemon juice.",
    "Once the soup is warmed through, pour it from the pan into the pitcher of a blender.",
    "Add the juice from 1 lemon to the soup, and then puree the mixture until it is smooth.",
    "If you have a stick blender, you can puree the soup directly in the saucepan.",
    "Strain the soup.",
    "To ensure that the soup is as smooth as you’d like it, place a fine mesh sieve over the saucepan and strain it.",
    "Use a spoon to press the soup through to get rid of any lumps.",
    "If the soup has cooled at all during the pureeing and straining, you can return it to the stove and heat it on low again Place in bowls and serve.",
    "When you’re happy with how smooth the soup is, give it a taste to see if you want to add any more salt and pepper.",
    "Next, pour the soup into bowls and serve.",
    "If you want to add a little spice to the soup, garnish it with freshly grated horseradish."
  ],
  "tyn_section":[
    "Chopping board and knife",
    "6 quart (6 L) saucepan",
    "Large bowl",
    "4 quart saucepan",
    "Wooden spoon",
    "Blender",
    "Sieve"
  ],
  "tyn_model":[
    "parsley",
    "water",
    "saucepan",
    "garlic",
    "butter",
    "stove",
    "chicken stock",
    "colander",
    "knife",
    "onion",
    "stock",
    "cream",
    "onions",
    "heavy cream",
    "salt and pepper",
    "blender",
    "lemon",
    "bowls",
    "large saucepan",
    "cold water",
    "pot",
    "bowl",
    "ice cold water",
    "salad spinner",
    "unsalted butter",
    "salt",
    "pepper",
    "kosher salt",
    "freshly ground black pepper",
    "wooden spoon",
    "vegetable stock",
    "stick blender",
    "fine mesh sieve",
    "spoon",
    "horseradish"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0571428571,
    "f1":0.0952380952,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4285714286,
    "p":0.1428571429,
    "f1":0.2142857143
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.2285714286,
    "f1":0.3463203463
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.0571428571,
    "f1":0.0952380952
  }
}