{
  "title":"How to Make Jolly Ranchers",
  "url":"https://www.wikihow.com/Make-Jolly-Ranchers",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Sugar Treats"
  ],
  "parts":[
    {
      "name":"Cooking the Candy",
      "steps":[
        {
          "headline":"Grease your cookie sheet with vegetable oil.",
          "description":"Set it close by the stovetop on a flat surface."
        },
        {
          "headline":"Place a heavy saucepan on your burner.",
          "description":"Add the granulated sugar, corn syrup and water. Turn the burner up to medium heat. If your burner runs cool, use medium high heat."
        },
        {
          "headline":"Clip your candy thermometer to your saucepan.",
          "description":"The tip should be submerged inside the syrup mixture."
        },
        {
          "headline":"Stir continuously.",
          "description":"The sugar mixture should reach boiling."
        },
        {
          "headline":"Keep the mixture boiling.",
          "description":"It should boil until it reaches 310 degrees Fahrenheit (154 Celsius). Be patient, since achieving this temperature can take a while. It is essential that the candy reach 300 to 310 degrees, which is considered “hard-crack.” At this point the sugar will change consistency."
        }
      ]
    },
    {
      "name":"Adding Flavoring",
      "steps":[
        {
          "headline":"Remove from the burner.",
          "description":"Hold on to the handle and keep stirring."
        },
        {
          "headline":"Pour in your flavor extract.",
          "description":"Jolly Rancher flavors include cherry, apple, lemon, watermelon, strawberry and grape, so you can make several batches to achieve a mixed bag of candies."
        },
        {
          "headline":"Add several drops of food coloring to match your flavor extract.",
          "description":"For example, green apple should be green, while cherry will be red."
        },
        {
          "headline":"Continue stirring until the boiling stops and the bubbles stop forming on the surface.",
          "description":"Your candy texture will be smoother thanks to the extra stirring; however, it should still be very hot when you pour it into your baking sheet."
        }
      ]
    },
    {
      "name":"Separating Candies",
      "steps":[
        {
          "headline":"Pour the hot candy into your greased baking sheet.",
          "description":"Let it cool on the flat surface until you can touch it lightly. Test it with your finger. It should be slightly firm but malleable."
        },
        {
          "headline":"Flip your pan onto a cutting board.",
          "description":"Try to do this in one swift motion so it doesn’t stretch"
        },
        {
          "headline":"Score the candy into rows every one-inch (2.5cm) with a knife.",
          "description":"Turn the cutting board 90 degrees and score it in the opposite direction every one-half inch (1.3cm). This will make rectangular Jolly Rancher candies."
        },
        {
          "headline":"Cut all the way through a second time.",
          "description":"Wrap each candy in wax paper or cellophane while it is still warm. Try to keep the candy separated and airtight so that it doesn’t absorb too much moisture from the air."
        }
      ]
    }
  ],
  "text":" Cooking the Candy Grease your cookie sheet with vegetable oil. Set it close by the stovetop on a flat surface. Place a heavy saucepan on your burner. Add the granulated sugar, corn syrup and water. Turn the burner up to medium heat. If your burner runs cool, use medium high heat. Clip your candy thermometer to your saucepan. The tip should be submerged inside the syrup mixture. Stir continuously. The sugar mixture should reach boiling. Keep the mixture boiling. It should boil until it reaches 310 degrees Fahrenheit (154 Celsius). Be patient, since achieving this temperature can take a while. It is essential that the candy reach 300 to 310 degrees, which is considered “hard-crack.” At this point the sugar will change consistency. Adding Flavoring Remove from the burner. Hold on to the handle and keep stirring. Pour in your flavor extract. Jolly Rancher flavors include cherry, apple, lemon, watermelon, strawberry and grape, so you can make several batches to achieve a mixed bag of candies. Add several drops of food coloring to match your flavor extract. For example, green apple should be green, while cherry will be red. Continue stirring until the boiling stops and the bubbles stop forming on the surface. Your candy texture will be smoother thanks to the extra stirring; however, it should still be very hot when you pour it into your baking sheet. Separating Candies Pour the hot candy into your greased baking sheet. Let it cool on the flat surface until you can touch it lightly. Test it with your finger. It should be slightly firm but malleable. Flip your pan onto a cutting board. Try to do this in one swift motion so it doesn’t stretch Score the candy into rows every one-inch (2.5cm) with a knife. Turn the cutting board 90 degrees and score it in the opposite direction every one-half inch (1.3cm). This will make rectangular Jolly Rancher candies. Cut all the way through a second time. Wrap each candy in wax paper or cellophane while it is still warm. Try to keep the candy separated and airtight so that it doesn’t absorb too much moisture from the air.",
  "sentences":[
    " Cooking the Candy Grease your cookie sheet with vegetable oil.",
    "Set it close by the stovetop on a flat surface.",
    "Place a heavy saucepan on your burner.",
    "Add the granulated sugar, corn syrup and water.",
    "Turn the burner up to medium heat.",
    "If your burner runs cool, use medium high heat.",
    "Clip your candy thermometer to your saucepan.",
    "The tip should be submerged inside the syrup mixture.",
    "Stir continuously.",
    "The sugar mixture should reach boiling.",
    "Keep the mixture boiling.",
    "It should boil until it reaches 310 degrees Fahrenheit (154 Celsius).",
    "Be patient, since achieving this temperature can take a while.",
    "It is essential that the candy reach 300 to 310 degrees, which is considered “hard-crack.” At this point the sugar will change consistency.",
    "Adding Flavoring Remove from the burner.",
    "Hold on to the handle and keep stirring.",
    "Pour in your flavor extract.",
    "Jolly Rancher flavors include cherry, apple, lemon, watermelon, strawberry and grape, so you can make several batches to achieve a mixed bag of candies.",
    "Add several drops of food coloring to match your flavor extract.",
    "For example, green apple should be green, while cherry will be red.",
    "Continue stirring until the boiling stops and the bubbles stop forming on the surface.",
    "Your candy texture will be smoother thanks to the extra stirring; however, it should still be very hot when you pour it into your baking sheet.",
    "Separating Candies Pour the hot candy into your greased baking sheet.",
    "Let it cool on the flat surface until you can touch it lightly.",
    "Test it with your finger.",
    "It should be slightly firm but malleable.",
    "Flip your pan onto a cutting board.",
    "Try to do this in one swift motion so it doesn’t stretch Score the candy into rows every one-inch (2.5cm) with a knife.",
    "Turn the cutting board 90 degrees and score it in the opposite direction every one-half inch (1.3cm).",
    "This will make rectangular Jolly Rancher candies.",
    "Cut all the way through a second time.",
    "Wrap each candy in wax paper or cellophane while it is still warm.",
    "Try to keep the candy separated and airtight so that it doesn’t absorb too much moisture from the air."
  ],
  "tyn_section":[
    "Candy thermometer",
    "Baking sheet with 1/2 inch (1.3cm) lip",
    "Vegetable oil",
    "Saucepan",
    "Metal spoon for stirring",
    "Wax paper/cellophane wrappers",
    "Knife",
    "Powdered sugar"
  ],
  "tyn_model":[
    "saucepan",
    "sugar",
    "baking sheet",
    "cutting board",
    "cookie sheet",
    "vegetable oil",
    "granulated sugar",
    "corn syrup",
    "water",
    "candy thermometer",
    "“hard",
    "” at",
    "burner",
    "jolly rancher",
    "lemon",
    "grape",
    "food coloring",
    "pan",
    "knife",
    "jolly rancher candies",
    "wax paper",
    "cellophane"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1818181818,
    "f1":0.2666666667,
    "avg_pos":0.4090909091
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.2272727273,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.2727272727,
    "f1":0.3797468354
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1818181818,
    "f1":0.2666666667
  }
}