{
  "title":"How to Make a Tree Out of Paper",
  "url":"https://www.wikihow.com/Make-a-Tree-Out-of-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft"
  ],
  "methods":[
    {
      "name":"Making a Cardstock Tree",
      "steps":[
        {
          "headline":"Fold a sheet of brown cardstock in half lengthwise and draw a tree.",
          "description":"Along the folded edge, draw the trunk and branches of half of a tree on the cardstock. You will need to create four cutouts of the same tree. You can make the trunk any size you would like. Be creative to create your tree's shape with branches in different directions."
        },
        {
          "headline":"Cut out the tree.",
          "description":"Cut the cardstock while it is folded to end up with a tree that is a mirror image of itself along the folded edge."
        },
        {
          "headline":"Trace your tree carefully three times.",
          "description":"Copy the tree shape onto three additional sheets of cardstock to create four identical trees."
        },
        {
          "headline":"Use scissors to cut out all four tree trunks and branches.",
          "description":"Make sure you cut exactly on the lines to end up with identical tree trunks."
        },
        {
          "headline":"Fold the trunks in half.",
          "description":"Use a ruler to draw a straight line up the middle of each tree trunk. Then, fold the trunks on the line to fold them in half. Fold all four trees in the same spot using the original tree that was folded as a guide."
        },
        {
          "headline":"Glue the trunks together.",
          "description":"Use a hot glue gun to glue two halves of the folded trunks together. Repeat this with the other two trunks. Then, glue the two sets together. Do not glue the branches, only the trunks, to allow the branches to look more natural in different directions. The trees will form a \"+\" shape with the folded edges coming together in the middle. The shape should provide stability to allow the tree to stand."
        },
        {
          "headline":"Cut leaves out.",
          "description":"Use lightweight paper to cut small leaves for the tree. Using multiple different shades of greens, reds, or yellows will give the tree depth. Fold a piece of paper into a small square. Draw a leaf shape onto the square. Use sharp scissors to cut out the leaf shape from all layers of the folded square to cut multiple leaves at one time. Make enough leaves to cover your tree. You can also use a leaf template to print pages of multiple leaves, and then cut them out individually."
        },
        {
          "headline":"Glue the leaves on the tree.",
          "description":"Use craft glue or a hot glue gun to attach the leaves onto the branches of your tree. Continue covering the tree with leaves until you reach your desired look."
        }
      ]
    },
    {
      "name":"Crafting a Growing Newspaper Tree",
      "steps":[
        {
          "headline":"Tape together newspaper pages.",
          "description":"Unfold six sheets of newspaper. Tape them together lengthwise to create one long sheet of newspaper."
        },
        {
          "headline":"Roll the newspaper into a tube.",
          "description":"Use a cardboard tube roll as a guide to roll the newspaper into a tube.."
        },
        {
          "headline":"Remove the cardboard tube.",
          "description":"Carefully pull the cardboard tube out of the middle of the newspaper roll. Don’t let the newspaper roll come undone while you do this."
        },
        {
          "headline":"Cut the top of the newspaper.",
          "description":"Hold the bottom of the newspaper tube in one hand, and use the other hand to cut the top of the newspaper. Use scissors to make a cut from the top of the newspaper tube down to around the middle of the roll. Turn the roll a quarter turn and make another identical cut. Repeat this two more times until you have 4 equal strips."
        },
        {
          "headline":"Bend the strips back.",
          "description":"Gently bend each of the strips away from the center so you can see the inside of the roll. Don’t make a folded crease, just bend them a little."
        },
        {
          "headline":"Make the tree grow.",
          "description":"Now it’s time to play with your tree and make it grow! Hold onto the base of the tube with one hand. Pinch the innermost layer of newspaper with your fingers and gently pull upwards on the newspaper inside the roll. The newspaper tree will start to grow taller as you pull the newspaper up. The cut strips will spread out like branches creating the look of a growing tree."
        }
      ]
    },
    {
      "name":"Creating an Old Tree from a Brown Paper Bag",
      "steps":[
        {
          "headline":"Make a horizontal line around the bag.",
          "description":"Lay the bag flat on a table. Use a ruler to make a mark on the brown bag four inches up from the bottom of the bag."
        },
        {
          "headline":"Cut down to the mark.",
          "description":"Use scissors to cut the top of the bag down to the mark you made on each of the four sides of the bag. Open the bag up to cut each of the four sides. You should end up with the top of the bag cut into four sections."
        },
        {
          "headline":"Twist the bag.",
          "description":"Twist the entire bag into one big twist. This will give the tree an aged look. Untwist the bag, and open the bag up again."
        },
        {
          "headline":"Make the trunk of the tree.",
          "description":"Twist the bottom of the bag at the mark you previously made. This should make the bag have the bottom open a bit, and be twisted tight at the mark you made."
        },
        {
          "headline":"Make the branches.",
          "description":"The four sections at the top of the bag will be the major branches of the tree. To create the branches, cut each of the four sections into thinner strips and twist each strip into a branch. Take the first section and twist it halfway up starting at the base of the section. Cut the end of the first section down to the twisted section. You can make one, two, or three cuts. Twist each new section. You can twist it all the way to the end, or stop halfway and make more cuts to twist. Continue until everything is twisted into a branch. Repeat this with all four main sections. Try to make each one slightly different."
        },
        {
          "headline":"Create the roots.",
          "description":"Use scissors to make four small snips around the base of the tree. Then, gently twist each section into four roots."
        },
        {
          "headline":"Add finished touches.",
          "description":"Stand your tree up to observe it. Make any needed tweaks to the branches to get the tree how you want it. You can cut leaves out and glue them on your tree if you’d like, but the brown bag tree looks great as is too."
        }
      ]
    }
  ],
  "text":" Making a Cardstock Tree Fold a sheet of brown cardstock in half lengthwise and draw a tree. Along the folded edge, draw the trunk and branches of half of a tree on the cardstock. You will need to create four cutouts of the same tree. You can make the trunk any size you would like. Be creative to create your tree's shape with branches in different directions. Cut out the tree. Cut the cardstock while it is folded to end up with a tree that is a mirror image of itself along the folded edge. Trace your tree carefully three times. Copy the tree shape onto three additional sheets of cardstock to create four identical trees. Use scissors to cut out all four tree trunks and branches. Make sure you cut exactly on the lines to end up with identical tree trunks. Fold the trunks in half. Use a ruler to draw a straight line up the middle of each tree trunk. Then, fold the trunks on the line to fold them in half. Fold all four trees in the same spot using the original tree that was folded as a guide. Glue the trunks together. Use a hot glue gun to glue two halves of the folded trunks together. Repeat this with the other two trunks. Then, glue the two sets together. Do not glue the branches, only the trunks, to allow the branches to look more natural in different directions. The trees will form a \"+\" shape with the folded edges coming together in the middle. The shape should provide stability to allow the tree to stand. Cut leaves out. Use lightweight paper to cut small leaves for the tree. Using multiple different shades of greens, reds, or yellows will give the tree depth. Fold a piece of paper into a small square. Draw a leaf shape onto the square. Use sharp scissors to cut out the leaf shape from all layers of the folded square to cut multiple leaves at one time. Make enough leaves to cover your tree. You can also use a leaf template to print pages of multiple leaves, and then cut them out individually. Glue the leaves on the tree. Use craft glue or a hot glue gun to attach the leaves onto the branches of your tree. Continue covering the tree with leaves until you reach your desired look. Crafting a Growing Newspaper Tree Tape together newspaper pages. Unfold six sheets of newspaper. Tape them together lengthwise to create one long sheet of newspaper. Roll the newspaper into a tube. Use a cardboard tube roll as a guide to roll the newspaper into a tube.. Remove the cardboard tube. Carefully pull the cardboard tube out of the middle of the newspaper roll. Don’t let the newspaper roll come undone while you do this. Cut the top of the newspaper. Hold the bottom of the newspaper tube in one hand, and use the other hand to cut the top of the newspaper. Use scissors to make a cut from the top of the newspaper tube down to around the middle of the roll. Turn the roll a quarter turn and make another identical cut. Repeat this two more times until you have 4 equal strips. Bend the strips back. Gently bend each of the strips away from the center so you can see the inside of the roll. Don’t make a folded crease, just bend them a little. Make the tree grow. Now it’s time to play with your tree and make it grow! Hold onto the base of the tube with one hand. Pinch the innermost layer of newspaper with your fingers and gently pull upwards on the newspaper inside the roll. The newspaper tree will start to grow taller as you pull the newspaper up. The cut strips will spread out like branches creating the look of a growing tree. Creating an Old Tree from a Brown Paper Bag Make a horizontal line around the bag. Lay the bag flat on a table. Use a ruler to make a mark on the brown bag four inches up from the bottom of the bag. Cut down to the mark. Use scissors to cut the top of the bag down to the mark you made on each of the four sides of the bag. Open the bag up to cut each of the four sides. You should end up with the top of the bag cut into four sections. Twist the bag. Twist the entire bag into one big twist. This will give the tree an aged look. Untwist the bag, and open the bag up again. Make the trunk of the tree. Twist the bottom of the bag at the mark you previously made. This should make the bag have the bottom open a bit, and be twisted tight at the mark you made. Make the branches. The four sections at the top of the bag will be the major branches of the tree. To create the branches, cut each of the four sections into thinner strips and twist each strip into a branch. Take the first section and twist it halfway up starting at the base of the section. Cut the end of the first section down to the twisted section. You can make one, two, or three cuts. Twist each new section. You can twist it all the way to the end, or stop halfway and make more cuts to twist. Continue until everything is twisted into a branch. Repeat this with all four main sections. Try to make each one slightly different. Create the roots. Use scissors to make four small snips around the base of the tree. Then, gently twist each section into four roots. Add finished touches. Stand your tree up to observe it. Make any needed tweaks to the branches to get the tree how you want it. You can cut leaves out and glue them on your tree if you’d like, but the brown bag tree looks great as is too.",
  "sentences":[
    " Making a Cardstock Tree Fold a sheet of brown cardstock in half lengthwise and draw a tree.",
    "Along the folded edge, draw the trunk and branches of half of a tree on the cardstock.",
    "You will need to create four cutouts of the same tree.",
    "You can make the trunk any size you would like.",
    "Be creative to create your tree's shape with branches in different directions.",
    "Cut out the tree.",
    "Cut the cardstock while it is folded to end up with a tree that is a mirror image of itself along the folded edge.",
    "Trace your tree carefully three times.",
    "Copy the tree shape onto three additional sheets of cardstock to create four identical trees.",
    "Use scissors to cut out all four tree trunks and branches.",
    "Make sure you cut exactly on the lines to end up with identical tree trunks.",
    "Fold the trunks in half.",
    "Use a ruler to draw a straight line up the middle of each tree trunk.",
    "Then, fold the trunks on the line to fold them in half.",
    "Fold all four trees in the same spot using the original tree that was folded as a guide.",
    "Glue the trunks together.",
    "Use a hot glue gun to glue two halves of the folded trunks together.",
    "Repeat this with the other two trunks.",
    "Then, glue the two sets together.",
    "Do not glue the branches, only the trunks, to allow the branches to look more natural in different directions.",
    "The trees will form a \"+\" shape with the folded edges coming together in the middle.",
    "The shape should provide stability to allow the tree to stand.",
    "Cut leaves out.",
    "Use lightweight paper to cut small leaves for the tree.",
    "Using multiple different shades of greens, reds, or yellows will give the tree depth.",
    "Fold a piece of paper into a small square.",
    "Draw a leaf shape onto the square.",
    "Use sharp scissors to cut out the leaf shape from all layers of the folded square to cut multiple leaves at one time.",
    "Make enough leaves to cover your tree.",
    "You can also use a leaf template to print pages of multiple leaves, and then cut them out individually.",
    "Glue the leaves on the tree.",
    "Use craft glue or a hot glue gun to attach the leaves onto the branches of your tree.",
    "Continue covering the tree with leaves until you reach your desired look.",
    "Crafting a Growing Newspaper Tree Tape together newspaper pages.",
    "Unfold six sheets of newspaper.",
    "Tape them together lengthwise to create one long sheet of newspaper.",
    "Roll the newspaper into a tube.",
    "Use a cardboard tube roll as a guide to roll the newspaper into a tube..",
    "Remove the cardboard tube.",
    "Carefully pull the cardboard tube out of the middle of the newspaper roll.",
    "Don’t let the newspaper roll come undone while you do this.",
    "Cut the top of the newspaper.",
    "Hold the bottom of the newspaper tube in one hand, and use the other hand to cut the top of the newspaper.",
    "Use scissors to make a cut from the top of the newspaper tube down to around the middle of the roll.",
    "Turn the roll a quarter turn and make another identical cut.",
    "Repeat this two more times until you have 4 equal strips.",
    "Bend the strips back.",
    "Gently bend each of the strips away from the center so you can see the inside of the roll.",
    "Don’t make a folded crease, just bend them a little.",
    "Make the tree grow.",
    "Now it’s time to play with your tree and make it grow!",
    "Hold onto the base of the tube with one hand.",
    "Pinch the innermost layer of newspaper with your fingers and gently pull upwards on the newspaper inside the roll.",
    "The newspaper tree will start to grow taller as you pull the newspaper up.",
    "The cut strips will spread out like branches creating the look of a growing tree.",
    "Creating an Old Tree from a Brown Paper Bag Make a horizontal line around the bag.",
    "Lay the bag flat on a table.",
    "Use a ruler to make a mark on the brown bag four inches up from the bottom of the bag.",
    "Cut down to the mark.",
    "Use scissors to cut the top of the bag down to the mark you made on each of the four sides of the bag.",
    "Open the bag up to cut each of the four sides.",
    "You should end up with the top of the bag cut into four sections.",
    "Twist the bag.",
    "Twist the entire bag into one big twist.",
    "This will give the tree an aged look.",
    "Untwist the bag, and open the bag up again.",
    "Make the trunk of the tree.",
    "Twist the bottom of the bag at the mark you previously made.",
    "This should make the bag have the bottom open a bit, and be twisted tight at the mark you made.",
    "Make the branches.",
    "The four sections at the top of the bag will be the major branches of the tree.",
    "To create the branches, cut each of the four sections into thinner strips and twist each strip into a branch.",
    "Take the first section and twist it halfway up starting at the base of the section.",
    "Cut the end of the first section down to the twisted section.",
    "You can make one, two, or three cuts.",
    "Twist each new section.",
    "You can twist it all the way to the end, or stop halfway and make more cuts to twist.",
    "Continue until everything is twisted into a branch.",
    "Repeat this with all four main sections.",
    "Try to make each one slightly different.",
    "Create the roots.",
    "Use scissors to make four small snips around the base of the tree.",
    "Then, gently twist each section into four roots.",
    "Add finished touches.",
    "Stand your tree up to observe it.",
    "Make any needed tweaks to the branches to get the tree how you want it.",
    "You can cut leaves out and glue them on your tree if you’d like, but the brown bag tree looks great as is too."
  ],
  "tyn_section":[
    "Cardstock Tree",
    "Brown cardstock",
    "Lightweight paper for leaves",
    "Hot glue gun",
    "Ruler",
    "Scissors",
    "Pen",
    "Newspaper Tree",
    "Newspaper",
    "Cardboard tube from a paper towel roll",
    "Tape",
    "Brown Bag Tree",
    "Brown paper bag",
    "Optional rock or other weight"
  ],
  "tyn_model":[
    "newspaper",
    "scissors",
    "bag",
    "cardstock",
    "glue",
    "cardboard",
    "ruler",
    "paper",
    "tree",
    "hot glue",
    "craft glue",
    "glue gun",
    "brown paper bag",
    "brown bag tree"
  ],
  "simple_metrics":{
    "r":0.3571428571,
    "p":0.3571428571,
    "f1":0.3571428571,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6428571429,
    "p":0.6428571429,
    "f1":0.6428571429
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6428571429,
    "p":0.8571428571,
    "f1":0.7346938776
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.5,
    "f1":0.4615384615
  }
}