{
  "title":"How to Draw a Vampire",
  "url":"https://www.wikihow.com/Draw-a-Vampire",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Fantasy Drawing",
    "Drawing Supernatural Characters"
  ],
  "methods":[
    {
      "name":"Cartoon Vampire",
      "steps":[
        {
          "headline":"Draw a circle for the head and attach a curved shape with a pointed angle below the circle.",
          "description":"Add a horizontal line on the center of the circle and sketch a curved vertical line close to the left side of the circle."
        },
        {
          "headline":"Draw an oblong below the shape you have drawn earlier.",
          "description":""
        },
        {
          "headline":"Draw a cape extending from the oblong down.",
          "description":""
        },
        {
          "headline":"Add an elaborate collar to the cape, make the edges look pointed.",
          "description":""
        },
        {
          "headline":"Draw an outline of the vampire’s body using a square.",
          "description":"Draw the vampire’s legs using long lines and draw a circle for the feet."
        },
        {
          "headline":"Add details to the face using the crossed lines you have drawn earlier as guide.",
          "description":"Draw the eyes using two egg-like shapes and add a slanted line across the eyes for the lids. Draw a small circle for the pupils and a curved line for the eyebrows. Draw the nose and the mouth. Add inverted small triangles for the vampire’s fangs."
        },
        {
          "headline":"Draw the vampire’s face and hair.",
          "description":"Add the ears, make the upper tip of the ear slightly pointed."
        },
        {
          "headline":"Refine the drawing of the cape using the outline.",
          "description":""
        },
        {
          "headline":"Draw the hands and add details to the vampire’s suit like adding buttons.",
          "description":""
        },
        {
          "headline":"Refine details on the vampire’s pants and shoes.",
          "description":""
        },
        {
          "headline":"Erase unnecessary lines.",
          "description":""
        },
        {
          "headline":"Color the drawing.",
          "description":""
        }
      ]
    },
    {
      "name":"Simple Vampire (Head)",
      "steps":[
        {
          "headline":"Draw a circle.",
          "description":"Add an elongated angular shape for the vampire’s jaw line. Add a crossed curved line close to the left side of the drawing extending through the jaws."
        },
        {
          "headline":"Draw two slanted lines for the neck and add a wide curved line for the shoulders.",
          "description":""
        },
        {
          "headline":"Draw the collar of the vampire’s cape using curved lines.",
          "description":"Make it look elaborate and pointed on each tip."
        },
        {
          "headline":"Using the crossed lines as guide, draw the vampire’s eyes and eyebrows.",
          "description":"Make it look more intense and mean by adding short lines in between the brows."
        },
        {
          "headline":"Draw the nose using small slanted strokes.",
          "description":"In this angle, the nose looks smaller than in the usual portrait poses."
        },
        {
          "headline":"Draw the vampire’s mouth.",
          "description":"Emphasize on their characteristic fangs when drawing the teeth."
        },
        {
          "headline":"Draw the outline of the vampire’s face.",
          "description":"Add the ears, making the upper tip pointed."
        },
        {
          "headline":"Draw the vampire’s hair using slanted and curved strokes.",
          "description":"Darken and add details to the vampire’s clothing like a bow tie or anything you want."
        },
        {
          "headline":"Erase unnecessary lines.",
          "description":"You can add long slanted strokes on areas usually darkened with shadow."
        },
        {
          "headline":"Color the drawing.",
          "description":""
        }
      ]
    },
    {
      "name":"Floating Vampire with Bat",
      "steps":[
        {
          "headline":"Draw the outline sketches for the head and the back.",
          "description":""
        },
        {
          "headline":"Add the outline sketches of the face.",
          "description":""
        },
        {
          "headline":"Draw the outline sketches for the cape.",
          "description":""
        },
        {
          "headline":"Draw the actual lines for the head.",
          "description":""
        },
        {
          "headline":"Add the actual lines for the cape.",
          "description":""
        },
        {
          "headline":"Add the outline sketches for the arms through the feet.",
          "description":""
        },
        {
          "headline":"Add the outline sketches for the bat.",
          "description":""
        },
        {
          "headline":"Draw the outline sketches for the bat’s bones.",
          "description":""
        },
        {
          "headline":"Draw the actual lines of the arms through the feet.",
          "description":""
        },
        {
          "headline":"Draw the actual lines for the wide ears of the bat.",
          "description":""
        },
        {
          "headline":"Add the actual lines for the face of the bat.",
          "description":"Bats should look fierce. The fangs should also show on the bat’s mouth."
        },
        {
          "headline":"Draw two curved lines as an initial sketch for the bat’s wings.",
          "description":""
        },
        {
          "headline":"Continue drawing the upper part of the wings.",
          "description":""
        },
        {
          "headline":"Add two thin curved lines to show a bit frame on the wings of the bat.",
          "description":""
        },
        {
          "headline":"Continue drawing the bat’s webbed wings.",
          "description":""
        },
        {
          "headline":"Add the shapes of the bones to add details on the wings.",
          "description":""
        },
        {
          "headline":"Draw the body and the feet of the bat.",
          "description":""
        },
        {
          "headline":"Erase the unnecessary lines.",
          "description":""
        },
        {
          "headline":"Fill in the basic colors.",
          "description":""
        },
        {
          "headline":"Add the highlights and shadows.",
          "description":""
        },
        {
          "headline":"Add a creepy background to finish the draft.",
          "description":"Make sure that the background is a little bit blurred to show an atmospheric effect. Both the vampire and the bat are floating so you don’t have to include the cast shadows on the drawing."
        }
      ]
    },
    {
      "name":"Close-Up Vampire with Bats",
      "steps":[
        {
          "headline":"Start with an egg-shaped outline sketch of the head.",
          "description":""
        },
        {
          "headline":"Add the outline sketches for the face.",
          "description":""
        },
        {
          "headline":"Draw the actual lines for the ears and the jawline.",
          "description":""
        },
        {
          "headline":"Add the brows.",
          "description":""
        },
        {
          "headline":"Draw the eyes and nose.",
          "description":""
        },
        {
          "headline":"Start drawing the mouth with the actual lines of the upper lip.",
          "description":""
        },
        {
          "headline":"Add the upper teeth and the fangs.",
          "description":""
        },
        {
          "headline":"Finish drawing the mouth by completing the teeth and the lower lip.",
          "description":""
        },
        {
          "headline":"Start drawing the hair from the middle top of the forehead.",
          "description":""
        },
        {
          "headline":"Finish drawing the hair.",
          "description":""
        },
        {
          "headline":"Draw outline sketches for the upper body.",
          "description":""
        },
        {
          "headline":"Draw the actual lines of the neck.",
          "description":""
        }
      ]
    }
  ],
  "text":" Cartoon Vampire Draw a circle for the head and attach a curved shape with a pointed angle below the circle. Add a horizontal line on the center of the circle and sketch a curved vertical line close to the left side of the circle. Draw an oblong below the shape you have drawn earlier.  Draw a cape extending from the oblong down.  Add an elaborate collar to the cape, make the edges look pointed.  Draw an outline of the vampire’s body using a square. Draw the vampire’s legs using long lines and draw a circle for the feet. Add details to the face using the crossed lines you have drawn earlier as guide. Draw the eyes using two egg-like shapes and add a slanted line across the eyes for the lids. Draw a small circle for the pupils and a curved line for the eyebrows. Draw the nose and the mouth. Add inverted small triangles for the vampire’s fangs. Draw the vampire’s face and hair. Add the ears, make the upper tip of the ear slightly pointed. Refine the drawing of the cape using the outline.  Draw the hands and add details to the vampire’s suit like adding buttons.  Refine details on the vampire’s pants and shoes.  Erase unnecessary lines.  Color the drawing.  Simple Vampire (Head) Draw a circle. Add an elongated angular shape for the vampire’s jaw line. Add a crossed curved line close to the left side of the drawing extending through the jaws. Draw two slanted lines for the neck and add a wide curved line for the shoulders.  Draw the collar of the vampire’s cape using curved lines. Make it look elaborate and pointed on each tip. Using the crossed lines as guide, draw the vampire’s eyes and eyebrows. Make it look more intense and mean by adding short lines in between the brows. Draw the nose using small slanted strokes. In this angle, the nose looks smaller than in the usual portrait poses. Draw the vampire’s mouth. Emphasize on their characteristic fangs when drawing the teeth. Draw the outline of the vampire’s face. Add the ears, making the upper tip pointed. Draw the vampire’s hair using slanted and curved strokes. Darken and add details to the vampire’s clothing like a bow tie or anything you want. Erase unnecessary lines. You can add long slanted strokes on areas usually darkened with shadow. Color the drawing.  Floating Vampire with Bat Draw the outline sketches for the head and the back.  Add the outline sketches of the face.  Draw the outline sketches for the cape.  Draw the actual lines for the head.  Add the actual lines for the cape.  Add the outline sketches for the arms through the feet.  Add the outline sketches for the bat.  Draw the outline sketches for the bat’s bones.  Draw the actual lines of the arms through the feet.  Draw the actual lines for the wide ears of the bat.  Add the actual lines for the face of the bat. Bats should look fierce. The fangs should also show on the bat’s mouth. Draw two curved lines as an initial sketch for the bat’s wings.  Continue drawing the upper part of the wings.  Add two thin curved lines to show a bit frame on the wings of the bat.  Continue drawing the bat’s webbed wings.  Add the shapes of the bones to add details on the wings.  Draw the body and the feet of the bat.  Erase the unnecessary lines.  Fill in the basic colors.  Add the highlights and shadows.  Add a creepy background to finish the draft. Make sure that the background is a little bit blurred to show an atmospheric effect. Both the vampire and the bat are floating so you don’t have to include the cast shadows on the drawing. Close-Up Vampire with Bats Start with an egg-shaped outline sketch of the head.  Add the outline sketches for the face.  Draw the actual lines for the ears and the jawline.  Add the brows.  Draw the eyes and nose.  Start drawing the mouth with the actual lines of the upper lip.  Add the upper teeth and the fangs.  Finish drawing the mouth by completing the teeth and the lower lip.  Start drawing the hair from the middle top of the forehead.  Finish drawing the hair.  Draw outline sketches for the upper body.  Draw the actual lines of the neck. ",
  "sentences":[
    " Cartoon Vampire Draw a circle for the head and attach a curved shape with a pointed angle below the circle.",
    "Add a horizontal line on the center of the circle and sketch a curved vertical line close to the left side of the circle.",
    "Draw an oblong below the shape you have drawn earlier.",
    "Draw a cape extending from the oblong down.",
    "Add an elaborate collar to the cape, make the edges look pointed.",
    "Draw an outline of the vampire’s body using a square.",
    "Draw the vampire’s legs using long lines and draw a circle for the feet.",
    "Add details to the face using the crossed lines you have drawn earlier as guide.",
    "Draw the eyes using two egg-like shapes and add a slanted line across the eyes for the lids.",
    "Draw a small circle for the pupils and a curved line for the eyebrows.",
    "Draw the nose and the mouth.",
    "Add inverted small triangles for the vampire’s fangs.",
    "Draw the vampire’s face and hair.",
    "Add the ears, make the upper tip of the ear slightly pointed.",
    "Refine the drawing of the cape using the outline.",
    "Draw the hands and add details to the vampire’s suit like adding buttons.",
    "Refine details on the vampire’s pants and shoes.",
    "Erase unnecessary lines.",
    "Color the drawing.",
    "Simple Vampire (Head) Draw a circle.",
    "Add an elongated angular shape for the vampire’s jaw line.",
    "Add a crossed curved line close to the left side of the drawing extending through the jaws.",
    "Draw two slanted lines for the neck and add a wide curved line for the shoulders.",
    "Draw the collar of the vampire’s cape using curved lines.",
    "Make it look elaborate and pointed on each tip.",
    "Using the crossed lines as guide, draw the vampire’s eyes and eyebrows.",
    "Make it look more intense and mean by adding short lines in between the brows.",
    "Draw the nose using small slanted strokes.",
    "In this angle, the nose looks smaller than in the usual portrait poses.",
    "Draw the vampire’s mouth.",
    "Emphasize on their characteristic fangs when drawing the teeth.",
    "Draw the outline of the vampire’s face.",
    "Add the ears, making the upper tip pointed.",
    "Draw the vampire’s hair using slanted and curved strokes.",
    "Darken and add details to the vampire’s clothing like a bow tie or anything you want.",
    "Erase unnecessary lines.",
    "You can add long slanted strokes on areas usually darkened with shadow.",
    "Color the drawing.",
    "Floating Vampire with Bat Draw the outline sketches for the head and the back.",
    "Add the outline sketches of the face.",
    "Draw the outline sketches for the cape.",
    "Draw the actual lines for the head.",
    "Add the actual lines for the cape.",
    "Add the outline sketches for the arms through the feet.",
    "Add the outline sketches for the bat.",
    "Draw the outline sketches for the bat’s bones.",
    "Draw the actual lines of the arms through the feet.",
    "Draw the actual lines for the wide ears of the bat.",
    "Add the actual lines for the face of the bat.",
    "Bats should look fierce.",
    "The fangs should also show on the bat’s mouth.",
    "Draw two curved lines as an initial sketch for the bat’s wings.",
    "Continue drawing the upper part of the wings.",
    "Add two thin curved lines to show a bit frame on the wings of the bat.",
    "Continue drawing the bat’s webbed wings.",
    "Add the shapes of the bones to add details on the wings.",
    "Draw the body and the feet of the bat.",
    "Erase the unnecessary lines.",
    "Fill in the basic colors.",
    "Add the highlights and shadows.",
    "Add a creepy background to finish the draft.",
    "Make sure that the background is a little bit blurred to show an atmospheric effect.",
    "Both the vampire and the bat are floating so you don’t have to include the cast shadows on the drawing.",
    "Close-Up Vampire with Bats Start with an egg-shaped outline sketch of the head.",
    "Add the outline sketches for the face.",
    "Draw the actual lines for the ears and the jawline.",
    "Add the brows.",
    "Draw the eyes and nose.",
    "Start drawing the mouth with the actual lines of the upper lip.",
    "Add the upper teeth and the fangs.",
    "Finish drawing the mouth by completing the teeth and the lower lip.",
    "Start drawing the hair from the middle top of the forehead.",
    "Finish drawing the hair.",
    "Draw outline sketches for the upper body.",
    "Draw the actual lines of the neck."
  ],
  "tyn_section":[
    "Paper",
    "Pencil",
    "Pencil sharpener",
    "Eraser gum",
    "Colored pencils, crayons, markers or watercolors"
  ],
  "tyn_model":[
    "bat",
    "cape",
    "vampire",
    "square",
    "eyebrows",
    "hair"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}