{
  "title":"How to Make Halo Halo",
  "url":"https://www.wikihow.com/Make-Halo-Halo",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk"
  ],
  "steps":[
    {
      "headline":"It is more fun to have the guests make their own halo-halo.",
      "description":"Line the ingredients in the order that you want to serve them with their own spoons, and provide small disposable spoons for the guests who want to try the more exotic ingredients first. There is no specific method to this. Purists like arranging the ingredients according to color, but it doesn't matter. It all ends up mixed anyway."
    },
    {
      "headline":"In a tall glass, add a teaspoon (or tablespoon) of each ingredient.",
      "description":"It's best to put the sweeter ingredients in the middle, but there's really no science to it. Try to put as much variety as you can until the glass is half full (or half empty). Add sugar if you like."
    },
    {
      "headline":"Scoop the ice into the glass until it comes up to the brim.",
      "description":"You might have to pack it in with your clean hands."
    },
    {
      "headline":"Drizzle with milk until the ice turns into the color of milk.",
      "description":""
    },
    {
      "headline":"Top with additional ingredients such as a slice of milk flan, a teaspoon of purple yam, and vanilla ice cream.",
      "description":"Sprinkle with a handful of the pounded rice or Rice Krispies."
    },
    {
      "headline":"Serve on a plate or a bowl with a flat bottom.",
      "description":"You will need it to avoid spillage."
    },
    {
      "headline":"Mix, mix, mix, mix, mix before you eat.",
      "description":"Dainty hands will not work. This is a messy dish that you have to work for. Enjoy the sound of crunching ice. Eat and then mix some more. You can even mix while you chew!"
    }
  ],
  "text":" It is more fun to have the guests make their own halo-halo. Line the ingredients in the order that you want to serve them with their own spoons, and provide small disposable spoons for the guests who want to try the more exotic ingredients first. There is no specific method to this. Purists like arranging the ingredients according to color, but it doesn't matter. It all ends up mixed anyway. In a tall glass, add a teaspoon (or tablespoon) of each ingredient. It's best to put the sweeter ingredients in the middle, but there's really no science to it. Try to put as much variety as you can until the glass is half full (or half empty). Add sugar if you like. Scoop the ice into the glass until it comes up to the brim. You might have to pack it in with your clean hands. Drizzle with milk until the ice turns into the color of milk.  Top with additional ingredients such as a slice of milk flan, a teaspoon of purple yam, and vanilla ice cream. Sprinkle with a handful of the pounded rice or Rice Krispies. Serve on a plate or a bowl with a flat bottom. You will need it to avoid spillage. Mix, mix, mix, mix, mix before you eat. Dainty hands will not work. This is a messy dish that you have to work for. Enjoy the sound of crunching ice. Eat and then mix some more. You can even mix while you chew!",
  "sentences":[
    " It is more fun to have the guests make their own halo-halo.",
    "Line the ingredients in the order that you want to serve them with their own spoons, and provide small disposable spoons for the guests who want to try the more exotic ingredients first.",
    "There is no specific method to this.",
    "Purists like arranging the ingredients according to color, but it doesn't matter.",
    "It all ends up mixed anyway.",
    "In a tall glass, add a teaspoon (or tablespoon) of each ingredient.",
    "It's best to put the sweeter ingredients in the middle, but there's really no science to it.",
    "Try to put as much variety as you can until the glass is half full (or half empty).",
    "Add sugar if you like.",
    "Scoop the ice into the glass until it comes up to the brim.",
    "You might have to pack it in with your clean hands.",
    "Drizzle with milk until the ice turns into the color of milk.",
    "Top with additional ingredients such as a slice of milk flan, a teaspoon of purple yam, and vanilla ice cream.",
    "Sprinkle with a handful of the pounded rice or Rice Krispies.",
    "Serve on a plate or a bowl with a flat bottom.",
    "You will need it to avoid spillage.",
    "Mix, mix, mix, mix, mix before you eat.",
    "Dainty hands will not work.",
    "This is a messy dish that you have to work for.",
    "Enjoy the sound of crunching ice.",
    "Eat and then mix some more.",
    "You can even mix while you chew!"
  ],
  "tyn_section":[
    "Ice cream scoop",
    "Tall glass",
    "Long teaspoon",
    "Small plate to set the glass on and serve",
    "Patience while mixing everything together"
  ],
  "tyn_model":[
    "ice",
    "spoons",
    "milk",
    "tall glass",
    "sugar",
    "glass",
    "milk flan",
    "purple yam",
    "vanilla ice cream",
    "pounded rice",
    "rice krispies",
    "plate",
    "bowl"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.0769230769,
    "f1":0.1111111111,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.2307692308,
    "f1":0.2926829268
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.3076923077,
    "f1":0.347826087
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.0769230769,
    "f1":0.1111111111
  }
}