{
  "title":"How to Make Spinach Soup",
  "url":"https://www.wikihow.com/Make-Spinach-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Making Creamy Spinach Soup",
      "steps":[
        {
          "headline":"Heat the oil in a large skillet over medium heat, then add the spinach and garlic.",
          "description":"Stir the spinach and garlic occasionally to help them cook more evenly and prevent them from burning. Cook until the spinach is wilted, about 2 to 3 minutes."
        },
        {
          "headline":"Puree the mixture in a blender or food processor with ¼ cup (60 milliliters) of hot water.",
          "description":"Once the spinach has wilted, transfer the mixture to a blender or food processor. Add some hot water and puree until it is smooth. If the spinach is not mixing smoothly enough, use a rubber spatula to scrape any unblended spinach down the sides and towards the bottom. Set the mixture aside when it is completely smooth."
        },
        {
          "headline":"Cook the onions in butter over medium heat in a saucepan until the onions start to soften.",
          "description":"Make sure that the saucepan is large enough to fit the rest of your ingredients, including the milk and pureed spinach."
        },
        {
          "headline":"Sift the flour into the mixture, and cook for another 2 minutes.",
          "description":"Occasionally stir the mixture with a spatula. You will end up with a roux-like paste, which you will eventually thin out. This will help create a thicker soup."
        },
        {
          "headline":"Pour in the milk, salt, and pepper, and cook over medium heat for 5 minutes, stirring constantly.",
          "description":"Use a whisk to help the roux dissolve and break up any clumps or lumps."
        },
        {
          "headline":"Add the pureed spinach and cook until it thickens, about 3 to 5 minutes.",
          "description":"Open up the blender or food processor, and pour the pureed spinach into the saucepan. Whisk everything together to combine, then cook until the soup thickens, stirring occasionally."
        },
        {
          "headline":"Taste the soup and make any necessary adjustments.",
          "description":"If you need to, add in some more salt, cayenne pepper, and/or black pepper."
        },
        {
          "headline":"Pour the soup into bowls and serve.",
          "description":"For extra flavor, garnish it with Gruyere cheese. You can also use other types of cheese as well."
        }
      ]
    },
    {
      "name":"Making Vegan Spinach Soup",
      "steps":[
        {
          "headline":"Sauté the onions with the olive oil in a saucepan over medium heat.",
          "description":"Pour the olive oil into a large saucepan and heat it over medium heat. Add the onions and sauté them until they turn soft, about 3 minutes."
        },
        {
          "headline":"Add the garlic and cook for 30 seconds.",
          "description":"Peel the garlic first, then mince it as finely as possible. Add it to the saucepan, and cook it for 30 seconds, stirring occasionally."
        },
        {
          "headline":"Pour in the vegetable stock and the potatoes, then simmer until the potatoes become soft and tender.",
          "description":"Peel the potatoes, then cut them into small chunks; this will help them cook faster. The potatoes need to be soft and tender, almost falling apart. Depending on how small you cut the potatoes, this should take between 10 and 15 minutes. For a thinner soup, use 3 cups (700 milliliters) of vegetable stock. For a thicker soup, use 2 cups (475 milliliters) of vegetable stock."
        },
        {
          "headline":"Add the spinach and cook for 2 minutes.",
          "description":"Don't worry about chopping the spinach just yet. You will be pureeing everything later on."
        },
        {
          "headline":"Add the lemon juice, cayenne pepper, and salt.",
          "description":"Stir everything together to combine. Try to use fresh lemon juice, if you can, for best taste."
        },
        {
          "headline":"Puree until smooth in a blender or food processor.",
          "description":"Transfer the soup into a blender or food processor, and puree until everything is smooth. If the ingredients are not blending smoothly, use a rubber spatula to push down any unblended soup down towards the bottom. There should be no lumps, clumps, or chunks."
        },
        {
          "headline":"Adjust the seasonings, if necessary.",
          "description":"Once the soup is smooth, give it a quick taste. If you need to, add some more salt or cayenne pepper, and stir to combine."
        },
        {
          "headline":"Pour the soup into bowls and serve it.",
          "description":"The soup will taste the best while it is still hot, but you can also serve it chilled as well."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Creamy Spinach Soup Heat the oil in a large skillet over medium heat, then add the spinach and garlic. Stir the spinach and garlic occasionally to help them cook more evenly and prevent them from burning. Cook until the spinach is wilted, about 2 to 3 minutes. Puree the mixture in a blender or food processor with ¼ cup (60 milliliters) of hot water. Once the spinach has wilted, transfer the mixture to a blender or food processor. Add some hot water and puree until it is smooth. If the spinach is not mixing smoothly enough, use a rubber spatula to scrape any unblended spinach down the sides and towards the bottom. Set the mixture aside when it is completely smooth. Cook the onions in butter over medium heat in a saucepan until the onions start to soften. Make sure that the saucepan is large enough to fit the rest of your ingredients, including the milk and pureed spinach. Sift the flour into the mixture, and cook for another 2 minutes. Occasionally stir the mixture with a spatula. You will end up with a roux-like paste, which you will eventually thin out. This will help create a thicker soup. Pour in the milk, salt, and pepper, and cook over medium heat for 5 minutes, stirring constantly. Use a whisk to help the roux dissolve and break up any clumps or lumps. Add the pureed spinach and cook until it thickens, about 3 to 5 minutes. Open up the blender or food processor, and pour the pureed spinach into the saucepan. Whisk everything together to combine, then cook until the soup thickens, stirring occasionally. Taste the soup and make any necessary adjustments. If you need to, add in some more salt, cayenne pepper, and/or black pepper. Pour the soup into bowls and serve. For extra flavor, garnish it with Gruyere cheese. You can also use other types of cheese as well. Making Vegan Spinach Soup Sauté the onions with the olive oil in a saucepan over medium heat. Pour the olive oil into a large saucepan and heat it over medium heat. Add the onions and sauté them until they turn soft, about 3 minutes. Add the garlic and cook for 30 seconds. Peel the garlic first, then mince it as finely as possible. Add it to the saucepan, and cook it for 30 seconds, stirring occasionally. Pour in the vegetable stock and the potatoes, then simmer until the potatoes become soft and tender. Peel the potatoes, then cut them into small chunks; this will help them cook faster. The potatoes need to be soft and tender, almost falling apart. Depending on how small you cut the potatoes, this should take between 10 and 15 minutes. For a thinner soup, use 3 cups (700 milliliters) of vegetable stock. For a thicker soup, use 2 cups (475 milliliters) of vegetable stock. Add the spinach and cook for 2 minutes. Don't worry about chopping the spinach just yet. You will be pureeing everything later on. Add the lemon juice, cayenne pepper, and salt. Stir everything together to combine. Try to use fresh lemon juice, if you can, for best taste. Puree until smooth in a blender or food processor. Transfer the soup into a blender or food processor, and puree until everything is smooth. If the ingredients are not blending smoothly, use a rubber spatula to push down any unblended soup down towards the bottom. There should be no lumps, clumps, or chunks. Adjust the seasonings, if necessary. Once the soup is smooth, give it a quick taste. If you need to, add some more salt or cayenne pepper, and stir to combine. Pour the soup into bowls and serve it. The soup will taste the best while it is still hot, but you can also serve it chilled as well. Finished. ",
  "sentences":[
    " Making Creamy Spinach Soup Heat the oil in a large skillet over medium heat, then add the spinach and garlic.",
    "Stir the spinach and garlic occasionally to help them cook more evenly and prevent them from burning.",
    "Cook until the spinach is wilted, about 2 to 3 minutes.",
    "Puree the mixture in a blender or food processor with ¼ cup (60 milliliters) of hot water.",
    "Once the spinach has wilted, transfer the mixture to a blender or food processor.",
    "Add some hot water and puree until it is smooth.",
    "If the spinach is not mixing smoothly enough, use a rubber spatula to scrape any unblended spinach down the sides and towards the bottom.",
    "Set the mixture aside when it is completely smooth.",
    "Cook the onions in butter over medium heat in a saucepan until the onions start to soften.",
    "Make sure that the saucepan is large enough to fit the rest of your ingredients, including the milk and pureed spinach.",
    "Sift the flour into the mixture, and cook for another 2 minutes.",
    "Occasionally stir the mixture with a spatula.",
    "You will end up with a roux-like paste, which you will eventually thin out.",
    "This will help create a thicker soup.",
    "Pour in the milk, salt, and pepper, and cook over medium heat for 5 minutes, stirring constantly.",
    "Use a whisk to help the roux dissolve and break up any clumps or lumps.",
    "Add the pureed spinach and cook until it thickens, about 3 to 5 minutes.",
    "Open up the blender or food processor, and pour the pureed spinach into the saucepan.",
    "Whisk everything together to combine, then cook until the soup thickens, stirring occasionally.",
    "Taste the soup and make any necessary adjustments.",
    "If you need to, add in some more salt, cayenne pepper, and/or black pepper.",
    "Pour the soup into bowls and serve.",
    "For extra flavor, garnish it with Gruyere cheese.",
    "You can also use other types of cheese as well.",
    "Making Vegan Spinach Soup Sauté the onions with the olive oil in a saucepan over medium heat.",
    "Pour the olive oil into a large saucepan and heat it over medium heat.",
    "Add the onions and sauté them until they turn soft, about 3 minutes.",
    "Add the garlic and cook for 30 seconds.",
    "Peel the garlic first, then mince it as finely as possible.",
    "Add it to the saucepan, and cook it for 30 seconds, stirring occasionally.",
    "Pour in the vegetable stock and the potatoes, then simmer until the potatoes become soft and tender.",
    "Peel the potatoes, then cut them into small chunks; this will help them cook faster.",
    "The potatoes need to be soft and tender, almost falling apart.",
    "Depending on how small you cut the potatoes, this should take between 10 and 15 minutes.",
    "For a thinner soup, use 3 cups (700 milliliters) of vegetable stock.",
    "For a thicker soup, use 2 cups (475 milliliters) of vegetable stock.",
    "Add the spinach and cook for 2 minutes.",
    "Don't worry about chopping the spinach just yet.",
    "You will be pureeing everything later on.",
    "Add the lemon juice, cayenne pepper, and salt.",
    "Stir everything together to combine.",
    "Try to use fresh lemon juice, if you can, for best taste.",
    "Puree until smooth in a blender or food processor.",
    "Transfer the soup into a blender or food processor, and puree until everything is smooth.",
    "If the ingredients are not blending smoothly, use a rubber spatula to push down any unblended soup down towards the bottom.",
    "There should be no lumps, clumps, or chunks.",
    "Adjust the seasonings, if necessary.",
    "Once the soup is smooth, give it a quick taste.",
    "If you need to, add some more salt or cayenne pepper, and stir to combine.",
    "Pour the soup into bowls and serve it.",
    "The soup will taste the best while it is still hot, but you can also serve it chilled as well.",
    "Finished."
  ],
  "tyn_section":[
    "Creamy Spinach Soup",
    "Skillet",
    "Blender or food processor",
    "Rubber spatula",
    "Large saucepan",
    "Whisk",
    "Vegan Spinach Soup"
  ],
  "tyn_model":[
    "spinach",
    "blender",
    "food processor",
    "saucepan",
    "potatoes",
    "garlic",
    "onions",
    "salt",
    "vegetable stock",
    "hot water",
    "rubber spatula",
    "milk",
    "pepper",
    "cayenne pepper",
    "olive oil",
    "lemon",
    "oil",
    "large skillet",
    "butter",
    "flour",
    "spatula",
    "whisk",
    "black pepper",
    "gruyere cheese",
    "large saucepan",
    "cayenne",
    "seasonings",
    "bowls"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.1071428571,
    "f1":0.1714285714,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.25,
    "f1":0.3703703704
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2857142857,
    "f1":0.4444444444
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.1071428571,
    "f1":0.1714285714
  }
}