{
  "title":"How to Make Iced Tea",
  "url":"https://www.wikihow.com/Make-Iced-Tea",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Tea",
    "Iced Tea"
  ],
  "methods":[
    {
      "name":"Simple Black Iced Tea",
      "steps":[
        {
          "headline":"Bring 2 cups (480 ml) of water to a rapid boil.",
          "description":"You can boil the water in a small pan or a pot."
        },
        {
          "headline":"Turn off the heat.",
          "description":""
        },
        {
          "headline":"Add 3-5 bags of your favorite black tea.",
          "description":"Ceylon and Keemun teas can work best because they won't turn cloudy when they're left to stand. You can even choose a special tea blend that is made specifically for iced tea."
        },
        {
          "headline":"Leave the teabags in the hot water for 5 minutes.",
          "description":"Any longer than that and the tea will be too bitter. If you leave them in for less time than that, then the tea will be too weak. This will be a very strong mixture of tea -- you'll dilute it with water momentarily. Remove the tea bags after the time has passed."
        },
        {
          "headline":"Pour the tea into a pitcher.",
          "description":"Wait 5-10 minutes for it to cool down."
        },
        {
          "headline":"Pour 2 cups (480 ml) of cold water into the tea.",
          "description":"This will dilute the tea and will make the mixture less strong. You can stir the mixture for best results."
        },
        {
          "headline":"Refrigerate the mixture until it's chilled.",
          "description":"This should take 2-3 hours."
        },
        {
          "headline":"Serve the tea.",
          "description":"Pour the tea into a tall glass that is filled with ice. Squeeze a slice of lemon into the tea and add a sprig of mint to the top. If you'd like to add sugar, start by stirring in half a teaspoon and add more to taste."
        }
      ]
    },
    {
      "name":"Fruity Iced Tea",
      "steps":[
        {
          "headline":"Make strong black tea.",
          "description":"Use the same method you would use to make simple iced tea: just boil 2 cups of water, steep 3-5 tea bags in it for 5 minutes, pour 2 cups of water into the mix, and add sugar or lemon to taste. Pour this mixture into a pitcher."
        },
        {
          "headline":"Refrigerate to chill.",
          "description":"Leave the tea in the fridge for 2-3 hours."
        },
        {
          "headline":"Add 1/2 cup of sugar syrup.",
          "description":"Stir this into the mixture -- if it's not sweet enough, add more of the syrup."
        },
        {
          "headline":"Fill 1 cup with slivers of fresh fruit.",
          "description":"Dice peaches, pineapples, strawberries, raspberries, and apples until they fit into 1 cup. You can sprinkle them with a bit of lemon juice."
        },
        {
          "headline":"Add the cup to the tea mixture.",
          "description":"Stir it around until the fruit mixes in with the black tea and floats evenly in the pitcher."
        },
        {
          "headline":"Serve the tea.",
          "description":"Pour the tea into a glass filled with ice. Add a sprig of mint to the top."
        }
      ]
    },
    {
      "name":"Strawberry Iced Tea",
      "steps":[
        {
          "headline":"Pour 2 quarts/1.8 liters (0.5 US gal) of hot black tea tea into a ceramic or glass mixing bowl.",
          "description":""
        },
        {
          "headline":"Add the 1/3 cups of superfine (caster) sugar to the tea.",
          "description":"Stir thoroughly to dissolve the sugar."
        },
        {
          "headline":"Add 1/2 cups of freshly squeezed lemon juice.",
          "description":"Test to see if it requires additional sweetening or lemon juice and adjust accordingly. Then, set it aside to cool."
        },
        {
          "headline":"Puree 31 oz/900g strawberries.",
          "description":"Push the puree through a fine-sieve to remove the pips. Press on the mixture with the back of a wooden spoon."
        },
        {
          "headline":"Once the tea has cooled, add the puree and mix.",
          "description":"Mix thoroughly. Pour the mixture into a pitcher."
        },
        {
          "headline":"Refrigerate for 30 minutes.",
          "description":"Let this mixture cool off and settle together for thirty minutes or longer."
        },
        {
          "headline":"Serve.",
          "description":"Fill a glass with ice and pour the tea into it. Add a few strawberries -- whole or sliced -- to the side of the glass as a garnish."
        }
      ]
    },
    {
      "name":"Vanilla Iced Green Tea",
      "steps":[
        {
          "headline":"Brew 4 rounded teaspoons of Sencha tea in 1 liter/33 fl oz of hot water.",
          "description":"Let the tea infuse for 1-2 minutes."
        },
        {
          "headline":"Strain the tea into a jug or pitcher.",
          "description":""
        },
        {
          "headline":"Add 1 tablespoon of freshly squeezed lemon juice.",
          "description":"Stir well."
        },
        {
          "headline":"Add 1 tablespoon of honey.",
          "description":"Stir well."
        },
        {
          "headline":"Stir the ingredients together.",
          "description":"Stir the tea until it's evenly blended."
        },
        {
          "headline":"Serve the tea with a scoop of vanilla ice cream.",
          "description":"Add one scoop of vanilla ice cream to each glass and finish by pouring the chilled green tea over the top. This tea can be served as a dessert."
        }
      ]
    },
    {
      "name":"Other Variations of Iced Tea",
      "steps":[
        {
          "headline":"Make sweet tea.",
          "description":"This version is especially suitable for sweet-tooths and outdoor grilling in the Southern United States. Sugar never dissolves completely in cold tea. To make this variation of tea, you can follow the recipe for making simple black iced tea, except you should add 1 cup of simple syrup for every 2 cups of water of the finished iced tea mixture. If that doesn't taste sweet enough, just add more. This tea tastes excellent when it's garnished with mint."
        },
        {
          "headline":"Make lemon iced tea.",
          "description":"To make this citrus-flavored tea, begin by making ordinary black tea by boiling 2 cups of water, steeping 3-5 tea bags in it for 5 minutes, and pouring 2 cups of water into the mix. Then, squeeze the juice from a lemon to fill 1/2 a cup with lemon juice. Stir this into the cooled mix. If that's not lemony enough, just add a bit more. Serve this tea over ice with sugar to taste and a sprig of mint."
        },
        {
          "headline":"Make vanilla iced tea.",
          "description":"Brew 2 cups of ordinary black tea. Let the tea cool down and add 1 cup of cold water; some ice cubes are fine too. Add 2 teaspoons of vanilla essence (extract). Serve with a spoonful of vanilla ice-cream."
        }
      ]
    }
  ],
  "text":" Simple Black Iced Tea Bring 2 cups (480 ml) of water to a rapid boil. You can boil the water in a small pan or a pot. Turn off the heat.  Add 3-5 bags of your favorite black tea. Ceylon and Keemun teas can work best because they won't turn cloudy when they're left to stand. You can even choose a special tea blend that is made specifically for iced tea. Leave the teabags in the hot water for 5 minutes. Any longer than that and the tea will be too bitter. If you leave them in for less time than that, then the tea will be too weak. This will be a very strong mixture of tea -- you'll dilute it with water momentarily. Remove the tea bags after the time has passed. Pour the tea into a pitcher. Wait 5-10 minutes for it to cool down. Pour 2 cups (480 ml) of cold water into the tea. This will dilute the tea and will make the mixture less strong. You can stir the mixture for best results. Refrigerate the mixture until it's chilled. This should take 2-3 hours. Serve the tea. Pour the tea into a tall glass that is filled with ice. Squeeze a slice of lemon into the tea and add a sprig of mint to the top. If you'd like to add sugar, start by stirring in half a teaspoon and add more to taste. Fruity Iced Tea Make strong black tea. Use the same method you would use to make simple iced tea: just boil 2 cups of water, steep 3-5 tea bags in it for 5 minutes, pour 2 cups of water into the mix, and add sugar or lemon to taste. Pour this mixture into a pitcher. Refrigerate to chill. Leave the tea in the fridge for 2-3 hours. Add 1/2 cup of sugar syrup. Stir this into the mixture -- if it's not sweet enough, add more of the syrup. Fill 1 cup with slivers of fresh fruit. Dice peaches, pineapples, strawberries, raspberries, and apples until they fit into 1 cup. You can sprinkle them with a bit of lemon juice. Add the cup to the tea mixture. Stir it around until the fruit mixes in with the black tea and floats evenly in the pitcher. Serve the tea. Pour the tea into a glass filled with ice. Add a sprig of mint to the top. Strawberry Iced Tea Pour 2 quarts/1.8 liters (0.5 US gal) of hot black tea tea into a ceramic or glass mixing bowl.  Add the 1/3 cups of superfine (caster) sugar to the tea. Stir thoroughly to dissolve the sugar. Add 1/2 cups of freshly squeezed lemon juice. Test to see if it requires additional sweetening or lemon juice and adjust accordingly. Then, set it aside to cool. Puree 31 oz/900g strawberries. Push the puree through a fine-sieve to remove the pips. Press on the mixture with the back of a wooden spoon. Once the tea has cooled, add the puree and mix. Mix thoroughly. Pour the mixture into a pitcher. Refrigerate for 30 minutes. Let this mixture cool off and settle together for thirty minutes or longer. Serve. Fill a glass with ice and pour the tea into it. Add a few strawberries -- whole or sliced -- to the side of the glass as a garnish. Vanilla Iced Green Tea Brew 4 rounded teaspoons of Sencha tea in 1 liter/33 fl oz of hot water. Let the tea infuse for 1-2 minutes. Strain the tea into a jug or pitcher.  Add 1 tablespoon of freshly squeezed lemon juice. Stir well. Add 1 tablespoon of honey. Stir well. Stir the ingredients together. Stir the tea until it's evenly blended. Serve the tea with a scoop of vanilla ice cream. Add one scoop of vanilla ice cream to each glass and finish by pouring the chilled green tea over the top. This tea can be served as a dessert. Other Variations of Iced Tea Make sweet tea. This version is especially suitable for sweet-tooths and outdoor grilling in the Southern United States. Sugar never dissolves completely in cold tea. To make this variation of tea, you can follow the recipe for making simple black iced tea, except you should add 1 cup of simple syrup for every 2 cups of water of the finished iced tea mixture. If that doesn't taste sweet enough, just add more. This tea tastes excellent when it's garnished with mint. Make lemon iced tea. To make this citrus-flavored tea, begin by making ordinary black tea by boiling 2 cups of water, steeping 3-5 tea bags in it for 5 minutes, and pouring 2 cups of water into the mix. Then, squeeze the juice from a lemon to fill 1/2 a cup with lemon juice. Stir this into the cooled mix. If that's not lemony enough, just add a bit more. Serve this tea over ice with sugar to taste and a sprig of mint. Make vanilla iced tea. Brew 2 cups of ordinary black tea. Let the tea cool down and add 1 cup of cold water; some ice cubes are fine too. Add 2 teaspoons of vanilla essence (extract). Serve with a spoonful of vanilla ice-cream.",
  "sentences":[
    " Simple Black Iced Tea Bring 2 cups (480 ml) of water to a rapid boil.",
    "You can boil the water in a small pan or a pot.",
    "Turn off the heat.",
    "Add 3-5 bags of your favorite black tea.",
    "Ceylon and Keemun teas can work best because they won't turn cloudy when they're left to stand.",
    "You can even choose a special tea blend that is made specifically for iced tea.",
    "Leave the teabags in the hot water for 5 minutes.",
    "Any longer than that and the tea will be too bitter.",
    "If you leave them in for less time than that, then the tea will be too weak.",
    "This will be a very strong mixture of tea -- you'll dilute it with water momentarily.",
    "Remove the tea bags after the time has passed.",
    "Pour the tea into a pitcher.",
    "Wait 5-10 minutes for it to cool down.",
    "Pour 2 cups (480 ml) of cold water into the tea.",
    "This will dilute the tea and will make the mixture less strong.",
    "You can stir the mixture for best results.",
    "Refrigerate the mixture until it's chilled.",
    "This should take 2-3 hours.",
    "Serve the tea.",
    "Pour the tea into a tall glass that is filled with ice.",
    "Squeeze a slice of lemon into the tea and add a sprig of mint to the top.",
    "If you'd like to add sugar, start by stirring in half a teaspoon and add more to taste.",
    "Fruity Iced Tea Make strong black tea.",
    "Use the same method you would use to make simple iced tea: just boil 2 cups of water, steep 3-5 tea bags in it for 5 minutes, pour 2 cups of water into the mix, and add sugar or lemon to taste.",
    "Pour this mixture into a pitcher.",
    "Refrigerate to chill.",
    "Leave the tea in the fridge for 2-3 hours.",
    "Add 1/2 cup of sugar syrup.",
    "Stir this into the mixture -- if it's not sweet enough, add more of the syrup.",
    "Fill 1 cup with slivers of fresh fruit.",
    "Dice peaches, pineapples, strawberries, raspberries, and apples until they fit into 1 cup.",
    "You can sprinkle them with a bit of lemon juice.",
    "Add the cup to the tea mixture.",
    "Stir it around until the fruit mixes in with the black tea and floats evenly in the pitcher.",
    "Serve the tea.",
    "Pour the tea into a glass filled with ice.",
    "Add a sprig of mint to the top.",
    "Strawberry Iced Tea Pour 2 quarts/1.8 liters (0.5 US gal) of hot black tea tea into a ceramic or glass mixing bowl.",
    "Add the 1/3 cups of superfine (caster) sugar to the tea.",
    "Stir thoroughly to dissolve the sugar.",
    "Add 1/2 cups of freshly squeezed lemon juice.",
    "Test to see if it requires additional sweetening or lemon juice and adjust accordingly.",
    "Then, set it aside to cool.",
    "Puree 31 oz/900g strawberries.",
    "Push the puree through a fine-sieve to remove the pips.",
    "Press on the mixture with the back of a wooden spoon.",
    "Once the tea has cooled, add the puree and mix.",
    "Mix thoroughly.",
    "Pour the mixture into a pitcher.",
    "Refrigerate for 30 minutes.",
    "Let this mixture cool off and settle together for thirty minutes or longer.",
    "Serve.",
    "Fill a glass with ice and pour the tea into it.",
    "Add a few strawberries -- whole or sliced -- to the side of the glass as a garnish.",
    "Vanilla Iced Green Tea Brew 4 rounded teaspoons of Sencha tea in 1 liter/33 fl oz of hot water.",
    "Let the tea infuse for 1-2 minutes.",
    "Strain the tea into a jug or pitcher.",
    "Add 1 tablespoon of freshly squeezed lemon juice.",
    "Stir well.",
    "Add 1 tablespoon of honey.",
    "Stir well.",
    "Stir the ingredients together.",
    "Stir the tea until it's evenly blended.",
    "Serve the tea with a scoop of vanilla ice cream.",
    "Add one scoop of vanilla ice cream to each glass and finish by pouring the chilled green tea over the top.",
    "This tea can be served as a dessert.",
    "Other Variations of Iced Tea Make sweet tea.",
    "This version is especially suitable for sweet-tooths and outdoor grilling in the Southern United States.",
    "Sugar never dissolves completely in cold tea.",
    "To make this variation of tea, you can follow the recipe for making simple black iced tea, except you should add 1 cup of simple syrup for every 2 cups of water of the finished iced tea mixture.",
    "If that doesn't taste sweet enough, just add more.",
    "This tea tastes excellent when it's garnished with mint.",
    "Make lemon iced tea.",
    "To make this citrus-flavored tea, begin by making ordinary black tea by boiling 2 cups of water, steeping 3-5 tea bags in it for 5 minutes, and pouring 2 cups of water into the mix.",
    "Then, squeeze the juice from a lemon to fill 1/2 a cup with lemon juice.",
    "Stir this into the cooled mix.",
    "If that's not lemony enough, just add a bit more.",
    "Serve this tea over ice with sugar to taste and a sprig of mint.",
    "Make vanilla iced tea.",
    "Brew 2 cups of ordinary black tea.",
    "Let the tea cool down and add 1 cup of cold water; some ice cubes are fine too.",
    "Add 2 teaspoons of vanilla essence (extract).",
    "Serve with a spoonful of vanilla ice-cream."
  ],
  "tyn_section":[
    "Small pan",
    "Suitable container (jug, pitcher) capable of holding 2 quarts/2 liters (0.5 US gal) of liquid"
  ],
  "tyn_model":[
    "water",
    "tea",
    "pitcher",
    "lemon juice",
    "sugar",
    "iced tea",
    "tea bags",
    "lemon",
    "mint",
    "strawberries",
    "glass",
    "black tea",
    "cold water",
    "ice",
    "vanilla ice cream",
    "tall glass",
    "sugar syrup",
    "peaches",
    "pineapples",
    "raspberries",
    "apples",
    "strawberry iced tea",
    "black tea tea",
    "ceramic or glass mixing bowl",
    "superfine (caster) sugar",
    "sweetening or",
    "fine-sieve",
    "wooden spoon",
    "iced green tea",
    "sencha tea",
    "hot water",
    "honey",
    "green tea",
    "sweet tea",
    "sweet-tooths",
    "simple syrup",
    "lemon iced tea",
    "vanilla iced tea",
    "ordinary black tea",
    "vanilla essence",
    "vanilla ice-cream"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}