{
  "title":"How to Clean Broccoli",
  "url":"https://www.wikihow.com/Clean-Broccoli",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Washing Broccoli with Water",
      "steps":[
        {
          "headline":"Fill a sink with cold water and soak the broccoli for 5-10 minutes.",
          "description":"Clean the sink thoroughly, and put a plug in the sink to stop the water from flowing down the drain. Make sure there's enough water to completely submerge the broccoli. Then, leave the broccoli in the water undisturbed to soak off dirt and debris. When you first put the broccoli in the water, swirl it around in the water a few times to loosen any larger pieces of dirt. If you use warm water, the florets of the broccoli can wilt slightly. If you don’t have a sink available, you can use a large bowl instead. Just make sure the broccoli is submerged under the water."
        },
        {
          "headline":"Place the broccoli in a colander and run it under cold water.",
          "description":"After soaking the broccoli, drain the sink and turn on the cold water. Let the water rinse the broccoli, and turn it over in the colander to rinse both sides. If you don’t have a colander, you can simply hold the broccoli in your hands and move it around under the water."
        },
        {
          "headline":"Use your hands to rub the vegetable to remove dirt and debris.",
          "description":"The head of your broccoli has many cracks and crevices where dirt can become trapped. To loosen them, run your fingers over the tops of the tops of the florets, and rub the sides and bottoms of the stalks. If you have a bristle brush for cleaning fruits and vegetables, you can use it to clean broccoli, but remember to be careful when brushing the florets. They can be delicate and may easily break off of the stalk."
        },
        {
          "headline":"Shake the broccoli dry before serving or cooking.",
          "description":"Hold the broccoli over the sink and let the water drip off of the florets for a few seconds. Then, tap the broccoli off of your hand 3-4 times to remove as much water as possible from inside of the florets\nIf the florets and stalk are still wet, you can pat them try with a paper towel or clean cloth before preparing the broccoli."
        }
      ]
    },
    {
      "name":"Using a Vinegar Solution",
      "steps":[
        {
          "headline":"Fill a large bowl with a mixture of 3 parts water and 1 part white vinegar.",
          "description":"Make sure the bowl is large enough to hold the broccoli, and stir the mixture with a spoon to combine the water and vinegar. Be sure to include enough water so that the entire head of broccoli is completely submerged. For example, if you put 3 cups (710 mL) of water into the bowl, then you would add 1 cup (240 mL) of white vinegar."
        },
        {
          "headline":"Place the broccoli in the solution to soak for 15-20 minutes.",
          "description":"Swirl the broccoli around the bowl a few times to loosen any larger debris, and then let the vegetable sit undisturbed. While it’s soaking, you can prepare other parts of your meal. A vinegar bath takes slightly longer than a cold water bath, but can be more effective at removing pesticides and bacteria than water alone."
        },
        {
          "headline":"Remove the broccoli from the solution and rinse it under cool water.",
          "description":"As you’re rinsing, use your hands or a bristle brush to rub the stalk and florets. Make sure you rinse all of the sides of the broccoli, including the bottom of the stalk and underneath the florets. If you soak the broccoli for longer than 30 minutes, it can begin to absorb the vinegar, giving it a bitter taste."
        }
      ]
    },
    {
      "name":"Removing Cabbage Worms with Salt Water",
      "steps":[
        {
          "headline":"Place the broccoli with the florets down in a container of cold water.",
          "description":"If you’re making organic or home-grown broccoli, you may be concerned about worms in the florets. To be safe, soak the florets in a brine solution. Worms tend to live in the florets, where there are plenty of places to hide. If you’re worried about worms in the stalk, you can place the entire stalk into the water, but be sure to keep the florets facing down."
        },
        {
          "headline":"Add 1  tsp (4.9 mL) of salt for every 1 US qt (950 mL) of cold water.",
          "description":"Pour in the salt after you’ve added the broccoli, and swirl the head around  in the water to mix the salt into the water. This will also loosen the worms from their hiding places and may dislodge many of them immediately. If you don’t see any worms when you move the broccoli, continue the soaking process to ensure that there aren’t any hidden worms."
        },
        {
          "headline":"Let the broccoli soak for 15-30 minutes to drive out the worms.",
          "description":"As the broccoli sits in the water, the worms in the florets will contract in the cold water and float to the top. To remove them from the water, scoop them out with a sieve or a slotted spoon. You don’t have to remove the worms from the water, but it can prevent them from re-attaching to the stalk before you remove it from the water."
        },
        {
          "headline":"Rinse the florets in cold water to remove any brine.",
          "description":"After soaking in salt water, the broccoli might have some salt stuck to it. Hold the head under cold, running water for 15 seconds, turning it to rinse both sides. If you haven’t yet cleaned the broccoli by scrubbing it with a brush or your fingers, you can do it while you rinse the head."
        },
        {
          "headline":"Shake the broccoli and pat it dry.",
          "description":"Hold the broccoli upside-down over the sink and tap the bottom of the stalk to dislodge any remaining worms. Then, use a clean towel to soak up any excess water, and inspect the florets closely. Once the broccoli is clean and dry, you can cut and cook it or serve it immediately."
        }
      ]
    }
  ],
  "text":" Washing Broccoli with Water Fill a sink with cold water and soak the broccoli for 5-10 minutes. Clean the sink thoroughly, and put a plug in the sink to stop the water from flowing down the drain. Make sure there's enough water to completely submerge the broccoli. Then, leave the broccoli in the water undisturbed to soak off dirt and debris. When you first put the broccoli in the water, swirl it around in the water a few times to loosen any larger pieces of dirt. If you use warm water, the florets of the broccoli can wilt slightly. If you don’t have a sink available, you can use a large bowl instead. Just make sure the broccoli is submerged under the water. Place the broccoli in a colander and run it under cold water. After soaking the broccoli, drain the sink and turn on the cold water. Let the water rinse the broccoli, and turn it over in the colander to rinse both sides. If you don’t have a colander, you can simply hold the broccoli in your hands and move it around under the water. Use your hands to rub the vegetable to remove dirt and debris. The head of your broccoli has many cracks and crevices where dirt can become trapped. To loosen them, run your fingers over the tops of the tops of the florets, and rub the sides and bottoms of the stalks. If you have a bristle brush for cleaning fruits and vegetables, you can use it to clean broccoli, but remember to be careful when brushing the florets. They can be delicate and may easily break off of the stalk. Shake the broccoli dry before serving or cooking. Hold the broccoli over the sink and let the water drip off of the florets for a few seconds. Then, tap the broccoli off of your hand 3-4 times to remove as much water as possible from inside of the florets\nIf the florets and stalk are still wet, you can pat them try with a paper towel or clean cloth before preparing the broccoli. Using a Vinegar Solution Fill a large bowl with a mixture of 3 parts water and 1 part white vinegar. Make sure the bowl is large enough to hold the broccoli, and stir the mixture with a spoon to combine the water and vinegar. Be sure to include enough water so that the entire head of broccoli is completely submerged. For example, if you put 3 cups (710 mL) of water into the bowl, then you would add 1 cup (240 mL) of white vinegar. Place the broccoli in the solution to soak for 15-20 minutes. Swirl the broccoli around the bowl a few times to loosen any larger debris, and then let the vegetable sit undisturbed. While it’s soaking, you can prepare other parts of your meal. A vinegar bath takes slightly longer than a cold water bath, but can be more effective at removing pesticides and bacteria than water alone. Remove the broccoli from the solution and rinse it under cool water. As you’re rinsing, use your hands or a bristle brush to rub the stalk and florets. Make sure you rinse all of the sides of the broccoli, including the bottom of the stalk and underneath the florets. If you soak the broccoli for longer than 30 minutes, it can begin to absorb the vinegar, giving it a bitter taste. Removing Cabbage Worms with Salt Water Place the broccoli with the florets down in a container of cold water. If you’re making organic or home-grown broccoli, you may be concerned about worms in the florets. To be safe, soak the florets in a brine solution. Worms tend to live in the florets, where there are plenty of places to hide. If you’re worried about worms in the stalk, you can place the entire stalk into the water, but be sure to keep the florets facing down. Add 1  tsp (4.9 mL) of salt for every 1 US qt (950 mL) of cold water. Pour in the salt after you’ve added the broccoli, and swirl the head around  in the water to mix the salt into the water. This will also loosen the worms from their hiding places and may dislodge many of them immediately. If you don’t see any worms when you move the broccoli, continue the soaking process to ensure that there aren’t any hidden worms. Let the broccoli soak for 15-30 minutes to drive out the worms. As the broccoli sits in the water, the worms in the florets will contract in the cold water and float to the top. To remove them from the water, scoop them out with a sieve or a slotted spoon. You don’t have to remove the worms from the water, but it can prevent them from re-attaching to the stalk before you remove it from the water. Rinse the florets in cold water to remove any brine. After soaking in salt water, the broccoli might have some salt stuck to it. Hold the head under cold, running water for 15 seconds, turning it to rinse both sides. If you haven’t yet cleaned the broccoli by scrubbing it with a brush or your fingers, you can do it while you rinse the head. Shake the broccoli and pat it dry. Hold the broccoli upside-down over the sink and tap the bottom of the stalk to dislodge any remaining worms. Then, use a clean towel to soak up any excess water, and inspect the florets closely. Once the broccoli is clean and dry, you can cut and cook it or serve it immediately.",
  "sentences":[
    " Washing Broccoli with Water Fill a sink with cold water and soak the broccoli for 5-10 minutes.",
    "Clean the sink thoroughly, and put a plug in the sink to stop the water from flowing down the drain.",
    "Make sure there's enough water to completely submerge the broccoli.",
    "Then, leave the broccoli in the water undisturbed to soak off dirt and debris.",
    "When you first put the broccoli in the water, swirl it around in the water a few times to loosen any larger pieces of dirt.",
    "If you use warm water, the florets of the broccoli can wilt slightly.",
    "If you don’t have a sink available, you can use a large bowl instead.",
    "Just make sure the broccoli is submerged under the water.",
    "Place the broccoli in a colander and run it under cold water.",
    "After soaking the broccoli, drain the sink and turn on the cold water.",
    "Let the water rinse the broccoli, and turn it over in the colander to rinse both sides.",
    "If you don’t have a colander, you can simply hold the broccoli in your hands and move it around under the water.",
    "Use your hands to rub the vegetable to remove dirt and debris.",
    "The head of your broccoli has many cracks and crevices where dirt can become trapped.",
    "To loosen them, run your fingers over the tops of the tops of the florets, and rub the sides and bottoms of the stalks.",
    "If you have a bristle brush for cleaning fruits and vegetables, you can use it to clean broccoli, but remember to be careful when brushing the florets.",
    "They can be delicate and may easily break off of the stalk.",
    "Shake the broccoli dry before serving or cooking.",
    "Hold the broccoli over the sink and let the water drip off of the florets for a few seconds.",
    "Then, tap the broccoli off of your hand 3-4 times to remove as much water as possible from inside of the florets\nIf the florets and stalk are still wet, you can pat them try with a paper towel or clean cloth before preparing the broccoli.",
    "Using a Vinegar Solution Fill a large bowl with a mixture of 3 parts water and 1 part white vinegar.",
    "Make sure the bowl is large enough to hold the broccoli, and stir the mixture with a spoon to combine the water and vinegar.",
    "Be sure to include enough water so that the entire head of broccoli is completely submerged.",
    "For example, if you put 3 cups (710 mL) of water into the bowl, then you would add 1 cup (240 mL) of white vinegar.",
    "Place the broccoli in the solution to soak for 15-20 minutes.",
    "Swirl the broccoli around the bowl a few times to loosen any larger debris, and then let the vegetable sit undisturbed.",
    "While it’s soaking, you can prepare other parts of your meal.",
    "A vinegar bath takes slightly longer than a cold water bath, but can be more effective at removing pesticides and bacteria than water alone.",
    "Remove the broccoli from the solution and rinse it under cool water.",
    "As you’re rinsing, use your hands or a bristle brush to rub the stalk and florets.",
    "Make sure you rinse all of the sides of the broccoli, including the bottom of the stalk and underneath the florets.",
    "If you soak the broccoli for longer than 30 minutes, it can begin to absorb the vinegar, giving it a bitter taste.",
    "Removing Cabbage Worms with Salt Water Place the broccoli with the florets down in a container of cold water.",
    "If you’re making organic or home-grown broccoli, you may be concerned about worms in the florets.",
    "To be safe, soak the florets in a brine solution.",
    "Worms tend to live in the florets, where there are plenty of places to hide.",
    "If you’re worried about worms in the stalk, you can place the entire stalk into the water, but be sure to keep the florets facing down.",
    "Add 1  tsp (4.9 mL) of salt for every 1 US qt (950 mL) of cold water.",
    "Pour in the salt after you’ve added the broccoli, and swirl the head around  in the water to mix the salt into the water.",
    "This will also loosen the worms from their hiding places and may dislodge many of them immediately.",
    "If you don’t see any worms when you move the broccoli, continue the soaking process to ensure that there aren’t any hidden worms.",
    "Let the broccoli soak for 15-30 minutes to drive out the worms.",
    "As the broccoli sits in the water, the worms in the florets will contract in the cold water and float to the top.",
    "To remove them from the water, scoop them out with a sieve or a slotted spoon.",
    "You don’t have to remove the worms from the water, but it can prevent them from re-attaching to the stalk before you remove it from the water.",
    "Rinse the florets in cold water to remove any brine.",
    "After soaking in salt water, the broccoli might have some salt stuck to it.",
    "Hold the head under cold, running water for 15 seconds, turning it to rinse both sides.",
    "If you haven’t yet cleaned the broccoli by scrubbing it with a brush or your fingers, you can do it while you rinse the head.",
    "Shake the broccoli and pat it dry.",
    "Hold the broccoli upside-down over the sink and tap the bottom of the stalk to dislodge any remaining worms.",
    "Then, use a clean towel to soak up any excess water, and inspect the florets closely.",
    "Once the broccoli is clean and dry, you can cut and cook it or serve it immediately."
  ],
  "tyn_section":[
    "Water",
    "Sink or bowl",
    "Colander",
    "Bristle brush (optional)",
    "White vinegar",
    "Large bowl",
    "Deep container or bowl",
    "Table salt"
  ],
  "tyn_model":[
    "water",
    "broccoli",
    "vinegar",
    "bowl",
    "colander",
    "salt",
    "bristle brush",
    "white vinegar",
    "salt water",
    "cold water",
    "spoon",
    "sieve",
    "slotted spoon",
    "sink"
  ],
  "simple_metrics":{
    "r":0.375,
    "p":0.2142857143,
    "f1":0.2727272727,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.6428571429,
    "f1":0.6923076923
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.7142857143,
    "f1":0.7865168539
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.2857142857,
    "f1":0.3636363636
  }
}