{
  "title":"How to Grow Grass from Seeds",
  "url":"https://www.wikihow.com/Grow-Grass-from-Seeds",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "methods":[
    {
      "name":"Planting the Seed",
      "steps":[
        {
          "headline":"Scatter the seed.",
          "description":"For large areas, rent or buy a lawn spreader or a mechanical seeder, which shoots grass seed evenly across the lawn. For small areas, spread grass seeds by hand. Use the amount of seed recommended by the lawn care expert at your home and garden store. It is important to use the correct amount of grass seeds to ensure your lawn grows evenly. Do not overseed your lawn. Do not use up extra seed by spreading it over the lawn. Overseeded areas will grow thin, unhealthy grass, because seedlings will compete for limited nutrients."
        },
        {
          "headline":"Protect seeds with topsoil or mulch.",
          "description":"Newly planted seeds need to be protected from the elements until they take root. A thin layer of topsoil will help, but it's best to use a loose layer of mulch to help retain moisture. You can distribute this by hand or with a cage roller. Yellow grain straw is a popular choice, since it's cheap and easily broken up by the mower once your lawn is established. Avoid hay, which has too many seeds, and fresh pine straw, which slows grass growth. (Aged pine straw is fine.) Other forms of mulch will also work, but apply dense materials such as compost or sawdust in layers no thicker than ¼\" (6 mm)."
        },
        {
          "headline":"Water the seeds.",
          "description":"Set your garden hose head to the \"mist\" setting and lightly water the seeds until it is thoroughly damp. For a larger lawn, run a sprinkler in the center of the area for a few minutes. Don't use a powerful stream of water, or you will wash away the grass seeds. Newly planted seeds should be watered lightly every other day until the grass sprouts."
        },
        {
          "headline":"Keep people and pets off the new lawn.",
          "description":"Protect the newly planted seeds from trampling for the first few weeks. Consider putting up a sign or using a string or flags to cordon the area. If pets and other animals run loose, consider putting a temporary fence to protect the lawn from harm."
        }
      ]
    },
    {
      "name":"Choosing a Type of Grass",
      "steps":[
        {
          "headline":"Research the type of grass that grows best in your region.",
          "description":"Most grasses are either cool season grasses or warm season grasses. It's important to find out which kind of grass grows best where you live to ensure a healthy lawn all year round. Cool season grasses prefer areas with cool summers, and grow best in spring and fall when temperatures are between 60 and 75ºF (16–24ºC). They often turn brown and dormant in summer, but if properly watered will return again and may retain some color even in winter. Cool season grasses include the following:\nKentucky bluegrass, is a fine, dark green grass that grows well in shade. Tall fescue, a low maintenance grass,is coarse. Perennial ryegrass grows well in full sun. It is medium-textured. Warm season grasses thrive in warm climates, from the southern U.S. down to tropical zones. Planted in spring, they will wait until summer temperatures of 80 to 90ºF (27–32ºC) to really take off, then go dormant as the weather cools. Warm season grasses include the following:\nBermuda grass likes full sun, not shade. It is fine-textured. Zoysia grass is a medium-textured grass that is hardier than most warm-season grasses during winter. St. Augustine grass is a coarse grass that cannot survive cold winters."
        },
        {
          "headline":"Decide what type of grass will grow best in your yard conditions.",
          "description":"The conditions in your yard will affect the health of your grass as much as the climate in your region. Hundreds of seed varieties have been developed to grow in specific environments. Consider the following variables when choosing a type of grass:\nDoes your yard have good drainage? Or does it dry too quickly? Some seeds are engineered to survive waterlogged soil. Others are drought-resistant. Does your yard have abundant shade or full sun? How much foot traffic does your lawn get? Some grasses hold up well to high foot traffic, while others have trouble recovering if trampled. Is your grass for decorative purposes, or do you want to walk on it with bare feet? Some grasses are beautiful but coarse. Others are soft, perfect for lounging outside. How often do you want to mow your lawn? Some grasses grow quickly, and need to be mowed every week while others can be left alone longer."
        },
        {
          "headline":"You can buy grass seed at garden stores or online.",
          "description":"Buy from a reputable source. Calculate how much grass seed you will need. Each kind of seed provides a different amount of coverage. After you calculate the square footage of the area where you're planting grass, talk to the salesperson at the home / garden lawn care store. Ask how much seed you will need to buy. Some seed sellers provide online grass seed calculators."
        }
      ]
    },
    {
      "name":"Preparing the Soil for Planting",
      "steps":[
        {
          "headline":"Till the top layer of soil.",
          "description":"For best results, break compacted soil up into a loose, even texture that holds moisture well but drains easily. If you have a large area to cover, buy or rent a soil tiller to break up the soil. If you have a small area to cover, use a garden rake or hoe instead. As you till, break up large clumps of dirt so that the soil is fine and even. Remove rocks, sticks, and other debris from the lawn. If you're adding seeds to a lawn with bare patches, use a tiller or garden rake to break up the soil. Mow the rest of the lawn as short as possible. Don't wait too long between raking and planting. If the churned up soil hardens into a crusty or lumpy texture, you may need to rake it again."
        },
        {
          "headline":"Level the ground.",
          "description":"If there are spots in your yard where water pools when it rains, they need to be leveled out. Seed planted there won't survive long. Level the ground by adding topsoil to low areas. Run the tiller over the area to even it out and blend it with the surrounding soil."
        },
        {
          "headline":"Fertilize the soil.",
          "description":"Grass grows significantly better in fertilized soil. Buy a fertilizer specifically made for newly planted grass."
        }
      ]
    },
    {
      "name":"Taking Care of the Grass",
      "steps":[
        {
          "headline":"Gradually reduce watering.",
          "description":"As your grass becomes established, it will need less and less water (allowing for weather). It's typically best to continue watering lightly every other day for a week or two after the grass blades appear. You can then gradually reduce the watering schedule until you are watering only once a week. You can also increase the amount of water per session at the same time, until you are providing enough water to make the soil soaked, but not soggy. If the grass starts turning brown or looking dry, quickly water to revive it. Don't water your lawn after heavy rain or it could become waterlogged."
        },
        {
          "headline":"Mow the grass.",
          "description":"Mowing grass encourages it to grow thick and healthy. If it grows too tall, it will get reedy and tough. Mow when the grass is 4 inches (10.2 cm) tall. Grass clippings in the yard act as a natural mulch to aid stronger grass. Consider a push reel mower instead of a power mower. Push reel mowers are better for the health of your grass because they snip it neatly unlike power mowers which tear and shred it, making it more susceptible to disease. Plus, push reel mowers do not emit pollution."
        },
        {
          "headline":"Fertilize the lawn.",
          "description":"After six weeks, when the grass is healthy and tall, give it another application of fertilizer specifically made for grass. This ensures healthy growth for the rest of the season. Fertilize your lawn at the beginning of each growing season."
        }
      ]
    }
  ],
  "text":" Planting the Seed Scatter the seed. For large areas, rent or buy a lawn spreader or a mechanical seeder, which shoots grass seed evenly across the lawn. For small areas, spread grass seeds by hand. Use the amount of seed recommended by the lawn care expert at your home and garden store. It is important to use the correct amount of grass seeds to ensure your lawn grows evenly. Do not overseed your lawn. Do not use up extra seed by spreading it over the lawn. Overseeded areas will grow thin, unhealthy grass, because seedlings will compete for limited nutrients. Protect seeds with topsoil or mulch. Newly planted seeds need to be protected from the elements until they take root. A thin layer of topsoil will help, but it's best to use a loose layer of mulch to help retain moisture. You can distribute this by hand or with a cage roller. Yellow grain straw is a popular choice, since it's cheap and easily broken up by the mower once your lawn is established. Avoid hay, which has too many seeds, and fresh pine straw, which slows grass growth. (Aged pine straw is fine.) Other forms of mulch will also work, but apply dense materials such as compost or sawdust in layers no thicker than ¼\" (6 mm). Water the seeds. Set your garden hose head to the \"mist\" setting and lightly water the seeds until it is thoroughly damp. For a larger lawn, run a sprinkler in the center of the area for a few minutes. Don't use a powerful stream of water, or you will wash away the grass seeds. Newly planted seeds should be watered lightly every other day until the grass sprouts. Keep people and pets off the new lawn. Protect the newly planted seeds from trampling for the first few weeks. Consider putting up a sign or using a string or flags to cordon the area. If pets and other animals run loose, consider putting a temporary fence to protect the lawn from harm. Choosing a Type of Grass Research the type of grass that grows best in your region. Most grasses are either cool season grasses or warm season grasses. It's important to find out which kind of grass grows best where you live to ensure a healthy lawn all year round. Cool season grasses prefer areas with cool summers, and grow best in spring and fall when temperatures are between 60 and 75ºF (16–24ºC). They often turn brown and dormant in summer, but if properly watered will return again and may retain some color even in winter. Cool season grasses include the following:\nKentucky bluegrass, is a fine, dark green grass that grows well in shade. Tall fescue, a low maintenance grass,is coarse. Perennial ryegrass grows well in full sun. It is medium-textured. Warm season grasses thrive in warm climates, from the southern U.S. down to tropical zones. Planted in spring, they will wait until summer temperatures of 80 to 90ºF (27–32ºC) to really take off, then go dormant as the weather cools. Warm season grasses include the following:\nBermuda grass likes full sun, not shade. It is fine-textured. Zoysia grass is a medium-textured grass that is hardier than most warm-season grasses during winter. St. Augustine grass is a coarse grass that cannot survive cold winters. Decide what type of grass will grow best in your yard conditions. The conditions in your yard will affect the health of your grass as much as the climate in your region. Hundreds of seed varieties have been developed to grow in specific environments. Consider the following variables when choosing a type of grass:\nDoes your yard have good drainage? Or does it dry too quickly? Some seeds are engineered to survive waterlogged soil. Others are drought-resistant. Does your yard have abundant shade or full sun? How much foot traffic does your lawn get? Some grasses hold up well to high foot traffic, while others have trouble recovering if trampled. Is your grass for decorative purposes, or do you want to walk on it with bare feet? Some grasses are beautiful but coarse. Others are soft, perfect for lounging outside. How often do you want to mow your lawn? Some grasses grow quickly, and need to be mowed every week while others can be left alone longer. You can buy grass seed at garden stores or online. Buy from a reputable source. Calculate how much grass seed you will need. Each kind of seed provides a different amount of coverage. After you calculate the square footage of the area where you're planting grass, talk to the salesperson at the home / garden lawn care store. Ask how much seed you will need to buy. Some seed sellers provide online grass seed calculators. Preparing the Soil for Planting Till the top layer of soil. For best results, break compacted soil up into a loose, even texture that holds moisture well but drains easily. If you have a large area to cover, buy or rent a soil tiller to break up the soil. If you have a small area to cover, use a garden rake or hoe instead. As you till, break up large clumps of dirt so that the soil is fine and even. Remove rocks, sticks, and other debris from the lawn. If you're adding seeds to a lawn with bare patches, use a tiller or garden rake to break up the soil. Mow the rest of the lawn as short as possible. Don't wait too long between raking and planting. If the churned up soil hardens into a crusty or lumpy texture, you may need to rake it again. Level the ground. If there are spots in your yard where water pools when it rains, they need to be leveled out. Seed planted there won't survive long. Level the ground by adding topsoil to low areas. Run the tiller over the area to even it out and blend it with the surrounding soil. Fertilize the soil. Grass grows significantly better in fertilized soil. Buy a fertilizer specifically made for newly planted grass. Taking Care of the Grass Gradually reduce watering. As your grass becomes established, it will need less and less water (allowing for weather). It's typically best to continue watering lightly every other day for a week or two after the grass blades appear. You can then gradually reduce the watering schedule until you are watering only once a week. You can also increase the amount of water per session at the same time, until you are providing enough water to make the soil soaked, but not soggy. If the grass starts turning brown or looking dry, quickly water to revive it. Don't water your lawn after heavy rain or it could become waterlogged. Mow the grass. Mowing grass encourages it to grow thick and healthy. If it grows too tall, it will get reedy and tough. Mow when the grass is 4 inches (10.2 cm) tall. Grass clippings in the yard act as a natural mulch to aid stronger grass. Consider a push reel mower instead of a power mower. Push reel mowers are better for the health of your grass because they snip it neatly unlike power mowers which tear and shred it, making it more susceptible to disease. Plus, push reel mowers do not emit pollution. Fertilize the lawn. After six weeks, when the grass is healthy and tall, give it another application of fertilizer specifically made for grass. This ensures healthy growth for the rest of the season. Fertilize your lawn at the beginning of each growing season.",
  "sentences":[
    " Planting the Seed Scatter the seed.",
    "For large areas, rent or buy a lawn spreader or a mechanical seeder, which shoots grass seed evenly across the lawn.",
    "For small areas, spread grass seeds by hand.",
    "Use the amount of seed recommended by the lawn care expert at your home and garden store.",
    "It is important to use the correct amount of grass seeds to ensure your lawn grows evenly.",
    "Do not overseed your lawn.",
    "Do not use up extra seed by spreading it over the lawn.",
    "Overseeded areas will grow thin, unhealthy grass, because seedlings will compete for limited nutrients.",
    "Protect seeds with topsoil or mulch.",
    "Newly planted seeds need to be protected from the elements until they take root.",
    "A thin layer of topsoil will help, but it's best to use a loose layer of mulch to help retain moisture.",
    "You can distribute this by hand or with a cage roller.",
    "Yellow grain straw is a popular choice, since it's cheap and easily broken up by the mower once your lawn is established.",
    "Avoid hay, which has too many seeds, and fresh pine straw, which slows grass growth.",
    "(Aged pine straw is fine.)",
    "Other forms of mulch will also work, but apply dense materials such as compost or sawdust in layers no thicker than ¼\" (6 mm).",
    "Water the seeds.",
    "Set your garden hose head to the \"mist\" setting and lightly water the seeds until it is thoroughly damp.",
    "For a larger lawn, run a sprinkler in the center of the area for a few minutes.",
    "Don't use a powerful stream of water, or you will wash away the grass seeds.",
    "Newly planted seeds should be watered lightly every other day until the grass sprouts.",
    "Keep people and pets off the new lawn.",
    "Protect the newly planted seeds from trampling for the first few weeks.",
    "Consider putting up a sign or using a string or flags to cordon the area.",
    "If pets and other animals run loose, consider putting a temporary fence to protect the lawn from harm.",
    "Choosing a Type of Grass Research the type of grass that grows best in your region.",
    "Most grasses are either cool season grasses or warm season grasses.",
    "It's important to find out which kind of grass grows best where you live to ensure a healthy lawn all year round.",
    "Cool season grasses prefer areas with cool summers, and grow best in spring and fall when temperatures are between 60 and 75ºF (16–24ºC).",
    "They often turn brown and dormant in summer, but if properly watered will return again and may retain some color even in winter.",
    "Cool season grasses include the following:\nKentucky bluegrass, is a fine, dark green grass that grows well in shade.",
    "Tall fescue, a low maintenance grass,is coarse.",
    "Perennial ryegrass grows well in full sun.",
    "It is medium-textured.",
    "Warm season grasses thrive in warm climates, from the southern U.S. down to tropical zones.",
    "Planted in spring, they will wait until summer temperatures of 80 to 90ºF (27–32ºC) to really take off, then go dormant as the weather cools.",
    "Warm season grasses include the following:\nBermuda grass likes full sun, not shade.",
    "It is fine-textured.",
    "Zoysia grass is a medium-textured grass that is hardier than most warm-season grasses during winter.",
    "St. Augustine grass is a coarse grass that cannot survive cold winters.",
    "Decide what type of grass will grow best in your yard conditions.",
    "The conditions in your yard will affect the health of your grass as much as the climate in your region.",
    "Hundreds of seed varieties have been developed to grow in specific environments.",
    "Consider the following variables when choosing a type of grass:\nDoes your yard have good drainage?",
    "Or does it dry too quickly?",
    "Some seeds are engineered to survive waterlogged soil.",
    "Others are drought-resistant.",
    "Does your yard have abundant shade or full sun?",
    "How much foot traffic does your lawn get?",
    "Some grasses hold up well to high foot traffic, while others have trouble recovering if trampled.",
    "Is your grass for decorative purposes, or do you want to walk on it with bare feet?",
    "Some grasses are beautiful but coarse.",
    "Others are soft, perfect for lounging outside.",
    "How often do you want to mow your lawn?",
    "Some grasses grow quickly, and need to be mowed every week while others can be left alone longer.",
    "You can buy grass seed at garden stores or online.",
    "Buy from a reputable source.",
    "Calculate how much grass seed you will need.",
    "Each kind of seed provides a different amount of coverage.",
    "After you calculate the square footage of the area where you're planting grass, talk to the salesperson at the home / garden lawn care store.",
    "Ask how much seed you will need to buy.",
    "Some seed sellers provide online grass seed calculators.",
    "Preparing the Soil for Planting Till the top layer of soil.",
    "For best results, break compacted soil up into a loose, even texture that holds moisture well but drains easily.",
    "If you have a large area to cover, buy or rent a soil tiller to break up the soil.",
    "If you have a small area to cover, use a garden rake or hoe instead.",
    "As you till, break up large clumps of dirt so that the soil is fine and even.",
    "Remove rocks, sticks, and other debris from the lawn.",
    "If you're adding seeds to a lawn with bare patches, use a tiller or garden rake to break up the soil.",
    "Mow the rest of the lawn as short as possible.",
    "Don't wait too long between raking and planting.",
    "If the churned up soil hardens into a crusty or lumpy texture, you may need to rake it again.",
    "Level the ground.",
    "If there are spots in your yard where water pools when it rains, they need to be leveled out.",
    "Seed planted there won't survive long.",
    "Level the ground by adding topsoil to low areas.",
    "Run the tiller over the area to even it out and blend it with the surrounding soil.",
    "Fertilize the soil.",
    "Grass grows significantly better in fertilized soil.",
    "Buy a fertilizer specifically made for newly planted grass.",
    "Taking Care of the Grass Gradually reduce watering.",
    "As your grass becomes established, it will need less and less water (allowing for weather).",
    "It's typically best to continue watering lightly every other day for a week or two after the grass blades appear.",
    "You can then gradually reduce the watering schedule until you are watering only once a week.",
    "You can also increase the amount of water per session at the same time, until you are providing enough water to make the soil soaked, but not soggy.",
    "If the grass starts turning brown or looking dry, quickly water to revive it.",
    "Don't water your lawn after heavy rain or it could become waterlogged.",
    "Mow the grass.",
    "Mowing grass encourages it to grow thick and healthy.",
    "If it grows too tall, it will get reedy and tough.",
    "Mow when the grass is 4 inches (10.2 cm) tall.",
    "Grass clippings in the yard act as a natural mulch to aid stronger grass.",
    "Consider a push reel mower instead of a power mower.",
    "Push reel mowers are better for the health of your grass because they snip it neatly unlike power mowers which tear and shred it, making it more susceptible to disease.",
    "Plus, push reel mowers do not emit pollution.",
    "Fertilize the lawn.",
    "After six weeks, when the grass is healthy and tall, give it another application of fertilizer specifically made for grass.",
    "This ensures healthy growth for the rest of the season.",
    "Fertilize your lawn at the beginning of each growing season."
  ],
  "tyn_section":[
    "Grass seed",
    "Fertilizer",
    "Topsoil",
    "Tiller or seed spreader (optional)",
    "Lawn mower",
    "Garden hose"
  ],
  "tyn_model":[
    "grass",
    "water",
    "grass seed",
    "mulch",
    "grass seeds",
    "seed",
    "topsoil",
    "soil",
    "garden rake",
    "tiller",
    "fertilizer",
    "push reel mowers",
    "lawn spreader",
    "mechanical seeder",
    "lawn care expert",
    "hay",
    "compost",
    "garden hose",
    "tall fescue,",
    "seeds",
    "garden stores",
    "seed sellers",
    "grass seed calculators",
    "soil tiller",
    "rocks",
    "push reel mower"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1538461538,
    "f1":0.25,
    "avg_pos":0.0769230769
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.2692307692,
    "f1":0.3835616438
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.4615384615,
    "f1":0.5940594059
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1923076923,
    "f1":0.2985074627
  }
}