{
  "title":"How to Put Laminate on a Counter Top",
  "url":"https://www.wikihow.com/Put-Laminate-on-a-Counter-Top",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "steps":[
    {
      "headline":"Spend some time planning your project.",
      "description":"For areas where a backsplash is required, a post-formed factory built countertop may be more suitable, but for many applications, a do-it-yourself top will work well, offering you more flexibility and the satisfaction of doing the job yourself. Here are some things you will need to know before beginning:\nDecide how large the counter top or work top will be. For example, a work-counter in a craft room may need to be 24–36 inches (61.0–91.4 cm) wide, depending on the size of the materials you will use on it. Look at the colors and the effect they will have on the surface. Dark wood or stone designs are pretty to look at, but if the lighting in the area you will use them in is not sufficient, a lighter or brighter color may be more suitable. Look at the exposure the surface can expect. For areas near sinks or where water or other liquids may be spilled, post-formed counter tops will help manage spills since they have an integrated back-splash and slightly raised front edge to decrease run-off from the surface."
    },
    {
      "headline":"Choose the type and finish of your material.",
      "description":"Plastic laminates come in an almost limitless selection, from solid colors to realistic wood or stone designs, either very smooth and glossy, or embossed and textured to more closely replicate the material they resemble."
    },
    {
      "headline":"Choose the material you will glue your laminate to.",
      "description":"Plywood or MDF (medium density fiberboard) are common materials for a laminate substrate, and each has advantages and disadvantages. Here is a limited comparison:\nPlywood has a somewhat higher structural strength, and weighs less than its fiberboard counterpart. It can be purchased in thicknesses ranging from ⁄4 inch (0.6 cm) to ⁄4 inch (1.9 cm), and comes in sheets normally sized at 4 foot (1.2 m) by 8 foot (2.4 m), although special order sheets can be longer. Plywood with exterior glue will be somewhat more resistant to moisture, as well. MDF board is less inclined to warping, since it has no directional grain. Its surface is more dense, so it takes the glue a bit better than plywood, and the glue will not dry quite as quickly. Typically, MDF board is about 25-30% less expensive than a sanded hardwood plywood."
    },
    {
      "headline":"Choose that plastic laminate you will use for your project.",
      "description":"There are a number of grades and brands available at building supply stores and home improvement retailers, so you can plan to spend some time researching and shopping for the product you will use. Plastic laminate comes in sheets, normally measuring 49 or 60 inches (124.5 or 152.4 cm) by 12 feet (3.7 m), but can be purchased cut to size for your project to minimize waste."
    },
    {
      "headline":"Match the contact cement to the laminate you choose.",
      "description":"Many retailers sell laminate with a thermoset glue already applied to the back of the sheet, but if you buy one that does not have this feature, you will have to glue up the laminate yourself. This is the process we will be looking at in this article. You should find two basic choices in adhesives, either a solvent based (very flammable, very fast setting) or water based (non flammable, slower setting) contact cements. Generally, you will need about 1 quart of adhesive for each 4 X 8 sheet or 32 square feet of countertop."
    },
    {
      "headline":"Purchase disposable paint brushes or a paint roller with a close (short) nap to spread your glue.",
      "description":""
    },
    {
      "headline":"Assemble the materials in a workshop or other location with good ventilation and lighting, relatively little dust, and plenty of workbench space.",
      "description":"You will also want to make sure you have the tools you will need to perform the work."
    },
    {
      "headline":"Cut your plywood (or MDF) to the size you want.",
      "description":"If this is going to be a close fit project, you may want to make it slightly larger than you will need so it can be scribed and trimmed to fit. This is especially critical if you are fitting against an abutting wall or between two walls, as they may not be square (at a true 90 degree angle)."
    },
    {
      "headline":"Rip a strip of your plywood about 2 inches (5.1 cm) wide the length of your top for an edge band.",
      "description":"Screw (and glue, if preferred) this strip along the front edge of your top. Make sure the edge is square and perfectly flush, sanding if necessary to perfect the fit."
    },
    {
      "headline":"Cut the laminate to fit the top.",
      "description":"Usually, you will allow about ⁄4 to ⁄2 inch (0.6 to 1.3 cm) overlap so the material can be trimmed to fit after it is glued, since placing it with contact cement on it does not allow for error."
    },
    {
      "headline":"Lay your plywood on a set of saw horses, and place the cut sheet of laminate, bottom up, on a workbench or other surface so you can apply the glue.",
      "description":"You will want to be very careful to keep the plywood and laminate clean after you begin to apply the glue."
    },
    {
      "headline":"Roll or brush a thin coat of contact cement on both the plywood and the back of the laminate, making sure no runs or thick splatters form on either surface, as excess glue will cause a dimple or bump on the finished surface.",
      "description":""
    },
    {
      "headline":"Allow the adhesive to dry until all the gloss, or wet appearance disappears.",
      "description":"The glue will cease to be tacky, or wet, to the touch. Carefully lift the laminate and place it on top of the plywood, aligning it as it is placed along the front edge and ends. Once the glued surfaces make contact, repositioning them is almost impossible."
    },
    {
      "headline":"Use a soft cloth to press the surface of the laminate, working from the center towards the edges.",
      "description":"This will prevent buckles or bubbles from forming. Ideally, when the laminate is pressed down, you will have at least an eighth of an inch of overhang all the way around the top."
    },
    {
      "headline":"Cut a piece of laminate for your edge band.",
      "description":"If you are using ⁄4 inch (1.9 cm) thick plywood, you will want the edge band to be about 1 ⁄8 inch (4.1 cm) wide, and at least ⁄4 inch (0.6 cm) longer than the edge it will fit on. Ideally, you will also want a factory edge to tuck underneath the top laminate at the corner, but if not, you will need to pre-fit the band and trim it so it fits tightly."
    },
    {
      "headline":"Glue the edge band on each exposed edge, applying the contact cement to the plywood edge and the back of the laminate as you did with the top sheet, and allowing it to dry.",
      "description":""
    },
    {
      "headline":"Use a router with a laminate trimming bit to trim excess laminate on all edges.",
      "description":"Be careful, if using a tapered trimmer, not to set the bit so deeply that it scuffs the laminate below the thickness of the surface material."
    },
    {
      "headline":"Clean up any glue spots on the surfaces, and fit your countertop into position.",
      "description":""
    }
  ],
  "text":" Spend some time planning your project. For areas where a backsplash is required, a post-formed factory built countertop may be more suitable, but for many applications, a do-it-yourself top will work well, offering you more flexibility and the satisfaction of doing the job yourself. Here are some things you will need to know before beginning:\nDecide how large the counter top or work top will be. For example, a work-counter in a craft room may need to be 24–36 inches (61.0–91.4 cm) wide, depending on the size of the materials you will use on it. Look at the colors and the effect they will have on the surface. Dark wood or stone designs are pretty to look at, but if the lighting in the area you will use them in is not sufficient, a lighter or brighter color may be more suitable. Look at the exposure the surface can expect. For areas near sinks or where water or other liquids may be spilled, post-formed counter tops will help manage spills since they have an integrated back-splash and slightly raised front edge to decrease run-off from the surface. Choose the type and finish of your material. Plastic laminates come in an almost limitless selection, from solid colors to realistic wood or stone designs, either very smooth and glossy, or embossed and textured to more closely replicate the material they resemble. Choose the material you will glue your laminate to. Plywood or MDF (medium density fiberboard) are common materials for a laminate substrate, and each has advantages and disadvantages. Here is a limited comparison:\nPlywood has a somewhat higher structural strength, and weighs less than its fiberboard counterpart. It can be purchased in thicknesses ranging from ⁄4 inch (0.6 cm) to ⁄4 inch (1.9 cm), and comes in sheets normally sized at 4 foot (1.2 m) by 8 foot (2.4 m), although special order sheets can be longer. Plywood with exterior glue will be somewhat more resistant to moisture, as well. MDF board is less inclined to warping, since it has no directional grain. Its surface is more dense, so it takes the glue a bit better than plywood, and the glue will not dry quite as quickly. Typically, MDF board is about 25-30% less expensive than a sanded hardwood plywood. Choose that plastic laminate you will use for your project. There are a number of grades and brands available at building supply stores and home improvement retailers, so you can plan to spend some time researching and shopping for the product you will use. Plastic laminate comes in sheets, normally measuring 49 or 60 inches (124.5 or 152.4 cm) by 12 feet (3.7 m), but can be purchased cut to size for your project to minimize waste. Match the contact cement to the laminate you choose. Many retailers sell laminate with a thermoset glue already applied to the back of the sheet, but if you buy one that does not have this feature, you will have to glue up the laminate yourself. This is the process we will be looking at in this article. You should find two basic choices in adhesives, either a solvent based (very flammable, very fast setting) or water based (non flammable, slower setting) contact cements. Generally, you will need about 1 quart of adhesive for each 4 X 8 sheet or 32 square feet of countertop. Purchase disposable paint brushes or a paint roller with a close (short) nap to spread your glue.  Assemble the materials in a workshop or other location with good ventilation and lighting, relatively little dust, and plenty of workbench space. You will also want to make sure you have the tools you will need to perform the work. Cut your plywood (or MDF) to the size you want. If this is going to be a close fit project, you may want to make it slightly larger than you will need so it can be scribed and trimmed to fit. This is especially critical if you are fitting against an abutting wall or between two walls, as they may not be square (at a true 90 degree angle). Rip a strip of your plywood about 2 inches (5.1 cm) wide the length of your top for an edge band. Screw (and glue, if preferred) this strip along the front edge of your top. Make sure the edge is square and perfectly flush, sanding if necessary to perfect the fit. Cut the laminate to fit the top. Usually, you will allow about ⁄4 to ⁄2 inch (0.6 to 1.3 cm) overlap so the material can be trimmed to fit after it is glued, since placing it with contact cement on it does not allow for error. Lay your plywood on a set of saw horses, and place the cut sheet of laminate, bottom up, on a workbench or other surface so you can apply the glue. You will want to be very careful to keep the plywood and laminate clean after you begin to apply the glue. Roll or brush a thin coat of contact cement on both the plywood and the back of the laminate, making sure no runs or thick splatters form on either surface, as excess glue will cause a dimple or bump on the finished surface.  Allow the adhesive to dry until all the gloss, or wet appearance disappears. The glue will cease to be tacky, or wet, to the touch. Carefully lift the laminate and place it on top of the plywood, aligning it as it is placed along the front edge and ends. Once the glued surfaces make contact, repositioning them is almost impossible. Use a soft cloth to press the surface of the laminate, working from the center towards the edges. This will prevent buckles or bubbles from forming. Ideally, when the laminate is pressed down, you will have at least an eighth of an inch of overhang all the way around the top. Cut a piece of laminate for your edge band. If you are using ⁄4 inch (1.9 cm) thick plywood, you will want the edge band to be about 1 ⁄8 inch (4.1 cm) wide, and at least ⁄4 inch (0.6 cm) longer than the edge it will fit on. Ideally, you will also want a factory edge to tuck underneath the top laminate at the corner, but if not, you will need to pre-fit the band and trim it so it fits tightly. Glue the edge band on each exposed edge, applying the contact cement to the plywood edge and the back of the laminate as you did with the top sheet, and allowing it to dry.  Use a router with a laminate trimming bit to trim excess laminate on all edges. Be careful, if using a tapered trimmer, not to set the bit so deeply that it scuffs the laminate below the thickness of the surface material. Clean up any glue spots on the surfaces, and fit your countertop into position. ",
  "sentences":[
    " Spend some time planning your project.",
    "For areas where a backsplash is required, a post-formed factory built countertop may be more suitable, but for many applications, a do-it-yourself top will work well, offering you more flexibility and the satisfaction of doing the job yourself.",
    "Here are some things you will need to know before beginning:\nDecide how large the counter top or work top will be.",
    "For example, a work-counter in a craft room may need to be 24–36 inches (61.0–91.4 cm) wide, depending on the size of the materials you will use on it.",
    "Look at the colors and the effect they will have on the surface.",
    "Dark wood or stone designs are pretty to look at, but if the lighting in the area you will use them in is not sufficient, a lighter or brighter color may be more suitable.",
    "Look at the exposure the surface can expect.",
    "For areas near sinks or where water or other liquids may be spilled, post-formed counter tops will help manage spills since they have an integrated back-splash and slightly raised front edge to decrease run-off from the surface.",
    "Choose the type and finish of your material.",
    "Plastic laminates come in an almost limitless selection, from solid colors to realistic wood or stone designs, either very smooth and glossy, or embossed and textured to more closely replicate the material they resemble.",
    "Choose the material you will glue your laminate to.",
    "Plywood or MDF (medium density fiberboard) are common materials for a laminate substrate, and each has advantages and disadvantages.",
    "Here is a limited comparison:\nPlywood has a somewhat higher structural strength, and weighs less than its fiberboard counterpart.",
    "It can be purchased in thicknesses ranging from ⁄4 inch (0.6 cm) to ⁄4 inch (1.9 cm), and comes in sheets normally sized at 4 foot (1.2 m) by 8 foot (2.4 m), although special order sheets can be longer.",
    "Plywood with exterior glue will be somewhat more resistant to moisture, as well.",
    "MDF board is less inclined to warping, since it has no directional grain.",
    "Its surface is more dense, so it takes the glue a bit better than plywood, and the glue will not dry quite as quickly.",
    "Typically, MDF board is about 25-30% less expensive than a sanded hardwood plywood.",
    "Choose that plastic laminate you will use for your project.",
    "There are a number of grades and brands available at building supply stores and home improvement retailers, so you can plan to spend some time researching and shopping for the product you will use.",
    "Plastic laminate comes in sheets, normally measuring 49 or 60 inches (124.5 or 152.4 cm) by 12 feet (3.7 m), but can be purchased cut to size for your project to minimize waste.",
    "Match the contact cement to the laminate you choose.",
    "Many retailers sell laminate with a thermoset glue already applied to the back of the sheet, but if you buy one that does not have this feature, you will have to glue up the laminate yourself.",
    "This is the process we will be looking at in this article.",
    "You should find two basic choices in adhesives, either a solvent based (very flammable, very fast setting) or water based (non flammable, slower setting) contact cements.",
    "Generally, you will need about 1 quart of adhesive for each 4 X 8 sheet or 32 square feet of countertop.",
    "Purchase disposable paint brushes or a paint roller with a close (short) nap to spread your glue.",
    "Assemble the materials in a workshop or other location with good ventilation and lighting, relatively little dust, and plenty of workbench space.",
    "You will also want to make sure you have the tools you will need to perform the work.",
    "Cut your plywood (or MDF) to the size you want.",
    "If this is going to be a close fit project, you may want to make it slightly larger than you will need so it can be scribed and trimmed to fit.",
    "This is especially critical if you are fitting against an abutting wall or between two walls, as they may not be square (at a true 90 degree angle).",
    "Rip a strip of your plywood about 2 inches (5.1 cm) wide the length of your top for an edge band.",
    "Screw (and glue, if preferred) this strip along the front edge of your top.",
    "Make sure the edge is square and perfectly flush, sanding if necessary to perfect the fit.",
    "Cut the laminate to fit the top.",
    "Usually, you will allow about ⁄4 to ⁄2 inch (0.6 to 1.3 cm) overlap so the material can be trimmed to fit after it is glued, since placing it with contact cement on it does not allow for error.",
    "Lay your plywood on a set of saw horses, and place the cut sheet of laminate, bottom up, on a workbench or other surface so you can apply the glue.",
    "You will want to be very careful to keep the plywood and laminate clean after you begin to apply the glue.",
    "Roll or brush a thin coat of contact cement on both the plywood and the back of the laminate, making sure no runs or thick splatters form on either surface, as excess glue will cause a dimple or bump on the finished surface.",
    "Allow the adhesive to dry until all the gloss, or wet appearance disappears.",
    "The glue will cease to be tacky, or wet, to the touch.",
    "Carefully lift the laminate and place it on top of the plywood, aligning it as it is placed along the front edge and ends.",
    "Once the glued surfaces make contact, repositioning them is almost impossible.",
    "Use a soft cloth to press the surface of the laminate, working from the center towards the edges.",
    "This will prevent buckles or bubbles from forming.",
    "Ideally, when the laminate is pressed down, you will have at least an eighth of an inch of overhang all the way around the top.",
    "Cut a piece of laminate for your edge band.",
    "If you are using ⁄4 inch (1.9 cm) thick plywood, you will want the edge band to be about 1 ⁄8 inch (4.1 cm) wide, and at least ⁄4 inch (0.6 cm) longer than the edge it will fit on.",
    "Ideally, you will also want a factory edge to tuck underneath the top laminate at the corner, but if not, you will need to pre-fit the band and trim it so it fits tightly.",
    "Glue the edge band on each exposed edge, applying the contact cement to the plywood edge and the back of the laminate as you did with the top sheet, and allowing it to dry.",
    "Use a router with a laminate trimming bit to trim excess laminate on all edges.",
    "Be careful, if using a tapered trimmer, not to set the bit so deeply that it scuffs the laminate below the thickness of the surface material.",
    "Clean up any glue spots on the surfaces, and fit your countertop into position."
  ],
  "tyn_section":[
    "Laminate and plywood or MDF board.",
    "Contact Cement and application tools.",
    "Circular saw with a fine-toothed blade, or table saw.",
    "Router with a laminate trimming bit.",
    "Measuring tape and chalk line."
  ],
  "tyn_model":[
    "laminate",
    "plywood",
    "glue",
    "contact cement",
    "mdf board",
    "plastic laminate",
    "adhesive",
    "counter top",
    "water",
    "laminate substrate",
    "thermoset glue",
    "adhesives",
    "paint brushes",
    "paint roller",
    "mdf",
    "saw horses",
    "router",
    "laminate trimming bit",
    "tapered trimmer"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.2,
    "p":0.0526315789,
    "f1":0.0833333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}