{
  "title":"How to Make Needlepoint Pillows",
  "url":"https://www.wikihow.com/Make-Needlepoint-Pillows",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Needlepoint"
  ],
  "steps":[
    {
      "headline":"Become familiar with basic ways to make a pillow.",
      "description":""
    },
    {
      "headline":"Block your canvas to make it perfectly \"square\".",
      "description":""
    },
    {
      "headline":"Note: Most needlework projects should already be square.",
      "description":"\"Blocking\" is the process of pulling/steaming the fabric back into squareness if your stitching has inadvertently pulled it somewhat off of square."
    },
    {
      "headline":"Measure fabric for your back.",
      "description":"It should be cut from a sturdy material. Allow at least an inch (2.5 cm) of seam allowance over and above your needle point pattern. Note: Avoid using thin materials such as poplin, sheeting, etc. Use something heavier like Twill, Corduroy, Denim, etc. instead. Also: You should NEVER cut into your stitched pattern. Avoid even cutting closer than a half inch to your needle pointed area. The canvas unravels easily in most cases, and you will need that canvas area to sew your backing to."
    },
    {
      "headline":"Lay your canvas and pillow back on top of each other with \"right\" sides facing.",
      "description":""
    },
    {
      "headline":"Pin or hand baste the edges, leaving several inches to \"turn\" the pillow right side out.",
      "description":""
    },
    {
      "headline":"Stitch around the perimeter from the canvas side so that you can see where your pattern edges are.",
      "description":""
    },
    {
      "headline":"Leave a section un- sewn so that you can turn the pillow right side out.",
      "description":""
    },
    {
      "headline":"Sew the pillow seam just inside the pattern lines... by approximately 1/16th of an inch or a cm or two.",
      "description":""
    },
    {
      "headline":"Reinforce the seam by stitching a second seam just outside of the first.",
      "description":"If you stitch on the exact line, it's okay, but two lines around 1 centimeter (0.4 in) apart work well. You can also \"zigzag\" or \"Satin Stitch\" outside of your main seam with your sewing machine."
    },
    {
      "headline":"Miter cut the corners.",
      "description":""
    },
    {
      "headline":"Turn the pillow right side out, taking care to push the corners out carefully.",
      "description":"(too much force, and you'll poke through the seams and have to re-sew the corners...)"
    },
    {
      "headline":"Stuff the pillow.",
      "description":""
    },
    {
      "headline":"Sew the remaining opening closed using the Blind Stitch.",
      "description":""
    }
  ],
  "text":" Become familiar with basic ways to make a pillow.  Block your canvas to make it perfectly \"square\".  Note: Most needlework projects should already be square. \"Blocking\" is the process of pulling/steaming the fabric back into squareness if your stitching has inadvertently pulled it somewhat off of square. Measure fabric for your back. It should be cut from a sturdy material. Allow at least an inch (2.5 cm) of seam allowance over and above your needle point pattern. Note: Avoid using thin materials such as poplin, sheeting, etc. Use something heavier like Twill, Corduroy, Denim, etc. instead. Also: You should NEVER cut into your stitched pattern. Avoid even cutting closer than a half inch to your needle pointed area. The canvas unravels easily in most cases, and you will need that canvas area to sew your backing to. Lay your canvas and pillow back on top of each other with \"right\" sides facing.  Pin or hand baste the edges, leaving several inches to \"turn\" the pillow right side out.  Stitch around the perimeter from the canvas side so that you can see where your pattern edges are.  Leave a section un- sewn so that you can turn the pillow right side out.  Sew the pillow seam just inside the pattern lines... by approximately 1/16th of an inch or a cm or two.  Reinforce the seam by stitching a second seam just outside of the first. If you stitch on the exact line, it's okay, but two lines around 1 centimeter (0.4 in) apart work well. You can also \"zigzag\" or \"Satin Stitch\" outside of your main seam with your sewing machine. Miter cut the corners.  Turn the pillow right side out, taking care to push the corners out carefully. (too much force, and you'll poke through the seams and have to re-sew the corners...) Stuff the pillow.  Sew the remaining opening closed using the Blind Stitch. ",
  "sentences":[
    " Become familiar with basic ways to make a pillow.",
    "Block your canvas to make it perfectly \"square\".",
    "Note: Most needlework projects should already be square.",
    "\"Blocking\" is the process of pulling/steaming the fabric back into squareness if your stitching has inadvertently pulled it somewhat off of square.",
    "Measure fabric for your back.",
    "It should be cut from a sturdy material.",
    "Allow at least an inch (2.5 cm) of seam allowance over and above your needle point pattern.",
    "Note: Avoid using thin materials such as poplin, sheeting, etc.",
    "Use something heavier like Twill, Corduroy, Denim, etc.",
    "instead.",
    "Also: You should NEVER cut into your stitched pattern.",
    "Avoid even cutting closer than a half inch to your needle pointed area.",
    "The canvas unravels easily in most cases, and you will need that canvas area to sew your backing to.",
    "Lay your canvas and pillow back on top of each other with \"right\" sides facing.",
    "Pin or hand baste the edges, leaving several inches to \"turn\" the pillow right side out.",
    "Stitch around the perimeter from the canvas side so that you can see where your pattern edges are.",
    "Leave a section un- sewn so that you can turn the pillow right side out.",
    "Sew the pillow seam just inside the pattern lines... by approximately 1/16th of an inch or a cm or two.",
    "Reinforce the seam by stitching a second seam just outside of the first.",
    "If you stitch on the exact line, it's okay, but two lines around 1 centimeter (0.4 in) apart work well.",
    "You can also \"zigzag\" or \"Satin Stitch\" outside of your main seam with your sewing machine.",
    "Miter cut the corners.",
    "Turn the pillow right side out, taking care to push the corners out carefully.",
    "(too much force, and you'll poke through the seams and have to re-sew the corners...) Stuff the pillow.",
    "Sew the remaining opening closed using the Blind Stitch."
  ],
  "tyn_section":[
    "Needlework",
    "Sewing Machine",
    "Sewing notions",
    "Stuffing"
  ],
  "tyn_model":[
    "pillow",
    "canvas",
    "fabric",
    "twill",
    "corduroy",
    "sewing machine",
    "miter",
    "blind stitch"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.125,
    "f1":0.1666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.125,
    "f1":0.1666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.125,
    "f1":0.2
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.125,
    "f1":0.1666666667
  }
}