{
  "title":"How to Make an Avocado Dessert",
  "url":"https://www.wikihow.com/Make-an-Avocado-Dessert",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "methods":[
    {
      "name":"Chocolate Avocado Pudding",
      "steps":[
        {
          "headline":"Cut the avocados in 1/2 and scoop the flesh into a food processor.",
          "description":"Put 2 pounds (0.91 kg) ripe avocados on a cutting board and carefully cut lengthwise through both sides of each avocado. Use your hands to twist the sides of the avocado apart. Then, use a spoon to remove the pits and scoop the flesh from each 1/2 into a food processor. There's no need to cut the avocados into chunks since you'll be blending them."
        },
        {
          "headline":"Add milk, cocoa, vanilla, and salt to the food processor.",
          "description":"Pour ⁄4 cup (59 ml) of plain, chocolate, or non-dairy milk into the food processor. Then, add 3 tablespoons of (21 g) of unsweetened cocoa powder, 2 teaspoons (9.9 ml) of vanilla extract or vanilla bean paste, and 1/4 teaspoon (1 g) of salt. For example, use almond milk, soy milk, oat milk, or hemp milk. If you'd like your pudding to have a stronger chocolate flavor, add an extra 2 tablespoons (14 g) of cocoa powder."
        },
        {
          "headline":"Blend the ingredients for 30 to 45 seconds.",
          "description":"Turn on the food processor and blend the ingredients until the avocados are completely smooth. You might have to stop the machine and scrape down the sides if bits of avocado are getting stuck. Set aside the avocado mixture while you prepare the chocolate."
        },
        {
          "headline":"Chop 2 to 3 ounces (30 to 45 g) of chocolate into ⁄2 inch (1.3 cm) pieces.",
          "description":"Put dark or bittersweet chocolate with at least 70% cocoa solids on your cutting board. Then, use a large knife to carefully cut the chocolate into ⁄2 inch (1.3 cm) chunks. It's important to use a dark or bittersweet chocolate so your pudding has a rich flavor."
        },
        {
          "headline":"Microwave the chocolate in 20-second increments until it's melted.",
          "description":"Transfer the chocolate chunks to a microwave-safe bowl and heat the chocolate for 20 seconds. Stir the chocolate and microwave it for another 20 seconds. Stir frequently to help the chocolate melt evenly. It will take 45 to 60 seconds total for the chocolate to melt."
        },
        {
          "headline":"Stir ⁄4 cup (59 ml) of your choice of sweetener into the melted chocolate.",
          "description":"To sweeten your avocado pudding, use sugar, honey, maple syrup, or agave nectar, for instance. Stir the sweetener into the chocolate until it's incorporated. Adding the sweetener will make the melted chocolate thicker."
        },
        {
          "headline":"Scoop the melted chocolate into the avocado mixture.",
          "description":"Take the lid off of the food processor or blender and scrape the melted chocolate into it. Avoid spooning the melted chocolate through the food processor's feeder tube because too much of the chocolate will stick to the tube."
        },
        {
          "headline":"Add coconut cream or a banana to the processor if you want to flavor the pudding.",
          "description":"For a slight coconut flavor, add 1 to 3 tablespoons (19 to 57 g) of coconut cream to the food processor. If you want your pudding to be a little sweeter, add 1/2 of a very ripe banana. The banana will also make the pudding smoother and thicker."
        },
        {
          "headline":"Blend the pudding for 2 minutes or until it's completely smooth.",
          "description":"Put the lid on the food processor and blend the ingredients for 1 minute. Then, stop the processor and scrape down the sides of the processor. Blend the pudding for 1 more minute so it's smooth and thick. If the pudding is too thick for your liking, blend in your choice of milk 1 tablespoon (15 ml) at a time until it's the consistency you want."
        },
        {
          "headline":"Chill the avocado pudding for 20 to 30 minutes before serving it.",
          "description":"Spoon the pudding into a large bowl or individual serving bowls. Cover the pudding with plastic wrap and refrigerate it for 20 to 30 minutes.Tip: The pudding will continue to thicken as it chills so it will become more mousse-like if you chill it longer. Refrigerate leftover pudding in an airtight container for up to 1 day."
        }
      ]
    },
    {
      "name":"Avocado Ice Cream",
      "steps":[
        {
          "headline":"Scoop the flesh from 2 pounds (0.91 kg) of avocados into a blender.",
          "description":"Set the avocados on a cutting board and carefully slice lengthwise down each side of the avocados. Use both hands to twist the sides in opposite directions so the pieces separate. Then, lift the pit out with a spoon and discard it. Use a spoon to scoop the ripe avocado flesh into a blender. If you don't have a blender, use a food processor instead."
        },
        {
          "headline":"Put the sweetened condensed milk, lemon juice, and salt in the blender.",
          "description":"Open a 14-ounce (396 g) can of sweetened condensed milk and scoop it into the blender. Add 2 tablespoons (30 ml) of lemon juice and 1 pinch of sea salt.Variation: For a non-dairy option, substitute coconut cream for the sweetened condensed milk and add 1/2 cup (100 g) of sugar."
        },
        {
          "headline":"Blend the ingredients until they're smooth and transfer them to a mixing bowl.",
          "description":"Blend for at least 30 seconds so there aren't any chunks or pieces of avocado visible. You may need to stop and scrape down the sides of the blender if pieces get stuck. Once the avocado mixture is smooth, pour it into a large mixing bowl and set it aside."
        },
        {
          "headline":"Beat 1 ⁄2 cups (350 ml) of heavy cream in a separate bowl on high speed.",
          "description":"Pour the chilled cream into the bowl of a stand mixer and use a whisk attachment to beat the cream on high speed. Keep beating until the cream holds firm peaks. If you don't have a stand mixer, use a hand mixer instead."
        },
        {
          "headline":"Fold the whipped cream into the avocado mixture until it's incorporated.",
          "description":"Carefully spoon the whipped cream into the bowl using a spatula. To fold the whipped cream, hold the spatula and use a gentle twisting motion with your wrist to curve the spatula around and through the center of the mixture. Keep doing this until there aren't streaks of avocado. It's important to fold the mixture instead of stir it since you're trying to keep the volume in the cream you whipped."
        },
        {
          "headline":"Pour the mixture into a 9 in × 5 in (23 cm × 13 cm) loaf pan and cover it with foil.",
          "description":"Use the back of a spoon to make the mixture level in the pan before you cover it with aluminum foil. If you prefer, put the mixture into an ice cream maker instead. Follow your machine's operating instructions to freeze the avocado ice cream."
        },
        {
          "headline":"Freeze the ice cream for 6 hours before serving it.",
          "description":"Remove the loaf pan once the ice cream is completely firm. Then, scoop the avocado ice cream into serving bowls and enjoy! Because there are no preservatives in this ice cream, store the leftover ice cream in the freezer and use it within 1 day."
        }
      ]
    },
    {
      "name":"Fudgy Avocado Brownies",
      "steps":[
        {
          "headline":"Preheat the oven to 350 °F (177 °C) and line a 9 in × 9 in (23 cm × 23 cm) pan.",
          "description":"Tear off a piece of parchment paper and lay it in the bottom of the baking pan. Set the pan aside while you prepare the batter. If you don't have parchment paper, spray the pan with nonstick cooking spray."
        },
        {
          "headline":"Cut 2 avocados in 1/2 and scoop the flesh into a blender.",
          "description":"Put the ripe avocados on a cutting board and carefully use a knife to cut the avocado lengthwise. Then, twist the avocado apart and use a spoon to scoop out the pit. Take the spoon and scoop the avocado flesh into a blender. If you don't have a blender, use a food processor."
        },
        {
          "headline":"Add 2 eggs, both types of sugar, cocoa, baking soda, salt, and vanilla to the blender.",
          "description":"Crack the eggs into the blender and add 1/2 cup (100 g) of granulated sugar, 2/3 cup (135 g) of packed brown sugar, 2/3 cup (85 g) of cocoa powder, 1 teaspoon (5 g) of baking soda, 1 pinch of salt, and 1 teaspoon (4.9 ml) of vanilla. This recipe doesn't contain flour so it's gluten-free."
        },
        {
          "headline":"Blend the brownie batter for 30 seconds.",
          "description":"Put the lid on and blend the ingredients until the avocado is completely smooth. Stop and scrape down the sides of the blender to ensure that avocado pieces aren't stuck."
        },
        {
          "headline":"Add 1 1/2 cups (262 g) of chocolate chunks and pour the batter into the pan.",
          "description":"Pour the chocolate chips directly into the brownie batter, but don't use the blender to mix them. Pour the batter into the parchment paper-lined pan and use a spatula to scrape all of the batter out.Tip: You might have to spread some of the chocolate chunks around in the pan to distribute them evenly."
        },
        {
          "headline":"Bake the brownies for 20 to 25 minutes.",
          "description":"Put the pan into the preheated oven and cook them until they start to pull away from the edge of the pan. To test if they're done, lightly touch the top of the brownies. If they're done, the brownies will feel firm and will spring back slightly. If your finger leaves an indent, cook the brownies for another 3 to 5 minutes and check them again."
        },
        {
          "headline":"Remove the brownies and cool them for 5 to 10 minutes before serving them.",
          "description":"Turn off the oven and wear oven mitts to take the pan out of the oven. Let the brownies cool for 5 to 10 minutes so they're easier to cut. Serve the brownies warm or at room temperature. Put leftover brownies in an airtight container and refrigerate them for up to 1 week. If you prefer, freeze them for up to 4 months."
        }
      ]
    }
  ],
  "text":" Chocolate Avocado Pudding Cut the avocados in 1/2 and scoop the flesh into a food processor. Put 2 pounds (0.91 kg) ripe avocados on a cutting board and carefully cut lengthwise through both sides of each avocado. Use your hands to twist the sides of the avocado apart. Then, use a spoon to remove the pits and scoop the flesh from each 1/2 into a food processor. There's no need to cut the avocados into chunks since you'll be blending them. Add milk, cocoa, vanilla, and salt to the food processor. Pour ⁄4 cup (59 ml) of plain, chocolate, or non-dairy milk into the food processor. Then, add 3 tablespoons of (21 g) of unsweetened cocoa powder, 2 teaspoons (9.9 ml) of vanilla extract or vanilla bean paste, and 1/4 teaspoon (1 g) of salt. For example, use almond milk, soy milk, oat milk, or hemp milk. If you'd like your pudding to have a stronger chocolate flavor, add an extra 2 tablespoons (14 g) of cocoa powder. Blend the ingredients for 30 to 45 seconds. Turn on the food processor and blend the ingredients until the avocados are completely smooth. You might have to stop the machine and scrape down the sides if bits of avocado are getting stuck. Set aside the avocado mixture while you prepare the chocolate. Chop 2 to 3 ounces (30 to 45 g) of chocolate into ⁄2 inch (1.3 cm) pieces. Put dark or bittersweet chocolate with at least 70% cocoa solids on your cutting board. Then, use a large knife to carefully cut the chocolate into ⁄2 inch (1.3 cm) chunks. It's important to use a dark or bittersweet chocolate so your pudding has a rich flavor. Microwave the chocolate in 20-second increments until it's melted. Transfer the chocolate chunks to a microwave-safe bowl and heat the chocolate for 20 seconds. Stir the chocolate and microwave it for another 20 seconds. Stir frequently to help the chocolate melt evenly. It will take 45 to 60 seconds total for the chocolate to melt. Stir ⁄4 cup (59 ml) of your choice of sweetener into the melted chocolate. To sweeten your avocado pudding, use sugar, honey, maple syrup, or agave nectar, for instance. Stir the sweetener into the chocolate until it's incorporated. Adding the sweetener will make the melted chocolate thicker. Scoop the melted chocolate into the avocado mixture. Take the lid off of the food processor or blender and scrape the melted chocolate into it. Avoid spooning the melted chocolate through the food processor's feeder tube because too much of the chocolate will stick to the tube. Add coconut cream or a banana to the processor if you want to flavor the pudding. For a slight coconut flavor, add 1 to 3 tablespoons (19 to 57 g) of coconut cream to the food processor. If you want your pudding to be a little sweeter, add 1/2 of a very ripe banana. The banana will also make the pudding smoother and thicker. Blend the pudding for 2 minutes or until it's completely smooth. Put the lid on the food processor and blend the ingredients for 1 minute. Then, stop the processor and scrape down the sides of the processor. Blend the pudding for 1 more minute so it's smooth and thick. If the pudding is too thick for your liking, blend in your choice of milk 1 tablespoon (15 ml) at a time until it's the consistency you want. Chill the avocado pudding for 20 to 30 minutes before serving it. Spoon the pudding into a large bowl or individual serving bowls. Cover the pudding with plastic wrap and refrigerate it for 20 to 30 minutes.Tip: The pudding will continue to thicken as it chills so it will become more mousse-like if you chill it longer. Refrigerate leftover pudding in an airtight container for up to 1 day. Avocado Ice Cream Scoop the flesh from 2 pounds (0.91 kg) of avocados into a blender. Set the avocados on a cutting board and carefully slice lengthwise down each side of the avocados. Use both hands to twist the sides in opposite directions so the pieces separate. Then, lift the pit out with a spoon and discard it. Use a spoon to scoop the ripe avocado flesh into a blender. If you don't have a blender, use a food processor instead. Put the sweetened condensed milk, lemon juice, and salt in the blender. Open a 14-ounce (396 g) can of sweetened condensed milk and scoop it into the blender. Add 2 tablespoons (30 ml) of lemon juice and 1 pinch of sea salt.Variation: For a non-dairy option, substitute coconut cream for the sweetened condensed milk and add 1/2 cup (100 g) of sugar. Blend the ingredients until they're smooth and transfer them to a mixing bowl. Blend for at least 30 seconds so there aren't any chunks or pieces of avocado visible. You may need to stop and scrape down the sides of the blender if pieces get stuck. Once the avocado mixture is smooth, pour it into a large mixing bowl and set it aside. Beat 1 ⁄2 cups (350 ml) of heavy cream in a separate bowl on high speed. Pour the chilled cream into the bowl of a stand mixer and use a whisk attachment to beat the cream on high speed. Keep beating until the cream holds firm peaks. If you don't have a stand mixer, use a hand mixer instead. Fold the whipped cream into the avocado mixture until it's incorporated. Carefully spoon the whipped cream into the bowl using a spatula. To fold the whipped cream, hold the spatula and use a gentle twisting motion with your wrist to curve the spatula around and through the center of the mixture. Keep doing this until there aren't streaks of avocado. It's important to fold the mixture instead of stir it since you're trying to keep the volume in the cream you whipped. Pour the mixture into a 9 in × 5 in (23 cm × 13 cm) loaf pan and cover it with foil. Use the back of a spoon to make the mixture level in the pan before you cover it with aluminum foil. If you prefer, put the mixture into an ice cream maker instead. Follow your machine's operating instructions to freeze the avocado ice cream. Freeze the ice cream for 6 hours before serving it. Remove the loaf pan once the ice cream is completely firm. Then, scoop the avocado ice cream into serving bowls and enjoy! Because there are no preservatives in this ice cream, store the leftover ice cream in the freezer and use it within 1 day. Fudgy Avocado Brownies Preheat the oven to 350 °F (177 °C) and line a 9 in × 9 in (23 cm × 23 cm) pan. Tear off a piece of parchment paper and lay it in the bottom of the baking pan. Set the pan aside while you prepare the batter. If you don't have parchment paper, spray the pan with nonstick cooking spray. Cut 2 avocados in 1/2 and scoop the flesh into a blender. Put the ripe avocados on a cutting board and carefully use a knife to cut the avocado lengthwise. Then, twist the avocado apart and use a spoon to scoop out the pit. Take the spoon and scoop the avocado flesh into a blender. If you don't have a blender, use a food processor. Add 2 eggs, both types of sugar, cocoa, baking soda, salt, and vanilla to the blender. Crack the eggs into the blender and add 1/2 cup (100 g) of granulated sugar, 2/3 cup (135 g) of packed brown sugar, 2/3 cup (85 g) of cocoa powder, 1 teaspoon (5 g) of baking soda, 1 pinch of salt, and 1 teaspoon (4.9 ml) of vanilla. This recipe doesn't contain flour so it's gluten-free. Blend the brownie batter for 30 seconds. Put the lid on and blend the ingredients until the avocado is completely smooth. Stop and scrape down the sides of the blender to ensure that avocado pieces aren't stuck. Add 1 1/2 cups (262 g) of chocolate chunks and pour the batter into the pan. Pour the chocolate chips directly into the brownie batter, but don't use the blender to mix them. Pour the batter into the parchment paper-lined pan and use a spatula to scrape all of the batter out.Tip: You might have to spread some of the chocolate chunks around in the pan to distribute them evenly. Bake the brownies for 20 to 25 minutes. Put the pan into the preheated oven and cook them until they start to pull away from the edge of the pan. To test if they're done, lightly touch the top of the brownies. If they're done, the brownies will feel firm and will spring back slightly. If your finger leaves an indent, cook the brownies for another 3 to 5 minutes and check them again. Remove the brownies and cool them for 5 to 10 minutes before serving them. Turn off the oven and wear oven mitts to take the pan out of the oven. Let the brownies cool for 5 to 10 minutes so they're easier to cut. Serve the brownies warm or at room temperature. Put leftover brownies in an airtight container and refrigerate them for up to 1 week. If you prefer, freeze them for up to 4 months.",
  "sentences":[
    " Chocolate Avocado Pudding Cut the avocados in 1/2 and scoop the flesh into a food processor.",
    "Put 2 pounds (0.91 kg) ripe avocados on a cutting board and carefully cut lengthwise through both sides of each avocado.",
    "Use your hands to twist the sides of the avocado apart.",
    "Then, use a spoon to remove the pits and scoop the flesh from each 1/2 into a food processor.",
    "There's no need to cut the avocados into chunks since you'll be blending them.",
    "Add milk, cocoa, vanilla, and salt to the food processor.",
    "Pour ⁄4 cup (59 ml) of plain, chocolate, or non-dairy milk into the food processor.",
    "Then, add 3 tablespoons of (21 g) of unsweetened cocoa powder, 2 teaspoons (9.9 ml) of vanilla extract or vanilla bean paste, and 1/4 teaspoon (1 g) of salt.",
    "For example, use almond milk, soy milk, oat milk, or hemp milk.",
    "If you'd like your pudding to have a stronger chocolate flavor, add an extra 2 tablespoons (14 g) of cocoa powder.",
    "Blend the ingredients for 30 to 45 seconds.",
    "Turn on the food processor and blend the ingredients until the avocados are completely smooth.",
    "You might have to stop the machine and scrape down the sides if bits of avocado are getting stuck.",
    "Set aside the avocado mixture while you prepare the chocolate.",
    "Chop 2 to 3 ounces (30 to 45 g) of chocolate into ⁄2 inch (1.3 cm) pieces.",
    "Put dark or bittersweet chocolate with at least 70% cocoa solids on your cutting board.",
    "Then, use a large knife to carefully cut the chocolate into ⁄2 inch (1.3 cm) chunks.",
    "It's important to use a dark or bittersweet chocolate so your pudding has a rich flavor.",
    "Microwave the chocolate in 20-second increments until it's melted.",
    "Transfer the chocolate chunks to a microwave-safe bowl and heat the chocolate for 20 seconds.",
    "Stir the chocolate and microwave it for another 20 seconds.",
    "Stir frequently to help the chocolate melt evenly.",
    "It will take 45 to 60 seconds total for the chocolate to melt.",
    "Stir ⁄4 cup (59 ml) of your choice of sweetener into the melted chocolate.",
    "To sweeten your avocado pudding, use sugar, honey, maple syrup, or agave nectar, for instance.",
    "Stir the sweetener into the chocolate until it's incorporated.",
    "Adding the sweetener will make the melted chocolate thicker.",
    "Scoop the melted chocolate into the avocado mixture.",
    "Take the lid off of the food processor or blender and scrape the melted chocolate into it.",
    "Avoid spooning the melted chocolate through the food processor's feeder tube because too much of the chocolate will stick to the tube.",
    "Add coconut cream or a banana to the processor if you want to flavor the pudding.",
    "For a slight coconut flavor, add 1 to 3 tablespoons (19 to 57 g) of coconut cream to the food processor.",
    "If you want your pudding to be a little sweeter, add 1/2 of a very ripe banana.",
    "The banana will also make the pudding smoother and thicker.",
    "Blend the pudding for 2 minutes or until it's completely smooth.",
    "Put the lid on the food processor and blend the ingredients for 1 minute.",
    "Then, stop the processor and scrape down the sides of the processor.",
    "Blend the pudding for 1 more minute so it's smooth and thick.",
    "If the pudding is too thick for your liking, blend in your choice of milk 1 tablespoon (15 ml) at a time until it's the consistency you want.",
    "Chill the avocado pudding for 20 to 30 minutes before serving it.",
    "Spoon the pudding into a large bowl or individual serving bowls.",
    "Cover the pudding with plastic wrap and refrigerate it for 20 to 30 minutes.Tip: The pudding will continue to thicken as it chills so it will become more mousse-like if you chill it longer.",
    "Refrigerate leftover pudding in an airtight container for up to 1 day.",
    "Avocado Ice Cream Scoop the flesh from 2 pounds (0.91 kg) of avocados into a blender.",
    "Set the avocados on a cutting board and carefully slice lengthwise down each side of the avocados.",
    "Use both hands to twist the sides in opposite directions so the pieces separate.",
    "Then, lift the pit out with a spoon and discard it.",
    "Use a spoon to scoop the ripe avocado flesh into a blender.",
    "If you don't have a blender, use a food processor instead.",
    "Put the sweetened condensed milk, lemon juice, and salt in the blender.",
    "Open a 14-ounce (396 g) can of sweetened condensed milk and scoop it into the blender.",
    "Add 2 tablespoons (30 ml) of lemon juice and 1 pinch of sea salt.Variation: For a non-dairy option, substitute coconut cream for the sweetened condensed milk and add 1/2 cup (100 g) of sugar.",
    "Blend the ingredients until they're smooth and transfer them to a mixing bowl.",
    "Blend for at least 30 seconds so there aren't any chunks or pieces of avocado visible.",
    "You may need to stop and scrape down the sides of the blender if pieces get stuck.",
    "Once the avocado mixture is smooth, pour it into a large mixing bowl and set it aside.",
    "Beat 1 ⁄2 cups (350 ml) of heavy cream in a separate bowl on high speed.",
    "Pour the chilled cream into the bowl of a stand mixer and use a whisk attachment to beat the cream on high speed.",
    "Keep beating until the cream holds firm peaks.",
    "If you don't have a stand mixer, use a hand mixer instead.",
    "Fold the whipped cream into the avocado mixture until it's incorporated.",
    "Carefully spoon the whipped cream into the bowl using a spatula.",
    "To fold the whipped cream, hold the spatula and use a gentle twisting motion with your wrist to curve the spatula around and through the center of the mixture.",
    "Keep doing this until there aren't streaks of avocado.",
    "It's important to fold the mixture instead of stir it since you're trying to keep the volume in the cream you whipped.",
    "Pour the mixture into a 9 in × 5 in (23 cm × 13 cm) loaf pan and cover it with foil.",
    "Use the back of a spoon to make the mixture level in the pan before you cover it with aluminum foil.",
    "If you prefer, put the mixture into an ice cream maker instead.",
    "Follow your machine's operating instructions to freeze the avocado ice cream.",
    "Freeze the ice cream for 6 hours before serving it.",
    "Remove the loaf pan once the ice cream is completely firm.",
    "Then, scoop the avocado ice cream into serving bowls and enjoy!",
    "Because there are no preservatives in this ice cream, store the leftover ice cream in the freezer and use it within 1 day.",
    "Fudgy Avocado Brownies Preheat the oven to 350 °F (177 °C) and line a 9 in × 9 in (23 cm × 23 cm) pan.",
    "Tear off a piece of parchment paper and lay it in the bottom of the baking pan.",
    "Set the pan aside while you prepare the batter.",
    "If you don't have parchment paper, spray the pan with nonstick cooking spray.",
    "Cut 2 avocados in 1/2 and scoop the flesh into a blender.",
    "Put the ripe avocados on a cutting board and carefully use a knife to cut the avocado lengthwise.",
    "Then, twist the avocado apart and use a spoon to scoop out the pit.",
    "Take the spoon and scoop the avocado flesh into a blender.",
    "If you don't have a blender, use a food processor.",
    "Add 2 eggs, both types of sugar, cocoa, baking soda, salt, and vanilla to the blender.",
    "Crack the eggs into the blender and add 1/2 cup (100 g) of granulated sugar, 2/3 cup (135 g) of packed brown sugar, 2/3 cup (85 g) of cocoa powder, 1 teaspoon (5 g) of baking soda, 1 pinch of salt, and 1 teaspoon (4.9 ml) of vanilla.",
    "This recipe doesn't contain flour so it's gluten-free.",
    "Blend the brownie batter for 30 seconds.",
    "Put the lid on and blend the ingredients until the avocado is completely smooth.",
    "Stop and scrape down the sides of the blender to ensure that avocado pieces aren't stuck.",
    "Add 1 1/2 cups (262 g) of chocolate chunks and pour the batter into the pan.",
    "Pour the chocolate chips directly into the brownie batter, but don't use the blender to mix them.",
    "Pour the batter into the parchment paper-lined pan and use a spatula to scrape all of the batter out.Tip: You might have to spread some of the chocolate chunks around in the pan to distribute them evenly.",
    "Bake the brownies for 20 to 25 minutes.",
    "Put the pan into the preheated oven and cook them until they start to pull away from the edge of the pan.",
    "To test if they're done, lightly touch the top of the brownies.",
    "If they're done, the brownies will feel firm and will spring back slightly.",
    "If your finger leaves an indent, cook the brownies for another 3 to 5 minutes and check them again.",
    "Remove the brownies and cool them for 5 to 10 minutes before serving them.",
    "Turn off the oven and wear oven mitts to take the pan out of the oven.",
    "Let the brownies cool for 5 to 10 minutes so they're easier to cut.",
    "Serve the brownies warm or at room temperature.",
    "Put leftover brownies in an airtight container and refrigerate them for up to 1 week.",
    "If you prefer, freeze them for up to 4 months."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Knife and cutting board",
    "Food processor",
    "Spatula",
    "Serving bowls",
    "Microwave-safe bowl",
    "Blender or food processor",
    "Mixing bowl",
    "Mixer with whisk attachment",
    "9 in × 5 in (23 cm × 13 cm) loaf pan",
    "Aluminum foil",
    "9 in × 9 in (23 cm × 23 cm) pan",
    "Parchment paper"
  ],
  "tyn_model":[
    "blender",
    "chocolate",
    "food processor",
    "avocado",
    "spoon",
    "salt",
    "cream",
    "spatula",
    "ice cream",
    "oven",
    "milk",
    "vanilla",
    "sweetener",
    "sugar",
    "coconut cream",
    "banana",
    "pudding",
    "sweetened condensed milk",
    "whipped cream",
    "parchment paper",
    "cocoa",
    "cocoa powder",
    "avocado pudding",
    "processor",
    "airtight container",
    "stand mixer",
    "loaf pan",
    "avocado ice cream",
    "eggs",
    "baking soda",
    "brownie batter",
    "unsweetened cocoa powder",
    "vanilla extract",
    "vanilla bean paste",
    "almond milk",
    "soy milk",
    "oat milk",
    "hemp milk",
    "cutting board",
    "large knife",
    "microwave-safe bowl",
    "microwave",
    "honey",
    "maple syrup",
    "agave nectar",
    "large bowl",
    "plastic wrap",
    "avocados",
    "lemon",
    "lemon juice",
    "sea salt",
    "mixing bowl",
    "large mixing bowl",
    "heavy cream",
    "whisk",
    "hand mixer",
    "bowl",
    "× 5",
    "× 13",
    "foil",
    "aluminum foil",
    "ice cream maker",
    "× 9",
    "× 23",
    "baking pan",
    "nonstick cooking spray",
    "knife",
    "granulated sugar",
    "brown sugar",
    "chocolate chunks",
    "chocolate chips",
    "pan",
    "oven mitts"
  ],
  "simple_metrics":{
    "r":0.4615384615,
    "p":0.0821917808,
    "f1":0.1395348837,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6153846154,
    "p":0.1506849315,
    "f1":0.242090784
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6153846154,
    "p":0.1643835616,
    "f1":0.2594594595
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4615384615,
    "p":0.095890411,
    "f1":0.1587901701
  }
}