{
  "title":"How to Make Gazpacho",
  "url":"https://www.wikihow.com/Make-Gazpacho",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Making A Traditional Gazpacho",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"You will need the following:\n2 cups (470 ml) cubed crustless day-old bread\n2 garlic cloves\nCoarse sea salt and ground pepper\n2 pounds (0.91 kg) ripe beefsteak tomatoes, seeded\n1 four inch piece of English cucumber\n1 1-inch thick slice of green pepper\n3 teaspoons (15 ml) red wine vinegar\n1 teaspoon (5 ml) sherry vinegar\n1 cup (240 ml) extra virgin olive oil divided into two equal portions, plus more for drizzling\n1 cup (240 ml) cold water\n1 cup (240 ml) torn rustic bread"
        },
        {
          "headline":"Cover 2 cups of day-old bread with cold water.",
          "description":"This will allow the bread to soak up the water. Let this sit for 15 minutes. You will definitely want to use day-old bread for this recipe. Fresh bread will be too soft and will become too soggy."
        },
        {
          "headline":"Put 2 garlic cloves in a small saucepan.",
          "description":"Cover them with water. Bring the water to a boil. Cook the garlic for 3 minutes. Then you should remove it from heat and drain it."
        },
        {
          "headline":"Blend your ingredients.",
          "description":"You will need the garlic, bread, salt, tomatoes, cucumber, bell pepper, and vinegars. Use a powerful blender to do this. Start by transferring the garlic to a blender. Squeeze any excess liquid from bread. Then add the bread to the blender with the garlic. Add the 2 teaspoons of salt, the tomatoes, cucumber, bell pepper and vinegars."
        },
        {
          "headline":"Puree this mixture until it is smooth.",
          "description":"You will want your soup to have a smooth, even texture. With the blender running, add 1/2 cup of olive oil in a steady stream. Blend until this mixture emulsifies. Blend in the cold water, then season the soup with salt and pepper. Refrigerate the soup for at least 3 hours, or overnight."
        },
        {
          "headline":"Make the croutons.",
          "description":"Start by heating 1/2 cup of olive oil in a skillet over medium heat. Heat the oil until it is hot, but not smoking. Add 1 cup of torn rustic bread and fry it, tossing the croutons frequently until they are gold and crisp. Using a slotted spoon, transfer the croutons to a plate lined with paper towel to soak up the oil. Season the croutons with salt and pepper."
        },
        {
          "headline":"Serve the soup in chilled bowls.",
          "description":"This is how this dish is traditionally served. Drizzle a little bit of olive oil on top of each soup bowl. Top the soup with 2-3 croutons. This recipe will make about 6 servings."
        }
      ]
    },
    {
      "name":"Preparing a Green Gazpacho",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"You will need the following: \n\n⁄4 cup (59 ml)white wine vinegar\n3 teaspoons (15 ml) fresh lime juice\n1.5 cups (350 ml) plain Greek yogurt, divided\n\n⁄2 cup (120 ml) olive oil, plus more for drizzling\n4 ounces (110 g) ciabatta or country style bread, crust removed\n1 medium English cucumber, sliced lengthwise with the seeds removed\n1 green bell pepper, coarsely chopped\n4 large tomatillos, husked and quartered\n4 scallions, cut into 1 inch pieces\n2 jalapeños with seeds removed, chopped\n2 garlic cloves, finely grated\n\n⁄4 teaspoon (4 ml) coarse salt, plus more for taste\nHungarian hot paprika, for serving"
        },
        {
          "headline":"Make the soup base.",
          "description":"You will need to mix several ingredients together, then chill them before blending them. Start by whisking together 1/4 cup white wine vinegar, 3 tsp lime juice, 1 cup of Greek yogurt and 1/2 cup olive oil in a bowl until the mixture is smooth. Add 4oz of ciabatta bread, 1 medium English cucumber, 1 green bell pepper, 4 large tomatillos, 4 scallions,2  jalapeños, and 3/4 tsp salt to the yogurt mixture. Toss these ingredients to coat them, making sure the bread is coated well to ensure that it will soak up as much flavor as possible. Cover the mixture and chill it at least 4 hours or overnight."
        },
        {
          "headline":"Puree the bread and vegetable mixture.",
          "description":"Use a high powered blender. Work in batches, blending until the soup base is very smooth. Transfer the soup base to a large bowl\nSeason the gazpacho with salt."
        },
        {
          "headline":"Prepare the soup topping.",
          "description":"This will consist of the remaining yogurt. Whisk the remaining 1/2 cup of Greek yogurt. Thin the yogurt with cold water, a tablespoon at a time, until it is the consistence of heavy cream. Ladle the cold gazpacho into chilled soup bowls. Drizzle each soup bowl with the thinned yogurt and some olive oil. Sprinkle Hungarian hot paprika on top of each bowl to taste. You can make this soup a day ahead. Cover and chill the soup base and mix well before serving."
        }
      ]
    },
    {
      "name":"Making A Non Traditional Watermelon and Tomato Gazpacho with Feta Cheese",
      "steps":[
        {
          "headline":"Consider making a non-traditional, creative twist on gazpacho.",
          "description":"These are very interesting soups that pack in unique ingredients. There are many creative, and unique non-traditional versions of this chilled soup. Many of these variations use different fruits and vegetables in the soup base. However, the techniques used are similar to the original technique. For a creative twist on gazpacho, food writer Mark Bitman suggests a watermelon and tomato gazpacho."
        },
        {
          "headline":"Assemble all the ingredients.",
          "description":"You will need the following: \n1 garlic clove\nAbout 3 pounds (1.4 kg) watermelon with the rind and seeds removed, cut into large chunks\n2 ripe tomatoes, cored and cut into wedges\n2 tablespoons (30 ml) lemon juice\nSalt and black pepper\n4 ounces (110 g) crumbled feta cheese\n\n⁄4 cup (59 ml) olive oil\n\n⁄2 cup (120 ml) chopped basil or mint, for garnish"
        },
        {
          "headline":"Blend the ingredients.",
          "description":"You can blend until smooth or keep the mixture at a chunky texture for this recipe, depending on your preference. Add the garlic clove first and pulse the blender a few times to chop it. Add 3 lb chopped watermelon, 2 chopped ripe tomatoes, 2 T lemon juice, and a sprinkling of salt and pepper. Blend the mixture until it is smooth or chunky. You can add a few ice cubes during this process to keep the blender working. Chill the blended soup base for several hours."
        },
        {
          "headline":"Test the gazpacho for taste.",
          "description":"You want a delicate balance of flavors. You can add more salt or pepper if the soup needs more seasoning. You can also add more lemon juice to increase the acidity of the dish. Remember, you will be adding feta which is a salty cheese."
        },
        {
          "headline":"Serve the gazpacho.",
          "description":"Portion the soup into four chilled bowls. Top each bowl with a small amount of feta cheese. Drizzle the soup with olive oil. Garnish each bowl with chopped basil or mint. For a variation on this recipe, use peaches instead of the watermelon or tomato for another interesting twist on a classic dish!"
        }
      ]
    }
  ],
  "text":" Making A Traditional Gazpacho Gather your ingredients. You will need the following:\n2 cups (470 ml) cubed crustless day-old bread\n2 garlic cloves\nCoarse sea salt and ground pepper\n2 pounds (0.91 kg) ripe beefsteak tomatoes, seeded\n1 four inch piece of English cucumber\n1 1-inch thick slice of green pepper\n3 teaspoons (15 ml) red wine vinegar\n1 teaspoon (5 ml) sherry vinegar\n1 cup (240 ml) extra virgin olive oil divided into two equal portions, plus more for drizzling\n1 cup (240 ml) cold water\n1 cup (240 ml) torn rustic bread Cover 2 cups of day-old bread with cold water. This will allow the bread to soak up the water. Let this sit for 15 minutes. You will definitely want to use day-old bread for this recipe. Fresh bread will be too soft and will become too soggy. Put 2 garlic cloves in a small saucepan. Cover them with water. Bring the water to a boil. Cook the garlic for 3 minutes. Then you should remove it from heat and drain it. Blend your ingredients. You will need the garlic, bread, salt, tomatoes, cucumber, bell pepper, and vinegars. Use a powerful blender to do this. Start by transferring the garlic to a blender. Squeeze any excess liquid from bread. Then add the bread to the blender with the garlic. Add the 2 teaspoons of salt, the tomatoes, cucumber, bell pepper and vinegars. Puree this mixture until it is smooth. You will want your soup to have a smooth, even texture. With the blender running, add 1/2 cup of olive oil in a steady stream. Blend until this mixture emulsifies. Blend in the cold water, then season the soup with salt and pepper. Refrigerate the soup for at least 3 hours, or overnight. Make the croutons. Start by heating 1/2 cup of olive oil in a skillet over medium heat. Heat the oil until it is hot, but not smoking. Add 1 cup of torn rustic bread and fry it, tossing the croutons frequently until they are gold and crisp. Using a slotted spoon, transfer the croutons to a plate lined with paper towel to soak up the oil. Season the croutons with salt and pepper. Serve the soup in chilled bowls. This is how this dish is traditionally served. Drizzle a little bit of olive oil on top of each soup bowl. Top the soup with 2-3 croutons. This recipe will make about 6 servings. Preparing a Green Gazpacho Gather your ingredients. You will need the following: \n\n⁄4 cup (59 ml)white wine vinegar\n3 teaspoons (15 ml) fresh lime juice\n1.5 cups (350 ml) plain Greek yogurt, divided\n\n⁄2 cup (120 ml) olive oil, plus more for drizzling\n4 ounces (110 g) ciabatta or country style bread, crust removed\n1 medium English cucumber, sliced lengthwise with the seeds removed\n1 green bell pepper, coarsely chopped\n4 large tomatillos, husked and quartered\n4 scallions, cut into 1 inch pieces\n2 jalapeños with seeds removed, chopped\n2 garlic cloves, finely grated\n\n⁄4 teaspoon (4 ml) coarse salt, plus more for taste\nHungarian hot paprika, for serving Make the soup base. You will need to mix several ingredients together, then chill them before blending them. Start by whisking together 1/4 cup white wine vinegar, 3 tsp lime juice, 1 cup of Greek yogurt and 1/2 cup olive oil in a bowl until the mixture is smooth. Add 4oz of ciabatta bread, 1 medium English cucumber, 1 green bell pepper, 4 large tomatillos, 4 scallions,2  jalapeños, and 3/4 tsp salt to the yogurt mixture. Toss these ingredients to coat them, making sure the bread is coated well to ensure that it will soak up as much flavor as possible. Cover the mixture and chill it at least 4 hours or overnight. Puree the bread and vegetable mixture. Use a high powered blender. Work in batches, blending until the soup base is very smooth. Transfer the soup base to a large bowl\nSeason the gazpacho with salt. Prepare the soup topping. This will consist of the remaining yogurt. Whisk the remaining 1/2 cup of Greek yogurt. Thin the yogurt with cold water, a tablespoon at a time, until it is the consistence of heavy cream. Ladle the cold gazpacho into chilled soup bowls. Drizzle each soup bowl with the thinned yogurt and some olive oil. Sprinkle Hungarian hot paprika on top of each bowl to taste. You can make this soup a day ahead. Cover and chill the soup base and mix well before serving. Making A Non Traditional Watermelon and Tomato Gazpacho with Feta Cheese Consider making a non-traditional, creative twist on gazpacho. These are very interesting soups that pack in unique ingredients. There are many creative, and unique non-traditional versions of this chilled soup. Many of these variations use different fruits and vegetables in the soup base. However, the techniques used are similar to the original technique. For a creative twist on gazpacho, food writer Mark Bitman suggests a watermelon and tomato gazpacho. Assemble all the ingredients. You will need the following: \n1 garlic clove\nAbout 3 pounds (1.4 kg) watermelon with the rind and seeds removed, cut into large chunks\n2 ripe tomatoes, cored and cut into wedges\n2 tablespoons (30 ml) lemon juice\nSalt and black pepper\n4 ounces (110 g) crumbled feta cheese\n\n⁄4 cup (59 ml) olive oil\n\n⁄2 cup (120 ml) chopped basil or mint, for garnish Blend the ingredients. You can blend until smooth or keep the mixture at a chunky texture for this recipe, depending on your preference. Add the garlic clove first and pulse the blender a few times to chop it. Add 3 lb chopped watermelon, 2 chopped ripe tomatoes, 2 T lemon juice, and a sprinkling of salt and pepper. Blend the mixture until it is smooth or chunky. You can add a few ice cubes during this process to keep the blender working. Chill the blended soup base for several hours. Test the gazpacho for taste. You want a delicate balance of flavors. You can add more salt or pepper if the soup needs more seasoning. You can also add more lemon juice to increase the acidity of the dish. Remember, you will be adding feta which is a salty cheese. Serve the gazpacho. Portion the soup into four chilled bowls. Top each bowl with a small amount of feta cheese. Drizzle the soup with olive oil. Garnish each bowl with chopped basil or mint. For a variation on this recipe, use peaches instead of the watermelon or tomato for another interesting twist on a classic dish!",
  "sentences":[
    " Making A Traditional Gazpacho Gather your ingredients.",
    "You will need the following:\n2 cups (470 ml) cubed crustless day-old bread\n2 garlic cloves\nCoarse sea salt and ground pepper\n2 pounds (0.91 kg) ripe beefsteak tomatoes, seeded\n1 four inch piece of English cucumber\n1 1-inch thick slice of green pepper\n3 teaspoons (15 ml) red wine vinegar\n1 teaspoon (5 ml) sherry vinegar\n1 cup (240 ml) extra virgin olive oil divided into two equal portions, plus more for drizzling\n1 cup (240 ml) cold water\n1 cup (240 ml) torn rustic bread Cover 2 cups of day-old bread with cold water.",
    "This will allow the bread to soak up the water.",
    "Let this sit for 15 minutes.",
    "You will definitely want to use day-old bread for this recipe.",
    "Fresh bread will be too soft and will become too soggy.",
    "Put 2 garlic cloves in a small saucepan.",
    "Cover them with water.",
    "Bring the water to a boil.",
    "Cook the garlic for 3 minutes.",
    "Then you should remove it from heat and drain it.",
    "Blend your ingredients.",
    "You will need the garlic, bread, salt, tomatoes, cucumber, bell pepper, and vinegars.",
    "Use a powerful blender to do this.",
    "Start by transferring the garlic to a blender.",
    "Squeeze any excess liquid from bread.",
    "Then add the bread to the blender with the garlic.",
    "Add the 2 teaspoons of salt, the tomatoes, cucumber, bell pepper and vinegars.",
    "Puree this mixture until it is smooth.",
    "You will want your soup to have a smooth, even texture.",
    "With the blender running, add 1/2 cup of olive oil in a steady stream.",
    "Blend until this mixture emulsifies.",
    "Blend in the cold water, then season the soup with salt and pepper.",
    "Refrigerate the soup for at least 3 hours, or overnight.",
    "Make the croutons.",
    "Start by heating 1/2 cup of olive oil in a skillet over medium heat.",
    "Heat the oil until it is hot, but not smoking.",
    "Add 1 cup of torn rustic bread and fry it, tossing the croutons frequently until they are gold and crisp.",
    "Using a slotted spoon, transfer the croutons to a plate lined with paper towel to soak up the oil.",
    "Season the croutons with salt and pepper.",
    "Serve the soup in chilled bowls.",
    "This is how this dish is traditionally served.",
    "Drizzle a little bit of olive oil on top of each soup bowl.",
    "Top the soup with 2-3 croutons.",
    "This recipe will make about 6 servings.",
    "Preparing a Green Gazpacho Gather your ingredients.",
    "You will need the following: \n\n⁄4 cup (59 ml)white wine vinegar\n3 teaspoons (15 ml) fresh lime juice\n1.5 cups (350 ml) plain Greek yogurt, divided\n\n⁄2 cup (120 ml) olive oil, plus more for drizzling\n4 ounces (110 g) ciabatta or country style bread, crust removed\n1 medium English cucumber, sliced lengthwise with the seeds removed\n1 green bell pepper, coarsely chopped\n4 large tomatillos, husked and quartered\n4 scallions, cut into 1 inch pieces\n2 jalapeños with seeds removed, chopped\n2 garlic cloves, finely grated\n\n⁄4 teaspoon (4 ml) coarse salt, plus more for taste\nHungarian hot paprika, for serving Make the soup base.",
    "You will need to mix several ingredients together, then chill them before blending them.",
    "Start by whisking together 1/4 cup white wine vinegar, 3 tsp lime juice, 1 cup of Greek yogurt and 1/2 cup olive oil in a bowl until the mixture is smooth.",
    "Add 4oz of ciabatta bread, 1 medium English cucumber, 1 green bell pepper, 4 large tomatillos, 4 scallions,2  jalapeños, and 3/4 tsp salt to the yogurt mixture.",
    "Toss these ingredients to coat them, making sure the bread is coated well to ensure that it will soak up as much flavor as possible.",
    "Cover the mixture and chill it at least 4 hours or overnight.",
    "Puree the bread and vegetable mixture.",
    "Use a high powered blender.",
    "Work in batches, blending until the soup base is very smooth.",
    "Transfer the soup base to a large bowl\nSeason the gazpacho with salt.",
    "Prepare the soup topping.",
    "This will consist of the remaining yogurt.",
    "Whisk the remaining 1/2 cup of Greek yogurt.",
    "Thin the yogurt with cold water, a tablespoon at a time, until it is the consistence of heavy cream.",
    "Ladle the cold gazpacho into chilled soup bowls.",
    "Drizzle each soup bowl with the thinned yogurt and some olive oil.",
    "Sprinkle Hungarian hot paprika on top of each bowl to taste.",
    "You can make this soup a day ahead.",
    "Cover and chill the soup base and mix well before serving.",
    "Making A Non Traditional Watermelon and Tomato Gazpacho with Feta Cheese Consider making a non-traditional, creative twist on gazpacho.",
    "These are very interesting soups that pack in unique ingredients.",
    "There are many creative, and unique non-traditional versions of this chilled soup.",
    "Many of these variations use different fruits and vegetables in the soup base.",
    "However, the techniques used are similar to the original technique.",
    "For a creative twist on gazpacho, food writer Mark Bitman suggests a watermelon and tomato gazpacho.",
    "Assemble all the ingredients.",
    "You will need the following: \n1 garlic clove\nAbout 3 pounds (1.4 kg) watermelon with the rind and seeds removed, cut into large chunks\n2 ripe tomatoes, cored and cut into wedges\n2 tablespoons (30 ml) lemon juice\nSalt and black pepper\n4 ounces (110 g) crumbled feta cheese\n\n⁄4 cup (59 ml) olive oil\n\n⁄2 cup (120 ml) chopped basil or mint, for garnish Blend the ingredients.",
    "You can blend until smooth or keep the mixture at a chunky texture for this recipe, depending on your preference.",
    "Add the garlic clove first and pulse the blender a few times to chop it.",
    "Add 3 lb chopped watermelon, 2 chopped ripe tomatoes, 2 T lemon juice, and a sprinkling of salt and pepper.",
    "Blend the mixture until it is smooth or chunky.",
    "You can add a few ice cubes during this process to keep the blender working.",
    "Chill the blended soup base for several hours.",
    "Test the gazpacho for taste.",
    "You want a delicate balance of flavors.",
    "You can add more salt or pepper if the soup needs more seasoning.",
    "You can also add more lemon juice to increase the acidity of the dish.",
    "Remember, you will be adding feta which is a salty cheese.",
    "Serve the gazpacho.",
    "Portion the soup into four chilled bowls.",
    "Top each bowl with a small amount of feta cheese.",
    "Drizzle the soup with olive oil.",
    "Garnish each bowl with chopped basil or mint.",
    "For a variation on this recipe, use peaches instead of the watermelon or tomato for another interesting twist on a classic dish!"
  ],
  "tyn_section":[
    "Blender"
  ],
  "tyn_model":[
    "garlic",
    "olive oil",
    "salt",
    "blender",
    "water",
    "tomatoes",
    "yogurt",
    "cold water",
    "cucumber",
    "salt and pepper",
    "feta cheese",
    "watermelon",
    "day-old bread",
    "english cucumber",
    "bread",
    "bell pepper",
    "vinegars",
    "green bell pepper",
    "tomatillos",
    "jalapeños",
    "hot paprika",
    "greek yogurt",
    "lemon juice",
    "sea salt",
    "ground pepper",
    "beefsteak tomatoes",
    "green pepper",
    "red wine vinegar",
    "sherry vinegar",
    "extra virgin olive oil",
    "small saucepan",
    "skillet",
    "oil",
    "rustic bread",
    "slotted spoon",
    "soup bowl",
    "wine vinegar",
    "fresh lime juice",
    "plain greek yogurt",
    "ciabatta or country style bread",
    "scallions",
    "coarse salt",
    "white wine vinegar",
    "lime juice",
    "bowl",
    "high powered blender",
    "heavy cream",
    "chilled soup",
    "tomato",
    "black pepper",
    "basil",
    "ice cubes",
    "lemon",
    "feta",
    "peaches"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.0181818182,
    "f1":0.0357142857,
    "avg_pos":0.0545454545
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.0181818182,
    "f1":0.0357142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.0363636364,
    "f1":0.0701754386
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.0181818182,
    "f1":0.0357142857
  }
}