{
  "title":"How to Make a Pony Bead Bracelet",
  "url":"https://www.wikihow.com/Make-a-Pony-Bead-Bracelet",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Beading"
  ],
  "steps":[
    {
      "headline":"Buy yourself some Pony beads.",
      "description":"You can find these at just about any craft store, or in the craft section of stores like Walmart and Target. Pony beads are very inexpensive; expect to pay about 2 to 5 dollars for a bag of 500 to 1500 beads."
    },
    {
      "headline":"Procure some string.",
      "description":"This usually isn't too far from the beads. The best kind of string to use is stretchy elastic cord, which comes in many different thicknesses. The best size for this project is around .7 mm. Any smaller is likely to break from stress and any bigger is a bit difficult to tie off effectively."
    },
    {
      "headline":"Plan out your design.",
      "description":"While it is entirely possible to just put random beads on a string and tie it off; your bracelets will look much better if you take a few minutes to plan out your design. Play around with different color combinations and patterns. Take as much time as you want to do this. Come up with a pattern that you really like before moving on."
    },
    {
      "headline":"Once you've decided on a pattern, you need to lay out that pattern and repeat it for as long as you need to make it go all the way around your wrist.",
      "description":"An average bracelet will have approximately 25 to 32 beads on it, depending on the size of your wrist. Small children will usually only need about 20 to 25."
    },
    {
      "headline":"Time to make that bracelet!",
      "description":"Take the loose end of the string and unwind about a foot or so of string from your spool. No, you won't be using all of it, but it's always good to have a little extra room to work with. Now start stringing your beads on. Leave about an inch and a half of string at the loose end."
    },
    {
      "headline":"Tie it together!",
      "description":"Just make two good, tight square knots with your string. Try not to pull so tight that it breaks, but tight enough that it won't come undone. At this point the bracelet will still be attached to the rest of the string on the spool. Use some scissors to cut off the extra string near the knot. Now you've got a totally cool, unique bracelet."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Buy yourself some Pony beads. You can find these at just about any craft store, or in the craft section of stores like Walmart and Target. Pony beads are very inexpensive; expect to pay about 2 to 5 dollars for a bag of 500 to 1500 beads. Procure some string. This usually isn't too far from the beads. The best kind of string to use is stretchy elastic cord, which comes in many different thicknesses. The best size for this project is around .7 mm. Any smaller is likely to break from stress and any bigger is a bit difficult to tie off effectively. Plan out your design. While it is entirely possible to just put random beads on a string and tie it off; your bracelets will look much better if you take a few minutes to plan out your design. Play around with different color combinations and patterns. Take as much time as you want to do this. Come up with a pattern that you really like before moving on. Once you've decided on a pattern, you need to lay out that pattern and repeat it for as long as you need to make it go all the way around your wrist. An average bracelet will have approximately 25 to 32 beads on it, depending on the size of your wrist. Small children will usually only need about 20 to 25. Time to make that bracelet! Take the loose end of the string and unwind about a foot or so of string from your spool. No, you won't be using all of it, but it's always good to have a little extra room to work with. Now start stringing your beads on. Leave about an inch and a half of string at the loose end. Tie it together! Just make two good, tight square knots with your string. Try not to pull so tight that it breaks, but tight enough that it won't come undone. At this point the bracelet will still be attached to the rest of the string on the spool. Use some scissors to cut off the extra string near the knot. Now you've got a totally cool, unique bracelet. Finished. ",
  "sentences":[
    " Buy yourself some Pony beads.",
    "You can find these at just about any craft store, or in the craft section of stores like Walmart and Target.",
    "Pony beads are very inexpensive; expect to pay about 2 to 5 dollars for a bag of 500 to 1500 beads.",
    "Procure some string.",
    "This usually isn't too far from the beads.",
    "The best kind of string to use is stretchy elastic cord, which comes in many different thicknesses.",
    "The best size for this project is around .7 mm.",
    "Any smaller is likely to break from stress and any bigger is a bit difficult to tie off effectively.",
    "Plan out your design.",
    "While it is entirely possible to just put random beads on a string and tie it off; your bracelets will look much better if you take a few minutes to plan out your design.",
    "Play around with different color combinations and patterns.",
    "Take as much time as you want to do this.",
    "Come up with a pattern that you really like before moving on.",
    "Once you've decided on a pattern, you need to lay out that pattern and repeat it for as long as you need to make it go all the way around your wrist.",
    "An average bracelet will have approximately 25 to 32 beads on it, depending on the size of your wrist.",
    "Small children will usually only need about 20 to 25.",
    "Time to make that bracelet!",
    "Take the loose end of the string and unwind about a foot or so of string from your spool.",
    "No, you won't be using all of it, but it's always good to have a little extra room to work with.",
    "Now start stringing your beads on.",
    "Leave about an inch and a half of string at the loose end.",
    "Tie it together!",
    "Just make two good, tight square knots with your string.",
    "Try not to pull so tight that it breaks, but tight enough that it won't come undone.",
    "At this point the bracelet will still be attached to the rest of the string on the spool.",
    "Use some scissors to cut off the extra string near the knot.",
    "Now you've got a totally cool, unique bracelet.",
    "Finished."
  ],
  "tyn_section":[
    "25 to 32 Pony beads",
    ".7 or .8 mm elastic cord",
    "Scissors",
    "Clear nail polish (optional, but recommended)"
  ],
  "tyn_model":[
    "string",
    "beads",
    "pony beads",
    "elastic cord",
    "scissors"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.2,
    "f1":0.2222222222,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.2,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.6,
    "f1":0.6666666667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.2,
    "f1":0.2222222222
  }
}