{
  "title":"How to Make Caramel Corn",
  "url":"https://www.wikihow.com/Make-Caramel-Corn",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Caramel"
  ],
  "parts":[
    {
      "name":"Popping the Corn",
      "steps":[
        {
          "headline":"Get some un-popped corn kernels.",
          "description":"You will need 2 ounces (42 grams) of un-popped corn kernels to make 8 cups (88 grams) of popped popcorn. Be sure to get the plain, un-seasoned kind. You can also pre-popped corn. If you choose to go that route, make sure that you get the plain, unflavored kind, and skip down to {{#sauce|making the caramel sauce}}. You will need 8 cups (88 grams) of popped popcorn."
        },
        {
          "headline":"Heat 1½ tablespoon of oil in a large saucepan over medium-high heat.",
          "description":"Use a heavy-bottomed, 3-quart (3-liter) saucepan. This will ensure that the popcorn has enough room to pop. If your saucepan is smaller, then you will need to do this in two batches. If you don't have vegetable oil or peanut oil, try another type of oil with a high smoking point, such as canola or coconut."
        },
        {
          "headline":"Add three corn kernels, and wait for them to pop.",
          "description":"This will let you know when the saucepan is hot enough for the rest of the popcorn."
        },
        {
          "headline":"Add the rest of the corn kernels, and spread them around.",
          "description":"This will help them get evenly coated with oil. Make sure that the corn kernels are distributed evenly across the bottom of the saucepan."
        },
        {
          "headline":"Cover the saucepan with a lid, then take it off of the stove for 30 seconds.",
          "description":"This will bring everything down to the same temperature. It will help all of the corn kernels to pop at the same time and reduce scorching."
        },
        {
          "headline":"Put the saucepan back onto the stove, and cook the popcorn.",
          "description":"Once the corn kernels start to pop rapidly, shake the saucepan back-and-forth across the burner. This helps the corn pop evenly as well as prevents scorching. Keep the saucepan on the stove until the popping slows down to several seconds apart. Keep the lid tilted open slightly. This will let the steam escape, and give you nice, dry, crispy popcorn."
        },
        {
          "headline":"Turn off the heat, hold the lid down tightly for a few seconds, and shake the saucepan one last time.",
          "description":"Sometimes, not off of the corn kernels pop. This will knock them to the bottom of the saucepan, and pop them."
        },
        {
          "headline":"Transfer the popped corn into a large bowl.",
          "description":"To get rid of any un-popped corn kernels, give the bowl a good shake, then use a cup to scoop the popcorn out and into another bowl."
        }
      ]
    },
    {
      "name":"Making the Sauce and Corn",
      "steps":[
        {
          "headline":"Preheat your oven to 200 to 250ºF (94 to 122ºC).",
          "description":"You will be using the oven to dry the popcorn later on. While it is pre-heating, you can make the caramel sauce."
        },
        {
          "headline":"Melt the butter in a medium-sized saucepan over medium heat, then stir in the sugar, corn syrup, and salt.",
          "description":"Place a medium-sized saucepan on the stove. Cut the butter into cubes, then put it into the saucepan. Let it melt over medium heat, then stir in the sugar, corn syrup, and salt using a rubber spatula."
        },
        {
          "headline":"Bring the mixture to a boil, then let it cook for 4 minutes.",
          "description":"Stir the mixture as it comes to a boil. Once it starts to boil, stop, and set your rubber spatula aside. Let the mixture cook without stirring for 4 minutes. If you have a candy thermometer, use it to test the temperature. The ideal temperature should be between 250 and 300°F (122 and 149°C). If you want extra crunchy popcorn, cook the popcorn until you see wisps of smoke."
        },
        {
          "headline":"Take the saucepan off the stove and stir in the baking soda and vanilla extract.",
          "description":"The caramel may start to fizz at this point, which is fine. Keep stirring until everything is evenly combined."
        }
      ]
    },
    {
      "name":"Finishing the Caramel Corn",
      "steps":[
        {
          "headline":"Slowly pour the caramel sauce over the popcorn.",
          "description":"If you have not already, transfer the popcorn into a large bowl. Pour the caramel over the popcorn slowly, stirring the popcorn as you do so. The corn needs to be evenly coated."
        },
        {
          "headline":"Spread the popcorn across two large, lightly-greased baking dishes.",
          "description":"Lightly grease the baking dishes first, then spread the popcorn across them as evenly as you can. If your baking dishes are small, then you may need to use a third one."
        },
        {
          "headline":"Bake the popcorn for 1 hour, stirring it every 15 minutes.",
          "description":"Carefully place the baking sheets into the oven and set the timer for 1 hour. Give the popcorn a stir with a rubber spatula ever 15 minutes. This will help the popcorn bake evenly, and prevents it from getting soggy."
        },
        {
          "headline":"Take the popcorn out of the oven, spread it onto a sheet of parchment paper, and let it cool.",
          "description":"The popcorn may have clumped together. You can leave it like this, or you can break it apart using a spatula."
        }
      ]
    },
    {
      "name":"Trying Variations",
      "steps":[
        {
          "headline":"Try salted caramel corn.",
          "description":"Increase the salt to 2 teaspoons. Just after you have taken the popcorn out of the oven, sprinkle some sea salt over it."
        },
        {
          "headline":"Give it a crunch with chopped walnuts of pecans.",
          "description":"After you have popped the corn, stir in about 3 cups (375 grams) of chopped walnuts of pecans. Next, stir in your caramel sauce, and proceed with the rest of the recipe."
        },
        {
          "headline":"Add in some color with candy.",
          "description":"Make the caramel corn according to the recipe, but reserve about ¼ to ½ cup (60 to 120 milliliters) of the sauce. After the popcorn has cooled, spread it out onto a baking sheet lined with parchment paper, and drizzle the rest of the caramel sauce over it. Toss in a handful of mini chocolate caramels, such as Rollo's, and another handful of candy-coated chocolates, such as M&Ms. Stir everything together, and serve. M&Ms come in seasonal blends and colors, such as red and green for Christmas, and orange, yellow, and brown for Halloween/Thanksgiving."
        },
        {
          "headline":"Add some spices to the caramel sauce.",
          "description":"After you have finished the sauce, stir in some of your favorite ground baking spices along with the vanilla extract. You will need at least 3 teaspoons. Great options include pumpkin pie spice, apple pie spice, and cinnamon."
        },
        {
          "headline":"Make some \"zebra\" caramel corn.",
          "description":"Make your caramel corn first, then let it cool. Melt ½ cup (90 grams) of semi-sweet chocolate chips in the microwave on medium for 2 minutes. Give it a stir, then heat it at 20-second intervals, stirring in between, until it is smooth. Drizzle it over the caramel corn. Repeat with ½ cup (90 grams) of white chocolate ships. Wait for the chocolate to harden, then serve."
        }
      ]
    }
  ],
  "text":" Popping the Corn Get some un-popped corn kernels. You will need 2 ounces (42 grams) of un-popped corn kernels to make 8 cups (88 grams) of popped popcorn. Be sure to get the plain, un-seasoned kind. You can also pre-popped corn. If you choose to go that route, make sure that you get the plain, unflavored kind, and skip down to {{#sauce|making the caramel sauce}}. You will need 8 cups (88 grams) of popped popcorn. Heat 1½ tablespoon of oil in a large saucepan over medium-high heat. Use a heavy-bottomed, 3-quart (3-liter) saucepan. This will ensure that the popcorn has enough room to pop. If your saucepan is smaller, then you will need to do this in two batches. If you don't have vegetable oil or peanut oil, try another type of oil with a high smoking point, such as canola or coconut. Add three corn kernels, and wait for them to pop. This will let you know when the saucepan is hot enough for the rest of the popcorn. Add the rest of the corn kernels, and spread them around. This will help them get evenly coated with oil. Make sure that the corn kernels are distributed evenly across the bottom of the saucepan. Cover the saucepan with a lid, then take it off of the stove for 30 seconds. This will bring everything down to the same temperature. It will help all of the corn kernels to pop at the same time and reduce scorching. Put the saucepan back onto the stove, and cook the popcorn. Once the corn kernels start to pop rapidly, shake the saucepan back-and-forth across the burner. This helps the corn pop evenly as well as prevents scorching. Keep the saucepan on the stove until the popping slows down to several seconds apart. Keep the lid tilted open slightly. This will let the steam escape, and give you nice, dry, crispy popcorn. Turn off the heat, hold the lid down tightly for a few seconds, and shake the saucepan one last time. Sometimes, not off of the corn kernels pop. This will knock them to the bottom of the saucepan, and pop them. Transfer the popped corn into a large bowl. To get rid of any un-popped corn kernels, give the bowl a good shake, then use a cup to scoop the popcorn out and into another bowl. Making the Sauce and Corn Preheat your oven to 200 to 250ºF (94 to 122ºC). You will be using the oven to dry the popcorn later on. While it is pre-heating, you can make the caramel sauce. Melt the butter in a medium-sized saucepan over medium heat, then stir in the sugar, corn syrup, and salt. Place a medium-sized saucepan on the stove. Cut the butter into cubes, then put it into the saucepan. Let it melt over medium heat, then stir in the sugar, corn syrup, and salt using a rubber spatula. Bring the mixture to a boil, then let it cook for 4 minutes. Stir the mixture as it comes to a boil. Once it starts to boil, stop, and set your rubber spatula aside. Let the mixture cook without stirring for 4 minutes. If you have a candy thermometer, use it to test the temperature. The ideal temperature should be between 250 and 300°F (122 and 149°C). If you want extra crunchy popcorn, cook the popcorn until you see wisps of smoke. Take the saucepan off the stove and stir in the baking soda and vanilla extract. The caramel may start to fizz at this point, which is fine. Keep stirring until everything is evenly combined. Finishing the Caramel Corn Slowly pour the caramel sauce over the popcorn. If you have not already, transfer the popcorn into a large bowl. Pour the caramel over the popcorn slowly, stirring the popcorn as you do so. The corn needs to be evenly coated. Spread the popcorn across two large, lightly-greased baking dishes. Lightly grease the baking dishes first, then spread the popcorn across them as evenly as you can. If your baking dishes are small, then you may need to use a third one. Bake the popcorn for 1 hour, stirring it every 15 minutes. Carefully place the baking sheets into the oven and set the timer for 1 hour. Give the popcorn a stir with a rubber spatula ever 15 minutes. This will help the popcorn bake evenly, and prevents it from getting soggy. Take the popcorn out of the oven, spread it onto a sheet of parchment paper, and let it cool. The popcorn may have clumped together. You can leave it like this, or you can break it apart using a spatula. Trying Variations Try salted caramel corn. Increase the salt to 2 teaspoons. Just after you have taken the popcorn out of the oven, sprinkle some sea salt over it. Give it a crunch with chopped walnuts of pecans. After you have popped the corn, stir in about 3 cups (375 grams) of chopped walnuts of pecans. Next, stir in your caramel sauce, and proceed with the rest of the recipe. Add in some color with candy. Make the caramel corn according to the recipe, but reserve about ¼ to ½ cup (60 to 120 milliliters) of the sauce. After the popcorn has cooled, spread it out onto a baking sheet lined with parchment paper, and drizzle the rest of the caramel sauce over it. Toss in a handful of mini chocolate caramels, such as Rollo's, and another handful of candy-coated chocolates, such as M&Ms. Stir everything together, and serve. M&Ms come in seasonal blends and colors, such as red and green for Christmas, and orange, yellow, and brown for Halloween/Thanksgiving. Add some spices to the caramel sauce. After you have finished the sauce, stir in some of your favorite ground baking spices along with the vanilla extract. You will need at least 3 teaspoons. Great options include pumpkin pie spice, apple pie spice, and cinnamon. Make some \"zebra\" caramel corn. Make your caramel corn first, then let it cool. Melt ½ cup (90 grams) of semi-sweet chocolate chips in the microwave on medium for 2 minutes. Give it a stir, then heat it at 20-second intervals, stirring in between, until it is smooth. Drizzle it over the caramel corn. Repeat with ½ cup (90 grams) of white chocolate ships. Wait for the chocolate to harden, then serve.",
  "sentences":[
    " Popping the Corn Get some un-popped corn kernels.",
    "You will need 2 ounces (42 grams) of un-popped corn kernels to make 8 cups (88 grams) of popped popcorn.",
    "Be sure to get the plain, un-seasoned kind.",
    "You can also pre-popped corn.",
    "If you choose to go that route, make sure that you get the plain, unflavored kind, and skip down to {{#sauce|making the caramel sauce}}.",
    "You will need 8 cups (88 grams) of popped popcorn.",
    "Heat 1½ tablespoon of oil in a large saucepan over medium-high heat.",
    "Use a heavy-bottomed, 3-quart (3-liter) saucepan.",
    "This will ensure that the popcorn has enough room to pop.",
    "If your saucepan is smaller, then you will need to do this in two batches.",
    "If you don't have vegetable oil or peanut oil, try another type of oil with a high smoking point, such as canola or coconut.",
    "Add three corn kernels, and wait for them to pop.",
    "This will let you know when the saucepan is hot enough for the rest of the popcorn.",
    "Add the rest of the corn kernels, and spread them around.",
    "This will help them get evenly coated with oil.",
    "Make sure that the corn kernels are distributed evenly across the bottom of the saucepan.",
    "Cover the saucepan with a lid, then take it off of the stove for 30 seconds.",
    "This will bring everything down to the same temperature.",
    "It will help all of the corn kernels to pop at the same time and reduce scorching.",
    "Put the saucepan back onto the stove, and cook the popcorn.",
    "Once the corn kernels start to pop rapidly, shake the saucepan back-and-forth across the burner.",
    "This helps the corn pop evenly as well as prevents scorching.",
    "Keep the saucepan on the stove until the popping slows down to several seconds apart.",
    "Keep the lid tilted open slightly.",
    "This will let the steam escape, and give you nice, dry, crispy popcorn.",
    "Turn off the heat, hold the lid down tightly for a few seconds, and shake the saucepan one last time.",
    "Sometimes, not off of the corn kernels pop.",
    "This will knock them to the bottom of the saucepan, and pop them.",
    "Transfer the popped corn into a large bowl.",
    "To get rid of any un-popped corn kernels, give the bowl a good shake, then use a cup to scoop the popcorn out and into another bowl.",
    "Making the Sauce and Corn Preheat your oven to 200 to 250ºF (94 to 122ºC).",
    "You will be using the oven to dry the popcorn later on.",
    "While it is pre-heating, you can make the caramel sauce.",
    "Melt the butter in a medium-sized saucepan over medium heat, then stir in the sugar, corn syrup, and salt.",
    "Place a medium-sized saucepan on the stove.",
    "Cut the butter into cubes, then put it into the saucepan.",
    "Let it melt over medium heat, then stir in the sugar, corn syrup, and salt using a rubber spatula.",
    "Bring the mixture to a boil, then let it cook for 4 minutes.",
    "Stir the mixture as it comes to a boil.",
    "Once it starts to boil, stop, and set your rubber spatula aside.",
    "Let the mixture cook without stirring for 4 minutes.",
    "If you have a candy thermometer, use it to test the temperature.",
    "The ideal temperature should be between 250 and 300°F (122 and 149°C).",
    "If you want extra crunchy popcorn, cook the popcorn until you see wisps of smoke.",
    "Take the saucepan off the stove and stir in the baking soda and vanilla extract.",
    "The caramel may start to fizz at this point, which is fine.",
    "Keep stirring until everything is evenly combined.",
    "Finishing the Caramel Corn Slowly pour the caramel sauce over the popcorn.",
    "If you have not already, transfer the popcorn into a large bowl.",
    "Pour the caramel over the popcorn slowly, stirring the popcorn as you do so.",
    "The corn needs to be evenly coated.",
    "Spread the popcorn across two large, lightly-greased baking dishes.",
    "Lightly grease the baking dishes first, then spread the popcorn across them as evenly as you can.",
    "If your baking dishes are small, then you may need to use a third one.",
    "Bake the popcorn for 1 hour, stirring it every 15 minutes.",
    "Carefully place the baking sheets into the oven and set the timer for 1 hour.",
    "Give the popcorn a stir with a rubber spatula ever 15 minutes.",
    "This will help the popcorn bake evenly, and prevents it from getting soggy.",
    "Take the popcorn out of the oven, spread it onto a sheet of parchment paper, and let it cool.",
    "The popcorn may have clumped together.",
    "You can leave it like this, or you can break it apart using a spatula.",
    "Trying Variations Try salted caramel corn.",
    "Increase the salt to 2 teaspoons.",
    "Just after you have taken the popcorn out of the oven, sprinkle some sea salt over it.",
    "Give it a crunch with chopped walnuts of pecans.",
    "After you have popped the corn, stir in about 3 cups (375 grams) of chopped walnuts of pecans.",
    "Next, stir in your caramel sauce, and proceed with the rest of the recipe.",
    "Add in some color with candy.",
    "Make the caramel corn according to the recipe, but reserve about ¼ to ½ cup (60 to 120 milliliters) of the sauce.",
    "After the popcorn has cooled, spread it out onto a baking sheet lined with parchment paper, and drizzle the rest of the caramel sauce over it.",
    "Toss in a handful of mini chocolate caramels, such as Rollo's, and another handful of candy-coated chocolates, such as M&Ms.",
    "Stir everything together, and serve.",
    "M&Ms come in seasonal blends and colors, such as red and green for Christmas, and orange, yellow, and brown for Halloween/Thanksgiving.",
    "Add some spices to the caramel sauce.",
    "After you have finished the sauce, stir in some of your favorite ground baking spices along with the vanilla extract.",
    "You will need at least 3 teaspoons.",
    "Great options include pumpkin pie spice, apple pie spice, and cinnamon.",
    "Make some \"zebra\" caramel corn.",
    "Make your caramel corn first, then let it cool.",
    "Melt ½ cup (90 grams) of semi-sweet chocolate chips in the microwave on medium for 2 minutes.",
    "Give it a stir, then heat it at 20-second intervals, stirring in between, until it is smooth.",
    "Drizzle it over the caramel corn.",
    "Repeat with ½ cup (90 grams) of white chocolate ships.",
    "Wait for the chocolate to harden, then serve."
  ],
  "tyn_section":[
    "Heavy-bottomed, 3-quart (3-liter) saucepan",
    "Rubber spatula",
    "Large mixing bowl",
    "Medium-sized saucepan",
    "2 baking sheets/dishes",
    "Wax paper"
  ],
  "tyn_model":[
    "saucepan",
    "popcorn",
    "stove",
    "oven",
    "caramel sauce",
    "caramel corn",
    "oil",
    "salt",
    "rubber spatula",
    "baking dishes",
    "large bowl",
    "bowl",
    "butter",
    "medium-sized saucepan",
    "sugar",
    "corn syrup",
    "vanilla extract",
    "parchment paper",
    "corn",
    "large saucepan",
    "vegetable oil",
    "canola",
    "coconut",
    "candy thermometer",
    "baking soda",
    "caramel",
    "baking sheets",
    "spatula",
    "salted caramel corn",
    "sea salt",
    "pecans",
    "candy",
    "baking sheet",
    "candy-coated chocolates",
    "spices",
    "baking spices",
    "pumpkin pie spice",
    "apple pie spice",
    "cinnamon",
    "semi-sweet chocolate chips",
    "microwave",
    "white chocolate",
    "chocolate"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0465116279,
    "f1":0.0816326531,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1162790698,
    "f1":0.1886792453
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.1860465116,
    "f1":0.2909090909
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0697674419,
    "f1":0.1224489796
  }
}