{
  "title":"How to Reseed a Lawn with Weeds",
  "url":"https://www.wikihow.com/Reseed-a-Lawn-with-Weeds",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Lawn Care",
    "Lawn Problems",
    "Lawn Weeds"
  ],
  "methods":[
    {
      "name":"Testing Your Lawn and Getting the Right Seed",
      "steps":[
        {
          "headline":"Dig up samples of your lawn’s soil.",
          "description":"Use a spade to dig 6 inches (15 cm) into the ground in 3 different spots on your lawn. Separate the dirt from rocks and grass and scoop them into a container."
        },
        {
          "headline":"Send samples of your soil to a local extension office or garden center.",
          "description":"Call a local garden center or extension office and ask them if they can test your soil for nutrient deficiencies and pH level. Send the soil to them after talking with them to get an analysis of what kind fertilizers and amendments you should use. You can also purchase a pH test at a gardening store, though it won't be as comprehensive as sending in your soil for a professional evaluation. The garden center or extension office will also be able to identify any existing issues with your lawn."
        },
        {
          "headline":"Purchase the proper grass seeds.",
          "description":"If it gets cold in the fall and winter where you are, you’ll want to purchase cool-season grass seed such as bentgrass, bluegrass, and tall fescue. If you live in an area that has a warm climate year-round, you’ll want to get warm-season grasses such as Bermuda, centipede, and zoysia. You can also purchase a mixture of seed to repair damaged lawns or protect your grass from drought conditions. Warm-season seeds do better in hot drought conditions, while cool-season seeds do better in the shade and cold conditions."
        },
        {
          "headline":"Reseed your lawn at the proper time of year.",
          "description":"If you are planting cool-season grass, you want to plant it in the fall or spring. During these times the soil is warm but the air is cool, creating the perfect grass growing conditions. If you are planting warm-season grass, you should plant the seed in late-spring or mid-summer."
        }
      ]
    },
    {
      "name":"Performing Spot Weeding and Seeding",
      "steps":[
        {
          "headline":"Dig up roots with a spade or deweeding tool.",
          "description":"Hold the spade or deweeding tool 1 inch (2.5 cm) away from the base of the weed. Angle your tool downward towards the center of the weed, trying not to sever any of the roots. Push down on the handle of your tool to uproot the weed."
        },
        {
          "headline":"Remove any remaining weed roots.",
          "description":"Severed roots will cause new weeds to sprout. Dig up any weed stems that you see and discard them in a garbage bag along with the weeds."
        },
        {
          "headline":"Sprinkle moist compost over the spot that you pulled.",
          "description":"Use a soil-based compost that’s high in organic material to promote the growth of new grass. Lay down 1–2 inches (2.5–5.1 cm) of compost."
        },
        {
          "headline":"Scatter grass seeds over the compost.",
          "description":"Lay down a handful of seeds over the compost. The seeds should cover the area in a thin layer. The seeds should not pile up. If the compost you used was moist, you don’t need to water the seeds anymore."
        },
        {
          "headline":"Cover the compost with fleece.",
          "description":"Horticultural fleece or nets can be purchased at gardening stores or online. This will prevent animals like squirrels or birds from eating the grass seed before it has time to germinate. Lay the fleece over the area where you laid compost and grass seed."
        },
        {
          "headline":"Secure the fleece with wooden stakes.",
          "description":"Use small wooden stakes, nails, or branches to secure the fleece in all 4 corners. This should keep the grass seed covered."
        },
        {
          "headline":"Remove the fleece after a week or 2.",
          "description":"Warm-season grass could take up to 24 days to germinate. Cool-season grass will typically germinate in under 2 weeks. Once the grass seed starts to sprout into grass, you can remove the fleece and allow the grass to mature. It may take several weeks for the spot to fully fill in."
        },
        {
          "headline":"Weed the lawn once the grass has grown 2–3 inches (5.1–7.6 cm).",
          "description":"There still may be weed seeds around the area. Once the grass has grown a little, you should watch for any new weeds. Regularly weed the lawn to stop their growth."
        }
      ]
    },
    {
      "name":"Reseeding the Entire Lawn",
      "steps":[
        {
          "headline":"Kill existing grass if you want to start over from scratch.",
          "description":"To completely start over, kill the grass that is currently there. Applying black poly film over the entirety of your lawn will kill the grass underneath. Alternatively, you could lay wet newspaper or cardboard over the grass. Put 6 inches (15 cm) of compost on top of this layer. This method can take up to 2-3 weeks for the grass and weeds to fully die. Once the weeds and grass have died, remove the film or paper from your yard."
        },
        {
          "headline":"Mow your grass so it’s 1.5 inches (3.8 cm) long.",
          "description":"Put a collection bag on the back of your lawnmower so that it collects all of the clippings and cut weeds. Set the mower to cut 1.5 inches (3.8 cm) and go over your entire lawn and cut it to the same length. Not using a collection bag can spread weed seeds back onto your lawn."
        },
        {
          "headline":"Rake up loose grass and weeds.",
          "description":"Go over the lawn with a stiff rake and pile up loose grass and weeds. Put the excess weeds and old grass into garbage bags. Remove any excess weeds or grass that are on the surface of the lawn before moving onto the next step."
        },
        {
          "headline":"Lay ⁄2 inch (1.3 cm) layer of compost over your lawn.",
          "description":"Wear a pair of gloves and start to spread the compost over the surface your lawn. Then, use a rake to level out the compost so that it’s even ⁄2 inch (1.3 cm) layer on your lawn. If you got your lawn tested, you can use a compost with the specific nutrients that your lawn needs to be healthy."
        },
        {
          "headline":"Spread fertilizer over your lawn with a broadcast spreader.",
          "description":"Fill the hopper in your broadcast spreader with a 9-3-4 balanced fertilizer. Lay down 1 pound (450 g) of fertilizer for every 1,000 square feet (93 m). You can rent or purchase a broadcast spreader from a hardware or gardening store. This fertilizer will encourage the growth of your newly planted grass seed. 9-3-4 stands for 9 parts nitrogen, 3 parts phosphorus, and 4 parts potassium."
        },
        {
          "headline":"Spread grass seed across the surface of your lawn.",
          "description":"Use a broadcast spreader to lay 7 pounds (3,200 g) of seed per 1,000 square feet (93 m) of lawn. Fill the hopper of the spreader up with the appropriate amount of grass seed. Then, run the spreader across the surface of your lawn. For example, if you had a 1,500 square feet (140 m) lawn, you'd need to distribute 10 pounds (4,500 g) of seed over the lawn."
        },
        {
          "headline":"Use the backside of the rake to spread the grass seed.",
          "description":"Distribute the seeds as evenly as you can with the backside of the rake so that it grows evenly. Rake around the compost so that it mixes in with the seeds and the seeds become embedded in the compost."
        },
        {
          "headline":"Water the lawn twice a day.",
          "description":"Lightly water the lawn so you don't wash away the seeds. Water the lawn once in the morning and once when the sun goes down. Continue watering the lawn 2 times a day until the seeds start to germinate and grass starts to grow. From there, you can regularly maintain your lawn."
        }
      ]
    }
  ],
  "text":" Testing Your Lawn and Getting the Right Seed Dig up samples of your lawn’s soil. Use a spade to dig 6 inches (15 cm) into the ground in 3 different spots on your lawn. Separate the dirt from rocks and grass and scoop them into a container. Send samples of your soil to a local extension office or garden center. Call a local garden center or extension office and ask them if they can test your soil for nutrient deficiencies and pH level. Send the soil to them after talking with them to get an analysis of what kind fertilizers and amendments you should use. You can also purchase a pH test at a gardening store, though it won't be as comprehensive as sending in your soil for a professional evaluation. The garden center or extension office will also be able to identify any existing issues with your lawn. Purchase the proper grass seeds. If it gets cold in the fall and winter where you are, you’ll want to purchase cool-season grass seed such as bentgrass, bluegrass, and tall fescue. If you live in an area that has a warm climate year-round, you’ll want to get warm-season grasses such as Bermuda, centipede, and zoysia. You can also purchase a mixture of seed to repair damaged lawns or protect your grass from drought conditions. Warm-season seeds do better in hot drought conditions, while cool-season seeds do better in the shade and cold conditions. Reseed your lawn at the proper time of year. If you are planting cool-season grass, you want to plant it in the fall or spring. During these times the soil is warm but the air is cool, creating the perfect grass growing conditions. If you are planting warm-season grass, you should plant the seed in late-spring or mid-summer. Performing Spot Weeding and Seeding Dig up roots with a spade or deweeding tool. Hold the spade or deweeding tool 1 inch (2.5 cm) away from the base of the weed. Angle your tool downward towards the center of the weed, trying not to sever any of the roots. Push down on the handle of your tool to uproot the weed. Remove any remaining weed roots. Severed roots will cause new weeds to sprout. Dig up any weed stems that you see and discard them in a garbage bag along with the weeds. Sprinkle moist compost over the spot that you pulled. Use a soil-based compost that’s high in organic material to promote the growth of new grass. Lay down 1–2 inches (2.5–5.1 cm) of compost. Scatter grass seeds over the compost. Lay down a handful of seeds over the compost. The seeds should cover the area in a thin layer. The seeds should not pile up. If the compost you used was moist, you don’t need to water the seeds anymore. Cover the compost with fleece. Horticultural fleece or nets can be purchased at gardening stores or online. This will prevent animals like squirrels or birds from eating the grass seed before it has time to germinate. Lay the fleece over the area where you laid compost and grass seed. Secure the fleece with wooden stakes. Use small wooden stakes, nails, or branches to secure the fleece in all 4 corners. This should keep the grass seed covered. Remove the fleece after a week or 2. Warm-season grass could take up to 24 days to germinate. Cool-season grass will typically germinate in under 2 weeks. Once the grass seed starts to sprout into grass, you can remove the fleece and allow the grass to mature. It may take several weeks for the spot to fully fill in. Weed the lawn once the grass has grown 2–3 inches (5.1–7.6 cm). There still may be weed seeds around the area. Once the grass has grown a little, you should watch for any new weeds. Regularly weed the lawn to stop their growth. Reseeding the Entire Lawn Kill existing grass if you want to start over from scratch. To completely start over, kill the grass that is currently there. Applying black poly film over the entirety of your lawn will kill the grass underneath. Alternatively, you could lay wet newspaper or cardboard over the grass. Put 6 inches (15 cm) of compost on top of this layer. This method can take up to 2-3 weeks for the grass and weeds to fully die. Once the weeds and grass have died, remove the film or paper from your yard. Mow your grass so it’s 1.5 inches (3.8 cm) long. Put a collection bag on the back of your lawnmower so that it collects all of the clippings and cut weeds. Set the mower to cut 1.5 inches (3.8 cm) and go over your entire lawn and cut it to the same length. Not using a collection bag can spread weed seeds back onto your lawn. Rake up loose grass and weeds. Go over the lawn with a stiff rake and pile up loose grass and weeds. Put the excess weeds and old grass into garbage bags. Remove any excess weeds or grass that are on the surface of the lawn before moving onto the next step. Lay ⁄2 inch (1.3 cm) layer of compost over your lawn. Wear a pair of gloves and start to spread the compost over the surface your lawn. Then, use a rake to level out the compost so that it’s even ⁄2 inch (1.3 cm) layer on your lawn. If you got your lawn tested, you can use a compost with the specific nutrients that your lawn needs to be healthy. Spread fertilizer over your lawn with a broadcast spreader. Fill the hopper in your broadcast spreader with a 9-3-4 balanced fertilizer. Lay down 1 pound (450 g) of fertilizer for every 1,000 square feet (93 m). You can rent or purchase a broadcast spreader from a hardware or gardening store. This fertilizer will encourage the growth of your newly planted grass seed. 9-3-4 stands for 9 parts nitrogen, 3 parts phosphorus, and 4 parts potassium. Spread grass seed across the surface of your lawn. Use a broadcast spreader to lay 7 pounds (3,200 g) of seed per 1,000 square feet (93 m) of lawn. Fill the hopper of the spreader up with the appropriate amount of grass seed. Then, run the spreader across the surface of your lawn. For example, if you had a 1,500 square feet (140 m) lawn, you'd need to distribute 10 pounds (4,500 g) of seed over the lawn. Use the backside of the rake to spread the grass seed. Distribute the seeds as evenly as you can with the backside of the rake so that it grows evenly. Rake around the compost so that it mixes in with the seeds and the seeds become embedded in the compost. Water the lawn twice a day. Lightly water the lawn so you don't wash away the seeds. Water the lawn once in the morning and once when the sun goes down. Continue watering the lawn 2 times a day until the seeds start to germinate and grass starts to grow. From there, you can regularly maintain your lawn.",
  "sentences":[
    " Testing Your Lawn and Getting the Right Seed Dig up samples of your lawn’s soil.",
    "Use a spade to dig 6 inches (15 cm) into the ground in 3 different spots on your lawn.",
    "Separate the dirt from rocks and grass and scoop them into a container.",
    "Send samples of your soil to a local extension office or garden center.",
    "Call a local garden center or extension office and ask them if they can test your soil for nutrient deficiencies and pH level.",
    "Send the soil to them after talking with them to get an analysis of what kind fertilizers and amendments you should use.",
    "You can also purchase a pH test at a gardening store, though it won't be as comprehensive as sending in your soil for a professional evaluation.",
    "The garden center or extension office will also be able to identify any existing issues with your lawn.",
    "Purchase the proper grass seeds.",
    "If it gets cold in the fall and winter where you are, you’ll want to purchase cool-season grass seed such as bentgrass, bluegrass, and tall fescue.",
    "If you live in an area that has a warm climate year-round, you’ll want to get warm-season grasses such as Bermuda, centipede, and zoysia.",
    "You can also purchase a mixture of seed to repair damaged lawns or protect your grass from drought conditions.",
    "Warm-season seeds do better in hot drought conditions, while cool-season seeds do better in the shade and cold conditions.",
    "Reseed your lawn at the proper time of year.",
    "If you are planting cool-season grass, you want to plant it in the fall or spring.",
    "During these times the soil is warm but the air is cool, creating the perfect grass growing conditions.",
    "If you are planting warm-season grass, you should plant the seed in late-spring or mid-summer.",
    "Performing Spot Weeding and Seeding Dig up roots with a spade or deweeding tool.",
    "Hold the spade or deweeding tool 1 inch (2.5 cm) away from the base of the weed.",
    "Angle your tool downward towards the center of the weed, trying not to sever any of the roots.",
    "Push down on the handle of your tool to uproot the weed.",
    "Remove any remaining weed roots.",
    "Severed roots will cause new weeds to sprout.",
    "Dig up any weed stems that you see and discard them in a garbage bag along with the weeds.",
    "Sprinkle moist compost over the spot that you pulled.",
    "Use a soil-based compost that’s high in organic material to promote the growth of new grass.",
    "Lay down 1–2 inches (2.5–5.1 cm) of compost.",
    "Scatter grass seeds over the compost.",
    "Lay down a handful of seeds over the compost.",
    "The seeds should cover the area in a thin layer.",
    "The seeds should not pile up.",
    "If the compost you used was moist, you don’t need to water the seeds anymore.",
    "Cover the compost with fleece.",
    "Horticultural fleece or nets can be purchased at gardening stores or online.",
    "This will prevent animals like squirrels or birds from eating the grass seed before it has time to germinate.",
    "Lay the fleece over the area where you laid compost and grass seed.",
    "Secure the fleece with wooden stakes.",
    "Use small wooden stakes, nails, or branches to secure the fleece in all 4 corners.",
    "This should keep the grass seed covered.",
    "Remove the fleece after a week or 2.",
    "Warm-season grass could take up to 24 days to germinate.",
    "Cool-season grass will typically germinate in under 2 weeks.",
    "Once the grass seed starts to sprout into grass, you can remove the fleece and allow the grass to mature.",
    "It may take several weeks for the spot to fully fill in.",
    "Weed the lawn once the grass has grown 2–3 inches (5.1–7.6 cm).",
    "There still may be weed seeds around the area.",
    "Once the grass has grown a little, you should watch for any new weeds.",
    "Regularly weed the lawn to stop their growth.",
    "Reseeding the Entire Lawn Kill existing grass if you want to start over from scratch.",
    "To completely start over, kill the grass that is currently there.",
    "Applying black poly film over the entirety of your lawn will kill the grass underneath.",
    "Alternatively, you could lay wet newspaper or cardboard over the grass.",
    "Put 6 inches (15 cm) of compost on top of this layer.",
    "This method can take up to 2-3 weeks for the grass and weeds to fully die.",
    "Once the weeds and grass have died, remove the film or paper from your yard.",
    "Mow your grass so it’s 1.5 inches (3.8 cm) long.",
    "Put a collection bag on the back of your lawnmower so that it collects all of the clippings and cut weeds.",
    "Set the mower to cut 1.5 inches (3.8 cm) and go over your entire lawn and cut it to the same length.",
    "Not using a collection bag can spread weed seeds back onto your lawn.",
    "Rake up loose grass and weeds.",
    "Go over the lawn with a stiff rake and pile up loose grass and weeds.",
    "Put the excess weeds and old grass into garbage bags.",
    "Remove any excess weeds or grass that are on the surface of the lawn before moving onto the next step.",
    "Lay ⁄2 inch (1.3 cm) layer of compost over your lawn.",
    "Wear a pair of gloves and start to spread the compost over the surface your lawn.",
    "Then, use a rake to level out the compost so that it’s even ⁄2 inch (1.3 cm) layer on your lawn.",
    "If you got your lawn tested, you can use a compost with the specific nutrients that your lawn needs to be healthy.",
    "Spread fertilizer over your lawn with a broadcast spreader.",
    "Fill the hopper in your broadcast spreader with a 9-3-4 balanced fertilizer.",
    "Lay down 1 pound (450 g) of fertilizer for every 1,000 square feet (93 m).",
    "You can rent or purchase a broadcast spreader from a hardware or gardening store.",
    "This fertilizer will encourage the growth of your newly planted grass seed.",
    "9-3-4 stands for 9 parts nitrogen, 3 parts phosphorus, and 4 parts potassium.",
    "Spread grass seed across the surface of your lawn.",
    "Use a broadcast spreader to lay 7 pounds (3,200 g) of seed per 1,000 square feet (93 m) of lawn.",
    "Fill the hopper of the spreader up with the appropriate amount of grass seed.",
    "Then, run the spreader across the surface of your lawn.",
    "For example, if you had a 1,500 square feet (140 m) lawn, you'd need to distribute 10 pounds (4,500 g) of seed over the lawn.",
    "Use the backside of the rake to spread the grass seed.",
    "Distribute the seeds as evenly as you can with the backside of the rake so that it grows evenly.",
    "Rake around the compost so that it mixes in with the seeds and the seeds become embedded in the compost.",
    "Water the lawn twice a day.",
    "Lightly water the lawn so you don't wash away the seeds.",
    "Water the lawn once in the morning and once when the sun goes down.",
    "Continue watering the lawn 2 times a day until the seeds start to germinate and grass starts to grow.",
    "From there, you can regularly maintain your lawn."
  ],
  "tyn_section":[
    "Spade or shovel",
    "Container",
    "pH soil test (optional)",
    "Spade or deweeding tool",
    "Moist compost",
    "Grass seeds",
    "Horticultural fleece",
    "Wooden stakes",
    "Lawnmower",
    "Black poly film",
    "Rake",
    "Compost",
    "Balanced fertilizer",
    "Grass seed",
    "Water"
  ],
  "tyn_model":[
    "compost",
    "fleece",
    "grass seed",
    "soil",
    "rake",
    "broadcast spreader",
    "garden center",
    "fertilizer",
    "water",
    "spade",
    "seeds",
    "weed seeds",
    "spreader",
    "rocks",
    "container",
    "fertilizers",
    "tall fescue",
    "seed",
    "grass",
    "spade or deweeding tool",
    "garbage bag",
    "soil-based compost",
    "grass seeds",
    "horticultural fleece",
    "nets",
    "black poly film",
    "newspaper",
    "cardboard",
    "paper",
    "mower",
    "collection bag",
    "garbage bags",
    "9-3-4 balanced fertilizer",
    "gardening store",
    "nitrogen",
    "phosphorus",
    "potassium"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.2432432432,
    "f1":0.3461538462,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7333333333,
    "p":0.4324324324,
    "f1":0.544049459
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.4864864865,
    "f1":0.6050420168
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.2702702703,
    "f1":0.3846153846
  }
}