{
  "title":"How to Pickle Fish",
  "url":"https://www.wikihow.com/Pickle-Fish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "parts":[
    {
      "name":"Brining the Fish",
      "steps":[
        {
          "headline":"Cut your fish into chunks.",
          "description":"While you can pickle full fish or large fillets, you won't get the same control over the process that you do when you cut up the fish. If your fish is freshly caught, clean and gut it first. Then, use a sharp, clean knife to cut your fish into large chunks before you start the brining process. The chunks should be about the size of a large bite of food. You want to be able to eat them, but you don't want them to be so small that they dissolve during the pickling process. For smaller fish like anchovies or herring, you may be able to pickle the whole filet without cutting it up."
        },
        {
          "headline":"Use salt and water to make a weak brine.",
          "description":"Your fish will go through a weak brine before it goes in the heavy, more flavorful brine. Make a weak brine by adding 1 cup of kosher salt or sea salt per every quart of water (about 200 grams per every liter of water), and bringing the solution to a boil. Let the salt dissolve before removing it from the heat. Then, allow the brine to cool. You will need enough brine to completely cover your fish."
        },
        {
          "headline":"Cover your fish with the weak brine.",
          "description":"Once the brine has cooled to room temperature, put your fish fillets or fish chunks in a ceramic or glass container. Pour in enough brine to completely cover the fish, but not so much that you cannot move the dish."
        },
        {
          "headline":"Refrigerate the fish in brine for 8-24 hours.",
          "description":"How long you choose to keep your fish in the weak brine will be a matter of preference. The longer you brine, the more of a pickled flavor you will get. This can work well for stronger fish like pike but may be too much for a more delicate fish like bass."
        },
        {
          "headline":"Drain the brine from the container.",
          "description":"Carefully drain out the brine from the dish into the sink or another container. At this point, you may or may not choose to rinse the fish. Rinsing helps get rid of some of the salty flavor from the brine. If you do rinse, pat the fish dry completely. If you don't rinse, you should still pat the fish to absorb any excess salt."
        },
        {
          "headline":"Cover pike and strongly flavored fish with white vinegar for up to a day.",
          "description":"More delicate fish including salmon and trout don't need to go into vinegar, but stronger fish often do. After you've removed the brine and patted dry your fish, cover it with 5% acidity distilled white vinegar. Put the fish back in the refrigerator and allow it to sit for at least overnight and up to a full day. Once your fish is ready for pickling, drain the vinegar, but don't rinse off the fish. Other fish that may benefit from a vinegar soak include mackerel, sardines, and anchovies."
        }
      ]
    },
    {
      "name":"Pickling the Fish",
      "steps":[
        {
          "headline":"Boil your pickling brine.",
          "description":"A basic pickling brine will combine vinegar, water, spices, and occasionally sugar. Boil these together in a large pot or kettle and let it simmer for 5-10 minutes. To make a basic pickling brine that will work for 10 pounds (4.5 kg) of most fish, combine:\n5 (1.25 liters) cups of water\n2 quarts (2 liters) of distilled white vinegar\n1-2 tbsp (14-28 grams) of ground black pepper or peppercorns\n1 tbsp (14 grams) whole cloves\n2 tbsp mustard seeds (28 grams)\n3-4 bay leaves"
        },
        {
          "headline":"Add different flavors to your brine depending on the fish.",
          "description":"If you just want to use the basic brine, that's fine. You can add different spices and flavors to your brine, though, to bring out the flavor of the fish you're pickling. Common brine additives include:\n¼ teaspoon (about 1 gram) each of whole allspice and dill seed, and ⅓ cup (about 76 grams) granulated sugar for a trout or salmon brine. ¾ cup (about 170 grams) brown sugar and 2 peeled garlic cloves for a perch brine. ½ teaspoon (about 2 grams) of garam masala, a small knob of fresh ginger, and 2-3 dried red chilies, coarsely chopped, for fish like mackerel or blue eye."
        },
        {
          "headline":"Simmer the fish in the brine for 5-10 minutes.",
          "description":"Once your brine is past the boiling point, carefully add your fish and let it simmer on a medium-low heat for at least 5 but no more than 10 minutes. The fish should be easily pierced with a fork, but not flaky or falling apart."
        },
        {
          "headline":"Refrigerate the fish and brine in a shallow pan.",
          "description":"Quickly and carefully move the fish and brine from the stovetop to a shallow glass or ceramic pan. Refrigerate the pan until the brine comes down to at least room temperature."
        },
        {
          "headline":"Pack the fish in sterile glass jars.",
          "description":"Pack the fish in sterile glass jars in thin layers. Between layers of fish, add in thin layers of fresh sliced onions, peppercorns, lemons, and bay leaves. Pack the jar tightly up to the brim for the best results."
        },
        {
          "headline":"Strain the vinegar brine.",
          "description":"Filter the vinegar brine from the shallow dish into a pouring container like a pitcher or jar. Use a mesh sieve to get out any bay leaves, peppercorns, or large spice chunks."
        },
        {
          "headline":"Cover the fish with the strained brine and seal the jars.",
          "description":"Once you filtered your brine, pour it into the jars of fish, filling them up to the brim. Seal the jars immediately. Have a towel ready to soak up excess brine. It's better to overfill and have a little spill out than to underfill and ruin your fish. Fill the jars up as much as possible, and wipe up any excess that may come out when you seal them."
        }
      ]
    },
    {
      "name":"Serving and Storing",
      "steps":[
        {
          "headline":"Refrigerate the jars immediately.",
          "description":"Store the jars of pickled fish in the refrigerator, and they should keep for up to 6 weeks. Make sure the jar is sealed tightly after each time you open it. Always give the fish a smell before serving to make sure it hasn't spoiled. Spoiled fish will smell like mold, rotting meat, or even sulphur. It's a strong odor that's generally hard to miss. If you aren't quite sure, though, it's always best to err on the side of caution."
        },
        {
          "headline":"Eat the fish straight from the jar for a snack or quick meal.",
          "description":"There are many ways you can enjoy your pickled fish, but the easiest is to eat it straight from the jar with no additional preparation. This can make a good side or appetizer for a meal, or a protein to go on top of a salad. Let any excess pickling liquid drain off before serving plain pickled fish. Get a few of the onion slices from the jar, too, to add some extra flavor to your plate."
        },
        {
          "headline":"Make a pickled fish smørrebrød.",
          "description":"Smørrebrød is a traditional Danish open-faced sandwich that often features pickled fish. The more traditional recipes call for herring, but you can use any fish you want. To make your sandwich:\nTrim a slice of rye bread into a straight-edged rectangle. Apply a thin layer of butter over the top side of the bread. Layer on your pickled fish, building it up to your desired amount. Tuck slices of red onion between the layers of pickled fish. Top with fresh dill."
        },
        {
          "headline":"Add pickled fish to a deli salad.",
          "description":"Pickled fish can enhance most deli salads including potato salad, macaroni salad, and most pasta salads. Drain your pickled fish and cut it into bite-sized bits. Then, gently fold it into your favorite deli salad. The fish adds protein and as well as both fatty and acidic flavors."
        }
      ]
    }
  ],
  "text":" Brining the Fish Cut your fish into chunks. While you can pickle full fish or large fillets, you won't get the same control over the process that you do when you cut up the fish. If your fish is freshly caught, clean and gut it first. Then, use a sharp, clean knife to cut your fish into large chunks before you start the brining process. The chunks should be about the size of a large bite of food. You want to be able to eat them, but you don't want them to be so small that they dissolve during the pickling process. For smaller fish like anchovies or herring, you may be able to pickle the whole filet without cutting it up. Use salt and water to make a weak brine. Your fish will go through a weak brine before it goes in the heavy, more flavorful brine. Make a weak brine by adding 1 cup of kosher salt or sea salt per every quart of water (about 200 grams per every liter of water), and bringing the solution to a boil. Let the salt dissolve before removing it from the heat. Then, allow the brine to cool. You will need enough brine to completely cover your fish. Cover your fish with the weak brine. Once the brine has cooled to room temperature, put your fish fillets or fish chunks in a ceramic or glass container. Pour in enough brine to completely cover the fish, but not so much that you cannot move the dish. Refrigerate the fish in brine for 8-24 hours. How long you choose to keep your fish in the weak brine will be a matter of preference. The longer you brine, the more of a pickled flavor you will get. This can work well for stronger fish like pike but may be too much for a more delicate fish like bass. Drain the brine from the container. Carefully drain out the brine from the dish into the sink or another container. At this point, you may or may not choose to rinse the fish. Rinsing helps get rid of some of the salty flavor from the brine. If you do rinse, pat the fish dry completely. If you don't rinse, you should still pat the fish to absorb any excess salt. Cover pike and strongly flavored fish with white vinegar for up to a day. More delicate fish including salmon and trout don't need to go into vinegar, but stronger fish often do. After you've removed the brine and patted dry your fish, cover it with 5% acidity distilled white vinegar. Put the fish back in the refrigerator and allow it to sit for at least overnight and up to a full day. Once your fish is ready for pickling, drain the vinegar, but don't rinse off the fish. Other fish that may benefit from a vinegar soak include mackerel, sardines, and anchovies. Pickling the Fish Boil your pickling brine. A basic pickling brine will combine vinegar, water, spices, and occasionally sugar. Boil these together in a large pot or kettle and let it simmer for 5-10 minutes. To make a basic pickling brine that will work for 10 pounds (4.5 kg) of most fish, combine:\n5 (1.25 liters) cups of water\n2 quarts (2 liters) of distilled white vinegar\n1-2 tbsp (14-28 grams) of ground black pepper or peppercorns\n1 tbsp (14 grams) whole cloves\n2 tbsp mustard seeds (28 grams)\n3-4 bay leaves Add different flavors to your brine depending on the fish. If you just want to use the basic brine, that's fine. You can add different spices and flavors to your brine, though, to bring out the flavor of the fish you're pickling. Common brine additives include:\n¼ teaspoon (about 1 gram) each of whole allspice and dill seed, and ⅓ cup (about 76 grams) granulated sugar for a trout or salmon brine. ¾ cup (about 170 grams) brown sugar and 2 peeled garlic cloves for a perch brine. ½ teaspoon (about 2 grams) of garam masala, a small knob of fresh ginger, and 2-3 dried red chilies, coarsely chopped, for fish like mackerel or blue eye. Simmer the fish in the brine for 5-10 minutes. Once your brine is past the boiling point, carefully add your fish and let it simmer on a medium-low heat for at least 5 but no more than 10 minutes. The fish should be easily pierced with a fork, but not flaky or falling apart. Refrigerate the fish and brine in a shallow pan. Quickly and carefully move the fish and brine from the stovetop to a shallow glass or ceramic pan. Refrigerate the pan until the brine comes down to at least room temperature. Pack the fish in sterile glass jars. Pack the fish in sterile glass jars in thin layers. Between layers of fish, add in thin layers of fresh sliced onions, peppercorns, lemons, and bay leaves. Pack the jar tightly up to the brim for the best results. Strain the vinegar brine. Filter the vinegar brine from the shallow dish into a pouring container like a pitcher or jar. Use a mesh sieve to get out any bay leaves, peppercorns, or large spice chunks. Cover the fish with the strained brine and seal the jars. Once you filtered your brine, pour it into the jars of fish, filling them up to the brim. Seal the jars immediately. Have a towel ready to soak up excess brine. It's better to overfill and have a little spill out than to underfill and ruin your fish. Fill the jars up as much as possible, and wipe up any excess that may come out when you seal them. Serving and Storing Refrigerate the jars immediately. Store the jars of pickled fish in the refrigerator, and they should keep for up to 6 weeks. Make sure the jar is sealed tightly after each time you open it. Always give the fish a smell before serving to make sure it hasn't spoiled. Spoiled fish will smell like mold, rotting meat, or even sulphur. It's a strong odor that's generally hard to miss. If you aren't quite sure, though, it's always best to err on the side of caution. Eat the fish straight from the jar for a snack or quick meal. There are many ways you can enjoy your pickled fish, but the easiest is to eat it straight from the jar with no additional preparation. This can make a good side or appetizer for a meal, or a protein to go on top of a salad. Let any excess pickling liquid drain off before serving plain pickled fish. Get a few of the onion slices from the jar, too, to add some extra flavor to your plate. Make a pickled fish smørrebrød. Smørrebrød is a traditional Danish open-faced sandwich that often features pickled fish. The more traditional recipes call for herring, but you can use any fish you want. To make your sandwich:\nTrim a slice of rye bread into a straight-edged rectangle. Apply a thin layer of butter over the top side of the bread. Layer on your pickled fish, building it up to your desired amount. Tuck slices of red onion between the layers of pickled fish. Top with fresh dill. Add pickled fish to a deli salad. Pickled fish can enhance most deli salads including potato salad, macaroni salad, and most pasta salads. Drain your pickled fish and cut it into bite-sized bits. Then, gently fold it into your favorite deli salad. The fish adds protein and as well as both fatty and acidic flavors.",
  "sentences":[
    " Brining the Fish Cut your fish into chunks.",
    "While you can pickle full fish or large fillets, you won't get the same control over the process that you do when you cut up the fish.",
    "If your fish is freshly caught, clean and gut it first.",
    "Then, use a sharp, clean knife to cut your fish into large chunks before you start the brining process.",
    "The chunks should be about the size of a large bite of food.",
    "You want to be able to eat them, but you don't want them to be so small that they dissolve during the pickling process.",
    "For smaller fish like anchovies or herring, you may be able to pickle the whole filet without cutting it up.",
    "Use salt and water to make a weak brine.",
    "Your fish will go through a weak brine before it goes in the heavy, more flavorful brine.",
    "Make a weak brine by adding 1 cup of kosher salt or sea salt per every quart of water (about 200 grams per every liter of water), and bringing the solution to a boil.",
    "Let the salt dissolve before removing it from the heat.",
    "Then, allow the brine to cool.",
    "You will need enough brine to completely cover your fish.",
    "Cover your fish with the weak brine.",
    "Once the brine has cooled to room temperature, put your fish fillets or fish chunks in a ceramic or glass container.",
    "Pour in enough brine to completely cover the fish, but not so much that you cannot move the dish.",
    "Refrigerate the fish in brine for 8-24 hours.",
    "How long you choose to keep your fish in the weak brine will be a matter of preference.",
    "The longer you brine, the more of a pickled flavor you will get.",
    "This can work well for stronger fish like pike but may be too much for a more delicate fish like bass.",
    "Drain the brine from the container.",
    "Carefully drain out the brine from the dish into the sink or another container.",
    "At this point, you may or may not choose to rinse the fish.",
    "Rinsing helps get rid of some of the salty flavor from the brine.",
    "If you do rinse, pat the fish dry completely.",
    "If you don't rinse, you should still pat the fish to absorb any excess salt.",
    "Cover pike and strongly flavored fish with white vinegar for up to a day.",
    "More delicate fish including salmon and trout don't need to go into vinegar, but stronger fish often do.",
    "After you've removed the brine and patted dry your fish, cover it with 5% acidity distilled white vinegar.",
    "Put the fish back in the refrigerator and allow it to sit for at least overnight and up to a full day.",
    "Once your fish is ready for pickling, drain the vinegar, but don't rinse off the fish.",
    "Other fish that may benefit from a vinegar soak include mackerel, sardines, and anchovies.",
    "Pickling the Fish Boil your pickling brine.",
    "A basic pickling brine will combine vinegar, water, spices, and occasionally sugar.",
    "Boil these together in a large pot or kettle and let it simmer for 5-10 minutes.",
    "To make a basic pickling brine that will work for 10 pounds (4.5 kg) of most fish, combine:\n5 (1.25 liters) cups of water\n2 quarts (2 liters) of distilled white vinegar\n1-2 tbsp (14-28 grams) of ground black pepper or peppercorns\n1 tbsp (14 grams) whole cloves\n2 tbsp mustard seeds (28 grams)\n3-4 bay leaves Add different flavors to your brine depending on the fish.",
    "If you just want to use the basic brine, that's fine.",
    "You can add different spices and flavors to your brine, though, to bring out the flavor of the fish you're pickling.",
    "Common brine additives include:\n¼ teaspoon (about 1 gram) each of whole allspice and dill seed, and ⅓ cup (about 76 grams) granulated sugar for a trout or salmon brine.",
    "¾ cup (about 170 grams) brown sugar and 2 peeled garlic cloves for a perch brine.",
    "½ teaspoon (about 2 grams) of garam masala, a small knob of fresh ginger, and 2-3 dried red chilies, coarsely chopped, for fish like mackerel or blue eye.",
    "Simmer the fish in the brine for 5-10 minutes.",
    "Once your brine is past the boiling point, carefully add your fish and let it simmer on a medium-low heat for at least 5 but no more than 10 minutes.",
    "The fish should be easily pierced with a fork, but not flaky or falling apart.",
    "Refrigerate the fish and brine in a shallow pan.",
    "Quickly and carefully move the fish and brine from the stovetop to a shallow glass or ceramic pan.",
    "Refrigerate the pan until the brine comes down to at least room temperature.",
    "Pack the fish in sterile glass jars.",
    "Pack the fish in sterile glass jars in thin layers.",
    "Between layers of fish, add in thin layers of fresh sliced onions, peppercorns, lemons, and bay leaves.",
    "Pack the jar tightly up to the brim for the best results.",
    "Strain the vinegar brine.",
    "Filter the vinegar brine from the shallow dish into a pouring container like a pitcher or jar.",
    "Use a mesh sieve to get out any bay leaves, peppercorns, or large spice chunks.",
    "Cover the fish with the strained brine and seal the jars.",
    "Once you filtered your brine, pour it into the jars of fish, filling them up to the brim.",
    "Seal the jars immediately.",
    "Have a towel ready to soak up excess brine.",
    "It's better to overfill and have a little spill out than to underfill and ruin your fish.",
    "Fill the jars up as much as possible, and wipe up any excess that may come out when you seal them.",
    "Serving and Storing Refrigerate the jars immediately.",
    "Store the jars of pickled fish in the refrigerator, and they should keep for up to 6 weeks.",
    "Make sure the jar is sealed tightly after each time you open it.",
    "Always give the fish a smell before serving to make sure it hasn't spoiled.",
    "Spoiled fish will smell like mold, rotting meat, or even sulphur.",
    "It's a strong odor that's generally hard to miss.",
    "If you aren't quite sure, though, it's always best to err on the side of caution.",
    "Eat the fish straight from the jar for a snack or quick meal.",
    "There are many ways you can enjoy your pickled fish, but the easiest is to eat it straight from the jar with no additional preparation.",
    "This can make a good side or appetizer for a meal, or a protein to go on top of a salad.",
    "Let any excess pickling liquid drain off before serving plain pickled fish.",
    "Get a few of the onion slices from the jar, too, to add some extra flavor to your plate.",
    "Make a pickled fish smørrebrød.",
    "Smørrebrød is a traditional Danish open-faced sandwich that often features pickled fish.",
    "The more traditional recipes call for herring, but you can use any fish you want.",
    "To make your sandwich:\nTrim a slice of rye bread into a straight-edged rectangle.",
    "Apply a thin layer of butter over the top side of the bread.",
    "Layer on your pickled fish, building it up to your desired amount.",
    "Tuck slices of red onion between the layers of pickled fish.",
    "Top with fresh dill.",
    "Add pickled fish to a deli salad.",
    "Pickled fish can enhance most deli salads including potato salad, macaroni salad, and most pasta salads.",
    "Drain your pickled fish and cut it into bite-sized bits.",
    "Then, gently fold it into your favorite deli salad.",
    "The fish adds protein and as well as both fatty and acidic flavors."
  ],
  "tyn_section":[
    "Knife",
    "Large saucepan",
    "Large glass or ceramic dish",
    "Canning jars",
    "Mesh sieve"
  ],
  "tyn_model":[
    "fish",
    "pickled fish",
    "vinegar",
    "water",
    "salt",
    "brine",
    "jars",
    "herring",
    "container",
    "distilled white vinegar",
    "refrigerator",
    "pickling brine",
    "sterile glass jars",
    "knife",
    "food",
    "pickling",
    "kosher salt",
    "sea salt",
    "fish fillets",
    "bass",
    "dish",
    "pike",
    "white vinegar",
    "salmon",
    "trout",
    "mackerel",
    "sardines",
    "anchovies",
    "spices",
    "sugar",
    "large pot",
    "ground black pepper",
    "mustard seeds",
    "allspice",
    "⅓ cup",
    "granulated sugar",
    "brown sugar",
    "garlic",
    "perch brine",
    "garam masala",
    "fresh ginger",
    "red chilies",
    "blue eye",
    "fork",
    "shallow pan",
    "stovetop",
    "shallow glass or ceramic pan",
    "onions",
    "lemons",
    "bay leaves",
    "shallow dish",
    "pouring container",
    "mesh sieve",
    "towel",
    "pickling liquid",
    "onion",
    "pickled",
    "rye bread",
    "butter",
    "red onion",
    "dill",
    "deli salad"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.0322580645,
    "f1":0.0597014925,
    "avg_pos":0.2096774194
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.0483870968,
    "f1":0.0895522388
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.0806451613,
    "f1":0.1492537313
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.0322580645,
    "f1":0.0597014925
  }
}