{
  "title":"How to Create a Twig Wreath",
  "url":"https://www.wikihow.com/Create-a-Twig-Wreath",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "steps":[
    {
      "headline":"Obtain a heavy wire clothes hanger.",
      "description":""
    },
    {
      "headline":"Clip the \"hook\" off of the hanger with wire cutters.",
      "description":""
    },
    {
      "headline":"Obtain a largish supply of smallish twigs.",
      "description":"Try to keep the twig equal in diameter and length. Some trees work better than others and you should check for permission before trimming any foliage from property you don't own."
    },
    {
      "headline":"Clip your twigs 8–10 inches (20.3–25.4 cm) in length.",
      "description":""
    },
    {
      "headline":"Bend your hanger into a circle.",
      "description":"The more even and smooth the circle is, the better your wreath will look."
    },
    {
      "headline":"Wrap florist's wire around the hanger wire to fasten it.",
      "description":"From this point forward, you will be simply winding the florist wire around the hanger and around the twigs."
    },
    {
      "headline":"Hold the base of a twig at a tangential angle to the base wire circle.",
      "description":""
    },
    {
      "headline":"Wrap the florist wire around its base so that the thinner, branching part of the twig lays out and away from the base circle.",
      "description":""
    },
    {
      "headline":"Lay a second twig beside the first, also at a tangent.",
      "description":""
    },
    {
      "headline":"Wrap florist wire around both the base of the twig and around the base wire to fasten the base of the twig to the heavy wire (using the thinner florist wire for wrapping/fastening).",
      "description":""
    },
    {
      "headline":"Continue until you have covered all of the base, hanger wire with twigs.",
      "description":""
    },
    {
      "headline":"Tie off the florist wire in the back.",
      "description":"Form a hanging loop."
    },
    {
      "headline":"Step back and admire your handiwork!",
      "description":""
    }
  ],
  "text":" Obtain a heavy wire clothes hanger.  Clip the \"hook\" off of the hanger with wire cutters.  Obtain a largish supply of smallish twigs. Try to keep the twig equal in diameter and length. Some trees work better than others and you should check for permission before trimming any foliage from property you don't own. Clip your twigs 8–10 inches (20.3–25.4 cm) in length.  Bend your hanger into a circle. The more even and smooth the circle is, the better your wreath will look. Wrap florist's wire around the hanger wire to fasten it. From this point forward, you will be simply winding the florist wire around the hanger and around the twigs. Hold the base of a twig at a tangential angle to the base wire circle.  Wrap the florist wire around its base so that the thinner, branching part of the twig lays out and away from the base circle.  Lay a second twig beside the first, also at a tangent.  Wrap florist wire around both the base of the twig and around the base wire to fasten the base of the twig to the heavy wire (using the thinner florist wire for wrapping/fastening).  Continue until you have covered all of the base, hanger wire with twigs.  Tie off the florist wire in the back. Form a hanging loop. Step back and admire your handiwork! ",
  "sentences":[
    " Obtain a heavy wire clothes hanger.",
    "Clip the \"hook\" off of the hanger with wire cutters.",
    "Obtain a largish supply of smallish twigs.",
    "Try to keep the twig equal in diameter and length.",
    "Some trees work better than others and you should check for permission before trimming any foliage from property you don't own.",
    "Clip your twigs 8–10 inches (20.3–25.4 cm) in length.",
    "Bend your hanger into a circle.",
    "The more even and smooth the circle is, the better your wreath will look.",
    "Wrap florist's wire around the hanger wire to fasten it.",
    "From this point forward, you will be simply winding the florist wire around the hanger and around the twigs.",
    "Hold the base of a twig at a tangential angle to the base wire circle.",
    "Wrap the florist wire around its base so that the thinner, branching part of the twig lays out and away from the base circle.",
    "Lay a second twig beside the first, also at a tangent.",
    "Wrap florist wire around both the base of the twig and around the base wire to fasten the base of the twig to the heavy wire (using the thinner florist wire for wrapping/fastening).",
    "Continue until you have covered all of the base, hanger wire with twigs.",
    "Tie off the florist wire in the back.",
    "Form a hanging loop.",
    "Step back and admire your handiwork!"
  ],
  "tyn_section":[
    "One (possibly two) wire clothes hangers",
    "Florist wire",
    "A collection of thin, branching twigs. (with or without leaves)",
    "Garden shears to cut the twigs with, if you are collecting your own"
  ],
  "tyn_model":[
    "florist wire",
    "twigs",
    "heavy wire clothes hanger",
    "wire cutters",
    "florist's wire",
    "twig",
    "heavy wire",
    "hanger wire"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.125,
    "f1":0.1666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.25,
    "p":0.125,
    "f1":0.1666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.25,
    "p":0.625,
    "f1":0.3571428571
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.125,
    "f1":0.1666666667
  }
}