{
  "title":"How to Clean Rust from Littlest Pet Shop Toys",
  "url":"https://www.wikihow.com/Clean-Rust-from-Littlest-Pet-Shop-Toys",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "methods":[
    {
      "name":"Dish Soap and Water",
      "steps":[
        {
          "headline":"Find a clean Q-tip (cotton swab).",
          "description":"If you don't have one around, you can also use a tissue, paper towel, or cotton ball."
        },
        {
          "headline":"Place the Q-tip under running water.",
          "description":"Dampen it well but do not leave it dripping. Too much water will still leave rust."
        },
        {
          "headline":"Squeeze a little dish soap on the Q-tip.",
          "description":"Don't add too much, just a dab. If it starts dripping, massage the soap into the swab."
        },
        {
          "headline":"Push the Q-tip under the neck of the toy.",
          "description":"Rub it back and forth over the area affected by the rust. Sometimes it can take a lot of scrubbing, so be patient. You can also try scraping off the rust using a soft toothbrush, a long fingernail or a toothpick. Be aware though, this can scrape off any paint."
        },
        {
          "headline":"Keep cleaning in this manner until the rust ring or stain has been removed from the neck of the LPS.",
          "description":"Then, rinse off the soap with warm water soaked into a sponge. (wring it before use) If it's too chunky, you can use another dampened cotton swab."
        },
        {
          "headline":"Allow to dry thoroughly.",
          "description":"Rub it with paper towel or a clean cloth to remove any water, then allow it to air dry before using again. Be aware that you might need to do this again, depending on how bad the rust is. Always be careful with your LPS around water."
        },
        {
          "headline":"Enjoy!",
          "description":"You are done with cleaning the rust."
        }
      ]
    },
    {
      "name":"Vinegar",
      "steps":[
        {
          "headline":"Fill a small container with white vinegar.",
          "description":"Use this for dipping the Q-tip into. Make sure it's not dropping wet, but damp enough."
        },
        {
          "headline":"Rub the vinegar soaked Q-tip around the rust ring or stain on the LPS toy.",
          "description":"Continue doing this until the stain lifts. Sometimes it takes a lot of scrubbing. You can also try scraping off the rust using a soft toothbrush, a long fingernail or a toothpick. Be careful, it might lift off the paint."
        },
        {
          "headline":"Rinse off with warm water soaked into a sponge (wring it before use), but you can use a cotton swab if the sponge was too big.",
          "description":""
        },
        {
          "headline":"Rub a paper towel or clean cloth to remove as much liquid as possible.",
          "description":""
        },
        {
          "headline":"Allow to air dry in a warm place.",
          "description":""
        }
      ]
    },
    {
      "name":"Commercial Cleaners",
      "steps":[
        {
          "headline":"Choose a commercial cleaner to remove the rust rings or stains.",
          "description":"Some options include:\nA natural stain remover pen\nA commercial rust remover (but be very sure to read what surfaces the remover works on; you don't want the toy to dissolve)."
        },
        {
          "headline":"Sponge wash the area affected by the rust.",
          "description":"Use warm water and gentle dish detergent. Then apply the commercial cleaner in very small amounts, using the Q-tip or a soft old toothbrush."
        },
        {
          "headline":"Scrub gently until the stain lifts.",
          "description":"If it's hard to come off, scrub a little harder, but don't"
        },
        {
          "headline":"Rinse off with warm water soaked into a sponge (wring it before use), or you can use a damp cotton swab.",
          "description":""
        },
        {
          "headline":"Rub a paper towel or clean cloth to remove as much water as possible, this will keep it from rusting again.",
          "description":""
        },
        {
          "headline":"Allow to air dry in a warm place.",
          "description":""
        }
      ]
    }
  ],
  "text":" Dish Soap and Water Find a clean Q-tip (cotton swab). If you don't have one around, you can also use a tissue, paper towel, or cotton ball. Place the Q-tip under running water. Dampen it well but do not leave it dripping. Too much water will still leave rust. Squeeze a little dish soap on the Q-tip. Don't add too much, just a dab. If it starts dripping, massage the soap into the swab. Push the Q-tip under the neck of the toy. Rub it back and forth over the area affected by the rust. Sometimes it can take a lot of scrubbing, so be patient. You can also try scraping off the rust using a soft toothbrush, a long fingernail or a toothpick. Be aware though, this can scrape off any paint. Keep cleaning in this manner until the rust ring or stain has been removed from the neck of the LPS. Then, rinse off the soap with warm water soaked into a sponge. (wring it before use) If it's too chunky, you can use another dampened cotton swab. Allow to dry thoroughly. Rub it with paper towel or a clean cloth to remove any water, then allow it to air dry before using again. Be aware that you might need to do this again, depending on how bad the rust is. Always be careful with your LPS around water. Enjoy! You are done with cleaning the rust. Vinegar Fill a small container with white vinegar. Use this for dipping the Q-tip into. Make sure it's not dropping wet, but damp enough. Rub the vinegar soaked Q-tip around the rust ring or stain on the LPS toy. Continue doing this until the stain lifts. Sometimes it takes a lot of scrubbing. You can also try scraping off the rust using a soft toothbrush, a long fingernail or a toothpick. Be careful, it might lift off the paint. Rinse off with warm water soaked into a sponge (wring it before use), but you can use a cotton swab if the sponge was too big.  Rub a paper towel or clean cloth to remove as much liquid as possible.  Allow to air dry in a warm place.  Commercial Cleaners Choose a commercial cleaner to remove the rust rings or stains. Some options include:\nA natural stain remover pen\nA commercial rust remover (but be very sure to read what surfaces the remover works on; you don't want the toy to dissolve). Sponge wash the area affected by the rust. Use warm water and gentle dish detergent. Then apply the commercial cleaner in very small amounts, using the Q-tip or a soft old toothbrush. Scrub gently until the stain lifts. If it's hard to come off, scrub a little harder, but don't Rinse off with warm water soaked into a sponge (wring it before use), or you can use a damp cotton swab.  Rub a paper towel or clean cloth to remove as much water as possible, this will keep it from rusting again.  Allow to air dry in a warm place. ",
  "sentences":[
    " Dish Soap and Water Find a clean Q-tip (cotton swab).",
    "If you don't have one around, you can also use a tissue, paper towel, or cotton ball.",
    "Place the Q-tip under running water.",
    "Dampen it well but do not leave it dripping.",
    "Too much water will still leave rust.",
    "Squeeze a little dish soap on the Q-tip.",
    "Don't add too much, just a dab.",
    "If it starts dripping, massage the soap into the swab.",
    "Push the Q-tip under the neck of the toy.",
    "Rub it back and forth over the area affected by the rust.",
    "Sometimes it can take a lot of scrubbing, so be patient.",
    "You can also try scraping off the rust using a soft toothbrush, a long fingernail or a toothpick.",
    "Be aware though, this can scrape off any paint.",
    "Keep cleaning in this manner until the rust ring or stain has been removed from the neck of the LPS.",
    "Then, rinse off the soap with warm water soaked into a sponge.",
    "(wring it before use) If it's too chunky, you can use another dampened cotton swab.",
    "Allow to dry thoroughly.",
    "Rub it with paper towel or a clean cloth to remove any water, then allow it to air dry before using again.",
    "Be aware that you might need to do this again, depending on how bad the rust is.",
    "Always be careful with your LPS around water.",
    "Enjoy!",
    "You are done with cleaning the rust.",
    "Vinegar Fill a small container with white vinegar.",
    "Use this for dipping the Q-tip into.",
    "Make sure it's not dropping wet, but damp enough.",
    "Rub the vinegar soaked Q-tip around the rust ring or stain on the LPS toy.",
    "Continue doing this until the stain lifts.",
    "Sometimes it takes a lot of scrubbing.",
    "You can also try scraping off the rust using a soft toothbrush, a long fingernail or a toothpick.",
    "Be careful, it might lift off the paint.",
    "Rinse off with warm water soaked into a sponge (wring it before use), but you can use a cotton swab if the sponge was too big.",
    "Rub a paper towel or clean cloth to remove as much liquid as possible.",
    "Allow to air dry in a warm place.",
    "Commercial Cleaners Choose a commercial cleaner to remove the rust rings or stains.",
    "Some options include:\nA natural stain remover pen\nA commercial rust remover (but be very sure to read what surfaces the remover works on; you don't want the toy to dissolve).",
    "Sponge wash the area affected by the rust.",
    "Use warm water and gentle dish detergent.",
    "Then apply the commercial cleaner in very small amounts, using the Q-tip or a soft old toothbrush.",
    "Scrub gently until the stain lifts.",
    "If it's hard to come off, scrub a little harder, but don't Rinse off with warm water soaked into a sponge (wring it before use), or you can use a damp cotton swab.",
    "Rub a paper towel or clean cloth to remove as much water as possible, this will keep it from rusting again.",
    "Allow to air dry in a warm place."
  ],
  "tyn_section":[
    "Q-tip (cotton ear bud) (or soft toothbrush, toothpick, long fingernail)",
    "Dish soap and warm water",
    "White vinegar",
    "Paper towel and clean rags",
    "Sponge",
    "Commercial cleaner"
  ],
  "tyn_model":[
    "water",
    "q-tip",
    "sponge",
    "soap",
    "paper towel",
    "q-",
    "vinegar",
    "cotton swab",
    "tissue, paper towel",
    "cotton ball",
    "dish soap",
    "white vinegar",
    "cleaner",
    "natural stain remover pen",
    "dish detergent",
    "commercial cleaner"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1875,
    "f1":0.2727272727,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.3125,
    "f1":0.3846153846
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.5,
    "f1":0.625
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1875,
    "f1":0.2727272727
  }
}