{
  "title":"How to Stain Stairs",
  "url":"https://www.wikihow.com/Stain-Stairs",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs"
  ],
  "parts":[
    {
      "name":"Repairing and Cleaning the Staircase",
      "steps":[
        {
          "headline":"Strip away any carpeting material with pliers and a pry bar.",
          "description":"Pull up the carpet and padding, any wooden carpet strips, and the staples or tacks holding everything in place. Use pliers to pick up the carpet at corners and edges. Switch to a pry bar only if the pliers aren’t doing the job, since it’s more likely to damage the wood. Wear heavy-duty work gloves and sturdy, long pants and a long-sleeve shirt when removing carpet. You’ll come across lots of sharp tacks and/or staples!"
        },
        {
          "headline":"Move, cover, or seal off furniture and other items near the staircase.",
          "description":"Depending on the job, you’ll either be doing some sanding or a lot of sanding. In any case, you’ll create a lot of dust. Move what can be moved, and cover what can’t be moved with plastic sheeting or drop cloths. Seal off any nearby interior doorways with plastic sheeting. Affix it with masking tape. However, don’t seal off a doorway if it provides your closest source of fresh air ventilation, such as a window or exterior door. Lay down drop cloths on nearby floors or carpets."
        },
        {
          "headline":"Create ventilation by opening any nearby windows or doors.",
          "description":"Ventilating the area helps dissipate some of the dust from sanding. It’s even more important to ventilate the area when you’re using chemical strippers or applying stain. Otherwise, potentially dangerous fumes may build up and possibly cause you harm. For added safety, also wear a respirator and goggles to protect yourself from any fumes and small dust particles. A dust mask will keep you from breathing in sanding dust, but won’t prevent you from inhaling fumes."
        },
        {
          "headline":"Locate and hammer down any loose or protruding nails.",
          "description":"Make sure all the nail heads are level with the surrounding wood. Use a nail setter—they look a bit like a tiny spike or a really thick nail—if you’re concerned about marring the wood with hammer blows. To use a nail setter, simply hold the thinner end against the head of the nail, then strike the thicker end with your hammer. Protruding nails will get in the way and cause problems while you sand, strip, and stain the wood. Take care of them first!"
        },
        {
          "headline":"Tape off any adjacent surfaces that you want to protect.",
          "description":"For instance, tape the area where each stair tread and riser meets the wall. Apply the tape to the wall, so that you have full access to the stairs. Use painter’s tape for the best results, or regular masking tape. Leave the tape in place until the entire job is finished."
        }
      ]
    },
    {
      "name":"Stripping Old Paint or Stain",
      "steps":[
        {
          "headline":"Apply a chemical stripper for stairs with thick paint or heavy stain.",
          "description":"If the stairs have only 1-2 coats of paint or a light stain, you can skip straight to sanding. For thick layers of paint or stain, though, a chemical stripper is a sensible first step, so long as you follow all product instructions and safety precautions—including providing adequate ventilation. Chemical strippers are usually applied to the surface with a brush, then scraped off with a putty knife after a designated waiting period. Follow the specific instructions that come with your stripper. Wear chemical-resistant cleaning gloves, goggles, and a respirator when applying and removing the stripper. Wipe the stripped stairs with a clean, slightly damp rag before moving on to sanding."
        },
        {
          "headline":"Sand away nicks, dents, and any remaining finishes with medium-grit sandpaper.",
          "description":"To speed things up, use an electric random orbital sander for easily-accessible surfaces. Corners and other tight areas may require a finishing sander, sanding block, or sandpaper sheet. In the hardest-to-reach areas, a small wood chisel can help to remove the last bits of finish. Medium-grit sandpaper is in the 60-100 grit range. Follow the product instructions carefully if you’re using an orbital sander. Wear thick gloves, eye protection, and a respirator. Apply even pressure and keep the sander in constant motion. When sanding by hand, use smooth, even, back-and-forth strokes."
        },
        {
          "headline":"Move on to fine-grit sandpaper to finish your sanding job.",
          "description":"If you’re staining brand-new stairs, you may only need to give them this final light sanding. Use your orbital sander and/or hand sanders to give the stairs an even texture and appearance that’s ready to accept stain. Fine-grit sandpaper ranges from about 120-220 grit. Apply gentle, even pressure. You want the stairs to appear smooth but have the slightest amount of surface texture to to accept the stain."
        },
        {
          "headline":"Clean away the dust with a shop vacuum and tack cloths.",
          "description":"Use the shop vacuum to suck up the bulk of the dust on the steps and surrounding vicinity. Follow up by wiping down the stairs with tack cloths, which will remove any remaining dust. As the name indicates, tack cloths are slightly sticky rags. You can buy them at any home improvement store. If you don’t have a tack cloth, use slightly dampened rags."
        },
        {
          "headline":"Plan to stain either all the stairs or every other stair, based on your needs.",
          "description":"Ideally, you’ll be able to close the staircase to all foot traffic for at least 2 days after completing the job. If this isn’t possible, finish every other step first so that the staircase can still be (carefully) used. After at least 2 days, move on to finishing the remaining steps. In any case, always work from the top step down—it’s much easier and more comfortable to do the job this way!"
        }
      ]
    },
    {
      "name":"Applying Wood Conditioner",
      "steps":[
        {
          "headline":"Choose stain, varnish, and (if needed) wood conditioner of the same type.",
          "description":"For example, if you choose an oil-based stain, also choose an oil-based varnish and conditioner. Or, if you prefer a water-based stain, go with a water-based varnish and conditioner. Mis-matched products will result in a rough, non-durable finish. Oil-based products provide a deeper, richer, more durable finish. Water-based products are easier to clean up and are typically considered more eco-friendly. Wood conditioner isn’t absolutely essential, but is highly recommended in nearly all cases."
        },
        {
          "headline":"Brush on the wood conditioner, especially with soft woods like pine.",
          "description":"Use a natural bristle paintbrush or a rag to apply a thin coat of the conditioner over the wood. Apply it in the direction of the wood grain, wait the recommended time (usually 15 minutes), then wipe off any excess (in the direction of the grain) with a clean rags. Let the conditioner dry for at least 30 minutes but not more than 2 hours before applying stain, or as recommended on the container. Wood conditioner causes softer woods to absorb stain more slowly, resulting in a more even finish with fewer blotches and streaks. If you’re not sure whether your stairs are made of a soft wood (like pine), a medium wood (like walnut), or a hardwood (like oak), go ahead and use wood conditioner. At worst, it will make no noticeable difference in the finished stain."
        },
        {
          "headline":"Sand the conditioned wood lightly with fine-grit sandpaper.",
          "description":"Just before applying the first coat of stain, lightly go over the stairs with 220-grit sandpaper to add a slight bit of roughness to the wood surface. Use tack cloths to remove the dust before proceeding. Sand in the direction of the grain, using even strokes."
        }
      ]
    },
    {
      "name":"Adding Coats of Stain",
      "steps":[
        {
          "headline":"Apply the first coat of stain with a paintbrush or rag.",
          "description":"After reading the instructions for mixing the stain, dip your brush or rag into it and apply an even layer with smooth, long strokes that go with the grain of the wood. Allow the stain to penetrate the wood for 5-15 minutes, depending on the depth of color you desire. Leaving the stain on for 15 minutes will produce a deeper, richer stain color than leaving it on for 5 minutes, but it might also conceal some of the natural beauty of the wood grain. It’s really a matter of personal preference when it comes to choosing a brush or a rag—either one will do a good job with the right technique."
        },
        {
          "headline":"Wipe off excess stain that hasn’t soaked into the wood after 5-15 minutes.",
          "description":"Use clean, dry cloths and wipe in the direction of the grain. Do not allow any stain that has not penetrated the wood to dry on the surface. It will cause streaks and smears."
        },
        {
          "headline":"Add additional coats if you want a deeper, darker finish.",
          "description":"Allow the first coat to dry completely—this typically takes about 4 hours, but check the product instructions. If you like the look, move on to sealing the stain. Or, if desired, add another coat of stain using the same process as before. You can add 3-4 total coats if you wish. Remember to keep wiping away the excess stain 5-15 minutes after application. Allow 4 hours between coats."
        }
      ]
    },
    {
      "name":"Protecting the Stain with Varnish",
      "steps":[
        {
          "headline":"Brush on a coat of floor-grade polyurethane varnish.",
          "description":"Follow the package instructions for stirring and applying the varnish. Unless otherwise directed, use a natural bristle paintbrush and apply a thin layer using long, even strokes. Stairs are high-traffic areas, so sealing them is essential. Remember to use a compatible varnish—oil-based with an oil-based stain, or water-based with a water-based stain. Allow the varnish to dry for the recommended time, such as 4 hours."
        },
        {
          "headline":"Sand the varnish lightly if you want to apply a second coat.",
          "description":"One coat of varnish may be sufficient, in which case you’re all done! However, since stairs take a beating from foot traffic, adding a second coat isn’t a bad idea. Before doing this, very lightly sand the varnish with 220-grit sandpaper. Wipe away the dust with a tack cloth before proceeding. Some floor-grade polyurethanes do not require sanding between coats, especially if the second coat is applied within 12 hours of the first coat. Check the product instructions."
        },
        {
          "headline":"Apply a second coat of varnish.",
          "description":"Use the same process as before. When you’re done, allow the finish to dry for at least 48 hours before using the stairs. After the drying time is complete, remove any drop cloths, painter's tape, and other materials, and enjoy your beautiful new staircase!"
        }
      ]
    }
  ],
  "text":" Repairing and Cleaning the Staircase Strip away any carpeting material with pliers and a pry bar. Pull up the carpet and padding, any wooden carpet strips, and the staples or tacks holding everything in place. Use pliers to pick up the carpet at corners and edges. Switch to a pry bar only if the pliers aren’t doing the job, since it’s more likely to damage the wood. Wear heavy-duty work gloves and sturdy, long pants and a long-sleeve shirt when removing carpet. You’ll come across lots of sharp tacks and/or staples! Move, cover, or seal off furniture and other items near the staircase. Depending on the job, you’ll either be doing some sanding or a lot of sanding. In any case, you’ll create a lot of dust. Move what can be moved, and cover what can’t be moved with plastic sheeting or drop cloths. Seal off any nearby interior doorways with plastic sheeting. Affix it with masking tape. However, don’t seal off a doorway if it provides your closest source of fresh air ventilation, such as a window or exterior door. Lay down drop cloths on nearby floors or carpets. Create ventilation by opening any nearby windows or doors. Ventilating the area helps dissipate some of the dust from sanding. It’s even more important to ventilate the area when you’re using chemical strippers or applying stain. Otherwise, potentially dangerous fumes may build up and possibly cause you harm. For added safety, also wear a respirator and goggles to protect yourself from any fumes and small dust particles. A dust mask will keep you from breathing in sanding dust, but won’t prevent you from inhaling fumes. Locate and hammer down any loose or protruding nails. Make sure all the nail heads are level with the surrounding wood. Use a nail setter—they look a bit like a tiny spike or a really thick nail—if you’re concerned about marring the wood with hammer blows. To use a nail setter, simply hold the thinner end against the head of the nail, then strike the thicker end with your hammer. Protruding nails will get in the way and cause problems while you sand, strip, and stain the wood. Take care of them first! Tape off any adjacent surfaces that you want to protect. For instance, tape the area where each stair tread and riser meets the wall. Apply the tape to the wall, so that you have full access to the stairs. Use painter’s tape for the best results, or regular masking tape. Leave the tape in place until the entire job is finished. Stripping Old Paint or Stain Apply a chemical stripper for stairs with thick paint or heavy stain. If the stairs have only 1-2 coats of paint or a light stain, you can skip straight to sanding. For thick layers of paint or stain, though, a chemical stripper is a sensible first step, so long as you follow all product instructions and safety precautions—including providing adequate ventilation. Chemical strippers are usually applied to the surface with a brush, then scraped off with a putty knife after a designated waiting period. Follow the specific instructions that come with your stripper. Wear chemical-resistant cleaning gloves, goggles, and a respirator when applying and removing the stripper. Wipe the stripped stairs with a clean, slightly damp rag before moving on to sanding. Sand away nicks, dents, and any remaining finishes with medium-grit sandpaper. To speed things up, use an electric random orbital sander for easily-accessible surfaces. Corners and other tight areas may require a finishing sander, sanding block, or sandpaper sheet. In the hardest-to-reach areas, a small wood chisel can help to remove the last bits of finish. Medium-grit sandpaper is in the 60-100 grit range. Follow the product instructions carefully if you’re using an orbital sander. Wear thick gloves, eye protection, and a respirator. Apply even pressure and keep the sander in constant motion. When sanding by hand, use smooth, even, back-and-forth strokes. Move on to fine-grit sandpaper to finish your sanding job. If you’re staining brand-new stairs, you may only need to give them this final light sanding. Use your orbital sander and/or hand sanders to give the stairs an even texture and appearance that’s ready to accept stain. Fine-grit sandpaper ranges from about 120-220 grit. Apply gentle, even pressure. You want the stairs to appear smooth but have the slightest amount of surface texture to to accept the stain. Clean away the dust with a shop vacuum and tack cloths. Use the shop vacuum to suck up the bulk of the dust on the steps and surrounding vicinity. Follow up by wiping down the stairs with tack cloths, which will remove any remaining dust. As the name indicates, tack cloths are slightly sticky rags. You can buy them at any home improvement store. If you don’t have a tack cloth, use slightly dampened rags. Plan to stain either all the stairs or every other stair, based on your needs. Ideally, you’ll be able to close the staircase to all foot traffic for at least 2 days after completing the job. If this isn’t possible, finish every other step first so that the staircase can still be (carefully) used. After at least 2 days, move on to finishing the remaining steps. In any case, always work from the top step down—it’s much easier and more comfortable to do the job this way! Applying Wood Conditioner Choose stain, varnish, and (if needed) wood conditioner of the same type. For example, if you choose an oil-based stain, also choose an oil-based varnish and conditioner. Or, if you prefer a water-based stain, go with a water-based varnish and conditioner. Mis-matched products will result in a rough, non-durable finish. Oil-based products provide a deeper, richer, more durable finish. Water-based products are easier to clean up and are typically considered more eco-friendly. Wood conditioner isn’t absolutely essential, but is highly recommended in nearly all cases. Brush on the wood conditioner, especially with soft woods like pine. Use a natural bristle paintbrush or a rag to apply a thin coat of the conditioner over the wood. Apply it in the direction of the wood grain, wait the recommended time (usually 15 minutes), then wipe off any excess (in the direction of the grain) with a clean rags. Let the conditioner dry for at least 30 minutes but not more than 2 hours before applying stain, or as recommended on the container. Wood conditioner causes softer woods to absorb stain more slowly, resulting in a more even finish with fewer blotches and streaks. If you’re not sure whether your stairs are made of a soft wood (like pine), a medium wood (like walnut), or a hardwood (like oak), go ahead and use wood conditioner. At worst, it will make no noticeable difference in the finished stain. Sand the conditioned wood lightly with fine-grit sandpaper. Just before applying the first coat of stain, lightly go over the stairs with 220-grit sandpaper to add a slight bit of roughness to the wood surface. Use tack cloths to remove the dust before proceeding. Sand in the direction of the grain, using even strokes. Adding Coats of Stain Apply the first coat of stain with a paintbrush or rag. After reading the instructions for mixing the stain, dip your brush or rag into it and apply an even layer with smooth, long strokes that go with the grain of the wood. Allow the stain to penetrate the wood for 5-15 minutes, depending on the depth of color you desire. Leaving the stain on for 15 minutes will produce a deeper, richer stain color than leaving it on for 5 minutes, but it might also conceal some of the natural beauty of the wood grain. It’s really a matter of personal preference when it comes to choosing a brush or a rag—either one will do a good job with the right technique. Wipe off excess stain that hasn’t soaked into the wood after 5-15 minutes. Use clean, dry cloths and wipe in the direction of the grain. Do not allow any stain that has not penetrated the wood to dry on the surface. It will cause streaks and smears. Add additional coats if you want a deeper, darker finish. Allow the first coat to dry completely—this typically takes about 4 hours, but check the product instructions. If you like the look, move on to sealing the stain. Or, if desired, add another coat of stain using the same process as before. You can add 3-4 total coats if you wish. Remember to keep wiping away the excess stain 5-15 minutes after application. Allow 4 hours between coats. Protecting the Stain with Varnish Brush on a coat of floor-grade polyurethane varnish. Follow the package instructions for stirring and applying the varnish. Unless otherwise directed, use a natural bristle paintbrush and apply a thin layer using long, even strokes. Stairs are high-traffic areas, so sealing them is essential. Remember to use a compatible varnish—oil-based with an oil-based stain, or water-based with a water-based stain. Allow the varnish to dry for the recommended time, such as 4 hours. Sand the varnish lightly if you want to apply a second coat. One coat of varnish may be sufficient, in which case you’re all done! However, since stairs take a beating from foot traffic, adding a second coat isn’t a bad idea. Before doing this, very lightly sand the varnish with 220-grit sandpaper. Wipe away the dust with a tack cloth before proceeding. Some floor-grade polyurethanes do not require sanding between coats, especially if the second coat is applied within 12 hours of the first coat. Check the product instructions. Apply a second coat of varnish. Use the same process as before. When you’re done, allow the finish to dry for at least 48 hours before using the stairs. After the drying time is complete, remove any drop cloths, painter's tape, and other materials, and enjoy your beautiful new staircase!",
  "sentences":[
    " Repairing and Cleaning the Staircase Strip away any carpeting material with pliers and a pry bar.",
    "Pull up the carpet and padding, any wooden carpet strips, and the staples or tacks holding everything in place.",
    "Use pliers to pick up the carpet at corners and edges.",
    "Switch to a pry bar only if the pliers aren’t doing the job, since it’s more likely to damage the wood.",
    "Wear heavy-duty work gloves and sturdy, long pants and a long-sleeve shirt when removing carpet.",
    "You’ll come across lots of sharp tacks and/or staples!",
    "Move, cover, or seal off furniture and other items near the staircase.",
    "Depending on the job, you’ll either be doing some sanding or a lot of sanding.",
    "In any case, you’ll create a lot of dust.",
    "Move what can be moved, and cover what can’t be moved with plastic sheeting or drop cloths.",
    "Seal off any nearby interior doorways with plastic sheeting.",
    "Affix it with masking tape.",
    "However, don’t seal off a doorway if it provides your closest source of fresh air ventilation, such as a window or exterior door.",
    "Lay down drop cloths on nearby floors or carpets.",
    "Create ventilation by opening any nearby windows or doors.",
    "Ventilating the area helps dissipate some of the dust from sanding.",
    "It’s even more important to ventilate the area when you’re using chemical strippers or applying stain.",
    "Otherwise, potentially dangerous fumes may build up and possibly cause you harm.",
    "For added safety, also wear a respirator and goggles to protect yourself from any fumes and small dust particles.",
    "A dust mask will keep you from breathing in sanding dust, but won’t prevent you from inhaling fumes.",
    "Locate and hammer down any loose or protruding nails.",
    "Make sure all the nail heads are level with the surrounding wood.",
    "Use a nail setter—they look a bit like a tiny spike or a really thick nail—if you’re concerned about marring the wood with hammer blows.",
    "To use a nail setter, simply hold the thinner end against the head of the nail, then strike the thicker end with your hammer.",
    "Protruding nails will get in the way and cause problems while you sand, strip, and stain the wood.",
    "Take care of them first!",
    "Tape off any adjacent surfaces that you want to protect.",
    "For instance, tape the area where each stair tread and riser meets the wall.",
    "Apply the tape to the wall, so that you have full access to the stairs.",
    "Use painter’s tape for the best results, or regular masking tape.",
    "Leave the tape in place until the entire job is finished.",
    "Stripping Old Paint or Stain Apply a chemical stripper for stairs with thick paint or heavy stain.",
    "If the stairs have only 1-2 coats of paint or a light stain, you can skip straight to sanding.",
    "For thick layers of paint or stain, though, a chemical stripper is a sensible first step, so long as you follow all product instructions and safety precautions—including providing adequate ventilation.",
    "Chemical strippers are usually applied to the surface with a brush, then scraped off with a putty knife after a designated waiting period.",
    "Follow the specific instructions that come with your stripper.",
    "Wear chemical-resistant cleaning gloves, goggles, and a respirator when applying and removing the stripper.",
    "Wipe the stripped stairs with a clean, slightly damp rag before moving on to sanding.",
    "Sand away nicks, dents, and any remaining finishes with medium-grit sandpaper.",
    "To speed things up, use an electric random orbital sander for easily-accessible surfaces.",
    "Corners and other tight areas may require a finishing sander, sanding block, or sandpaper sheet.",
    "In the hardest-to-reach areas, a small wood chisel can help to remove the last bits of finish.",
    "Medium-grit sandpaper is in the 60-100 grit range.",
    "Follow the product instructions carefully if you’re using an orbital sander.",
    "Wear thick gloves, eye protection, and a respirator.",
    "Apply even pressure and keep the sander in constant motion.",
    "When sanding by hand, use smooth, even, back-and-forth strokes.",
    "Move on to fine-grit sandpaper to finish your sanding job.",
    "If you’re staining brand-new stairs, you may only need to give them this final light sanding.",
    "Use your orbital sander and/or hand sanders to give the stairs an even texture and appearance that’s ready to accept stain.",
    "Fine-grit sandpaper ranges from about 120-220 grit.",
    "Apply gentle, even pressure.",
    "You want the stairs to appear smooth but have the slightest amount of surface texture to to accept the stain.",
    "Clean away the dust with a shop vacuum and tack cloths.",
    "Use the shop vacuum to suck up the bulk of the dust on the steps and surrounding vicinity.",
    "Follow up by wiping down the stairs with tack cloths, which will remove any remaining dust.",
    "As the name indicates, tack cloths are slightly sticky rags.",
    "You can buy them at any home improvement store.",
    "If you don’t have a tack cloth, use slightly dampened rags.",
    "Plan to stain either all the stairs or every other stair, based on your needs.",
    "Ideally, you’ll be able to close the staircase to all foot traffic for at least 2 days after completing the job.",
    "If this isn’t possible, finish every other step first so that the staircase can still be (carefully) used.",
    "After at least 2 days, move on to finishing the remaining steps.",
    "In any case, always work from the top step down—it’s much easier and more comfortable to do the job this way!",
    "Applying Wood Conditioner Choose stain, varnish, and (if needed) wood conditioner of the same type.",
    "For example, if you choose an oil-based stain, also choose an oil-based varnish and conditioner.",
    "Or, if you prefer a water-based stain, go with a water-based varnish and conditioner.",
    "Mis-matched products will result in a rough, non-durable finish.",
    "Oil-based products provide a deeper, richer, more durable finish.",
    "Water-based products are easier to clean up and are typically considered more eco-friendly.",
    "Wood conditioner isn’t absolutely essential, but is highly recommended in nearly all cases.",
    "Brush on the wood conditioner, especially with soft woods like pine.",
    "Use a natural bristle paintbrush or a rag to apply a thin coat of the conditioner over the wood.",
    "Apply it in the direction of the wood grain, wait the recommended time (usually 15 minutes), then wipe off any excess (in the direction of the grain) with a clean rags.",
    "Let the conditioner dry for at least 30 minutes but not more than 2 hours before applying stain, or as recommended on the container.",
    "Wood conditioner causes softer woods to absorb stain more slowly, resulting in a more even finish with fewer blotches and streaks.",
    "If you’re not sure whether your stairs are made of a soft wood (like pine), a medium wood (like walnut), or a hardwood (like oak), go ahead and use wood conditioner.",
    "At worst, it will make no noticeable difference in the finished stain.",
    "Sand the conditioned wood lightly with fine-grit sandpaper.",
    "Just before applying the first coat of stain, lightly go over the stairs with 220-grit sandpaper to add a slight bit of roughness to the wood surface.",
    "Use tack cloths to remove the dust before proceeding.",
    "Sand in the direction of the grain, using even strokes.",
    "Adding Coats of Stain Apply the first coat of stain with a paintbrush or rag.",
    "After reading the instructions for mixing the stain, dip your brush or rag into it and apply an even layer with smooth, long strokes that go with the grain of the wood.",
    "Allow the stain to penetrate the wood for 5-15 minutes, depending on the depth of color you desire.",
    "Leaving the stain on for 15 minutes will produce a deeper, richer stain color than leaving it on for 5 minutes, but it might also conceal some of the natural beauty of the wood grain.",
    "It’s really a matter of personal preference when it comes to choosing a brush or a rag—either one will do a good job with the right technique.",
    "Wipe off excess stain that hasn’t soaked into the wood after 5-15 minutes.",
    "Use clean, dry cloths and wipe in the direction of the grain.",
    "Do not allow any stain that has not penetrated the wood to dry on the surface.",
    "It will cause streaks and smears.",
    "Add additional coats if you want a deeper, darker finish.",
    "Allow the first coat to dry completely—this typically takes about 4 hours, but check the product instructions.",
    "If you like the look, move on to sealing the stain.",
    "Or, if desired, add another coat of stain using the same process as before.",
    "You can add 3-4 total coats if you wish.",
    "Remember to keep wiping away the excess stain 5-15 minutes after application.",
    "Allow 4 hours between coats.",
    "Protecting the Stain with Varnish Brush on a coat of floor-grade polyurethane varnish.",
    "Follow the package instructions for stirring and applying the varnish.",
    "Unless otherwise directed, use a natural bristle paintbrush and apply a thin layer using long, even strokes.",
    "Stairs are high-traffic areas, so sealing them is essential.",
    "Remember to use a compatible varnish—oil-based with an oil-based stain, or water-based with a water-based stain.",
    "Allow the varnish to dry for the recommended time, such as 4 hours.",
    "Sand the varnish lightly if you want to apply a second coat.",
    "One coat of varnish may be sufficient, in which case you’re all done!",
    "However, since stairs take a beating from foot traffic, adding a second coat isn’t a bad idea.",
    "Before doing this, very lightly sand the varnish with 220-grit sandpaper.",
    "Wipe away the dust with a tack cloth before proceeding.",
    "Some floor-grade polyurethanes do not require sanding between coats, especially if the second coat is applied within 12 hours of the first coat.",
    "Check the product instructions.",
    "Apply a second coat of varnish.",
    "Use the same process as before.",
    "When you’re done, allow the finish to dry for at least 48 hours before using the stairs.",
    "After the drying time is complete, remove any drop cloths, painter's tape, and other materials, and enjoy your beautiful new staircase!"
  ],
  "tyn_section":[
    "Pliers",
    "Pry bar",
    "Work gloves",
    "Work clothes",
    "Respirator",
    "Goggles",
    "Plastic sheeting",
    "Drop cloths",
    "Hammer",
    "Masking tape",
    "Painter's tape",
    "Sandpaper/sanding block/orbital sander",
    "Chemical stripper",
    "Rags",
    "Putty knife",
    "Small wood chisel",
    "Shop vacuum",
    "Tack cloths",
    "Wood conditioner",
    "Wood stain",
    "Polyurethane varnish",
    "Paintbrushes"
  ],
  "tyn_model":[
    "wood conditioner",
    "varnish",
    "conditioner",
    "tack cloths",
    "pliers",
    "drop cloths",
    "tape",
    "fine-grit sandpaper",
    "pry bar",
    "plastic sheeting",
    "masking tape",
    "chemical strippers",
    "hammer",
    "nails",
    "nail setter",
    "chemical stripper",
    "stripper",
    "sander",
    "orbital sander",
    "shop vacuum",
    "natural bristle paintbrush",
    "220-grit sandpaper",
    "brush",
    "respirator",
    "goggles",
    "dust mask",
    "—they",
    "—if",
    "painter’s tape",
    "paint",
    "—including",
    "putty knife",
    "cleaning gloves",
    "medium-grit sandpaper",
    "electric random orbital sander",
    "sanding block",
    "sandpaper sheet",
    "wood chisel",
    "sandpaper",
    "tack cloth",
    "rags",
    "—it",
    "oil-based varnish",
    "water-based varnish",
    "oil",
    "paintbrush or",
    "rag",
    "—either",
    "cloths",
    "—this",
    "varnish brush",
    "polyurethane varnish",
    "—oil",
    "polyurethanes",
    "painter's tape"
  ],
  "simple_metrics":{
    "r":0.7272727273,
    "p":0.2909090909,
    "f1":0.4155844156,
    "avg_pos":0.0727272727
  },
  "jacc_metrics_0.5":{
    "r":0.7727272727,
    "p":0.4,
    "f1":0.5271317829
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9090909091,
    "p":0.5454545455,
    "f1":0.6818181818
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7727272727,
    "p":0.3090909091,
    "f1":0.4415584416
  }
}