{
  "title":"How to Make Crispy Vegetable Spring Rolls",
  "url":"https://www.wikihow.com/Make-Crispy-Vegetable-Spring-Rolls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine"
  ],
  "steps":[
    {
      "headline":"Cook the vegetables.",
      "description":"Heat the wok with some vegetable oil. Add in the carrots, red pepper, bamboo shoots, bean sprouts, and cabbage. Cook everything together until they have slightly softened."
    },
    {
      "headline":"Add the wet ingredients.",
      "description":"Add the noodles, soy sauce, oyster sauce, sugar, salt, and pepper. Mix well and remove from the heat. Place everything in a bowl to cool."
    },
    {
      "headline":"Make the spring rolls.",
      "description":"Place the spring roll wrapper in front of you, with one corner at the bottom so that it resembles a diamond. Brush the four edges of the wrapper with the beaten egg. Next, add the filling in the bottom part of the wrapper in a thin log shape, not touching the edges. Leave the bottom few centimetres clear."
    },
    {
      "headline":"Lift the wrapper over the top and tuck it in under the filling.",
      "description":"Fold over the left side, and then the right side and roll it up to form a tube. Brush a little more egg along the top part and seal the roll."
    },
    {
      "headline":"Repeat until all the rolls are finished.",
      "description":""
    },
    {
      "headline":"Fry the egg rolls.",
      "description":"Place a pan with oil over a medium heat. Wait until the oil is hot and then deep fry the egg rolls until they are lightly brown. Drain them on paper towels."
    },
    {
      "headline":"Serve.",
      "description":"Serve the finished egg rolls with a side of sweet & sour sauce or other favorite dips."
    }
  ],
  "text":" Cook the vegetables. Heat the wok with some vegetable oil. Add in the carrots, red pepper, bamboo shoots, bean sprouts, and cabbage. Cook everything together until they have slightly softened. Add the wet ingredients. Add the noodles, soy sauce, oyster sauce, sugar, salt, and pepper. Mix well and remove from the heat. Place everything in a bowl to cool. Make the spring rolls. Place the spring roll wrapper in front of you, with one corner at the bottom so that it resembles a diamond. Brush the four edges of the wrapper with the beaten egg. Next, add the filling in the bottom part of the wrapper in a thin log shape, not touching the edges. Leave the bottom few centimetres clear. Lift the wrapper over the top and tuck it in under the filling. Fold over the left side, and then the right side and roll it up to form a tube. Brush a little more egg along the top part and seal the roll. Repeat until all the rolls are finished.  Fry the egg rolls. Place a pan with oil over a medium heat. Wait until the oil is hot and then deep fry the egg rolls until they are lightly brown. Drain them on paper towels. Serve. Serve the finished egg rolls with a side of sweet & sour sauce or other favorite dips.",
  "sentences":[
    " Cook the vegetables.",
    "Heat the wok with some vegetable oil.",
    "Add in the carrots, red pepper, bamboo shoots, bean sprouts, and cabbage.",
    "Cook everything together until they have slightly softened.",
    "Add the wet ingredients.",
    "Add the noodles, soy sauce, oyster sauce, sugar, salt, and pepper.",
    "Mix well and remove from the heat.",
    "Place everything in a bowl to cool.",
    "Make the spring rolls.",
    "Place the spring roll wrapper in front of you, with one corner at the bottom so that it resembles a diamond.",
    "Brush the four edges of the wrapper with the beaten egg.",
    "Next, add the filling in the bottom part of the wrapper in a thin log shape, not touching the edges.",
    "Leave the bottom few centimetres clear.",
    "Lift the wrapper over the top and tuck it in under the filling.",
    "Fold over the left side, and then the right side and roll it up to form a tube.",
    "Brush a little more egg along the top part and seal the roll.",
    "Repeat until all the rolls are finished.",
    "Fry the egg rolls.",
    "Place a pan with oil over a medium heat.",
    "Wait until the oil is hot and then deep fry the egg rolls until they are lightly brown.",
    "Drain them on paper towels.",
    "Serve.",
    "Serve the finished egg rolls with a side of sweet & sour sauce or other favorite dips."
  ],
  "tyn_section":[
    "Wok",
    "Wooden spoon",
    "Bowl",
    "Spoon",
    "Brush",
    "Tea towel",
    "Saucepan",
    "Slotted spoon",
    "Tray lined with paper towels",
    "Tongs"
  ],
  "tyn_model":[
    "egg",
    "oil",
    "vegetables",
    "wok",
    "vegetable oil",
    "carrots",
    "red pepper",
    "bamboo shoots",
    "bean sprouts",
    "cabbage",
    "noodles",
    "soy sauce",
    "oyster sauce",
    "sugar",
    "salt",
    "pepper",
    "bowl",
    "spring roll",
    "pan",
    "paper towels",
    "sweet & sour sauce"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.0952380952,
    "f1":0.1290322581,
    "avg_pos":0.1428571429
  },
  "jacc_metrics_0.5":{
    "r":0.2,
    "p":0.0952380952,
    "f1":0.1290322581
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3,
    "p":0.1428571429,
    "f1":0.1935483871
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.0952380952,
    "f1":0.1290322581
  }
}