{
  "title":"How to Use a Wood Lathe",
  "url":"https://www.wikihow.com/Use-a-Wood-Lathe",
  "category_hierarchy":[
    "Home and Garden",
    "Tools"
  ],
  "steps":[
    {
      "headline":"Select a lathe suitable for your project.",
      "description":"Bench top lathes can be ideal for turning small projects like ink pens and yo-yos, larger machines may be used for making spindles used in furniture and handrail styles. Here are some differences in wood lathe specifications:\nBed length is the distance between centers, or the maximum length of the stock that can be turned. Swing is the term used to describe the largest diameter stock that can be turned. Horsepower is the amount of torque the lathe motor develops, which in turn will determine how heavy an item can be turned without overloading this critical component. RPMs are the revolutions per minute the stock can be turned. Here, note that most, if not all lathes have variable speed capabilities. A lathe with a very low speed range allows the user to start a piece of odd shaped, unbalanced stock without excessive vibration, and high speed machines can speed the work while making obtaining a fine, smooth finish easier to achieve. Weight and composition. Heavier machines with cast iron beds and steel frames offer a good, solid work platform, but can be difficult to move if you are operating it in a crowded workshop where you will be storing it when it is not in use."
    },
    {
      "headline":"Choose the lathe operation you are going to begin with.",
      "description":"A simple task might be to turn a square or irregularly shaped piece of wood to a true cylindrical shape, often the first step to forming a spindle or other round item."
    },
    {
      "headline":"Select the correct cutting tools for your objective.",
      "description":"Lathe tools are called chisels. They feature long, round, curved handles to afford a solid grip and sufficient leverage to enable the turner to control the cutting edge accurately with minimal fatigue. Common wood chisels simply are too short and are ill-designed for this purpose. Here are a few of the many types turning tools you may find:\nGouges. These usually have specially shaped cutting edges for performing particular cuts, such as bowl gouges, with concave, curved cutting edges to form the smooth, curved surface of a bowl, or vee, or knurling gouges for cutting grooves or knurls in wooden spindles. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/72\\/Woodturning6_605.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/72\\/Woodturning6_605.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nScrapers. These are often flat or slightly curved chisels for removing wood from flat or cylindrical shapes, or for roughing out a shape. Parting tools. These are thin, vee tipped tools for cutting off work pieces. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/3\\/31\\/Woodturning8_837.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/3\\/31\\/Woodturning8_837.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nSpoon cutters have a spoon shaped cutting edge and are also often used for shaping bowls. Other tools you may encounter are skew chisels, fluted gouges, spindle gouges, and nose chisels."
    },
    {
      "headline":"Learn the components of your lathe.",
      "description":"A basic wood lathe consists of a bed, headstock, tailstock, and tool rest. Here are the functions of each of these parts.The headstock consists of the drive train, including the motor, pulleys, belts, and spindle, and for a right handed turner, will be located on the left end of the lathe. Mounted on the end of the headstock facing the tailstock is the spindle and the spur center or for face turning such as bowls and plates, or other flat or face work, the face plate assembly. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/14\\/Woodturning19_547.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/14\\/Woodturning19_547.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nThe tail stock is the free spinning end of the lathe, and has the tailstock spindle and the cup center, as well as a hand-wheel or other feature for clamping or securing the work piece between the lathe centers. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/06\\/Woodturning11_68.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/06\\/Woodturning11_68.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nThe tool rest is similar to a mechanical arm with a metal guide bar to support the chisel used for turning the work piece. It usually can be adjusted by sliding the length of the bed at its base, with an intermediate arm that can swing from a parallel to a perpendicular position in relation to the lathe bed, and the upper arm, which holds the actual tool rest bar. This assembly has as many as three swivel joints, all of which tighten with a setscrew or clamp to keep it secure while turning is in progress. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Woodturning12_73.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Woodturning12_73.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Read your owner's manual before proceeding with actual lathe work for specific instructions, features and detailed safety instructions.",
      "description":"Keep your owner's manual handy for reference if you decide to purchase accessories for your particular lathe, for maintenance instructions, and for reference to capacities and specifications for your machine."
    },
    {
      "headline":"Select a suitable piece of wood for your project.",
      "description":"For a beginner, using a softwood like southern yellow pine, lodge-pole pine, or balsam fir may be a good idea. Look for a piece with fairly straight grain, and few, tight, knots. Never turn a split piece of stock, or one with loose knots, these may separate during turning, and become projectiles traveling at a significant speed."
    },
    {
      "headline":"Square the stock.",
      "description":"For example, if you are going to begin with a piece of 2X4 lumber, rip it to a nominally square shape, such as 2X2. You can then chamfer, or bevel the square corners, effectively creating an octagonal piece, which will reduce the amount of wood that must be removed to reach your desired cylindrical shape."
    },
    {
      "headline":"Cut the stock to the desired length.",
      "description":"For a beginner, starting with a relatively short length, less than 2 foot (0.6 m) long for an intermediate, or medium sized lathe, is a good choice. Longer work pieces are difficult to true, and maintaining a uniform diameter along the length of a longer piece can take a lot of work."
    },
    {
      "headline":"Mark the center of each end of your stock, and position it between the lathe centers.",
      "description":"Assuming the tailstock is not locked in position, slide this until it pushes the cup center into the tail end of your work piece. Using the hand crank, tighten the tailstock spindle so that it pushes the stock into the spur center, mounted on the headstock spindle. Make sure the work piece is securely held, and all clamps are tightened, otherwise, the work piece may fly off the lathe while you are turning. Also make sure the lathe keys are out of the machine before you start"
    },
    {
      "headline":"Position the tool rest parallel to the length of the work piece, keeping it far enough back to allow the work piece to rotate without hitting it, but as close as possible.",
      "description":"A good working distance is about 3/4 of an inch. Remember, the closer the tool rest is to the turning work piece, the more leverage and better control you will have with your knife (chisel)."
    },
    {
      "headline":"Free spin, or hand turn the work piece to make sure it doesn't hit the tool rest.",
      "description":"It is a good practice to always turn a work piece by hand before turning the lathe on, making sure it has sufficient clearance."
    },
    {
      "headline":"Choose the chisel you will use for the turning operation.",
      "description":"A roughing gouge is a good choice for beginning to turn an irregular or square work piece down to a round shape. Practice holding the tool on the tool rest, using your left (again, for right handed persons) hand on the metal blade behind the tool rest, and your right near the end of the handle. Keeping your elbows in, and braced against your body will give you better control of the tool."
    },
    {
      "headline":"Turn the lathe on, making sure it is at the lowest speed setting.",
      "description":"Place the cutting edge of the tool on the rest, keeping clear of the rotating work piece, check your grip, and slowly begin easing it toward the work piece. You want to move in toward it perpendicular to the work piece, until the cutting edge just touches the wood. Forcing it or moving too quickly will cause the tool to jam into the wood, and it will either break off, or you will lose your grip on the tool if the lathe doesn't stall out. This is one of the most dangerous steps in beginning turning."
    },
    {
      "headline":"Feel the resistance of the cutting edge and watch the size of the chips being cut from the work piece.",
      "description":"When truing, you will want to cut small chips, less than 1/4 of an inch in length."
    },
    {
      "headline":"Begin moving the cutting edge parallel to the rotation of the work piece, continuing to make a light cut along its length.",
      "description":"When using a roughing gouge or similar tool, you can cant, or pitch the tool edge so chips are thrown at an angle from the work piece, so you do not become covered with them while you turn. Twist the tool slightly and observe the flight path of the chips to adjust it so they fly away from you to your right or left."
    },
    {
      "headline":"Continue pushing the tool into the stock gradually, in passes, so that you remove a roughly equal amount of wood with each pass.",
      "description":"This will eventually cut away the angular corners, leaving your work piece round, and with practice, cylindrical in shape."
    },
    {
      "headline":"Stop the lathe frequently when you are just beginning, to check your progress, look for stress cracks in the wood, and clear debris which may begin to accumulate on the lathe bed.",
      "description":"You may want to use a pair of calipers to check the diameter of your work piece along its length so you finish with the desired diameter."
    },
    {
      "headline":"Smooth the finished round work piece by increasing your lathe speed, and holding your cutting tool so it barely contacts the wood, then moving it slowly along the work piece’s length.",
      "description":"The slower your tool movement, and finer, or lighter the cut, the smoother the finished cut will be."
    },
    {
      "headline":"Sand the work piece when you are finished cutting if desired.",
      "description":"You can sand the stock by hand while it is turning if you use caution. Turn the lathe off, and swing the tool rest out of the way, then select a suitable grit and type of sandpaper for this process. Turn the lathe back on, and hold the paper lightly against the wood, moving it back and forth to prevent removing too much wood from one area of the work piece."
    }
  ],
  "text":" Select a lathe suitable for your project. Bench top lathes can be ideal for turning small projects like ink pens and yo-yos, larger machines may be used for making spindles used in furniture and handrail styles. Here are some differences in wood lathe specifications:\nBed length is the distance between centers, or the maximum length of the stock that can be turned. Swing is the term used to describe the largest diameter stock that can be turned. Horsepower is the amount of torque the lathe motor develops, which in turn will determine how heavy an item can be turned without overloading this critical component. RPMs are the revolutions per minute the stock can be turned. Here, note that most, if not all lathes have variable speed capabilities. A lathe with a very low speed range allows the user to start a piece of odd shaped, unbalanced stock without excessive vibration, and high speed machines can speed the work while making obtaining a fine, smooth finish easier to achieve. Weight and composition. Heavier machines with cast iron beds and steel frames offer a good, solid work platform, but can be difficult to move if you are operating it in a crowded workshop where you will be storing it when it is not in use. Choose the lathe operation you are going to begin with. A simple task might be to turn a square or irregularly shaped piece of wood to a true cylindrical shape, often the first step to forming a spindle or other round item. Select the correct cutting tools for your objective. Lathe tools are called chisels. They feature long, round, curved handles to afford a solid grip and sufficient leverage to enable the turner to control the cutting edge accurately with minimal fatigue. Common wood chisels simply are too short and are ill-designed for this purpose. Here are a few of the many types turning tools you may find:\nGouges. These usually have specially shaped cutting edges for performing particular cuts, such as bowl gouges, with concave, curved cutting edges to form the smooth, curved surface of a bowl, or vee, or knurling gouges for cutting grooves or knurls in wooden spindles. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/72\\/Woodturning6_605.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/72\\/Woodturning6_605.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nScrapers. These are often flat or slightly curved chisels for removing wood from flat or cylindrical shapes, or for roughing out a shape. Parting tools. These are thin, vee tipped tools for cutting off work pieces. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/3\\/31\\/Woodturning8_837.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/3\\/31\\/Woodturning8_837.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nSpoon cutters have a spoon shaped cutting edge and are also often used for shaping bowls. Other tools you may encounter are skew chisels, fluted gouges, spindle gouges, and nose chisels. Learn the components of your lathe. A basic wood lathe consists of a bed, headstock, tailstock, and tool rest. Here are the functions of each of these parts.The headstock consists of the drive train, including the motor, pulleys, belts, and spindle, and for a right handed turner, will be located on the left end of the lathe. Mounted on the end of the headstock facing the tailstock is the spindle and the spur center or for face turning such as bowls and plates, or other flat or face work, the face plate assembly. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/14\\/Woodturning19_547.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/14\\/Woodturning19_547.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nThe tail stock is the free spinning end of the lathe, and has the tailstock spindle and the cup center, as well as a hand-wheel or other feature for clamping or securing the work piece between the lathe centers. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/06\\/Woodturning11_68.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/06\\/Woodturning11_68.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nThe tool rest is similar to a mechanical arm with a metal guide bar to support the chisel used for turning the work piece. It usually can be adjusted by sliding the length of the bed at its base, with an intermediate arm that can swing from a parallel to a perpendicular position in relation to the lathe bed, and the upper arm, which holds the actual tool rest bar. This assembly has as many as three swivel joints, all of which tighten with a setscrew or clamp to keep it secure while turning is in progress. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Woodturning12_73.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Woodturning12_73.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"} Read your owner's manual before proceeding with actual lathe work for specific instructions, features and detailed safety instructions. Keep your owner's manual handy for reference if you decide to purchase accessories for your particular lathe, for maintenance instructions, and for reference to capacities and specifications for your machine. Select a suitable piece of wood for your project. For a beginner, using a softwood like southern yellow pine, lodge-pole pine, or balsam fir may be a good idea. Look for a piece with fairly straight grain, and few, tight, knots. Never turn a split piece of stock, or one with loose knots, these may separate during turning, and become projectiles traveling at a significant speed. Square the stock. For example, if you are going to begin with a piece of 2X4 lumber, rip it to a nominally square shape, such as 2X2. You can then chamfer, or bevel the square corners, effectively creating an octagonal piece, which will reduce the amount of wood that must be removed to reach your desired cylindrical shape. Cut the stock to the desired length. For a beginner, starting with a relatively short length, less than 2 foot (0.6 m) long for an intermediate, or medium sized lathe, is a good choice. Longer work pieces are difficult to true, and maintaining a uniform diameter along the length of a longer piece can take a lot of work. Mark the center of each end of your stock, and position it between the lathe centers. Assuming the tailstock is not locked in position, slide this until it pushes the cup center into the tail end of your work piece. Using the hand crank, tighten the tailstock spindle so that it pushes the stock into the spur center, mounted on the headstock spindle. Make sure the work piece is securely held, and all clamps are tightened, otherwise, the work piece may fly off the lathe while you are turning. Also make sure the lathe keys are out of the machine before you start Position the tool rest parallel to the length of the work piece, keeping it far enough back to allow the work piece to rotate without hitting it, but as close as possible. A good working distance is about 3/4 of an inch. Remember, the closer the tool rest is to the turning work piece, the more leverage and better control you will have with your knife (chisel). Free spin, or hand turn the work piece to make sure it doesn't hit the tool rest. It is a good practice to always turn a work piece by hand before turning the lathe on, making sure it has sufficient clearance. Choose the chisel you will use for the turning operation. A roughing gouge is a good choice for beginning to turn an irregular or square work piece down to a round shape. Practice holding the tool on the tool rest, using your left (again, for right handed persons) hand on the metal blade behind the tool rest, and your right near the end of the handle. Keeping your elbows in, and braced against your body will give you better control of the tool. Turn the lathe on, making sure it is at the lowest speed setting. Place the cutting edge of the tool on the rest, keeping clear of the rotating work piece, check your grip, and slowly begin easing it toward the work piece. You want to move in toward it perpendicular to the work piece, until the cutting edge just touches the wood. Forcing it or moving too quickly will cause the tool to jam into the wood, and it will either break off, or you will lose your grip on the tool if the lathe doesn't stall out. This is one of the most dangerous steps in beginning turning. Feel the resistance of the cutting edge and watch the size of the chips being cut from the work piece. When truing, you will want to cut small chips, less than 1/4 of an inch in length. Begin moving the cutting edge parallel to the rotation of the work piece, continuing to make a light cut along its length. When using a roughing gouge or similar tool, you can cant, or pitch the tool edge so chips are thrown at an angle from the work piece, so you do not become covered with them while you turn. Twist the tool slightly and observe the flight path of the chips to adjust it so they fly away from you to your right or left. Continue pushing the tool into the stock gradually, in passes, so that you remove a roughly equal amount of wood with each pass. This will eventually cut away the angular corners, leaving your work piece round, and with practice, cylindrical in shape. Stop the lathe frequently when you are just beginning, to check your progress, look for stress cracks in the wood, and clear debris which may begin to accumulate on the lathe bed. You may want to use a pair of calipers to check the diameter of your work piece along its length so you finish with the desired diameter. Smooth the finished round work piece by increasing your lathe speed, and holding your cutting tool so it barely contacts the wood, then moving it slowly along the work piece’s length. The slower your tool movement, and finer, or lighter the cut, the smoother the finished cut will be. Sand the work piece when you are finished cutting if desired. You can sand the stock by hand while it is turning if you use caution. Turn the lathe off, and swing the tool rest out of the way, then select a suitable grit and type of sandpaper for this process. Turn the lathe back on, and hold the paper lightly against the wood, moving it back and forth to prevent removing too much wood from one area of the work piece.",
  "sentences":[
    " Select a lathe suitable for your project.",
    "Bench top lathes can be ideal for turning small projects like ink pens and yo-yos, larger machines may be used for making spindles used in furniture and handrail styles.",
    "Here are some differences in wood lathe specifications:\nBed length is the distance between centers, or the maximum length of the stock that can be turned.",
    "Swing is the term used to describe the largest diameter stock that can be turned.",
    "Horsepower is the amount of torque the lathe motor develops, which in turn will determine how heavy an item can be turned without overloading this critical component.",
    "RPMs are the revolutions per minute the stock can be turned.",
    "Here, note that most, if not all lathes have variable speed capabilities.",
    "A lathe with a very low speed range allows the user to start a piece of odd shaped, unbalanced stock without excessive vibration, and high speed machines can speed the work while making obtaining a fine, smooth finish easier to achieve.",
    "Weight and composition.",
    "Heavier machines with cast iron beds and steel frames offer a good, solid work platform, but can be difficult to move if you are operating it in a crowded workshop where you will be storing it when it is not in use.",
    "Choose the lathe operation you are going to begin with.",
    "A simple task might be to turn a square or irregularly shaped piece of wood to a true cylindrical shape, often the first step to forming a spindle or other round item.",
    "Select the correct cutting tools for your objective.",
    "Lathe tools are called chisels.",
    "They feature long, round, curved handles to afford a solid grip and sufficient leverage to enable the turner to control the cutting edge accurately with minimal fatigue.",
    "Common wood chisels simply are too short and are ill-designed for this purpose.",
    "Here are a few of the many types turning tools you may find:\nGouges.",
    "These usually have specially shaped cutting edges for performing particular cuts, such as bowl gouges, with concave, curved cutting edges to form the smooth, curved surface of a bowl, or vee, or knurling gouges for cutting grooves or knurls in wooden spindles.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/72\\/Woodturning6_605.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/72\\/Woodturning6_605.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nScrapers.",
    "These are often flat or slightly curved chisels for removing wood from flat or cylindrical shapes, or for roughing out a shape.",
    "Parting tools.",
    "These are thin, vee tipped tools for cutting off work pieces.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/3\\/31\\/Woodturning8_837.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/3\\/31\\/Woodturning8_837.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nSpoon cutters have a spoon shaped cutting edge and are also often used for shaping bowls.",
    "Other tools you may encounter are skew chisels, fluted gouges, spindle gouges, and nose chisels.",
    "Learn the components of your lathe.",
    "A basic wood lathe consists of a bed, headstock, tailstock, and tool rest.",
    "Here are the functions of each of these parts.The headstock consists of the drive train, including the motor, pulleys, belts, and spindle, and for a right handed turner, will be located on the left end of the lathe.",
    "Mounted on the end of the headstock facing the tailstock is the spindle and the spur center or for face turning such as bowls and plates, or other flat or face work, the face plate assembly.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/14\\/Woodturning19_547.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/14\\/Woodturning19_547.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nThe tail stock is the free spinning end of the lathe, and has the tailstock spindle and the cup center, as well as a hand-wheel or other feature for clamping or securing the work piece between the lathe centers.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/06\\/Woodturning11_68.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/06\\/Woodturning11_68.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}\n\nThe tool rest is similar to a mechanical arm with a metal guide bar to support the chisel used for turning the work piece.",
    "It usually can be adjusted by sliding the length of the bed at its base, with an intermediate arm that can swing from a parallel to a perpendicular position in relation to the lathe bed, and the upper arm, which holds the actual tool rest bar.",
    "This assembly has as many as three swivel joints, all of which tighten with a setscrew or clamp to keep it secure while turning is in progress.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Woodturning12_73.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0d\\/Woodturning12_73.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"} Read your owner's manual before proceeding with actual lathe work for specific instructions, features and detailed safety instructions.",
    "Keep your owner's manual handy for reference if you decide to purchase accessories for your particular lathe, for maintenance instructions, and for reference to capacities and specifications for your machine.",
    "Select a suitable piece of wood for your project.",
    "For a beginner, using a softwood like southern yellow pine, lodge-pole pine, or balsam fir may be a good idea.",
    "Look for a piece with fairly straight grain, and few, tight, knots.",
    "Never turn a split piece of stock, or one with loose knots, these may separate during turning, and become projectiles traveling at a significant speed.",
    "Square the stock.",
    "For example, if you are going to begin with a piece of 2X4 lumber, rip it to a nominally square shape, such as 2X2.",
    "You can then chamfer, or bevel the square corners, effectively creating an octagonal piece, which will reduce the amount of wood that must be removed to reach your desired cylindrical shape.",
    "Cut the stock to the desired length.",
    "For a beginner, starting with a relatively short length, less than 2 foot (0.6 m) long for an intermediate, or medium sized lathe, is a good choice.",
    "Longer work pieces are difficult to true, and maintaining a uniform diameter along the length of a longer piece can take a lot of work.",
    "Mark the center of each end of your stock, and position it between the lathe centers.",
    "Assuming the tailstock is not locked in position, slide this until it pushes the cup center into the tail end of your work piece.",
    "Using the hand crank, tighten the tailstock spindle so that it pushes the stock into the spur center, mounted on the headstock spindle.",
    "Make sure the work piece is securely held, and all clamps are tightened, otherwise, the work piece may fly off the lathe while you are turning.",
    "Also make sure the lathe keys are out of the machine before you start Position the tool rest parallel to the length of the work piece, keeping it far enough back to allow the work piece to rotate without hitting it, but as close as possible.",
    "A good working distance is about 3/4 of an inch.",
    "Remember, the closer the tool rest is to the turning work piece, the more leverage and better control you will have with your knife (chisel).",
    "Free spin, or hand turn the work piece to make sure it doesn't hit the tool rest.",
    "It is a good practice to always turn a work piece by hand before turning the lathe on, making sure it has sufficient clearance.",
    "Choose the chisel you will use for the turning operation.",
    "A roughing gouge is a good choice for beginning to turn an irregular or square work piece down to a round shape.",
    "Practice holding the tool on the tool rest, using your left (again, for right handed persons) hand on the metal blade behind the tool rest, and your right near the end of the handle.",
    "Keeping your elbows in, and braced against your body will give you better control of the tool.",
    "Turn the lathe on, making sure it is at the lowest speed setting.",
    "Place the cutting edge of the tool on the rest, keeping clear of the rotating work piece, check your grip, and slowly begin easing it toward the work piece.",
    "You want to move in toward it perpendicular to the work piece, until the cutting edge just touches the wood.",
    "Forcing it or moving too quickly will cause the tool to jam into the wood, and it will either break off, or you will lose your grip on the tool if the lathe doesn't stall out.",
    "This is one of the most dangerous steps in beginning turning.",
    "Feel the resistance of the cutting edge and watch the size of the chips being cut from the work piece.",
    "When truing, you will want to cut small chips, less than 1/4 of an inch in length.",
    "Begin moving the cutting edge parallel to the rotation of the work piece, continuing to make a light cut along its length.",
    "When using a roughing gouge or similar tool, you can cant, or pitch the tool edge so chips are thrown at an angle from the work piece, so you do not become covered with them while you turn.",
    "Twist the tool slightly and observe the flight path of the chips to adjust it so they fly away from you to your right or left.",
    "Continue pushing the tool into the stock gradually, in passes, so that you remove a roughly equal amount of wood with each pass.",
    "This will eventually cut away the angular corners, leaving your work piece round, and with practice, cylindrical in shape.",
    "Stop the lathe frequently when you are just beginning, to check your progress, look for stress cracks in the wood, and clear debris which may begin to accumulate on the lathe bed.",
    "You may want to use a pair of calipers to check the diameter of your work piece along its length so you finish with the desired diameter.",
    "Smooth the finished round work piece by increasing your lathe speed, and holding your cutting tool so it barely contacts the wood, then moving it slowly along the work piece’s length.",
    "The slower your tool movement, and finer, or lighter the cut, the smoother the finished cut will be.",
    "Sand the work piece when you are finished cutting if desired.",
    "You can sand the stock by hand while it is turning if you use caution.",
    "Turn the lathe off, and swing the tool rest out of the way, then select a suitable grit and type of sandpaper for this process.",
    "Turn the lathe back on, and hold the paper lightly against the wood, moving it back and forth to prevent removing too much wood from one area of the work piece."
  ],
  "tyn_section":[
    "Lathe",
    "Turning tools",
    "Wood stock",
    "Safety equipment"
  ],
  "tyn_model":[
    "lathe",
    "tool",
    "spindle",
    "chisel",
    "lathes",
    "wood lathe",
    "wood",
    "bowls",
    "yo-yos,",
    "machines",
    "cutting tools",
    "lathe tools",
    "turner",
    "bowl",
    "scrapers",
    "spoon cutters",
    "spoon",
    "belts",
    "spur",
    "plates",
    "parser",
    "tool rest",
    "lodge-pole pine",
    "lumber",
    "stock",
    "knife",
    "roughing gouge",
    "calipers",
    "sandpaper",
    "paper"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0333333333,
    "f1":0.0588235294,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1666666667,
    "f1":0.25
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2,
    "f1":0.3157894737
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0333333333,
    "f1":0.0588235294
  }
}