{
  "title":"How to Roast Partridge",
  "url":"https://www.wikihow.com/Roast-Partridge",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat"
  ],
  "methods":[
    {
      "name":"Part One: Brining the Partridge",
      "steps":[
        {
          "headline":"Combine the brine ingredients.",
          "description":"Place the salt, bay leaf, dried thyme, and rosemary in a large bowl or dish. Pour steaming hot tap water over the other ingredients in the dish. Make sure that the dish you use is also large enough to hold both partridges. The water does not need to be boiling hot, but it should be as hot as your tap can make it."
        },
        {
          "headline":"Cool the brine.",
          "description":"Set the brine aside on your kitchen counter for 30 minutes, or until it cools to room temperature. Do not refrigerate the brine yet. You may want to loosely cover the bowl of brine with a paper towel or piece of plastic wrap to prevent dust or other contaminants from falling in."
        },
        {
          "headline":"Submerge the partridge.",
          "description":"Place both partridges in the brine. Make sure that they are completely covered by the brine. Once the birds are inside, cover the dish more securely with a lid or a piece of plastic wrap."
        },
        {
          "headline":"Refrigerate for 8 hours.",
          "description":"Place the brine-covered partridges in the refrigerator. Keep the dish there for 3 to 8 hours. During this time, the brine breaks down some of the muscle fibers of the partridge, turning them from solids into liquids. It also seeps into the remaining fibers, infusing the meat with more moisture. Avoid brining the birds for more than 8 hours, though, since the brine can ruin the meat if too many muscle fibers are destroyed during this stage."
        }
      ]
    },
    {
      "name":"Part Two: Roasting the Partridge",
      "steps":[
        {
          "headline":"Dry off the partridge.",
          "description":"Remove the partridges from the brine and pat them dry with clean paper towels. You should also let the birds sit out at room temperature for about 20 minutes after pulling them out of the brine. This allows more of the excess moisture to dry, and it also drops the temperature of the meat to a warmer temperature, thereby reducing the amount of time the partridges will spend cooking in dry heat."
        },
        {
          "headline":"Preheat the oven to 400 degrees Fahrenheit (200 degrees Celsius).",
          "description":"Prepare a small roasting pan or shallow baking dish by lining it with nonstick aluminum foil. The foil is not strictly necessary, but it can make it easier to clean the dish later."
        },
        {
          "headline":"Place the partridge in the roasting pan.",
          "description":"Arrange both partridges in the same roasting pan, breast-side up. Ideally, the two partridges should be in a single snug layer. There should not be much excess room for them to move around."
        },
        {
          "headline":"Add the butter and broth.",
          "description":"Rub the softened butter over each partridge. After applying the butter, pour the chicken broth over the partridges, as well. When applying the butter, make sure that you get all outer sides of the skin. If there is any butter left after the outside is finished, tuck it underneath the skin. Between the salt in the brine, the salt in the broth, and the salt in the bacon (see next step), there should be plenty of salt to thoroughly season the meat of the partridges at this point. Do not add any more."
        },
        {
          "headline":"Drape the bacon over the bird.",
          "description":"Lay or wrap the bacon over the partridges, using two slices of bacon per bird. If you choose to wrap the bacon over the partridges instead of merely laying it on top, you may need to use toothpicks to hold the bacon in place. Note that sliced salt pork can be used instead of bacon, if desired. The bacon adds flavor to the partridges, but it is also another trick used to help keep the meat moist during the dry cooking process."
        },
        {
          "headline":"Cover with foil.",
          "description":"Cover the entire roasting pan loosely with aluminum foil. The wrapping should be fairly loose. If you make it too tight, it could disturb the bacon lying on top of the birds."
        },
        {
          "headline":"Roast for 25 minutes.",
          "description":"Place the roasting dish in the oven and let the partridges cook, covered, for roughly 25 minutes. Meanwhile, prepare a second small baking sheet by lining it with nonstick aluminum foil."
        },
        {
          "headline":"Remove the foil and continue roasting.",
          "description":"Remove the dish from the oven and take off the foil. Take the bacon off of the partridges, then cook both the birds and the bacon separately for another 10 minutes. Place the bacon on the lined baking sheet before returning it to the oven. The partridges should remain in their original roasting dish, but they should be cooked uncovered during this part of the process. Baste the partridges with the juices in the pan before returning them to the oven. Do so once more after about 5 minutes, or halfway through this final part of the cooking process."
        },
        {
          "headline":"Let the partridge rest.",
          "description":"Pull the partridges and the bacon out of the oven. Let the meat rest while you prepare the sauce. The bacon will be crisp when done. The partridges should be golden brown when done, with an internal temperature of 180 degrees Fahrenheit (82.2 degrees Celsius). If you do not have a meat thermometer, you can perform a quick visual test for doneness by piercing the partridge with a fork. The fork should glide in easily. You should also be able to wiggle both legs of the partridge without difficulty. Place the partridges and bacon on a warm serving plate during this time and cover them with more foil. No matter how long it takes for you to prepare the gravy, the partridges should rest for at least 5 to 10 minutes."
        }
      ]
    },
    {
      "name":"Part Three: Making the Gravy",
      "steps":[
        {
          "headline":"Transfer the juices to a saucepan.",
          "description":"Pour the leftover juices from the roasting dish into a small to medium saucepan. Set the saucepan on the stove over medium-high heat. Since there will be a considerable amount of fat in these juices, you may wish to strain it out by pouring the juices through a sieve and into the pan. The fine mesh of the sieve should strain out most larger pieces of fat."
        },
        {
          "headline":"Mix the cornstarch and water.",
          "description":"In a separate small bowl, use a fork to whisk together the cornstarch and cold water, forming a slurry. The two ingredients must be thoroughly combined before you proceed. Do not allow any of the cornstarch to stick to the bottom of the bowl."
        },
        {
          "headline":"Add the cornstarch mixture to the juices.",
          "description":"Pour the cornstarch slurry into the juices sitting on the stove. Stir to combine. Cook the new mixture in the saucepan over medium-high heat until it boils and thickens, stirring the mixture occasionally as it heats up."
        },
        {
          "headline":"Season with mustard, jelly, salt, and pepper.",
          "description":"Add these four remaining ingredients to the gravy. Stir them in thoroughly, then heat through. If desired, you could skip the Dijon mustard and red currant jelly, adding only the salt and pepper. Doing so will create a more traditional poultry-style gravy."
        }
      ]
    },
    {
      "name":"Part Four: Serving the Partridge",
      "steps":[
        {
          "headline":"Serve with bacon and gravy.",
          "description":"Place one partridge on one serving plate. Lay two pieces of bacon on top, then spoon some of the gravy over the entire thing. You could also serve the bacon on the side, if desired. If you want each person to be able to add the gravy separately, ladle it into a gravy boat and set it down on the side of the plates."
        },
        {
          "headline":"Carve each partridge individually.",
          "description":"Since partridges are so small, each person would traditionally carve his or her own while eating the bird. If you are not concerned with presentation, however, you could carve both birds before plating them. There is no set technique for carving a partridge, but typically, you would begin by removing the legs and wings from the body of the bird. Strip the meat off the legs and wings, then from the breast and back of the partridge."
        }
      ]
    }
  ],
  "text":" Part One: Brining the Partridge Combine the brine ingredients. Place the salt, bay leaf, dried thyme, and rosemary in a large bowl or dish. Pour steaming hot tap water over the other ingredients in the dish. Make sure that the dish you use is also large enough to hold both partridges. The water does not need to be boiling hot, but it should be as hot as your tap can make it. Cool the brine. Set the brine aside on your kitchen counter for 30 minutes, or until it cools to room temperature. Do not refrigerate the brine yet. You may want to loosely cover the bowl of brine with a paper towel or piece of plastic wrap to prevent dust or other contaminants from falling in. Submerge the partridge. Place both partridges in the brine. Make sure that they are completely covered by the brine. Once the birds are inside, cover the dish more securely with a lid or a piece of plastic wrap. Refrigerate for 8 hours. Place the brine-covered partridges in the refrigerator. Keep the dish there for 3 to 8 hours. During this time, the brine breaks down some of the muscle fibers of the partridge, turning them from solids into liquids. It also seeps into the remaining fibers, infusing the meat with more moisture. Avoid brining the birds for more than 8 hours, though, since the brine can ruin the meat if too many muscle fibers are destroyed during this stage. Part Two: Roasting the Partridge Dry off the partridge. Remove the partridges from the brine and pat them dry with clean paper towels. You should also let the birds sit out at room temperature for about 20 minutes after pulling them out of the brine. This allows more of the excess moisture to dry, and it also drops the temperature of the meat to a warmer temperature, thereby reducing the amount of time the partridges will spend cooking in dry heat. Preheat the oven to 400 degrees Fahrenheit (200 degrees Celsius). Prepare a small roasting pan or shallow baking dish by lining it with nonstick aluminum foil. The foil is not strictly necessary, but it can make it easier to clean the dish later. Place the partridge in the roasting pan. Arrange both partridges in the same roasting pan, breast-side up. Ideally, the two partridges should be in a single snug layer. There should not be much excess room for them to move around. Add the butter and broth. Rub the softened butter over each partridge. After applying the butter, pour the chicken broth over the partridges, as well. When applying the butter, make sure that you get all outer sides of the skin. If there is any butter left after the outside is finished, tuck it underneath the skin. Between the salt in the brine, the salt in the broth, and the salt in the bacon (see next step), there should be plenty of salt to thoroughly season the meat of the partridges at this point. Do not add any more. Drape the bacon over the bird. Lay or wrap the bacon over the partridges, using two slices of bacon per bird. If you choose to wrap the bacon over the partridges instead of merely laying it on top, you may need to use toothpicks to hold the bacon in place. Note that sliced salt pork can be used instead of bacon, if desired. The bacon adds flavor to the partridges, but it is also another trick used to help keep the meat moist during the dry cooking process. Cover with foil. Cover the entire roasting pan loosely with aluminum foil. The wrapping should be fairly loose. If you make it too tight, it could disturb the bacon lying on top of the birds. Roast for 25 minutes. Place the roasting dish in the oven and let the partridges cook, covered, for roughly 25 minutes. Meanwhile, prepare a second small baking sheet by lining it with nonstick aluminum foil. Remove the foil and continue roasting. Remove the dish from the oven and take off the foil. Take the bacon off of the partridges, then cook both the birds and the bacon separately for another 10 minutes. Place the bacon on the lined baking sheet before returning it to the oven. The partridges should remain in their original roasting dish, but they should be cooked uncovered during this part of the process. Baste the partridges with the juices in the pan before returning them to the oven. Do so once more after about 5 minutes, or halfway through this final part of the cooking process. Let the partridge rest. Pull the partridges and the bacon out of the oven. Let the meat rest while you prepare the sauce. The bacon will be crisp when done. The partridges should be golden brown when done, with an internal temperature of 180 degrees Fahrenheit (82.2 degrees Celsius). If you do not have a meat thermometer, you can perform a quick visual test for doneness by piercing the partridge with a fork. The fork should glide in easily. You should also be able to wiggle both legs of the partridge without difficulty. Place the partridges and bacon on a warm serving plate during this time and cover them with more foil. No matter how long it takes for you to prepare the gravy, the partridges should rest for at least 5 to 10 minutes. Part Three: Making the Gravy Transfer the juices to a saucepan. Pour the leftover juices from the roasting dish into a small to medium saucepan. Set the saucepan on the stove over medium-high heat. Since there will be a considerable amount of fat in these juices, you may wish to strain it out by pouring the juices through a sieve and into the pan. The fine mesh of the sieve should strain out most larger pieces of fat. Mix the cornstarch and water. In a separate small bowl, use a fork to whisk together the cornstarch and cold water, forming a slurry. The two ingredients must be thoroughly combined before you proceed. Do not allow any of the cornstarch to stick to the bottom of the bowl. Add the cornstarch mixture to the juices. Pour the cornstarch slurry into the juices sitting on the stove. Stir to combine. Cook the new mixture in the saucepan over medium-high heat until it boils and thickens, stirring the mixture occasionally as it heats up. Season with mustard, jelly, salt, and pepper. Add these four remaining ingredients to the gravy. Stir them in thoroughly, then heat through. If desired, you could skip the Dijon mustard and red currant jelly, adding only the salt and pepper. Doing so will create a more traditional poultry-style gravy. Part Four: Serving the Partridge Serve with bacon and gravy. Place one partridge on one serving plate. Lay two pieces of bacon on top, then spoon some of the gravy over the entire thing. You could also serve the bacon on the side, if desired. If you want each person to be able to add the gravy separately, ladle it into a gravy boat and set it down on the side of the plates. Carve each partridge individually. Since partridges are so small, each person would traditionally carve his or her own while eating the bird. If you are not concerned with presentation, however, you could carve both birds before plating them. There is no set technique for carving a partridge, but typically, you would begin by removing the legs and wings from the body of the bird. Strip the meat off the legs and wings, then from the breast and back of the partridge.",
  "sentences":[
    " Part One: Brining the Partridge Combine the brine ingredients.",
    "Place the salt, bay leaf, dried thyme, and rosemary in a large bowl or dish.",
    "Pour steaming hot tap water over the other ingredients in the dish.",
    "Make sure that the dish you use is also large enough to hold both partridges.",
    "The water does not need to be boiling hot, but it should be as hot as your tap can make it.",
    "Cool the brine.",
    "Set the brine aside on your kitchen counter for 30 minutes, or until it cools to room temperature.",
    "Do not refrigerate the brine yet.",
    "You may want to loosely cover the bowl of brine with a paper towel or piece of plastic wrap to prevent dust or other contaminants from falling in.",
    "Submerge the partridge.",
    "Place both partridges in the brine.",
    "Make sure that they are completely covered by the brine.",
    "Once the birds are inside, cover the dish more securely with a lid or a piece of plastic wrap.",
    "Refrigerate for 8 hours.",
    "Place the brine-covered partridges in the refrigerator.",
    "Keep the dish there for 3 to 8 hours.",
    "During this time, the brine breaks down some of the muscle fibers of the partridge, turning them from solids into liquids.",
    "It also seeps into the remaining fibers, infusing the meat with more moisture.",
    "Avoid brining the birds for more than 8 hours, though, since the brine can ruin the meat if too many muscle fibers are destroyed during this stage.",
    "Part Two: Roasting the Partridge Dry off the partridge.",
    "Remove the partridges from the brine and pat them dry with clean paper towels.",
    "You should also let the birds sit out at room temperature for about 20 minutes after pulling them out of the brine.",
    "This allows more of the excess moisture to dry, and it also drops the temperature of the meat to a warmer temperature, thereby reducing the amount of time the partridges will spend cooking in dry heat.",
    "Preheat the oven to 400 degrees Fahrenheit (200 degrees Celsius).",
    "Prepare a small roasting pan or shallow baking dish by lining it with nonstick aluminum foil.",
    "The foil is not strictly necessary, but it can make it easier to clean the dish later.",
    "Place the partridge in the roasting pan.",
    "Arrange both partridges in the same roasting pan, breast-side up.",
    "Ideally, the two partridges should be in a single snug layer.",
    "There should not be much excess room for them to move around.",
    "Add the butter and broth.",
    "Rub the softened butter over each partridge.",
    "After applying the butter, pour the chicken broth over the partridges, as well.",
    "When applying the butter, make sure that you get all outer sides of the skin.",
    "If there is any butter left after the outside is finished, tuck it underneath the skin.",
    "Between the salt in the brine, the salt in the broth, and the salt in the bacon (see next step), there should be plenty of salt to thoroughly season the meat of the partridges at this point.",
    "Do not add any more.",
    "Drape the bacon over the bird.",
    "Lay or wrap the bacon over the partridges, using two slices of bacon per bird.",
    "If you choose to wrap the bacon over the partridges instead of merely laying it on top, you may need to use toothpicks to hold the bacon in place.",
    "Note that sliced salt pork can be used instead of bacon, if desired.",
    "The bacon adds flavor to the partridges, but it is also another trick used to help keep the meat moist during the dry cooking process.",
    "Cover with foil.",
    "Cover the entire roasting pan loosely with aluminum foil.",
    "The wrapping should be fairly loose.",
    "If you make it too tight, it could disturb the bacon lying on top of the birds.",
    "Roast for 25 minutes.",
    "Place the roasting dish in the oven and let the partridges cook, covered, for roughly 25 minutes.",
    "Meanwhile, prepare a second small baking sheet by lining it with nonstick aluminum foil.",
    "Remove the foil and continue roasting.",
    "Remove the dish from the oven and take off the foil.",
    "Take the bacon off of the partridges, then cook both the birds and the bacon separately for another 10 minutes.",
    "Place the bacon on the lined baking sheet before returning it to the oven.",
    "The partridges should remain in their original roasting dish, but they should be cooked uncovered during this part of the process.",
    "Baste the partridges with the juices in the pan before returning them to the oven.",
    "Do so once more after about 5 minutes, or halfway through this final part of the cooking process.",
    "Let the partridge rest.",
    "Pull the partridges and the bacon out of the oven.",
    "Let the meat rest while you prepare the sauce.",
    "The bacon will be crisp when done.",
    "The partridges should be golden brown when done, with an internal temperature of 180 degrees Fahrenheit (82.2 degrees Celsius).",
    "If you do not have a meat thermometer, you can perform a quick visual test for doneness by piercing the partridge with a fork.",
    "The fork should glide in easily.",
    "You should also be able to wiggle both legs of the partridge without difficulty.",
    "Place the partridges and bacon on a warm serving plate during this time and cover them with more foil.",
    "No matter how long it takes for you to prepare the gravy, the partridges should rest for at least 5 to 10 minutes.",
    "Part Three: Making the Gravy Transfer the juices to a saucepan.",
    "Pour the leftover juices from the roasting dish into a small to medium saucepan.",
    "Set the saucepan on the stove over medium-high heat.",
    "Since there will be a considerable amount of fat in these juices, you may wish to strain it out by pouring the juices through a sieve and into the pan.",
    "The fine mesh of the sieve should strain out most larger pieces of fat.",
    "Mix the cornstarch and water.",
    "In a separate small bowl, use a fork to whisk together the cornstarch and cold water, forming a slurry.",
    "The two ingredients must be thoroughly combined before you proceed.",
    "Do not allow any of the cornstarch to stick to the bottom of the bowl.",
    "Add the cornstarch mixture to the juices.",
    "Pour the cornstarch slurry into the juices sitting on the stove.",
    "Stir to combine.",
    "Cook the new mixture in the saucepan over medium-high heat until it boils and thickens, stirring the mixture occasionally as it heats up.",
    "Season with mustard, jelly, salt, and pepper.",
    "Add these four remaining ingredients to the gravy.",
    "Stir them in thoroughly, then heat through.",
    "If desired, you could skip the Dijon mustard and red currant jelly, adding only the salt and pepper.",
    "Doing so will create a more traditional poultry-style gravy.",
    "Part Four: Serving the Partridge Serve with bacon and gravy.",
    "Place one partridge on one serving plate.",
    "Lay two pieces of bacon on top, then spoon some of the gravy over the entire thing.",
    "You could also serve the bacon on the side, if desired.",
    "If you want each person to be able to add the gravy separately, ladle it into a gravy boat and set it down on the side of the plates.",
    "Carve each partridge individually.",
    "Since partridges are so small, each person would traditionally carve his or her own while eating the bird.",
    "If you are not concerned with presentation, however, you could carve both birds before plating them.",
    "There is no set technique for carving a partridge, but typically, you would begin by removing the legs and wings from the body of the bird.",
    "Strip the meat off the legs and wings, then from the breast and back of the partridge."
  ],
  "tyn_section":[
    "Large dish",
    "Plastic wrap",
    "Refrigerator",
    "Paper towels",
    "Oven",
    "Small roasting pan or shallow baking dish",
    "Nonstick aluminum foil",
    "Toothpicks",
    "Small baking sheet",
    "Baster",
    "Meat thermometer",
    "Forks",
    "Knives",
    "Serving plates",
    "Stove",
    "Small to medium saucepan",
    "Mixing spoon",
    "Fork",
    "Small bowl",
    "Sieve"
  ],
  "tyn_model":[
    "bacon",
    "salt",
    "oven",
    "butter",
    "cornstarch",
    "roasting pan",
    "foil",
    "saucepan",
    "partridge",
    "roasting dish",
    "fork",
    "gravy",
    "water",
    "plastic wrap",
    "dish",
    "nonstick aluminum foil",
    "broth",
    "baking sheet",
    "pan",
    "stove",
    "sieve",
    "bay leaf",
    "rosemary",
    "tap water",
    "paper towel",
    "refrigerator",
    "brine",
    "paper towels",
    "baking dish",
    "chicken broth",
    "salt pork",
    "aluminum foil",
    "meat thermometer",
    "serving plate",
    "cold water",
    "bowl",
    "mustard",
    "jelly",
    "pepper",
    "dijon mustard",
    "red currant jelly",
    "plate",
    "gravy boat",
    "plates"
  ],
  "simple_metrics":{
    "r":0.45,
    "p":0.2045454545,
    "f1":0.28125,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.65,
    "p":0.3181818182,
    "f1":0.4272300469
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.65,
    "p":0.4318181818,
    "f1":0.518907563
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333
  }
}