{
  "title":"How to Cook a Deer Roast in a Slow Cooker",
  "url":"https://www.wikihow.com/Cook-a-Deer-Roast-in-a-Slow-Cooker",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat"
  ],
  "methods":[
    {
      "name":"Method One: Traditional Venison Roast",
      "steps":[
        {
          "headline":"Place the roast and broth in the slow cooker.",
          "description":"Place the venison roast in your slow cooker. Pour 2 cups (500 ml) of beef broth over it evenly. If you do not have beef broth, you could use venison stock, beef stock, chicken stock, or vegetable broth. In a pinch, you could even use water."
        },
        {
          "headline":"Cover the roast with butter.",
          "description":"Cut the butter into small chunks and distribute it evenly over the surface of the roast. If the butter has been softened, smear it over the top and sides of the meat. If the butter is still hard, however, simply distribute the chunks of butter over the surface as evenly as possible to distribute the flavor."
        },
        {
          "headline":"Add the seasonings.",
          "description":"Combine the garlic, salt, pepper, paprika, thyme, and rosemary in a small bowl. Sprinkle this blend of spices and herbs evenly over the top and sides of the roast. If you want the seasonings to penetrate the meat even further, consider using your hands to rub the seasoning blend into the meat. This works best if you are also using softened butter since you can spread both the butter and the seasonings over the surface at the same time."
        },
        {
          "headline":"Add the vegetables.",
          "description":"Spread the diced onion over the top of the roast. Layer the cubed potatoes and chopped carrots on top, as well. Even if you choose not to prepare the roast with vegetables, you should still add the onion. Many people claim that the pungent onion flavor masks the \"gamey\" taste of a deer roast. If you prefer crisp, firm vegetables, you can wait until the final 2 hours of cooking time before adding the cubed potatoes and chopped carrots. The onion should always be added at this time, however."
        },
        {
          "headline":"Cook on low for 8 to 10 hours.",
          "description":"Cover the slow cooker and switch it to low. A thawed roast should take about 8 hours, but a frozen or partially frozen roast will need a full 10 hours. Alternatively, you could switch the slow cooker on high and leave it for 6 hours."
        },
        {
          "headline":"Serve warm.",
          "description":"Once the roast has finished cooking, remove it from the slow cooker and carve it into portion-sized chunks. Serve the potatoes and carrots on the side."
        }
      ]
    },
    {
      "name":"Method Two: Pulled Venison Roast Sandwiches",
      "steps":[
        {
          "headline":"Cut the roast into slices.",
          "description":"Use a sharp knife to cut the venison roast into slices that are roughly 2 inches (5 cm) thick. Cutting the roast into slices will make it easier to keep the meat submerged under the sauce as it cooks. You should also remove any visible fat and connective tissue as you cut the roast into slices."
        },
        {
          "headline":"Layer the onions and roast in the slow cooker.",
          "description":"Spread the slices of onion evenly over the bottom of the slow cooker. Place the slices of deer roast on top of the onions. The pungent onion flavor helps mask the \"gamey\" taste of the venison. If possible, avoid overlapping the slices of venison roast. Keep the slices in as even and flat a layer as possible."
        },
        {
          "headline":"Dissolve the sugar in the cider vinegar.",
          "description":"In a separate medium mixing bowl, whisk together the apple cider vinegar and the brown sugar until the sugar is fully dissolved. This will form the base of your barbecue sauce."
        },
        {
          "headline":"Whisk in the remaining sauce ingredients.",
          "description":"Add the beef broth, ketchup, Worcestershire sauce, tomato paste, butter, chili powder, salt, ground mustard, garlic powder, red pepper flakes, and black pepper to the vinegar-sugar sauce base. Whisk these ingredient in, blending everything evenly. Margarine, lard, or vegetable shortening can be used instead of butter, if desired, but you must include some sort of fat if you want the naturally lean deer meat to become tender and moist as it cooks."
        },
        {
          "headline":"Cover the venison with the sauce.",
          "description":"Pour the barbecue sauce over the venison slices, covering the meat completely and evenly. If desired, you can reserve 1/2 cup (125 ml) of the sauce to serve on the side when the shredded roast is finished cooking."
        },
        {
          "headline":"Pour the cola over the meat.",
          "description":"Pour the liquid over the contents of the slow cooker, covering the roast in the process. You may need to add more cola if 1 cup (250 ml) fails to cover the roast. Make sure that the roast is just barely covered. If you don't want to use cola, you can use beer, chicken stock, beef broth, or water. Regardless of what you use, though, the meat should be covered in liquid as it cooks."
        },
        {
          "headline":"Cook on low for 9 to 10 hours.",
          "description":"Cover the slow cooker and set it on low. Cook until the meat is tender enough to pull apart with a fork. If you don't have that much time, you can opt to cook the roast on high for 6 hours, instead."
        },
        {
          "headline":"Shred the roast.",
          "description":"Remove the meat from the slow cooker and place it in a large bowl or on a large platter. Use two forks to shred the roast into pieces."
        },
        {
          "headline":"Return the meat to the slow cooker.",
          "description":"Place the shredded venison roast back in your slow cooker, cover, and let it cook for another hour on low or another 30 minutes on high. While the roast is technically safe and ready to eat without returning it to the slow cooker, allowing it to cook for additional time allows the flavor of the barbecue sauce to penetrate the meat more thoroughly."
        },
        {
          "headline":"Serve warm.",
          "description":"When done, switch the slow cooker to warm and serve the shredded venison directly from the appliance. Enjoy the shredded venison on sandwich buns, on top of mashed potatoes or noodles, or in any way you would usually serve shredded barbecue meat."
        }
      ]
    },
    {
      "name":"Method Three: Venison Roast Stew",
      "steps":[
        {
          "headline":"Cut the venison into cubes.",
          "description":"Use a sharp knife to cut the venison roast into 1-inch (2.5-cm) cubes. During this time, you should also trim any visible fat or connective tissue you see."
        },
        {
          "headline":"Coat the venison in flour.",
          "description":"Place the flour in a shallow bowl. Toss the venison cubes in the flour, rolling and turning them as needed until all sides are coated. You could also do this by placing the flour and venison in a large resealable plastic bag. Seal the bag and shake it vigorously to coat all the pieces."
        },
        {
          "headline":"Heat the oil in a skillet.",
          "description":"Pour the oil into a large skillet and heat it on medium-high for a minute or so. The oil should become visibly thinner. Do not allow it to become hot enough to smoke, though. For a richer flavor, replace the oil with butter."
        },
        {
          "headline":"Brown the venison cubes.",
          "description":"Place the coated cubes of venison roast in the skillet of hot oil. Cook, turning frequently, until lightly browned on most sides. Browning the cubes of meat before adding them to your slow cooker deepens the flavor. The oil or butter also adds fat to the otherwise lean meat, which will help the meat stay tender and moist during the cooking process."
        },
        {
          "headline":"Place the deer meat in a slow cooker.",
          "description":"Dump the contents of the skillet into your slow cooker, dispersing the venison evenly over the bottom of the appliance. Do not drain the excess oil. Pour it into the slow cooker along with the meat."
        },
        {
          "headline":"Add the vegetables.",
          "description":"Layer the cubed potatoes, diced carrots, chopped celery, and chopped onion on top of the meat. You can alter or omit the vegetables you use, but you should always include onion since the pungent onion flavor helps mask the \"gamey\" taste of venison."
        },
        {
          "headline":"Pour in the broth.",
          "description":"Pour enough broth over the contents of the slow cooker to completely cover the venison. You do not need to keep all of the vegetables submerged, but the meat itself needs to be submerged if you want it to remain moist. If you do not have beef broth, chicken broth, vegetable broth, venison stock, or water can be used, instead."
        },
        {
          "headline":"Cook on high for 6 hours.",
          "description":"Cover the slow cooker and cook it on high for 6 hours, or until the vegetables and cubes of meat are tender enough to fall apart. If you want to prolong the cooking time, switch the slow cooker on low and cook the stew for 8 to 10 hours."
        },
        {
          "headline":"Serve warm.",
          "description":"Switch the slow cooker to warm and serve the venison roast stew directly from the appliance."
        }
      ]
    }
  ],
  "text":" Method One: Traditional Venison Roast Place the roast and broth in the slow cooker. Place the venison roast in your slow cooker. Pour 2 cups (500 ml) of beef broth over it evenly. If you do not have beef broth, you could use venison stock, beef stock, chicken stock, or vegetable broth. In a pinch, you could even use water. Cover the roast with butter. Cut the butter into small chunks and distribute it evenly over the surface of the roast. If the butter has been softened, smear it over the top and sides of the meat. If the butter is still hard, however, simply distribute the chunks of butter over the surface as evenly as possible to distribute the flavor. Add the seasonings. Combine the garlic, salt, pepper, paprika, thyme, and rosemary in a small bowl. Sprinkle this blend of spices and herbs evenly over the top and sides of the roast. If you want the seasonings to penetrate the meat even further, consider using your hands to rub the seasoning blend into the meat. This works best if you are also using softened butter since you can spread both the butter and the seasonings over the surface at the same time. Add the vegetables. Spread the diced onion over the top of the roast. Layer the cubed potatoes and chopped carrots on top, as well. Even if you choose not to prepare the roast with vegetables, you should still add the onion. Many people claim that the pungent onion flavor masks the \"gamey\" taste of a deer roast. If you prefer crisp, firm vegetables, you can wait until the final 2 hours of cooking time before adding the cubed potatoes and chopped carrots. The onion should always be added at this time, however. Cook on low for 8 to 10 hours. Cover the slow cooker and switch it to low. A thawed roast should take about 8 hours, but a frozen or partially frozen roast will need a full 10 hours. Alternatively, you could switch the slow cooker on high and leave it for 6 hours. Serve warm. Once the roast has finished cooking, remove it from the slow cooker and carve it into portion-sized chunks. Serve the potatoes and carrots on the side. Method Two: Pulled Venison Roast Sandwiches Cut the roast into slices. Use a sharp knife to cut the venison roast into slices that are roughly 2 inches (5 cm) thick. Cutting the roast into slices will make it easier to keep the meat submerged under the sauce as it cooks. You should also remove any visible fat and connective tissue as you cut the roast into slices. Layer the onions and roast in the slow cooker. Spread the slices of onion evenly over the bottom of the slow cooker. Place the slices of deer roast on top of the onions. The pungent onion flavor helps mask the \"gamey\" taste of the venison. If possible, avoid overlapping the slices of venison roast. Keep the slices in as even and flat a layer as possible. Dissolve the sugar in the cider vinegar. In a separate medium mixing bowl, whisk together the apple cider vinegar and the brown sugar until the sugar is fully dissolved. This will form the base of your barbecue sauce. Whisk in the remaining sauce ingredients. Add the beef broth, ketchup, Worcestershire sauce, tomato paste, butter, chili powder, salt, ground mustard, garlic powder, red pepper flakes, and black pepper to the vinegar-sugar sauce base. Whisk these ingredient in, blending everything evenly. Margarine, lard, or vegetable shortening can be used instead of butter, if desired, but you must include some sort of fat if you want the naturally lean deer meat to become tender and moist as it cooks. Cover the venison with the sauce. Pour the barbecue sauce over the venison slices, covering the meat completely and evenly. If desired, you can reserve 1/2 cup (125 ml) of the sauce to serve on the side when the shredded roast is finished cooking. Pour the cola over the meat. Pour the liquid over the contents of the slow cooker, covering the roast in the process. You may need to add more cola if 1 cup (250 ml) fails to cover the roast. Make sure that the roast is just barely covered. If you don't want to use cola, you can use beer, chicken stock, beef broth, or water. Regardless of what you use, though, the meat should be covered in liquid as it cooks. Cook on low for 9 to 10 hours. Cover the slow cooker and set it on low. Cook until the meat is tender enough to pull apart with a fork. If you don't have that much time, you can opt to cook the roast on high for 6 hours, instead. Shred the roast. Remove the meat from the slow cooker and place it in a large bowl or on a large platter. Use two forks to shred the roast into pieces. Return the meat to the slow cooker. Place the shredded venison roast back in your slow cooker, cover, and let it cook for another hour on low or another 30 minutes on high. While the roast is technically safe and ready to eat without returning it to the slow cooker, allowing it to cook for additional time allows the flavor of the barbecue sauce to penetrate the meat more thoroughly. Serve warm. When done, switch the slow cooker to warm and serve the shredded venison directly from the appliance. Enjoy the shredded venison on sandwich buns, on top of mashed potatoes or noodles, or in any way you would usually serve shredded barbecue meat. Method Three: Venison Roast Stew Cut the venison into cubes. Use a sharp knife to cut the venison roast into 1-inch (2.5-cm) cubes. During this time, you should also trim any visible fat or connective tissue you see. Coat the venison in flour. Place the flour in a shallow bowl. Toss the venison cubes in the flour, rolling and turning them as needed until all sides are coated. You could also do this by placing the flour and venison in a large resealable plastic bag. Seal the bag and shake it vigorously to coat all the pieces. Heat the oil in a skillet. Pour the oil into a large skillet and heat it on medium-high for a minute or so. The oil should become visibly thinner. Do not allow it to become hot enough to smoke, though. For a richer flavor, replace the oil with butter. Brown the venison cubes. Place the coated cubes of venison roast in the skillet of hot oil. Cook, turning frequently, until lightly browned on most sides. Browning the cubes of meat before adding them to your slow cooker deepens the flavor. The oil or butter also adds fat to the otherwise lean meat, which will help the meat stay tender and moist during the cooking process. Place the deer meat in a slow cooker. Dump the contents of the skillet into your slow cooker, dispersing the venison evenly over the bottom of the appliance. Do not drain the excess oil. Pour it into the slow cooker along with the meat. Add the vegetables. Layer the cubed potatoes, diced carrots, chopped celery, and chopped onion on top of the meat. You can alter or omit the vegetables you use, but you should always include onion since the pungent onion flavor helps mask the \"gamey\" taste of venison. Pour in the broth. Pour enough broth over the contents of the slow cooker to completely cover the venison. You do not need to keep all of the vegetables submerged, but the meat itself needs to be submerged if you want it to remain moist. If you do not have beef broth, chicken broth, vegetable broth, venison stock, or water can be used, instead. Cook on high for 6 hours. Cover the slow cooker and cook it on high for 6 hours, or until the vegetables and cubes of meat are tender enough to fall apart. If you want to prolong the cooking time, switch the slow cooker on low and cook the stew for 8 to 10 hours. Serve warm. Switch the slow cooker to warm and serve the venison roast stew directly from the appliance.",
  "sentences":[
    " Method One: Traditional Venison Roast Place the roast and broth in the slow cooker.",
    "Place the venison roast in your slow cooker.",
    "Pour 2 cups (500 ml) of beef broth over it evenly.",
    "If you do not have beef broth, you could use venison stock, beef stock, chicken stock, or vegetable broth.",
    "In a pinch, you could even use water.",
    "Cover the roast with butter.",
    "Cut the butter into small chunks and distribute it evenly over the surface of the roast.",
    "If the butter has been softened, smear it over the top and sides of the meat.",
    "If the butter is still hard, however, simply distribute the chunks of butter over the surface as evenly as possible to distribute the flavor.",
    "Add the seasonings.",
    "Combine the garlic, salt, pepper, paprika, thyme, and rosemary in a small bowl.",
    "Sprinkle this blend of spices and herbs evenly over the top and sides of the roast.",
    "If you want the seasonings to penetrate the meat even further, consider using your hands to rub the seasoning blend into the meat.",
    "This works best if you are also using softened butter since you can spread both the butter and the seasonings over the surface at the same time.",
    "Add the vegetables.",
    "Spread the diced onion over the top of the roast.",
    "Layer the cubed potatoes and chopped carrots on top, as well.",
    "Even if you choose not to prepare the roast with vegetables, you should still add the onion.",
    "Many people claim that the pungent onion flavor masks the \"gamey\" taste of a deer roast.",
    "If you prefer crisp, firm vegetables, you can wait until the final 2 hours of cooking time before adding the cubed potatoes and chopped carrots.",
    "The onion should always be added at this time, however.",
    "Cook on low for 8 to 10 hours.",
    "Cover the slow cooker and switch it to low.",
    "A thawed roast should take about 8 hours, but a frozen or partially frozen roast will need a full 10 hours.",
    "Alternatively, you could switch the slow cooker on high and leave it for 6 hours.",
    "Serve warm.",
    "Once the roast has finished cooking, remove it from the slow cooker and carve it into portion-sized chunks.",
    "Serve the potatoes and carrots on the side.",
    "Method Two: Pulled Venison Roast Sandwiches Cut the roast into slices.",
    "Use a sharp knife to cut the venison roast into slices that are roughly 2 inches (5 cm) thick.",
    "Cutting the roast into slices will make it easier to keep the meat submerged under the sauce as it cooks.",
    "You should also remove any visible fat and connective tissue as you cut the roast into slices.",
    "Layer the onions and roast in the slow cooker.",
    "Spread the slices of onion evenly over the bottom of the slow cooker.",
    "Place the slices of deer roast on top of the onions.",
    "The pungent onion flavor helps mask the \"gamey\" taste of the venison.",
    "If possible, avoid overlapping the slices of venison roast.",
    "Keep the slices in as even and flat a layer as possible.",
    "Dissolve the sugar in the cider vinegar.",
    "In a separate medium mixing bowl, whisk together the apple cider vinegar and the brown sugar until the sugar is fully dissolved.",
    "This will form the base of your barbecue sauce.",
    "Whisk in the remaining sauce ingredients.",
    "Add the beef broth, ketchup, Worcestershire sauce, tomato paste, butter, chili powder, salt, ground mustard, garlic powder, red pepper flakes, and black pepper to the vinegar-sugar sauce base.",
    "Whisk these ingredient in, blending everything evenly.",
    "Margarine, lard, or vegetable shortening can be used instead of butter, if desired, but you must include some sort of fat if you want the naturally lean deer meat to become tender and moist as it cooks.",
    "Cover the venison with the sauce.",
    "Pour the barbecue sauce over the venison slices, covering the meat completely and evenly.",
    "If desired, you can reserve 1/2 cup (125 ml) of the sauce to serve on the side when the shredded roast is finished cooking.",
    "Pour the cola over the meat.",
    "Pour the liquid over the contents of the slow cooker, covering the roast in the process.",
    "You may need to add more cola if 1 cup (250 ml) fails to cover the roast.",
    "Make sure that the roast is just barely covered.",
    "If you don't want to use cola, you can use beer, chicken stock, beef broth, or water.",
    "Regardless of what you use, though, the meat should be covered in liquid as it cooks.",
    "Cook on low for 9 to 10 hours.",
    "Cover the slow cooker and set it on low.",
    "Cook until the meat is tender enough to pull apart with a fork.",
    "If you don't have that much time, you can opt to cook the roast on high for 6 hours, instead.",
    "Shred the roast.",
    "Remove the meat from the slow cooker and place it in a large bowl or on a large platter.",
    "Use two forks to shred the roast into pieces.",
    "Return the meat to the slow cooker.",
    "Place the shredded venison roast back in your slow cooker, cover, and let it cook for another hour on low or another 30 minutes on high.",
    "While the roast is technically safe and ready to eat without returning it to the slow cooker, allowing it to cook for additional time allows the flavor of the barbecue sauce to penetrate the meat more thoroughly.",
    "Serve warm.",
    "When done, switch the slow cooker to warm and serve the shredded venison directly from the appliance.",
    "Enjoy the shredded venison on sandwich buns, on top of mashed potatoes or noodles, or in any way you would usually serve shredded barbecue meat.",
    "Method Three: Venison Roast Stew Cut the venison into cubes.",
    "Use a sharp knife to cut the venison roast into 1-inch (2.5-cm) cubes.",
    "During this time, you should also trim any visible fat or connective tissue you see.",
    "Coat the venison in flour.",
    "Place the flour in a shallow bowl.",
    "Toss the venison cubes in the flour, rolling and turning them as needed until all sides are coated.",
    "You could also do this by placing the flour and venison in a large resealable plastic bag.",
    "Seal the bag and shake it vigorously to coat all the pieces.",
    "Heat the oil in a skillet.",
    "Pour the oil into a large skillet and heat it on medium-high for a minute or so.",
    "The oil should become visibly thinner.",
    "Do not allow it to become hot enough to smoke, though.",
    "For a richer flavor, replace the oil with butter.",
    "Brown the venison cubes.",
    "Place the coated cubes of venison roast in the skillet of hot oil.",
    "Cook, turning frequently, until lightly browned on most sides.",
    "Browning the cubes of meat before adding them to your slow cooker deepens the flavor.",
    "The oil or butter also adds fat to the otherwise lean meat, which will help the meat stay tender and moist during the cooking process.",
    "Place the deer meat in a slow cooker.",
    "Dump the contents of the skillet into your slow cooker, dispersing the venison evenly over the bottom of the appliance.",
    "Do not drain the excess oil.",
    "Pour it into the slow cooker along with the meat.",
    "Add the vegetables.",
    "Layer the cubed potatoes, diced carrots, chopped celery, and chopped onion on top of the meat.",
    "You can alter or omit the vegetables you use, but you should always include onion since the pungent onion flavor helps mask the \"gamey\" taste of venison.",
    "Pour in the broth.",
    "Pour enough broth over the contents of the slow cooker to completely cover the venison.",
    "You do not need to keep all of the vegetables submerged, but the meat itself needs to be submerged if you want it to remain moist.",
    "If you do not have beef broth, chicken broth, vegetable broth, venison stock, or water can be used, instead.",
    "Cook on high for 6 hours.",
    "Cover the slow cooker and cook it on high for 6 hours, or until the vegetables and cubes of meat are tender enough to fall apart.",
    "If you want to prolong the cooking time, switch the slow cooker on low and cook the stew for 8 to 10 hours.",
    "Serve warm.",
    "Switch the slow cooker to warm and serve the venison roast stew directly from the appliance."
  ],
  "tyn_section":[
    "Slow cooker",
    "Nonstick cooking spray or slow cooker liners",
    "Sharp kitchen knife",
    "Medium mixing bowl",
    "Whisk",
    "Forks",
    "Large skillet"
  ],
  "tyn_model":[
    "slow cooker",
    "butter",
    "onion",
    "oil",
    "beef broth",
    "vegetables",
    "potatoes",
    "carrots",
    "flour",
    "water",
    "seasonings",
    "barbecue sauce",
    "cola",
    "skillet",
    "venison roast",
    "venison stock",
    "chicken stock",
    "vegetable broth",
    "salt",
    "onions",
    "sugar",
    "broth",
    "beef stock",
    "garlic",
    "pepper",
    "paprika",
    "thyme",
    "rosemary",
    "small bowl",
    "spices",
    "herbs",
    "knife",
    "cider vinegar",
    "medium mixing bowl",
    "apple cider vinegar",
    "brown sugar",
    "ketchup",
    "worcestershire sauce",
    "tomato paste",
    "chili powder",
    "ground mustard",
    "garlic powder",
    "red pepper flakes",
    "black pepper",
    "vinegar",
    "margarine",
    "lard",
    "vegetable shortening",
    "venison",
    "beer",
    "fork",
    "forks",
    "barbecue meat",
    "bowl",
    "resealable plastic bag",
    "large skillet",
    "hot oil",
    "celery",
    "chicken broth",
    "venison roast stew"
  ],
  "simple_metrics":{
    "r":0.5714285714,
    "p":0.0666666667,
    "f1":0.1194029851,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.0833333333,
    "f1":0.1454545455
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.1166666667,
    "f1":0.2005730659
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.0666666667,
    "f1":0.1194029851
  }
}