{
  "title":"How to Make Flowers Out of Baby Socks",
  "url":"https://www.wikihow.com/Make-Flowers-Out-of-Baby-Socks",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Leaf and Flower Crafts"
  ],
  "parts":[
    {
      "name":"Making the flower",
      "steps":[
        {
          "headline":"Choose the baby sock or socks to make a flower or a bunch of flowers from.",
          "description":"If using used socks, clean them first. If making a bouquet of baby socks for a gift, choose colors that look good together."
        },
        {
          "headline":"Lay the sock on a flat, clean work surface.",
          "description":""
        },
        {
          "headline":"Take the toe end of the sock and fold it over slightly.",
          "description":"Then start to roll the sock up one roll. Don't make it too tight or too loose. The toe end should stick out over the edge of the sock as you roll."
        },
        {
          "headline":"Roll two more times.",
          "description":"Three rolls should be enough to form the flower shape from a small baby sock, but judge it from the size of the sock you're working with. There should be a small amount of sock fabric between the last roll and the opening of the sock. Again, don't roll either too tightly or too loosely."
        },
        {
          "headline":"Pinch the rolled area of the sock together with your fingers.",
          "description":"Now open up the sock, and as you do so, curl it around the rolled portion of the baby sock. The sock opening should swallow up the rolled portion until about halfway, with the top half of the rolls peaking out, resembling flower petals emerging from the bud."
        },
        {
          "headline":"Gently pull the rolled portion up a little.",
          "description":"This will give the flower more height. Proportion it properly by making adjustments."
        },
        {
          "headline":"Push a length of floral wire or a straw high into the base of the flower sock.",
          "description":"Capture the end of the rolled portion. Wrap around several times to keep it in place. It is important to push the wire high and wrap around a good base portion of the rolled part of the flower; otherwise, the rolls will fall out of shape. Be careful not to catch the sock fabric as you wind the wire in place."
        },
        {
          "headline":"Finish off by winding florist's tape around the outside base of the flower sock.",
          "description":"Wrap from the sock base downward, covering all of the wire stem length you have chosen. (Alternatively, use a green pipe cleaner for the stem portion and attach with the florist's wire; that way, you only have to take the florist's tape over the wire and joined onto the pipe cleaner.)"
        },
        {
          "headline":"Make more baby sock flowers if you like.",
          "description":"You will probably find that this has taken you a while to perfect. Practice on a few more before deciding whether you want to put in the effort to make a whole bunch. If you do, proceed to the next stage."
        }
      ]
    },
    {
      "name":"Turning the baby sock flower into a bouquet",
      "steps":[
        {
          "headline":"Make sufficient baby sock flowers to form a bunch or bouquet.",
          "description":"For a decent bundle, a dozen is probably a good amount to make; that is six pairs of socks, plenty for a decent gift for the baby shower."
        },
        {
          "headline":"Decide how you will display them.",
          "description":"This might be in a vase, stuck in a foam square, sitting on top of a bundle of wrapped diapers, etc. If you select a pretty vase, this can be a keepsake for the parents, while a more simple option, such as a gift box, could be covered beautifully and serve as a storage box for the socks when in use. You could even print \"socks\" on the side of the box."
        },
        {
          "headline":"Place the baby sock flowers into the chosen vessel.",
          "description":"Arrange neatly to appear like a bunch of flowers. You may need to use wire, ribbon, etc to hold them in place, or you could even use florist's foam and slide them into that to stand in place firmly. Colored glass balls or marbles can be used to hold the stems inside a container such as a vase; match them to the sock flower colors. Add real greenery as well, if wished. Baby's breath, fern leaves, pussy willows, etc., look wonderful interspersed with the baby sock flowers. An alternative option to placing in a container is to wrap the stems in a receiving/baby blanket to look like the paper florist's use to wrap around flowers. Be sure to add a bow to finish the look and hold the folded blanket in place."
        },
        {
          "headline":"Add a gift card to the bouquet.",
          "description":"Finish with a bow or similar embellishment."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the flower Choose the baby sock or socks to make a flower or a bunch of flowers from. If using used socks, clean them first. If making a bouquet of baby socks for a gift, choose colors that look good together. Lay the sock on a flat, clean work surface.  Take the toe end of the sock and fold it over slightly. Then start to roll the sock up one roll. Don't make it too tight or too loose. The toe end should stick out over the edge of the sock as you roll. Roll two more times. Three rolls should be enough to form the flower shape from a small baby sock, but judge it from the size of the sock you're working with. There should be a small amount of sock fabric between the last roll and the opening of the sock. Again, don't roll either too tightly or too loosely. Pinch the rolled area of the sock together with your fingers. Now open up the sock, and as you do so, curl it around the rolled portion of the baby sock. The sock opening should swallow up the rolled portion until about halfway, with the top half of the rolls peaking out, resembling flower petals emerging from the bud. Gently pull the rolled portion up a little. This will give the flower more height. Proportion it properly by making adjustments. Push a length of floral wire or a straw high into the base of the flower sock. Capture the end of the rolled portion. Wrap around several times to keep it in place. It is important to push the wire high and wrap around a good base portion of the rolled part of the flower; otherwise, the rolls will fall out of shape. Be careful not to catch the sock fabric as you wind the wire in place. Finish off by winding florist's tape around the outside base of the flower sock. Wrap from the sock base downward, covering all of the wire stem length you have chosen. (Alternatively, use a green pipe cleaner for the stem portion and attach with the florist's wire; that way, you only have to take the florist's tape over the wire and joined onto the pipe cleaner.) Make more baby sock flowers if you like. You will probably find that this has taken you a while to perfect. Practice on a few more before deciding whether you want to put in the effort to make a whole bunch. If you do, proceed to the next stage. Turning the baby sock flower into a bouquet Make sufficient baby sock flowers to form a bunch or bouquet. For a decent bundle, a dozen is probably a good amount to make; that is six pairs of socks, plenty for a decent gift for the baby shower. Decide how you will display them. This might be in a vase, stuck in a foam square, sitting on top of a bundle of wrapped diapers, etc. If you select a pretty vase, this can be a keepsake for the parents, while a more simple option, such as a gift box, could be covered beautifully and serve as a storage box for the socks when in use. You could even print \"socks\" on the side of the box. Place the baby sock flowers into the chosen vessel. Arrange neatly to appear like a bunch of flowers. You may need to use wire, ribbon, etc to hold them in place, or you could even use florist's foam and slide them into that to stand in place firmly. Colored glass balls or marbles can be used to hold the stems inside a container such as a vase; match them to the sock flower colors. Add real greenery as well, if wished. Baby's breath, fern leaves, pussy willows, etc., look wonderful interspersed with the baby sock flowers. An alternative option to placing in a container is to wrap the stems in a receiving/baby blanket to look like the paper florist's use to wrap around flowers. Be sure to add a bow to finish the look and hold the folded blanket in place. Add a gift card to the bouquet. Finish with a bow or similar embellishment. Finished. ",
  "sentences":[
    " Making the flower Choose the baby sock or socks to make a flower or a bunch of flowers from.",
    "If using used socks, clean them first.",
    "If making a bouquet of baby socks for a gift, choose colors that look good together.",
    "Lay the sock on a flat, clean work surface.",
    "Take the toe end of the sock and fold it over slightly.",
    "Then start to roll the sock up one roll.",
    "Don't make it too tight or too loose.",
    "The toe end should stick out over the edge of the sock as you roll.",
    "Roll two more times.",
    "Three rolls should be enough to form the flower shape from a small baby sock, but judge it from the size of the sock you're working with.",
    "There should be a small amount of sock fabric between the last roll and the opening of the sock.",
    "Again, don't roll either too tightly or too loosely.",
    "Pinch the rolled area of the sock together with your fingers.",
    "Now open up the sock, and as you do so, curl it around the rolled portion of the baby sock.",
    "The sock opening should swallow up the rolled portion until about halfway, with the top half of the rolls peaking out, resembling flower petals emerging from the bud.",
    "Gently pull the rolled portion up a little.",
    "This will give the flower more height.",
    "Proportion it properly by making adjustments.",
    "Push a length of floral wire or a straw high into the base of the flower sock.",
    "Capture the end of the rolled portion.",
    "Wrap around several times to keep it in place.",
    "It is important to push the wire high and wrap around a good base portion of the rolled part of the flower; otherwise, the rolls will fall out of shape.",
    "Be careful not to catch the sock fabric as you wind the wire in place.",
    "Finish off by winding florist's tape around the outside base of the flower sock.",
    "Wrap from the sock base downward, covering all of the wire stem length you have chosen.",
    "(Alternatively, use a green pipe cleaner for the stem portion and attach with the florist's wire; that way, you only have to take the florist's tape over the wire and joined onto the pipe cleaner.)",
    "Make more baby sock flowers if you like.",
    "You will probably find that this has taken you a while to perfect.",
    "Practice on a few more before deciding whether you want to put in the effort to make a whole bunch.",
    "If you do, proceed to the next stage.",
    "Turning the baby sock flower into a bouquet Make sufficient baby sock flowers to form a bunch or bouquet.",
    "For a decent bundle, a dozen is probably a good amount to make; that is six pairs of socks, plenty for a decent gift for the baby shower.",
    "Decide how you will display them.",
    "This might be in a vase, stuck in a foam square, sitting on top of a bundle of wrapped diapers, etc.",
    "If you select a pretty vase, this can be a keepsake for the parents, while a more simple option, such as a gift box, could be covered beautifully and serve as a storage box for the socks when in use.",
    "You could even print \"socks\" on the side of the box.",
    "Place the baby sock flowers into the chosen vessel.",
    "Arrange neatly to appear like a bunch of flowers.",
    "You may need to use wire, ribbon, etc to hold them in place, or you could even use florist's foam and slide them into that to stand in place firmly.",
    "Colored glass balls or marbles can be used to hold the stems inside a container such as a vase; match them to the sock flower colors.",
    "Add real greenery as well, if wished.",
    "Baby's breath, fern leaves, pussy willows, etc., look wonderful interspersed with the baby sock flowers.",
    "An alternative option to placing in a container is to wrap the stems in a receiving/baby blanket to look like the paper florist's use to wrap around flowers.",
    "Be sure to add a bow to finish the look and hold the folded blanket in place.",
    "Add a gift card to the bouquet.",
    "Finish with a bow or similar embellishment.",
    "Finished."
  ],
  "tyn_section":[
    "Baby socks",
    "Florist's or floral wire (you may prefer to use a green pipe cleaner (chenille stick) for the actual stem, and just use the wire around the sock)",
    "Florist's tape"
  ],
  "tyn_model":[
    "sock",
    "wire",
    "vase",
    "pipe cleaner",
    "baby sock flowers",
    "flowers",
    "sock fabric",
    "floral wire",
    "straw",
    "florist's tape",
    "florist's wire",
    "florist's",
    "ribbon",
    "florist's foam",
    "fern leaves",
    "pussy willows",
    "container",
    "blanket"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0555555556,
    "f1":0.0952380952,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1111111111,
    "f1":0.1666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.2222222222,
    "f1":0.2666666667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0555555556,
    "f1":0.0952380952
  }
}