{
  "title":"How to Clean Your Oven Without Odor",
  "url":"https://www.wikihow.com/Clean-Your-Oven-Without-Odor",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Using Vinegar and Baking Soda",
      "steps":[
        {
          "headline":"Fill a baking pan with water and vinegar.",
          "description":"Pre-heat your oven to 350 degrees F (176.6 degrees C). Fill a baking pan about halfway with warm water. Add 1 cup (240 ml) of white vinegar to the baking dish."
        },
        {
          "headline":"Bake the mixture for 1 hour.",
          "description":"Place the dish (filled with water and vinegar) on the middle oven rack in your pre-heated oven. Leave this to bake for 1 hour. You may want to set a timer for yourself."
        },
        {
          "headline":"Wait 1 hour for your oven to cool.",
          "description":"After the vinegar and water has finished baking, turn off your oven. Leave the door closed, and leave the baking dish inside. Wait 45-60 minutes, until your oven feels cool to the touch. Remove the baking dish and your oven racks."
        },
        {
          "headline":"Apply vinegar and baking soda to the inside of your oven.",
          "description":"Place some white vinegar in a spray bottle and spray down the inside of your oven. Then, sprinkle baking soda on the sides and bottom of your oven. Wait five minutes while the mixture foams."
        },
        {
          "headline":"Scrub the oven.",
          "description":"Use a damp sponge to scrub the inside of your oven. The grime and food residue should come off easily. If you encounter any chunks, use a plastic spatula to pry these off. EXPERT TIP\t\"Pumice sticks are very effective for scrubbing your oven without scratching it.\" Ashley Matuska\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley MatuskaCleaning Guru"
        },
        {
          "headline":"Rinse off the vinegar and baking soda.",
          "description":"Rinse off your sponge with clean water, and fill a dish with clean water. Use the water and your sponge to remove the vinegar and baking soda from the inside of your oven. When you are finished, return the oven racks."
        }
      ]
    },
    {
      "name":"Leaving Ammonia in Your Oven Overnight",
      "steps":[
        {
          "headline":"Heat your oven to 150 degrees F (65.5 C).",
          "description":"Ammonia is a powerful natural cleanser that can help to loosen and remove grease from your oven. Start by heating your oven to 150 degrees F (65.5 C). Then turn off the heat."
        },
        {
          "headline":"Place hot water (in one dish) and ammonia (in another) in your oven.",
          "description":"Heat some water on your stove to boiling. Then place this water in a baking dish and set it on the bottom rack of your oven. Add 1 cup (240 ml) of ammonia to a baking dish (or oven-safe bowl) and place this on the top rack."
        },
        {
          "headline":"Leave the baking dishes in your oven overnight.",
          "description":"Close the oven door and allow the ammonia and water to work on your oven overnight (or for at least 8 hours). While you sleep, the grease and grime is being loosened."
        },
        {
          "headline":"Let the oven air out for 15 minutes.",
          "description":"In the morning, remove the baking dishes (reserving the ammonia) and the oven racks from your oven. Leave the oven door open for 15 minutes so that the oven can air out."
        },
        {
          "headline":"Scrub the oven with ammonia and dish soap.",
          "description":"Add 1-2 teaspoons (4.9-9.8 ml) of dish soap and 1 cup (240 ml) of ammonia, that you have reserved, to 1 quart (0.94 liters) of hot water. Using this liquid, scrub your oven with a sponge and/or scouring pad. The grease and grime should come off easily."
        },
        {
          "headline":"Rinse off the solution.",
          "description":"Fill a container with warm water and rinse off your sponge. Using your sponge and the clean water, wipe down the inside of your oven to remove any traces of ammonia and dish soap. When you are finished, return the oven racks."
        }
      ]
    },
    {
      "name":"Cleansing With Lemons",
      "steps":[
        {
          "headline":"Create a citrus solution.",
          "description":"Cut 2 large lemons in half. Squeeze the juice from both lemons into a baking dish, and place the lemon halves in the dish as well. Fill this dish one third of the way with warm water. Meanwhile, pre-heat your oven to 250 degrees F (121 C)."
        },
        {
          "headline":"Bake the citrus solution for 30-60 minutes.",
          "description":"Place the baking dish of citrus solution on the middle rack of your oven, and bake for 30-60 minutes, depending on how much build-up you have."
        },
        {
          "headline":"Allow the oven to cool.",
          "description":"Once the citrus solution has had a chance to bake, carefully remove the dish (retaining the solution), and turn off the oven. Allow the oven to cool for another 30-45 minutes, and remove your oven racks."
        },
        {
          "headline":"Scrub the oven with the citrus solution.",
          "description":"Using your reserved citrus solution, along with a sponge and/or scouring pad, scrub the inside of your oven. Grease and grime should come off easily. There is no need to rinse this solution. When you are finished, return the oven racks."
        }
      ]
    }
  ],
  "text":" Using Vinegar and Baking Soda Fill a baking pan with water and vinegar. Pre-heat your oven to 350 degrees F (176.6 degrees C). Fill a baking pan about halfway with warm water. Add 1 cup (240 ml) of white vinegar to the baking dish. Bake the mixture for 1 hour. Place the dish (filled with water and vinegar) on the middle oven rack in your pre-heated oven. Leave this to bake for 1 hour. You may want to set a timer for yourself. Wait 1 hour for your oven to cool. After the vinegar and water has finished baking, turn off your oven. Leave the door closed, and leave the baking dish inside. Wait 45-60 minutes, until your oven feels cool to the touch. Remove the baking dish and your oven racks. Apply vinegar and baking soda to the inside of your oven. Place some white vinegar in a spray bottle and spray down the inside of your oven. Then, sprinkle baking soda on the sides and bottom of your oven. Wait five minutes while the mixture foams. Scrub the oven. Use a damp sponge to scrub the inside of your oven. The grime and food residue should come off easily. If you encounter any chunks, use a plastic spatula to pry these off. EXPERT TIP\t\"Pumice sticks are very effective for scrubbing your oven without scratching it.\" Ashley Matuska\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley MatuskaCleaning Guru Rinse off the vinegar and baking soda. Rinse off your sponge with clean water, and fill a dish with clean water. Use the water and your sponge to remove the vinegar and baking soda from the inside of your oven. When you are finished, return the oven racks. Leaving Ammonia in Your Oven Overnight Heat your oven to 150 degrees F (65.5 C). Ammonia is a powerful natural cleanser that can help to loosen and remove grease from your oven. Start by heating your oven to 150 degrees F (65.5 C). Then turn off the heat. Place hot water (in one dish) and ammonia (in another) in your oven. Heat some water on your stove to boiling. Then place this water in a baking dish and set it on the bottom rack of your oven. Add 1 cup (240 ml) of ammonia to a baking dish (or oven-safe bowl) and place this on the top rack. Leave the baking dishes in your oven overnight. Close the oven door and allow the ammonia and water to work on your oven overnight (or for at least 8 hours). While you sleep, the grease and grime is being loosened. Let the oven air out for 15 minutes. In the morning, remove the baking dishes (reserving the ammonia) and the oven racks from your oven. Leave the oven door open for 15 minutes so that the oven can air out. Scrub the oven with ammonia and dish soap. Add 1-2 teaspoons (4.9-9.8 ml) of dish soap and 1 cup (240 ml) of ammonia, that you have reserved, to 1 quart (0.94 liters) of hot water. Using this liquid, scrub your oven with a sponge and/or scouring pad. The grease and grime should come off easily. Rinse off the solution. Fill a container with warm water and rinse off your sponge. Using your sponge and the clean water, wipe down the inside of your oven to remove any traces of ammonia and dish soap. When you are finished, return the oven racks. Cleansing With Lemons Create a citrus solution. Cut 2 large lemons in half. Squeeze the juice from both lemons into a baking dish, and place the lemon halves in the dish as well. Fill this dish one third of the way with warm water. Meanwhile, pre-heat your oven to 250 degrees F (121 C). Bake the citrus solution for 30-60 minutes. Place the baking dish of citrus solution on the middle rack of your oven, and bake for 30-60 minutes, depending on how much build-up you have. Allow the oven to cool. Once the citrus solution has had a chance to bake, carefully remove the dish (retaining the solution), and turn off the oven. Allow the oven to cool for another 30-45 minutes, and remove your oven racks. Scrub the oven with the citrus solution. Using your reserved citrus solution, along with a sponge and/or scouring pad, scrub the inside of your oven. Grease and grime should come off easily. There is no need to rinse this solution. When you are finished, return the oven racks.",
  "sentences":[
    " Using Vinegar and Baking Soda Fill a baking pan with water and vinegar.",
    "Pre-heat your oven to 350 degrees F (176.6 degrees C).",
    "Fill a baking pan about halfway with warm water.",
    "Add 1 cup (240 ml) of white vinegar to the baking dish.",
    "Bake the mixture for 1 hour.",
    "Place the dish (filled with water and vinegar) on the middle oven rack in your pre-heated oven.",
    "Leave this to bake for 1 hour.",
    "You may want to set a timer for yourself.",
    "Wait 1 hour for your oven to cool.",
    "After the vinegar and water has finished baking, turn off your oven.",
    "Leave the door closed, and leave the baking dish inside.",
    "Wait 45-60 minutes, until your oven feels cool to the touch.",
    "Remove the baking dish and your oven racks.",
    "Apply vinegar and baking soda to the inside of your oven.",
    "Place some white vinegar in a spray bottle and spray down the inside of your oven.",
    "Then, sprinkle baking soda on the sides and bottom of your oven.",
    "Wait five minutes while the mixture foams.",
    "Scrub the oven.",
    "Use a damp sponge to scrub the inside of your oven.",
    "The grime and food residue should come off easily.",
    "If you encounter any chunks, use a plastic spatula to pry these off.",
    "EXPERT TIP\t\"Pumice sticks are very effective for scrubbing your oven without scratching it.\"",
    "Ashley Matuska\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado.",
    "She has worked in the cleaning industry for over 5 years.",
    "Ashley MatuskaCleaning Guru Rinse off the vinegar and baking soda.",
    "Rinse off your sponge with clean water, and fill a dish with clean water.",
    "Use the water and your sponge to remove the vinegar and baking soda from the inside of your oven.",
    "When you are finished, return the oven racks.",
    "Leaving Ammonia in Your Oven Overnight Heat your oven to 150 degrees F (65.5 C).",
    "Ammonia is a powerful natural cleanser that can help to loosen and remove grease from your oven.",
    "Start by heating your oven to 150 degrees F (65.5 C).",
    "Then turn off the heat.",
    "Place hot water (in one dish) and ammonia (in another) in your oven.",
    "Heat some water on your stove to boiling.",
    "Then place this water in a baking dish and set it on the bottom rack of your oven.",
    "Add 1 cup (240 ml) of ammonia to a baking dish (or oven-safe bowl) and place this on the top rack.",
    "Leave the baking dishes in your oven overnight.",
    "Close the oven door and allow the ammonia and water to work on your oven overnight (or for at least 8 hours).",
    "While you sleep, the grease and grime is being loosened.",
    "Let the oven air out for 15 minutes.",
    "In the morning, remove the baking dishes (reserving the ammonia) and the oven racks from your oven.",
    "Leave the oven door open for 15 minutes so that the oven can air out.",
    "Scrub the oven with ammonia and dish soap.",
    "Add 1-2 teaspoons (4.9-9.8 ml) of dish soap and 1 cup (240 ml) of ammonia, that you have reserved, to 1 quart (0.94 liters) of hot water.",
    "Using this liquid, scrub your oven with a sponge and/or scouring pad.",
    "The grease and grime should come off easily.",
    "Rinse off the solution.",
    "Fill a container with warm water and rinse off your sponge.",
    "Using your sponge and the clean water, wipe down the inside of your oven to remove any traces of ammonia and dish soap.",
    "When you are finished, return the oven racks.",
    "Cleansing With Lemons Create a citrus solution.",
    "Cut 2 large lemons in half.",
    "Squeeze the juice from both lemons into a baking dish, and place the lemon halves in the dish as well.",
    "Fill this dish one third of the way with warm water.",
    "Meanwhile, pre-heat your oven to 250 degrees F (121 C).",
    "Bake the citrus solution for 30-60 minutes.",
    "Place the baking dish of citrus solution on the middle rack of your oven, and bake for 30-60 minutes, depending on how much build-up you have.",
    "Allow the oven to cool.",
    "Once the citrus solution has had a chance to bake, carefully remove the dish (retaining the solution), and turn off the oven.",
    "Allow the oven to cool for another 30-45 minutes, and remove your oven racks.",
    "Scrub the oven with the citrus solution.",
    "Using your reserved citrus solution, along with a sponge and/or scouring pad, scrub the inside of your oven.",
    "Grease and grime should come off easily.",
    "There is no need to rinse this solution.",
    "When you are finished, return the oven racks."
  ],
  "tyn_section":[
    "Ammonia",
    "Vinegar (and spray bottle)",
    "Baking soda",
    "Two large lemons",
    "Paper towels",
    "A baking pan",
    "Sponge",
    "Scouring pad"
  ],
  "tyn_model":[
    "oven",
    "water",
    "vinegar",
    "baking dish",
    "sponge",
    "ammonia",
    "oven racks",
    "baking soda",
    "dish soap",
    "baking pan",
    "white vinegar",
    "baking dishes",
    "scouring pad",
    "oven rack",
    "spray bottle",
    "plastic spatula",
    "pumice sticks",
    "dashing maids",
    "oven-safe bowl",
    "hot water",
    "lemons",
    "lemon",
    "citrus solution"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1739130435,
    "f1":0.2580645161,
    "avg_pos":0.2173913043
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.2173913043,
    "f1":0.3225806452
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.347826087,
    "f1":0.4752475248
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.2173913043,
    "f1":0.3225806452
  }
}