{
  "title":"How to Make a Traditional Full English Breakfast",
  "url":"https://www.wikihow.com/Make-a-Traditional-Full-English-Breakfast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast"
  ],
  "methods":[
    {
      "name":"Assembling the Classic Fry-Up",
      "steps":[
        {
          "headline":"Cook the sausages for 15 minutes, or until they’re cooked through.",
          "description":"Heat 1 teaspoon (4.9 mL) of oil in a large pan over low heat. Once the oil is hot, add 2 sausages to the pan. After 10 minutes, turn the heat up to medium and cook the sausages for an additional 5 minutes. Once they’re done, either push them to the side of the pan to keep them warm, or transfer them to a hot plate. If you use really thin sausages, they may not take as long to cook. You can check the doneness by cutting the sausage in half. If there is still red, raw meat inside, it needs several more minutes on the stove."
        },
        {
          "headline":"Fry the bacon in the same pan as the sausage.",
          "description":"Add 2 to 3 slices of bacon to the already-hot pan. Cook them for 2 minutes on each side, or until they are as crispy as you prefer. When they’re done, either set them to the side of the pan with the sausage, or put them on the hot plate. A longer cook time will produce crispier bacon. Back bacon is recommended for a truly authentic fry-up, but you can use whatever kind you like best—even turkey bacon, if you’re trying to be a little more heart healthy."
        },
        {
          "headline":"Heat up 1/4 cup (40 grams) of baked beans on the stovetop.",
          "description":"Add your beans to the pan and cook them for 2 to 3 minutes, or until they’re hot all the way through. Use canned beans to save time, or make your own baked beans from scratch ahead of time. Once the beans are hot, move them to the side of the pan or to a hot plate. Beans are a very common (and, often said, essential) part of a classic full English breakfast. You can add the beans to toast, eat them alongside the meats, or enjoy them on their own. Though if you don’t like beans, you don’t have to include them."
        },
        {
          "headline":"Grill up your tomato slices or whole tomatoes.",
          "description":"If you’re using small, whole tomatoes, cut them in half lengthwise. If you’re using a large tomato, slice off 2 to 3 ⁄4 inch (0.64 cm) slices. Sprinkle the tomatoes with salt and pepper, and place them onto the hot pan. Cook them for about 2 minutes per side. Push the tomatoes to the side or add them to a hot plate when they’re done. The acidity from the tomatoes is a really important part of the flavor profile of an English breakfast. It cuts through the richness and fattiness of the rest of the dish."
        },
        {
          "headline":"Fry up a thick slice of bread in butter or leftover bacon fat.",
          "description":"Skip the toaster and instead add a piece of bread to the pan in which you’ve cooked the meats, beans, and tomatoes and fry the bread. If the pan is a bit dry, add ⁄2 tablespoon (7.4 mL) of soft butter to the pan and let it melt. Fry the bread on each side for 2 to 3 minutes, or until the bread is brown and toasty. Set the finished toast off to the side when it’s done. The fried bread will be pretty rich from the fat and grease, so you’ll probably just want one slice, though you can make more if you so desire."
        },
        {
          "headline":"Make two fried eggs to add to your plate.",
          "description":"Check that the heat on the pan is set to medium-high. If the pan is dry, add ⁄2 tablespoon (7.4 mL) of butter to it. Crack the eggs directly into the pan, and cook them for 30 to 60 seconds. Spoon melted butter and grease overtop of the eggs as they cook to baste them and infuse them with more flavor. Turn off the heat once the whites of the eggs are cooked through, but before the yolks have hardened. If you don’t like fried eggs, try making scrambled eggs instead."
        },
        {
          "headline":"Assemble your meal on a plate, and serve it alongside hot coffee or tea.",
          "description":"Grab a plate, and add the sausage, bacon, beans, tomatoes, toast, and eggs to it. Sit down and enjoy your breakfast—you worked hard for it! Feel free to use ketchup, hot sauce, or any other condiments you enjoy."
        }
      ]
    },
    {
      "name":"Exploring English Breakfast Alternatives",
      "steps":[
        {
          "headline":"Fry up some black pudding to add to your plate.",
          "description":"Slice off 1 to 2 ⁄2 inch (1.3 cm) pieces of the pudding. Fry the slices in a hot pan for 2 minutes on each side, or until the exterior is crispy. Black pudding is made of oatmeal, pork fat, and blood. You can also get white pudding, which is just made of oatmeal and pork fat. Both puddings have a grainy texture, and the black pudding usually tastes a bit coppery."
        },
        {
          "headline":"Add a fried kidney for a tender, protein filled option.",
          "description":"Trim away the fat and membrane from the kidney and cut it in half lengthwise. Add the kidney sections to your hot pan, and cook them for 1 to 2 minutes on each side. They’re done when the outsides are slightly browned and the insides are still pink. If you want to check the internal temperature of the kidney, it should be in the 150 to 160 °F (66 to 71 °C) range once it has finished cooking."
        },
        {
          "headline":"Poach 2 to 3 kippers in your pan if you like fish.",
          "description":"Add enough butter or oil to the hot pan so that there is a thin layer of the liquid. Put 2 to 3 kippers into the pan, and poach the fish for 5 minutes. Spoon the cooked kippers out of the liquid, flake them over your eggs, or serve them whole on the side of your plate. You’ll find canned kippers at your local grocery store, though you can sometimes buy them fresh or frozen, too."
        },
        {
          "headline":"Add a handful of mushrooms to add a savory element to your plate.",
          "description":"Button or portobello mushrooms are the most popular additions to the fry-up, but you could also use chanterelle or shiitake mushrooms. Take 4 to 5 mushrooms, rinse away any dirt, and add them to a hot pan. Cook them for 1 to 2 minutes, then flip them over and cook them for another 3 to 4 minutes. Don’t flip or stir the mushrooms often, as this will make them release more moisture and could make them soggy."
        },
        {
          "headline":"Prepare a side of potatoes to add a starchy element to your breakfast.",
          "description":"Hash browns, oven fries, mashed potatoes, shredded potatoes—you can add whatever style of potato you like best to your breakfast. Either bake the potatoes in the oven, or fry them in a hot pan, seasoning them with salt and pepper. Leftover potatoes are great to quickly fry up and add to your dish."
        }
      ]
    }
  ],
  "text":" Assembling the Classic Fry-Up Cook the sausages for 15 minutes, or until they’re cooked through. Heat 1 teaspoon (4.9 mL) of oil in a large pan over low heat. Once the oil is hot, add 2 sausages to the pan. After 10 minutes, turn the heat up to medium and cook the sausages for an additional 5 minutes. Once they’re done, either push them to the side of the pan to keep them warm, or transfer them to a hot plate. If you use really thin sausages, they may not take as long to cook. You can check the doneness by cutting the sausage in half. If there is still red, raw meat inside, it needs several more minutes on the stove. Fry the bacon in the same pan as the sausage. Add 2 to 3 slices of bacon to the already-hot pan. Cook them for 2 minutes on each side, or until they are as crispy as you prefer. When they’re done, either set them to the side of the pan with the sausage, or put them on the hot plate. A longer cook time will produce crispier bacon. Back bacon is recommended for a truly authentic fry-up, but you can use whatever kind you like best—even turkey bacon, if you’re trying to be a little more heart healthy. Heat up 1/4 cup (40 grams) of baked beans on the stovetop. Add your beans to the pan and cook them for 2 to 3 minutes, or until they’re hot all the way through. Use canned beans to save time, or make your own baked beans from scratch ahead of time. Once the beans are hot, move them to the side of the pan or to a hot plate. Beans are a very common (and, often said, essential) part of a classic full English breakfast. You can add the beans to toast, eat them alongside the meats, or enjoy them on their own. Though if you don’t like beans, you don’t have to include them. Grill up your tomato slices or whole tomatoes. If you’re using small, whole tomatoes, cut them in half lengthwise. If you’re using a large tomato, slice off 2 to 3 ⁄4 inch (0.64 cm) slices. Sprinkle the tomatoes with salt and pepper, and place them onto the hot pan. Cook them for about 2 minutes per side. Push the tomatoes to the side or add them to a hot plate when they’re done. The acidity from the tomatoes is a really important part of the flavor profile of an English breakfast. It cuts through the richness and fattiness of the rest of the dish. Fry up a thick slice of bread in butter or leftover bacon fat. Skip the toaster and instead add a piece of bread to the pan in which you’ve cooked the meats, beans, and tomatoes and fry the bread. If the pan is a bit dry, add ⁄2 tablespoon (7.4 mL) of soft butter to the pan and let it melt. Fry the bread on each side for 2 to 3 minutes, or until the bread is brown and toasty. Set the finished toast off to the side when it’s done. The fried bread will be pretty rich from the fat and grease, so you’ll probably just want one slice, though you can make more if you so desire. Make two fried eggs to add to your plate. Check that the heat on the pan is set to medium-high. If the pan is dry, add ⁄2 tablespoon (7.4 mL) of butter to it. Crack the eggs directly into the pan, and cook them for 30 to 60 seconds. Spoon melted butter and grease overtop of the eggs as they cook to baste them and infuse them with more flavor. Turn off the heat once the whites of the eggs are cooked through, but before the yolks have hardened. If you don’t like fried eggs, try making scrambled eggs instead. Assemble your meal on a plate, and serve it alongside hot coffee or tea. Grab a plate, and add the sausage, bacon, beans, tomatoes, toast, and eggs to it. Sit down and enjoy your breakfast—you worked hard for it! Feel free to use ketchup, hot sauce, or any other condiments you enjoy. Exploring English Breakfast Alternatives Fry up some black pudding to add to your plate. Slice off 1 to 2 ⁄2 inch (1.3 cm) pieces of the pudding. Fry the slices in a hot pan for 2 minutes on each side, or until the exterior is crispy. Black pudding is made of oatmeal, pork fat, and blood. You can also get white pudding, which is just made of oatmeal and pork fat. Both puddings have a grainy texture, and the black pudding usually tastes a bit coppery. Add a fried kidney for a tender, protein filled option. Trim away the fat and membrane from the kidney and cut it in half lengthwise. Add the kidney sections to your hot pan, and cook them for 1 to 2 minutes on each side. They’re done when the outsides are slightly browned and the insides are still pink. If you want to check the internal temperature of the kidney, it should be in the 150 to 160 °F (66 to 71 °C) range once it has finished cooking. Poach 2 to 3 kippers in your pan if you like fish. Add enough butter or oil to the hot pan so that there is a thin layer of the liquid. Put 2 to 3 kippers into the pan, and poach the fish for 5 minutes. Spoon the cooked kippers out of the liquid, flake them over your eggs, or serve them whole on the side of your plate. You’ll find canned kippers at your local grocery store, though you can sometimes buy them fresh or frozen, too. Add a handful of mushrooms to add a savory element to your plate. Button or portobello mushrooms are the most popular additions to the fry-up, but you could also use chanterelle or shiitake mushrooms. Take 4 to 5 mushrooms, rinse away any dirt, and add them to a hot pan. Cook them for 1 to 2 minutes, then flip them over and cook them for another 3 to 4 minutes. Don’t flip or stir the mushrooms often, as this will make them release more moisture and could make them soggy. Prepare a side of potatoes to add a starchy element to your breakfast. Hash browns, oven fries, mashed potatoes, shredded potatoes—you can add whatever style of potato you like best to your breakfast. Either bake the potatoes in the oven, or fry them in a hot pan, seasoning them with salt and pepper. Leftover potatoes are great to quickly fry up and add to your dish.",
  "sentences":[
    " Assembling the Classic Fry-Up Cook the sausages for 15 minutes, or until they’re cooked through.",
    "Heat 1 teaspoon (4.9 mL) of oil in a large pan over low heat.",
    "Once the oil is hot, add 2 sausages to the pan.",
    "After 10 minutes, turn the heat up to medium and cook the sausages for an additional 5 minutes.",
    "Once they’re done, either push them to the side of the pan to keep them warm, or transfer them to a hot plate.",
    "If you use really thin sausages, they may not take as long to cook.",
    "You can check the doneness by cutting the sausage in half.",
    "If there is still red, raw meat inside, it needs several more minutes on the stove.",
    "Fry the bacon in the same pan as the sausage.",
    "Add 2 to 3 slices of bacon to the already-hot pan.",
    "Cook them for 2 minutes on each side, or until they are as crispy as you prefer.",
    "When they’re done, either set them to the side of the pan with the sausage, or put them on the hot plate.",
    "A longer cook time will produce crispier bacon.",
    "Back bacon is recommended for a truly authentic fry-up, but you can use whatever kind you like best—even turkey bacon, if you’re trying to be a little more heart healthy.",
    "Heat up 1/4 cup (40 grams) of baked beans on the stovetop.",
    "Add your beans to the pan and cook them for 2 to 3 minutes, or until they’re hot all the way through.",
    "Use canned beans to save time, or make your own baked beans from scratch ahead of time.",
    "Once the beans are hot, move them to the side of the pan or to a hot plate.",
    "Beans are a very common (and, often said, essential) part of a classic full English breakfast.",
    "You can add the beans to toast, eat them alongside the meats, or enjoy them on their own.",
    "Though if you don’t like beans, you don’t have to include them.",
    "Grill up your tomato slices or whole tomatoes.",
    "If you’re using small, whole tomatoes, cut them in half lengthwise.",
    "If you’re using a large tomato, slice off 2 to 3 ⁄4 inch (0.64 cm) slices.",
    "Sprinkle the tomatoes with salt and pepper, and place them onto the hot pan.",
    "Cook them for about 2 minutes per side.",
    "Push the tomatoes to the side or add them to a hot plate when they’re done.",
    "The acidity from the tomatoes is a really important part of the flavor profile of an English breakfast.",
    "It cuts through the richness and fattiness of the rest of the dish.",
    "Fry up a thick slice of bread in butter or leftover bacon fat.",
    "Skip the toaster and instead add a piece of bread to the pan in which you’ve cooked the meats, beans, and tomatoes and fry the bread.",
    "If the pan is a bit dry, add ⁄2 tablespoon (7.4 mL) of soft butter to the pan and let it melt.",
    "Fry the bread on each side for 2 to 3 minutes, or until the bread is brown and toasty.",
    "Set the finished toast off to the side when it’s done.",
    "The fried bread will be pretty rich from the fat and grease, so you’ll probably just want one slice, though you can make more if you so desire.",
    "Make two fried eggs to add to your plate.",
    "Check that the heat on the pan is set to medium-high.",
    "If the pan is dry, add ⁄2 tablespoon (7.4 mL) of butter to it.",
    "Crack the eggs directly into the pan, and cook them for 30 to 60 seconds.",
    "Spoon melted butter and grease overtop of the eggs as they cook to baste them and infuse them with more flavor.",
    "Turn off the heat once the whites of the eggs are cooked through, but before the yolks have hardened.",
    "If you don’t like fried eggs, try making scrambled eggs instead.",
    "Assemble your meal on a plate, and serve it alongside hot coffee or tea.",
    "Grab a plate, and add the sausage, bacon, beans, tomatoes, toast, and eggs to it.",
    "Sit down and enjoy your breakfast—you worked hard for it!",
    "Feel free to use ketchup, hot sauce, or any other condiments you enjoy.",
    "Exploring English Breakfast Alternatives Fry up some black pudding to add to your plate.",
    "Slice off 1 to 2 ⁄2 inch (1.3 cm) pieces of the pudding.",
    "Fry the slices in a hot pan for 2 minutes on each side, or until the exterior is crispy.",
    "Black pudding is made of oatmeal, pork fat, and blood.",
    "You can also get white pudding, which is just made of oatmeal and pork fat.",
    "Both puddings have a grainy texture, and the black pudding usually tastes a bit coppery.",
    "Add a fried kidney for a tender, protein filled option.",
    "Trim away the fat and membrane from the kidney and cut it in half lengthwise.",
    "Add the kidney sections to your hot pan, and cook them for 1 to 2 minutes on each side.",
    "They’re done when the outsides are slightly browned and the insides are still pink.",
    "If you want to check the internal temperature of the kidney, it should be in the 150 to 160 °F (66 to 71 °C) range once it has finished cooking.",
    "Poach 2 to 3 kippers in your pan if you like fish.",
    "Add enough butter or oil to the hot pan so that there is a thin layer of the liquid.",
    "Put 2 to 3 kippers into the pan, and poach the fish for 5 minutes.",
    "Spoon the cooked kippers out of the liquid, flake them over your eggs, or serve them whole on the side of your plate.",
    "You’ll find canned kippers at your local grocery store, though you can sometimes buy them fresh or frozen, too.",
    "Add a handful of mushrooms to add a savory element to your plate.",
    "Button or portobello mushrooms are the most popular additions to the fry-up, but you could also use chanterelle or shiitake mushrooms.",
    "Take 4 to 5 mushrooms, rinse away any dirt, and add them to a hot pan.",
    "Cook them for 1 to 2 minutes, then flip them over and cook them for another 3 to 4 minutes.",
    "Don’t flip or stir the mushrooms often, as this will make them release more moisture and could make them soggy.",
    "Prepare a side of potatoes to add a starchy element to your breakfast.",
    "Hash browns, oven fries, mashed potatoes, shredded potatoes—you can add whatever style of potato you like best to your breakfast.",
    "Either bake the potatoes in the oven, or fry them in a hot pan, seasoning them with salt and pepper.",
    "Leftover potatoes are great to quickly fry up and add to your dish."
  ],
  "tyn_section":[
    "Pan",
    "Spatula",
    "Silverware",
    "Plate"
  ],
  "tyn_model":[
    "tomatoes",
    "eggs",
    "beans",
    "plate",
    "pan",
    "butter",
    "mushrooms",
    "potatoes",
    "hot plate",
    "bacon",
    "sausage",
    "bread",
    "black pudding",
    "oil",
    "baked beans",
    "tomato",
    "salt and pepper",
    "—you",
    "pudding",
    "hot pan",
    "oatmeal",
    "pork fat",
    "fish",
    "large pan",
    "stove",
    "—even",
    "stovetop",
    "meats",
    "bacon fat",
    "toaster",
    "soft butter",
    "fried eggs",
    "toast",
    "ketchup",
    "hot sauce",
    "chanterelle or",
    "hash browns",
    "oven fries",
    "mashed potatoes",
    "potato",
    "oven"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0487804878,
    "f1":0.0888888889,
    "avg_pos":0.0975609756
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1219512195,
    "f1":0.1960784314
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.1219512195,
    "f1":0.1960784314
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0487804878,
    "f1":0.0888888889
  }
}