{
  "title":"How to Spend the Entire Day With a Stuffed Toy",
  "url":"https://www.wikihow.com/Spend-the-Entire-Day-With-a-Stuffed-Toy",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Traditional Toys",
    "Stuffed Animals"
  ],
  "parts":[
    {
      "name":"In the Morning",
      "steps":[
        {
          "headline":"Find a teddy or stuffed animal that you love.",
          "description":""
        },
        {
          "headline":"Ask your teddy how it is feeling this brand new day.",
          "description":"Ask the teddy as you would if you were talking to a small child."
        },
        {
          "headline":"Brush your teeth and hair.",
          "description":"Don't forget your stuffed animal too; brush its fur and teeth. Note that some stuffed animals (like a plush Rocket) don't have teeth. Wash both of your faces with a damp washcloth."
        },
        {
          "headline":"Get dressed.",
          "description":"Find a cute outfit for both you and stuffed animal! Baby clothes work great for twelve-inch bears or stuffed animals."
        },
        {
          "headline":"Eat breakfast together.",
          "description":"Set a place for your stuffed animal to make him/her feel special. Try taking a piece of paper, drawing lines in different colors all around the paper, crumpling it up, and tearing or cutting pieces off it to make teddy food. Give it to your stuffed pal for breakfast."
        },
        {
          "headline":"Have some playtime.",
          "description":"Hold a conversation with your stuffed animal. Take it with you to play a game."
        },
        {
          "headline":"Watch a movie or a TV episode.",
          "description":"Find a movie that's age appropriate for both of you. Avoid anything that might scare your toy."
        }
      ]
    },
    {
      "name":"In the Afternoon",
      "steps":[
        {
          "headline":"Have lunch.",
          "description":"Go back to the table that you set for breakfast and make yourself some lunch. Talk to your furry friend about the day ahead."
        },
        {
          "headline":"Do some work or chores if you have any to do.",
          "description":"Give your stuffed animal a miniature briefcase and work on anything you have to do."
        },
        {
          "headline":"Go on an outing.",
          "description":"Get your parents or an older sibling to take you somewhere with your stuffed toy. Not everything can happen at home! Maybe you both could go to the park or hang out at the bowling alley? Anywhere is fine so long as you both enjoy it. You could also take your stuffed toy to the bookstore or coffee shop. Try not to get the stuffed toy dirty."
        }
      ]
    },
    {
      "name":"In the Evening",
      "steps":[
        {
          "headline":"Take your stuffed toy home.",
          "description":"Now it's time for a nice, relaxing spa experience. Put a damp cloth in the microwave for thirty seconds and drape it over your eyes. Make one for your stuffed animal and sit in a comfy chair. Simply rest."
        },
        {
          "headline":"Watch another movie with your furry friend.",
          "description":""
        },
        {
          "headline":"Have dinner together.",
          "description":"Eat dinner after relaxing and when the movie is done. Treat you and your stuffed animal to something special for dessert."
        }
      ]
    },
    {
      "name":"At Night",
      "steps":[
        {
          "headline":"Get both of you ready for bedtime.",
          "description":"Brush your teeth and hair/fur like you did in the morning."
        },
        {
          "headline":"Wind down together.",
          "description":"Before you and your stuffed animal decide to go to bed, be sure to do something relaxing with them to settle them such as reading or playing a family game."
        },
        {
          "headline":"Make a bed for your companion.",
          "description":"Tuck your companion into bed. Make sure he/she is nice and warm."
        },
        {
          "headline":"Say goodnight and go to bed.",
          "description":"Goodnight––sleep tight!"
        }
      ]
    }
  ],
  "text":" In the Morning Find a teddy or stuffed animal that you love.  Ask your teddy how it is feeling this brand new day. Ask the teddy as you would if you were talking to a small child. Brush your teeth and hair. Don't forget your stuffed animal too; brush its fur and teeth. Note that some stuffed animals (like a plush Rocket) don't have teeth. Wash both of your faces with a damp washcloth. Get dressed. Find a cute outfit for both you and stuffed animal! Baby clothes work great for twelve-inch bears or stuffed animals. Eat breakfast together. Set a place for your stuffed animal to make him/her feel special. Try taking a piece of paper, drawing lines in different colors all around the paper, crumpling it up, and tearing or cutting pieces off it to make teddy food. Give it to your stuffed pal for breakfast. Have some playtime. Hold a conversation with your stuffed animal. Take it with you to play a game. Watch a movie or a TV episode. Find a movie that's age appropriate for both of you. Avoid anything that might scare your toy. In the Afternoon Have lunch. Go back to the table that you set for breakfast and make yourself some lunch. Talk to your furry friend about the day ahead. Do some work or chores if you have any to do. Give your stuffed animal a miniature briefcase and work on anything you have to do. Go on an outing. Get your parents or an older sibling to take you somewhere with your stuffed toy. Not everything can happen at home! Maybe you both could go to the park or hang out at the bowling alley? Anywhere is fine so long as you both enjoy it. You could also take your stuffed toy to the bookstore or coffee shop. Try not to get the stuffed toy dirty. In the Evening Take your stuffed toy home. Now it's time for a nice, relaxing spa experience. Put a damp cloth in the microwave for thirty seconds and drape it over your eyes. Make one for your stuffed animal and sit in a comfy chair. Simply rest. Watch another movie with your furry friend.  Have dinner together. Eat dinner after relaxing and when the movie is done. Treat you and your stuffed animal to something special for dessert. At Night Get both of you ready for bedtime. Brush your teeth and hair/fur like you did in the morning. Wind down together. Before you and your stuffed animal decide to go to bed, be sure to do something relaxing with them to settle them such as reading or playing a family game. Make a bed for your companion. Tuck your companion into bed. Make sure he/she is nice and warm. Say goodnight and go to bed. Goodnight––sleep tight!",
  "sentences":[
    " In the Morning Find a teddy or stuffed animal that you love.",
    "Ask your teddy how it is feeling this brand new day.",
    "Ask the teddy as you would if you were talking to a small child.",
    "Brush your teeth and hair.",
    "Don't forget your stuffed animal too; brush its fur and teeth.",
    "Note that some stuffed animals (like a plush Rocket) don't have teeth.",
    "Wash both of your faces with a damp washcloth.",
    "Get dressed.",
    "Find a cute outfit for both you and stuffed animal!",
    "Baby clothes work great for twelve-inch bears or stuffed animals.",
    "Eat breakfast together.",
    "Set a place for your stuffed animal to make him/her feel special.",
    "Try taking a piece of paper, drawing lines in different colors all around the paper, crumpling it up, and tearing or cutting pieces off it to make teddy food.",
    "Give it to your stuffed pal for breakfast.",
    "Have some playtime.",
    "Hold a conversation with your stuffed animal.",
    "Take it with you to play a game.",
    "Watch a movie or a TV episode.",
    "Find a movie that's age appropriate for both of you.",
    "Avoid anything that might scare your toy.",
    "In the Afternoon Have lunch.",
    "Go back to the table that you set for breakfast and make yourself some lunch.",
    "Talk to your furry friend about the day ahead.",
    "Do some work or chores if you have any to do.",
    "Give your stuffed animal a miniature briefcase and work on anything you have to do.",
    "Go on an outing.",
    "Get your parents or an older sibling to take you somewhere with your stuffed toy.",
    "Not everything can happen at home!",
    "Maybe you both could go to the park or hang out at the bowling alley?",
    "Anywhere is fine so long as you both enjoy it.",
    "You could also take your stuffed toy to the bookstore or coffee shop.",
    "Try not to get the stuffed toy dirty.",
    "In the Evening Take your stuffed toy home.",
    "Now it's time for a nice, relaxing spa experience.",
    "Put a damp cloth in the microwave for thirty seconds and drape it over your eyes.",
    "Make one for your stuffed animal and sit in a comfy chair.",
    "Simply rest.",
    "Watch another movie with your furry friend.",
    "Have dinner together.",
    "Eat dinner after relaxing and when the movie is done.",
    "Treat you and your stuffed animal to something special for dessert.",
    "At Night Get both of you ready for bedtime.",
    "Brush your teeth and hair/fur like you did in the morning.",
    "Wind down together.",
    "Before you and your stuffed animal decide to go to bed, be sure to do something relaxing with them to settle them such as reading or playing a family game.",
    "Make a bed for your companion.",
    "Tuck your companion into bed.",
    "Make sure he/she is nice and warm.",
    "Say goodnight and go to bed.",
    "Goodnight––sleep tight!"
  ],
  "tyn_section":[
    "Plush, stuffed toy or teddy",
    "DVD or movie tickets",
    "Some spare cash",
    "Hat or pullover if it is cold out",
    "Clothes for your plush friend",
    "Fake food"
  ],
  "tyn_model":[
    "paper",
    "plush rocket",
    "washcloth",
    "microwave"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}