{
  "title":"How to Get Sweat Stains out of Clothing",
  "url":"https://www.wikihow.com/Get-Sweat-Stains-out-of-Clothing",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal",
    "Bodily Fluid Stain Removal"
  ],
  "methods":[
    {
      "name":"Using Baking Soda and Hydrogen Peroxide on Whites",
      "steps":[
        {
          "headline":"Flip your item of clothing inside out and place it in a bowl or sink.",
          "description":"Flipping your item of clothing inside out will allow you to attack the stain directly. Place your reversed item of clothing inside a large bowl or sink, with the stain resting at the lowest point in the bowl or sink. This method will not work with spandex, which can be damaged by hot water. Using baking soda and hydrogen peroxide may cause discoloration if you’re removing stains from colored fabric."
        },
        {
          "headline":"Combine baking soda, hydrogen peroxide, and water in a separate bowl.",
          "description":"Use 1 part baking soda, 1 part hydrogen peroxide, and 1 part water in a large bowl and mix them together with a large clean spoon. Mix the solution until there are no visible chunks of baking soda left. About ⁄4 cup (59 mL) of each ingredient will be enough for 1 shirt or pair of pants."
        },
        {
          "headline":"Boil a pot of water and pour it directly on the stains.",
          "description":"Fill a large pot with water and heat it on the stove until the water reaches a rolling boil. While wearing an oven mitt, carry the pot over to your sink or bowl and pour the boiling water directly over your sweat stain. This will loosen the fabric and make the sweat stains easier to scrub away."
        },
        {
          "headline":"Pour the baking soda solution directly on to the stain and scrub it.",
          "description":"With a spoon, scoop your solution directly on top of the stains. Let it soak for at least 5 minutes. After it soaks, scrub the stain with a scrub brush or toothbrush in soft, circular motions until the stain disappears. You can soak your clothing for longer if you’d like. White fabric won’t be damaged by letting it soak for longer."
        },
        {
          "headline":"Throw the clothing in with your dirty laundry and wash it.",
          "description":"Throw your item of clothing in with your dirty laundry and sort it before you wash it. Use your standard laundry detergent and run a regular wash cycle to remove any residue from your baking soda or hydrogen peroxide.Warning: If you don’t wash your clothing soon after using the baking soda and hydrogen peroxide, then you run the risk of letting residual stains settle permanently."
        }
      ]
    },
    {
      "name":"Washing Colors with White Vinegar",
      "steps":[
        {
          "headline":"Place your item of clothing in a sink or large bowl, inside out.",
          "description":"You’re going to soak your item of clothing for a while, so make sure that the bowl is big and deep enough to keep your clothing fully submerged for a long period of time. Place the stained area at the lowest point in the bowl or sink so that it can fully soak when you add your vinegar. White vinegar is the least likely to damage colored clothing."
        },
        {
          "headline":"Fill a bowl with white vinegar and water and pour it over the stain.",
          "description":"In a large bowl, combine 1 part white vinegar with 1 part water and mix it with a large spoon. Pour your mixture over the stain so that it is fully submerged in your mixture.Warning: Don’t try this with any non-white vinegar, which will permanently stain your clothing. About ⁄3 cup (79 mL) of each ingredient will be enough for 1 shirt or pair of pants as long as this will cover the stain completely."
        },
        {
          "headline":"Let your clothing soak for 30 minutes before washing it.",
          "description":"Allow your clothing to soak in the vinegar solution for at least 30 minutes before throwing it in with your sorted laundry for a standard wash. If you notice that the stain is still there after you’ve washed it, repeat this process."
        }
      ]
    },
    {
      "name":"Trying Lemon Juice for a Natural Clean",
      "steps":[
        {
          "headline":"Fill a glass with water and lemon juice.",
          "description":"Squeeze several lemons into a small glass until it’s half full. Then, top the lemon juice off with room temperature water until your glass is filled to the brim. You can add 1 teaspoon (4 grams) of salt to the mixture if you’d like to make the stain easier to scrub.Tip: You can use pre-bottled lemon juice if you’d like, but check the label first to make sure that there isn’t any sugar added to it. The sugar will leave a strange residue behind and could add a different stain after your shirt dries."
        },
        {
          "headline":"Pour your lemon juice solution onto the stain and rub it.",
          "description":"With your item of clothing sitting over your sink, pour your lemon juice over your stain and begin to rub it gently between the pads of your fingers. Rub it for 3-5 minutes until you see the stain disappearing."
        },
        {
          "headline":"Leave your clothing to soak for 1 hour and then wash it.",
          "description":"After you’ve rubbed the majority of the stain away, let your clothing sit in the sink for 1 hour. This will give the lemon juice and water time to loosen up any remaining residue from the sweat stain. Then, throw your clothing in with the rest of your laundry. You can rinse the lemon juice and salt under cold water if you’re washing the clothing with any colored items of clothing and are worried about the salt changing their color. Lemon juice can have an undesired effect on colored fabric if it’s been dyed."
        }
      ]
    }
  ],
  "text":" Using Baking Soda and Hydrogen Peroxide on Whites Flip your item of clothing inside out and place it in a bowl or sink. Flipping your item of clothing inside out will allow you to attack the stain directly. Place your reversed item of clothing inside a large bowl or sink, with the stain resting at the lowest point in the bowl or sink. This method will not work with spandex, which can be damaged by hot water. Using baking soda and hydrogen peroxide may cause discoloration if you’re removing stains from colored fabric. Combine baking soda, hydrogen peroxide, and water in a separate bowl. Use 1 part baking soda, 1 part hydrogen peroxide, and 1 part water in a large bowl and mix them together with a large clean spoon. Mix the solution until there are no visible chunks of baking soda left. About ⁄4 cup (59 mL) of each ingredient will be enough for 1 shirt or pair of pants. Boil a pot of water and pour it directly on the stains. Fill a large pot with water and heat it on the stove until the water reaches a rolling boil. While wearing an oven mitt, carry the pot over to your sink or bowl and pour the boiling water directly over your sweat stain. This will loosen the fabric and make the sweat stains easier to scrub away. Pour the baking soda solution directly on to the stain and scrub it. With a spoon, scoop your solution directly on top of the stains. Let it soak for at least 5 minutes. After it soaks, scrub the stain with a scrub brush or toothbrush in soft, circular motions until the stain disappears. You can soak your clothing for longer if you’d like. White fabric won’t be damaged by letting it soak for longer. Throw the clothing in with your dirty laundry and wash it. Throw your item of clothing in with your dirty laundry and sort it before you wash it. Use your standard laundry detergent and run a regular wash cycle to remove any residue from your baking soda or hydrogen peroxide.Warning: If you don’t wash your clothing soon after using the baking soda and hydrogen peroxide, then you run the risk of letting residual stains settle permanently. Washing Colors with White Vinegar Place your item of clothing in a sink or large bowl, inside out. You’re going to soak your item of clothing for a while, so make sure that the bowl is big and deep enough to keep your clothing fully submerged for a long period of time. Place the stained area at the lowest point in the bowl or sink so that it can fully soak when you add your vinegar. White vinegar is the least likely to damage colored clothing. Fill a bowl with white vinegar and water and pour it over the stain. In a large bowl, combine 1 part white vinegar with 1 part water and mix it with a large spoon. Pour your mixture over the stain so that it is fully submerged in your mixture.Warning: Don’t try this with any non-white vinegar, which will permanently stain your clothing. About ⁄3 cup (79 mL) of each ingredient will be enough for 1 shirt or pair of pants as long as this will cover the stain completely. Let your clothing soak for 30 minutes before washing it. Allow your clothing to soak in the vinegar solution for at least 30 minutes before throwing it in with your sorted laundry for a standard wash. If you notice that the stain is still there after you’ve washed it, repeat this process. Trying Lemon Juice for a Natural Clean Fill a glass with water and lemon juice. Squeeze several lemons into a small glass until it’s half full. Then, top the lemon juice off with room temperature water until your glass is filled to the brim. You can add 1 teaspoon (4 grams) of salt to the mixture if you’d like to make the stain easier to scrub.Tip: You can use pre-bottled lemon juice if you’d like, but check the label first to make sure that there isn’t any sugar added to it. The sugar will leave a strange residue behind and could add a different stain after your shirt dries. Pour your lemon juice solution onto the stain and rub it. With your item of clothing sitting over your sink, pour your lemon juice over your stain and begin to rub it gently between the pads of your fingers. Rub it for 3-5 minutes until you see the stain disappearing. Leave your clothing to soak for 1 hour and then wash it. After you’ve rubbed the majority of the stain away, let your clothing sit in the sink for 1 hour. This will give the lemon juice and water time to loosen up any remaining residue from the sweat stain. Then, throw your clothing in with the rest of your laundry. You can rinse the lemon juice and salt under cold water if you’re washing the clothing with any colored items of clothing and are worried about the salt changing their color. Lemon juice can have an undesired effect on colored fabric if it’s been dyed.",
  "sentences":[
    " Using Baking Soda and Hydrogen Peroxide on Whites Flip your item of clothing inside out and place it in a bowl or sink.",
    "Flipping your item of clothing inside out will allow you to attack the stain directly.",
    "Place your reversed item of clothing inside a large bowl or sink, with the stain resting at the lowest point in the bowl or sink.",
    "This method will not work with spandex, which can be damaged by hot water.",
    "Using baking soda and hydrogen peroxide may cause discoloration if you’re removing stains from colored fabric.",
    "Combine baking soda, hydrogen peroxide, and water in a separate bowl.",
    "Use 1 part baking soda, 1 part hydrogen peroxide, and 1 part water in a large bowl and mix them together with a large clean spoon.",
    "Mix the solution until there are no visible chunks of baking soda left.",
    "About ⁄4 cup (59 mL) of each ingredient will be enough for 1 shirt or pair of pants.",
    "Boil a pot of water and pour it directly on the stains.",
    "Fill a large pot with water and heat it on the stove until the water reaches a rolling boil.",
    "While wearing an oven mitt, carry the pot over to your sink or bowl and pour the boiling water directly over your sweat stain.",
    "This will loosen the fabric and make the sweat stains easier to scrub away.",
    "Pour the baking soda solution directly on to the stain and scrub it.",
    "With a spoon, scoop your solution directly on top of the stains.",
    "Let it soak for at least 5 minutes.",
    "After it soaks, scrub the stain with a scrub brush or toothbrush in soft, circular motions until the stain disappears.",
    "You can soak your clothing for longer if you’d like.",
    "White fabric won’t be damaged by letting it soak for longer.",
    "Throw the clothing in with your dirty laundry and wash it.",
    "Throw your item of clothing in with your dirty laundry and sort it before you wash it.",
    "Use your standard laundry detergent and run a regular wash cycle to remove any residue from your baking soda or hydrogen peroxide.Warning: If you don’t wash your clothing soon after using the baking soda and hydrogen peroxide, then you run the risk of letting residual stains settle permanently.",
    "Washing Colors with White Vinegar Place your item of clothing in a sink or large bowl, inside out.",
    "You’re going to soak your item of clothing for a while, so make sure that the bowl is big and deep enough to keep your clothing fully submerged for a long period of time.",
    "Place the stained area at the lowest point in the bowl or sink so that it can fully soak when you add your vinegar.",
    "White vinegar is the least likely to damage colored clothing.",
    "Fill a bowl with white vinegar and water and pour it over the stain.",
    "In a large bowl, combine 1 part white vinegar with 1 part water and mix it with a large spoon.",
    "Pour your mixture over the stain so that it is fully submerged in your mixture.Warning: Don’t try this with any non-white vinegar, which will permanently stain your clothing.",
    "About ⁄3 cup (79 mL) of each ingredient will be enough for 1 shirt or pair of pants as long as this will cover the stain completely.",
    "Let your clothing soak for 30 minutes before washing it.",
    "Allow your clothing to soak in the vinegar solution for at least 30 minutes before throwing it in with your sorted laundry for a standard wash.",
    "If you notice that the stain is still there after you’ve washed it, repeat this process.",
    "Trying Lemon Juice for a Natural Clean Fill a glass with water and lemon juice.",
    "Squeeze several lemons into a small glass until it’s half full.",
    "Then, top the lemon juice off with room temperature water until your glass is filled to the brim.",
    "You can add 1 teaspoon (4 grams) of salt to the mixture if you’d like to make the stain easier to scrub.Tip: You can use pre-bottled lemon juice if you’d like, but check the label first to make sure that there isn’t any sugar added to it.",
    "The sugar will leave a strange residue behind and could add a different stain after your shirt dries.",
    "Pour your lemon juice solution onto the stain and rub it.",
    "With your item of clothing sitting over your sink, pour your lemon juice over your stain and begin to rub it gently between the pads of your fingers.",
    "Rub it for 3-5 minutes until you see the stain disappearing.",
    "Leave your clothing to soak for 1 hour and then wash it.",
    "After you’ve rubbed the majority of the stain away, let your clothing sit in the sink for 1 hour.",
    "This will give the lemon juice and water time to loosen up any remaining residue from the sweat stain.",
    "Then, throw your clothing in with the rest of your laundry.",
    "You can rinse the lemon juice and salt under cold water if you’re washing the clothing with any colored items of clothing and are worried about the salt changing their color.",
    "Lemon juice can have an undesired effect on colored fabric if it’s been dyed."
  ],
  "tyn_section":[
    "Large bowl or sink",
    "Pot",
    "Oven mitt",
    "Baking soda",
    "Hydrogen peroxide",
    "Water",
    "Spoon",
    "Scrub brush or toothbrush",
    "White vinegar",
    "Small glass",
    "Lemons or lemon juice",
    "Salt"
  ],
  "tyn_model":[
    "water",
    "baking soda",
    "hydrogen peroxide",
    "bowl",
    "lemon juice",
    "vinegar",
    "white vinegar",
    "salt",
    "lemon",
    "sugar",
    "large bowl",
    "large clean spoon",
    "large pot",
    "oven mitt",
    "pot",
    "spoon",
    "scrub brush",
    "laundry detergent",
    "large spoon",
    "glass"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.4,
    "f1":0.5,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.75,
    "f1":0.8571428571
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.8,
    "f1":0.8888888889
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.4,
    "f1":0.5
  }
}