{
  "title":"How to Make Hot and Spicy Chicken",
  "url":"https://www.wikihow.com/Make-Hot-and-Spicy-Chicken",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "parts":[
    {
      "name":"Seasoning and Coating the Chicken",
      "steps":[
        {
          "headline":"Toss the chicken with salt and pepper and refrigerate.",
          "description":"In a large bowl, combine 1 whole chicken that’s been cut into 4 or 8 pieces, depending on your preference, with 1 ½ teaspoons (3 g) of freshly ground black pepper and 1 tablespoon (18 g) of kosher salt. Toss well so the chicken is coated, cover the bowl with plastic wrap, and refrigerate overnight. Be sure to wash the chicken thoroughly and pat dry before combining with the salt and pepper. If you don’t want to use a whole chicken, you can substitute 3 lbs of chicken wings or chicken tenders instead."
        },
        {
          "headline":"Combine the milk, eggs, and hot sauce, and mix the flour and sea salt.",
          "description":"In a medium size bowl, mix together 2 large eggs, 1 cup (237 ml) of buttermilk or whole milk, and 1 tablespoon (15 ml) of a vinegar-based hot sauce until well blended. In a separate medium size bowl, whisk 2 cups (250 g) of all-purpose flour together with 2 teaspoons (8 g) of sea salt until they’re well mixed. You can use either buttermilk or whole milk in the recipe, but keep in mind that the buttermilk will provide a tangier flavor. Tabasco is a common vinegar-based hot sauce that you can find at most grocery stores."
        },
        {
          "headline":"Dredge the chicken in the flour mixture and dip in the milk mixture.",
          "description":"Take the chicken pieces out of the refrigerator, and press them into the flour mixture to coat both sides. Next, dip them in the milk mixture so all of the chicken is covered. Shake the chicken pieces after you dredge them to get rid of any excess flour. Be sure to allow the excess milk mixture to drip back into the bowl when you’re coating the chicken pieces."
        },
        {
          "headline":"Coat the chicken with flour mixture again.",
          "description":"Once you’ve dipped the chicken in the milk mixture, place them back in the flour mixture to again coat both sides. Shake off any excess, and place the chicken on a large plate or baking sheet."
        }
      ]
    },
    {
      "name":"Frying the Chicken",
      "steps":[
        {
          "headline":"Heat the oil in a large saucepan.",
          "description":"Fill a 6 quart (5.7 L) saucepan with 2-inches (5 cm) of vegetable oil, and heat it over medium high heat. Use a deep fry thermometer so you know when the oil has reached 325 degrees Fahrenheit (163 degrees Celsius). If you don’t have a large enough saucepan, you can use a Dutch oven for frying the chicken."
        },
        {
          "headline":"Place the chicken in the oil in batches and fry until golden brown.",
          "description":"When the oil reaches the right temperature, place the chicken in the pan in batches, making sure not to crowd the pan. Allow the pieces to fry until crispy and golden brown, turning them over once. If you quartered your chicken before frying, the breast pieces should take approximately 15 to 17 minutes to fry, while the leg pieces should take about 18 to 20 minutes. If you cut the chicken into 8 pieces, they should take approximately 7 to 10 minutes to fry. If you’re using wings or chicken tender, you may only need to fry them for 5 to 7 minutes. To ensure that the chicken is cooked through, have an instant-read thermometer on hand. Test the thickest part of each piece and make sure that the internal temperature is at least 160 degrees Fahrenheit (71 degrees Celsius) for white meat and 165 degrees Fahrenheit (74 degrees Celsius) for dark meat."
        },
        {
          "headline":"Remove the chicken from the oil and drain on the rack.",
          "description":"When the chicken pieces have finished frying, remove them from the oil with tongs. Place them on a wire rack that’s set across the top of a rimmed baking sheet so the excess oil can drain away. When you’ve finished frying all of the chicken, turn the heat on the pan off and allow the oil to cool slightly so it’s ready for the next step."
        }
      ]
    },
    {
      "name":"Adding the Hot and Spicy Coating",
      "steps":[
        {
          "headline":"Add the cayenne pepper and other seasonings to some of the frying oil.",
          "description":"Use a ladle to carefully add ½ cup (118 ml) of the frying oil to a medium size heatproof bowl. Stir in 3 tablespoons (16 g) of cayenne pepper, 1 tablespoon (12.5 g) of packed light brown sugar, 1 teaspoon (3 g) of chili powder, ¾ teaspoon (3 g) of sea salt, 1 teaspoon (2 g) of black pepper, ½ teaspoon (1.5 g) of garlic powder, and ½ teaspoon (1 g) of paprika, and mix until well blended. Hot oil can burn the skin easily, so take care when you’re pouring it into your bowl to mix with the seasonings. If you don’t want the chicken to be too hot and spicy, you can reduce the cayenne pepper to 1 or 2 tablespoons (5.3 to 10.6 g)."
        },
        {
          "headline":"Brush the spicy mixture over the chicken.",
          "description":"While the chicken and the spicy mixture are both still warm, use a pastry brush to coat the chicken pieces on both sides with the oil mixture. If you don’t have a brush, you can use a spoon to carefully pour it over the chicken."
        },
        {
          "headline":"Serve immediately.",
          "description":"The hot and spicy chicken should be served warm, so as soon as it’s coated with the oil mixture, plate it up. Depending on the size of the chicken, place one or two pieces on a white sandwich bread and garnish with sliced pickles."
        }
      ]
    }
  ],
  "text":" Seasoning and Coating the Chicken Toss the chicken with salt and pepper and refrigerate. In a large bowl, combine 1 whole chicken that’s been cut into 4 or 8 pieces, depending on your preference, with 1 ½ teaspoons (3 g) of freshly ground black pepper and 1 tablespoon (18 g) of kosher salt. Toss well so the chicken is coated, cover the bowl with plastic wrap, and refrigerate overnight. Be sure to wash the chicken thoroughly and pat dry before combining with the salt and pepper. If you don’t want to use a whole chicken, you can substitute 3 lbs of chicken wings or chicken tenders instead. Combine the milk, eggs, and hot sauce, and mix the flour and sea salt. In a medium size bowl, mix together 2 large eggs, 1 cup (237 ml) of buttermilk or whole milk, and 1 tablespoon (15 ml) of a vinegar-based hot sauce until well blended. In a separate medium size bowl, whisk 2 cups (250 g) of all-purpose flour together with 2 teaspoons (8 g) of sea salt until they’re well mixed. You can use either buttermilk or whole milk in the recipe, but keep in mind that the buttermilk will provide a tangier flavor. Tabasco is a common vinegar-based hot sauce that you can find at most grocery stores. Dredge the chicken in the flour mixture and dip in the milk mixture. Take the chicken pieces out of the refrigerator, and press them into the flour mixture to coat both sides. Next, dip them in the milk mixture so all of the chicken is covered. Shake the chicken pieces after you dredge them to get rid of any excess flour. Be sure to allow the excess milk mixture to drip back into the bowl when you’re coating the chicken pieces. Coat the chicken with flour mixture again. Once you’ve dipped the chicken in the milk mixture, place them back in the flour mixture to again coat both sides. Shake off any excess, and place the chicken on a large plate or baking sheet. Frying the Chicken Heat the oil in a large saucepan. Fill a 6 quart (5.7 L) saucepan with 2-inches (5 cm) of vegetable oil, and heat it over medium high heat. Use a deep fry thermometer so you know when the oil has reached 325 degrees Fahrenheit (163 degrees Celsius). If you don’t have a large enough saucepan, you can use a Dutch oven for frying the chicken. Place the chicken in the oil in batches and fry until golden brown. When the oil reaches the right temperature, place the chicken in the pan in batches, making sure not to crowd the pan. Allow the pieces to fry until crispy and golden brown, turning them over once. If you quartered your chicken before frying, the breast pieces should take approximately 15 to 17 minutes to fry, while the leg pieces should take about 18 to 20 minutes. If you cut the chicken into 8 pieces, they should take approximately 7 to 10 minutes to fry. If you’re using wings or chicken tender, you may only need to fry them for 5 to 7 minutes. To ensure that the chicken is cooked through, have an instant-read thermometer on hand. Test the thickest part of each piece and make sure that the internal temperature is at least 160 degrees Fahrenheit (71 degrees Celsius) for white meat and 165 degrees Fahrenheit (74 degrees Celsius) for dark meat. Remove the chicken from the oil and drain on the rack. When the chicken pieces have finished frying, remove them from the oil with tongs. Place them on a wire rack that’s set across the top of a rimmed baking sheet so the excess oil can drain away. When you’ve finished frying all of the chicken, turn the heat on the pan off and allow the oil to cool slightly so it’s ready for the next step. Adding the Hot and Spicy Coating Add the cayenne pepper and other seasonings to some of the frying oil. Use a ladle to carefully add ½ cup (118 ml) of the frying oil to a medium size heatproof bowl. Stir in 3 tablespoons (16 g) of cayenne pepper, 1 tablespoon (12.5 g) of packed light brown sugar, 1 teaspoon (3 g) of chili powder, ¾ teaspoon (3 g) of sea salt, 1 teaspoon (2 g) of black pepper, ½ teaspoon (1.5 g) of garlic powder, and ½ teaspoon (1 g) of paprika, and mix until well blended. Hot oil can burn the skin easily, so take care when you’re pouring it into your bowl to mix with the seasonings. If you don’t want the chicken to be too hot and spicy, you can reduce the cayenne pepper to 1 or 2 tablespoons (5.3 to 10.6 g). Brush the spicy mixture over the chicken. While the chicken and the spicy mixture are both still warm, use a pastry brush to coat the chicken pieces on both sides with the oil mixture. If you don’t have a brush, you can use a spoon to carefully pour it over the chicken. Serve immediately. The hot and spicy chicken should be served warm, so as soon as it’s coated with the oil mixture, plate it up. Depending on the size of the chicken, place one or two pieces on a white sandwich bread and garnish with sliced pickles.",
  "sentences":[
    " Seasoning and Coating the Chicken Toss the chicken with salt and pepper and refrigerate.",
    "In a large bowl, combine 1 whole chicken that’s been cut into 4 or 8 pieces, depending on your preference, with 1 ½ teaspoons (3 g) of freshly ground black pepper and 1 tablespoon (18 g) of kosher salt.",
    "Toss well so the chicken is coated, cover the bowl with plastic wrap, and refrigerate overnight.",
    "Be sure to wash the chicken thoroughly and pat dry before combining with the salt and pepper.",
    "If you don’t want to use a whole chicken, you can substitute 3 lbs of chicken wings or chicken tenders instead.",
    "Combine the milk, eggs, and hot sauce, and mix the flour and sea salt.",
    "In a medium size bowl, mix together 2 large eggs, 1 cup (237 ml) of buttermilk or whole milk, and 1 tablespoon (15 ml) of a vinegar-based hot sauce until well blended.",
    "In a separate medium size bowl, whisk 2 cups (250 g) of all-purpose flour together with 2 teaspoons (8 g) of sea salt until they’re well mixed.",
    "You can use either buttermilk or whole milk in the recipe, but keep in mind that the buttermilk will provide a tangier flavor.",
    "Tabasco is a common vinegar-based hot sauce that you can find at most grocery stores.",
    "Dredge the chicken in the flour mixture and dip in the milk mixture.",
    "Take the chicken pieces out of the refrigerator, and press them into the flour mixture to coat both sides.",
    "Next, dip them in the milk mixture so all of the chicken is covered.",
    "Shake the chicken pieces after you dredge them to get rid of any excess flour.",
    "Be sure to allow the excess milk mixture to drip back into the bowl when you’re coating the chicken pieces.",
    "Coat the chicken with flour mixture again.",
    "Once you’ve dipped the chicken in the milk mixture, place them back in the flour mixture to again coat both sides.",
    "Shake off any excess, and place the chicken on a large plate or baking sheet.",
    "Frying the Chicken Heat the oil in a large saucepan.",
    "Fill a 6 quart (5.7 L) saucepan with 2-inches (5 cm) of vegetable oil, and heat it over medium high heat.",
    "Use a deep fry thermometer so you know when the oil has reached 325 degrees Fahrenheit (163 degrees Celsius).",
    "If you don’t have a large enough saucepan, you can use a Dutch oven for frying the chicken.",
    "Place the chicken in the oil in batches and fry until golden brown.",
    "When the oil reaches the right temperature, place the chicken in the pan in batches, making sure not to crowd the pan.",
    "Allow the pieces to fry until crispy and golden brown, turning them over once.",
    "If you quartered your chicken before frying, the breast pieces should take approximately 15 to 17 minutes to fry, while the leg pieces should take about 18 to 20 minutes.",
    "If you cut the chicken into 8 pieces, they should take approximately 7 to 10 minutes to fry.",
    "If you’re using wings or chicken tender, you may only need to fry them for 5 to 7 minutes.",
    "To ensure that the chicken is cooked through, have an instant-read thermometer on hand.",
    "Test the thickest part of each piece and make sure that the internal temperature is at least 160 degrees Fahrenheit (71 degrees Celsius) for white meat and 165 degrees Fahrenheit (74 degrees Celsius) for dark meat.",
    "Remove the chicken from the oil and drain on the rack.",
    "When the chicken pieces have finished frying, remove them from the oil with tongs.",
    "Place them on a wire rack that’s set across the top of a rimmed baking sheet so the excess oil can drain away.",
    "When you’ve finished frying all of the chicken, turn the heat on the pan off and allow the oil to cool slightly so it’s ready for the next step.",
    "Adding the Hot and Spicy Coating Add the cayenne pepper and other seasonings to some of the frying oil.",
    "Use a ladle to carefully add ½ cup (118 ml) of the frying oil to a medium size heatproof bowl.",
    "Stir in 3 tablespoons (16 g) of cayenne pepper, 1 tablespoon (12.5 g) of packed light brown sugar, 1 teaspoon (3 g) of chili powder, ¾ teaspoon (3 g) of sea salt, 1 teaspoon (2 g) of black pepper, ½ teaspoon (1.5 g) of garlic powder, and ½ teaspoon (1 g) of paprika, and mix until well blended.",
    "Hot oil can burn the skin easily, so take care when you’re pouring it into your bowl to mix with the seasonings.",
    "If you don’t want the chicken to be too hot and spicy, you can reduce the cayenne pepper to 1 or 2 tablespoons (5.3 to 10.6 g).",
    "Brush the spicy mixture over the chicken.",
    "While the chicken and the spicy mixture are both still warm, use a pastry brush to coat the chicken pieces on both sides with the oil mixture.",
    "If you don’t have a brush, you can use a spoon to carefully pour it over the chicken.",
    "Serve immediately.",
    "The hot and spicy chicken should be served warm, so as soon as it’s coated with the oil mixture, plate it up.",
    "Depending on the size of the chicken, place one or two pieces on a white sandwich bread and garnish with sliced pickles."
  ],
  "tyn_section":[
    "A large bowl",
    "Plastic wrap",
    "2 medium size bowls",
    "A wooden spoon",
    "A rimmed baking sheet",
    "A wire rack",
    "A 6 quart (5.7 L) saucepan",
    "A deep frying thermometer",
    "An instant-read thermometer",
    "Tongs",
    "A ladle",
    "A heat proof bowl",
    "A pastry brush"
  ],
  "tyn_model":[
    "oil",
    "chicken",
    "milk",
    "flour",
    "bowl",
    "sea salt",
    "cayenne pepper",
    "eggs",
    "buttermilk or",
    "baking sheet",
    "saucepan",
    "frying oil",
    "salt and pepper",
    "freshly ground black pepper",
    "kosher salt",
    "plastic wrap",
    "salt",
    "pepper",
    "chicken wings",
    "chicken tenders",
    "hot sauce",
    "whole milk",
    "vinegar-based hot sauce",
    "all-purpose flour",
    "buttermilk",
    "refrigerator",
    "large plate",
    "large saucepan",
    "vegetable oil",
    "deep fry thermometer",
    "dutch oven",
    "instant-read thermometer",
    "pan",
    "ladle",
    "heatproof bowl",
    "light brown sugar",
    "chili powder",
    "black pepper",
    "garlic",
    "paprika",
    "seasonings",
    "pastry brush",
    "spoon",
    "sandwich bread",
    "pickles"
  ],
  "simple_metrics":{
    "r":0.0769230769,
    "p":0.0222222222,
    "f1":0.0344827586,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3846153846,
    "p":0.1111111111,
    "f1":0.1724137931
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6153846154,
    "p":0.1777777778,
    "f1":0.275862069
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2307692308,
    "p":0.0666666667,
    "f1":0.1034482759
  }
}