{
  "title":"How to Make Christmas Hot Chocolate",
  "url":"https://www.wikihow.com/Make-Christmas-Hot-Chocolate",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Chocolate and Cocoa Drinks"
  ],
  "methods":[
    {
      "name":"Making a Traditional Hot Chocolate Base",
      "steps":[
        {
          "headline":"Mix the cocoa powder and sugar in a large saucepan.",
          "description":"Measure 1/3 cup (68 grams) of sugar and 1/3 cup (33 grams) of unsweetened cocoa powder into your saucepan. Use a spoon to stir the ingredients together until they are completely blended. If you notice any lumps in the mixture, use the back of your spoon to squish them. This ensures that your hot chocolate has a smooth consistency. Both raw sugar and white sugar work well for this recipe."
        },
        {
          "headline":"Stir in 1.5 cups (350 mL) of milk into the saucepan over a medium heat.",
          "description":"Measure the milk into the saucepan with the cocoa powder and sugar. Use a spoon or a whisk to mix all the ingredients until they are fully combined and there are no lumps. If the mixture starts to boil, turn down the heat."
        },
        {
          "headline":"Mix in an extra 3.5 cups (830 mL) of cream or milk.",
          "description":"Cream helps to create a thicker, richer tasting hot chocolate, whereas milk will give a lighter, more traditional taste. Measure your chosen liquid into the saucepan and then gently stir it to integrate it into the rest of the hot chocolate mixture. Use a ratio of ½ cream and ½ milk if you want a moderately creamy hot chocolate."
        },
        {
          "headline":"Keep it on the heat until it reaches your desired temperature.",
          "description":"Continue to stir the hot chocolate mixture while it is on the heat. Use a spoon to taste the hot chocolate to check that it is the right temperature. Leave it on the heat until it reaches a pleasant temperature. If the hot chocolate is too hot, simply take it off the heat and leave it to cool for a few minutes before drinking it."
        }
      ]
    },
    {
      "name":"Creating Different Flavours",
      "steps":[
        {
          "headline":"Add a dash of Irish Cream for a rich, adult Christmas treat.",
          "description":"This hot chocolate variation is perfect for adult Christmas parties! It has a rich, luxurious taste that is sure to win over your guests. Stir in 1 tbsp (15 mL) of Irish Cream into each persons mug of hot chocolate just before drinking. Avoid adding the Irish Cream to the hot chocolate while it is still on the heat, as this can diminish some of the flavour."
        },
        {
          "headline":"Stir in 2 drops of peppermint essence to give it a minty taste.",
          "description":"Peppermint is a popular and timeless Christmas flavour. Stir 2 drops of peppermint essence into each mug of hot chocolate to give it a delicious festive taste. If you want a stronger peppermint flavour, simply add an extra drop of peppermint essence. Instead of using peppermint essence, you can place a candy cane into your mug of hot chocolate to give a delicious, sweet mint flavour."
        },
        {
          "headline":"Mix ¼ tsp (3.75 mL) of vanilla extract into your cup for a luxurious taste.",
          "description":"The smooth, rich taste of vanilla is a wonderful Christmas addition to your hot chocolate. Measure the vanilla essence into your mug and then stir it until you can no longer see it sitting on the top of the hot chocolate. If you don’t have any vanilla extract, use vanilla essence instead."
        },
        {
          "headline":"Add maple syrup and spices to make a gingerbread hot chocolate.",
          "description":"This delicious hot chocolate will taste and smell like freshly cooked gingerbread. To transform your hot chocolate, simply add 1 tablespoon (15 mL) of maple syrup, ¼ tsp (0.6 grams) of cinnamon, ¼ tsp (0.5 grams) of ginger, and ¼ tsp (0.5 grams) of allspice into your mug of hot chocolate and stir it thoroughly to disperse the spices. For best results use pure maple syrup instead of maple flavouring."
        },
        {
          "headline":"Skip the cocoa powder to make a white hot chocolate.",
          "description":"This hot chocolate is sometimes called a snow chocolate because of its creamy, white appearance. To make this simple variation of hot chocolate, simply leave out the cocoa and add 2 ounces (57 g) of chopped up white chocolate per mug. To add extra flavour to the drink add a ¼ tsp (3.8 mL) of vanilla extract and 1/16 tsp (0.15 grams) of cinnamon to each mug."
        },
        {
          "headline":"Add a dash of cinnamon and whipped cream for a fluffy spiced drink.",
          "description":"This is a fun way to decorate your hot chocolate. Simply add as much whipped cream onto your hot chocolate as you desire and then sprinkle ¼ tsp (0.6 grams) of cinnamon over the cream. These hot chocolates are sometimes called snowman hot chocolates because of their fluffy white tops. If you want the cinnamon taste integrated through the entire drink, mix it into the hot chocolate before you add the cream."
        },
        {
          "headline":"Put a few fresh blackberries on top of your drink for a black forest treat.",
          "description":"The tart flavour of blackberries are a yummy way to counteract the sweet taste of the hot chocolate. Float 2 or 3 fresh blackberries on top of each mug of hot chocolate and then drizzle a little blackberry sauce over the top, if desired. To add extra decoration to this drink, float a few mini marshmallows on top of the hot chocolate."
        }
      ]
    }
  ],
  "text":" Making a Traditional Hot Chocolate Base Mix the cocoa powder and sugar in a large saucepan. Measure 1/3 cup (68 grams) of sugar and 1/3 cup (33 grams) of unsweetened cocoa powder into your saucepan. Use a spoon to stir the ingredients together until they are completely blended. If you notice any lumps in the mixture, use the back of your spoon to squish them. This ensures that your hot chocolate has a smooth consistency. Both raw sugar and white sugar work well for this recipe. Stir in 1.5 cups (350 mL) of milk into the saucepan over a medium heat. Measure the milk into the saucepan with the cocoa powder and sugar. Use a spoon or a whisk to mix all the ingredients until they are fully combined and there are no lumps. If the mixture starts to boil, turn down the heat. Mix in an extra 3.5 cups (830 mL) of cream or milk. Cream helps to create a thicker, richer tasting hot chocolate, whereas milk will give a lighter, more traditional taste. Measure your chosen liquid into the saucepan and then gently stir it to integrate it into the rest of the hot chocolate mixture. Use a ratio of ½ cream and ½ milk if you want a moderately creamy hot chocolate. Keep it on the heat until it reaches your desired temperature. Continue to stir the hot chocolate mixture while it is on the heat. Use a spoon to taste the hot chocolate to check that it is the right temperature. Leave it on the heat until it reaches a pleasant temperature. If the hot chocolate is too hot, simply take it off the heat and leave it to cool for a few minutes before drinking it. Creating Different Flavours Add a dash of Irish Cream for a rich, adult Christmas treat. This hot chocolate variation is perfect for adult Christmas parties! It has a rich, luxurious taste that is sure to win over your guests. Stir in 1 tbsp (15 mL) of Irish Cream into each persons mug of hot chocolate just before drinking. Avoid adding the Irish Cream to the hot chocolate while it is still on the heat, as this can diminish some of the flavour. Stir in 2 drops of peppermint essence to give it a minty taste. Peppermint is a popular and timeless Christmas flavour. Stir 2 drops of peppermint essence into each mug of hot chocolate to give it a delicious festive taste. If you want a stronger peppermint flavour, simply add an extra drop of peppermint essence. Instead of using peppermint essence, you can place a candy cane into your mug of hot chocolate to give a delicious, sweet mint flavour. Mix ¼ tsp (3.75 mL) of vanilla extract into your cup for a luxurious taste. The smooth, rich taste of vanilla is a wonderful Christmas addition to your hot chocolate. Measure the vanilla essence into your mug and then stir it until you can no longer see it sitting on the top of the hot chocolate. If you don’t have any vanilla extract, use vanilla essence instead. Add maple syrup and spices to make a gingerbread hot chocolate. This delicious hot chocolate will taste and smell like freshly cooked gingerbread. To transform your hot chocolate, simply add 1 tablespoon (15 mL) of maple syrup, ¼ tsp (0.6 grams) of cinnamon, ¼ tsp (0.5 grams) of ginger, and ¼ tsp (0.5 grams) of allspice into your mug of hot chocolate and stir it thoroughly to disperse the spices. For best results use pure maple syrup instead of maple flavouring. Skip the cocoa powder to make a white hot chocolate. This hot chocolate is sometimes called a snow chocolate because of its creamy, white appearance. To make this simple variation of hot chocolate, simply leave out the cocoa and add 2 ounces (57 g) of chopped up white chocolate per mug. To add extra flavour to the drink add a ¼ tsp (3.8 mL) of vanilla extract and 1/16 tsp (0.15 grams) of cinnamon to each mug. Add a dash of cinnamon and whipped cream for a fluffy spiced drink. This is a fun way to decorate your hot chocolate. Simply add as much whipped cream onto your hot chocolate as you desire and then sprinkle ¼ tsp (0.6 grams) of cinnamon over the cream. These hot chocolates are sometimes called snowman hot chocolates because of their fluffy white tops. If you want the cinnamon taste integrated through the entire drink, mix it into the hot chocolate before you add the cream. Put a few fresh blackberries on top of your drink for a black forest treat. The tart flavour of blackberries are a yummy way to counteract the sweet taste of the hot chocolate. Float 2 or 3 fresh blackberries on top of each mug of hot chocolate and then drizzle a little blackberry sauce over the top, if desired. To add extra decoration to this drink, float a few mini marshmallows on top of the hot chocolate.",
  "sentences":[
    " Making a Traditional Hot Chocolate Base Mix the cocoa powder and sugar in a large saucepan.",
    "Measure 1/3 cup (68 grams) of sugar and 1/3 cup (33 grams) of unsweetened cocoa powder into your saucepan.",
    "Use a spoon to stir the ingredients together until they are completely blended.",
    "If you notice any lumps in the mixture, use the back of your spoon to squish them.",
    "This ensures that your hot chocolate has a smooth consistency.",
    "Both raw sugar and white sugar work well for this recipe.",
    "Stir in 1.5 cups (350 mL) of milk into the saucepan over a medium heat.",
    "Measure the milk into the saucepan with the cocoa powder and sugar.",
    "Use a spoon or a whisk to mix all the ingredients until they are fully combined and there are no lumps.",
    "If the mixture starts to boil, turn down the heat.",
    "Mix in an extra 3.5 cups (830 mL) of cream or milk.",
    "Cream helps to create a thicker, richer tasting hot chocolate, whereas milk will give a lighter, more traditional taste.",
    "Measure your chosen liquid into the saucepan and then gently stir it to integrate it into the rest of the hot chocolate mixture.",
    "Use a ratio of ½ cream and ½ milk if you want a moderately creamy hot chocolate.",
    "Keep it on the heat until it reaches your desired temperature.",
    "Continue to stir the hot chocolate mixture while it is on the heat.",
    "Use a spoon to taste the hot chocolate to check that it is the right temperature.",
    "Leave it on the heat until it reaches a pleasant temperature.",
    "If the hot chocolate is too hot, simply take it off the heat and leave it to cool for a few minutes before drinking it.",
    "Creating Different Flavours Add a dash of Irish Cream for a rich, adult Christmas treat.",
    "This hot chocolate variation is perfect for adult Christmas parties!",
    "It has a rich, luxurious taste that is sure to win over your guests.",
    "Stir in 1 tbsp (15 mL) of Irish Cream into each persons mug of hot chocolate just before drinking.",
    "Avoid adding the Irish Cream to the hot chocolate while it is still on the heat, as this can diminish some of the flavour.",
    "Stir in 2 drops of peppermint essence to give it a minty taste.",
    "Peppermint is a popular and timeless Christmas flavour.",
    "Stir 2 drops of peppermint essence into each mug of hot chocolate to give it a delicious festive taste.",
    "If you want a stronger peppermint flavour, simply add an extra drop of peppermint essence.",
    "Instead of using peppermint essence, you can place a candy cane into your mug of hot chocolate to give a delicious, sweet mint flavour.",
    "Mix ¼ tsp (3.75 mL) of vanilla extract into your cup for a luxurious taste.",
    "The smooth, rich taste of vanilla is a wonderful Christmas addition to your hot chocolate.",
    "Measure the vanilla essence into your mug and then stir it until you can no longer see it sitting on the top of the hot chocolate.",
    "If you don’t have any vanilla extract, use vanilla essence instead.",
    "Add maple syrup and spices to make a gingerbread hot chocolate.",
    "This delicious hot chocolate will taste and smell like freshly cooked gingerbread.",
    "To transform your hot chocolate, simply add 1 tablespoon (15 mL) of maple syrup, ¼ tsp (0.6 grams) of cinnamon, ¼ tsp (0.5 grams) of ginger, and ¼ tsp (0.5 grams) of allspice into your mug of hot chocolate and stir it thoroughly to disperse the spices.",
    "For best results use pure maple syrup instead of maple flavouring.",
    "Skip the cocoa powder to make a white hot chocolate.",
    "This hot chocolate is sometimes called a snow chocolate because of its creamy, white appearance.",
    "To make this simple variation of hot chocolate, simply leave out the cocoa and add 2 ounces (57 g) of chopped up white chocolate per mug.",
    "To add extra flavour to the drink add a ¼ tsp (3.8 mL) of vanilla extract and 1/16 tsp (0.15 grams) of cinnamon to each mug.",
    "Add a dash of cinnamon and whipped cream for a fluffy spiced drink.",
    "This is a fun way to decorate your hot chocolate.",
    "Simply add as much whipped cream onto your hot chocolate as you desire and then sprinkle ¼ tsp (0.6 grams) of cinnamon over the cream.",
    "These hot chocolates are sometimes called snowman hot chocolates because of their fluffy white tops.",
    "If you want the cinnamon taste integrated through the entire drink, mix it into the hot chocolate before you add the cream.",
    "Put a few fresh blackberries on top of your drink for a black forest treat.",
    "The tart flavour of blackberries are a yummy way to counteract the sweet taste of the hot chocolate.",
    "Float 2 or 3 fresh blackberries on top of each mug of hot chocolate and then drizzle a little blackberry sauce over the top, if desired.",
    "To add extra decoration to this drink, float a few mini marshmallows on top of the hot chocolate."
  ],
  "tyn_section":[
    "Saucepan",
    "Spoon",
    "Measuring cups"
  ],
  "tyn_model":[
    "hot chocolate",
    "milk",
    "cream",
    "chocolate",
    "cinnamon",
    "sugar",
    "saucepan",
    "spoon",
    "cocoa powder",
    "irish cream",
    "vanilla extract",
    "maple syrup",
    "blackberries",
    "vanilla essence",
    "whipped cream",
    "hot chocolate base",
    "large saucepan",
    "unsweetened cocoa powder",
    "white sugar",
    "whisk",
    "candy cane",
    "vanilla",
    "spices",
    "ginger",
    "allspice",
    "cocoa",
    "white chocolate",
    "blackberry sauce",
    "marshmallows"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.0689655172,
    "f1":0.125,
    "avg_pos":0.2068965517
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.1034482759,
    "f1":0.1791044776
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.1034482759,
    "f1":0.1791044776
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.0689655172,
    "f1":0.125
  }
}