{
  "title":"How to Make a Gift Bow",
  "url":"https://www.wikihow.com/Make-a-Gift-Bow",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects",
    "Bow Projects"
  ],
  "methods":[
    {
      "name":"Classic gift bow",
      "steps":[
        {
          "headline":"Cut a length of ribbon.",
          "description":"For a large ribbon, use a long length of wide ribbon. For a small ribbon, use a shorter length or narrow ribbon."
        },
        {
          "headline":"Spread the length of ribbon on a flat work surface.",
          "description":""
        },
        {
          "headline":"Fold the ribbon.",
          "description":"Fold it to form two loops at each side. Bring these two loops together to form one loop in between the two side loops."
        },
        {
          "headline":"Cross the top left loop over the top right loop.",
          "description":""
        },
        {
          "headline":"Fold the left loop behind the right loop.",
          "description":"Then pull it through the bottom loop."
        },
        {
          "headline":"Pull the top two loops together tightly.",
          "description":"This will form a knot at the center of the bow."
        },
        {
          "headline":"Trim the ends of the ribbon to neaten.",
          "description":"Cut either a diagonal or a V-shape to prevent fraying."
        },
        {
          "headline":"Attach to the gift.",
          "description":"Either loop it through ribbon attached to the gift or tape in place using doubled-up or double-sided tape."
        }
      ]
    },
    {
      "name":"Top bow for a gift box (square or rectangle)",
      "steps":[
        {
          "headline":"Cut a long length of wide ribbon.",
          "description":"To get the desired ribbon length, wrap the ribbon loosely around the length of the box, then its width. This is the basic length, then add another 60cm (24 inches) to the length, for making the bow with. (This additional measurement may need adjusting for a much larger box.) Choose a color of ribbon to suit the gift box."
        },
        {
          "headline":"Lay the ribbon across the top of the box, facing vertically.",
          "description":"Wrap the ribbon around the length of the box first, and hold it at the base of the box."
        },
        {
          "headline":"Check that the wrong side of the ribbon is facing the box.",
          "description":"Twist the ribbons around each other by 90 degrees to pull each end of the ribbon horizontally."
        },
        {
          "headline":"Fix the ribbon if needed.",
          "description":"Twist the ends to keep the wrong side of the ribbon facing the box, then pull the ends up and over the center of the box. Pull tightly to keep the ribbon firm."
        },
        {
          "headline":"Make loops from each of the ribbon ends.",
          "description":"Tie a bow by folding the right loop over the left and folding it underneath the left loop. Pull towards you, then pull tightly."
        },
        {
          "headline":"Bring the left loop over the right loop, then slide the left loop through the hole under the right loop.",
          "description":"This forms the knot. Pull tightly."
        },
        {
          "headline":"Trim the ends of the ribbon to neaten.",
          "description":"Cut either a diagonal or a V-shape to prevent fraying."
        },
        {
          "headline":"Done.",
          "description":"the gift now has a complete gift bow made from ribbon."
        }
      ]
    },
    {
      "name":"Side bow for a rectangular gift box",
      "steps":[
        {
          "headline":"Purchase a suitable rectangular gift box with a lid.",
          "description":"Place the gift inside, wrapped as appropriate. Place the lid on."
        },
        {
          "headline":"Cut a long length of wide ribbon.",
          "description":"See the measurement approach in Method 2 above. Choose a color of ribbon that suits the gift box."
        },
        {
          "headline":"Fold the ribbon so that one side of the ribbon is 25 percent shorter than the other side.",
          "description":""
        },
        {
          "headline":"Lay the fold on the center of the gift box.",
          "description":"Hold in place."
        },
        {
          "headline":"Wrap the two ends of the ribbon around the gift box and back up to the top.",
          "description":"Keep them apart from each other."
        },
        {
          "headline":"After bringing the lengths back up to the top of the box, thread them through the fold made earlier.",
          "description":"Pull tight."
        },
        {
          "headline":"Pick up the two ends.",
          "description":"Take the longer end and bring it right around the side of the box, underneath and back up to meet the shorter end."
        },
        {
          "headline":"Tie the two ends together in a box on the short side of the box.",
          "description":"Done."
        }
      ]
    },
    {
      "name":"Flat bow",
      "steps":[
        {
          "headline":"Cut the ribbon.",
          "description":"Cut it twice the length of the desired finished bow length."
        },
        {
          "headline":"Lay the ribbon out on a flat surface.",
          "description":""
        },
        {
          "headline":"Fold the ribbon into a loop.",
          "description":"Glue the join of both ends together."
        },
        {
          "headline":"Flatten the ribbon in the center.",
          "description":"Flatten it over the join, then glue the flattened section in place."
        },
        {
          "headline":"Cut a small piece of ribbon from the same ribbon.",
          "description":"Wrap it around the center of the ribbon over the flattened section. Glue the join of this fold at the back."
        },
        {
          "headline":"Done.",
          "description":"The flat bow is neat and professional looking. It looks ideal attached on its own to a gift or added to a length of already wrapped ribbon."
        }
      ]
    }
  ],
  "text":" Classic gift bow Cut a length of ribbon. For a large ribbon, use a long length of wide ribbon. For a small ribbon, use a shorter length or narrow ribbon. Spread the length of ribbon on a flat work surface.  Fold the ribbon. Fold it to form two loops at each side. Bring these two loops together to form one loop in between the two side loops. Cross the top left loop over the top right loop.  Fold the left loop behind the right loop. Then pull it through the bottom loop. Pull the top two loops together tightly. This will form a knot at the center of the bow. Trim the ends of the ribbon to neaten. Cut either a diagonal or a V-shape to prevent fraying. Attach to the gift. Either loop it through ribbon attached to the gift or tape in place using doubled-up or double-sided tape. Top bow for a gift box (square or rectangle) Cut a long length of wide ribbon. To get the desired ribbon length, wrap the ribbon loosely around the length of the box, then its width. This is the basic length, then add another 60cm (24 inches) to the length, for making the bow with. (This additional measurement may need adjusting for a much larger box.) Choose a color of ribbon to suit the gift box. Lay the ribbon across the top of the box, facing vertically. Wrap the ribbon around the length of the box first, and hold it at the base of the box. Check that the wrong side of the ribbon is facing the box. Twist the ribbons around each other by 90 degrees to pull each end of the ribbon horizontally. Fix the ribbon if needed. Twist the ends to keep the wrong side of the ribbon facing the box, then pull the ends up and over the center of the box. Pull tightly to keep the ribbon firm. Make loops from each of the ribbon ends. Tie a bow by folding the right loop over the left and folding it underneath the left loop. Pull towards you, then pull tightly. Bring the left loop over the right loop, then slide the left loop through the hole under the right loop. This forms the knot. Pull tightly. Trim the ends of the ribbon to neaten. Cut either a diagonal or a V-shape to prevent fraying. Done. the gift now has a complete gift bow made from ribbon. Side bow for a rectangular gift box Purchase a suitable rectangular gift box with a lid. Place the gift inside, wrapped as appropriate. Place the lid on. Cut a long length of wide ribbon. See the measurement approach in Method 2 above. Choose a color of ribbon that suits the gift box. Fold the ribbon so that one side of the ribbon is 25 percent shorter than the other side.  Lay the fold on the center of the gift box. Hold in place. Wrap the two ends of the ribbon around the gift box and back up to the top. Keep them apart from each other. After bringing the lengths back up to the top of the box, thread them through the fold made earlier. Pull tight. Pick up the two ends. Take the longer end and bring it right around the side of the box, underneath and back up to meet the shorter end. Tie the two ends together in a box on the short side of the box. Done. Flat bow Cut the ribbon. Cut it twice the length of the desired finished bow length. Lay the ribbon out on a flat surface.  Fold the ribbon into a loop. Glue the join of both ends together. Flatten the ribbon in the center. Flatten it over the join, then glue the flattened section in place. Cut a small piece of ribbon from the same ribbon. Wrap it around the center of the ribbon over the flattened section. Glue the join of this fold at the back. Done. The flat bow is neat and professional looking. It looks ideal attached on its own to a gift or added to a length of already wrapped ribbon.",
  "sentences":[
    " Classic gift bow Cut a length of ribbon.",
    "For a large ribbon, use a long length of wide ribbon.",
    "For a small ribbon, use a shorter length or narrow ribbon.",
    "Spread the length of ribbon on a flat work surface.",
    "Fold the ribbon.",
    "Fold it to form two loops at each side.",
    "Bring these two loops together to form one loop in between the two side loops.",
    "Cross the top left loop over the top right loop.",
    "Fold the left loop behind the right loop.",
    "Then pull it through the bottom loop.",
    "Pull the top two loops together tightly.",
    "This will form a knot at the center of the bow.",
    "Trim the ends of the ribbon to neaten.",
    "Cut either a diagonal or a V-shape to prevent fraying.",
    "Attach to the gift.",
    "Either loop it through ribbon attached to the gift or tape in place using doubled-up or double-sided tape.",
    "Top bow for a gift box (square or rectangle) Cut a long length of wide ribbon.",
    "To get the desired ribbon length, wrap the ribbon loosely around the length of the box, then its width.",
    "This is the basic length, then add another 60cm (24 inches) to the length, for making the bow with.",
    "(This additional measurement may need adjusting for a much larger box.)",
    "Choose a color of ribbon to suit the gift box.",
    "Lay the ribbon across the top of the box, facing vertically.",
    "Wrap the ribbon around the length of the box first, and hold it at the base of the box.",
    "Check that the wrong side of the ribbon is facing the box.",
    "Twist the ribbons around each other by 90 degrees to pull each end of the ribbon horizontally.",
    "Fix the ribbon if needed.",
    "Twist the ends to keep the wrong side of the ribbon facing the box, then pull the ends up and over the center of the box.",
    "Pull tightly to keep the ribbon firm.",
    "Make loops from each of the ribbon ends.",
    "Tie a bow by folding the right loop over the left and folding it underneath the left loop.",
    "Pull towards you, then pull tightly.",
    "Bring the left loop over the right loop, then slide the left loop through the hole under the right loop.",
    "This forms the knot.",
    "Pull tightly.",
    "Trim the ends of the ribbon to neaten.",
    "Cut either a diagonal or a V-shape to prevent fraying.",
    "Done.",
    "the gift now has a complete gift bow made from ribbon.",
    "Side bow for a rectangular gift box Purchase a suitable rectangular gift box with a lid.",
    "Place the gift inside, wrapped as appropriate.",
    "Place the lid on.",
    "Cut a long length of wide ribbon.",
    "See the measurement approach in Method 2 above.",
    "Choose a color of ribbon that suits the gift box.",
    "Fold the ribbon so that one side of the ribbon is 25 percent shorter than the other side.",
    "Lay the fold on the center of the gift box.",
    "Hold in place.",
    "Wrap the two ends of the ribbon around the gift box and back up to the top.",
    "Keep them apart from each other.",
    "After bringing the lengths back up to the top of the box, thread them through the fold made earlier.",
    "Pull tight.",
    "Pick up the two ends.",
    "Take the longer end and bring it right around the side of the box, underneath and back up to meet the shorter end.",
    "Tie the two ends together in a box on the short side of the box.",
    "Done.",
    "Flat bow Cut the ribbon.",
    "Cut it twice the length of the desired finished bow length.",
    "Lay the ribbon out on a flat surface.",
    "Fold the ribbon into a loop.",
    "Glue the join of both ends together.",
    "Flatten the ribbon in the center.",
    "Flatten it over the join, then glue the flattened section in place.",
    "Cut a small piece of ribbon from the same ribbon.",
    "Wrap it around the center of the ribbon over the flattened section.",
    "Glue the join of this fold at the back.",
    "Done.",
    "The flat bow is neat and professional looking.",
    "It looks ideal attached on its own to a gift or added to a length of already wrapped ribbon."
  ],
  "tyn_section":[
    "Ribbon",
    "Tape for attaching",
    "Scissors (suitable for fabric)",
    "Glue (where appropriate)",
    "Gift box (if relevant)"
  ],
  "tyn_model":[
    "ribbon",
    "tape",
    "ribbons",
    "thread"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.25,
    "f1":0.2222222222,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.2,
    "p":0.25,
    "f1":0.2222222222
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.5,
    "f1":0.4444444444
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2,
    "p":0.25,
    "f1":0.2222222222
  }
}