{
  "title":"How to Play Harvest Moon Tree of Tranquility",
  "url":"https://www.wikihow.com/Play-Harvest-Moon-Tree-of-Tranquility",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Harvest Moon Series"
  ],
  "steps":[
    {
      "headline":"When you start, be sure to name your character something you'll want to be called throughout the whole game.",
      "description":"You can also choose one of the default names."
    },
    {
      "headline":"Choose your house depending on what you'll be doing mostly.",
      "description":"The main idea is to farm, but you don't have to be a farmer. You can be a rancher, a nurse, a fisherman, or other options available for you. Some places you can work part time and watch a cutscene, and the farming is where you use the remote to work.You will be able to choose a plot of land for your house, and the location works with what you want to do. All plots are good fro raising animals."
    },
    {
      "headline":"When you farm, pick all of the weeds out of your garden.",
      "description":"When you have X's over your eyes, head to the hot spring. You can get to it when you go to caramel falls. Near the monkey are some slanted rocks. Climb up them to get to the hot spring. Bathe in it to restore your energy. You can only use it once a day. Once all your weeds are picked, plow six spots in a row. You can plant your seeds if you face the way the row is."
    },
    {
      "headline":"Water your plants everyday, unless it rains or storms.",
      "description":"After you water them, you can use the hot springs again if your stamina is low."
    },
    {
      "headline":"After your done working on your farm for the day, you can go talk to people.",
      "description":"Some villagers you can marry. Pick your favorite out of the little booklet from the game case. If the person you like is not in your town:"
    },
    {
      "headline":"Now people will start moving in.",
      "description":"Once you find the one your want to marry, talk to them everyday, part-time at the place they work at, give them stuff, and talk to them every time you see them. They will warm up to you, and confess their feelings at six hears. Once they are up to eight hearts, the Mayor will tell you about the Blue Bird, and the blue feather. If you see the blue bird around your house, go to Carmel falls. You'll find the feather and you can ask your boyfriend/girlfriend to marry you. If they have a quest for you, and you haven't finished that, you will need to finish that first before proposing. After a whole year of being married, you'll have a kid if your house is at level 5."
    },
    {
      "headline":"Be creative and make sure to save your money.",
      "description":"You will need money to buy seeds, animals, and other things. You can earn money by working part-time, foraging, farming, mining, and fishing. If you make friends with the animals, once you raise two and four hearts with them, you'll receive gifts. You can also receive gifts from the bachelors and bachelorettes once you raise enough hearts."
    }
  ],
  "text":" When you start, be sure to name your character something you'll want to be called throughout the whole game. You can also choose one of the default names. Choose your house depending on what you'll be doing mostly. The main idea is to farm, but you don't have to be a farmer. You can be a rancher, a nurse, a fisherman, or other options available for you. Some places you can work part time and watch a cutscene, and the farming is where you use the remote to work.You will be able to choose a plot of land for your house, and the location works with what you want to do. All plots are good fro raising animals. When you farm, pick all of the weeds out of your garden. When you have X's over your eyes, head to the hot spring. You can get to it when you go to caramel falls. Near the monkey are some slanted rocks. Climb up them to get to the hot spring. Bathe in it to restore your energy. You can only use it once a day. Once all your weeds are picked, plow six spots in a row. You can plant your seeds if you face the way the row is. Water your plants everyday, unless it rains or storms. After you water them, you can use the hot springs again if your stamina is low. After your done working on your farm for the day, you can go talk to people. Some villagers you can marry. Pick your favorite out of the little booklet from the game case. If the person you like is not in your town: Now people will start moving in. Once you find the one your want to marry, talk to them everyday, part-time at the place they work at, give them stuff, and talk to them every time you see them. They will warm up to you, and confess their feelings at six hears. Once they are up to eight hearts, the Mayor will tell you about the Blue Bird, and the blue feather. If you see the blue bird around your house, go to Carmel falls. You'll find the feather and you can ask your boyfriend/girlfriend to marry you. If they have a quest for you, and you haven't finished that, you will need to finish that first before proposing. After a whole year of being married, you'll have a kid if your house is at level 5. Be creative and make sure to save your money. You will need money to buy seeds, animals, and other things. You can earn money by working part-time, foraging, farming, mining, and fishing. If you make friends with the animals, once you raise two and four hearts with them, you'll receive gifts. You can also receive gifts from the bachelors and bachelorettes once you raise enough hearts.",
  "sentences":[
    " When you start, be sure to name your character something you'll want to be called throughout the whole game.",
    "You can also choose one of the default names.",
    "Choose your house depending on what you'll be doing mostly.",
    "The main idea is to farm, but you don't have to be a farmer.",
    "You can be a rancher, a nurse, a fisherman, or other options available for you.",
    "Some places you can work part time and watch a cutscene, and the farming is where you use the remote to work.You will be able to choose a plot of land for your house, and the location works with what you want to do.",
    "All plots are good fro raising animals.",
    "When you farm, pick all of the weeds out of your garden.",
    "When you have X's over your eyes, head to the hot spring.",
    "You can get to it when you go to caramel falls.",
    "Near the monkey are some slanted rocks.",
    "Climb up them to get to the hot spring.",
    "Bathe in it to restore your energy.",
    "You can only use it once a day.",
    "Once all your weeds are picked, plow six spots in a row.",
    "You can plant your seeds if you face the way the row is.",
    "Water your plants everyday, unless it rains or storms.",
    "After you water them, you can use the hot springs again if your stamina is low.",
    "After your done working on your farm for the day, you can go talk to people.",
    "Some villagers you can marry.",
    "Pick your favorite out of the little booklet from the game case.",
    "If the person you like is not in your town: Now people will start moving in.",
    "Once you find the one your want to marry, talk to them everyday, part-time at the place they work at, give them stuff, and talk to them every time you see them.",
    "They will warm up to you, and confess their feelings at six hears.",
    "Once they are up to eight hearts, the Mayor will tell you about the Blue Bird, and the blue feather.",
    "If you see the blue bird around your house, go to Carmel falls.",
    "You'll find the feather and you can ask your boyfriend/girlfriend to marry you.",
    "If they have a quest for you, and you haven't finished that, you will need to finish that first before proposing.",
    "After a whole year of being married, you'll have a kid if your house is at level 5.",
    "Be creative and make sure to save your money.",
    "You will need money to buy seeds, animals, and other things.",
    "You can earn money by working part-time, foraging, farming, mining, and fishing.",
    "If you make friends with the animals, once you raise two and four hearts with them, you'll receive gifts.",
    "You can also receive gifts from the bachelors and bachelorettes once you raise enough hearts."
  ],
  "tyn_section":[
    "A wii.",
    "A Harvest Moon game.",
    "A wiimote",
    "A nunchuck",
    "A wii classic controller",
    "Time to play",
    "Ability to sit still"
  ],
  "tyn_model":[
    "hot spring",
    "water",
    "animals",
    "fisherman",
    "remote",
    "rocks",
    "hot springs",
    "blue bird",
    "feather",
    "seeds",
    "fishing"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}