{
  "title":"How to Make a Tomato Cage",
  "url":"https://www.wikihow.com/Make-a-Tomato-Cage",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Vegetables",
    "Growing Tomatoes"
  ],
  "methods":[
    {
      "name":"Making a Tomato Cage Out of Concrete Reinforcing Wire",
      "steps":[
        {
          "headline":"Buy a roll of concrete reinforcing wire.",
          "description":"Pick up a roll of standard concrete reinforcing wire. This is type of wire mesh typically used for construction projects, though it also works marvelously for heavy-duty gardening projects. Concrete wire handles similarly to chicken wire, but is much sturdier and longer lasting. You can find concrete reinforcing wire at most home improvement stores and garden centers. The price of concrete wire will vary, but you might be better off shelling out a little more for more durable wire. You will make up the cost by not having to replace the cages as often."
        },
        {
          "headline":"Cut a length a section large enough to form the body of the cage.",
          "description":"Use a pair of wire cutters to cut roughly 5 feet (1.5 m) of wire from the roll (about 12 squares in length). Make sure you wear gloves, eye protection and clothing with sleeves while cutting the metal wire. The edges of the wire spokes will be very sharp after you cut them, and it can be easy to slice yourself while molding the body of the cage if you’re not careful. Take proper safety precautions when working around sharp metal edges. Place the wire roll on the ground and hold it far away from your face while cutting. Store extra concrete wire for patch-ups or other future projects."
        },
        {
          "headline":"Curve the wire into a cylinder and connect the ends.",
          "description":"Using your hands, simply curve the length of wire until both ends come together. This should be easy to do, as the wire comes in a roll and will want to curve in on itself naturally. Bend the spokes at the cut ends and hook them together to connect them. Your tomato cage will be approximately 2 feet (0.61 m) in diameter, making it spacious enough to accommodate most larger tomato plants. Give the hooked ends an extra twist to make sure they stay secured. Make sure any exposed cut spokes are snipped away or covered. You can use zip ties or another type of fastener to ensure that your cages will not separate over time."
        },
        {
          "headline":"Cut the lower ring from the cage and insert it into the ground.",
          "description":"Now that the body of the cage has been assembled, stand it upright and cut away the horizontal ring on the lower edge of the cage. This will leave you with an unobstructed section of vertical spikes at the bottom of the cage that you’ll force into the ground to stabilize it. Insert the spikes into the soil around the tomato plant about 5 inches (13 cm) deep. You’re done! The open squares in the concrete wire will be small enough to contain overgrown foliage, but large enough to allow you to water and pick ripe tomatoes. These cages are tough, lightweight and easy to remove and store."
        }
      ]
    },
    {
      "name":"Making a Tomato Cage Out of Metal Livestock Paneling",
      "steps":[
        {
          "headline":"Buy a metal livestock panel.",
          "description":"Find a store that sells farm and garden supplies and ask an associate about buying metal livestock paneling. Livestock paneling is a kind of thick, heavy metal grating designed to be rugged enough to keep smaller animals from getting into or escaping confined areas. It usually comes in sections that are about 16 feet (4.9 m) long and 4 feet (1.2 m)  wide. Livestock paneling will be slightly more expensive than concrete wire or wood for making tomato cages. However, they will last considerably longer and will be in no danger of being uprooted or damaged by animals or the elements due to the paneling’s tough construction."
        },
        {
          "headline":"Cut the panel into 4 sections.",
          "description":"Use a sturdy pair of bolt cutters to snip the paneling into 4 equally sized sections to serve as the tomato cage. Measure a section to 6 grating squares widthwise and cut away the rest. Do the same for the length of the panel, counting about 9 squares down from the end and cutting all the way across. You should be left with a rectangular section of paneling 6 squares wide and 9 squares high. Use gloves and eye protection when handling the bolt cutters. The severed edges of the metal will be sharp. Work in a flat, open space outside somewhere where the metal trimmings won’t get lost underfoot. Safely dispose of the unused trimmings when you’re finished."
        },
        {
          "headline":"Plant the 4 pieces of the cage in the ground.",
          "description":"Cut away the horizontal bars at the bottom of the panels to create spikes that you can stick in the ground. Take a moment to make sure that each spike is straight. Stand the cage pieces up lengthwise, spike-sides down, and push each section down forcefully into the soil around your tomato plants. The cage will protect and contain the growth of the plants, allowing the other sides to remain open for easy watering, mulching and picking. The cages will be slightly heavy, so the spikes should be inserted 5 inches (13 cm) to 6 inches (15 cm) into the ground to help it hold steady. If you’re using cages to support multiple tomato plants, position them so that the cage corners are facing each other. This will keep the tomato plants from growing unchecked into one another."
        }
      ]
    },
    {
      "name":"Making a Basic Wooden Tomato Cage",
      "steps":[
        {
          "headline":"Buy the lumber for the cage.",
          "description":"Visit a hardware or home and garden store to find the raw lumber required to fashion the wooden cages. For this project, you will need 2 2 by 2 by 8 feet (0.61 by 0.61 by 2.44 m) boards, along with 3 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) pieces. The wood will require a few simple cuts to form the different parts of the tomato cage. Wood is generally cheaper and easier to find than other materials like concrete wire and livestock paneling. Because it is an organic material, wood is less durable than metal. You should get plenty of use out of wooden tomato cages, but don’t expect them to last as long as cages constructed from metal wire or paneling."
        },
        {
          "headline":"Cut the supports and rungs for the cage.",
          "description":"Cut each of the 2 by 2 by 8 feet (0.61 by 0.61 by 2.44 m) boards perfectly in half. You should now have 4 1 by 2 by 4 feet (0.30 by 0.61 by 1.22 m) pieces. These will serve as the upright supports for the cage. Cut the 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) boards into 6 equal sized sections. They will act as the rungs for the upright supports. Make all the necessary cuts first. Then, all that’s left to do is nail or screw the pieces together. You will have some wood left over after cutting the 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) boards. The leftover wood can be saved for future projects or used elsewhere in your garden."
        },
        {
          "headline":"Screw the assembly together.",
          "description":"Using a nail gun or wood screws, attach 3 of the 1 by 2 feet (0.30 by 0.61 m) rungs to 2 of the 2 by 2 feet (0.61 by 0.61 m) legs to make a basic ladder construction. The rungs should be placed roughly 15 inches (38 cm) apart, starting at the top of the ladder and leaving space at the bottom for the supports to be driven into the ground. Repeat this process to craft the other side of the cage. Then, attach both ladders by securing three sections of 1x2 lumber perpendicularly to the sides. The 19.5” sections will overlap the ends of the ladder construction, including the 18” rungs you attached previously."
        },
        {
          "headline":"Place the cage over your tomato plants.",
          "description":"Position the wooden cage over a tomato plant. Press down firmly to mark where the legs are to go in the soil. Dig a small hole for each leg, about 4 inches (10 cm) deep. Set the legs of the cage down into the holes and fill in the space around them with loose soil. This process will result in a single tomato cage. If you’re planning on making multiple cages, take an assembly-line approach. Do all of your measuring and marking at once, followed by all your cutting, then screwing or nailing. You can also drive the cage into the ground using a hammer or mallet, being careful not to damage the structure. It may help to sharpen the legs or cut them into points first."
        }
      ]
    }
  ],
  "text":" Making a Tomato Cage Out of Concrete Reinforcing Wire Buy a roll of concrete reinforcing wire. Pick up a roll of standard concrete reinforcing wire. This is type of wire mesh typically used for construction projects, though it also works marvelously for heavy-duty gardening projects. Concrete wire handles similarly to chicken wire, but is much sturdier and longer lasting. You can find concrete reinforcing wire at most home improvement stores and garden centers. The price of concrete wire will vary, but you might be better off shelling out a little more for more durable wire. You will make up the cost by not having to replace the cages as often. Cut a length a section large enough to form the body of the cage. Use a pair of wire cutters to cut roughly 5 feet (1.5 m) of wire from the roll (about 12 squares in length). Make sure you wear gloves, eye protection and clothing with sleeves while cutting the metal wire. The edges of the wire spokes will be very sharp after you cut them, and it can be easy to slice yourself while molding the body of the cage if you’re not careful. Take proper safety precautions when working around sharp metal edges. Place the wire roll on the ground and hold it far away from your face while cutting. Store extra concrete wire for patch-ups or other future projects. Curve the wire into a cylinder and connect the ends. Using your hands, simply curve the length of wire until both ends come together. This should be easy to do, as the wire comes in a roll and will want to curve in on itself naturally. Bend the spokes at the cut ends and hook them together to connect them. Your tomato cage will be approximately 2 feet (0.61 m) in diameter, making it spacious enough to accommodate most larger tomato plants. Give the hooked ends an extra twist to make sure they stay secured. Make sure any exposed cut spokes are snipped away or covered. You can use zip ties or another type of fastener to ensure that your cages will not separate over time. Cut the lower ring from the cage and insert it into the ground. Now that the body of the cage has been assembled, stand it upright and cut away the horizontal ring on the lower edge of the cage. This will leave you with an unobstructed section of vertical spikes at the bottom of the cage that you’ll force into the ground to stabilize it. Insert the spikes into the soil around the tomato plant about 5 inches (13 cm) deep. You’re done! The open squares in the concrete wire will be small enough to contain overgrown foliage, but large enough to allow you to water and pick ripe tomatoes. These cages are tough, lightweight and easy to remove and store. Making a Tomato Cage Out of Metal Livestock Paneling Buy a metal livestock panel. Find a store that sells farm and garden supplies and ask an associate about buying metal livestock paneling. Livestock paneling is a kind of thick, heavy metal grating designed to be rugged enough to keep smaller animals from getting into or escaping confined areas. It usually comes in sections that are about 16 feet (4.9 m) long and 4 feet (1.2 m)  wide. Livestock paneling will be slightly more expensive than concrete wire or wood for making tomato cages. However, they will last considerably longer and will be in no danger of being uprooted or damaged by animals or the elements due to the paneling’s tough construction. Cut the panel into 4 sections. Use a sturdy pair of bolt cutters to snip the paneling into 4 equally sized sections to serve as the tomato cage. Measure a section to 6 grating squares widthwise and cut away the rest. Do the same for the length of the panel, counting about 9 squares down from the end and cutting all the way across. You should be left with a rectangular section of paneling 6 squares wide and 9 squares high. Use gloves and eye protection when handling the bolt cutters. The severed edges of the metal will be sharp. Work in a flat, open space outside somewhere where the metal trimmings won’t get lost underfoot. Safely dispose of the unused trimmings when you’re finished. Plant the 4 pieces of the cage in the ground. Cut away the horizontal bars at the bottom of the panels to create spikes that you can stick in the ground. Take a moment to make sure that each spike is straight. Stand the cage pieces up lengthwise, spike-sides down, and push each section down forcefully into the soil around your tomato plants. The cage will protect and contain the growth of the plants, allowing the other sides to remain open for easy watering, mulching and picking. The cages will be slightly heavy, so the spikes should be inserted 5 inches (13 cm) to 6 inches (15 cm) into the ground to help it hold steady. If you’re using cages to support multiple tomato plants, position them so that the cage corners are facing each other. This will keep the tomato plants from growing unchecked into one another. Making a Basic Wooden Tomato Cage Buy the lumber for the cage. Visit a hardware or home and garden store to find the raw lumber required to fashion the wooden cages. For this project, you will need 2 2 by 2 by 8 feet (0.61 by 0.61 by 2.44 m) boards, along with 3 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) pieces. The wood will require a few simple cuts to form the different parts of the tomato cage. Wood is generally cheaper and easier to find than other materials like concrete wire and livestock paneling. Because it is an organic material, wood is less durable than metal. You should get plenty of use out of wooden tomato cages, but don’t expect them to last as long as cages constructed from metal wire or paneling. Cut the supports and rungs for the cage. Cut each of the 2 by 2 by 8 feet (0.61 by 0.61 by 2.44 m) boards perfectly in half. You should now have 4 1 by 2 by 4 feet (0.30 by 0.61 by 1.22 m) pieces. These will serve as the upright supports for the cage. Cut the 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) boards into 6 equal sized sections. They will act as the rungs for the upright supports. Make all the necessary cuts first. Then, all that’s left to do is nail or screw the pieces together. You will have some wood left over after cutting the 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) boards. The leftover wood can be saved for future projects or used elsewhere in your garden. Screw the assembly together. Using a nail gun or wood screws, attach 3 of the 1 by 2 feet (0.30 by 0.61 m) rungs to 2 of the 2 by 2 feet (0.61 by 0.61 m) legs to make a basic ladder construction. The rungs should be placed roughly 15 inches (38 cm) apart, starting at the top of the ladder and leaving space at the bottom for the supports to be driven into the ground. Repeat this process to craft the other side of the cage. Then, attach both ladders by securing three sections of 1x2 lumber perpendicularly to the sides. The 19.5” sections will overlap the ends of the ladder construction, including the 18” rungs you attached previously. Place the cage over your tomato plants. Position the wooden cage over a tomato plant. Press down firmly to mark where the legs are to go in the soil. Dig a small hole for each leg, about 4 inches (10 cm) deep. Set the legs of the cage down into the holes and fill in the space around them with loose soil. This process will result in a single tomato cage. If you’re planning on making multiple cages, take an assembly-line approach. Do all of your measuring and marking at once, followed by all your cutting, then screwing or nailing. You can also drive the cage into the ground using a hammer or mallet, being careful not to damage the structure. It may help to sharpen the legs or cut them into points first.",
  "sentences":[
    " Making a Tomato Cage Out of Concrete Reinforcing Wire Buy a roll of concrete reinforcing wire.",
    "Pick up a roll of standard concrete reinforcing wire.",
    "This is type of wire mesh typically used for construction projects, though it also works marvelously for heavy-duty gardening projects.",
    "Concrete wire handles similarly to chicken wire, but is much sturdier and longer lasting.",
    "You can find concrete reinforcing wire at most home improvement stores and garden centers.",
    "The price of concrete wire will vary, but you might be better off shelling out a little more for more durable wire.",
    "You will make up the cost by not having to replace the cages as often.",
    "Cut a length a section large enough to form the body of the cage.",
    "Use a pair of wire cutters to cut roughly 5 feet (1.5 m) of wire from the roll (about 12 squares in length).",
    "Make sure you wear gloves, eye protection and clothing with sleeves while cutting the metal wire.",
    "The edges of the wire spokes will be very sharp after you cut them, and it can be easy to slice yourself while molding the body of the cage if you’re not careful.",
    "Take proper safety precautions when working around sharp metal edges.",
    "Place the wire roll on the ground and hold it far away from your face while cutting.",
    "Store extra concrete wire for patch-ups or other future projects.",
    "Curve the wire into a cylinder and connect the ends.",
    "Using your hands, simply curve the length of wire until both ends come together.",
    "This should be easy to do, as the wire comes in a roll and will want to curve in on itself naturally.",
    "Bend the spokes at the cut ends and hook them together to connect them.",
    "Your tomato cage will be approximately 2 feet (0.61 m) in diameter, making it spacious enough to accommodate most larger tomato plants.",
    "Give the hooked ends an extra twist to make sure they stay secured.",
    "Make sure any exposed cut spokes are snipped away or covered.",
    "You can use zip ties or another type of fastener to ensure that your cages will not separate over time.",
    "Cut the lower ring from the cage and insert it into the ground.",
    "Now that the body of the cage has been assembled, stand it upright and cut away the horizontal ring on the lower edge of the cage.",
    "This will leave you with an unobstructed section of vertical spikes at the bottom of the cage that you’ll force into the ground to stabilize it.",
    "Insert the spikes into the soil around the tomato plant about 5 inches (13 cm) deep.",
    "You’re done!",
    "The open squares in the concrete wire will be small enough to contain overgrown foliage, but large enough to allow you to water and pick ripe tomatoes.",
    "These cages are tough, lightweight and easy to remove and store.",
    "Making a Tomato Cage Out of Metal Livestock Paneling Buy a metal livestock panel.",
    "Find a store that sells farm and garden supplies and ask an associate about buying metal livestock paneling.",
    "Livestock paneling is a kind of thick, heavy metal grating designed to be rugged enough to keep smaller animals from getting into or escaping confined areas.",
    "It usually comes in sections that are about 16 feet (4.9 m) long and 4 feet (1.2 m)  wide.",
    "Livestock paneling will be slightly more expensive than concrete wire or wood for making tomato cages.",
    "However, they will last considerably longer and will be in no danger of being uprooted or damaged by animals or the elements due to the paneling’s tough construction.",
    "Cut the panel into 4 sections.",
    "Use a sturdy pair of bolt cutters to snip the paneling into 4 equally sized sections to serve as the tomato cage.",
    "Measure a section to 6 grating squares widthwise and cut away the rest.",
    "Do the same for the length of the panel, counting about 9 squares down from the end and cutting all the way across.",
    "You should be left with a rectangular section of paneling 6 squares wide and 9 squares high.",
    "Use gloves and eye protection when handling the bolt cutters.",
    "The severed edges of the metal will be sharp.",
    "Work in a flat, open space outside somewhere where the metal trimmings won’t get lost underfoot.",
    "Safely dispose of the unused trimmings when you’re finished.",
    "Plant the 4 pieces of the cage in the ground.",
    "Cut away the horizontal bars at the bottom of the panels to create spikes that you can stick in the ground.",
    "Take a moment to make sure that each spike is straight.",
    "Stand the cage pieces up lengthwise, spike-sides down, and push each section down forcefully into the soil around your tomato plants.",
    "The cage will protect and contain the growth of the plants, allowing the other sides to remain open for easy watering, mulching and picking.",
    "The cages will be slightly heavy, so the spikes should be inserted 5 inches (13 cm) to 6 inches (15 cm) into the ground to help it hold steady.",
    "If you’re using cages to support multiple tomato plants, position them so that the cage corners are facing each other.",
    "This will keep the tomato plants from growing unchecked into one another.",
    "Making a Basic Wooden Tomato Cage Buy the lumber for the cage.",
    "Visit a hardware or home and garden store to find the raw lumber required to fashion the wooden cages.",
    "For this project, you will need 2 2 by 2 by 8 feet (0.61 by 0.61 by 2.44 m) boards, along with 3 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) pieces.",
    "The wood will require a few simple cuts to form the different parts of the tomato cage.",
    "Wood is generally cheaper and easier to find than other materials like concrete wire and livestock paneling.",
    "Because it is an organic material, wood is less durable than metal.",
    "You should get plenty of use out of wooden tomato cages, but don’t expect them to last as long as cages constructed from metal wire or paneling.",
    "Cut the supports and rungs for the cage.",
    "Cut each of the 2 by 2 by 8 feet (0.61 by 0.61 by 2.44 m) boards perfectly in half.",
    "You should now have 4 1 by 2 by 4 feet (0.30 by 0.61 by 1.22 m) pieces.",
    "These will serve as the upright supports for the cage.",
    "Cut the 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) boards into 6 equal sized sections.",
    "They will act as the rungs for the upright supports.",
    "Make all the necessary cuts first.",
    "Then, all that’s left to do is nail or screw the pieces together.",
    "You will have some wood left over after cutting the 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) boards.",
    "The leftover wood can be saved for future projects or used elsewhere in your garden.",
    "Screw the assembly together.",
    "Using a nail gun or wood screws, attach 3 of the 1 by 2 feet (0.30 by 0.61 m) rungs to 2 of the 2 by 2 feet (0.61 by 0.61 m) legs to make a basic ladder construction.",
    "The rungs should be placed roughly 15 inches (38 cm) apart, starting at the top of the ladder and leaving space at the bottom for the supports to be driven into the ground.",
    "Repeat this process to craft the other side of the cage.",
    "Then, attach both ladders by securing three sections of 1x2 lumber perpendicularly to the sides.",
    "The 19.5” sections will overlap the ends of the ladder construction, including the 18” rungs you attached previously.",
    "Place the cage over your tomato plants.",
    "Position the wooden cage over a tomato plant.",
    "Press down firmly to mark where the legs are to go in the soil.",
    "Dig a small hole for each leg, about 4 inches (10 cm) deep.",
    "Set the legs of the cage down into the holes and fill in the space around them with loose soil.",
    "This process will result in a single tomato cage.",
    "If you’re planning on making multiple cages, take an assembly-line approach.",
    "Do all of your measuring and marking at once, followed by all your cutting, then screwing or nailing.",
    "You can also drive the cage into the ground using a hammer or mallet, being careful not to damage the structure.",
    "It may help to sharpen the legs or cut them into points first."
  ],
  "tyn_section":[
    "Tomato plants (or other stalk vegetables)",
    "Roll of concrete reinforcing wire",
    "Section of livestock paneling",
    "2 by 2 by 8 feet (0.61 by 0.61 by 2.44 m) and 1 by 2 by 8 feet (0.30 by 0.61 by 2.44 m) lumber",
    "Saw",
    "Wire/bolt cutters",
    "Wood screws and/or nail gun",
    "Measuring tape",
    "Pen or pencil"
  ],
  "tyn_model":[
    "wire",
    "concrete wire",
    "concrete reinforcing wire",
    "tomato cage",
    "livestock paneling",
    "boards",
    "wood",
    "ladder",
    "bolt cutters",
    "cages",
    "lumber",
    "chicken wire",
    "wire cutters",
    "metal wire",
    "zip ties",
    "fastener",
    "tomatoes",
    "grating",
    "gloves",
    "cage",
    "tomato cages",
    "nail gun",
    "wood screws",
    "ladders",
    "1x2 lumber",
    "” sections",
    "” rungs",
    "wooden cage",
    "hammer",
    "mallet"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2222222222,
    "p":0.0666666667,
    "f1":0.1025641026
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4444444444,
    "p":0.2333333333,
    "f1":0.306010929
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}