{
  "title":"How to Preserve Peppadews",
  "url":"https://www.wikihow.com/Preserve-Peppadews",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices",
    "Preserving Herbs"
  ],
  "methods":[
    {
      "name":"Method One: Freezing",
      "steps":[
        {
          "headline":"Wash the Piquanté Peppers.",
          "description":"Rinse the Piquanté Peppers under running water, using your fingers to gently scrub away any dirt or debris. Completely dry the Piquanté Peppers with clean paper towels before continuing."
        },
        {
          "headline":"Package in freezer-safe bags.",
          "description":"Pack the whole Piquanté Peppers in a thick resealable plastic bag labeled for freezer use. Leave little to no headspace. Label the bag using a permanent marker. List the contents (Piquanté Peppers) and the current date. Doing so allows you to keep track of how long your Piquanté Peppers have been in storage."
        },
        {
          "headline":"Freeze until needed.",
          "description":"Place the bagged Piquanté Peppers in your freezer. Store them for up to 8 months. It is recommended that you keep your freezer at a temperature of 0 degrees Fahrenheit (-18 degrees Celsius) or below."
        },
        {
          "headline":"Seed and mince before thawing.",
          "description":"When you are ready to use the Piquanté Peppers, remove the stems and seeds before thawing them. If you plan to cut them up, you should do that before thawing them, too. Piquanté Peppers are easier to cut while they are still frozen. To seed the Piquanté Peppers, begin by cutting off the stem end and slicing the pepper in half lengthwise. Run a spoon or gloved finger down each half to brush the seeds away. Note that Piquanté Peppers lose some of their crunch after being frozen and thawed, so keep that in mind when you choose this preservation method."
        }
      ]
    },
    {
      "name":"Method Two: Pickling",
      "steps":[
        {
          "headline":"Stem and seed the Piquanté Peppers.",
          "description":"Use a sharp knife to cut off the stem end of each Piquanté Pepper. Dig out the seeds with a small spoon. Place the Piquanté Peppers in a large mixing bowl after seeding them."
        },
        {
          "headline":"Soak the Piquanté Peppers in boiling water.",
          "description":"Boil 3 or 4 cups (750 or 1000 ml) of water in a kettle, then pour the boiling water over the Piquanté Peppers. Allow the Piquanté Peppers to soak for 10 minutes. After soaking the Piquanté Peppers, pour the contents of the bowl through a colander. Allow the Piquanté Peppers to sit in the colander for another 2 to 4 minutes to ensure that they drain well."
        },
        {
          "headline":"Combine the pickling spices.",
          "description":"Place the mustard seeds, allspice berries, coriander seeds, red pepper flakes, ground ginger, crushed bay leaves, cinnamon sticks, and cloves in a resealable plastic bag. Seal the bag and shake well to combine evenly. You can replace this blend of pickling spices with your own or with a commercially prepared mix, if desired."
        },
        {
          "headline":"Boil the pickling liquid.",
          "description":"Combine 1 cup (250 ml) of water with the vinegar, sugar, and pickling spice mix in a large saucepan. Heat on the stove over medium-high until the mixture reaches a boil. Even though distilled white vinegar is recommended, a wine vinegar, malt vinegar, or spirit vinegar would also work."
        },
        {
          "headline":"Add the Piquanté Peppers and continue boiling.",
          "description":"Place the prepared Piquanté Peppers in the boiling pickling liquid. Continue boiling the contents of the saucepan for another 15 minutes. Boil the Piquanté Peppers uncovered. Stir the contents of the saucepan occasionally to ensure even cooking."
        },
        {
          "headline":"Transfer the Piquanté Peppers and liquid to clean jars.",
          "description":"Spoon the Piquanté Peppers into prepared canning jars and pour the pickling liquid over them. Use half-pint (250-ml) or pint (500-ml) jars. Do not use quart (1-L) jars. Leave roughly 1 inch (2.5 cm) of empty headspace at the top of each jar. Stir or poke the contents of each jar with a spoon or skewer to release any trapped air bubbles. If you are using more than one jar, make sure that you distribute the Piquanté Peppers and pickling liquid evenly within both jars."
        },
        {
          "headline":"Process the peppers.",
          "description":"You can process the Piquanté Peppers in a boiling water canner, but a pressure canner is recommended. For dial gauge pressure canners, process the jars for 35 minutes under 12 lbs (82 KPa) of pressure when at an altitude between 0 and 2000 ft (0 and 610 m). Add an extra 1 lb (7 KPa) of pressure for each additional 2000 ft (610 m) in altitude. For weighted gauge pressure canners, process the jars for 35 minutes under 15 lbs (102 KPa) of pressure when at an altitude of 1000 ft (305 m) or below. Add an extra 5 lbs (35 KPa) of pressure when the altitude exceeds 1000 ft (305 m). When using a water canner:\nProcess the jars for 10 minutes at altitudes between 0 and 1000 ft (0 and 305 m). Process the jars for 15 minutes at altitudes between 1001 and 6000 ft (306 and 1830 m). Process the jars for 20 minutes at altitudes above 6000 ft (1830 m). Let the canner cool until it depressurizes, then slowly open the lid. Remove the jars with a jar lifter and place them on dry dish towels. Let cool for 12 to 24 hours at room temperature. Sealed (indented) jars are ready for storage. Jars that did not seal properly should be stored in the refrigerator and used within several weeks."
        },
        {
          "headline":"Store until needed.",
          "description":"Store the sealed pickled Piquanté Peppers for at least 2 to 3 weeks before enjoying. Waiting at least this long will improve the flavor. No matter where you store the Piquanté Peppers, the storage temperature of unopened Piquanté Peppers should remain at or below 75 degrees Fahrenheit (24.1 degrees Celsius) to maintain the best level of quality. An opened jar should be stored in the refrigerator."
        }
      ]
    },
    {
      "name":"Method Three: Non-Pickled Canning",
      "steps":[
        {
          "headline":"Stem and seed the Piquanté Peppers.",
          "description":"Slice the stem end of each Piquanté Pepper, then use a small spoon to dig out the cores and seeds."
        },
        {
          "headline":"Blanch for 3 minutes.",
          "description":"Boil water in a large saucepan over medium-high heat. Submerge the Piquanté Peppers and allow them to simmer for 3 minutes. As the Piquanté Peppers sit in the boiling water, prepare a large bowl of ice water for the next step."
        },
        {
          "headline":"Dunk in cold water.",
          "description":"Immediately transfer the blanched Piquanté Peppers to the bowl of prepared ice water. Allow them to sit for 2 to 3 minutes. Dunking the Piquanté Peppers in ice water will stop the cooking process and allow them to maintain a better color and texture. Drain the Piquanté Peppers thoroughly by pouring the contents of the ice water bowl through a colander."
        },
        {
          "headline":"Pack the Piquanté Peppers into jars.",
          "description":"Spoon the Piquanté Peppers into half-pint (250-ml) or pint (500-ml) glass canning jars. Leave the Piquanté Peppers whole as you pack them. To save space, you may wish to flatten them before packing them. Do so by lightly pressing on the side with the bottom of a spoon. The jars must be thoroughly cleaned and dried before you use them."
        },
        {
          "headline":"Cover with boiling water.",
          "description":"Pour boiling water over the Piquanté Peppers, filling each jar until only 1 inch (2.5 ml) of headspace remains. You can use the boiling water leftover from when you blanched the Piquanté Peppers or use freshly boiled water from a kettle. Either option is acceptable."
        },
        {
          "headline":"Add the salt and lemon juice.",
          "description":"Add 1/2 tsp (2.5 ml) of salt and 1 Tbsp (15 ml) of lemon juice to each pint (500-ml) jar. If using half-pint (250-ml) jars, add 1/4 tsp (1.25 ml) of salt and 1/2 Tbsp (7.5 ml) of lemon juice to each one. After adding the salt and lemon juice, run a plastic knife or spatula in between the Piquanté Peppers and the jar. Doing so mixes the salt and lemon juice into the water while also removing trapped air bubbles."
        },
        {
          "headline":"Process in a pressure canner.",
          "description":"For non-pickled Piquanté Peppers, a pressure canner is strongly recommended due to the low acid content of the vegetable. Process the jars of Piquanté Peppers for 35 minutes. Wipe the jar rims using a clean, damp cloth and make sure that the lids and ring bands are tightly secured before processing. The proper pressure setting will vary depending on the type of canner used and the altitude you are positioned at. For dial gauge canners:\nAt 0 to 2000 ft (0 to 610 m), the pressure should be set to 11 lbs (75 KPa). At 2001 to 4000 ft (611 to 1220 m), the pressure should be set to 12 lbs (82 KPa). At 4001 to 6000 ft (1221 to 1830 m), the pressure should be set to 13 lbs (89 KPa). At 6001 to 8000 ft (1831 to 2440 m), the pressure should be set to 14 lbs (95 KPa). For weighted gauge canners:\nAt 0 to 1000 ft (0 to 305 m), the pressure should be set to 10 lbs (68 KPa). Above 1000 ft (305 m), the pressure should be set to 15 lb (102 KPa). Allow the canner to air cool until it depressurizes. Open the canner slowly and lift the jars out with a jar lifter. Let the jars to air cool for 12 to 24 hours on a dish towel or cooling rack. Check the jars when cool. An indented lid signifies a proper seal. Jars that did not seal properly should be stored in the refrigerator and used within several weeks."
        },
        {
          "headline":"Store until needed.",
          "description":"Store the canned Piquanté Peppers in a cool, dry, dark place. They can be opened and consumed immediately, but they should last for a year or longer if properly sealed. Storage temperatures should not exceed 75 degrees Fahrenheit (24.1 degrees Celsius). After opening a jar or preserved Piquanté Peppers, keep that jar in the refrigerator."
        }
      ]
    }
  ],
  "text":" Method One: Freezing Wash the Piquanté Peppers. Rinse the Piquanté Peppers under running water, using your fingers to gently scrub away any dirt or debris. Completely dry the Piquanté Peppers with clean paper towels before continuing. Package in freezer-safe bags. Pack the whole Piquanté Peppers in a thick resealable plastic bag labeled for freezer use. Leave little to no headspace. Label the bag using a permanent marker. List the contents (Piquanté Peppers) and the current date. Doing so allows you to keep track of how long your Piquanté Peppers have been in storage. Freeze until needed. Place the bagged Piquanté Peppers in your freezer. Store them for up to 8 months. It is recommended that you keep your freezer at a temperature of 0 degrees Fahrenheit (-18 degrees Celsius) or below. Seed and mince before thawing. When you are ready to use the Piquanté Peppers, remove the stems and seeds before thawing them. If you plan to cut them up, you should do that before thawing them, too. Piquanté Peppers are easier to cut while they are still frozen. To seed the Piquanté Peppers, begin by cutting off the stem end and slicing the pepper in half lengthwise. Run a spoon or gloved finger down each half to brush the seeds away. Note that Piquanté Peppers lose some of their crunch after being frozen and thawed, so keep that in mind when you choose this preservation method. Method Two: Pickling Stem and seed the Piquanté Peppers. Use a sharp knife to cut off the stem end of each Piquanté Pepper. Dig out the seeds with a small spoon. Place the Piquanté Peppers in a large mixing bowl after seeding them. Soak the Piquanté Peppers in boiling water. Boil 3 or 4 cups (750 or 1000 ml) of water in a kettle, then pour the boiling water over the Piquanté Peppers. Allow the Piquanté Peppers to soak for 10 minutes. After soaking the Piquanté Peppers, pour the contents of the bowl through a colander. Allow the Piquanté Peppers to sit in the colander for another 2 to 4 minutes to ensure that they drain well. Combine the pickling spices. Place the mustard seeds, allspice berries, coriander seeds, red pepper flakes, ground ginger, crushed bay leaves, cinnamon sticks, and cloves in a resealable plastic bag. Seal the bag and shake well to combine evenly. You can replace this blend of pickling spices with your own or with a commercially prepared mix, if desired. Boil the pickling liquid. Combine 1 cup (250 ml) of water with the vinegar, sugar, and pickling spice mix in a large saucepan. Heat on the stove over medium-high until the mixture reaches a boil. Even though distilled white vinegar is recommended, a wine vinegar, malt vinegar, or spirit vinegar would also work. Add the Piquanté Peppers and continue boiling. Place the prepared Piquanté Peppers in the boiling pickling liquid. Continue boiling the contents of the saucepan for another 15 minutes. Boil the Piquanté Peppers uncovered. Stir the contents of the saucepan occasionally to ensure even cooking. Transfer the Piquanté Peppers and liquid to clean jars. Spoon the Piquanté Peppers into prepared canning jars and pour the pickling liquid over them. Use half-pint (250-ml) or pint (500-ml) jars. Do not use quart (1-L) jars. Leave roughly 1 inch (2.5 cm) of empty headspace at the top of each jar. Stir or poke the contents of each jar with a spoon or skewer to release any trapped air bubbles. If you are using more than one jar, make sure that you distribute the Piquanté Peppers and pickling liquid evenly within both jars. Process the peppers. You can process the Piquanté Peppers in a boiling water canner, but a pressure canner is recommended. For dial gauge pressure canners, process the jars for 35 minutes under 12 lbs (82 KPa) of pressure when at an altitude between 0 and 2000 ft (0 and 610 m). Add an extra 1 lb (7 KPa) of pressure for each additional 2000 ft (610 m) in altitude. For weighted gauge pressure canners, process the jars for 35 minutes under 15 lbs (102 KPa) of pressure when at an altitude of 1000 ft (305 m) or below. Add an extra 5 lbs (35 KPa) of pressure when the altitude exceeds 1000 ft (305 m). When using a water canner:\nProcess the jars for 10 minutes at altitudes between 0 and 1000 ft (0 and 305 m). Process the jars for 15 minutes at altitudes between 1001 and 6000 ft (306 and 1830 m). Process the jars for 20 minutes at altitudes above 6000 ft (1830 m). Let the canner cool until it depressurizes, then slowly open the lid. Remove the jars with a jar lifter and place them on dry dish towels. Let cool for 12 to 24 hours at room temperature. Sealed (indented) jars are ready for storage. Jars that did not seal properly should be stored in the refrigerator and used within several weeks. Store until needed. Store the sealed pickled Piquanté Peppers for at least 2 to 3 weeks before enjoying. Waiting at least this long will improve the flavor. No matter where you store the Piquanté Peppers, the storage temperature of unopened Piquanté Peppers should remain at or below 75 degrees Fahrenheit (24.1 degrees Celsius) to maintain the best level of quality. An opened jar should be stored in the refrigerator. Method Three: Non-Pickled Canning Stem and seed the Piquanté Peppers. Slice the stem end of each Piquanté Pepper, then use a small spoon to dig out the cores and seeds. Blanch for 3 minutes. Boil water in a large saucepan over medium-high heat. Submerge the Piquanté Peppers and allow them to simmer for 3 minutes. As the Piquanté Peppers sit in the boiling water, prepare a large bowl of ice water for the next step. Dunk in cold water. Immediately transfer the blanched Piquanté Peppers to the bowl of prepared ice water. Allow them to sit for 2 to 3 minutes. Dunking the Piquanté Peppers in ice water will stop the cooking process and allow them to maintain a better color and texture. Drain the Piquanté Peppers thoroughly by pouring the contents of the ice water bowl through a colander. Pack the Piquanté Peppers into jars. Spoon the Piquanté Peppers into half-pint (250-ml) or pint (500-ml) glass canning jars. Leave the Piquanté Peppers whole as you pack them. To save space, you may wish to flatten them before packing them. Do so by lightly pressing on the side with the bottom of a spoon. The jars must be thoroughly cleaned and dried before you use them. Cover with boiling water. Pour boiling water over the Piquanté Peppers, filling each jar until only 1 inch (2.5 ml) of headspace remains. You can use the boiling water leftover from when you blanched the Piquanté Peppers or use freshly boiled water from a kettle. Either option is acceptable. Add the salt and lemon juice. Add 1/2 tsp (2.5 ml) of salt and 1 Tbsp (15 ml) of lemon juice to each pint (500-ml) jar. If using half-pint (250-ml) jars, add 1/4 tsp (1.25 ml) of salt and 1/2 Tbsp (7.5 ml) of lemon juice to each one. After adding the salt and lemon juice, run a plastic knife or spatula in between the Piquanté Peppers and the jar. Doing so mixes the salt and lemon juice into the water while also removing trapped air bubbles. Process in a pressure canner. For non-pickled Piquanté Peppers, a pressure canner is strongly recommended due to the low acid content of the vegetable. Process the jars of Piquanté Peppers for 35 minutes. Wipe the jar rims using a clean, damp cloth and make sure that the lids and ring bands are tightly secured before processing. The proper pressure setting will vary depending on the type of canner used and the altitude you are positioned at. For dial gauge canners:\nAt 0 to 2000 ft (0 to 610 m), the pressure should be set to 11 lbs (75 KPa). At 2001 to 4000 ft (611 to 1220 m), the pressure should be set to 12 lbs (82 KPa). At 4001 to 6000 ft (1221 to 1830 m), the pressure should be set to 13 lbs (89 KPa). At 6001 to 8000 ft (1831 to 2440 m), the pressure should be set to 14 lbs (95 KPa). For weighted gauge canners:\nAt 0 to 1000 ft (0 to 305 m), the pressure should be set to 10 lbs (68 KPa). Above 1000 ft (305 m), the pressure should be set to 15 lb (102 KPa). Allow the canner to air cool until it depressurizes. Open the canner slowly and lift the jars out with a jar lifter. Let the jars to air cool for 12 to 24 hours on a dish towel or cooling rack. Check the jars when cool. An indented lid signifies a proper seal. Jars that did not seal properly should be stored in the refrigerator and used within several weeks. Store until needed. Store the canned Piquanté Peppers in a cool, dry, dark place. They can be opened and consumed immediately, but they should last for a year or longer if properly sealed. Storage temperatures should not exceed 75 degrees Fahrenheit (24.1 degrees Celsius). After opening a jar or preserved Piquanté Peppers, keep that jar in the refrigerator.",
  "sentences":[
    " Method One: Freezing Wash the Piquanté Peppers.",
    "Rinse the Piquanté Peppers under running water, using your fingers to gently scrub away any dirt or debris.",
    "Completely dry the Piquanté Peppers with clean paper towels before continuing.",
    "Package in freezer-safe bags.",
    "Pack the whole Piquanté Peppers in a thick resealable plastic bag labeled for freezer use.",
    "Leave little to no headspace.",
    "Label the bag using a permanent marker.",
    "List the contents (Piquanté Peppers) and the current date.",
    "Doing so allows you to keep track of how long your Piquanté Peppers have been in storage.",
    "Freeze until needed.",
    "Place the bagged Piquanté Peppers in your freezer.",
    "Store them for up to 8 months.",
    "It is recommended that you keep your freezer at a temperature of 0 degrees Fahrenheit (-18 degrees Celsius) or below.",
    "Seed and mince before thawing.",
    "When you are ready to use the Piquanté Peppers, remove the stems and seeds before thawing them.",
    "If you plan to cut them up, you should do that before thawing them, too.",
    "Piquanté Peppers are easier to cut while they are still frozen.",
    "To seed the Piquanté Peppers, begin by cutting off the stem end and slicing the pepper in half lengthwise.",
    "Run a spoon or gloved finger down each half to brush the seeds away.",
    "Note that Piquanté Peppers lose some of their crunch after being frozen and thawed, so keep that in mind when you choose this preservation method.",
    "Method Two: Pickling Stem and seed the Piquanté Peppers.",
    "Use a sharp knife to cut off the stem end of each Piquanté Pepper.",
    "Dig out the seeds with a small spoon.",
    "Place the Piquanté Peppers in a large mixing bowl after seeding them.",
    "Soak the Piquanté Peppers in boiling water.",
    "Boil 3 or 4 cups (750 or 1000 ml) of water in a kettle, then pour the boiling water over the Piquanté Peppers.",
    "Allow the Piquanté Peppers to soak for 10 minutes.",
    "After soaking the Piquanté Peppers, pour the contents of the bowl through a colander.",
    "Allow the Piquanté Peppers to sit in the colander for another 2 to 4 minutes to ensure that they drain well.",
    "Combine the pickling spices.",
    "Place the mustard seeds, allspice berries, coriander seeds, red pepper flakes, ground ginger, crushed bay leaves, cinnamon sticks, and cloves in a resealable plastic bag.",
    "Seal the bag and shake well to combine evenly.",
    "You can replace this blend of pickling spices with your own or with a commercially prepared mix, if desired.",
    "Boil the pickling liquid.",
    "Combine 1 cup (250 ml) of water with the vinegar, sugar, and pickling spice mix in a large saucepan.",
    "Heat on the stove over medium-high until the mixture reaches a boil.",
    "Even though distilled white vinegar is recommended, a wine vinegar, malt vinegar, or spirit vinegar would also work.",
    "Add the Piquanté Peppers and continue boiling.",
    "Place the prepared Piquanté Peppers in the boiling pickling liquid.",
    "Continue boiling the contents of the saucepan for another 15 minutes.",
    "Boil the Piquanté Peppers uncovered.",
    "Stir the contents of the saucepan occasionally to ensure even cooking.",
    "Transfer the Piquanté Peppers and liquid to clean jars.",
    "Spoon the Piquanté Peppers into prepared canning jars and pour the pickling liquid over them.",
    "Use half-pint (250-ml) or pint (500-ml) jars.",
    "Do not use quart (1-L) jars.",
    "Leave roughly 1 inch (2.5 cm) of empty headspace at the top of each jar.",
    "Stir or poke the contents of each jar with a spoon or skewer to release any trapped air bubbles.",
    "If you are using more than one jar, make sure that you distribute the Piquanté Peppers and pickling liquid evenly within both jars.",
    "Process the peppers.",
    "You can process the Piquanté Peppers in a boiling water canner, but a pressure canner is recommended.",
    "For dial gauge pressure canners, process the jars for 35 minutes under 12 lbs (82 KPa) of pressure when at an altitude between 0 and 2000 ft (0 and 610 m).",
    "Add an extra 1 lb (7 KPa) of pressure for each additional 2000 ft (610 m) in altitude.",
    "For weighted gauge pressure canners, process the jars for 35 minutes under 15 lbs (102 KPa) of pressure when at an altitude of 1000 ft (305 m) or below.",
    "Add an extra 5 lbs (35 KPa) of pressure when the altitude exceeds 1000 ft (305 m).",
    "When using a water canner:\nProcess the jars for 10 minutes at altitudes between 0 and 1000 ft (0 and 305 m).",
    "Process the jars for 15 minutes at altitudes between 1001 and 6000 ft (306 and 1830 m).",
    "Process the jars for 20 minutes at altitudes above 6000 ft (1830 m).",
    "Let the canner cool until it depressurizes, then slowly open the lid.",
    "Remove the jars with a jar lifter and place them on dry dish towels.",
    "Let cool for 12 to 24 hours at room temperature.",
    "Sealed (indented) jars are ready for storage.",
    "Jars that did not seal properly should be stored in the refrigerator and used within several weeks.",
    "Store until needed.",
    "Store the sealed pickled Piquanté Peppers for at least 2 to 3 weeks before enjoying.",
    "Waiting at least this long will improve the flavor.",
    "No matter where you store the Piquanté Peppers, the storage temperature of unopened Piquanté Peppers should remain at or below 75 degrees Fahrenheit (24.1 degrees Celsius) to maintain the best level of quality.",
    "An opened jar should be stored in the refrigerator.",
    "Method Three: Non-Pickled Canning Stem and seed the Piquanté Peppers.",
    "Slice the stem end of each Piquanté Pepper, then use a small spoon to dig out the cores and seeds.",
    "Blanch for 3 minutes.",
    "Boil water in a large saucepan over medium-high heat.",
    "Submerge the Piquanté Peppers and allow them to simmer for 3 minutes.",
    "As the Piquanté Peppers sit in the boiling water, prepare a large bowl of ice water for the next step.",
    "Dunk in cold water.",
    "Immediately transfer the blanched Piquanté Peppers to the bowl of prepared ice water.",
    "Allow them to sit for 2 to 3 minutes.",
    "Dunking the Piquanté Peppers in ice water will stop the cooking process and allow them to maintain a better color and texture.",
    "Drain the Piquanté Peppers thoroughly by pouring the contents of the ice water bowl through a colander.",
    "Pack the Piquanté Peppers into jars.",
    "Spoon the Piquanté Peppers into half-pint (250-ml) or pint (500-ml) glass canning jars.",
    "Leave the Piquanté Peppers whole as you pack them.",
    "To save space, you may wish to flatten them before packing them.",
    "Do so by lightly pressing on the side with the bottom of a spoon.",
    "The jars must be thoroughly cleaned and dried before you use them.",
    "Cover with boiling water.",
    "Pour boiling water over the Piquanté Peppers, filling each jar until only 1 inch (2.5 ml) of headspace remains.",
    "You can use the boiling water leftover from when you blanched the Piquanté Peppers or use freshly boiled water from a kettle.",
    "Either option is acceptable.",
    "Add the salt and lemon juice.",
    "Add 1/2 tsp (2.5 ml) of salt and 1 Tbsp (15 ml) of lemon juice to each pint (500-ml) jar.",
    "If using half-pint (250-ml) jars, add 1/4 tsp (1.25 ml) of salt and 1/2 Tbsp (7.5 ml) of lemon juice to each one.",
    "After adding the salt and lemon juice, run a plastic knife or spatula in between the Piquanté Peppers and the jar.",
    "Doing so mixes the salt and lemon juice into the water while also removing trapped air bubbles.",
    "Process in a pressure canner.",
    "For non-pickled Piquanté Peppers, a pressure canner is strongly recommended due to the low acid content of the vegetable.",
    "Process the jars of Piquanté Peppers for 35 minutes.",
    "Wipe the jar rims using a clean, damp cloth and make sure that the lids and ring bands are tightly secured before processing.",
    "The proper pressure setting will vary depending on the type of canner used and the altitude you are positioned at.",
    "For dial gauge canners:\nAt 0 to 2000 ft (0 to 610 m), the pressure should be set to 11 lbs (75 KPa).",
    "At 2001 to 4000 ft (611 to 1220 m), the pressure should be set to 12 lbs (82 KPa).",
    "At 4001 to 6000 ft (1221 to 1830 m), the pressure should be set to 13 lbs (89 KPa).",
    "At 6001 to 8000 ft (1831 to 2440 m), the pressure should be set to 14 lbs (95 KPa).",
    "For weighted gauge canners:\nAt 0 to 1000 ft (0 to 305 m), the pressure should be set to 10 lbs (68 KPa).",
    "Above 1000 ft (305 m), the pressure should be set to 15 lb (102 KPa).",
    "Allow the canner to air cool until it depressurizes.",
    "Open the canner slowly and lift the jars out with a jar lifter.",
    "Let the jars to air cool for 12 to 24 hours on a dish towel or cooling rack.",
    "Check the jars when cool.",
    "An indented lid signifies a proper seal.",
    "Jars that did not seal properly should be stored in the refrigerator and used within several weeks.",
    "Store until needed.",
    "Store the canned Piquanté Peppers in a cool, dry, dark place.",
    "They can be opened and consumed immediately, but they should last for a year or longer if properly sealed.",
    "Storage temperatures should not exceed 75 degrees Fahrenheit (24.1 degrees Celsius).",
    "After opening a jar or preserved Piquanté Peppers, keep that jar in the refrigerator."
  ],
  "tyn_section":[
    "Freezing",
    "Sink",
    "Paper towels",
    "Freezer-safe plastic bags",
    "Freezer",
    "Sharp kitchen knife",
    "Pickling",
    "Sharp knife",
    "Small spoon",
    "Large mixing bowl",
    "Kettle",
    "Colander",
    "Resealable plastic bag",
    "Large saucepan",
    "Heat-resistant mixing spoon",
    "Half-pint (250-ml) or pint (500-ml) canning jars with lids",
    "Pressure canner or water canner",
    "Jar tongs",
    "Dish towels",
    "Non-Pickled Canning",
    "Serving spoon or mixing spoon",
    "Plastic knife or spatula",
    "Pressure canner",
    "Dish towels or cooling rack"
  ],
  "tyn_model":[
    "piquanté peppers",
    "water",
    "jars",
    "salt",
    "canner",
    "refrigerator",
    "ice water",
    "spoon",
    "colander",
    "lemon juice",
    "resealable plastic bag",
    "freezer",
    "piquanté pepper",
    "small spoon",
    "pickling spices",
    "large saucepan",
    "saucepan",
    "jar lifter",
    "pressure canner",
    "paper towels",
    "freezer-safe bags",
    "permanent marker",
    "pepper",
    "mixing bowl",
    "kettle",
    "bowl",
    "mustard seeds",
    "allspice berries",
    "coriander",
    "red pepper",
    "ginger",
    "bay leaves",
    "cinnamon sticks",
    "cloves",
    "vinegar",
    "sugar",
    "pickling spice mix",
    "stove",
    "distilled white vinegar",
    "wine vinegar",
    "malt vinegar",
    "spirit vinegar",
    "canning jars",
    "peppers",
    "boiling water canner",
    "dial gauge pressure canners",
    "weighted gauge pressure canners",
    "water canner",
    "pickled canning",
    "glass canning jars",
    "plastic knife",
    "spatula",
    "lemon",
    "dial gauge canners",
    "weighted gauge canners"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.1454545455,
    "f1":0.2025316456,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5416666667,
    "p":0.2909090909,
    "f1":0.3785259327
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.4,
    "f1":0.5217391304
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4166666667,
    "p":0.1818181818,
    "f1":0.253164557
  }
}