{
  "title":"How to Chop Vegetables Very Quickly",
  "url":"https://www.wikihow.com/Chop-Vegetables-Very-Quickly",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "steps":[
    {
      "headline":"Prepare a surface for cutting.",
      "description":"Use a clean table and make sure that the cutting board stays in its place."
    },
    {
      "headline":"Prepare the vegetables.",
      "description":"Prepare the vegetables accordingly by rinsing, peeling, removing kernels, discarding roots etc."
    },
    {
      "headline":"Decide how you would like the final result to look like.",
      "description":"Do you want to cut into cubes, sticks, julienne or Japanese flowers? The possibilities are only limited by your choice of vegetable and the style of the cuisine you are aiming for."
    },
    {
      "headline":"Place one vegetable on the cutting board.",
      "description":"With your non-dominant hand, hold the vegetable firmly in place with the surface of your nails pointing toward and parallel to the blade. Ensure that your nails are closer to the blade than the skin of your fingers."
    },
    {
      "headline":"With your cutting hand, firmly grasp the knife at the handle keeping your index finger and thumb at either side of the upper part of the blade or your index finger on top of the blade in order to ensure stability.",
      "description":"Make sure your fingers cannot slide under the blade."
    },
    {
      "headline":"Look at the knife from above focusing your vision on neither side of the knife, but rather on the back of the blade.",
      "description":""
    },
    {
      "headline":"Move the knife to the right side of the vegetable, keeping it parallel to your nails.",
      "description":""
    },
    {
      "headline":"Using your lower arm, tilt the blade, so that the upper edge of the knife eventually touches the cutting board.",
      "description":""
    },
    {
      "headline":"Start cutting in mid air by thrusting the handle down, keeping the upper edge of the blade steadily attached to the cutting board.",
      "description":"Do not move your knife in any other direction other than around the axis of the upper blade. The motion should look similar to that of a paper cutter, although for greater speeds the upper edge of the blade may slide back and forth along the cutting board."
    },
    {
      "headline":"'With your non-dominant hand, move the vegetable toward the knife.",
      "description":""
    },
    {
      "headline":"Carefully synchronize the raising of the knife with the approach of the vegetable from the left.",
      "description":""
    },
    {
      "headline":"Cut straight and try to be consistent when sizing the vegetable.",
      "description":""
    },
    {
      "headline":"When finished with one vegetable, repeat the process for the next one.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Prepare a surface for cutting. Use a clean table and make sure that the cutting board stays in its place. Prepare the vegetables. Prepare the vegetables accordingly by rinsing, peeling, removing kernels, discarding roots etc. Decide how you would like the final result to look like. Do you want to cut into cubes, sticks, julienne or Japanese flowers? The possibilities are only limited by your choice of vegetable and the style of the cuisine you are aiming for. Place one vegetable on the cutting board. With your non-dominant hand, hold the vegetable firmly in place with the surface of your nails pointing toward and parallel to the blade. Ensure that your nails are closer to the blade than the skin of your fingers. With your cutting hand, firmly grasp the knife at the handle keeping your index finger and thumb at either side of the upper part of the blade or your index finger on top of the blade in order to ensure stability. Make sure your fingers cannot slide under the blade. Look at the knife from above focusing your vision on neither side of the knife, but rather on the back of the blade.  Move the knife to the right side of the vegetable, keeping it parallel to your nails.  Using your lower arm, tilt the blade, so that the upper edge of the knife eventually touches the cutting board.  Start cutting in mid air by thrusting the handle down, keeping the upper edge of the blade steadily attached to the cutting board. Do not move your knife in any other direction other than around the axis of the upper blade. The motion should look similar to that of a paper cutter, although for greater speeds the upper edge of the blade may slide back and forth along the cutting board. 'With your non-dominant hand, move the vegetable toward the knife.  Carefully synchronize the raising of the knife with the approach of the vegetable from the left.  Cut straight and try to be consistent when sizing the vegetable.  When finished with one vegetable, repeat the process for the next one.  Finished. ",
  "sentences":[
    " Prepare a surface for cutting.",
    "Use a clean table and make sure that the cutting board stays in its place.",
    "Prepare the vegetables.",
    "Prepare the vegetables accordingly by rinsing, peeling, removing kernels, discarding roots etc.",
    "Decide how you would like the final result to look like.",
    "Do you want to cut into cubes, sticks, julienne or Japanese flowers?",
    "The possibilities are only limited by your choice of vegetable and the style of the cuisine you are aiming for.",
    "Place one vegetable on the cutting board.",
    "With your non-dominant hand, hold the vegetable firmly in place with the surface of your nails pointing toward and parallel to the blade.",
    "Ensure that your nails are closer to the blade than the skin of your fingers.",
    "With your cutting hand, firmly grasp the knife at the handle keeping your index finger and thumb at either side of the upper part of the blade or your index finger on top of the blade in order to ensure stability.",
    "Make sure your fingers cannot slide under the blade.",
    "Look at the knife from above focusing your vision on neither side of the knife, but rather on the back of the blade.",
    "Move the knife to the right side of the vegetable, keeping it parallel to your nails.",
    "Using your lower arm, tilt the blade, so that the upper edge of the knife eventually touches the cutting board.",
    "Start cutting in mid air by thrusting the handle down, keeping the upper edge of the blade steadily attached to the cutting board.",
    "Do not move your knife in any other direction other than around the axis of the upper blade.",
    "The motion should look similar to that of a paper cutter, although for greater speeds the upper edge of the blade may slide back and forth along the cutting board.",
    "'With your non-dominant hand, move the vegetable toward the knife.",
    "Carefully synchronize the raising of the knife with the approach of the vegetable from the left.",
    "Cut straight and try to be consistent when sizing the vegetable.",
    "When finished with one vegetable, repeat the process for the next one.",
    "Finished."
  ],
  "tyn_section":[
    "A sharp chef's knife",
    "A cutting board",
    "Fresh vegetables",
    "Vegetable peeler [optional]"
  ],
  "tyn_model":[
    "knife",
    "vegetable",
    "cutting board",
    "vegetables",
    "julienne",
    "cutting hand"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.3333333333,
    "f1":0.4
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.5,
    "f1":0.6
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.1666666667,
    "f1":0.2
  }
}