{
  "title":"How to Build Legos",
  "url":"https://www.wikihow.com/Build-Legos",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Construction Toys",
    "LEGO and Other Building Blocks"
  ],
  "methods":[
    {
      "name":"Building a Snake",
      "steps":[
        {
          "headline":"Gather the necessary LEGO blocks.",
          "description":"To complete your snake, you will need the following bricks. If you don't have the right colors, get creative! Two light gray 1x6 thin bricks\nOne red 1x1 hooked piece\nTwo light green 1x1 trapezium (rectangle with a square attached) bricks\nOne white 1x1 piece with a hole\nThree light green 1x3 bricks\nOne light green 1x2 piece\nTwo eyepieces"
        },
        {
          "headline":"Place a light gray 1x6 thin brick on a flat surface.",
          "description":"Orient the piece horizontally in front of you—this will act as the first part of your snake. If you can't find a light gray brick, choose another darker color."
        },
        {
          "headline":"Put a red 1x1 hooked piece to the left of your 1x6 brick.",
          "description":"Place it onto the same flat surface as your 1x6 brick. Face the hook outward to the left and be sure that the side opposite to the hook is touching the left side of the 1x6 brick. Choose a pink or magenta color if you can't find red."
        },
        {
          "headline":"Connect the first two pieces with a light green 1x1 trapezium brick.",
          "description":"Place the piece over the notch on the 1x1 hooked piece and the first notch on the left side of the 1x6 thin brick. The trapezium acts as the head of the snake and connects the first 2 pieces. Face the slope of the 1x1 trapezium brick to the left."
        },
        {
          "headline":"Stick the white 1x1 piece with a hole to the right of the trapezium.",
          "description":"Face the holes outwards—one south toward you and the other away from you to the north. Ensure that the piece is the same height as the trapezium piece and rests tight against its flat side. Choose a light gray color for this piece if you don't have white."
        },
        {
          "headline":"Attach 2 eyepieces to the white 1x1 piece with a hole.",
          "description":"Each of the holes facing outwards can accommodate 1 eyepiece. Attach an eyepiece to each one."
        },
        {
          "headline":"Stick a light green 1x3 brick to the right of the white 1x1 piece.",
          "description":"This piece should be the same height as the 1x1 trapezium and the white 1x1 piece. You should now have 5 notches free on top of the snake and 1 notch free on the base. Choose a light green color identical to the trapezium piece."
        },
        {
          "headline":"Place another light gray 1x6 thin brick onto a flat surface.",
          "description":"Align it a bit north of the first 1x6 thin brick, parallel to your snake. Afterwards, move it to the right until the left notch on the piece is directly across from the remaining notch on the base of your snake."
        },
        {
          "headline":"Connect the two 1x6 thin brick base pieces using a 1x3 brick.",
          "description":"Use a light green 1x3 brick piece to connect the two 1x6 thin bricks vertically. This connecting piece acts as the center body of the snake. After connecting the front and the back of the snake, confirm that the second 1x6 thin brick base piece (the back) has 5 notches remaining."
        },
        {
          "headline":"Attach a light green 1x3 brick to the right of the last 1x3 brick.",
          "description":"After attaching this piece, you should have 2 remaining notches on the tail of your snake. Select any shade of green for this piece if you don't have light green."
        },
        {
          "headline":"Stick a light green 1x1 trapezium piece onto the last notch on the tail.",
          "description":"Face the angled side of the trapezium piece outward to the right. Choose a light-green color if possible. Confirm that your snake has 12 free notches on the top."
        },
        {
          "headline":"Attach a light green 1x2 thin brick over the 1x1 eyepiece.",
          "description":"To top off the head of the snake, attach this piece on top of the 1x1 white eyepiece and the notch directly to its right. Select a light-green color if possible."
        }
      ]
    },
    {
      "name":"Making a Fidget Spinner",
      "steps":[
        {
          "headline":"Gather the necessary LEGO blocks.",
          "description":"The complete your fidget spinner, you will need the following bricks. Don't worry about colors—they can be whatever you want, although we have some suggestions below for a nice effect when you use your spinner! Two 4x4 round plates\nOne 6x6 round plate\nTwo 2x2 round tiles with round holes\nOne 2x2 round tile with a star hole\nOne axle 3 studs long\nEight 2x3 thin rectangles\nFour 2x2 thin squares"
        },
        {
          "headline":"Place a 6x6 round plate on a flat surface.",
          "description":"This will act as the bottom part of the fidget spinner. Choose a bright color like turquoise or light blue for a nice effect."
        },
        {
          "headline":"Attach two 4x4 round plates to the top and bottom of the first plate.",
          "description":"Each 4x4 piece should be attached to the center of the 6x6 plate, leaving 12 notches free around its perimeter. Choose darker colors for the 4-by-4 plates."
        },
        {
          "headline":"Place a 2x2 tile with a round hole onto an axle.",
          "description":"Be sure that the axle is 3 notches long with a stud on one end. Afterwards, place the tile facing downward onto a flat surface with the axle pointing upward. Choose a dark color like gray or black for the round tile."
        },
        {
          "headline":"Slide the axle into the hole of the turquoise piece.",
          "description":"Hold the turquoise piece in front of you using your thumb and middle finger and slide the axle into the hole from the top. Make sure that the 2x2 tile is on top of the axle with its notches facing upward."
        },
        {
          "headline":"Attach a 2x2 tile with a round hole onto the bottom of the axle.",
          "description":"Hold your spinner by its turquoise piece using your thumb and middle finger. Press down on the 2x2 tile on the top of the axle using your index finger and attach the second 2x2 tile to the bottom of the axle. Afterwards, press the tile upwards so that the top 4 notches connect it to the red 4-by-4 round plates."
        },
        {
          "headline":"Slide a 2x2 round piece onto the top of the axle.",
          "description":"Select the round plate with an \"x\" hole. Leave some space at the tip of the axle so the spinner can rotate on it."
        },
        {
          "headline":"Attach a 2x6 thin rectangle underneath the side of the 6x6 plate.",
          "description":"Stick the top 2 notches of the rectangle directly underneath one of the pairs of notches located on the perimeter of the 6x6 plate. The piece should have 4 notches free and point outward from the spinner. Select a color like orange, blue, yellow, or brown."
        },
        {
          "headline":"Connect a thin 2x2 square plate to the 4 free notches.",
          "description":"Fill up the remaining notches on the 2x3 thin rectangle connected to the 6x6 round plate using the square plate. Select a color that matches the 2x3 thin rectangle."
        },
        {
          "headline":"Attach a 2x3 thin rectangle to the top of the 6x6 round plate.",
          "description":"Connect the pair of notches on the outside of the plate to the 2 holes underneath a 2x3 thin rectangle. Attach the remaining 4 holes underneath the 2x3 thin rectangle to the top of the 2x2 thin square brick. Make sure your completed arm is facing outwards from the spinner. Keep each piece of the arm the same color."
        },
        {
          "headline":"Connect 3 more arms to the remaining pairs of notches.",
          "description":"Repeat the procedure for creating arms for the 3 remaining pairs of 2 notches. After attaching 4 arms, you should have 1 free notch on the 6x6 plate between each one. Select different colors for each arm."
        },
        {
          "headline":"Hold your fidget spinner by the gray 2x2 tiles and spin it!",
          "description":"Using your non-dominant hand, place your thumb on one 2x2 tile and your middle finger on the other. Press them together toward each other and hold the spinner firmly. Use the index finger of your dominant hand to spin the toy from one of its arms. Don't hit the spinner with your index finger too hard to avoid breaking it."
        }
      ]
    },
    {
      "name":"Creating a Flower",
      "steps":[
        {
          "headline":"Gather the necessary LEGO blocks.",
          "description":"The complete your flower you will need the following bricks:\nOne dark green 2x4 flat brick\nTwo light green 2x2 thick bricks\nFour light green 1x2 trapezium (rectangle with a square attached) bricks\nOne gray 2x2 thin brick. Four purple half-crescent pieces\nFour yellow rods."
        },
        {
          "headline":"Place the dark green 2x4 brick on a flat surface.",
          "description":"This piece will act as the base of the flower. Ideally, the piece should be dark green. Orient the piece horizontally in front of you."
        },
        {
          "headline":"Stack two light green 2x2 bricks each onto the base.",
          "description":"Choose a lighter shade of green for these pieces. Stick the first one into the middle of the rectangular base—there should be 2 notches to the left and 2 to the right. Afterwards, place the second piece directly on top."
        },
        {
          "headline":"Connect four light green 1x2 trapezium pieces onto the top square.",
          "description":"Select colors identical to the previous squares. Face the pointed ends (with the hollow notches) of each of these pieces outwards. Begin by attaching the first piece to the bottom-left notch on the 2x2 brick, with the hollow notch facing you. Continue connecting the rest in the same manner. Connect the second piece to the top-left notch on the 2x2 brick, the third to the top-right, and the fourth to the bottom-right. Orient each piece to face a different direction. Starting from the first piece, the order of their directions is: down, left, up, right."
        },
        {
          "headline":"Place a one thin 2x2 brick onto the 4 trapezium pieces.",
          "description":"After attaching this piece, the only part visible from the trapezium pieces should be the hollow pointed ends. Use a lighter shade of green for this piece. If you can't find the right color for this piece, don't worry—it's the least visible piece."
        },
        {
          "headline":"Attach 4 half-crescent pieces to the trapezium pieces.",
          "description":"Attach each of the half-crescents onto the pointed ends of the trapezium pieces. Orient all of them to point outward from the center square. Each half-crescent piece should face the same direction as the 1x2 trapezium pieces they are connected to."
        },
        {
          "headline":"Connect 4 yellow cylinders to the 2x2 brick.",
          "description":"Connect the circular bottom part of each cylinder to the free notches of the 2x2 brick. After attaching them, you can rotate them into the direction of your choosing. Direct them outward from the center of the flower for a nice effect. Use yellow colors for these pieces."
        }
      ]
    }
  ],
  "text":" Building a Snake Gather the necessary LEGO blocks. To complete your snake, you will need the following bricks. If you don't have the right colors, get creative! Two light gray 1x6 thin bricks\nOne red 1x1 hooked piece\nTwo light green 1x1 trapezium (rectangle with a square attached) bricks\nOne white 1x1 piece with a hole\nThree light green 1x3 bricks\nOne light green 1x2 piece\nTwo eyepieces Place a light gray 1x6 thin brick on a flat surface. Orient the piece horizontally in front of you—this will act as the first part of your snake. If you can't find a light gray brick, choose another darker color. Put a red 1x1 hooked piece to the left of your 1x6 brick. Place it onto the same flat surface as your 1x6 brick. Face the hook outward to the left and be sure that the side opposite to the hook is touching the left side of the 1x6 brick. Choose a pink or magenta color if you can't find red. Connect the first two pieces with a light green 1x1 trapezium brick. Place the piece over the notch on the 1x1 hooked piece and the first notch on the left side of the 1x6 thin brick. The trapezium acts as the head of the snake and connects the first 2 pieces. Face the slope of the 1x1 trapezium brick to the left. Stick the white 1x1 piece with a hole to the right of the trapezium. Face the holes outwards—one south toward you and the other away from you to the north. Ensure that the piece is the same height as the trapezium piece and rests tight against its flat side. Choose a light gray color for this piece if you don't have white. Attach 2 eyepieces to the white 1x1 piece with a hole. Each of the holes facing outwards can accommodate 1 eyepiece. Attach an eyepiece to each one. Stick a light green 1x3 brick to the right of the white 1x1 piece. This piece should be the same height as the 1x1 trapezium and the white 1x1 piece. You should now have 5 notches free on top of the snake and 1 notch free on the base. Choose a light green color identical to the trapezium piece. Place another light gray 1x6 thin brick onto a flat surface. Align it a bit north of the first 1x6 thin brick, parallel to your snake. Afterwards, move it to the right until the left notch on the piece is directly across from the remaining notch on the base of your snake. Connect the two 1x6 thin brick base pieces using a 1x3 brick. Use a light green 1x3 brick piece to connect the two 1x6 thin bricks vertically. This connecting piece acts as the center body of the snake. After connecting the front and the back of the snake, confirm that the second 1x6 thin brick base piece (the back) has 5 notches remaining. Attach a light green 1x3 brick to the right of the last 1x3 brick. After attaching this piece, you should have 2 remaining notches on the tail of your snake. Select any shade of green for this piece if you don't have light green. Stick a light green 1x1 trapezium piece onto the last notch on the tail. Face the angled side of the trapezium piece outward to the right. Choose a light-green color if possible. Confirm that your snake has 12 free notches on the top. Attach a light green 1x2 thin brick over the 1x1 eyepiece. To top off the head of the snake, attach this piece on top of the 1x1 white eyepiece and the notch directly to its right. Select a light-green color if possible. Making a Fidget Spinner Gather the necessary LEGO blocks. The complete your fidget spinner, you will need the following bricks. Don't worry about colors—they can be whatever you want, although we have some suggestions below for a nice effect when you use your spinner! Two 4x4 round plates\nOne 6x6 round plate\nTwo 2x2 round tiles with round holes\nOne 2x2 round tile with a star hole\nOne axle 3 studs long\nEight 2x3 thin rectangles\nFour 2x2 thin squares Place a 6x6 round plate on a flat surface. This will act as the bottom part of the fidget spinner. Choose a bright color like turquoise or light blue for a nice effect. Attach two 4x4 round plates to the top and bottom of the first plate. Each 4x4 piece should be attached to the center of the 6x6 plate, leaving 12 notches free around its perimeter. Choose darker colors for the 4-by-4 plates. Place a 2x2 tile with a round hole onto an axle. Be sure that the axle is 3 notches long with a stud on one end. Afterwards, place the tile facing downward onto a flat surface with the axle pointing upward. Choose a dark color like gray or black for the round tile. Slide the axle into the hole of the turquoise piece. Hold the turquoise piece in front of you using your thumb and middle finger and slide the axle into the hole from the top. Make sure that the 2x2 tile is on top of the axle with its notches facing upward. Attach a 2x2 tile with a round hole onto the bottom of the axle. Hold your spinner by its turquoise piece using your thumb and middle finger. Press down on the 2x2 tile on the top of the axle using your index finger and attach the second 2x2 tile to the bottom of the axle. Afterwards, press the tile upwards so that the top 4 notches connect it to the red 4-by-4 round plates. Slide a 2x2 round piece onto the top of the axle. Select the round plate with an \"x\" hole. Leave some space at the tip of the axle so the spinner can rotate on it. Attach a 2x6 thin rectangle underneath the side of the 6x6 plate. Stick the top 2 notches of the rectangle directly underneath one of the pairs of notches located on the perimeter of the 6x6 plate. The piece should have 4 notches free and point outward from the spinner. Select a color like orange, blue, yellow, or brown. Connect a thin 2x2 square plate to the 4 free notches. Fill up the remaining notches on the 2x3 thin rectangle connected to the 6x6 round plate using the square plate. Select a color that matches the 2x3 thin rectangle. Attach a 2x3 thin rectangle to the top of the 6x6 round plate. Connect the pair of notches on the outside of the plate to the 2 holes underneath a 2x3 thin rectangle. Attach the remaining 4 holes underneath the 2x3 thin rectangle to the top of the 2x2 thin square brick. Make sure your completed arm is facing outwards from the spinner. Keep each piece of the arm the same color. Connect 3 more arms to the remaining pairs of notches. Repeat the procedure for creating arms for the 3 remaining pairs of 2 notches. After attaching 4 arms, you should have 1 free notch on the 6x6 plate between each one. Select different colors for each arm. Hold your fidget spinner by the gray 2x2 tiles and spin it! Using your non-dominant hand, place your thumb on one 2x2 tile and your middle finger on the other. Press them together toward each other and hold the spinner firmly. Use the index finger of your dominant hand to spin the toy from one of its arms. Don't hit the spinner with your index finger too hard to avoid breaking it. Creating a Flower Gather the necessary LEGO blocks. The complete your flower you will need the following bricks:\nOne dark green 2x4 flat brick\nTwo light green 2x2 thick bricks\nFour light green 1x2 trapezium (rectangle with a square attached) bricks\nOne gray 2x2 thin brick. Four purple half-crescent pieces\nFour yellow rods. Place the dark green 2x4 brick on a flat surface. This piece will act as the base of the flower. Ideally, the piece should be dark green. Orient the piece horizontally in front of you. Stack two light green 2x2 bricks each onto the base. Choose a lighter shade of green for these pieces. Stick the first one into the middle of the rectangular base—there should be 2 notches to the left and 2 to the right. Afterwards, place the second piece directly on top. Connect four light green 1x2 trapezium pieces onto the top square. Select colors identical to the previous squares. Face the pointed ends (with the hollow notches) of each of these pieces outwards. Begin by attaching the first piece to the bottom-left notch on the 2x2 brick, with the hollow notch facing you. Continue connecting the rest in the same manner. Connect the second piece to the top-left notch on the 2x2 brick, the third to the top-right, and the fourth to the bottom-right. Orient each piece to face a different direction. Starting from the first piece, the order of their directions is: down, left, up, right. Place a one thin 2x2 brick onto the 4 trapezium pieces. After attaching this piece, the only part visible from the trapezium pieces should be the hollow pointed ends. Use a lighter shade of green for this piece. If you can't find the right color for this piece, don't worry—it's the least visible piece. Attach 4 half-crescent pieces to the trapezium pieces. Attach each of the half-crescents onto the pointed ends of the trapezium pieces. Orient all of them to point outward from the center square. Each half-crescent piece should face the same direction as the 1x2 trapezium pieces they are connected to. Connect 4 yellow cylinders to the 2x2 brick. Connect the circular bottom part of each cylinder to the free notches of the 2x2 brick. After attaching them, you can rotate them into the direction of your choosing. Direct them outward from the center of the flower for a nice effect. Use yellow colors for these pieces.",
  "sentences":[
    " Building a Snake Gather the necessary LEGO blocks.",
    "To complete your snake, you will need the following bricks.",
    "If you don't have the right colors, get creative!",
    "Two light gray 1x6 thin bricks\nOne red 1x1 hooked piece\nTwo light green 1x1 trapezium (rectangle with a square attached) bricks\nOne white 1x1 piece with a hole\nThree light green 1x3 bricks\nOne light green 1x2 piece\nTwo eyepieces Place a light gray 1x6 thin brick on a flat surface.",
    "Orient the piece horizontally in front of you—this will act as the first part of your snake.",
    "If you can't find a light gray brick, choose another darker color.",
    "Put a red 1x1 hooked piece to the left of your 1x6 brick.",
    "Place it onto the same flat surface as your 1x6 brick.",
    "Face the hook outward to the left and be sure that the side opposite to the hook is touching the left side of the 1x6 brick.",
    "Choose a pink or magenta color if you can't find red.",
    "Connect the first two pieces with a light green 1x1 trapezium brick.",
    "Place the piece over the notch on the 1x1 hooked piece and the first notch on the left side of the 1x6 thin brick.",
    "The trapezium acts as the head of the snake and connects the first 2 pieces.",
    "Face the slope of the 1x1 trapezium brick to the left.",
    "Stick the white 1x1 piece with a hole to the right of the trapezium.",
    "Face the holes outwards—one south toward you and the other away from you to the north.",
    "Ensure that the piece is the same height as the trapezium piece and rests tight against its flat side.",
    "Choose a light gray color for this piece if you don't have white.",
    "Attach 2 eyepieces to the white 1x1 piece with a hole.",
    "Each of the holes facing outwards can accommodate 1 eyepiece.",
    "Attach an eyepiece to each one.",
    "Stick a light green 1x3 brick to the right of the white 1x1 piece.",
    "This piece should be the same height as the 1x1 trapezium and the white 1x1 piece.",
    "You should now have 5 notches free on top of the snake and 1 notch free on the base.",
    "Choose a light green color identical to the trapezium piece.",
    "Place another light gray 1x6 thin brick onto a flat surface.",
    "Align it a bit north of the first 1x6 thin brick, parallel to your snake.",
    "Afterwards, move it to the right until the left notch on the piece is directly across from the remaining notch on the base of your snake.",
    "Connect the two 1x6 thin brick base pieces using a 1x3 brick.",
    "Use a light green 1x3 brick piece to connect the two 1x6 thin bricks vertically.",
    "This connecting piece acts as the center body of the snake.",
    "After connecting the front and the back of the snake, confirm that the second 1x6 thin brick base piece (the back) has 5 notches remaining.",
    "Attach a light green 1x3 brick to the right of the last 1x3 brick.",
    "After attaching this piece, you should have 2 remaining notches on the tail of your snake.",
    "Select any shade of green for this piece if you don't have light green.",
    "Stick a light green 1x1 trapezium piece onto the last notch on the tail.",
    "Face the angled side of the trapezium piece outward to the right.",
    "Choose a light-green color if possible.",
    "Confirm that your snake has 12 free notches on the top.",
    "Attach a light green 1x2 thin brick over the 1x1 eyepiece.",
    "To top off the head of the snake, attach this piece on top of the 1x1 white eyepiece and the notch directly to its right.",
    "Select a light-green color if possible.",
    "Making a Fidget Spinner Gather the necessary LEGO blocks.",
    "The complete your fidget spinner, you will need the following bricks.",
    "Don't worry about colors—they can be whatever you want, although we have some suggestions below for a nice effect when you use your spinner!",
    "Two 4x4 round plates\nOne 6x6 round plate\nTwo 2x2 round tiles with round holes\nOne 2x2 round tile with a star hole\nOne axle 3 studs long\nEight 2x3 thin rectangles\nFour 2x2 thin squares Place a 6x6 round plate on a flat surface.",
    "This will act as the bottom part of the fidget spinner.",
    "Choose a bright color like turquoise or light blue for a nice effect.",
    "Attach two 4x4 round plates to the top and bottom of the first plate.",
    "Each 4x4 piece should be attached to the center of the 6x6 plate, leaving 12 notches free around its perimeter.",
    "Choose darker colors for the 4-by-4 plates.",
    "Place a 2x2 tile with a round hole onto an axle.",
    "Be sure that the axle is 3 notches long with a stud on one end.",
    "Afterwards, place the tile facing downward onto a flat surface with the axle pointing upward.",
    "Choose a dark color like gray or black for the round tile.",
    "Slide the axle into the hole of the turquoise piece.",
    "Hold the turquoise piece in front of you using your thumb and middle finger and slide the axle into the hole from the top.",
    "Make sure that the 2x2 tile is on top of the axle with its notches facing upward.",
    "Attach a 2x2 tile with a round hole onto the bottom of the axle.",
    "Hold your spinner by its turquoise piece using your thumb and middle finger.",
    "Press down on the 2x2 tile on the top of the axle using your index finger and attach the second 2x2 tile to the bottom of the axle.",
    "Afterwards, press the tile upwards so that the top 4 notches connect it to the red 4-by-4 round plates.",
    "Slide a 2x2 round piece onto the top of the axle.",
    "Select the round plate with an \"x\" hole.",
    "Leave some space at the tip of the axle so the spinner can rotate on it.",
    "Attach a 2x6 thin rectangle underneath the side of the 6x6 plate.",
    "Stick the top 2 notches of the rectangle directly underneath one of the pairs of notches located on the perimeter of the 6x6 plate.",
    "The piece should have 4 notches free and point outward from the spinner.",
    "Select a color like orange, blue, yellow, or brown.",
    "Connect a thin 2x2 square plate to the 4 free notches.",
    "Fill up the remaining notches on the 2x3 thin rectangle connected to the 6x6 round plate using the square plate.",
    "Select a color that matches the 2x3 thin rectangle.",
    "Attach a 2x3 thin rectangle to the top of the 6x6 round plate.",
    "Connect the pair of notches on the outside of the plate to the 2 holes underneath a 2x3 thin rectangle.",
    "Attach the remaining 4 holes underneath the 2x3 thin rectangle to the top of the 2x2 thin square brick.",
    "Make sure your completed arm is facing outwards from the spinner.",
    "Keep each piece of the arm the same color.",
    "Connect 3 more arms to the remaining pairs of notches.",
    "Repeat the procedure for creating arms for the 3 remaining pairs of 2 notches.",
    "After attaching 4 arms, you should have 1 free notch on the 6x6 plate between each one.",
    "Select different colors for each arm.",
    "Hold your fidget spinner by the gray 2x2 tiles and spin it!",
    "Using your non-dominant hand, place your thumb on one 2x2 tile and your middle finger on the other.",
    "Press them together toward each other and hold the spinner firmly.",
    "Use the index finger of your dominant hand to spin the toy from one of its arms.",
    "Don't hit the spinner with your index finger too hard to avoid breaking it.",
    "Creating a Flower Gather the necessary LEGO blocks.",
    "The complete your flower you will need the following bricks:\nOne dark green 2x4 flat brick\nTwo light green 2x2 thick bricks\nFour light green 1x2 trapezium (rectangle with a square attached) bricks\nOne gray 2x2 thin brick.",
    "Four purple half-crescent pieces\nFour yellow rods.",
    "Place the dark green 2x4 brick on a flat surface.",
    "This piece will act as the base of the flower.",
    "Ideally, the piece should be dark green.",
    "Orient the piece horizontally in front of you.",
    "Stack two light green 2x2 bricks each onto the base.",
    "Choose a lighter shade of green for these pieces.",
    "Stick the first one into the middle of the rectangular base—there should be 2 notches to the left and 2 to the right.",
    "Afterwards, place the second piece directly on top.",
    "Connect four light green 1x2 trapezium pieces onto the top square.",
    "Select colors identical to the previous squares.",
    "Face the pointed ends (with the hollow notches) of each of these pieces outwards.",
    "Begin by attaching the first piece to the bottom-left notch on the 2x2 brick, with the hollow notch facing you.",
    "Continue connecting the rest in the same manner.",
    "Connect the second piece to the top-left notch on the 2x2 brick, the third to the top-right, and the fourth to the bottom-right.",
    "Orient each piece to face a different direction.",
    "Starting from the first piece, the order of their directions is: down, left, up, right.",
    "Place a one thin 2x2 brick onto the 4 trapezium pieces.",
    "After attaching this piece, the only part visible from the trapezium pieces should be the hollow pointed ends.",
    "Use a lighter shade of green for this piece.",
    "If you can't find the right color for this piece, don't worry—it's the least visible piece.",
    "Attach 4 half-crescent pieces to the trapezium pieces.",
    "Attach each of the half-crescents onto the pointed ends of the trapezium pieces.",
    "Orient all of them to point outward from the center square.",
    "Each half-crescent piece should face the same direction as the 1x2 trapezium pieces they are connected to.",
    "Connect 4 yellow cylinders to the 2x2 brick.",
    "Connect the circular bottom part of each cylinder to the free notches of the 2x2 brick.",
    "After attaching them, you can rotate them into the direction of your choosing.",
    "Direct them outward from the center of the flower for a nice effect.",
    "Use yellow colors for these pieces."
  ],
  "tyn_section":[
    "Creating a Snake",
    "LEGO® Creative Building Cube",
    "Building a Fidget Spinner",
    "LEGO® Classic Creative Bricks",
    "LEGO® Bricks Bricks Bricks"
  ],
  "tyn_model":[
    "brick",
    "spinner",
    "fidget spinner",
    "lego blocks",
    "plate",
    "trapezium brick",
    "plates",
    "bricks",
    "—this",
    "trapezium",
    "—one",
    "eyepieces",
    "—they",
    "tile",
    "4-by-4 round plates",
    "square plate",
    "rods",
    "—there",
    "—it"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.1052631579,
    "f1":0.1666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.1052631579,
    "f1":0.1666666667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}