{
  "title":"How to Make Paper Look Like Stained Glass",
  "url":"https://www.wikihow.com/Make-Paper-Look-Like-Stained-Glass",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Papermaking"
  ],
  "parts":[
    {
      "name":"Creating the drawing",
      "steps":[
        {
          "headline":"Create a drawing.",
          "description":"Decide on a simple drawing the first time that you try this, so that you can concentrate most on getting the technique accurate. Afterwards, you can progress to more advanced drawings. Some ideas for trying first include a star, a moon, a basic tree, a flower or the outline of a cat or dog. It is also recommended that you keep your first design small, as there is a lot of coloring in required."
        },
        {
          "headline":"Draw the image onto white paper.",
          "description":"Use permanent black marker to sketch the image in place. Position the drawing in the center of the white paper. If you prefer, print out a simple design using black ink on white paper."
        },
        {
          "headline":"Add geometric shapes around the initial image.",
          "description":"These help to give the impression of a stained glass window. Diamonds, squares and rectangles are suitable shapes."
        },
        {
          "headline":"Hold the paper up to a window with the images facing outward.",
          "description":"Using the light to highlight the images, draw around them on the back of the paper as well."
        },
        {
          "headline":"Color in the drawn images with crayons.",
          "description":"Used different colors for each image, and perhaps different colors within the image. Color them on both sides."
        },
        {
          "headline":"Finish by coloring in all of the remaining background of the paper.",
          "description":"The whole sheet of paper must be colored in for the best effect, both front and back."
        }
      ]
    },
    {
      "name":"Adding the baby oil",
      "steps":[
        {
          "headline":"Coat the back of the drawing in a small amount of baby oil.",
          "description":"Use a cotton swab or bud as the \"brush\". Turn the paper over to the back. Dip the swap into the oil, then coat sections at a time of the back of the drawing. Continue until you have covered the entire back of the paper. Be sparing with the amount of baby oil used. It should be just enough to coat the paper for a translucent effect. Avoid having it drip off or thoroughly soak the paper. Paint gently; if you press too hard, the paper may rip."
        },
        {
          "headline":"Allow to dry fully.",
          "description":"See Warnings below for what might happen if it's not dry enough."
        },
        {
          "headline":"Punch or pierce a hole in the top of the paper.",
          "description":"Thread a piece of ribbon or string through it and tie in a loop for hanging. You can skip this step if you're going to use poster tack or tape to attach the paper to the window."
        },
        {
          "headline":"Hang or attach the drawing on a window.",
          "description":"The light will shine through, the baby oil will intensify the colors and let the light shine through, giving the impression of a stained glass window."
        }
      ]
    }
  ],
  "text":" Creating the drawing Create a drawing. Decide on a simple drawing the first time that you try this, so that you can concentrate most on getting the technique accurate. Afterwards, you can progress to more advanced drawings. Some ideas for trying first include a star, a moon, a basic tree, a flower or the outline of a cat or dog. It is also recommended that you keep your first design small, as there is a lot of coloring in required. Draw the image onto white paper. Use permanent black marker to sketch the image in place. Position the drawing in the center of the white paper. If you prefer, print out a simple design using black ink on white paper. Add geometric shapes around the initial image. These help to give the impression of a stained glass window. Diamonds, squares and rectangles are suitable shapes. Hold the paper up to a window with the images facing outward. Using the light to highlight the images, draw around them on the back of the paper as well. Color in the drawn images with crayons. Used different colors for each image, and perhaps different colors within the image. Color them on both sides. Finish by coloring in all of the remaining background of the paper. The whole sheet of paper must be colored in for the best effect, both front and back. Adding the baby oil Coat the back of the drawing in a small amount of baby oil. Use a cotton swab or bud as the \"brush\". Turn the paper over to the back. Dip the swap into the oil, then coat sections at a time of the back of the drawing. Continue until you have covered the entire back of the paper. Be sparing with the amount of baby oil used. It should be just enough to coat the paper for a translucent effect. Avoid having it drip off or thoroughly soak the paper. Paint gently; if you press too hard, the paper may rip. Allow to dry fully. See Warnings below for what might happen if it's not dry enough. Punch or pierce a hole in the top of the paper. Thread a piece of ribbon or string through it and tie in a loop for hanging. You can skip this step if you're going to use poster tack or tape to attach the paper to the window. Hang or attach the drawing on a window. The light will shine through, the baby oil will intensify the colors and let the light shine through, giving the impression of a stained glass window.",
  "sentences":[
    " Creating the drawing Create a drawing.",
    "Decide on a simple drawing the first time that you try this, so that you can concentrate most on getting the technique accurate.",
    "Afterwards, you can progress to more advanced drawings.",
    "Some ideas for trying first include a star, a moon, a basic tree, a flower or the outline of a cat or dog.",
    "It is also recommended that you keep your first design small, as there is a lot of coloring in required.",
    "Draw the image onto white paper.",
    "Use permanent black marker to sketch the image in place.",
    "Position the drawing in the center of the white paper.",
    "If you prefer, print out a simple design using black ink on white paper.",
    "Add geometric shapes around the initial image.",
    "These help to give the impression of a stained glass window.",
    "Diamonds, squares and rectangles are suitable shapes.",
    "Hold the paper up to a window with the images facing outward.",
    "Using the light to highlight the images, draw around them on the back of the paper as well.",
    "Color in the drawn images with crayons.",
    "Used different colors for each image, and perhaps different colors within the image.",
    "Color them on both sides.",
    "Finish by coloring in all of the remaining background of the paper.",
    "The whole sheet of paper must be colored in for the best effect, both front and back.",
    "Adding the baby oil Coat the back of the drawing in a small amount of baby oil.",
    "Use a cotton swab or bud as the \"brush\".",
    "Turn the paper over to the back.",
    "Dip the swap into the oil, then coat sections at a time of the back of the drawing.",
    "Continue until you have covered the entire back of the paper.",
    "Be sparing with the amount of baby oil used.",
    "It should be just enough to coat the paper for a translucent effect.",
    "Avoid having it drip off or thoroughly soak the paper.",
    "Paint gently; if you press too hard, the paper may rip.",
    "Allow to dry fully.",
    "See Warnings below for what might happen if it's not dry enough.",
    "Punch or pierce a hole in the top of the paper.",
    "Thread a piece of ribbon or string through it and tie in a loop for hanging.",
    "You can skip this step if you're going to use poster tack or tape to attach the paper to the window.",
    "Hang or attach the drawing on a window.",
    "The light will shine through, the baby oil will intensify the colors and let the light shine through, giving the impression of a stained glass window."
  ],
  "tyn_section":[
    "Quality white paper",
    "Crayons in many colors",
    "Black permanent marker",
    "Design ideas",
    "Baby oil",
    "Cotton swab or bud",
    "Hole puncher or sharp end of scissors",
    "Ribbon or string (ribbon is good because of its width, which is less likely to tear the paper)",
    "Tape or poster tack (optional alternative)"
  ],
  "tyn_model":[
    "paper",
    "baby oil",
    "white paper",
    "stained glass window",
    "permanent black marker",
    "black ink",
    "crayons",
    "cotton swab",
    "oil",
    "paint",
    "ribbon",
    "poster tack or tape"
  ],
  "simple_metrics":{
    "r":0.1111111111,
    "p":0.0833333333,
    "f1":0.0952380952,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5555555556,
    "p":0.5,
    "f1":0.5263157895
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5555555556,
    "p":0.5833333333,
    "f1":0.5691056911
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4444444444,
    "p":0.3333333333,
    "f1":0.380952381
  }
}