{
  "title":"How to Expose Photo Emulsion for Silk Screen Printing",
  "url":"https://www.wikihow.com/Expose-Photo-Emulsion-for-Silk-Screen-Printing",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects"
  ],
  "parts":[
    {
      "name":"Setting Up",
      "steps":[
        {
          "headline":"Find a location equipped with running water, electrical, and a dark closet.",
          "description":"Things will flow smoothly in this process if everything is properly set up. A garage or small room with blinds, with an easy bathroom access is ideal. Setting up a \"dark room\" in a closet with as little access to light is essential. The area needs to have electricity for the light table and fan in the dark room."
        },
        {
          "headline":"Obtain all materials.",
          "description":"Your supplies are listed under \"Things You'll Need.\" These materials can be purchased at any craft store such as Dick Blick, Michaels, Joann’s, and Walmart."
        },
        {
          "headline":"Set up drop cloth and silkscreen.",
          "description":"Using a drop cloth or old newspaper, set up a workspace on the ground against a stable surface such as a wall. Place the screen topside facing out; this is where the emulsion needs to coat the screen. The top of the screen is the outer, flat side."
        },
        {
          "headline":"Create a dark room and exposure closet.",
          "description":"Coating the screen with the emulsion chemical does not have to be done in complete darkness, just in little light. A dark room can be simply created by having closed blinds, a closed door, and shut off lights. To create an exposure closet, use a drop cloth or old newspaper to create a resting spot for the screen. Place a small fan inside the closet but don’t turn it on yet. Use old fabric or blankets, dark in color, or black garbage bags and tape to the walls to resist as much light as possible. The lights can be on while setting up but need to be off for the next step."
        },
        {
          "headline":"Mix and measure emulsion.",
          "description":"Make sure the lights are off and blinds are closed. Put rubber gloves on and open the container of emulsion and use the spatula to stir the chemical. Measure ½ cup of chemical for a large screen and pour into the emulsion trough. Disperse evenly so the chemical is stretching the entire width of the trough."
        }
      ]
    },
    {
      "name":"Preparing the Screen",
      "steps":[
        {
          "headline":"Coat the screen using the emulsion trough.",
          "description":"Make sure the screen is propped up against the wall with the flat surface facing you.Use one hand to hold the screen steady and the other to hold the trough. Using the rounded edge of the trough, squeegee up the back of screen, holding the trough at a 45° angle, and applying even pressure throughout. The entire screen should be covered in emulsion. Then use the sharp edge of the trough, not to apply more emulsion, but to scrape off any excess using the trough the same way."
        },
        {
          "headline":"Hold the screen up to the closed blinds and see if there are any holes or missing spots.",
          "description":"You can fill these in with a small paintbrush."
        },
        {
          "headline":"Set up screen in exposure closet, and  start the timer and fan.",
          "description":"When the screen is fully covered and the excess emulsion has been removed, place the screen with the bottom side propped against the wall. Turn the fan on so it will help dry the emulsion faster. Take note of the time and wait one hour before checking the screen."
        },
        {
          "headline":"Clean up.",
          "description":"Empty the remaining emulsion from the trough back into the container and refrigerate if necessary. Wash the trough, spatula, and measuring cup. Throw away old newspaper or drop cloth."
        }
      ]
    },
    {
      "name":"Exposing the Screen",
      "steps":[
        {
          "headline":"Prepare light table.",
          "description":"If a light table has been purchased, you simply can plug it in when ready. If constructing one yourself, keep in mind the light needs to evenly be dispersed so plan the lighting according to screen size. Place the lights underneath the table so that no area is more bright than another. Playing around with the lighting in this step is fine as long as the exposure closet is sealed."
        },
        {
          "headline":"Prepare image(s) for light table.",
          "description":"Using a black marker or paint pen, draw or trace whatever image is to be printed. Use the light table to make sure the black areas are not passing light. Tape the image down to the table securing it in place."
        },
        {
          "headline":"Expose screen on light table for 7 minutes.",
          "description":"After the screen has been in the closet for one hour and is completely dry it can be exposed. When you place the dried screen over the drawing and expose the whole thing to strong light, the emulsion will harden where the light hits it, but the drawn areas will block the light. Quickly place the screen over the image where it most evenly fits. Weight the inside of the screen all over with magazines or bricks etc., evenly and firmly. Turn on the light and expose 7 minutes."
        }
      ]
    },
    {
      "name":"Finishing Up",
      "steps":[
        {
          "headline":"Wash out the screen.",
          "description":"Turn off light and wash out the soft emulsion. These first few moments are crucial to the entire process. The screen needs to be thoroughly washed out and each moment it dry’s, the more permanent it becomes. When you can completely see through your image on the screen, then it is completely washed out and has been properly exposed."
        },
        {
          "headline":"Dry and clean.",
          "description":"Allow the screen to thoroughly dry out by placing it in front of the fan, if in a hurry or propped up somewhere to air dry. Clean remaining materials to avoid a mess or clutter."
        },
        {
          "headline":"Print!",
          "description":""
        }
      ]
    }
  ],
  "text":" Setting Up Find a location equipped with running water, electrical, and a dark closet. Things will flow smoothly in this process if everything is properly set up. A garage or small room with blinds, with an easy bathroom access is ideal. Setting up a \"dark room\" in a closet with as little access to light is essential. The area needs to have electricity for the light table and fan in the dark room. Obtain all materials. Your supplies are listed under \"Things You'll Need.\" These materials can be purchased at any craft store such as Dick Blick, Michaels, Joann’s, and Walmart. Set up drop cloth and silkscreen. Using a drop cloth or old newspaper, set up a workspace on the ground against a stable surface such as a wall. Place the screen topside facing out; this is where the emulsion needs to coat the screen. The top of the screen is the outer, flat side. Create a dark room and exposure closet. Coating the screen with the emulsion chemical does not have to be done in complete darkness, just in little light. A dark room can be simply created by having closed blinds, a closed door, and shut off lights. To create an exposure closet, use a drop cloth or old newspaper to create a resting spot for the screen. Place a small fan inside the closet but don’t turn it on yet. Use old fabric or blankets, dark in color, or black garbage bags and tape to the walls to resist as much light as possible. The lights can be on while setting up but need to be off for the next step. Mix and measure emulsion. Make sure the lights are off and blinds are closed. Put rubber gloves on and open the container of emulsion and use the spatula to stir the chemical. Measure ½ cup of chemical for a large screen and pour into the emulsion trough. Disperse evenly so the chemical is stretching the entire width of the trough. Preparing the Screen Coat the screen using the emulsion trough. Make sure the screen is propped up against the wall with the flat surface facing you.Use one hand to hold the screen steady and the other to hold the trough. Using the rounded edge of the trough, squeegee up the back of screen, holding the trough at a 45° angle, and applying even pressure throughout. The entire screen should be covered in emulsion. Then use the sharp edge of the trough, not to apply more emulsion, but to scrape off any excess using the trough the same way. Hold the screen up to the closed blinds and see if there are any holes or missing spots. You can fill these in with a small paintbrush. Set up screen in exposure closet, and  start the timer and fan. When the screen is fully covered and the excess emulsion has been removed, place the screen with the bottom side propped against the wall. Turn the fan on so it will help dry the emulsion faster. Take note of the time and wait one hour before checking the screen. Clean up. Empty the remaining emulsion from the trough back into the container and refrigerate if necessary. Wash the trough, spatula, and measuring cup. Throw away old newspaper or drop cloth. Exposing the Screen Prepare light table. If a light table has been purchased, you simply can plug it in when ready. If constructing one yourself, keep in mind the light needs to evenly be dispersed so plan the lighting according to screen size. Place the lights underneath the table so that no area is more bright than another. Playing around with the lighting in this step is fine as long as the exposure closet is sealed. Prepare image(s) for light table. Using a black marker or paint pen, draw or trace whatever image is to be printed. Use the light table to make sure the black areas are not passing light. Tape the image down to the table securing it in place. Expose screen on light table for 7 minutes. After the screen has been in the closet for one hour and is completely dry it can be exposed. When you place the dried screen over the drawing and expose the whole thing to strong light, the emulsion will harden where the light hits it, but the drawn areas will block the light. Quickly place the screen over the image where it most evenly fits. Weight the inside of the screen all over with magazines or bricks etc., evenly and firmly. Turn on the light and expose 7 minutes. Finishing Up Wash out the screen. Turn off light and wash out the soft emulsion. These first few moments are crucial to the entire process. The screen needs to be thoroughly washed out and each moment it dry’s, the more permanent it becomes. When you can completely see through your image on the screen, then it is completely washed out and has been properly exposed. Dry and clean. Allow the screen to thoroughly dry out by placing it in front of the fan, if in a hurry or propped up somewhere to air dry. Clean remaining materials to avoid a mess or clutter. Print! ",
  "sentences":[
    " Setting Up Find a location equipped with running water, electrical, and a dark closet.",
    "Things will flow smoothly in this process if everything is properly set up.",
    "A garage or small room with blinds, with an easy bathroom access is ideal.",
    "Setting up a \"dark room\" in a closet with as little access to light is essential.",
    "The area needs to have electricity for the light table and fan in the dark room.",
    "Obtain all materials.",
    "Your supplies are listed under \"Things You'll Need.\"",
    "These materials can be purchased at any craft store such as Dick Blick, Michaels, Joann’s, and Walmart.",
    "Set up drop cloth and silkscreen.",
    "Using a drop cloth or old newspaper, set up a workspace on the ground against a stable surface such as a wall.",
    "Place the screen topside facing out; this is where the emulsion needs to coat the screen.",
    "The top of the screen is the outer, flat side.",
    "Create a dark room and exposure closet.",
    "Coating the screen with the emulsion chemical does not have to be done in complete darkness, just in little light.",
    "A dark room can be simply created by having closed blinds, a closed door, and shut off lights.",
    "To create an exposure closet, use a drop cloth or old newspaper to create a resting spot for the screen.",
    "Place a small fan inside the closet but don’t turn it on yet.",
    "Use old fabric or blankets, dark in color, or black garbage bags and tape to the walls to resist as much light as possible.",
    "The lights can be on while setting up but need to be off for the next step.",
    "Mix and measure emulsion.",
    "Make sure the lights are off and blinds are closed.",
    "Put rubber gloves on and open the container of emulsion and use the spatula to stir the chemical.",
    "Measure ½ cup of chemical for a large screen and pour into the emulsion trough.",
    "Disperse evenly so the chemical is stretching the entire width of the trough.",
    "Preparing the Screen Coat the screen using the emulsion trough.",
    "Make sure the screen is propped up against the wall with the flat surface facing you.Use one hand to hold the screen steady and the other to hold the trough.",
    "Using the rounded edge of the trough, squeegee up the back of screen, holding the trough at a 45° angle, and applying even pressure throughout.",
    "The entire screen should be covered in emulsion.",
    "Then use the sharp edge of the trough, not to apply more emulsion, but to scrape off any excess using the trough the same way.",
    "Hold the screen up to the closed blinds and see if there are any holes or missing spots.",
    "You can fill these in with a small paintbrush.",
    "Set up screen in exposure closet, and  start the timer and fan.",
    "When the screen is fully covered and the excess emulsion has been removed, place the screen with the bottom side propped against the wall.",
    "Turn the fan on so it will help dry the emulsion faster.",
    "Take note of the time and wait one hour before checking the screen.",
    "Clean up.",
    "Empty the remaining emulsion from the trough back into the container and refrigerate if necessary.",
    "Wash the trough, spatula, and measuring cup.",
    "Throw away old newspaper or drop cloth.",
    "Exposing the Screen Prepare light table.",
    "If a light table has been purchased, you simply can plug it in when ready.",
    "If constructing one yourself, keep in mind the light needs to evenly be dispersed so plan the lighting according to screen size.",
    "Place the lights underneath the table so that no area is more bright than another.",
    "Playing around with the lighting in this step is fine as long as the exposure closet is sealed.",
    "Prepare image(s) for light table.",
    "Using a black marker or paint pen, draw or trace whatever image is to be printed.",
    "Use the light table to make sure the black areas are not passing light.",
    "Tape the image down to the table securing it in place.",
    "Expose screen on light table for 7 minutes.",
    "After the screen has been in the closet for one hour and is completely dry it can be exposed.",
    "When you place the dried screen over the drawing and expose the whole thing to strong light, the emulsion will harden where the light hits it, but the drawn areas will block the light.",
    "Quickly place the screen over the image where it most evenly fits.",
    "Weight the inside of the screen all over with magazines or bricks etc., evenly and firmly.",
    "Turn on the light and expose 7 minutes.",
    "Finishing Up Wash out the screen.",
    "Turn off light and wash out the soft emulsion.",
    "These first few moments are crucial to the entire process.",
    "The screen needs to be thoroughly washed out and each moment it dry’s, the more permanent it becomes.",
    "When you can completely see through your image on the screen, then it is completely washed out and has been properly exposed.",
    "Dry and clean.",
    "Allow the screen to thoroughly dry out by placing it in front of the fan, if in a hurry or propped up somewhere to air dry.",
    "Clean remaining materials to avoid a mess or clutter.",
    "Print!"
  ],
  "tyn_section":[
    "Opaque black photo image on tracing paper or clear acetate, tape",
    "Silkscreen, any size",
    "Light table or glass table with multiple, bright lights",
    "Photo emulsion chemical",
    "Emulsion trough",
    "Small tip paint brush",
    "Spatula",
    "Measuring cup",
    "Rubber gloves",
    "Old newspaper or magazine",
    "6-8 bricks or miscellaneous heavy objects",
    "Drop cloth",
    "Dark closet or designated area with complete darkness for 1 hour",
    "Fan",
    "Bucket of water or sink access",
    "Scrub brush",
    "Dish soap"
  ],
  "tyn_model":[
    "drop cloth",
    "emulsion",
    "light table",
    "fan",
    "newspaper",
    "spatula",
    "emulsion trough",
    "emulsion chemical",
    "blankets",
    "tape",
    "rubber gloves",
    "timer",
    "container",
    "black marker",
    "paint pen",
    "screen",
    "magazines"
  ],
  "simple_metrics":{
    "r":0.2941176471,
    "p":0.2941176471,
    "f1":0.2941176471,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3529411765,
    "p":0.4117647059,
    "f1":0.3800904977
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3529411765,
    "p":0.4117647059,
    "f1":0.3800904977
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3529411765,
    "p":0.3529411765,
    "f1":0.3529411765
  }
}