{
  "title":"How to Do Tricks with Your Fuzzy Magic Worm",
  "url":"https://www.wikihow.com/Do-Tricks-with-Your-Fuzzy-Magic-Worm",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "parts":[
    {
      "name":"Following trick",
      "steps":[
        {
          "headline":"Make the fuzzy magic worm follow you.",
          "description":"Twist all the way until it is fully extended."
        },
        {
          "headline":"Hold the piece of white cardboard in your hand and make a fist to hide it.",
          "description":""
        },
        {
          "headline":"Make a fist with your other hand and start walking.",
          "description":"The worm will start to follow you. To make it even funnier, pretend you don't know its there, and when turning to see, move your fist so that it goes behind you. This works best on younger children. If you want, try with a younger sibling first."
        }
      ]
    },
    {
      "name":"Hide the worm",
      "steps":[
        {
          "headline":"Make the fuzzy magic worm \"hide\" in a \"cave\".",
          "description":"You will need to extend the worm to about 12 inches and put it under a pillow."
        },
        {
          "headline":"Lean the pillow against the side of the sofa or a chair so that its in a \"cave\".",
          "description":""
        },
        {
          "headline":"Gently tug on the string slowly, with jerks, and out will come the frightened worm.",
          "description":"To make it go back, pretend to view the back of the cave and move your hand with you, therefore pulling it back."
        }
      ]
    },
    {
      "name":"Twist and twirl",
      "steps":[
        {
          "headline":"Make the fuzzy magic worm twist and twirl.",
          "description":"Choose a cylinder, from a pencil to an oven handle, and wrap it around three to five times."
        },
        {
          "headline":"Gently pull and it will twist around the cylinder.",
          "description":"To make it do a little extra, with more \"pizazz\", wrap it on a chair with bars on the back, and do it any pattern you want."
        },
        {
          "headline":"Pull and watch as it goes crazy!",
          "description":""
        }
      ]
    },
    {
      "name":"Jumping worm",
      "steps":[
        {
          "headline":"Make the fuzzy magic worm \"ultra jump\".",
          "description":"Find two flat surfaces that are slightly shorter than the full length of the string."
        },
        {
          "headline":"Put the fuzzy magic worm on surface one, walk behind surface two, and pull!",
          "description":"The magic fuzzy worm will fly through the air and land right in front of you. To make this more believable, stretch your hand out, say, \"come here wormie\" and then pull to put your hand back in place."
        }
      ]
    },
    {
      "name":"Sniff a scent",
      "steps":[
        {
          "headline":"Make the fuzzy magic worm \"sniff\" and \"follow a scent\".",
          "description":"Put it on the ground at full length or long enough so that it is on the ground and when you pull all it does is moves its head."
        },
        {
          "headline":"Gently tug the fuzzy magic worm and move it around, so that only the nose sticks up and it looks like it's sniffing.",
          "description":""
        },
        {
          "headline":"Drag it along.",
          "description":"Stop occasionally for sniffs, and continue. To make this more believable, light a scented candle or make a scent and then start the action!"
        }
      ]
    }
  ],
  "text":" Following trick Make the fuzzy magic worm follow you. Twist all the way until it is fully extended. Hold the piece of white cardboard in your hand and make a fist to hide it.  Make a fist with your other hand and start walking. The worm will start to follow you. To make it even funnier, pretend you don't know its there, and when turning to see, move your fist so that it goes behind you. This works best on younger children. If you want, try with a younger sibling first. Hide the worm Make the fuzzy magic worm \"hide\" in a \"cave\". You will need to extend the worm to about 12 inches and put it under a pillow. Lean the pillow against the side of the sofa or a chair so that its in a \"cave\".  Gently tug on the string slowly, with jerks, and out will come the frightened worm. To make it go back, pretend to view the back of the cave and move your hand with you, therefore pulling it back. Twist and twirl Make the fuzzy magic worm twist and twirl. Choose a cylinder, from a pencil to an oven handle, and wrap it around three to five times. Gently pull and it will twist around the cylinder. To make it do a little extra, with more \"pizazz\", wrap it on a chair with bars on the back, and do it any pattern you want. Pull and watch as it goes crazy!  Jumping worm Make the fuzzy magic worm \"ultra jump\". Find two flat surfaces that are slightly shorter than the full length of the string. Put the fuzzy magic worm on surface one, walk behind surface two, and pull! The magic fuzzy worm will fly through the air and land right in front of you. To make this more believable, stretch your hand out, say, \"come here wormie\" and then pull to put your hand back in place. Sniff a scent Make the fuzzy magic worm \"sniff\" and \"follow a scent\". Put it on the ground at full length or long enough so that it is on the ground and when you pull all it does is moves its head. Gently tug the fuzzy magic worm and move it around, so that only the nose sticks up and it looks like it's sniffing.  Drag it along. Stop occasionally for sniffs, and continue. To make this more believable, light a scented candle or make a scent and then start the action!",
  "sentences":[
    " Following trick Make the fuzzy magic worm follow you.",
    "Twist all the way until it is fully extended.",
    "Hold the piece of white cardboard in your hand and make a fist to hide it.",
    "Make a fist with your other hand and start walking.",
    "The worm will start to follow you.",
    "To make it even funnier, pretend you don't know its there, and when turning to see, move your fist so that it goes behind you.",
    "This works best on younger children.",
    "If you want, try with a younger sibling first.",
    "Hide the worm Make the fuzzy magic worm \"hide\" in a \"cave\".",
    "You will need to extend the worm to about 12 inches and put it under a pillow.",
    "Lean the pillow against the side of the sofa or a chair so that its in a \"cave\".",
    "Gently tug on the string slowly, with jerks, and out will come the frightened worm.",
    "To make it go back, pretend to view the back of the cave and move your hand with you, therefore pulling it back.",
    "Twist and twirl Make the fuzzy magic worm twist and twirl.",
    "Choose a cylinder, from a pencil to an oven handle, and wrap it around three to five times.",
    "Gently pull and it will twist around the cylinder.",
    "To make it do a little extra, with more \"pizazz\", wrap it on a chair with bars on the back, and do it any pattern you want.",
    "Pull and watch as it goes crazy!",
    "Jumping worm Make the fuzzy magic worm \"ultra jump\".",
    "Find two flat surfaces that are slightly shorter than the full length of the string.",
    "Put the fuzzy magic worm on surface one, walk behind surface two, and pull!",
    "The magic fuzzy worm will fly through the air and land right in front of you.",
    "To make this more believable, stretch your hand out, say, \"come here wormie\" and then pull to put your hand back in place.",
    "Sniff a scent Make the fuzzy magic worm \"sniff\" and \"follow a scent\".",
    "Put it on the ground at full length or long enough so that it is on the ground and when you pull all it does is moves its head.",
    "Gently tug the fuzzy magic worm and move it around, so that only the nose sticks up and it looks like it's sniffing.",
    "Drag it along.",
    "Stop occasionally for sniffs, and continue.",
    "To make this more believable, light a scented candle or make a scent and then start the action!"
  ],
  "tyn_section":[
    "Fuzzy magic worm",
    "Props (as required)"
  ],
  "tyn_model":[
    "fuzzy magic worm",
    "pillow",
    "cardboard",
    "pencil",
    "chair",
    "magic fuzzy worm",
    "scented candle"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1428571429,
    "f1":0.2222222222,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2857142857,
    "f1":0.3636363636
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.2857142857,
    "f1":0.3636363636
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.2857142857,
    "f1":0.3636363636
  }
}