{
  "title":"How to Make a Leaf Rubbing",
  "url":"https://www.wikihow.com/Make-a-Leaf-Rubbing",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Leaf and Flower Crafts"
  ],
  "steps":[
    {
      "headline":"Find a good leaf to draw from.",
      "description":"Look at the texture and features on the leaf. Are there holes on it? Has it dropped on the ground recently or has it been on the ground for some time?"
    },
    {
      "headline":"Place the leaf on a hard surface.",
      "description":"A good suggestion is to use a notebook or a piece of cardboard. Put the leaf \"veins\" towards you (the bottom of the leaf)."
    },
    {
      "headline":"Put a white sheet of paper on the leaf.",
      "description":"To prevent the leaf from moving, you can tape it down on the hard surface."
    },
    {
      "headline":"Rub a crayon, pastel pencil, colored pencil or marker on its side and gently color on the layered paper over the leaf.",
      "description":"Notice that you'll be \"drawing\" the leaf on the paper."
    },
    {
      "headline":"Repeat this craft with other leaves and colors.",
      "description":"Use soft and hard leaves to compare how drawings come out."
    }
  ],
  "text":" Find a good leaf to draw from. Look at the texture and features on the leaf. Are there holes on it? Has it dropped on the ground recently or has it been on the ground for some time? Place the leaf on a hard surface. A good suggestion is to use a notebook or a piece of cardboard. Put the leaf \"veins\" towards you (the bottom of the leaf). Put a white sheet of paper on the leaf. To prevent the leaf from moving, you can tape it down on the hard surface. Rub a crayon, pastel pencil, colored pencil or marker on its side and gently color on the layered paper over the leaf. Notice that you'll be \"drawing\" the leaf on the paper. Repeat this craft with other leaves and colors. Use soft and hard leaves to compare how drawings come out.",
  "sentences":[
    " Find a good leaf to draw from.",
    "Look at the texture and features on the leaf.",
    "Are there holes on it?",
    "Has it dropped on the ground recently or has it been on the ground for some time?",
    "Place the leaf on a hard surface.",
    "A good suggestion is to use a notebook or a piece of cardboard.",
    "Put the leaf \"veins\" towards you (the bottom of the leaf).",
    "Put a white sheet of paper on the leaf.",
    "To prevent the leaf from moving, you can tape it down on the hard surface.",
    "Rub a crayon, pastel pencil, colored pencil or marker on its side and gently color on the layered paper over the leaf.",
    "Notice that you'll be \"drawing\" the leaf on the paper.",
    "Repeat this craft with other leaves and colors.",
    "Use soft and hard leaves to compare how drawings come out."
  ],
  "tyn_section":[
    "Crayons, pastels, or pencils",
    "Leaves (preferably green)",
    "A hard, flat surface",
    "White paper or a sketch book",
    "Tape (optional)"
  ],
  "tyn_model":[
    "paper",
    "notebook",
    "cardboard",
    "crayon",
    "pastel pencil",
    "colored pencil"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}