{
  "title":"How to Reborn a Doll",
  "url":"https://www.wikihow.com/Reborn-a-Doll",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Dolls and Doll Houses",
    "Baby and Newborn Dolls"
  ],
  "parts":[
    {
      "name":"Supplies",
      "steps":[
        {
          "headline":"Purchase a kit from a recommended reborn doll parts company.",
          "description":"This is the easiest way to complete your first doll. Once you get a feel for the colors and doll making you can experiment with your own way of doll making. The kit should contain everything you need to complete the project such as paints, stuffing materials, body, doll limbs, mohair, and the tools to complete the doll. A doll making kit should cost around $150 and will contain almost everything needed for your first project. If you do not purchase a kit, the following suggested items will help you get started in reborning. There are purchasing links listed in the sources section of this article."
        },
        {
          "headline":"Purchase the doll parts to complete the project.",
          "description":"Most dolls will need a head, arms, legs, cloth body, hair. If you are reborning an open-eyed baby, you will need to purchase eyes and perhaps eye lashes, if you choose not to buy a doll making kit."
        },
        {
          "headline":"Purchase a rooting tool.",
          "description":""
        },
        {
          "headline":"Purchase pantyhose (to fill with beads) and other fillers as required for the project.",
          "description":""
        },
        {
          "headline":"Purchase paint supplies.",
          "description":"Most reborn artists use paints which will require the purchase of an oven, preferably a convection oven. You will need to purchase paints, paint brushes, perhaps sea sponges or berry makers.Many reborn artists use air-dry paints. If you choose to use air-dry paints, make sure to follow the directions, as there may be slight variations in technique depending on the paints."
        }
      ]
    },
    {
      "name":"Creating the Doll",
      "steps":[
        {
          "headline":"Wash all the doll parts and let dry thoroughly.",
          "description":"Try to find a dish detergent that works well to remove oils and to clean your doll. You can search online to find out what reborn artists recommend when it comes to selecting the best dish detergent to use."
        },
        {
          "headline":"Paint veins on the head and anywhere else you'd like veining.",
          "description":"Typical areas to find veining would be on the backs of the hands and the bottom of the feet. Look at photos of babies to get a good idea of where to place the veins. Use a very thin paint, almost like watercolor, to paint the veins. Light layers of paint are what is needed to paint a reborn doll."
        },
        {
          "headline":"Line a baking sheet or baking tray with a dish towel or tea towel.",
          "description":"Place the doll parts onto the towel."
        },
        {
          "headline":"Bake the doll parts that have had veins applied.",
          "description":"The temperature is usually between 260 to 265 °F (127 to 129 °C) for 8 minutes to set the paint."
        },
        {
          "headline":"Remove the doll parts and let cool.",
          "description":""
        },
        {
          "headline":"Apply a thin wash of flesh tone colored paint in a pouncing motion using a mop brush or sponge, your choice,  to the doll parts.",
          "description":"Be sure to use a very thin, almost watercolor consistency paint, otherwise your doll will end up looking chalky. Bake according to the previous directions. Let it cool."
        },
        {
          "headline":"Reapply several thin layers of flesh tone and mottling layers of colored paint using a brush or sponge.",
          "description":"Bake to set paint."
        },
        {
          "headline":"Apply a thin wash of blushing to create a newborn blotchy look.",
          "description":"Typical places to blush would include the bottoms of the feet (use a \"U\" motion to paint around the outer edges of the sole); in baby creases (do this delicately) and across the bridge of the nose and cheeks. Use a sea sponge or mop brush to pounce the paint. Bake to set paint using previous directions."
        },
        {
          "headline":"Paint the nails and lips.",
          "description":"Use a filbert paint brush to apply the paint. Apply one layer of paint to the nails and several layers to the lips. Bake as directed above to set the paint."
        },
        {
          "headline":"Paint the eyelids with fine veining using a script liner brush.",
          "description":"Use a delicate hand, and thinned paint, to carefully paint veins on the eyelids. Use a purplish paint that looks much like Dioxide purple. Bake the doll parts as directed to set the paint."
        },
        {
          "headline":"Paint the eye brows using a script liner brush and a delicate hand.",
          "description":"The paint should be very thin so the brows look delicate when painted onto the face. Bake the doll parts as directed to set the paint."
        },
        {
          "headline":"Apply the nail tips using a liner brush or toothpick.",
          "description":"Use a whitish paint and delicately apply a dab of paint following the curvature of the nail. Bake the doll parts as directed to set the paint."
        }
      ]
    },
    {
      "name":"Rooting the Hair and Eyelashes",
      "steps":[
        {
          "headline":"Cut the mohair into manageable lengths, around 3 inches (7.6 cm).",
          "description":""
        },
        {
          "headline":"Insert the hair into the scalp using the rooting tool and felt needles.",
          "description":""
        },
        {
          "headline":"Glue the hair from inside the head cavity.",
          "description":"Add a good dollop of glue to inside of the head cavity in the scalp area. You can search online to discover what reborn artists recommend for gluing hair. Use a hemostat or other long gripping tool and a sponge to smear the glue around. Let dry."
        },
        {
          "headline":"Root the eyelashes.",
          "description":"The eyelashes are rooted the same way. Root the eyelashes in and then glue them from inside the doll head."
        },
        {
          "headline":"Trim the scalp hair as desired.",
          "description":"Look at newborn babies to get a general idea of how to style the hair. Some artists use a razor comb to style the hair as this helps create a realistic hair cut."
        },
        {
          "headline":"Dampen the hair with water and place a cut off nylon, or nylon sock,  on the head to hold the hair down.",
          "description":"Let it dry."
        },
        {
          "headline":"Style the hair as desired.",
          "description":""
        }
      ]
    },
    {
      "name":"Assembling the Doll",
      "steps":[
        {
          "headline":"Follow the kit directions or directions given for the purchased doll parts.",
          "description":"In general, line the body cavities with cut off pantyhose and fill with beads or other filler to weight the body and head. Secure the nylons and place in appropriate doll cavities."
        },
        {
          "headline":"Assemble the doll parts following the kit or purchased body directions.",
          "description":""
        },
        {
          "headline":"Diaper your doll, if appropriate.",
          "description":""
        },
        {
          "headline":"Dress your doll in desired outfit.",
          "description":""
        }
      ]
    }
  ],
  "text":" Supplies Purchase a kit from a recommended reborn doll parts company. This is the easiest way to complete your first doll. Once you get a feel for the colors and doll making you can experiment with your own way of doll making. The kit should contain everything you need to complete the project such as paints, stuffing materials, body, doll limbs, mohair, and the tools to complete the doll. A doll making kit should cost around $150 and will contain almost everything needed for your first project. If you do not purchase a kit, the following suggested items will help you get started in reborning. There are purchasing links listed in the sources section of this article. Purchase the doll parts to complete the project. Most dolls will need a head, arms, legs, cloth body, hair. If you are reborning an open-eyed baby, you will need to purchase eyes and perhaps eye lashes, if you choose not to buy a doll making kit. Purchase a rooting tool.  Purchase pantyhose (to fill with beads) and other fillers as required for the project.  Purchase paint supplies. Most reborn artists use paints which will require the purchase of an oven, preferably a convection oven. You will need to purchase paints, paint brushes, perhaps sea sponges or berry makers.Many reborn artists use air-dry paints. If you choose to use air-dry paints, make sure to follow the directions, as there may be slight variations in technique depending on the paints. Creating the Doll Wash all the doll parts and let dry thoroughly. Try to find a dish detergent that works well to remove oils and to clean your doll. You can search online to find out what reborn artists recommend when it comes to selecting the best dish detergent to use. Paint veins on the head and anywhere else you'd like veining. Typical areas to find veining would be on the backs of the hands and the bottom of the feet. Look at photos of babies to get a good idea of where to place the veins. Use a very thin paint, almost like watercolor, to paint the veins. Light layers of paint are what is needed to paint a reborn doll. Line a baking sheet or baking tray with a dish towel or tea towel. Place the doll parts onto the towel. Bake the doll parts that have had veins applied. The temperature is usually between 260 to 265 °F (127 to 129 °C) for 8 minutes to set the paint. Remove the doll parts and let cool.  Apply a thin wash of flesh tone colored paint in a pouncing motion using a mop brush or sponge, your choice,  to the doll parts. Be sure to use a very thin, almost watercolor consistency paint, otherwise your doll will end up looking chalky. Bake according to the previous directions. Let it cool. Reapply several thin layers of flesh tone and mottling layers of colored paint using a brush or sponge. Bake to set paint. Apply a thin wash of blushing to create a newborn blotchy look. Typical places to blush would include the bottoms of the feet (use a \"U\" motion to paint around the outer edges of the sole); in baby creases (do this delicately) and across the bridge of the nose and cheeks. Use a sea sponge or mop brush to pounce the paint. Bake to set paint using previous directions. Paint the nails and lips. Use a filbert paint brush to apply the paint. Apply one layer of paint to the nails and several layers to the lips. Bake as directed above to set the paint. Paint the eyelids with fine veining using a script liner brush. Use a delicate hand, and thinned paint, to carefully paint veins on the eyelids. Use a purplish paint that looks much like Dioxide purple. Bake the doll parts as directed to set the paint. Paint the eye brows using a script liner brush and a delicate hand. The paint should be very thin so the brows look delicate when painted onto the face. Bake the doll parts as directed to set the paint. Apply the nail tips using a liner brush or toothpick. Use a whitish paint and delicately apply a dab of paint following the curvature of the nail. Bake the doll parts as directed to set the paint. Rooting the Hair and Eyelashes Cut the mohair into manageable lengths, around 3 inches (7.6 cm).  Insert the hair into the scalp using the rooting tool and felt needles.  Glue the hair from inside the head cavity. Add a good dollop of glue to inside of the head cavity in the scalp area. You can search online to discover what reborn artists recommend for gluing hair. Use a hemostat or other long gripping tool and a sponge to smear the glue around. Let dry. Root the eyelashes. The eyelashes are rooted the same way. Root the eyelashes in and then glue them from inside the doll head. Trim the scalp hair as desired. Look at newborn babies to get a general idea of how to style the hair. Some artists use a razor comb to style the hair as this helps create a realistic hair cut. Dampen the hair with water and place a cut off nylon, or nylon sock,  on the head to hold the hair down. Let it dry. Style the hair as desired.  Assembling the Doll Follow the kit directions or directions given for the purchased doll parts. In general, line the body cavities with cut off pantyhose and fill with beads or other filler to weight the body and head. Secure the nylons and place in appropriate doll cavities. Assemble the doll parts following the kit or purchased body directions.  Diaper your doll, if appropriate.  Dress your doll in desired outfit. ",
  "sentences":[
    " Supplies Purchase a kit from a recommended reborn doll parts company.",
    "This is the easiest way to complete your first doll.",
    "Once you get a feel for the colors and doll making you can experiment with your own way of doll making.",
    "The kit should contain everything you need to complete the project such as paints, stuffing materials, body, doll limbs, mohair, and the tools to complete the doll.",
    "A doll making kit should cost around $150 and will contain almost everything needed for your first project.",
    "If you do not purchase a kit, the following suggested items will help you get started in reborning.",
    "There are purchasing links listed in the sources section of this article.",
    "Purchase the doll parts to complete the project.",
    "Most dolls will need a head, arms, legs, cloth body, hair.",
    "If you are reborning an open-eyed baby, you will need to purchase eyes and perhaps eye lashes, if you choose not to buy a doll making kit.",
    "Purchase a rooting tool.",
    "Purchase pantyhose (to fill with beads) and other fillers as required for the project.",
    "Purchase paint supplies.",
    "Most reborn artists use paints which will require the purchase of an oven, preferably a convection oven.",
    "You will need to purchase paints, paint brushes, perhaps sea sponges or berry makers.Many reborn artists use air-dry paints.",
    "If you choose to use air-dry paints, make sure to follow the directions, as there may be slight variations in technique depending on the paints.",
    "Creating the Doll Wash all the doll parts and let dry thoroughly.",
    "Try to find a dish detergent that works well to remove oils and to clean your doll.",
    "You can search online to find out what reborn artists recommend when it comes to selecting the best dish detergent to use.",
    "Paint veins on the head and anywhere else you'd like veining.",
    "Typical areas to find veining would be on the backs of the hands and the bottom of the feet.",
    "Look at photos of babies to get a good idea of where to place the veins.",
    "Use a very thin paint, almost like watercolor, to paint the veins.",
    "Light layers of paint are what is needed to paint a reborn doll.",
    "Line a baking sheet or baking tray with a dish towel or tea towel.",
    "Place the doll parts onto the towel.",
    "Bake the doll parts that have had veins applied.",
    "The temperature is usually between 260 to 265 °F (127 to 129 °C) for 8 minutes to set the paint.",
    "Remove the doll parts and let cool.",
    "Apply a thin wash of flesh tone colored paint in a pouncing motion using a mop brush or sponge, your choice,  to the doll parts.",
    "Be sure to use a very thin, almost watercolor consistency paint, otherwise your doll will end up looking chalky.",
    "Bake according to the previous directions.",
    "Let it cool.",
    "Reapply several thin layers of flesh tone and mottling layers of colored paint using a brush or sponge.",
    "Bake to set paint.",
    "Apply a thin wash of blushing to create a newborn blotchy look.",
    "Typical places to blush would include the bottoms of the feet (use a \"U\" motion to paint around the outer edges of the sole); in baby creases (do this delicately) and across the bridge of the nose and cheeks.",
    "Use a sea sponge or mop brush to pounce the paint.",
    "Bake to set paint using previous directions.",
    "Paint the nails and lips.",
    "Use a filbert paint brush to apply the paint.",
    "Apply one layer of paint to the nails and several layers to the lips.",
    "Bake as directed above to set the paint.",
    "Paint the eyelids with fine veining using a script liner brush.",
    "Use a delicate hand, and thinned paint, to carefully paint veins on the eyelids.",
    "Use a purplish paint that looks much like Dioxide purple.",
    "Bake the doll parts as directed to set the paint.",
    "Paint the eye brows using a script liner brush and a delicate hand.",
    "The paint should be very thin so the brows look delicate when painted onto the face.",
    "Bake the doll parts as directed to set the paint.",
    "Apply the nail tips using a liner brush or toothpick.",
    "Use a whitish paint and delicately apply a dab of paint following the curvature of the nail.",
    "Bake the doll parts as directed to set the paint.",
    "Rooting the Hair and Eyelashes Cut the mohair into manageable lengths, around 3 inches (7.6 cm).",
    "Insert the hair into the scalp using the rooting tool and felt needles.",
    "Glue the hair from inside the head cavity.",
    "Add a good dollop of glue to inside of the head cavity in the scalp area.",
    "You can search online to discover what reborn artists recommend for gluing hair.",
    "Use a hemostat or other long gripping tool and a sponge to smear the glue around.",
    "Let dry.",
    "Root the eyelashes.",
    "The eyelashes are rooted the same way.",
    "Root the eyelashes in and then glue them from inside the doll head.",
    "Trim the scalp hair as desired.",
    "Look at newborn babies to get a general idea of how to style the hair.",
    "Some artists use a razor comb to style the hair as this helps create a realistic hair cut.",
    "Dampen the hair with water and place a cut off nylon, or nylon sock,  on the head to hold the hair down.",
    "Let it dry.",
    "Style the hair as desired.",
    "Assembling the Doll Follow the kit directions or directions given for the purchased doll parts.",
    "In general, line the body cavities with cut off pantyhose and fill with beads or other filler to weight the body and head.",
    "Secure the nylons and place in appropriate doll cavities.",
    "Assemble the doll parts following the kit or purchased body directions.",
    "Diaper your doll, if appropriate.",
    "Dress your doll in desired outfit."
  ],
  "tyn_section":[
    "Paint brushes such as mop brushes, liner brushes, brushes that work with your hands and creative ability.",
    "Favorite brand of paint for reborning. Some of the older styles of reborn dolls were painted with oils or acrylic paints.",
    "Paint palette or other palette based on the type of paint using. Some paints require a specific palette so the paints can work correctly. Check to make sure you purchase the correct palette.",
    "Sea sponge or berry brushes for texturing",
    "Cosmetic sponges",
    "Cotton balls",
    "Paper towels for keeping hands clean",
    "Toothpicks",
    "Dish towel or tea towel for baking. Plan to use an old towel as this towel should only be used for doll making.",
    "Micro-rooting tool",
    "Mohair, or other favorite hair for rooting the doll head and eyelashes",
    "Hemostat for gluing the hair",
    "Scissors or another cutting tool for cutting hair and eyelashes",
    "Oven thermometer",
    "Convection oven",
    "Cooling racks",
    "Oven mitts"
  ],
  "tyn_model":[
    "paint",
    "paints",
    "glue",
    "sponge",
    "mohair",
    "pantyhose",
    "air-dry paints",
    "dish detergent",
    "script liner brush",
    "doll making",
    "doll making kit",
    "paint brushes",
    "sea sponges",
    "berry makers",
    "baking sheet",
    "baking tray",
    "dish towel",
    "tea towel",
    "mop brush",
    "colored paint",
    "sea sponge",
    "filbert paint brush",
    "dioxide purple",
    "liner brush",
    "rooting tool",
    "felt needles",
    "water",
    "beads",
    "nylons"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.1176470588,
    "p":0.0689655172,
    "f1":0.0869565217
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}