{
  "title":"How to Play Fugitive (Night Game)",
  "url":"https://www.wikihow.com/Play-Fugitive-(Night-Game)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Hiding Games"
  ],
  "methods":[
    {
      "name":"Setting up the Game",
      "steps":[
        {
          "headline":"Gather 4 or more people to play.",
          "description":"You’ll need an equal number of players on each team. Split your players into 2 groups: the fugitives and the cops. You can divide people randomly, such as by having them draw their role out of a hat or choose team captains and have them pick their team members 1 at a time. This game is best for teens and adults as it involves traveling over a long distance and hiding along the way."
        },
        {
          "headline":"Choose a point A and point B for the game.",
          "description":"Fugitive is best played over a walking-friendly area of 2-5 miles, so select a point A and point B that the players can safely travel through. The fugitives, drivers, and chasers will all start at point A and travel towards point B. The first fugitive to reach point B is the winner of the game. If you’re playing fugitive in your neighborhood, then you might make your backyard the starting point and make a local playground the ending point. You may also want to set some ground rules before the game begins to specify what areas are and are not okay to travel through. Be careful not to play fugitive in areas with a lot of traffic. Choose side roads and quiet streets in residential areas to travel through."
        },
        {
          "headline":"Designate drivers and chasers if the cops will pursue fugitives in cars.",
          "description":"If you decide to play the game with cars, you’ll also need to designate drivers and chasers. These players will travel in the car looking for fugitives. If they spot a fugitive, the chaser can get out of the car and go after them. If the chaser tags the fugitive, they are out and they will have to get into the car with the driver and chaser.Tip: If you don’t want to incorporate cars into your game of fugitive, give the cops flashlights to distinguish them from the other players. The cops could also be allowed to use bikes if you don’t want to use cars."
        },
        {
          "headline":"Set a time limit before the game begins.",
          "description":"Fugitive can go on for hours, so it may be a good idea to set an official end time for the game. At this point, all players must meet up at the end point. Any fugitives who make it to the end point without being caught by the cops are safe. For example, if the game starts at 8:00 pm, you might decide to end it at 11:00 pm."
        }
      ]
    },
    {
      "name":"Playing the Game",
      "steps":[
        {
          "headline":"Give the fugitives a 5 minute head start if you’re using cars.",
          "description":"Once the players are divided into their teams, have the cops close their eyes or turn away. Allow the fugitives a 5 minute head start. The cops can go considerably faster than the fugitives if the cops are using cars. The cops could also use bikes if you dont want to use cars."
        },
        {
          "headline":"Have the cops close their eyes and count to 100 if they will be on foot.",
          "description":"If the cops are not using cars, the fugitives won't need as much of a head start. Have the cops close their eyes and count to 100 before they take off in pursuit of the fugitives."
        },
        {
          "headline":"Send the cops in pursuit of the fugitives.",
          "description":"The fugitives can travel towards their destination using any path they like, and this is wise since it will help them to hide from the cops. The cops may pursue the fugitives along any route they like as well. If a cop sees a fugitive, their chaser can get out and go after them. If a chaser tags a fugitive, that person is out of the game and must get into the car or walk along with the cop and chaser."
        },
        {
          "headline":"Drop off fugitives at the end point if they are caught.",
          "description":"The fugitives can ride along with the drivers and chasers if there’s room in the car. If the car fills up or if the cops want to drop off fugitives as they go, the cops can drop the fugitives off at the end point with the understanding that they are out.Tip: You may want to designate a cop to act as the guard at the end point and make sure that any players who have been caught do not try to leave and reenter the game."
        },
        {
          "headline":"Avoid trespassing or doing anything else that is illegal while you play.",
          "description":"Fugitives are on foot and will need to hide and run from the cops pursuing them in a car. However, it’s important to stay safe and avoid doing anything illegal while you play the game. Don’t trespass or vandalize anything in your quest to reach the end point."
        }
      ]
    },
    {
      "name":"Winning the Game",
      "steps":[
        {
          "headline":"Wait and watch in areas that you think fugitives might travel through.",
          "description":"This is a great strategy for cops. If you suspect that fugitives may come through an area or that they may be hiding, park your car, turn off the lights, and wait. When you spot a fugitive, your chaser can go after them on foot and take them by surprise.Tip: If you're the driver, you can also get out of the car and pursue fugitives on foot if you want to. However, this can put you at a disadvantage since you’ll be leaving your car behind."
        },
        {
          "headline":"Catch as many fugitives as possible if you’re a cop.",
          "description":"To win fugitive as a cop, your goal is to prevent any of the fugitives from reaching the end point. To do this, catch as many fugitives as possible and deliver them to the end point. You might want to keep a tally of the number of fugitives you have caught."
        },
        {
          "headline":"Make it to the end point first if you’re a fugitive.",
          "description":"If you’re playing the game as a fugitive, your goal is to make it to the end point before anyone else without getting caught. However, even if you don’t make it to the end point first, arriving without being caught will still mean that you are safe. Try to find a good hiding place and slowly move towards point B, finding more hiding places as you go. Once you are close enough, run as quickly and as silently as you can and try to make it to point B without getting tagged."
        }
      ]
    }
  ],
  "text":" Setting up the Game Gather 4 or more people to play. You’ll need an equal number of players on each team. Split your players into 2 groups: the fugitives and the cops. You can divide people randomly, such as by having them draw their role out of a hat or choose team captains and have them pick their team members 1 at a time. This game is best for teens and adults as it involves traveling over a long distance and hiding along the way. Choose a point A and point B for the game. Fugitive is best played over a walking-friendly area of 2-5 miles, so select a point A and point B that the players can safely travel through. The fugitives, drivers, and chasers will all start at point A and travel towards point B. The first fugitive to reach point B is the winner of the game. If you’re playing fugitive in your neighborhood, then you might make your backyard the starting point and make a local playground the ending point. You may also want to set some ground rules before the game begins to specify what areas are and are not okay to travel through. Be careful not to play fugitive in areas with a lot of traffic. Choose side roads and quiet streets in residential areas to travel through. Designate drivers and chasers if the cops will pursue fugitives in cars. If you decide to play the game with cars, you’ll also need to designate drivers and chasers. These players will travel in the car looking for fugitives. If they spot a fugitive, the chaser can get out of the car and go after them. If the chaser tags the fugitive, they are out and they will have to get into the car with the driver and chaser.Tip: If you don’t want to incorporate cars into your game of fugitive, give the cops flashlights to distinguish them from the other players. The cops could also be allowed to use bikes if you don’t want to use cars. Set a time limit before the game begins. Fugitive can go on for hours, so it may be a good idea to set an official end time for the game. At this point, all players must meet up at the end point. Any fugitives who make it to the end point without being caught by the cops are safe. For example, if the game starts at 8:00 pm, you might decide to end it at 11:00 pm. Playing the Game Give the fugitives a 5 minute head start if you’re using cars. Once the players are divided into their teams, have the cops close their eyes or turn away. Allow the fugitives a 5 minute head start. The cops can go considerably faster than the fugitives if the cops are using cars. The cops could also use bikes if you dont want to use cars. Have the cops close their eyes and count to 100 if they will be on foot. If the cops are not using cars, the fugitives won't need as much of a head start. Have the cops close their eyes and count to 100 before they take off in pursuit of the fugitives. Send the cops in pursuit of the fugitives. The fugitives can travel towards their destination using any path they like, and this is wise since it will help them to hide from the cops. The cops may pursue the fugitives along any route they like as well. If a cop sees a fugitive, their chaser can get out and go after them. If a chaser tags a fugitive, that person is out of the game and must get into the car or walk along with the cop and chaser. Drop off fugitives at the end point if they are caught. The fugitives can ride along with the drivers and chasers if there’s room in the car. If the car fills up or if the cops want to drop off fugitives as they go, the cops can drop the fugitives off at the end point with the understanding that they are out.Tip: You may want to designate a cop to act as the guard at the end point and make sure that any players who have been caught do not try to leave and reenter the game. Avoid trespassing or doing anything else that is illegal while you play. Fugitives are on foot and will need to hide and run from the cops pursuing them in a car. However, it’s important to stay safe and avoid doing anything illegal while you play the game. Don’t trespass or vandalize anything in your quest to reach the end point. Winning the Game Wait and watch in areas that you think fugitives might travel through. This is a great strategy for cops. If you suspect that fugitives may come through an area or that they may be hiding, park your car, turn off the lights, and wait. When you spot a fugitive, your chaser can go after them on foot and take them by surprise.Tip: If you're the driver, you can also get out of the car and pursue fugitives on foot if you want to. However, this can put you at a disadvantage since you’ll be leaving your car behind. Catch as many fugitives as possible if you’re a cop. To win fugitive as a cop, your goal is to prevent any of the fugitives from reaching the end point. To do this, catch as many fugitives as possible and deliver them to the end point. You might want to keep a tally of the number of fugitives you have caught. Make it to the end point first if you’re a fugitive. If you’re playing the game as a fugitive, your goal is to make it to the end point before anyone else without getting caught. However, even if you don’t make it to the end point first, arriving without being caught will still mean that you are safe. Try to find a good hiding place and slowly move towards point B, finding more hiding places as you go. Once you are close enough, run as quickly and as silently as you can and try to make it to point B without getting tagged.",
  "sentences":[
    " Setting up the Game Gather 4 or more people to play.",
    "You’ll need an equal number of players on each team.",
    "Split your players into 2 groups: the fugitives and the cops.",
    "You can divide people randomly, such as by having them draw their role out of a hat or choose team captains and have them pick their team members 1 at a time.",
    "This game is best for teens and adults as it involves traveling over a long distance and hiding along the way.",
    "Choose a point A and point B for the game.",
    "Fugitive is best played over a walking-friendly area of 2-5 miles, so select a point A and point B that the players can safely travel through.",
    "The fugitives, drivers, and chasers will all start at point A and travel towards point B.",
    "The first fugitive to reach point B is the winner of the game.",
    "If you’re playing fugitive in your neighborhood, then you might make your backyard the starting point and make a local playground the ending point.",
    "You may also want to set some ground rules before the game begins to specify what areas are and are not okay to travel through.",
    "Be careful not to play fugitive in areas with a lot of traffic.",
    "Choose side roads and quiet streets in residential areas to travel through.",
    "Designate drivers and chasers if the cops will pursue fugitives in cars.",
    "If you decide to play the game with cars, you’ll also need to designate drivers and chasers.",
    "These players will travel in the car looking for fugitives.",
    "If they spot a fugitive, the chaser can get out of the car and go after them.",
    "If the chaser tags the fugitive, they are out and they will have to get into the car with the driver and chaser.Tip: If you don’t want to incorporate cars into your game of fugitive, give the cops flashlights to distinguish them from the other players.",
    "The cops could also be allowed to use bikes if you don’t want to use cars.",
    "Set a time limit before the game begins.",
    "Fugitive can go on for hours, so it may be a good idea to set an official end time for the game.",
    "At this point, all players must meet up at the end point.",
    "Any fugitives who make it to the end point without being caught by the cops are safe.",
    "For example, if the game starts at 8:00 pm, you might decide to end it at 11:00 pm.",
    "Playing the Game Give the fugitives a 5 minute head start if you’re using cars.",
    "Once the players are divided into their teams, have the cops close their eyes or turn away.",
    "Allow the fugitives a 5 minute head start.",
    "The cops can go considerably faster than the fugitives if the cops are using cars.",
    "The cops could also use bikes if you dont want to use cars.",
    "Have the cops close their eyes and count to 100 if they will be on foot.",
    "If the cops are not using cars, the fugitives won't need as much of a head start.",
    "Have the cops close their eyes and count to 100 before they take off in pursuit of the fugitives.",
    "Send the cops in pursuit of the fugitives.",
    "The fugitives can travel towards their destination using any path they like, and this is wise since it will help them to hide from the cops.",
    "The cops may pursue the fugitives along any route they like as well.",
    "If a cop sees a fugitive, their chaser can get out and go after them.",
    "If a chaser tags a fugitive, that person is out of the game and must get into the car or walk along with the cop and chaser.",
    "Drop off fugitives at the end point if they are caught.",
    "The fugitives can ride along with the drivers and chasers if there’s room in the car.",
    "If the car fills up or if the cops want to drop off fugitives as they go, the cops can drop the fugitives off at the end point with the understanding that they are out.Tip: You may want to designate a cop to act as the guard at the end point and make sure that any players who have been caught do not try to leave and reenter the game.",
    "Avoid trespassing or doing anything else that is illegal while you play.",
    "Fugitives are on foot and will need to hide and run from the cops pursuing them in a car.",
    "However, it’s important to stay safe and avoid doing anything illegal while you play the game.",
    "Don’t trespass or vandalize anything in your quest to reach the end point.",
    "Winning the Game Wait and watch in areas that you think fugitives might travel through.",
    "This is a great strategy for cops.",
    "If you suspect that fugitives may come through an area or that they may be hiding, park your car, turn off the lights, and wait.",
    "When you spot a fugitive, your chaser can go after them on foot and take them by surprise.Tip: If you're the driver, you can also get out of the car and pursue fugitives on foot if you want to.",
    "However, this can put you at a disadvantage since you’ll be leaving your car behind.",
    "Catch as many fugitives as possible if you’re a cop.",
    "To win fugitive as a cop, your goal is to prevent any of the fugitives from reaching the end point.",
    "To do this, catch as many fugitives as possible and deliver them to the end point.",
    "You might want to keep a tally of the number of fugitives you have caught.",
    "Make it to the end point first if you’re a fugitive.",
    "If you’re playing the game as a fugitive, your goal is to make it to the end point before anyone else without getting caught.",
    "However, even if you don’t make it to the end point first, arriving without being caught will still mean that you are safe.",
    "Try to find a good hiding place and slowly move towards point B, finding more hiding places as you go.",
    "Once you are close enough, run as quickly and as silently as you can and try to make it to point B without getting tagged."
  ],
  "tyn_section":[
    "Cars (optional)",
    "Flashlights (optional)",
    "Safe area to play in"
  ],
  "tyn_model":[
    "cars",
    "bikes",
    "fugitive",
    "chaser"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.25,
    "f1":0.2857142857
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.25,
    "f1":0.2857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}