{
  "title":"How to Cross Hatch",
  "url":"https://www.wikihow.com/Cross-Hatch",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Learning to Draw",
    "Advanced Drawing Skills"
  ],
  "parts":[
    {
      "name":"Learning Cross Hatching Basics",
      "steps":[
        {
          "headline":"Draw a series of parallel lines.",
          "description":"This is called basic hatching, and it’s the first step in cross hatching. There are two types of basic hatching: parallel and contour. Both can be used as a base for cross hatching. Regardless of which hatching type you use, the lines do not cross over one another in standard hatching. You should also try to keep your lines equally spaced out for seamless, smooth shading. With parallel hatching, your lines should remain straight and run vertically or horizontally. With contour hatching, your lines should follow the contour of the outline you’re shading. When you add basic hatching to your drawing, you'll use this skill to draw parallel lines over the area you wish to shade. Practice this by drawing a series of hatching lines on a piece of scrap paper."
        },
        {
          "headline":"Add a perpendicular series of lines over the first.",
          "description":"To use cross hatching in your drawing, draw a second layer of lines over the first set, going in the opposite direction. This second layer of hatch marks should cross over the first in perpendicular or near-perpendicular directions. The lines of the second layer should not cross over one another, though. Your cross hatch marks should match the hatch mark type used in your base layer. For example, if you started with parallel hatch marks, your cross hatch marks should also be parallel. Practice this by adding a set of cross hatching lines over your hatching."
        },
        {
          "headline":"Draw fewer lines spread further apart to create lighter shading.",
          "description":"You can vary the shadow’s value by varying the number of lines you draw. In areas that require lighter shading, draw fewer hatching lines and space them further apart from each other."
        },
        {
          "headline":"Increase the lines’ density or add layers to imply darker shading.",
          "description":"In sections of your drawing that require deeper shadows, increase the number of lines and place them closer together. You can also layer additional series of cross hatching lines to make that area appear darker and more heavily shaded. Alternate directions when adding layers of cross hatching lines. For example, start with a set of vertical lines, then a horizontal set, then a diagonal set, then an opposite diagonal set. This will allow you to build up a deeper, darker shadow effect."
        },
        {
          "headline":"Add depth with fine cross hatching.",
          "description":"Add even more layers of cross hatching in different directions to create an extremely subtle and rich shading. The extra layers add even more nuance in tone and value. Fine pencils and fine-line pens are best for this technique, because they can create precise lines that seem to blend together from a distance."
        },
        {
          "headline":"Rotate your paper to try a new perspective.",
          "description":"Cross hatching can take some time to master, so if you’re having trouble envisioning where shadows should go, try rotating your paper. Look for any areas that you may have forgotten to shade or places where the shadow doesn’t fall correctly. Oftentimes, looking at a drawing for a long time can make it difficult to see problem areas—this trick can give you a new perspective and help you notice those areas more easily."
        }
      ]
    },
    {
      "name":"Cross Hatching in a Drawing",
      "steps":[
        {
          "headline":"Sketch the outline of an object in pencil.",
          "description":"Before cross hatching, you'll need to draw the actual shape or object you want to shade. Find either a real object, a reference photo, or imagine your own object. When practicing the technique, it’s often best to start by drawing a three-dimensional geometric shape with clear, angular lines."
        },
        {
          "headline":"Determine the correct lighting.",
          "description":"Before adding any hatch marks, take a moment to look at the object and examine how the light source hits the object and reflect off its surface. This will help you figure out which areas of the drawing should have the lightest shading and which areas need heavier shading. If you’re drawing from imagination, try to imagine how the light would fall or find a similar object to examine. Note that the absolute lightest sections will have no hatch or cross hatch marks. Your imaginary light source would hit these areas directly, so they shouldn't have any shadows. Areas and surfaces further away from your imaginary light source should be darker and will require more cross hatching. If you have trouble imagining a light source and the shadows it would cast, find a photograph of a simple object lit by a single light source. Note where the light and shadows fall, and practice copying this effect with cross hatching."
        },
        {
          "headline":"Draw hatch lines where shadows fall on the object.",
          "description":"Sketch your base layer of standard hatch marks into the outline. Keep the hatch marks in each section parallel to one another, even if they curve along the contours of the outline. For this step, use a pencil and press lightly. This way, you can easily erase these lines if needed. Place more hatch marks closer together in sections that need heavier shading. For sections that need lighter shade, space the hatch marks further apart and use fewer hatch marks overall. The base hatch marks should indicate which areas are darker than others even before you add the cross hatching. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKelly Medford\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlein Air Painter\t\t\t\t\t\t\t\tKelly Medford is an American painter based in Rome, Italy. She studied classical painting, drawing and printmaking both in the U.S. and in Italy. She works primarily en plein air on the streets of Rome, and also travels for private international collectors on commission. She founded Sketching Rome Tours in 2012 where she teaches sketchbook journaling to visitors of Rome. Kelly is a graduate of the Florence Academy of Art. Kelly Medford\t\t\tPlein Air Painter\t\t\t\tWhat Our Expert Does: \"Cross hatching is most effective when you think about the lines following the plane of the object you're shading. For example, is something I'm sketching is round, I would make rounded lines that follow the contour of the object. Or if I were sketching a box, I would use lines going in different directions for the side, top, and bottom planes.\""
        },
        {
          "headline":"Add in cross hatch lines.",
          "description":"Sketch a layer of perpendicular or near-perpendicular cross hatch marks over the base layer of hatch lines. Try to keep the spacing, number, and placement of these cross hatch marks similar to that of the base hatch marks, so areas of the drawing with more hatch marks should also have more cross hatch marks."
        },
        {
          "headline":"Go over the drawing in ink.",
          "description":"Once you're satisfied with the placement and amount of cross hatch marks, go over the pencil marks with your inking tool. When working with a nibbed pen, dip it in the ink, then draw a line on a separate piece of scrap paper before moving to your drawing. This allows you to unload some of the excess ink and prevents it from bleeding onto the drawing itself. Go over the outline of the drawing first, then work on tracing each section of cross hatch marks. Work carefully and try to follow your previously created marks as closely as possible. You can add additional cross hatch marks as needed, but try not to get carried away since you won't be able to undo any of the marks you make in this step. Note that any pencil marks that are still visible after inking might make the drawing look darker than the final piece will look, so don't worry too much if the overall drawing looks darker than anticipated right now."
        },
        {
          "headline":"Erase the pencil marks once the ink has dried.",
          "description":"Allow the ink to dry, then use an eraser to carefully remove any visible pencil marks from the final drawing. Wait for the ink to dry before you attempt any erasing. If you swipe the eraser over the drawing while the ink is still wet, you'll smear the ink and ruin the crispness of your cross hatching."
        }
      ]
    },
    {
      "name":"Using the Right Materials",
      "steps":[
        {
          "headline":"Use a sharp or fine-tipped drawing utensil.",
          "description":"Since cross hatching requires you to draw thin lines close together, you'll need to use a fine-tipped drawing utensil. Whether you use a pencil or pen, make sure it’s sharp or fine-tipped in order to make your lines precise. Even if you want the final drawing to be inked, it's still a good idea to start the drawing with pencil. Use a drawing pencil, mechanical pencil, or a sharpened standard number two pencil. For your inking tool, opt for either a nibbed pen or fine-tip ink pen. Both options work well, so choose whichever instrument you feel more comfortable handling."
        },
        {
          "headline":"Make a value scale.",
          "description":"Before you start drawing a project, make a value scale to help you maintain a balanced range of values. Draw 4 identical 1 in (2.5 cm) squares in a line, then fill each box in with different values, going from light to dark. Use techniques such as varying density and adding sets of lines to gradually move from lightest to darkest. This will help you practice creating subtle differences in value. Use a pencil and some scratch paper for this exercise. As you draw, refer to this scale to determine your desired value range. For example, you could select one value box on your scale to be the darkest value in your drawing. Use your scale to compare with the drawing and make sure you don’t go darker."
        },
        {
          "headline":"Use a piece of scrap paper to block off sections.",
          "description":"When drawing, place pieces of scrap paper over places where you don’t want any cross hatching. This will also help you keep your hatching lines neat and avoid accidentally drawing a hatching line too far."
        }
      ]
    }
  ],
  "text":" Learning Cross Hatching Basics Draw a series of parallel lines. This is called basic hatching, and it’s the first step in cross hatching. There are two types of basic hatching: parallel and contour. Both can be used as a base for cross hatching. Regardless of which hatching type you use, the lines do not cross over one another in standard hatching. You should also try to keep your lines equally spaced out for seamless, smooth shading. With parallel hatching, your lines should remain straight and run vertically or horizontally. With contour hatching, your lines should follow the contour of the outline you’re shading. When you add basic hatching to your drawing, you'll use this skill to draw parallel lines over the area you wish to shade. Practice this by drawing a series of hatching lines on a piece of scrap paper. Add a perpendicular series of lines over the first. To use cross hatching in your drawing, draw a second layer of lines over the first set, going in the opposite direction. This second layer of hatch marks should cross over the first in perpendicular or near-perpendicular directions. The lines of the second layer should not cross over one another, though. Your cross hatch marks should match the hatch mark type used in your base layer. For example, if you started with parallel hatch marks, your cross hatch marks should also be parallel. Practice this by adding a set of cross hatching lines over your hatching. Draw fewer lines spread further apart to create lighter shading. You can vary the shadow’s value by varying the number of lines you draw. In areas that require lighter shading, draw fewer hatching lines and space them further apart from each other. Increase the lines’ density or add layers to imply darker shading. In sections of your drawing that require deeper shadows, increase the number of lines and place them closer together. You can also layer additional series of cross hatching lines to make that area appear darker and more heavily shaded. Alternate directions when adding layers of cross hatching lines. For example, start with a set of vertical lines, then a horizontal set, then a diagonal set, then an opposite diagonal set. This will allow you to build up a deeper, darker shadow effect. Add depth with fine cross hatching. Add even more layers of cross hatching in different directions to create an extremely subtle and rich shading. The extra layers add even more nuance in tone and value. Fine pencils and fine-line pens are best for this technique, because they can create precise lines that seem to blend together from a distance. Rotate your paper to try a new perspective. Cross hatching can take some time to master, so if you’re having trouble envisioning where shadows should go, try rotating your paper. Look for any areas that you may have forgotten to shade or places where the shadow doesn’t fall correctly. Oftentimes, looking at a drawing for a long time can make it difficult to see problem areas—this trick can give you a new perspective and help you notice those areas more easily. Cross Hatching in a Drawing Sketch the outline of an object in pencil. Before cross hatching, you'll need to draw the actual shape or object you want to shade. Find either a real object, a reference photo, or imagine your own object. When practicing the technique, it’s often best to start by drawing a three-dimensional geometric shape with clear, angular lines. Determine the correct lighting. Before adding any hatch marks, take a moment to look at the object and examine how the light source hits the object and reflect off its surface. This will help you figure out which areas of the drawing should have the lightest shading and which areas need heavier shading. If you’re drawing from imagination, try to imagine how the light would fall or find a similar object to examine. Note that the absolute lightest sections will have no hatch or cross hatch marks. Your imaginary light source would hit these areas directly, so they shouldn't have any shadows. Areas and surfaces further away from your imaginary light source should be darker and will require more cross hatching. If you have trouble imagining a light source and the shadows it would cast, find a photograph of a simple object lit by a single light source. Note where the light and shadows fall, and practice copying this effect with cross hatching. Draw hatch lines where shadows fall on the object. Sketch your base layer of standard hatch marks into the outline. Keep the hatch marks in each section parallel to one another, even if they curve along the contours of the outline. For this step, use a pencil and press lightly. This way, you can easily erase these lines if needed. Place more hatch marks closer together in sections that need heavier shading. For sections that need lighter shade, space the hatch marks further apart and use fewer hatch marks overall. The base hatch marks should indicate which areas are darker than others even before you add the cross hatching. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKelly Medford\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlein Air Painter\t\t\t\t\t\t\t\tKelly Medford is an American painter based in Rome, Italy. She studied classical painting, drawing and printmaking both in the U.S. and in Italy. She works primarily en plein air on the streets of Rome, and also travels for private international collectors on commission. She founded Sketching Rome Tours in 2012 where she teaches sketchbook journaling to visitors of Rome. Kelly is a graduate of the Florence Academy of Art. Kelly Medford\t\t\tPlein Air Painter\t\t\t\tWhat Our Expert Does: \"Cross hatching is most effective when you think about the lines following the plane of the object you're shading. For example, is something I'm sketching is round, I would make rounded lines that follow the contour of the object. Or if I were sketching a box, I would use lines going in different directions for the side, top, and bottom planes.\" Add in cross hatch lines. Sketch a layer of perpendicular or near-perpendicular cross hatch marks over the base layer of hatch lines. Try to keep the spacing, number, and placement of these cross hatch marks similar to that of the base hatch marks, so areas of the drawing with more hatch marks should also have more cross hatch marks. Go over the drawing in ink. Once you're satisfied with the placement and amount of cross hatch marks, go over the pencil marks with your inking tool. When working with a nibbed pen, dip it in the ink, then draw a line on a separate piece of scrap paper before moving to your drawing. This allows you to unload some of the excess ink and prevents it from bleeding onto the drawing itself. Go over the outline of the drawing first, then work on tracing each section of cross hatch marks. Work carefully and try to follow your previously created marks as closely as possible. You can add additional cross hatch marks as needed, but try not to get carried away since you won't be able to undo any of the marks you make in this step. Note that any pencil marks that are still visible after inking might make the drawing look darker than the final piece will look, so don't worry too much if the overall drawing looks darker than anticipated right now. Erase the pencil marks once the ink has dried. Allow the ink to dry, then use an eraser to carefully remove any visible pencil marks from the final drawing. Wait for the ink to dry before you attempt any erasing. If you swipe the eraser over the drawing while the ink is still wet, you'll smear the ink and ruin the crispness of your cross hatching. Using the Right Materials Use a sharp or fine-tipped drawing utensil. Since cross hatching requires you to draw thin lines close together, you'll need to use a fine-tipped drawing utensil. Whether you use a pencil or pen, make sure it’s sharp or fine-tipped in order to make your lines precise. Even if you want the final drawing to be inked, it's still a good idea to start the drawing with pencil. Use a drawing pencil, mechanical pencil, or a sharpened standard number two pencil. For your inking tool, opt for either a nibbed pen or fine-tip ink pen. Both options work well, so choose whichever instrument you feel more comfortable handling. Make a value scale. Before you start drawing a project, make a value scale to help you maintain a balanced range of values. Draw 4 identical 1 in (2.5 cm) squares in a line, then fill each box in with different values, going from light to dark. Use techniques such as varying density and adding sets of lines to gradually move from lightest to darkest. This will help you practice creating subtle differences in value. Use a pencil and some scratch paper for this exercise. As you draw, refer to this scale to determine your desired value range. For example, you could select one value box on your scale to be the darkest value in your drawing. Use your scale to compare with the drawing and make sure you don’t go darker. Use a piece of scrap paper to block off sections. When drawing, place pieces of scrap paper over places where you don’t want any cross hatching. This will also help you keep your hatching lines neat and avoid accidentally drawing a hatching line too far.",
  "sentences":[
    " Learning Cross Hatching Basics Draw a series of parallel lines.",
    "This is called basic hatching, and it’s the first step in cross hatching.",
    "There are two types of basic hatching: parallel and contour.",
    "Both can be used as a base for cross hatching.",
    "Regardless of which hatching type you use, the lines do not cross over one another in standard hatching.",
    "You should also try to keep your lines equally spaced out for seamless, smooth shading.",
    "With parallel hatching, your lines should remain straight and run vertically or horizontally.",
    "With contour hatching, your lines should follow the contour of the outline you’re shading.",
    "When you add basic hatching to your drawing, you'll use this skill to draw parallel lines over the area you wish to shade.",
    "Practice this by drawing a series of hatching lines on a piece of scrap paper.",
    "Add a perpendicular series of lines over the first.",
    "To use cross hatching in your drawing, draw a second layer of lines over the first set, going in the opposite direction.",
    "This second layer of hatch marks should cross over the first in perpendicular or near-perpendicular directions.",
    "The lines of the second layer should not cross over one another, though.",
    "Your cross hatch marks should match the hatch mark type used in your base layer.",
    "For example, if you started with parallel hatch marks, your cross hatch marks should also be parallel.",
    "Practice this by adding a set of cross hatching lines over your hatching.",
    "Draw fewer lines spread further apart to create lighter shading.",
    "You can vary the shadow’s value by varying the number of lines you draw.",
    "In areas that require lighter shading, draw fewer hatching lines and space them further apart from each other.",
    "Increase the lines’ density or add layers to imply darker shading.",
    "In sections of your drawing that require deeper shadows, increase the number of lines and place them closer together.",
    "You can also layer additional series of cross hatching lines to make that area appear darker and more heavily shaded.",
    "Alternate directions when adding layers of cross hatching lines.",
    "For example, start with a set of vertical lines, then a horizontal set, then a diagonal set, then an opposite diagonal set.",
    "This will allow you to build up a deeper, darker shadow effect.",
    "Add depth with fine cross hatching.",
    "Add even more layers of cross hatching in different directions to create an extremely subtle and rich shading.",
    "The extra layers add even more nuance in tone and value.",
    "Fine pencils and fine-line pens are best for this technique, because they can create precise lines that seem to blend together from a distance.",
    "Rotate your paper to try a new perspective.",
    "Cross hatching can take some time to master, so if you’re having trouble envisioning where shadows should go, try rotating your paper.",
    "Look for any areas that you may have forgotten to shade or places where the shadow doesn’t fall correctly.",
    "Oftentimes, looking at a drawing for a long time can make it difficult to see problem areas—this trick can give you a new perspective and help you notice those areas more easily.",
    "Cross Hatching in a Drawing Sketch the outline of an object in pencil.",
    "Before cross hatching, you'll need to draw the actual shape or object you want to shade.",
    "Find either a real object, a reference photo, or imagine your own object.",
    "When practicing the technique, it’s often best to start by drawing a three-dimensional geometric shape with clear, angular lines.",
    "Determine the correct lighting.",
    "Before adding any hatch marks, take a moment to look at the object and examine how the light source hits the object and reflect off its surface.",
    "This will help you figure out which areas of the drawing should have the lightest shading and which areas need heavier shading.",
    "If you’re drawing from imagination, try to imagine how the light would fall or find a similar object to examine.",
    "Note that the absolute lightest sections will have no hatch or cross hatch marks.",
    "Your imaginary light source would hit these areas directly, so they shouldn't have any shadows.",
    "Areas and surfaces further away from your imaginary light source should be darker and will require more cross hatching.",
    "If you have trouble imagining a light source and the shadows it would cast, find a photograph of a simple object lit by a single light source.",
    "Note where the light and shadows fall, and practice copying this effect with cross hatching.",
    "Draw hatch lines where shadows fall on the object.",
    "Sketch your base layer of standard hatch marks into the outline.",
    "Keep the hatch marks in each section parallel to one another, even if they curve along the contours of the outline.",
    "For this step, use a pencil and press lightly.",
    "This way, you can easily erase these lines if needed.",
    "Place more hatch marks closer together in sections that need heavier shading.",
    "For sections that need lighter shade, space the hatch marks further apart and use fewer hatch marks overall.",
    "The base hatch marks should indicate which areas are darker than others even before you add the cross hatching.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKelly Medford\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlein Air Painter\t\t\t\t\t\t\t\tKelly Medford is an American painter based in Rome, Italy.",
    "She studied classical painting, drawing and printmaking both in the U.S. and in Italy.",
    "She works primarily en plein air on the streets of Rome, and also travels for private international collectors on commission.",
    "She founded Sketching Rome Tours in 2012 where she teaches sketchbook journaling to visitors of Rome.",
    "Kelly is a graduate of the Florence Academy of Art.",
    "Kelly Medford\t\t\tPlein Air Painter\t\t\t\tWhat Our Expert Does: \"Cross hatching is most effective when you think about the lines following the plane of the object you're shading.",
    "For example, is something I'm sketching is round, I would make rounded lines that follow the contour of the object.",
    "Or if I were sketching a box, I would use lines going in different directions for the side, top, and bottom planes.\"",
    "Add in cross hatch lines.",
    "Sketch a layer of perpendicular or near-perpendicular cross hatch marks over the base layer of hatch lines.",
    "Try to keep the spacing, number, and placement of these cross hatch marks similar to that of the base hatch marks, so areas of the drawing with more hatch marks should also have more cross hatch marks.",
    "Go over the drawing in ink.",
    "Once you're satisfied with the placement and amount of cross hatch marks, go over the pencil marks with your inking tool.",
    "When working with a nibbed pen, dip it in the ink, then draw a line on a separate piece of scrap paper before moving to your drawing.",
    "This allows you to unload some of the excess ink and prevents it from bleeding onto the drawing itself.",
    "Go over the outline of the drawing first, then work on tracing each section of cross hatch marks.",
    "Work carefully and try to follow your previously created marks as closely as possible.",
    "You can add additional cross hatch marks as needed, but try not to get carried away since you won't be able to undo any of the marks you make in this step.",
    "Note that any pencil marks that are still visible after inking might make the drawing look darker than the final piece will look, so don't worry too much if the overall drawing looks darker than anticipated right now.",
    "Erase the pencil marks once the ink has dried.",
    "Allow the ink to dry, then use an eraser to carefully remove any visible pencil marks from the final drawing.",
    "Wait for the ink to dry before you attempt any erasing.",
    "If you swipe the eraser over the drawing while the ink is still wet, you'll smear the ink and ruin the crispness of your cross hatching.",
    "Using the Right Materials Use a sharp or fine-tipped drawing utensil.",
    "Since cross hatching requires you to draw thin lines close together, you'll need to use a fine-tipped drawing utensil.",
    "Whether you use a pencil or pen, make sure it’s sharp or fine-tipped in order to make your lines precise.",
    "Even if you want the final drawing to be inked, it's still a good idea to start the drawing with pencil.",
    "Use a drawing pencil, mechanical pencil, or a sharpened standard number two pencil.",
    "For your inking tool, opt for either a nibbed pen or fine-tip ink pen.",
    "Both options work well, so choose whichever instrument you feel more comfortable handling.",
    "Make a value scale.",
    "Before you start drawing a project, make a value scale to help you maintain a balanced range of values.",
    "Draw 4 identical 1 in (2.5 cm) squares in a line, then fill each box in with different values, going from light to dark.",
    "Use techniques such as varying density and adding sets of lines to gradually move from lightest to darkest.",
    "This will help you practice creating subtle differences in value.",
    "Use a pencil and some scratch paper for this exercise.",
    "As you draw, refer to this scale to determine your desired value range.",
    "For example, you could select one value box on your scale to be the darkest value in your drawing.",
    "Use your scale to compare with the drawing and make sure you don’t go darker.",
    "Use a piece of scrap paper to block off sections.",
    "When drawing, place pieces of scrap paper over places where you don’t want any cross hatching.",
    "This will also help you keep your hatching lines neat and avoid accidentally drawing a hatching line too far."
  ],
  "tyn_section":[
    "Drawing paper",
    "Scrap paper",
    "Sharp pencil",
    "Eraser",
    "Fine-tip pen or nibbed pen with dipping ink"
  ],
  "tyn_model":[
    "pencil",
    "ink",
    "scrap paper",
    "scale",
    "paper",
    "plein air painter",
    "eraser",
    "’ density",
    "pencils",
    "fine-line pens",
    "—this",
    "sketchbook journaling",
    "box",
    "inking tool",
    "pencil marks",
    "drawing pencil",
    "mechanical pencil",
    "fine-tip ink pen",
    "scratch paper"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1052631579,
    "f1":0.1666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.2105263158,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.4736842105,
    "f1":0.6428571429
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.1052631579,
    "f1":0.1666666667
  }
}