{
  "title":"How to Make a Burlap Bow",
  "url":"https://www.wikihow.com/Make-a-Burlap-Bow",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects"
  ],
  "methods":[
    {
      "name":"Basic Bow[1]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Cut a length of burlap ribbon.",
          "description":"Use scissors to cut 2 to 3 feet (61 to 91 cm) of wired or free-form burlap ribbon. This can be done with nearly any width, but 2 to 4 inch (5 to 10 cm) wide ribbon will work well for many decorative applications. If you use a much thicker ribbon, you may need to cut a longer piece. It's better to start with too much length than too little since you can trim off any excess toward the end of the project."
        },
        {
          "headline":"Crisscross the ends over the center.",
          "description":"Lay the burlap ribbon flat an identify the center. Fold the ends so that they crisscross over this center point. The top edge of each folded end should intersect at the exact center point of the ribbon, but the rest of the end will angle downward below this point. Fold the ribbon so that the folds are about as large as you want the final ribbon loops to be. Make sure that both sides are even."
        },
        {
          "headline":"Pinch and tie the center.",
          "description":"Pinch the ribbon at the center point of intersection, then tie it in place with a small wire tie or piece of twine. Pinch from top to bottom and adjust the inner pleats that form as needed. You should also make any necessary adjustments to the size and shape of the loops before tying off the center. Trim the wire tie or ribbon after tying it on. Keep it as short as possible so it will be easier to cover."
        },
        {
          "headline":"Cut a smaller length of burlap ribbon.",
          "description":"Use scissors to cut 4 to 6 inches (10 to 15 cm) of wired or free-form burlap ribbon. This piece of ribbon should be one-half to two-thirds the width of the main ribbon. Make sure that it is wide enough to hide the center but not wide enough to distort the shape of the bow."
        },
        {
          "headline":"Cover the center using the second piece.",
          "description":"Wrap the new length of burlap around the center of the bow and tack it into place using hot glue. Make sure that this piece of burlap completely hides the wire or ribbon holding the bow's shape. Also note that the end of this center piece should be positioned to the back of the bow."
        },
        {
          "headline":"Snip the ribbon ends.",
          "description":"Trim the ends of the burlap as desired, and try to keep both ends the same approximate length. You can trim the ends at a simple slant, but cutting a \"v\" shape into both ends can give the bow a decorative appearance. Doing so also makes the burlap less likely to unravel."
        },
        {
          "headline":"Use as desired.",
          "description":"The burlap ribbon is now finished. You can use it to decorate frames, wreaths, and more."
        }
      ]
    },
    {
      "name":"Multi-Loop Bow[2]\n\tX\n\t\tResearch source\n\t\t\n[3]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Cut a length of burlap ribbon.",
          "description":"Cut 4 to 5 feet (1.2 to 1.5 m) of wired or free-form burlap ribbon. For this length range, burlap ribbon measuring 2 to 4 inches (5 to 10 cm) wide should work well. You can, however, use larger widths. Wider ribbon can actually create a fluffier bow. Just make sure to increase the length of the ribbon when selecting a wider type."
        },
        {
          "headline":"Fold the burlap.",
          "description":"Determine how wide you want the final bow to be, then fold one end over to create a loop half that long. Note that this should not be half the length of your ribbon. At most, this first loop should only take up no more than one-quarter the total ribbon length. This loop should also lie flat and parallel to the rest of the ribbon."
        },
        {
          "headline":"Make a mirror fold.",
          "description":"Fold the opposite end back over the front of the bow and over the first loop. The resulting loop should be just as large as the first. Keep the ribbon parallel and flat as you make this second loop. After completing this step, the maximum bow width should be set to your desired final width."
        },
        {
          "headline":"Stack progressively smaller loop sets on top.",
          "description":"Continue folding the loose end of burlap back and forth on top of the initial loop set. Work in equal pairs, and make each pair a little smaller than the one beneath it. Each set of folds should lie flat and parallel on top of the rest of the bow, and each individual loop in a set should match the other loop with which it's paired. The exact number of pairs will vary based on the width of the ribbon and on your personal aesthetic taste. Larger widths may only need two to three loop sets total, but smaller widths may need twice that amount to achieve a similarly fluffy bow."
        },
        {
          "headline":"Tie off the center.",
          "description":"Carefully wrap a wire tie or piece of florist wire around the exact center of the bow to secure it. Tie the wire as tightly as possible to maintain a fixed shape, then trim any excess wire using wire cutters. You should also trim any excess burlap after tying off the center of the bow."
        },
        {
          "headline":"Hide the wire tie with additional burlap.",
          "description":"Cut another length of burlap, then wrap it around the center to hide the wire. The burlap used during this step will need to be narrower than the burlap used for the main body of the bow. You can use a different ribbon, or use the same type of ribbon and simply fold it before wrapping it. Make sure that the center ribbon overlaps and ties at the back of the bow instead of the front. Leave enough ribbon hanging down from the center to create \"tails\" beneath the bow."
        },
        {
          "headline":"Fan out the loops.",
          "description":"Twist and fluff the separate loops as needed to create the precise look you want. Since burlap is such a thick material, it will usually retain its shape regardless of whether you use wired or free-form ribbon."
        },
        {
          "headline":"Cut the ribbon tails.",
          "description":"Trim the ribbon tails to the desired length, keeping both tails equally long. If desired, you can also cut \"v\" shaped notches into the ends to help prevent the burlap from unraveling over time."
        },
        {
          "headline":"Use as desired.",
          "description":"The burlap bow should now be finished. You can use it as its own decoration or use it to accent wreaths, vases, pillows, and more."
        }
      ]
    },
    {
      "name":"Gift Bow[4]\n\tX\n\t\tResearch source\n\t\t\n[5]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Cut seven strips of burlap.",
          "description":"Select 1/2 to 3/4 inch (1.25 to 1.9 cm) wide burlap ribbon. Cut seven pieces of ribbon, creating three pairs of ribbon in progressively smaller lengths. Two pieces should be 10 inches (25 cm) long, two should be 9 inches (23 cm) long, and two should be 8 inches (20 cm) long. The final piece should be 4 inches (10 cm) long and should not have its own match."
        },
        {
          "headline":"Loop both ends and staple them in the center.",
          "description":"Starting with one piece of burlap, fold the end of the strip so that it sits on top of the center of the piece. Fold the other end so that it overlaps the first at this center point. With each fold, the top side of the end should meet the top side of the center, creating a pointed loop. The finished appearance should look like a figure-8. Staple the center of the figure-8 to hold it together as you continue working."
        },
        {
          "headline":"Repeat with most of the remaining strips.",
          "description":"Repeat the folding and stapling process with the other 10 inch (25 cm) strip, both 9 inch (23 cm) strips, and both 8 inch (20 cm) strips. Do not, however, loop the final 4 inch (10 cm) strip yet."
        },
        {
          "headline":"Crisscross two loops.",
          "description":"Create and \"x\" shape from the two largest loops by laying one on top of the other, angling them in perpendicular directions. Note that the narrow, pointed part of the loops should point downward when you stack them. Hold the two pieces together by placing a small dab of hot glue in between them."
        },
        {
          "headline":"Stack the remaining loops in pairs.",
          "description":"Stack the remaining four loop pairs on top of the bottom set, working with one size at a time. The loops of each evenly sized pair should form a perpendicular \"x\" shape with one another. As you stack the loops on top of one another, try to fill in the gaps left by the previous set. Once you determine the best placement for a loop, hold it in place using hot glue."
        },
        {
          "headline":"Loop the final strip into a circle.",
          "description":"Bring the ends of the 4 inch (10 cm) strip together, forming a single circular loop. Hold the ends together with a staple or a bead of hot glue."
        },
        {
          "headline":"Adhere the final loop to the center.",
          "description":"Place a bead of hot glue in the open center of your ribbon stack. Press the seam side of the final loop into the glue. Once the glue dries, fluff and readjust the secure loops as needed. Some of the outer loops should slightly overlap the center loop."
        },
        {
          "headline":"Use as desired.",
          "description":"The burlap bow should be complete. You can use it to decorate gifts and other packages."
        }
      ]
    }
  ],
  "text":" Basic Bow[1]\n\tX\n\t\tResearch source Cut a length of burlap ribbon. Use scissors to cut 2 to 3 feet (61 to 91 cm) of wired or free-form burlap ribbon. This can be done with nearly any width, but 2 to 4 inch (5 to 10 cm) wide ribbon will work well for many decorative applications. If you use a much thicker ribbon, you may need to cut a longer piece. It's better to start with too much length than too little since you can trim off any excess toward the end of the project. Crisscross the ends over the center. Lay the burlap ribbon flat an identify the center. Fold the ends so that they crisscross over this center point. The top edge of each folded end should intersect at the exact center point of the ribbon, but the rest of the end will angle downward below this point. Fold the ribbon so that the folds are about as large as you want the final ribbon loops to be. Make sure that both sides are even. Pinch and tie the center. Pinch the ribbon at the center point of intersection, then tie it in place with a small wire tie or piece of twine. Pinch from top to bottom and adjust the inner pleats that form as needed. You should also make any necessary adjustments to the size and shape of the loops before tying off the center. Trim the wire tie or ribbon after tying it on. Keep it as short as possible so it will be easier to cover. Cut a smaller length of burlap ribbon. Use scissors to cut 4 to 6 inches (10 to 15 cm) of wired or free-form burlap ribbon. This piece of ribbon should be one-half to two-thirds the width of the main ribbon. Make sure that it is wide enough to hide the center but not wide enough to distort the shape of the bow. Cover the center using the second piece. Wrap the new length of burlap around the center of the bow and tack it into place using hot glue. Make sure that this piece of burlap completely hides the wire or ribbon holding the bow's shape. Also note that the end of this center piece should be positioned to the back of the bow. Snip the ribbon ends. Trim the ends of the burlap as desired, and try to keep both ends the same approximate length. You can trim the ends at a simple slant, but cutting a \"v\" shape into both ends can give the bow a decorative appearance. Doing so also makes the burlap less likely to unravel. Use as desired. The burlap ribbon is now finished. You can use it to decorate frames, wreaths, and more. Multi-Loop Bow[2]\n\tX\n\t\tResearch source\n\t\t\n[3]\n\tX\n\t\tResearch source Cut a length of burlap ribbon. Cut 4 to 5 feet (1.2 to 1.5 m) of wired or free-form burlap ribbon. For this length range, burlap ribbon measuring 2 to 4 inches (5 to 10 cm) wide should work well. You can, however, use larger widths. Wider ribbon can actually create a fluffier bow. Just make sure to increase the length of the ribbon when selecting a wider type. Fold the burlap. Determine how wide you want the final bow to be, then fold one end over to create a loop half that long. Note that this should not be half the length of your ribbon. At most, this first loop should only take up no more than one-quarter the total ribbon length. This loop should also lie flat and parallel to the rest of the ribbon. Make a mirror fold. Fold the opposite end back over the front of the bow and over the first loop. The resulting loop should be just as large as the first. Keep the ribbon parallel and flat as you make this second loop. After completing this step, the maximum bow width should be set to your desired final width. Stack progressively smaller loop sets on top. Continue folding the loose end of burlap back and forth on top of the initial loop set. Work in equal pairs, and make each pair a little smaller than the one beneath it. Each set of folds should lie flat and parallel on top of the rest of the bow, and each individual loop in a set should match the other loop with which it's paired. The exact number of pairs will vary based on the width of the ribbon and on your personal aesthetic taste. Larger widths may only need two to three loop sets total, but smaller widths may need twice that amount to achieve a similarly fluffy bow. Tie off the center. Carefully wrap a wire tie or piece of florist wire around the exact center of the bow to secure it. Tie the wire as tightly as possible to maintain a fixed shape, then trim any excess wire using wire cutters. You should also trim any excess burlap after tying off the center of the bow. Hide the wire tie with additional burlap. Cut another length of burlap, then wrap it around the center to hide the wire. The burlap used during this step will need to be narrower than the burlap used for the main body of the bow. You can use a different ribbon, or use the same type of ribbon and simply fold it before wrapping it. Make sure that the center ribbon overlaps and ties at the back of the bow instead of the front. Leave enough ribbon hanging down from the center to create \"tails\" beneath the bow. Fan out the loops. Twist and fluff the separate loops as needed to create the precise look you want. Since burlap is such a thick material, it will usually retain its shape regardless of whether you use wired or free-form ribbon. Cut the ribbon tails. Trim the ribbon tails to the desired length, keeping both tails equally long. If desired, you can also cut \"v\" shaped notches into the ends to help prevent the burlap from unraveling over time. Use as desired. The burlap bow should now be finished. You can use it as its own decoration or use it to accent wreaths, vases, pillows, and more. Gift Bow[4]\n\tX\n\t\tResearch source\n\t\t\n[5]\n\tX\n\t\tResearch source Cut seven strips of burlap. Select 1/2 to 3/4 inch (1.25 to 1.9 cm) wide burlap ribbon. Cut seven pieces of ribbon, creating three pairs of ribbon in progressively smaller lengths. Two pieces should be 10 inches (25 cm) long, two should be 9 inches (23 cm) long, and two should be 8 inches (20 cm) long. The final piece should be 4 inches (10 cm) long and should not have its own match. Loop both ends and staple them in the center. Starting with one piece of burlap, fold the end of the strip so that it sits on top of the center of the piece. Fold the other end so that it overlaps the first at this center point. With each fold, the top side of the end should meet the top side of the center, creating a pointed loop. The finished appearance should look like a figure-8. Staple the center of the figure-8 to hold it together as you continue working. Repeat with most of the remaining strips. Repeat the folding and stapling process with the other 10 inch (25 cm) strip, both 9 inch (23 cm) strips, and both 8 inch (20 cm) strips. Do not, however, loop the final 4 inch (10 cm) strip yet. Crisscross two loops. Create and \"x\" shape from the two largest loops by laying one on top of the other, angling them in perpendicular directions. Note that the narrow, pointed part of the loops should point downward when you stack them. Hold the two pieces together by placing a small dab of hot glue in between them. Stack the remaining loops in pairs. Stack the remaining four loop pairs on top of the bottom set, working with one size at a time. The loops of each evenly sized pair should form a perpendicular \"x\" shape with one another. As you stack the loops on top of one another, try to fill in the gaps left by the previous set. Once you determine the best placement for a loop, hold it in place using hot glue. Loop the final strip into a circle. Bring the ends of the 4 inch (10 cm) strip together, forming a single circular loop. Hold the ends together with a staple or a bead of hot glue. Adhere the final loop to the center. Place a bead of hot glue in the open center of your ribbon stack. Press the seam side of the final loop into the glue. Once the glue dries, fluff and readjust the secure loops as needed. Some of the outer loops should slightly overlap the center loop. Use as desired. The burlap bow should be complete. You can use it to decorate gifts and other packages.",
  "sentences":[
    " Basic Bow[1]\n\tX\n\t\tResearch source Cut a length of burlap ribbon.",
    "Use scissors to cut 2 to 3 feet (61 to 91 cm) of wired or free-form burlap ribbon.",
    "This can be done with nearly any width, but 2 to 4 inch (5 to 10 cm) wide ribbon will work well for many decorative applications.",
    "If you use a much thicker ribbon, you may need to cut a longer piece.",
    "It's better to start with too much length than too little since you can trim off any excess toward the end of the project.",
    "Crisscross the ends over the center.",
    "Lay the burlap ribbon flat an identify the center.",
    "Fold the ends so that they crisscross over this center point.",
    "The top edge of each folded end should intersect at the exact center point of the ribbon, but the rest of the end will angle downward below this point.",
    "Fold the ribbon so that the folds are about as large as you want the final ribbon loops to be.",
    "Make sure that both sides are even.",
    "Pinch and tie the center.",
    "Pinch the ribbon at the center point of intersection, then tie it in place with a small wire tie or piece of twine.",
    "Pinch from top to bottom and adjust the inner pleats that form as needed.",
    "You should also make any necessary adjustments to the size and shape of the loops before tying off the center.",
    "Trim the wire tie or ribbon after tying it on.",
    "Keep it as short as possible so it will be easier to cover.",
    "Cut a smaller length of burlap ribbon.",
    "Use scissors to cut 4 to 6 inches (10 to 15 cm) of wired or free-form burlap ribbon.",
    "This piece of ribbon should be one-half to two-thirds the width of the main ribbon.",
    "Make sure that it is wide enough to hide the center but not wide enough to distort the shape of the bow.",
    "Cover the center using the second piece.",
    "Wrap the new length of burlap around the center of the bow and tack it into place using hot glue.",
    "Make sure that this piece of burlap completely hides the wire or ribbon holding the bow's shape.",
    "Also note that the end of this center piece should be positioned to the back of the bow.",
    "Snip the ribbon ends.",
    "Trim the ends of the burlap as desired, and try to keep both ends the same approximate length.",
    "You can trim the ends at a simple slant, but cutting a \"v\" shape into both ends can give the bow a decorative appearance.",
    "Doing so also makes the burlap less likely to unravel.",
    "Use as desired.",
    "The burlap ribbon is now finished.",
    "You can use it to decorate frames, wreaths, and more.",
    "Multi-Loop Bow[2]\n\tX\n\t\tResearch source\n\t\t\n[3]\n\tX\n\t\tResearch source Cut a length of burlap ribbon.",
    "Cut 4 to 5 feet (1.2 to 1.5 m) of wired or free-form burlap ribbon.",
    "For this length range, burlap ribbon measuring 2 to 4 inches (5 to 10 cm) wide should work well.",
    "You can, however, use larger widths.",
    "Wider ribbon can actually create a fluffier bow.",
    "Just make sure to increase the length of the ribbon when selecting a wider type.",
    "Fold the burlap.",
    "Determine how wide you want the final bow to be, then fold one end over to create a loop half that long.",
    "Note that this should not be half the length of your ribbon.",
    "At most, this first loop should only take up no more than one-quarter the total ribbon length.",
    "This loop should also lie flat and parallel to the rest of the ribbon.",
    "Make a mirror fold.",
    "Fold the opposite end back over the front of the bow and over the first loop.",
    "The resulting loop should be just as large as the first.",
    "Keep the ribbon parallel and flat as you make this second loop.",
    "After completing this step, the maximum bow width should be set to your desired final width.",
    "Stack progressively smaller loop sets on top.",
    "Continue folding the loose end of burlap back and forth on top of the initial loop set.",
    "Work in equal pairs, and make each pair a little smaller than the one beneath it.",
    "Each set of folds should lie flat and parallel on top of the rest of the bow, and each individual loop in a set should match the other loop with which it's paired.",
    "The exact number of pairs will vary based on the width of the ribbon and on your personal aesthetic taste.",
    "Larger widths may only need two to three loop sets total, but smaller widths may need twice that amount to achieve a similarly fluffy bow.",
    "Tie off the center.",
    "Carefully wrap a wire tie or piece of florist wire around the exact center of the bow to secure it.",
    "Tie the wire as tightly as possible to maintain a fixed shape, then trim any excess wire using wire cutters.",
    "You should also trim any excess burlap after tying off the center of the bow.",
    "Hide the wire tie with additional burlap.",
    "Cut another length of burlap, then wrap it around the center to hide the wire.",
    "The burlap used during this step will need to be narrower than the burlap used for the main body of the bow.",
    "You can use a different ribbon, or use the same type of ribbon and simply fold it before wrapping it.",
    "Make sure that the center ribbon overlaps and ties at the back of the bow instead of the front.",
    "Leave enough ribbon hanging down from the center to create \"tails\" beneath the bow.",
    "Fan out the loops.",
    "Twist and fluff the separate loops as needed to create the precise look you want.",
    "Since burlap is such a thick material, it will usually retain its shape regardless of whether you use wired or free-form ribbon.",
    "Cut the ribbon tails.",
    "Trim the ribbon tails to the desired length, keeping both tails equally long.",
    "If desired, you can also cut \"v\" shaped notches into the ends to help prevent the burlap from unraveling over time.",
    "Use as desired.",
    "The burlap bow should now be finished.",
    "You can use it as its own decoration or use it to accent wreaths, vases, pillows, and more.",
    "Gift Bow[4]\n\tX\n\t\tResearch source\n\t\t\n[5]\n\tX\n\t\tResearch source Cut seven strips of burlap.",
    "Select 1/2 to 3/4 inch (1.25 to 1.9 cm) wide burlap ribbon.",
    "Cut seven pieces of ribbon, creating three pairs of ribbon in progressively smaller lengths.",
    "Two pieces should be 10 inches (25 cm) long, two should be 9 inches (23 cm) long, and two should be 8 inches (20 cm) long.",
    "The final piece should be 4 inches (10 cm) long and should not have its own match.",
    "Loop both ends and staple them in the center.",
    "Starting with one piece of burlap, fold the end of the strip so that it sits on top of the center of the piece.",
    "Fold the other end so that it overlaps the first at this center point.",
    "With each fold, the top side of the end should meet the top side of the center, creating a pointed loop.",
    "The finished appearance should look like a figure-8.",
    "Staple the center of the figure-8 to hold it together as you continue working.",
    "Repeat with most of the remaining strips.",
    "Repeat the folding and stapling process with the other 10 inch (25 cm) strip, both 9 inch (23 cm) strips, and both 8 inch (20 cm) strips.",
    "Do not, however, loop the final 4 inch (10 cm) strip yet.",
    "Crisscross two loops.",
    "Create and \"x\" shape from the two largest loops by laying one on top of the other, angling them in perpendicular directions.",
    "Note that the narrow, pointed part of the loops should point downward when you stack them.",
    "Hold the two pieces together by placing a small dab of hot glue in between them.",
    "Stack the remaining loops in pairs.",
    "Stack the remaining four loop pairs on top of the bottom set, working with one size at a time.",
    "The loops of each evenly sized pair should form a perpendicular \"x\" shape with one another.",
    "As you stack the loops on top of one another, try to fill in the gaps left by the previous set.",
    "Once you determine the best placement for a loop, hold it in place using hot glue.",
    "Loop the final strip into a circle.",
    "Bring the ends of the 4 inch (10 cm) strip together, forming a single circular loop.",
    "Hold the ends together with a staple or a bead of hot glue.",
    "Adhere the final loop to the center.",
    "Place a bead of hot glue in the open center of your ribbon stack.",
    "Press the seam side of the final loop into the glue.",
    "Once the glue dries, fluff and readjust the secure loops as needed.",
    "Some of the outer loops should slightly overlap the center loop.",
    "Use as desired.",
    "The burlap bow should be complete.",
    "You can use it to decorate gifts and other packages."
  ],
  "tyn_section":[
    "Basic Bow",
    "2 to 4 in (5.1 to 10.2 cm) wide burlap ribbon",
    "1 in (2.5 cm) wide burlap ribbon",
    "Scissors",
    "Wire tie, floral wire, or twine",
    "Wire cutters",
    "Hot glue gun",
    "Multi-Loop Bow",
    "Gift Bow",
    "1⁄2",
    "1",
    "⁄",
    "2",
    " to ",
    "3⁄4",
    "3",
    "4",
    " in (1.3 to 1.9 cm) wide burlap ribbon",
    "Stapler"
  ],
  "tyn_model":[
    "ribbon",
    "burlap",
    "burlap ribbon",
    "hot glue",
    "wire",
    "scissors",
    "burlap bow",
    "glue",
    "wire tie or piece",
    "twine",
    "wire tie or ribbon",
    "wire tie",
    "florist wire",
    "wire cutters",
    "staple"
  ],
  "simple_metrics":{
    "r":0.1052631579,
    "p":0.1333333333,
    "f1":0.1176470588,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.1578947368,
    "p":0.2666666667,
    "f1":0.1983471074
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3157894737,
    "p":0.5333333333,
    "f1":0.3966942149
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1578947368,
    "p":0.2,
    "f1":0.1764705882
  }
}