{
  "title":"How to Make Crab Salad",
  "url":"https://www.wikihow.com/Make-Crab-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads",
    "Seafood and Fish Salads"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Use lump crab meat or imitation crab.",
          "description":"Both real crab and imitation crab meat can be used for crab salad, but the two have slightly different textures and, as such, will produce slightly different results. Real crab is usually more expensive. You can buy it frozen, canned, or pasteurized, but when making crab salad, canned crab meat will work best. Imitation crab meat is actually made from various species of white fish. The fish is ground into a paste and enhanced with crab flavoring, then molded into the form of a crab leg. You'll usually buy imitation crab as “crab sticks.”"
        },
        {
          "headline":"Pick through lump crab meat before use.",
          "description":"When using real crab meat, you'll need to sort through the contents of the can and pick out anything that isn't actually meat. Open the can and squeeze out any excess liquid using the back of a fork. Dump the crab meat into a bowl and use your fingers to pick over it. Remove any pieces of shell or cartilage hiding among the meat."
        },
        {
          "headline":"Separate imitation crab sticks.",
          "description":"If you decide to use imitation crab meat in the form of crab sticks, you'll need to separate the molded crab sticks into chunks or shreds. Thaw frozen crab sticks by submerging the package in cool, running water. Wait 10 to 15 minutes, flipping the package once halfway through. Remove the plastic package once the crab sticks finish defrosting. Cut each crab stick into three or four evenly sized pieces. You can use it like this, or you can pick apart each piece with your fingers to tear the meat into smaller shreds."
        }
      ]
    },
    {
      "name":"Method One: Simple Crab Salad",
      "steps":[
        {
          "headline":"Melt the butter.",
          "description":"Place the butter in a medium skillet and set it on the stove over medium-high heat. As the butter melts, turn the skillet back and forth to evenly coat the bottom. Wait until the butter completely melts before continuing."
        },
        {
          "headline":"Sauté the green pepper and onion.",
          "description":"Add the chopped onion and green bell pepper to the melted butter. Cook the vegetables, stirring frequently, for about 3 minutes. The exact time may vary depending on how large your pieces are. Only cook the vegetables until they become tender, and do not wait for the onion to turn translucent or brown."
        },
        {
          "headline":"Add the crab meat.",
          "description":"Flake the crab meat into the vegetable mixture. Stir to combine, then continue cooking for another 3 minutes. Stir the mixture frequently as it continues to cook. Cook the crab meat until it becomes warm throughout."
        },
        {
          "headline":"Meanwhile, prepare the dressing.",
          "description":"Place the mayonnaise, sour cream, lemon juice, Dijon mustard, and parsley in a medium mixing bowl. Whisk the ingredients together until evenly combined. Fresh parsley is ideal, but if you don't have fresh parsley, use 2 tsp (10 ml) of dried parsley instead. Note that this amount of dressing will just barely coat the crab salad. If you prefer crab salad with heavier dressing, you may need to double the dressing ingredients."
        },
        {
          "headline":"Combine the dressing and crab.",
          "description":"Remove the crab mixture from the stove and spoon it into the bowl of dressing. Mix gently until the crab mixture and vegetables are evenly coated. If there's extra butter in the skillet after cooking the crab and vegetables, drain it before combining the mixture with the dressing. Keeping the butter could cause the salad to become runny."
        },
        {
          "headline":"Season with salt and pepper.",
          "description":"Sprinkle and mix in as much salt and black pepper as desired according to your own sense of taste. Start with small amounts, like 1/8 (0.6 ml) each, and increase the salt and pepper as needed until satisfied."
        },
        {
          "headline":"Serve warm or cold.",
          "description":"You can enjoy the crab salad immediately or store it in your refrigerator for later. The crab salad may need to chill for 30 to 60 minutes before it becomes cool. Store crab salad in a sealed plastic or glass container and keep it in your refrigerator for three to four days."
        }
      ]
    },
    {
      "name":"Method Two: Spicy Crab Salad",
      "steps":[
        {
          "headline":"Season the crab meat with lemon juice.",
          "description":"Flake the crab meat and place it in a medium mixing bowl. Sprinkle it with the lemon juice and toss gently with a fork. Add the lemon juice to taste. Start with 1 Tbsp (15 ml) and taste the results with a clean fork. Gradually increase the amount up to 3 Tbsp (45 ml), mixing and tasting with a clean fork each time."
        },
        {
          "headline":"Combine with the dressing ingredients.",
          "description":"Add the mayonnaise, hot sauce, mustard, and diced celery to the bowl of seasoned crab. Mix until evenly combined. The hot sauce is another ingredient that should be added and adjusted to taste. If you like your crab salad mildly spicy, 1 tsp (5 ml) should be enough. For a stronger kick, add up to 3 tsp (15 ml)."
        },
        {
          "headline":"Add the salt and pepper.",
          "description":"Mix in salt and ground black pepper, adjusting the amount to fit your preferences. If you aren't sure about how much to add, start with 1/8 tsp (0.6 ml) of each. Add more until you're satisfied with the taste."
        },
        {
          "headline":"Chill before serving.",
          "description":"Place the crab salad in your refrigerator and chill it for 30 to 60 minutes, or until cook. Serve and enjoy cold. When refrigerated in a sealed glass or plastic container, this crab salad should remain edible for about three to four days."
        }
      ]
    },
    {
      "name":"Method Three: Russian Crab Salad",
      "steps":[
        {
          "headline":"Boil and peel the eggs.",
          "description":"Hard boil the eggs, then allow them to cool to room temperature before removing the shells. Place the eggs in a small saucepan and cover with 1 to 2 inches (2.5 to 5 cm) of cold water. Set the saucepan on your stove over medium-high heat. Bring the water to a boil, then immediately remove the saucepan from the heat. Cover it with its lid and let the eggs sit in the hot water for 15 minutes. Submerge the eggs in ice water for 2 to 5 minutes. Once cool, peel off the shells."
        },
        {
          "headline":"Dice the eggs, crab, and onion.",
          "description":"Use a sharp kitchen knife to dice the hard boiled eggs, crab meat, and onion. Dice the egg white and yolks together. If using actual crab meat instead of imitation crab, flake the crab into small chunks. Note that the onion should be diced into very fine pieces."
        },
        {
          "headline":"Combine the crab, eggs, onion, and corn.",
          "description":"Place all four ingredients in a medium mixing bowl. Gently toss them together with a fork until evenly mixed. Make sure that the corn is fully drained before adding it to the mixture. If any of the canned juice remains, it could make the resulting crab salad too runny."
        },
        {
          "headline":"Add the mayonnaise and horseradish sauce.",
          "description":"Add these two ingredients to the crab-vegetable mixture, then stir until evenly coated. Consider mixing the mayonnaise and horseradish sauce in a separate bowl before adding it to the crab mixture. Doing so is not strictly necessary, but it may make it easier for you to distribute both ingredients evenly throughout the crab salad."
        },
        {
          "headline":"Season with salt and pepper.",
          "description":"Sprinkle the crab salad with salt and pepper, then adjust these seasonings to taste. The 1/4 tsp (1.25 ml) salt and 1/8 tsp (0.6 ml) black pepper listed in the recipe are estimates. You can add more or less as desired, or even omit the salt and pepper completely."
        },
        {
          "headline":"Fold in the peas.",
          "description":"Add the peas to the rest of the ingredients and gently fold them into the salad. Adding the peas last can help prevent them from breaking apart as you mix the ingredients. As with the canned corn, make sure that you completely drain the can of peas before adding them to the crab salad."
        },
        {
          "headline":"Chill before serving.",
          "description":"Place the crab salad in your refrigerator for at least 60 minutes. Serve cold. Store extra crab salad in a sealed glass or plastic container. Refrigerate it for up to three or four days."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Steps Use lump crab meat or imitation crab. Both real crab and imitation crab meat can be used for crab salad, but the two have slightly different textures and, as such, will produce slightly different results. Real crab is usually more expensive. You can buy it frozen, canned, or pasteurized, but when making crab salad, canned crab meat will work best. Imitation crab meat is actually made from various species of white fish. The fish is ground into a paste and enhanced with crab flavoring, then molded into the form of a crab leg. You'll usually buy imitation crab as “crab sticks.” Pick through lump crab meat before use. When using real crab meat, you'll need to sort through the contents of the can and pick out anything that isn't actually meat. Open the can and squeeze out any excess liquid using the back of a fork. Dump the crab meat into a bowl and use your fingers to pick over it. Remove any pieces of shell or cartilage hiding among the meat. Separate imitation crab sticks. If you decide to use imitation crab meat in the form of crab sticks, you'll need to separate the molded crab sticks into chunks or shreds. Thaw frozen crab sticks by submerging the package in cool, running water. Wait 10 to 15 minutes, flipping the package once halfway through. Remove the plastic package once the crab sticks finish defrosting. Cut each crab stick into three or four evenly sized pieces. You can use it like this, or you can pick apart each piece with your fingers to tear the meat into smaller shreds. Method One: Simple Crab Salad Melt the butter. Place the butter in a medium skillet and set it on the stove over medium-high heat. As the butter melts, turn the skillet back and forth to evenly coat the bottom. Wait until the butter completely melts before continuing. Sauté the green pepper and onion. Add the chopped onion and green bell pepper to the melted butter. Cook the vegetables, stirring frequently, for about 3 minutes. The exact time may vary depending on how large your pieces are. Only cook the vegetables until they become tender, and do not wait for the onion to turn translucent or brown. Add the crab meat. Flake the crab meat into the vegetable mixture. Stir to combine, then continue cooking for another 3 minutes. Stir the mixture frequently as it continues to cook. Cook the crab meat until it becomes warm throughout. Meanwhile, prepare the dressing. Place the mayonnaise, sour cream, lemon juice, Dijon mustard, and parsley in a medium mixing bowl. Whisk the ingredients together until evenly combined. Fresh parsley is ideal, but if you don't have fresh parsley, use 2 tsp (10 ml) of dried parsley instead. Note that this amount of dressing will just barely coat the crab salad. If you prefer crab salad with heavier dressing, you may need to double the dressing ingredients. Combine the dressing and crab. Remove the crab mixture from the stove and spoon it into the bowl of dressing. Mix gently until the crab mixture and vegetables are evenly coated. If there's extra butter in the skillet after cooking the crab and vegetables, drain it before combining the mixture with the dressing. Keeping the butter could cause the salad to become runny. Season with salt and pepper. Sprinkle and mix in as much salt and black pepper as desired according to your own sense of taste. Start with small amounts, like 1/8 (0.6 ml) each, and increase the salt and pepper as needed until satisfied. Serve warm or cold. You can enjoy the crab salad immediately or store it in your refrigerator for later. The crab salad may need to chill for 30 to 60 minutes before it becomes cool. Store crab salad in a sealed plastic or glass container and keep it in your refrigerator for three to four days. Method Two: Spicy Crab Salad Season the crab meat with lemon juice. Flake the crab meat and place it in a medium mixing bowl. Sprinkle it with the lemon juice and toss gently with a fork. Add the lemon juice to taste. Start with 1 Tbsp (15 ml) and taste the results with a clean fork. Gradually increase the amount up to 3 Tbsp (45 ml), mixing and tasting with a clean fork each time. Combine with the dressing ingredients. Add the mayonnaise, hot sauce, mustard, and diced celery to the bowl of seasoned crab. Mix until evenly combined. The hot sauce is another ingredient that should be added and adjusted to taste. If you like your crab salad mildly spicy, 1 tsp (5 ml) should be enough. For a stronger kick, add up to 3 tsp (15 ml). Add the salt and pepper. Mix in salt and ground black pepper, adjusting the amount to fit your preferences. If you aren't sure about how much to add, start with 1/8 tsp (0.6 ml) of each. Add more until you're satisfied with the taste. Chill before serving. Place the crab salad in your refrigerator and chill it for 30 to 60 minutes, or until cook. Serve and enjoy cold. When refrigerated in a sealed glass or plastic container, this crab salad should remain edible for about three to four days. Method Three: Russian Crab Salad Boil and peel the eggs. Hard boil the eggs, then allow them to cool to room temperature before removing the shells. Place the eggs in a small saucepan and cover with 1 to 2 inches (2.5 to 5 cm) of cold water. Set the saucepan on your stove over medium-high heat. Bring the water to a boil, then immediately remove the saucepan from the heat. Cover it with its lid and let the eggs sit in the hot water for 15 minutes. Submerge the eggs in ice water for 2 to 5 minutes. Once cool, peel off the shells. Dice the eggs, crab, and onion. Use a sharp kitchen knife to dice the hard boiled eggs, crab meat, and onion. Dice the egg white and yolks together. If using actual crab meat instead of imitation crab, flake the crab into small chunks. Note that the onion should be diced into very fine pieces. Combine the crab, eggs, onion, and corn. Place all four ingredients in a medium mixing bowl. Gently toss them together with a fork until evenly mixed. Make sure that the corn is fully drained before adding it to the mixture. If any of the canned juice remains, it could make the resulting crab salad too runny. Add the mayonnaise and horseradish sauce. Add these two ingredients to the crab-vegetable mixture, then stir until evenly coated. Consider mixing the mayonnaise and horseradish sauce in a separate bowl before adding it to the crab mixture. Doing so is not strictly necessary, but it may make it easier for you to distribute both ingredients evenly throughout the crab salad. Season with salt and pepper. Sprinkle the crab salad with salt and pepper, then adjust these seasonings to taste. The 1/4 tsp (1.25 ml) salt and 1/8 tsp (0.6 ml) black pepper listed in the recipe are estimates. You can add more or less as desired, or even omit the salt and pepper completely. Fold in the peas. Add the peas to the rest of the ingredients and gently fold them into the salad. Adding the peas last can help prevent them from breaking apart as you mix the ingredients. As with the canned corn, make sure that you completely drain the can of peas before adding them to the crab salad. Chill before serving. Place the crab salad in your refrigerator for at least 60 minutes. Serve cold. Store extra crab salad in a sealed glass or plastic container. Refrigerate it for up to three or four days. Finished. ",
  "sentences":[
    " Steps Use lump crab meat or imitation crab.",
    "Both real crab and imitation crab meat can be used for crab salad, but the two have slightly different textures and, as such, will produce slightly different results.",
    "Real crab is usually more expensive.",
    "You can buy it frozen, canned, or pasteurized, but when making crab salad, canned crab meat will work best.",
    "Imitation crab meat is actually made from various species of white fish.",
    "The fish is ground into a paste and enhanced with crab flavoring, then molded into the form of a crab leg.",
    "You'll usually buy imitation crab as “crab sticks.” Pick through lump crab meat before use.",
    "When using real crab meat, you'll need to sort through the contents of the can and pick out anything that isn't actually meat.",
    "Open the can and squeeze out any excess liquid using the back of a fork.",
    "Dump the crab meat into a bowl and use your fingers to pick over it.",
    "Remove any pieces of shell or cartilage hiding among the meat.",
    "Separate imitation crab sticks.",
    "If you decide to use imitation crab meat in the form of crab sticks, you'll need to separate the molded crab sticks into chunks or shreds.",
    "Thaw frozen crab sticks by submerging the package in cool, running water.",
    "Wait 10 to 15 minutes, flipping the package once halfway through.",
    "Remove the plastic package once the crab sticks finish defrosting.",
    "Cut each crab stick into three or four evenly sized pieces.",
    "You can use it like this, or you can pick apart each piece with your fingers to tear the meat into smaller shreds.",
    "Method One: Simple Crab Salad Melt the butter.",
    "Place the butter in a medium skillet and set it on the stove over medium-high heat.",
    "As the butter melts, turn the skillet back and forth to evenly coat the bottom.",
    "Wait until the butter completely melts before continuing.",
    "Sauté the green pepper and onion.",
    "Add the chopped onion and green bell pepper to the melted butter.",
    "Cook the vegetables, stirring frequently, for about 3 minutes.",
    "The exact time may vary depending on how large your pieces are.",
    "Only cook the vegetables until they become tender, and do not wait for the onion to turn translucent or brown.",
    "Add the crab meat.",
    "Flake the crab meat into the vegetable mixture.",
    "Stir to combine, then continue cooking for another 3 minutes.",
    "Stir the mixture frequently as it continues to cook.",
    "Cook the crab meat until it becomes warm throughout.",
    "Meanwhile, prepare the dressing.",
    "Place the mayonnaise, sour cream, lemon juice, Dijon mustard, and parsley in a medium mixing bowl.",
    "Whisk the ingredients together until evenly combined.",
    "Fresh parsley is ideal, but if you don't have fresh parsley, use 2 tsp (10 ml) of dried parsley instead.",
    "Note that this amount of dressing will just barely coat the crab salad.",
    "If you prefer crab salad with heavier dressing, you may need to double the dressing ingredients.",
    "Combine the dressing and crab.",
    "Remove the crab mixture from the stove and spoon it into the bowl of dressing.",
    "Mix gently until the crab mixture and vegetables are evenly coated.",
    "If there's extra butter in the skillet after cooking the crab and vegetables, drain it before combining the mixture with the dressing.",
    "Keeping the butter could cause the salad to become runny.",
    "Season with salt and pepper.",
    "Sprinkle and mix in as much salt and black pepper as desired according to your own sense of taste.",
    "Start with small amounts, like 1/8 (0.6 ml) each, and increase the salt and pepper as needed until satisfied.",
    "Serve warm or cold.",
    "You can enjoy the crab salad immediately or store it in your refrigerator for later.",
    "The crab salad may need to chill for 30 to 60 minutes before it becomes cool.",
    "Store crab salad in a sealed plastic or glass container and keep it in your refrigerator for three to four days.",
    "Method Two: Spicy Crab Salad Season the crab meat with lemon juice.",
    "Flake the crab meat and place it in a medium mixing bowl.",
    "Sprinkle it with the lemon juice and toss gently with a fork.",
    "Add the lemon juice to taste.",
    "Start with 1 Tbsp (15 ml) and taste the results with a clean fork.",
    "Gradually increase the amount up to 3 Tbsp (45 ml), mixing and tasting with a clean fork each time.",
    "Combine with the dressing ingredients.",
    "Add the mayonnaise, hot sauce, mustard, and diced celery to the bowl of seasoned crab.",
    "Mix until evenly combined.",
    "The hot sauce is another ingredient that should be added and adjusted to taste.",
    "If you like your crab salad mildly spicy, 1 tsp (5 ml) should be enough.",
    "For a stronger kick, add up to 3 tsp (15 ml).",
    "Add the salt and pepper.",
    "Mix in salt and ground black pepper, adjusting the amount to fit your preferences.",
    "If you aren't sure about how much to add, start with 1/8 tsp (0.6 ml) of each.",
    "Add more until you're satisfied with the taste.",
    "Chill before serving.",
    "Place the crab salad in your refrigerator and chill it for 30 to 60 minutes, or until cook.",
    "Serve and enjoy cold.",
    "When refrigerated in a sealed glass or plastic container, this crab salad should remain edible for about three to four days.",
    "Method Three: Russian Crab Salad Boil and peel the eggs.",
    "Hard boil the eggs, then allow them to cool to room temperature before removing the shells.",
    "Place the eggs in a small saucepan and cover with 1 to 2 inches (2.5 to 5 cm) of cold water.",
    "Set the saucepan on your stove over medium-high heat.",
    "Bring the water to a boil, then immediately remove the saucepan from the heat.",
    "Cover it with its lid and let the eggs sit in the hot water for 15 minutes.",
    "Submerge the eggs in ice water for 2 to 5 minutes.",
    "Once cool, peel off the shells.",
    "Dice the eggs, crab, and onion.",
    "Use a sharp kitchen knife to dice the hard boiled eggs, crab meat, and onion.",
    "Dice the egg white and yolks together.",
    "If using actual crab meat instead of imitation crab, flake the crab into small chunks.",
    "Note that the onion should be diced into very fine pieces.",
    "Combine the crab, eggs, onion, and corn.",
    "Place all four ingredients in a medium mixing bowl.",
    "Gently toss them together with a fork until evenly mixed.",
    "Make sure that the corn is fully drained before adding it to the mixture.",
    "If any of the canned juice remains, it could make the resulting crab salad too runny.",
    "Add the mayonnaise and horseradish sauce.",
    "Add these two ingredients to the crab-vegetable mixture, then stir until evenly coated.",
    "Consider mixing the mayonnaise and horseradish sauce in a separate bowl before adding it to the crab mixture.",
    "Doing so is not strictly necessary, but it may make it easier for you to distribute both ingredients evenly throughout the crab salad.",
    "Season with salt and pepper.",
    "Sprinkle the crab salad with salt and pepper, then adjust these seasonings to taste.",
    "The 1/4 tsp (1.25 ml) salt and 1/8 tsp (0.6 ml) black pepper listed in the recipe are estimates.",
    "You can add more or less as desired, or even omit the salt and pepper completely.",
    "Fold in the peas.",
    "Add the peas to the rest of the ingredients and gently fold them into the salad.",
    "Adding the peas last can help prevent them from breaking apart as you mix the ingredients.",
    "As with the canned corn, make sure that you completely drain the can of peas before adding them to the crab salad.",
    "Chill before serving.",
    "Place the crab salad in your refrigerator for at least 60 minutes.",
    "Serve cold.",
    "Store extra crab salad in a sealed glass or plastic container.",
    "Refrigerate it for up to three or four days.",
    "Finished."
  ],
  "tyn_section":[
    "Simple Crab Salad",
    "Medium skillet",
    "Mixing spoon",
    "Whisk",
    "Medium mixing bowl",
    "Sealable glass or plastic container",
    "Spicy Crab Salad",
    "Fork",
    "Russian Crab Salad",
    "Small saucepan",
    "Bowl of ice water",
    "Knife"
  ],
  "tyn_model":[
    "crab salad",
    "crab",
    "crab meat",
    "butter",
    "onion",
    "salt and pepper",
    "eggs",
    "fork",
    "bowl",
    "mayonnaise",
    "parsley",
    "peas",
    "water",
    "stove",
    "medium mixing bowl",
    "lemon",
    "skillet",
    "vegetables",
    "dressing",
    "hot sauce",
    "salt",
    "refrigerator",
    "saucepan",
    "corn",
    "horseradish sauce",
    "lump crab meat",
    "imitation crab meat",
    "crab leg",
    "imitation crab",
    "“crab",
    "” pick",
    "imitation crab sticks",
    "crab sticks",
    "plastic",
    "simple crab salad",
    "medium skillet",
    "green pepper",
    "green bell pepper",
    "vegetable",
    "sour cream",
    "lemon juice",
    "dijon mustard",
    "salt and black pepper",
    "sealed plastic or glass container",
    "mustard",
    "celery",
    "ground black pepper",
    "russian crab salad",
    "small saucepan",
    "cold water",
    "ice water",
    "kitchen knife",
    "hard boiled eggs",
    "crab-vegetable",
    "seasonings",
    "black pepper",
    "salad",
    "canned corn",
    "sealed glass or plastic container"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1016949153,
    "f1":0.1690140845,
    "avg_pos":0.5762711864
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.2203389831,
    "f1":0.3485254692
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.2711864407,
    "f1":0.4092071611
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.1525423729,
    "f1":0.2482758621
  }
}