{
  "title":"How to Repair the Thermal Fuse on an Espresso Machine",
  "url":"https://www.wikihow.com/Repair-the-Thermal-Fuse-on-an-Espresso-Machine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Coffee Accessories"
  ],
  "steps":[
    {
      "headline":"Plug in machine to another outlet that you know is working.",
      "description":""
    },
    {
      "headline":"Unplug machine (this is really, really important).",
      "description":""
    },
    {
      "headline":"Remove the top cover.",
      "description":""
    },
    {
      "headline":"Check thermal fuse.",
      "description":"It will be held down against one of the massive metal parts of the \"boiler\". The thermal fuse is ⁄8 inch (0.3 cm) diameter and half and inch long and looks like a piece of glass, and is usually encased in a plastic insulating tube."
    },
    {
      "headline":"Use a connectivity checker to see if the fuse is conducting.",
      "description":"You can't get the electrodes of the ohmmeter on the ends of the fuse, so you have to trace the wires back to some metal connection point, and touch the conductivity checker probes there. If the fuse does not conduct electricity, it must be replaced."
    },
    {
      "headline":"Unscrew the clip holding the plastic tube and fuse to the metal part, and pull one end of the plastic tube back as far as you can towards the fuse, and cut the wire from the fuse.",
      "description":"If you can't get the tube far enough to see the wire leading from the fuse, try pulling it the other way. Remove the plastic tube and cut the wire on the other side of the fuse."
    },
    {
      "headline":"Go to Radio shack with the old fuse, and buy several (3) new fuses ($1 each) of the same temperature rating (printed in tiny letters on the side of the fuse) , and a bunch of crimping connectors to connect the new fuse wires to the old wires.",
      "description":""
    },
    {
      "headline":"Connect one end of the fuse to one of the wire ends.",
      "description":"Crimp the connector using a proper tool, or pliers if you have not got a crimping tool."
    },
    {
      "headline":"Put the plastic tube back over the fuse.",
      "description":""
    },
    {
      "headline":"Join the other wire on the fuse to the remaining wire of the machine.",
      "description":""
    },
    {
      "headline":"Pull the plastic tube back over the fuse, making sure that no metal is touchable.",
      "description":"Screw the clip back on so the fuse is held securely against the metal part."
    },
    {
      "headline":"Take the remaining two fuses in their paper folders and put them securely with the crimping connectors in some safe place... perhaps with the instruction book that you have so carefully saved.",
      "description":"You will certainly need them in a year or two."
    }
  ],
  "text":" Plug in machine to another outlet that you know is working.  Unplug machine (this is really, really important).  Remove the top cover.  Check thermal fuse. It will be held down against one of the massive metal parts of the \"boiler\". The thermal fuse is ⁄8 inch (0.3 cm) diameter and half and inch long and looks like a piece of glass, and is usually encased in a plastic insulating tube. Use a connectivity checker to see if the fuse is conducting. You can't get the electrodes of the ohmmeter on the ends of the fuse, so you have to trace the wires back to some metal connection point, and touch the conductivity checker probes there. If the fuse does not conduct electricity, it must be replaced. Unscrew the clip holding the plastic tube and fuse to the metal part, and pull one end of the plastic tube back as far as you can towards the fuse, and cut the wire from the fuse. If you can't get the tube far enough to see the wire leading from the fuse, try pulling it the other way. Remove the plastic tube and cut the wire on the other side of the fuse. Go to Radio shack with the old fuse, and buy several (3) new fuses ($1 each) of the same temperature rating (printed in tiny letters on the side of the fuse) , and a bunch of crimping connectors to connect the new fuse wires to the old wires.  Connect one end of the fuse to one of the wire ends. Crimp the connector using a proper tool, or pliers if you have not got a crimping tool. Put the plastic tube back over the fuse.  Join the other wire on the fuse to the remaining wire of the machine.  Pull the plastic tube back over the fuse, making sure that no metal is touchable. Screw the clip back on so the fuse is held securely against the metal part. Take the remaining two fuses in their paper folders and put them securely with the crimping connectors in some safe place... perhaps with the instruction book that you have so carefully saved. You will certainly need them in a year or two.",
  "sentences":[
    " Plug in machine to another outlet that you know is working.",
    "Unplug machine (this is really, really important).",
    "Remove the top cover.",
    "Check thermal fuse.",
    "It will be held down against one of the massive metal parts of the \"boiler\".",
    "The thermal fuse is ⁄8 inch (0.3 cm) diameter and half and inch long and looks like a piece of glass, and is usually encased in a plastic insulating tube.",
    "Use a connectivity checker to see if the fuse is conducting.",
    "You can't get the electrodes of the ohmmeter on the ends of the fuse, so you have to trace the wires back to some metal connection point, and touch the conductivity checker probes there.",
    "If the fuse does not conduct electricity, it must be replaced.",
    "Unscrew the clip holding the plastic tube and fuse to the metal part, and pull one end of the plastic tube back as far as you can towards the fuse, and cut the wire from the fuse.",
    "If you can't get the tube far enough to see the wire leading from the fuse, try pulling it the other way.",
    "Remove the plastic tube and cut the wire on the other side of the fuse.",
    "Go to Radio shack with the old fuse, and buy several (3) new fuses ($1 each) of the same temperature rating (printed in tiny letters on the side of the fuse) , and a bunch of crimping connectors to connect the new fuse wires to the old wires.",
    "Connect one end of the fuse to one of the wire ends.",
    "Crimp the connector using a proper tool, or pliers if you have not got a crimping tool.",
    "Put the plastic tube back over the fuse.",
    "Join the other wire on the fuse to the remaining wire of the machine.",
    "Pull the plastic tube back over the fuse, making sure that no metal is touchable.",
    "Screw the clip back on so the fuse is held securely against the metal part.",
    "Take the remaining two fuses in their paper folders and put them securely with the crimping connectors in some safe place... perhaps with the instruction book that you have so carefully saved.",
    "You will certainly need them in a year or two."
  ],
  "tyn_section":[
    "Phillips or slot screwdriver",
    "Crimping tool or pliers"
  ],
  "tyn_model":[
    "fuse",
    "crimping connectors",
    "boiler",
    "radio shack",
    "pliers",
    "plastic tube"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}