{
  "title":"How to Make Tapioca Pearls",
  "url":"https://www.wikihow.com/Make-Tapioca-Pearls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Tea",
    "Milk Tea",
    "Bubble Tea"
  ],
  "parts":[
    {
      "name":"Mixing the Dough",
      "steps":[
        {
          "headline":"Bring ⁄3 cup (79 ml) of water to a boil.",
          "description":"Pour the water into a pot or kettle and heat it until it's vigorously boiling. Keep in mind that some of this water will evaporate as the water comes to a boil, but you'll only need ⁄4 cup (59 ml) for the dough."
        },
        {
          "headline":"Put the tapioca starch and boiling water into a bowl.",
          "description":"Place 1/2 cup (65 g) of tapioca starch into a heat-proof bowl and carefully pour in ⁄4 cup (59 ml) of the boiling water. You can find tapioca starch near cornstarch and flour in your grocery store's baking aisle or at local Asian markets."
        },
        {
          "headline":"Stir the mixture to combine the ingredients.",
          "description":"Use a spoon or chopsticks to stir the boiling water into the tapioca starch until the dry powder isn't visible. The mixture should look chunky and somewhat dry.Variation: To make black tapioca pearls, add a few drops of black food coloring or a pinch of activated charcoal to the bowl before you knead the dough. Keep adding coloring until the dough is as dark as you like."
        },
        {
          "headline":"Knead the mixture to make a thick dough.",
          "description":"Once it's cool enough to handle, you can use your hands to knead the mixture into a thick dough. This should take about 1 minute for the dough to come together into a firm dough. If the dough is too sticky to handle, sprinkle a little more tapioca starch over and work it into the dough. Keep in mind that if you dyed the dough, it may stain your fingers or work surface. Consider putting the dough on a plastic mat or piece of parchment paper to prevent staining."
        }
      ]
    },
    {
      "name":"Shaping the Pearls",
      "steps":[
        {
          "headline":"Line a sheet with parchment paper and cover the dough with a towel.",
          "description":"Place a rimmed baking sheet next to your work surface and lay a piece of parchment paper on it. To prevent the dough from drying out as you roll the pearls, cover the bowl with a damp towel. Use a rimmed baking sheet so the pearls don't roll off if you need to move the sheet."
        },
        {
          "headline":"Roll 1/2 of the dough into a 0.4 in (1.0 cm) wide rope.",
          "description":"Place the dough on your work surface and use the palms of your hand to roll the dough into a long, evenly sized rope. It should be about 0.4 in (1.0 cm) wide. Repeat this with the rest of the dough, so you have 2 long strips of dough ready to cut."
        },
        {
          "headline":"Cut the strips of dough into pearls.",
          "description":"Use a sharp knife or bench scraper to cut individual tapioca pearls from the strips of dough. You can make them any size you want, but keep in mind that the pearls will swell a little as they cook. Most standard tapioca pearls are about 0.4 to 0.8 in (1.0 to 2.0 cm) in diameter before they're cooked."
        },
        {
          "headline":"Set the tapioca pearls on the baking sheet for up to 2 hours.",
          "description":"Transfer the pearls to the parchment paper-lined baking sheet and leave them at room temperature for up to 2 hours. Ensure that the pearls aren't touching as they dry or they could stick together.Did You Know? Drying the pearls slightly will prevent them from sticking together as they boil. If you'd like to store the tapioca pearls for later, freeze them in an airtight container for up to 3 months. To make the pearls, boil them without thawing them, but add about 3 to 5 minutes to the cooking time."
        }
      ]
    },
    {
      "name":"Boiling and Using the Tapioca Pearls",
      "steps":[
        {
          "headline":"Bring a pot of water to a boil over high heat.",
          "description":"Set a large pot on the stove and fill it at least 1/2 to 3/4 full of water. Turn the burner to high so the water comes to a vigorous boil. If you'd like to cook only a handful of tapioca pearls, you can use a small pot. To make a single bubble tea drink, you'll need 1/4 cup (80 g) of cooked tapioca pearls."
        },
        {
          "headline":"Add the tapioca pearls and boil them for 15 to 20 minutes.",
          "description":"Slowly add the pearls to the boiling water so the water doesn't splash and the pearls are completely submerged. Stir the pearls and then boil them uncovered until they're completely tender. The pearls will float to the top of the pot once they're half-cooked. You may need to adjust the heat if it looks like the pot may boil over after you add the pearls."
        },
        {
          "headline":"Drain the cooked tapioca pearls.",
          "description":"Turn off the burner and use a slotted spoon to scoop the tapioca pearls out of the boiling water. Transfer the pearls to a bowl and let them cool a little before you add them to tea. If you'd like to sweeten the pearls, soak them in a sugar tea syrup for at least 1 hour.Sugar Tea Syrup: Stir together ⁄4 cup (59 ml) of hot water with 2 tablespoons (25 g) of brown sugar and 1 teabag of black tea. Steep the tea for 15 minutes before removing the teabag. Use the pearls the same day you boil them, since they'll begin to stick together and become tough."
        },
        {
          "headline":"Make a classic milk tea bubble tea.",
          "description":"To make 1 drink, steep 1 black teabag in ⁄2 cup (120 ml) of boiling water for 5 minutes. Remove the bag and let the tea cool until it's at room temperature. Place about 1/4 cup (80 g) of the cooked tapioca pearls into a serving glass. Pour 2 tablespoons (30 ml) of sugar tea syrup (even if you used sweetened tapioca pearls) over and fill the glass with ice. Then pour in the cooled black tea and ⁄2 cup (120 ml) of cold milk. Serve the bubble tea with a wide straw and enjoy it before the ice begins to melt."
        }
      ]
    }
  ],
  "text":" Mixing the Dough Bring ⁄3 cup (79 ml) of water to a boil. Pour the water into a pot or kettle and heat it until it's vigorously boiling. Keep in mind that some of this water will evaporate as the water comes to a boil, but you'll only need ⁄4 cup (59 ml) for the dough. Put the tapioca starch and boiling water into a bowl. Place 1/2 cup (65 g) of tapioca starch into a heat-proof bowl and carefully pour in ⁄4 cup (59 ml) of the boiling water. You can find tapioca starch near cornstarch and flour in your grocery store's baking aisle or at local Asian markets. Stir the mixture to combine the ingredients. Use a spoon or chopsticks to stir the boiling water into the tapioca starch until the dry powder isn't visible. The mixture should look chunky and somewhat dry.Variation: To make black tapioca pearls, add a few drops of black food coloring or a pinch of activated charcoal to the bowl before you knead the dough. Keep adding coloring until the dough is as dark as you like. Knead the mixture to make a thick dough. Once it's cool enough to handle, you can use your hands to knead the mixture into a thick dough. This should take about 1 minute for the dough to come together into a firm dough. If the dough is too sticky to handle, sprinkle a little more tapioca starch over and work it into the dough. Keep in mind that if you dyed the dough, it may stain your fingers or work surface. Consider putting the dough on a plastic mat or piece of parchment paper to prevent staining. Shaping the Pearls Line a sheet with parchment paper and cover the dough with a towel. Place a rimmed baking sheet next to your work surface and lay a piece of parchment paper on it. To prevent the dough from drying out as you roll the pearls, cover the bowl with a damp towel. Use a rimmed baking sheet so the pearls don't roll off if you need to move the sheet. Roll 1/2 of the dough into a 0.4 in (1.0 cm) wide rope. Place the dough on your work surface and use the palms of your hand to roll the dough into a long, evenly sized rope. It should be about 0.4 in (1.0 cm) wide. Repeat this with the rest of the dough, so you have 2 long strips of dough ready to cut. Cut the strips of dough into pearls. Use a sharp knife or bench scraper to cut individual tapioca pearls from the strips of dough. You can make them any size you want, but keep in mind that the pearls will swell a little as they cook. Most standard tapioca pearls are about 0.4 to 0.8 in (1.0 to 2.0 cm) in diameter before they're cooked. Set the tapioca pearls on the baking sheet for up to 2 hours. Transfer the pearls to the parchment paper-lined baking sheet and leave them at room temperature for up to 2 hours. Ensure that the pearls aren't touching as they dry or they could stick together.Did You Know? Drying the pearls slightly will prevent them from sticking together as they boil. If you'd like to store the tapioca pearls for later, freeze them in an airtight container for up to 3 months. To make the pearls, boil them without thawing them, but add about 3 to 5 minutes to the cooking time. Boiling and Using the Tapioca Pearls Bring a pot of water to a boil over high heat. Set a large pot on the stove and fill it at least 1/2 to 3/4 full of water. Turn the burner to high so the water comes to a vigorous boil. If you'd like to cook only a handful of tapioca pearls, you can use a small pot. To make a single bubble tea drink, you'll need 1/4 cup (80 g) of cooked tapioca pearls. Add the tapioca pearls and boil them for 15 to 20 minutes. Slowly add the pearls to the boiling water so the water doesn't splash and the pearls are completely submerged. Stir the pearls and then boil them uncovered until they're completely tender. The pearls will float to the top of the pot once they're half-cooked. You may need to adjust the heat if it looks like the pot may boil over after you add the pearls. Drain the cooked tapioca pearls. Turn off the burner and use a slotted spoon to scoop the tapioca pearls out of the boiling water. Transfer the pearls to a bowl and let them cool a little before you add them to tea. If you'd like to sweeten the pearls, soak them in a sugar tea syrup for at least 1 hour.Sugar Tea Syrup: Stir together ⁄4 cup (59 ml) of hot water with 2 tablespoons (25 g) of brown sugar and 1 teabag of black tea. Steep the tea for 15 minutes before removing the teabag. Use the pearls the same day you boil them, since they'll begin to stick together and become tough. Make a classic milk tea bubble tea. To make 1 drink, steep 1 black teabag in ⁄2 cup (120 ml) of boiling water for 5 minutes. Remove the bag and let the tea cool until it's at room temperature. Place about 1/4 cup (80 g) of the cooked tapioca pearls into a serving glass. Pour 2 tablespoons (30 ml) of sugar tea syrup (even if you used sweetened tapioca pearls) over and fill the glass with ice. Then pour in the cooled black tea and ⁄2 cup (120 ml) of cold milk. Serve the bubble tea with a wide straw and enjoy it before the ice begins to melt.",
  "sentences":[
    " Mixing the Dough Bring ⁄3 cup (79 ml) of water to a boil.",
    "Pour the water into a pot or kettle and heat it until it's vigorously boiling.",
    "Keep in mind that some of this water will evaporate as the water comes to a boil, but you'll only need ⁄4 cup (59 ml) for the dough.",
    "Put the tapioca starch and boiling water into a bowl.",
    "Place 1/2 cup (65 g) of tapioca starch into a heat-proof bowl and carefully pour in ⁄4 cup (59 ml) of the boiling water.",
    "You can find tapioca starch near cornstarch and flour in your grocery store's baking aisle or at local Asian markets.",
    "Stir the mixture to combine the ingredients.",
    "Use a spoon or chopsticks to stir the boiling water into the tapioca starch until the dry powder isn't visible.",
    "The mixture should look chunky and somewhat dry.Variation: To make black tapioca pearls, add a few drops of black food coloring or a pinch of activated charcoal to the bowl before you knead the dough.",
    "Keep adding coloring until the dough is as dark as you like.",
    "Knead the mixture to make a thick dough.",
    "Once it's cool enough to handle, you can use your hands to knead the mixture into a thick dough.",
    "This should take about 1 minute for the dough to come together into a firm dough.",
    "If the dough is too sticky to handle, sprinkle a little more tapioca starch over and work it into the dough.",
    "Keep in mind that if you dyed the dough, it may stain your fingers or work surface.",
    "Consider putting the dough on a plastic mat or piece of parchment paper to prevent staining.",
    "Shaping the Pearls Line a sheet with parchment paper and cover the dough with a towel.",
    "Place a rimmed baking sheet next to your work surface and lay a piece of parchment paper on it.",
    "To prevent the dough from drying out as you roll the pearls, cover the bowl with a damp towel.",
    "Use a rimmed baking sheet so the pearls don't roll off if you need to move the sheet.",
    "Roll 1/2 of the dough into a 0.4 in (1.0 cm) wide rope.",
    "Place the dough on your work surface and use the palms of your hand to roll the dough into a long, evenly sized rope.",
    "It should be about 0.4 in (1.0 cm) wide.",
    "Repeat this with the rest of the dough, so you have 2 long strips of dough ready to cut.",
    "Cut the strips of dough into pearls.",
    "Use a sharp knife or bench scraper to cut individual tapioca pearls from the strips of dough.",
    "You can make them any size you want, but keep in mind that the pearls will swell a little as they cook.",
    "Most standard tapioca pearls are about 0.4 to 0.8 in (1.0 to 2.0 cm) in diameter before they're cooked.",
    "Set the tapioca pearls on the baking sheet for up to 2 hours.",
    "Transfer the pearls to the parchment paper-lined baking sheet and leave them at room temperature for up to 2 hours.",
    "Ensure that the pearls aren't touching as they dry or they could stick together.Did You Know?",
    "Drying the pearls slightly will prevent them from sticking together as they boil.",
    "If you'd like to store the tapioca pearls for later, freeze them in an airtight container for up to 3 months.",
    "To make the pearls, boil them without thawing them, but add about 3 to 5 minutes to the cooking time.",
    "Boiling and Using the Tapioca Pearls Bring a pot of water to a boil over high heat.",
    "Set a large pot on the stove and fill it at least 1/2 to 3/4 full of water.",
    "Turn the burner to high so the water comes to a vigorous boil.",
    "If you'd like to cook only a handful of tapioca pearls, you can use a small pot.",
    "To make a single bubble tea drink, you'll need 1/4 cup (80 g) of cooked tapioca pearls.",
    "Add the tapioca pearls and boil them for 15 to 20 minutes.",
    "Slowly add the pearls to the boiling water so the water doesn't splash and the pearls are completely submerged.",
    "Stir the pearls and then boil them uncovered until they're completely tender.",
    "The pearls will float to the top of the pot once they're half-cooked.",
    "You may need to adjust the heat if it looks like the pot may boil over after you add the pearls.",
    "Drain the cooked tapioca pearls.",
    "Turn off the burner and use a slotted spoon to scoop the tapioca pearls out of the boiling water.",
    "Transfer the pearls to a bowl and let them cool a little before you add them to tea.",
    "If you'd like to sweeten the pearls, soak them in a sugar tea syrup for at least 1 hour.Sugar Tea Syrup: Stir together ⁄4 cup (59 ml) of hot water with 2 tablespoons (25 g) of brown sugar and 1 teabag of black tea.",
    "Steep the tea for 15 minutes before removing the teabag.",
    "Use the pearls the same day you boil them, since they'll begin to stick together and become tough.",
    "Make a classic milk tea bubble tea.",
    "To make 1 drink, steep 1 black teabag in ⁄2 cup (120 ml) of boiling water for 5 minutes.",
    "Remove the bag and let the tea cool until it's at room temperature.",
    "Place about 1/4 cup (80 g) of the cooked tapioca pearls into a serving glass.",
    "Pour 2 tablespoons (30 ml) of sugar tea syrup (even if you used sweetened tapioca pearls) over and fill the glass with ice.",
    "Then pour in the cooled black tea and ⁄2 cup (120 ml) of cold milk.",
    "Serve the bubble tea with a wide straw and enjoy it before the ice begins to melt."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Heat-proof bowl",
    "Large pot with a lid",
    "Slotted spoon",
    "Spoon or chopsticks",
    "Towel",
    "Rimmed baking sheet",
    "Parchment paper",
    "Knife or bench scraper",
    "Serving glass",
    "Wide straw"
  ],
  "tyn_model":[
    "water",
    "tapioca pearls",
    "tapioca starch",
    "parchment paper",
    "baking sheet",
    "bowl",
    "sugar tea syrup",
    "burner",
    "bubble tea",
    "pot",
    "tea",
    "black tea",
    "ice",
    "pot or kettle",
    "heat-proof bowl",
    "flour",
    "spoon",
    "black food coloring",
    "activated charcoal",
    "sharp knife",
    "airtight container",
    "slotted spoon",
    "hot water",
    "brown sugar",
    "milk tea",
    "boiling water",
    "serving glass",
    "sweetened tapioca pearls",
    "glass",
    "cold milk",
    "wide straw"
  ],
  "simple_metrics":{
    "r":0.4545454545,
    "p":0.1612903226,
    "f1":0.2380952381,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5454545455,
    "p":0.2903225806,
    "f1":0.3789473684
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6363636364,
    "p":0.2903225806,
    "f1":0.3987341772
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5454545455,
    "p":0.1935483871,
    "f1":0.2857142857
  }
}