{
  "title":"How to Make and Shoot Mini Paper Bullets with Rubber Bands",
  "url":"https://www.wikihow.com/Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Wargaming",
    "Toy Weaponry"
  ],
  "parts":[
    {
      "name":"Preparation",
      "steps":[
        {
          "headline":"Gather what you need.",
          "description":"There is no doubt that it is absolutely simple. You will need:\n1 Rubber Band\n1 Sheet of Paper\nScissors or Ruler (Optional)"
        },
        {
          "headline":"Make your ammo.",
          "description":"Take your piece of paper. Cut or tear the piece of paper into smaller pieces with your hands, scissors, ruler, etc. The small papers should be roughly near 7 cm by 1 cm. Scrunch up the small pieces of paper into a good-sized, tight and firm paper ball. This will be called a mini-paper bullet. Make a few more bullets to add to your ammo stock. For a more advanced paper bullet, you could also try making paper hornets."
        }
      ]
    },
    {
      "name":"Shooting: Basic Method 1",
      "steps":[
        {
          "headline":"Take the Rubber band.",
          "description":"Wrap it around your thumb and index finger. Make sure to put the rubber band on your default hand (hand that you usually use)."
        },
        {
          "headline":"Grab a bullet and move it in between the rubber band.",
          "description":"Pinch it with your thumb and index finger of your other hand. Don't let go of the bullet."
        },
        {
          "headline":"Pull the bullet towards you.",
          "description":"If you are pulling the closest band towards you, you are doing it correctly."
        },
        {
          "headline":"Draw, aim and let it go.",
          "description":""
        }
      ]
    },
    {
      "name":"Shooting: Basic Method 2",
      "steps":[
        {
          "headline":"Repeat the setup for the first method without fitting the bullet.",
          "description":""
        },
        {
          "headline":"Pinch and place the bullet outside of the rubber band away from you.",
          "description":"Pull the band that is further away from you towards you. This will overlap the band that is closest towards you. Do not pull the band closest towards you."
        },
        {
          "headline":"Draw, aim and fire.",
          "description":""
        }
      ]
    },
    {
      "name":"Shooting: Full Power",
      "steps":[
        {
          "headline":"Repeat the setup as before without fitting the bullet.",
          "description":""
        },
        {
          "headline":"Pinch and place the bullet in the same way as the second method.",
          "description":""
        },
        {
          "headline":"Pull the bullet towards you.",
          "description":"This time, pull both bands."
        },
        {
          "headline":"Draw, aim, release.",
          "description":""
        }
      ]
    },
    {
      "name":"Shooting: Advanced Method 1",
      "steps":[
        {
          "headline":"Setup the rubber band wrapped around your thumb and index finger.",
          "description":"The tricky part is coming up. Although it is easy to do practically, describing it in words is a different matter."
        },
        {
          "headline":"Hold the band closest to you.",
          "description":"Pull it under the band farthest from you."
        },
        {
          "headline":"Move it to the base of your middle finger without any twisting.",
          "description":"Hold the bullet by pinching it with your thumb and index finger of your other hand."
        },
        {
          "headline":"Place the bullet in front of the higher rubber band.",
          "description":""
        },
        {
          "headline":"Pull back the rubber band and twist the band.",
          "description":""
        },
        {
          "headline":"Pull back, sight, fire.",
          "description":""
        }
      ]
    },
    {
      "name":"Shooting: Advanced Method 2",
      "steps":[
        {
          "headline":"Setup the rubber like usually.",
          "description":"That is, wrapped around your thumb and index finger."
        },
        {
          "headline":"Hold the furthest band and take it under the other band towards your middle finger.",
          "description":"Twist the band you are holding and place it in the base of your middle finger. Your middle finger should be resting near the middle of your palm."
        },
        {
          "headline":"Take your mini-paper bullet.",
          "description":"Pull back the rubber band with the bullet."
        },
        {
          "headline":"Let it go and watch it fly.",
          "description":""
        }
      ]
    },
    {
      "name":"Avoid Suspicion",
      "steps":[
        {
          "headline":"Hide the bullets.",
          "description":"Whether in school, home, or work, you've got to hide your masterpiece of fun. In school, you might shoot your bullets across the room but you should hide your weapon so that people aren't suspicious of you. You certainly don't want your enemy or other people using your weapon. The best hiding spot for your bullets is your pocket. Shorts pocket, jacket pocket, all are fine. Hiding it in a pocket is another good thing because your hand could reach it easily."
        },
        {
          "headline":"Act casual.",
          "description":"Pretend to be writing or pretend to be doing something with your hands. The person you shot might think that your working hands means that it is too busy for games."
        },
        {
          "headline":"Hide the rubber band.",
          "description":"The rubber band makes a twanging sound after firing the bullet so it is a good idea to hide it quickly. If you have a watch, you could use it to cover up your rubber band. Or else you put it inside a pocket or put it next to other bracelets or things on your arm to make it look like everyday stuff. You might not get it to shoot well at first, but remember to place the bullet in the right place so the power will go into the bullet. Don't forget to read the tips below to learn more {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\\/v4-460px-Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\",\"bigUrl\":\"\\/images\\/thumb\\/3\\/3e\\/Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\\/aid6359620-v4-728px-Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":\"728\",\"bigHeight\":\"546\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        }
      ]
    }
  ],
  "text":" Preparation Gather what you need. There is no doubt that it is absolutely simple. You will need:\n1 Rubber Band\n1 Sheet of Paper\nScissors or Ruler (Optional) Make your ammo. Take your piece of paper. Cut or tear the piece of paper into smaller pieces with your hands, scissors, ruler, etc. The small papers should be roughly near 7 cm by 1 cm. Scrunch up the small pieces of paper into a good-sized, tight and firm paper ball. This will be called a mini-paper bullet. Make a few more bullets to add to your ammo stock. For a more advanced paper bullet, you could also try making paper hornets. Shooting: Basic Method 1 Take the Rubber band. Wrap it around your thumb and index finger. Make sure to put the rubber band on your default hand (hand that you usually use). Grab a bullet and move it in between the rubber band. Pinch it with your thumb and index finger of your other hand. Don't let go of the bullet. Pull the bullet towards you. If you are pulling the closest band towards you, you are doing it correctly. Draw, aim and let it go.  Shooting: Basic Method 2 Repeat the setup for the first method without fitting the bullet.  Pinch and place the bullet outside of the rubber band away from you. Pull the band that is further away from you towards you. This will overlap the band that is closest towards you. Do not pull the band closest towards you. Draw, aim and fire.  Shooting: Full Power Repeat the setup as before without fitting the bullet.  Pinch and place the bullet in the same way as the second method.  Pull the bullet towards you. This time, pull both bands. Draw, aim, release.  Shooting: Advanced Method 1 Setup the rubber band wrapped around your thumb and index finger. The tricky part is coming up. Although it is easy to do practically, describing it in words is a different matter. Hold the band closest to you. Pull it under the band farthest from you. Move it to the base of your middle finger without any twisting. Hold the bullet by pinching it with your thumb and index finger of your other hand. Place the bullet in front of the higher rubber band.  Pull back the rubber band and twist the band.  Pull back, sight, fire.  Shooting: Advanced Method 2 Setup the rubber like usually. That is, wrapped around your thumb and index finger. Hold the furthest band and take it under the other band towards your middle finger. Twist the band you are holding and place it in the base of your middle finger. Your middle finger should be resting near the middle of your palm. Take your mini-paper bullet. Pull back the rubber band with the bullet. Let it go and watch it fly.  Avoid Suspicion Hide the bullets. Whether in school, home, or work, you've got to hide your masterpiece of fun. In school, you might shoot your bullets across the room but you should hide your weapon so that people aren't suspicious of you. You certainly don't want your enemy or other people using your weapon. The best hiding spot for your bullets is your pocket. Shorts pocket, jacket pocket, all are fine. Hiding it in a pocket is another good thing because your hand could reach it easily. Act casual. Pretend to be writing or pretend to be doing something with your hands. The person you shot might think that your working hands means that it is too busy for games. Hide the rubber band. The rubber band makes a twanging sound after firing the bullet so it is a good idea to hide it quickly. If you have a watch, you could use it to cover up your rubber band. Or else you put it inside a pocket or put it next to other bracelets or things on your arm to make it look like everyday stuff. You might not get it to shoot well at first, but remember to place the bullet in the right place so the power will go into the bullet. Don't forget to read the tips below to learn more {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\\/v4-460px-Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\",\"bigUrl\":\"\\/images\\/thumb\\/3\\/3e\\/Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\\/aid6359620-v4-728px-Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":\"728\",\"bigHeight\":\"546\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}",
  "sentences":[
    " Preparation Gather what you need.",
    "There is no doubt that it is absolutely simple.",
    "You will need:\n1 Rubber Band\n1 Sheet of Paper\nScissors or Ruler (Optional) Make your ammo.",
    "Take your piece of paper.",
    "Cut or tear the piece of paper into smaller pieces with your hands, scissors, ruler, etc.",
    "The small papers should be roughly near 7 cm by 1 cm.",
    "Scrunch up the small pieces of paper into a good-sized, tight and firm paper ball.",
    "This will be called a mini-paper bullet.",
    "Make a few more bullets to add to your ammo stock.",
    "For a more advanced paper bullet, you could also try making paper hornets.",
    "Shooting: Basic Method 1 Take the Rubber band.",
    "Wrap it around your thumb and index finger.",
    "Make sure to put the rubber band on your default hand (hand that you usually use).",
    "Grab a bullet and move it in between the rubber band.",
    "Pinch it with your thumb and index finger of your other hand.",
    "Don't let go of the bullet.",
    "Pull the bullet towards you.",
    "If you are pulling the closest band towards you, you are doing it correctly.",
    "Draw, aim and let it go.",
    "Shooting: Basic Method 2 Repeat the setup for the first method without fitting the bullet.",
    "Pinch and place the bullet outside of the rubber band away from you.",
    "Pull the band that is further away from you towards you.",
    "This will overlap the band that is closest towards you.",
    "Do not pull the band closest towards you.",
    "Draw, aim and fire.",
    "Shooting: Full Power Repeat the setup as before without fitting the bullet.",
    "Pinch and place the bullet in the same way as the second method.",
    "Pull the bullet towards you.",
    "This time, pull both bands.",
    "Draw, aim, release.",
    "Shooting: Advanced Method 1 Setup the rubber band wrapped around your thumb and index finger.",
    "The tricky part is coming up.",
    "Although it is easy to do practically, describing it in words is a different matter.",
    "Hold the band closest to you.",
    "Pull it under the band farthest from you.",
    "Move it to the base of your middle finger without any twisting.",
    "Hold the bullet by pinching it with your thumb and index finger of your other hand.",
    "Place the bullet in front of the higher rubber band.",
    "Pull back the rubber band and twist the band.",
    "Pull back, sight, fire.",
    "Shooting: Advanced Method 2 Setup the rubber like usually.",
    "That is, wrapped around your thumb and index finger.",
    "Hold the furthest band and take it under the other band towards your middle finger.",
    "Twist the band you are holding and place it in the base of your middle finger.",
    "Your middle finger should be resting near the middle of your palm.",
    "Take your mini-paper bullet.",
    "Pull back the rubber band with the bullet.",
    "Let it go and watch it fly.",
    "Avoid Suspicion Hide the bullets.",
    "Whether in school, home, or work, you've got to hide your masterpiece of fun.",
    "In school, you might shoot your bullets across the room but you should hide your weapon so that people aren't suspicious of you.",
    "You certainly don't want your enemy or other people using your weapon.",
    "The best hiding spot for your bullets is your pocket.",
    "Shorts pocket, jacket pocket, all are fine.",
    "Hiding it in a pocket is another good thing because your hand could reach it easily.",
    "Act casual.",
    "Pretend to be writing or pretend to be doing something with your hands.",
    "The person you shot might think that your working hands means that it is too busy for games.",
    "Hide the rubber band.",
    "The rubber band makes a twanging sound after firing the bullet so it is a good idea to hide it quickly.",
    "If you have a watch, you could use it to cover up your rubber band.",
    "Or else you put it inside a pocket or put it next to other bracelets or things on your arm to make it look like everyday stuff.",
    "You might not get it to shoot well at first, but remember to place the bullet in the right place so the power will go into the bullet.",
    "Don't forget to read the tips below to learn more {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\\/v4-460px-Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\",\"bigUrl\":\"\\/images\\/thumb\\/3\\/3e\\/Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\\/aid6359620-v4-728px-Make-and-Shoot-Mini-Paper-Bullets-with-Rubber-Bands-Step-26.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":\"728\",\"bigHeight\":\"546\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
  ],
  "tyn_section":[
    "Paper (Soft paper recommended)",
    "Rubber Band(s)",
    "Scissors or Ruler (Optional)"
  ],
  "tyn_model":[
    "rubber band",
    "paper",
    "rubber",
    "ruler",
    "scissors",
    "bullet",
    "watch",
    "parser"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.125,
    "f1":0.1818181818
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.375,
    "f1":0.48
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}