{
  "title":"How to Get Rid of Animal Pests With Hot Pepper Spray",
  "url":"https://www.wikihow.com/Get-Rid-of-Animal-Pests-With-Hot-Pepper-Spray",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds"
  ],
  "parts":[
    {
      "name":"Making Hot Pepper Spray",
      "steps":[
        {
          "headline":"Gather the supplies for making an anti-pest spray.",
          "description":"Hot peppers have a compound in them called capsaicin, which is an irritant to most animals if they smell or taste it. To make the spray, get water, hot pepper flakes or chopped hot peppers, and biodegradable dish soap. You can find hot pepper flakes at most grocery stores in the spice aisle, or you can order packets of the flakes online."
        },
        {
          "headline":"Combine 1 gallon (3.8 L) of water and 3 tbsp (15.9 g) of pepper flakes in a pot.",
          "description":"Cooking the flakes in the water will help to release the capsaicin into the water and make the mixture more potent. If you don’t have hot pepper flakes available, you can use 10 chopped cayenne or jalapeno peppers. Tip:  If you’re dealing with larger pests, like bears or moose, add an additional 2-3 tbsp (10.6-15.9 g) of hot pepper flakes to the mixture. This will make the spray more potent to scare them off!"
        },
        {
          "headline":"Heat the mixture over high heat and simmer for 15 minutes.",
          "description":"Move the pot onto a burner and cover it with a lid. Wait for the water to reach a boil, and lower the temperature to a medium heat. Then, stir the mixture regularly as it cooks to infuse the pepper into the water. Your eyes may start to water if there’s a lot of steam rising from the pot. Try to keep your face away from the steam, and leave the pot partially covered while you stir."
        },
        {
          "headline":"Remove the mixture from the heat and let it stand for 24 hours.",
          "description":"After the heating process is over, the spray needs to infuse for a longer period of time to become as potent as possible. Leave the pot covered and place it in a safe area to diffuse the pepper flavor into the water. Some gardeners let their mixture sit for up to 48 hours for a very potent infusion. However, this may not be necessary if you’re only planning to use the spray in your garden."
        },
        {
          "headline":"Strain the flakes out of the water and discard the peppers.",
          "description":"Pour the liquid through a sieve, and gather the water in a large pot under the sieve. This will separate the flakes from the water, leaving only the hot pepper spray behind. Since you’re going to be spraying the liquid, you don’t want the hot peppers suspended in the water. They can clog the spray bottle, making your spray less effective."
        },
        {
          "headline":"Add 2 tsp (10 mL) of biodegradable dish soap to the remaining liquid.",
          "description":"The dish soap helps the spray stick to the plants and other areas when you spray it outside. Make sure you only add the soap to the liquid after the pepper flakes have been strained out of the water. If they’re still in the water, the soap will stick to the flakes and get strained out. Try using a castile soap, which is biodegradable and safe for outdoor use. It won’t harm your plants or soil, but is powerful enough to add some sticking power to the spray."
        },
        {
          "headline":"Pour the liquid into a spray bottle.",
          "description":"Label the bottle to prevent a mix-up, and write the date on the outside since the spray will be most effective if used within 2-3 months. When you’re ready to use the spray, make sure the cap and nozzle are secured, and shake the bottle vigorously. If you get some liquid on your hands as you’re pouring it into the bottle, avoid touching your face, and immediately wash your hands to prevent irritation."
        }
      ]
    },
    {
      "name":"Applying the Spray to Get Rid of Pests",
      "steps":[
        {
          "headline":"Spray the liquid on and around plants to deter deer and rabbits.",
          "description":"In the morning or evening, head outside and mist the leaves, stems, and soil surrounding the plants that the deer and rabbits like best. Make sure you spray every part of the plant that you want to protect, since the animals can sometimes eat around the unsprayed parts. If you're not sure how sensitive plants will react to the spray, test a small area of a leaf first. Wait four days and if the plant doesn't react, you should be able to safely use the spray. Avoid plants, like ivy, ferns, succulents, palms, some types of tomatoes, and azaleas, which are known to be sensitive to insecticides and pesticides. Never apply the spray in the middle of the day because the heat from the sun can cause the spray to “bake” the leaves and kill the plant.Caution: If you have pets in your yard, like cats and dogs, you may want to partition off any areas that you've sprayed. Your pets can experience discomfort and burning sensations if they come in contact with or eat vegetation that has been sprayed with hot peppers."
        },
        {
          "headline":"Apply the spray to a bird feeder if you have squirrels.",
          "description":"Squirrels are very sensitive to the active ingredient in peppers, but birds are not. Spray the mixture on your bird feeder and onto the seeds inside of the feeder. When the squirrels eat the seeds, they’ll experience a burning sensation in their mouths and won’t revisit the bird feeder. Don’t worry about the birds eating the spray. They don’t have the same reaction to the spray and will still be able to enjoy the seeds. Other Ways to Repel Squirrels\nSprinkle hot pepper flakes in your garden to deter them. If squirrels are digging up your mulch and eating your plants, lay the flakes in the squirrels' favorite spots. Set up wind chimes and pinwheels to create noise and movement. Position pinwheels and wind chimes throughout your garden to scare squirrels away. Try mixing cayenne powder with petroleum jelly. If you have squirrels who like to climb poles or hang from ledges, mix 1 teaspoon (5.3 g) of cayenne powder into 3 tablespoons (40 g) of petroleum jelly. Then, smear the jelly in the places where they're climbing and running to deter them."
        },
        {
          "headline":"Use an ultra-potent pepper spray to protect against bears.",
          "description":"Most commercial bear sprays are just extremely potent pepper spray. To make your own emergency spray, replace the flakes in the spray recipe with 24 large chopped cayenne peppers, and reduce the amount of water to 2 cups (470 mL). Pour the liquid into a small spray bottle to carry with you while hiking or camping for safety in case of an unexpected bear encounter. If you have bears visiting your yard, spray the areas that they frequent. You can use a spray with less potency on camping materials, like your tent and the outside of your cooler for an extra layer of safety while you’re camping. Remember to keep pets away from the sprayed areas to avoid injury, especially if you're using a potent spray."
        },
        {
          "headline":"Re-apply the spray every week and after rain for the best results.",
          "description":"Unfortunately, the spray won’t last forever on plants. Plan to go through your garden once per week during the spring, summer, and fall to ensure that your plants are protected from pests. If it rains at any point, try to apply the spray again as soon as possible to deter deer, rabbits, and squirrels. If you notice the animal pests have been avoiding the areas that you’ve sprayed, but have chosen new targets in your garden, try spraying as many plants as you can. Eventually, the animals will learn that your garden is unsafe and will look for food elsewhere.Hot pepper spray can also deter soft-body insects, like mayflies, aphids, caterpillars, and maggots. The spray will irritate their outer shells, causing them to migrate to a different plant, but it won't kill them on contact."
        }
      ]
    }
  ],
  "text":" Making Hot Pepper Spray Gather the supplies for making an anti-pest spray. Hot peppers have a compound in them called capsaicin, which is an irritant to most animals if they smell or taste it. To make the spray, get water, hot pepper flakes or chopped hot peppers, and biodegradable dish soap. You can find hot pepper flakes at most grocery stores in the spice aisle, or you can order packets of the flakes online. Combine 1 gallon (3.8 L) of water and 3 tbsp (15.9 g) of pepper flakes in a pot. Cooking the flakes in the water will help to release the capsaicin into the water and make the mixture more potent. If you don’t have hot pepper flakes available, you can use 10 chopped cayenne or jalapeno peppers. Tip:  If you’re dealing with larger pests, like bears or moose, add an additional 2-3 tbsp (10.6-15.9 g) of hot pepper flakes to the mixture. This will make the spray more potent to scare them off! Heat the mixture over high heat and simmer for 15 minutes. Move the pot onto a burner and cover it with a lid. Wait for the water to reach a boil, and lower the temperature to a medium heat. Then, stir the mixture regularly as it cooks to infuse the pepper into the water. Your eyes may start to water if there’s a lot of steam rising from the pot. Try to keep your face away from the steam, and leave the pot partially covered while you stir. Remove the mixture from the heat and let it stand for 24 hours. After the heating process is over, the spray needs to infuse for a longer period of time to become as potent as possible. Leave the pot covered and place it in a safe area to diffuse the pepper flavor into the water. Some gardeners let their mixture sit for up to 48 hours for a very potent infusion. However, this may not be necessary if you’re only planning to use the spray in your garden. Strain the flakes out of the water and discard the peppers. Pour the liquid through a sieve, and gather the water in a large pot under the sieve. This will separate the flakes from the water, leaving only the hot pepper spray behind. Since you’re going to be spraying the liquid, you don’t want the hot peppers suspended in the water. They can clog the spray bottle, making your spray less effective. Add 2 tsp (10 mL) of biodegradable dish soap to the remaining liquid. The dish soap helps the spray stick to the plants and other areas when you spray it outside. Make sure you only add the soap to the liquid after the pepper flakes have been strained out of the water. If they’re still in the water, the soap will stick to the flakes and get strained out. Try using a castile soap, which is biodegradable and safe for outdoor use. It won’t harm your plants or soil, but is powerful enough to add some sticking power to the spray. Pour the liquid into a spray bottle. Label the bottle to prevent a mix-up, and write the date on the outside since the spray will be most effective if used within 2-3 months. When you’re ready to use the spray, make sure the cap and nozzle are secured, and shake the bottle vigorously. If you get some liquid on your hands as you’re pouring it into the bottle, avoid touching your face, and immediately wash your hands to prevent irritation. Applying the Spray to Get Rid of Pests Spray the liquid on and around plants to deter deer and rabbits. In the morning or evening, head outside and mist the leaves, stems, and soil surrounding the plants that the deer and rabbits like best. Make sure you spray every part of the plant that you want to protect, since the animals can sometimes eat around the unsprayed parts. If you're not sure how sensitive plants will react to the spray, test a small area of a leaf first. Wait four days and if the plant doesn't react, you should be able to safely use the spray. Avoid plants, like ivy, ferns, succulents, palms, some types of tomatoes, and azaleas, which are known to be sensitive to insecticides and pesticides. Never apply the spray in the middle of the day because the heat from the sun can cause the spray to “bake” the leaves and kill the plant.Caution: If you have pets in your yard, like cats and dogs, you may want to partition off any areas that you've sprayed. Your pets can experience discomfort and burning sensations if they come in contact with or eat vegetation that has been sprayed with hot peppers. Apply the spray to a bird feeder if you have squirrels. Squirrels are very sensitive to the active ingredient in peppers, but birds are not. Spray the mixture on your bird feeder and onto the seeds inside of the feeder. When the squirrels eat the seeds, they’ll experience a burning sensation in their mouths and won’t revisit the bird feeder. Don’t worry about the birds eating the spray. They don’t have the same reaction to the spray and will still be able to enjoy the seeds. Other Ways to Repel Squirrels\nSprinkle hot pepper flakes in your garden to deter them. If squirrels are digging up your mulch and eating your plants, lay the flakes in the squirrels' favorite spots. Set up wind chimes and pinwheels to create noise and movement. Position pinwheels and wind chimes throughout your garden to scare squirrels away. Try mixing cayenne powder with petroleum jelly. If you have squirrels who like to climb poles or hang from ledges, mix 1 teaspoon (5.3 g) of cayenne powder into 3 tablespoons (40 g) of petroleum jelly. Then, smear the jelly in the places where they're climbing and running to deter them. Use an ultra-potent pepper spray to protect against bears. Most commercial bear sprays are just extremely potent pepper spray. To make your own emergency spray, replace the flakes in the spray recipe with 24 large chopped cayenne peppers, and reduce the amount of water to 2 cups (470 mL). Pour the liquid into a small spray bottle to carry with you while hiking or camping for safety in case of an unexpected bear encounter. If you have bears visiting your yard, spray the areas that they frequent. You can use a spray with less potency on camping materials, like your tent and the outside of your cooler for an extra layer of safety while you’re camping. Remember to keep pets away from the sprayed areas to avoid injury, especially if you're using a potent spray. Re-apply the spray every week and after rain for the best results. Unfortunately, the spray won’t last forever on plants. Plan to go through your garden once per week during the spring, summer, and fall to ensure that your plants are protected from pests. If it rains at any point, try to apply the spray again as soon as possible to deter deer, rabbits, and squirrels. If you notice the animal pests have been avoiding the areas that you’ve sprayed, but have chosen new targets in your garden, try spraying as many plants as you can. Eventually, the animals will learn that your garden is unsafe and will look for food elsewhere.Hot pepper spray can also deter soft-body insects, like mayflies, aphids, caterpillars, and maggots. The spray will irritate their outer shells, causing them to migrate to a different plant, but it won't kill them on contact.",
  "sentences":[
    " Making Hot Pepper Spray Gather the supplies for making an anti-pest spray.",
    "Hot peppers have a compound in them called capsaicin, which is an irritant to most animals if they smell or taste it.",
    "To make the spray, get water, hot pepper flakes or chopped hot peppers, and biodegradable dish soap.",
    "You can find hot pepper flakes at most grocery stores in the spice aisle, or you can order packets of the flakes online.",
    "Combine 1 gallon (3.8 L) of water and 3 tbsp (15.9 g) of pepper flakes in a pot.",
    "Cooking the flakes in the water will help to release the capsaicin into the water and make the mixture more potent.",
    "If you don’t have hot pepper flakes available, you can use 10 chopped cayenne or jalapeno peppers.",
    "Tip:  If you’re dealing with larger pests, like bears or moose, add an additional 2-3 tbsp (10.6-15.9 g) of hot pepper flakes to the mixture.",
    "This will make the spray more potent to scare them off!",
    "Heat the mixture over high heat and simmer for 15 minutes.",
    "Move the pot onto a burner and cover it with a lid.",
    "Wait for the water to reach a boil, and lower the temperature to a medium heat.",
    "Then, stir the mixture regularly as it cooks to infuse the pepper into the water.",
    "Your eyes may start to water if there’s a lot of steam rising from the pot.",
    "Try to keep your face away from the steam, and leave the pot partially covered while you stir.",
    "Remove the mixture from the heat and let it stand for 24 hours.",
    "After the heating process is over, the spray needs to infuse for a longer period of time to become as potent as possible.",
    "Leave the pot covered and place it in a safe area to diffuse the pepper flavor into the water.",
    "Some gardeners let their mixture sit for up to 48 hours for a very potent infusion.",
    "However, this may not be necessary if you’re only planning to use the spray in your garden.",
    "Strain the flakes out of the water and discard the peppers.",
    "Pour the liquid through a sieve, and gather the water in a large pot under the sieve.",
    "This will separate the flakes from the water, leaving only the hot pepper spray behind.",
    "Since you’re going to be spraying the liquid, you don’t want the hot peppers suspended in the water.",
    "They can clog the spray bottle, making your spray less effective.",
    "Add 2 tsp (10 mL) of biodegradable dish soap to the remaining liquid.",
    "The dish soap helps the spray stick to the plants and other areas when you spray it outside.",
    "Make sure you only add the soap to the liquid after the pepper flakes have been strained out of the water.",
    "If they’re still in the water, the soap will stick to the flakes and get strained out.",
    "Try using a castile soap, which is biodegradable and safe for outdoor use.",
    "It won’t harm your plants or soil, but is powerful enough to add some sticking power to the spray.",
    "Pour the liquid into a spray bottle.",
    "Label the bottle to prevent a mix-up, and write the date on the outside since the spray will be most effective if used within 2-3 months.",
    "When you’re ready to use the spray, make sure the cap and nozzle are secured, and shake the bottle vigorously.",
    "If you get some liquid on your hands as you’re pouring it into the bottle, avoid touching your face, and immediately wash your hands to prevent irritation.",
    "Applying the Spray to Get Rid of Pests Spray the liquid on and around plants to deter deer and rabbits.",
    "In the morning or evening, head outside and mist the leaves, stems, and soil surrounding the plants that the deer and rabbits like best.",
    "Make sure you spray every part of the plant that you want to protect, since the animals can sometimes eat around the unsprayed parts.",
    "If you're not sure how sensitive plants will react to the spray, test a small area of a leaf first.",
    "Wait four days and if the plant doesn't react, you should be able to safely use the spray.",
    "Avoid plants, like ivy, ferns, succulents, palms, some types of tomatoes, and azaleas, which are known to be sensitive to insecticides and pesticides.",
    "Never apply the spray in the middle of the day because the heat from the sun can cause the spray to “bake” the leaves and kill the plant.Caution: If you have pets in your yard, like cats and dogs, you may want to partition off any areas that you've sprayed.",
    "Your pets can experience discomfort and burning sensations if they come in contact with or eat vegetation that has been sprayed with hot peppers.",
    "Apply the spray to a bird feeder if you have squirrels.",
    "Squirrels are very sensitive to the active ingredient in peppers, but birds are not.",
    "Spray the mixture on your bird feeder and onto the seeds inside of the feeder.",
    "When the squirrels eat the seeds, they’ll experience a burning sensation in their mouths and won’t revisit the bird feeder.",
    "Don’t worry about the birds eating the spray.",
    "They don’t have the same reaction to the spray and will still be able to enjoy the seeds.",
    "Other Ways to Repel Squirrels\nSprinkle hot pepper flakes in your garden to deter them.",
    "If squirrels are digging up your mulch and eating your plants, lay the flakes in the squirrels' favorite spots.",
    "Set up wind chimes and pinwheels to create noise and movement.",
    "Position pinwheels and wind chimes throughout your garden to scare squirrels away.",
    "Try mixing cayenne powder with petroleum jelly.",
    "If you have squirrels who like to climb poles or hang from ledges, mix 1 teaspoon (5.3 g) of cayenne powder into 3 tablespoons (40 g) of petroleum jelly.",
    "Then, smear the jelly in the places where they're climbing and running to deter them.",
    "Use an ultra-potent pepper spray to protect against bears.",
    "Most commercial bear sprays are just extremely potent pepper spray.",
    "To make your own emergency spray, replace the flakes in the spray recipe with 24 large chopped cayenne peppers, and reduce the amount of water to 2 cups (470 mL).",
    "Pour the liquid into a small spray bottle to carry with you while hiking or camping for safety in case of an unexpected bear encounter.",
    "If you have bears visiting your yard, spray the areas that they frequent.",
    "You can use a spray with less potency on camping materials, like your tent and the outside of your cooler for an extra layer of safety while you’re camping.",
    "Remember to keep pets away from the sprayed areas to avoid injury, especially if you're using a potent spray.",
    "Re-apply the spray every week and after rain for the best results.",
    "Unfortunately, the spray won’t last forever on plants.",
    "Plan to go through your garden once per week during the spring, summer, and fall to ensure that your plants are protected from pests.",
    "If it rains at any point, try to apply the spray again as soon as possible to deter deer, rabbits, and squirrels.",
    "If you notice the animal pests have been avoiding the areas that you’ve sprayed, but have chosen new targets in your garden, try spraying as many plants as you can.",
    "Eventually, the animals will learn that your garden is unsafe and will look for food elsewhere.Hot pepper spray can also deter soft-body insects, like mayflies, aphids, caterpillars, and maggots.",
    "The spray will irritate their outer shells, causing them to migrate to a different plant, but it won't kill them on contact."
  ],
  "tyn_section":[
    "Large pot",
    "Water",
    "Hot pepper flakes",
    "Biodegradable dish soap",
    "Strainer or sieve",
    "Spray bottle"
  ],
  "tyn_model":[
    "water",
    "pot",
    "dish soap",
    "hot pepper",
    "peppers",
    "bird feeder",
    "pepper spray",
    "hot pepper spray",
    "hot pepper flakes",
    "pepper",
    "soap",
    "spray bottle",
    "wind chimes",
    "cayenne powder",
    "petroleum jelly",
    "hot peppers",
    "pepper flakes",
    "burner",
    "sieve",
    "large pot",
    "castile soap",
    "tomatoes",
    "pesticides",
    "“bake",
    "” the",
    "birds",
    "jelly",
    "cayenne peppers",
    "aphids",
    "maggots"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1333333333,
    "f1":0.2222222222,
    "avg_pos":0.6333333333
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.3,
    "f1":0.4411764706
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.4333333333,
    "f1":0.6046511628
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8333333333,
    "p":0.2333333333,
    "f1":0.3645833333
  }
}