{
  "title":"How to Cook Good Food",
  "url":"https://www.wikihow.com/Cook-Good-Food",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Crafting Better Dishes",
      "steps":[
        {
          "headline":"Focus, at first, on the 1-2 types of cuisine you want to cook the most.",
          "description":"The world of food is wide, diverse, and exciting, but you can't tackle it all at once. Think about what you really want to cook, and make an effort to \"master\" a certain type of food -- Italian, Indian, brunch, soups, etc. The good news is that most kitchen techniques are universal, and will translate to any type of food. Focusing on similar dishes now, however, lets you master the flavorings, techniques, and workflow without worrying if it will taste good. You'll improve cooking stills while mastering 4-5 recipes you'll have for the rest of your life. Then you can expand. Buy 1-2 cookbooks in a cuisine you love, then commit to working through them. Each recipe will teach you a little more about your chosen foods and ingredients, even if it is just a novel way to eat them."
        },
        {
          "headline":"Know what is in season to find the best vegetables available.",
          "description":"In-season means that the vegetable is naturally harvested at the time you're shopping, meaning it is the freshest it can get. Better ingredients lead to better dishes, and in-season vegetables are the best way to get surprisingly great flavor out of even the simplest meals. Going to your local farmer's market can help, as they only carry things in season, but you can do a little research before hitting the supermarket, too. Check out this handy \"Seasonal Veggie Chart\" for help shopping. Join your local CSA, a vegetable sharing group, to get in-season vegetables delivered right to your door."
        },
        {
          "headline":"Read recipes, and then actually make them according to the instructions.",
          "description":"Many home cooks want to just experiment, putting together ingredients based on intuition. This is a great way to get used to cooking and learn how ingredients are used, but it won't turn you into a good cook. Think about it -- would you rather make poached eggs 5 times on your own, hoping to learn the secret to a good batch, or learn from cooks who have already done all the work for you? When reading recipes, write in the margins! Give yourself tips and notes as you work to make the next cook even better. Experiment! Make yourself try 1-2 new recipes a week to expand your horizons. As you get better, try recipes that require new techniques, like braising, deglazing, spatchcocking, etc."
        },
        {
          "headline":"Dig into the \"how\" and \"why\" of cooking, not just the recipe, when reading cookbooks.",
          "description":"The best way to cook good food, anytime, is to understand the principles of cooking, not the basic steps. For example, you don't need a chemistry degree to make sense of the Maillard Reaction (the golden-brown, sweet flavored crust that forms at high temperatures), but knowing that water gets in the way of it teaches you to pat your foods dry before grilling them. Reading through a cookbook, all of it, is a great way to pick up useful bits of information. Be curious -- do you know why milk curdles when mixed with acids? Why do you need to proof the yeast before baking? Let Google be your culinary school and you'll be a pro in no time. Check out food blogs, like America's Test Kitchen or Serious Eats, that focus on the art and science of cooking, not just the ingredients and recipe."
        }
      ]
    },
    {
      "name":"Mastering Basic Cooking",
      "steps":[
        {
          "headline":"Learn the key vegetable base of your cuisine, setting up your \"canvas\" for experimentation.",
          "description":"In western cooking, a mirepoix is a combination of onions, carrots, and celery used as the base of many kinds of soup, sauces and dishes. There is generally twice as much onion as carrots and celery. You then cook the ingredients until soft in some oil, then use it to start your soup or sauce. It is key in French and Italian cooking, in particular. The longer you cook a base, the deeper the flavor. For Cajun/Creole dishes, many people substitute green bell peppers for carrots. In Indian cooking, the \"holy trinity\" is onion, garlic, and ginger. It is used similarly, as a base. In Spanish cuisine (like paella), use onions, garlic, and tomatoes. In German cooking, you might use carrot, celeriac, and leek. Caribbean cooking uses hot peppers, onions, cubanelles, garlic, and cilantro often pounded to a paste. West African cuisine uses green & yellow onions, hot peppers, bell peppers, and garlic, often pounded into a paste."
        },
        {
          "headline":"Understand the power of spices, and which ones match well with which cuisines.",
          "description":"There are far too many spices to mention them all here, but there are some simple, easy combinations that all good cooks should know. A diverse, big spice rack is essential for cooking different cuisines and imparting subtle, but necessary, flavor to great dishes. The following, though necessarily incomplete lists, is a good starting point. Italian: Basil, rosemary, thyme, oregano, bay leaves, cracked red pepper, fennel, pine nuts\n\nFrench: Rosemary, parsley, thyme, basil, bay leaves, marjoram, nutmeg\n\nAmerican: Paprika, chili powder, oregano, basil, thyme -- very open-ended\n\n\nMexican: Oregano, chili powder, chipotle, cayenne, paprika, cinnamon, cilantro\n\nIndian: Ginger, cumin, coriander, paprika, turmeric, cardamom, mustard seed, gram masala (spice mixture), clove, hot chili peppers, nutmeg\n\nWest African: Paprika, dijon, garlic/onion powder, hibiscus, cayenne, cumin, hot pepper\n\nChinese: Hot pepper, hot mustard seed, cinnamon, star anise, fennel, clove, ginger, licorice, sesame seeds, chili oilToast powdered or dried spices for 30 seconds in a medium hot pan, then cool them off before using for added flavor and professional complexity."
        },
        {
          "headline":"Salt your food throughout cooking.",
          "description":"Salt actually changes the chemical reactions taking place as you cook, removing moisture and expanding flavor. Anytime you add a new ingredient to the pan, sprinkle in a light dash of salt. Then, as you taste, you can keep adding salt to taste. Meats should be salted at least 20 minutes in advance of cooking, at room temperature. This removes surface moisture, allowing for a solid, tasty crust to form on the outside or skin."
        },
        {
          "headline":"Taste your meal constantly as you cook.",
          "description":"Trust your nose and tongue, not your eyes, when spicing foods. Good cooks are tasting constantly, checking in on their food at every stage of cooking. Spices actually mature in a dish, growing in flavor the longer they cook (so long as they don't burn). When cooking, you must be constantly sampling your food, adding a touch of this or a dash of that where needed. In general, fresh spices need to be added towards the end, so they don't overcook, and dry spices should be added early on to soften and gather flavor. That said, you don't want to tear the dish apart. In general, a little taste after every new ingredient or spice should cover your bases."
        },
        {
          "headline":"Understand the power of a good acid.",
          "description":"Whole books have been written about the used of acids, like lemon and vinegar, in cooking. Simply put, they give the food a kick in the pants, an expanding flavors so they pop more when you take your first bite. Acids are best when added at the very end of a dish for a fresh splash of flavor. If your dish is too acidic, add in some fat or sugar to balance it out. Try out:\n\nVinegar: Balsamic is sweet, white is bitter, rice is light, red wine is hearty, at this is only the beginning. A splash of the right vinegar in the pan, right before removing the food, is heavenly. Citrus: Usually lemon, lime, or both, though oranges have use in some Caribbean and Asian cuisines. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco. He has been working in restaurants for over ten years. Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants. Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tStart with salt and acid, then add depth. Chef Alex Hong, who's worked in Michelin-starred restaurants, says: \"The easiest way to make sure everything is properly balanced is acid and salt. Then, add a little bit of microplaned garlic or some tarragon leaves, which is really going to add some depth into whatever you're making.\""
        },
        {
          "headline":"Prioritize great ingredients over difficult or complex recipes.",
          "description":"Good ingredients make good food. Moreover, you'll learn more from mastering a simple sauce than going for broke with an 8-hour meal. Each of the following recipes are great starters that will not only teach you valuable skills, they also make wonderful dishes:\n\nBasic Tomato Sauce (teaches vegetable chopping, sauces, \"mirepoix,\" seasoning)\n\nIndian Curry (teaches pre-seasoning, ingredient substitution, time management)\n\nStir-Fry (teaches cutting technique, cooking timing, deglazing, pan-frying)\n\nRoast Chicken or Turkey (teaches poultry/meat breakdown, roasting, time management, internal meat temperatures, and homemade gravies and roux)\n\nBasic Pizza Dough (teaches baking basics, working with yeast, recipe customization')\n\nHomemade Vinaigrette & Homemade Salads (teaches emulsion, uses of different greens, working with different flavored oils and vinegar, effective meal planning)"
        }
      ]
    },
    {
      "name":"Cooking Cleanly and Efficiently",
      "steps":[
        {
          "headline":"Stock your kitchen with the right tools for the job.",
          "description":"Walk into any kitchen store and you'll notice a dizzying array of items. But the essentials for a good kitchen can get you through 90% of all recipes. While you should expand your tools as you get better and better, you should, at least, start with:\nSkillets (1 large, 1 small)\nSaucepots (1 5-gallon, 1 1-gallon, or rough equivalents\nRoasting pan\nCasserole Dish\nDutch Oven (optional, but highly recommended)\nMetal mixing bowl(s)\nKnife set (minimum -- chef's knife, paring knife, serrated knife)\nCutting boards (at least 2 -- one for meat and one for other)\nDry and wet measuring cups/spoons\nMetal tongs. Mixing Utensils (whisk, wooden spoon, slotted spoon, ladle, spatula)"
        },
        {
          "headline":"Practice your essential knife skills until they become second nature.",
          "description":"You'll spend more time on your knife than any other tool, and it pays to use it well. Good knife skills don't only make your more efficient, they make your food taste better. Evenly cut vegetables cook evenly, avoiding the bias of meats and onions makes for more tender food, and proper technique saves you from dulled blades and hours of cutting. Some tips for professional knife work include:\nGrip the knife with your thumb and curled index finger where the blade meets the handle. You want the back of your hand pointing up, not to the side, for the best control. If the blade is curved, cut forward and back, not up and down. You want to slide the knife through the food so that the curve of the blade slides along the cutting board. Sharpen your knives every few months. Get the professionally sharpened once or twice a year. Dull blades can slip and cut you, and make cooking much less fun."
        },
        {
          "headline":"Chop everything in advance, allowing you to add your ingredients in time without stress.",
          "description":"Everything that you can safely prep ahead of time should be prepped ahead of time. Good cooks are excellent time managers, utilizing every second in the kitchen efficiently so they aren't running around with their heads cut off or leaving things accidentally on the stove. Chop your veggies. Measure out ingredients into cups or bowls. Clean workspaces before cooking, not during. Get all needed tools and items out of storage and in the kitchen. Do each stage all at once. Don't skin an onion, then cut it, then skin another, then cut it. Skin all the onions at once, then cut all the onions at once."
        },
        {
          "headline":"Meal plan to get the most out of your shops and ensure your kitchen is well stocked.",
          "description":"Good meal planning helps you get the most out of your shopping, re-using ingredients and minimizing waste. Write out a little calendar and plan out meals for the next 2-3 days to start, looking up recipes with some ingredient overlap for the best results\nKeep a list of your favorite meals and recipes to make future meal planning easier. Looking up recipes in advance will also help you see how different ingredients can be used different ways, expanding your cooking vocabulary."
        },
        {
          "headline":"Clean as you go, put ingredients away after you have used them, place used utensils by the sink ready for washing, and wipe down the bench-tops after use.",
          "description":"This makes it lots easier than a big cleanup. More importantly, it keeps your workspaces clean and clutter-free, allowing you to keep cooking or working on new dishes with ease. Anytime you handle raw meat or fish, wash down all surfaces and utensils used. Get in a habit of cleaning during downtime (sauteeing, waiting for a loaf to proof, etc. )."
        },
        {
          "headline":"Set up a \"trash bowl\" on your counter top to effectively remove bits as you work.",
          "description":"Good cooks hit the trashcan and/or compost bin a lot, trimming bits of food and unwrapping or opening ingredients. You'll be faster and more hygienic if you just keep a trash receptacle right on hand."
        },
        {
          "headline":"Know that a well run, well-organized kitchen will make good food much, much easier to pull off.",
          "description":"Your shrimp are going to burn if you have to run around looking for the sea salt, onions and potatoes will lose flavor and texture if stored wrong, and leftovers will all go to waste if you don't keep the fridge in some semblance of order. There is a reason most professional kitchens are run with army-like precision. While you don't need to go so far as labeling everything you own, an organized kitchen allows all of your energy to go into the food, not finding it. Give yourself ample space, using the biggest cutting boards you can fit. Keep everything grouped -- spices, vegetables, cooking oils, etc. -- so they are easy to find."
        }
      ]
    }
  ],
  "text":" Crafting Better Dishes Focus, at first, on the 1-2 types of cuisine you want to cook the most. The world of food is wide, diverse, and exciting, but you can't tackle it all at once. Think about what you really want to cook, and make an effort to \"master\" a certain type of food -- Italian, Indian, brunch, soups, etc. The good news is that most kitchen techniques are universal, and will translate to any type of food. Focusing on similar dishes now, however, lets you master the flavorings, techniques, and workflow without worrying if it will taste good. You'll improve cooking stills while mastering 4-5 recipes you'll have for the rest of your life. Then you can expand. Buy 1-2 cookbooks in a cuisine you love, then commit to working through them. Each recipe will teach you a little more about your chosen foods and ingredients, even if it is just a novel way to eat them. Know what is in season to find the best vegetables available. In-season means that the vegetable is naturally harvested at the time you're shopping, meaning it is the freshest it can get. Better ingredients lead to better dishes, and in-season vegetables are the best way to get surprisingly great flavor out of even the simplest meals. Going to your local farmer's market can help, as they only carry things in season, but you can do a little research before hitting the supermarket, too. Check out this handy \"Seasonal Veggie Chart\" for help shopping. Join your local CSA, a vegetable sharing group, to get in-season vegetables delivered right to your door. Read recipes, and then actually make them according to the instructions. Many home cooks want to just experiment, putting together ingredients based on intuition. This is a great way to get used to cooking and learn how ingredients are used, but it won't turn you into a good cook. Think about it -- would you rather make poached eggs 5 times on your own, hoping to learn the secret to a good batch, or learn from cooks who have already done all the work for you? When reading recipes, write in the margins! Give yourself tips and notes as you work to make the next cook even better. Experiment! Make yourself try 1-2 new recipes a week to expand your horizons. As you get better, try recipes that require new techniques, like braising, deglazing, spatchcocking, etc. Dig into the \"how\" and \"why\" of cooking, not just the recipe, when reading cookbooks. The best way to cook good food, anytime, is to understand the principles of cooking, not the basic steps. For example, you don't need a chemistry degree to make sense of the Maillard Reaction (the golden-brown, sweet flavored crust that forms at high temperatures), but knowing that water gets in the way of it teaches you to pat your foods dry before grilling them. Reading through a cookbook, all of it, is a great way to pick up useful bits of information. Be curious -- do you know why milk curdles when mixed with acids? Why do you need to proof the yeast before baking? Let Google be your culinary school and you'll be a pro in no time. Check out food blogs, like America's Test Kitchen or Serious Eats, that focus on the art and science of cooking, not just the ingredients and recipe. Mastering Basic Cooking Learn the key vegetable base of your cuisine, setting up your \"canvas\" for experimentation. In western cooking, a mirepoix is a combination of onions, carrots, and celery used as the base of many kinds of soup, sauces and dishes. There is generally twice as much onion as carrots and celery. You then cook the ingredients until soft in some oil, then use it to start your soup or sauce. It is key in French and Italian cooking, in particular. The longer you cook a base, the deeper the flavor. For Cajun/Creole dishes, many people substitute green bell peppers for carrots. In Indian cooking, the \"holy trinity\" is onion, garlic, and ginger. It is used similarly, as a base. In Spanish cuisine (like paella), use onions, garlic, and tomatoes. In German cooking, you might use carrot, celeriac, and leek. Caribbean cooking uses hot peppers, onions, cubanelles, garlic, and cilantro often pounded to a paste. West African cuisine uses green & yellow onions, hot peppers, bell peppers, and garlic, often pounded into a paste. Understand the power of spices, and which ones match well with which cuisines. There are far too many spices to mention them all here, but there are some simple, easy combinations that all good cooks should know. A diverse, big spice rack is essential for cooking different cuisines and imparting subtle, but necessary, flavor to great dishes. The following, though necessarily incomplete lists, is a good starting point. Italian: Basil, rosemary, thyme, oregano, bay leaves, cracked red pepper, fennel, pine nuts\n\nFrench: Rosemary, parsley, thyme, basil, bay leaves, marjoram, nutmeg\n\nAmerican: Paprika, chili powder, oregano, basil, thyme -- very open-ended\n\n\nMexican: Oregano, chili powder, chipotle, cayenne, paprika, cinnamon, cilantro\n\nIndian: Ginger, cumin, coriander, paprika, turmeric, cardamom, mustard seed, gram masala (spice mixture), clove, hot chili peppers, nutmeg\n\nWest African: Paprika, dijon, garlic/onion powder, hibiscus, cayenne, cumin, hot pepper\n\nChinese: Hot pepper, hot mustard seed, cinnamon, star anise, fennel, clove, ginger, licorice, sesame seeds, chili oilToast powdered or dried spices for 30 seconds in a medium hot pan, then cool them off before using for added flavor and professional complexity. Salt your food throughout cooking. Salt actually changes the chemical reactions taking place as you cook, removing moisture and expanding flavor. Anytime you add a new ingredient to the pan, sprinkle in a light dash of salt. Then, as you taste, you can keep adding salt to taste. Meats should be salted at least 20 minutes in advance of cooking, at room temperature. This removes surface moisture, allowing for a solid, tasty crust to form on the outside or skin. Taste your meal constantly as you cook. Trust your nose and tongue, not your eyes, when spicing foods. Good cooks are tasting constantly, checking in on their food at every stage of cooking. Spices actually mature in a dish, growing in flavor the longer they cook (so long as they don't burn). When cooking, you must be constantly sampling your food, adding a touch of this or a dash of that where needed. In general, fresh spices need to be added towards the end, so they don't overcook, and dry spices should be added early on to soften and gather flavor. That said, you don't want to tear the dish apart. In general, a little taste after every new ingredient or spice should cover your bases. Understand the power of a good acid. Whole books have been written about the used of acids, like lemon and vinegar, in cooking. Simply put, they give the food a kick in the pants, an expanding flavors so they pop more when you take your first bite. Acids are best when added at the very end of a dish for a fresh splash of flavor. If your dish is too acidic, add in some fat or sugar to balance it out. Try out:\n\nVinegar: Balsamic is sweet, white is bitter, rice is light, red wine is hearty, at this is only the beginning. A splash of the right vinegar in the pan, right before removing the food, is heavenly. Citrus: Usually lemon, lime, or both, though oranges have use in some Caribbean and Asian cuisines. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco. He has been working in restaurants for over ten years. Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants. Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tStart with salt and acid, then add depth. Chef Alex Hong, who's worked in Michelin-starred restaurants, says: \"The easiest way to make sure everything is properly balanced is acid and salt. Then, add a little bit of microplaned garlic or some tarragon leaves, which is really going to add some depth into whatever you're making.\" Prioritize great ingredients over difficult or complex recipes. Good ingredients make good food. Moreover, you'll learn more from mastering a simple sauce than going for broke with an 8-hour meal. Each of the following recipes are great starters that will not only teach you valuable skills, they also make wonderful dishes:\n\nBasic Tomato Sauce (teaches vegetable chopping, sauces, \"mirepoix,\" seasoning)\n\nIndian Curry (teaches pre-seasoning, ingredient substitution, time management)\n\nStir-Fry (teaches cutting technique, cooking timing, deglazing, pan-frying)\n\nRoast Chicken or Turkey (teaches poultry/meat breakdown, roasting, time management, internal meat temperatures, and homemade gravies and roux)\n\nBasic Pizza Dough (teaches baking basics, working with yeast, recipe customization')\n\nHomemade Vinaigrette & Homemade Salads (teaches emulsion, uses of different greens, working with different flavored oils and vinegar, effective meal planning) Cooking Cleanly and Efficiently Stock your kitchen with the right tools for the job. Walk into any kitchen store and you'll notice a dizzying array of items. But the essentials for a good kitchen can get you through 90% of all recipes. While you should expand your tools as you get better and better, you should, at least, start with:\nSkillets (1 large, 1 small)\nSaucepots (1 5-gallon, 1 1-gallon, or rough equivalents\nRoasting pan\nCasserole Dish\nDutch Oven (optional, but highly recommended)\nMetal mixing bowl(s)\nKnife set (minimum -- chef's knife, paring knife, serrated knife)\nCutting boards (at least 2 -- one for meat and one for other)\nDry and wet measuring cups/spoons\nMetal tongs. Mixing Utensils (whisk, wooden spoon, slotted spoon, ladle, spatula) Practice your essential knife skills until they become second nature. You'll spend more time on your knife than any other tool, and it pays to use it well. Good knife skills don't only make your more efficient, they make your food taste better. Evenly cut vegetables cook evenly, avoiding the bias of meats and onions makes for more tender food, and proper technique saves you from dulled blades and hours of cutting. Some tips for professional knife work include:\nGrip the knife with your thumb and curled index finger where the blade meets the handle. You want the back of your hand pointing up, not to the side, for the best control. If the blade is curved, cut forward and back, not up and down. You want to slide the knife through the food so that the curve of the blade slides along the cutting board. Sharpen your knives every few months. Get the professionally sharpened once or twice a year. Dull blades can slip and cut you, and make cooking much less fun. Chop everything in advance, allowing you to add your ingredients in time without stress. Everything that you can safely prep ahead of time should be prepped ahead of time. Good cooks are excellent time managers, utilizing every second in the kitchen efficiently so they aren't running around with their heads cut off or leaving things accidentally on the stove. Chop your veggies. Measure out ingredients into cups or bowls. Clean workspaces before cooking, not during. Get all needed tools and items out of storage and in the kitchen. Do each stage all at once. Don't skin an onion, then cut it, then skin another, then cut it. Skin all the onions at once, then cut all the onions at once. Meal plan to get the most out of your shops and ensure your kitchen is well stocked. Good meal planning helps you get the most out of your shopping, re-using ingredients and minimizing waste. Write out a little calendar and plan out meals for the next 2-3 days to start, looking up recipes with some ingredient overlap for the best results\nKeep a list of your favorite meals and recipes to make future meal planning easier. Looking up recipes in advance will also help you see how different ingredients can be used different ways, expanding your cooking vocabulary. Clean as you go, put ingredients away after you have used them, place used utensils by the sink ready for washing, and wipe down the bench-tops after use. This makes it lots easier than a big cleanup. More importantly, it keeps your workspaces clean and clutter-free, allowing you to keep cooking or working on new dishes with ease. Anytime you handle raw meat or fish, wash down all surfaces and utensils used. Get in a habit of cleaning during downtime (sauteeing, waiting for a loaf to proof, etc. ). Set up a \"trash bowl\" on your counter top to effectively remove bits as you work. Good cooks hit the trashcan and/or compost bin a lot, trimming bits of food and unwrapping or opening ingredients. You'll be faster and more hygienic if you just keep a trash receptacle right on hand. Know that a well run, well-organized kitchen will make good food much, much easier to pull off. Your shrimp are going to burn if you have to run around looking for the sea salt, onions and potatoes will lose flavor and texture if stored wrong, and leftovers will all go to waste if you don't keep the fridge in some semblance of order. There is a reason most professional kitchens are run with army-like precision. While you don't need to go so far as labeling everything you own, an organized kitchen allows all of your energy to go into the food, not finding it. Give yourself ample space, using the biggest cutting boards you can fit. Keep everything grouped -- spices, vegetables, cooking oils, etc. -- so they are easy to find.",
  "sentences":[
    " Crafting Better Dishes Focus, at first, on the 1-2 types of cuisine you want to cook the most.",
    "The world of food is wide, diverse, and exciting, but you can't tackle it all at once.",
    "Think about what you really want to cook, and make an effort to \"master\" a certain type of food -- Italian, Indian, brunch, soups, etc.",
    "The good news is that most kitchen techniques are universal, and will translate to any type of food.",
    "Focusing on similar dishes now, however, lets you master the flavorings, techniques, and workflow without worrying if it will taste good.",
    "You'll improve cooking stills while mastering 4-5 recipes you'll have for the rest of your life.",
    "Then you can expand.",
    "Buy 1-2 cookbooks in a cuisine you love, then commit to working through them.",
    "Each recipe will teach you a little more about your chosen foods and ingredients, even if it is just a novel way to eat them.",
    "Know what is in season to find the best vegetables available.",
    "In-season means that the vegetable is naturally harvested at the time you're shopping, meaning it is the freshest it can get.",
    "Better ingredients lead to better dishes, and in-season vegetables are the best way to get surprisingly great flavor out of even the simplest meals.",
    "Going to your local farmer's market can help, as they only carry things in season, but you can do a little research before hitting the supermarket, too.",
    "Check out this handy \"Seasonal Veggie Chart\" for help shopping.",
    "Join your local CSA, a vegetable sharing group, to get in-season vegetables delivered right to your door.",
    "Read recipes, and then actually make them according to the instructions.",
    "Many home cooks want to just experiment, putting together ingredients based on intuition.",
    "This is a great way to get used to cooking and learn how ingredients are used, but it won't turn you into a good cook.",
    "Think about it -- would you rather make poached eggs 5 times on your own, hoping to learn the secret to a good batch, or learn from cooks who have already done all the work for you?",
    "When reading recipes, write in the margins!",
    "Give yourself tips and notes as you work to make the next cook even better.",
    "Experiment!",
    "Make yourself try 1-2 new recipes a week to expand your horizons.",
    "As you get better, try recipes that require new techniques, like braising, deglazing, spatchcocking, etc.",
    "Dig into the \"how\" and \"why\" of cooking, not just the recipe, when reading cookbooks.",
    "The best way to cook good food, anytime, is to understand the principles of cooking, not the basic steps.",
    "For example, you don't need a chemistry degree to make sense of the Maillard Reaction (the golden-brown, sweet flavored crust that forms at high temperatures), but knowing that water gets in the way of it teaches you to pat your foods dry before grilling them.",
    "Reading through a cookbook, all of it, is a great way to pick up useful bits of information.",
    "Be curious -- do you know why milk curdles when mixed with acids?",
    "Why do you need to proof the yeast before baking?",
    "Let Google be your culinary school and you'll be a pro in no time.",
    "Check out food blogs, like America's Test Kitchen or Serious Eats, that focus on the art and science of cooking, not just the ingredients and recipe.",
    "Mastering Basic Cooking Learn the key vegetable base of your cuisine, setting up your \"canvas\" for experimentation.",
    "In western cooking, a mirepoix is a combination of onions, carrots, and celery used as the base of many kinds of soup, sauces and dishes.",
    "There is generally twice as much onion as carrots and celery.",
    "You then cook the ingredients until soft in some oil, then use it to start your soup or sauce.",
    "It is key in French and Italian cooking, in particular.",
    "The longer you cook a base, the deeper the flavor.",
    "For Cajun/Creole dishes, many people substitute green bell peppers for carrots.",
    "In Indian cooking, the \"holy trinity\" is onion, garlic, and ginger.",
    "It is used similarly, as a base.",
    "In Spanish cuisine (like paella), use onions, garlic, and tomatoes.",
    "In German cooking, you might use carrot, celeriac, and leek.",
    "Caribbean cooking uses hot peppers, onions, cubanelles, garlic, and cilantro often pounded to a paste.",
    "West African cuisine uses green & yellow onions, hot peppers, bell peppers, and garlic, often pounded into a paste.",
    "Understand the power of spices, and which ones match well with which cuisines.",
    "There are far too many spices to mention them all here, but there are some simple, easy combinations that all good cooks should know.",
    "A diverse, big spice rack is essential for cooking different cuisines and imparting subtle, but necessary, flavor to great dishes.",
    "The following, though necessarily incomplete lists, is a good starting point.",
    "Italian: Basil, rosemary, thyme, oregano, bay leaves, cracked red pepper, fennel, pine nuts\n\nFrench: Rosemary, parsley, thyme, basil, bay leaves, marjoram, nutmeg\n\nAmerican: Paprika, chili powder, oregano, basil, thyme -- very open-ended\n\n\nMexican: Oregano, chili powder, chipotle, cayenne, paprika, cinnamon, cilantro\n\nIndian: Ginger, cumin, coriander, paprika, turmeric, cardamom, mustard seed, gram masala (spice mixture), clove, hot chili peppers, nutmeg\n\nWest African: Paprika, dijon, garlic/onion powder, hibiscus, cayenne, cumin, hot pepper\n\nChinese: Hot pepper, hot mustard seed, cinnamon, star anise, fennel, clove, ginger, licorice, sesame seeds, chili oilToast powdered or dried spices for 30 seconds in a medium hot pan, then cool them off before using for added flavor and professional complexity.",
    "Salt your food throughout cooking.",
    "Salt actually changes the chemical reactions taking place as you cook, removing moisture and expanding flavor.",
    "Anytime you add a new ingredient to the pan, sprinkle in a light dash of salt.",
    "Then, as you taste, you can keep adding salt to taste.",
    "Meats should be salted at least 20 minutes in advance of cooking, at room temperature.",
    "This removes surface moisture, allowing for a solid, tasty crust to form on the outside or skin.",
    "Taste your meal constantly as you cook.",
    "Trust your nose and tongue, not your eyes, when spicing foods.",
    "Good cooks are tasting constantly, checking in on their food at every stage of cooking.",
    "Spices actually mature in a dish, growing in flavor the longer they cook (so long as they don't burn).",
    "When cooking, you must be constantly sampling your food, adding a touch of this or a dash of that where needed.",
    "In general, fresh spices need to be added towards the end, so they don't overcook, and dry spices should be added early on to soften and gather flavor.",
    "That said, you don't want to tear the dish apart.",
    "In general, a little taste after every new ingredient or spice should cover your bases.",
    "Understand the power of a good acid.",
    "Whole books have been written about the used of acids, like lemon and vinegar, in cooking.",
    "Simply put, they give the food a kick in the pants, an expanding flavors so they pop more when you take your first bite.",
    "Acids are best when added at the very end of a dish for a fresh splash of flavor.",
    "If your dish is too acidic, add in some fat or sugar to balance it out.",
    "Try out:\n\nVinegar: Balsamic is sweet, white is bitter, rice is light, red wine is hearty, at this is only the beginning.",
    "A splash of the right vinegar in the pan, right before removing the food, is heavenly.",
    "Citrus: Usually lemon, lime, or both, though oranges have use in some Caribbean and Asian cuisines.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlex Hong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tExecutive Chef & Restaurant Owner\t\t\t\t\t\t\t\tAlex Hong is the Executive Chef and Co-Owner of Sorrel, a New American restaurant in San Francisco.",
    "He has been working in restaurants for over ten years.",
    "Alex is a graduate of the Culinary Institute of America, and has worked in the kitchens of Jean-Georges and Quince, both Michelin-starred restaurants.",
    "Alex Hong\t\t\tExecutive Chef & Restaurant Owner\t\t\t\tStart with salt and acid, then add depth.",
    "Chef Alex Hong, who's worked in Michelin-starred restaurants, says: \"The easiest way to make sure everything is properly balanced is acid and salt.",
    "Then, add a little bit of microplaned garlic or some tarragon leaves, which is really going to add some depth into whatever you're making.\"",
    "Prioritize great ingredients over difficult or complex recipes.",
    "Good ingredients make good food.",
    "Moreover, you'll learn more from mastering a simple sauce than going for broke with an 8-hour meal.",
    "Each of the following recipes are great starters that will not only teach you valuable skills, they also make wonderful dishes:\n\nBasic Tomato Sauce (teaches vegetable chopping, sauces, \"mirepoix,\" seasoning)\n\nIndian Curry (teaches pre-seasoning, ingredient substitution, time management)\n\nStir-Fry (teaches cutting technique, cooking timing, deglazing, pan-frying)\n\nRoast Chicken or Turkey (teaches poultry/meat breakdown, roasting, time management, internal meat temperatures, and homemade gravies and roux)\n\nBasic Pizza Dough (teaches baking basics, working with yeast, recipe customization')\n\nHomemade Vinaigrette & Homemade Salads (teaches emulsion, uses of different greens, working with different flavored oils and vinegar, effective meal planning) Cooking Cleanly and Efficiently Stock your kitchen with the right tools for the job.",
    "Walk into any kitchen store and you'll notice a dizzying array of items.",
    "But the essentials for a good kitchen can get you through 90% of all recipes.",
    "While you should expand your tools as you get better and better, you should, at least, start with:\nSkillets (1 large, 1 small)\nSaucepots (1 5-gallon, 1 1-gallon, or rough equivalents\nRoasting pan\nCasserole Dish\nDutch Oven (optional, but highly recommended)\nMetal mixing bowl(s)\nKnife set (minimum -- chef's knife, paring knife, serrated knife)\nCutting boards (at least 2 -- one for meat and one for other)\nDry and wet measuring cups/spoons\nMetal tongs.",
    "Mixing Utensils (whisk, wooden spoon, slotted spoon, ladle, spatula) Practice your essential knife skills until they become second nature.",
    "You'll spend more time on your knife than any other tool, and it pays to use it well.",
    "Good knife skills don't only make your more efficient, they make your food taste better.",
    "Evenly cut vegetables cook evenly, avoiding the bias of meats and onions makes for more tender food, and proper technique saves you from dulled blades and hours of cutting.",
    "Some tips for professional knife work include:\nGrip the knife with your thumb and curled index finger where the blade meets the handle.",
    "You want the back of your hand pointing up, not to the side, for the best control.",
    "If the blade is curved, cut forward and back, not up and down.",
    "You want to slide the knife through the food so that the curve of the blade slides along the cutting board.",
    "Sharpen your knives every few months.",
    "Get the professionally sharpened once or twice a year.",
    "Dull blades can slip and cut you, and make cooking much less fun.",
    "Chop everything in advance, allowing you to add your ingredients in time without stress.",
    "Everything that you can safely prep ahead of time should be prepped ahead of time.",
    "Good cooks are excellent time managers, utilizing every second in the kitchen efficiently so they aren't running around with their heads cut off or leaving things accidentally on the stove.",
    "Chop your veggies.",
    "Measure out ingredients into cups or bowls.",
    "Clean workspaces before cooking, not during.",
    "Get all needed tools and items out of storage and in the kitchen.",
    "Do each stage all at once.",
    "Don't skin an onion, then cut it, then skin another, then cut it.",
    "Skin all the onions at once, then cut all the onions at once.",
    "Meal plan to get the most out of your shops and ensure your kitchen is well stocked.",
    "Good meal planning helps you get the most out of your shopping, re-using ingredients and minimizing waste.",
    "Write out a little calendar and plan out meals for the next 2-3 days to start, looking up recipes with some ingredient overlap for the best results\nKeep a list of your favorite meals and recipes to make future meal planning easier.",
    "Looking up recipes in advance will also help you see how different ingredients can be used different ways, expanding your cooking vocabulary.",
    "Clean as you go, put ingredients away after you have used them, place used utensils by the sink ready for washing, and wipe down the bench-tops after use.",
    "This makes it lots easier than a big cleanup.",
    "More importantly, it keeps your workspaces clean and clutter-free, allowing you to keep cooking or working on new dishes with ease.",
    "Anytime you handle raw meat or fish, wash down all surfaces and utensils used.",
    "Get in a habit of cleaning during downtime (sauteeing, waiting for a loaf to proof, etc.",
    ").",
    "Set up a \"trash bowl\" on your counter top to effectively remove bits as you work.",
    "Good cooks hit the trashcan and/or compost bin a lot, trimming bits of food and unwrapping or opening ingredients.",
    "You'll be faster and more hygienic if you just keep a trash receptacle right on hand.",
    "Know that a well run, well-organized kitchen will make good food much, much easier to pull off.",
    "Your shrimp are going to burn if you have to run around looking for the sea salt, onions and potatoes will lose flavor and texture if stored wrong, and leftovers will all go to waste if you don't keep the fridge in some semblance of order.",
    "There is a reason most professional kitchens are run with army-like precision.",
    "While you don't need to go so far as labeling everything you own, an organized kitchen allows all of your energy to go into the food, not finding it.",
    "Give yourself ample space, using the biggest cutting boards you can fit.",
    "Keep everything grouped -- spices, vegetables, cooking oils, etc.",
    "-- so they are easy to find."
  ],
  "tyn_section":[
    "Food",
    "Money",
    "A kitchen"
  ],
  "tyn_model":[
    "onions",
    "spices",
    "knife",
    "salt",
    "vegetables",
    "garlic",
    "paprika",
    "vinegar",
    "carrots",
    "onion",
    "ginger",
    "basil",
    "thyme",
    "oregano",
    "acid",
    "celery",
    "hot peppers",
    "cilantro",
    "rosemary",
    "fennel",
    "nutmeg",
    "chili powder",
    "cayenne",
    "cinnamon",
    "cumin",
    "hot pepper",
    "utensils",
    "food",
    "soups",
    "vegetable",
    "vegetable sharing group",
    "poached eggs",
    "water",
    "milk",
    "yeast",
    "culinary school",
    "oil",
    "peppers",
    "tomatoes",
    "carrot",
    "celeriac",
    "leek",
    "cubanelles",
    "bell peppers",
    "spice rack",
    "cracked red pepper",
    "pine nuts",
    "parsley",
    "marjoram",
    "chipotle",
    "coriander",
    "turmeric",
    "cardamom",
    "mustard seed",
    "spice",
    "hot chili peppers",
    "dijon",
    "garlic/onion powder",
    "hibiscus",
    "star anise",
    "licorice",
    "chili oiltoast",
    "acids",
    "lemon",
    "sugar",
    "balsamic",
    "rice",
    "red wine",
    "citrus",
    "lime",
    "oranges",
    "sorrel",
    "culinary institute of america",
    "jean-georges and",
    "quince",
    "tarragon",
    "tomato sauce",
    "indian curry",
    "roux",
    "pizza dough",
    "vinaigrette",
    "skillets",
    "saucepots",
    "roasting pan",
    "dutch oven",
    "chef's knife",
    "paring knife",
    "serrated knife",
    "spoons",
    "metal tongs",
    "whisk",
    "wooden spoon",
    "slotted spoon",
    "ladle",
    "spatula",
    "knives",
    "fish",
    "trash bowl",
    "compost bin",
    "shrimp",
    "sea salt",
    "potatoes",
    "fridge",
    "cooking oils"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0096153846,
    "f1":0.0186915888,
    "avg_pos":0.2596153846
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0096153846,
    "f1":0.0186915888
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.0096153846,
    "f1":0.0186915888
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0096153846,
    "f1":0.0186915888
  }
}