{
  "title":"How to Play a Roleplaying Game",
  "url":"https://www.wikihow.com/Play-a-Roleplaying-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Role Playing Games"
  ],
  "parts":[
    {
      "name":"Determining Your RPG",
      "steps":[
        {
          "headline":"Decide which game you want to play.",
          "description":"You can play a commercially-sold tabletop RPG like Dungeons and Dragons or Vampire: The Masquerade, or an online version like Star Wars: The Old Republic. You can also start your own roleplaying game--it's up to you! Your game should be something you're interested in and that you know other people would like to play. If you don't want to buy a game, try setting up your own roleplaying game based on fictional characters, history, or even completely imaginary characters and settings."
        },
        {
          "headline":"Find a group of like-minded players.",
          "description":"Roleplaying is a social activity, so once you've decided what you want to focus on, it's time to find two or three other people interested in the same thing. Ask your friends or search online--there are lots of RPGs that are done completely online. You can also visit your local gaming or hobby shop for regular roleplaying meetups."
        },
        {
          "headline":"Choose a rulebook or determine your rules.",
          "description":"If you'll be using a commercial RPG, all you need to decide is which rulebook you're going to follow. If you are making up your own game, it's important to set up some ground rules first so that everybody knows what to do. If you'll be using a rulebook, you can buy them online or at game shops. Sometimes a game will have multiple rulebooks, so ask for recommendations or read online reviews to determine which will be best for your roleplay. If you're making up your own game, think about what kind of limits there should be. Can players rise from the dead, fly, or disappear? If you're playing a fanfiction or historical roleplay, can they act completely different from the original character? Will you allow players to go again or start over with a new character if they've made a mistake? It might be helpful to write the rules down so everyone knows them."
        },
        {
          "headline":"Decide who your gamemaster will be.",
          "description":"The gamemaster enforces the game rules and describes the effects of each player's turn. Usually, the gamemaster is whoever knows the rules of the game best. In some games, the gamemaster is actually responsible for devising the storylines, so check your rules before choosing."
        },
        {
          "headline":"Make sure you have all the supplies.",
          "description":"Some games require nothing but pen and paper, but others might need dice, a game board, or even props and costumes. Check your rules and make sure you've got everything you need."
        },
        {
          "headline":"Choose a regular time to play.",
          "description":"If you can, try to pick a weekly or monthly meeting time for everybody to get together and play. It's much easier to have a long-term game if there's a regular time for it! Be sure to ask each player what their schedule looks like. You can have the meeting at the same place, or rotate between your houses. You can also do all of your roleplaying entirely online."
        }
      ]
    },
    {
      "name":"Creating a Character",
      "steps":[
        {
          "headline":"Choose a character from the game list.",
          "description":"If your game comes with pre-set characters, choose your favorite or the one you identify with most. If you have your heart set on a specific character, let the other players know beforehand. Many character lists are divided by class--warriors, wizards, healers, and similar categories. If you don't have a favorite, check out their stats and see if any class in particular appeals to you."
        },
        {
          "headline":"Make up your own character.",
          "description":"If your game has room for an imaginary character, think about what you'd like your character to be. What kind of character you'll choose will depend on what kind of game you're playing. Sorcerers are great for medieval fantasy games, while aliens would be better for a Star Trek roleplay."
        },
        {
          "headline":"Pick your character's strengths and weaknesses.",
          "description":"Every roleplaying character has a set of strengths and a set of weaknesses, and they should balance each other out. Nobody will want to play with you if your character is immortal and can never be hurt or tricked, but you won't enjoy the game if your character is so weak they die every round. Think about any drawbacks of your character choices. For example, your werewolf character might be stronger and scarier than your friend's vampire, but you'll only be able to use it if there's a full moon in the game."
        },
        {
          "headline":"Choose your character's accessories.",
          "description":"If your character has a weapon, armor, magic bag, or anything else than can affect the game, make sure you tell the other players about it first. You should also devise an attack or hit level the accessories give your character. For example, if your character has a pocketknife and a sword, the sword should be able to cause more damage than the knife. Or if your character carries a healing potion, determine if it can bring people back from the dead or just cure minor wounds."
        }
      ]
    },
    {
      "name":"Playing Your RPG",
      "steps":[
        {
          "headline":"Wait for the gamemaster to tell you what to do.",
          "description":"The gamemaster sets up the scene and decides who goes first. If you're playing from a guidebook or manual, this will be predetermined, but if it's a game you devised, they can pick anything."
        },
        {
          "headline":"Make an opening move that advances the story.",
          "description":"If you go first, think about the setting and devise a move that helps move the story forward. If you're in space, you probably aren't going to meet a pack of wolves, but that might be an appropriate move if you're in medieval England! Making your first move an attack is a good way to get the action going and get the other players interested. For example, instead of choosing something like “My sorcerer looks up a spell in his book,” try “My sorcerer casts a spell of blindness on your wizard.”"
        },
        {
          "headline":"Roll the dice to determine what happens (optional).",
          "description":"Some roleplaying games make you roll a dice to determine the importance of your play. If your game doesn't have dice, be prepared to talk about exactly what effect your play has on the game!"
        },
        {
          "headline":"React to other players' moves.",
          "description":"In many games, the gamemaster will determine the effects of each play. In others, players react to each other's plays immediately. If you aren't the first, it's easiest to base your move off of what the last player did. For example, if they said that a dragon appeared in the sky, you can say something like “The dragon breathes fire onto the village” or “My hunter shoots three arrows at the dragon.” Depending on your game, either the gamemaster or the next player will determine the results."
        },
        {
          "headline":"Start a new scenario.",
          "description":"If you want to move the game in a different direction, you can! Try starting a brand new scenario within your game. For example, if you are currently on a quest to find a treasure, you can have a wizard appear asking your group to save a princess first. Don't start too many subplots--it can make the game too confusing to follow."
        },
        {
          "headline":"Pause the game when time is up.",
          "description":"Part of the fun of roleplaying is telling a continuous story. You don't need to wind up the entire story when game time comes to an end. Be sure to write down the last few moves so you can pick up where you started next time. If you feel like the storyline isn't going anywhere or you'd like to start something new, that's fine too!"
        }
      ]
    }
  ],
  "text":" Determining Your RPG Decide which game you want to play. You can play a commercially-sold tabletop RPG like Dungeons and Dragons or Vampire: The Masquerade, or an online version like Star Wars: The Old Republic. You can also start your own roleplaying game--it's up to you! Your game should be something you're interested in and that you know other people would like to play. If you don't want to buy a game, try setting up your own roleplaying game based on fictional characters, history, or even completely imaginary characters and settings. Find a group of like-minded players. Roleplaying is a social activity, so once you've decided what you want to focus on, it's time to find two or three other people interested in the same thing. Ask your friends or search online--there are lots of RPGs that are done completely online. You can also visit your local gaming or hobby shop for regular roleplaying meetups. Choose a rulebook or determine your rules. If you'll be using a commercial RPG, all you need to decide is which rulebook you're going to follow. If you are making up your own game, it's important to set up some ground rules first so that everybody knows what to do. If you'll be using a rulebook, you can buy them online or at game shops. Sometimes a game will have multiple rulebooks, so ask for recommendations or read online reviews to determine which will be best for your roleplay. If you're making up your own game, think about what kind of limits there should be. Can players rise from the dead, fly, or disappear? If you're playing a fanfiction or historical roleplay, can they act completely different from the original character? Will you allow players to go again or start over with a new character if they've made a mistake? It might be helpful to write the rules down so everyone knows them. Decide who your gamemaster will be. The gamemaster enforces the game rules and describes the effects of each player's turn. Usually, the gamemaster is whoever knows the rules of the game best. In some games, the gamemaster is actually responsible for devising the storylines, so check your rules before choosing. Make sure you have all the supplies. Some games require nothing but pen and paper, but others might need dice, a game board, or even props and costumes. Check your rules and make sure you've got everything you need. Choose a regular time to play. If you can, try to pick a weekly or monthly meeting time for everybody to get together and play. It's much easier to have a long-term game if there's a regular time for it! Be sure to ask each player what their schedule looks like. You can have the meeting at the same place, or rotate between your houses. You can also do all of your roleplaying entirely online. Creating a Character Choose a character from the game list. If your game comes with pre-set characters, choose your favorite or the one you identify with most. If you have your heart set on a specific character, let the other players know beforehand. Many character lists are divided by class--warriors, wizards, healers, and similar categories. If you don't have a favorite, check out their stats and see if any class in particular appeals to you. Make up your own character. If your game has room for an imaginary character, think about what you'd like your character to be. What kind of character you'll choose will depend on what kind of game you're playing. Sorcerers are great for medieval fantasy games, while aliens would be better for a Star Trek roleplay. Pick your character's strengths and weaknesses. Every roleplaying character has a set of strengths and a set of weaknesses, and they should balance each other out. Nobody will want to play with you if your character is immortal and can never be hurt or tricked, but you won't enjoy the game if your character is so weak they die every round. Think about any drawbacks of your character choices. For example, your werewolf character might be stronger and scarier than your friend's vampire, but you'll only be able to use it if there's a full moon in the game. Choose your character's accessories. If your character has a weapon, armor, magic bag, or anything else than can affect the game, make sure you tell the other players about it first. You should also devise an attack or hit level the accessories give your character. For example, if your character has a pocketknife and a sword, the sword should be able to cause more damage than the knife. Or if your character carries a healing potion, determine if it can bring people back from the dead or just cure minor wounds. Playing Your RPG Wait for the gamemaster to tell you what to do. The gamemaster sets up the scene and decides who goes first. If you're playing from a guidebook or manual, this will be predetermined, but if it's a game you devised, they can pick anything. Make an opening move that advances the story. If you go first, think about the setting and devise a move that helps move the story forward. If you're in space, you probably aren't going to meet a pack of wolves, but that might be an appropriate move if you're in medieval England! Making your first move an attack is a good way to get the action going and get the other players interested. For example, instead of choosing something like “My sorcerer looks up a spell in his book,” try “My sorcerer casts a spell of blindness on your wizard.” Roll the dice to determine what happens (optional). Some roleplaying games make you roll a dice to determine the importance of your play. If your game doesn't have dice, be prepared to talk about exactly what effect your play has on the game! React to other players' moves. In many games, the gamemaster will determine the effects of each play. In others, players react to each other's plays immediately. If you aren't the first, it's easiest to base your move off of what the last player did. For example, if they said that a dragon appeared in the sky, you can say something like “The dragon breathes fire onto the village” or “My hunter shoots three arrows at the dragon.” Depending on your game, either the gamemaster or the next player will determine the results. Start a new scenario. If you want to move the game in a different direction, you can! Try starting a brand new scenario within your game. For example, if you are currently on a quest to find a treasure, you can have a wizard appear asking your group to save a princess first. Don't start too many subplots--it can make the game too confusing to follow. Pause the game when time is up. Part of the fun of roleplaying is telling a continuous story. You don't need to wind up the entire story when game time comes to an end. Be sure to write down the last few moves so you can pick up where you started next time. If you feel like the storyline isn't going anywhere or you'd like to start something new, that's fine too!",
  "sentences":[
    " Determining Your RPG Decide which game you want to play.",
    "You can play a commercially-sold tabletop RPG like Dungeons and Dragons or Vampire: The Masquerade, or an online version like Star Wars: The Old Republic.",
    "You can also start your own roleplaying game--it's up to you!",
    "Your game should be something you're interested in and that you know other people would like to play.",
    "If you don't want to buy a game, try setting up your own roleplaying game based on fictional characters, history, or even completely imaginary characters and settings.",
    "Find a group of like-minded players.",
    "Roleplaying is a social activity, so once you've decided what you want to focus on, it's time to find two or three other people interested in the same thing.",
    "Ask your friends or search online--there are lots of RPGs that are done completely online.",
    "You can also visit your local gaming or hobby shop for regular roleplaying meetups.",
    "Choose a rulebook or determine your rules.",
    "If you'll be using a commercial RPG, all you need to decide is which rulebook you're going to follow.",
    "If you are making up your own game, it's important to set up some ground rules first so that everybody knows what to do.",
    "If you'll be using a rulebook, you can buy them online or at game shops.",
    "Sometimes a game will have multiple rulebooks, so ask for recommendations or read online reviews to determine which will be best for your roleplay.",
    "If you're making up your own game, think about what kind of limits there should be.",
    "Can players rise from the dead, fly, or disappear?",
    "If you're playing a fanfiction or historical roleplay, can they act completely different from the original character?",
    "Will you allow players to go again or start over with a new character if they've made a mistake?",
    "It might be helpful to write the rules down so everyone knows them.",
    "Decide who your gamemaster will be.",
    "The gamemaster enforces the game rules and describes the effects of each player's turn.",
    "Usually, the gamemaster is whoever knows the rules of the game best.",
    "In some games, the gamemaster is actually responsible for devising the storylines, so check your rules before choosing.",
    "Make sure you have all the supplies.",
    "Some games require nothing but pen and paper, but others might need dice, a game board, or even props and costumes.",
    "Check your rules and make sure you've got everything you need.",
    "Choose a regular time to play.",
    "If you can, try to pick a weekly or monthly meeting time for everybody to get together and play.",
    "It's much easier to have a long-term game if there's a regular time for it!",
    "Be sure to ask each player what their schedule looks like.",
    "You can have the meeting at the same place, or rotate between your houses.",
    "You can also do all of your roleplaying entirely online.",
    "Creating a Character Choose a character from the game list.",
    "If your game comes with pre-set characters, choose your favorite or the one you identify with most.",
    "If you have your heart set on a specific character, let the other players know beforehand.",
    "Many character lists are divided by class--warriors, wizards, healers, and similar categories.",
    "If you don't have a favorite, check out their stats and see if any class in particular appeals to you.",
    "Make up your own character.",
    "If your game has room for an imaginary character, think about what you'd like your character to be.",
    "What kind of character you'll choose will depend on what kind of game you're playing.",
    "Sorcerers are great for medieval fantasy games, while aliens would be better for a Star Trek roleplay.",
    "Pick your character's strengths and weaknesses.",
    "Every roleplaying character has a set of strengths and a set of weaknesses, and they should balance each other out.",
    "Nobody will want to play with you if your character is immortal and can never be hurt or tricked, but you won't enjoy the game if your character is so weak they die every round.",
    "Think about any drawbacks of your character choices.",
    "For example, your werewolf character might be stronger and scarier than your friend's vampire, but you'll only be able to use it if there's a full moon in the game.",
    "Choose your character's accessories.",
    "If your character has a weapon, armor, magic bag, or anything else than can affect the game, make sure you tell the other players about it first.",
    "You should also devise an attack or hit level the accessories give your character.",
    "For example, if your character has a pocketknife and a sword, the sword should be able to cause more damage than the knife.",
    "Or if your character carries a healing potion, determine if it can bring people back from the dead or just cure minor wounds.",
    "Playing Your RPG Wait for the gamemaster to tell you what to do.",
    "The gamemaster sets up the scene and decides who goes first.",
    "If you're playing from a guidebook or manual, this will be predetermined, but if it's a game you devised, they can pick anything.",
    "Make an opening move that advances the story.",
    "If you go first, think about the setting and devise a move that helps move the story forward.",
    "If you're in space, you probably aren't going to meet a pack of wolves, but that might be an appropriate move if you're in medieval England!",
    "Making your first move an attack is a good way to get the action going and get the other players interested.",
    "For example, instead of choosing something like “My sorcerer looks up a spell in his book,” try “My sorcerer casts a spell of blindness on your wizard.” Roll the dice to determine what happens (optional).",
    "Some roleplaying games make you roll a dice to determine the importance of your play.",
    "If your game doesn't have dice, be prepared to talk about exactly what effect your play has on the game!",
    "React to other players' moves.",
    "In many games, the gamemaster will determine the effects of each play.",
    "In others, players react to each other's plays immediately.",
    "If you aren't the first, it's easiest to base your move off of what the last player did.",
    "For example, if they said that a dragon appeared in the sky, you can say something like “The dragon breathes fire onto the village” or “My hunter shoots three arrows at the dragon.” Depending on your game, either the gamemaster or the next player will determine the results.",
    "Start a new scenario.",
    "If you want to move the game in a different direction, you can!",
    "Try starting a brand new scenario within your game.",
    "For example, if you are currently on a quest to find a treasure, you can have a wizard appear asking your group to save a princess first.",
    "Don't start too many subplots--it can make the game too confusing to follow.",
    "Pause the game when time is up.",
    "Part of the fun of roleplaying is telling a continuous story.",
    "You don't need to wind up the entire story when game time comes to an end.",
    "Be sure to write down the last few moves so you can pick up where you started next time.",
    "If you feel like the storyline isn't going anywhere or you'd like to start something new, that's fine too!"
  ],
  "tyn_section":[
    "A place to play",
    "Friends to play with",
    "Dice, if your game requires it",
    "Paper and pencils",
    "Rule books if you're playing an organized game"
  ],
  "tyn_model":[
    "dice",
    "“my",
    "dragon",
    "rpgs",
    "game board",
    "wizards",
    "sorcerers",
    "magic bag",
    "pocketknife",
    "sword",
    "knife",
    "wolves",
    "” try",
    "” roll",
    "roleplaying games",
    "“the",
    "” or",
    "” depending",
    "wizard"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}