{
  "title":"How to Lubricate Door Hinges",
  "url":"https://www.wikihow.com/Lubricate-Door-Hinges",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows"
  ],
  "methods":[
    {
      "name":"Lubricating the Hinge",
      "steps":[
        {
          "headline":"Purchase suitable lubricant.",
          "description":"Lubricant used on door hinges should be capable of penetrating the grime and coating the interior of the hinge to keep it working effectively. It's important to get a can or container that has a thin nozzle to access the hinge area. Ask your local hardware dealer for a good and affordable spray lubricant. Good varieties and brands to use on hinges include:\nSilicone spray lubricants like Blaster or Tri-Flow are usually the most widely-available and easiest lubricants to use for greasing door hinges. Lithium grease is effective and dust-resistant, available in large quantities at most auto parts stores. Primarily used for lubricating car parts, this will do the trick and be useful in other situations as well. Food-grade oils like olive, canola, or coconut oil can also be used in a pinch to lubricate sticky hinges. If the door works relatively well but still squeaks, these are effective ways of fixing a quick squeak. Food oils tend to attract dust and grime, however, making them less desirable than silicone, or other varieties of lubricant."
        },
        {
          "headline":"Find the hinge pin.",
          "description":"Each door hinge consists of the hinge itself and the pin used to hold the two components of the hinge together, the door to the wall. Look for the round hinge pin that sits between the flat plates on the hinge. This hinge pin holds the hinge plates together and will need to be removed to lubricate the hinge effectively."
        },
        {
          "headline":"Remove the hinge pin.",
          "description":"Open the door and pull out the pin some of the way from the hinge. On some hinges, you may be able to use your fingers, but it's likely you'll need to use long pliers to move the pin counterclockwise to remove it. Be careful to avoid scraping your knuckles. Some hinge pins can be rusted or otherwise difficult to remove. If you're struggling to get it loose, you might use a screwdriver or some PB blaster to help to loosen the pin. Read the following section for more specific information on dealing with stuck pins."
        },
        {
          "headline":"Clean, and Apply lubricant.",
          "description":"After removing the hinge pin, clean off the old grease and grime from the pin and the hinge plates using a disposable rag or paper towel. Then, apply a thin coat of lubricant directly onto the hinge pin, as well as into the hinge itself."
        },
        {
          "headline":"Reassemble the hinge.",
          "description":"Push the hinge pin back into place and ensure that it is secured."
        },
        {
          "headline":"Verify.",
          "description":"Open and close the door several times to work the lubricant around the innards of the hinges. If the door continues to squeak when you open and close it, repeat this process for each hinge until the squeak disappears."
        },
        {
          "headline":"Use a rag or paper towel to clean up.",
          "description":"Wipe away any excess grime, oil drips, and dust from the hinge area to leave it clean. The build up of grime is why the hinge becomes squeaky in the first place, making it important that you clean it up while you've got the chance."
        }
      ]
    },
    {
      "name":"Removing Sticky Hinge Pins",
      "steps":[
        {
          "headline":"Soak rusty hinges in PB blaster.",
          "description":"If you're struggling to remove the hinge pin from a sticky door, soak it in some penetrating lubricant spray for up to 12 hours before trying to remove it. WD-40 is another product commonly used for the purpose. Spray a liberal amount of penetrating spray onto the hinge and let it sit. Many people starting forcing the pin out with a hammer, but if it is very rusted, this could damage the wood of the door, break the hinge, and leave you with a bigger repair job on your hands."
        },
        {
          "headline":"Gently tap the end of the pin with a screwdriver.",
          "description":"After letting it soak, use the end of the screwdriver to tap the pin through the hinge, pushing it out gently. This can be a more effective way of getting the pin removed from the hinge to lubricate it. Use something small enough to push the pin out. The tip of a pair of pliers, even an ink pen or another small thin tool might be appropriate for the job. Find something the approximate size of the hinge you're working on."
        },
        {
          "headline":"Repair the pin, if necessary.",
          "description":"Roll the pin on a flat surface to see if it is bent, and examine the pin for signs of wear. If it's very rusty and bent, it's good to spend a little bit of time straightening it out and cleaning it up before re-installing it, so you can avoid a squeaky door in the future. If it's bent, straighten it out by putting it on a cement floor and tapping it with a hammer to bend it back into shape. Use emery cloth to sand down the pin, removing the rust. This will help the pin fit more loosely, creating less resistance and less potential for squeaking."
        }
      ]
    }
  ],
  "text":" Lubricating the Hinge Purchase suitable lubricant. Lubricant used on door hinges should be capable of penetrating the grime and coating the interior of the hinge to keep it working effectively. It's important to get a can or container that has a thin nozzle to access the hinge area. Ask your local hardware dealer for a good and affordable spray lubricant. Good varieties and brands to use on hinges include:\nSilicone spray lubricants like Blaster or Tri-Flow are usually the most widely-available and easiest lubricants to use for greasing door hinges. Lithium grease is effective and dust-resistant, available in large quantities at most auto parts stores. Primarily used for lubricating car parts, this will do the trick and be useful in other situations as well. Food-grade oils like olive, canola, or coconut oil can also be used in a pinch to lubricate sticky hinges. If the door works relatively well but still squeaks, these are effective ways of fixing a quick squeak. Food oils tend to attract dust and grime, however, making them less desirable than silicone, or other varieties of lubricant. Find the hinge pin. Each door hinge consists of the hinge itself and the pin used to hold the two components of the hinge together, the door to the wall. Look for the round hinge pin that sits between the flat plates on the hinge. This hinge pin holds the hinge plates together and will need to be removed to lubricate the hinge effectively. Remove the hinge pin. Open the door and pull out the pin some of the way from the hinge. On some hinges, you may be able to use your fingers, but it's likely you'll need to use long pliers to move the pin counterclockwise to remove it. Be careful to avoid scraping your knuckles. Some hinge pins can be rusted or otherwise difficult to remove. If you're struggling to get it loose, you might use a screwdriver or some PB blaster to help to loosen the pin. Read the following section for more specific information on dealing with stuck pins. Clean, and Apply lubricant. After removing the hinge pin, clean off the old grease and grime from the pin and the hinge plates using a disposable rag or paper towel. Then, apply a thin coat of lubricant directly onto the hinge pin, as well as into the hinge itself. Reassemble the hinge. Push the hinge pin back into place and ensure that it is secured. Verify. Open and close the door several times to work the lubricant around the innards of the hinges. If the door continues to squeak when you open and close it, repeat this process for each hinge until the squeak disappears. Use a rag or paper towel to clean up. Wipe away any excess grime, oil drips, and dust from the hinge area to leave it clean. The build up of grime is why the hinge becomes squeaky in the first place, making it important that you clean it up while you've got the chance. Removing Sticky Hinge Pins Soak rusty hinges in PB blaster. If you're struggling to remove the hinge pin from a sticky door, soak it in some penetrating lubricant spray for up to 12 hours before trying to remove it. WD-40 is another product commonly used for the purpose. Spray a liberal amount of penetrating spray onto the hinge and let it sit. Many people starting forcing the pin out with a hammer, but if it is very rusted, this could damage the wood of the door, break the hinge, and leave you with a bigger repair job on your hands. Gently tap the end of the pin with a screwdriver. After letting it soak, use the end of the screwdriver to tap the pin through the hinge, pushing it out gently. This can be a more effective way of getting the pin removed from the hinge to lubricate it. Use something small enough to push the pin out. The tip of a pair of pliers, even an ink pen or another small thin tool might be appropriate for the job. Find something the approximate size of the hinge you're working on. Repair the pin, if necessary. Roll the pin on a flat surface to see if it is bent, and examine the pin for signs of wear. If it's very rusty and bent, it's good to spend a little bit of time straightening it out and cleaning it up before re-installing it, so you can avoid a squeaky door in the future. If it's bent, straighten it out by putting it on a cement floor and tapping it with a hammer to bend it back into shape. Use emery cloth to sand down the pin, removing the rust. This will help the pin fit more loosely, creating less resistance and less potential for squeaking.",
  "sentences":[
    " Lubricating the Hinge Purchase suitable lubricant.",
    "Lubricant used on door hinges should be capable of penetrating the grime and coating the interior of the hinge to keep it working effectively.",
    "It's important to get a can or container that has a thin nozzle to access the hinge area.",
    "Ask your local hardware dealer for a good and affordable spray lubricant.",
    "Good varieties and brands to use on hinges include:\nSilicone spray lubricants like Blaster or Tri-Flow are usually the most widely-available and easiest lubricants to use for greasing door hinges.",
    "Lithium grease is effective and dust-resistant, available in large quantities at most auto parts stores.",
    "Primarily used for lubricating car parts, this will do the trick and be useful in other situations as well.",
    "Food-grade oils like olive, canola, or coconut oil can also be used in a pinch to lubricate sticky hinges.",
    "If the door works relatively well but still squeaks, these are effective ways of fixing a quick squeak.",
    "Food oils tend to attract dust and grime, however, making them less desirable than silicone, or other varieties of lubricant.",
    "Find the hinge pin.",
    "Each door hinge consists of the hinge itself and the pin used to hold the two components of the hinge together, the door to the wall.",
    "Look for the round hinge pin that sits between the flat plates on the hinge.",
    "This hinge pin holds the hinge plates together and will need to be removed to lubricate the hinge effectively.",
    "Remove the hinge pin.",
    "Open the door and pull out the pin some of the way from the hinge.",
    "On some hinges, you may be able to use your fingers, but it's likely you'll need to use long pliers to move the pin counterclockwise to remove it.",
    "Be careful to avoid scraping your knuckles.",
    "Some hinge pins can be rusted or otherwise difficult to remove.",
    "If you're struggling to get it loose, you might use a screwdriver or some PB blaster to help to loosen the pin.",
    "Read the following section for more specific information on dealing with stuck pins.",
    "Clean, and Apply lubricant.",
    "After removing the hinge pin, clean off the old grease and grime from the pin and the hinge plates using a disposable rag or paper towel.",
    "Then, apply a thin coat of lubricant directly onto the hinge pin, as well as into the hinge itself.",
    "Reassemble the hinge.",
    "Push the hinge pin back into place and ensure that it is secured.",
    "Verify.",
    "Open and close the door several times to work the lubricant around the innards of the hinges.",
    "If the door continues to squeak when you open and close it, repeat this process for each hinge until the squeak disappears.",
    "Use a rag or paper towel to clean up.",
    "Wipe away any excess grime, oil drips, and dust from the hinge area to leave it clean.",
    "The build up of grime is why the hinge becomes squeaky in the first place, making it important that you clean it up while you've got the chance.",
    "Removing Sticky Hinge Pins Soak rusty hinges in PB blaster.",
    "If you're struggling to remove the hinge pin from a sticky door, soak it in some penetrating lubricant spray for up to 12 hours before trying to remove it.",
    "WD-40 is another product commonly used for the purpose.",
    "Spray a liberal amount of penetrating spray onto the hinge and let it sit.",
    "Many people starting forcing the pin out with a hammer, but if it is very rusted, this could damage the wood of the door, break the hinge, and leave you with a bigger repair job on your hands.",
    "Gently tap the end of the pin with a screwdriver.",
    "After letting it soak, use the end of the screwdriver to tap the pin through the hinge, pushing it out gently.",
    "This can be a more effective way of getting the pin removed from the hinge to lubricate it.",
    "Use something small enough to push the pin out.",
    "The tip of a pair of pliers, even an ink pen or another small thin tool might be appropriate for the job.",
    "Find something the approximate size of the hinge you're working on.",
    "Repair the pin, if necessary.",
    "Roll the pin on a flat surface to see if it is bent, and examine the pin for signs of wear.",
    "If it's very rusty and bent, it's good to spend a little bit of time straightening it out and cleaning it up before re-installing it, so you can avoid a squeaky door in the future.",
    "If it's bent, straighten it out by putting it on a cement floor and tapping it with a hammer to bend it back into shape.",
    "Use emery cloth to sand down the pin, removing the rust.",
    "This will help the pin fit more loosely, creating less resistance and less potential for squeaking."
  ],
  "tyn_section":[
    "Lubricating oil with appropriate nozzle",
    "Paper towels or rags",
    "Hammer",
    "Screwdriver"
  ],
  "tyn_model":[
    "lubricant",
    "screwdriver",
    "pliers",
    "hammer",
    "silicone spray lubricants",
    "tri-flow",
    "lubricants",
    "lithium grease",
    "canola",
    "coconut oil",
    "silicone",
    "pin",
    "pb blaster",
    "penetrating lubricant spray",
    "wd-40 is",
    "ink pen",
    "emery cloth"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1176470588,
    "f1":0.1904761905,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1176470588,
    "f1":0.1904761905
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.1176470588,
    "f1":0.1904761905
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1176470588,
    "f1":0.1904761905
  }
}