{
  "title":"How to Make Spring Roll Wrappers",
  "url":"https://www.wikihow.com/Make-Spring-Roll-Wrappers",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Chinese Dishes"
  ],
  "methods":[
    {
      "name":"Method One: Thick Wheat Wrappers[1]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Form a flour well.",
          "description":"Place the wheat-based bread flour in a large bowl, using your hands or a spoon to form a well in the center. While not strictly necessary, it's a good idea to sift the flour into the bowl to remove any lumps and make it less dense. If necessary, you could use all-purpose flour instead of bread flour, but the resulting wrappers might be slightly less durable."
        },
        {
          "headline":"Beat in the egg and water.",
          "description":"Add the beaten egg and cold water to the center of the flour well. Gradually beat these ingredients into the flour until well-combined. The resulting dough should be very smooth. Start by adding only 1 Tbsp (15 ml) of cold water, then gradually add more water as needed to achieve the desired texture. Use cold water only; warm water may make the dough too sticky to work with."
        },
        {
          "headline":"Knead the dough.",
          "description":"Turn the dough out onto a well-floured surface. Knead it for several minutes, or until it becomes notably more elastic. If there's enough room in the bowl, you could knead the dough in the bowl during this step. You should handle the dough with well-floured hands either way."
        },
        {
          "headline":"Chill overnight.",
          "description":"Return the dough to the bowl. Cover the bowl with plastic wrap, then place the dough into your refrigerator. Let it remain there overnight. While it chills, the dough should become firmer and easier to handle. You need to give it at least 4 hours, but 8 to 12 hours will be best."
        },
        {
          "headline":"Roll out the dough.",
          "description":"Turn the chilled dough out onto a well-floured surface. Roll the batch into a rectangle measuring roughly 12 inches (30.5 cm) wide and 16 inches (40.6 cm) long. You also need to apply generous amounts of flour to the rolling pin used for this step. Avoid sprinkling too much flour directly over the dough since adding too much excess flour may result in denser, less crispy wrappers. If the dough seems too sticky as you work with it, try refrigerating it for a longer period of time."
        },
        {
          "headline":"Cut the dough into squares.",
          "description":"Use a smooth knife to cut the dough into 12 squares, each measuring 4 inches (10 cm) on all sides. You'll need to make four columns across the top and three rows along the side to produce 12 evenly sized squares."
        },
        {
          "headline":"Flatten each square.",
          "description":"Using a floured rolling pin, flatten each square until it measures roughly 6 inches (15 cm) on all sides."
        },
        {
          "headline":"Use as needed.",
          "description":"Stack the wrappers, layering plastic wrap or parchment paper in between each one. Tightly wrap the entire stack with additional plastic wrap and refrigerate the wrappers until you're ready to use them. These wrappers will dry out if stored for prolonged periods, so you should try to use them within several days."
        }
      ]
    },
    {
      "name":"Method Two: Thin Wheat Wrappers[2]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Combine the dry ingredients.",
          "description":"Sift the flour, corn starch, and salt into a medium mixing bowl. Stir well to combine. If desired, you could sift the combined dry ingredients a second time to remove any lumps that formed during the mixing process. The second sift is not strictly necessary, though."
        },
        {
          "headline":"Add the water.",
          "description":"Pour the water into the dry ingredients. Whisk it into the mixture until a smooth batter forms. Continue whisking and beating the batter for a few minutes to work out any lumps. The batter should be as smooth as possible before you continue."
        },
        {
          "headline":"Heat the oil.",
          "description":"Pour the oil into a medium frying pan. Place the pan on the stove over medium heat. If you don't want to use vegetable oil, you could grease the pan with nonstick cooking spray, instead. Turn the pan to spread the oil across the bottom. When the oil is hot enough, it should spread without difficulty."
        },
        {
          "headline":"Ladle the batter into the pan.",
          "description":"Scoop up 1/4 cup (60 ml) or less of the batter, then carefully pour it into the center of the pan. Working quickly, rotate the pan to spread the batter into a thin, wide circle. Alternatively, you could spread the batter with the back of the ladle or with a moist pastry brush."
        },
        {
          "headline":"Cook until the wrapper sets.",
          "description":"Cook the wrapper for several minutes. As soon as the edges begin peeling up, remove the wrapper from the pan using a spatula or fork. Neither side should brown, but both sides should be set. If the top does not appear set when the edges begin rising, carefully flip the wrapper over to the other side and cook it for an additional few seconds before removing it completely."
        },
        {
          "headline":"Repeat with the remaining batter.",
          "description":"Pour and cook the remaining batter, following the same procedure. Continue until you no longer have any batter left. Stack the finished wrappers on top of one another, placing wax paper or parchment paper in between layers to prevent them from sticking together. Cover the entire stack with a damp paper towel to prevent the wrappers from drying out."
        },
        {
          "headline":"Use as needed.",
          "description":"These wrappers are best when used immediately, but if necessary, you can store them in airtight containers in your refrigerator for several days. Keep the layers separated during refrigeration. Note that you may need to dampen the wrappers with a little water before use if they dry out during refrigeration."
        }
      ]
    },
    {
      "name":"Method Three: Rice Wrappers[4]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Combine the dry ingredients.",
          "description":"Sift together the rice flour, starch, and salt into a large mixing bowl. Gently toss the ingredients together using a wooden spoon. After combining the ingredients, consider sifting them again to remove any lumps that may have formed during the mixing process."
        },
        {
          "headline":"Combine the wet ingredients.",
          "description":"Place the eggs, vegetable oil, and water into a separate medium mixing bowl. Whisk until evenly combined. While not strictly necessary, it's a good idea to lightly beat the eggs (enough to combine the whites and yolks) before adding the oil and water. Doing so makes it easier to evenly distribute the whites and yolks."
        },
        {
          "headline":"Mix both sets together.",
          "description":"Form a well with the dry mixture, then pour the liquid mixture into that well. Gradually combine the two mixtures with a wooden spoon until evenly mixed. After mixing the two sets, continue beating them with a whisk until nearly all of the lumps are gone. The batter must be as smooth as possible."
        },
        {
          "headline":"Chill for one hour.",
          "description":"Cover the bowl with plastic wrap and place it in your refrigerator for approximately one hour. Chilling the batter will thicken it slightly, but it should still be a liquid batter instead of a solid dough."
        },
        {
          "headline":"Heat a medium frying pan.",
          "description":"Spray a medium nonstick frying pan with nonstick cooking spray. Set the pan onto the stove over medium heat. If necessary, you could add a little oil to the pan instead of using cooking spray. Only add 1 tsp (5 ml) or so, however; adding too much oil can give the wrappers an undesirable greasy texture and taste. Allow the pan to heat up for 30 to 60 seconds before continuing."
        },
        {
          "headline":"Pour the batter into the hot pan.",
          "description":"Scoop up approximately 1/4 cup (60 ml) of the chilled batter, then carefully ladle it into the center of the pan. Since the batter is thick, it may not spread out far on its own. Use the back of the ladle to swirl the batter around, forming a very thin film over the bottom of the pan."
        },
        {
          "headline":"Cook until set.",
          "description":"Cook the film for a couple of minutes. As soon as it sets and forms a solid wrapper, carefully lift it off from the bottom of the pan using a spatula or fork. You should not attempt to flip the wrapper over while cooking it. Note that neither side of the wrapper should brown, either."
        },
        {
          "headline":"Repeat with the remaining batter.",
          "description":"Ladle the rest of the batter into the hot pan, working with 1/4 cup (60 ml) or so each time. Consider keeping the batter in the refrigerator in between batches, especially if it starts getting thin while pouring it. You can stack the finished wrappers, but keep sheets of wax paper or parchment paper in between each one to prevent them from sticking."
        },
        {
          "headline":"Use as needed.",
          "description":"These wrappers are best when used immediately, but you can also save them in the refrigerator for one or two days. Keep each wrapper separated by plastic wrap or wax paper. Cover the entire batch with plastic wrap before storing the wrappers."
        }
      ]
    }
  ],
  "text":" Method One: Thick Wheat Wrappers[1]\n\tX\n\t\tResearch source Form a flour well. Place the wheat-based bread flour in a large bowl, using your hands or a spoon to form a well in the center. While not strictly necessary, it's a good idea to sift the flour into the bowl to remove any lumps and make it less dense. If necessary, you could use all-purpose flour instead of bread flour, but the resulting wrappers might be slightly less durable. Beat in the egg and water. Add the beaten egg and cold water to the center of the flour well. Gradually beat these ingredients into the flour until well-combined. The resulting dough should be very smooth. Start by adding only 1 Tbsp (15 ml) of cold water, then gradually add more water as needed to achieve the desired texture. Use cold water only; warm water may make the dough too sticky to work with. Knead the dough. Turn the dough out onto a well-floured surface. Knead it for several minutes, or until it becomes notably more elastic. If there's enough room in the bowl, you could knead the dough in the bowl during this step. You should handle the dough with well-floured hands either way. Chill overnight. Return the dough to the bowl. Cover the bowl with plastic wrap, then place the dough into your refrigerator. Let it remain there overnight. While it chills, the dough should become firmer and easier to handle. You need to give it at least 4 hours, but 8 to 12 hours will be best. Roll out the dough. Turn the chilled dough out onto a well-floured surface. Roll the batch into a rectangle measuring roughly 12 inches (30.5 cm) wide and 16 inches (40.6 cm) long. You also need to apply generous amounts of flour to the rolling pin used for this step. Avoid sprinkling too much flour directly over the dough since adding too much excess flour may result in denser, less crispy wrappers. If the dough seems too sticky as you work with it, try refrigerating it for a longer period of time. Cut the dough into squares. Use a smooth knife to cut the dough into 12 squares, each measuring 4 inches (10 cm) on all sides. You'll need to make four columns across the top and three rows along the side to produce 12 evenly sized squares. Flatten each square. Using a floured rolling pin, flatten each square until it measures roughly 6 inches (15 cm) on all sides. Use as needed. Stack the wrappers, layering plastic wrap or parchment paper in between each one. Tightly wrap the entire stack with additional plastic wrap and refrigerate the wrappers until you're ready to use them. These wrappers will dry out if stored for prolonged periods, so you should try to use them within several days. Method Two: Thin Wheat Wrappers[2]\n\tX\n\t\tResearch source Combine the dry ingredients. Sift the flour, corn starch, and salt into a medium mixing bowl. Stir well to combine. If desired, you could sift the combined dry ingredients a second time to remove any lumps that formed during the mixing process. The second sift is not strictly necessary, though. Add the water. Pour the water into the dry ingredients. Whisk it into the mixture until a smooth batter forms. Continue whisking and beating the batter for a few minutes to work out any lumps. The batter should be as smooth as possible before you continue. Heat the oil. Pour the oil into a medium frying pan. Place the pan on the stove over medium heat. If you don't want to use vegetable oil, you could grease the pan with nonstick cooking spray, instead. Turn the pan to spread the oil across the bottom. When the oil is hot enough, it should spread without difficulty. Ladle the batter into the pan. Scoop up 1/4 cup (60 ml) or less of the batter, then carefully pour it into the center of the pan. Working quickly, rotate the pan to spread the batter into a thin, wide circle. Alternatively, you could spread the batter with the back of the ladle or with a moist pastry brush. Cook until the wrapper sets. Cook the wrapper for several minutes. As soon as the edges begin peeling up, remove the wrapper from the pan using a spatula or fork. Neither side should brown, but both sides should be set. If the top does not appear set when the edges begin rising, carefully flip the wrapper over to the other side and cook it for an additional few seconds before removing it completely. Repeat with the remaining batter. Pour and cook the remaining batter, following the same procedure. Continue until you no longer have any batter left. Stack the finished wrappers on top of one another, placing wax paper or parchment paper in between layers to prevent them from sticking together. Cover the entire stack with a damp paper towel to prevent the wrappers from drying out. Use as needed. These wrappers are best when used immediately, but if necessary, you can store them in airtight containers in your refrigerator for several days. Keep the layers separated during refrigeration. Note that you may need to dampen the wrappers with a little water before use if they dry out during refrigeration. Method Three: Rice Wrappers[4]\n\tX\n\t\tResearch source Combine the dry ingredients. Sift together the rice flour, starch, and salt into a large mixing bowl. Gently toss the ingredients together using a wooden spoon. After combining the ingredients, consider sifting them again to remove any lumps that may have formed during the mixing process. Combine the wet ingredients. Place the eggs, vegetable oil, and water into a separate medium mixing bowl. Whisk until evenly combined. While not strictly necessary, it's a good idea to lightly beat the eggs (enough to combine the whites and yolks) before adding the oil and water. Doing so makes it easier to evenly distribute the whites and yolks. Mix both sets together. Form a well with the dry mixture, then pour the liquid mixture into that well. Gradually combine the two mixtures with a wooden spoon until evenly mixed. After mixing the two sets, continue beating them with a whisk until nearly all of the lumps are gone. The batter must be as smooth as possible. Chill for one hour. Cover the bowl with plastic wrap and place it in your refrigerator for approximately one hour. Chilling the batter will thicken it slightly, but it should still be a liquid batter instead of a solid dough. Heat a medium frying pan. Spray a medium nonstick frying pan with nonstick cooking spray. Set the pan onto the stove over medium heat. If necessary, you could add a little oil to the pan instead of using cooking spray. Only add 1 tsp (5 ml) or so, however; adding too much oil can give the wrappers an undesirable greasy texture and taste. Allow the pan to heat up for 30 to 60 seconds before continuing. Pour the batter into the hot pan. Scoop up approximately 1/4 cup (60 ml) of the chilled batter, then carefully ladle it into the center of the pan. Since the batter is thick, it may not spread out far on its own. Use the back of the ladle to swirl the batter around, forming a very thin film over the bottom of the pan. Cook until set. Cook the film for a couple of minutes. As soon as it sets and forms a solid wrapper, carefully lift it off from the bottom of the pan using a spatula or fork. You should not attempt to flip the wrapper over while cooking it. Note that neither side of the wrapper should brown, either. Repeat with the remaining batter. Ladle the rest of the batter into the hot pan, working with 1/4 cup (60 ml) or so each time. Consider keeping the batter in the refrigerator in between batches, especially if it starts getting thin while pouring it. You can stack the finished wrappers, but keep sheets of wax paper or parchment paper in between each one to prevent them from sticking. Use as needed. These wrappers are best when used immediately, but you can also save them in the refrigerator for one or two days. Keep each wrapper separated by plastic wrap or wax paper. Cover the entire batch with plastic wrap before storing the wrappers.",
  "sentences":[
    " Method One: Thick Wheat Wrappers[1]\n\tX\n\t\tResearch source Form a flour well.",
    "Place the wheat-based bread flour in a large bowl, using your hands or a spoon to form a well in the center.",
    "While not strictly necessary, it's a good idea to sift the flour into the bowl to remove any lumps and make it less dense.",
    "If necessary, you could use all-purpose flour instead of bread flour, but the resulting wrappers might be slightly less durable.",
    "Beat in the egg and water.",
    "Add the beaten egg and cold water to the center of the flour well.",
    "Gradually beat these ingredients into the flour until well-combined.",
    "The resulting dough should be very smooth.",
    "Start by adding only 1 Tbsp (15 ml) of cold water, then gradually add more water as needed to achieve the desired texture.",
    "Use cold water only; warm water may make the dough too sticky to work with.",
    "Knead the dough.",
    "Turn the dough out onto a well-floured surface.",
    "Knead it for several minutes, or until it becomes notably more elastic.",
    "If there's enough room in the bowl, you could knead the dough in the bowl during this step.",
    "You should handle the dough with well-floured hands either way.",
    "Chill overnight.",
    "Return the dough to the bowl.",
    "Cover the bowl with plastic wrap, then place the dough into your refrigerator.",
    "Let it remain there overnight.",
    "While it chills, the dough should become firmer and easier to handle.",
    "You need to give it at least 4 hours, but 8 to 12 hours will be best.",
    "Roll out the dough.",
    "Turn the chilled dough out onto a well-floured surface.",
    "Roll the batch into a rectangle measuring roughly 12 inches (30.5 cm) wide and 16 inches (40.6 cm) long.",
    "You also need to apply generous amounts of flour to the rolling pin used for this step.",
    "Avoid sprinkling too much flour directly over the dough since adding too much excess flour may result in denser, less crispy wrappers.",
    "If the dough seems too sticky as you work with it, try refrigerating it for a longer period of time.",
    "Cut the dough into squares.",
    "Use a smooth knife to cut the dough into 12 squares, each measuring 4 inches (10 cm) on all sides.",
    "You'll need to make four columns across the top and three rows along the side to produce 12 evenly sized squares.",
    "Flatten each square.",
    "Using a floured rolling pin, flatten each square until it measures roughly 6 inches (15 cm) on all sides.",
    "Use as needed.",
    "Stack the wrappers, layering plastic wrap or parchment paper in between each one.",
    "Tightly wrap the entire stack with additional plastic wrap and refrigerate the wrappers until you're ready to use them.",
    "These wrappers will dry out if stored for prolonged periods, so you should try to use them within several days.",
    "Method Two: Thin Wheat Wrappers[2]\n\tX\n\t\tResearch source Combine the dry ingredients.",
    "Sift the flour, corn starch, and salt into a medium mixing bowl.",
    "Stir well to combine.",
    "If desired, you could sift the combined dry ingredients a second time to remove any lumps that formed during the mixing process.",
    "The second sift is not strictly necessary, though.",
    "Add the water.",
    "Pour the water into the dry ingredients.",
    "Whisk it into the mixture until a smooth batter forms.",
    "Continue whisking and beating the batter for a few minutes to work out any lumps.",
    "The batter should be as smooth as possible before you continue.",
    "Heat the oil.",
    "Pour the oil into a medium frying pan.",
    "Place the pan on the stove over medium heat.",
    "If you don't want to use vegetable oil, you could grease the pan with nonstick cooking spray, instead.",
    "Turn the pan to spread the oil across the bottom.",
    "When the oil is hot enough, it should spread without difficulty.",
    "Ladle the batter into the pan.",
    "Scoop up 1/4 cup (60 ml) or less of the batter, then carefully pour it into the center of the pan.",
    "Working quickly, rotate the pan to spread the batter into a thin, wide circle.",
    "Alternatively, you could spread the batter with the back of the ladle or with a moist pastry brush.",
    "Cook until the wrapper sets.",
    "Cook the wrapper for several minutes.",
    "As soon as the edges begin peeling up, remove the wrapper from the pan using a spatula or fork.",
    "Neither side should brown, but both sides should be set.",
    "If the top does not appear set when the edges begin rising, carefully flip the wrapper over to the other side and cook it for an additional few seconds before removing it completely.",
    "Repeat with the remaining batter.",
    "Pour and cook the remaining batter, following the same procedure.",
    "Continue until you no longer have any batter left.",
    "Stack the finished wrappers on top of one another, placing wax paper or parchment paper in between layers to prevent them from sticking together.",
    "Cover the entire stack with a damp paper towel to prevent the wrappers from drying out.",
    "Use as needed.",
    "These wrappers are best when used immediately, but if necessary, you can store them in airtight containers in your refrigerator for several days.",
    "Keep the layers separated during refrigeration.",
    "Note that you may need to dampen the wrappers with a little water before use if they dry out during refrigeration.",
    "Method Three: Rice Wrappers[4]\n\tX\n\t\tResearch source Combine the dry ingredients.",
    "Sift together the rice flour, starch, and salt into a large mixing bowl.",
    "Gently toss the ingredients together using a wooden spoon.",
    "After combining the ingredients, consider sifting them again to remove any lumps that may have formed during the mixing process.",
    "Combine the wet ingredients.",
    "Place the eggs, vegetable oil, and water into a separate medium mixing bowl.",
    "Whisk until evenly combined.",
    "While not strictly necessary, it's a good idea to lightly beat the eggs (enough to combine the whites and yolks) before adding the oil and water.",
    "Doing so makes it easier to evenly distribute the whites and yolks.",
    "Mix both sets together.",
    "Form a well with the dry mixture, then pour the liquid mixture into that well.",
    "Gradually combine the two mixtures with a wooden spoon until evenly mixed.",
    "After mixing the two sets, continue beating them with a whisk until nearly all of the lumps are gone.",
    "The batter must be as smooth as possible.",
    "Chill for one hour.",
    "Cover the bowl with plastic wrap and place it in your refrigerator for approximately one hour.",
    "Chilling the batter will thicken it slightly, but it should still be a liquid batter instead of a solid dough.",
    "Heat a medium frying pan.",
    "Spray a medium nonstick frying pan with nonstick cooking spray.",
    "Set the pan onto the stove over medium heat.",
    "If necessary, you could add a little oil to the pan instead of using cooking spray.",
    "Only add 1 tsp (5 ml) or so, however; adding too much oil can give the wrappers an undesirable greasy texture and taste.",
    "Allow the pan to heat up for 30 to 60 seconds before continuing.",
    "Pour the batter into the hot pan.",
    "Scoop up approximately 1/4 cup (60 ml) of the chilled batter, then carefully ladle it into the center of the pan.",
    "Since the batter is thick, it may not spread out far on its own.",
    "Use the back of the ladle to swirl the batter around, forming a very thin film over the bottom of the pan.",
    "Cook until set.",
    "Cook the film for a couple of minutes.",
    "As soon as it sets and forms a solid wrapper, carefully lift it off from the bottom of the pan using a spatula or fork.",
    "You should not attempt to flip the wrapper over while cooking it.",
    "Note that neither side of the wrapper should brown, either.",
    "Repeat with the remaining batter.",
    "Ladle the rest of the batter into the hot pan, working with 1/4 cup (60 ml) or so each time.",
    "Consider keeping the batter in the refrigerator in between batches, especially if it starts getting thin while pouring it.",
    "You can stack the finished wrappers, but keep sheets of wax paper or parchment paper in between each one to prevent them from sticking.",
    "Use as needed.",
    "These wrappers are best when used immediately, but you can also save them in the refrigerator for one or two days.",
    "Keep each wrapper separated by plastic wrap or wax paper.",
    "Cover the entire batch with plastic wrap before storing the wrappers."
  ],
  "tyn_section":[
    "Thick Wheat Wrappers",
    "Large mixing bowl",
    "Whisk",
    "Wooden spoon",
    "Plastic wrap",
    "Rolling pin",
    "Smooth knife",
    "Thin Wheat Wrappers",
    "Medium mixing bowl",
    "Sieve",
    "Ladle",
    "Medium frying pan",
    "Spatula or fork",
    "Wax paper or parchment paper",
    "Damp paper towels",
    "Airtight container",
    "Rice Wrappers",
    "Parchment paper or wax paper"
  ],
  "tyn_model":[
    "water",
    "flour",
    "oil",
    "bowl",
    "plastic wrap",
    "pan",
    "cold water",
    "refrigerator",
    "parchment paper",
    "wax paper",
    "salt",
    "medium mixing bowl",
    "medium frying pan",
    "stove",
    "vegetable oil",
    "nonstick cooking spray",
    "ladle",
    "spatula",
    "fork",
    "wooden spoon",
    "eggs",
    "whisk",
    "flour well",
    "wheat-based bread flour",
    "spoon",
    "all-purpose flour",
    "bread flour",
    "egg",
    "rolling pin",
    "smooth knife",
    "thin wheat wrappers[2",
    "corn starch",
    "moist pastry brush",
    "airtight containers",
    "rice wrappers[4",
    "rice flour",
    "starch",
    "large mixing bowl",
    "nonstick frying pan",
    "cooking spray"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.225,
    "f1":0.3103448276,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.35,
    "f1":0.4590163934
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.525,
    "f1":0.6441717791
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.225,
    "f1":0.3103448276
  }
}