{
  "title":"How to Make Cheesy Scrambled Eggs",
  "url":"https://www.wikihow.com/Make-Cheesy-Scrambled-Eggs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Scrambled Eggs"
  ],
  "methods":[
    {
      "name":"Making Stove-Top Eggs",
      "steps":[
        {
          "headline":"Heat some butter in a pan over a stove.",
          "description":"Place a pan on the stove, then turn the heat on to medium low. Once the pan is hot, add the butter. Let the butter melt slowly."
        },
        {
          "headline":"Break the eggs into a bowl and beat them with a whisk.",
          "description":"This will be enough for one person. Do not add any cheese, salt, or any other seasonings into the bowl yet."
        },
        {
          "headline":"Coat the surface of the pan with the melted butter.",
          "description":"Take the pan by the handle, and tilt it around until the melted butter covers the entire surface. Try to get some of the butter up the inside sides of the pan as well."
        },
        {
          "headline":"Pour the beaten eggs onto the pan and let them sit for 10 seconds.",
          "description":"If needed, tilt the pan around again so that the eggs cover the entire surface."
        },
        {
          "headline":"Stir the eggs with a spatula once they start to turn firm at the bottom.",
          "description":"Try to use a silicone spatula instead of a metal or wood one. Eggs are less likely to stick to silicone than to wood. A silicone spatula also won't scratch your pan up like a metal one would."
        },
        {
          "headline":"Remove the pan from the stove when the eggs are mostly set.",
          "description":"The eggs will continue to cook, even after you remove them from heat. If you wait too long, your eggs will turn out over-cooked and dry."
        },
        {
          "headline":"Add the cheese and stir the eggs a few more times.",
          "description":"Grated cheese melts quickly and easily. The heat from the still-cooking eggs will be just enough for this. Keep stirring the eggs until the cheese has melted."
        },
        {
          "headline":"Transfer the eggs to a plate.",
          "description":"At this point, you can season them with some salt and/or pepper. You can also garnish them with some chopped chives."
        }
      ]
    },
    {
      "name":"Making Oven-Baked Eggs",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F (175°C).",
          "description":"This method is great when you have to serve a large group."
        },
        {
          "headline":"Place the butter into 9 by 13 by 2 inches (22.86 by 33.02 by 5.08 centimeters) baking dish, and stick the dish into the oven.",
          "description":"The butter will melt while the oven is preheating and help grease the dish. Try to use a dish made out of glass or ceramic."
        },
        {
          "headline":"Break the eggs into a large bowl and discard the shells.",
          "description":"This will be enough for six servings, with two eggs per serving."
        },
        {
          "headline":"Add the milk, salt, and/or pepper to the eggs, and stir using a whisk.",
          "description":"Keep stirring until the yolks break and everything is evenly mixed. Don't worry about the cheese just yet."
        },
        {
          "headline":"Pour the eggs into the baking dish.",
          "description":"Take the baking dish out of the oven first. If necessary, use a spatula to help spread the butter across the bottom. Then, carefully pour the egg mixture into the dish."
        },
        {
          "headline":"Place the dish into the oven and bake the eggs for 10 minutes.",
          "description":"You are not baking them all the way because you will be \"scrambling\" them from time to time."
        },
        {
          "headline":"Give the eggs a quick stir and bake for another 10 to 15 minutes.",
          "description":"Do not take the pan out of the oven. Instead, pull out the oven rack enough so that you can reach the pan without burning yourself. Use a spatula to \"pull\" the eggs across the bottom and sides of the pan. This will create that curdy texture that stove-fried scrambled eggs have."
        },
        {
          "headline":"Add the grated cheese when there are just a few minutes left of baking.",
          "description":"Give the eggs a final stir to mix in the cheese. The shredded cheese will melt quickly in the still cooking eggs."
        },
        {
          "headline":"Serve the eggs.",
          "description":"Take the eggs out of the oven just before they finish cooking. Because they are a protein, they will continue on their own. You can serve the eggs directly out of the baking dish, or you can transfer them to a platter."
        }
      ]
    },
    {
      "name":"Making Microwave-Cooked Eggs",
      "steps":[
        {
          "headline":"Find a 10 ounce (295 milliliters), microwave-safe cup.",
          "description":"This will be enough for one person."
        },
        {
          "headline":"Add the eggs and milk and mix them together with a fork.",
          "description":"Keep mixing until the yolks break and everything is combined."
        },
        {
          "headline":"Season the eggs, and still them one last time.",
          "description":"Add in some salt and cayenne pepper. For extra flavor, chop up a scallion, and add it in. Don't worry about adding the cheese in. You will do that last."
        },
        {
          "headline":"Place the cup into the microwave and cook it on high for 45 seconds.",
          "description":"There is no need to cover the eggs. You are not cooking the eggs all the way just yet because you will be \"scrambling\" them with a fork."
        },
        {
          "headline":"Give the egg mixture a quick stir and microwave them for another 45 seconds.",
          "description":"Be careful when handling the cup; it will be very hot."
        },
        {
          "headline":"Remove the cup from the microwave and stir in the cheddar cheese.",
          "description":"Use a clean fork this time, so that you don't raw egg into the cooked eggs."
        },
        {
          "headline":"Cover the eggs with a paper towel and wait one minute.",
          "description":"The paper towel will trap heat and moisture. It will also keep the eggs from drying out or turning cold. The eggs will continue cooking during this sitting time."
        },
        {
          "headline":"Consider garnishing the eggs with a small tomato before serving it.",
          "description":"You can eat the eggs directly from the cup, or your can put them on a plate. To garnish the eggs, get a cherry or grape tomato, and cut it into fourths. Place the tomato on top of the eggs."
        }
      ]
    },
    {
      "name":"Making Variations",
      "steps":[
        {
          "headline":"Pair feta cheese with spinach.",
          "description":"Melt ½ tablespoon of butter over medium-low heat in a nonstick skillet. Add a some spinach and sauté for about 2 minutes. Add 2 beaten eggs, and cook until almost done. Finish off with 1 tablespoon of crumbled feta cheese. Give the eggs a final stir and serve. This is enough for 1 serving. Season the eggs with salt and pepper."
        },
        {
          "headline":"Try adding some herbs about 1 minute before the eggs are finished cooking.",
          "description":"You will need 2 tablespoons of chopped herbs per serving of scrambled eggs. Herbs that go well with scrambled eggs include: parsley and chives. Consider pairing these with grated Parmesan or Gruyere. You can season the eggs further with salt and pepper, just before serving."
        },
        {
          "headline":"Pair mushrooms with grated Parmesan cheese.",
          "description":"Heat some butter in a saucepan over low heat, then add 3 sliced mushrooms and 1 tablespoon of chopped up onion. Stir, then add 1 tablespoon of grated Parmesan cheese. Sauté for 15 minutes before adding the eggs and cooking them until they are done. This is enough for one serving."
        },
        {
          "headline":"Try bacon with a shredded four-cheese Mexican blend.",
          "description":"For each serving of scrambled eggs, you will need 1 piece of fried bacon and 1 to 2 tablespoons of the Mexican cheese blend. Crumble the bacon, and add it along with the cheese, just before the scrambled eggs finish cooking."
        },
        {
          "headline":"Add some ham for a classical breakfast blend.",
          "description":"For each serving of scrambled egg, you will need 1 slice of cooked ham and ¼ to 1/3 cup (25 to 35 grams) of shredded cheese. Chop the ham up into small cubes, and add it to the eggs, along with the cheese, just as the eggs finish cooking. For the cheese, try Cheddar cheese or a Mexican blend. For a heartier blend, try adding some chopped up onion and green bell pepper. Sauté the onion and pepper for 2 to 4 minutes before adding the eggs to the pan."
        }
      ]
    }
  ],
  "text":" Making Stove-Top Eggs Heat some butter in a pan over a stove. Place a pan on the stove, then turn the heat on to medium low. Once the pan is hot, add the butter. Let the butter melt slowly. Break the eggs into a bowl and beat them with a whisk. This will be enough for one person. Do not add any cheese, salt, or any other seasonings into the bowl yet. Coat the surface of the pan with the melted butter. Take the pan by the handle, and tilt it around until the melted butter covers the entire surface. Try to get some of the butter up the inside sides of the pan as well. Pour the beaten eggs onto the pan and let them sit for 10 seconds. If needed, tilt the pan around again so that the eggs cover the entire surface. Stir the eggs with a spatula once they start to turn firm at the bottom. Try to use a silicone spatula instead of a metal or wood one. Eggs are less likely to stick to silicone than to wood. A silicone spatula also won't scratch your pan up like a metal one would. Remove the pan from the stove when the eggs are mostly set. The eggs will continue to cook, even after you remove them from heat. If you wait too long, your eggs will turn out over-cooked and dry. Add the cheese and stir the eggs a few more times. Grated cheese melts quickly and easily. The heat from the still-cooking eggs will be just enough for this. Keep stirring the eggs until the cheese has melted. Transfer the eggs to a plate. At this point, you can season them with some salt and/or pepper. You can also garnish them with some chopped chives. Making Oven-Baked Eggs Preheat your oven to 350°F (175°C). This method is great when you have to serve a large group. Place the butter into 9 by 13 by 2 inches (22.86 by 33.02 by 5.08 centimeters) baking dish, and stick the dish into the oven. The butter will melt while the oven is preheating and help grease the dish. Try to use a dish made out of glass or ceramic. Break the eggs into a large bowl and discard the shells. This will be enough for six servings, with two eggs per serving. Add the milk, salt, and/or pepper to the eggs, and stir using a whisk. Keep stirring until the yolks break and everything is evenly mixed. Don't worry about the cheese just yet. Pour the eggs into the baking dish. Take the baking dish out of the oven first. If necessary, use a spatula to help spread the butter across the bottom. Then, carefully pour the egg mixture into the dish. Place the dish into the oven and bake the eggs for 10 minutes. You are not baking them all the way because you will be \"scrambling\" them from time to time. Give the eggs a quick stir and bake for another 10 to 15 minutes. Do not take the pan out of the oven. Instead, pull out the oven rack enough so that you can reach the pan without burning yourself. Use a spatula to \"pull\" the eggs across the bottom and sides of the pan. This will create that curdy texture that stove-fried scrambled eggs have. Add the grated cheese when there are just a few minutes left of baking. Give the eggs a final stir to mix in the cheese. The shredded cheese will melt quickly in the still cooking eggs. Serve the eggs. Take the eggs out of the oven just before they finish cooking. Because they are a protein, they will continue on their own. You can serve the eggs directly out of the baking dish, or you can transfer them to a platter. Making Microwave-Cooked Eggs Find a 10 ounce (295 milliliters), microwave-safe cup. This will be enough for one person. Add the eggs and milk and mix them together with a fork. Keep mixing until the yolks break and everything is combined. Season the eggs, and still them one last time. Add in some salt and cayenne pepper. For extra flavor, chop up a scallion, and add it in. Don't worry about adding the cheese in. You will do that last. Place the cup into the microwave and cook it on high for 45 seconds. There is no need to cover the eggs. You are not cooking the eggs all the way just yet because you will be \"scrambling\" them with a fork. Give the egg mixture a quick stir and microwave them for another 45 seconds. Be careful when handling the cup; it will be very hot. Remove the cup from the microwave and stir in the cheddar cheese. Use a clean fork this time, so that you don't raw egg into the cooked eggs. Cover the eggs with a paper towel and wait one minute. The paper towel will trap heat and moisture. It will also keep the eggs from drying out or turning cold. The eggs will continue cooking during this sitting time. Consider garnishing the eggs with a small tomato before serving it. You can eat the eggs directly from the cup, or your can put them on a plate. To garnish the eggs, get a cherry or grape tomato, and cut it into fourths. Place the tomato on top of the eggs. Making Variations Pair feta cheese with spinach. Melt ½ tablespoon of butter over medium-low heat in a nonstick skillet. Add a some spinach and sauté for about 2 minutes. Add 2 beaten eggs, and cook until almost done. Finish off with 1 tablespoon of crumbled feta cheese. Give the eggs a final stir and serve. This is enough for 1 serving. Season the eggs with salt and pepper. Try adding some herbs about 1 minute before the eggs are finished cooking. You will need 2 tablespoons of chopped herbs per serving of scrambled eggs. Herbs that go well with scrambled eggs include: parsley and chives. Consider pairing these with grated Parmesan or Gruyere. You can season the eggs further with salt and pepper, just before serving. Pair mushrooms with grated Parmesan cheese. Heat some butter in a saucepan over low heat, then add 3 sliced mushrooms and 1 tablespoon of chopped up onion. Stir, then add 1 tablespoon of grated Parmesan cheese. Sauté for 15 minutes before adding the eggs and cooking them until they are done. This is enough for one serving. Try bacon with a shredded four-cheese Mexican blend. For each serving of scrambled eggs, you will need 1 piece of fried bacon and 1 to 2 tablespoons of the Mexican cheese blend. Crumble the bacon, and add it along with the cheese, just before the scrambled eggs finish cooking. Add some ham for a classical breakfast blend. For each serving of scrambled egg, you will need 1 slice of cooked ham and ¼ to 1/3 cup (25 to 35 grams) of shredded cheese. Chop the ham up into small cubes, and add it to the eggs, along with the cheese, just as the eggs finish cooking. For the cheese, try Cheddar cheese or a Mexican blend. For a heartier blend, try adding some chopped up onion and green bell pepper. Sauté the onion and pepper for 2 to 4 minutes before adding the eggs to the pan.",
  "sentences":[
    " Making Stove-Top Eggs Heat some butter in a pan over a stove.",
    "Place a pan on the stove, then turn the heat on to medium low.",
    "Once the pan is hot, add the butter.",
    "Let the butter melt slowly.",
    "Break the eggs into a bowl and beat them with a whisk.",
    "This will be enough for one person.",
    "Do not add any cheese, salt, or any other seasonings into the bowl yet.",
    "Coat the surface of the pan with the melted butter.",
    "Take the pan by the handle, and tilt it around until the melted butter covers the entire surface.",
    "Try to get some of the butter up the inside sides of the pan as well.",
    "Pour the beaten eggs onto the pan and let them sit for 10 seconds.",
    "If needed, tilt the pan around again so that the eggs cover the entire surface.",
    "Stir the eggs with a spatula once they start to turn firm at the bottom.",
    "Try to use a silicone spatula instead of a metal or wood one.",
    "Eggs are less likely to stick to silicone than to wood.",
    "A silicone spatula also won't scratch your pan up like a metal one would.",
    "Remove the pan from the stove when the eggs are mostly set.",
    "The eggs will continue to cook, even after you remove them from heat.",
    "If you wait too long, your eggs will turn out over-cooked and dry.",
    "Add the cheese and stir the eggs a few more times.",
    "Grated cheese melts quickly and easily.",
    "The heat from the still-cooking eggs will be just enough for this.",
    "Keep stirring the eggs until the cheese has melted.",
    "Transfer the eggs to a plate.",
    "At this point, you can season them with some salt and/or pepper.",
    "You can also garnish them with some chopped chives.",
    "Making Oven-Baked Eggs Preheat your oven to 350°F (175°C).",
    "This method is great when you have to serve a large group.",
    "Place the butter into 9 by 13 by 2 inches (22.86 by 33.02 by 5.08 centimeters) baking dish, and stick the dish into the oven.",
    "The butter will melt while the oven is preheating and help grease the dish.",
    "Try to use a dish made out of glass or ceramic.",
    "Break the eggs into a large bowl and discard the shells.",
    "This will be enough for six servings, with two eggs per serving.",
    "Add the milk, salt, and/or pepper to the eggs, and stir using a whisk.",
    "Keep stirring until the yolks break and everything is evenly mixed.",
    "Don't worry about the cheese just yet.",
    "Pour the eggs into the baking dish.",
    "Take the baking dish out of the oven first.",
    "If necessary, use a spatula to help spread the butter across the bottom.",
    "Then, carefully pour the egg mixture into the dish.",
    "Place the dish into the oven and bake the eggs for 10 minutes.",
    "You are not baking them all the way because you will be \"scrambling\" them from time to time.",
    "Give the eggs a quick stir and bake for another 10 to 15 minutes.",
    "Do not take the pan out of the oven.",
    "Instead, pull out the oven rack enough so that you can reach the pan without burning yourself.",
    "Use a spatula to \"pull\" the eggs across the bottom and sides of the pan.",
    "This will create that curdy texture that stove-fried scrambled eggs have.",
    "Add the grated cheese when there are just a few minutes left of baking.",
    "Give the eggs a final stir to mix in the cheese.",
    "The shredded cheese will melt quickly in the still cooking eggs.",
    "Serve the eggs.",
    "Take the eggs out of the oven just before they finish cooking.",
    "Because they are a protein, they will continue on their own.",
    "You can serve the eggs directly out of the baking dish, or you can transfer them to a platter.",
    "Making Microwave-Cooked Eggs Find a 10 ounce (295 milliliters), microwave-safe cup.",
    "This will be enough for one person.",
    "Add the eggs and milk and mix them together with a fork.",
    "Keep mixing until the yolks break and everything is combined.",
    "Season the eggs, and still them one last time.",
    "Add in some salt and cayenne pepper.",
    "For extra flavor, chop up a scallion, and add it in.",
    "Don't worry about adding the cheese in.",
    "You will do that last.",
    "Place the cup into the microwave and cook it on high for 45 seconds.",
    "There is no need to cover the eggs.",
    "You are not cooking the eggs all the way just yet because you will be \"scrambling\" them with a fork.",
    "Give the egg mixture a quick stir and microwave them for another 45 seconds.",
    "Be careful when handling the cup; it will be very hot.",
    "Remove the cup from the microwave and stir in the cheddar cheese.",
    "Use a clean fork this time, so that you don't raw egg into the cooked eggs.",
    "Cover the eggs with a paper towel and wait one minute.",
    "The paper towel will trap heat and moisture.",
    "It will also keep the eggs from drying out or turning cold.",
    "The eggs will continue cooking during this sitting time.",
    "Consider garnishing the eggs with a small tomato before serving it.",
    "You can eat the eggs directly from the cup, or your can put them on a plate.",
    "To garnish the eggs, get a cherry or grape tomato, and cut it into fourths.",
    "Place the tomato on top of the eggs.",
    "Making Variations Pair feta cheese with spinach.",
    "Melt ½ tablespoon of butter over medium-low heat in a nonstick skillet.",
    "Add a some spinach and sauté for about 2 minutes.",
    "Add 2 beaten eggs, and cook until almost done.",
    "Finish off with 1 tablespoon of crumbled feta cheese.",
    "Give the eggs a final stir and serve.",
    "This is enough for 1 serving.",
    "Season the eggs with salt and pepper.",
    "Try adding some herbs about 1 minute before the eggs are finished cooking.",
    "You will need 2 tablespoons of chopped herbs per serving of scrambled eggs.",
    "Herbs that go well with scrambled eggs include: parsley and chives.",
    "Consider pairing these with grated Parmesan or Gruyere.",
    "You can season the eggs further with salt and pepper, just before serving.",
    "Pair mushrooms with grated Parmesan cheese.",
    "Heat some butter in a saucepan over low heat, then add 3 sliced mushrooms and 1 tablespoon of chopped up onion.",
    "Stir, then add 1 tablespoon of grated Parmesan cheese.",
    "Sauté for 15 minutes before adding the eggs and cooking them until they are done.",
    "This is enough for one serving.",
    "Try bacon with a shredded four-cheese Mexican blend.",
    "For each serving of scrambled eggs, you will need 1 piece of fried bacon and 1 to 2 tablespoons of the Mexican cheese blend.",
    "Crumble the bacon, and add it along with the cheese, just before the scrambled eggs finish cooking.",
    "Add some ham for a classical breakfast blend.",
    "For each serving of scrambled egg, you will need 1 slice of cooked ham and ¼ to 1/3 cup (25 to 35 grams) of shredded cheese.",
    "Chop the ham up into small cubes, and add it to the eggs, along with the cheese, just as the eggs finish cooking.",
    "For the cheese, try Cheddar cheese or a Mexican blend.",
    "For a heartier blend, try adding some chopped up onion and green bell pepper.",
    "Sauté the onion and pepper for 2 to 4 minutes before adding the eggs to the pan."
  ],
  "tyn_section":[
    "Stove-Top Eggs",
    "Stove",
    "Mixing bowl",
    "Whisk",
    "Non-stick frying pan",
    "Spatula (silicone recommended)",
    "Oven-Baked Eggs",
    "[20]",
    "X",
    "Research source",
    "Oven",
    "9 by 13 inch (22.86 by 33.02 by 5.08 centimeters) baking dish",
    "Fork, spoon, or spatula",
    "Microwave-Cooked Eggs",
    "[21]",
    "Microwave",
    "10 ounce (295 milliliters), microwave-safe cup",
    "Fork",
    "Paper towel"
  ],
  "tyn_model":[
    "eggs",
    "butter",
    "oven",
    "spatula",
    "baking dish",
    "scrambled eggs",
    "pan",
    "stove",
    "salt",
    "fork",
    "microwave",
    "onion",
    "bacon",
    "ham",
    "bowl",
    "whisk",
    "plate",
    "milk",
    "cheddar cheese",
    "tomato",
    "feta cheese",
    "spinach",
    "salt and pepper",
    "herbs",
    "mushrooms",
    "parmesan cheese",
    "stove-top",
    "cheese",
    "oven-baked eggs",
    "large bowl",
    "pepper",
    "oven rack",
    "cayenne pepper",
    "scallion",
    "paper towel",
    "nonstick skillet",
    "parsley",
    "chives",
    "gruyere",
    "saucepan",
    "four-cheese mexican blend",
    "mexican cheese",
    "scrambled egg",
    "shredded cheese",
    "green bell pepper"
  ],
  "simple_metrics":{
    "r":0.3684210526,
    "p":0.1555555556,
    "f1":0.21875,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5263157895,
    "p":0.2444444444,
    "f1":0.3338391502
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6315789474,
    "p":0.3333333333,
    "f1":0.4363636364
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3684210526,
    "p":0.1555555556,
    "f1":0.21875
  }
}