{
  "title":"How to Detect a Gas Leak",
  "url":"https://www.wikihow.com/Detect-a-Gas-Leak",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Using Gas Detectors",
      "steps":[
        {
          "headline":"Place carbon monoxide detectors in your home.",
          "description":"Carbon monoxide (CO) is a colorless and odorless gas that’s toxic to the body. Plug in your carbon monoxide detectors in an outlet at knee-level or lower since CO is heavier than air. Place at least 1 detector on each level of your home. Never block a carbon monoxide detector with furniture or curtains since they could restrict air flow. If you have pets or children that would interfere with the detectors at knee-level, plug the devices in chest-level outlets.Tip: Sometimes, you can get a combination smoke and carbon monoxide detector. Look at your local hardware store for the device."
        },
        {
          "headline":"Use a handheld natural gas detector to find the source of the leak.",
          "description":"Portable gas detectors can sense the gas concentration in certain areas of your home. Walk through your home with the gas detector, keeping an eye on the display meter. Whenever they sense a concentration too high, an alarm will go off to let you know the area is not safe. Gas detectors can be purchased from your local hardware store."
        },
        {
          "headline":"Set a radon detection test in the lowest level of your home.",
          "description":"Radon is a natural gas that’s odorless, colorless, and tasteless naturally found in the ground. Place a short-term test kit in the lowest level of your home where people spend time and leave it there for 90 days. Use the envelope provided in the kit to send the test to a lab where they can calculate the radon levels. If it comes back with 4 pCi/L (picocuries per liter) or higher, you need to call a professional to install a radon mitigation system in your home. Avoid keeping radon tests in areas that get damp and humid, such as the kitchen, bathroom, or laundry room.Tip: Use long-term radon tests if you want to know the change in radon levels over a period of time longer than 3 months."
        }
      ]
    },
    {
      "name":"Checking for Signs of Natural Gas in Your Home",
      "steps":[
        {
          "headline":"See if your home has a rotten egg or sulfuric smell.",
          "description":"Natural gases from your appliances have the added chemical mercaptan, making the gas have an unpleasant odor so you can detect it easier. If you notice the smell in your home, it’s possible that you have a gas leak near your stove, water heater, or another appliance. Check the burners on a gas stove to make sure they’re completely turned off. Immediately turn off the gas supply line and leave the building if there is a strong odor."
        },
        {
          "headline":"Listen for a hissing or whistling noise near your appliances or pipes.",
          "description":"You may be able to hear the gas leaking from loose connections. If you hear a faint hiss or whistle that you haven’t heard before, walk around your home and listen for the change in volume. When it gets louder, you’re closer to the possible leak. The gas makes a hiss or whistle when it escapes through a tight space, so not all gas leaks will make a noise."
        },
        {
          "headline":"Check if the flames on your gas stove are orange or yellow instead of blue.",
          "description":"Gas stoves should have blue flames, meaning that they have enough oxygen for the gas to completely combust. When there are yellow or orange flames, the natural gas isn’t completely burning and could be contributing to a gas leak. Gas stoves may have orange or yellow flames when they’re first lit. Only be concerned if the flame is consistently orange or yellow."
        },
        {
          "headline":"Watch for a white cloud or dust moving near your gas lines.",
          "description":"While natural gas is usually colorless, a leak may stir up dust and make a small cloud near your pipes. Keep your eyes open for any mist or clouds that you can’t account for otherwise."
        },
        {
          "headline":"Look to see if your any houseplants are dying.",
          "description":"Plants need carbon dioxide in order to survive, and gas leaks can limit the amount your plants get. If you notice your plants wilting or yellowing even though you still care for them regularly, you may have gas leaking into your home. Keep plants in areas in your home where gas leaks are common, like in your kitchen or close to a fireplace."
        },
        {
          "headline":"Check your gas bill to see if it’s higher than normal.",
          "description":"Compare your gas bills over a 2-3 month period to see if there’s been a significant change in cost. If you notice a spike in your bill, contact your utility company first to make sure your bill is correct. If everything is right on their end, let them know you may have a gas leak in your home. Keep in mind any changes in your lifestyle. For example, if it’s winter and you’ve been using your furnace more, your gas prices may be higher because of it. Compare bills from the same time of year to see a more accurate change."
        },
        {
          "headline":"Note any physical symptoms you have while you’re at home.",
          "description":"Breathing natural gas or carbon monoxide limits the amount of oxygen your body receives. If you start experiencing body pains, headaches, lightheadedness, or nausea for no apparent reason, check your gas lines and your appliances to see if there are any problems. Other symptoms may include, but are not limited to, reduced appetite, difficulty breathing, fatigue, and eye and throat irritation."
        }
      ]
    },
    {
      "name":"Locating a Natural Gas Leak on Your Pipes",
      "steps":[
        {
          "headline":"Mix 1  c (240 ml) of water with 1  tsp (4.9 ml) of dish soap.",
          "description":"Fill the cup with water and squeeze in a small amount of dish soap. Stir the soap and water together until it starts to form suds. You can use any liquid dish soap to test for a gas leak. If you don’t have dish soap, you can substitute a liquid laundry detergent instead."
        },
        {
          "headline":"Brush the soapy water onto your pipe connection.",
          "description":"Dip a small paintbrush into the soapy water so the bristles are completely coated. Paint a thin layer of the water around the pipe connections where you think there may be a leak. Brush the water around the whole connection point so it’s saturated. Common Places for Gas Leaks\nCheck the fittings between 2 pipes since the insulation ring may be damaged or old. Look near the valve shut-offs to see if they're slightly opened or loose. Find where your gas lines connect to your appliances to see if the connections are loose or damaged."
        },
        {
          "headline":"Look for bubbles where you put the water.",
          "description":"Any gas leaking from your pipe connections will make bubbles in the soapy water. If bubbles don’t form at the connection, then the gas leak is in a different place on your pipes. Continue brushing the water and watching for bubbles until you find the source of your leak."
        },
        {
          "headline":"Mark the spot on the pipe so a professional can come fix it.",
          "description":"Use a pencil or a marker to draw on the pipe where you found the gas leak. Once it’s marked, contact your utility company and let them know that you have a leak in your home so they can fix it. Don’t attempt to fix gas lines yourself if you’re inexperienced."
        }
      ]
    },
    {
      "name":"Taking Safety Precautions if You Suspect a Leak",
      "steps":[
        {
          "headline":"Turn off your gas line and pilot lights.",
          "description":"Locate the gas main valve near your main gas meter, usually found on the side of your building or in a cabinet inside. Turn the valve so it’s perpendicular to the gas pipes to turn it off. Stopping your gas main should also stop your pilot lights."
        },
        {
          "headline":"Open the windows to vent your home.",
          "description":"Keep all of your windows and doors open if possible so the gas inside your home can escape. That way, there is a less dangerous concentration in your home and it’s not as likely to spark or explode. Even when your windows are open, you shouldn’t stay in your home until the gas leak is fixed."
        },
        {
          "headline":"Don’t use any appliances or electronics inside.",
          "description":"Anything electric creates a spark that could ignite a high concentration of natural gas. Avoid turning on any switches, electronics, or gas appliances while you suspect a leak. Avoid using lighters or anything with an open flame. Don’t search for a gas leak with a flashlight or any other light source."
        },
        {
          "headline":"Leave your home and call the fire department.",
          "description":"Evacuate your home as soon as you can once you’ve determined there’s a gas leak. Go across the street and away from your home in case of an explosion. Once you’re a safe distance away, contact the fire department and let them know there is a gas leak. Don’t use a landline or mobile phone while you’re still inside your house.Tip: Have a set meeting point for your family in case of emergencies. For example, you may specify a house or landmark across the street where you all can meet."
        }
      ]
    }
  ],
  "text":" Using Gas Detectors Place carbon monoxide detectors in your home. Carbon monoxide (CO) is a colorless and odorless gas that’s toxic to the body. Plug in your carbon monoxide detectors in an outlet at knee-level or lower since CO is heavier than air. Place at least 1 detector on each level of your home. Never block a carbon monoxide detector with furniture or curtains since they could restrict air flow. If you have pets or children that would interfere with the detectors at knee-level, plug the devices in chest-level outlets.Tip: Sometimes, you can get a combination smoke and carbon monoxide detector. Look at your local hardware store for the device. Use a handheld natural gas detector to find the source of the leak. Portable gas detectors can sense the gas concentration in certain areas of your home. Walk through your home with the gas detector, keeping an eye on the display meter. Whenever they sense a concentration too high, an alarm will go off to let you know the area is not safe. Gas detectors can be purchased from your local hardware store. Set a radon detection test in the lowest level of your home. Radon is a natural gas that’s odorless, colorless, and tasteless naturally found in the ground. Place a short-term test kit in the lowest level of your home where people spend time and leave it there for 90 days. Use the envelope provided in the kit to send the test to a lab where they can calculate the radon levels. If it comes back with 4 pCi/L (picocuries per liter) or higher, you need to call a professional to install a radon mitigation system in your home. Avoid keeping radon tests in areas that get damp and humid, such as the kitchen, bathroom, or laundry room.Tip: Use long-term radon tests if you want to know the change in radon levels over a period of time longer than 3 months. Checking for Signs of Natural Gas in Your Home See if your home has a rotten egg or sulfuric smell. Natural gases from your appliances have the added chemical mercaptan, making the gas have an unpleasant odor so you can detect it easier. If you notice the smell in your home, it’s possible that you have a gas leak near your stove, water heater, or another appliance. Check the burners on a gas stove to make sure they’re completely turned off. Immediately turn off the gas supply line and leave the building if there is a strong odor. Listen for a hissing or whistling noise near your appliances or pipes. You may be able to hear the gas leaking from loose connections. If you hear a faint hiss or whistle that you haven’t heard before, walk around your home and listen for the change in volume. When it gets louder, you’re closer to the possible leak. The gas makes a hiss or whistle when it escapes through a tight space, so not all gas leaks will make a noise. Check if the flames on your gas stove are orange or yellow instead of blue. Gas stoves should have blue flames, meaning that they have enough oxygen for the gas to completely combust. When there are yellow or orange flames, the natural gas isn’t completely burning and could be contributing to a gas leak. Gas stoves may have orange or yellow flames when they’re first lit. Only be concerned if the flame is consistently orange or yellow. Watch for a white cloud or dust moving near your gas lines. While natural gas is usually colorless, a leak may stir up dust and make a small cloud near your pipes. Keep your eyes open for any mist or clouds that you can’t account for otherwise. Look to see if your any houseplants are dying. Plants need carbon dioxide in order to survive, and gas leaks can limit the amount your plants get. If you notice your plants wilting or yellowing even though you still care for them regularly, you may have gas leaking into your home. Keep plants in areas in your home where gas leaks are common, like in your kitchen or close to a fireplace. Check your gas bill to see if it’s higher than normal. Compare your gas bills over a 2-3 month period to see if there’s been a significant change in cost. If you notice a spike in your bill, contact your utility company first to make sure your bill is correct. If everything is right on their end, let them know you may have a gas leak in your home. Keep in mind any changes in your lifestyle. For example, if it’s winter and you’ve been using your furnace more, your gas prices may be higher because of it. Compare bills from the same time of year to see a more accurate change. Note any physical symptoms you have while you’re at home. Breathing natural gas or carbon monoxide limits the amount of oxygen your body receives. If you start experiencing body pains, headaches, lightheadedness, or nausea for no apparent reason, check your gas lines and your appliances to see if there are any problems. Other symptoms may include, but are not limited to, reduced appetite, difficulty breathing, fatigue, and eye and throat irritation. Locating a Natural Gas Leak on Your Pipes Mix 1  c (240 ml) of water with 1  tsp (4.9 ml) of dish soap. Fill the cup with water and squeeze in a small amount of dish soap. Stir the soap and water together until it starts to form suds. You can use any liquid dish soap to test for a gas leak. If you don’t have dish soap, you can substitute a liquid laundry detergent instead. Brush the soapy water onto your pipe connection. Dip a small paintbrush into the soapy water so the bristles are completely coated. Paint a thin layer of the water around the pipe connections where you think there may be a leak. Brush the water around the whole connection point so it’s saturated. Common Places for Gas Leaks\nCheck the fittings between 2 pipes since the insulation ring may be damaged or old. Look near the valve shut-offs to see if they're slightly opened or loose. Find where your gas lines connect to your appliances to see if the connections are loose or damaged. Look for bubbles where you put the water. Any gas leaking from your pipe connections will make bubbles in the soapy water. If bubbles don’t form at the connection, then the gas leak is in a different place on your pipes. Continue brushing the water and watching for bubbles until you find the source of your leak. Mark the spot on the pipe so a professional can come fix it. Use a pencil or a marker to draw on the pipe where you found the gas leak. Once it’s marked, contact your utility company and let them know that you have a leak in your home so they can fix it. Don’t attempt to fix gas lines yourself if you’re inexperienced. Taking Safety Precautions if You Suspect a Leak Turn off your gas line and pilot lights. Locate the gas main valve near your main gas meter, usually found on the side of your building or in a cabinet inside. Turn the valve so it’s perpendicular to the gas pipes to turn it off. Stopping your gas main should also stop your pilot lights. Open the windows to vent your home. Keep all of your windows and doors open if possible so the gas inside your home can escape. That way, there is a less dangerous concentration in your home and it’s not as likely to spark or explode. Even when your windows are open, you shouldn’t stay in your home until the gas leak is fixed. Don’t use any appliances or electronics inside. Anything electric creates a spark that could ignite a high concentration of natural gas. Avoid turning on any switches, electronics, or gas appliances while you suspect a leak. Avoid using lighters or anything with an open flame. Don’t search for a gas leak with a flashlight or any other light source. Leave your home and call the fire department. Evacuate your home as soon as you can once you’ve determined there’s a gas leak. Go across the street and away from your home in case of an explosion. Once you’re a safe distance away, contact the fire department and let them know there is a gas leak. Don’t use a landline or mobile phone while you’re still inside your house.Tip: Have a set meeting point for your family in case of emergencies. For example, you may specify a house or landmark across the street where you all can meet.",
  "sentences":[
    " Using Gas Detectors Place carbon monoxide detectors in your home.",
    "Carbon monoxide (CO) is a colorless and odorless gas that’s toxic to the body.",
    "Plug in your carbon monoxide detectors in an outlet at knee-level or lower since CO is heavier than air.",
    "Place at least 1 detector on each level of your home.",
    "Never block a carbon monoxide detector with furniture or curtains since they could restrict air flow.",
    "If you have pets or children that would interfere with the detectors at knee-level, plug the devices in chest-level outlets.Tip: Sometimes, you can get a combination smoke and carbon monoxide detector.",
    "Look at your local hardware store for the device.",
    "Use a handheld natural gas detector to find the source of the leak.",
    "Portable gas detectors can sense the gas concentration in certain areas of your home.",
    "Walk through your home with the gas detector, keeping an eye on the display meter.",
    "Whenever they sense a concentration too high, an alarm will go off to let you know the area is not safe.",
    "Gas detectors can be purchased from your local hardware store.",
    "Set a radon detection test in the lowest level of your home.",
    "Radon is a natural gas that’s odorless, colorless, and tasteless naturally found in the ground.",
    "Place a short-term test kit in the lowest level of your home where people spend time and leave it there for 90 days.",
    "Use the envelope provided in the kit to send the test to a lab where they can calculate the radon levels.",
    "If it comes back with 4 pCi/L (picocuries per liter) or higher, you need to call a professional to install a radon mitigation system in your home.",
    "Avoid keeping radon tests in areas that get damp and humid, such as the kitchen, bathroom, or laundry room.Tip: Use long-term radon tests if you want to know the change in radon levels over a period of time longer than 3 months.",
    "Checking for Signs of Natural Gas in Your Home See if your home has a rotten egg or sulfuric smell.",
    "Natural gases from your appliances have the added chemical mercaptan, making the gas have an unpleasant odor so you can detect it easier.",
    "If you notice the smell in your home, it’s possible that you have a gas leak near your stove, water heater, or another appliance.",
    "Check the burners on a gas stove to make sure they’re completely turned off.",
    "Immediately turn off the gas supply line and leave the building if there is a strong odor.",
    "Listen for a hissing or whistling noise near your appliances or pipes.",
    "You may be able to hear the gas leaking from loose connections.",
    "If you hear a faint hiss or whistle that you haven’t heard before, walk around your home and listen for the change in volume.",
    "When it gets louder, you’re closer to the possible leak.",
    "The gas makes a hiss or whistle when it escapes through a tight space, so not all gas leaks will make a noise.",
    "Check if the flames on your gas stove are orange or yellow instead of blue.",
    "Gas stoves should have blue flames, meaning that they have enough oxygen for the gas to completely combust.",
    "When there are yellow or orange flames, the natural gas isn’t completely burning and could be contributing to a gas leak.",
    "Gas stoves may have orange or yellow flames when they’re first lit.",
    "Only be concerned if the flame is consistently orange or yellow.",
    "Watch for a white cloud or dust moving near your gas lines.",
    "While natural gas is usually colorless, a leak may stir up dust and make a small cloud near your pipes.",
    "Keep your eyes open for any mist or clouds that you can’t account for otherwise.",
    "Look to see if your any houseplants are dying.",
    "Plants need carbon dioxide in order to survive, and gas leaks can limit the amount your plants get.",
    "If you notice your plants wilting or yellowing even though you still care for them regularly, you may have gas leaking into your home.",
    "Keep plants in areas in your home where gas leaks are common, like in your kitchen or close to a fireplace.",
    "Check your gas bill to see if it’s higher than normal.",
    "Compare your gas bills over a 2-3 month period to see if there’s been a significant change in cost.",
    "If you notice a spike in your bill, contact your utility company first to make sure your bill is correct.",
    "If everything is right on their end, let them know you may have a gas leak in your home.",
    "Keep in mind any changes in your lifestyle.",
    "For example, if it’s winter and you’ve been using your furnace more, your gas prices may be higher because of it.",
    "Compare bills from the same time of year to see a more accurate change.",
    "Note any physical symptoms you have while you’re at home.",
    "Breathing natural gas or carbon monoxide limits the amount of oxygen your body receives.",
    "If you start experiencing body pains, headaches, lightheadedness, or nausea for no apparent reason, check your gas lines and your appliances to see if there are any problems.",
    "Other symptoms may include, but are not limited to, reduced appetite, difficulty breathing, fatigue, and eye and throat irritation.",
    "Locating a Natural Gas Leak on Your Pipes Mix 1  c (240 ml) of water with 1  tsp (4.9 ml) of dish soap.",
    "Fill the cup with water and squeeze in a small amount of dish soap.",
    "Stir the soap and water together until it starts to form suds.",
    "You can use any liquid dish soap to test for a gas leak.",
    "If you don’t have dish soap, you can substitute a liquid laundry detergent instead.",
    "Brush the soapy water onto your pipe connection.",
    "Dip a small paintbrush into the soapy water so the bristles are completely coated.",
    "Paint a thin layer of the water around the pipe connections where you think there may be a leak.",
    "Brush the water around the whole connection point so it’s saturated.",
    "Common Places for Gas Leaks\nCheck the fittings between 2 pipes since the insulation ring may be damaged or old.",
    "Look near the valve shut-offs to see if they're slightly opened or loose.",
    "Find where your gas lines connect to your appliances to see if the connections are loose or damaged.",
    "Look for bubbles where you put the water.",
    "Any gas leaking from your pipe connections will make bubbles in the soapy water.",
    "If bubbles don’t form at the connection, then the gas leak is in a different place on your pipes.",
    "Continue brushing the water and watching for bubbles until you find the source of your leak.",
    "Mark the spot on the pipe so a professional can come fix it.",
    "Use a pencil or a marker to draw on the pipe where you found the gas leak.",
    "Once it’s marked, contact your utility company and let them know that you have a leak in your home so they can fix it.",
    "Don’t attempt to fix gas lines yourself if you’re inexperienced.",
    "Taking Safety Precautions if You Suspect a Leak Turn off your gas line and pilot lights.",
    "Locate the gas main valve near your main gas meter, usually found on the side of your building or in a cabinet inside.",
    "Turn the valve so it’s perpendicular to the gas pipes to turn it off.",
    "Stopping your gas main should also stop your pilot lights.",
    "Open the windows to vent your home.",
    "Keep all of your windows and doors open if possible so the gas inside your home can escape.",
    "That way, there is a less dangerous concentration in your home and it’s not as likely to spark or explode.",
    "Even when your windows are open, you shouldn’t stay in your home until the gas leak is fixed.",
    "Don’t use any appliances or electronics inside.",
    "Anything electric creates a spark that could ignite a high concentration of natural gas.",
    "Avoid turning on any switches, electronics, or gas appliances while you suspect a leak.",
    "Avoid using lighters or anything with an open flame.",
    "Don’t search for a gas leak with a flashlight or any other light source.",
    "Leave your home and call the fire department.",
    "Evacuate your home as soon as you can once you’ve determined there’s a gas leak.",
    "Go across the street and away from your home in case of an explosion.",
    "Once you’re a safe distance away, contact the fire department and let them know there is a gas leak.",
    "Don’t use a landline or mobile phone while you’re still inside your house.Tip: Have a set meeting point for your family in case of emergencies.",
    "For example, you may specify a house or landmark across the street where you all can meet."
  ],
  "tyn_section":[
    "Carbon monoxide detector",
    "Handheld detector",
    "Radon test kit",
    "Postage",
    "Locating a Leak on Your Gas Pipes",
    "Mixing cup",
    "Water",
    "Liquid dish soap",
    "Paintbrush"
  ],
  "tyn_model":[
    "gas",
    "water",
    "natural gas",
    "radon",
    "dish soap",
    "carbon monoxide detectors",
    "carbon monoxide detector",
    "gas stove",
    "gas stoves",
    "plants",
    "utility company",
    "carbon monoxide (",
    "natural gas detector",
    "portable gas detectors",
    "gas detector",
    "gas detectors",
    "radon detection",
    "radon tests",
    "carbon dioxide",
    "furnace",
    "carbon monoxide",
    "soap",
    "laundry detergent",
    "soapy water",
    "pencil",
    "marker",
    "gas main valve",
    "gas main",
    "lighters"
  ],
  "simple_metrics":{
    "r":0.2222222222,
    "p":0.0689655172,
    "f1":0.1052631579,
    "avg_pos":0.2068965517
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.2413793103,
    "f1":0.28
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5555555556,
    "p":0.3448275862,
    "f1":0.4255319149
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.1379310345,
    "f1":0.1951219512
  }
}