{
  "title":"How to Make Avocado Juice",
  "url":"https://www.wikihow.com/Make-Avocado-Juice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Juice"
  ],
  "steps":[
    {
      "headline":"Cut the avocado and scoop out the pulp.",
      "description":"To cut your avocado easily:\nTake your knife and cut the avocado in half vertically. Twist the two sides apart, exposing the pit inside. With a spoon or a knife, remove the pit. Grab a spoon and scoop out the all of the inside. Don't know if your avocado is ripe? Read wikiHow's How to Tell if an Avocado is Ripe to find out!"
    },
    {
      "headline":"Put the pulp of the avocado (and any other fruits or vegetables) in a blender.",
      "description":"If you're using sugar or honey, add it now, too. Give it a quick whirl to get the juices flowing and the flavors combined. For the first recipe (the creamier, richer version), hold off on the milk for right now and just add the sugar. That part comes next. For the second recipe (for the health foodie in you), add all the vegetables and fruits you'd like. Add a couple, give it a taste, maybe add a couple more. Experiment!"
    },
    {
      "headline":"Add the milk, if applicable, bit by bit.",
      "description":"You want complete control over the thickness of your drink; should it be more smoothie-like or more like juice? The natural thickness of the avocado opens up the entire spectrum of consistency. Add a small amount, blend it up, and decide whether or not you'd like to add more. Give it a taste test, too! It probably goes without saying that the thicker and richer your milk, the thicker and richer the final taste will be. Whole milk and avocado will be more smoothie-like while almond milk and avocado will be thinner -- and have a completely different taste."
    },
    {
      "headline":"Finish blending, garnish and serve chilled.",
      "description":"Once you've found the right consistency, blend it until everything is combined thoroughly, creating a uniform look throughout. Garnish with whatever your heart desires -- maybe a slice of pineapple or a dollop of whipped cream?"
    }
  ],
  "text":" Cut the avocado and scoop out the pulp. To cut your avocado easily:\nTake your knife and cut the avocado in half vertically. Twist the two sides apart, exposing the pit inside. With a spoon or a knife, remove the pit. Grab a spoon and scoop out the all of the inside. Don't know if your avocado is ripe? Read wikiHow's How to Tell if an Avocado is Ripe to find out! Put the pulp of the avocado (and any other fruits or vegetables) in a blender. If you're using sugar or honey, add it now, too. Give it a quick whirl to get the juices flowing and the flavors combined. For the first recipe (the creamier, richer version), hold off on the milk for right now and just add the sugar. That part comes next. For the second recipe (for the health foodie in you), add all the vegetables and fruits you'd like. Add a couple, give it a taste, maybe add a couple more. Experiment! Add the milk, if applicable, bit by bit. You want complete control over the thickness of your drink; should it be more smoothie-like or more like juice? The natural thickness of the avocado opens up the entire spectrum of consistency. Add a small amount, blend it up, and decide whether or not you'd like to add more. Give it a taste test, too! It probably goes without saying that the thicker and richer your milk, the thicker and richer the final taste will be. Whole milk and avocado will be more smoothie-like while almond milk and avocado will be thinner -- and have a completely different taste. Finish blending, garnish and serve chilled. Once you've found the right consistency, blend it until everything is combined thoroughly, creating a uniform look throughout. Garnish with whatever your heart desires -- maybe a slice of pineapple or a dollop of whipped cream?",
  "sentences":[
    " Cut the avocado and scoop out the pulp.",
    "To cut your avocado easily:\nTake your knife and cut the avocado in half vertically.",
    "Twist the two sides apart, exposing the pit inside.",
    "With a spoon or a knife, remove the pit.",
    "Grab a spoon and scoop out the all of the inside.",
    "Don't know if your avocado is ripe?",
    "Read wikiHow's How to Tell if an Avocado is Ripe to find out!",
    "Put the pulp of the avocado (and any other fruits or vegetables) in a blender.",
    "If you're using sugar or honey, add it now, too.",
    "Give it a quick whirl to get the juices flowing and the flavors combined.",
    "For the first recipe (the creamier, richer version), hold off on the milk for right now and just add the sugar.",
    "That part comes next.",
    "For the second recipe (for the health foodie in you), add all the vegetables and fruits you'd like.",
    "Add a couple, give it a taste, maybe add a couple more.",
    "Experiment!",
    "Add the milk, if applicable, bit by bit.",
    "You want complete control over the thickness of your drink; should it be more smoothie-like or more like juice?",
    "The natural thickness of the avocado opens up the entire spectrum of consistency.",
    "Add a small amount, blend it up, and decide whether or not you'd like to add more.",
    "Give it a taste test, too!",
    "It probably goes without saying that the thicker and richer your milk, the thicker and richer the final taste will be.",
    "Whole milk and avocado will be more smoothie-like while almond milk and avocado will be thinner -- and have a completely different taste.",
    "Finish blending, garnish and serve chilled.",
    "Once you've found the right consistency, blend it until everything is combined thoroughly, creating a uniform look throughout.",
    "Garnish with whatever your heart desires -- maybe a slice of pineapple or a dollop of whipped cream?"
  ],
  "tyn_section":[
    "Blender",
    "Drinking glass",
    "Knife",
    "Spoon"
  ],
  "tyn_model":[
    "avocado",
    "milk",
    "knife",
    "spoon",
    "sugar",
    "blender",
    "honey",
    "fruits",
    "whole milk",
    "almond milk",
    "pineapple",
    "whipped cream"
  ],
  "simple_metrics":{
    "r":0.75,
    "p":0.25,
    "f1":0.375,
    "avg_pos":0.4166666667
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.25,
    "f1":0.375
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.25,
    "f1":0.375
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.25,
    "f1":0.375
  }
}