{
  "title":"How to Play Aces Up",
  "url":"https://www.wikihow.com/Play-Aces-Up",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games",
    "Card Games for One"
  ],
  "methods":[
    {
      "name":"Dealing Your Cards",
      "steps":[
        {
          "headline":"Find a good playing surface.",
          "description":"One of the best things about Aces Up is that you can play it on a very small surface. If you're at home, any table or flat surface will do. While on the go, play the game on the back of a book, an in-flight tray, or even the top of your laptop."
        },
        {
          "headline":"Shuffle the deck.",
          "description":"While some solitaire games use more than one deck of cards, Aces Up only requires one standard 52 card deck. Buy a deck at the store or use one you've got around the house. Just make sure it has all 52 cards, or you won't be able to win. It's also possible to play online if you have a computer and access to the internet."
        },
        {
          "headline":"Set your tableau and stock.",
          "description":"There are two main parts in the setup of Aces High: the tableau and the stock. Deal the tableau by placing four cards, face up, in a row. The remaining cards become the stock. Set it off the the side, facedown."
        }
      ]
    },
    {
      "name":"Playing Through the Deck",
      "steps":[
        {
          "headline":"Look for two or more cards with the same suit.",
          "description":"There's only one way to remove cards from the tableau: by finding two or more cards of the same suit, then removing the lower card. Look for pairs like a 2 of hearts and a 5 of hearts, then remove the 2 of hearts. For another example, with a tableau of (8♣, 9♦, 8♦, 5♥), 8♦ is removed because it is lower than 9♦. Remember the order of the cards. In this game, aces have the highest value, followed by Kings, Queens and Jacks. After the face cards, the numbered cards have descending value, with two being the smallest card. Place the removed cards in a new discard pile. You'll want the cards in a separate pile: don't place them at the bottom of the stock like some other card games."
        },
        {
          "headline":"Deal out new cards.",
          "description":"When you run out of matching suited cards, deal out four more. Lay one on top of each row on the tableau, face up. This will display a whole new set of cards that you can match and remove."
        },
        {
          "headline":"Move cards onto empty spaces.",
          "description":"If you remove a low card and it leaves an empty space behind, you're allowed to move an empty card onto this space. This will come in handy later, because lower cards often get stacked on top of higher cards of a same suit. Always try to move aces onto empty spaces. If an ace of any suit comes out of the stock and you end up with an empty space to put it on, move it right away. The goal of the game is to have only the aces remaining on the tableau, so they'll need to be on the bottom spaces."
        },
        {
          "headline":"Continue in the same pattern.",
          "description":"Keep matching cards until you can't match any more, then deal four more cards. Move cards to empty spaces to create new openings when it's possible, always trying to move the aces to the bottom spaces. Keep playing until the stock runs out and there are no more available moves."
        }
      ]
    },
    {
      "name":"Winning the Game",
      "steps":[
        {
          "headline":"Check your tableau.",
          "description":"To win the game, you'll want to leave only aces on the table, with every other card discarded. The more you play, the more you will win, but keep in mind that games often end with cards of different suits on the tops of the stacks; this is the easiest way to know that you've lost."
        },
        {
          "headline":"Use some strategy.",
          "description":"Aces Up is a simple game, so there's not much complex strategy to be applied. However, if you keep in mind the basics of the game, you're more likely to win more often. Use your empty spaces and move your aces as soon as possible. If you see a low card stacked on a higher card of the same suit, try to move the lower card to an empty space. For example, if you see a 7 of diamonds on top of a 9 of diamonds, move the 7 to an empty space and then remove it to the discard pile. Try moving aces to empty spots. When an empty space appears and you have an ace that's free to move to it, move the ace as soon as possible."
        },
        {
          "headline":"Play again.",
          "description":"Aces up is a fast moving game, so each game takes only about 5-10 minutes. If your first one ends in a loss, reshuffle your cards and try again. The more practice you get, the more strategies you'll be able to develop."
        }
      ]
    }
  ],
  "text":" Dealing Your Cards Find a good playing surface. One of the best things about Aces Up is that you can play it on a very small surface. If you're at home, any table or flat surface will do. While on the go, play the game on the back of a book, an in-flight tray, or even the top of your laptop. Shuffle the deck. While some solitaire games use more than one deck of cards, Aces Up only requires one standard 52 card deck. Buy a deck at the store or use one you've got around the house. Just make sure it has all 52 cards, or you won't be able to win. It's also possible to play online if you have a computer and access to the internet. Set your tableau and stock. There are two main parts in the setup of Aces High: the tableau and the stock. Deal the tableau by placing four cards, face up, in a row. The remaining cards become the stock. Set it off the the side, facedown. Playing Through the Deck Look for two or more cards with the same suit. There's only one way to remove cards from the tableau: by finding two or more cards of the same suit, then removing the lower card. Look for pairs like a 2 of hearts and a 5 of hearts, then remove the 2 of hearts. For another example, with a tableau of (8♣, 9♦, 8♦, 5♥), 8♦ is removed because it is lower than 9♦. Remember the order of the cards. In this game, aces have the highest value, followed by Kings, Queens and Jacks. After the face cards, the numbered cards have descending value, with two being the smallest card. Place the removed cards in a new discard pile. You'll want the cards in a separate pile: don't place them at the bottom of the stock like some other card games. Deal out new cards. When you run out of matching suited cards, deal out four more. Lay one on top of each row on the tableau, face up. This will display a whole new set of cards that you can match and remove. Move cards onto empty spaces. If you remove a low card and it leaves an empty space behind, you're allowed to move an empty card onto this space. This will come in handy later, because lower cards often get stacked on top of higher cards of a same suit. Always try to move aces onto empty spaces. If an ace of any suit comes out of the stock and you end up with an empty space to put it on, move it right away. The goal of the game is to have only the aces remaining on the tableau, so they'll need to be on the bottom spaces. Continue in the same pattern. Keep matching cards until you can't match any more, then deal four more cards. Move cards to empty spaces to create new openings when it's possible, always trying to move the aces to the bottom spaces. Keep playing until the stock runs out and there are no more available moves. Winning the Game Check your tableau. To win the game, you'll want to leave only aces on the table, with every other card discarded. The more you play, the more you will win, but keep in mind that games often end with cards of different suits on the tops of the stacks; this is the easiest way to know that you've lost. Use some strategy. Aces Up is a simple game, so there's not much complex strategy to be applied. However, if you keep in mind the basics of the game, you're more likely to win more often. Use your empty spaces and move your aces as soon as possible. If you see a low card stacked on a higher card of the same suit, try to move the lower card to an empty space. For example, if you see a 7 of diamonds on top of a 9 of diamonds, move the 7 to an empty space and then remove it to the discard pile. Try moving aces to empty spots. When an empty space appears and you have an ace that's free to move to it, move the ace as soon as possible. Play again. Aces up is a fast moving game, so each game takes only about 5-10 minutes. If your first one ends in a loss, reshuffle your cards and try again. The more practice you get, the more strategies you'll be able to develop.",
  "sentences":[
    " Dealing Your Cards Find a good playing surface.",
    "One of the best things about Aces Up is that you can play it on a very small surface.",
    "If you're at home, any table or flat surface will do.",
    "While on the go, play the game on the back of a book, an in-flight tray, or even the top of your laptop.",
    "Shuffle the deck.",
    "While some solitaire games use more than one deck of cards, Aces Up only requires one standard 52 card deck.",
    "Buy a deck at the store or use one you've got around the house.",
    "Just make sure it has all 52 cards, or you won't be able to win.",
    "It's also possible to play online if you have a computer and access to the internet.",
    "Set your tableau and stock.",
    "There are two main parts in the setup of Aces High: the tableau and the stock.",
    "Deal the tableau by placing four cards, face up, in a row.",
    "The remaining cards become the stock.",
    "Set it off the the side, facedown.",
    "Playing Through the Deck Look for two or more cards with the same suit.",
    "There's only one way to remove cards from the tableau: by finding two or more cards of the same suit, then removing the lower card.",
    "Look for pairs like a 2 of hearts and a 5 of hearts, then remove the 2 of hearts.",
    "For another example, with a tableau of (8♣, 9♦, 8♦, 5♥), 8♦ is removed because it is lower than 9♦.",
    "Remember the order of the cards.",
    "In this game, aces have the highest value, followed by Kings, Queens and Jacks.",
    "After the face cards, the numbered cards have descending value, with two being the smallest card.",
    "Place the removed cards in a new discard pile.",
    "You'll want the cards in a separate pile: don't place them at the bottom of the stock like some other card games.",
    "Deal out new cards.",
    "When you run out of matching suited cards, deal out four more.",
    "Lay one on top of each row on the tableau, face up.",
    "This will display a whole new set of cards that you can match and remove.",
    "Move cards onto empty spaces.",
    "If you remove a low card and it leaves an empty space behind, you're allowed to move an empty card onto this space.",
    "This will come in handy later, because lower cards often get stacked on top of higher cards of a same suit.",
    "Always try to move aces onto empty spaces.",
    "If an ace of any suit comes out of the stock and you end up with an empty space to put it on, move it right away.",
    "The goal of the game is to have only the aces remaining on the tableau, so they'll need to be on the bottom spaces.",
    "Continue in the same pattern.",
    "Keep matching cards until you can't match any more, then deal four more cards.",
    "Move cards to empty spaces to create new openings when it's possible, always trying to move the aces to the bottom spaces.",
    "Keep playing until the stock runs out and there are no more available moves.",
    "Winning the Game Check your tableau.",
    "To win the game, you'll want to leave only aces on the table, with every other card discarded.",
    "The more you play, the more you will win, but keep in mind that games often end with cards of different suits on the tops of the stacks; this is the easiest way to know that you've lost.",
    "Use some strategy.",
    "Aces Up is a simple game, so there's not much complex strategy to be applied.",
    "However, if you keep in mind the basics of the game, you're more likely to win more often.",
    "Use your empty spaces and move your aces as soon as possible.",
    "If you see a low card stacked on a higher card of the same suit, try to move the lower card to an empty space.",
    "For example, if you see a 7 of diamonds on top of a 9 of diamonds, move the 7 to an empty space and then remove it to the discard pile.",
    "Try moving aces to empty spots.",
    "When an empty space appears and you have an ace that's free to move to it, move the ace as soon as possible.",
    "Play again.",
    "Aces up is a fast moving game, so each game takes only about 5-10 minutes.",
    "If your first one ends in a loss, reshuffle your cards and try again.",
    "The more practice you get, the more strategies you'll be able to develop."
  ],
  "tyn_section":[
    "A deck of cards",
    "A flat surface"
  ],
  "tyn_model":[
    "cards",
    "stock",
    "♦,",
    "diamonds",
    "solitaire games",
    "♣,",
    "♥)",
    "♦ is",
    "♦.",
    "kings",
    "queens",
    "ace",
    "aces"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}