{
  "title":"How to Make Syrniki",
  "url":"https://www.wikihow.com/Make-Syrniki",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "European Cuisine",
    "Russian and Slavic Cuisine"
  ],
  "steps":[
    {
      "headline":"Find a dry farmer's or cottage cheese.",
      "description":"Traditionally, people make syrniki from a fresh, soft cheese sold as \"tvorog\" in Eastern European delis (or simply \"syr,\" meaning cheese). In Western grocery stores, the closest option is usually a firm \"curd cheese,\" \"farmer's cheese,\" or \"quark.\" In a pinch, you can use ricotta or dry cottage cheese. You can even make your own cottage cheese and press out the moisture to get tvorog. Tvorog tends to be a little tangier and less salty than Western curd cheese. Skip the extra salt in this recipe if you're using a salty cheese."
    },
    {
      "headline":"Break up the cheese into small pieces.",
      "description":"Mash 1 cup (240 mL) cheese with a fork or pulse in the blender until the curds are in small pieces."
    },
    {
      "headline":"Mix together the batter ingredients.",
      "description":"Beat the egg in a large bowl. Add the cheese, 6 tbsp (50 g) flour, 3 tbsp (40 g) sugar, ½ tsp (2.5 mL) vanilla, and a dash of salt. Mix thoroughly until the ingredients are well mixed and the batter holds together in a loose lump, similar to thick pancake batter. You may need to add extra flour if using a wet cheese."
    },
    {
      "headline":"Heat a pan of oil.",
      "description":"Heat about 1 tbsp (15 mL) of oil in a medium sized skillet over medium high heat. The oil is hot enough when it makes a sprinkle of flour sizzle."
    },
    {
      "headline":"Form the batter into thick pancakes.",
      "description":"While waiting for the oil to heat up, separate the batter into balls that fit on your palm. Coat each ball in flour and flatten it gently into a thick, round patty, similar to an American pancake."
    },
    {
      "headline":"Fry until brown on both sides.",
      "description":"It only takes a couple minutes on each side to cook these pancakes. The outside should be golden brown and slightly crispy from the flour coating, while the inside stays soft, fluffy, and cheesy. Add a little more oil to the pan between each batch of syrniki."
    },
    {
      "headline":"Serve with toppings.",
      "description":"Serve the syrniki hot and enjoy with a garnish of sour cream, fruit jam, fresh fruit, applesauce, or honey."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Find a dry farmer's or cottage cheese. Traditionally, people make syrniki from a fresh, soft cheese sold as \"tvorog\" in Eastern European delis (or simply \"syr,\" meaning cheese). In Western grocery stores, the closest option is usually a firm \"curd cheese,\" \"farmer's cheese,\" or \"quark.\" In a pinch, you can use ricotta or dry cottage cheese. You can even make your own cottage cheese and press out the moisture to get tvorog. Tvorog tends to be a little tangier and less salty than Western curd cheese. Skip the extra salt in this recipe if you're using a salty cheese. Break up the cheese into small pieces. Mash 1 cup (240 mL) cheese with a fork or pulse in the blender until the curds are in small pieces. Mix together the batter ingredients. Beat the egg in a large bowl. Add the cheese, 6 tbsp (50 g) flour, 3 tbsp (40 g) sugar, ½ tsp (2.5 mL) vanilla, and a dash of salt. Mix thoroughly until the ingredients are well mixed and the batter holds together in a loose lump, similar to thick pancake batter. You may need to add extra flour if using a wet cheese. Heat a pan of oil. Heat about 1 tbsp (15 mL) of oil in a medium sized skillet over medium high heat. The oil is hot enough when it makes a sprinkle of flour sizzle. Form the batter into thick pancakes. While waiting for the oil to heat up, separate the batter into balls that fit on your palm. Coat each ball in flour and flatten it gently into a thick, round patty, similar to an American pancake. Fry until brown on both sides. It only takes a couple minutes on each side to cook these pancakes. The outside should be golden brown and slightly crispy from the flour coating, while the inside stays soft, fluffy, and cheesy. Add a little more oil to the pan between each batch of syrniki. Serve with toppings. Serve the syrniki hot and enjoy with a garnish of sour cream, fruit jam, fresh fruit, applesauce, or honey. Finished. ",
  "sentences":[
    " Find a dry farmer's or cottage cheese.",
    "Traditionally, people make syrniki from a fresh, soft cheese sold as \"tvorog\" in Eastern European delis (or simply \"syr,\" meaning cheese).",
    "In Western grocery stores, the closest option is usually a firm \"curd cheese,\" \"farmer's cheese,\" or \"quark.\"",
    "In a pinch, you can use ricotta or dry cottage cheese.",
    "You can even make your own cottage cheese and press out the moisture to get tvorog.",
    "Tvorog tends to be a little tangier and less salty than Western curd cheese.",
    "Skip the extra salt in this recipe if you're using a salty cheese.",
    "Break up the cheese into small pieces.",
    "Mash 1 cup (240 mL) cheese with a fork or pulse in the blender until the curds are in small pieces.",
    "Mix together the batter ingredients.",
    "Beat the egg in a large bowl.",
    "Add the cheese, 6 tbsp (50 g) flour, 3 tbsp (40 g) sugar, ½ tsp (2.5 mL) vanilla, and a dash of salt.",
    "Mix thoroughly until the ingredients are well mixed and the batter holds together in a loose lump, similar to thick pancake batter.",
    "You may need to add extra flour if using a wet cheese.",
    "Heat a pan of oil.",
    "Heat about 1 tbsp (15 mL) of oil in a medium sized skillet over medium high heat.",
    "The oil is hot enough when it makes a sprinkle of flour sizzle.",
    "Form the batter into thick pancakes.",
    "While waiting for the oil to heat up, separate the batter into balls that fit on your palm.",
    "Coat each ball in flour and flatten it gently into a thick, round patty, similar to an American pancake.",
    "Fry until brown on both sides.",
    "It only takes a couple minutes on each side to cook these pancakes.",
    "The outside should be golden brown and slightly crispy from the flour coating, while the inside stays soft, fluffy, and cheesy.",
    "Add a little more oil to the pan between each batch of syrniki.",
    "Serve with toppings.",
    "Serve the syrniki hot and enjoy with a garnish of sour cream, fruit jam, fresh fruit, applesauce, or honey.",
    "Finished."
  ],
  "tyn_section":[
    "Large bowl",
    "Fork or blender",
    "Stove",
    "Pan"
  ],
  "tyn_model":[
    "flour",
    "oil",
    "cottage cheese",
    "cheese",
    "tvorog",
    "curd cheese",
    "salt",
    "farmer's cheese",
    "ricotta",
    "fork",
    "blender",
    "egg",
    "large bowl",
    "sugar",
    "vanilla",
    "pan",
    "medium sized skillet",
    "sour cream",
    "fruit jam",
    "applesauce",
    "honey"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0952380952,
    "f1":0.16,
    "avg_pos":0.5714285714
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.0952380952,
    "f1":0.16
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.1904761905,
    "f1":0.3037974684
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0952380952,
    "f1":0.16
  }
}