{
  "title":"How to Make Strawberry Milkshakes",
  "url":"https://www.wikihow.com/Make-Strawberry-Milkshakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk",
    "Fruit Based Shakes"
  ],
  "methods":[
    {
      "name":"Making a Simple Strawberry Milkshake",
      "steps":[
        {
          "headline":"Place all of the ingredients in a blender.",
          "description":"Place 5 oz. of thawed frozen sweetened strawberries, 1 1/2 cups (350 ml.) of cold milk, and 1/2 pint of vanilla ice cream in a blender."
        },
        {
          "headline":"Blend the ingredients on high for 2-3 minutes.",
          "description":"Blend the ingredients until you've made a cool and creamy mixture. If you like your milkshake to be a bit chunkier, you can blend it for a bit less time. If you'd like it to be smoother, then you can blend it for more time."
        },
        {
          "headline":"Pour the milkshake into two glasses.",
          "description":"This recipe makes two glasses of strawberry milkshakes. Pour it into two glasses and place a straw in them."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy these tasty strawberry milkshakes while they're cold."
        }
      ]
    },
    {
      "name":"Making a Strawberry Banana Milkshake",
      "steps":[
        {
          "headline":"Place all of the ingredients in a blender.",
          "description":"To make this strawberry banana milkshake, place 1 overripe banana, 4 large strawberries, 3/4 cup vanilla ice cream, 1/2 cup milk, and 1/2 tsp. vanilla extract in a blender."
        },
        {
          "headline":"Blend the ingredients on high until the milkshake is smooth.",
          "description":"This should take about 2-3 minutes."
        },
        {
          "headline":"Pour the milkshake into a glass.",
          "description":""
        },
        {
          "headline":"Garnish.",
          "description":"Garnish this milkshake with some whipped cream."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy this cool milkshake immediately while it's nice and cool."
        }
      ]
    },
    {
      "name":"Making a Creamy Strawberry Milkshake",
      "steps":[
        {
          "headline":"Place all of the ingredients in a blender.",
          "description":"Place 6 cups of fresh strawberries, 3-4 scoops of strawberry ice cream, 1/4 cup of whipping cream, 1/3 cup of milk, 2 tbsp. of sugar, and 1 tbsp. of lemon juice in a blender."
        },
        {
          "headline":"Blend the ingredients on high for 2-3 minutes.",
          "description":"Keep blending them until you've made a smooth and creamy milkshake. If you'd like the milkshake to be a bit thinner, you can add more milk along the way."
        },
        {
          "headline":"Pour the milkshake into a glass.",
          "description":"Pour the milkshake into a cool tall glass."
        },
        {
          "headline":"Garnish.",
          "description":"Garnish the milkshake with one or two sliced strawberries."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy this creamy beverage while it's cold."
        }
      ]
    },
    {
      "name":"Making a Creamy Strawberry and Blueberry Milkshake",
      "steps":[
        {
          "headline":"Add 2 cups of vanilla ice cream to your blender.",
          "description":"If you like, you can substitute other fruity flavors of ice cream, like, for instance, strawberry, for part or all of your vanilla. More vanilla gives a creamier taste, while more of other types of ice cream can give sweeter, fruitier blends."
        },
        {
          "headline":"Add your berries.",
          "description":"Add 2 cups of strawberries and 2 cups of blueberries to your shake for a delicious blend of flavors. Change the proportions of your berries as you wish."
        },
        {
          "headline":"Add 1/3 cup of milk.",
          "description":"Milk helps ensure your milkshake isn't too thick or solid to drink. A little bit of milk goes a long way, but don't be afraid to add more if the final product is too thick for you."
        },
        {
          "headline":"Optionally, add 1 tsp lemon juice.",
          "description":"A dash of lemon juice isn't essential for a great-tasting shake, but it can give your shake just a hint of tartness. Don't add too much, as the sour flavor of the lemon can begin to clash with the creaminess of your shake if you're too generous."
        },
        {
          "headline":"Add 10-20 ice cubes.",
          "description":"The more ice you add to your shake, the \"slushier\" it will be. Keep in mind that when ice melts, it makes your shake watery, so drink particularly slushy shakes quickly!"
        },
        {
          "headline":"Blend, garnish, and enjoy!",
          "description":"Serve with a dollop of whipped cream on top of your shake and a slice of strawberry or two on the rim of the glass for garnish. Savor your sweet, delicious beverage!"
        }
      ]
    }
  ],
  "text":" Making a Simple Strawberry Milkshake Place all of the ingredients in a blender. Place 5 oz. of thawed frozen sweetened strawberries, 1 1/2 cups (350 ml.) of cold milk, and 1/2 pint of vanilla ice cream in a blender. Blend the ingredients on high for 2-3 minutes. Blend the ingredients until you've made a cool and creamy mixture. If you like your milkshake to be a bit chunkier, you can blend it for a bit less time. If you'd like it to be smoother, then you can blend it for more time. Pour the milkshake into two glasses. This recipe makes two glasses of strawberry milkshakes. Pour it into two glasses and place a straw in them. Serve. Enjoy these tasty strawberry milkshakes while they're cold. Making a Strawberry Banana Milkshake Place all of the ingredients in a blender. To make this strawberry banana milkshake, place 1 overripe banana, 4 large strawberries, 3/4 cup vanilla ice cream, 1/2 cup milk, and 1/2 tsp. vanilla extract in a blender. Blend the ingredients on high until the milkshake is smooth. This should take about 2-3 minutes. Pour the milkshake into a glass.  Garnish. Garnish this milkshake with some whipped cream. Serve. Enjoy this cool milkshake immediately while it's nice and cool. Making a Creamy Strawberry Milkshake Place all of the ingredients in a blender. Place 6 cups of fresh strawberries, 3-4 scoops of strawberry ice cream, 1/4 cup of whipping cream, 1/3 cup of milk, 2 tbsp. of sugar, and 1 tbsp. of lemon juice in a blender. Blend the ingredients on high for 2-3 minutes. Keep blending them until you've made a smooth and creamy milkshake. If you'd like the milkshake to be a bit thinner, you can add more milk along the way. Pour the milkshake into a glass. Pour the milkshake into a cool tall glass. Garnish. Garnish the milkshake with one or two sliced strawberries. Serve. Enjoy this creamy beverage while it's cold. Making a Creamy Strawberry and Blueberry Milkshake Add 2 cups of vanilla ice cream to your blender. If you like, you can substitute other fruity flavors of ice cream, like, for instance, strawberry, for part or all of your vanilla. More vanilla gives a creamier taste, while more of other types of ice cream can give sweeter, fruitier blends. Add your berries. Add 2 cups of strawberries and 2 cups of blueberries to your shake for a delicious blend of flavors. Change the proportions of your berries as you wish. Add 1/3 cup of milk. Milk helps ensure your milkshake isn't too thick or solid to drink. A little bit of milk goes a long way, but don't be afraid to add more if the final product is too thick for you. Optionally, add 1 tsp lemon juice. A dash of lemon juice isn't essential for a great-tasting shake, but it can give your shake just a hint of tartness. Don't add too much, as the sour flavor of the lemon can begin to clash with the creaminess of your shake if you're too generous. Add 10-20 ice cubes. The more ice you add to your shake, the \"slushier\" it will be. Keep in mind that when ice melts, it makes your shake watery, so drink particularly slushy shakes quickly! Blend, garnish, and enjoy! Serve with a dollop of whipped cream on top of your shake and a slice of strawberry or two on the rim of the glass for garnish. Savor your sweet, delicious beverage!",
  "sentences":[
    " Making a Simple Strawberry Milkshake Place all of the ingredients in a blender.",
    "Place 5 oz.",
    "of thawed frozen sweetened strawberries, 1 1/2 cups (350 ml.)",
    "of cold milk, and 1/2 pint of vanilla ice cream in a blender.",
    "Blend the ingredients on high for 2-3 minutes.",
    "Blend the ingredients until you've made a cool and creamy mixture.",
    "If you like your milkshake to be a bit chunkier, you can blend it for a bit less time.",
    "If you'd like it to be smoother, then you can blend it for more time.",
    "Pour the milkshake into two glasses.",
    "This recipe makes two glasses of strawberry milkshakes.",
    "Pour it into two glasses and place a straw in them.",
    "Serve.",
    "Enjoy these tasty strawberry milkshakes while they're cold.",
    "Making a Strawberry Banana Milkshake Place all of the ingredients in a blender.",
    "To make this strawberry banana milkshake, place 1 overripe banana, 4 large strawberries, 3/4 cup vanilla ice cream, 1/2 cup milk, and 1/2 tsp.",
    "vanilla extract in a blender.",
    "Blend the ingredients on high until the milkshake is smooth.",
    "This should take about 2-3 minutes.",
    "Pour the milkshake into a glass.",
    "Garnish.",
    "Garnish this milkshake with some whipped cream.",
    "Serve.",
    "Enjoy this cool milkshake immediately while it's nice and cool.",
    "Making a Creamy Strawberry Milkshake Place all of the ingredients in a blender.",
    "Place 6 cups of fresh strawberries, 3-4 scoops of strawberry ice cream, 1/4 cup of whipping cream, 1/3 cup of milk, 2 tbsp.",
    "of sugar, and 1 tbsp.",
    "of lemon juice in a blender.",
    "Blend the ingredients on high for 2-3 minutes.",
    "Keep blending them until you've made a smooth and creamy milkshake.",
    "If you'd like the milkshake to be a bit thinner, you can add more milk along the way.",
    "Pour the milkshake into a glass.",
    "Pour the milkshake into a cool tall glass.",
    "Garnish.",
    "Garnish the milkshake with one or two sliced strawberries.",
    "Serve.",
    "Enjoy this creamy beverage while it's cold.",
    "Making a Creamy Strawberry and Blueberry Milkshake Add 2 cups of vanilla ice cream to your blender.",
    "If you like, you can substitute other fruity flavors of ice cream, like, for instance, strawberry, for part or all of your vanilla.",
    "More vanilla gives a creamier taste, while more of other types of ice cream can give sweeter, fruitier blends.",
    "Add your berries.",
    "Add 2 cups of strawberries and 2 cups of blueberries to your shake for a delicious blend of flavors.",
    "Change the proportions of your berries as you wish.",
    "Add 1/3 cup of milk.",
    "Milk helps ensure your milkshake isn't too thick or solid to drink.",
    "A little bit of milk goes a long way, but don't be afraid to add more if the final product is too thick for you.",
    "Optionally, add 1 tsp lemon juice.",
    "A dash of lemon juice isn't essential for a great-tasting shake, but it can give your shake just a hint of tartness.",
    "Don't add too much, as the sour flavor of the lemon can begin to clash with the creaminess of your shake if you're too generous.",
    "Add 10-20 ice cubes.",
    "The more ice you add to your shake, the \"slushier\" it will be.",
    "Keep in mind that when ice melts, it makes your shake watery, so drink particularly slushy shakes quickly!",
    "Blend, garnish, and enjoy!",
    "Serve with a dollop of whipped cream on top of your shake and a slice of strawberry or two on the rim of the glass for garnish.",
    "Savor your sweet, delicious beverage!"
  ],
  "tyn_section":[
    "Blender",
    "Ice cream scoop",
    "Glass"
  ],
  "tyn_model":[
    "blender",
    "milk",
    "strawberries",
    "vanilla ice cream",
    "glass",
    "whipped cream",
    "lemon juice",
    "ice cream",
    "strawberry",
    "vanilla",
    "lemon",
    "ice",
    "sweetened strawberries",
    "cold milk",
    "strawberry milkshakes",
    "straw",
    "strawberry banana milkshake",
    "banana",
    "vanilla extract",
    "strawberry ice cream",
    "whipping cream",
    "sugar",
    "tall glass",
    "berries",
    "blueberries",
    "ice cubes"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.0769230769,
    "f1":0.1379310345,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.2307692308,
    "f1":0.375
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2692307692,
    "f1":0.4242424242
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.1153846154,
    "f1":0.2068965517
  }
}