{
  "title":"How to Cook Chestnuts",
  "url":"https://www.wikihow.com/Cook-Chestnuts",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "methods":[
    {
      "name":"Microwaving Chestnuts",
      "steps":[
        {
          "headline":"Grab a handful of chestnuts.",
          "description":"Five or six at a time will do."
        },
        {
          "headline":"Chop each chestnut in half.",
          "description":"Place it on a cutting board and cut it with a sharp knife. Cutting it in half will help it cook faster."
        },
        {
          "headline":"Cook them in the microwave on the \"potato\" setting.",
          "description":"The chestnut is similar to the potato when it comes to cooking. This should take between 2-5 minutes, depending on the strength of your microwave."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy these chestnuts plain and bite the nut directly off the shell or scoop it out with a small spoon first."
        }
      ]
    },
    {
      "name":"Roasting Chestnuts in an Oven",
      "steps":[
        {
          "headline":"Preheat your oven to 400ºF (205ºC).",
          "description":""
        },
        {
          "headline":"Cut an \"X\" shape into the flat side of each chestnut.",
          "description":"Use a sharp knife to do this. This will make the chestnuts roast faster, allowing the steam to escape from the chestnuts. You can also just pierce each chestnut several times with a fork."
        },
        {
          "headline":"Place the chestnuts on a baking sheet.",
          "description":"You can also just place them right on the grill, with the cut side facing up. Sprinkle them lightly with water to help them roast."
        },
        {
          "headline":"Roast the chestnuts for 15-20 minutes.",
          "description":"Roast them until they're tender and the shell comes off easily. While they're roasting, use a spoon or spatula to move them around every few minutes so they don't burn. When they're done roasting, remove them from the oven."
        },
        {
          "headline":"Crush their skins.",
          "description":"Wait 2-3 minutes for the chestnuts to cool off and then wrap them in a towel and squeeze them until the skin is crushed. Leave them in the towel for another five minutes."
        },
        {
          "headline":"Peel the nuts.",
          "description":"Do this while they're still warm to make the process easier. Take out the inner skin along with the shell. If any nuts are hard to peel, you can heat them briefly for a few more minutes until they're ready."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy these nuts on their own while they're nice and hot."
        }
      ]
    },
    {
      "name":"Roasting Chestnuts Over an Open Fire",
      "steps":[
        {
          "headline":"Rinse the chestnuts.",
          "description":"Rinse them off under cool water to remove any dirt."
        },
        {
          "headline":"Score the shells.",
          "description":"Score the shells before you place them in a pan."
        },
        {
          "headline":"Put the nuts in a cast iron frying pan.",
          "description":"Place the flat sides of the chestnuts down."
        },
        {
          "headline":"Prepare the fire.",
          "description":"Make sure that there's a bed of glowing coals that you can rest the pan on, whether you've lit a fireplace or a campfire."
        },
        {
          "headline":"Place the pan on the coals for 5 minutes.",
          "description":"This should be enough to roast one side of the chestnuts. Lightly shake the pan around every minute or so to distribute the heat."
        },
        {
          "headline":"Turn the nuts over.",
          "description":"After five minutes, use a potholder to remove the pan, roll over the nuts, and place them back on the fire."
        },
        {
          "headline":"Roast the nuts for another 5 minutes.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Once you've roasted the nuts, wait 2-3 minutes for them to cool down and enjoy them while they're nice and hot."
        }
      ]
    },
    {
      "name":"Boiling Chestnuts",
      "steps":[
        {
          "headline":"Boil a pot of water.",
          "description":""
        },
        {
          "headline":"Cut an X into one side of two cups of chestnuts.",
          "description":"Use a sharp knife to cut the \"X\" shape into the chestnuts. This will make them boil more easily. Boiling chestnuts won't make them quite as tasty or aromatic, but it's a great way to quickly soften them."
        },
        {
          "headline":"Boil the chestnuts for 5-10 minutes.",
          "description":""
        },
        {
          "headline":"Let the chestnuts cool.",
          "description":"Wait at least 2-3 minutes until the chestnuts are cool enough for you to handle them."
        },
        {
          "headline":"Peel the shells and the skins off the nuts.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Enjoy these chestnuts plain or with 1/2 a teaspoon of cinnamon and one tablespoon of melted butter."
        }
      ]
    }
  ],
  "text":" Microwaving Chestnuts Grab a handful of chestnuts. Five or six at a time will do. Chop each chestnut in half. Place it on a cutting board and cut it with a sharp knife. Cutting it in half will help it cook faster. Cook them in the microwave on the \"potato\" setting. The chestnut is similar to the potato when it comes to cooking. This should take between 2-5 minutes, depending on the strength of your microwave. Serve. Enjoy these chestnuts plain and bite the nut directly off the shell or scoop it out with a small spoon first. Roasting Chestnuts in an Oven Preheat your oven to 400ºF (205ºC).  Cut an \"X\" shape into the flat side of each chestnut. Use a sharp knife to do this. This will make the chestnuts roast faster, allowing the steam to escape from the chestnuts. You can also just pierce each chestnut several times with a fork. Place the chestnuts on a baking sheet. You can also just place them right on the grill, with the cut side facing up. Sprinkle them lightly with water to help them roast. Roast the chestnuts for 15-20 minutes. Roast them until they're tender and the shell comes off easily. While they're roasting, use a spoon or spatula to move them around every few minutes so they don't burn. When they're done roasting, remove them from the oven. Crush their skins. Wait 2-3 minutes for the chestnuts to cool off and then wrap them in a towel and squeeze them until the skin is crushed. Leave them in the towel for another five minutes. Peel the nuts. Do this while they're still warm to make the process easier. Take out the inner skin along with the shell. If any nuts are hard to peel, you can heat them briefly for a few more minutes until they're ready. Serve. Enjoy these nuts on their own while they're nice and hot. Roasting Chestnuts Over an Open Fire Rinse the chestnuts. Rinse them off under cool water to remove any dirt. Score the shells. Score the shells before you place them in a pan. Put the nuts in a cast iron frying pan. Place the flat sides of the chestnuts down. Prepare the fire. Make sure that there's a bed of glowing coals that you can rest the pan on, whether you've lit a fireplace or a campfire. Place the pan on the coals for 5 minutes. This should be enough to roast one side of the chestnuts. Lightly shake the pan around every minute or so to distribute the heat. Turn the nuts over. After five minutes, use a potholder to remove the pan, roll over the nuts, and place them back on the fire. Roast the nuts for another 5 minutes.  Serve. Once you've roasted the nuts, wait 2-3 minutes for them to cool down and enjoy them while they're nice and hot. Boiling Chestnuts Boil a pot of water.  Cut an X into one side of two cups of chestnuts. Use a sharp knife to cut the \"X\" shape into the chestnuts. This will make them boil more easily. Boiling chestnuts won't make them quite as tasty or aromatic, but it's a great way to quickly soften them. Boil the chestnuts for 5-10 minutes.  Let the chestnuts cool. Wait at least 2-3 minutes until the chestnuts are cool enough for you to handle them. Peel the shells and the skins off the nuts.  Serve. Enjoy these chestnuts plain or with 1/2 a teaspoon of cinnamon and one tablespoon of melted butter.",
  "sentences":[
    " Microwaving Chestnuts Grab a handful of chestnuts.",
    "Five or six at a time will do.",
    "Chop each chestnut in half.",
    "Place it on a cutting board and cut it with a sharp knife.",
    "Cutting it in half will help it cook faster.",
    "Cook them in the microwave on the \"potato\" setting.",
    "The chestnut is similar to the potato when it comes to cooking.",
    "This should take between 2-5 minutes, depending on the strength of your microwave.",
    "Serve.",
    "Enjoy these chestnuts plain and bite the nut directly off the shell or scoop it out with a small spoon first.",
    "Roasting Chestnuts in an Oven Preheat your oven to 400ºF (205ºC).",
    "Cut an \"X\" shape into the flat side of each chestnut.",
    "Use a sharp knife to do this.",
    "This will make the chestnuts roast faster, allowing the steam to escape from the chestnuts.",
    "You can also just pierce each chestnut several times with a fork.",
    "Place the chestnuts on a baking sheet.",
    "You can also just place them right on the grill, with the cut side facing up.",
    "Sprinkle them lightly with water to help them roast.",
    "Roast the chestnuts for 15-20 minutes.",
    "Roast them until they're tender and the shell comes off easily.",
    "While they're roasting, use a spoon or spatula to move them around every few minutes so they don't burn.",
    "When they're done roasting, remove them from the oven.",
    "Crush their skins.",
    "Wait 2-3 minutes for the chestnuts to cool off and then wrap them in a towel and squeeze them until the skin is crushed.",
    "Leave them in the towel for another five minutes.",
    "Peel the nuts.",
    "Do this while they're still warm to make the process easier.",
    "Take out the inner skin along with the shell.",
    "If any nuts are hard to peel, you can heat them briefly for a few more minutes until they're ready.",
    "Serve.",
    "Enjoy these nuts on their own while they're nice and hot.",
    "Roasting Chestnuts Over an Open Fire Rinse the chestnuts.",
    "Rinse them off under cool water to remove any dirt.",
    "Score the shells.",
    "Score the shells before you place them in a pan.",
    "Put the nuts in a cast iron frying pan.",
    "Place the flat sides of the chestnuts down.",
    "Prepare the fire.",
    "Make sure that there's a bed of glowing coals that you can rest the pan on, whether you've lit a fireplace or a campfire.",
    "Place the pan on the coals for 5 minutes.",
    "This should be enough to roast one side of the chestnuts.",
    "Lightly shake the pan around every minute or so to distribute the heat.",
    "Turn the nuts over.",
    "After five minutes, use a potholder to remove the pan, roll over the nuts, and place them back on the fire.",
    "Roast the nuts for another 5 minutes.",
    "Serve.",
    "Once you've roasted the nuts, wait 2-3 minutes for them to cool down and enjoy them while they're nice and hot.",
    "Boiling Chestnuts Boil a pot of water.",
    "Cut an X into one side of two cups of chestnuts.",
    "Use a sharp knife to cut the \"X\" shape into the chestnuts.",
    "This will make them boil more easily.",
    "Boiling chestnuts won't make them quite as tasty or aromatic, but it's a great way to quickly soften them.",
    "Boil the chestnuts for 5-10 minutes.",
    "Let the chestnuts cool.",
    "Wait at least 2-3 minutes until the chestnuts are cool enough for you to handle them.",
    "Peel the shells and the skins off the nuts.",
    "Serve.",
    "Enjoy these chestnuts plain or with 1/2 a teaspoon of cinnamon and one tablespoon of melted butter."
  ],
  "tyn_section":[
    "a handful of chestnuts",
    "a knife",
    "a cutting board",
    "a microwave"
  ],
  "tyn_model":[
    "chestnuts",
    "nuts",
    "pan",
    "oven",
    "water",
    "sharp knife",
    "microwave",
    "towel",
    "coals",
    "cutting board",
    "chestnut",
    "potato",
    "fork",
    "baking sheet",
    "grill",
    "spoon",
    "spatula",
    "cast iron frying pan",
    "cinnamon",
    "melted butter"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1,
    "f1":0.1666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.15,
    "f1":0.25
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.05,
    "f1":0.0833333333
  }
}