{
  "title":"How to Poach Fruit",
  "url":"https://www.wikihow.com/Poach-Fruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "parts":[
    {
      "name":"Understanding the Poaching Process",
      "steps":[
        {
          "headline":"Get the poaching ratios accurate.",
          "description":"It is standard to use 2 parts of liquid to 1 part sugar. The liquid can be water, wine, spirit, liqueur, juice, etc. If you don't want to use sugar, adjust with another sweetener, such as honey or maple syrup. Or, leave it out completely."
        },
        {
          "headline":"Prepare the fruit.",
          "description":"There are some important considerations to address before poaching the fruit:\nDo you want to remove the peel, the core, the seeds, etc.? Or, are these to be included? This will depend on the fruit type used and the dish being made. Many people like being able to avoid having to pick out seeds and stringy bits when eating poached fruits but it's a personal preference. Consider what size to leave or cut the fruit. Note that smaller pieces will poach faster than larger ones. However, a half piece of fruit may look a lot better than chunks, depending on the dish presentation and the fruit being used, such as pear or peach halves. (And, of course, rhubarb doesn't have a \"half\" in the traditional sense!) Know how ripe the fruit is. The riper the fruit, the less time needed for poaching and if it's too ripe, it'll fall apart. Harder, firm fruit tends to poach best."
        },
        {
          "headline":"Consider the end flavour.",
          "description":"You can rely on just the fruit and the syrup as the final flavour. However, you can play with the flavours to enhance the poached fruit, such as by adding cloves, spices, aromatic leaves, vanilla pod, etc. to the liquid. This can be added to either or both the fruit and liquid and left to stand for a time before poaching. Or, it can added with the fruit and poached straight away, for a less intense flavour addition. Some great additions for flavour include: Cinnamon, cloves, lemon peel or juice, vanilla beans (scraped), nutmeg, coffee, tea, rosemary, sage, etc."
        },
        {
          "headline":"Poach using a medium heat.",
          "description":"This will cook the fruit at a nice pace and the liquid will have time to thicken nicely around the fruit."
        },
        {
          "headline":"Rest poached fruits in their syrup.",
          "description":"Once poached, there is only good news for leaving the fruit in the syrup––it tastes even better for the soaking! If you need to make the dessert ahead, do so and let the syrup continue to infuse through the poached fruit for even greater depth of flavour."
        }
      ]
    },
    {
      "name":"Poaching Fruit",
      "steps":[
        {
          "headline":"Wash the fruit to prepare it for use.",
          "description":""
        },
        {
          "headline":"Cut the fruit into large pieces, quarters or halves, as preferred.",
          "description":"Large stone fruits such as peaches and nectarines are best cut into neat halves, for nice presentation and for retaining their texture."
        },
        {
          "headline":"Pour the water into the saucepan or skillet/frying pan with high sides.",
          "description":"Add the sugar and stir through. Add the lemon rind piece or cinnamon stick, whichever you're using (or both, if wished)."
        },
        {
          "headline":"Place on the stove top or hob.",
          "description":"Heat gently and stir frequently, to help dissolve the sugar."
        },
        {
          "headline":"Increase the heat.",
          "description":"Boil rapidly for 2 minutes; you'll see it turn into a syrup texture."
        },
        {
          "headline":"Add the chopped or halved fruit with care.",
          "description":""
        },
        {
          "headline":"Cook gently until the fruit just turns tender and remains whole.",
          "description":"Do not cover the pan and do not overcook the fruit; it must remain intact."
        },
        {
          "headline":"Remove from the stove top or hob.",
          "description":""
        },
        {
          "headline":"Remove the fruit from the pan using a slotted spoon.",
          "description":"Arrange in each bowl, serving container or on a plate."
        },
        {
          "headline":"Serve hot or cold.",
          "description":"Include some of the liquid in which it was cooked, for each serving. Add a scoop of ice cream or cream if desired. Custard is another good choice. However, the fruit tastes great on its own too. The poached fruit can be eaten at either room temperature or chilled from the fridge."
        }
      ]
    }
  ],
  "text":" Understanding the Poaching Process Get the poaching ratios accurate. It is standard to use 2 parts of liquid to 1 part sugar. The liquid can be water, wine, spirit, liqueur, juice, etc. If you don't want to use sugar, adjust with another sweetener, such as honey or maple syrup. Or, leave it out completely. Prepare the fruit. There are some important considerations to address before poaching the fruit:\nDo you want to remove the peel, the core, the seeds, etc.? Or, are these to be included? This will depend on the fruit type used and the dish being made. Many people like being able to avoid having to pick out seeds and stringy bits when eating poached fruits but it's a personal preference. Consider what size to leave or cut the fruit. Note that smaller pieces will poach faster than larger ones. However, a half piece of fruit may look a lot better than chunks, depending on the dish presentation and the fruit being used, such as pear or peach halves. (And, of course, rhubarb doesn't have a \"half\" in the traditional sense!) Know how ripe the fruit is. The riper the fruit, the less time needed for poaching and if it's too ripe, it'll fall apart. Harder, firm fruit tends to poach best. Consider the end flavour. You can rely on just the fruit and the syrup as the final flavour. However, you can play with the flavours to enhance the poached fruit, such as by adding cloves, spices, aromatic leaves, vanilla pod, etc. to the liquid. This can be added to either or both the fruit and liquid and left to stand for a time before poaching. Or, it can added with the fruit and poached straight away, for a less intense flavour addition. Some great additions for flavour include: Cinnamon, cloves, lemon peel or juice, vanilla beans (scraped), nutmeg, coffee, tea, rosemary, sage, etc. Poach using a medium heat. This will cook the fruit at a nice pace and the liquid will have time to thicken nicely around the fruit. Rest poached fruits in their syrup. Once poached, there is only good news for leaving the fruit in the syrup––it tastes even better for the soaking! If you need to make the dessert ahead, do so and let the syrup continue to infuse through the poached fruit for even greater depth of flavour. Poaching Fruit Wash the fruit to prepare it for use.  Cut the fruit into large pieces, quarters or halves, as preferred. Large stone fruits such as peaches and nectarines are best cut into neat halves, for nice presentation and for retaining their texture. Pour the water into the saucepan or skillet/frying pan with high sides. Add the sugar and stir through. Add the lemon rind piece or cinnamon stick, whichever you're using (or both, if wished). Place on the stove top or hob. Heat gently and stir frequently, to help dissolve the sugar. Increase the heat. Boil rapidly for 2 minutes; you'll see it turn into a syrup texture. Add the chopped or halved fruit with care.  Cook gently until the fruit just turns tender and remains whole. Do not cover the pan and do not overcook the fruit; it must remain intact. Remove from the stove top or hob.  Remove the fruit from the pan using a slotted spoon. Arrange in each bowl, serving container or on a plate. Serve hot or cold. Include some of the liquid in which it was cooked, for each serving. Add a scoop of ice cream or cream if desired. Custard is another good choice. However, the fruit tastes great on its own too. The poached fruit can be eaten at either room temperature or chilled from the fridge.",
  "sentences":[
    " Understanding the Poaching Process Get the poaching ratios accurate.",
    "It is standard to use 2 parts of liquid to 1 part sugar.",
    "The liquid can be water, wine, spirit, liqueur, juice, etc.",
    "If you don't want to use sugar, adjust with another sweetener, such as honey or maple syrup.",
    "Or, leave it out completely.",
    "Prepare the fruit.",
    "There are some important considerations to address before poaching the fruit:\nDo you want to remove the peel, the core, the seeds, etc.?",
    "Or, are these to be included?",
    "This will depend on the fruit type used and the dish being made.",
    "Many people like being able to avoid having to pick out seeds and stringy bits when eating poached fruits but it's a personal preference.",
    "Consider what size to leave or cut the fruit.",
    "Note that smaller pieces will poach faster than larger ones.",
    "However, a half piece of fruit may look a lot better than chunks, depending on the dish presentation and the fruit being used, such as pear or peach halves.",
    "(And, of course, rhubarb doesn't have a \"half\" in the traditional sense!)",
    "Know how ripe the fruit is.",
    "The riper the fruit, the less time needed for poaching and if it's too ripe, it'll fall apart.",
    "Harder, firm fruit tends to poach best.",
    "Consider the end flavour.",
    "You can rely on just the fruit and the syrup as the final flavour.",
    "However, you can play with the flavours to enhance the poached fruit, such as by adding cloves, spices, aromatic leaves, vanilla pod, etc.",
    "to the liquid.",
    "This can be added to either or both the fruit and liquid and left to stand for a time before poaching.",
    "Or, it can added with the fruit and poached straight away, for a less intense flavour addition.",
    "Some great additions for flavour include: Cinnamon, cloves, lemon peel or juice, vanilla beans (scraped), nutmeg, coffee, tea, rosemary, sage, etc.",
    "Poach using a medium heat.",
    "This will cook the fruit at a nice pace and the liquid will have time to thicken nicely around the fruit.",
    "Rest poached fruits in their syrup.",
    "Once poached, there is only good news for leaving the fruit in the syrup––it tastes even better for the soaking!",
    "If you need to make the dessert ahead, do so and let the syrup continue to infuse through the poached fruit for even greater depth of flavour.",
    "Poaching Fruit Wash the fruit to prepare it for use.",
    "Cut the fruit into large pieces, quarters or halves, as preferred.",
    "Large stone fruits such as peaches and nectarines are best cut into neat halves, for nice presentation and for retaining their texture.",
    "Pour the water into the saucepan or skillet/frying pan with high sides.",
    "Add the sugar and stir through.",
    "Add the lemon rind piece or cinnamon stick, whichever you're using (or both, if wished).",
    "Place on the stove top or hob.",
    "Heat gently and stir frequently, to help dissolve the sugar.",
    "Increase the heat.",
    "Boil rapidly for 2 minutes; you'll see it turn into a syrup texture.",
    "Add the chopped or halved fruit with care.",
    "Cook gently until the fruit just turns tender and remains whole.",
    "Do not cover the pan and do not overcook the fruit; it must remain intact.",
    "Remove from the stove top or hob.",
    "Remove the fruit from the pan using a slotted spoon.",
    "Arrange in each bowl, serving container or on a plate.",
    "Serve hot or cold.",
    "Include some of the liquid in which it was cooked, for each serving.",
    "Add a scoop of ice cream or cream if desired.",
    "Custard is another good choice.",
    "However, the fruit tastes great on its own too.",
    "The poached fruit can be eaten at either room temperature or chilled from the fridge."
  ],
  "tyn_section":[
    "Cutting board",
    "Kitchen knife",
    "Saucepan with heavy base",
    "Stirring implement such as a wooden spoon",
    "Serving bowls, plates or a single serving container for helping oneself from"
  ],
  "tyn_model":[
    "sugar",
    "fruit",
    "water",
    "cloves",
    "stove top",
    "honey",
    "maple syrup",
    "fruits",
    "rhubarb",
    "syrup",
    "spices",
    "aromatic leaves",
    "vanilla",
    "cinnamon",
    "lemon",
    "vanilla beans",
    "nutmeg",
    "coffee",
    "tea",
    "rosemary",
    "sage",
    "peaches",
    "saucepan or",
    "skillet/frying pan",
    "lemon rind",
    "cinnamon stick",
    "pan",
    "slotted spoon",
    "bowl",
    "plate",
    "ice cream",
    "cream",
    "custard"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}