{
  "title":"How to Make Waterproof Matches",
  "url":"https://www.wikihow.com/Make-Waterproof-Matches",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Fire",
    "Fire Making"
  ],
  "methods":[
    {
      "name":"Use Turpentine",
      "steps":[
        {
          "headline":"Pour 2 to 3 large tablespoons of turpentine into a small (tumbler sized) glass.",
          "description":""
        },
        {
          "headline":"Place the matches, (head down) into the turpentine and allow the matches to soak for 5 minutes.",
          "description":"During that time the turpentine will soak into the head as well as the stem. All the water will be driven off by the turpentine."
        },
        {
          "headline":"Remove the matches and spread them out to dry out on a sheet of newspaper.",
          "description":"Generally, 20 minutes for excess turpentine to evaporate is recommended. Matches treated in this way remain waterproof for several months or longer."
        }
      ]
    },
    {
      "name":"Use Nail Polish",
      "steps":[
        {
          "headline":"Dip the head end of the match into clear nail polish far enough to cover at least an eighth of an inch (3 millimeters) of the stick below the head.",
          "description":""
        },
        {
          "headline":"Hold the match for a few seconds to allow the polish to dry and then place the match on a table or counter so that the head is suspended off the edge of the surface.",
          "description":""
        },
        {
          "headline":"Place a sheet of newsprint below to catch anything that may drip off.",
          "description":""
        }
      ]
    },
    {
      "name":"Use a Candle",
      "steps":[
        {
          "headline":"Light a candle and let it burn down until you have a good amount of liquid wax (about a half of an inch or 1 centimeter).",
          "description":""
        },
        {
          "headline":"Extinguish the candle.",
          "description":""
        },
        {
          "headline":"Dip the head end of the match into the wax far enough to cover at least an eighth of an inch (3 millimeters) of the stick below the head.",
          "description":""
        },
        {
          "headline":"Hold the match for a few seconds to allow the wax to harden slightly and then place the match on a table or counter so that the head is suspended off the edge of the surface.",
          "description":""
        },
        {
          "headline":"When the wax has cooled, but not completely hardened, pinch the end of the wax coating (towards the stick), forming a tight seal.",
          "description":""
        }
      ]
    },
    {
      "name":"Using Paraffin Wax",
      "steps":[
        {
          "headline":"Melt enough paraffin wax in a double boiler to be able to coat with wax about a half of an inch (1 centimeter) deep.",
          "description":""
        },
        {
          "headline":"Wrap some twine or jute string around several matches from the bottom, to just below the wax quickly.",
          "description":"This makes a torch that can burn for 10 or more minutes."
        }
      ]
    }
  ],
  "text":" Use Turpentine Pour 2 to 3 large tablespoons of turpentine into a small (tumbler sized) glass.  Place the matches, (head down) into the turpentine and allow the matches to soak for 5 minutes. During that time the turpentine will soak into the head as well as the stem. All the water will be driven off by the turpentine. Remove the matches and spread them out to dry out on a sheet of newspaper. Generally, 20 minutes for excess turpentine to evaporate is recommended. Matches treated in this way remain waterproof for several months or longer. Use Nail Polish Dip the head end of the match into clear nail polish far enough to cover at least an eighth of an inch (3 millimeters) of the stick below the head.  Hold the match for a few seconds to allow the polish to dry and then place the match on a table or counter so that the head is suspended off the edge of the surface.  Place a sheet of newsprint below to catch anything that may drip off.  Use a Candle Light a candle and let it burn down until you have a good amount of liquid wax (about a half of an inch or 1 centimeter).  Extinguish the candle.  Dip the head end of the match into the wax far enough to cover at least an eighth of an inch (3 millimeters) of the stick below the head.  Hold the match for a few seconds to allow the wax to harden slightly and then place the match on a table or counter so that the head is suspended off the edge of the surface.  When the wax has cooled, but not completely hardened, pinch the end of the wax coating (towards the stick), forming a tight seal.  Using Paraffin Wax Melt enough paraffin wax in a double boiler to be able to coat with wax about a half of an inch (1 centimeter) deep.  Wrap some twine or jute string around several matches from the bottom, to just below the wax quickly. This makes a torch that can burn for 10 or more minutes.",
  "sentences":[
    " Use Turpentine Pour 2 to 3 large tablespoons of turpentine into a small (tumbler sized) glass.",
    "Place the matches, (head down) into the turpentine and allow the matches to soak for 5 minutes.",
    "During that time the turpentine will soak into the head as well as the stem.",
    "All the water will be driven off by the turpentine.",
    "Remove the matches and spread them out to dry out on a sheet of newspaper.",
    "Generally, 20 minutes for excess turpentine to evaporate is recommended.",
    "Matches treated in this way remain waterproof for several months or longer.",
    "Use Nail Polish Dip the head end of the match into clear nail polish far enough to cover at least an eighth of an inch (3 millimeters) of the stick below the head.",
    "Hold the match for a few seconds to allow the polish to dry and then place the match on a table or counter so that the head is suspended off the edge of the surface.",
    "Place a sheet of newsprint below to catch anything that may drip off.",
    "Use a Candle Light a candle and let it burn down until you have a good amount of liquid wax (about a half of an inch or 1 centimeter).",
    "Extinguish the candle.",
    "Dip the head end of the match into the wax far enough to cover at least an eighth of an inch (3 millimeters) of the stick below the head.",
    "Hold the match for a few seconds to allow the wax to harden slightly and then place the match on a table or counter so that the head is suspended off the edge of the surface.",
    "When the wax has cooled, but not completely hardened, pinch the end of the wax coating (towards the stick), forming a tight seal.",
    "Using Paraffin Wax Melt enough paraffin wax in a double boiler to be able to coat with wax about a half of an inch (1 centimeter) deep.",
    "Wrap some twine or jute string around several matches from the bottom, to just below the wax quickly.",
    "This makes a torch that can burn for 10 or more minutes."
  ],
  "tyn_section":[
    "Sturdy wooden matches (preferably the strike-anywhere sort)",
    "Candles, Paraffin Wax, Nail Polish or Turpentine.",
    "A saucepan or double boiler",
    "Tongs or fork to dip matches into wax",
    "Newspaper or other table covering",
    "Small glass tumbler.",
    "Fire extinguisher or fire rug.",
    "Life insurance."
  ],
  "tyn_model":[
    "turpentine",
    "matches",
    "match",
    "candle",
    "wax",
    "paraffin wax",
    "water",
    "newspaper",
    "nail polish",
    "clear nail polish",
    "double boiler",
    "twine or",
    "torch"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.125,
    "p":0.0769230769,
    "f1":0.0952380952
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}