{
  "title":"How to Make a Mini Desk Organizer",
  "url":"https://www.wikihow.com/Make-a-Mini-Desk-Organizer",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "parts":[
    {
      "name":"Preparing to Make Your Desk Organizer",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"You will need a variety of different materials to create your mini desk organizer. You can decorate your mini desk organizer however you want with decorative paper, ribbon, and beads, so think about how you want it to look before you get started. You will need:\na large piece of foam board (or a few smaller pieces)\ndecorative paper of your choice\ndecorative ribbon of your choice\neight beads of your choice\nfour birthday cake candle holders\nsharp scissors\nruler\nglue stick\nhot glue gun\nwhite school glue"
        },
        {
          "headline":"Download the parts diagram.",
          "description":"The parts diagram will give you an idea of how everything fits together before you get started. It also includes the measurements for each of the foam board pieces that you will need. You can download the parts diagram at: http://anadiycrafts.com/diagram-parts-mini-desk-organizer/"
        },
        {
          "headline":"Heat up your glue gun before you start.",
          "description":"Glue guns are more effective when they are fully heated, so plug in your glue gun at least 15 minutes before you start working. If the glue is not fully heated, then your organizer may not be as sturdy."
        },
        {
          "headline":"Cut out foam board pieces.",
          "description":"Before you cut out your foam board pieces, you will want to measure and mark each piece that you need to cut. Then, use your scissors to cut out the pieces. You will need to cut out:\ntwo 16.5 cm by 16.5 cm pieces\nsix 16.5 cm by 10 cm pieces\nfour 9.5 cm by 15 cm pieces\neight 2.5 cm by 15 cm pieces\neight 3 cm by 9.5 cm pieces"
        }
      ]
    },
    {
      "name":"Assembling the Drawers",
      "steps":[
        {
          "headline":"Glue on the sides of the drawer.",
          "description":"Get one of the 9.5 cm by 15 cm pieces. This will serve as the bottom of the drawer. Then, grab one of your 2.5 cm by 15 cm pieces. These pieces will serve as the sides of each drawer. Take one of these pieces and use white school glue to attach it to the 15 cm edge. The side piece should be secured onto the drawer bottom, not attached to its side. Do the same thing for the other side of the drawer. Let the pieces dry for about five minutes."
        },
        {
          "headline":"Secure the front and back of the drawer.",
          "description":"Next, take one of the 3 cm by 9.5 cm pieces and apply glue to the bottom and side edges of the widest part of the piece (not the long, skinny edge). Then, attach the piece over the long skinny edges of the drawer base and side pieces. Wait for the glue to dry for about five minutes. Do the same thing for the other 3 cm by 9.5 cm piece."
        },
        {
          "headline":"Repeat this process for the rest of the drawers.",
          "description":"After you have completed one drawer, you can move on to the next one. You will have four drawers total when you are done. Allow the drawers to dry while you work on the dresser."
        }
      ]
    },
    {
      "name":"Assembling the Dresser",
      "steps":[
        {
          "headline":"Mark the dresser side piece.",
          "description":"Take one of the 16.5 cm by 16.5 cm pieces. This is one of the sides of the dresser. You will need to mark this piece so that you know where to glue the shelves. Use your ruler and pencil to mark where each shelf will need to be placed. Leave exactly 3.6 centimeters between the shelves so that the drawers will fit well. Place the first shelf about two centimeters from the edge."
        },
        {
          "headline":"Glue the shelves in place.",
          "description":"Use the hot glue gun to apply glue to the long skinny edge of one side of a shelf (one of the 16.5 cm by 10 cm pieces). Then, press the edge of the shelf onto the dresser side. Repeat this process until you only have one 16.5 cm by 10 cm piece left. Do not glue the last 16.5 cm by 10 cm piece onto the dresser side. This last piece will be the back of your dresser."
        },
        {
          "headline":"Secure the other side.",
          "description":"Next, apply white school glue to the long, skinny edges of the shelf that you just secured onto the shelf side. Then, take your other 16.5 cm by 16.5 cm piece and press it into place over these shelves. Your dresser should now look like a tiny bookshelf without a back. Wait for five minutes before you attach the back. The white school glue needs to dry first."
        },
        {
          "headline":"Attach the back.",
          "description":"Next, apply white school glue to the long, skinny edges of the shelves and sides on one side of the dresser. Then apply the last 16.5 cm by 10 cm piece to this side. Make sure that the edges are all well-aligned and press on the piece for a couple of minutes to make sure that it is secured. Wait for at least five minutes before you do anything else with this piece."
        }
      ]
    },
    {
      "name":"Decorating the Dresser",
      "steps":[
        {
          "headline":"Get your decorative paper ready.",
          "description":"When you are ready to decorate, get your decorative paper and cut it so that it will fit the sides, back, and top of the dresser, as well as the front section of all four of your drawers. You will need:\ntwo 16.5 cm by 16.5 cm pieces\ntwo 16.5 cm by 10 cm pieces\nfour 3 cm by 9.5 cm pieces"
        },
        {
          "headline":"Decorate the dresser and drawers with decorative paper.",
          "description":"You can use your glue stick to apply glue to the edges of each part of the dresser that you are decorating. Only decorate one side at a time so that the glue will not dry before you have a chance to apply the paper. Gently press each piece of paper onto its corresponding piece. Apply the two 16.5 cm by 16.5 cm pieces to the sides. Apply the two 16.5 cm by 10 cm pieces to the top and back of the dresser\nApply the four 3 cm by 9.5 cm pieces to the fronts of the drawers."
        },
        {
          "headline":"Assemble drawer handles.",
          "description":"Take one of your birthday candle holders and apply a small dot of hot glue to the center of the holder. Then, take one of your beads and press it into the center of the holder. Repeat this for the other three candle holders. These will be your drawer handles."
        },
        {
          "headline":"Attach drawer handles.",
          "description":"Measure the front of each drawer to find the center. It should be 1.5 inches from the long edge and 4.5 inches from the short edge. Place a small pencil mark in the center of each drawer front to mark the center. Then, apply a small dab of hot glue onto this pencil mark and press the drawer handle into place."
        },
        {
          "headline":"Use ribbon to cover bare edges on the dresser.",
          "description":"After you have applied the decorative paper, there will still be several exposed long, skinny edges on your dresser that you will need to cover up with ribbon. Cut strips of ribbon to fit these edges and then use the hot glue gun to attach the ribbon."
        },
        {
          "headline":"Attach remaining four beads to bottom of dresser.",
          "description":"The remaining four beads that you have will serve as the feet of the dresser. Turn your dresser upside down and then apply a dab of hot glue to one of the four corners of the bottom of the dresser. Then, press one bead into the dab of glue to secure it. Repeat this process with the other three beads"
        },
        {
          "headline":"Insert the drawers.",
          "description":"Now that you have assembled and decorated the entire organizer, you can insert your drawers and use your new mini desk organizer on your desk.Fill your mini desk organizer with colored pencils, erasers, lip balm, or whatever else you like to keep handy at your desk."
        }
      ]
    }
  ],
  "text":" Preparing to Make Your Desk Organizer Gather your materials. You will need a variety of different materials to create your mini desk organizer. You can decorate your mini desk organizer however you want with decorative paper, ribbon, and beads, so think about how you want it to look before you get started. You will need:\na large piece of foam board (or a few smaller pieces)\ndecorative paper of your choice\ndecorative ribbon of your choice\neight beads of your choice\nfour birthday cake candle holders\nsharp scissors\nruler\nglue stick\nhot glue gun\nwhite school glue Download the parts diagram. The parts diagram will give you an idea of how everything fits together before you get started. It also includes the measurements for each of the foam board pieces that you will need. You can download the parts diagram at: http://anadiycrafts.com/diagram-parts-mini-desk-organizer/ Heat up your glue gun before you start. Glue guns are more effective when they are fully heated, so plug in your glue gun at least 15 minutes before you start working. If the glue is not fully heated, then your organizer may not be as sturdy. Cut out foam board pieces. Before you cut out your foam board pieces, you will want to measure and mark each piece that you need to cut. Then, use your scissors to cut out the pieces. You will need to cut out:\ntwo 16.5 cm by 16.5 cm pieces\nsix 16.5 cm by 10 cm pieces\nfour 9.5 cm by 15 cm pieces\neight 2.5 cm by 15 cm pieces\neight 3 cm by 9.5 cm pieces Assembling the Drawers Glue on the sides of the drawer. Get one of the 9.5 cm by 15 cm pieces. This will serve as the bottom of the drawer. Then, grab one of your 2.5 cm by 15 cm pieces. These pieces will serve as the sides of each drawer. Take one of these pieces and use white school glue to attach it to the 15 cm edge. The side piece should be secured onto the drawer bottom, not attached to its side. Do the same thing for the other side of the drawer. Let the pieces dry for about five minutes. Secure the front and back of the drawer. Next, take one of the 3 cm by 9.5 cm pieces and apply glue to the bottom and side edges of the widest part of the piece (not the long, skinny edge). Then, attach the piece over the long skinny edges of the drawer base and side pieces. Wait for the glue to dry for about five minutes. Do the same thing for the other 3 cm by 9.5 cm piece. Repeat this process for the rest of the drawers. After you have completed one drawer, you can move on to the next one. You will have four drawers total when you are done. Allow the drawers to dry while you work on the dresser. Assembling the Dresser Mark the dresser side piece. Take one of the 16.5 cm by 16.5 cm pieces. This is one of the sides of the dresser. You will need to mark this piece so that you know where to glue the shelves. Use your ruler and pencil to mark where each shelf will need to be placed. Leave exactly 3.6 centimeters between the shelves so that the drawers will fit well. Place the first shelf about two centimeters from the edge. Glue the shelves in place. Use the hot glue gun to apply glue to the long skinny edge of one side of a shelf (one of the 16.5 cm by 10 cm pieces). Then, press the edge of the shelf onto the dresser side. Repeat this process until you only have one 16.5 cm by 10 cm piece left. Do not glue the last 16.5 cm by 10 cm piece onto the dresser side. This last piece will be the back of your dresser. Secure the other side. Next, apply white school glue to the long, skinny edges of the shelf that you just secured onto the shelf side. Then, take your other 16.5 cm by 16.5 cm piece and press it into place over these shelves. Your dresser should now look like a tiny bookshelf without a back. Wait for five minutes before you attach the back. The white school glue needs to dry first. Attach the back. Next, apply white school glue to the long, skinny edges of the shelves and sides on one side of the dresser. Then apply the last 16.5 cm by 10 cm piece to this side. Make sure that the edges are all well-aligned and press on the piece for a couple of minutes to make sure that it is secured. Wait for at least five minutes before you do anything else with this piece. Decorating the Dresser Get your decorative paper ready. When you are ready to decorate, get your decorative paper and cut it so that it will fit the sides, back, and top of the dresser, as well as the front section of all four of your drawers. You will need:\ntwo 16.5 cm by 16.5 cm pieces\ntwo 16.5 cm by 10 cm pieces\nfour 3 cm by 9.5 cm pieces Decorate the dresser and drawers with decorative paper. You can use your glue stick to apply glue to the edges of each part of the dresser that you are decorating. Only decorate one side at a time so that the glue will not dry before you have a chance to apply the paper. Gently press each piece of paper onto its corresponding piece. Apply the two 16.5 cm by 16.5 cm pieces to the sides. Apply the two 16.5 cm by 10 cm pieces to the top and back of the dresser\nApply the four 3 cm by 9.5 cm pieces to the fronts of the drawers. Assemble drawer handles. Take one of your birthday candle holders and apply a small dot of hot glue to the center of the holder. Then, take one of your beads and press it into the center of the holder. Repeat this for the other three candle holders. These will be your drawer handles. Attach drawer handles. Measure the front of each drawer to find the center. It should be 1.5 inches from the long edge and 4.5 inches from the short edge. Place a small pencil mark in the center of each drawer front to mark the center. Then, apply a small dab of hot glue onto this pencil mark and press the drawer handle into place. Use ribbon to cover bare edges on the dresser. After you have applied the decorative paper, there will still be several exposed long, skinny edges on your dresser that you will need to cover up with ribbon. Cut strips of ribbon to fit these edges and then use the hot glue gun to attach the ribbon. Attach remaining four beads to bottom of dresser. The remaining four beads that you have will serve as the feet of the dresser. Turn your dresser upside down and then apply a dab of hot glue to one of the four corners of the bottom of the dresser. Then, press one bead into the dab of glue to secure it. Repeat this process with the other three beads Insert the drawers. Now that you have assembled and decorated the entire organizer, you can insert your drawers and use your new mini desk organizer on your desk.Fill your mini desk organizer with colored pencils, erasers, lip balm, or whatever else you like to keep handy at your desk.",
  "sentences":[
    " Preparing to Make Your Desk Organizer Gather your materials.",
    "You will need a variety of different materials to create your mini desk organizer.",
    "You can decorate your mini desk organizer however you want with decorative paper, ribbon, and beads, so think about how you want it to look before you get started.",
    "You will need:\na large piece of foam board (or a few smaller pieces)\ndecorative paper of your choice\ndecorative ribbon of your choice\neight beads of your choice\nfour birthday cake candle holders\nsharp scissors\nruler\nglue stick\nhot glue gun\nwhite school glue Download the parts diagram.",
    "The parts diagram will give you an idea of how everything fits together before you get started.",
    "It also includes the measurements for each of the foam board pieces that you will need.",
    "You can download the parts diagram at: http://anadiycrafts.com/diagram-parts-mini-desk-organizer/ Heat up your glue gun before you start.",
    "Glue guns are more effective when they are fully heated, so plug in your glue gun at least 15 minutes before you start working.",
    "If the glue is not fully heated, then your organizer may not be as sturdy.",
    "Cut out foam board pieces.",
    "Before you cut out your foam board pieces, you will want to measure and mark each piece that you need to cut.",
    "Then, use your scissors to cut out the pieces.",
    "You will need to cut out:\ntwo 16.5 cm by 16.5 cm pieces\nsix 16.5 cm by 10 cm pieces\nfour 9.5 cm by 15 cm pieces\neight 2.5 cm by 15 cm pieces\neight 3 cm by 9.5 cm pieces Assembling the Drawers Glue on the sides of the drawer.",
    "Get one of the 9.5 cm by 15 cm pieces.",
    "This will serve as the bottom of the drawer.",
    "Then, grab one of your 2.5 cm by 15 cm pieces.",
    "These pieces will serve as the sides of each drawer.",
    "Take one of these pieces and use white school glue to attach it to the 15 cm edge.",
    "The side piece should be secured onto the drawer bottom, not attached to its side.",
    "Do the same thing for the other side of the drawer.",
    "Let the pieces dry for about five minutes.",
    "Secure the front and back of the drawer.",
    "Next, take one of the 3 cm by 9.5 cm pieces and apply glue to the bottom and side edges of the widest part of the piece (not the long, skinny edge).",
    "Then, attach the piece over the long skinny edges of the drawer base and side pieces.",
    "Wait for the glue to dry for about five minutes.",
    "Do the same thing for the other 3 cm by 9.5 cm piece.",
    "Repeat this process for the rest of the drawers.",
    "After you have completed one drawer, you can move on to the next one.",
    "You will have four drawers total when you are done.",
    "Allow the drawers to dry while you work on the dresser.",
    "Assembling the Dresser Mark the dresser side piece.",
    "Take one of the 16.5 cm by 16.5 cm pieces.",
    "This is one of the sides of the dresser.",
    "You will need to mark this piece so that you know where to glue the shelves.",
    "Use your ruler and pencil to mark where each shelf will need to be placed.",
    "Leave exactly 3.6 centimeters between the shelves so that the drawers will fit well.",
    "Place the first shelf about two centimeters from the edge.",
    "Glue the shelves in place.",
    "Use the hot glue gun to apply glue to the long skinny edge of one side of a shelf (one of the 16.5 cm by 10 cm pieces).",
    "Then, press the edge of the shelf onto the dresser side.",
    "Repeat this process until you only have one 16.5 cm by 10 cm piece left.",
    "Do not glue the last 16.5 cm by 10 cm piece onto the dresser side.",
    "This last piece will be the back of your dresser.",
    "Secure the other side.",
    "Next, apply white school glue to the long, skinny edges of the shelf that you just secured onto the shelf side.",
    "Then, take your other 16.5 cm by 16.5 cm piece and press it into place over these shelves.",
    "Your dresser should now look like a tiny bookshelf without a back.",
    "Wait for five minutes before you attach the back.",
    "The white school glue needs to dry first.",
    "Attach the back.",
    "Next, apply white school glue to the long, skinny edges of the shelves and sides on one side of the dresser.",
    "Then apply the last 16.5 cm by 10 cm piece to this side.",
    "Make sure that the edges are all well-aligned and press on the piece for a couple of minutes to make sure that it is secured.",
    "Wait for at least five minutes before you do anything else with this piece.",
    "Decorating the Dresser Get your decorative paper ready.",
    "When you are ready to decorate, get your decorative paper and cut it so that it will fit the sides, back, and top of the dresser, as well as the front section of all four of your drawers.",
    "You will need:\ntwo 16.5 cm by 16.5 cm pieces\ntwo 16.5 cm by 10 cm pieces\nfour 3 cm by 9.5 cm pieces Decorate the dresser and drawers with decorative paper.",
    "You can use your glue stick to apply glue to the edges of each part of the dresser that you are decorating.",
    "Only decorate one side at a time so that the glue will not dry before you have a chance to apply the paper.",
    "Gently press each piece of paper onto its corresponding piece.",
    "Apply the two 16.5 cm by 16.5 cm pieces to the sides.",
    "Apply the two 16.5 cm by 10 cm pieces to the top and back of the dresser\nApply the four 3 cm by 9.5 cm pieces to the fronts of the drawers.",
    "Assemble drawer handles.",
    "Take one of your birthday candle holders and apply a small dot of hot glue to the center of the holder.",
    "Then, take one of your beads and press it into the center of the holder.",
    "Repeat this for the other three candle holders.",
    "These will be your drawer handles.",
    "Attach drawer handles.",
    "Measure the front of each drawer to find the center.",
    "It should be 1.5 inches from the long edge and 4.5 inches from the short edge.",
    "Place a small pencil mark in the center of each drawer front to mark the center.",
    "Then, apply a small dab of hot glue onto this pencil mark and press the drawer handle into place.",
    "Use ribbon to cover bare edges on the dresser.",
    "After you have applied the decorative paper, there will still be several exposed long, skinny edges on your dresser that you will need to cover up with ribbon.",
    "Cut strips of ribbon to fit these edges and then use the hot glue gun to attach the ribbon.",
    "Attach remaining four beads to bottom of dresser.",
    "The remaining four beads that you have will serve as the feet of the dresser.",
    "Turn your dresser upside down and then apply a dab of hot glue to one of the four corners of the bottom of the dresser.",
    "Then, press one bead into the dab of glue to secure it.",
    "Repeat this process with the other three beads Insert the drawers.",
    "Now that you have assembled and decorated the entire organizer, you can insert your drawers and use your new mini desk organizer on your desk.Fill your mini desk organizer with colored pencils, erasers, lip balm, or whatever else you like to keep handy at your desk."
  ],
  "tyn_section":[
    "a large piece of foam board (or a few smaller pieces)",
    "decorative paper of your choice",
    "decorative ribbon of your choice",
    "eight beads of your choice",
    "four birthday cake candle holders",
    "sharp scissors",
    "ruler",
    "glue stick",
    "hot glue gun",
    "white school glue"
  ],
  "tyn_model":[
    "glue",
    "decorative paper",
    "ribbon",
    "white school glue",
    "dresser",
    "foam board",
    "hot glue",
    "beads",
    "glue stick",
    "hot glue gun",
    "glue gun",
    "paper",
    "decorative ribbon",
    "sharp scissors",
    "scissors",
    "six",
    "four",
    "ruler",
    "pencil",
    "shelf",
    "drawer handles",
    "mini desk organizer",
    "colored pencils",
    "erasers",
    "lip balm"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.2,
    "f1":0.2857142857,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.36,
    "f1":0.4186046512
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7,
    "p":0.44,
    "f1":0.5403508772
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.28,
    "f1":0.358974359
  }
}