{
  "title":"How to Make Oven Fries",
  "url":"https://www.wikihow.com/Make-Oven-Fries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Fast Food"
  ],
  "methods":[
    {
      "name":"Making Basic Oven Fries",
      "steps":[
        {
          "headline":"Preheat your oven to 400°F (205°C) and coat a baking sheet with cooking spray.",
          "description":"For easy clean-up, consider covering the baking sheet with aluminum foil first, then spraying the foil with cooking spray."
        },
        {
          "headline":"Cut the potatoes into wedges.",
          "description":"Start by cutting the potatoes in half lengthwise, and then cutting each half into four wedges. You can choose to peel the potatoes first, or leave them unpeeled."
        },
        {
          "headline":"Combine the oil and seasonings together in a large mixing bowl.",
          "description":"Mix together the spices first, then add the oil, and stir everything together with a fork or small whisk. You will be adding the potato wedges into the bowl, so make sure that it is big enough."
        },
        {
          "headline":"Add the potatoes, then toss them until they are evenly coated.",
          "description":"A quick and simple way to do this would be to cover the bowl with a lid, and then shaking it a few times."
        },
        {
          "headline":"Spread the potatoes across the baking sheet in an even layer.",
          "description":"Make sure that the potato wedges are not clumped together, or they won't bake properly. If you want crispier wedges, make sure that they aren't touching; use a separate baking sheet, if necessary."
        },
        {
          "headline":"Bake the potatoes for 40 to 45 minutes.",
          "description":"After about 20 minutes or so, turn the wedges over using a spatula; this ensures that they bake evenly."
        },
        {
          "headline":"Use a spatula or a pair of tongs to serve the fries.",
          "description":"If you'd like, you can season them further with some fresh parsley and freshly grated Parmigiano-Reggiano."
        }
      ]
    },
    {
      "name":"Making Crispy Oven Fries",
      "steps":[
        {
          "headline":"Preheat your oven to 450°F (233°C) and generously grease a baking sheet with cooking spray.",
          "description":"For easier clean-up, cover the baking sheets with aluminum foil first, then coat the foil with cooking spray."
        },
        {
          "headline":"Cut the potatoes into ¼-inch (0.64-centimeter) thick matchsticks.",
          "description":"You can do this by cutting the potatoes in half lengthwise, in half again, and then into wedges, and finally into thin strips. The matchstick shape is important. Combined with the high baking temperature, it is what will give you nice, crispy fries. You can leave the potatoes unpeeled, or you can peel them first."
        },
        {
          "headline":"Mix together the oil and salt in a large mixing bowl.",
          "description":"Consider adding other seasonings, such as pepper, garlic powder, and fresh, chopped rosemary. You will be tossing the potatoes in this, so make sure that the bowl is big enough."
        },
        {
          "headline":"Toss the potatoes with the oil and salt.",
          "description":"An easy way to do this would be to cover the bowl with a tight-fitting lid, and then shaking it."
        },
        {
          "headline":"Spread the potatoes out in an even layer on the greased baking sheet.",
          "description":"Make sure that the fries aren't clumped together or touching. Use another baking sheet, if necessary. If the fries are clumped together, they won't turn out very crispy."
        },
        {
          "headline":"Bake the fries for 25 to 35 minutes.",
          "description":"The longer you bake them for, the crispier they will become. About halfway through the baking time, toss the fries with a spatula or a pair of tongs. This ensures even baking. To make garlic fries: During the last 10 minutes of baking, sauté 3 cloves of garlic in 1 to 2 tablespoons of olive oil until it turns brown, then set it aside."
        },
        {
          "headline":"Season the fries, if desired, then serve them immediately.",
          "description":"Use a spatula to transfer the fries from the baking sheet to your serving dish. If you are making garlic fries: season the fries with sea salt, then drizzle the sautéed garlic over them."
        }
      ]
    }
  ],
  "text":" Making Basic Oven Fries Preheat your oven to 400°F (205°C) and coat a baking sheet with cooking spray. For easy clean-up, consider covering the baking sheet with aluminum foil first, then spraying the foil with cooking spray. Cut the potatoes into wedges. Start by cutting the potatoes in half lengthwise, and then cutting each half into four wedges. You can choose to peel the potatoes first, or leave them unpeeled. Combine the oil and seasonings together in a large mixing bowl. Mix together the spices first, then add the oil, and stir everything together with a fork or small whisk. You will be adding the potato wedges into the bowl, so make sure that it is big enough. Add the potatoes, then toss them until they are evenly coated. A quick and simple way to do this would be to cover the bowl with a lid, and then shaking it a few times. Spread the potatoes across the baking sheet in an even layer. Make sure that the potato wedges are not clumped together, or they won't bake properly. If you want crispier wedges, make sure that they aren't touching; use a separate baking sheet, if necessary. Bake the potatoes for 40 to 45 minutes. After about 20 minutes or so, turn the wedges over using a spatula; this ensures that they bake evenly. Use a spatula or a pair of tongs to serve the fries. If you'd like, you can season them further with some fresh parsley and freshly grated Parmigiano-Reggiano. Making Crispy Oven Fries Preheat your oven to 450°F (233°C) and generously grease a baking sheet with cooking spray. For easier clean-up, cover the baking sheets with aluminum foil first, then coat the foil with cooking spray. Cut the potatoes into ¼-inch (0.64-centimeter) thick matchsticks. You can do this by cutting the potatoes in half lengthwise, in half again, and then into wedges, and finally into thin strips. The matchstick shape is important. Combined with the high baking temperature, it is what will give you nice, crispy fries. You can leave the potatoes unpeeled, or you can peel them first. Mix together the oil and salt in a large mixing bowl. Consider adding other seasonings, such as pepper, garlic powder, and fresh, chopped rosemary. You will be tossing the potatoes in this, so make sure that the bowl is big enough. Toss the potatoes with the oil and salt. An easy way to do this would be to cover the bowl with a tight-fitting lid, and then shaking it. Spread the potatoes out in an even layer on the greased baking sheet. Make sure that the fries aren't clumped together or touching. Use another baking sheet, if necessary. If the fries are clumped together, they won't turn out very crispy. Bake the fries for 25 to 35 minutes. The longer you bake them for, the crispier they will become. About halfway through the baking time, toss the fries with a spatula or a pair of tongs. This ensures even baking. To make garlic fries: During the last 10 minutes of baking, sauté 3 cloves of garlic in 1 to 2 tablespoons of olive oil until it turns brown, then set it aside. Season the fries, if desired, then serve them immediately. Use a spatula to transfer the fries from the baking sheet to your serving dish. If you are making garlic fries: season the fries with sea salt, then drizzle the sautéed garlic over them.",
  "sentences":[
    " Making Basic Oven Fries Preheat your oven to 400°F (205°C) and coat a baking sheet with cooking spray.",
    "For easy clean-up, consider covering the baking sheet with aluminum foil first, then spraying the foil with cooking spray.",
    "Cut the potatoes into wedges.",
    "Start by cutting the potatoes in half lengthwise, and then cutting each half into four wedges.",
    "You can choose to peel the potatoes first, or leave them unpeeled.",
    "Combine the oil and seasonings together in a large mixing bowl.",
    "Mix together the spices first, then add the oil, and stir everything together with a fork or small whisk.",
    "You will be adding the potato wedges into the bowl, so make sure that it is big enough.",
    "Add the potatoes, then toss them until they are evenly coated.",
    "A quick and simple way to do this would be to cover the bowl with a lid, and then shaking it a few times.",
    "Spread the potatoes across the baking sheet in an even layer.",
    "Make sure that the potato wedges are not clumped together, or they won't bake properly.",
    "If you want crispier wedges, make sure that they aren't touching; use a separate baking sheet, if necessary.",
    "Bake the potatoes for 40 to 45 minutes.",
    "After about 20 minutes or so, turn the wedges over using a spatula; this ensures that they bake evenly.",
    "Use a spatula or a pair of tongs to serve the fries.",
    "If you'd like, you can season them further with some fresh parsley and freshly grated Parmigiano-Reggiano.",
    "Making Crispy Oven Fries Preheat your oven to 450°F (233°C) and generously grease a baking sheet with cooking spray.",
    "For easier clean-up, cover the baking sheets with aluminum foil first, then coat the foil with cooking spray.",
    "Cut the potatoes into ¼-inch (0.64-centimeter) thick matchsticks.",
    "You can do this by cutting the potatoes in half lengthwise, in half again, and then into wedges, and finally into thin strips.",
    "The matchstick shape is important.",
    "Combined with the high baking temperature, it is what will give you nice, crispy fries.",
    "You can leave the potatoes unpeeled, or you can peel them first.",
    "Mix together the oil and salt in a large mixing bowl.",
    "Consider adding other seasonings, such as pepper, garlic powder, and fresh, chopped rosemary.",
    "You will be tossing the potatoes in this, so make sure that the bowl is big enough.",
    "Toss the potatoes with the oil and salt.",
    "An easy way to do this would be to cover the bowl with a tight-fitting lid, and then shaking it.",
    "Spread the potatoes out in an even layer on the greased baking sheet.",
    "Make sure that the fries aren't clumped together or touching.",
    "Use another baking sheet, if necessary.",
    "If the fries are clumped together, they won't turn out very crispy.",
    "Bake the fries for 25 to 35 minutes.",
    "The longer you bake them for, the crispier they will become.",
    "About halfway through the baking time, toss the fries with a spatula or a pair of tongs.",
    "This ensures even baking.",
    "To make garlic fries: During the last 10 minutes of baking, sauté 3 cloves of garlic in 1 to 2 tablespoons of olive oil until it turns brown, then set it aside.",
    "Season the fries, if desired, then serve them immediately.",
    "Use a spatula to transfer the fries from the baking sheet to your serving dish.",
    "If you are making garlic fries: season the fries with sea salt, then drizzle the sautéed garlic over them."
  ],
  "tyn_section":[
    "Oven",
    "Baking sheet(s)",
    "Aluminum foil (optional)",
    "Cooking spray",
    "Mixing bowl",
    "Spatula"
  ],
  "tyn_model":[
    "potatoes",
    "baking sheet",
    "cooking spray",
    "oil",
    "bowl",
    "spatula",
    "oven",
    "aluminum foil",
    "potato",
    "salt",
    "garlic fries",
    "garlic",
    "oven fries",
    "seasonings",
    "mixing bowl",
    "spices",
    "fork",
    "small whisk",
    "parsley",
    "baking sheets",
    "foil",
    "large mixing bowl",
    "pepper",
    "garlic powder",
    "rosemary",
    "olive oil",
    "sea salt"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1481481481,
    "f1":0.2424242424,
    "avg_pos":0.2222222222
  },
  "jacc_metrics_0.5":{
    "r":0.8333333333,
    "p":0.2962962963,
    "f1":0.4371584699
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.4074074074,
    "f1":0.5789473684
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8333333333,
    "p":0.2222222222,
    "f1":0.350877193
  }
}