{
  "title":"How to Teach a Dog How to Catch a Frisbee",
  "url":"https://www.wikihow.com/Teach-a-Dog-How-to-Catch-a-Frisbee",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Flying Discs and Frisbees"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Buy a minimum of 2 *dog* discs.",
          "description":"Human discs (\"frisbees\") can injure your dog. Look for the brands Hyperflite, Hero or Aerobie. These discs are specially designed to reduce risk of injuring your dog. There are discs for destructive dogs (the Hyperflite Jawz) and soft floppy discs as well (the Aerobie Dogobie). The Flippy Flopper is a soft fabric disc available at most pet stores. The Kong Flyer is also a good choice."
        },
        {
          "headline":"Get your dog to get excited about the disc by associating it with very positive things.",
          "description":"For example:\nUse the disc as a feeding dish for a week. Rub hot dog on the disc and praise your dog for going after it. Play tug gently with the disc. Always let your dog win. Don't rip the disc out of your dog's mouth. Reward any behavior that shows \"drive\" to get the disc. This means that even if your dog jumps up and grabs the disc out of your hand without waiting for you to offer it to her, this is positive! Never tell your dog to 'DROP' the disc. Always use a second disc to entice your dog to drop the one in his mouth, on his own. Remember, always encourage your dog's drive to have and get the disc."
        },
        {
          "headline":"Throw \"rollers\".",
          "description":"Instead of throwing the disc in the air, throw it so that the disc rolls on the ground like a wheel. This helps your dog transition from fetching a ball to retrieving a disc. Dogs love to chase discs this way. It helps them learn to \"target\" the disc and pick it up."
        },
        {
          "headline":"Throw the disc in the air and alternate with rollers.",
          "description":"Begin with short, slow throws, and be very careful to avoid hitting your dog with the disc. In the beginning, your dog will likely let the disc hit the ground before retrieving it. It may take 100 or more throws before your dog grabs it out of the air for the first time. Be patient!"
        },
        {
          "headline":"Encourage your dog's drive to get the disc.",
          "description":"Eventually your dog will get used to the flying disc, learn how to track it in the air, and eventually will want the disc so badly (\"DRIVE!\") that she won't want to wait for it to drop to the ground and will instead grab it out of the air. This is the moment you've been waiting for! Congratulations, you now have a Disc Dog!"
        },
        {
          "headline":"Prepare to be amazed.",
          "description":""
        }
      ]
    },
    {
      "name":"Young Dogs",
      "steps":[
        {
          "headline":"Teach grabbing.",
          "description":"Bend over slightly and hold frisbee in your hand, horizontal to the ground, at the height of the dog's mouth. Then let him grab it with his mouth while you are still holding on to it. Say \"drop it\" then take the frisbee from his mouth immediately. Now praise the dog graciously by saying \"good boy (girl) and repeat the process again a few more times."
        },
        {
          "headline":"Teach running and grabbing.",
          "description":"Now do the exact same exercise, only move your body in a circle away from the dog, keeping it at the height of the dog's mouth. As the puppy grows, you will be able to stand up while doing this exercise."
        },
        {
          "headline":"Teach jumping and grabbing.",
          "description":"Now that you are standing up, hold the frisbee a little higher than the dog's mouth and horizontal to the ground, so he has to jump up to grab it. After a while, release the frisbee right before your dog jumps up to grab it. Try turning in a circle with this exercise as well."
        },
        {
          "headline":"Advance to the steps above for older dogs.",
          "description":"If you are training a young pup, you may need to repeat all the above many times before it is ready to chase the frisbee."
        }
      ]
    }
  ],
  "text":" Steps Buy a minimum of 2 *dog* discs. Human discs (\"frisbees\") can injure your dog. Look for the brands Hyperflite, Hero or Aerobie. These discs are specially designed to reduce risk of injuring your dog. There are discs for destructive dogs (the Hyperflite Jawz) and soft floppy discs as well (the Aerobie Dogobie). The Flippy Flopper is a soft fabric disc available at most pet stores. The Kong Flyer is also a good choice. Get your dog to get excited about the disc by associating it with very positive things. For example:\nUse the disc as a feeding dish for a week. Rub hot dog on the disc and praise your dog for going after it. Play tug gently with the disc. Always let your dog win. Don't rip the disc out of your dog's mouth. Reward any behavior that shows \"drive\" to get the disc. This means that even if your dog jumps up and grabs the disc out of your hand without waiting for you to offer it to her, this is positive! Never tell your dog to 'DROP' the disc. Always use a second disc to entice your dog to drop the one in his mouth, on his own. Remember, always encourage your dog's drive to have and get the disc. Throw \"rollers\". Instead of throwing the disc in the air, throw it so that the disc rolls on the ground like a wheel. This helps your dog transition from fetching a ball to retrieving a disc. Dogs love to chase discs this way. It helps them learn to \"target\" the disc and pick it up. Throw the disc in the air and alternate with rollers. Begin with short, slow throws, and be very careful to avoid hitting your dog with the disc. In the beginning, your dog will likely let the disc hit the ground before retrieving it. It may take 100 or more throws before your dog grabs it out of the air for the first time. Be patient! Encourage your dog's drive to get the disc. Eventually your dog will get used to the flying disc, learn how to track it in the air, and eventually will want the disc so badly (\"DRIVE!\") that she won't want to wait for it to drop to the ground and will instead grab it out of the air. This is the moment you've been waiting for! Congratulations, you now have a Disc Dog! Prepare to be amazed.  Young Dogs Teach grabbing. Bend over slightly and hold frisbee in your hand, horizontal to the ground, at the height of the dog's mouth. Then let him grab it with his mouth while you are still holding on to it. Say \"drop it\" then take the frisbee from his mouth immediately. Now praise the dog graciously by saying \"good boy (girl) and repeat the process again a few more times. Teach running and grabbing. Now do the exact same exercise, only move your body in a circle away from the dog, keeping it at the height of the dog's mouth. As the puppy grows, you will be able to stand up while doing this exercise. Teach jumping and grabbing. Now that you are standing up, hold the frisbee a little higher than the dog's mouth and horizontal to the ground, so he has to jump up to grab it. After a while, release the frisbee right before your dog jumps up to grab it. Try turning in a circle with this exercise as well. Advance to the steps above for older dogs. If you are training a young pup, you may need to repeat all the above many times before it is ready to chase the frisbee.",
  "sentences":[
    " Steps Buy a minimum of 2 *dog* discs.",
    "Human discs (\"frisbees\") can injure your dog.",
    "Look for the brands Hyperflite, Hero or Aerobie.",
    "These discs are specially designed to reduce risk of injuring your dog.",
    "There are discs for destructive dogs (the Hyperflite Jawz) and soft floppy discs as well (the Aerobie Dogobie).",
    "The Flippy Flopper is a soft fabric disc available at most pet stores.",
    "The Kong Flyer is also a good choice.",
    "Get your dog to get excited about the disc by associating it with very positive things.",
    "For example:\nUse the disc as a feeding dish for a week.",
    "Rub hot dog on the disc and praise your dog for going after it.",
    "Play tug gently with the disc.",
    "Always let your dog win.",
    "Don't rip the disc out of your dog's mouth.",
    "Reward any behavior that shows \"drive\" to get the disc.",
    "This means that even if your dog jumps up and grabs the disc out of your hand without waiting for you to offer it to her, this is positive!",
    "Never tell your dog to 'DROP' the disc.",
    "Always use a second disc to entice your dog to drop the one in his mouth, on his own.",
    "Remember, always encourage your dog's drive to have and get the disc.",
    "Throw \"rollers\".",
    "Instead of throwing the disc in the air, throw it so that the disc rolls on the ground like a wheel.",
    "This helps your dog transition from fetching a ball to retrieving a disc.",
    "Dogs love to chase discs this way.",
    "It helps them learn to \"target\" the disc and pick it up.",
    "Throw the disc in the air and alternate with rollers.",
    "Begin with short, slow throws, and be very careful to avoid hitting your dog with the disc.",
    "In the beginning, your dog will likely let the disc hit the ground before retrieving it.",
    "It may take 100 or more throws before your dog grabs it out of the air for the first time.",
    "Be patient!",
    "Encourage your dog's drive to get the disc.",
    "Eventually your dog will get used to the flying disc, learn how to track it in the air, and eventually will want the disc so badly (\"DRIVE!\")",
    "that she won't want to wait for it to drop to the ground and will instead grab it out of the air.",
    "This is the moment you've been waiting for!",
    "Congratulations, you now have a Disc Dog!",
    "Prepare to be amazed.",
    "Young Dogs Teach grabbing.",
    "Bend over slightly and hold frisbee in your hand, horizontal to the ground, at the height of the dog's mouth.",
    "Then let him grab it with his mouth while you are still holding on to it.",
    "Say \"drop it\" then take the frisbee from his mouth immediately.",
    "Now praise the dog graciously by saying \"good boy (girl) and repeat the process again a few more times.",
    "Teach running and grabbing.",
    "Now do the exact same exercise, only move your body in a circle away from the dog, keeping it at the height of the dog's mouth.",
    "As the puppy grows, you will be able to stand up while doing this exercise.",
    "Teach jumping and grabbing.",
    "Now that you are standing up, hold the frisbee a little higher than the dog's mouth and horizontal to the ground, so he has to jump up to grab it.",
    "After a while, release the frisbee right before your dog jumps up to grab it.",
    "Try turning in a circle with this exercise as well.",
    "Advance to the steps above for older dogs.",
    "If you are training a young pup, you may need to repeat all the above many times before it is ready to chase the frisbee."
  ],
  "tyn_section":[
    "1 - 5 discs"
  ],
  "tyn_model":[
    "frisbee",
    "discs",
    "disc",
    "flippy flopper",
    "hot dog",
    "rollers",
    "disc dog"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}