{
  "title":"How to Have a Build a Bear School",
  "url":"https://www.wikihow.com/Have-a-Build-a-Bear-School",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Traditional Toys",
    "Teddy Bears",
    "Build a Bear"
  ],
  "parts":[
    {
      "name":"Setting Up Your School",
      "steps":[
        {
          "headline":"Clear an area in your room or closet.",
          "description":"This will be the area you use for your school. Make sure it's large enough for all the Build-A-Bears you'll be enrolling!"
        },
        {
          "headline":"Gather necessary school supplies.",
          "description":"Choose items like rulers, pencils, pens, paper, folders, and binders. And choose other items you think would be good for school."
        },
        {
          "headline":"Make desks.",
          "description":"These can be made of small boxes, such as shoe, tissue, or food boxes. Cover them with fabric or paper to make them nicer and more uniform. Plain brown paper works well. For seats, use small boxes or large good containers."
        },
        {
          "headline":"Attach name tags to the desk of each bear.",
          "description":"That way, you don't have moments where you're like, \"Where did this bear sit?\""
        },
        {
          "headline":"Plan the bears' lessons and subjects.",
          "description":"Plan everything out and make a schedule. If you have a friend over or a willing sibling, they could be a teacher's assistant or principal."
        }
      ]
    },
    {
      "name":"Running the School",
      "steps":[
        {
          "headline":"Host an assembly.",
          "description":"Tell your bear students everything they should know about the school and what they'll be learning."
        },
        {
          "headline":"Get the bears ready for their first lesson.",
          "description":""
        },
        {
          "headline":"Learn their names and do roll-call.",
          "description":"If you do this, you won't confuse the bears and will know who's absent."
        },
        {
          "headline":"Teach them the basics:  handwriting, English, mathematics, science, and social studies.",
          "description":"Don't just write everything for them, grab their paw and help them. Feel free to include other subjects such as art, P.E., music, history, foreign languages, etc. You could even teach fashion with Build-a-Bear clothes!"
        },
        {
          "headline":"Give your furry friends playtime and lunch.",
          "description":"Let them have toilet breaks when they need."
        },
        {
          "headline":"Don't be strict.",
          "description":"If the bears are naughty, stand them in the corner of the room for about 10 minutes so that they learn from their mistakes. Remember to reward them when they are good! Be a nice teacher. Never become physically abusive."
        },
        {
          "headline":"Set some homework.",
          "description":"When you have been running your school for quite some time, and your pupils are more capable of learning, give them reading books and homework. You can even have them sit exams and award them certificates that you've made."
        },
        {
          "headline":"Keep on making plans when you can.",
          "description":"If you have a sibling or friend helping it may be easier to do so."
        },
        {
          "headline":"Keep recapping what your bears have learned with them so they don't forget.",
          "description":"And don't teach them the same thing as they may become bored."
        }
      ]
    }
  ],
  "text":" Setting Up Your School Clear an area in your room or closet. This will be the area you use for your school. Make sure it's large enough for all the Build-A-Bears you'll be enrolling! Gather necessary school supplies. Choose items like rulers, pencils, pens, paper, folders, and binders. And choose other items you think would be good for school. Make desks. These can be made of small boxes, such as shoe, tissue, or food boxes. Cover them with fabric or paper to make them nicer and more uniform. Plain brown paper works well. For seats, use small boxes or large good containers. Attach name tags to the desk of each bear. That way, you don't have moments where you're like, \"Where did this bear sit?\" Plan the bears' lessons and subjects. Plan everything out and make a schedule. If you have a friend over or a willing sibling, they could be a teacher's assistant or principal. Running the School Host an assembly. Tell your bear students everything they should know about the school and what they'll be learning. Get the bears ready for their first lesson.  Learn their names and do roll-call. If you do this, you won't confuse the bears and will know who's absent. Teach them the basics:  handwriting, English, mathematics, science, and social studies. Don't just write everything for them, grab their paw and help them. Feel free to include other subjects such as art, P.E., music, history, foreign languages, etc. You could even teach fashion with Build-a-Bear clothes! Give your furry friends playtime and lunch. Let them have toilet breaks when they need. Don't be strict. If the bears are naughty, stand them in the corner of the room for about 10 minutes so that they learn from their mistakes. Remember to reward them when they are good! Be a nice teacher. Never become physically abusive. Set some homework. When you have been running your school for quite some time, and your pupils are more capable of learning, give them reading books and homework. You can even have them sit exams and award them certificates that you've made. Keep on making plans when you can. If you have a sibling or friend helping it may be easier to do so. Keep recapping what your bears have learned with them so they don't forget. And don't teach them the same thing as they may become bored.",
  "sentences":[
    " Setting Up Your School Clear an area in your room or closet.",
    "This will be the area you use for your school.",
    "Make sure it's large enough for all the Build-A-Bears you'll be enrolling!",
    "Gather necessary school supplies.",
    "Choose items like rulers, pencils, pens, paper, folders, and binders.",
    "And choose other items you think would be good for school.",
    "Make desks.",
    "These can be made of small boxes, such as shoe, tissue, or food boxes.",
    "Cover them with fabric or paper to make them nicer and more uniform.",
    "Plain brown paper works well.",
    "For seats, use small boxes or large good containers.",
    "Attach name tags to the desk of each bear.",
    "That way, you don't have moments where you're like, \"Where did this bear sit?\"",
    "Plan the bears' lessons and subjects.",
    "Plan everything out and make a schedule.",
    "If you have a friend over or a willing sibling, they could be a teacher's assistant or principal.",
    "Running the School Host an assembly.",
    "Tell your bear students everything they should know about the school and what they'll be learning.",
    "Get the bears ready for their first lesson.",
    "Learn their names and do roll-call.",
    "If you do this, you won't confuse the bears and will know who's absent.",
    "Teach them the basics:  handwriting, English, mathematics, science, and social studies.",
    "Don't just write everything for them, grab their paw and help them.",
    "Feel free to include other subjects such as art, P.E., music, history, foreign languages, etc.",
    "You could even teach fashion with Build-a-Bear clothes!",
    "Give your furry friends playtime and lunch.",
    "Let them have toilet breaks when they need.",
    "Don't be strict.",
    "If the bears are naughty, stand them in the corner of the room for about 10 minutes so that they learn from their mistakes.",
    "Remember to reward them when they are good!",
    "Be a nice teacher.",
    "Never become physically abusive.",
    "Set some homework.",
    "When you have been running your school for quite some time, and your pupils are more capable of learning, give them reading books and homework.",
    "You can even have them sit exams and award them certificates that you've made.",
    "Keep on making plans when you can.",
    "If you have a sibling or friend helping it may be easier to do so.",
    "Keep recapping what your bears have learned with them so they don't forget.",
    "And don't teach them the same thing as they may become bored."
  ],
  "tyn_section":[
    "Your Build-A-Bears",
    "Spare area you can use for your school",
    "Cardboard boxes or any other box",
    "Fabric or decorative paper to cover the boxes",
    "School supplies for the bear",
    "Glue",
    "Scissors"
  ],
  "tyn_model":[
    "bears",
    "rulers",
    "pencils",
    "pens",
    "paper",
    "folders",
    "binders",
    "desks",
    "fabric",
    "mathematics",
    "social studies"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}