{
  "title":"How to Make Homemade Soup",
  "url":"https://www.wikihow.com/Make-Homemade-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Soups"
  ],
  "methods":[
    {
      "name":"Making A Clear Soup",
      "steps":[
        {
          "headline":"Plan out your soup.",
          "description":"If you don't have any experience making homemade soups before, clear soups are recommended as a way to learn the ropes, as they offer more room for simplicity. Before getting started, you'll need to figure out what kind of soup you're looking to make. Is it a hearty vegetable soup? A mineral-rich bone broth? Having a good idea of where to go early on will take the stress and guesswork out of the process later on."
        },
        {
          "headline":"Gather your ingredients.",
          "description":"While this is by no means an exhaustive list of recommended ingredients to have in your homemade soup, it's a good place to start. Potatoes, peas, kidney beans and carrots are great if you're looking to make a hearty broth. Other vegetables like roughly chopped celery, tomatoes and corn can give the soup a richer taste. Aromatics like onions and garlic are highly recommended for their flavour. The smaller you cut them, the more their flavour will inform the rest of the broth. Noodles are great in soups (for instance, chicken noodle soup) as they tend to embody the flavour of the stock. They're an especially effective addition to a soup that's otherwise lacking in solid substance. If you choose to have meat in your soup, make sure it is pre-cooked, and kept in small enough pieces. You'll also want to make sure the type of meat complements your soup stock. If you're using beans, make sure to have them pre-soaked in water. This will ensure they cook more evenly alongside the other ingredients."
        },
        {
          "headline":"Prepare a soup stock.",
          "description":"There are multiple ways to do this. Though it depends on the type of soup you would like to make, one recommended method is to make a stock by simmering soup bones in a pot of water overnight. This will extract the minerals and flavour from the bones, giving your soup a hearty and nutritious base to start with. Chicken and beef bones are standard choices for soups, though different bones will each yield their own individual tastes. For a vegetarian alternative, adding finely chopped vegetables to a pot of water and letting it simmer will make a fine vegetable stock for your soup. If you're thrifty, you can use the small, unused remains of past veggie recipes to make the stock. Adding these to cold water and proceeding to simmer will ensure all each vegetable's flavour has a chance to be released. Some dieticians recommend simmering bones for as long as 12-48 hours. This longer process reportedly \"breaks the bones down, releases nutrients and minerals, and makes nutrient-rich collagen, gelatin, and glucosamine easier to digest.\" Oxtail may also be used as a good alternative to bones. If you don't have bones or meat to take it from, you can try asking your local butcher for spare bones to fuel your soup stock. If you want to skip this step, you can purchase a prefabricated bouillon at your local grocery store."
        },
        {
          "headline":"Add desired spices to your stock while it simmers.",
          "description":"Again, there are a number of ways you can effectively spice up a soup. A tablespoon of sea salt, a teaspoon of peppercorns, and a bunch of parsley are all versatile ways to add zest to a half-pot of soup. Try adding one or two chicken feet to the broth while it simmers. It may not sound appealing, but a chicken foot will add a gelatinous texture to the soup that some may find enjoyable."
        },
        {
          "headline":"Start adding your ingredients once the stock has simmered sufficiently.",
          "description":"If you made the stock with soup bones, remove them with a ladle. Cut up your vegetables if you haven't done so already. If you're using the recommended ingredients, the potatoes and carrots should be cut into small enough chunks that they'll be able to get consistently soft inside the soup. Add the ingredients in descending order from largest to smallest (e.g: beginning with potato chunks and meat, slowly working to peas and corn.) Working by this process will ideally give all of your ingredients an opportunity to cook relatively evenly."
        },
        {
          "headline":"Let simmer for at least half an hour, or until the largest vegetables have gone soft.",
          "description":"Stir regularly for optimal consistency. Taste the broth periodically during the cooking process. If you think something is missing, adding a dose of salt and pepper is an easy way to liven up a soup."
        },
        {
          "headline":"Serve and enjoy!",
          "description":"Distribute your soup into bowls with a ladle. Making a homemade soup can be a lengthy ordeal when you take overnight stock simmering into consideration, but with a little luck and effort, you'll find homemade soup can be one of the most satisfying dishes available."
        },
        {
          "headline":"Store excess portions in the freezer.",
          "description":"Clear soups are one of the most freezer-friendly dishes around! Put whatever you won't be eating in the next 1-2 days in the freezer, and the soup will stay fresh for a long time."
        }
      ]
    },
    {
      "name":"Making A Thick Soup",
      "steps":[
        {
          "headline":"Figure out what kind of thick soup you want to make.",
          "description":"A purée, a blended vegetable paste, is the most common form of thick soup. Most often, a thick soup is defined by its thickening agent (I.E: cream) as much as its dominant ingredients. If this is your first time making a thick soup, you may want to stick with making a simple purée; if you're feeling more daring, a cream-based soup can be one of the most delicious things you can make from home. Although the possible choice of ingredients is just as varied as with the clear soup, keep in mind that the base of a thick soup won't complement every ingredient. If you're unsure where or how to start with planning your soup, try looking up a few good specific recipes online. Cream of mushroom soup is a well-loved standard, for instance!"
        },
        {
          "headline":"Purée ingredients for your soup's base.",
          "description":"In the vast majority of cases, you'll achieve the base of your thick soup by puréeing vegetables. Boil the vegetables you want to make your base with. Then, using a food processor or immersion blender, purée your chosen base vegetables until they make a fine paste. Adding this paste to simmering water and stir until the purée is fully mixed. Although the ratio will vary depending on the desired thickness of your soup, using 1 pound of vegetables per 4 cups of water is a good place to start. You can make a meat base by finely chopping or puréeing cooked meat, like chicken. This will yield a much different direction for the soup, and you may find a meat base carries flavour more easily than its vegetarian counterpart. As an alternative measure, you can go without puréeing anything, instead relying on the thickening agent (which you'll add later!) for the soup's texture. A homemade or store-bought meat or veggie stock works in this occasion, although certain ingredients (like mushrooms) make for wonderful cream soups without being puréed."
        },
        {
          "headline":"Introduce your desired veggies and aromatics.",
          "description":"As with the clear soup, you'll want to give extra time to the larger ingredients you'll be adding to the soup, for the sake of letting everything cook evenly. You'll find aromatics like onions and garlic are particularly useful when it comes to making a thick or cream-based soup."
        },
        {
          "headline":"Add a  thickening agent.",
          "description":"This is the decisive part of making a thick soup. How you decide to thicken the soup will have just as much of an impact as the central ingredients you've decided to put in it. There are several ways to do this:\nWith a roux. A roux is an equal mixture of flour and fat (like butter) that may be used to thicken your soup. Mix both into a saucepan on medium heat and stir until the melted butter has enveloped the flour. Adding this to your soup is the best option if you want a thick soup, but don't want it cream-based. Butter may also be replaced with cooking oil or grease. With starch, like grated raw potato. Use a grater to grate shreds of potato directly into the simmering soup. 5-10 minutes should be enough to produce the consistency you're looking for. With cream or milk. Cream is the essential element in cream-based soups. To make sure the milk doesn't curdle, warm it up in the microwave beforehand. Add your milk or cream to A 1/2 cup of cream should suffice for a quart of soup; up to a full cup of milk will sate a similar effect. If you decide to make a cream-based soup, do not add the cream until just prior to the soup being consumed. With egg yolk. 1 egg yolk per cup of soup should be enough. Beat the egg yolk until it's a mixture. Don't add the egg directly to the liquid; instead, add some of the soup to help warm up the beaten egg mixture before joining it in with the pot. This will ensure the egg yolk mixes properly with the soup. With flour. Although vegetable soups may not stand up to flour, you'll find adding a couple tablespoons of flour will thicken a rich meat soup effectively."
        },
        {
          "headline":"Let simmer for an hour.",
          "description":"Stir the soup regularly, to make sure the flavours disperse evenly. You may also find it helpful to periodically taste test the soup. If the taste isn't to your liking, adding salt and pepper helps in a dash to improve a soup's flavour. Other seasonings (like parsley and peppercorn) go a long way towards improving a dish."
        },
        {
          "headline":"Complete your recipe with a garnish.",
          "description":"A garnish may include anything that livens up, or decorates your soup. This is the step that can elevate your homemade soup to restaurant status! A garnish may even be added simply for visual flair. As with the other ingredients in a homemade soup, you are completely free to experiment with whatever you think would give your homegrown recipe some added personality. Here are some examples:\nA slice of bread or tortilla is a fun and practical addition; the bread will absorb the flavour of your soup and give you something more solid to munch on. A thin meat like prosciutto is a light, but effective way of adding excitement to your soup. Lightly grating cheese like parmesan on a cream-based soup is sure to add flavour to your soup. Moreover, it will give your dish a distinctive visual flair. Even if your soup already consists largely of vegetables, adding fresh vegetables on top of it can add a new angle of taste and texture to the soup."
        },
        {
          "headline":"Serve and store your thick soup.",
          "description":"While clean soups have a simple charm to them, a well-made thick or cream-based soup can taste like a fine restaurant creation, even if it's made from home. If you're planning on a cream-based soup, it's a good idea to add the cream and stirring moments before eating it. Thick soups don't generally keep as well as their lighter counterparts, particularly those with cream thickeners. For a long-lasting dish, it's actually recommended you don't add thickener to stored portions, instead adding a cream once it's been defrosted."
        }
      ]
    }
  ],
  "text":" Making A Clear Soup Plan out your soup. If you don't have any experience making homemade soups before, clear soups are recommended as a way to learn the ropes, as they offer more room for simplicity. Before getting started, you'll need to figure out what kind of soup you're looking to make. Is it a hearty vegetable soup? A mineral-rich bone broth? Having a good idea of where to go early on will take the stress and guesswork out of the process later on. Gather your ingredients. While this is by no means an exhaustive list of recommended ingredients to have in your homemade soup, it's a good place to start. Potatoes, peas, kidney beans and carrots are great if you're looking to make a hearty broth. Other vegetables like roughly chopped celery, tomatoes and corn can give the soup a richer taste. Aromatics like onions and garlic are highly recommended for their flavour. The smaller you cut them, the more their flavour will inform the rest of the broth. Noodles are great in soups (for instance, chicken noodle soup) as they tend to embody the flavour of the stock. They're an especially effective addition to a soup that's otherwise lacking in solid substance. If you choose to have meat in your soup, make sure it is pre-cooked, and kept in small enough pieces. You'll also want to make sure the type of meat complements your soup stock. If you're using beans, make sure to have them pre-soaked in water. This will ensure they cook more evenly alongside the other ingredients. Prepare a soup stock. There are multiple ways to do this. Though it depends on the type of soup you would like to make, one recommended method is to make a stock by simmering soup bones in a pot of water overnight. This will extract the minerals and flavour from the bones, giving your soup a hearty and nutritious base to start with. Chicken and beef bones are standard choices for soups, though different bones will each yield their own individual tastes. For a vegetarian alternative, adding finely chopped vegetables to a pot of water and letting it simmer will make a fine vegetable stock for your soup. If you're thrifty, you can use the small, unused remains of past veggie recipes to make the stock. Adding these to cold water and proceeding to simmer will ensure all each vegetable's flavour has a chance to be released. Some dieticians recommend simmering bones for as long as 12-48 hours. This longer process reportedly \"breaks the bones down, releases nutrients and minerals, and makes nutrient-rich collagen, gelatin, and glucosamine easier to digest.\" Oxtail may also be used as a good alternative to bones. If you don't have bones or meat to take it from, you can try asking your local butcher for spare bones to fuel your soup stock. If you want to skip this step, you can purchase a prefabricated bouillon at your local grocery store. Add desired spices to your stock while it simmers. Again, there are a number of ways you can effectively spice up a soup. A tablespoon of sea salt, a teaspoon of peppercorns, and a bunch of parsley are all versatile ways to add zest to a half-pot of soup. Try adding one or two chicken feet to the broth while it simmers. It may not sound appealing, but a chicken foot will add a gelatinous texture to the soup that some may find enjoyable. Start adding your ingredients once the stock has simmered sufficiently. If you made the stock with soup bones, remove them with a ladle. Cut up your vegetables if you haven't done so already. If you're using the recommended ingredients, the potatoes and carrots should be cut into small enough chunks that they'll be able to get consistently soft inside the soup. Add the ingredients in descending order from largest to smallest (e.g: beginning with potato chunks and meat, slowly working to peas and corn.) Working by this process will ideally give all of your ingredients an opportunity to cook relatively evenly. Let simmer for at least half an hour, or until the largest vegetables have gone soft. Stir regularly for optimal consistency. Taste the broth periodically during the cooking process. If you think something is missing, adding a dose of salt and pepper is an easy way to liven up a soup. Serve and enjoy! Distribute your soup into bowls with a ladle. Making a homemade soup can be a lengthy ordeal when you take overnight stock simmering into consideration, but with a little luck and effort, you'll find homemade soup can be one of the most satisfying dishes available. Store excess portions in the freezer. Clear soups are one of the most freezer-friendly dishes around! Put whatever you won't be eating in the next 1-2 days in the freezer, and the soup will stay fresh for a long time. Making A Thick Soup Figure out what kind of thick soup you want to make. A purée, a blended vegetable paste, is the most common form of thick soup. Most often, a thick soup is defined by its thickening agent (I.E: cream) as much as its dominant ingredients. If this is your first time making a thick soup, you may want to stick with making a simple purée; if you're feeling more daring, a cream-based soup can be one of the most delicious things you can make from home. Although the possible choice of ingredients is just as varied as with the clear soup, keep in mind that the base of a thick soup won't complement every ingredient. If you're unsure where or how to start with planning your soup, try looking up a few good specific recipes online. Cream of mushroom soup is a well-loved standard, for instance! Purée ingredients for your soup's base. In the vast majority of cases, you'll achieve the base of your thick soup by puréeing vegetables. Boil the vegetables you want to make your base with. Then, using a food processor or immersion blender, purée your chosen base vegetables until they make a fine paste. Adding this paste to simmering water and stir until the purée is fully mixed. Although the ratio will vary depending on the desired thickness of your soup, using 1 pound of vegetables per 4 cups of water is a good place to start. You can make a meat base by finely chopping or puréeing cooked meat, like chicken. This will yield a much different direction for the soup, and you may find a meat base carries flavour more easily than its vegetarian counterpart. As an alternative measure, you can go without puréeing anything, instead relying on the thickening agent (which you'll add later!) for the soup's texture. A homemade or store-bought meat or veggie stock works in this occasion, although certain ingredients (like mushrooms) make for wonderful cream soups without being puréed. Introduce your desired veggies and aromatics. As with the clear soup, you'll want to give extra time to the larger ingredients you'll be adding to the soup, for the sake of letting everything cook evenly. You'll find aromatics like onions and garlic are particularly useful when it comes to making a thick or cream-based soup. Add a  thickening agent. This is the decisive part of making a thick soup. How you decide to thicken the soup will have just as much of an impact as the central ingredients you've decided to put in it. There are several ways to do this:\nWith a roux. A roux is an equal mixture of flour and fat (like butter) that may be used to thicken your soup. Mix both into a saucepan on medium heat and stir until the melted butter has enveloped the flour. Adding this to your soup is the best option if you want a thick soup, but don't want it cream-based. Butter may also be replaced with cooking oil or grease. With starch, like grated raw potato. Use a grater to grate shreds of potato directly into the simmering soup. 5-10 minutes should be enough to produce the consistency you're looking for. With cream or milk. Cream is the essential element in cream-based soups. To make sure the milk doesn't curdle, warm it up in the microwave beforehand. Add your milk or cream to A 1/2 cup of cream should suffice for a quart of soup; up to a full cup of milk will sate a similar effect. If you decide to make a cream-based soup, do not add the cream until just prior to the soup being consumed. With egg yolk. 1 egg yolk per cup of soup should be enough. Beat the egg yolk until it's a mixture. Don't add the egg directly to the liquid; instead, add some of the soup to help warm up the beaten egg mixture before joining it in with the pot. This will ensure the egg yolk mixes properly with the soup. With flour. Although vegetable soups may not stand up to flour, you'll find adding a couple tablespoons of flour will thicken a rich meat soup effectively. Let simmer for an hour. Stir the soup regularly, to make sure the flavours disperse evenly. You may also find it helpful to periodically taste test the soup. If the taste isn't to your liking, adding salt and pepper helps in a dash to improve a soup's flavour. Other seasonings (like parsley and peppercorn) go a long way towards improving a dish. Complete your recipe with a garnish. A garnish may include anything that livens up, or decorates your soup. This is the step that can elevate your homemade soup to restaurant status! A garnish may even be added simply for visual flair. As with the other ingredients in a homemade soup, you are completely free to experiment with whatever you think would give your homegrown recipe some added personality. Here are some examples:\nA slice of bread or tortilla is a fun and practical addition; the bread will absorb the flavour of your soup and give you something more solid to munch on. A thin meat like prosciutto is a light, but effective way of adding excitement to your soup. Lightly grating cheese like parmesan on a cream-based soup is sure to add flavour to your soup. Moreover, it will give your dish a distinctive visual flair. Even if your soup already consists largely of vegetables, adding fresh vegetables on top of it can add a new angle of taste and texture to the soup. Serve and store your thick soup. While clean soups have a simple charm to them, a well-made thick or cream-based soup can taste like a fine restaurant creation, even if it's made from home. If you're planning on a cream-based soup, it's a good idea to add the cream and stirring moments before eating it. Thick soups don't generally keep as well as their lighter counterparts, particularly those with cream thickeners. For a long-lasting dish, it's actually recommended you don't add thickener to stored portions, instead adding a cream once it's been defrosted.",
  "sentences":[
    " Making A Clear Soup Plan out your soup.",
    "If you don't have any experience making homemade soups before, clear soups are recommended as a way to learn the ropes, as they offer more room for simplicity.",
    "Before getting started, you'll need to figure out what kind of soup you're looking to make.",
    "Is it a hearty vegetable soup?",
    "A mineral-rich bone broth?",
    "Having a good idea of where to go early on will take the stress and guesswork out of the process later on.",
    "Gather your ingredients.",
    "While this is by no means an exhaustive list of recommended ingredients to have in your homemade soup, it's a good place to start.",
    "Potatoes, peas, kidney beans and carrots are great if you're looking to make a hearty broth.",
    "Other vegetables like roughly chopped celery, tomatoes and corn can give the soup a richer taste.",
    "Aromatics like onions and garlic are highly recommended for their flavour.",
    "The smaller you cut them, the more their flavour will inform the rest of the broth.",
    "Noodles are great in soups (for instance, chicken noodle soup) as they tend to embody the flavour of the stock.",
    "They're an especially effective addition to a soup that's otherwise lacking in solid substance.",
    "If you choose to have meat in your soup, make sure it is pre-cooked, and kept in small enough pieces.",
    "You'll also want to make sure the type of meat complements your soup stock.",
    "If you're using beans, make sure to have them pre-soaked in water.",
    "This will ensure they cook more evenly alongside the other ingredients.",
    "Prepare a soup stock.",
    "There are multiple ways to do this.",
    "Though it depends on the type of soup you would like to make, one recommended method is to make a stock by simmering soup bones in a pot of water overnight.",
    "This will extract the minerals and flavour from the bones, giving your soup a hearty and nutritious base to start with.",
    "Chicken and beef bones are standard choices for soups, though different bones will each yield their own individual tastes.",
    "For a vegetarian alternative, adding finely chopped vegetables to a pot of water and letting it simmer will make a fine vegetable stock for your soup.",
    "If you're thrifty, you can use the small, unused remains of past veggie recipes to make the stock.",
    "Adding these to cold water and proceeding to simmer will ensure all each vegetable's flavour has a chance to be released.",
    "Some dieticians recommend simmering bones for as long as 12-48 hours.",
    "This longer process reportedly \"breaks the bones down, releases nutrients and minerals, and makes nutrient-rich collagen, gelatin, and glucosamine easier to digest.\"",
    "Oxtail may also be used as a good alternative to bones.",
    "If you don't have bones or meat to take it from, you can try asking your local butcher for spare bones to fuel your soup stock.",
    "If you want to skip this step, you can purchase a prefabricated bouillon at your local grocery store.",
    "Add desired spices to your stock while it simmers.",
    "Again, there are a number of ways you can effectively spice up a soup.",
    "A tablespoon of sea salt, a teaspoon of peppercorns, and a bunch of parsley are all versatile ways to add zest to a half-pot of soup.",
    "Try adding one or two chicken feet to the broth while it simmers.",
    "It may not sound appealing, but a chicken foot will add a gelatinous texture to the soup that some may find enjoyable.",
    "Start adding your ingredients once the stock has simmered sufficiently.",
    "If you made the stock with soup bones, remove them with a ladle.",
    "Cut up your vegetables if you haven't done so already.",
    "If you're using the recommended ingredients, the potatoes and carrots should be cut into small enough chunks that they'll be able to get consistently soft inside the soup.",
    "Add the ingredients in descending order from largest to smallest (e.g: beginning with potato chunks and meat, slowly working to peas and corn.)",
    "Working by this process will ideally give all of your ingredients an opportunity to cook relatively evenly.",
    "Let simmer for at least half an hour, or until the largest vegetables have gone soft.",
    "Stir regularly for optimal consistency.",
    "Taste the broth periodically during the cooking process.",
    "If you think something is missing, adding a dose of salt and pepper is an easy way to liven up a soup.",
    "Serve and enjoy!",
    "Distribute your soup into bowls with a ladle.",
    "Making a homemade soup can be a lengthy ordeal when you take overnight stock simmering into consideration, but with a little luck and effort, you'll find homemade soup can be one of the most satisfying dishes available.",
    "Store excess portions in the freezer.",
    "Clear soups are one of the most freezer-friendly dishes around!",
    "Put whatever you won't be eating in the next 1-2 days in the freezer, and the soup will stay fresh for a long time.",
    "Making A Thick Soup Figure out what kind of thick soup you want to make.",
    "A purée, a blended vegetable paste, is the most common form of thick soup.",
    "Most often, a thick soup is defined by its thickening agent (I.E: cream) as much as its dominant ingredients.",
    "If this is your first time making a thick soup, you may want to stick with making a simple purée; if you're feeling more daring, a cream-based soup can be one of the most delicious things you can make from home.",
    "Although the possible choice of ingredients is just as varied as with the clear soup, keep in mind that the base of a thick soup won't complement every ingredient.",
    "If you're unsure where or how to start with planning your soup, try looking up a few good specific recipes online.",
    "Cream of mushroom soup is a well-loved standard, for instance!",
    "Purée ingredients for your soup's base.",
    "In the vast majority of cases, you'll achieve the base of your thick soup by puréeing vegetables.",
    "Boil the vegetables you want to make your base with.",
    "Then, using a food processor or immersion blender, purée your chosen base vegetables until they make a fine paste.",
    "Adding this paste to simmering water and stir until the purée is fully mixed.",
    "Although the ratio will vary depending on the desired thickness of your soup, using 1 pound of vegetables per 4 cups of water is a good place to start.",
    "You can make a meat base by finely chopping or puréeing cooked meat, like chicken.",
    "This will yield a much different direction for the soup, and you may find a meat base carries flavour more easily than its vegetarian counterpart.",
    "As an alternative measure, you can go without puréeing anything, instead relying on the thickening agent (which you'll add later!)",
    "for the soup's texture.",
    "A homemade or store-bought meat or veggie stock works in this occasion, although certain ingredients (like mushrooms) make for wonderful cream soups without being puréed.",
    "Introduce your desired veggies and aromatics.",
    "As with the clear soup, you'll want to give extra time to the larger ingredients you'll be adding to the soup, for the sake of letting everything cook evenly.",
    "You'll find aromatics like onions and garlic are particularly useful when it comes to making a thick or cream-based soup.",
    "Add a  thickening agent.",
    "This is the decisive part of making a thick soup.",
    "How you decide to thicken the soup will have just as much of an impact as the central ingredients you've decided to put in it.",
    "There are several ways to do this:\nWith a roux.",
    "A roux is an equal mixture of flour and fat (like butter) that may be used to thicken your soup.",
    "Mix both into a saucepan on medium heat and stir until the melted butter has enveloped the flour.",
    "Adding this to your soup is the best option if you want a thick soup, but don't want it cream-based.",
    "Butter may also be replaced with cooking oil or grease.",
    "With starch, like grated raw potato.",
    "Use a grater to grate shreds of potato directly into the simmering soup.",
    "5-10 minutes should be enough to produce the consistency you're looking for.",
    "With cream or milk.",
    "Cream is the essential element in cream-based soups.",
    "To make sure the milk doesn't curdle, warm it up in the microwave beforehand.",
    "Add your milk or cream to A 1/2 cup of cream should suffice for a quart of soup; up to a full cup of milk will sate a similar effect.",
    "If you decide to make a cream-based soup, do not add the cream until just prior to the soup being consumed.",
    "With egg yolk.",
    "1 egg yolk per cup of soup should be enough.",
    "Beat the egg yolk until it's a mixture.",
    "Don't add the egg directly to the liquid; instead, add some of the soup to help warm up the beaten egg mixture before joining it in with the pot.",
    "This will ensure the egg yolk mixes properly with the soup.",
    "With flour.",
    "Although vegetable soups may not stand up to flour, you'll find adding a couple tablespoons of flour will thicken a rich meat soup effectively.",
    "Let simmer for an hour.",
    "Stir the soup regularly, to make sure the flavours disperse evenly.",
    "You may also find it helpful to periodically taste test the soup.",
    "If the taste isn't to your liking, adding salt and pepper helps in a dash to improve a soup's flavour.",
    "Other seasonings (like parsley and peppercorn) go a long way towards improving a dish.",
    "Complete your recipe with a garnish.",
    "A garnish may include anything that livens up, or decorates your soup.",
    "This is the step that can elevate your homemade soup to restaurant status!",
    "A garnish may even be added simply for visual flair.",
    "As with the other ingredients in a homemade soup, you are completely free to experiment with whatever you think would give your homegrown recipe some added personality.",
    "Here are some examples:\nA slice of bread or tortilla is a fun and practical addition; the bread will absorb the flavour of your soup and give you something more solid to munch on.",
    "A thin meat like prosciutto is a light, but effective way of adding excitement to your soup.",
    "Lightly grating cheese like parmesan on a cream-based soup is sure to add flavour to your soup.",
    "Moreover, it will give your dish a distinctive visual flair.",
    "Even if your soup already consists largely of vegetables, adding fresh vegetables on top of it can add a new angle of taste and texture to the soup.",
    "Serve and store your thick soup.",
    "While clean soups have a simple charm to them, a well-made thick or cream-based soup can taste like a fine restaurant creation, even if it's made from home.",
    "If you're planning on a cream-based soup, it's a good idea to add the cream and stirring moments before eating it.",
    "Thick soups don't generally keep as well as their lighter counterparts, particularly those with cream thickeners.",
    "For a long-lasting dish, it's actually recommended you don't add thickener to stored portions, instead adding a cream once it's been defrosted."
  ],
  "tyn_section":[
    "Assorted vegetables and base-- this depends on personal preference!",
    "A large pot, for brewing the soup in.",
    "A stove with a working top element, for simmering the soup with.",
    "A spoon and ladle, for stirring and serving the soup respectively.",
    "Bowls and/or tupperware, for serving or storing the soup once ready.",
    "A food processor or immersion blender (for pureeing a thick soup base.)",
    "OPTIONAL: A cheese grater (for grating potato for thickness or cheese for garnish.)"
  ],
  "tyn_model":[
    "cream",
    "vegetables",
    "water",
    "flour",
    "soup",
    "milk",
    "potato",
    "butter",
    "potatoes",
    "peas",
    "carrots",
    "garlic",
    "soup stock",
    "pot",
    "chicken",
    "parsley",
    "stock",
    "ladle",
    "salt and pepper",
    "cream-based soup",
    "roux",
    "vegetable soup",
    "bone broth",
    "celery",
    "tomatoes",
    "corn",
    "onions",
    "noodles",
    "chicken noodle soup",
    "beans",
    "vegetable stock",
    "gelatin",
    "oxtail",
    "spices",
    "sea salt",
    "peppercorns",
    "chicken feet",
    "chicken foot",
    "meat",
    "broth",
    "bowls",
    "overnight stock",
    "cream of mushroom soup",
    "food processor",
    "immersion blender",
    "mushrooms",
    "cream soups",
    "fat",
    "saucepan",
    "cooking oil",
    "grater",
    "cream-based soups",
    "microwave",
    "peppercorn",
    "bread",
    "tortilla",
    "prosciutto",
    "cheese",
    "parmesan"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}