{
  "title":"How to Disassemble a PlayStation 2",
  "url":"https://www.wikihow.com/Disassemble-a-PlayStation-2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 2"
  ],
  "steps":[
    {
      "headline":"Be sure your PS2 is unplugged before beginning.",
      "description":"Remove any peripherals (memory cards, network adapters, etc.)"
    },
    {
      "headline":"Turn the PS2 on its top, and remove the screw covers.",
      "description":"This will give you access to the rubber feet on the bottom of the unit, as well as the small plastic screw hole covers in the corners. Your unit will have either 8 or 10 screws depending on the version. you may need to use the tip of a small flathead screwdriver to remove the plastic covers."
    },
    {
      "headline":"Use the #2 screwdriver to remove the screws securing the bottom plate.",
      "description":"Keep track of which types of screws come from which holes; there are at least two different lengths of screw."
    },
    {
      "headline":"Flip the entire unit over and score the warranty sticker on the back of the unit.",
      "description":"This will, of course, void your warranty, if it is still valid. Use your thumbnail, or if you prefer, a small screwdriver."
    },
    {
      "headline":"Carefully lift the top of the unit off.",
      "description":"Start at the back, and pivot around the DVD tray cover. At about 45 degrees, the top should be free of the façade. There will still be a fragile cable connecting the eject button assembly to the mainboard. Turn the top to the side and place it upside-down so that the cord is not compromised. You may unplug the eject button assembly from the mainboard by simply pulling on the blue plastic attached to the end of the wire."
    },
    {
      "headline":"If you simply wish to access the DVD drive internals to clean or focus the laser (or to bypass the need for a flip-top), remove the four small screws securing the top of the drive.",
      "description":"There will be some slight resistance in removal from the magnetized disc holder. You may stop at this step, or proceed to access the remainder of the components. If you are not accessing the DVD internals, leave the cover in place to prevent damage to the laser when maneuvering the console."
    },
    {
      "headline":"Remove the screws securing the power socket, controller port, and DVD drive units.",
      "description":"Be very careful, as the controller ports and DVD drive are held on by small, flat and very short cables."
    },
    {
      "headline":"Carefully flip the entire unit over once again.",
      "description":"There will be many loose components, including the DVD drive and the other parts you just unscrewed. You may now remove the lower portion of the PlayStation 2."
    },
    {
      "headline":"Remove the four screws securing the power supply unit.",
      "description":"The PSU is also plugged into the mainboard by a long 4 pin plug, so a small amount of force is required to remove the board. You may also remove the 2 pin power connector which wraps around the side of the board and attaches to the fan assembly. Preferably, set the PSU on a clean sheet of paper so that it will not get any conductive residue on it. It is also now possible to remove the metal hard drive cage. If desired, you may remove the controller port from its ZIF (Zero Insertion Force) socket. Gently flip up the long brown cover on the board-side socket with a small flat tool, then lift out the wire."
    },
    {
      "headline":"Carefully remove the screws securing the metal shield to the mainboard.",
      "description":"Set it aside so it will not get bent or misshapen."
    },
    {
      "headline":"Remove the small wires which connect the DVD drive and the eject button assembly to the sides of the mainboard.",
      "description":"Label which plug goes to which socket. Depending on your version, the wires may either be plug-in, ZIF, or a mix of both types. If there are blue pieces of transparent plastic attached to the wires, then your wires can be simply pulled out."
    },
    {
      "headline":"Your PS2 should now be completely accessible, however, BE VERY CAREFUL when shifting components, as each model of PS2 is different, and there may be further wires or screws attaching other components.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Be sure your PS2 is unplugged before beginning. Remove any peripherals (memory cards, network adapters, etc.) Turn the PS2 on its top, and remove the screw covers. This will give you access to the rubber feet on the bottom of the unit, as well as the small plastic screw hole covers in the corners. Your unit will have either 8 or 10 screws depending on the version. you may need to use the tip of a small flathead screwdriver to remove the plastic covers. Use the #2 screwdriver to remove the screws securing the bottom plate. Keep track of which types of screws come from which holes; there are at least two different lengths of screw. Flip the entire unit over and score the warranty sticker on the back of the unit. This will, of course, void your warranty, if it is still valid. Use your thumbnail, or if you prefer, a small screwdriver. Carefully lift the top of the unit off. Start at the back, and pivot around the DVD tray cover. At about 45 degrees, the top should be free of the façade. There will still be a fragile cable connecting the eject button assembly to the mainboard. Turn the top to the side and place it upside-down so that the cord is not compromised. You may unplug the eject button assembly from the mainboard by simply pulling on the blue plastic attached to the end of the wire. If you simply wish to access the DVD drive internals to clean or focus the laser (or to bypass the need for a flip-top), remove the four small screws securing the top of the drive. There will be some slight resistance in removal from the magnetized disc holder. You may stop at this step, or proceed to access the remainder of the components. If you are not accessing the DVD internals, leave the cover in place to prevent damage to the laser when maneuvering the console. Remove the screws securing the power socket, controller port, and DVD drive units. Be very careful, as the controller ports and DVD drive are held on by small, flat and very short cables. Carefully flip the entire unit over once again. There will be many loose components, including the DVD drive and the other parts you just unscrewed. You may now remove the lower portion of the PlayStation 2. Remove the four screws securing the power supply unit. The PSU is also plugged into the mainboard by a long 4 pin plug, so a small amount of force is required to remove the board. You may also remove the 2 pin power connector which wraps around the side of the board and attaches to the fan assembly. Preferably, set the PSU on a clean sheet of paper so that it will not get any conductive residue on it. It is also now possible to remove the metal hard drive cage. If desired, you may remove the controller port from its ZIF (Zero Insertion Force) socket. Gently flip up the long brown cover on the board-side socket with a small flat tool, then lift out the wire. Carefully remove the screws securing the metal shield to the mainboard. Set it aside so it will not get bent or misshapen. Remove the small wires which connect the DVD drive and the eject button assembly to the sides of the mainboard. Label which plug goes to which socket. Depending on your version, the wires may either be plug-in, ZIF, or a mix of both types. If there are blue pieces of transparent plastic attached to the wires, then your wires can be simply pulled out. Your PS2 should now be completely accessible, however, BE VERY CAREFUL when shifting components, as each model of PS2 is different, and there may be further wires or screws attaching other components.  Finished. ",
  "sentences":[
    " Be sure your PS2 is unplugged before beginning.",
    "Remove any peripherals (memory cards, network adapters, etc.)",
    "Turn the PS2 on its top, and remove the screw covers.",
    "This will give you access to the rubber feet on the bottom of the unit, as well as the small plastic screw hole covers in the corners.",
    "Your unit will have either 8 or 10 screws depending on the version.",
    "you may need to use the tip of a small flathead screwdriver to remove the plastic covers.",
    "Use the #2 screwdriver to remove the screws securing the bottom plate.",
    "Keep track of which types of screws come from which holes; there are at least two different lengths of screw.",
    "Flip the entire unit over and score the warranty sticker on the back of the unit.",
    "This will, of course, void your warranty, if it is still valid.",
    "Use your thumbnail, or if you prefer, a small screwdriver.",
    "Carefully lift the top of the unit off.",
    "Start at the back, and pivot around the DVD tray cover.",
    "At about 45 degrees, the top should be free of the façade.",
    "There will still be a fragile cable connecting the eject button assembly to the mainboard.",
    "Turn the top to the side and place it upside-down so that the cord is not compromised.",
    "You may unplug the eject button assembly from the mainboard by simply pulling on the blue plastic attached to the end of the wire.",
    "If you simply wish to access the DVD drive internals to clean or focus the laser (or to bypass the need for a flip-top), remove the four small screws securing the top of the drive.",
    "There will be some slight resistance in removal from the magnetized disc holder.",
    "You may stop at this step, or proceed to access the remainder of the components.",
    "If you are not accessing the DVD internals, leave the cover in place to prevent damage to the laser when maneuvering the console.",
    "Remove the screws securing the power socket, controller port, and DVD drive units.",
    "Be very careful, as the controller ports and DVD drive are held on by small, flat and very short cables.",
    "Carefully flip the entire unit over once again.",
    "There will be many loose components, including the DVD drive and the other parts you just unscrewed.",
    "You may now remove the lower portion of the PlayStation 2.",
    "Remove the four screws securing the power supply unit.",
    "The PSU is also plugged into the mainboard by a long 4 pin plug, so a small amount of force is required to remove the board.",
    "You may also remove the 2 pin power connector which wraps around the side of the board and attaches to the fan assembly.",
    "Preferably, set the PSU on a clean sheet of paper so that it will not get any conductive residue on it.",
    "It is also now possible to remove the metal hard drive cage.",
    "If desired, you may remove the controller port from its ZIF (Zero Insertion Force) socket.",
    "Gently flip up the long brown cover on the board-side socket with a small flat tool, then lift out the wire.",
    "Carefully remove the screws securing the metal shield to the mainboard.",
    "Set it aside so it will not get bent or misshapen.",
    "Remove the small wires which connect the DVD drive and the eject button assembly to the sides of the mainboard.",
    "Label which plug goes to which socket.",
    "Depending on your version, the wires may either be plug-in, ZIF, or a mix of both types.",
    "If there are blue pieces of transparent plastic attached to the wires, then your wires can be simply pulled out.",
    "Your PS2 should now be completely accessible, however, BE VERY CAREFUL when shifting components, as each model of PS2 is different, and there may be further wires or screws attaching other components.",
    "Finished."
  ],
  "tyn_section":[
    "Philips #2 screwdriver",
    "Philips #00 screwdriver",
    "Flathead #0 screwdriver, or other small flat object (optional, yet indispensable)",
    "Tweezers (optional)"
  ],
  "tyn_model":[
    "ps2",
    "dvd drive",
    "screwdriver",
    "eject button",
    "laser",
    "psu",
    "dvd tray",
    "screws",
    "playstation 2",
    "power supply",
    "fan"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.0909090909,
    "f1":0.1538461538
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}