{
  "title":"How to Germinate Maple Tree Seeds",
  "url":"https://www.wikihow.com/Germinate-Maple-Tree-Seeds",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Plant Propagation Techniques"
  ],
  "methods":[
    {
      "name":"Using Cold Stratification",
      "steps":[
        {
          "headline":"Try this for most maple seeds.",
          "description":"Sugar maples, bigleaf maples, boxelder maples, Japanese maples, Norway maples, and some red maples lie dormant over the winter, then germinate as soon as temperatures warm. The cold stratification approach produces very high germination rates in these species. All of these species drop their seeds in autumn or early winter. If your red maple trees drop their seeds in spring or early summer, try germinating them in the soil instead. If you're going to plant the seeds outdoors, start this method 90–120 days before the last winter frost."
        },
        {
          "headline":"Fill a plastic bag with growing material.",
          "description":"Place a handful of peat moss, vermiculite, or germination paper in a small, plastic, zip-locked bag. For best results, use sterile material and handle it with disposable gloves to avoid introducing fungus. Tiny \"snack sized\" bags work best. Larger bags trap more air with the seeds, which can lead to fungal problems. Red maple seeds are sensitive to acidity. For this species, choose vermiculite (a neutral or basic substance) rather than peat moss (acidic)."
        },
        {
          "headline":"Add a little water.",
          "description":"Add a couple drops of water to the growing material to dampen the material slightly. If you see standing water, or if you can squeeze out water from the material, it is too wet."
        },
        {
          "headline":"Apply a little fungicide (optional).",
          "description":"Fungicide can prevent mold from destroying your seeds, but it is not always necessary, and may damage the plant if overused. Add only in tiny quantities, following manufacturer's instructions. Some growers rinse the seeds in very diluted bleach solutions instead."
        },
        {
          "headline":"Add the seeds and close the bag.",
          "description":"Place your seeds in the bag. Starting from the base, roll the bag to expel most of the air. Zip it closed."
        },
        {
          "headline":"Store in the refrigerator.",
          "description":"Now it's time to \"stratify\" the seeds, or expose them to temperatures that trigger germination. For most species, the ideal temperature is usually around 1–5ºC (33.8–41ºF). The crisper drawer of a refrigerator is usually about this temperature. Ideally, use a thermometer to confirm the correct temperature. Some seeds may fail to germinate if the temperature is just a couple degrees off. If possible, keep boxelder and Norway maple seeds at exactly 5ºC (41ºF), and red maple seeds at exactly 3ºC (37.4ºF). Other species are not as picky."
        },
        {
          "headline":"Leave them for 40–120 days, checking every week or 2.",
          "description":"Most of these species take 90–120 days to germinate, but the bigleaf maple and a few others can sprout in as few as 40. Every week or 2, check on the bag and make adjustments as needed:\nIf you notice condensation, pick up the bag and gently tap it to knock the water droplets off. Lay the bag back down on the opposite side, so the wet seeds have a chance to dry off. If the growing material has dried out, add a drop or 2 of water. If you notice any mold or black spots, remove the affected seed and throw it away. (If the whole batch is molding, try a little fungicide.) If the seeds have begun to sprout, remove them from the refrigerator."
        },
        {
          "headline":"Plant the seeds.",
          "description":"Once the seeds have germinated, plant them 0.6–1.2cm (¼–½ inch) under moist soil. Most maples do well in partial shade, but look up the exact species if possible for more info on planting. To increase the odds of survival, start the seedlings in an indoor seed tray instead. Fill the tray with 7.6–10 cm (3–4 inches) of well-draining potting soil, or an even mix of peat moss, rotted compost, vermiculite and coarse sand. Water whenever the soil becomes completely dry. Transfer to planter pots once the second set of leaves appear."
        }
      ]
    },
    {
      "name":"Combining Warm and Cold Stratification",
      "steps":[
        {
          "headline":"Follow this approach for mountain and Asian species.",
          "description":"Vine maple, striped maple, Amur maple, and paperbark maple are all tough to germinate, and require extra attention. This applies to most other species native to Asia, as well as mountain maples and rocky mountain maples. All of the seeds in this category drop in autumn or winter. Left alone in the soil, they can take years to germinate."
        },
        {
          "headline":"Treat the outer hull.",
          "description":"Many of these species have an extremely hard hull (pericarp). Growers often \"scarify\" the hull to greatly improve germination rates. You may use any of these methods:\nRub the base of the seed (opposite the wing) against a nail file or sandpaper. Stop as soon as you break through the hull, barely nicking the seed coat underneath. Soak the seeds in household strength hydrogen peroxide for several hours, then rinse well. Soak the seeds in warm water for 24 hours."
        },
        {
          "headline":"Store in a warm room.",
          "description":"The US Forest Service recommends keeping the seeds at 20–30ºC (68–86ºF) for 30–60 days. These seeds have not been studied as thoroughly as those of other species, so exact guidelines for each species are not available."
        },
        {
          "headline":"Cold stratify for 90–180 days.",
          "description":"Transfer the seeds to a plastic, zip-locked bag in the refrigerator, with a small handful of peat moss or other growing material. Check back every couple weeks to look for signs of mold, drying, or sprouting. Rocky mountain seeds (Acer glabrum) usually take the full 180 days to germinate. Other species can take as few as 90, but they are unpredictable. Don't expect every seed to sprout. Germination rates as low as 20% are common for these species."
        },
        {
          "headline":"Plant the seeds.",
          "description":"You may start the germinated seeds on an indoor seedling tray, or plant them outside if the last frost has passed. Plant them 0.6 to 2.5cm (¼ to 1 inch) beneath the soil surface. Water occasionally but deeply, not letting the soil stay dry for long. For more specific information, look up your exact maple species."
        }
      ]
    },
    {
      "name":"Germinating in the Soil",
      "steps":[
        {
          "headline":"Collect seeds in late spring or early summer.",
          "description":"Silver maples and some red maples (but not Japanese red maples) will drop their seeds early in the growing season. These species do not go dormant, and there is no need for any special treatments. Some red maple trees will not drop seeds until autumn or winter; these require cold stratification. Even the groves that drop seeds early usually have alternate years of good and bad seed production."
        },
        {
          "headline":"Plant immediately.",
          "description":"Seeds of this type will die if they dry out in storage. Plant shortly after you collect them. They should germinate quickly."
        },
        {
          "headline":"Plant on moist ground.",
          "description":"Place the seeds on moist ground with plenty of leaf litter and other organic material. As long as the soil doesn't dry out, the seeds will require no maintenance."
        },
        {
          "headline":"Plant in sun or partial shade.",
          "description":"Silver maples grow poorly in shade. Red maples can handle shade for 3–5 years, but may have trouble growing if they remain under the canopy past that point."
        },
        {
          "headline":"Leave bare seedbeds undisturbed (optional).",
          "description":"If some of the seeds fail to germinate, they will often sprout the following year. These are usually a minority of the seeds, but if you haven't had much success it could be worth leaving the area untended for a second season. If very few of the seeds germinate, and the climate has been fairly typical, the seeds most likely died in storage. Plant a new batch next year rather than waiting."
        }
      ]
    }
  ],
  "text":" Using Cold Stratification Try this for most maple seeds. Sugar maples, bigleaf maples, boxelder maples, Japanese maples, Norway maples, and some red maples lie dormant over the winter, then germinate as soon as temperatures warm. The cold stratification approach produces very high germination rates in these species. All of these species drop their seeds in autumn or early winter. If your red maple trees drop their seeds in spring or early summer, try germinating them in the soil instead. If you're going to plant the seeds outdoors, start this method 90–120 days before the last winter frost. Fill a plastic bag with growing material. Place a handful of peat moss, vermiculite, or germination paper in a small, plastic, zip-locked bag. For best results, use sterile material and handle it with disposable gloves to avoid introducing fungus. Tiny \"snack sized\" bags work best. Larger bags trap more air with the seeds, which can lead to fungal problems. Red maple seeds are sensitive to acidity. For this species, choose vermiculite (a neutral or basic substance) rather than peat moss (acidic). Add a little water. Add a couple drops of water to the growing material to dampen the material slightly. If you see standing water, or if you can squeeze out water from the material, it is too wet. Apply a little fungicide (optional). Fungicide can prevent mold from destroying your seeds, but it is not always necessary, and may damage the plant if overused. Add only in tiny quantities, following manufacturer's instructions. Some growers rinse the seeds in very diluted bleach solutions instead. Add the seeds and close the bag. Place your seeds in the bag. Starting from the base, roll the bag to expel most of the air. Zip it closed. Store in the refrigerator. Now it's time to \"stratify\" the seeds, or expose them to temperatures that trigger germination. For most species, the ideal temperature is usually around 1–5ºC (33.8–41ºF). The crisper drawer of a refrigerator is usually about this temperature. Ideally, use a thermometer to confirm the correct temperature. Some seeds may fail to germinate if the temperature is just a couple degrees off. If possible, keep boxelder and Norway maple seeds at exactly 5ºC (41ºF), and red maple seeds at exactly 3ºC (37.4ºF). Other species are not as picky. Leave them for 40–120 days, checking every week or 2. Most of these species take 90–120 days to germinate, but the bigleaf maple and a few others can sprout in as few as 40. Every week or 2, check on the bag and make adjustments as needed:\nIf you notice condensation, pick up the bag and gently tap it to knock the water droplets off. Lay the bag back down on the opposite side, so the wet seeds have a chance to dry off. If the growing material has dried out, add a drop or 2 of water. If you notice any mold or black spots, remove the affected seed and throw it away. (If the whole batch is molding, try a little fungicide.) If the seeds have begun to sprout, remove them from the refrigerator. Plant the seeds. Once the seeds have germinated, plant them 0.6–1.2cm (¼–½ inch) under moist soil. Most maples do well in partial shade, but look up the exact species if possible for more info on planting. To increase the odds of survival, start the seedlings in an indoor seed tray instead. Fill the tray with 7.6–10 cm (3–4 inches) of well-draining potting soil, or an even mix of peat moss, rotted compost, vermiculite and coarse sand. Water whenever the soil becomes completely dry. Transfer to planter pots once the second set of leaves appear. Combining Warm and Cold Stratification Follow this approach for mountain and Asian species. Vine maple, striped maple, Amur maple, and paperbark maple are all tough to germinate, and require extra attention. This applies to most other species native to Asia, as well as mountain maples and rocky mountain maples. All of the seeds in this category drop in autumn or winter. Left alone in the soil, they can take years to germinate. Treat the outer hull. Many of these species have an extremely hard hull (pericarp). Growers often \"scarify\" the hull to greatly improve germination rates. You may use any of these methods:\nRub the base of the seed (opposite the wing) against a nail file or sandpaper. Stop as soon as you break through the hull, barely nicking the seed coat underneath. Soak the seeds in household strength hydrogen peroxide for several hours, then rinse well. Soak the seeds in warm water for 24 hours. Store in a warm room. The US Forest Service recommends keeping the seeds at 20–30ºC (68–86ºF) for 30–60 days. These seeds have not been studied as thoroughly as those of other species, so exact guidelines for each species are not available. Cold stratify for 90–180 days. Transfer the seeds to a plastic, zip-locked bag in the refrigerator, with a small handful of peat moss or other growing material. Check back every couple weeks to look for signs of mold, drying, or sprouting. Rocky mountain seeds (Acer glabrum) usually take the full 180 days to germinate. Other species can take as few as 90, but they are unpredictable. Don't expect every seed to sprout. Germination rates as low as 20% are common for these species. Plant the seeds. You may start the germinated seeds on an indoor seedling tray, or plant them outside if the last frost has passed. Plant them 0.6 to 2.5cm (¼ to 1 inch) beneath the soil surface. Water occasionally but deeply, not letting the soil stay dry for long. For more specific information, look up your exact maple species. Germinating in the Soil Collect seeds in late spring or early summer. Silver maples and some red maples (but not Japanese red maples) will drop their seeds early in the growing season. These species do not go dormant, and there is no need for any special treatments. Some red maple trees will not drop seeds until autumn or winter; these require cold stratification. Even the groves that drop seeds early usually have alternate years of good and bad seed production. Plant immediately. Seeds of this type will die if they dry out in storage. Plant shortly after you collect them. They should germinate quickly. Plant on moist ground. Place the seeds on moist ground with plenty of leaf litter and other organic material. As long as the soil doesn't dry out, the seeds will require no maintenance. Plant in sun or partial shade. Silver maples grow poorly in shade. Red maples can handle shade for 3–5 years, but may have trouble growing if they remain under the canopy past that point. Leave bare seedbeds undisturbed (optional). If some of the seeds fail to germinate, they will often sprout the following year. These are usually a minority of the seeds, but if you haven't had much success it could be worth leaving the area untended for a second season. If very few of the seeds germinate, and the climate has been fairly typical, the seeds most likely died in storage. Plant a new batch next year rather than waiting.",
  "sentences":[
    " Using Cold Stratification Try this for most maple seeds.",
    "Sugar maples, bigleaf maples, boxelder maples, Japanese maples, Norway maples, and some red maples lie dormant over the winter, then germinate as soon as temperatures warm.",
    "The cold stratification approach produces very high germination rates in these species.",
    "All of these species drop their seeds in autumn or early winter.",
    "If your red maple trees drop their seeds in spring or early summer, try germinating them in the soil instead.",
    "If you're going to plant the seeds outdoors, start this method 90–120 days before the last winter frost.",
    "Fill a plastic bag with growing material.",
    "Place a handful of peat moss, vermiculite, or germination paper in a small, plastic, zip-locked bag.",
    "For best results, use sterile material and handle it with disposable gloves to avoid introducing fungus.",
    "Tiny \"snack sized\" bags work best.",
    "Larger bags trap more air with the seeds, which can lead to fungal problems.",
    "Red maple seeds are sensitive to acidity.",
    "For this species, choose vermiculite (a neutral or basic substance) rather than peat moss (acidic).",
    "Add a little water.",
    "Add a couple drops of water to the growing material to dampen the material slightly.",
    "If you see standing water, or if you can squeeze out water from the material, it is too wet.",
    "Apply a little fungicide (optional).",
    "Fungicide can prevent mold from destroying your seeds, but it is not always necessary, and may damage the plant if overused.",
    "Add only in tiny quantities, following manufacturer's instructions.",
    "Some growers rinse the seeds in very diluted bleach solutions instead.",
    "Add the seeds and close the bag.",
    "Place your seeds in the bag.",
    "Starting from the base, roll the bag to expel most of the air.",
    "Zip it closed.",
    "Store in the refrigerator.",
    "Now it's time to \"stratify\" the seeds, or expose them to temperatures that trigger germination.",
    "For most species, the ideal temperature is usually around 1–5ºC (33.8–41ºF).",
    "The crisper drawer of a refrigerator is usually about this temperature.",
    "Ideally, use a thermometer to confirm the correct temperature.",
    "Some seeds may fail to germinate if the temperature is just a couple degrees off.",
    "If possible, keep boxelder and Norway maple seeds at exactly 5ºC (41ºF), and red maple seeds at exactly 3ºC (37.4ºF).",
    "Other species are not as picky.",
    "Leave them for 40–120 days, checking every week or 2.",
    "Most of these species take 90–120 days to germinate, but the bigleaf maple and a few others can sprout in as few as 40.",
    "Every week or 2, check on the bag and make adjustments as needed:\nIf you notice condensation, pick up the bag and gently tap it to knock the water droplets off.",
    "Lay the bag back down on the opposite side, so the wet seeds have a chance to dry off.",
    "If the growing material has dried out, add a drop or 2 of water.",
    "If you notice any mold or black spots, remove the affected seed and throw it away.",
    "(If the whole batch is molding, try a little fungicide.)",
    "If the seeds have begun to sprout, remove them from the refrigerator.",
    "Plant the seeds.",
    "Once the seeds have germinated, plant them 0.6–1.2cm (¼–½ inch) under moist soil.",
    "Most maples do well in partial shade, but look up the exact species if possible for more info on planting.",
    "To increase the odds of survival, start the seedlings in an indoor seed tray instead.",
    "Fill the tray with 7.6–10 cm (3–4 inches) of well-draining potting soil, or an even mix of peat moss, rotted compost, vermiculite and coarse sand.",
    "Water whenever the soil becomes completely dry.",
    "Transfer to planter pots once the second set of leaves appear.",
    "Combining Warm and Cold Stratification Follow this approach for mountain and Asian species.",
    "Vine maple, striped maple, Amur maple, and paperbark maple are all tough to germinate, and require extra attention.",
    "This applies to most other species native to Asia, as well as mountain maples and rocky mountain maples.",
    "All of the seeds in this category drop in autumn or winter.",
    "Left alone in the soil, they can take years to germinate.",
    "Treat the outer hull.",
    "Many of these species have an extremely hard hull (pericarp).",
    "Growers often \"scarify\" the hull to greatly improve germination rates.",
    "You may use any of these methods:\nRub the base of the seed (opposite the wing) against a nail file or sandpaper.",
    "Stop as soon as you break through the hull, barely nicking the seed coat underneath.",
    "Soak the seeds in household strength hydrogen peroxide for several hours, then rinse well.",
    "Soak the seeds in warm water for 24 hours.",
    "Store in a warm room.",
    "The US Forest Service recommends keeping the seeds at 20–30ºC (68–86ºF) for 30–60 days.",
    "These seeds have not been studied as thoroughly as those of other species, so exact guidelines for each species are not available.",
    "Cold stratify for 90–180 days.",
    "Transfer the seeds to a plastic, zip-locked bag in the refrigerator, with a small handful of peat moss or other growing material.",
    "Check back every couple weeks to look for signs of mold, drying, or sprouting.",
    "Rocky mountain seeds (Acer glabrum) usually take the full 180 days to germinate.",
    "Other species can take as few as 90, but they are unpredictable.",
    "Don't expect every seed to sprout.",
    "Germination rates as low as 20% are common for these species.",
    "Plant the seeds.",
    "You may start the germinated seeds on an indoor seedling tray, or plant them outside if the last frost has passed.",
    "Plant them 0.6 to 2.5cm (¼ to 1 inch) beneath the soil surface.",
    "Water occasionally but deeply, not letting the soil stay dry for long.",
    "For more specific information, look up your exact maple species.",
    "Germinating in the Soil Collect seeds in late spring or early summer.",
    "Silver maples and some red maples (but not Japanese red maples) will drop their seeds early in the growing season.",
    "These species do not go dormant, and there is no need for any special treatments.",
    "Some red maple trees will not drop seeds until autumn or winter; these require cold stratification.",
    "Even the groves that drop seeds early usually have alternate years of good and bad seed production.",
    "Plant immediately.",
    "Seeds of this type will die if they dry out in storage.",
    "Plant shortly after you collect them.",
    "They should germinate quickly.",
    "Plant on moist ground.",
    "Place the seeds on moist ground with plenty of leaf litter and other organic material.",
    "As long as the soil doesn't dry out, the seeds will require no maintenance.",
    "Plant in sun or partial shade.",
    "Silver maples grow poorly in shade.",
    "Red maples can handle shade for 3–5 years, but may have trouble growing if they remain under the canopy past that point.",
    "Leave bare seedbeds undisturbed (optional).",
    "If some of the seeds fail to germinate, they will often sprout the following year.",
    "These are usually a minority of the seeds, but if you haven't had much success it could be worth leaving the area untended for a second season.",
    "If very few of the seeds germinate, and the climate has been fairly typical, the seeds most likely died in storage.",
    "Plant a new batch next year rather than waiting."
  ],
  "tyn_section":[
    "Fresh, new season maple seeds",
    "Zipper bag",
    "Refrigerator",
    "Peat moss, vermiculite, or germination paper",
    "Potting soil",
    "Fungicide"
  ],
  "tyn_model":[
    "water",
    "peat moss",
    "red maple",
    "refrigerator",
    "fungicide",
    "cold stratification",
    "plastic bag",
    "germination paper",
    "bleach",
    "thermometer",
    "norway maple",
    "bigleaf maple",
    "seed tray",
    "potting soil",
    "coarse sand",
    "planter pots",
    "vine maple",
    "pericarp",
    "nail file",
    "hydrogen peroxide",
    "rocky mountain seeds",
    "maple",
    "seeds"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1304347826,
    "f1":0.2068965517,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1304347826,
    "f1":0.2068965517
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.2173913043,
    "f1":0.3448275862
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1304347826,
    "f1":0.2068965517
  }
}