{
  "title":"How to Lessen the Strong Taste of Brussels Sprouts",
  "url":"https://www.wikihow.com/Lessen-the-Strong-Taste-of-Brussels-Sprouts",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Lemon Juice",
      "steps":[
        {
          "headline":"Boil some water with a touch of salt and just a little bit of freshly squeezed lemon juice.",
          "description":""
        },
        {
          "headline":"With a paring knife, cut an \"X\" into the base of the sprout.",
          "description":"Then add the Brussels sprouts to the water. Do not over-cook - this is very important! They should still be crispy firm but tender."
        },
        {
          "headline":"Leave the lid off the saucepan for 5 minutes during cooking.",
          "description":"This allows the vapor to dissipate, taking the less-desirable odors with it."
        },
        {
          "headline":"Serve.",
          "description":"Your Brussels sprouts should now please even the fussiest of veggie eaters!"
        }
      ]
    },
    {
      "name":"Olive Oil",
      "steps":[
        {
          "headline":"Cut any dirty or brown looking leaves off while slicing off the hard bottom where the sprout is attached to the stalk.",
          "description":""
        },
        {
          "headline":"Place into a roasting pan.",
          "description":""
        },
        {
          "headline":"Sprinkle liberally with some salt, some fresh-ground pepper, and a little olive oil.",
          "description":""
        },
        {
          "headline":"Toss to coat with all the above.",
          "description":""
        },
        {
          "headline":"Roast in a slow oven until it's crisp-tender and lightly browned, stirring and lowering the temp if they brown quicker than they soften to your degree of liking.",
          "description":""
        }
      ]
    },
    {
      "name":"Garlic",
      "steps":[
        {
          "headline":"Cut off the hard bottom and slice the brussels sprouts into shreds that resemble lettuce.",
          "description":"Make it fairly fine."
        },
        {
          "headline":"Boil a cup of water with a teaspoon of salt.",
          "description":"Drop the shredded sprouts in for exactly two minutes - no more. Any longer, and you will have smelly, slimy mush. You just want to make them tender, slightly wilted, but with some snap left in them."
        },
        {
          "headline":"Remove them to a bowl of ice water to stop the cooking and then drain, or drop them into a colander to drain, and run some cold tap water over them.",
          "description":"Let them drain while you do the next step."
        },
        {
          "headline":"Melt 1/2 stick of butter.",
          "description":"Add 1 clove minced garlic and just heat until you can smell the garlic. Mmmmm. Remove from heat."
        },
        {
          "headline":"Squeeze a lemon into the butter.",
          "description":""
        },
        {
          "headline":"Add the drained brussels sprouts, salt and pepper to taste, and turn on the heat again.",
          "description":"Toss the sprouts in the lemon, garlic and butter mixture, just until heated through - about one minute."
        },
        {
          "headline":"Remove from heat and sprinkle with some shredded or flaked Parmesan cheese.",
          "description":""
        },
        {
          "headline":"Enjoy!",
          "description":""
        }
      ]
    },
    {
      "name":"Onion",
      "steps":[
        {
          "headline":"Heat the butter in a pan till melted and hot; add the chopped onion.",
          "description":""
        },
        {
          "headline":"Clean the Brussels sprouts; take off any dried leaves and cross the base with a X cut at the bottom approx 1–1.5 centimeter (0.4–0.6 in) deep.",
          "description":""
        },
        {
          "headline":"Once the onions have gone transparent, add the Brussels sprouts, soup cube, and water just sufficient to barely cover the spouts in a saucepan.",
          "description":""
        },
        {
          "headline":"Allow the water to evaporate and serve.",
          "description":""
        }
      ]
    },
    {
      "name":"Parmesan",
      "steps":[
        {
          "headline":"Trim vegetable ends.",
          "description":"Cut in half to expose centers."
        },
        {
          "headline":"Steam the Brussels sprouts for about 10-12 minutes.",
          "description":"They should retain some crispness."
        },
        {
          "headline":"Place the sprouts on a plate or in a serving bowl.",
          "description":""
        },
        {
          "headline":"Sprinkle with butter-flavored powder and Parmesan cheese, allowing the powder and cheese to melt around the sprouts.",
          "description":"If using a bowl, toss lightly."
        }
      ]
    },
    {
      "name":"Chicken Stock",
      "steps":[
        {
          "headline":"Clean the Brussels sprouts; take off any dried leaves and cross the base with a X cut at the bottom approx 1–1.5 centimeter (0.4–0.6 in) deep.",
          "description":"You may also halve or quarter them."
        },
        {
          "headline":"Cover with chicken stock and sprinkle with a little sugar.",
          "description":""
        },
        {
          "headline":"Simmer until tender and serve.",
          "description":""
        }
      ]
    },
    {
      "name":"Water and Salt",
      "steps":[
        {
          "headline":"Cut off the base and discard loose leaves",
          "description":""
        },
        {
          "headline":"Boil 3 cups of water for each cup of sprouts, with 1 tsp salt per cup of sprouts.",
          "description":""
        },
        {
          "headline":"With water boiling, drop in sprouts for 30 seconds.",
          "description":"Remove and rinse in cold water."
        },
        {
          "headline":"Now, cook using any method desired (roasting is best).",
          "description":"This par-boiling removes most of the \"ugh\" flavors."
        }
      ]
    },
    {
      "name":"Red Wine Vinegar",
      "steps":[
        {
          "headline":"Trim to your liking.",
          "description":""
        },
        {
          "headline":"Cook them like normal",
          "description":""
        },
        {
          "headline":"Add Red Wine Vinegar to taste.",
          "description":""
        },
        {
          "headline":"Add Butter and pepper to taste.",
          "description":""
        }
      ]
    },
    {
      "name":"Mayonnaise",
      "steps":[
        {
          "headline":"Trim to your liking.",
          "description":""
        },
        {
          "headline":"Cook them like normal",
          "description":""
        },
        {
          "headline":"Eat with mayonnaise",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Lemon Juice Boil some water with a touch of salt and just a little bit of freshly squeezed lemon juice.  With a paring knife, cut an \"X\" into the base of the sprout. Then add the Brussels sprouts to the water. Do not over-cook - this is very important! They should still be crispy firm but tender. Leave the lid off the saucepan for 5 minutes during cooking. This allows the vapor to dissipate, taking the less-desirable odors with it. Serve. Your Brussels sprouts should now please even the fussiest of veggie eaters! Olive Oil Cut any dirty or brown looking leaves off while slicing off the hard bottom where the sprout is attached to the stalk.  Place into a roasting pan.  Sprinkle liberally with some salt, some fresh-ground pepper, and a little olive oil.  Toss to coat with all the above.  Roast in a slow oven until it's crisp-tender and lightly browned, stirring and lowering the temp if they brown quicker than they soften to your degree of liking.  Garlic Cut off the hard bottom and slice the brussels sprouts into shreds that resemble lettuce. Make it fairly fine. Boil a cup of water with a teaspoon of salt. Drop the shredded sprouts in for exactly two minutes - no more. Any longer, and you will have smelly, slimy mush. You just want to make them tender, slightly wilted, but with some snap left in them. Remove them to a bowl of ice water to stop the cooking and then drain, or drop them into a colander to drain, and run some cold tap water over them. Let them drain while you do the next step. Melt 1/2 stick of butter. Add 1 clove minced garlic and just heat until you can smell the garlic. Mmmmm. Remove from heat. Squeeze a lemon into the butter.  Add the drained brussels sprouts, salt and pepper to taste, and turn on the heat again. Toss the sprouts in the lemon, garlic and butter mixture, just until heated through - about one minute. Remove from heat and sprinkle with some shredded or flaked Parmesan cheese.  Enjoy!  Onion Heat the butter in a pan till melted and hot; add the chopped onion.  Clean the Brussels sprouts; take off any dried leaves and cross the base with a X cut at the bottom approx 1–1.5 centimeter (0.4–0.6 in) deep.  Once the onions have gone transparent, add the Brussels sprouts, soup cube, and water just sufficient to barely cover the spouts in a saucepan.  Allow the water to evaporate and serve.  Parmesan Trim vegetable ends. Cut in half to expose centers. Steam the Brussels sprouts for about 10-12 minutes. They should retain some crispness. Place the sprouts on a plate or in a serving bowl.  Sprinkle with butter-flavored powder and Parmesan cheese, allowing the powder and cheese to melt around the sprouts. If using a bowl, toss lightly. Chicken Stock Clean the Brussels sprouts; take off any dried leaves and cross the base with a X cut at the bottom approx 1–1.5 centimeter (0.4–0.6 in) deep. You may also halve or quarter them. Cover with chicken stock and sprinkle with a little sugar.  Simmer until tender and serve.  Water and Salt Cut off the base and discard loose leaves  Boil 3 cups of water for each cup of sprouts, with 1 tsp salt per cup of sprouts.  With water boiling, drop in sprouts for 30 seconds. Remove and rinse in cold water. Now, cook using any method desired (roasting is best). This par-boiling removes most of the \"ugh\" flavors. Red Wine Vinegar Trim to your liking.  Cook them like normal  Add Red Wine Vinegar to taste.  Add Butter and pepper to taste.  Mayonnaise Trim to your liking.  Cook them like normal  Eat with mayonnaise  Finished. ",
  "sentences":[
    " Lemon Juice Boil some water with a touch of salt and just a little bit of freshly squeezed lemon juice.",
    "With a paring knife, cut an \"X\" into the base of the sprout.",
    "Then add the Brussels sprouts to the water.",
    "Do not over-cook - this is very important!",
    "They should still be crispy firm but tender.",
    "Leave the lid off the saucepan for 5 minutes during cooking.",
    "This allows the vapor to dissipate, taking the less-desirable odors with it.",
    "Serve.",
    "Your Brussels sprouts should now please even the fussiest of veggie eaters!",
    "Olive Oil Cut any dirty or brown looking leaves off while slicing off the hard bottom where the sprout is attached to the stalk.",
    "Place into a roasting pan.",
    "Sprinkle liberally with some salt, some fresh-ground pepper, and a little olive oil.",
    "Toss to coat with all the above.",
    "Roast in a slow oven until it's crisp-tender and lightly browned, stirring and lowering the temp if they brown quicker than they soften to your degree of liking.",
    "Garlic Cut off the hard bottom and slice the brussels sprouts into shreds that resemble lettuce.",
    "Make it fairly fine.",
    "Boil a cup of water with a teaspoon of salt.",
    "Drop the shredded sprouts in for exactly two minutes - no more.",
    "Any longer, and you will have smelly, slimy mush.",
    "You just want to make them tender, slightly wilted, but with some snap left in them.",
    "Remove them to a bowl of ice water to stop the cooking and then drain, or drop them into a colander to drain, and run some cold tap water over them.",
    "Let them drain while you do the next step.",
    "Melt 1/2 stick of butter.",
    "Add 1 clove minced garlic and just heat until you can smell the garlic.",
    "Mmmmm.",
    "Remove from heat.",
    "Squeeze a lemon into the butter.",
    "Add the drained brussels sprouts, salt and pepper to taste, and turn on the heat again.",
    "Toss the sprouts in the lemon, garlic and butter mixture, just until heated through - about one minute.",
    "Remove from heat and sprinkle with some shredded or flaked Parmesan cheese.",
    "Enjoy!",
    "Onion Heat the butter in a pan till melted and hot; add the chopped onion.",
    "Clean the Brussels sprouts; take off any dried leaves and cross the base with a X cut at the bottom approx 1–1.5 centimeter (0.4–0.6 in) deep.",
    "Once the onions have gone transparent, add the Brussels sprouts, soup cube, and water just sufficient to barely cover the spouts in a saucepan.",
    "Allow the water to evaporate and serve.",
    "Parmesan Trim vegetable ends.",
    "Cut in half to expose centers.",
    "Steam the Brussels sprouts for about 10-12 minutes.",
    "They should retain some crispness.",
    "Place the sprouts on a plate or in a serving bowl.",
    "Sprinkle with butter-flavored powder and Parmesan cheese, allowing the powder and cheese to melt around the sprouts.",
    "If using a bowl, toss lightly.",
    "Chicken Stock Clean the Brussels sprouts; take off any dried leaves and cross the base with a X cut at the bottom approx 1–1.5 centimeter (0.4–0.6 in) deep.",
    "You may also halve or quarter them.",
    "Cover with chicken stock and sprinkle with a little sugar.",
    "Simmer until tender and serve.",
    "Water and Salt Cut off the base and discard loose leaves  Boil 3 cups of water for each cup of sprouts, with 1 tsp salt per cup of sprouts.",
    "With water boiling, drop in sprouts for 30 seconds.",
    "Remove and rinse in cold water.",
    "Now, cook using any method desired (roasting is best).",
    "This par-boiling removes most of the \"ugh\" flavors.",
    "Red Wine Vinegar Trim to your liking.",
    "Cook them like normal  Add Red Wine Vinegar to taste.",
    "Add Butter and pepper to taste.",
    "Mayonnaise Trim to your liking.",
    "Cook them like normal  Eat with mayonnaise  Finished."
  ],
  "tyn_section":[
    "Saucepan with lid",
    "For Methods 1 & 3",
    "Citrus juice squeezer",
    "For Method 5",
    "Steamer pot or appliance",
    "For Method 8",
    "Heavy skillet cast iron works best"
  ],
  "tyn_model":[
    "water",
    "brussels sprouts",
    "salt",
    "butter",
    "garlic",
    "saucepan",
    "olive oil",
    "lemon",
    "pepper",
    "parmesan cheese",
    "onion",
    "chicken stock",
    "red wine vinegar",
    "mayonnaise",
    "lemon juice",
    "freshly squeezed lemon juice",
    "paring knife",
    "roasting pan",
    "fresh-ground pepper",
    "oven",
    "lettuce",
    "ice water",
    "colander",
    "tap water",
    "pan",
    "onions",
    "parmesan",
    "plate",
    "serving bowl",
    "butter-flavored powder",
    "bowl",
    "sugar"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.1428571429,
    "p":0.03125,
    "f1":0.0512820513
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}