{
  "title":"How to Remove Ants from Potted Plants",
  "url":"https://www.wikihow.com/Remove-Ants-from-Potted-Plants",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds"
  ],
  "methods":[
    {
      "name":"Applying Insecticides and Baits",
      "steps":[
        {
          "headline":"Apply the insecticide permethrin to the soil.",
          "description":"When ants eat or come into contact with permethrin, their nervous system is paralyzed and the pests die. Permethrin comes in several forms: concentrated liquid, dust, powder, and aerosol. Before applying permethrin to any potted plant, read the product instructions carefully. If administered improperly, this insecticide can cause harm to humans. Use the concentrated liquid form on your potted plants. Follow the product instructions to make an effective permethrin solution and apply as instructed. If you, a family member, or pet are sprayed with and ingest permethrin, call a doctor or vet immediately."
        },
        {
          "headline":"Use a bait to destroy the entire ant colony.",
          "description":"Ants are drawn to the bait, which contains slow-acting insecticides, by sugars, oils, and proteins. Worker ants bring the poisonous food back to the colony and pass the harmful item directly to the mouths of other worker ants, larvae, and queens. As the poisonous bait is passed from ant to ant or ant to larvae, the colony slowly dwindles. You can purchase ant bait in stick form and insert it directly into the infested potted plant. You may also use a reusable bait station. Since this trap is refillable, this method is ideal to eradicate a substantial infestation. Fill the reusable bait station with the insecticide of your choice. Close the station and set it near the base of the plant. Check the bait station frequently so that you can empty and or refill it as needed. Baits are considered the safest form of insecticide. Before using ant baits, however, always read the label to ensure that it is safe to use around children and pets. Purchase baits that include one of the following active ingredients: hydramethylnon, fipronil, boric acid, or avermectin B. Do not purchase baits that contain cyfluthrin or permethrin. These fast-attacking insecticides will kill the worker ant before it can reach the colony."
        },
        {
          "headline":"Cover the topsoil with Diatomaceous Earth (DE).",
          "description":"DE is an organic, mineral-based insecticide. Using an applicator bulb is the safest way to apply diatomaceous earth. Use an applicator bulb to distribute this chalk-like substance around the base and on the soil of the infested potted plant. Within approximately 30 minutes of coming into contact with DE, the ants on the plant will die. This product is less effective when wet. Reapply this product after watering, rain, or heavy dew. Do not inhale this product. Store the remaining product inside a sealed bag to limit your exposure to the product."
        },
        {
          "headline":"Mix 1 tablespoon peppermint soap with 2 cups of water.",
          "description":"Spray this solution on the plant’s foliage. Remove ants from your plant's foliage by spraying it with water from a hose."
        }
      ]
    },
    {
      "name":"Submerging the Pot in Water",
      "steps":[
        {
          "headline":"Prepare the solution.",
          "description":"If your potted plant is totally infested with tiny pests, flooding the soil with a water-insecticide solution will cause the ants to flee their nest. The ants that come into contact with the insecticide mixture will die or drown. To prepare the solution:\nGrab a clean bucket. Fill the bucket with 1 gallon of water. (If your potted plant is large, double or triple the amount of water). Stir in 1 cup of insecticidal soap or dish soap or detergent per 1 gallon of water. Some dish soaps and detergents are a milder, less expensive, but less reliable alternatives to insecticidal soap. Branded dish soaps and detergents include: Dawn, Palmolive, Dove, Ivory, and Joy."
        },
        {
          "headline":"Divide the solution.",
          "description":"First, set aside approximately half of the solution to submerge the pot in. Find a bucket or tub that is large enough for the pot to fit inside and fill it with half the mixture. Second, fill a small spray bottle with the solution—you will use this to spray any ants that might escape from the soil. Lastly, you will pour all of the remaining solution to through the infested plant's soil."
        },
        {
          "headline":"Pour approximately half of the mixture through the soil.",
          "description":"Move the plant to a shady spot in your yard. Slowly pour half of the insecticide mixture through the soil of the potted plant. Spray any ants that escape the potted plant with the insecticide mixture. Let the planted pot sit for 1 hour. Insecticidal soap is mild and safe to use in organic gardens. These soaps contain specially formatted potassium fatty acids that kill insects on contact but are not harmful to humans or animals. Since these soaps have a low mammalian toxicity, they are considered safe to use around children and pets and are approved for use on organic farms. While it should not ruin your yard or garden, you may wish to work on a concrete patio or driveway to reduce any possible risk of damage."
        },
        {
          "headline":"Submerge the entire pot in the insecticide solution.",
          "description":"After pouring the solution through the soil, and catching the runoff in a container, pick up the pot and submerge it in the insecticide solution. Let it sit in the solution for 15 minutes. Spray any ants that escape the potted plant with the insecticide mixture. Remove the potted plant from the solution and set it on the ground."
        },
        {
          "headline":"Rinse the plant and pot with fresh water.",
          "description":"Use a hose to drench the entire potted plant with clean water. The fresh water will flush out any remaining insecticide solution. Allow the plant and soil to dry completely before moving it to a sunny location or watering it again."
        }
      ]
    },
    {
      "name":"Repotting the Plant",
      "steps":[
        {
          "headline":"Rinse the plant's roots.",
          "description":"In order to eradicate the ant colony, you need to remove and replace the infested soil. Use a gardening trowel to carefully remove the plant from the pot. Throw away any soil remaining in the pot. Gently spray the roots with a hose to dislodge any ants or infested soil. This is a messy job—work in a spot that can get dirty and wet."
        },
        {
          "headline":"Clean the pot.",
          "description":"After removing the infected soil from the pot, you need to sanitize the container. Thoroughly cleaning the pot will ensure that all traces of the infected soil are removed. Use a cloth or sponge to scrub the inside and outside of the pot with a 1:10 bleach to water solution."
        },
        {
          "headline":"Replant the pot.",
          "description":"Fill your pot with fresh, uninfected soil. Insert the plant into the clean soil and fill in any gaps with more dirt. When you have finished, water your plant thoroughly. If the plant’s roots are getting too big for the pot, replant it in a larger pot."
        }
      ]
    },
    {
      "name":"Using Household Products",
      "steps":[
        {
          "headline":"Spread coffee grounds on the soil.",
          "description":"Ants detest coffee grounds and will avoid them if they are able. Sprinkle some of the grounds on the plant’s soil. Spread a small circle of coffee grounds around the base of the plant."
        },
        {
          "headline":"Surround your plants with household products that are toxic or deterrents to ants.",
          "description":"If you are uncomfortable using insecticides, especially if they have pets or children, there are several items in your kitchen cupboards that can kill or deter ants. These items include baking soda, pepper, cinnamon, chili powder, and peppermint. Encircle the base of your potted plant with a narrow ring of one of these products."
        },
        {
          "headline":"Create a non-toxic ant trap.",
          "description":"If you prefer not to use chemicals to kill the ants, you may set up a non-toxic sticky trap. Surround your plant with contact paper instead of ant bait. As the ants try to cross the contact paper, they will get stuck. Cut out a ring of contact paper that fits tightly around the base of your potted plant. Separate the two layers and place the non-sticky side of the contact paper on the ground. Set your plant directly in the center of the contact paper ring (on top of the sticky side). Replace as needed."
        }
      ]
    }
  ],
  "text":" Applying Insecticides and Baits Apply the insecticide permethrin to the soil. When ants eat or come into contact with permethrin, their nervous system is paralyzed and the pests die. Permethrin comes in several forms: concentrated liquid, dust, powder, and aerosol. Before applying permethrin to any potted plant, read the product instructions carefully. If administered improperly, this insecticide can cause harm to humans. Use the concentrated liquid form on your potted plants. Follow the product instructions to make an effective permethrin solution and apply as instructed. If you, a family member, or pet are sprayed with and ingest permethrin, call a doctor or vet immediately. Use a bait to destroy the entire ant colony. Ants are drawn to the bait, which contains slow-acting insecticides, by sugars, oils, and proteins. Worker ants bring the poisonous food back to the colony and pass the harmful item directly to the mouths of other worker ants, larvae, and queens. As the poisonous bait is passed from ant to ant or ant to larvae, the colony slowly dwindles. You can purchase ant bait in stick form and insert it directly into the infested potted plant. You may also use a reusable bait station. Since this trap is refillable, this method is ideal to eradicate a substantial infestation. Fill the reusable bait station with the insecticide of your choice. Close the station and set it near the base of the plant. Check the bait station frequently so that you can empty and or refill it as needed. Baits are considered the safest form of insecticide. Before using ant baits, however, always read the label to ensure that it is safe to use around children and pets. Purchase baits that include one of the following active ingredients: hydramethylnon, fipronil, boric acid, or avermectin B. Do not purchase baits that contain cyfluthrin or permethrin. These fast-attacking insecticides will kill the worker ant before it can reach the colony. Cover the topsoil with Diatomaceous Earth (DE). DE is an organic, mineral-based insecticide. Using an applicator bulb is the safest way to apply diatomaceous earth. Use an applicator bulb to distribute this chalk-like substance around the base and on the soil of the infested potted plant. Within approximately 30 minutes of coming into contact with DE, the ants on the plant will die. This product is less effective when wet. Reapply this product after watering, rain, or heavy dew. Do not inhale this product. Store the remaining product inside a sealed bag to limit your exposure to the product. Mix 1 tablespoon peppermint soap with 2 cups of water. Spray this solution on the plant’s foliage. Remove ants from your plant's foliage by spraying it with water from a hose. Submerging the Pot in Water Prepare the solution. If your potted plant is totally infested with tiny pests, flooding the soil with a water-insecticide solution will cause the ants to flee their nest. The ants that come into contact with the insecticide mixture will die or drown. To prepare the solution:\nGrab a clean bucket. Fill the bucket with 1 gallon of water. (If your potted plant is large, double or triple the amount of water). Stir in 1 cup of insecticidal soap or dish soap or detergent per 1 gallon of water. Some dish soaps and detergents are a milder, less expensive, but less reliable alternatives to insecticidal soap. Branded dish soaps and detergents include: Dawn, Palmolive, Dove, Ivory, and Joy. Divide the solution. First, set aside approximately half of the solution to submerge the pot in. Find a bucket or tub that is large enough for the pot to fit inside and fill it with half the mixture. Second, fill a small spray bottle with the solution—you will use this to spray any ants that might escape from the soil. Lastly, you will pour all of the remaining solution to through the infested plant's soil. Pour approximately half of the mixture through the soil. Move the plant to a shady spot in your yard. Slowly pour half of the insecticide mixture through the soil of the potted plant. Spray any ants that escape the potted plant with the insecticide mixture. Let the planted pot sit for 1 hour. Insecticidal soap is mild and safe to use in organic gardens. These soaps contain specially formatted potassium fatty acids that kill insects on contact but are not harmful to humans or animals. Since these soaps have a low mammalian toxicity, they are considered safe to use around children and pets and are approved for use on organic farms. While it should not ruin your yard or garden, you may wish to work on a concrete patio or driveway to reduce any possible risk of damage. Submerge the entire pot in the insecticide solution. After pouring the solution through the soil, and catching the runoff in a container, pick up the pot and submerge it in the insecticide solution. Let it sit in the solution for 15 minutes. Spray any ants that escape the potted plant with the insecticide mixture. Remove the potted plant from the solution and set it on the ground. Rinse the plant and pot with fresh water. Use a hose to drench the entire potted plant with clean water. The fresh water will flush out any remaining insecticide solution. Allow the plant and soil to dry completely before moving it to a sunny location or watering it again. Repotting the Plant Rinse the plant's roots. In order to eradicate the ant colony, you need to remove and replace the infested soil. Use a gardening trowel to carefully remove the plant from the pot. Throw away any soil remaining in the pot. Gently spray the roots with a hose to dislodge any ants or infested soil. This is a messy job—work in a spot that can get dirty and wet. Clean the pot. After removing the infected soil from the pot, you need to sanitize the container. Thoroughly cleaning the pot will ensure that all traces of the infected soil are removed. Use a cloth or sponge to scrub the inside and outside of the pot with a 1:10 bleach to water solution. Replant the pot. Fill your pot with fresh, uninfected soil. Insert the plant into the clean soil and fill in any gaps with more dirt. When you have finished, water your plant thoroughly. If the plant’s roots are getting too big for the pot, replant it in a larger pot. Using Household Products Spread coffee grounds on the soil. Ants detest coffee grounds and will avoid them if they are able. Sprinkle some of the grounds on the plant’s soil. Spread a small circle of coffee grounds around the base of the plant. Surround your plants with household products that are toxic or deterrents to ants. If you are uncomfortable using insecticides, especially if they have pets or children, there are several items in your kitchen cupboards that can kill or deter ants. These items include baking soda, pepper, cinnamon, chili powder, and peppermint. Encircle the base of your potted plant with a narrow ring of one of these products. Create a non-toxic ant trap. If you prefer not to use chemicals to kill the ants, you may set up a non-toxic sticky trap. Surround your plant with contact paper instead of ant bait. As the ants try to cross the contact paper, they will get stuck. Cut out a ring of contact paper that fits tightly around the base of your potted plant. Separate the two layers and place the non-sticky side of the contact paper on the ground. Set your plant directly in the center of the contact paper ring (on top of the sticky side). Replace as needed.",
  "sentences":[
    " Applying Insecticides and Baits Apply the insecticide permethrin to the soil.",
    "When ants eat or come into contact with permethrin, their nervous system is paralyzed and the pests die.",
    "Permethrin comes in several forms: concentrated liquid, dust, powder, and aerosol.",
    "Before applying permethrin to any potted plant, read the product instructions carefully.",
    "If administered improperly, this insecticide can cause harm to humans.",
    "Use the concentrated liquid form on your potted plants.",
    "Follow the product instructions to make an effective permethrin solution and apply as instructed.",
    "If you, a family member, or pet are sprayed with and ingest permethrin, call a doctor or vet immediately.",
    "Use a bait to destroy the entire ant colony.",
    "Ants are drawn to the bait, which contains slow-acting insecticides, by sugars, oils, and proteins.",
    "Worker ants bring the poisonous food back to the colony and pass the harmful item directly to the mouths of other worker ants, larvae, and queens.",
    "As the poisonous bait is passed from ant to ant or ant to larvae, the colony slowly dwindles.",
    "You can purchase ant bait in stick form and insert it directly into the infested potted plant.",
    "You may also use a reusable bait station.",
    "Since this trap is refillable, this method is ideal to eradicate a substantial infestation.",
    "Fill the reusable bait station with the insecticide of your choice.",
    "Close the station and set it near the base of the plant.",
    "Check the bait station frequently so that you can empty and or refill it as needed.",
    "Baits are considered the safest form of insecticide.",
    "Before using ant baits, however, always read the label to ensure that it is safe to use around children and pets.",
    "Purchase baits that include one of the following active ingredients: hydramethylnon, fipronil, boric acid, or avermectin B.",
    "Do not purchase baits that contain cyfluthrin or permethrin.",
    "These fast-attacking insecticides will kill the worker ant before it can reach the colony.",
    "Cover the topsoil with Diatomaceous Earth (DE).",
    "DE is an organic, mineral-based insecticide.",
    "Using an applicator bulb is the safest way to apply diatomaceous earth.",
    "Use an applicator bulb to distribute this chalk-like substance around the base and on the soil of the infested potted plant.",
    "Within approximately 30 minutes of coming into contact with DE, the ants on the plant will die.",
    "This product is less effective when wet.",
    "Reapply this product after watering, rain, or heavy dew.",
    "Do not inhale this product.",
    "Store the remaining product inside a sealed bag to limit your exposure to the product.",
    "Mix 1 tablespoon peppermint soap with 2 cups of water.",
    "Spray this solution on the plant’s foliage.",
    "Remove ants from your plant's foliage by spraying it with water from a hose.",
    "Submerging the Pot in Water Prepare the solution.",
    "If your potted plant is totally infested with tiny pests, flooding the soil with a water-insecticide solution will cause the ants to flee their nest.",
    "The ants that come into contact with the insecticide mixture will die or drown.",
    "To prepare the solution:\nGrab a clean bucket.",
    "Fill the bucket with 1 gallon of water.",
    "(If your potted plant is large, double or triple the amount of water).",
    "Stir in 1 cup of insecticidal soap or dish soap or detergent per 1 gallon of water.",
    "Some dish soaps and detergents are a milder, less expensive, but less reliable alternatives to insecticidal soap.",
    "Branded dish soaps and detergents include: Dawn, Palmolive, Dove, Ivory, and Joy.",
    "Divide the solution.",
    "First, set aside approximately half of the solution to submerge the pot in.",
    "Find a bucket or tub that is large enough for the pot to fit inside and fill it with half the mixture.",
    "Second, fill a small spray bottle with the solution—you will use this to spray any ants that might escape from the soil.",
    "Lastly, you will pour all of the remaining solution to through the infested plant's soil.",
    "Pour approximately half of the mixture through the soil.",
    "Move the plant to a shady spot in your yard.",
    "Slowly pour half of the insecticide mixture through the soil of the potted plant.",
    "Spray any ants that escape the potted plant with the insecticide mixture.",
    "Let the planted pot sit for 1 hour.",
    "Insecticidal soap is mild and safe to use in organic gardens.",
    "These soaps contain specially formatted potassium fatty acids that kill insects on contact but are not harmful to humans or animals.",
    "Since these soaps have a low mammalian toxicity, they are considered safe to use around children and pets and are approved for use on organic farms.",
    "While it should not ruin your yard or garden, you may wish to work on a concrete patio or driveway to reduce any possible risk of damage.",
    "Submerge the entire pot in the insecticide solution.",
    "After pouring the solution through the soil, and catching the runoff in a container, pick up the pot and submerge it in the insecticide solution.",
    "Let it sit in the solution for 15 minutes.",
    "Spray any ants that escape the potted plant with the insecticide mixture.",
    "Remove the potted plant from the solution and set it on the ground.",
    "Rinse the plant and pot with fresh water.",
    "Use a hose to drench the entire potted plant with clean water.",
    "The fresh water will flush out any remaining insecticide solution.",
    "Allow the plant and soil to dry completely before moving it to a sunny location or watering it again.",
    "Repotting the Plant Rinse the plant's roots.",
    "In order to eradicate the ant colony, you need to remove and replace the infested soil.",
    "Use a gardening trowel to carefully remove the plant from the pot.",
    "Throw away any soil remaining in the pot.",
    "Gently spray the roots with a hose to dislodge any ants or infested soil.",
    "This is a messy job—work in a spot that can get dirty and wet.",
    "Clean the pot.",
    "After removing the infected soil from the pot, you need to sanitize the container.",
    "Thoroughly cleaning the pot will ensure that all traces of the infected soil are removed.",
    "Use a cloth or sponge to scrub the inside and outside of the pot with a 1:10 bleach to water solution.",
    "Replant the pot.",
    "Fill your pot with fresh, uninfected soil.",
    "Insert the plant into the clean soil and fill in any gaps with more dirt.",
    "When you have finished, water your plant thoroughly.",
    "If the plant’s roots are getting too big for the pot, replant it in a larger pot.",
    "Using Household Products Spread coffee grounds on the soil.",
    "Ants detest coffee grounds and will avoid them if they are able.",
    "Sprinkle some of the grounds on the plant’s soil.",
    "Spread a small circle of coffee grounds around the base of the plant.",
    "Surround your plants with household products that are toxic or deterrents to ants.",
    "If you are uncomfortable using insecticides, especially if they have pets or children, there are several items in your kitchen cupboards that can kill or deter ants.",
    "These items include baking soda, pepper, cinnamon, chili powder, and peppermint.",
    "Encircle the base of your potted plant with a narrow ring of one of these products.",
    "Create a non-toxic ant trap.",
    "If you prefer not to use chemicals to kill the ants, you may set up a non-toxic sticky trap.",
    "Surround your plant with contact paper instead of ant bait.",
    "As the ants try to cross the contact paper, they will get stuck.",
    "Cut out a ring of contact paper that fits tightly around the base of your potted plant.",
    "Separate the two layers and place the non-sticky side of the contact paper on the ground.",
    "Set your plant directly in the center of the contact paper ring (on top of the sticky side).",
    "Replace as needed."
  ],
  "tyn_section":[
    "Treating the Plant with Insecticides and Baits",
    "Permethrin insecticide",
    "Ant bait",
    "Diatomaceous earth (DE)",
    "Submerging the Plant in Water",
    "Clean bucket",
    "1 gallon of water",
    "1 cup of insecticide soap or dish soap",
    "Clean spray bottle",
    "Tub or bucket large enough for the pot to fit inside",
    "Hose",
    "Fresh potting soil",
    "1:10 bleach to water solution",
    "Spray bottle",
    "Sponge or rag",
    "Preventing or Treating Ant Infestation with Natural Household Products",
    "Coffee grounds",
    "Baking soda",
    "Pepper",
    "Cinnamon",
    "Chili powder",
    "Peppermint",
    "Contact paper"
  ],
  "tyn_model":[
    "water",
    "pot",
    "permethrin",
    "contact paper",
    "insecticidal soap",
    "insecticide mixture",
    "insecticide solution",
    "coffee grounds",
    "insecticides",
    "ant bait",
    "insecticide",
    "diatomaceous earth",
    "de",
    "bucket",
    "dish soaps",
    "hose",
    "insecticide permethrin",
    "bait",
    "hydramethylnon,",
    "fipronil",
    "boric acid",
    "applicator bulb",
    "peppermint soap",
    "water-insecticide solution",
    "dish soap",
    "dawn",
    "palmolive",
    "dove",
    "ivory",
    "joy",
    "spray bottle",
    "—you",
    "soaps",
    "potassium fatty acids",
    "container",
    "gardening trowel",
    "—work",
    "sponge",
    "baking soda",
    "pepper",
    "cinnamon",
    "chili powder"
  ],
  "simple_metrics":{
    "r":0.3913043478,
    "p":0.2142857143,
    "f1":0.2769230769,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6086956522,
    "p":0.380952381,
    "f1":0.4686192469
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.652173913,
    "p":0.4523809524,
    "f1":0.53420806
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5217391304,
    "p":0.2619047619,
    "f1":0.3487450462
  }
}