{
  "title":"How to Make Unlined Curtains",
  "url":"https://www.wikihow.com/Make-Unlined-Curtains",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows",
    "Window Treatments",
    "Curtains"
  ],
  "methods":[
    {
      "name":"Choosing Your Fabric",
      "steps":[
        {
          "headline":"Select a fabric to meet your lighting purposes.",
          "description":"Because your curtains are going to be unlined, they will still allow some sunlight through. For the lightest look, choose curtains made of lace or a sheer cloth. These will allow the most light through while still showing a simple pattern or color. If you want to block out sunlight, look for a heavy linen fabric. Even without being lined this fabric will dampen the amount of light shining through them, making your room much darker. If you choose a fabric that is patterned, try to find one that is patterned only on one side or that has an identical pattern on both sides. This is because when the sun shines through the fabric, it will cause you to see both patterns at once, making it appear very disorienting. Using a fabric with a high thread count (500+) is more expensive, but will block the most sunlight because it is tightly woven."
        },
        {
          "headline":"Choose a texture of fabric.",
          "description":"Although you may not be touching your curtains all the time, the texture of the fabric gives a different appearance when hung in the light. Cotton and polyester fabrics are the most basic for curtain use, and the easiest to sew. Avoid using silk or satin, as they will deteriorate in the sunlight. Sewing jersey knit fabrics is very difficult as they stretch when pulled. They will also begin to puddle on the floor after being hung because of their elasticity. Don’t choose a fabric that is too stiff, as it won’t drape when hung. An example of this is tulle, which offers a pretty option for sheer fabric, but is much too inflexible."
        },
        {
          "headline":"Get creative with your fabric.",
          "description":"You don’t have to purchase your fabric at a fabric store, look in second-hand, vintage, and consignment shops for great fabric. Try finding vintage tablecloths in the size you need to fit your window. These offer a fun mod look to your room. Using patterned sheets is a cheap alternative to buying yardage of fabric. You can look for brand new or vintage sheets in antique or consignment shops."
        }
      ]
    },
    {
      "name":"Making No-Sew Unlined Curtains",
      "steps":[
        {
          "headline":"Hang your curtain rod.",
          "description":"In order to know where to measure your fabric, you need to know from how high you will be hanging it. To give the illusion of high ceilings, hang the curtain rod as near to the ceiling as you can, or a foot or more above the top of your window. If you want your curtains to puddle on the floor, measure them 6–12 inches (15.2–30.5 cm) longer than the total length from the curtain rod to the floor."
        },
        {
          "headline":"Measure your fabric.",
          "description":"Depending on what appearance you are looking for, the width of the fabric may differ. If you want your panels to completely cover your window, each should measure the width of half the window plus two inches. For example, if your window is 48 inches (121.9 cm) wide, then each panel should be 24 inches (61.0 cm) plus an extra two each, 26 inches (66.0 cm) for each. If your panels are only ornamental, measure them to be 1/4 of the total width of the window."
        },
        {
          "headline":"Measure your hem.",
          "description":"You will want it to measure about half an inch in on every side. You will create the hem by folding the edge of the fabric over, thus giving a clean edge to the curtain."
        },
        {
          "headline":"Apply iron-on tape to one side of the curtain.",
          "description":"The tape should meet the edge of where the hem will begin, so that you can fold the edge of the fabric over and use the iron-tape to secure the folded section."
        },
        {
          "headline":"Use an iron to stick the tape to the fabric.",
          "description":"Make sure your fold is straight, and hem the edge with the tape in between. Iron over the folded top so that the heat can cause the tape to stick to the two pieces."
        },
        {
          "headline":"Continue ironing all four edges.",
          "description":"If necessary, apply extra ironing tape at the corners to get them to stick."
        },
        {
          "headline":"Attach clip-on rings.",
          "description":"Evenly space them along the top of the curtain to allow for even draping."
        },
        {
          "headline":"Hang your curtains.",
          "description":"Slide the clip-on rings over the curtain rod and adjust the hang to meet your aesthetic preferences. Enjoy!"
        }
      ]
    },
    {
      "name":"Making Unlined Curtains Using a Sewing Machine",
      "steps":[
        {
          "headline":"Measure your fabric.",
          "description":"Similar to no-sew curtains, you need to decide how much of the window you want covered and then give an extra allowance for the hem. Allow six inches of extra fabric at the top of the curtains to create the loop for the curtain rod. Sewing a hem requires less extra fabric to fold over than an iron-on hem, so feel free to reduce the folded edge to only a few centimeters, at least two minimum though."
        },
        {
          "headline":"Fold over the hems and iron.",
          "description":"You need to create a distinct fold for the hem to make it easier to sew. Pin the hem in place with straight pins."
        },
        {
          "headline":"Sew the length of the curtains.",
          "description":"You can hand stitch or use a sewing machine, but the latter will take significantly less time. Sew along the hem that you just ironed, removing the pins as you go."
        },
        {
          "headline":"Sew the width of the curtains.",
          "description":"Follow the same rules as above by ironing along the hem and removing pins as you go."
        },
        {
          "headline":"Apply the heading tape.",
          "description":"Measure the tape to match the width of the curtains, and iron onto the top of the panel. This will stiffen the top edge, making it sturdier for hanging."
        },
        {
          "headline":"Fold over the top six inches to create a loop.",
          "description":"If your curtain rod is larger, adjust this by adding more fabric for the loop."
        },
        {
          "headline":"Sew along the top, creating a loop.",
          "description":"Make sure the loop is even all the way across, or else it will not allow the curtain rod to go through or will drape unevenly."
        },
        {
          "headline":"Hem the bottom.",
          "description":"Take down the curtain and turn up a double hem to the marked length and press. To make a neat finish at the lower corners, open out the folds at the sides (unpick the side hem you've already sewn), and the hem. Fold in the corner at an angle, then carefully refold all the turnings to make a 'mitered corner'. Hand-sew the hem and the miter (you can use the machine if you’re in a hurry)."
        },
        {
          "headline":"Hang your curtains.",
          "description":"Slide the rod through the loop you’ve created, and drape the curtains to match your taste. Enjoy your newly made curtains!"
        }
      ]
    }
  ],
  "text":" Choosing Your Fabric Select a fabric to meet your lighting purposes. Because your curtains are going to be unlined, they will still allow some sunlight through. For the lightest look, choose curtains made of lace or a sheer cloth. These will allow the most light through while still showing a simple pattern or color. If you want to block out sunlight, look for a heavy linen fabric. Even without being lined this fabric will dampen the amount of light shining through them, making your room much darker. If you choose a fabric that is patterned, try to find one that is patterned only on one side or that has an identical pattern on both sides. This is because when the sun shines through the fabric, it will cause you to see both patterns at once, making it appear very disorienting. Using a fabric with a high thread count (500+) is more expensive, but will block the most sunlight because it is tightly woven. Choose a texture of fabric. Although you may not be touching your curtains all the time, the texture of the fabric gives a different appearance when hung in the light. Cotton and polyester fabrics are the most basic for curtain use, and the easiest to sew. Avoid using silk or satin, as they will deteriorate in the sunlight. Sewing jersey knit fabrics is very difficult as they stretch when pulled. They will also begin to puddle on the floor after being hung because of their elasticity. Don’t choose a fabric that is too stiff, as it won’t drape when hung. An example of this is tulle, which offers a pretty option for sheer fabric, but is much too inflexible. Get creative with your fabric. You don’t have to purchase your fabric at a fabric store, look in second-hand, vintage, and consignment shops for great fabric. Try finding vintage tablecloths in the size you need to fit your window. These offer a fun mod look to your room. Using patterned sheets is a cheap alternative to buying yardage of fabric. You can look for brand new or vintage sheets in antique or consignment shops. Making No-Sew Unlined Curtains Hang your curtain rod. In order to know where to measure your fabric, you need to know from how high you will be hanging it. To give the illusion of high ceilings, hang the curtain rod as near to the ceiling as you can, or a foot or more above the top of your window. If you want your curtains to puddle on the floor, measure them 6–12 inches (15.2–30.5 cm) longer than the total length from the curtain rod to the floor. Measure your fabric. Depending on what appearance you are looking for, the width of the fabric may differ. If you want your panels to completely cover your window, each should measure the width of half the window plus two inches. For example, if your window is 48 inches (121.9 cm) wide, then each panel should be 24 inches (61.0 cm) plus an extra two each, 26 inches (66.0 cm) for each. If your panels are only ornamental, measure them to be 1/4 of the total width of the window. Measure your hem. You will want it to measure about half an inch in on every side. You will create the hem by folding the edge of the fabric over, thus giving a clean edge to the curtain. Apply iron-on tape to one side of the curtain. The tape should meet the edge of where the hem will begin, so that you can fold the edge of the fabric over and use the iron-tape to secure the folded section. Use an iron to stick the tape to the fabric. Make sure your fold is straight, and hem the edge with the tape in between. Iron over the folded top so that the heat can cause the tape to stick to the two pieces. Continue ironing all four edges. If necessary, apply extra ironing tape at the corners to get them to stick. Attach clip-on rings. Evenly space them along the top of the curtain to allow for even draping. Hang your curtains. Slide the clip-on rings over the curtain rod and adjust the hang to meet your aesthetic preferences. Enjoy! Making Unlined Curtains Using a Sewing Machine Measure your fabric. Similar to no-sew curtains, you need to decide how much of the window you want covered and then give an extra allowance for the hem. Allow six inches of extra fabric at the top of the curtains to create the loop for the curtain rod. Sewing a hem requires less extra fabric to fold over than an iron-on hem, so feel free to reduce the folded edge to only a few centimeters, at least two minimum though. Fold over the hems and iron. You need to create a distinct fold for the hem to make it easier to sew. Pin the hem in place with straight pins. Sew the length of the curtains. You can hand stitch or use a sewing machine, but the latter will take significantly less time. Sew along the hem that you just ironed, removing the pins as you go. Sew the width of the curtains. Follow the same rules as above by ironing along the hem and removing pins as you go. Apply the heading tape. Measure the tape to match the width of the curtains, and iron onto the top of the panel. This will stiffen the top edge, making it sturdier for hanging. Fold over the top six inches to create a loop. If your curtain rod is larger, adjust this by adding more fabric for the loop. Sew along the top, creating a loop. Make sure the loop is even all the way across, or else it will not allow the curtain rod to go through or will drape unevenly. Hem the bottom. Take down the curtain and turn up a double hem to the marked length and press. To make a neat finish at the lower corners, open out the folds at the sides (unpick the side hem you've already sewn), and the hem. Fold in the corner at an angle, then carefully refold all the turnings to make a 'mitered corner'. Hand-sew the hem and the miter (you can use the machine if you’re in a hurry). Hang your curtains. Slide the rod through the loop you’ve created, and drape the curtains to match your taste. Enjoy your newly made curtains!",
  "sentences":[
    " Choosing Your Fabric Select a fabric to meet your lighting purposes.",
    "Because your curtains are going to be unlined, they will still allow some sunlight through.",
    "For the lightest look, choose curtains made of lace or a sheer cloth.",
    "These will allow the most light through while still showing a simple pattern or color.",
    "If you want to block out sunlight, look for a heavy linen fabric.",
    "Even without being lined this fabric will dampen the amount of light shining through them, making your room much darker.",
    "If you choose a fabric that is patterned, try to find one that is patterned only on one side or that has an identical pattern on both sides.",
    "This is because when the sun shines through the fabric, it will cause you to see both patterns at once, making it appear very disorienting.",
    "Using a fabric with a high thread count (500+) is more expensive, but will block the most sunlight because it is tightly woven.",
    "Choose a texture of fabric.",
    "Although you may not be touching your curtains all the time, the texture of the fabric gives a different appearance when hung in the light.",
    "Cotton and polyester fabrics are the most basic for curtain use, and the easiest to sew.",
    "Avoid using silk or satin, as they will deteriorate in the sunlight.",
    "Sewing jersey knit fabrics is very difficult as they stretch when pulled.",
    "They will also begin to puddle on the floor after being hung because of their elasticity.",
    "Don’t choose a fabric that is too stiff, as it won’t drape when hung.",
    "An example of this is tulle, which offers a pretty option for sheer fabric, but is much too inflexible.",
    "Get creative with your fabric.",
    "You don’t have to purchase your fabric at a fabric store, look in second-hand, vintage, and consignment shops for great fabric.",
    "Try finding vintage tablecloths in the size you need to fit your window.",
    "These offer a fun mod look to your room.",
    "Using patterned sheets is a cheap alternative to buying yardage of fabric.",
    "You can look for brand new or vintage sheets in antique or consignment shops.",
    "Making No-Sew Unlined Curtains Hang your curtain rod.",
    "In order to know where to measure your fabric, you need to know from how high you will be hanging it.",
    "To give the illusion of high ceilings, hang the curtain rod as near to the ceiling as you can, or a foot or more above the top of your window.",
    "If you want your curtains to puddle on the floor, measure them 6–12 inches (15.2–30.5 cm) longer than the total length from the curtain rod to the floor.",
    "Measure your fabric.",
    "Depending on what appearance you are looking for, the width of the fabric may differ.",
    "If you want your panels to completely cover your window, each should measure the width of half the window plus two inches.",
    "For example, if your window is 48 inches (121.9 cm) wide, then each panel should be 24 inches (61.0 cm) plus an extra two each, 26 inches (66.0 cm) for each.",
    "If your panels are only ornamental, measure them to be 1/4 of the total width of the window.",
    "Measure your hem.",
    "You will want it to measure about half an inch in on every side.",
    "You will create the hem by folding the edge of the fabric over, thus giving a clean edge to the curtain.",
    "Apply iron-on tape to one side of the curtain.",
    "The tape should meet the edge of where the hem will begin, so that you can fold the edge of the fabric over and use the iron-tape to secure the folded section.",
    "Use an iron to stick the tape to the fabric.",
    "Make sure your fold is straight, and hem the edge with the tape in between.",
    "Iron over the folded top so that the heat can cause the tape to stick to the two pieces.",
    "Continue ironing all four edges.",
    "If necessary, apply extra ironing tape at the corners to get them to stick.",
    "Attach clip-on rings.",
    "Evenly space them along the top of the curtain to allow for even draping.",
    "Hang your curtains.",
    "Slide the clip-on rings over the curtain rod and adjust the hang to meet your aesthetic preferences.",
    "Enjoy!",
    "Making Unlined Curtains Using a Sewing Machine Measure your fabric.",
    "Similar to no-sew curtains, you need to decide how much of the window you want covered and then give an extra allowance for the hem.",
    "Allow six inches of extra fabric at the top of the curtains to create the loop for the curtain rod.",
    "Sewing a hem requires less extra fabric to fold over than an iron-on hem, so feel free to reduce the folded edge to only a few centimeters, at least two minimum though.",
    "Fold over the hems and iron.",
    "You need to create a distinct fold for the hem to make it easier to sew.",
    "Pin the hem in place with straight pins.",
    "Sew the length of the curtains.",
    "You can hand stitch or use a sewing machine, but the latter will take significantly less time.",
    "Sew along the hem that you just ironed, removing the pins as you go.",
    "Sew the width of the curtains.",
    "Follow the same rules as above by ironing along the hem and removing pins as you go.",
    "Apply the heading tape.",
    "Measure the tape to match the width of the curtains, and iron onto the top of the panel.",
    "This will stiffen the top edge, making it sturdier for hanging.",
    "Fold over the top six inches to create a loop.",
    "If your curtain rod is larger, adjust this by adding more fabric for the loop.",
    "Sew along the top, creating a loop.",
    "Make sure the loop is even all the way across, or else it will not allow the curtain rod to go through or will drape unevenly.",
    "Hem the bottom.",
    "Take down the curtain and turn up a double hem to the marked length and press.",
    "To make a neat finish at the lower corners, open out the folds at the sides (unpick the side hem you've already sewn), and the hem.",
    "Fold in the corner at an angle, then carefully refold all the turnings to make a 'mitered corner'.",
    "Hand-sew the hem and the miter (you can use the machine if you’re in a hurry).",
    "Hang your curtains.",
    "Slide the rod through the loop you’ve created, and drape the curtains to match your taste.",
    "Enjoy your newly made curtains!"
  ],
  "tyn_section":[
    "Fabric",
    "Curtain heading tape",
    "Metal measuring tape",
    "Good dressmaking scissors",
    "Sewing machine",
    "Needle",
    "Pins",
    "Pencil",
    "Thread",
    "Iron-on tape"
  ],
  "tyn_model":[
    "fabric",
    "curtains",
    "curtain rod",
    "iron",
    "sheets",
    "sewing machine",
    "jersey knit fabrics",
    "tulle",
    "tablecloths",
    "iron-on tape",
    "iron-tape",
    "ironing tape",
    "clip-on rings",
    "clip-",
    "iron-on hem",
    "straight pins",
    "heading tape",
    "tape",
    "curtain",
    "miter",
    "rod"
  ],
  "simple_metrics":{
    "r":0.3,
    "p":0.1428571429,
    "f1":0.1935483871,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2857142857,
    "f1":0.3636363636
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.4285714286,
    "f1":0.5
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.1904761905,
    "f1":0.2580645161
  }
}