{
  "title":"How to Cook Short Grain Brown Rice",
  "url":"https://www.wikihow.com/Cook-Short-Grain-Brown-Rice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "parts":[
    {
      "name":"Combining the Ingredients",
      "steps":[
        {
          "headline":"Run the rice under cold water for about 10 seconds in a fine mesh colander.",
          "description":"While short-grain rice is meant to be starchier than long-grain rice, running the rice under water will help to get rid of any excess starch that does nothing but add cholesterol. Pour your rice into a rice strainer or fine mesh colander and run water over it for just a few seconds. Usually, you would run water over rice for about 30 seconds, but because short grain rice is meant to be sticky, you do not want to get rid of too much."
        },
        {
          "headline":"Combine your water, salt, and butter or vegetable oil in a saucepan.",
          "description":"Add 2 cups (470 ml) of water, 1 teaspoon (5.7 g) of salt, and 2 tablespoons (30 ml) of unsalted vegetable oil to a heavy-bottomed saucepan, but do not turn on the heat. The salt will let the water get hotter before it reaches a boil, while vegetable oil improves the texture and flavor of the rice. The heavy-bottomed saucepan will cook the rice more evenly. You can use butter instead of vegetable oil for a creamier texture. Generally, you should aim for a 2 to 1 ratio of water to rice. If you want to make more, take the amount of rice you want to make, double it, and add that much water. You should add more salt and butter to the mix in a proportional amount (so if you make twice the amount of rice, add twice the amount of salt and butter)."
        },
        {
          "headline":"Squeeze 2 tablespoons (30 ml) of lemon juice into the saucepan if you so desire.",
          "description":"Lemon juice adds a subtle zest to rice, which greatly improves its flavor if eaten as a side or alone without additions, but it is not needed to cook the rice fully. The starch of short grain rice brings out the citrus flavor more fully than long-grain rice. You can also use the juice of an orange, if you don't like lemon, although it will not produce quite as strong of a citrus flavor. If you do use an orange, add about 2 tbsp (14 g) of orange zest to the rice after cooking."
        },
        {
          "headline":"Add the rice and give the mix a few stirs.",
          "description":"Add 1 cup (180 g) of rice to the saucepan and stir the mix to get the rice evenly spread around the saucepan. Don't stir or disturb the rice while it cooks, or it won't cook evenly. Make sure you have about double the amount of water as you do rice to cook it without having to use a rice strainer later on."
        }
      ]
    },
    {
      "name":"Boiling and Simmering",
      "steps":[
        {
          "headline":"Bring the rice to a rolling boil on high heat.",
          "description":"It is very important that you do not have the heat on until all the ingredients are combined. Turn your stovetop to near-max heat, and allow the rice to come to a rapid rolling boil."
        },
        {
          "headline":"Reduce the heat to low and cover tightly as soon as it boils.",
          "description":"The water has reached a rolling boil after bubbles form, rise, and burst rapidly. Turn the heat to low and cover the saucepan tightly. It is very important that you do not remove the cover at all during the cooking process, as the heat needs to be trapped to properly cook the rice. If the lid is removed even for a peek, the rice will cook unevenly."
        },
        {
          "headline":"Cook the rice for a further 45 minutes.",
          "description":"Keeping the heat on low, let the rice cook for three-quarters of an hour. Make sure the lid is on there nice and tight before finding something to do. You can use this time to prepare veggies and other additions for your rice."
        }
      ]
    },
    {
      "name":"Serving the Rice",
      "steps":[
        {
          "headline":"Remove the saucepan from the heat and let the rice sit for 5 to 10 minutes.",
          "description":"This allows the rice to fully absorb the rest of the water in the saucepan while letting it cool down enough to eat. Even though the saucepan is off the heat, do not remove the lid yet, as this traps the water and steam, and the rice will finish cooking on its own."
        },
        {
          "headline":"Remove the cover and fluff the rice with a fork.",
          "description":"With the cover finally removed, the rice may look a little deflated. Using a fork, gently fluff the rice by inserting it into the center and raising it, as if you were slowly whisking eggs, until you have fluffed the entire mix. Fluffing with a fork is better than with a spoon or other utensil as the gaps between prongs allow proper mixing and allow excess water to evaporate. Your rice should end up plump but still sticky — it should look like it fills the saucepan ever so slightly more than when it was un-fluffed."
        },
        {
          "headline":"Serve it hot alongside your favorite foods.",
          "description":"Short-grain brown rice goes well with just about everything, but especially well as a side to Asian, South American, Indian, and Middle Eastern entrees. By simply adding some cooked veggies or meats after it has finished cooking, it can become an excellent entree on its own. You can store rice in the fridge in a sealed container for a few days. If it starts to turn crusty, add a few drops of water to it before you reheat it to bring back its fluffy stickiness."
        }
      ]
    }
  ],
  "text":" Combining the Ingredients Run the rice under cold water for about 10 seconds in a fine mesh colander. While short-grain rice is meant to be starchier than long-grain rice, running the rice under water will help to get rid of any excess starch that does nothing but add cholesterol. Pour your rice into a rice strainer or fine mesh colander and run water over it for just a few seconds. Usually, you would run water over rice for about 30 seconds, but because short grain rice is meant to be sticky, you do not want to get rid of too much. Combine your water, salt, and butter or vegetable oil in a saucepan. Add 2 cups (470 ml) of water, 1 teaspoon (5.7 g) of salt, and 2 tablespoons (30 ml) of unsalted vegetable oil to a heavy-bottomed saucepan, but do not turn on the heat. The salt will let the water get hotter before it reaches a boil, while vegetable oil improves the texture and flavor of the rice. The heavy-bottomed saucepan will cook the rice more evenly. You can use butter instead of vegetable oil for a creamier texture. Generally, you should aim for a 2 to 1 ratio of water to rice. If you want to make more, take the amount of rice you want to make, double it, and add that much water. You should add more salt and butter to the mix in a proportional amount (so if you make twice the amount of rice, add twice the amount of salt and butter). Squeeze 2 tablespoons (30 ml) of lemon juice into the saucepan if you so desire. Lemon juice adds a subtle zest to rice, which greatly improves its flavor if eaten as a side or alone without additions, but it is not needed to cook the rice fully. The starch of short grain rice brings out the citrus flavor more fully than long-grain rice. You can also use the juice of an orange, if you don't like lemon, although it will not produce quite as strong of a citrus flavor. If you do use an orange, add about 2 tbsp (14 g) of orange zest to the rice after cooking. Add the rice and give the mix a few stirs. Add 1 cup (180 g) of rice to the saucepan and stir the mix to get the rice evenly spread around the saucepan. Don't stir or disturb the rice while it cooks, or it won't cook evenly. Make sure you have about double the amount of water as you do rice to cook it without having to use a rice strainer later on. Boiling and Simmering Bring the rice to a rolling boil on high heat. It is very important that you do not have the heat on until all the ingredients are combined. Turn your stovetop to near-max heat, and allow the rice to come to a rapid rolling boil. Reduce the heat to low and cover tightly as soon as it boils. The water has reached a rolling boil after bubbles form, rise, and burst rapidly. Turn the heat to low and cover the saucepan tightly. It is very important that you do not remove the cover at all during the cooking process, as the heat needs to be trapped to properly cook the rice. If the lid is removed even for a peek, the rice will cook unevenly. Cook the rice for a further 45 minutes. Keeping the heat on low, let the rice cook for three-quarters of an hour. Make sure the lid is on there nice and tight before finding something to do. You can use this time to prepare veggies and other additions for your rice. Serving the Rice Remove the saucepan from the heat and let the rice sit for 5 to 10 minutes. This allows the rice to fully absorb the rest of the water in the saucepan while letting it cool down enough to eat. Even though the saucepan is off the heat, do not remove the lid yet, as this traps the water and steam, and the rice will finish cooking on its own. Remove the cover and fluff the rice with a fork. With the cover finally removed, the rice may look a little deflated. Using a fork, gently fluff the rice by inserting it into the center and raising it, as if you were slowly whisking eggs, until you have fluffed the entire mix. Fluffing with a fork is better than with a spoon or other utensil as the gaps between prongs allow proper mixing and allow excess water to evaporate. Your rice should end up plump but still sticky — it should look like it fills the saucepan ever so slightly more than when it was un-fluffed. Serve it hot alongside your favorite foods. Short-grain brown rice goes well with just about everything, but especially well as a side to Asian, South American, Indian, and Middle Eastern entrees. By simply adding some cooked veggies or meats after it has finished cooking, it can become an excellent entree on its own. You can store rice in the fridge in a sealed container for a few days. If it starts to turn crusty, add a few drops of water to it before you reheat it to bring back its fluffy stickiness.",
  "sentences":[
    " Combining the Ingredients Run the rice under cold water for about 10 seconds in a fine mesh colander.",
    "While short-grain rice is meant to be starchier than long-grain rice, running the rice under water will help to get rid of any excess starch that does nothing but add cholesterol.",
    "Pour your rice into a rice strainer or fine mesh colander and run water over it for just a few seconds.",
    "Usually, you would run water over rice for about 30 seconds, but because short grain rice is meant to be sticky, you do not want to get rid of too much.",
    "Combine your water, salt, and butter or vegetable oil in a saucepan.",
    "Add 2 cups (470 ml) of water, 1 teaspoon (5.7 g) of salt, and 2 tablespoons (30 ml) of unsalted vegetable oil to a heavy-bottomed saucepan, but do not turn on the heat.",
    "The salt will let the water get hotter before it reaches a boil, while vegetable oil improves the texture and flavor of the rice.",
    "The heavy-bottomed saucepan will cook the rice more evenly.",
    "You can use butter instead of vegetable oil for a creamier texture.",
    "Generally, you should aim for a 2 to 1 ratio of water to rice.",
    "If you want to make more, take the amount of rice you want to make, double it, and add that much water.",
    "You should add more salt and butter to the mix in a proportional amount (so if you make twice the amount of rice, add twice the amount of salt and butter).",
    "Squeeze 2 tablespoons (30 ml) of lemon juice into the saucepan if you so desire.",
    "Lemon juice adds a subtle zest to rice, which greatly improves its flavor if eaten as a side or alone without additions, but it is not needed to cook the rice fully.",
    "The starch of short grain rice brings out the citrus flavor more fully than long-grain rice.",
    "You can also use the juice of an orange, if you don't like lemon, although it will not produce quite as strong of a citrus flavor.",
    "If you do use an orange, add about 2 tbsp (14 g) of orange zest to the rice after cooking.",
    "Add the rice and give the mix a few stirs.",
    "Add 1 cup (180 g) of rice to the saucepan and stir the mix to get the rice evenly spread around the saucepan.",
    "Don't stir or disturb the rice while it cooks, or it won't cook evenly.",
    "Make sure you have about double the amount of water as you do rice to cook it without having to use a rice strainer later on.",
    "Boiling and Simmering Bring the rice to a rolling boil on high heat.",
    "It is very important that you do not have the heat on until all the ingredients are combined.",
    "Turn your stovetop to near-max heat, and allow the rice to come to a rapid rolling boil.",
    "Reduce the heat to low and cover tightly as soon as it boils.",
    "The water has reached a rolling boil after bubbles form, rise, and burst rapidly.",
    "Turn the heat to low and cover the saucepan tightly.",
    "It is very important that you do not remove the cover at all during the cooking process, as the heat needs to be trapped to properly cook the rice.",
    "If the lid is removed even for a peek, the rice will cook unevenly.",
    "Cook the rice for a further 45 minutes.",
    "Keeping the heat on low, let the rice cook for three-quarters of an hour.",
    "Make sure the lid is on there nice and tight before finding something to do.",
    "You can use this time to prepare veggies and other additions for your rice.",
    "Serving the Rice Remove the saucepan from the heat and let the rice sit for 5 to 10 minutes.",
    "This allows the rice to fully absorb the rest of the water in the saucepan while letting it cool down enough to eat.",
    "Even though the saucepan is off the heat, do not remove the lid yet, as this traps the water and steam, and the rice will finish cooking on its own.",
    "Remove the cover and fluff the rice with a fork.",
    "With the cover finally removed, the rice may look a little deflated.",
    "Using a fork, gently fluff the rice by inserting it into the center and raising it, as if you were slowly whisking eggs, until you have fluffed the entire mix.",
    "Fluffing with a fork is better than with a spoon or other utensil as the gaps between prongs allow proper mixing and allow excess water to evaporate.",
    "Your rice should end up plump but still sticky — it should look like it fills the saucepan ever so slightly more than when it was un-fluffed.",
    "Serve it hot alongside your favorite foods.",
    "Short-grain brown rice goes well with just about everything, but especially well as a side to Asian, South American, Indian, and Middle Eastern entrees.",
    "By simply adding some cooked veggies or meats after it has finished cooking, it can become an excellent entree on its own.",
    "You can store rice in the fridge in a sealed container for a few days.",
    "If it starts to turn crusty, add a few drops of water to it before you reheat it to bring back its fluffy stickiness."
  ],
  "tyn_section":[
    "Medium saucepan",
    "Wooden spoon",
    "Lemon squeezer or orange zester",
    "Fork"
  ],
  "tyn_model":[
    "rice",
    "water",
    "saucepan",
    "salt",
    "butter",
    "lemon",
    "fork",
    "fine mesh colander",
    "rice strainer",
    "vegetable oil",
    "butter or vegetable oil",
    "unsalted vegetable oil",
    "heavy-bottomed saucepan",
    "orange",
    "orange zest",
    "stovetop",
    "eggs",
    "spoon",
    "— it",
    "brown rice"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.05,
    "f1":0.0833333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.15,
    "f1":0.25
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2,
    "f1":0.3157894737
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.05,
    "f1":0.0833333333
  }
}