{
  "title":"How to Plant a Fern",
  "url":"https://www.wikihow.com/Plant-a-Fern",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "steps":[
    {
      "headline":"Get the fern started indoors, especially if you live in an area with unreliable weather for your particular breed of fern.",
      "description":"All types of ferns require a different climate, however most prefer a hot humid atmosphere. Grow the fern indoors until you begin to see multiple leaves spring out from the center. The goal is to grow it until you have enough roots to hold it a ball in your hand, however you do not want to pull the plant out of the ground prematurely. If you're not sure whether the fern is quite ready to be planted outdoors, leave it in the ground for a while longer."
    },
    {
      "headline":"Figure out the time of year best for planting.",
      "description":"During the Spring season (where winter is cold and wet where you live) is best. In warmer climates Fall is preferable."
    },
    {
      "headline":"Get the fern ready to be moved.",
      "description":"If your fern is a good size and is actively growing, cut the leaves by half of their length. This will make it easier to move and relieve the stress of the plant."
    },
    {
      "headline":"Dig out a generous ball of the roots.",
      "description":"Don't be afraid to pull up a lot of dirt along with the roots. The shape of the ball isn't too important, so don't worry about shaping it afterwards. This will hurt the roots more than anything."
    },
    {
      "headline":"Dig a hole the same size as the root ball and place the fern inside.",
      "description":"Leaving a generous amount of space for the hole to fit is okay, as you will be filling it in and watering it in the extra space."
    },
    {
      "headline":"Pour water into the area.",
      "description":"Water more than you normally would as this will get the soil ready and begin to get the fern used to it's new area."
    },
    {
      "headline":"Fill in excess space with soil Don't pack too tightly, leave the soil soft.",
      "description":""
    },
    {
      "headline":"Monitor the plant and make sure it is growing at the same rate as before you planted it.",
      "description":"The growing rate should be fairly close to the same. If the plant isn't responding well move it back to where you had it before. Don't move the plant's location too often as this injures the plant."
    }
  ],
  "text":" Get the fern started indoors, especially if you live in an area with unreliable weather for your particular breed of fern. All types of ferns require a different climate, however most prefer a hot humid atmosphere. Grow the fern indoors until you begin to see multiple leaves spring out from the center. The goal is to grow it until you have enough roots to hold it a ball in your hand, however you do not want to pull the plant out of the ground prematurely. If you're not sure whether the fern is quite ready to be planted outdoors, leave it in the ground for a while longer. Figure out the time of year best for planting. During the Spring season (where winter is cold and wet where you live) is best. In warmer climates Fall is preferable. Get the fern ready to be moved. If your fern is a good size and is actively growing, cut the leaves by half of their length. This will make it easier to move and relieve the stress of the plant. Dig out a generous ball of the roots. Don't be afraid to pull up a lot of dirt along with the roots. The shape of the ball isn't too important, so don't worry about shaping it afterwards. This will hurt the roots more than anything. Dig a hole the same size as the root ball and place the fern inside. Leaving a generous amount of space for the hole to fit is okay, as you will be filling it in and watering it in the extra space. Pour water into the area. Water more than you normally would as this will get the soil ready and begin to get the fern used to it's new area. Fill in excess space with soil Don't pack too tightly, leave the soil soft.  Monitor the plant and make sure it is growing at the same rate as before you planted it. The growing rate should be fairly close to the same. If the plant isn't responding well move it back to where you had it before. Don't move the plant's location too often as this injures the plant.",
  "sentences":[
    " Get the fern started indoors, especially if you live in an area with unreliable weather for your particular breed of fern.",
    "All types of ferns require a different climate, however most prefer a hot humid atmosphere.",
    "Grow the fern indoors until you begin to see multiple leaves spring out from the center.",
    "The goal is to grow it until you have enough roots to hold it a ball in your hand, however you do not want to pull the plant out of the ground prematurely.",
    "If you're not sure whether the fern is quite ready to be planted outdoors, leave it in the ground for a while longer.",
    "Figure out the time of year best for planting.",
    "During the Spring season (where winter is cold and wet where you live) is best.",
    "In warmer climates Fall is preferable.",
    "Get the fern ready to be moved.",
    "If your fern is a good size and is actively growing, cut the leaves by half of their length.",
    "This will make it easier to move and relieve the stress of the plant.",
    "Dig out a generous ball of the roots.",
    "Don't be afraid to pull up a lot of dirt along with the roots.",
    "The shape of the ball isn't too important, so don't worry about shaping it afterwards.",
    "This will hurt the roots more than anything.",
    "Dig a hole the same size as the root ball and place the fern inside.",
    "Leaving a generous amount of space for the hole to fit is okay, as you will be filling it in and watering it in the extra space.",
    "Pour water into the area.",
    "Water more than you normally would as this will get the soil ready and begin to get the fern used to it's new area.",
    "Fill in excess space with soil Don't pack too tightly, leave the soil soft.",
    "Monitor the plant and make sure it is growing at the same rate as before you planted it.",
    "The growing rate should be fairly close to the same.",
    "If the plant isn't responding well move it back to where you had it before.",
    "Don't move the plant's location too often as this injures the plant."
  ],
  "tyn_section":[
    "fern",
    "pot",
    "gardening tools(optional)"
  ],
  "tyn_model":[
    "fern",
    "water",
    "soil"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  }
}