{
  "title":"How to Make a Sock Puppet",
  "url":"https://www.wikihow.com/Make-a-Sock-Puppet",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Making Toys"
  ],
  "methods":[
    {
      "name":"Making a Simple Sock Puppet",
      "steps":[
        {
          "headline":"Find a clean sock that's long enough to cover your arm.",
          "description":"A crew sock or a knee sock would work great for this! The sock can be any color you like. It can be fuzzy or plain. It can even have stripes or polka dots! Just make sure there aren't any holes."
        },
        {
          "headline":"Slip the sock over your hand.",
          "description":"Once you the sock on, make a C-shape with your hand. Put your fingers into the toe part. Try to get your thumb into the heel part. If you can't reach it, tuck the sock into the groove between your thumb and fingers. Open and close your hand. Your sock should already start looking like a puppet."
        },
        {
          "headline":"Use a marker to make two dots above the seam for the eyes.",
          "description":"If you want your puppet to have a nose, make a dot for that as well."
        },
        {
          "headline":"Take the sock off.",
          "description":"Spread it flat on the table. The marks for the eyes and nose may look out of place, but that's fine. This is why you made them while wearing the sock."
        },
        {
          "headline":"Glue some eyes onto the sock.",
          "description":"You can do this with a hot glue gun, fabric glue, or tacky glue. For the actual eyes, you can use buttons, pompoms, or googly eyes. You can also draw the eyes on with a marker. If your puppet is a girl, draw some eyelashes with a marker!"
        },
        {
          "headline":"Glue a small pompom just above the seam for the nose.",
          "description":"You can also cut a triangle or circle out of felt and use that instead. A button would also make a cute nose. If you don't have any of these, you can draw a nose on instead!"
        },
        {
          "headline":"Add some other decorations.",
          "description":"Your puppet is done at this point. You can still glue items onto it to give it more character. For example, you can glue some yarn to the top for hair. For more ideas, click here."
        }
      ]
    },
    {
      "name":"Making a Fancy Puppet",
      "steps":[
        {
          "headline":"Cut the toes off of a sock with fabric scissors.",
          "description":"Find a sock long enough to cover your arm. It can be any color or pattern. A solid sock would work for just about any character, while a spotted one could make a leopard. You can even use a striped sock to make a zebra! Once you are happy with your sock, cut the toes off with fabric scissors, using the toe seam as a guide. Those funky, fuzzy socks work the best for this type of puppet, but you can use plain socks too."
        },
        {
          "headline":"Cut a 4-inch (10.16-centimeter) oval out of thin cardboard.",
          "description":"Get some thin cardboard. Draw an oval on it that is about 4 inches (10.16 centimeters) long. It should a little narrower than your sock. Cut the oval out with a pair of scissors. You can use an old cereal box for the cardboard."
        },
        {
          "headline":"Cut a matching oval out of felt, then set it aside.",
          "description":"Use the cardboard oval you just cut out to trace another oval onto a sheet of felt. Cut the felt oval out, then set it aside. You will be gluing this to the inside of the mouth later. Pink or red would work the best, but you can use a different color too."
        },
        {
          "headline":"Fold the cardboard oval in half to make a crease.",
          "description":"Unfold the oval when you are done. It will be bent like a V, which is good."
        },
        {
          "headline":"Tuck the oval into the cut part of the sock.",
          "description":"Keeping it bent like a V, tuck the oval into the sock. Pull the cut edges of the sock over the edges of the oval. Don't worry if things don't look perfect. You will be fixing that later."
        },
        {
          "headline":"Glue the sock to the top and bottom of the oval.",
          "description":"Set the sock down and open the mouth. Pull the edges of the sock over the top and bottom (narrow) ends of the oval by ½-inch (1.27-centimeter). Glue them down with hot glue. Don't worry if the sides get messed up. You'll fix that next. If you don't have hot glue, fabric glue or tacky glue may also work."
        },
        {
          "headline":"Glue the sock to the side edges of the oval.",
          "description":"Pull a bit of sock over the side edge of the oval by ½-inch (1.27-centimeter) and glue it down. Work your way from the top edge of the oval to the bottom. When you are done, do the other side of the oval too."
        },
        {
          "headline":"Glue the felt oval into the mouth.",
          "description":"Draw a line of glue around the inside of the puppet's mouth. Press the felt oval into the glue. Make sure that the edges match up. This will give the inside of the mouth some color and cover up the cut part of the sock. If you are using hot glue, work a little bit at a time so it doesn't dry too fast."
        },
        {
          "headline":"Decorate the puppet.",
          "description":"You can have the heel part be on the top or bottom of the puppet. Glue some googly eyes or buttons for the eyes. Add a smaller pompom or button for the nose. If you want to give your puppet a tongue, cut a long tongue shape out of red or pink felt, then glue it inside the mouth. Don't glue the tongue all the way down. This way it can flap around! For more decorating ideas, click here."
        }
      ]
    },
    {
      "name":"Decorating the Puppet Further",
      "steps":[
        {
          "headline":"Decide how much more your puppet needs.",
          "description":"You don't have to use everything from this section. Take a look at your puppet, and decide what character you want it to be. Pick some ideas from the list before, or make up your own decorations!"
        },
        {
          "headline":"Make arms using pipe cleaners and rolled up pieces of felt.",
          "description":"Fold a pipe cleaner in half. Fold a piece of felt around the pipe cleaner, then secure it with glue. Trim the felt down so that it is the same length as the pipe cleaner, plus 1 inch (2.54 centimeters). Cut one end of the arm into a hand shape, then glue the other end to the puppet. Repeat this step to make the other arm."
        },
        {
          "headline":"Use yarn to add some hair, if desired.",
          "description":"Wrap some yarn around your hand (short) or a book (long). Slide it off and cut apart the loops on one end. Tie a piece of yarn around the middle to hold it all together. Glue this to the top of the head, right above the eyes. The more times you wrap, the thicker the hair will be. Wrap it at least 10 times. You can use a similar technique to give your puppet a mustache! Leave the hair down or cut it. You can also braid it or put it into pigtails. You can also make hair out of pipe cleaners or cut shapes out of felt."
        },
        {
          "headline":"Glue googly eyes to pompoms to make silly eyes.",
          "description":"Glue two large pompoms to the top of your puppet's head. The pompoms can be as close together or as far apart as you want. Next, glue a googly eye to the front of each pompom (not the top)."
        },
        {
          "headline":"Draw on some defining features.",
          "description":"Here is where you can get really creative! All you need is a fabric marker or a permanent marker. Try one of the ideas from below:\nDraw eyelashes if it's girl puppet. Draw freckles or a beauty mark under the eyes. Add some thick eyebrows or a mustache. Outline the puppet's mouth in red for lipstick."
        },
        {
          "headline":"Make accessories for the puppet.",
          "description":"These can add lots of character to your puppet. All you need are some pipe cleaners, buttons, glue, and extra felt. Below are some ideas to get you started:\nCut a bow or tie out of felt, then glue it to the puppet. Make a pair of glasses out of pipe cleaners. Glue fancy buttons to either side of the puppet's head for earrings. Make a bow out of ribbon, then glue it to the top of the puppet's head."
        },
        {
          "headline":"Use pompoms, craft foam, or felt to turn it into a monster.",
          "description":"Sock puppets look silly enough on their own. You can make yours even sillier by turning it into a monster. Try one of these ideas:\nGlue pompoms all over its body to make warts. Cut triangles out of felt or craft foam to make spikes. Give it some teeth or fangs. White craft form works the best for this. Make some horns for it out of craft foam or pipe cleaners."
        }
      ]
    }
  ],
  "text":" Making a Simple Sock Puppet Find a clean sock that's long enough to cover your arm. A crew sock or a knee sock would work great for this! The sock can be any color you like. It can be fuzzy or plain. It can even have stripes or polka dots! Just make sure there aren't any holes. Slip the sock over your hand. Once you the sock on, make a C-shape with your hand. Put your fingers into the toe part. Try to get your thumb into the heel part. If you can't reach it, tuck the sock into the groove between your thumb and fingers. Open and close your hand. Your sock should already start looking like a puppet. Use a marker to make two dots above the seam for the eyes. If you want your puppet to have a nose, make a dot for that as well. Take the sock off. Spread it flat on the table. The marks for the eyes and nose may look out of place, but that's fine. This is why you made them while wearing the sock. Glue some eyes onto the sock. You can do this with a hot glue gun, fabric glue, or tacky glue. For the actual eyes, you can use buttons, pompoms, or googly eyes. You can also draw the eyes on with a marker. If your puppet is a girl, draw some eyelashes with a marker! Glue a small pompom just above the seam for the nose. You can also cut a triangle or circle out of felt and use that instead. A button would also make a cute nose. If you don't have any of these, you can draw a nose on instead! Add some other decorations. Your puppet is done at this point. You can still glue items onto it to give it more character. For example, you can glue some yarn to the top for hair. For more ideas, click here. Making a Fancy Puppet Cut the toes off of a sock with fabric scissors. Find a sock long enough to cover your arm. It can be any color or pattern. A solid sock would work for just about any character, while a spotted one could make a leopard. You can even use a striped sock to make a zebra! Once you are happy with your sock, cut the toes off with fabric scissors, using the toe seam as a guide. Those funky, fuzzy socks work the best for this type of puppet, but you can use plain socks too. Cut a 4-inch (10.16-centimeter) oval out of thin cardboard. Get some thin cardboard. Draw an oval on it that is about 4 inches (10.16 centimeters) long. It should a little narrower than your sock. Cut the oval out with a pair of scissors. You can use an old cereal box for the cardboard. Cut a matching oval out of felt, then set it aside. Use the cardboard oval you just cut out to trace another oval onto a sheet of felt. Cut the felt oval out, then set it aside. You will be gluing this to the inside of the mouth later. Pink or red would work the best, but you can use a different color too. Fold the cardboard oval in half to make a crease. Unfold the oval when you are done. It will be bent like a V, which is good. Tuck the oval into the cut part of the sock. Keeping it bent like a V, tuck the oval into the sock. Pull the cut edges of the sock over the edges of the oval. Don't worry if things don't look perfect. You will be fixing that later. Glue the sock to the top and bottom of the oval. Set the sock down and open the mouth. Pull the edges of the sock over the top and bottom (narrow) ends of the oval by ½-inch (1.27-centimeter). Glue them down with hot glue. Don't worry if the sides get messed up. You'll fix that next. If you don't have hot glue, fabric glue or tacky glue may also work. Glue the sock to the side edges of the oval. Pull a bit of sock over the side edge of the oval by ½-inch (1.27-centimeter) and glue it down. Work your way from the top edge of the oval to the bottom. When you are done, do the other side of the oval too. Glue the felt oval into the mouth. Draw a line of glue around the inside of the puppet's mouth. Press the felt oval into the glue. Make sure that the edges match up. This will give the inside of the mouth some color and cover up the cut part of the sock. If you are using hot glue, work a little bit at a time so it doesn't dry too fast. Decorate the puppet. You can have the heel part be on the top or bottom of the puppet. Glue some googly eyes or buttons for the eyes. Add a smaller pompom or button for the nose. If you want to give your puppet a tongue, cut a long tongue shape out of red or pink felt, then glue it inside the mouth. Don't glue the tongue all the way down. This way it can flap around! For more decorating ideas, click here. Decorating the Puppet Further Decide how much more your puppet needs. You don't have to use everything from this section. Take a look at your puppet, and decide what character you want it to be. Pick some ideas from the list before, or make up your own decorations! Make arms using pipe cleaners and rolled up pieces of felt. Fold a pipe cleaner in half. Fold a piece of felt around the pipe cleaner, then secure it with glue. Trim the felt down so that it is the same length as the pipe cleaner, plus 1 inch (2.54 centimeters). Cut one end of the arm into a hand shape, then glue the other end to the puppet. Repeat this step to make the other arm. Use yarn to add some hair, if desired. Wrap some yarn around your hand (short) or a book (long). Slide it off and cut apart the loops on one end. Tie a piece of yarn around the middle to hold it all together. Glue this to the top of the head, right above the eyes. The more times you wrap, the thicker the hair will be. Wrap it at least 10 times. You can use a similar technique to give your puppet a mustache! Leave the hair down or cut it. You can also braid it or put it into pigtails. You can also make hair out of pipe cleaners or cut shapes out of felt. Glue googly eyes to pompoms to make silly eyes. Glue two large pompoms to the top of your puppet's head. The pompoms can be as close together or as far apart as you want. Next, glue a googly eye to the front of each pompom (not the top). Draw on some defining features. Here is where you can get really creative! All you need is a fabric marker or a permanent marker. Try one of the ideas from below:\nDraw eyelashes if it's girl puppet. Draw freckles or a beauty mark under the eyes. Add some thick eyebrows or a mustache. Outline the puppet's mouth in red for lipstick. Make accessories for the puppet. These can add lots of character to your puppet. All you need are some pipe cleaners, buttons, glue, and extra felt. Below are some ideas to get you started:\nCut a bow or tie out of felt, then glue it to the puppet. Make a pair of glasses out of pipe cleaners. Glue fancy buttons to either side of the puppet's head for earrings. Make a bow out of ribbon, then glue it to the top of the puppet's head. Use pompoms, craft foam, or felt to turn it into a monster. Sock puppets look silly enough on their own. You can make yours even sillier by turning it into a monster. Try one of these ideas:\nGlue pompoms all over its body to make warts. Cut triangles out of felt or craft foam to make spikes. Give it some teeth or fangs. White craft form works the best for this. Make some horns for it out of craft foam or pipe cleaners.",
  "sentences":[
    " Making a Simple Sock Puppet Find a clean sock that's long enough to cover your arm.",
    "A crew sock or a knee sock would work great for this!",
    "The sock can be any color you like.",
    "It can be fuzzy or plain.",
    "It can even have stripes or polka dots!",
    "Just make sure there aren't any holes.",
    "Slip the sock over your hand.",
    "Once you the sock on, make a C-shape with your hand.",
    "Put your fingers into the toe part.",
    "Try to get your thumb into the heel part.",
    "If you can't reach it, tuck the sock into the groove between your thumb and fingers.",
    "Open and close your hand.",
    "Your sock should already start looking like a puppet.",
    "Use a marker to make two dots above the seam for the eyes.",
    "If you want your puppet to have a nose, make a dot for that as well.",
    "Take the sock off.",
    "Spread it flat on the table.",
    "The marks for the eyes and nose may look out of place, but that's fine.",
    "This is why you made them while wearing the sock.",
    "Glue some eyes onto the sock.",
    "You can do this with a hot glue gun, fabric glue, or tacky glue.",
    "For the actual eyes, you can use buttons, pompoms, or googly eyes.",
    "You can also draw the eyes on with a marker.",
    "If your puppet is a girl, draw some eyelashes with a marker!",
    "Glue a small pompom just above the seam for the nose.",
    "You can also cut a triangle or circle out of felt and use that instead.",
    "A button would also make a cute nose.",
    "If you don't have any of these, you can draw a nose on instead!",
    "Add some other decorations.",
    "Your puppet is done at this point.",
    "You can still glue items onto it to give it more character.",
    "For example, you can glue some yarn to the top for hair.",
    "For more ideas, click here.",
    "Making a Fancy Puppet Cut the toes off of a sock with fabric scissors.",
    "Find a sock long enough to cover your arm.",
    "It can be any color or pattern.",
    "A solid sock would work for just about any character, while a spotted one could make a leopard.",
    "You can even use a striped sock to make a zebra!",
    "Once you are happy with your sock, cut the toes off with fabric scissors, using the toe seam as a guide.",
    "Those funky, fuzzy socks work the best for this type of puppet, but you can use plain socks too.",
    "Cut a 4-inch (10.16-centimeter) oval out of thin cardboard.",
    "Get some thin cardboard.",
    "Draw an oval on it that is about 4 inches (10.16 centimeters) long.",
    "It should a little narrower than your sock.",
    "Cut the oval out with a pair of scissors.",
    "You can use an old cereal box for the cardboard.",
    "Cut a matching oval out of felt, then set it aside.",
    "Use the cardboard oval you just cut out to trace another oval onto a sheet of felt.",
    "Cut the felt oval out, then set it aside.",
    "You will be gluing this to the inside of the mouth later.",
    "Pink or red would work the best, but you can use a different color too.",
    "Fold the cardboard oval in half to make a crease.",
    "Unfold the oval when you are done.",
    "It will be bent like a V, which is good.",
    "Tuck the oval into the cut part of the sock.",
    "Keeping it bent like a V, tuck the oval into the sock.",
    "Pull the cut edges of the sock over the edges of the oval.",
    "Don't worry if things don't look perfect.",
    "You will be fixing that later.",
    "Glue the sock to the top and bottom of the oval.",
    "Set the sock down and open the mouth.",
    "Pull the edges of the sock over the top and bottom (narrow) ends of the oval by ½-inch (1.27-centimeter).",
    "Glue them down with hot glue.",
    "Don't worry if the sides get messed up.",
    "You'll fix that next.",
    "If you don't have hot glue, fabric glue or tacky glue may also work.",
    "Glue the sock to the side edges of the oval.",
    "Pull a bit of sock over the side edge of the oval by ½-inch (1.27-centimeter) and glue it down.",
    "Work your way from the top edge of the oval to the bottom.",
    "When you are done, do the other side of the oval too.",
    "Glue the felt oval into the mouth.",
    "Draw a line of glue around the inside of the puppet's mouth.",
    "Press the felt oval into the glue.",
    "Make sure that the edges match up.",
    "This will give the inside of the mouth some color and cover up the cut part of the sock.",
    "If you are using hot glue, work a little bit at a time so it doesn't dry too fast.",
    "Decorate the puppet.",
    "You can have the heel part be on the top or bottom of the puppet.",
    "Glue some googly eyes or buttons for the eyes.",
    "Add a smaller pompom or button for the nose.",
    "If you want to give your puppet a tongue, cut a long tongue shape out of red or pink felt, then glue it inside the mouth.",
    "Don't glue the tongue all the way down.",
    "This way it can flap around!",
    "For more decorating ideas, click here.",
    "Decorating the Puppet Further Decide how much more your puppet needs.",
    "You don't have to use everything from this section.",
    "Take a look at your puppet, and decide what character you want it to be.",
    "Pick some ideas from the list before, or make up your own decorations!",
    "Make arms using pipe cleaners and rolled up pieces of felt.",
    "Fold a pipe cleaner in half.",
    "Fold a piece of felt around the pipe cleaner, then secure it with glue.",
    "Trim the felt down so that it is the same length as the pipe cleaner, plus 1 inch (2.54 centimeters).",
    "Cut one end of the arm into a hand shape, then glue the other end to the puppet.",
    "Repeat this step to make the other arm.",
    "Use yarn to add some hair, if desired.",
    "Wrap some yarn around your hand (short) or a book (long).",
    "Slide it off and cut apart the loops on one end.",
    "Tie a piece of yarn around the middle to hold it all together.",
    "Glue this to the top of the head, right above the eyes.",
    "The more times you wrap, the thicker the hair will be.",
    "Wrap it at least 10 times.",
    "You can use a similar technique to give your puppet a mustache!",
    "Leave the hair down or cut it.",
    "You can also braid it or put it into pigtails.",
    "You can also make hair out of pipe cleaners or cut shapes out of felt.",
    "Glue googly eyes to pompoms to make silly eyes.",
    "Glue two large pompoms to the top of your puppet's head.",
    "The pompoms can be as close together or as far apart as you want.",
    "Next, glue a googly eye to the front of each pompom (not the top).",
    "Draw on some defining features.",
    "Here is where you can get really creative!",
    "All you need is a fabric marker or a permanent marker.",
    "Try one of the ideas from below:\nDraw eyelashes if it's girl puppet.",
    "Draw freckles or a beauty mark under the eyes.",
    "Add some thick eyebrows or a mustache.",
    "Outline the puppet's mouth in red for lipstick.",
    "Make accessories for the puppet.",
    "These can add lots of character to your puppet.",
    "All you need are some pipe cleaners, buttons, glue, and extra felt.",
    "Below are some ideas to get you started:\nCut a bow or tie out of felt, then glue it to the puppet.",
    "Make a pair of glasses out of pipe cleaners.",
    "Glue fancy buttons to either side of the puppet's head for earrings.",
    "Make a bow out of ribbon, then glue it to the top of the puppet's head.",
    "Use pompoms, craft foam, or felt to turn it into a monster.",
    "Sock puppets look silly enough on their own.",
    "You can make yours even sillier by turning it into a monster.",
    "Try one of these ideas:\nGlue pompoms all over its body to make warts.",
    "Cut triangles out of felt or craft foam to make spikes.",
    "Give it some teeth or fangs.",
    "White craft form works the best for this.",
    "Make some horns for it out of craft foam or pipe cleaners."
  ],
  "tyn_section":[
    "Making a Simple Puppet",
    "A clean, long sock",
    "Marker",
    "Scissors",
    "Glue",
    "Pompoms, buttons, googly eyes, etc.",
    "Thin cardboard"
  ],
  "tyn_model":[
    "sock",
    "glue",
    "felt",
    "cardboard",
    "pipe cleaners",
    "yarn",
    "pompoms",
    "marker",
    "buttons",
    "hot glue",
    "pipe cleaner",
    "craft foam",
    "fabric glue",
    "fabric scissors",
    "table",
    "hot glue gun",
    "scissors",
    "cereal box",
    "pompom",
    "book",
    "googly eyes",
    "googly eye",
    "fabric marker",
    "permanent marker",
    "glasses",
    "ribbon"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.1153846154,
    "f1":0.1818181818,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.3461538462,
    "f1":0.4311377246
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5714285714,
    "p":0.3846153846,
    "f1":0.4597701149
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.1153846154,
    "f1":0.1818181818
  }
}