{
  "title":"How to Arm Knit an Infinity Scarf",
  "url":"https://www.wikihow.com/Arm-Knit-an-Infinity-Scarf",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Knitting",
    "Knitting Clothes"
  ],
  "parts":[
    {
      "name":"Making the Knot",
      "steps":[
        {
          "headline":"Start with two skeins of yarn, and find the ends.",
          "description":"These two skeins should be treated as if they were one, so make sure the two ends line up. Before you start, make sure the yarn can unfurl from the skeins easily."
        },
        {
          "headline":"Leave approximately four feet of each skein for the tail of the scarf.",
          "description":"The yarn attached to the ball is the working yarn. Make sure the working yarn is to your left, and the tail is to your right."
        },
        {
          "headline":"Start the slipknot by holding the working yarn in your left hand so that your palm is facing you.",
          "description":""
        },
        {
          "headline":"Take the tail over the working yarn and make a loop.",
          "description":""
        },
        {
          "headline":"Pull the tail yarn through the loop, and pull tight to finish the knot leaving a loop at the top.",
          "description":""
        },
        {
          "headline":"Place the loop over your right arm and tighten around your wrist.",
          "description":"Make sure the loop is loose enough to move up and down your wrist. You do not want the loop to be too tight."
        }
      ]
    },
    {
      "name":"Casting On",
      "steps":[
        {
          "headline":"Separate the working yarn from the tail, holding the working yarn in your left hand.",
          "description":"Make sure the tail is to the right of you."
        },
        {
          "headline":"Hold the working yarn in your bottom two fingers of your left hand.",
          "description":"Your thumb should be pacing up, and your index and middle finger should be pointing towards your right hand."
        },
        {
          "headline":"Wrap your thumb over and under the working yarn.",
          "description":"The yarn should be wrapped around your thumb and held between your bottom two fingers."
        },
        {
          "headline":"Take your index and middle finger of your left hand and grab the tail yarn between your two fingers.",
          "description":""
        },
        {
          "headline":"Wrap your right fingers under the yarn that is touching your palm (the yarn that is being held between your thumb and bottom two fingers), and pull through making a loop.",
          "description":""
        },
        {
          "headline":"Grab the tail yarn with your right fingers, then pull the tail yarn towards you through the loop.",
          "description":"When pulling the yarn through the loop, the yarn should come off of your thumb."
        },
        {
          "headline":"Place the loop over your right wrist.",
          "description":"Pull the loop tight."
        },
        {
          "headline":"Repeat this process between ten and fourteen times.",
          "description":"The amount of times that you repeat the steps will determine the width of the scarf. The more you repeat these steps, the wider the scarf."
        }
      ]
    },
    {
      "name":"Knitting Rows",
      "steps":[
        {
          "headline":"Begin your first row.",
          "description":"Hold your working yarn between your thumb and index finger of your right hand."
        },
        {
          "headline":"Pick up the first stitch on your right wrist with your left hand.",
          "description":""
        },
        {
          "headline":"Pull the stitch over the yarn you are holding in your right hand, and let go.",
          "description":"Do not let go of the loop you are holding in your right hand. Only release the yarn you pulled over with your left hand."
        },
        {
          "headline":"Place the loop you are holding in your right hand over your left wrist and tighten.",
          "description":""
        },
        {
          "headline":"Repeat this process until all of the stitches from your right arm are now on your left arm.",
          "description":""
        },
        {
          "headline":"Begin your second row.",
          "description":"To do this, hold the working yarn between your thumb and index finger of your left hand."
        },
        {
          "headline":"Pick up the first stitch on your left wrist with your right hand.",
          "description":""
        },
        {
          "headline":"Pull the stitch over the yarn you are holding in your left hand, and let go.",
          "description":"Do not let go of the loop you are holding in your left hand. Only release the yarn you pulled over with your right hand."
        },
        {
          "headline":"Place the loop you are holding in your left hand over your right wrist.",
          "description":""
        },
        {
          "headline":"Repeat until all of the stitches from your left arm are now on your right arm.",
          "description":"Remember, you should have the same number of stitches that you started with."
        },
        {
          "headline":"Repeat rows one and two until you have achieved the desired scarf length.",
          "description":"Row one is moving stitches from your right arm to your left. Row two is moving stitches from your left arm to your right. Two skeins of yarn will make a scarf long enough to wrap around your neck once. If you want to make an infinity scarf, join another two skeins of yarn by tying them to the original skeins. Make sure you finish with row two so that the yarn is on your right wrist to start casting off."
        }
      ]
    },
    {
      "name":"Casting Off",
      "steps":[
        {
          "headline":"Hold your working yarn between your thumb and index finger of your right hand.",
          "description":""
        },
        {
          "headline":"Pick up the first stitch on your right wrist with your left hand.",
          "description":"Pull the loop over the yarn you are holding in your right hand, and let go. Do not let go of the loop you are holding in your right hand. Only release the yarn you pulled over with your left hand."
        },
        {
          "headline":"Place the loop you are holding in your right hand over your left wrist and tighten.",
          "description":""
        },
        {
          "headline":"Repeat this process so that you have two stitches on your left arm.",
          "description":"You should never have more than two stitches on your left arm when casting off. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4e\\/IMG_7479.jpg\\/460px-IMG_7479.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4e\\/IMG_7479.jpg\\/760px-IMG_7479.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"With your right hand pick up the second stitch on your left arm (the one closest to your elbow).",
          "description":""
        },
        {
          "headline":"Pull the stitch over your left hand.",
          "description":""
        },
        {
          "headline":"Let go of all the yarn and tighten by pulling on the working yarn.",
          "description":"You should be left with one stitch on your left arm."
        },
        {
          "headline":"Repeat the process of this entire section so far to move a stitch from your right arm to your left arm.",
          "description":"After this step, you should have two stitches on your left arm."
        },
        {
          "headline":"Repeat the previous step.",
          "description":"You should be left with only one stitch on your left arm."
        },
        {
          "headline":"Continue the same method until you have one remaining stitch on your left arm.",
          "description":"You are alternating between knitting a \"normal\" stitch from your right arm to your left one, and then pulling the second stitch over the first one on your left arm."
        },
        {
          "headline":"Cut the working yarn leaving approximately two feet.",
          "description":""
        },
        {
          "headline":"Pull the cut end through the final loop on your left arm, take the loop off of your arm, and pull tight.",
          "description":""
        }
      ]
    },
    {
      "name":"Finishing Scarf",
      "steps":[
        {
          "headline":"Thread the cut end of the yarn through a needle.",
          "description":""
        },
        {
          "headline":"Match up the edges of the scarf and sew the two ends together.",
          "description":""
        },
        {
          "headline":"Turn the scarf inside out and sew through any loose ends.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Knot Start with two skeins of yarn, and find the ends. These two skeins should be treated as if they were one, so make sure the two ends line up. Before you start, make sure the yarn can unfurl from the skeins easily. Leave approximately four feet of each skein for the tail of the scarf. The yarn attached to the ball is the working yarn. Make sure the working yarn is to your left, and the tail is to your right. Start the slipknot by holding the working yarn in your left hand so that your palm is facing you.  Take the tail over the working yarn and make a loop.  Pull the tail yarn through the loop, and pull tight to finish the knot leaving a loop at the top.  Place the loop over your right arm and tighten around your wrist. Make sure the loop is loose enough to move up and down your wrist. You do not want the loop to be too tight. Casting On Separate the working yarn from the tail, holding the working yarn in your left hand. Make sure the tail is to the right of you. Hold the working yarn in your bottom two fingers of your left hand. Your thumb should be pacing up, and your index and middle finger should be pointing towards your right hand. Wrap your thumb over and under the working yarn. The yarn should be wrapped around your thumb and held between your bottom two fingers. Take your index and middle finger of your left hand and grab the tail yarn between your two fingers.  Wrap your right fingers under the yarn that is touching your palm (the yarn that is being held between your thumb and bottom two fingers), and pull through making a loop.  Grab the tail yarn with your right fingers, then pull the tail yarn towards you through the loop. When pulling the yarn through the loop, the yarn should come off of your thumb. Place the loop over your right wrist. Pull the loop tight. Repeat this process between ten and fourteen times. The amount of times that you repeat the steps will determine the width of the scarf. The more you repeat these steps, the wider the scarf. Knitting Rows Begin your first row. Hold your working yarn between your thumb and index finger of your right hand. Pick up the first stitch on your right wrist with your left hand.  Pull the stitch over the yarn you are holding in your right hand, and let go. Do not let go of the loop you are holding in your right hand. Only release the yarn you pulled over with your left hand. Place the loop you are holding in your right hand over your left wrist and tighten.  Repeat this process until all of the stitches from your right arm are now on your left arm.  Begin your second row. To do this, hold the working yarn between your thumb and index finger of your left hand. Pick up the first stitch on your left wrist with your right hand.  Pull the stitch over the yarn you are holding in your left hand, and let go. Do not let go of the loop you are holding in your left hand. Only release the yarn you pulled over with your right hand. Place the loop you are holding in your left hand over your right wrist.  Repeat until all of the stitches from your left arm are now on your right arm. Remember, you should have the same number of stitches that you started with. Repeat rows one and two until you have achieved the desired scarf length. Row one is moving stitches from your right arm to your left. Row two is moving stitches from your left arm to your right. Two skeins of yarn will make a scarf long enough to wrap around your neck once. If you want to make an infinity scarf, join another two skeins of yarn by tying them to the original skeins. Make sure you finish with row two so that the yarn is on your right wrist to start casting off. Casting Off Hold your working yarn between your thumb and index finger of your right hand.  Pick up the first stitch on your right wrist with your left hand. Pull the loop over the yarn you are holding in your right hand, and let go. Do not let go of the loop you are holding in your right hand. Only release the yarn you pulled over with your left hand. Place the loop you are holding in your right hand over your left wrist and tighten.  Repeat this process so that you have two stitches on your left arm. You should never have more than two stitches on your left arm when casting off. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4e\\/IMG_7479.jpg\\/460px-IMG_7479.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4e\\/IMG_7479.jpg\\/760px-IMG_7479.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} With your right hand pick up the second stitch on your left arm (the one closest to your elbow).  Pull the stitch over your left hand.  Let go of all the yarn and tighten by pulling on the working yarn. You should be left with one stitch on your left arm. Repeat the process of this entire section so far to move a stitch from your right arm to your left arm. After this step, you should have two stitches on your left arm. Repeat the previous step. You should be left with only one stitch on your left arm. Continue the same method until you have one remaining stitch on your left arm. You are alternating between knitting a \"normal\" stitch from your right arm to your left one, and then pulling the second stitch over the first one on your left arm. Cut the working yarn leaving approximately two feet.  Pull the cut end through the final loop on your left arm, take the loop off of your arm, and pull tight.  Finishing Scarf Thread the cut end of the yarn through a needle.  Match up the edges of the scarf and sew the two ends together.  Turn the scarf inside out and sew through any loose ends. ",
  "sentences":[
    " Making the Knot Start with two skeins of yarn, and find the ends.",
    "These two skeins should be treated as if they were one, so make sure the two ends line up.",
    "Before you start, make sure the yarn can unfurl from the skeins easily.",
    "Leave approximately four feet of each skein for the tail of the scarf.",
    "The yarn attached to the ball is the working yarn.",
    "Make sure the working yarn is to your left, and the tail is to your right.",
    "Start the slipknot by holding the working yarn in your left hand so that your palm is facing you.",
    "Take the tail over the working yarn and make a loop.",
    "Pull the tail yarn through the loop, and pull tight to finish the knot leaving a loop at the top.",
    "Place the loop over your right arm and tighten around your wrist.",
    "Make sure the loop is loose enough to move up and down your wrist.",
    "You do not want the loop to be too tight.",
    "Casting On Separate the working yarn from the tail, holding the working yarn in your left hand.",
    "Make sure the tail is to the right of you.",
    "Hold the working yarn in your bottom two fingers of your left hand.",
    "Your thumb should be pacing up, and your index and middle finger should be pointing towards your right hand.",
    "Wrap your thumb over and under the working yarn.",
    "The yarn should be wrapped around your thumb and held between your bottom two fingers.",
    "Take your index and middle finger of your left hand and grab the tail yarn between your two fingers.",
    "Wrap your right fingers under the yarn that is touching your palm (the yarn that is being held between your thumb and bottom two fingers), and pull through making a loop.",
    "Grab the tail yarn with your right fingers, then pull the tail yarn towards you through the loop.",
    "When pulling the yarn through the loop, the yarn should come off of your thumb.",
    "Place the loop over your right wrist.",
    "Pull the loop tight.",
    "Repeat this process between ten and fourteen times.",
    "The amount of times that you repeat the steps will determine the width of the scarf.",
    "The more you repeat these steps, the wider the scarf.",
    "Knitting Rows Begin your first row.",
    "Hold your working yarn between your thumb and index finger of your right hand.",
    "Pick up the first stitch on your right wrist with your left hand.",
    "Pull the stitch over the yarn you are holding in your right hand, and let go.",
    "Do not let go of the loop you are holding in your right hand.",
    "Only release the yarn you pulled over with your left hand.",
    "Place the loop you are holding in your right hand over your left wrist and tighten.",
    "Repeat this process until all of the stitches from your right arm are now on your left arm.",
    "Begin your second row.",
    "To do this, hold the working yarn between your thumb and index finger of your left hand.",
    "Pick up the first stitch on your left wrist with your right hand.",
    "Pull the stitch over the yarn you are holding in your left hand, and let go.",
    "Do not let go of the loop you are holding in your left hand.",
    "Only release the yarn you pulled over with your right hand.",
    "Place the loop you are holding in your left hand over your right wrist.",
    "Repeat until all of the stitches from your left arm are now on your right arm.",
    "Remember, you should have the same number of stitches that you started with.",
    "Repeat rows one and two until you have achieved the desired scarf length.",
    "Row one is moving stitches from your right arm to your left.",
    "Row two is moving stitches from your left arm to your right.",
    "Two skeins of yarn will make a scarf long enough to wrap around your neck once.",
    "If you want to make an infinity scarf, join another two skeins of yarn by tying them to the original skeins.",
    "Make sure you finish with row two so that the yarn is on your right wrist to start casting off.",
    "Casting Off Hold your working yarn between your thumb and index finger of your right hand.",
    "Pick up the first stitch on your right wrist with your left hand.",
    "Pull the loop over the yarn you are holding in your right hand, and let go.",
    "Do not let go of the loop you are holding in your right hand.",
    "Only release the yarn you pulled over with your left hand.",
    "Place the loop you are holding in your right hand over your left wrist and tighten.",
    "Repeat this process so that you have two stitches on your left arm.",
    "You should never have more than two stitches on your left arm when casting off.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4e\\/IMG_7479.jpg\\/460px-IMG_7479.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4e\\/IMG_7479.jpg\\/760px-IMG_7479.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} With your right hand pick up the second stitch on your left arm (the one closest to your elbow).",
    "Pull the stitch over your left hand.",
    "Let go of all the yarn and tighten by pulling on the working yarn.",
    "You should be left with one stitch on your left arm.",
    "Repeat the process of this entire section so far to move a stitch from your right arm to your left arm.",
    "After this step, you should have two stitches on your left arm.",
    "Repeat the previous step.",
    "You should be left with only one stitch on your left arm.",
    "Continue the same method until you have one remaining stitch on your left arm.",
    "You are alternating between knitting a \"normal\" stitch from your right arm to your left one, and then pulling the second stitch over the first one on your left arm.",
    "Cut the working yarn leaving approximately two feet.",
    "Pull the cut end through the final loop on your left arm, take the loop off of your arm, and pull tight.",
    "Finishing Scarf Thread the cut end of the yarn through a needle.",
    "Match up the edges of the scarf and sew the two ends together.",
    "Turn the scarf inside out and sew through any loose ends."
  ],
  "tyn_section":[
    "2-4 skeins of bulky yarn",
    "Scissors",
    "Darning needle"
  ],
  "tyn_model":[
    "yarn",
    "scarf",
    "needle"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}