{
  "title":"How to Make Waffles Without Baking Powder",
  "url":"https://www.wikihow.com/Make-Waffles-Without-Baking-Powder",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Waffles"
  ],
  "methods":[
    {
      "name":"Making Waffles with Yeast",
      "steps":[
        {
          "headline":"Mix yeast with water.",
          "description":"Use a large mixing bowl. Pour in a ½ cup of water (118 ml). Add 1 tablespoon of active dry yeast. Stir until the yeast dissolves."
        },
        {
          "headline":"Combine butter, milk, and salt separately.",
          "description":"First, use your microwave or stovetop to melt a ½ cup of butter (118 ml). Then, in a second mixing bowl, add the butter, 2 cups of milk (473 ml), and 1 teaspoon of salt. For sweeter waffles, also add 2 tablespoons of sugar if desired. Stir until the ingredients are evenly mixed."
        },
        {
          "headline":"Combine the two bowls.",
          "description":"First, allow the second bowl’s contents to cool down until it is lukewarm at most. Then pour them into the first bowl with the yeast and water. Stir until they have combined evenly."
        },
        {
          "headline":"Add flour.",
          "description":"Once the two liquid mixtures have been combined, add 3 cups of all-purpose flours (384 g). Mix the flour vigorously to form a dough. Continue until no dry flour remains."
        },
        {
          "headline":"Let the dough rise.",
          "description":"Seal the bowl with an airtight lid or plastic wrap. Then let it sit as is overnight. Expect the dough to double or triple in size during that time."
        },
        {
          "headline":"Add eggs and baking soda.",
          "description":"Once the dough has risen, beat or whisk two eggs until their consistency is even. Pour these into the batter, then add a ½ teaspoon of baking soda. Whisk or beat them the new ingredients into the dough until they have mixed evenly."
        },
        {
          "headline":"Make your waffles.",
          "description":"Line the inside of your waffle iron with a thin layer of vegetable oil to keep your batter from waffles from sticking. Then preheat the iron to its optimum temperature. Scoop an eighth of your dough into the iron for each waffle. Cook for about four minutes. Waffle irons’ temperatures may differ from one model to the next. Add or subtract minutes as needed."
        }
      ]
    },
    {
      "name":"Using a Dairy-Heavy Recipe",
      "steps":[
        {
          "headline":"Mix dry ingredients, minus the sugar.",
          "description":"Use a medium-sized mixing bowl. Add 1.5 cups of flour (188 g), 1 teaspoon of salt, and a ½ teaspoon of baking soda. Stir until they are evenly mixed."
        },
        {
          "headline":"Combine the wet ingredients, plus sugar.",
          "description":"Start by beating one egg in a second medium-sized mixing bowl. Next, throw in a ½ cup of granulated sugar (101 g), 2 tablespoons of softened butter, and 2 tablespoons of shortening. Mix thoroughly with an electric mixer until the consistency becomes smooth. Then add a ½ cup of half & half (118 ml), a ½ cup of milk (118 ml), a ¼ cup of buttermilk (59 ml), and a ¼ teaspoon of vanilla. Continue mixing until they are combined. If you are making batter ahead of time, cover the bowl with its lid or plastic wrap and refrigerate."
        },
        {
          "headline":"Make your waffles.",
          "description":"First, apply a light coat of vegetable oil over your waffle iron to prevent sticking. Then let the iron preheat to optimum temperature. Once it does, ladle about ⅓ to ½ cup of batter (78 to 118 ml) onto the iron. Close the iron and cook for three to four minutes. Waffle irons’ temperatures may vary. Adjust cooking time as needed."
        }
      ]
    },
    {
      "name":"Whipping Up a Vegan Gluten-Free Batter",
      "steps":[
        {
          "headline":"Soften the buckwheat.",
          "description":"Place 4 cups of buckwheat (660 g) in a large bowl. In a pot or kettle, heat enough water to both cover the buckwheat and fill an additional three to four inches (7.6 to 10.2 cm). Once the water reaches roughly 80 degrees Fahrenheit (26.7 degrees Celsius), pour the water into the bowl. Pour a ¼ cup of apple cider (59 ml) in with it. Then let the buckwheat soak and soften for 8 to 24 hours."
        },
        {
          "headline":"Strain the buckwheat.",
          "description":"Once the buckwheat has soaked, pour the bowl’s contents into a strainer over the sink to get rid of the water/vinegar mix. Rinse the buckwheat and allow it to drain. Then transfer it to a high-speed blender."
        },
        {
          "headline":"Blend with remaining ingredients.",
          "description":"Throw in 3 cups of water (710 ml), ¼ cup of liquified coconut oil (54 g), ¼ cup of tapioca starch (40 g), 6 drops of liquid stevia, 1.5 teaspoons of cinnamon, and 1.5 teaspoons of sea salt. Blend on pulse until the batter becomes smooth. If needed, liquify your coconut oil by heating it in a small saucepan."
        },
        {
          "headline":"Cook your waffles.",
          "description":"Coat the inside of your waffle iron with a thin layer of vegetable oil to keep your batter from sticking. Preheat the iron to its optimum temperature. Ladle about one cup of the batter into the iron for each waffle. Cook for three to four minutes. Waffle irons’ temperatures may differ from one model to the next. Add or subtract minutes as needed."
        }
      ]
    },
    {
      "name":"Making a Substitute for Baking Powder",
      "steps":[
        {
          "headline":"Mix cream of tartar with baking soda.",
          "description":"For every teaspoon of baking powder needed, add ½ teaspoon of cream of tartar. Add a ¼ teaspoon of baking soda. Whisk until they are evenly mixed. You can also add a ¼ teaspoon of cornstarch if desired."
        },
        {
          "headline":"Seal inside an airtight container.",
          "description":"If you are making this to bake with later, or if you have any left over afterward, use an airtight container for storage. Keep moisture out to avoid the mixture from clumping up unevenly. Keep the container in a refrigerator."
        },
        {
          "headline":"Test old mixtures before baking.",
          "description":"If your mixture has been in the pantry or cabinet for a while, make sure that the ingredients needed for leavening your waffle are still active. Heat some water in a pot until it starts to steam. Sprinkle some of the mixture into the water. If the water starts to fizz upon contact, the chemicals are still active. If not, a new batch is required."
        }
      ]
    }
  ],
  "text":" Making Waffles with Yeast Mix yeast with water. Use a large mixing bowl. Pour in a ½ cup of water (118 ml). Add 1 tablespoon of active dry yeast. Stir until the yeast dissolves. Combine butter, milk, and salt separately. First, use your microwave or stovetop to melt a ½ cup of butter (118 ml). Then, in a second mixing bowl, add the butter, 2 cups of milk (473 ml), and 1 teaspoon of salt. For sweeter waffles, also add 2 tablespoons of sugar if desired. Stir until the ingredients are evenly mixed. Combine the two bowls. First, allow the second bowl’s contents to cool down until it is lukewarm at most. Then pour them into the first bowl with the yeast and water. Stir until they have combined evenly. Add flour. Once the two liquid mixtures have been combined, add 3 cups of all-purpose flours (384 g). Mix the flour vigorously to form a dough. Continue until no dry flour remains. Let the dough rise. Seal the bowl with an airtight lid or plastic wrap. Then let it sit as is overnight. Expect the dough to double or triple in size during that time. Add eggs and baking soda. Once the dough has risen, beat or whisk two eggs until their consistency is even. Pour these into the batter, then add a ½ teaspoon of baking soda. Whisk or beat them the new ingredients into the dough until they have mixed evenly. Make your waffles. Line the inside of your waffle iron with a thin layer of vegetable oil to keep your batter from waffles from sticking. Then preheat the iron to its optimum temperature. Scoop an eighth of your dough into the iron for each waffle. Cook for about four minutes. Waffle irons’ temperatures may differ from one model to the next. Add or subtract minutes as needed. Using a Dairy-Heavy Recipe Mix dry ingredients, minus the sugar. Use a medium-sized mixing bowl. Add 1.5 cups of flour (188 g), 1 teaspoon of salt, and a ½ teaspoon of baking soda. Stir until they are evenly mixed. Combine the wet ingredients, plus sugar. Start by beating one egg in a second medium-sized mixing bowl. Next, throw in a ½ cup of granulated sugar (101 g), 2 tablespoons of softened butter, and 2 tablespoons of shortening. Mix thoroughly with an electric mixer until the consistency becomes smooth. Then add a ½ cup of half & half (118 ml), a ½ cup of milk (118 ml), a ¼ cup of buttermilk (59 ml), and a ¼ teaspoon of vanilla. Continue mixing until they are combined. If you are making batter ahead of time, cover the bowl with its lid or plastic wrap and refrigerate. Make your waffles. First, apply a light coat of vegetable oil over your waffle iron to prevent sticking. Then let the iron preheat to optimum temperature. Once it does, ladle about ⅓ to ½ cup of batter (78 to 118 ml) onto the iron. Close the iron and cook for three to four minutes. Waffle irons’ temperatures may vary. Adjust cooking time as needed. Whipping Up a Vegan Gluten-Free Batter Soften the buckwheat. Place 4 cups of buckwheat (660 g) in a large bowl. In a pot or kettle, heat enough water to both cover the buckwheat and fill an additional three to four inches (7.6 to 10.2 cm). Once the water reaches roughly 80 degrees Fahrenheit (26.7 degrees Celsius), pour the water into the bowl. Pour a ¼ cup of apple cider (59 ml) in with it. Then let the buckwheat soak and soften for 8 to 24 hours. Strain the buckwheat. Once the buckwheat has soaked, pour the bowl’s contents into a strainer over the sink to get rid of the water/vinegar mix. Rinse the buckwheat and allow it to drain. Then transfer it to a high-speed blender. Blend with remaining ingredients. Throw in 3 cups of water (710 ml), ¼ cup of liquified coconut oil (54 g), ¼ cup of tapioca starch (40 g), 6 drops of liquid stevia, 1.5 teaspoons of cinnamon, and 1.5 teaspoons of sea salt. Blend on pulse until the batter becomes smooth. If needed, liquify your coconut oil by heating it in a small saucepan. Cook your waffles. Coat the inside of your waffle iron with a thin layer of vegetable oil to keep your batter from sticking. Preheat the iron to its optimum temperature. Ladle about one cup of the batter into the iron for each waffle. Cook for three to four minutes. Waffle irons’ temperatures may differ from one model to the next. Add or subtract minutes as needed. Making a Substitute for Baking Powder Mix cream of tartar with baking soda. For every teaspoon of baking powder needed, add ½ teaspoon of cream of tartar. Add a ¼ teaspoon of baking soda. Whisk until they are evenly mixed. You can also add a ¼ teaspoon of cornstarch if desired. Seal inside an airtight container. If you are making this to bake with later, or if you have any left over afterward, use an airtight container for storage. Keep moisture out to avoid the mixture from clumping up unevenly. Keep the container in a refrigerator. Test old mixtures before baking. If your mixture has been in the pantry or cabinet for a while, make sure that the ingredients needed for leavening your waffle are still active. Heat some water in a pot until it starts to steam. Sprinkle some of the mixture into the water. If the water starts to fizz upon contact, the chemicals are still active. If not, a new batch is required.",
  "sentences":[
    " Making Waffles with Yeast Mix yeast with water.",
    "Use a large mixing bowl.",
    "Pour in a ½ cup of water (118 ml).",
    "Add 1 tablespoon of active dry yeast.",
    "Stir until the yeast dissolves.",
    "Combine butter, milk, and salt separately.",
    "First, use your microwave or stovetop to melt a ½ cup of butter (118 ml).",
    "Then, in a second mixing bowl, add the butter, 2 cups of milk (473 ml), and 1 teaspoon of salt.",
    "For sweeter waffles, also add 2 tablespoons of sugar if desired.",
    "Stir until the ingredients are evenly mixed.",
    "Combine the two bowls.",
    "First, allow the second bowl’s contents to cool down until it is lukewarm at most.",
    "Then pour them into the first bowl with the yeast and water.",
    "Stir until they have combined evenly.",
    "Add flour.",
    "Once the two liquid mixtures have been combined, add 3 cups of all-purpose flours (384 g).",
    "Mix the flour vigorously to form a dough.",
    "Continue until no dry flour remains.",
    "Let the dough rise.",
    "Seal the bowl with an airtight lid or plastic wrap.",
    "Then let it sit as is overnight.",
    "Expect the dough to double or triple in size during that time.",
    "Add eggs and baking soda.",
    "Once the dough has risen, beat or whisk two eggs until their consistency is even.",
    "Pour these into the batter, then add a ½ teaspoon of baking soda.",
    "Whisk or beat them the new ingredients into the dough until they have mixed evenly.",
    "Make your waffles.",
    "Line the inside of your waffle iron with a thin layer of vegetable oil to keep your batter from waffles from sticking.",
    "Then preheat the iron to its optimum temperature.",
    "Scoop an eighth of your dough into the iron for each waffle.",
    "Cook for about four minutes.",
    "Waffle irons’ temperatures may differ from one model to the next.",
    "Add or subtract minutes as needed.",
    "Using a Dairy-Heavy Recipe Mix dry ingredients, minus the sugar.",
    "Use a medium-sized mixing bowl.",
    "Add 1.5 cups of flour (188 g), 1 teaspoon of salt, and a ½ teaspoon of baking soda.",
    "Stir until they are evenly mixed.",
    "Combine the wet ingredients, plus sugar.",
    "Start by beating one egg in a second medium-sized mixing bowl.",
    "Next, throw in a ½ cup of granulated sugar (101 g), 2 tablespoons of softened butter, and 2 tablespoons of shortening.",
    "Mix thoroughly with an electric mixer until the consistency becomes smooth.",
    "Then add a ½ cup of half & half (118 ml), a ½ cup of milk (118 ml), a ¼ cup of buttermilk (59 ml), and a ¼ teaspoon of vanilla.",
    "Continue mixing until they are combined.",
    "If you are making batter ahead of time, cover the bowl with its lid or plastic wrap and refrigerate.",
    "Make your waffles.",
    "First, apply a light coat of vegetable oil over your waffle iron to prevent sticking.",
    "Then let the iron preheat to optimum temperature.",
    "Once it does, ladle about ⅓ to ½ cup of batter (78 to 118 ml) onto the iron.",
    "Close the iron and cook for three to four minutes.",
    "Waffle irons’ temperatures may vary.",
    "Adjust cooking time as needed.",
    "Whipping Up a Vegan Gluten-Free Batter Soften the buckwheat.",
    "Place 4 cups of buckwheat (660 g) in a large bowl.",
    "In a pot or kettle, heat enough water to both cover the buckwheat and fill an additional three to four inches (7.6 to 10.2 cm).",
    "Once the water reaches roughly 80 degrees Fahrenheit (26.7 degrees Celsius), pour the water into the bowl.",
    "Pour a ¼ cup of apple cider (59 ml) in with it.",
    "Then let the buckwheat soak and soften for 8 to 24 hours.",
    "Strain the buckwheat.",
    "Once the buckwheat has soaked, pour the bowl’s contents into a strainer over the sink to get rid of the water/vinegar mix.",
    "Rinse the buckwheat and allow it to drain.",
    "Then transfer it to a high-speed blender.",
    "Blend with remaining ingredients.",
    "Throw in 3 cups of water (710 ml), ¼ cup of liquified coconut oil (54 g), ¼ cup of tapioca starch (40 g), 6 drops of liquid stevia, 1.5 teaspoons of cinnamon, and 1.5 teaspoons of sea salt.",
    "Blend on pulse until the batter becomes smooth.",
    "If needed, liquify your coconut oil by heating it in a small saucepan.",
    "Cook your waffles.",
    "Coat the inside of your waffle iron with a thin layer of vegetable oil to keep your batter from sticking.",
    "Preheat the iron to its optimum temperature.",
    "Ladle about one cup of the batter into the iron for each waffle.",
    "Cook for three to four minutes.",
    "Waffle irons’ temperatures may differ from one model to the next.",
    "Add or subtract minutes as needed.",
    "Making a Substitute for Baking Powder Mix cream of tartar with baking soda.",
    "For every teaspoon of baking powder needed, add ½ teaspoon of cream of tartar.",
    "Add a ¼ teaspoon of baking soda.",
    "Whisk until they are evenly mixed.",
    "You can also add a ¼ teaspoon of cornstarch if desired.",
    "Seal inside an airtight container.",
    "If you are making this to bake with later, or if you have any left over afterward, use an airtight container for storage.",
    "Keep moisture out to avoid the mixture from clumping up unevenly.",
    "Keep the container in a refrigerator.",
    "Test old mixtures before baking.",
    "If your mixture has been in the pantry or cabinet for a while, make sure that the ingredients needed for leavening your waffle are still active.",
    "Heat some water in a pot until it starts to steam.",
    "Sprinkle some of the mixture into the water.",
    "If the water starts to fizz upon contact, the chemicals are still active.",
    "If not, a new batch is required."
  ],
  "tyn_section":[
    "Waffles with Yeast:",
    "Measuring cups",
    "Measuring spoons",
    "One large mixing bowl (preferably with lid)",
    "Second mixing bowl",
    "Large spoon for stirring",
    "Microwave or stovetop (for melting butter)",
    "Micowave-safe dish or saucepan (for melting butter)",
    "Plastic wrap",
    "Whisk or egg beater",
    "Dairy-Heavy Recipe:",
    "2 medium-sized mixing bowls",
    "Measuring cups and spoons",
    "Large spoon for mixing",
    "Electric mixer",
    "Waffle iron",
    "Vegetable oil (for cooking)",
    "Ladle",
    "Vegan Gluten-Free Batter:",
    "Large bowl for soaking",
    "Water for soaking",
    "Pot or kettle",
    "Strainer",
    "High-speed blender",
    "Baking Powder Substitute:",
    "Mixing bowl",
    "Spoon for mixing"
  ],
  "tyn_model":[
    "water",
    "baking soda",
    "iron",
    "flour",
    "bowl",
    "butter",
    "milk",
    "salt",
    "sugar",
    "waffle iron",
    "vegetable oil",
    "waffle irons",
    "’ temperatures",
    "yeast",
    "plastic wrap",
    "eggs",
    "medium-sized mixing bowl",
    "pot",
    "coconut oil",
    "baking powder",
    "airtight container",
    "active dry yeast",
    "microwave",
    "mixing bowl",
    "all-purpose flours",
    "airtight lid",
    "granulated sugar",
    "softened butter",
    "shortening",
    "electric mixer",
    "half & half",
    "buttermilk (",
    "vanilla",
    "⅓ to",
    "large bowl",
    "apple cider",
    "strainer",
    "vinegar",
    "high-speed blender",
    "tapioca starch",
    "liquid stevia",
    "cinnamon",
    "sea salt",
    "small saucepan",
    "cream of tartar",
    "cornstarch",
    "refrigerator"
  ],
  "simple_metrics":{
    "r":0.2222222222,
    "p":0.1276595745,
    "f1":0.1621621622,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3703703704,
    "p":0.2553191489,
    "f1":0.3022670025
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4814814815,
    "p":0.3191489362,
    "f1":0.3838582677
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2962962963,
    "p":0.170212766,
    "f1":0.2162162162
  }
}