{
  "title":"How to Make a Smudge Stick",
  "url":"https://www.wikihow.com/Make-a-Smudge-Stick",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Growing the Sage (Optional)",
      "steps":[
        {
          "headline":"Find an ideal place to plant the sage.",
          "description":"Before you start your sage plant, you will want to find a place outdoors that will provide optimal growing conditions. Sage grows best in full sun and well-drained soil. A clay pot is ideal to help with drainage for your sage plant especially if you live in a rainy climate. If you have to keep your plant indoors, make sure to keep it next to a sunny window."
        },
        {
          "headline":"Plan ahead when you will start your plant.",
          "description":"There are two methods to starting your plant:\nStart from seed. If you decide to grow from seed, plant the seeds 6-10 weeks before the last frost. You can sow the seeds outside in a bed placing them about 18–24 inches (46–61 cm) apart. However, growing sage from seed can be challenging and it can take up to two years for the plant to reach maturity. Many gardeners choose to start plants from cuttings because of this. Start with cuttings. If you tried starting fro seeds, and the plants didn't germinate properly, then try to start a plant with sage cuttings. Cut a stem off a healthy mature sage plant at least 3 inches (7.6 cm) long. Remove the leaves at the bottom, but make sure to keep at least a couple pairs of leaves at the top. Place your sage cutting into soil and water it. Be careful not to give it too much or too little water."
        },
        {
          "headline":"Wait for the right time to harvest.",
          "description":"It will take approximately 75 days, or two and a half months for the sage to be ready to be harvested. Once it's ready, take the trimmers and cut the stems of the desired leaves at the base of the plant. Be sure not to harvest more than half the plant so it will continue to grow for future harvests. If you are not confident enough to grow your own sage, or if it is too late in the season to start a new plant, you can purchase a sage plant."
        },
        {
          "headline":"Wait one day before you start wrapping your sage.",
          "description":"Place your trimmings in a paper bag or on top of newspaper overnight. Make sure they are not left in plastic or out in sunlight because this can cause the sage to wilt or it could start to decompose."
        }
      ]
    },
    {
      "name":"Making the Smudge Stick",
      "steps":[
        {
          "headline":"Clip the sage into relatively same lengths.",
          "description":"Remove any spotted or brown leaves. Arrange the leaves into bundles of the same lengths."
        },
        {
          "headline":"Grab the string and tie a knot at the base of the stems of the leaves.",
          "description":"Hold the bundle in one hand and wind the string up the bundle. Once you reach the top, wind the string down the bundle creating a crisscross design. This helps hold all the leaves in place. Wrap the leaves as tightly as possible. Tie another knot at the bottom of the bundle."
        },
        {
          "headline":"Set the bundles inside somewhere where it is dark and dry.",
          "description":"You can hang them on a drying line, or lay them flat to dry. If you lay them down flat, it is better to put them on a screen to help airflow. It is also good to flip them over every day or so. Depending on how humid it is, it can take up to a few weeks"
        }
      ]
    },
    {
      "name":"Using the Smudge Stick",
      "steps":[
        {
          "headline":"Ensure the stick is dry.",
          "description":"After the smudge sticks have dried, now they are ready to burn. Holding the stick at the base, use a match or lighter to ignite the top end of the smudge stick. Allow the sage to catch fire for a moment, and then carefully blow out the flame. Let the stick smolder and white smoke will start to travel upwards. Hold the sage over an ashtray or bowl to catch any fallen debris. Traditionally a shell is used for this purpose."
        },
        {
          "headline":"Use the white smoke from the smudge stick to cleanse rooms, spaces or people.",
          "description":"Gently wave the smoke from the smudge stick around the room where you want to clear the energy. The smoke will remove any negative energy left behind and leave a nice fragrance in the room. The same process can be done on a person. Slowly moving the smoldering sage around the person’s feet, limbs and head to help cleanse the energy around them."
        },
        {
          "headline":"Fully extinguish the flame when you are finished cleansing an area.",
          "description":"Press the smudge stick down to stifle the smoke completely. Try to avoid using water to put out the smudge stick because this can damage the stick for future use. Never leave burning sage unattended."
        }
      ]
    }
  ],
  "text":" Growing the Sage (Optional) Find an ideal place to plant the sage. Before you start your sage plant, you will want to find a place outdoors that will provide optimal growing conditions. Sage grows best in full sun and well-drained soil. A clay pot is ideal to help with drainage for your sage plant especially if you live in a rainy climate. If you have to keep your plant indoors, make sure to keep it next to a sunny window. Plan ahead when you will start your plant. There are two methods to starting your plant:\nStart from seed. If you decide to grow from seed, plant the seeds 6-10 weeks before the last frost. You can sow the seeds outside in a bed placing them about 18–24 inches (46–61 cm) apart. However, growing sage from seed can be challenging and it can take up to two years for the plant to reach maturity. Many gardeners choose to start plants from cuttings because of this. Start with cuttings. If you tried starting fro seeds, and the plants didn't germinate properly, then try to start a plant with sage cuttings. Cut a stem off a healthy mature sage plant at least 3 inches (7.6 cm) long. Remove the leaves at the bottom, but make sure to keep at least a couple pairs of leaves at the top. Place your sage cutting into soil and water it. Be careful not to give it too much or too little water. Wait for the right time to harvest. It will take approximately 75 days, or two and a half months for the sage to be ready to be harvested. Once it's ready, take the trimmers and cut the stems of the desired leaves at the base of the plant. Be sure not to harvest more than half the plant so it will continue to grow for future harvests. If you are not confident enough to grow your own sage, or if it is too late in the season to start a new plant, you can purchase a sage plant. Wait one day before you start wrapping your sage. Place your trimmings in a paper bag or on top of newspaper overnight. Make sure they are not left in plastic or out in sunlight because this can cause the sage to wilt or it could start to decompose. Making the Smudge Stick Clip the sage into relatively same lengths. Remove any spotted or brown leaves. Arrange the leaves into bundles of the same lengths. Grab the string and tie a knot at the base of the stems of the leaves. Hold the bundle in one hand and wind the string up the bundle. Once you reach the top, wind the string down the bundle creating a crisscross design. This helps hold all the leaves in place. Wrap the leaves as tightly as possible. Tie another knot at the bottom of the bundle. Set the bundles inside somewhere where it is dark and dry. You can hang them on a drying line, or lay them flat to dry. If you lay them down flat, it is better to put them on a screen to help airflow. It is also good to flip them over every day or so. Depending on how humid it is, it can take up to a few weeks Using the Smudge Stick Ensure the stick is dry. After the smudge sticks have dried, now they are ready to burn. Holding the stick at the base, use a match or lighter to ignite the top end of the smudge stick. Allow the sage to catch fire for a moment, and then carefully blow out the flame. Let the stick smolder and white smoke will start to travel upwards. Hold the sage over an ashtray or bowl to catch any fallen debris. Traditionally a shell is used for this purpose. Use the white smoke from the smudge stick to cleanse rooms, spaces or people. Gently wave the smoke from the smudge stick around the room where you want to clear the energy. The smoke will remove any negative energy left behind and leave a nice fragrance in the room. The same process can be done on a person. Slowly moving the smoldering sage around the person’s feet, limbs and head to help cleanse the energy around them. Fully extinguish the flame when you are finished cleansing an area. Press the smudge stick down to stifle the smoke completely. Try to avoid using water to put out the smudge stick because this can damage the stick for future use. Never leave burning sage unattended.",
  "sentences":[
    " Growing the Sage (Optional) Find an ideal place to plant the sage.",
    "Before you start your sage plant, you will want to find a place outdoors that will provide optimal growing conditions.",
    "Sage grows best in full sun and well-drained soil.",
    "A clay pot is ideal to help with drainage for your sage plant especially if you live in a rainy climate.",
    "If you have to keep your plant indoors, make sure to keep it next to a sunny window.",
    "Plan ahead when you will start your plant.",
    "There are two methods to starting your plant:\nStart from seed.",
    "If you decide to grow from seed, plant the seeds 6-10 weeks before the last frost.",
    "You can sow the seeds outside in a bed placing them about 18–24 inches (46–61 cm) apart.",
    "However, growing sage from seed can be challenging and it can take up to two years for the plant to reach maturity.",
    "Many gardeners choose to start plants from cuttings because of this.",
    "Start with cuttings.",
    "If you tried starting fro seeds, and the plants didn't germinate properly, then try to start a plant with sage cuttings.",
    "Cut a stem off a healthy mature sage plant at least 3 inches (7.6 cm) long.",
    "Remove the leaves at the bottom, but make sure to keep at least a couple pairs of leaves at the top.",
    "Place your sage cutting into soil and water it.",
    "Be careful not to give it too much or too little water.",
    "Wait for the right time to harvest.",
    "It will take approximately 75 days, or two and a half months for the sage to be ready to be harvested.",
    "Once it's ready, take the trimmers and cut the stems of the desired leaves at the base of the plant.",
    "Be sure not to harvest more than half the plant so it will continue to grow for future harvests.",
    "If you are not confident enough to grow your own sage, or if it is too late in the season to start a new plant, you can purchase a sage plant.",
    "Wait one day before you start wrapping your sage.",
    "Place your trimmings in a paper bag or on top of newspaper overnight.",
    "Make sure they are not left in plastic or out in sunlight because this can cause the sage to wilt or it could start to decompose.",
    "Making the Smudge Stick Clip the sage into relatively same lengths.",
    "Remove any spotted or brown leaves.",
    "Arrange the leaves into bundles of the same lengths.",
    "Grab the string and tie a knot at the base of the stems of the leaves.",
    "Hold the bundle in one hand and wind the string up the bundle.",
    "Once you reach the top, wind the string down the bundle creating a crisscross design.",
    "This helps hold all the leaves in place.",
    "Wrap the leaves as tightly as possible.",
    "Tie another knot at the bottom of the bundle.",
    "Set the bundles inside somewhere where it is dark and dry.",
    "You can hang them on a drying line, or lay them flat to dry.",
    "If you lay them down flat, it is better to put them on a screen to help airflow.",
    "It is also good to flip them over every day or so.",
    "Depending on how humid it is, it can take up to a few weeks Using the Smudge Stick Ensure the stick is dry.",
    "After the smudge sticks have dried, now they are ready to burn.",
    "Holding the stick at the base, use a match or lighter to ignite the top end of the smudge stick.",
    "Allow the sage to catch fire for a moment, and then carefully blow out the flame.",
    "Let the stick smolder and white smoke will start to travel upwards.",
    "Hold the sage over an ashtray or bowl to catch any fallen debris.",
    "Traditionally a shell is used for this purpose.",
    "Use the white smoke from the smudge stick to cleanse rooms, spaces or people.",
    "Gently wave the smoke from the smudge stick around the room where you want to clear the energy.",
    "The smoke will remove any negative energy left behind and leave a nice fragrance in the room.",
    "The same process can be done on a person.",
    "Slowly moving the smoldering sage around the person’s feet, limbs and head to help cleanse the energy around them.",
    "Fully extinguish the flame when you are finished cleansing an area.",
    "Press the smudge stick down to stifle the smoke completely.",
    "Try to avoid using water to put out the smudge stick because this can damage the stick for future use.",
    "Never leave burning sage unattended."
  ],
  "tyn_section":[
    "Sage seeds or cuttings from a mature sage plant",
    "Clay pot",
    "Hand shovel",
    "Quality soil that will provide drainage",
    "Gardening clippers",
    "String or twine",
    "Newspaper"
  ],
  "tyn_model":[
    "sage",
    "water",
    "pot",
    "trimmers",
    "sage plant",
    "newspaper",
    "string",
    "smudge stick",
    "match",
    "lighter",
    "ashtray",
    "bowl"
  ],
  "simple_metrics":{
    "r":0.1428571429,
    "p":0.0833333333,
    "f1":0.1052631579,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2857142857,
    "p":0.1666666667,
    "f1":0.2105263158
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4285714286,
    "p":0.25,
    "f1":0.3157894737
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1428571429,
    "p":0.0833333333,
    "f1":0.1052631579
  }
}