{
  "title":"How to Make Whole Wheat Bread in a Machine",
  "url":"https://www.wikihow.com/Make-Whole-Wheat-Bread-in-a-Machine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads"
  ],
  "steps":[
    {
      "headline":"Add two tablespoons of packed brown sugar to the bottom of the bread machine pan.",
      "description":"If you would like a darker texture of bread, at this point you can also add 3 tablespoons of molasses."
    },
    {
      "headline":"Add two tablespoons of olive oil.",
      "description":""
    },
    {
      "headline":"Add the warm water.",
      "description":"You can use it to rinse the oil and sugar off the measuring spoon."
    },
    {
      "headline":"Add up to two teaspoons of salt.",
      "description":"The salt controls the rise, and you don't want it to over-rise. The bread may hit the lid of the bread machine if it rises too much. It may also form a bubble or cave-in in the center. Make this bread more than once, and you will learn how much salt to add to control the rise."
    },
    {
      "headline":"Add three cups of unbleached flour.",
      "description":""
    },
    {
      "headline":"Add one cup of whole wheat flour.",
      "description":""
    },
    {
      "headline":"Add the yeast.",
      "description":"Adding it on the top of the flour like this keeps it dry until the bread cycle starts, in case you want to use a delay timer."
    },
    {
      "headline":"Place the pan in the bread machine.",
      "description":"Make sure it's inserted firmly and correctly."
    },
    {
      "headline":"Select an appropriate cycle and start the machine.",
      "description":"Do not open the machine while the cycle is running."
    }
  ],
  "text":" Add two tablespoons of packed brown sugar to the bottom of the bread machine pan. If you would like a darker texture of bread, at this point you can also add 3 tablespoons of molasses. Add two tablespoons of olive oil.  Add the warm water. You can use it to rinse the oil and sugar off the measuring spoon. Add up to two teaspoons of salt. The salt controls the rise, and you don't want it to over-rise. The bread may hit the lid of the bread machine if it rises too much. It may also form a bubble or cave-in in the center. Make this bread more than once, and you will learn how much salt to add to control the rise. Add three cups of unbleached flour.  Add one cup of whole wheat flour.  Add the yeast. Adding it on the top of the flour like this keeps it dry until the bread cycle starts, in case you want to use a delay timer. Place the pan in the bread machine. Make sure it's inserted firmly and correctly. Select an appropriate cycle and start the machine. Do not open the machine while the cycle is running.",
  "sentences":[
    " Add two tablespoons of packed brown sugar to the bottom of the bread machine pan.",
    "If you would like a darker texture of bread, at this point you can also add 3 tablespoons of molasses.",
    "Add two tablespoons of olive oil.",
    "Add the warm water.",
    "You can use it to rinse the oil and sugar off the measuring spoon.",
    "Add up to two teaspoons of salt.",
    "The salt controls the rise, and you don't want it to over-rise.",
    "The bread may hit the lid of the bread machine if it rises too much.",
    "It may also form a bubble or cave-in in the center.",
    "Make this bread more than once, and you will learn how much salt to add to control the rise.",
    "Add three cups of unbleached flour.",
    "Add one cup of whole wheat flour.",
    "Add the yeast.",
    "Adding it on the top of the flour like this keeps it dry until the bread cycle starts, in case you want to use a delay timer.",
    "Place the pan in the bread machine.",
    "Make sure it's inserted firmly and correctly.",
    "Select an appropriate cycle and start the machine.",
    "Do not open the machine while the cycle is running."
  ],
  "tyn_section":[
    "Bread machine",
    "Measuring cups and spoons"
  ],
  "tyn_model":[
    "bread machine",
    "salt",
    "brown sugar",
    "molasses",
    "olive oil",
    "water",
    "sugar",
    "measuring spoon",
    "whole wheat flour",
    "yeast",
    "flour",
    "pan"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0833333333,
    "f1":0.1428571429,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.0833333333,
    "f1":0.1428571429
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.0833333333,
    "f1":0.1428571429
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0833333333,
    "f1":0.1428571429
  }
}