{
  "title":"How to Make Matcha Tea",
  "url":"https://www.wikihow.com/Make-Matcha-Tea",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Tea",
    "Green Tea",
    "Matcha"
  ],
  "methods":[
    {
      "name":"Preparing Usucha",
      "steps":[
        {
          "headline":"Sift 1½ scoop of matcha powder into a small tea bowl and set it aside.",
          "description":"Place a sifter over a small tea bowl and measure out the matcha powder into it. If you do not have a matcha scoop, measure out 1½ teaspoon (2 grams) of matcha. Gently tap the sifter to sift the tea into the bowl. This will break up any clumps and give you a smoother matcha in the end. Usucha is a thinner type of matcha tea."
        },
        {
          "headline":"Pour 2 ounces (60 milliliters) of hot water into a separate tea cup.",
          "description":"The water needs to be just below boiling, about 165 to 180°F (75 to 80°C). Do not pour the hot water into the tea bowl with the matcha yet."
        },
        {
          "headline":"Slowly pour the hot water into the tea bowl.",
          "description":"This will help prevent the matcha from clumping. The hot water will also have warmed the tea cup up for you, making it ready for the tea. At this time, you may also want to dry the tea cup with a clean towel."
        },
        {
          "headline":"Whisk the tea rapidly for 10 to 15 seconds with a \"chasen\" using a zigzag motion.",
          "description":"A chasen is a delicate, bamboo whisk made specifically for preparing matcha tea. Do not use a metal fork or whisk as this will affect the flavor and aroma of the tea. This will give you a foamy tea. For a smoother tea, use circular motions."
        },
        {
          "headline":"Pour the tea back into the tea cup and drink it immediately.",
          "description":"This tea is not brewed like regular teas, so the tea powder will eventually settle to the bottom of the cup."
        }
      ]
    },
    {
      "name":"Preparing Koicha",
      "steps":[
        {
          "headline":"Sift 3 scoops of matcha powder into a small tea bowl and set it aside.",
          "description":"Place a small strainer over a small tea bowl and measure out the matcha powder into it. If you do not have a matcha scoop, measure out 3 teaspoons (4 grams) of matcha. Gently tap the side of the strainer to sift the tea into the bowl. This will break up any clumps and give you a smoother matcha in the end. Koicha is a thicker type of matcha tea."
        },
        {
          "headline":"Pour 2 ounces (60 milliliters) of hot water into a tea cup.",
          "description":"The water needs to be just short of boiling, about 165 to 180°F (75 to 80°C). Do not pour the hot water into the tea bowl with the matcha just yet. Make sure that you use filtered water or spring water. Ordinary tap water contains too many minerals which may affect the flavor of the tea."
        },
        {
          "headline":"Pour half of the water into the tea bowl.",
          "description":"Do not pour in all of the water all at once, or it will cause the tea to clump up."
        },
        {
          "headline":"Whisk the tea rapidly with a chasen using circular motions.",
          "description":"A chasen is a delicate, bamboo whisk made specifically for preparing matcha tea. Do not use a metal fork or whisk as this will affect the flavor and aroma of the tea. Keep stirring until the matcha is dissolved into a thick paste."
        },
        {
          "headline":"Pour the rest of the water into the bowl and stir it.",
          "description":"Use your chasen again and half-circular motions. Keep stirring until the matcha paste thins out. It won't be thin like Usucha, but thicker and darker."
        },
        {
          "headline":"Pour the matcha into the tea cup and drink it immediately.",
          "description":"If you wait too long, the matcha powder will settle to the bottom of the cup."
        }
      ]
    },
    {
      "name":"Making a Matcha Latte",
      "steps":[
        {
          "headline":"Sift 1½ teaspoon of matcha powder into a cup or mug.",
          "description":"Place a small strainer over a cup and measure the matcha powder into it. Gently tap the side of the strainer to shake the matcha powder into the cup. This will get rid of any clumps and give you a smoother drink in the end."
        },
        {
          "headline":"Stir in 1 tablespoon of hot water into the cup.",
          "description":"The water should be hot but not boiling, about 165 to 180°F (75 to 80°C). Briskly stir the tea using zigzag motions to make it frothy. Try to use a chasen (bamboo whisk) for this, but if you don't have one, a regular mini whisk will do. Keep whisking until all the powder is dissolved."
        },
        {
          "headline":"Heat the milk and sweetener.",
          "description":"You can do this using a milk frother on an espresso machine or in a saucepan on the stove. You can even do it in a cup in the microwave. Do not let the milk come to a boil; keep it between 165 to 180°F (75 to 80°C)."
        },
        {
          "headline":"Froth the milk for about 10 seconds, if desired.",
          "description":"You can do this by using a frother on an espresso machine. If you do not own an espresso machine, pour the milk into a separate cup and use a hand frother to froth it instead."
        },
        {
          "headline":"Pour the hot milk into the latte.",
          "description":"Place a large spoon just inside the rim of the frothing cup to hold back the foam. You do not have to use all of the milk—pour in as much as you'd like."
        },
        {
          "headline":"Scoop the foam on top of the cup.",
          "description":"Reach into your frother cup and scoop out the foam with a spoon. Gently place the foam on top of the latte. If you'd like, you can add another scoop or two of foam. Spread it evenly across the top of the latte."
        },
        {
          "headline":"Garnish with a sprinkle of matcha on top, if desired, and drink it immediately.",
          "description":"If you wait too long, the matcha powder will settle to the bottom of the cup."
        }
      ]
    },
    {
      "name":"Making an Iced Matcha Latte",
      "steps":[
        {
          "headline":"Sift 1½ teaspoons (2 grams) of matcha powder into a cup or mug.",
          "description":"Place a strainer over a cup and measure out the matcha powder into it. Gently tap the side of the strainer to sift the powder into the cup. This will get rid of any lumps and give you a smoother latte."
        },
        {
          "headline":"Add some sweetener, if desired.",
          "description":"You will be adding the hot water next, so it is better to add the sweetener right now. The hot water will help dissolve it much better than cold milk will. You can use any type of sweetener you wish, such as agave nectar, honey, maple syrup, sugar, etc."
        },
        {
          "headline":"Whisk in 1 tablespoon (15 milliliters) of hot water into the tea.",
          "description":"The water must be very hot, but not quite boiling—about 165 to 180°F (75 to 80°C). After you have poured the water in, briskly whisk it using a zigzag motion. You can use a chasen (bamboo whisk) for this, or you can use a metal whisk. Keep whisking until the matcha dissolves and there are no lumps or clumps. You will end up with a thick, green paste."
        },
        {
          "headline":"Whisk cold milk into the cup.",
          "description":"You can add as much milk as you'd like, and you can use any type of milk. Many people find that almond milk complements the flavor of matcha tea exceptionally well. Keep whisking the milk until it is combined with the matcha paste. There should be no streaks or swirls; you'll get a light green beverage."
        },
        {
          "headline":"Add some ice cubes, if desired.",
          "description":"To prevent the latte from getting watered down, consider using ice cubes made from milk. You can also omit the ice if you don't like your iced lattes as cold."
        },
        {
          "headline":"Garnish the latte with a sprinkle of matcha powder, and drink it immediately.",
          "description":"If you wait too long, the matcha powder will settle to the bottom of the cup."
        }
      ]
    }
  ],
  "text":" Preparing Usucha Sift 1½ scoop of matcha powder into a small tea bowl and set it aside. Place a sifter over a small tea bowl and measure out the matcha powder into it. If you do not have a matcha scoop, measure out 1½ teaspoon (2 grams) of matcha. Gently tap the sifter to sift the tea into the bowl. This will break up any clumps and give you a smoother matcha in the end. Usucha is a thinner type of matcha tea. Pour 2 ounces (60 milliliters) of hot water into a separate tea cup. The water needs to be just below boiling, about 165 to 180°F (75 to 80°C). Do not pour the hot water into the tea bowl with the matcha yet. Slowly pour the hot water into the tea bowl. This will help prevent the matcha from clumping. The hot water will also have warmed the tea cup up for you, making it ready for the tea. At this time, you may also want to dry the tea cup with a clean towel. Whisk the tea rapidly for 10 to 15 seconds with a \"chasen\" using a zigzag motion. A chasen is a delicate, bamboo whisk made specifically for preparing matcha tea. Do not use a metal fork or whisk as this will affect the flavor and aroma of the tea. This will give you a foamy tea. For a smoother tea, use circular motions. Pour the tea back into the tea cup and drink it immediately. This tea is not brewed like regular teas, so the tea powder will eventually settle to the bottom of the cup. Preparing Koicha Sift 3 scoops of matcha powder into a small tea bowl and set it aside. Place a small strainer over a small tea bowl and measure out the matcha powder into it. If you do not have a matcha scoop, measure out 3 teaspoons (4 grams) of matcha. Gently tap the side of the strainer to sift the tea into the bowl. This will break up any clumps and give you a smoother matcha in the end. Koicha is a thicker type of matcha tea. Pour 2 ounces (60 milliliters) of hot water into a tea cup. The water needs to be just short of boiling, about 165 to 180°F (75 to 80°C). Do not pour the hot water into the tea bowl with the matcha just yet. Make sure that you use filtered water or spring water. Ordinary tap water contains too many minerals which may affect the flavor of the tea. Pour half of the water into the tea bowl. Do not pour in all of the water all at once, or it will cause the tea to clump up. Whisk the tea rapidly with a chasen using circular motions. A chasen is a delicate, bamboo whisk made specifically for preparing matcha tea. Do not use a metal fork or whisk as this will affect the flavor and aroma of the tea. Keep stirring until the matcha is dissolved into a thick paste. Pour the rest of the water into the bowl and stir it. Use your chasen again and half-circular motions. Keep stirring until the matcha paste thins out. It won't be thin like Usucha, but thicker and darker. Pour the matcha into the tea cup and drink it immediately. If you wait too long, the matcha powder will settle to the bottom of the cup. Making a Matcha Latte Sift 1½ teaspoon of matcha powder into a cup or mug. Place a small strainer over a cup and measure the matcha powder into it. Gently tap the side of the strainer to shake the matcha powder into the cup. This will get rid of any clumps and give you a smoother drink in the end. Stir in 1 tablespoon of hot water into the cup. The water should be hot but not boiling, about 165 to 180°F (75 to 80°C). Briskly stir the tea using zigzag motions to make it frothy. Try to use a chasen (bamboo whisk) for this, but if you don't have one, a regular mini whisk will do. Keep whisking until all the powder is dissolved. Heat the milk and sweetener. You can do this using a milk frother on an espresso machine or in a saucepan on the stove. You can even do it in a cup in the microwave. Do not let the milk come to a boil; keep it between 165 to 180°F (75 to 80°C). Froth the milk for about 10 seconds, if desired. You can do this by using a frother on an espresso machine. If you do not own an espresso machine, pour the milk into a separate cup and use a hand frother to froth it instead. Pour the hot milk into the latte. Place a large spoon just inside the rim of the frothing cup to hold back the foam. You do not have to use all of the milk—pour in as much as you'd like. Scoop the foam on top of the cup. Reach into your frother cup and scoop out the foam with a spoon. Gently place the foam on top of the latte. If you'd like, you can add another scoop or two of foam. Spread it evenly across the top of the latte. Garnish with a sprinkle of matcha on top, if desired, and drink it immediately. If you wait too long, the matcha powder will settle to the bottom of the cup. Making an Iced Matcha Latte Sift 1½ teaspoons (2 grams) of matcha powder into a cup or mug. Place a strainer over a cup and measure out the matcha powder into it. Gently tap the side of the strainer to sift the powder into the cup. This will get rid of any lumps and give you a smoother latte. Add some sweetener, if desired. You will be adding the hot water next, so it is better to add the sweetener right now. The hot water will help dissolve it much better than cold milk will. You can use any type of sweetener you wish, such as agave nectar, honey, maple syrup, sugar, etc. Whisk in 1 tablespoon (15 milliliters) of hot water into the tea. The water must be very hot, but not quite boiling—about 165 to 180°F (75 to 80°C). After you have poured the water in, briskly whisk it using a zigzag motion. You can use a chasen (bamboo whisk) for this, or you can use a metal whisk. Keep whisking until the matcha dissolves and there are no lumps or clumps. You will end up with a thick, green paste. Whisk cold milk into the cup. You can add as much milk as you'd like, and you can use any type of milk. Many people find that almond milk complements the flavor of matcha tea exceptionally well. Keep whisking the milk until it is combined with the matcha paste. There should be no streaks or swirls; you'll get a light green beverage. Add some ice cubes, if desired. To prevent the latte from getting watered down, consider using ice cubes made from milk. You can also omit the ice if you don't like your iced lattes as cold. Garnish the latte with a sprinkle of matcha powder, and drink it immediately. If you wait too long, the matcha powder will settle to the bottom of the cup.",
  "sentences":[
    " Preparing Usucha Sift 1½ scoop of matcha powder into a small tea bowl and set it aside.",
    "Place a sifter over a small tea bowl and measure out the matcha powder into it.",
    "If you do not have a matcha scoop, measure out 1½ teaspoon (2 grams) of matcha.",
    "Gently tap the sifter to sift the tea into the bowl.",
    "This will break up any clumps and give you a smoother matcha in the end.",
    "Usucha is a thinner type of matcha tea.",
    "Pour 2 ounces (60 milliliters) of hot water into a separate tea cup.",
    "The water needs to be just below boiling, about 165 to 180°F (75 to 80°C).",
    "Do not pour the hot water into the tea bowl with the matcha yet.",
    "Slowly pour the hot water into the tea bowl.",
    "This will help prevent the matcha from clumping.",
    "The hot water will also have warmed the tea cup up for you, making it ready for the tea.",
    "At this time, you may also want to dry the tea cup with a clean towel.",
    "Whisk the tea rapidly for 10 to 15 seconds with a \"chasen\" using a zigzag motion.",
    "A chasen is a delicate, bamboo whisk made specifically for preparing matcha tea.",
    "Do not use a metal fork or whisk as this will affect the flavor and aroma of the tea.",
    "This will give you a foamy tea.",
    "For a smoother tea, use circular motions.",
    "Pour the tea back into the tea cup and drink it immediately.",
    "This tea is not brewed like regular teas, so the tea powder will eventually settle to the bottom of the cup.",
    "Preparing Koicha Sift 3 scoops of matcha powder into a small tea bowl and set it aside.",
    "Place a small strainer over a small tea bowl and measure out the matcha powder into it.",
    "If you do not have a matcha scoop, measure out 3 teaspoons (4 grams) of matcha.",
    "Gently tap the side of the strainer to sift the tea into the bowl.",
    "This will break up any clumps and give you a smoother matcha in the end.",
    "Koicha is a thicker type of matcha tea.",
    "Pour 2 ounces (60 milliliters) of hot water into a tea cup.",
    "The water needs to be just short of boiling, about 165 to 180°F (75 to 80°C).",
    "Do not pour the hot water into the tea bowl with the matcha just yet.",
    "Make sure that you use filtered water or spring water.",
    "Ordinary tap water contains too many minerals which may affect the flavor of the tea.",
    "Pour half of the water into the tea bowl.",
    "Do not pour in all of the water all at once, or it will cause the tea to clump up.",
    "Whisk the tea rapidly with a chasen using circular motions.",
    "A chasen is a delicate, bamboo whisk made specifically for preparing matcha tea.",
    "Do not use a metal fork or whisk as this will affect the flavor and aroma of the tea.",
    "Keep stirring until the matcha is dissolved into a thick paste.",
    "Pour the rest of the water into the bowl and stir it.",
    "Use your chasen again and half-circular motions.",
    "Keep stirring until the matcha paste thins out.",
    "It won't be thin like Usucha, but thicker and darker.",
    "Pour the matcha into the tea cup and drink it immediately.",
    "If you wait too long, the matcha powder will settle to the bottom of the cup.",
    "Making a Matcha Latte Sift 1½ teaspoon of matcha powder into a cup or mug.",
    "Place a small strainer over a cup and measure the matcha powder into it.",
    "Gently tap the side of the strainer to shake the matcha powder into the cup.",
    "This will get rid of any clumps and give you a smoother drink in the end.",
    "Stir in 1 tablespoon of hot water into the cup.",
    "The water should be hot but not boiling, about 165 to 180°F (75 to 80°C).",
    "Briskly stir the tea using zigzag motions to make it frothy.",
    "Try to use a chasen (bamboo whisk) for this, but if you don't have one, a regular mini whisk will do.",
    "Keep whisking until all the powder is dissolved.",
    "Heat the milk and sweetener.",
    "You can do this using a milk frother on an espresso machine or in a saucepan on the stove.",
    "You can even do it in a cup in the microwave.",
    "Do not let the milk come to a boil; keep it between 165 to 180°F (75 to 80°C).",
    "Froth the milk for about 10 seconds, if desired.",
    "You can do this by using a frother on an espresso machine.",
    "If you do not own an espresso machine, pour the milk into a separate cup and use a hand frother to froth it instead.",
    "Pour the hot milk into the latte.",
    "Place a large spoon just inside the rim of the frothing cup to hold back the foam.",
    "You do not have to use all of the milk—pour in as much as you'd like.",
    "Scoop the foam on top of the cup.",
    "Reach into your frother cup and scoop out the foam with a spoon.",
    "Gently place the foam on top of the latte.",
    "If you'd like, you can add another scoop or two of foam.",
    "Spread it evenly across the top of the latte.",
    "Garnish with a sprinkle of matcha on top, if desired, and drink it immediately.",
    "If you wait too long, the matcha powder will settle to the bottom of the cup.",
    "Making an Iced Matcha Latte Sift 1½ teaspoons (2 grams) of matcha powder into a cup or mug.",
    "Place a strainer over a cup and measure out the matcha powder into it.",
    "Gently tap the side of the strainer to sift the powder into the cup.",
    "This will get rid of any lumps and give you a smoother latte.",
    "Add some sweetener, if desired.",
    "You will be adding the hot water next, so it is better to add the sweetener right now.",
    "The hot water will help dissolve it much better than cold milk will.",
    "You can use any type of sweetener you wish, such as agave nectar, honey, maple syrup, sugar, etc.",
    "Whisk in 1 tablespoon (15 milliliters) of hot water into the tea.",
    "The water must be very hot, but not quite boiling—about 165 to 180°F (75 to 80°C).",
    "After you have poured the water in, briskly whisk it using a zigzag motion.",
    "You can use a chasen (bamboo whisk) for this, or you can use a metal whisk.",
    "Keep whisking until the matcha dissolves and there are no lumps or clumps.",
    "You will end up with a thick, green paste.",
    "Whisk cold milk into the cup.",
    "You can add as much milk as you'd like, and you can use any type of milk.",
    "Many people find that almond milk complements the flavor of matcha tea exceptionally well.",
    "Keep whisking the milk until it is combined with the matcha paste.",
    "There should be no streaks or swirls; you'll get a light green beverage.",
    "Add some ice cubes, if desired.",
    "To prevent the latte from getting watered down, consider using ice cubes made from milk.",
    "You can also omit the ice if you don't like your iced lattes as cold.",
    "Garnish the latte with a sprinkle of matcha powder, and drink it immediately.",
    "If you wait too long, the matcha powder will settle to the bottom of the cup."
  ],
  "tyn_section":[
    "Small bowl or tea bowl",
    "Small mesh sifter or strainer",
    "Bamboo matcha scoop or teaspoon",
    "Chasen (bamboo whisk)",
    "Tea cup",
    "Matcha Latte",
    "Milk frother",
    "Chasen (bamboo whisk) or mini whisk",
    "Cup or mug",
    "Spoon",
    "Iced Matcha Latte"
  ],
  "tyn_model":[
    "water",
    "milk",
    "matcha powder",
    "hot water",
    "tea cup",
    "tea",
    "whisk",
    "strainer",
    "small tea bowl",
    "tea bowl",
    "bamboo whisk",
    "sweetener",
    "sifter",
    "bowl",
    "matcha tea",
    "chasen",
    "matcha",
    "mug",
    "ice cubes",
    "tea powder",
    "small strainer",
    "milk frother",
    "saucepan",
    "microwave",
    "frother",
    "espresso machine",
    "large spoon",
    "—pour",
    "spoon",
    "agave nectar",
    "honey",
    "maple syrup",
    "sugar",
    "—about",
    "almond milk",
    "ice",
    "iced lattes"
  ],
  "simple_metrics":{
    "r":0.2727272727,
    "p":0.0810810811,
    "f1":0.125,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4545454545,
    "p":0.2702702703,
    "f1":0.3389830508
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8181818182,
    "p":0.4594594595,
    "f1":0.5884615385
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3636363636,
    "p":0.1081081081,
    "f1":0.1666666667
  }
}