{
  "title":"How to Make a Layered Pumpkin Cheesecake",
  "url":"https://www.wikihow.com/Make-a-Layered-Pumpkin-Cheesecake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Cheesecake"
  ],
  "methods":[
    {
      "name":"Making a Basic Layered Pumpkin Cheesecake",
      "steps":[
        {
          "headline":"Preheat your oven to 325°F (165°C).",
          "description":""
        },
        {
          "headline":"Combine the graham crackers, sugar, and pumpkin pie spice.",
          "description":"Fill a large mixing bowl with 1½ cups (125 grams) of crushed graham crackers. Add 2 tablespoons (29.6 ml) (30 grams) of white sugar and 2 teaspoons of pumpkin pie spice. Stir together with a rubber spatula until evenly combined. The graham crackers need to be finely crushed; they should resemble coarse sand. You can crush them using a blender or food processor."
        },
        {
          "headline":"Stir in ⅓ cup (75 grams) of melted butter.",
          "description":"If you have not yet done so, cut the butter into small cubes, then melt it in the microwave or in a little saucepan over the stove. Pour the butter into the graham cracker mixture, then stir it in with a rubber spatula."
        },
        {
          "headline":"Press the mixture across the bottom and sides of a 9-inch (22.86-centimeter) springform cake pan.",
          "description":"Set the pan aside. You will bake it when you bake the cheesecake."
        },
        {
          "headline":"Beat together the cream cheese and sugar until the mixture is light and fluffy.",
          "description":"You can do this using an electric mixer, a handheld beater, or a food processor set to medium speed for this."
        },
        {
          "headline":"Add the eggs one at a time, beating after each addition.",
          "description":"Turn the speed on your electric down to low, and beat the mixture well after each egg that you add. Keep beating until the eggs are completely mixed, and no streaks of egg yolk remain."
        },
        {
          "headline":"Gently fold in the sour cream.",
          "description":"Keep folding the sour cream until it is evenly mixed in. You don't want to see any streaks or swirls."
        },
        {
          "headline":"Mix the pumpkin, flour, and pumpkin pie spice into 1 cup (250 grams) of the batter.",
          "description":"Take out 1 cup (250 grams) of the batter, and put it into a medium-sized mixing bowl. Fold in the pumpkin purée, then add the flour and pumpkin pie spice. Set the bowl aside."
        },
        {
          "headline":"Stir the vanilla extract into the rest of the batter.",
          "description":"Note that you are only stirring the vanilla into the plain batter, and not the pumpkin batter."
        },
        {
          "headline":"Assemble your layers.",
          "description":"Spoon half of the pain/vanilla batter into your cake pan. Use the back of the spoon to spread it around. Next, spoon all of the pumpkin batter on top. To avoid messing up the bottom layer, drop little spoonfuls of the pumpkin batter on top of the plain batter, then smooth it out with the back of your spoon. Spoon the rest of the plain/vanilla batter on top."
        },
        {
          "headline":"Bake the cheesecake for 50 minutes.",
          "description":"It is ready when the center is almost set. Don't worry if it looks raw; it will set up over the next few hours."
        },
        {
          "headline":"Let the cheesecake sit in the oven for 2 hours.",
          "description":"Once the cake has finished baking, turn the oven off, and let the cheesecake sit inside for 2 hours."
        },
        {
          "headline":"Refrigerate the cheesecake for at least 4 hours before serving it.",
          "description":"To de-mold the cheesecake: run a sharp knife around the edges of the cake, between the crust and the sides of the pan. Then, slowly open the latch, and pull apart the pan. You can serve it as is, or with a dollop of whipped cream."
        }
      ]
    },
    {
      "name":"Making a Layered Pumpkin Cheesecake Pie",
      "steps":[
        {
          "headline":"Preheat your oven to 375°F (190°C) for 8 to 10 minutes.",
          "description":"If you already have a pie crust made (or bought from the store), click here to learn how to make the pumpkin-cheesecake filling."
        },
        {
          "headline":"Combine the graham crackers and sugar.",
          "description":"Pour the graham cracker crumbs into a large mixing bowl, then add the sugar. Stir the two together with a rubber spatula until the sugar and crumbs are evenly combined. Make sure that the graham crackers are finely-ground; they should resemble coarse crumbs."
        },
        {
          "headline":"Pour the melted butter, and stir well.",
          "description":"If you have not yet done so, melt the butter in the microwave or in a saucepan over the stove. Pour it into the graham cracker mixture, then stir it in with a rubber spatula."
        },
        {
          "headline":"Press the dough into the bottom of a 9-inch (22.86-centimeter) pie plate.",
          "description":"Do not grease the pie plate beforehand."
        },
        {
          "headline":"Bake the crust for 8 to 10 minutes.",
          "description":"The crust is ready when it is lightly browned. Because the crust does not contain any flour or eggs, it does not need to be baked. Baking it, however, will make your cheesecake more like a pie."
        },
        {
          "headline":"Allow the crust to cool on a wire rack before using it.",
          "description":"Do not take the crust out of the pie pan."
        },
        {
          "headline":"Preheat your oven to 325°F (165°C).",
          "description":""
        },
        {
          "headline":"Beat together the cream cheese, sugar, and vanilla extract.",
          "description":"Place the cream cheese into a large mixing bowl, then add the sugar and vanilla extract. Beat everything together until the texture is smooth. You can do this by hand or with an electric mixer."
        },
        {
          "headline":"Add the eggs one at a time, blending well after each one.",
          "description":"Keep blending until the eggs are all mixed in, and not streaks of egg yolk remain."
        },
        {
          "headline":"Spread 1 cup (250 grams) of the batter across the bottom of your crust.",
          "description":"Set the crust aside, and keep the rest of the batter in your mixing bowl."
        },
        {
          "headline":"Add the pumpkin purée and spices to the batter, and stir again until well combined.",
          "description":"Make sure that you are using 100% pure pumpkin purée and not the canned pumpkin pie type; the latter has too many added ingredients, which will affect the taste of your recipe."
        },
        {
          "headline":"Spread the pumpkin batter across the cheesecake layer.",
          "description":"To prevent disrupting the bottom layer too much, gently drop spoonfuls of the pumpkin batter into the pie crust until the cheesecake layer is no longer visible. Use the back of a spoon to smooth the top of the pie crust down."
        },
        {
          "headline":"Bake the cheesecake for 35 to 40 minutes.",
          "description":"It is ready when the center is almost set. Don't worry if the cheesecake still looks raw and gooey; it will continue to set up over the next few hours."
        },
        {
          "headline":"Let the cheesecake cool, then put it into the fridge for 3 hours.",
          "description":"Once the cheesecake is baked, turn the oven off, then leave the cheesecake in the oven for about 2 hours. Take the cheesecake out of the oven, then refrigerate it for at least 3 hours."
        },
        {
          "headline":"Serve the cheesecake.",
          "description":"It tastes great with some whipped cream. You can also garnish it further with a sprinkle of ground cinnamon or pumpkin pie spice."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making a Basic Layered Pumpkin Cheesecake Preheat your oven to 325°F (165°C).  Combine the graham crackers, sugar, and pumpkin pie spice. Fill a large mixing bowl with 1½ cups (125 grams) of crushed graham crackers. Add 2 tablespoons (29.6 ml) (30 grams) of white sugar and 2 teaspoons of pumpkin pie spice. Stir together with a rubber spatula until evenly combined. The graham crackers need to be finely crushed; they should resemble coarse sand. You can crush them using a blender or food processor. Stir in ⅓ cup (75 grams) of melted butter. If you have not yet done so, cut the butter into small cubes, then melt it in the microwave or in a little saucepan over the stove. Pour the butter into the graham cracker mixture, then stir it in with a rubber spatula. Press the mixture across the bottom and sides of a 9-inch (22.86-centimeter) springform cake pan. Set the pan aside. You will bake it when you bake the cheesecake. Beat together the cream cheese and sugar until the mixture is light and fluffy. You can do this using an electric mixer, a handheld beater, or a food processor set to medium speed for this. Add the eggs one at a time, beating after each addition. Turn the speed on your electric down to low, and beat the mixture well after each egg that you add. Keep beating until the eggs are completely mixed, and no streaks of egg yolk remain. Gently fold in the sour cream. Keep folding the sour cream until it is evenly mixed in. You don't want to see any streaks or swirls. Mix the pumpkin, flour, and pumpkin pie spice into 1 cup (250 grams) of the batter. Take out 1 cup (250 grams) of the batter, and put it into a medium-sized mixing bowl. Fold in the pumpkin purée, then add the flour and pumpkin pie spice. Set the bowl aside. Stir the vanilla extract into the rest of the batter. Note that you are only stirring the vanilla into the plain batter, and not the pumpkin batter. Assemble your layers. Spoon half of the pain/vanilla batter into your cake pan. Use the back of the spoon to spread it around. Next, spoon all of the pumpkin batter on top. To avoid messing up the bottom layer, drop little spoonfuls of the pumpkin batter on top of the plain batter, then smooth it out with the back of your spoon. Spoon the rest of the plain/vanilla batter on top. Bake the cheesecake for 50 minutes. It is ready when the center is almost set. Don't worry if it looks raw; it will set up over the next few hours. Let the cheesecake sit in the oven for 2 hours. Once the cake has finished baking, turn the oven off, and let the cheesecake sit inside for 2 hours. Refrigerate the cheesecake for at least 4 hours before serving it. To de-mold the cheesecake: run a sharp knife around the edges of the cake, between the crust and the sides of the pan. Then, slowly open the latch, and pull apart the pan. You can serve it as is, or with a dollop of whipped cream. Making a Layered Pumpkin Cheesecake Pie Preheat your oven to 375°F (190°C) for 8 to 10 minutes. If you already have a pie crust made (or bought from the store), click here to learn how to make the pumpkin-cheesecake filling. Combine the graham crackers and sugar. Pour the graham cracker crumbs into a large mixing bowl, then add the sugar. Stir the two together with a rubber spatula until the sugar and crumbs are evenly combined. Make sure that the graham crackers are finely-ground; they should resemble coarse crumbs. Pour the melted butter, and stir well. If you have not yet done so, melt the butter in the microwave or in a saucepan over the stove. Pour it into the graham cracker mixture, then stir it in with a rubber spatula. Press the dough into the bottom of a 9-inch (22.86-centimeter) pie plate. Do not grease the pie plate beforehand. Bake the crust for 8 to 10 minutes. The crust is ready when it is lightly browned. Because the crust does not contain any flour or eggs, it does not need to be baked. Baking it, however, will make your cheesecake more like a pie. Allow the crust to cool on a wire rack before using it. Do not take the crust out of the pie pan. Preheat your oven to 325°F (165°C).  Beat together the cream cheese, sugar, and vanilla extract. Place the cream cheese into a large mixing bowl, then add the sugar and vanilla extract. Beat everything together until the texture is smooth. You can do this by hand or with an electric mixer. Add the eggs one at a time, blending well after each one. Keep blending until the eggs are all mixed in, and not streaks of egg yolk remain. Spread 1 cup (250 grams) of the batter across the bottom of your crust. Set the crust aside, and keep the rest of the batter in your mixing bowl. Add the pumpkin purée and spices to the batter, and stir again until well combined. Make sure that you are using 100% pure pumpkin purée and not the canned pumpkin pie type; the latter has too many added ingredients, which will affect the taste of your recipe. Spread the pumpkin batter across the cheesecake layer. To prevent disrupting the bottom layer too much, gently drop spoonfuls of the pumpkin batter into the pie crust until the cheesecake layer is no longer visible. Use the back of a spoon to smooth the top of the pie crust down. Bake the cheesecake for 35 to 40 minutes. It is ready when the center is almost set. Don't worry if the cheesecake still looks raw and gooey; it will continue to set up over the next few hours. Let the cheesecake cool, then put it into the fridge for 3 hours. Once the cheesecake is baked, turn the oven off, then leave the cheesecake in the oven for about 2 hours. Take the cheesecake out of the oven, then refrigerate it for at least 3 hours. Serve the cheesecake. It tastes great with some whipped cream. You can also garnish it further with a sprinkle of ground cinnamon or pumpkin pie spice. Finished. ",
  "sentences":[
    " Making a Basic Layered Pumpkin Cheesecake Preheat your oven to 325°F (165°C).",
    "Combine the graham crackers, sugar, and pumpkin pie spice.",
    "Fill a large mixing bowl with 1½ cups (125 grams) of crushed graham crackers.",
    "Add 2 tablespoons (29.6 ml) (30 grams) of white sugar and 2 teaspoons of pumpkin pie spice.",
    "Stir together with a rubber spatula until evenly combined.",
    "The graham crackers need to be finely crushed; they should resemble coarse sand.",
    "You can crush them using a blender or food processor.",
    "Stir in ⅓ cup (75 grams) of melted butter.",
    "If you have not yet done so, cut the butter into small cubes, then melt it in the microwave or in a little saucepan over the stove.",
    "Pour the butter into the graham cracker mixture, then stir it in with a rubber spatula.",
    "Press the mixture across the bottom and sides of a 9-inch (22.86-centimeter) springform cake pan.",
    "Set the pan aside.",
    "You will bake it when you bake the cheesecake.",
    "Beat together the cream cheese and sugar until the mixture is light and fluffy.",
    "You can do this using an electric mixer, a handheld beater, or a food processor set to medium speed for this.",
    "Add the eggs one at a time, beating after each addition.",
    "Turn the speed on your electric down to low, and beat the mixture well after each egg that you add.",
    "Keep beating until the eggs are completely mixed, and no streaks of egg yolk remain.",
    "Gently fold in the sour cream.",
    "Keep folding the sour cream until it is evenly mixed in.",
    "You don't want to see any streaks or swirls.",
    "Mix the pumpkin, flour, and pumpkin pie spice into 1 cup (250 grams) of the batter.",
    "Take out 1 cup (250 grams) of the batter, and put it into a medium-sized mixing bowl.",
    "Fold in the pumpkin purée, then add the flour and pumpkin pie spice.",
    "Set the bowl aside.",
    "Stir the vanilla extract into the rest of the batter.",
    "Note that you are only stirring the vanilla into the plain batter, and not the pumpkin batter.",
    "Assemble your layers.",
    "Spoon half of the pain/vanilla batter into your cake pan.",
    "Use the back of the spoon to spread it around.",
    "Next, spoon all of the pumpkin batter on top.",
    "To avoid messing up the bottom layer, drop little spoonfuls of the pumpkin batter on top of the plain batter, then smooth it out with the back of your spoon.",
    "Spoon the rest of the plain/vanilla batter on top.",
    "Bake the cheesecake for 50 minutes.",
    "It is ready when the center is almost set.",
    "Don't worry if it looks raw; it will set up over the next few hours.",
    "Let the cheesecake sit in the oven for 2 hours.",
    "Once the cake has finished baking, turn the oven off, and let the cheesecake sit inside for 2 hours.",
    "Refrigerate the cheesecake for at least 4 hours before serving it.",
    "To de-mold the cheesecake: run a sharp knife around the edges of the cake, between the crust and the sides of the pan.",
    "Then, slowly open the latch, and pull apart the pan.",
    "You can serve it as is, or with a dollop of whipped cream.",
    "Making a Layered Pumpkin Cheesecake Pie Preheat your oven to 375°F (190°C) for 8 to 10 minutes.",
    "If you already have a pie crust made (or bought from the store), click here to learn how to make the pumpkin-cheesecake filling.",
    "Combine the graham crackers and sugar.",
    "Pour the graham cracker crumbs into a large mixing bowl, then add the sugar.",
    "Stir the two together with a rubber spatula until the sugar and crumbs are evenly combined.",
    "Make sure that the graham crackers are finely-ground; they should resemble coarse crumbs.",
    "Pour the melted butter, and stir well.",
    "If you have not yet done so, melt the butter in the microwave or in a saucepan over the stove.",
    "Pour it into the graham cracker mixture, then stir it in with a rubber spatula.",
    "Press the dough into the bottom of a 9-inch (22.86-centimeter) pie plate.",
    "Do not grease the pie plate beforehand.",
    "Bake the crust for 8 to 10 minutes.",
    "The crust is ready when it is lightly browned.",
    "Because the crust does not contain any flour or eggs, it does not need to be baked.",
    "Baking it, however, will make your cheesecake more like a pie.",
    "Allow the crust to cool on a wire rack before using it.",
    "Do not take the crust out of the pie pan.",
    "Preheat your oven to 325°F (165°C).",
    "Beat together the cream cheese, sugar, and vanilla extract.",
    "Place the cream cheese into a large mixing bowl, then add the sugar and vanilla extract.",
    "Beat everything together until the texture is smooth.",
    "You can do this by hand or with an electric mixer.",
    "Add the eggs one at a time, blending well after each one.",
    "Keep blending until the eggs are all mixed in, and not streaks of egg yolk remain.",
    "Spread 1 cup (250 grams) of the batter across the bottom of your crust.",
    "Set the crust aside, and keep the rest of the batter in your mixing bowl.",
    "Add the pumpkin purée and spices to the batter, and stir again until well combined.",
    "Make sure that you are using 100% pure pumpkin purée and not the canned pumpkin pie type; the latter has too many added ingredients, which will affect the taste of your recipe.",
    "Spread the pumpkin batter across the cheesecake layer.",
    "To prevent disrupting the bottom layer too much, gently drop spoonfuls of the pumpkin batter into the pie crust until the cheesecake layer is no longer visible.",
    "Use the back of a spoon to smooth the top of the pie crust down.",
    "Bake the cheesecake for 35 to 40 minutes.",
    "It is ready when the center is almost set.",
    "Don't worry if the cheesecake still looks raw and gooey; it will continue to set up over the next few hours.",
    "Let the cheesecake cool, then put it into the fridge for 3 hours.",
    "Once the cheesecake is baked, turn the oven off, then leave the cheesecake in the oven for about 2 hours.",
    "Take the cheesecake out of the oven, then refrigerate it for at least 3 hours.",
    "Serve the cheesecake.",
    "It tastes great with some whipped cream.",
    "You can also garnish it further with a sprinkle of ground cinnamon or pumpkin pie spice.",
    "Finished."
  ],
  "tyn_section":[
    "Oven",
    "Mixing bowls",
    "Rubber spatula",
    "Electric mixer",
    "9-inch (22.86-centimeter) springform cake pan",
    "Electric mixer (optional)",
    "9-inch (22.86-centimeter) pie pan"
  ],
  "tyn_model":[
    "sugar",
    "oven",
    "graham crackers",
    "pumpkin pie spice",
    "butter",
    "eggs",
    "rubber spatula",
    "mixing bowl",
    "graham cracker",
    "cream cheese",
    "vanilla extract",
    "spoon",
    "food processor",
    "microwave",
    "electric mixer",
    "sour cream",
    "flour",
    "bowl",
    "vanilla",
    "whipped cream",
    "pie crust",
    "pie plate",
    "pumpkin purée",
    "white sugar",
    "blender",
    "⅓ cup",
    "springform cake pan",
    "electric",
    "pumpkin",
    "medium-sized mixing",
    "cake pan",
    "plain/vanilla",
    "large mixing bowl",
    "saucepan",
    "pie pan",
    "spices",
    "pumpkin pie",
    "pumpkin batter",
    "fridge",
    "ground cinnamon"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.075,
    "f1":0.1276595745,
    "avg_pos":0.025
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.15,
    "f1":0.2553191489
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.225,
    "f1":0.3673469388
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.075,
    "f1":0.1325966851
  }
}