{
  "title":"How to Crochet Rainbow Dish Cloths",
  "url":"https://www.wikihow.com/Crochet-Rainbow-Dish-Cloths",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Crochet"
  ],
  "methods":[
    {
      "name":"Making a Rainbow Striped Dish Cloth",
      "steps":[
        {
          "headline":"Get a size J/6.00mm crochet hook and some medium, worsted weight cotton yarn.",
          "description":"You will need all 6 colors of the rainbow: red/pink, orange, yellow, green, blue, and purple. You will be using the first 5 for the body of the dish cloth, and purple for the edging. For a standard rainbow, use red, orange, yellow, green, blue and purple. For a brighter rainbow, use hot pink, neon orange, light yellow, spring green, bright/sky blue, and bright purple."
        },
        {
          "headline":"Start your foundation using red or hot pink yarn.",
          "description":"Make a slip knot, and slide your crochet hook through it. Make 25 chain stitches."
        },
        {
          "headline":"Finish your first row.",
          "description":"Still using your red or pink yarn, make a half double crochet into the third chain from your hook. Continue doing a half double crochet into each stitch for the rest of the row. Finish with 2 chain stitches, then turn your work."
        },
        {
          "headline":"Repeat your first row.",
          "description":"Make a half double crochet into the third chain from your hook, then more half double crochets until you reach the second to last stitch. Don't finish the last stitch, and don't turn your work. Your finished dish cloth will have 20 rows, with 2 rows for each color."
        },
        {
          "headline":"Add your next color.",
          "description":"Pull the yarn over your crochet hook, then push the hook through your last stitch, and pull up a loop with your orange yarn. Next, pull the orange yarn through all of the loops on your hook. This completes the half double crochet. Leave a 6-inch (15-centimeter) tail on your orange yarn. Cut your red/pink yarn, leaving a 6-inch (15-centimeter) tail."
        },
        {
          "headline":"Finish the second row.",
          "description":"Using your orange yarn, make 2 chain stitches, then turn your work. At this point, tie the two yarn tails together loosely. You will later untie them, and weave them into your dish cloth. Tying the tails together will simply keep your work from unraveling."
        },
        {
          "headline":"Make 17 more rows in a similar fashion.",
          "description":"Start each row with a half double crochet into the first stitch, then continue doing a half double crochet into each stitch for the rest of the row. Finish each row with 2 chain stitches before turning your work. Work 2 rows before changing to your next color. Remember, when changing your color:\nStop at the second to last stitch. Do a yarn over, then push the hook through the last stitch. Loop your new color onto your hook, then pull your new color through all of the loops on your hook. Make 2 chain stitches, then turn your work. Make sure that your old color and new color have 6-inch (15-centimeter) tails, then tie them loosely together."
        },
        {
          "headline":"Do your final row.",
          "description":"Working with your blue yarn, make a half double crochet into the top of each stitch from the previous row. Stop just before your last stitch."
        },
        {
          "headline":"Change to your edging color, but only use 1 chain stitch at the end.",
          "description":"Using the same method as before, make a yarn over, then push the hook through your last stitch. Cut your old color down to 6 inches (15 centimeters), and loop your new color (purple, black, or white) over your hook. Pull your new color back through all of the loops on your hook. Make 1 chain stitch, then turn your work. Remember to loosely tie both ends of the yarn together. Note that you are only making 1 chain stitch, not the usual 2."
        },
        {
          "headline":"Make a single crochet around the edges of your dish cloth.",
          "description":"To get nice, rounded corners, put 3 single crochets into the corners. Do a slip stitch, then tie off your work. If you are having trouble, try this: put 2 single crochets into your double chains."
        },
        {
          "headline":"Finish your work.",
          "description":"Cut the yarn down to 6 inches (15 centimeters), then use a yarn needle to work it back into your work. Next, go back to your rows, and undo each of the knots you tied earlier. Use your yarn needle to weave the 6-inch (15-centimeter) tails back into the rows."
        }
      ]
    },
    {
      "name":"Making a Rainbow-Shaped Dish Cloth",
      "steps":[
        {
          "headline":"Get out a size H/5.00mm crochet hook and choose your yarn.",
          "description":"The ideal yarn for this project is medium, worsted weight, cotton yarn. Do not use wool or acrylic yarn. You will need the 6 colors of the rainbow as well as a neutral color for under the rainbow, such as black or white. For a traditional rainbow, consider: red, orange, yellow, green, blue, and purple. For a brighter rainbow, consider: hot pink, neon orange, light yellow, spring green, bright/sky blue, and bright purple."
        },
        {
          "headline":"Start your first row using your neutral color.",
          "description":"Make 3 chain stitches. Next, skip the first chain stitch, and make 6 half double crochets in the second chain stitch. Fasten the yarn off and do not turn your work. Do not turn your work for the following rows. Fasten the yarn off at the end of each row, and leave a small tail so that you can weave it in."
        },
        {
          "headline":"Switch to your purple yarn, and start on the second row.",
          "description":"Start with 2 chain stitches. Make 2 half double crochets in each of the 6 stitches. You will have a total of 12 stitches."
        },
        {
          "headline":"Switch to your blue yarn, and start on the third row.",
          "description":"Begin with 2 chain stitches. Next, make 2 half double crochets in the same stitch followed by 1 half double crochet in the next stitch. Repeat the previous 3 stitches (2 hdc in the same stitch, 1 hdc) 6 times for a total of 18 stitches."
        },
        {
          "headline":"Switch to your green yarn, and start on the fourth row.",
          "description":"Start with 2 chain stitches. Make 2 half double crochets in the same stitch, then 2 half double crochets. Repeat the last 4 stitches (2 hdc in the same stitch, 2 hdc) 6 times for a total of 24 stitches."
        },
        {
          "headline":"Switch to your yellow yarn, and start on the fifth row.",
          "description":"Begin with 2 chain stitches. Next, do 2 half double crochets in the same stitch, followed by 3 half double crochets. Repeat the last 5 stitches (2 hdc in the same stitch, 3 hdc) 6 times for a total of 30 stitches."
        },
        {
          "headline":"Switch to your orange yarn, and start on the sixth row.",
          "description":"Start with 2 chain stitches. Make 2 half double crochets followed by 2 half double crochets in the same stitch. Follow up with 4 half double crochets. Repeat the last 6 stitches (2 hdc in the same stitch, 4 hdc) 6 times for a total of 36 stitches."
        },
        {
          "headline":"Switch to your red or pink yarn, and start on the final row.",
          "description":"Begin with 2 chain stitches. Next, do 2 half double crochets in the same stitch. Follow up with 5 half double crochets. Repeat the last 7 stitches (2 hdc in the same stitch, 5 hdc) 6 times for a total of 42 stitches."
        },
        {
          "headline":"Use a yarn needle to weave in the ends.",
          "description":"After you have finished each row, you fastened the yarn off, and cut it, leaving a short tail. Thread the first tail through your needle, and weave it back into the rainbow. Pull the needle out, and repeat with the remaining tails."
        }
      ]
    }
  ],
  "text":" Making a Rainbow Striped Dish Cloth Get a size J/6.00mm crochet hook and some medium, worsted weight cotton yarn. You will need all 6 colors of the rainbow: red/pink, orange, yellow, green, blue, and purple. You will be using the first 5 for the body of the dish cloth, and purple for the edging. For a standard rainbow, use red, orange, yellow, green, blue and purple. For a brighter rainbow, use hot pink, neon orange, light yellow, spring green, bright/sky blue, and bright purple. Start your foundation using red or hot pink yarn. Make a slip knot, and slide your crochet hook through it. Make 25 chain stitches. Finish your first row. Still using your red or pink yarn, make a half double crochet into the third chain from your hook. Continue doing a half double crochet into each stitch for the rest of the row. Finish with 2 chain stitches, then turn your work. Repeat your first row. Make a half double crochet into the third chain from your hook, then more half double crochets until you reach the second to last stitch. Don't finish the last stitch, and don't turn your work. Your finished dish cloth will have 20 rows, with 2 rows for each color. Add your next color. Pull the yarn over your crochet hook, then push the hook through your last stitch, and pull up a loop with your orange yarn. Next, pull the orange yarn through all of the loops on your hook. This completes the half double crochet. Leave a 6-inch (15-centimeter) tail on your orange yarn. Cut your red/pink yarn, leaving a 6-inch (15-centimeter) tail. Finish the second row. Using your orange yarn, make 2 chain stitches, then turn your work. At this point, tie the two yarn tails together loosely. You will later untie them, and weave them into your dish cloth. Tying the tails together will simply keep your work from unraveling. Make 17 more rows in a similar fashion. Start each row with a half double crochet into the first stitch, then continue doing a half double crochet into each stitch for the rest of the row. Finish each row with 2 chain stitches before turning your work. Work 2 rows before changing to your next color. Remember, when changing your color:\nStop at the second to last stitch. Do a yarn over, then push the hook through the last stitch. Loop your new color onto your hook, then pull your new color through all of the loops on your hook. Make 2 chain stitches, then turn your work. Make sure that your old color and new color have 6-inch (15-centimeter) tails, then tie them loosely together. Do your final row. Working with your blue yarn, make a half double crochet into the top of each stitch from the previous row. Stop just before your last stitch. Change to your edging color, but only use 1 chain stitch at the end. Using the same method as before, make a yarn over, then push the hook through your last stitch. Cut your old color down to 6 inches (15 centimeters), and loop your new color (purple, black, or white) over your hook. Pull your new color back through all of the loops on your hook. Make 1 chain stitch, then turn your work. Remember to loosely tie both ends of the yarn together. Note that you are only making 1 chain stitch, not the usual 2. Make a single crochet around the edges of your dish cloth. To get nice, rounded corners, put 3 single crochets into the corners. Do a slip stitch, then tie off your work. If you are having trouble, try this: put 2 single crochets into your double chains. Finish your work. Cut the yarn down to 6 inches (15 centimeters), then use a yarn needle to work it back into your work. Next, go back to your rows, and undo each of the knots you tied earlier. Use your yarn needle to weave the 6-inch (15-centimeter) tails back into the rows. Making a Rainbow-Shaped Dish Cloth Get out a size H/5.00mm crochet hook and choose your yarn. The ideal yarn for this project is medium, worsted weight, cotton yarn. Do not use wool or acrylic yarn. You will need the 6 colors of the rainbow as well as a neutral color for under the rainbow, such as black or white. For a traditional rainbow, consider: red, orange, yellow, green, blue, and purple. For a brighter rainbow, consider: hot pink, neon orange, light yellow, spring green, bright/sky blue, and bright purple. Start your first row using your neutral color. Make 3 chain stitches. Next, skip the first chain stitch, and make 6 half double crochets in the second chain stitch. Fasten the yarn off and do not turn your work. Do not turn your work for the following rows. Fasten the yarn off at the end of each row, and leave a small tail so that you can weave it in. Switch to your purple yarn, and start on the second row. Start with 2 chain stitches. Make 2 half double crochets in each of the 6 stitches. You will have a total of 12 stitches. Switch to your blue yarn, and start on the third row. Begin with 2 chain stitches. Next, make 2 half double crochets in the same stitch followed by 1 half double crochet in the next stitch. Repeat the previous 3 stitches (2 hdc in the same stitch, 1 hdc) 6 times for a total of 18 stitches. Switch to your green yarn, and start on the fourth row. Start with 2 chain stitches. Make 2 half double crochets in the same stitch, then 2 half double crochets. Repeat the last 4 stitches (2 hdc in the same stitch, 2 hdc) 6 times for a total of 24 stitches. Switch to your yellow yarn, and start on the fifth row. Begin with 2 chain stitches. Next, do 2 half double crochets in the same stitch, followed by 3 half double crochets. Repeat the last 5 stitches (2 hdc in the same stitch, 3 hdc) 6 times for a total of 30 stitches. Switch to your orange yarn, and start on the sixth row. Start with 2 chain stitches. Make 2 half double crochets followed by 2 half double crochets in the same stitch. Follow up with 4 half double crochets. Repeat the last 6 stitches (2 hdc in the same stitch, 4 hdc) 6 times for a total of 36 stitches. Switch to your red or pink yarn, and start on the final row. Begin with 2 chain stitches. Next, do 2 half double crochets in the same stitch. Follow up with 5 half double crochets. Repeat the last 7 stitches (2 hdc in the same stitch, 5 hdc) 6 times for a total of 42 stitches. Use a yarn needle to weave in the ends. After you have finished each row, you fastened the yarn off, and cut it, leaving a short tail. Thread the first tail through your needle, and weave it back into the rainbow. Pull the needle out, and repeat with the remaining tails.",
  "sentences":[
    " Making a Rainbow Striped Dish Cloth Get a size J/6.00mm crochet hook and some medium, worsted weight cotton yarn.",
    "You will need all 6 colors of the rainbow: red/pink, orange, yellow, green, blue, and purple.",
    "You will be using the first 5 for the body of the dish cloth, and purple for the edging.",
    "For a standard rainbow, use red, orange, yellow, green, blue and purple.",
    "For a brighter rainbow, use hot pink, neon orange, light yellow, spring green, bright/sky blue, and bright purple.",
    "Start your foundation using red or hot pink yarn.",
    "Make a slip knot, and slide your crochet hook through it.",
    "Make 25 chain stitches.",
    "Finish your first row.",
    "Still using your red or pink yarn, make a half double crochet into the third chain from your hook.",
    "Continue doing a half double crochet into each stitch for the rest of the row.",
    "Finish with 2 chain stitches, then turn your work.",
    "Repeat your first row.",
    "Make a half double crochet into the third chain from your hook, then more half double crochets until you reach the second to last stitch.",
    "Don't finish the last stitch, and don't turn your work.",
    "Your finished dish cloth will have 20 rows, with 2 rows for each color.",
    "Add your next color.",
    "Pull the yarn over your crochet hook, then push the hook through your last stitch, and pull up a loop with your orange yarn.",
    "Next, pull the orange yarn through all of the loops on your hook.",
    "This completes the half double crochet.",
    "Leave a 6-inch (15-centimeter) tail on your orange yarn.",
    "Cut your red/pink yarn, leaving a 6-inch (15-centimeter) tail.",
    "Finish the second row.",
    "Using your orange yarn, make 2 chain stitches, then turn your work.",
    "At this point, tie the two yarn tails together loosely.",
    "You will later untie them, and weave them into your dish cloth.",
    "Tying the tails together will simply keep your work from unraveling.",
    "Make 17 more rows in a similar fashion.",
    "Start each row with a half double crochet into the first stitch, then continue doing a half double crochet into each stitch for the rest of the row.",
    "Finish each row with 2 chain stitches before turning your work.",
    "Work 2 rows before changing to your next color.",
    "Remember, when changing your color:\nStop at the second to last stitch.",
    "Do a yarn over, then push the hook through the last stitch.",
    "Loop your new color onto your hook, then pull your new color through all of the loops on your hook.",
    "Make 2 chain stitches, then turn your work.",
    "Make sure that your old color and new color have 6-inch (15-centimeter) tails, then tie them loosely together.",
    "Do your final row.",
    "Working with your blue yarn, make a half double crochet into the top of each stitch from the previous row.",
    "Stop just before your last stitch.",
    "Change to your edging color, but only use 1 chain stitch at the end.",
    "Using the same method as before, make a yarn over, then push the hook through your last stitch.",
    "Cut your old color down to 6 inches (15 centimeters), and loop your new color (purple, black, or white) over your hook.",
    "Pull your new color back through all of the loops on your hook.",
    "Make 1 chain stitch, then turn your work.",
    "Remember to loosely tie both ends of the yarn together.",
    "Note that you are only making 1 chain stitch, not the usual 2.",
    "Make a single crochet around the edges of your dish cloth.",
    "To get nice, rounded corners, put 3 single crochets into the corners.",
    "Do a slip stitch, then tie off your work.",
    "If you are having trouble, try this: put 2 single crochets into your double chains.",
    "Finish your work.",
    "Cut the yarn down to 6 inches (15 centimeters), then use a yarn needle to work it back into your work.",
    "Next, go back to your rows, and undo each of the knots you tied earlier.",
    "Use your yarn needle to weave the 6-inch (15-centimeter) tails back into the rows.",
    "Making a Rainbow-Shaped Dish Cloth Get out a size H/5.00mm crochet hook and choose your yarn.",
    "The ideal yarn for this project is medium, worsted weight, cotton yarn.",
    "Do not use wool or acrylic yarn.",
    "You will need the 6 colors of the rainbow as well as a neutral color for under the rainbow, such as black or white.",
    "For a traditional rainbow, consider: red, orange, yellow, green, blue, and purple.",
    "For a brighter rainbow, consider: hot pink, neon orange, light yellow, spring green, bright/sky blue, and bright purple.",
    "Start your first row using your neutral color.",
    "Make 3 chain stitches.",
    "Next, skip the first chain stitch, and make 6 half double crochets in the second chain stitch.",
    "Fasten the yarn off and do not turn your work.",
    "Do not turn your work for the following rows.",
    "Fasten the yarn off at the end of each row, and leave a small tail so that you can weave it in.",
    "Switch to your purple yarn, and start on the second row.",
    "Start with 2 chain stitches.",
    "Make 2 half double crochets in each of the 6 stitches.",
    "You will have a total of 12 stitches.",
    "Switch to your blue yarn, and start on the third row.",
    "Begin with 2 chain stitches.",
    "Next, make 2 half double crochets in the same stitch followed by 1 half double crochet in the next stitch.",
    "Repeat the previous 3 stitches (2 hdc in the same stitch, 1 hdc) 6 times for a total of 18 stitches.",
    "Switch to your green yarn, and start on the fourth row.",
    "Start with 2 chain stitches.",
    "Make 2 half double crochets in the same stitch, then 2 half double crochets.",
    "Repeat the last 4 stitches (2 hdc in the same stitch, 2 hdc) 6 times for a total of 24 stitches.",
    "Switch to your yellow yarn, and start on the fifth row.",
    "Begin with 2 chain stitches.",
    "Next, do 2 half double crochets in the same stitch, followed by 3 half double crochets.",
    "Repeat the last 5 stitches (2 hdc in the same stitch, 3 hdc) 6 times for a total of 30 stitches.",
    "Switch to your orange yarn, and start on the sixth row.",
    "Start with 2 chain stitches.",
    "Make 2 half double crochets followed by 2 half double crochets in the same stitch.",
    "Follow up with 4 half double crochets.",
    "Repeat the last 6 stitches (2 hdc in the same stitch, 4 hdc) 6 times for a total of 36 stitches.",
    "Switch to your red or pink yarn, and start on the final row.",
    "Begin with 2 chain stitches.",
    "Next, do 2 half double crochets in the same stitch.",
    "Follow up with 5 half double crochets.",
    "Repeat the last 7 stitches (2 hdc in the same stitch, 5 hdc) 6 times for a total of 42 stitches.",
    "Use a yarn needle to weave in the ends.",
    "After you have finished each row, you fastened the yarn off, and cut it, leaving a short tail.",
    "Thread the first tail through your needle, and weave it back into the rainbow.",
    "Pull the needle out, and repeat with the remaining tails."
  ],
  "tyn_section":[
    "Size J/6.00mm crochet hook",
    "White or black",
    "Purple",
    "Bright blue",
    "Bright green",
    "Yellow",
    "Hot orange",
    "Hot pink",
    "Scissors",
    "Yarn needle",
    "H/5.00mm hook"
  ],
  "tyn_model":[
    "yarn",
    "crochet hook",
    "dish cloth",
    "orange yarn",
    "yarn needle",
    "worsted weight cotton yarn",
    "red or pink yarn",
    "blue yarn",
    "purple yarn",
    "needle"
  ],
  "simple_metrics":{
    "r":0.0909090909,
    "p":0.1,
    "f1":0.0952380952,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2727272727,
    "p":0.5,
    "f1":0.3529411765
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5454545455,
    "p":0.7,
    "f1":0.6131386861
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0909090909,
    "p":0.1,
    "f1":0.0952380952
  }
}