{
  "title":"How to Make Ink Stamped Coasters",
  "url":"https://www.wikihow.com/Make-Ink-Stamped-Coasters",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Printing Crafts",
    "Stamping"
  ],
  "methods":[
    {
      "name":"Making Simple Ink Stamped Coasters",
      "steps":[
        {
          "headline":"Get some 4-inch (10.16-centimeter), unglazed, stone tiles.",
          "description":"The best material to work with is terracotta or travertine. Avoid glazed tiles, as they are difficult to work with. Most importantly, if they aren't sealed properly, the ink will rub right off."
        },
        {
          "headline":"Wipe down your tiles with a damp cloth, and let them dry.",
          "description":"You can also wipe the tiles down with rubbing alcohol instead; it does the same job and dries a lot faster. Cleaning the tiles is very important, as they tend to come very dusty. Cleaning your tiles ensures that your design comes out neat and clean. Don't forget to wipe the back of the tiles down as well."
        },
        {
          "headline":"Coat your stamp with ink.",
          "description":"For best results, choose a permanent, self-setting ink. It will ensure that your work lasts longer. If you choose to use a hybrid, heat-setting ink, you will need to bake your tiles in the oven. Choose a dark or bright color that stands out against your tile."
        },
        {
          "headline":"Press the stamp against your tile, hold it for a few seconds, then pull it away.",
          "description":"Do not rock the stamp back and forth. Instead, press it straight down onto the tile, hold it for about 5 seconds, then lift it straight back up. If you rock your stamp, you may end up smudging your design."
        },
        {
          "headline":"Let the ink dry.",
          "description":"If you used hybrid or some other heat-setting ink, you will need to heat-set them using a heat gun or an oven. Each brand may be a little different, so read the instructions on your ink. In most cases, you should be able to pop your tiles into the oven, and bake them at 250°F (122°C) for 30 minutes. If you plan on baking your tiles, place them onto a foil lined baking sheet. Allow them to cool completely after baking before moving on. If you used a permanent, self-setting ink, then you do not need to bake your tiles."
        },
        {
          "headline":"Seal your work, then allow the tiles to dry once again.",
          "description":"Give your tiles a light coat of acrylic sealer. Alternatively, you can also use a sealer designed for natural tiles. Let the sealer dry before applying a second coat. The sealer will make the tile less-porous. If you have a simple image, consider coating just the image with a squeeze-on or brush-on sealing glaze."
        },
        {
          "headline":"Add a small or medium-sized felt pad to the back of each tile.",
          "description":"You will need four felt pads, one for each corner. You can also use rubber or cork pads. Alternatively, you can also hot glue a 4-inch (10.16-centimeter) square cut out of a thin sheet of cork to the back of your tile. These will prevent the tiles from scratching up your table or counter."
        }
      ]
    },
    {
      "name":"Making Ornate Ink Stamped Coasters",
      "steps":[
        {
          "headline":"Get some 4-inch (10.16-centimeter), unglazed, stone tiles.",
          "description":"Ideal materials to work with include terracotta and travertine. Avoid working with glazed ones, as they are difficult to seal; if they aren't sealed properly, the ink will come off."
        },
        {
          "headline":"Wipe down your tiles with a damp cloth, and let them dry.",
          "description":"You should do this even if the tiles look clean. They are often coated with a thin film of dust, which can prevent the ink from adhering properly. You can also wipe the tiles down with rubbing alcohol instead; it dries a lot faster. Be sure to wipe the back of the tiles as well."
        },
        {
          "headline":"Ink a large, patterned stamp for the background.",
          "description":"Choose a large stamp with subtle, non-distracting pattern, such as wood grain, cheesecloth, or romantic text. It should be the same size, or larger, as your tile. Next, coat the stamp evenly with ink. Consider a color that is similar to the tile, but a shade darker. For example, you could use dark grey for a light grey tile, and dark brown for a terracotta tile. This will keep the background from competing against the main image. For best results, use a permanent, self-setting ink. If you choose to use a hybrid or heat-set ink, you will need to bake your tiles in the oven. If the stamp is too big for the pad, flip the stamp over, then rub the pad against it."
        },
        {
          "headline":"Press the background stamp against your tile, lift it away, then let the ink dry.",
          "description":"Press the stamp straight down onto the tile using a lot of pressure. Do not rock the stamp, as this may smudge your design. Wait a few seconds, then carefully lift it away. Let the ink dry completely before moving on. If your background stamp was smaller than your tile, move it down to the next section of tile,  and stamp another row. Don't worry if your design did not come out perfectly sharp and clear. This rustic look is part of the overall design."
        },
        {
          "headline":"Ink a smaller stamp for your main image.",
          "description":"Choose a stamp with a pretty image or design that you like, such as a flower, bird, or butterfly. Ink the stamp with a darker color, such as black. Make sure that you are using the same type of ink as before. Do not mix hybrid and permanent inks. If you plan on filling your image in, choose an outline image rather than a solid one."
        },
        {
          "headline":"Press the smaller stamp against your tile.",
          "description":"Make sure that the background image is completely dry. Carefully position your stamp, then press it straight down against the tile. Hold it for about 5 seconds, then carefully pull it away. It is very important that you don't rock the stamp at this point. If you do, you may end up smudging the background off."
        },
        {
          "headline":"Allow the ink to dry once more before coloring in your main image, if desired.",
          "description":"If you used a translucent image, you might want to color it in. If you used a solid image, you can skip this step and move on. Dip a sponge dauber or pouncer into translucent ink, then pat it against your main image. Be careful not to rub the stamped image. Add more colors to create depth and layers. Allow each layer to dry before adding a second one."
        },
        {
          "headline":"Let the ink dry.",
          "description":"If you used hybrid or a heat-setting ink, you will need to heat-set it using a heat gun or oven. Each brand is different, so check the instructions on your ink container. Typically, you should be able to pop your tiles into the oven, and bake them at 250°F (122°C) for 30 minutes. If you are going to bake your tiles, put them onto a foil lined baking sheet. Let them cool completely before moving on. If you used a permanent, self-setting ink, then you do not need to bake the tiles."
        },
        {
          "headline":"Seal your work, then allow the tiles to dry once again.",
          "description":"You can seal your work using a clear, acrylic spray or a special sealer designed for natural tiles. Allow the sealer to dry before applying a second coat. While you can seal just the design on simpler tiles, you won't be able to do it here; you will have to seal the entire tile in order to protect the background image."
        },
        {
          "headline":"Add a small or medium-sized felt pad to the back of each tile.",
          "description":"You will need 4 felt pads, 1 for each corner. You can also use rubber or cork pads. Alternatively, you can use a 4-inch (10.16-centimeter) square out of a thin sheet of cork, then hot glue it to the back of your tile. The felt/rubber/cork backing will help protect your table or counter against scratches from the tiles."
        }
      ]
    }
  ],
  "text":" Making Simple Ink Stamped Coasters Get some 4-inch (10.16-centimeter), unglazed, stone tiles. The best material to work with is terracotta or travertine. Avoid glazed tiles, as they are difficult to work with. Most importantly, if they aren't sealed properly, the ink will rub right off. Wipe down your tiles with a damp cloth, and let them dry. You can also wipe the tiles down with rubbing alcohol instead; it does the same job and dries a lot faster. Cleaning the tiles is very important, as they tend to come very dusty. Cleaning your tiles ensures that your design comes out neat and clean. Don't forget to wipe the back of the tiles down as well. Coat your stamp with ink. For best results, choose a permanent, self-setting ink. It will ensure that your work lasts longer. If you choose to use a hybrid, heat-setting ink, you will need to bake your tiles in the oven. Choose a dark or bright color that stands out against your tile. Press the stamp against your tile, hold it for a few seconds, then pull it away. Do not rock the stamp back and forth. Instead, press it straight down onto the tile, hold it for about 5 seconds, then lift it straight back up. If you rock your stamp, you may end up smudging your design. Let the ink dry. If you used hybrid or some other heat-setting ink, you will need to heat-set them using a heat gun or an oven. Each brand may be a little different, so read the instructions on your ink. In most cases, you should be able to pop your tiles into the oven, and bake them at 250°F (122°C) for 30 minutes. If you plan on baking your tiles, place them onto a foil lined baking sheet. Allow them to cool completely after baking before moving on. If you used a permanent, self-setting ink, then you do not need to bake your tiles. Seal your work, then allow the tiles to dry once again. Give your tiles a light coat of acrylic sealer. Alternatively, you can also use a sealer designed for natural tiles. Let the sealer dry before applying a second coat. The sealer will make the tile less-porous. If you have a simple image, consider coating just the image with a squeeze-on or brush-on sealing glaze. Add a small or medium-sized felt pad to the back of each tile. You will need four felt pads, one for each corner. You can also use rubber or cork pads. Alternatively, you can also hot glue a 4-inch (10.16-centimeter) square cut out of a thin sheet of cork to the back of your tile. These will prevent the tiles from scratching up your table or counter. Making Ornate Ink Stamped Coasters Get some 4-inch (10.16-centimeter), unglazed, stone tiles. Ideal materials to work with include terracotta and travertine. Avoid working with glazed ones, as they are difficult to seal; if they aren't sealed properly, the ink will come off. Wipe down your tiles with a damp cloth, and let them dry. You should do this even if the tiles look clean. They are often coated with a thin film of dust, which can prevent the ink from adhering properly. You can also wipe the tiles down with rubbing alcohol instead; it dries a lot faster. Be sure to wipe the back of the tiles as well. Ink a large, patterned stamp for the background. Choose a large stamp with subtle, non-distracting pattern, such as wood grain, cheesecloth, or romantic text. It should be the same size, or larger, as your tile. Next, coat the stamp evenly with ink. Consider a color that is similar to the tile, but a shade darker. For example, you could use dark grey for a light grey tile, and dark brown for a terracotta tile. This will keep the background from competing against the main image. For best results, use a permanent, self-setting ink. If you choose to use a hybrid or heat-set ink, you will need to bake your tiles in the oven. If the stamp is too big for the pad, flip the stamp over, then rub the pad against it. Press the background stamp against your tile, lift it away, then let the ink dry. Press the stamp straight down onto the tile using a lot of pressure. Do not rock the stamp, as this may smudge your design. Wait a few seconds, then carefully lift it away. Let the ink dry completely before moving on. If your background stamp was smaller than your tile, move it down to the next section of tile,  and stamp another row. Don't worry if your design did not come out perfectly sharp and clear. This rustic look is part of the overall design. Ink a smaller stamp for your main image. Choose a stamp with a pretty image or design that you like, such as a flower, bird, or butterfly. Ink the stamp with a darker color, such as black. Make sure that you are using the same type of ink as before. Do not mix hybrid and permanent inks. If you plan on filling your image in, choose an outline image rather than a solid one. Press the smaller stamp against your tile. Make sure that the background image is completely dry. Carefully position your stamp, then press it straight down against the tile. Hold it for about 5 seconds, then carefully pull it away. It is very important that you don't rock the stamp at this point. If you do, you may end up smudging the background off. Allow the ink to dry once more before coloring in your main image, if desired. If you used a translucent image, you might want to color it in. If you used a solid image, you can skip this step and move on. Dip a sponge dauber or pouncer into translucent ink, then pat it against your main image. Be careful not to rub the stamped image. Add more colors to create depth and layers. Allow each layer to dry before adding a second one. Let the ink dry. If you used hybrid or a heat-setting ink, you will need to heat-set it using a heat gun or oven. Each brand is different, so check the instructions on your ink container. Typically, you should be able to pop your tiles into the oven, and bake them at 250°F (122°C) for 30 minutes. If you are going to bake your tiles, put them onto a foil lined baking sheet. Let them cool completely before moving on. If you used a permanent, self-setting ink, then you do not need to bake the tiles. Seal your work, then allow the tiles to dry once again. You can seal your work using a clear, acrylic spray or a special sealer designed for natural tiles. Allow the sealer to dry before applying a second coat. While you can seal just the design on simpler tiles, you won't be able to do it here; you will have to seal the entire tile in order to protect the background image. Add a small or medium-sized felt pad to the back of each tile. You will need 4 felt pads, 1 for each corner. You can also use rubber or cork pads. Alternatively, you can use a 4-inch (10.16-centimeter) square out of a thin sheet of cork, then hot glue it to the back of your tile. The felt/rubber/cork backing will help protect your table or counter against scratches from the tiles.",
  "sentences":[
    " Making Simple Ink Stamped Coasters Get some 4-inch (10.16-centimeter), unglazed, stone tiles.",
    "The best material to work with is terracotta or travertine.",
    "Avoid glazed tiles, as they are difficult to work with.",
    "Most importantly, if they aren't sealed properly, the ink will rub right off.",
    "Wipe down your tiles with a damp cloth, and let them dry.",
    "You can also wipe the tiles down with rubbing alcohol instead; it does the same job and dries a lot faster.",
    "Cleaning the tiles is very important, as they tend to come very dusty.",
    "Cleaning your tiles ensures that your design comes out neat and clean.",
    "Don't forget to wipe the back of the tiles down as well.",
    "Coat your stamp with ink.",
    "For best results, choose a permanent, self-setting ink.",
    "It will ensure that your work lasts longer.",
    "If you choose to use a hybrid, heat-setting ink, you will need to bake your tiles in the oven.",
    "Choose a dark or bright color that stands out against your tile.",
    "Press the stamp against your tile, hold it for a few seconds, then pull it away.",
    "Do not rock the stamp back and forth.",
    "Instead, press it straight down onto the tile, hold it for about 5 seconds, then lift it straight back up.",
    "If you rock your stamp, you may end up smudging your design.",
    "Let the ink dry.",
    "If you used hybrid or some other heat-setting ink, you will need to heat-set them using a heat gun or an oven.",
    "Each brand may be a little different, so read the instructions on your ink.",
    "In most cases, you should be able to pop your tiles into the oven, and bake them at 250°F (122°C) for 30 minutes.",
    "If you plan on baking your tiles, place them onto a foil lined baking sheet.",
    "Allow them to cool completely after baking before moving on.",
    "If you used a permanent, self-setting ink, then you do not need to bake your tiles.",
    "Seal your work, then allow the tiles to dry once again.",
    "Give your tiles a light coat of acrylic sealer.",
    "Alternatively, you can also use a sealer designed for natural tiles.",
    "Let the sealer dry before applying a second coat.",
    "The sealer will make the tile less-porous.",
    "If you have a simple image, consider coating just the image with a squeeze-on or brush-on sealing glaze.",
    "Add a small or medium-sized felt pad to the back of each tile.",
    "You will need four felt pads, one for each corner.",
    "You can also use rubber or cork pads.",
    "Alternatively, you can also hot glue a 4-inch (10.16-centimeter) square cut out of a thin sheet of cork to the back of your tile.",
    "These will prevent the tiles from scratching up your table or counter.",
    "Making Ornate Ink Stamped Coasters Get some 4-inch (10.16-centimeter), unglazed, stone tiles.",
    "Ideal materials to work with include terracotta and travertine.",
    "Avoid working with glazed ones, as they are difficult to seal; if they aren't sealed properly, the ink will come off.",
    "Wipe down your tiles with a damp cloth, and let them dry.",
    "You should do this even if the tiles look clean.",
    "They are often coated with a thin film of dust, which can prevent the ink from adhering properly.",
    "You can also wipe the tiles down with rubbing alcohol instead; it dries a lot faster.",
    "Be sure to wipe the back of the tiles as well.",
    "Ink a large, patterned stamp for the background.",
    "Choose a large stamp with subtle, non-distracting pattern, such as wood grain, cheesecloth, or romantic text.",
    "It should be the same size, or larger, as your tile.",
    "Next, coat the stamp evenly with ink.",
    "Consider a color that is similar to the tile, but a shade darker.",
    "For example, you could use dark grey for a light grey tile, and dark brown for a terracotta tile.",
    "This will keep the background from competing against the main image.",
    "For best results, use a permanent, self-setting ink.",
    "If you choose to use a hybrid or heat-set ink, you will need to bake your tiles in the oven.",
    "If the stamp is too big for the pad, flip the stamp over, then rub the pad against it.",
    "Press the background stamp against your tile, lift it away, then let the ink dry.",
    "Press the stamp straight down onto the tile using a lot of pressure.",
    "Do not rock the stamp, as this may smudge your design.",
    "Wait a few seconds, then carefully lift it away.",
    "Let the ink dry completely before moving on.",
    "If your background stamp was smaller than your tile, move it down to the next section of tile,  and stamp another row.",
    "Don't worry if your design did not come out perfectly sharp and clear.",
    "This rustic look is part of the overall design.",
    "Ink a smaller stamp for your main image.",
    "Choose a stamp with a pretty image or design that you like, such as a flower, bird, or butterfly.",
    "Ink the stamp with a darker color, such as black.",
    "Make sure that you are using the same type of ink as before.",
    "Do not mix hybrid and permanent inks.",
    "If you plan on filling your image in, choose an outline image rather than a solid one.",
    "Press the smaller stamp against your tile.",
    "Make sure that the background image is completely dry.",
    "Carefully position your stamp, then press it straight down against the tile.",
    "Hold it for about 5 seconds, then carefully pull it away.",
    "It is very important that you don't rock the stamp at this point.",
    "If you do, you may end up smudging the background off.",
    "Allow the ink to dry once more before coloring in your main image, if desired.",
    "If you used a translucent image, you might want to color it in.",
    "If you used a solid image, you can skip this step and move on.",
    "Dip a sponge dauber or pouncer into translucent ink, then pat it against your main image.",
    "Be careful not to rub the stamped image.",
    "Add more colors to create depth and layers.",
    "Allow each layer to dry before adding a second one.",
    "Let the ink dry.",
    "If you used hybrid or a heat-setting ink, you will need to heat-set it using a heat gun or oven.",
    "Each brand is different, so check the instructions on your ink container.",
    "Typically, you should be able to pop your tiles into the oven, and bake them at 250°F (122°C) for 30 minutes.",
    "If you are going to bake your tiles, put them onto a foil lined baking sheet.",
    "Let them cool completely before moving on.",
    "If you used a permanent, self-setting ink, then you do not need to bake the tiles.",
    "Seal your work, then allow the tiles to dry once again.",
    "You can seal your work using a clear, acrylic spray or a special sealer designed for natural tiles.",
    "Allow the sealer to dry before applying a second coat.",
    "While you can seal just the design on simpler tiles, you won't be able to do it here; you will have to seal the entire tile in order to protect the background image.",
    "Add a small or medium-sized felt pad to the back of each tile.",
    "You will need 4 felt pads, 1 for each corner.",
    "You can also use rubber or cork pads.",
    "Alternatively, you can use a 4-inch (10.16-centimeter) square out of a thin sheet of cork, then hot glue it to the back of your tile.",
    "The felt/rubber/cork backing will help protect your table or counter against scratches from the tiles."
  ],
  "tyn_section":[
    "Permanent stamp ink",
    "Stamps",
    "Natural, stone, unglazed tiles",
    "Felt, rubber, or cork pads",
    "Dark grey permanent stamp ink",
    "Black permanent stamp ink",
    "1 to 2 other colors",
    "Foam dauber or pouncer",
    "Large, background stamp",
    "Smaller stamp, for main image"
  ],
  "tyn_model":[
    "ink",
    "oven",
    "sealer",
    "cork",
    "rubbing alcohol",
    "heat gun",
    "felt pad",
    "felt pads",
    "hot glue",
    "rubber",
    "simple ink stamped coasters",
    "foil lined baking sheet",
    "acrylic sealer",
    "cork pads",
    "ornate ink stamped coasters",
    "terracotta",
    "travertine",
    "damp cloth",
    "stamp",
    "sponge dauber",
    "heat-setting ink",
    "ink container",
    "baking sheet",
    "clear, acrylic spray"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3,
    "p":0.125,
    "f1":0.1764705882
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}