{
  "title":"How to Use Leftover Celery",
  "url":"https://www.wikihow.com/Use-Leftover-Celery",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Making Snacks from Leftover Celery",
      "steps":[
        {
          "headline":"Eat celery with peanut butter.",
          "description":"This is a very popular snack among young children. Because children enjoy it so much, it's also a useful way of showing picky eaters that vegetables can be tasty. A popular version of this snack is called \"Ants on a log.\" Spread peanut butter onto your celery and add raisins to the top of the peanut butter to make this snack."
        },
        {
          "headline":"Dip celery in hummus.",
          "description":"This is a popular snack that takes very little effort and has minimal cleanup. It's a healthy snack, and you can add variety to it by using different varieties of hummus, like pine nut hummus, garlic hummus, and so on. Many people enjoy the flavor profile of hummus and olives. You can slice up some pitted kalamata olives and put it on top of your celery and hummus."
        },
        {
          "headline":"Make a celery salsa.",
          "description":"Use a knife to dice four sticks of celery finely. Then use your knife to halve six ripe tomatoes that are medium to large in size. Remove and throw away the tomato seeds. After that:\nUse your knife to chop up a small red onion finely. Then you can remove the seeds from your large red chili pepper, and finely chop this as well. Mix all the ingredients together in a bowl. Squeeze the juice of one lime over the ingredients and add two tbsps of finely chopped coriander. Sprinkle a little salt and pepper to taste and then mix the salsa to evenly distribute the seasoning. Wait for 20 minutes before serving."
        }
      ]
    },
    {
      "name":"Putting together a Celery Salad",
      "steps":[
        {
          "headline":"Gather your celery salad ingredients.",
          "description":"This recipe for celery salad is relatively simple and can be made in as few as 15 minutes. You can speed the preparation of this dish along by buying pre-chopped ingredients. For this dish, you'll need:\nBlack pepper\nCelery hearts (x3)\nChives (1 small bunch, chopped)\nCroutons\nCutting board\nGreen romaine (1 head)\nItalian parsley (1 cup, chopped)\nKnife\nKosher salt\nParmesan cheese (½ cup, grated)\nRadishes (x4)\nRed leaf lettuce (1 head)\nRed wine vinegar (3 tbsp)\nServing bowl (large)\nSugar (2 tsp)\nWalnut oil (or substitute extra virgin olive oil/a nut oil; 4 tbsp)"
        },
        {
          "headline":"Rinse your veggies.",
          "description":"Bacteria, dirt, or leftover pesticide may remain on your veggies. Rinse all veggies thoroughly under cool water, then pat each dry with either a clean dishcloth or paper towel. If you're not in a rush and want to save paper towel, you could spread your veggies on a clean surface and allow them to air dry."
        },
        {
          "headline":"Tear up your lettuce.",
          "description":"First, wash and dry your hands to prevent yourself from accidentally contaminating the clean lettuce. Pull its leaves apart by hand, then tear each leaf into bite-sized pieces. Do this for both the red leaf lettuce and romaine. As you tear up the lettuce, you can add it directly into your large serving bowl."
        },
        {
          "headline":"Cut up the rest of your veggies.",
          "description":"If you did not buy your parsley pre-chopped, lay it out on a clean cutting board and use your knife to chop one cup of this ingredient. Add this to your serving bowl, then do the same for your chives, if necessary. After that:\nSlice each of your four radishes thinly. Add these to your serving bowl once they are sliced. Use your knife to shave thin slices from your celery hearts. As soon as you finish, add this ingredient to your serving bowl as well."
        },
        {
          "headline":"Prepare your dressing.",
          "description":"In a small bowl, whisk your oil and vinegar thoroughly. Then add the sugar and continue to whisk until the sugar dissolves. After that, taste the dressing to check its flavor. You may need to add oil, vinegar, or sugar to adjust its flavor to your preferences."
        },
        {
          "headline":"Drizzle your dressing on the salad and enjoy.",
          "description":"Toss your salad to spread the vegetables evenly throughout the salad. Take your dressing and evenly distribute it on top of the salad. Season the salad with salt and pepper to taste. To prevent croutons from getting soggy, you should hold off adding these until just before you serve the salad."
        }
      ]
    },
    {
      "name":"Pickling Celery",
      "steps":[
        {
          "headline":"Collect your pickling supplies.",
          "description":"This method of pickling is relatively simple and only takes a couple of hours, most of which will be spent waiting for the brine to cool. This means you can whip up a batch of spicy pickled celery and then perform other tasks as it cools. You'll need:\nBowl (large; glass or ceramic preferred)\nCelery (about 8 large stalks)\nCracked peppercorn (1 tbsp)\nGarlic (4 cloves)\nKnife\nMustard seeds (1 tbsp)\nRed chili flakes (1 tsp)\nSalt (1 tbsp)\nSaucepan (small)\nSugar (¼ cup)\nWhite vinegar (1 cup)"
        },
        {
          "headline":"Prepare your ingredients.",
          "description":"Peel the papery outer skin off your four cloves of garlic and then use a garlic press or sturdy spoon to press or crush up the garlic. Put this in a small bowl to be used later. Then you should:\nRinse your celery thoroughly under cool water to remove any dirt or bacteria from it. Then use a clean dishcloth or paper towel to pat dry any remaining moisture. Cut your celery to your preferred size of pickle. You might want to leave your pickled celery long for use in Bloody Marys, you might cut them to sandwich size for use in lunches, and so on."
        },
        {
          "headline":"Boil your pickling brine.",
          "description":"First pour your vinegar into your saucepan. Turn the heat of your stove top to high, and stir in the sugar and salt. Allow the mixture to come to a boil, and continue stirring it until the sugar and salt have dissolved. Then:\nRemove the saucepan from the heat. Then add your crushed garlic, mustard seed, peppercorns, and chili flakes."
        },
        {
          "headline":"Mix your celery with the brine in a bowl.",
          "description":"Transfer the cut celery to your large bowl. Pour your brine mixture over the celery and use a spoon to stir the mixture to distribute the spices evenly throughout. While stirring, use your spoon to arrange the celery so that it is completely covered in the brine mixture."
        },
        {
          "headline":"Allow the mixture to cool and enjoy.",
          "description":"All you have to do is wait for a few hours and your pickled celery will be ready to eat. The celery and brine mixture should be completely cool before you serve this dish. To pickle longer stalks of celery:\nUse a mason jar instead of bowl. Stand the stalks up on their ends in the jar and pour enough brine to cover each stalk completely. Cover the jar with its lid tightly. Then, allow the pickled celery to cool completely and it's ready to eat. At some point you may need to gently shake the jar to help spread the spices evenly throughout the mixture."
        }
      ]
    }
  ],
  "text":" Making Snacks from Leftover Celery Eat celery with peanut butter. This is a very popular snack among young children. Because children enjoy it so much, it's also a useful way of showing picky eaters that vegetables can be tasty. A popular version of this snack is called \"Ants on a log.\" Spread peanut butter onto your celery and add raisins to the top of the peanut butter to make this snack. Dip celery in hummus. This is a popular snack that takes very little effort and has minimal cleanup. It's a healthy snack, and you can add variety to it by using different varieties of hummus, like pine nut hummus, garlic hummus, and so on. Many people enjoy the flavor profile of hummus and olives. You can slice up some pitted kalamata olives and put it on top of your celery and hummus. Make a celery salsa. Use a knife to dice four sticks of celery finely. Then use your knife to halve six ripe tomatoes that are medium to large in size. Remove and throw away the tomato seeds. After that:\nUse your knife to chop up a small red onion finely. Then you can remove the seeds from your large red chili pepper, and finely chop this as well. Mix all the ingredients together in a bowl. Squeeze the juice of one lime over the ingredients and add two tbsps of finely chopped coriander. Sprinkle a little salt and pepper to taste and then mix the salsa to evenly distribute the seasoning. Wait for 20 minutes before serving. Putting together a Celery Salad Gather your celery salad ingredients. This recipe for celery salad is relatively simple and can be made in as few as 15 minutes. You can speed the preparation of this dish along by buying pre-chopped ingredients. For this dish, you'll need:\nBlack pepper\nCelery hearts (x3)\nChives (1 small bunch, chopped)\nCroutons\nCutting board\nGreen romaine (1 head)\nItalian parsley (1 cup, chopped)\nKnife\nKosher salt\nParmesan cheese (½ cup, grated)\nRadishes (x4)\nRed leaf lettuce (1 head)\nRed wine vinegar (3 tbsp)\nServing bowl (large)\nSugar (2 tsp)\nWalnut oil (or substitute extra virgin olive oil/a nut oil; 4 tbsp) Rinse your veggies. Bacteria, dirt, or leftover pesticide may remain on your veggies. Rinse all veggies thoroughly under cool water, then pat each dry with either a clean dishcloth or paper towel. If you're not in a rush and want to save paper towel, you could spread your veggies on a clean surface and allow them to air dry. Tear up your lettuce. First, wash and dry your hands to prevent yourself from accidentally contaminating the clean lettuce. Pull its leaves apart by hand, then tear each leaf into bite-sized pieces. Do this for both the red leaf lettuce and romaine. As you tear up the lettuce, you can add it directly into your large serving bowl. Cut up the rest of your veggies. If you did not buy your parsley pre-chopped, lay it out on a clean cutting board and use your knife to chop one cup of this ingredient. Add this to your serving bowl, then do the same for your chives, if necessary. After that:\nSlice each of your four radishes thinly. Add these to your serving bowl once they are sliced. Use your knife to shave thin slices from your celery hearts. As soon as you finish, add this ingredient to your serving bowl as well. Prepare your dressing. In a small bowl, whisk your oil and vinegar thoroughly. Then add the sugar and continue to whisk until the sugar dissolves. After that, taste the dressing to check its flavor. You may need to add oil, vinegar, or sugar to adjust its flavor to your preferences. Drizzle your dressing on the salad and enjoy. Toss your salad to spread the vegetables evenly throughout the salad. Take your dressing and evenly distribute it on top of the salad. Season the salad with salt and pepper to taste. To prevent croutons from getting soggy, you should hold off adding these until just before you serve the salad. Pickling Celery Collect your pickling supplies. This method of pickling is relatively simple and only takes a couple of hours, most of which will be spent waiting for the brine to cool. This means you can whip up a batch of spicy pickled celery and then perform other tasks as it cools. You'll need:\nBowl (large; glass or ceramic preferred)\nCelery (about 8 large stalks)\nCracked peppercorn (1 tbsp)\nGarlic (4 cloves)\nKnife\nMustard seeds (1 tbsp)\nRed chili flakes (1 tsp)\nSalt (1 tbsp)\nSaucepan (small)\nSugar (¼ cup)\nWhite vinegar (1 cup) Prepare your ingredients. Peel the papery outer skin off your four cloves of garlic and then use a garlic press or sturdy spoon to press or crush up the garlic. Put this in a small bowl to be used later. Then you should:\nRinse your celery thoroughly under cool water to remove any dirt or bacteria from it. Then use a clean dishcloth or paper towel to pat dry any remaining moisture. Cut your celery to your preferred size of pickle. You might want to leave your pickled celery long for use in Bloody Marys, you might cut them to sandwich size for use in lunches, and so on. Boil your pickling brine. First pour your vinegar into your saucepan. Turn the heat of your stove top to high, and stir in the sugar and salt. Allow the mixture to come to a boil, and continue stirring it until the sugar and salt have dissolved. Then:\nRemove the saucepan from the heat. Then add your crushed garlic, mustard seed, peppercorns, and chili flakes. Mix your celery with the brine in a bowl. Transfer the cut celery to your large bowl. Pour your brine mixture over the celery and use a spoon to stir the mixture to distribute the spices evenly throughout. While stirring, use your spoon to arrange the celery so that it is completely covered in the brine mixture. Allow the mixture to cool and enjoy. All you have to do is wait for a few hours and your pickled celery will be ready to eat. The celery and brine mixture should be completely cool before you serve this dish. To pickle longer stalks of celery:\nUse a mason jar instead of bowl. Stand the stalks up on their ends in the jar and pour enough brine to cover each stalk completely. Cover the jar with its lid tightly. Then, allow the pickled celery to cool completely and it's ready to eat. At some point you may need to gently shake the jar to help spread the spices evenly throughout the mixture.",
  "sentences":[
    " Making Snacks from Leftover Celery Eat celery with peanut butter.",
    "This is a very popular snack among young children.",
    "Because children enjoy it so much, it's also a useful way of showing picky eaters that vegetables can be tasty.",
    "A popular version of this snack is called \"Ants on a log.\"",
    "Spread peanut butter onto your celery and add raisins to the top of the peanut butter to make this snack.",
    "Dip celery in hummus.",
    "This is a popular snack that takes very little effort and has minimal cleanup.",
    "It's a healthy snack, and you can add variety to it by using different varieties of hummus, like pine nut hummus, garlic hummus, and so on.",
    "Many people enjoy the flavor profile of hummus and olives.",
    "You can slice up some pitted kalamata olives and put it on top of your celery and hummus.",
    "Make a celery salsa.",
    "Use a knife to dice four sticks of celery finely.",
    "Then use your knife to halve six ripe tomatoes that are medium to large in size.",
    "Remove and throw away the tomato seeds.",
    "After that:\nUse your knife to chop up a small red onion finely.",
    "Then you can remove the seeds from your large red chili pepper, and finely chop this as well.",
    "Mix all the ingredients together in a bowl.",
    "Squeeze the juice of one lime over the ingredients and add two tbsps of finely chopped coriander.",
    "Sprinkle a little salt and pepper to taste and then mix the salsa to evenly distribute the seasoning.",
    "Wait for 20 minutes before serving.",
    "Putting together a Celery Salad Gather your celery salad ingredients.",
    "This recipe for celery salad is relatively simple and can be made in as few as 15 minutes.",
    "You can speed the preparation of this dish along by buying pre-chopped ingredients.",
    "For this dish, you'll need:\nBlack pepper\nCelery hearts (x3)\nChives (1 small bunch, chopped)\nCroutons\nCutting board\nGreen romaine (1 head)\nItalian parsley (1 cup, chopped)\nKnife\nKosher salt\nParmesan cheese (½ cup, grated)\nRadishes (x4)\nRed leaf lettuce (1 head)\nRed wine vinegar (3 tbsp)\nServing bowl (large)\nSugar (2 tsp)\nWalnut oil (or substitute extra virgin olive oil/a nut oil; 4 tbsp) Rinse your veggies.",
    "Bacteria, dirt, or leftover pesticide may remain on your veggies.",
    "Rinse all veggies thoroughly under cool water, then pat each dry with either a clean dishcloth or paper towel.",
    "If you're not in a rush and want to save paper towel, you could spread your veggies on a clean surface and allow them to air dry.",
    "Tear up your lettuce.",
    "First, wash and dry your hands to prevent yourself from accidentally contaminating the clean lettuce.",
    "Pull its leaves apart by hand, then tear each leaf into bite-sized pieces.",
    "Do this for both the red leaf lettuce and romaine.",
    "As you tear up the lettuce, you can add it directly into your large serving bowl.",
    "Cut up the rest of your veggies.",
    "If you did not buy your parsley pre-chopped, lay it out on a clean cutting board and use your knife to chop one cup of this ingredient.",
    "Add this to your serving bowl, then do the same for your chives, if necessary.",
    "After that:\nSlice each of your four radishes thinly.",
    "Add these to your serving bowl once they are sliced.",
    "Use your knife to shave thin slices from your celery hearts.",
    "As soon as you finish, add this ingredient to your serving bowl as well.",
    "Prepare your dressing.",
    "In a small bowl, whisk your oil and vinegar thoroughly.",
    "Then add the sugar and continue to whisk until the sugar dissolves.",
    "After that, taste the dressing to check its flavor.",
    "You may need to add oil, vinegar, or sugar to adjust its flavor to your preferences.",
    "Drizzle your dressing on the salad and enjoy.",
    "Toss your salad to spread the vegetables evenly throughout the salad.",
    "Take your dressing and evenly distribute it on top of the salad.",
    "Season the salad with salt and pepper to taste.",
    "To prevent croutons from getting soggy, you should hold off adding these until just before you serve the salad.",
    "Pickling Celery Collect your pickling supplies.",
    "This method of pickling is relatively simple and only takes a couple of hours, most of which will be spent waiting for the brine to cool.",
    "This means you can whip up a batch of spicy pickled celery and then perform other tasks as it cools.",
    "You'll need:\nBowl (large; glass or ceramic preferred)\nCelery (about 8 large stalks)\nCracked peppercorn (1 tbsp)\nGarlic (4 cloves)\nKnife\nMustard seeds (1 tbsp)\nRed chili flakes (1 tsp)\nSalt (1 tbsp)\nSaucepan (small)\nSugar (¼ cup)\nWhite vinegar (1 cup) Prepare your ingredients.",
    "Peel the papery outer skin off your four cloves of garlic and then use a garlic press or sturdy spoon to press or crush up the garlic.",
    "Put this in a small bowl to be used later.",
    "Then you should:\nRinse your celery thoroughly under cool water to remove any dirt or bacteria from it.",
    "Then use a clean dishcloth or paper towel to pat dry any remaining moisture.",
    "Cut your celery to your preferred size of pickle.",
    "You might want to leave your pickled celery long for use in Bloody Marys, you might cut them to sandwich size for use in lunches, and so on.",
    "Boil your pickling brine.",
    "First pour your vinegar into your saucepan.",
    "Turn the heat of your stove top to high, and stir in the sugar and salt.",
    "Allow the mixture to come to a boil, and continue stirring it until the sugar and salt have dissolved.",
    "Then:\nRemove the saucepan from the heat.",
    "Then add your crushed garlic, mustard seed, peppercorns, and chili flakes.",
    "Mix your celery with the brine in a bowl.",
    "Transfer the cut celery to your large bowl.",
    "Pour your brine mixture over the celery and use a spoon to stir the mixture to distribute the spices evenly throughout.",
    "While stirring, use your spoon to arrange the celery so that it is completely covered in the brine mixture.",
    "Allow the mixture to cool and enjoy.",
    "All you have to do is wait for a few hours and your pickled celery will be ready to eat.",
    "The celery and brine mixture should be completely cool before you serve this dish.",
    "To pickle longer stalks of celery:\nUse a mason jar instead of bowl.",
    "Stand the stalks up on their ends in the jar and pour enough brine to cover each stalk completely.",
    "Cover the jar with its lid tightly.",
    "Then, allow the pickled celery to cool completely and it's ready to eat.",
    "At some point you may need to gently shake the jar to help spread the spices evenly throughout the mixture."
  ],
  "tyn_section":[
    "Celery",
    "Coriander (optional)",
    "Hummus (optional",
    "Kalamata olives (pitted; optional)",
    "Knife",
    "Lime (optional)",
    "Peanut butter (optional)",
    "Raisins (optional)",
    "Red chili pepper (optional)",
    "Red onion (small; optional)",
    "Tomatoes (6 medium to large sized; optional)",
    "Black pepper",
    "Celery hearts (x3)",
    "Chives (1 small bunch, chopped)",
    "Croutons",
    "Cutting board",
    "Green romaine (1 head)",
    "Italian parsley (1 cup, chopped)",
    "Kosher salt",
    "Parmesan cheese (½ cup, grated)",
    "Radishes (x4)",
    "Red leaf lettuce (1 head)",
    "Red wine vinegar (3 tbsp)",
    "Serving bowl (large)",
    "Sugar (2 tsp)",
    "Walnut oil (or substitute extra virgin olive oil/a nut oil; 4 tbsp)",
    "Bowl (large; glass or ceramic preferred)",
    "Celery (about 8 large stalks)",
    "Cracked peppercorn (1 tbsp)",
    "Garlic (4 cloves)",
    "Mustard seeds (1 tbsp)",
    "Red chili flakes (1 tsp)",
    "Salt (1 tbsp)",
    "Saucepan (small)",
    "Sugar (¼ cup)",
    "White vinegar (1 cup)"
  ],
  "tyn_model":[
    "celery",
    "sugar",
    "knife",
    "bowl",
    "hummus",
    "peanut butter",
    "lettuce",
    "pickled celery",
    "garlic",
    "salt",
    "saucepan",
    "brine",
    "vegetables",
    "salt and pepper",
    "celery salad",
    "chives",
    "cutting board",
    "romaine",
    "radishes",
    "red leaf lettuce",
    "vinegar",
    "water",
    "serving bowl",
    "spoon",
    "jar",
    "raisins",
    "pine nut hummus",
    "olives",
    "kalamata olives",
    "celery salsa",
    "tomatoes",
    "tomato",
    "red onion",
    "red chili pepper",
    "lime",
    "coriander",
    "salsa",
    "black pepper",
    "celery hearts",
    "croutons",
    "italian parsley",
    "kosher salt",
    "parmesan cheese",
    "red wine",
    "walnut oil",
    "extra virgin olive oil",
    "nut oil",
    "paper towel",
    "large serving bowl",
    "parsley",
    "oil and vinegar",
    "dressing",
    "oil, vinegar",
    "pickling supplies",
    "peppercorn",
    "mustard seeds",
    "red chili flakes",
    "white vinegar",
    "garlic press",
    "pickling brine",
    "stove top",
    "crushed garlic",
    "mustard seed",
    "chili flakes",
    "large bowl",
    "mason jar",
    "spices"
  ],
  "simple_metrics":{
    "r":0.1666666667,
    "p":0.0895522388,
    "f1":0.1165048544,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.6111111111,
    "p":0.4029850746,
    "f1":0.485690924
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.5223880597,
    "f1":0.6422018349
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2777777778,
    "p":0.1492537313,
    "f1":0.1941747573
  }
}