{
  "title":"How to Create Open Shelving",
  "url":"https://www.wikihow.com/Create-Open-Shelving",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "parts":[
    {
      "name":"Choosing the Material for Your Open Shelving",
      "steps":[
        {
          "headline":"Prioritize pre-made shelving for easy installation.",
          "description":"You can buy pre-made open shelving at most general retailers, big box stores, and furniture stores. These kinds of shelves come in a variety of styles. You should choose the kind of the shelving most suitable for your home. In most cases, pre-made open shelving consists of a plank or baseboard, brackets for securing the plank or baseboard in place, and screws to fasten the brackets and plank or baseboard into place. If you cannot find the type of shelving you want, then you can also buy wood planks cut to your specifications at a big box hardware store. Then, apply a coat of stain or paint to make it the color you want."
        },
        {
          "headline":"Re-purpose and upcycle suitable open shelves.",
          "description":"Cupboards, for instance, can be very easily turned into open shelving. Remove the sides and front door of old cupboards to transform old cabinetry into an open shelf, though you may want to further anchor these to ensure the weight of the cabinet is well supported. You can re-finish old planking from barns or old structures, anchor these into the wall, and use these as open shelving as well. You can also use empty produce boxes from a farmers market or flea market. Mount them onto your wall in different configurations for a unique type of shelving."
        },
        {
          "headline":"Create a simple open shelf with pipe and wood.",
          "description":"You can create a simple frame with iron or steel pipe. Fit the pipe together in a rectangular shape by screwing the pipe together so it can accommodate a 2X4 plank of wood (or some other suitable piece of wood to use as the shelf base). When you've screwed together your piping frame, you should reinforce connecting pieces of pipe with zip-ties so it does not come loose over time. After you've finished your pipe shelving, you can use simple hooks or wall hangers in the wall to support your shelf. The metal used in making this shelf can be quite heavy. For this reason, you may want to install this shelf on studs. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeff Huynh\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\t\t\t\t\tJeff Huynh is the General Manager of Handyman Rescue Team, a full service solution in home services, renovations, and repair in the Greater Seattle area. He has over five years of handyman experience. He has a BS in Business Administration from the San Francisco State University and his Certificate in Industrial Electronics Technology from North Seattle College. Jeff Huynh\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\tWatch out for warping if you use wood. Jeff Huynh, handyman, tells us: \"Plywood and melamine are sturdy options for shelving, but fluctuations in humidity can cause them to warp over time.\""
        },
        {
          "headline":"Have a woodworker or cabinetmaker create a unique shelf.",
          "description":"If you’re not the woodworking type, you may want to have a professional, like a cabinetmaker or woodworker, to come up with an open shelving design suitable for your home. You could even ask the woodworker to incorporate certain old pieces of furniture or woodwork. An example of incorporating old pieces of furniture or woodwork might even include something like adding some molding to your open shelving that is commemorative of your first home."
        }
      ]
    },
    {
      "name":"Hanging Your Open Shelving",
      "steps":[
        {
          "headline":"Measure and mark the width of your shelves.",
          "description":"Your open shelving might have fasteners (like screws) or special anchors. You will likely be able to increase or decrease the fastener or anchor placement within a certain range. Choose a height for your shelf and at this height measure and mark all the fastener or anchor holes for your open shelf. When you’ve drawn your anchor holes, take a carpenter’s level and hold it so its bottom is level with each of the anchor hole marks. If the bubble of the level is balanced in the middle of the gauge, the holes are level. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeff Huynh\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\t\t\t\t\tJeff Huynh is the General Manager of Handyman Rescue Team, a full service solution in home services, renovations, and repair in the Greater Seattle area. He has over five years of handyman experience. He has a BS in Business Administration from the San Francisco State University and his Certificate in Industrial Electronics Technology from North Seattle College. Jeff Huynh\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\tSecure your shelves to studs for the most security. According to Jeff Huynh, the general manager of Handyman Rescue Team: \"If you're installing shelves on drywall, use a stud finder to locate the beams behind the wall, and center the shelf across those studs. Then, you can mount the shelf directly in with wooden screws. If you can't mount the shelf in studs, you can use drywall anchors to mount your shelf.\""
        },
        {
          "headline":"Drill guide holes.",
          "description":"By pre-drilling screw holes in the wall where your fastener or anchor hole marks have been drawn, you can make fastening your open shelving easier. Insert the appropriate drill bit into your drill and at each of the fastener or anchor hole marks, drill a guide hole with the drill bit. Push and pull your drill into the wall with firm, moderate pressure while the drill bit is spinning to create a guide hole in the wall for your shelving. After the hole has been drilled, there may be bits of sawdust or wood remaining in or around the guide hole. Use your fingers to brush this free from the hole."
        },
        {
          "headline":"Install wall anchors for shelves.",
          "description":"Wall anchors are plastic sheathes you can insert into the wall to further support your shelves. Once these are installed, you can fasten your shelf to the wall by sinking fasteners, like screws, through the shelf into the anchors. The materials you make your shelf out of and things you store on it will dictate whether or not your shelves require only fasteners or fasteners supported by anchors. For example:\nIf your shelving is light and you intend on holding light items on it, like knickknacks and utensils, it isn’t likely your shelving will need any support beyond screws. Keep in mind that drywall will not hold much weight. Figure out how much weight your wall mounted shelves will hold and make sure that it is more than the weight of items you want to place on them. You may want to use a wire shelving unit if you have heavy items to place on a shelf."
        },
        {
          "headline":"Screw your open shelving into the wall.",
          "description":"Start with the guide hole at one end. Hold it up to its associated mark on the wall, and screw it into place. Do the same at the next hole. After installing the second anchor, use your carpenter’s level to check the levelness of your two anchors. If they aren’t level, adjust them until they are, and then continue fastening and checking levelness in this fashion."
        },
        {
          "headline":"Re-check levelness and enjoy your open shelving.",
          "description":"After all fasteners are in place, lay the baseboard of your open shelving into the shelf frame. Check that the baseboard is secure and stably in place. Then, take your carpenter’s level and check levelness one more time. If the shelf is not level, adjust it until it is. If it is level, your shelving is ready to enjoy."
        }
      ]
    },
    {
      "name":"Making the Most of Your Open Shelving",
      "steps":[
        {
          "headline":"Position shelves in reachable locations.",
          "description":"Shelves that are positioned up high can be excellent for decorative purposes, but these can be difficult to clean and to rotate in new decorations to. Keep shelves at or around eye level so you can fully utilize them and clean them without difficulty. You may be able to include half-sized shelves beneath cupboards, above or below windows, or on cabinet sites, even."
        },
        {
          "headline":"Include decorative display pieces alongside functional ones.",
          "description":"Your open shelving doesn’t have to be display only. You can intersperse frequently used utensils and dishes with decorative pieces to make your kitchen look less utilitarian and more expressive of your personal taste and style. Think about grouping together items that are similar, like similar function items (like spoon-shaped or cup-like items), similar colored items, or items from same sets."
        },
        {
          "headline":"Tell a story with your shelf space.",
          "description":"If you are a home decorator, open shelving might be the perfect place for you to weave a creative holiday tale. You can include Christmas scenes and villages, changing the details according to season so that your home tells a story with its open shelving décor. You can display models or the finished work of your hobbies on your open shelving so conversation pieces are in open view. Use your open shelving for easy access storage. Place frequently used items into mason jars or other suitable containers, then place it on your shelving for later use."
        }
      ]
    }
  ],
  "text":" Choosing the Material for Your Open Shelving Prioritize pre-made shelving for easy installation. You can buy pre-made open shelving at most general retailers, big box stores, and furniture stores. These kinds of shelves come in a variety of styles. You should choose the kind of the shelving most suitable for your home. In most cases, pre-made open shelving consists of a plank or baseboard, brackets for securing the plank or baseboard in place, and screws to fasten the brackets and plank or baseboard into place. If you cannot find the type of shelving you want, then you can also buy wood planks cut to your specifications at a big box hardware store. Then, apply a coat of stain or paint to make it the color you want. Re-purpose and upcycle suitable open shelves. Cupboards, for instance, can be very easily turned into open shelving. Remove the sides and front door of old cupboards to transform old cabinetry into an open shelf, though you may want to further anchor these to ensure the weight of the cabinet is well supported. You can re-finish old planking from barns or old structures, anchor these into the wall, and use these as open shelving as well. You can also use empty produce boxes from a farmers market or flea market. Mount them onto your wall in different configurations for a unique type of shelving. Create a simple open shelf with pipe and wood. You can create a simple frame with iron or steel pipe. Fit the pipe together in a rectangular shape by screwing the pipe together so it can accommodate a 2X4 plank of wood (or some other suitable piece of wood to use as the shelf base). When you've screwed together your piping frame, you should reinforce connecting pieces of pipe with zip-ties so it does not come loose over time. After you've finished your pipe shelving, you can use simple hooks or wall hangers in the wall to support your shelf. The metal used in making this shelf can be quite heavy. For this reason, you may want to install this shelf on studs. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeff Huynh\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\t\t\t\t\tJeff Huynh is the General Manager of Handyman Rescue Team, a full service solution in home services, renovations, and repair in the Greater Seattle area. He has over five years of handyman experience. He has a BS in Business Administration from the San Francisco State University and his Certificate in Industrial Electronics Technology from North Seattle College. Jeff Huynh\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\tWatch out for warping if you use wood. Jeff Huynh, handyman, tells us: \"Plywood and melamine are sturdy options for shelving, but fluctuations in humidity can cause them to warp over time.\" Have a woodworker or cabinetmaker create a unique shelf. If you’re not the woodworking type, you may want to have a professional, like a cabinetmaker or woodworker, to come up with an open shelving design suitable for your home. You could even ask the woodworker to incorporate certain old pieces of furniture or woodwork. An example of incorporating old pieces of furniture or woodwork might even include something like adding some molding to your open shelving that is commemorative of your first home. Hanging Your Open Shelving Measure and mark the width of your shelves. Your open shelving might have fasteners (like screws) or special anchors. You will likely be able to increase or decrease the fastener or anchor placement within a certain range. Choose a height for your shelf and at this height measure and mark all the fastener or anchor holes for your open shelf. When you’ve drawn your anchor holes, take a carpenter’s level and hold it so its bottom is level with each of the anchor hole marks. If the bubble of the level is balanced in the middle of the gauge, the holes are level. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeff Huynh\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\t\t\t\t\tJeff Huynh is the General Manager of Handyman Rescue Team, a full service solution in home services, renovations, and repair in the Greater Seattle area. He has over five years of handyman experience. He has a BS in Business Administration from the San Francisco State University and his Certificate in Industrial Electronics Technology from North Seattle College. Jeff Huynh\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\tSecure your shelves to studs for the most security. According to Jeff Huynh, the general manager of Handyman Rescue Team: \"If you're installing shelves on drywall, use a stud finder to locate the beams behind the wall, and center the shelf across those studs. Then, you can mount the shelf directly in with wooden screws. If you can't mount the shelf in studs, you can use drywall anchors to mount your shelf.\" Drill guide holes. By pre-drilling screw holes in the wall where your fastener or anchor hole marks have been drawn, you can make fastening your open shelving easier. Insert the appropriate drill bit into your drill and at each of the fastener or anchor hole marks, drill a guide hole with the drill bit. Push and pull your drill into the wall with firm, moderate pressure while the drill bit is spinning to create a guide hole in the wall for your shelving. After the hole has been drilled, there may be bits of sawdust or wood remaining in or around the guide hole. Use your fingers to brush this free from the hole. Install wall anchors for shelves. Wall anchors are plastic sheathes you can insert into the wall to further support your shelves. Once these are installed, you can fasten your shelf to the wall by sinking fasteners, like screws, through the shelf into the anchors. The materials you make your shelf out of and things you store on it will dictate whether or not your shelves require only fasteners or fasteners supported by anchors. For example:\nIf your shelving is light and you intend on holding light items on it, like knickknacks and utensils, it isn’t likely your shelving will need any support beyond screws. Keep in mind that drywall will not hold much weight. Figure out how much weight your wall mounted shelves will hold and make sure that it is more than the weight of items you want to place on them. You may want to use a wire shelving unit if you have heavy items to place on a shelf. Screw your open shelving into the wall. Start with the guide hole at one end. Hold it up to its associated mark on the wall, and screw it into place. Do the same at the next hole. After installing the second anchor, use your carpenter’s level to check the levelness of your two anchors. If they aren’t level, adjust them until they are, and then continue fastening and checking levelness in this fashion. Re-check levelness and enjoy your open shelving. After all fasteners are in place, lay the baseboard of your open shelving into the shelf frame. Check that the baseboard is secure and stably in place. Then, take your carpenter’s level and check levelness one more time. If the shelf is not level, adjust it until it is. If it is level, your shelving is ready to enjoy. Making the Most of Your Open Shelving Position shelves in reachable locations. Shelves that are positioned up high can be excellent for decorative purposes, but these can be difficult to clean and to rotate in new decorations to. Keep shelves at or around eye level so you can fully utilize them and clean them without difficulty. You may be able to include half-sized shelves beneath cupboards, above or below windows, or on cabinet sites, even. Include decorative display pieces alongside functional ones. Your open shelving doesn’t have to be display only. You can intersperse frequently used utensils and dishes with decorative pieces to make your kitchen look less utilitarian and more expressive of your personal taste and style. Think about grouping together items that are similar, like similar function items (like spoon-shaped or cup-like items), similar colored items, or items from same sets. Tell a story with your shelf space. If you are a home decorator, open shelving might be the perfect place for you to weave a creative holiday tale. You can include Christmas scenes and villages, changing the details according to season so that your home tells a story with its open shelving décor. You can display models or the finished work of your hobbies on your open shelving so conversation pieces are in open view. Use your open shelving for easy access storage. Place frequently used items into mason jars or other suitable containers, then place it on your shelving for later use.",
  "sentences":[
    " Choosing the Material for Your Open Shelving Prioritize pre-made shelving for easy installation.",
    "You can buy pre-made open shelving at most general retailers, big box stores, and furniture stores.",
    "These kinds of shelves come in a variety of styles.",
    "You should choose the kind of the shelving most suitable for your home.",
    "In most cases, pre-made open shelving consists of a plank or baseboard, brackets for securing the plank or baseboard in place, and screws to fasten the brackets and plank or baseboard into place.",
    "If you cannot find the type of shelving you want, then you can also buy wood planks cut to your specifications at a big box hardware store.",
    "Then, apply a coat of stain or paint to make it the color you want.",
    "Re-purpose and upcycle suitable open shelves.",
    "Cupboards, for instance, can be very easily turned into open shelving.",
    "Remove the sides and front door of old cupboards to transform old cabinetry into an open shelf, though you may want to further anchor these to ensure the weight of the cabinet is well supported.",
    "You can re-finish old planking from barns or old structures, anchor these into the wall, and use these as open shelving as well.",
    "You can also use empty produce boxes from a farmers market or flea market.",
    "Mount them onto your wall in different configurations for a unique type of shelving.",
    "Create a simple open shelf with pipe and wood.",
    "You can create a simple frame with iron or steel pipe.",
    "Fit the pipe together in a rectangular shape by screwing the pipe together so it can accommodate a 2X4 plank of wood (or some other suitable piece of wood to use as the shelf base).",
    "When you've screwed together your piping frame, you should reinforce connecting pieces of pipe with zip-ties so it does not come loose over time.",
    "After you've finished your pipe shelving, you can use simple hooks or wall hangers in the wall to support your shelf.",
    "The metal used in making this shelf can be quite heavy.",
    "For this reason, you may want to install this shelf on studs.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeff Huynh\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\t\t\t\t\tJeff Huynh is the General Manager of Handyman Rescue Team, a full service solution in home services, renovations, and repair in the Greater Seattle area.",
    "He has over five years of handyman experience.",
    "He has a BS in Business Administration from the San Francisco State University and his Certificate in Industrial Electronics Technology from North Seattle College.",
    "Jeff Huynh\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\tWatch out for warping if you use wood.",
    "Jeff Huynh, handyman, tells us: \"Plywood and melamine are sturdy options for shelving, but fluctuations in humidity can cause them to warp over time.\"",
    "Have a woodworker or cabinetmaker create a unique shelf.",
    "If you’re not the woodworking type, you may want to have a professional, like a cabinetmaker or woodworker, to come up with an open shelving design suitable for your home.",
    "You could even ask the woodworker to incorporate certain old pieces of furniture or woodwork.",
    "An example of incorporating old pieces of furniture or woodwork might even include something like adding some molding to your open shelving that is commemorative of your first home.",
    "Hanging Your Open Shelving Measure and mark the width of your shelves.",
    "Your open shelving might have fasteners (like screws) or special anchors.",
    "You will likely be able to increase or decrease the fastener or anchor placement within a certain range.",
    "Choose a height for your shelf and at this height measure and mark all the fastener or anchor holes for your open shelf.",
    "When you’ve drawn your anchor holes, take a carpenter’s level and hold it so its bottom is level with each of the anchor hole marks.",
    "If the bubble of the level is balanced in the middle of the gauge, the holes are level.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeff Huynh\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\t\t\t\t\tJeff Huynh is the General Manager of Handyman Rescue Team, a full service solution in home services, renovations, and repair in the Greater Seattle area.",
    "He has over five years of handyman experience.",
    "He has a BS in Business Administration from the San Francisco State University and his Certificate in Industrial Electronics Technology from North Seattle College.",
    "Jeff Huynh\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\tSecure your shelves to studs for the most security.",
    "According to Jeff Huynh, the general manager of Handyman Rescue Team: \"If you're installing shelves on drywall, use a stud finder to locate the beams behind the wall, and center the shelf across those studs.",
    "Then, you can mount the shelf directly in with wooden screws.",
    "If you can't mount the shelf in studs, you can use drywall anchors to mount your shelf.\"",
    "Drill guide holes.",
    "By pre-drilling screw holes in the wall where your fastener or anchor hole marks have been drawn, you can make fastening your open shelving easier.",
    "Insert the appropriate drill bit into your drill and at each of the fastener or anchor hole marks, drill a guide hole with the drill bit.",
    "Push and pull your drill into the wall with firm, moderate pressure while the drill bit is spinning to create a guide hole in the wall for your shelving.",
    "After the hole has been drilled, there may be bits of sawdust or wood remaining in or around the guide hole.",
    "Use your fingers to brush this free from the hole.",
    "Install wall anchors for shelves.",
    "Wall anchors are plastic sheathes you can insert into the wall to further support your shelves.",
    "Once these are installed, you can fasten your shelf to the wall by sinking fasteners, like screws, through the shelf into the anchors.",
    "The materials you make your shelf out of and things you store on it will dictate whether or not your shelves require only fasteners or fasteners supported by anchors.",
    "For example:\nIf your shelving is light and you intend on holding light items on it, like knickknacks and utensils, it isn’t likely your shelving will need any support beyond screws.",
    "Keep in mind that drywall will not hold much weight.",
    "Figure out how much weight your wall mounted shelves will hold and make sure that it is more than the weight of items you want to place on them.",
    "You may want to use a wire shelving unit if you have heavy items to place on a shelf.",
    "Screw your open shelving into the wall.",
    "Start with the guide hole at one end.",
    "Hold it up to its associated mark on the wall, and screw it into place.",
    "Do the same at the next hole.",
    "After installing the second anchor, use your carpenter’s level to check the levelness of your two anchors.",
    "If they aren’t level, adjust them until they are, and then continue fastening and checking levelness in this fashion.",
    "Re-check levelness and enjoy your open shelving.",
    "After all fasteners are in place, lay the baseboard of your open shelving into the shelf frame.",
    "Check that the baseboard is secure and stably in place.",
    "Then, take your carpenter’s level and check levelness one more time.",
    "If the shelf is not level, adjust it until it is.",
    "If it is level, your shelving is ready to enjoy.",
    "Making the Most of Your Open Shelving Position shelves in reachable locations.",
    "Shelves that are positioned up high can be excellent for decorative purposes, but these can be difficult to clean and to rotate in new decorations to.",
    "Keep shelves at or around eye level so you can fully utilize them and clean them without difficulty.",
    "You may be able to include half-sized shelves beneath cupboards, above or below windows, or on cabinet sites, even.",
    "Include decorative display pieces alongside functional ones.",
    "Your open shelving doesn’t have to be display only.",
    "You can intersperse frequently used utensils and dishes with decorative pieces to make your kitchen look less utilitarian and more expressive of your personal taste and style.",
    "Think about grouping together items that are similar, like similar function items (like spoon-shaped or cup-like items), similar colored items, or items from same sets.",
    "Tell a story with your shelf space.",
    "If you are a home decorator, open shelving might be the perfect place for you to weave a creative holiday tale.",
    "You can include Christmas scenes and villages, changing the details according to season so that your home tells a story with its open shelving décor.",
    "You can display models or the finished work of your hobbies on your open shelving so conversation pieces are in open view.",
    "Use your open shelving for easy access storage.",
    "Place frequently used items into mason jars or other suitable containers, then place it on your shelving for later use."
  ],
  "tyn_section":[
    "Carpenter’s Level",
    "Drill (with screw and drill bits)",
    "Open shelving",
    "Pencil",
    "Screws",
    "Tape measure",
    "Wall anchors (optional; recommended)"
  ],
  "tyn_model":[
    "shelves",
    "handyman rescue team",
    "fasteners",
    "screws",
    "drill bit",
    "shelving",
    "brackets",
    "wood",
    "industrial electronics technology",
    "fastener",
    "level",
    "drill",
    "wall anchors",
    "anchors",
    "carpenter’s",
    "paint",
    "cupboards",
    "pipe",
    "piping frame",
    "zip-",
    "pipe shelving",
    "plywood",
    "melamine",
    "carpenter’s level",
    "stud finder",
    "wooden screws",
    "drywall anchors",
    "drywall",
    "wire shelving unit",
    "utensils",
    "dishes",
    "mason jars"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0625,
    "f1":0.1025641026,
    "avg_pos":0.71875
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.21875,
    "f1":0.3163841808
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5714285714,
    "p":0.25,
    "f1":0.347826087
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.0625,
    "f1":0.1025641026
  }
}