{
  "title":"How to Make a Fabric Frisbee",
  "url":"https://www.wikihow.com/Make-a-Fabric-Frisbee",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing",
    "Sewing Crafts",
    "Sewing Toys and Dolls"
  ],
  "methods":[
    {
      "name":"Making a Frisbee",
      "steps":[
        {
          "headline":"Cut two 8-inch (20.32-centimeter) circles out cotton fabric.",
          "description":"You can use the same color and pattern for both circles, or you can use different ones. You could even use a solid color for one circle, and a coordinating pattern for the other one. Use a large bowl, plate, or compass to trace the circle. Try to cut through both pieces of fabric at once. This save times and ensures that they are even."
        },
        {
          "headline":"Cut two 8-inch (20.32-centimeter) circles out of cotton batting.",
          "description":"Use the fabric circles to trace 8-inch (20.32-centimeter) circles onto cotton batting. Cut the circles out of the batting one at a time. The batting will make the Frisbee more stable."
        },
        {
          "headline":"Place the two fabric circles together, with the right sides facing in.",
          "description":"When you turn the Frisbee right-side-out at the end, the right side of the fabric will be showing."
        },
        {
          "headline":"Pin the cotton batting circles to both side of fabric disk.",
          "description":"Place a cotton batting circle on top of your fabric disk. Flip the whole thing over, and place the other cotton batting circle on top. Pin the disk together using sewing pins. You should have the cotton batting circles on the outside, and the fabric circles on the inside."
        },
        {
          "headline":"Sew around the circle, leaving a small gap for turning.",
          "description":"Use a sewing machine and a straight stitch to sew around the disk, ¼-inch (0.32-centimeter) from the edge. Leave a 3-inch (7.62-centimeter) gap between the start and end of your sewing."
        },
        {
          "headline":"Turn the Frisbee right-side-out.",
          "description":"Remove the sewing pins first, then turn the Frisbee right-side-out through the hole. Run a knitting needle, or another long, slender tool, along the inside of the Frisbee to help shape it. You should now see the right side of your fabric on both sides."
        },
        {
          "headline":"Iron the Frisbee flat, tucking in the opening.",
          "description":"Tuck in the raw edges from the opening, and pin them in place. Run an iron over the Frisbee using the cotton setting. Flip the Frisbee over, and iron the other side."
        },
        {
          "headline":"Sew the opening shut, removing the pins as you do so.",
          "description":"Use a ladder stitch to sew the opening shut. If you don't know how to ladder stitch, you can close the opening using fabric glue instead."
        },
        {
          "headline":"Trace a smaller circle inside the Frisbee.",
          "description":"Use a bowl, plate, or compass to trace a 4 to 5-inch (10.16 to 12.7-centimeter) wide circle in the center of your Frisbee. Use a washable dressmaker's chalk or pen to do this. If your Frisbee has a front and back, trace the circle on the back."
        },
        {
          "headline":"Topstitch the circle on your sewing machine.",
          "description":"You can use the same thread color as the fabric, or a contrasting one. This will add an element of design as well as keep the cotton batting in place. Backstitch a few times at the front and start of your sewing."
        }
      ]
    },
    {
      "name":"Making a Frisbee Cover",
      "steps":[
        {
          "headline":"Use a Frisbee to trace a circle on a piece of fabric, including seam allowances.",
          "description":"Place a Frisbee down on a piece of colorful cotton fabric. Use a dressmaker's chalk or pen to trace around the Frisbee, ½-inch (1.27-centimeter) from the edge."
        },
        {
          "headline":"Draw a narrow rectangle on the fabric, long enough to wrap around the Frisbee.",
          "description":"Measure around the Frisbee and add 1 inch (2.54 centimeters) for seam allowance. Draw a rectangle on the fabric that is 3½ inches (8.89 centimeters) wide and whatever the Frisbee's circumference is (plus the seam allowance). You can draw the rectangle on the same piece of fabric, or use a different color/pattern."
        },
        {
          "headline":"Cut the fabric out along the lines that you drew.",
          "description":"The circle will make the top of the Frisbee and the rectangle will make the inside hem."
        },
        {
          "headline":"Sew the narrow ends of the rectangle together to make a loop.",
          "description":"Fold the narrow ends of the rectangle together, right sides together. Sew along the edge using a ½-inch (1.27-centimeter) seam allowance."
        },
        {
          "headline":"Press the seam open with an iron.",
          "description":"This will make it easier to insert the elastic later on. If you'd like to, you can topstitch both of the hems down close to the seam. This will add an element of design and keep the hems from fraying."
        },
        {
          "headline":"Fold one of the raw edges over twice to make the hem.",
          "description":"Working your way around the loop, fold one of the raw edges in by ¼-inch (0.32-centimeter). Press it flat with an iron as you go. When you are done, fold the edge in by ½-inch (1.27-centimeter) and press it with an iron once more. Make sure that you are folding towards the wrong side of the fabric."
        },
        {
          "headline":"Topstitch the hem down, leaving a small gap.",
          "description":"Try to sew as close to the inside, folded edge as you can so that you'll have room for the elastic. Leave a 1 to 2-inch (2.54 to 5.08-centimeter) gap between the start and end of your sewing so that you can insert the elastic. You can use a matching thread color or a contrasting one."
        },
        {
          "headline":"Pin the loop to the circle with the right sides facing in.",
          "description":"Turn the circle so that the right side is facing you. Make sure that the wrong side of the loop is facing out, then pin the remaining raw edge all the way around the circle."
        },
        {
          "headline":"Sew around the circle.",
          "description":"Use a ¼-inch (0.32-centimeter) seam allowance and a matching thread color. When you are done sewing, consider cutting notches into the seam. This will make the cover lay more smoothly after you turn it inside out."
        },
        {
          "headline":"Thread some elastic through the loop's hem.",
          "description":"Frisbee, then cut some ⅜-inch (0.95-centimeter) wide elastic according to that length. Use a safety pin to thread the elastic through the opening in the hem. Remove the safety pin when you are done."
        },
        {
          "headline":"Sew the ends of the elastic together.",
          "description":"Overlap the ends until the loop rests neatly against the circle. Sew the ends together using a straight stitch. Trim off any excess elastic, if necessary. Don't make the elastic too tight. You want to be able to stretch the cover over your Frisbee. Don't make the elastic too loose, or the cover will fall off. Give your Frisbee a nicer finish by tucking the elastic into the hem, then stitch the 1 to 2-inch (2.54 to 5.08-centimeter) gap shut."
        },
        {
          "headline":"Turn the cover inside out.",
          "description":"At this point, your cover is complete, and ready to be slipped over a Frisbee. If you want to, press both sides of the cover with an iron first, before slipping it over a Frisbee."
        }
      ]
    }
  ],
  "text":" Making a Frisbee Cut two 8-inch (20.32-centimeter) circles out cotton fabric. You can use the same color and pattern for both circles, or you can use different ones. You could even use a solid color for one circle, and a coordinating pattern for the other one. Use a large bowl, plate, or compass to trace the circle. Try to cut through both pieces of fabric at once. This save times and ensures that they are even. Cut two 8-inch (20.32-centimeter) circles out of cotton batting. Use the fabric circles to trace 8-inch (20.32-centimeter) circles onto cotton batting. Cut the circles out of the batting one at a time. The batting will make the Frisbee more stable. Place the two fabric circles together, with the right sides facing in. When you turn the Frisbee right-side-out at the end, the right side of the fabric will be showing. Pin the cotton batting circles to both side of fabric disk. Place a cotton batting circle on top of your fabric disk. Flip the whole thing over, and place the other cotton batting circle on top. Pin the disk together using sewing pins. You should have the cotton batting circles on the outside, and the fabric circles on the inside. Sew around the circle, leaving a small gap for turning. Use a sewing machine and a straight stitch to sew around the disk, ¼-inch (0.32-centimeter) from the edge. Leave a 3-inch (7.62-centimeter) gap between the start and end of your sewing. Turn the Frisbee right-side-out. Remove the sewing pins first, then turn the Frisbee right-side-out through the hole. Run a knitting needle, or another long, slender tool, along the inside of the Frisbee to help shape it. You should now see the right side of your fabric on both sides. Iron the Frisbee flat, tucking in the opening. Tuck in the raw edges from the opening, and pin them in place. Run an iron over the Frisbee using the cotton setting. Flip the Frisbee over, and iron the other side. Sew the opening shut, removing the pins as you do so. Use a ladder stitch to sew the opening shut. If you don't know how to ladder stitch, you can close the opening using fabric glue instead. Trace a smaller circle inside the Frisbee. Use a bowl, plate, or compass to trace a 4 to 5-inch (10.16 to 12.7-centimeter) wide circle in the center of your Frisbee. Use a washable dressmaker's chalk or pen to do this. If your Frisbee has a front and back, trace the circle on the back. Topstitch the circle on your sewing machine. You can use the same thread color as the fabric, or a contrasting one. This will add an element of design as well as keep the cotton batting in place. Backstitch a few times at the front and start of your sewing. Making a Frisbee Cover Use a Frisbee to trace a circle on a piece of fabric, including seam allowances. Place a Frisbee down on a piece of colorful cotton fabric. Use a dressmaker's chalk or pen to trace around the Frisbee, ½-inch (1.27-centimeter) from the edge. Draw a narrow rectangle on the fabric, long enough to wrap around the Frisbee. Measure around the Frisbee and add 1 inch (2.54 centimeters) for seam allowance. Draw a rectangle on the fabric that is 3½ inches (8.89 centimeters) wide and whatever the Frisbee's circumference is (plus the seam allowance). You can draw the rectangle on the same piece of fabric, or use a different color/pattern. Cut the fabric out along the lines that you drew. The circle will make the top of the Frisbee and the rectangle will make the inside hem. Sew the narrow ends of the rectangle together to make a loop. Fold the narrow ends of the rectangle together, right sides together. Sew along the edge using a ½-inch (1.27-centimeter) seam allowance. Press the seam open with an iron. This will make it easier to insert the elastic later on. If you'd like to, you can topstitch both of the hems down close to the seam. This will add an element of design and keep the hems from fraying. Fold one of the raw edges over twice to make the hem. Working your way around the loop, fold one of the raw edges in by ¼-inch (0.32-centimeter). Press it flat with an iron as you go. When you are done, fold the edge in by ½-inch (1.27-centimeter) and press it with an iron once more. Make sure that you are folding towards the wrong side of the fabric. Topstitch the hem down, leaving a small gap. Try to sew as close to the inside, folded edge as you can so that you'll have room for the elastic. Leave a 1 to 2-inch (2.54 to 5.08-centimeter) gap between the start and end of your sewing so that you can insert the elastic. You can use a matching thread color or a contrasting one. Pin the loop to the circle with the right sides facing in. Turn the circle so that the right side is facing you. Make sure that the wrong side of the loop is facing out, then pin the remaining raw edge all the way around the circle. Sew around the circle. Use a ¼-inch (0.32-centimeter) seam allowance and a matching thread color. When you are done sewing, consider cutting notches into the seam. This will make the cover lay more smoothly after you turn it inside out. Thread some elastic through the loop's hem. Frisbee, then cut some ⅜-inch (0.95-centimeter) wide elastic according to that length. Use a safety pin to thread the elastic through the opening in the hem. Remove the safety pin when you are done. Sew the ends of the elastic together. Overlap the ends until the loop rests neatly against the circle. Sew the ends together using a straight stitch. Trim off any excess elastic, if necessary. Don't make the elastic too tight. You want to be able to stretch the cover over your Frisbee. Don't make the elastic too loose, or the cover will fall off. Give your Frisbee a nicer finish by tucking the elastic into the hem, then stitch the 1 to 2-inch (2.54 to 5.08-centimeter) gap shut. Turn the cover inside out. At this point, your cover is complete, and ready to be slipped over a Frisbee. If you want to, press both sides of the cover with an iron first, before slipping it over a Frisbee.",
  "sentences":[
    " Making a Frisbee Cut two 8-inch (20.32-centimeter) circles out cotton fabric.",
    "You can use the same color and pattern for both circles, or you can use different ones.",
    "You could even use a solid color for one circle, and a coordinating pattern for the other one.",
    "Use a large bowl, plate, or compass to trace the circle.",
    "Try to cut through both pieces of fabric at once.",
    "This save times and ensures that they are even.",
    "Cut two 8-inch (20.32-centimeter) circles out of cotton batting.",
    "Use the fabric circles to trace 8-inch (20.32-centimeter) circles onto cotton batting.",
    "Cut the circles out of the batting one at a time.",
    "The batting will make the Frisbee more stable.",
    "Place the two fabric circles together, with the right sides facing in.",
    "When you turn the Frisbee right-side-out at the end, the right side of the fabric will be showing.",
    "Pin the cotton batting circles to both side of fabric disk.",
    "Place a cotton batting circle on top of your fabric disk.",
    "Flip the whole thing over, and place the other cotton batting circle on top.",
    "Pin the disk together using sewing pins.",
    "You should have the cotton batting circles on the outside, and the fabric circles on the inside.",
    "Sew around the circle, leaving a small gap for turning.",
    "Use a sewing machine and a straight stitch to sew around the disk, ¼-inch (0.32-centimeter) from the edge.",
    "Leave a 3-inch (7.62-centimeter) gap between the start and end of your sewing.",
    "Turn the Frisbee right-side-out.",
    "Remove the sewing pins first, then turn the Frisbee right-side-out through the hole.",
    "Run a knitting needle, or another long, slender tool, along the inside of the Frisbee to help shape it.",
    "You should now see the right side of your fabric on both sides.",
    "Iron the Frisbee flat, tucking in the opening.",
    "Tuck in the raw edges from the opening, and pin them in place.",
    "Run an iron over the Frisbee using the cotton setting.",
    "Flip the Frisbee over, and iron the other side.",
    "Sew the opening shut, removing the pins as you do so.",
    "Use a ladder stitch to sew the opening shut.",
    "If you don't know how to ladder stitch, you can close the opening using fabric glue instead.",
    "Trace a smaller circle inside the Frisbee.",
    "Use a bowl, plate, or compass to trace a 4 to 5-inch (10.16 to 12.7-centimeter) wide circle in the center of your Frisbee.",
    "Use a washable dressmaker's chalk or pen to do this.",
    "If your Frisbee has a front and back, trace the circle on the back.",
    "Topstitch the circle on your sewing machine.",
    "You can use the same thread color as the fabric, or a contrasting one.",
    "This will add an element of design as well as keep the cotton batting in place.",
    "Backstitch a few times at the front and start of your sewing.",
    "Making a Frisbee Cover Use a Frisbee to trace a circle on a piece of fabric, including seam allowances.",
    "Place a Frisbee down on a piece of colorful cotton fabric.",
    "Use a dressmaker's chalk or pen to trace around the Frisbee, ½-inch (1.27-centimeter) from the edge.",
    "Draw a narrow rectangle on the fabric, long enough to wrap around the Frisbee.",
    "Measure around the Frisbee and add 1 inch (2.54 centimeters) for seam allowance.",
    "Draw a rectangle on the fabric that is 3½ inches (8.89 centimeters) wide and whatever the Frisbee's circumference is (plus the seam allowance).",
    "You can draw the rectangle on the same piece of fabric, or use a different color/pattern.",
    "Cut the fabric out along the lines that you drew.",
    "The circle will make the top of the Frisbee and the rectangle will make the inside hem.",
    "Sew the narrow ends of the rectangle together to make a loop.",
    "Fold the narrow ends of the rectangle together, right sides together.",
    "Sew along the edge using a ½-inch (1.27-centimeter) seam allowance.",
    "Press the seam open with an iron.",
    "This will make it easier to insert the elastic later on.",
    "If you'd like to, you can topstitch both of the hems down close to the seam.",
    "This will add an element of design and keep the hems from fraying.",
    "Fold one of the raw edges over twice to make the hem.",
    "Working your way around the loop, fold one of the raw edges in by ¼-inch (0.32-centimeter).",
    "Press it flat with an iron as you go.",
    "When you are done, fold the edge in by ½-inch (1.27-centimeter) and press it with an iron once more.",
    "Make sure that you are folding towards the wrong side of the fabric.",
    "Topstitch the hem down, leaving a small gap.",
    "Try to sew as close to the inside, folded edge as you can so that you'll have room for the elastic.",
    "Leave a 1 to 2-inch (2.54 to 5.08-centimeter) gap between the start and end of your sewing so that you can insert the elastic.",
    "You can use a matching thread color or a contrasting one.",
    "Pin the loop to the circle with the right sides facing in.",
    "Turn the circle so that the right side is facing you.",
    "Make sure that the wrong side of the loop is facing out, then pin the remaining raw edge all the way around the circle.",
    "Sew around the circle.",
    "Use a ¼-inch (0.32-centimeter) seam allowance and a matching thread color.",
    "When you are done sewing, consider cutting notches into the seam.",
    "This will make the cover lay more smoothly after you turn it inside out.",
    "Thread some elastic through the loop's hem.",
    "Frisbee, then cut some ⅜-inch (0.95-centimeter) wide elastic according to that length.",
    "Use a safety pin to thread the elastic through the opening in the hem.",
    "Remove the safety pin when you are done.",
    "Sew the ends of the elastic together.",
    "Overlap the ends until the loop rests neatly against the circle.",
    "Sew the ends together using a straight stitch.",
    "Trim off any excess elastic, if necessary.",
    "Don't make the elastic too tight.",
    "You want to be able to stretch the cover over your Frisbee.",
    "Don't make the elastic too loose, or the cover will fall off.",
    "Give your Frisbee a nicer finish by tucking the elastic into the hem, then stitch the 1 to 2-inch (2.54 to 5.08-centimeter) gap shut.",
    "Turn the cover inside out.",
    "At this point, your cover is complete, and ready to be slipped over a Frisbee.",
    "If you want to, press both sides of the cover with an iron first, before slipping it over a Frisbee."
  ],
  "tyn_section":[
    "Cotton fabric (1 to 2 colors or patterns)",
    "Cotton batting",
    "Dressmakers chalk or pen",
    "Fabric scissors",
    "Sewing machine",
    "Sewing pins",
    "Needle",
    "Thread",
    "Iron",
    "Pinking sheers",
    "⅜-inch (0.95-centimeter) wide elastic",
    "Safety pin",
    "Paper and pen for tracing"
  ],
  "tyn_model":[
    "frisbee",
    "fabric",
    "elastic",
    "iron",
    "cotton batting",
    "plate",
    "sewing pins",
    "sewing machine",
    "dressmaker's chalk",
    "thread",
    "cotton fabric",
    "large bowl",
    "compass",
    "fabric disk",
    "straight stitch",
    "fabric glue",
    "bowl",
    "colorful cotton fabric",
    "safety pin"
  ],
  "simple_metrics":{
    "r":0.4615384615,
    "p":0.3157894737,
    "f1":0.375,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5384615385,
    "p":0.3684210526,
    "f1":0.4375
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5384615385,
    "p":0.5263157895,
    "f1":0.5323193916
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4615384615,
    "p":0.3157894737,
    "f1":0.375
  }
}