{
  "title":"How to Make a Polymer Clay Penguin",
  "url":"https://www.wikihow.com/Make-a-Polymer-Clay-Penguin",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Making a Basic Penguin",
      "steps":[
        {
          "headline":"Make the body of the penguin.",
          "description":"Knead some black clay until it turns soft. Roll it into an oval, about twice the height of your thumbnail. Flatten one of the oval's pointy ends against your work surface until it can stand on its own."
        },
        {
          "headline":"Make the head of the penguin.",
          "description":"Roll some black clay into a small ball, about the same size as your thumbnail, or half the height of the body."
        },
        {
          "headline":"Attach the head to the body.",
          "description":"Gently press the head on top of the penguin's body. Don't worry if the head squishes a little. If you'd like, you can use a clay sculpting tool to smooth the seam between the head and the body."
        },
        {
          "headline":"Roll some white clay out into a thin sheet.",
          "description":"Clean your hands first, then knead some white clay until it turns soft. Roll the clay into a thin sheet using an acrylic rolling pin or tube. You can find acrylic rolling pins in the polymer clay aisle of an arts and crafts store. If you can't find any acrylic rolling pins, you can use a regular rolling pin, a fat marker, or any other smooth cylinder."
        },
        {
          "headline":"Cut an oval and a heart out of the white clay.",
          "description":"The oval will make the belly and the heart will make the face. Both need to be a little smaller than the body and head respectively. You can use mini polymer clay cutters for this; they look like miniature cookie cutters. You can also cut the shapes freehand with a craft blade instead."
        },
        {
          "headline":"Stick the white shapes onto the body and head.",
          "description":"Gently press the white heart onto the head, and the white oval onto the body. Make sure that the bottom of the heart and the top of the oval go into the crease between the head and body."
        },
        {
          "headline":"Roll some black clay into a thick sheet.",
          "description":"Clean your hands again, and knead some more black clay until it turns soft. Roll the clay into a thick, black sheet. Plan on making it twice as thick as the white sheet. This will eventually make the wings."
        },
        {
          "headline":"Cut two wings out of the sheet.",
          "description":"Start by cutting an oval out of the clay, a little bit shorter than the body. Cut the oval in half, lengthwise, so that you end up with two semi-ovals. You can use a craft blade to do this."
        },
        {
          "headline":"Add the wings onto the penguin's body.",
          "description":"Gently press the wings down onto the body to either side of the white belly. The flat edges of the wings should be facing the white belly. The tips of the wings should be nestled into the crease between the head and the body. Don't worry if the wings overlap the white belly a little. Consider flipping the bottom of the wings outwards for a cute touch."
        },
        {
          "headline":"Make a beak.",
          "description":"Clean your hands, and knead some orange clay. Roll the clay into a tiny teardrop or cone."
        },
        {
          "headline":"Attach the beak.",
          "description":"Press the bottom of the teardrop/cone into the middle of the penguin's face. Use a craft blade to cut the beak open after you attach it, if desired. This will give your penguin an open mouth instead of a closed one."
        },
        {
          "headline":"Make the feet.",
          "description":"Roll a small ball out of orange clay. Cut the ball in half using a craft blade. Cut two notches into each dome to make the feet."
        },
        {
          "headline":"Attach the feet.",
          "description":"Turn the penguin upside down. Pinch the back of both feet, then press them into the base of the body. Make sure that the front of the feet (the notched parts) stick out from under the body. Place the penguin right-side-up against the table, and adjust the feet, if needed."
        },
        {
          "headline":"Consider inserting an eyehook.",
          "description":"If you wish to turn this penguin into a charm, press a jewelry eyehook through the top of the head and into the body. If the hook is very long, trim it down first using a pair of wire cutters."
        },
        {
          "headline":"Bake the penguin according to the manufacturer's baking times and temperatures.",
          "description":"Turn on your oven, and let it reach the recommended temperature, usually between 215 to 325°F (102 to 163°C). Place the penguin on a foil-lined baking sheet, and bake it for the recommended time, typically 15 to 20 minutes. Each company will be a little different, so you will need to read the label on the clay's wrapper. If your penguin has a lot of fingerprints on it, gently brush it with a soft-bristled paintbrush before you bake it."
        },
        {
          "headline":"Allow the penguin to cool before adding the eyes.",
          "description":"Use a black permanent marker to draw two dots on the penguin's face, right above the beak. Position them in the loops of the \"heart\". You can also use a thin brush and acrylic paint."
        },
        {
          "headline":"Glaze the penguin, if desired.",
          "description":"If you wish to make the penguin shiny, get some glaze meant for polymer clay. Paint the penguin with the glaze, then let the glaze dry. Refer to the label on the bottle, as each brand's drying times will vary."
        }
      ]
    },
    {
      "name":"Making a Penguin Charm",
      "steps":[
        {
          "headline":"Shape the body.",
          "description":"Knead some polymer clay until it softens, then roll it into an oval. Flatten the oval with a glass so that you get a disk shape. Cut off one of the pointy ends of the oval, so that the penguin can stand upright. Penguins are typically black, but since you are making a cute penguin, you can make him or her any color you want! Pink, baby blue, or light purple would be especially cute!"
        },
        {
          "headline":"Roll some white clay into a thin sheet.",
          "description":"Clean your hands first to avoid transferring color, then knead some white clay until it softens. Roll it into a thin sheet using an acrylic rolling pin. You can find it in the polymer clay aisle of an arts and crafts store. If you can't find an acrylic rolling pin, you can use another smooth cylinder, such as a fat marker or a rolling pin."
        },
        {
          "headline":"Cut an \"m\" shape out of the sheet.",
          "description":"This will make the body and face of your penguin. It needs to be the width as body, but a little shorter. Use a craft blade to cut the shape out."
        },
        {
          "headline":"Press the white \"m\" onto body.",
          "description":"Be sure to match up the base of the \"m\" with the base of the body. You will have a slight gap between the top of the \"m\" and the top of the body."
        },
        {
          "headline":"Make a beak.",
          "description":"Clean your hands, then knead some orange clay until it turns soft. Press it into a thin disk, then cut a small triangle out of it using a craft blade."
        },
        {
          "headline":"Attach the beak.",
          "description":"Press the triangle into the middle of the white part on the body. Make sure that the pointed tip of the triangle is pointing downward."
        },
        {
          "headline":"Add some eyes.",
          "description":"Roll two small balls out of black clay. Press each ball onto the penguin to either side of the beak. They should just barely be touching the upper corners of the bead. If you don't have any black clay, you can skip this step, and paint the eyes on instead after you are done baking."
        },
        {
          "headline":"Insert an eyehook into the top of the penguin.",
          "description":"Measure the eyehook against the penguin first. If it is too long, trim it down with a pair of wire cutters. Push the eyehook down through the top of the penguin."
        },
        {
          "headline":"Bake the penguin.",
          "description":"Preheat your oven to the temperature specified by the manufacturer, typically between 215 to 325°F (102 to 163°C). Place your penguin onto a foil-liked baking sheet. Bake the penguin for the time recommended by the manufacturer, typically 15 to 20 minutes. Each brand of clay will have different baking times and temperatures. Read the label on the clay's wrapper carefully. If the eyehook is still look, put a little superglue around the seam."
        },
        {
          "headline":"Paint some feet onto the penguin once it cools.",
          "description":"After the penguin is done baking, take it out of the oven and let it cool. Use a thin paintbrush and some orange, acrylic paint to add two small v's at the bottom of the penguin. If you don't have any paint at home, you can use an orange permanent marker instead."
        },
        {
          "headline":"Glaze the penguin, if desired.",
          "description":"Get some glaze meant for polymer clay. Thread some string through the eyehook and tie it into a loop. Dip the penguin into the glaze, then lift it out. Let the excess glaze drip off, then hang the penguin by the loop so that it can dry. Place a sheet of scrap paper under the penguin as it is drying to catch any excess glaze."
        }
      ]
    }
  ],
  "text":" Making a Basic Penguin Make the body of the penguin. Knead some black clay until it turns soft. Roll it into an oval, about twice the height of your thumbnail. Flatten one of the oval's pointy ends against your work surface until it can stand on its own. Make the head of the penguin. Roll some black clay into a small ball, about the same size as your thumbnail, or half the height of the body. Attach the head to the body. Gently press the head on top of the penguin's body. Don't worry if the head squishes a little. If you'd like, you can use a clay sculpting tool to smooth the seam between the head and the body. Roll some white clay out into a thin sheet. Clean your hands first, then knead some white clay until it turns soft. Roll the clay into a thin sheet using an acrylic rolling pin or tube. You can find acrylic rolling pins in the polymer clay aisle of an arts and crafts store. If you can't find any acrylic rolling pins, you can use a regular rolling pin, a fat marker, or any other smooth cylinder. Cut an oval and a heart out of the white clay. The oval will make the belly and the heart will make the face. Both need to be a little smaller than the body and head respectively. You can use mini polymer clay cutters for this; they look like miniature cookie cutters. You can also cut the shapes freehand with a craft blade instead. Stick the white shapes onto the body and head. Gently press the white heart onto the head, and the white oval onto the body. Make sure that the bottom of the heart and the top of the oval go into the crease between the head and body. Roll some black clay into a thick sheet. Clean your hands again, and knead some more black clay until it turns soft. Roll the clay into a thick, black sheet. Plan on making it twice as thick as the white sheet. This will eventually make the wings. Cut two wings out of the sheet. Start by cutting an oval out of the clay, a little bit shorter than the body. Cut the oval in half, lengthwise, so that you end up with two semi-ovals. You can use a craft blade to do this. Add the wings onto the penguin's body. Gently press the wings down onto the body to either side of the white belly. The flat edges of the wings should be facing the white belly. The tips of the wings should be nestled into the crease between the head and the body. Don't worry if the wings overlap the white belly a little. Consider flipping the bottom of the wings outwards for a cute touch. Make a beak. Clean your hands, and knead some orange clay. Roll the clay into a tiny teardrop or cone. Attach the beak. Press the bottom of the teardrop/cone into the middle of the penguin's face. Use a craft blade to cut the beak open after you attach it, if desired. This will give your penguin an open mouth instead of a closed one. Make the feet. Roll a small ball out of orange clay. Cut the ball in half using a craft blade. Cut two notches into each dome to make the feet. Attach the feet. Turn the penguin upside down. Pinch the back of both feet, then press them into the base of the body. Make sure that the front of the feet (the notched parts) stick out from under the body. Place the penguin right-side-up against the table, and adjust the feet, if needed. Consider inserting an eyehook. If you wish to turn this penguin into a charm, press a jewelry eyehook through the top of the head and into the body. If the hook is very long, trim it down first using a pair of wire cutters. Bake the penguin according to the manufacturer's baking times and temperatures. Turn on your oven, and let it reach the recommended temperature, usually between 215 to 325°F (102 to 163°C). Place the penguin on a foil-lined baking sheet, and bake it for the recommended time, typically 15 to 20 minutes. Each company will be a little different, so you will need to read the label on the clay's wrapper. If your penguin has a lot of fingerprints on it, gently brush it with a soft-bristled paintbrush before you bake it. Allow the penguin to cool before adding the eyes. Use a black permanent marker to draw two dots on the penguin's face, right above the beak. Position them in the loops of the \"heart\". You can also use a thin brush and acrylic paint. Glaze the penguin, if desired. If you wish to make the penguin shiny, get some glaze meant for polymer clay. Paint the penguin with the glaze, then let the glaze dry. Refer to the label on the bottle, as each brand's drying times will vary. Making a Penguin Charm Shape the body. Knead some polymer clay until it softens, then roll it into an oval. Flatten the oval with a glass so that you get a disk shape. Cut off one of the pointy ends of the oval, so that the penguin can stand upright. Penguins are typically black, but since you are making a cute penguin, you can make him or her any color you want! Pink, baby blue, or light purple would be especially cute! Roll some white clay into a thin sheet. Clean your hands first to avoid transferring color, then knead some white clay until it softens. Roll it into a thin sheet using an acrylic rolling pin. You can find it in the polymer clay aisle of an arts and crafts store. If you can't find an acrylic rolling pin, you can use another smooth cylinder, such as a fat marker or a rolling pin. Cut an \"m\" shape out of the sheet. This will make the body and face of your penguin. It needs to be the width as body, but a little shorter. Use a craft blade to cut the shape out. Press the white \"m\" onto body. Be sure to match up the base of the \"m\" with the base of the body. You will have a slight gap between the top of the \"m\" and the top of the body. Make a beak. Clean your hands, then knead some orange clay until it turns soft. Press it into a thin disk, then cut a small triangle out of it using a craft blade. Attach the beak. Press the triangle into the middle of the white part on the body. Make sure that the pointed tip of the triangle is pointing downward. Add some eyes. Roll two small balls out of black clay. Press each ball onto the penguin to either side of the beak. They should just barely be touching the upper corners of the bead. If you don't have any black clay, you can skip this step, and paint the eyes on instead after you are done baking. Insert an eyehook into the top of the penguin. Measure the eyehook against the penguin first. If it is too long, trim it down with a pair of wire cutters. Push the eyehook down through the top of the penguin. Bake the penguin. Preheat your oven to the temperature specified by the manufacturer, typically between 215 to 325°F (102 to 163°C). Place your penguin onto a foil-liked baking sheet. Bake the penguin for the time recommended by the manufacturer, typically 15 to 20 minutes. Each brand of clay will have different baking times and temperatures. Read the label on the clay's wrapper carefully. If the eyehook is still look, put a little superglue around the seam. Paint some feet onto the penguin once it cools. After the penguin is done baking, take it out of the oven and let it cool. Use a thin paintbrush and some orange, acrylic paint to add two small v's at the bottom of the penguin. If you don't have any paint at home, you can use an orange permanent marker instead. Glaze the penguin, if desired. Get some glaze meant for polymer clay. Thread some string through the eyehook and tie it into a loop. Dip the penguin into the glaze, then lift it out. Let the excess glaze drip off, then hang the penguin by the loop so that it can dry. Place a sheet of scrap paper under the penguin as it is drying to catch any excess glaze.",
  "sentences":[
    " Making a Basic Penguin Make the body of the penguin.",
    "Knead some black clay until it turns soft.",
    "Roll it into an oval, about twice the height of your thumbnail.",
    "Flatten one of the oval's pointy ends against your work surface until it can stand on its own.",
    "Make the head of the penguin.",
    "Roll some black clay into a small ball, about the same size as your thumbnail, or half the height of the body.",
    "Attach the head to the body.",
    "Gently press the head on top of the penguin's body.",
    "Don't worry if the head squishes a little.",
    "If you'd like, you can use a clay sculpting tool to smooth the seam between the head and the body.",
    "Roll some white clay out into a thin sheet.",
    "Clean your hands first, then knead some white clay until it turns soft.",
    "Roll the clay into a thin sheet using an acrylic rolling pin or tube.",
    "You can find acrylic rolling pins in the polymer clay aisle of an arts and crafts store.",
    "If you can't find any acrylic rolling pins, you can use a regular rolling pin, a fat marker, or any other smooth cylinder.",
    "Cut an oval and a heart out of the white clay.",
    "The oval will make the belly and the heart will make the face.",
    "Both need to be a little smaller than the body and head respectively.",
    "You can use mini polymer clay cutters for this; they look like miniature cookie cutters.",
    "You can also cut the shapes freehand with a craft blade instead.",
    "Stick the white shapes onto the body and head.",
    "Gently press the white heart onto the head, and the white oval onto the body.",
    "Make sure that the bottom of the heart and the top of the oval go into the crease between the head and body.",
    "Roll some black clay into a thick sheet.",
    "Clean your hands again, and knead some more black clay until it turns soft.",
    "Roll the clay into a thick, black sheet.",
    "Plan on making it twice as thick as the white sheet.",
    "This will eventually make the wings.",
    "Cut two wings out of the sheet.",
    "Start by cutting an oval out of the clay, a little bit shorter than the body.",
    "Cut the oval in half, lengthwise, so that you end up with two semi-ovals.",
    "You can use a craft blade to do this.",
    "Add the wings onto the penguin's body.",
    "Gently press the wings down onto the body to either side of the white belly.",
    "The flat edges of the wings should be facing the white belly.",
    "The tips of the wings should be nestled into the crease between the head and the body.",
    "Don't worry if the wings overlap the white belly a little.",
    "Consider flipping the bottom of the wings outwards for a cute touch.",
    "Make a beak.",
    "Clean your hands, and knead some orange clay.",
    "Roll the clay into a tiny teardrop or cone.",
    "Attach the beak.",
    "Press the bottom of the teardrop/cone into the middle of the penguin's face.",
    "Use a craft blade to cut the beak open after you attach it, if desired.",
    "This will give your penguin an open mouth instead of a closed one.",
    "Make the feet.",
    "Roll a small ball out of orange clay.",
    "Cut the ball in half using a craft blade.",
    "Cut two notches into each dome to make the feet.",
    "Attach the feet.",
    "Turn the penguin upside down.",
    "Pinch the back of both feet, then press them into the base of the body.",
    "Make sure that the front of the feet (the notched parts) stick out from under the body.",
    "Place the penguin right-side-up against the table, and adjust the feet, if needed.",
    "Consider inserting an eyehook.",
    "If you wish to turn this penguin into a charm, press a jewelry eyehook through the top of the head and into the body.",
    "If the hook is very long, trim it down first using a pair of wire cutters.",
    "Bake the penguin according to the manufacturer's baking times and temperatures.",
    "Turn on your oven, and let it reach the recommended temperature, usually between 215 to 325°F (102 to 163°C).",
    "Place the penguin on a foil-lined baking sheet, and bake it for the recommended time, typically 15 to 20 minutes.",
    "Each company will be a little different, so you will need to read the label on the clay's wrapper.",
    "If your penguin has a lot of fingerprints on it, gently brush it with a soft-bristled paintbrush before you bake it.",
    "Allow the penguin to cool before adding the eyes.",
    "Use a black permanent marker to draw two dots on the penguin's face, right above the beak.",
    "Position them in the loops of the \"heart\".",
    "You can also use a thin brush and acrylic paint.",
    "Glaze the penguin, if desired.",
    "If you wish to make the penguin shiny, get some glaze meant for polymer clay.",
    "Paint the penguin with the glaze, then let the glaze dry.",
    "Refer to the label on the bottle, as each brand's drying times will vary.",
    "Making a Penguin Charm Shape the body.",
    "Knead some polymer clay until it softens, then roll it into an oval.",
    "Flatten the oval with a glass so that you get a disk shape.",
    "Cut off one of the pointy ends of the oval, so that the penguin can stand upright.",
    "Penguins are typically black, but since you are making a cute penguin, you can make him or her any color you want!",
    "Pink, baby blue, or light purple would be especially cute!",
    "Roll some white clay into a thin sheet.",
    "Clean your hands first to avoid transferring color, then knead some white clay until it softens.",
    "Roll it into a thin sheet using an acrylic rolling pin.",
    "You can find it in the polymer clay aisle of an arts and crafts store.",
    "If you can't find an acrylic rolling pin, you can use another smooth cylinder, such as a fat marker or a rolling pin.",
    "Cut an \"m\" shape out of the sheet.",
    "This will make the body and face of your penguin.",
    "It needs to be the width as body, but a little shorter.",
    "Use a craft blade to cut the shape out.",
    "Press the white \"m\" onto body.",
    "Be sure to match up the base of the \"m\" with the base of the body.",
    "You will have a slight gap between the top of the \"m\" and the top of the body.",
    "Make a beak.",
    "Clean your hands, then knead some orange clay until it turns soft.",
    "Press it into a thin disk, then cut a small triangle out of it using a craft blade.",
    "Attach the beak.",
    "Press the triangle into the middle of the white part on the body.",
    "Make sure that the pointed tip of the triangle is pointing downward.",
    "Add some eyes.",
    "Roll two small balls out of black clay.",
    "Press each ball onto the penguin to either side of the beak.",
    "They should just barely be touching the upper corners of the bead.",
    "If you don't have any black clay, you can skip this step, and paint the eyes on instead after you are done baking.",
    "Insert an eyehook into the top of the penguin.",
    "Measure the eyehook against the penguin first.",
    "If it is too long, trim it down with a pair of wire cutters.",
    "Push the eyehook down through the top of the penguin.",
    "Bake the penguin.",
    "Preheat your oven to the temperature specified by the manufacturer, typically between 215 to 325°F (102 to 163°C).",
    "Place your penguin onto a foil-liked baking sheet.",
    "Bake the penguin for the time recommended by the manufacturer, typically 15 to 20 minutes.",
    "Each brand of clay will have different baking times and temperatures.",
    "Read the label on the clay's wrapper carefully.",
    "If the eyehook is still look, put a little superglue around the seam.",
    "Paint some feet onto the penguin once it cools.",
    "After the penguin is done baking, take it out of the oven and let it cool.",
    "Use a thin paintbrush and some orange, acrylic paint to add two small v's at the bottom of the penguin.",
    "If you don't have any paint at home, you can use an orange permanent marker instead.",
    "Glaze the penguin, if desired.",
    "Get some glaze meant for polymer clay.",
    "Thread some string through the eyehook and tie it into a loop.",
    "Dip the penguin into the glaze, then lift it out.",
    "Let the excess glaze drip off, then hang the penguin by the loop so that it can dry.",
    "Place a sheet of scrap paper under the penguin as it is drying to catch any excess glaze."
  ],
  "tyn_section":[
    "Black polymer clay",
    "White polymer clay",
    "Orange polymer clay",
    "Craft blade",
    "Acrylic rolling pin",
    "Oven",
    "Baking sheet",
    "Aluminum foil",
    "Black permanent marker or acrylic paint",
    "Polymer clay glaze (optional)",
    "Eyehook or eye pin (optional, for charm)",
    "Polymer clay, any color (for body)",
    "Orange acrylic paint",
    "Thin paintbrush"
  ],
  "tyn_model":[
    "clay",
    "black clay",
    "craft blade",
    "white clay",
    "polymer clay",
    "penguin",
    "acrylic rolling pin",
    "orange clay",
    "oven",
    "acrylic rolling pins",
    "fat marker",
    "wire cutters",
    "permanent marker",
    "clay sculpting tool",
    "arts and crafts store",
    "polymer clay cutters",
    "table",
    "jewelry eyehook",
    "baking sheet",
    "thin brush",
    "acrylic paint",
    "glaze",
    "glass",
    "penguins",
    "rolling pin",
    "superglue",
    "orange, acrylic paint",
    "paint",
    "scrap paper"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.1379310345,
    "f1":0.1860465116,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6428571429,
    "p":0.4482758621,
    "f1":0.5282167043
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7857142857,
    "p":0.5862068966,
    "f1":0.671454219
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.3448275862,
    "f1":0.4301075269
  }
}