{
  "title":"How to Ombre Dye Table Runners",
  "url":"https://www.wikihow.com/Ombre-Dye-Table-Runners",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Making the Dye Bath",
      "steps":[
        {
          "headline":"Fill each bucket with water.",
          "description":"If you are only dyeing one or two table runners, you can use two cups of water per bucket. If you are doing a large batch of linens, you can adjust the amount of water based on the instructions of your fabric dye. Heat the water in a kettle or microwave until it is at least 140 °F (60 °C)."
        },
        {
          "headline":"Prepare the dye.",
          "description":"If you are using powdered or liquid dye, you should read the instructions on the packaging to determine how to prepare it. In general, you will mix the dye with water, adding either salt or vinegar based on the type of fabric you will be using. You should make up to four cups of dye. Mix the dye in a separate bowl, pitcher, or large measuring cup. You should adjust the amount of dye for the vibrancy that you want in your table runner. Darker or brighter colors will need more dye. Lighter or pastel colors will need less dye. For cotton, rayon and linen fabrics, mix in one cup salt of salt. For silk and nylon fabrics, stir in one cup of white vinegar."
        },
        {
          "headline":"Add dye to each bucket.",
          "description":"Each bucket will have a different concentration of dye. For the first bucket, use ¼ cup of dye. For the second, use ½ cup of dye, and for the third, use one full cup of dye."
        },
        {
          "headline":"Test first.",
          "description":"Using a rag, scrap of fabric, or paper towel, test the color of each dye bucket. Dip the test strip into the bucket, rinse out excess dye, and let it dry. Remember that the color may change slightly when it dries, so it is good wait until the test strip has dried to see what color emerges. You can even practice getting the ombre effect. Dip the test strip in each bucket to see how the colors blend into one another. It is recommended that you wear gloves as you dip into the dye to protect your hands and any other surfaces that you touch."
        }
      ]
    },
    {
      "name":"Dip-Dyeing the Runner",
      "steps":[
        {
          "headline":"Dampen the runner.",
          "description":"Before you dye it, run the table runner under a faucet until the entire fabric is wet. Wring out excess water so that it is slightly damp. Fold the runner lengthwise. Roll the table runner widthwise until you have a compact roll. The hem of the runner should be on one side of the roll."
        },
        {
          "headline":"Dip one end into each bucket.",
          "description":"Starting with the first bucket (the bucket with the lowest concentration of dye), dip the hem side of the runner into the dye. Make sure that it is submerged a little less than two-thirds of the way up the rolled runner. Hold it there for a minute. Remove and dip it in the second bucket, submerging it above halfway up the roll. Hold it there longer than the first, about two minutes. For the last bucket, dip the fabric about one-third of the way up, holding it there for three minutes. The longer you hold the runner in the dye, the darker the color will be. If you want a very light shade, submerge it for less than a minute. If you want a very dark shade, hold it down for longer than three minutes."
        },
        {
          "headline":"Rinse out excess dye.",
          "description":"Once you have finished dyeing it, run the fabric under a cool, running faucet. Rinse out excess dye until the water runs clear. If there are any sharp lines or splatters in your fabric, you can use a damp paper towel to smooth them out."
        },
        {
          "headline":"Dry.",
          "description":"Hang the table runner to dry completely. Once dry, you should wash the table runner with color-safe detergent before you use it. Do not wash with other linens or clothing in case the dye runs. If you used machine-safe fabric dye, you can put it in a washing machine. If not, wash it by hand."
        }
      ]
    },
    {
      "name":"Dyeing with Two Colors",
      "steps":[
        {
          "headline":"Prepare two dye baths.",
          "description":"You only need two dye baths if you are using two colors. Make one bath for each color used, according to the instructions on the dye packet. Some color combinations that might work include:\nOrange and pink\nGreen and blue\nPurple and pink\nRed and yellow"
        },
        {
          "headline":"Roll but do not fold the runner.",
          "description":"Dampen the runner, and squeeze out extra water. Do not fold the runner as you would for a single color ombre effect. Instead, just roll it up from one end to the other. This will let you dye both sides of the table runner separately. The hem of the rolled table cloth should be visible on either side of the roll."
        },
        {
          "headline":"Dip one end into the first color.",
          "description":"Choose one color, and dip one end of the runner into the tablecloth, submerging it up to halfway up the table runner. Gently move the runner up and down the dye, but try not to get dye higher than the halfway mark. Rinse out excess dye. If you want a white strip in the middle, submerge the runner less than halfway up the runner. If you do not want a white strip, submerge the fabric up to the halfway mark."
        },
        {
          "headline":"Dye the other side.",
          "description":"Once you have rinsed the first color, reroll the runner. Dip the other side into the dye and submerge the fabric until you have reached the desired color. Rinse out excess dye, and hang to dry. If you want the two colors to blend together, dip the second color past the halfway mark. Test this first with a rag or scrap to make sure that that the dyes do not run brown when mixed together."
        }
      ]
    }
  ],
  "text":" Making the Dye Bath Fill each bucket with water. If you are only dyeing one or two table runners, you can use two cups of water per bucket. If you are doing a large batch of linens, you can adjust the amount of water based on the instructions of your fabric dye. Heat the water in a kettle or microwave until it is at least 140 °F (60 °C). Prepare the dye. If you are using powdered or liquid dye, you should read the instructions on the packaging to determine how to prepare it. In general, you will mix the dye with water, adding either salt or vinegar based on the type of fabric you will be using. You should make up to four cups of dye. Mix the dye in a separate bowl, pitcher, or large measuring cup. You should adjust the amount of dye for the vibrancy that you want in your table runner. Darker or brighter colors will need more dye. Lighter or pastel colors will need less dye. For cotton, rayon and linen fabrics, mix in one cup salt of salt. For silk and nylon fabrics, stir in one cup of white vinegar. Add dye to each bucket. Each bucket will have a different concentration of dye. For the first bucket, use ¼ cup of dye. For the second, use ½ cup of dye, and for the third, use one full cup of dye. Test first. Using a rag, scrap of fabric, or paper towel, test the color of each dye bucket. Dip the test strip into the bucket, rinse out excess dye, and let it dry. Remember that the color may change slightly when it dries, so it is good wait until the test strip has dried to see what color emerges. You can even practice getting the ombre effect. Dip the test strip in each bucket to see how the colors blend into one another. It is recommended that you wear gloves as you dip into the dye to protect your hands and any other surfaces that you touch. Dip-Dyeing the Runner Dampen the runner. Before you dye it, run the table runner under a faucet until the entire fabric is wet. Wring out excess water so that it is slightly damp. Fold the runner lengthwise. Roll the table runner widthwise until you have a compact roll. The hem of the runner should be on one side of the roll. Dip one end into each bucket. Starting with the first bucket (the bucket with the lowest concentration of dye), dip the hem side of the runner into the dye. Make sure that it is submerged a little less than two-thirds of the way up the rolled runner. Hold it there for a minute. Remove and dip it in the second bucket, submerging it above halfway up the roll. Hold it there longer than the first, about two minutes. For the last bucket, dip the fabric about one-third of the way up, holding it there for three minutes. The longer you hold the runner in the dye, the darker the color will be. If you want a very light shade, submerge it for less than a minute. If you want a very dark shade, hold it down for longer than three minutes. Rinse out excess dye. Once you have finished dyeing it, run the fabric under a cool, running faucet. Rinse out excess dye until the water runs clear. If there are any sharp lines or splatters in your fabric, you can use a damp paper towel to smooth them out. Dry. Hang the table runner to dry completely. Once dry, you should wash the table runner with color-safe detergent before you use it. Do not wash with other linens or clothing in case the dye runs. If you used machine-safe fabric dye, you can put it in a washing machine. If not, wash it by hand. Dyeing with Two Colors Prepare two dye baths. You only need two dye baths if you are using two colors. Make one bath for each color used, according to the instructions on the dye packet. Some color combinations that might work include:\nOrange and pink\nGreen and blue\nPurple and pink\nRed and yellow Roll but do not fold the runner. Dampen the runner, and squeeze out extra water. Do not fold the runner as you would for a single color ombre effect. Instead, just roll it up from one end to the other. This will let you dye both sides of the table runner separately. The hem of the rolled table cloth should be visible on either side of the roll. Dip one end into the first color. Choose one color, and dip one end of the runner into the tablecloth, submerging it up to halfway up the table runner. Gently move the runner up and down the dye, but try not to get dye higher than the halfway mark. Rinse out excess dye. If you want a white strip in the middle, submerge the runner less than halfway up the runner. If you do not want a white strip, submerge the fabric up to the halfway mark. Dye the other side. Once you have rinsed the first color, reroll the runner. Dip the other side into the dye and submerge the fabric until you have reached the desired color. Rinse out excess dye, and hang to dry. If you want the two colors to blend together, dip the second color past the halfway mark. Test this first with a rag or scrap to make sure that that the dyes do not run brown when mixed together.",
  "sentences":[
    " Making the Dye Bath Fill each bucket with water.",
    "If you are only dyeing one or two table runners, you can use two cups of water per bucket.",
    "If you are doing a large batch of linens, you can adjust the amount of water based on the instructions of your fabric dye.",
    "Heat the water in a kettle or microwave until it is at least 140 °F (60 °C).",
    "Prepare the dye.",
    "If you are using powdered or liquid dye, you should read the instructions on the packaging to determine how to prepare it.",
    "In general, you will mix the dye with water, adding either salt or vinegar based on the type of fabric you will be using.",
    "You should make up to four cups of dye.",
    "Mix the dye in a separate bowl, pitcher, or large measuring cup.",
    "You should adjust the amount of dye for the vibrancy that you want in your table runner.",
    "Darker or brighter colors will need more dye.",
    "Lighter or pastel colors will need less dye.",
    "For cotton, rayon and linen fabrics, mix in one cup salt of salt.",
    "For silk and nylon fabrics, stir in one cup of white vinegar.",
    "Add dye to each bucket.",
    "Each bucket will have a different concentration of dye.",
    "For the first bucket, use ¼ cup of dye.",
    "For the second, use ½ cup of dye, and for the third, use one full cup of dye.",
    "Test first.",
    "Using a rag, scrap of fabric, or paper towel, test the color of each dye bucket.",
    "Dip the test strip into the bucket, rinse out excess dye, and let it dry.",
    "Remember that the color may change slightly when it dries, so it is good wait until the test strip has dried to see what color emerges.",
    "You can even practice getting the ombre effect.",
    "Dip the test strip in each bucket to see how the colors blend into one another.",
    "It is recommended that you wear gloves as you dip into the dye to protect your hands and any other surfaces that you touch.",
    "Dip-Dyeing the Runner Dampen the runner.",
    "Before you dye it, run the table runner under a faucet until the entire fabric is wet.",
    "Wring out excess water so that it is slightly damp.",
    "Fold the runner lengthwise.",
    "Roll the table runner widthwise until you have a compact roll.",
    "The hem of the runner should be on one side of the roll.",
    "Dip one end into each bucket.",
    "Starting with the first bucket (the bucket with the lowest concentration of dye), dip the hem side of the runner into the dye.",
    "Make sure that it is submerged a little less than two-thirds of the way up the rolled runner.",
    "Hold it there for a minute.",
    "Remove and dip it in the second bucket, submerging it above halfway up the roll.",
    "Hold it there longer than the first, about two minutes.",
    "For the last bucket, dip the fabric about one-third of the way up, holding it there for three minutes.",
    "The longer you hold the runner in the dye, the darker the color will be.",
    "If you want a very light shade, submerge it for less than a minute.",
    "If you want a very dark shade, hold it down for longer than three minutes.",
    "Rinse out excess dye.",
    "Once you have finished dyeing it, run the fabric under a cool, running faucet.",
    "Rinse out excess dye until the water runs clear.",
    "If there are any sharp lines or splatters in your fabric, you can use a damp paper towel to smooth them out.",
    "Dry.",
    "Hang the table runner to dry completely.",
    "Once dry, you should wash the table runner with color-safe detergent before you use it.",
    "Do not wash with other linens or clothing in case the dye runs.",
    "If you used machine-safe fabric dye, you can put it in a washing machine.",
    "If not, wash it by hand.",
    "Dyeing with Two Colors Prepare two dye baths.",
    "You only need two dye baths if you are using two colors.",
    "Make one bath for each color used, according to the instructions on the dye packet.",
    "Some color combinations that might work include:\nOrange and pink\nGreen and blue\nPurple and pink\nRed and yellow Roll but do not fold the runner.",
    "Dampen the runner, and squeeze out extra water.",
    "Do not fold the runner as you would for a single color ombre effect.",
    "Instead, just roll it up from one end to the other.",
    "This will let you dye both sides of the table runner separately.",
    "The hem of the rolled table cloth should be visible on either side of the roll.",
    "Dip one end into the first color.",
    "Choose one color, and dip one end of the runner into the tablecloth, submerging it up to halfway up the table runner.",
    "Gently move the runner up and down the dye, but try not to get dye higher than the halfway mark.",
    "Rinse out excess dye.",
    "If you want a white strip in the middle, submerge the runner less than halfway up the runner.",
    "If you do not want a white strip, submerge the fabric up to the halfway mark.",
    "Dye the other side.",
    "Once you have rinsed the first color, reroll the runner.",
    "Dip the other side into the dye and submerge the fabric until you have reached the desired color.",
    "Rinse out excess dye, and hang to dry.",
    "If you want the two colors to blend together, dip the second color past the halfway mark.",
    "Test this first with a rag or scrap to make sure that that the dyes do not run brown when mixed together."
  ],
  "tyn_section":[
    "Undyed Table Runner",
    "Fabric dye",
    "Three buckets, dishpans, or pitchers",
    "Mixing bowl",
    "Water",
    "Gloves",
    "Salt",
    "Vinegar"
  ],
  "tyn_model":[
    "dye",
    "water",
    "table runner",
    "fabric",
    "runner",
    "salt",
    "fabric dye",
    "vinegar",
    "rag",
    "bucket",
    "kettle",
    "microwave",
    "bowl",
    "pitcher",
    "paper towel",
    "dip-dyeing the runner",
    "color-safe detergent",
    "table cloth",
    "tablecloth"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.2105263158,
    "f1":0.2962962963,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.4210526316,
    "f1":0.5393258427
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.4736842105,
    "f1":0.5806451613
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.2631578947,
    "f1":0.3703703704
  }
}