{
  "title":"How to Make Hazelnut Chocolate Bark",
  "url":"https://www.wikihow.com/Make-Hazelnut-Chocolate-Bark",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Making Chocolate"
  ],
  "parts":[
    {
      "name":"Whipping Up Chocolate Hazelnut Bark",
      "steps":[
        {
          "headline":"Line a baking sheet.",
          "description":"To make the chocolate hazelnut bark, you’ll need an 11-inch by 17-inch (28-cm by 43-cm) baking sheet. Place a piece of parchment paper on the baking sheet as a liner so you can easily remove the bark when it’s ready. Set the baking sheet aside. You can substitute a silicone baking mat for the parchment paper if you prefer."
        },
        {
          "headline":"Melt the chocolate in a double boiler.",
          "description":"Add 2 pounds (907 g) of the chocolate of your choice to a heatproof bowl, and place the bowl inside a saucepan with water that’s simmering on the stove at medium to medium-high. Heat the chocolate in the double boiler until it is melted and completely smooth. Stir the chocolate constantly to ensure that it heats evenly and doesn’t burn. Dark chocolate, bittersweet chocolate, semisweet chocolate, and milk chocolate will all work well for the bark."
        },
        {
          "headline":"Mix in the hazelnut extract and chocolate hazelnut spread.",
          "description":"Once the chocolate is completely melted, add ½ teaspoon (2 ½ ml) of hazelnut extract and ½ cup (150 g) of chocolate hazelnut spread. Stir well to ensure that all of the ingredients are fully blended, and remove the bowl from the heat. You can find hazelnut extract in the same aisle at the grocery store where the vanilla extract is sold."
        },
        {
          "headline":"Pour the mixture onto the baking sheet.",
          "description":"After all of the ingredients are combined, transfer the mixture to the prepared baking sheet. Use a spatula or spoon to spread it in an even layer across the sheet."
        },
        {
          "headline":"Add the chopped hazelnuts.",
          "description":"When the chocolate mixture is spread on the baking sheet, sprinkle 1 cup (90 g) of finely chopped hazelnuts over the top. Distribute the nuts as evenly as possible across the chocolate. If you’d like to give the bark a salty flavor, sprinkle some sea salt along with the nuts."
        },
        {
          "headline":"Chill the bark until it’s firm.",
          "description":"Once you’ve sprinkle the nuts over the chocolate, place the tray in the refrigerator. Allow the bark to chill until it is completely firm, which should take 25 to 30 minutes. If you want to cover the chocolate before you refrigerate it, tent some foil over it. If you use plastic wrap, it may fall into the chocolate and stick to it as it chills."
        },
        {
          "headline":"Break the bark into pieces.",
          "description":"When the chocolate hazelnut bark is firm, remove it from the refrigerator. Use clean hands or a butter knife to break the bark into pieces and serve. Store the bark in an airtight container in the refrigerator for up to a week."
        }
      ]
    },
    {
      "name":"Preparing Spicy Orange Hazelnut Chocolate Bark",
      "steps":[
        {
          "headline":"Line a baking sheet.",
          "description":"For the spicy orange hazelnut chocolate bark, you’ll need a large baking sheet. Cover it with a piece of parchment paper to keep the bark from sticking to it as it chills. A silicone baking mat also works well for lining the baking sheet."
        },
        {
          "headline":"Melt the chocolate in the microwave.",
          "description":"Add 8 ounces (227 g) of chopped bittersweet chocolate to a large microwave-safe bowl. Heat the chocolate in the microwave on high in 30 second intervals until it is completely melted. Be sure to stir it after each interval to help the chocolate melt evenly. You can melt the chocolate in a double boiler if you prefer."
        },
        {
          "headline":"Mix in the pepper, orange zest, and some of the nuts.",
          "description":"Once the chocolate is melted, add ¼ teaspoon (½ g) of cayenne pepper, 1 teaspoon (2 g) of finely grated orange zest, and ⅜ cup (68 g) of coarsely chopped toasted hazelnuts. Stir well to ensure that the ingredients are well blended. If you prefer to have the orange flavor without the spice, leave out the cayenne pepper."
        },
        {
          "headline":"Spread the chocolate mixture onto the baking sheet.",
          "description":"When the chocolate mixture is fully blended, transfer it to the prepared baking sheet. Use the back of a spoon or an offset spatula to spread it over the sheet in an even layer."
        },
        {
          "headline":"Add the rest of the nuts and the seat salt.",
          "description":"After the chocolate is spread over the baking sheet, sprinkle the remaining ⅛ cup (22 g) of coarsely chopped hazelnuts over the bark. Add some flaky sea salt to taste as well. You can omit the sea salt if you prefer."
        },
        {
          "headline":"Refrigerate the bark until it is firm.",
          "description":"Once you’ve added the hazelnuts and sea salt, put the baking sheet in the refrigerator. Allow the bark to chill until it is solid, which should take 15 to 20 minutes."
        },
        {
          "headline":"Smash the bark into pieces and serve.",
          "description":"With clean hands, break the bark into individual pieces. Place the bark on a platter or plate for serving. Store the bark in an airtight container at room temperature. It will stay fresh for 5 to 7 days."
        }
      ]
    },
    {
      "name":"Mixing Up Hazelnut Marble Chocolate Bark",
      "steps":[
        {
          "headline":"Line a cookie sheet.",
          "description":"For the hazelnut marble chocolate bark, you’ll need a large, rimmed cookie sheet. Set down a layer of waxed paper or foil to make it easier to remove the bark when it’s finished chilling. You can also use parchment paper or a silicone baking mat to line the cookie sheet."
        },
        {
          "headline":"Melt the white chocolate in the microwave.",
          "description":"Add 6 ounces (170 g) of white chocolate to a medium microwave-safe bowl. Place the bowl in the microwave, and heat on high for 30 seconds. Stir the chocolate well, and if necessary, heat for another 30 seconds to melt it completely. If the white chocolate still isn’t melted after 1 minute, continue heating it in 15 second increments until it’s completely smooth. Be sure to stir well after each increment."
        },
        {
          "headline":"Microwave the semisweet chocolate and melt it.",
          "description":"Add 6 ounces (170 g) of semisweet baking chocolate to another medium microwave-safe bowl. Place the bowl in the microwave, and heat on high for 30 seconds. Stir the chocolate well to see if it’s melted, and heat for another 30 seconds if necessary to melt it completely. As with the white chocolate, continue heating the semisweet chocolate in 15 second increments until it is melted completely. Stir well after each time that you heat it."
        },
        {
          "headline":"Mix some nuts into each bowl of chocolate.",
          "description":"Once both chocolates are completely melted, add ¼ cup (45 g) of finely chopped toasted hazelnuts to each bowl. Stir well to ensure that the nuts are thoroughly incorporated in each chocolate."
        },
        {
          "headline":"Spread the two chocolates in alternating rows on the cookie sheet.",
          "description":"After you’ve mixed in the nuts, use spoons to transfer the chocolates to the cookie sheet. Place the chocolates in alternating side by side rows until you use up all of the chocolate. Spread the chocolates evenly so it has a thickness of approximately ¼-inch (6-mm)."
        },
        {
          "headline":"Cut through both chocolates with a knife to create swirls.",
          "description":"Once the chocolates are arranged in alternating rows, take a knife or small metal spatula and swirl through both chocolates. The goal is to mix them slightly to create a marbled effect. You don’t need to be perfect when you cut through the chocolate. You can create as subtle or dramatic a marbled effect as you like."
        },
        {
          "headline":"Chill the mixture until it is firm.",
          "description":"After you’ve swirled through the chocolate, place the cookie sheet in the refrigerator. Chill it until it is firm, which should take approximately 1 hour."
        },
        {
          "headline":"Break the bark into pieces.",
          "description":"When the bark is solid, remove it from the refrigerator. Use a knife or clean hands to break it into smaller pieces and serve. Store the bark in an airtight container."
        }
      ]
    }
  ],
  "text":" Whipping Up Chocolate Hazelnut Bark Line a baking sheet. To make the chocolate hazelnut bark, you’ll need an 11-inch by 17-inch (28-cm by 43-cm) baking sheet. Place a piece of parchment paper on the baking sheet as a liner so you can easily remove the bark when it’s ready. Set the baking sheet aside. You can substitute a silicone baking mat for the parchment paper if you prefer. Melt the chocolate in a double boiler. Add 2 pounds (907 g) of the chocolate of your choice to a heatproof bowl, and place the bowl inside a saucepan with water that’s simmering on the stove at medium to medium-high. Heat the chocolate in the double boiler until it is melted and completely smooth. Stir the chocolate constantly to ensure that it heats evenly and doesn’t burn. Dark chocolate, bittersweet chocolate, semisweet chocolate, and milk chocolate will all work well for the bark. Mix in the hazelnut extract and chocolate hazelnut spread. Once the chocolate is completely melted, add ½ teaspoon (2 ½ ml) of hazelnut extract and ½ cup (150 g) of chocolate hazelnut spread. Stir well to ensure that all of the ingredients are fully blended, and remove the bowl from the heat. You can find hazelnut extract in the same aisle at the grocery store where the vanilla extract is sold. Pour the mixture onto the baking sheet. After all of the ingredients are combined, transfer the mixture to the prepared baking sheet. Use a spatula or spoon to spread it in an even layer across the sheet. Add the chopped hazelnuts. When the chocolate mixture is spread on the baking sheet, sprinkle 1 cup (90 g) of finely chopped hazelnuts over the top. Distribute the nuts as evenly as possible across the chocolate. If you’d like to give the bark a salty flavor, sprinkle some sea salt along with the nuts. Chill the bark until it’s firm. Once you’ve sprinkle the nuts over the chocolate, place the tray in the refrigerator. Allow the bark to chill until it is completely firm, which should take 25 to 30 minutes. If you want to cover the chocolate before you refrigerate it, tent some foil over it. If you use plastic wrap, it may fall into the chocolate and stick to it as it chills. Break the bark into pieces. When the chocolate hazelnut bark is firm, remove it from the refrigerator. Use clean hands or a butter knife to break the bark into pieces and serve. Store the bark in an airtight container in the refrigerator for up to a week. Preparing Spicy Orange Hazelnut Chocolate Bark Line a baking sheet. For the spicy orange hazelnut chocolate bark, you’ll need a large baking sheet. Cover it with a piece of parchment paper to keep the bark from sticking to it as it chills. A silicone baking mat also works well for lining the baking sheet. Melt the chocolate in the microwave. Add 8 ounces (227 g) of chopped bittersweet chocolate to a large microwave-safe bowl. Heat the chocolate in the microwave on high in 30 second intervals until it is completely melted. Be sure to stir it after each interval to help the chocolate melt evenly. You can melt the chocolate in a double boiler if you prefer. Mix in the pepper, orange zest, and some of the nuts. Once the chocolate is melted, add ¼ teaspoon (½ g) of cayenne pepper, 1 teaspoon (2 g) of finely grated orange zest, and ⅜ cup (68 g) of coarsely chopped toasted hazelnuts. Stir well to ensure that the ingredients are well blended. If you prefer to have the orange flavor without the spice, leave out the cayenne pepper. Spread the chocolate mixture onto the baking sheet. When the chocolate mixture is fully blended, transfer it to the prepared baking sheet. Use the back of a spoon or an offset spatula to spread it over the sheet in an even layer. Add the rest of the nuts and the seat salt. After the chocolate is spread over the baking sheet, sprinkle the remaining ⅛ cup (22 g) of coarsely chopped hazelnuts over the bark. Add some flaky sea salt to taste as well. You can omit the sea salt if you prefer. Refrigerate the bark until it is firm. Once you’ve added the hazelnuts and sea salt, put the baking sheet in the refrigerator. Allow the bark to chill until it is solid, which should take 15 to 20 minutes. Smash the bark into pieces and serve. With clean hands, break the bark into individual pieces. Place the bark on a platter or plate for serving. Store the bark in an airtight container at room temperature. It will stay fresh for 5 to 7 days. Mixing Up Hazelnut Marble Chocolate Bark Line a cookie sheet. For the hazelnut marble chocolate bark, you’ll need a large, rimmed cookie sheet. Set down a layer of waxed paper or foil to make it easier to remove the bark when it’s finished chilling. You can also use parchment paper or a silicone baking mat to line the cookie sheet. Melt the white chocolate in the microwave. Add 6 ounces (170 g) of white chocolate to a medium microwave-safe bowl. Place the bowl in the microwave, and heat on high for 30 seconds. Stir the chocolate well, and if necessary, heat for another 30 seconds to melt it completely. If the white chocolate still isn’t melted after 1 minute, continue heating it in 15 second increments until it’s completely smooth. Be sure to stir well after each increment. Microwave the semisweet chocolate and melt it. Add 6 ounces (170 g) of semisweet baking chocolate to another medium microwave-safe bowl. Place the bowl in the microwave, and heat on high for 30 seconds. Stir the chocolate well to see if it’s melted, and heat for another 30 seconds if necessary to melt it completely. As with the white chocolate, continue heating the semisweet chocolate in 15 second increments until it is melted completely. Stir well after each time that you heat it. Mix some nuts into each bowl of chocolate. Once both chocolates are completely melted, add ¼ cup (45 g) of finely chopped toasted hazelnuts to each bowl. Stir well to ensure that the nuts are thoroughly incorporated in each chocolate. Spread the two chocolates in alternating rows on the cookie sheet. After you’ve mixed in the nuts, use spoons to transfer the chocolates to the cookie sheet. Place the chocolates in alternating side by side rows until you use up all of the chocolate. Spread the chocolates evenly so it has a thickness of approximately ¼-inch (6-mm). Cut through both chocolates with a knife to create swirls. Once the chocolates are arranged in alternating rows, take a knife or small metal spatula and swirl through both chocolates. The goal is to mix them slightly to create a marbled effect. You don’t need to be perfect when you cut through the chocolate. You can create as subtle or dramatic a marbled effect as you like. Chill the mixture until it is firm. After you’ve swirled through the chocolate, place the cookie sheet in the refrigerator. Chill it until it is firm, which should take approximately 1 hour. Break the bark into pieces. When the bark is solid, remove it from the refrigerator. Use a knife or clean hands to break it into smaller pieces and serve. Store the bark in an airtight container.",
  "sentences":[
    " Whipping Up Chocolate Hazelnut Bark Line a baking sheet.",
    "To make the chocolate hazelnut bark, you’ll need an 11-inch by 17-inch (28-cm by 43-cm) baking sheet.",
    "Place a piece of parchment paper on the baking sheet as a liner so you can easily remove the bark when it’s ready.",
    "Set the baking sheet aside.",
    "You can substitute a silicone baking mat for the parchment paper if you prefer.",
    "Melt the chocolate in a double boiler.",
    "Add 2 pounds (907 g) of the chocolate of your choice to a heatproof bowl, and place the bowl inside a saucepan with water that’s simmering on the stove at medium to medium-high.",
    "Heat the chocolate in the double boiler until it is melted and completely smooth.",
    "Stir the chocolate constantly to ensure that it heats evenly and doesn’t burn.",
    "Dark chocolate, bittersweet chocolate, semisweet chocolate, and milk chocolate will all work well for the bark.",
    "Mix in the hazelnut extract and chocolate hazelnut spread.",
    "Once the chocolate is completely melted, add ½ teaspoon (2 ½ ml) of hazelnut extract and ½ cup (150 g) of chocolate hazelnut spread.",
    "Stir well to ensure that all of the ingredients are fully blended, and remove the bowl from the heat.",
    "You can find hazelnut extract in the same aisle at the grocery store where the vanilla extract is sold.",
    "Pour the mixture onto the baking sheet.",
    "After all of the ingredients are combined, transfer the mixture to the prepared baking sheet.",
    "Use a spatula or spoon to spread it in an even layer across the sheet.",
    "Add the chopped hazelnuts.",
    "When the chocolate mixture is spread on the baking sheet, sprinkle 1 cup (90 g) of finely chopped hazelnuts over the top.",
    "Distribute the nuts as evenly as possible across the chocolate.",
    "If you’d like to give the bark a salty flavor, sprinkle some sea salt along with the nuts.",
    "Chill the bark until it’s firm.",
    "Once you’ve sprinkle the nuts over the chocolate, place the tray in the refrigerator.",
    "Allow the bark to chill until it is completely firm, which should take 25 to 30 minutes.",
    "If you want to cover the chocolate before you refrigerate it, tent some foil over it.",
    "If you use plastic wrap, it may fall into the chocolate and stick to it as it chills.",
    "Break the bark into pieces.",
    "When the chocolate hazelnut bark is firm, remove it from the refrigerator.",
    "Use clean hands or a butter knife to break the bark into pieces and serve.",
    "Store the bark in an airtight container in the refrigerator for up to a week.",
    "Preparing Spicy Orange Hazelnut Chocolate Bark Line a baking sheet.",
    "For the spicy orange hazelnut chocolate bark, you’ll need a large baking sheet.",
    "Cover it with a piece of parchment paper to keep the bark from sticking to it as it chills.",
    "A silicone baking mat also works well for lining the baking sheet.",
    "Melt the chocolate in the microwave.",
    "Add 8 ounces (227 g) of chopped bittersweet chocolate to a large microwave-safe bowl.",
    "Heat the chocolate in the microwave on high in 30 second intervals until it is completely melted.",
    "Be sure to stir it after each interval to help the chocolate melt evenly.",
    "You can melt the chocolate in a double boiler if you prefer.",
    "Mix in the pepper, orange zest, and some of the nuts.",
    "Once the chocolate is melted, add ¼ teaspoon (½ g) of cayenne pepper, 1 teaspoon (2 g) of finely grated orange zest, and ⅜ cup (68 g) of coarsely chopped toasted hazelnuts.",
    "Stir well to ensure that the ingredients are well blended.",
    "If you prefer to have the orange flavor without the spice, leave out the cayenne pepper.",
    "Spread the chocolate mixture onto the baking sheet.",
    "When the chocolate mixture is fully blended, transfer it to the prepared baking sheet.",
    "Use the back of a spoon or an offset spatula to spread it over the sheet in an even layer.",
    "Add the rest of the nuts and the seat salt.",
    "After the chocolate is spread over the baking sheet, sprinkle the remaining ⅛ cup (22 g) of coarsely chopped hazelnuts over the bark.",
    "Add some flaky sea salt to taste as well.",
    "You can omit the sea salt if you prefer.",
    "Refrigerate the bark until it is firm.",
    "Once you’ve added the hazelnuts and sea salt, put the baking sheet in the refrigerator.",
    "Allow the bark to chill until it is solid, which should take 15 to 20 minutes.",
    "Smash the bark into pieces and serve.",
    "With clean hands, break the bark into individual pieces.",
    "Place the bark on a platter or plate for serving.",
    "Store the bark in an airtight container at room temperature.",
    "It will stay fresh for 5 to 7 days.",
    "Mixing Up Hazelnut Marble Chocolate Bark Line a cookie sheet.",
    "For the hazelnut marble chocolate bark, you’ll need a large, rimmed cookie sheet.",
    "Set down a layer of waxed paper or foil to make it easier to remove the bark when it’s finished chilling.",
    "You can also use parchment paper or a silicone baking mat to line the cookie sheet.",
    "Melt the white chocolate in the microwave.",
    "Add 6 ounces (170 g) of white chocolate to a medium microwave-safe bowl.",
    "Place the bowl in the microwave, and heat on high for 30 seconds.",
    "Stir the chocolate well, and if necessary, heat for another 30 seconds to melt it completely.",
    "If the white chocolate still isn’t melted after 1 minute, continue heating it in 15 second increments until it’s completely smooth.",
    "Be sure to stir well after each increment.",
    "Microwave the semisweet chocolate and melt it.",
    "Add 6 ounces (170 g) of semisweet baking chocolate to another medium microwave-safe bowl.",
    "Place the bowl in the microwave, and heat on high for 30 seconds.",
    "Stir the chocolate well to see if it’s melted, and heat for another 30 seconds if necessary to melt it completely.",
    "As with the white chocolate, continue heating the semisweet chocolate in 15 second increments until it is melted completely.",
    "Stir well after each time that you heat it.",
    "Mix some nuts into each bowl of chocolate.",
    "Once both chocolates are completely melted, add ¼ cup (45 g) of finely chopped toasted hazelnuts to each bowl.",
    "Stir well to ensure that the nuts are thoroughly incorporated in each chocolate.",
    "Spread the two chocolates in alternating rows on the cookie sheet.",
    "After you’ve mixed in the nuts, use spoons to transfer the chocolates to the cookie sheet.",
    "Place the chocolates in alternating side by side rows until you use up all of the chocolate.",
    "Spread the chocolates evenly so it has a thickness of approximately ¼-inch (6-mm).",
    "Cut through both chocolates with a knife to create swirls.",
    "Once the chocolates are arranged in alternating rows, take a knife or small metal spatula and swirl through both chocolates.",
    "The goal is to mix them slightly to create a marbled effect.",
    "You don’t need to be perfect when you cut through the chocolate.",
    "You can create as subtle or dramatic a marbled effect as you like.",
    "Chill the mixture until it is firm.",
    "After you’ve swirled through the chocolate, place the cookie sheet in the refrigerator.",
    "Chill it until it is firm, which should take approximately 1 hour.",
    "Break the bark into pieces.",
    "When the bark is solid, remove it from the refrigerator.",
    "Use a knife or clean hands to break it into smaller pieces and serve.",
    "Store the bark in an airtight container."
  ],
  "tyn_section":[
    "An 11-inch by 17-inch (28-cm by 43-cm) baking sheet.",
    "Parchment paper",
    "A saucepan",
    "A heat-proof bowl",
    "A wooden spoon",
    "A spatula",
    "A large baking sheet",
    "A large microwave-safe bowl",
    "A spoon",
    "A large rimmed baking sheet",
    "Wax paper or foil",
    "2 medium microwave-safe bowls",
    "2 spoons",
    "A knife"
  ],
  "tyn_model":[
    "chocolate",
    "baking sheet",
    "refrigerator",
    "microwave",
    "cookie sheet",
    "parchment paper",
    "hazelnuts",
    "sea salt",
    "double boiler",
    "hazelnut extract",
    "bowl",
    "nuts",
    "airtight container",
    "white chocolate",
    "knife",
    "chocolate hazelnut bark",
    "orange zest",
    "cayenne pepper",
    "toasted hazelnuts",
    "medium microwave-safe bowl",
    "heatproof bowl",
    "saucepan",
    "water",
    "milk chocolate",
    "chocolate hazelnut",
    "chocolate hazelnut spread",
    "vanilla extract",
    "spatula",
    "tray",
    "foil",
    "plastic wrap",
    "butter knife",
    "bittersweet chocolate",
    "microwave-safe bowl",
    "pepper",
    "⅜ cup",
    "spoon",
    "seat salt",
    "⅛ cup",
    "plate",
    "hazelnut marble chocolate",
    "waxed paper",
    "semisweet baking chocolate",
    "semisweet chocolate",
    "spoons",
    "small metal spatula"
  ],
  "simple_metrics":{
    "r":0.0714285714,
    "p":0.0217391304,
    "f1":0.0333333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.1739130435,
    "f1":0.2666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.2608695652,
    "f1":0.4
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0714285714,
    "p":0.0217391304,
    "f1":0.0333333333
  }
}