{
  "title":"How to Dye Paper",
  "url":"https://www.wikihow.com/Dye-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Papermaking",
    "Dyeing Paper"
  ],
  "methods":[
    {
      "name":"Using Fabric Dye",
      "steps":[
        {
          "headline":"Put on a pair of gloves and protect your work surface.",
          "description":"Pull on a pair of rubber, vinyl, plastic, or latex gloves. Cover your work surface with a cheap, plastic tablecloth or some newspapers. This will keep the dye from staining your hands and your work surface. If the dye spills, wipe it up immediately with rubbing alcohol. It might be a good idea to wear an apron or old clothes that you don't mind possibly staining."
        },
        {
          "headline":"Fill a jar with ½ to 1 cup (120 to 240 milliliters) of hot water.",
          "description":"The more water you use, the lighter your dye will be. It might be a better idea to start off with ½ cup (120 milliliters) first, do a test swatch, then add more water as needed."
        },
        {
          "headline":"Add 1 teaspoon of liquid dye or 2 teaspoons of powder dye.",
          "description":"Stir the solution with a spoon or skewer. If you are using liquid dye, shake the bottle first. Don't add salt or vinegar."
        },
        {
          "headline":"Pour the dye into a shallow tray.",
          "description":"The tray needs to be big enough to fit your paper. You can also use a baking dish or a rimmed baking sheet."
        },
        {
          "headline":"Dip the paper into dye.",
          "description":"Choose thick paper, such as watercolor paper or hardcover book pages. Set the paper into the tray, then press down on it with your hands so that it sinks into the dye. If you are working with expensive paper, consider doing a test swatch using a scrap instead."
        },
        {
          "headline":"Lift the paper out of the dye.",
          "description":"Allow the excess dye to drip off of the paper. Don't worry if the paper looks dark. It will lighten slightly as it dries."
        },
        {
          "headline":"Dry the paper between two sheets of paper towel.",
          "description":"Sandwich the dyed paper between two stacks of paper towels. Gently press down on the paper towels to absorb the excess dye."
        },
        {
          "headline":"Iron the paper dry.",
          "description":"Cover your ironing board with a thin cloth. Place the dyed paper on top of the cloth. Cover the paper with another cloth. Turn your iron to the lowest setting. Pass the iron over the paper. This will help keep the paper nice and flat as well."
        }
      ]
    },
    {
      "name":"Using Coffee or Tea",
      "steps":[
        {
          "headline":"Brew some strong coffee or tea.",
          "description":"Brew coffee in a coffee maker or tea in a large mug. You can also brew loose-leaf tea or tea bags for 10 minutes. If you are using loose-leaf tea, be sure to strain it through a fine, mesh sieve lined with muslin cloth. Black tea is the most common, but you can experiment with different types of tea as well, such as hibiscus. The coffee can be hot or cold."
        },
        {
          "headline":"Pour the coffee or tea into a large tray.",
          "description":"The tray needs to be big enough to fit your paper. You can also use a baking dish or a rimmed baking sheet instead."
        },
        {
          "headline":"Set the paper into the tray.",
          "description":"Press it down under the liquid with your hands. Tap it gently to get rid of air bubbles."
        },
        {
          "headline":"Allow the paper to soak for 5 to 10 minutes.",
          "description":"The longer you let the paper soak, the darker the color will be."
        },
        {
          "headline":"Lift the paper out.",
          "description":"Hold it over the tray so that the excess liquid can drip back. Do not wring the paper. You can crumple it later to create an aged effect."
        },
        {
          "headline":"Blot the paper.",
          "description":"Set the paper down on a stack of paper towels. Place another paper towel on top of it, and pat it gently to soak up any excess liquid. Keep patting the paper with clean paper towels until most of the liquid had been absorbed and the paper is damp."
        },
        {
          "headline":"Dry the paper.",
          "description":"You can dry the paper with a heat gun, a hair dryer, or an oven. The heat gun/hair dryer will give you a smoother finish. Begin by setting the paper down onto a baking sheet, then do one of the following:\nBlow dry the paper with a heat gun or hair dryer. Alternate between blotting the paper with a paper towel and flipping it over. Wipe the baking sheet down if it gets wet. Dry the paper in the oven at 200°F (94°C) for 5 to 10 minutes. Create an aged effect by crumpling the paper halfway through the drying process. Flatten the paper out, then dry it the rest of the way."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Using Fabric Dye Put on a pair of gloves and protect your work surface. Pull on a pair of rubber, vinyl, plastic, or latex gloves. Cover your work surface with a cheap, plastic tablecloth or some newspapers. This will keep the dye from staining your hands and your work surface. If the dye spills, wipe it up immediately with rubbing alcohol. It might be a good idea to wear an apron or old clothes that you don't mind possibly staining. Fill a jar with ½ to 1 cup (120 to 240 milliliters) of hot water. The more water you use, the lighter your dye will be. It might be a better idea to start off with ½ cup (120 milliliters) first, do a test swatch, then add more water as needed. Add 1 teaspoon of liquid dye or 2 teaspoons of powder dye. Stir the solution with a spoon or skewer. If you are using liquid dye, shake the bottle first. Don't add salt or vinegar. Pour the dye into a shallow tray. The tray needs to be big enough to fit your paper. You can also use a baking dish or a rimmed baking sheet. Dip the paper into dye. Choose thick paper, such as watercolor paper or hardcover book pages. Set the paper into the tray, then press down on it with your hands so that it sinks into the dye. If you are working with expensive paper, consider doing a test swatch using a scrap instead. Lift the paper out of the dye. Allow the excess dye to drip off of the paper. Don't worry if the paper looks dark. It will lighten slightly as it dries. Dry the paper between two sheets of paper towel. Sandwich the dyed paper between two stacks of paper towels. Gently press down on the paper towels to absorb the excess dye. Iron the paper dry. Cover your ironing board with a thin cloth. Place the dyed paper on top of the cloth. Cover the paper with another cloth. Turn your iron to the lowest setting. Pass the iron over the paper. This will help keep the paper nice and flat as well. Using Coffee or Tea Brew some strong coffee or tea. Brew coffee in a coffee maker or tea in a large mug. You can also brew loose-leaf tea or tea bags for 10 minutes. If you are using loose-leaf tea, be sure to strain it through a fine, mesh sieve lined with muslin cloth. Black tea is the most common, but you can experiment with different types of tea as well, such as hibiscus. The coffee can be hot or cold. Pour the coffee or tea into a large tray. The tray needs to be big enough to fit your paper. You can also use a baking dish or a rimmed baking sheet instead. Set the paper into the tray. Press it down under the liquid with your hands. Tap it gently to get rid of air bubbles. Allow the paper to soak for 5 to 10 minutes. The longer you let the paper soak, the darker the color will be. Lift the paper out. Hold it over the tray so that the excess liquid can drip back. Do not wring the paper. You can crumple it later to create an aged effect. Blot the paper. Set the paper down on a stack of paper towels. Place another paper towel on top of it, and pat it gently to soak up any excess liquid. Keep patting the paper with clean paper towels until most of the liquid had been absorbed and the paper is damp. Dry the paper. You can dry the paper with a heat gun, a hair dryer, or an oven. The heat gun/hair dryer will give you a smoother finish. Begin by setting the paper down onto a baking sheet, then do one of the following:\nBlow dry the paper with a heat gun or hair dryer. Alternate between blotting the paper with a paper towel and flipping it over. Wipe the baking sheet down if it gets wet. Dry the paper in the oven at 200°F (94°C) for 5 to 10 minutes. Create an aged effect by crumpling the paper halfway through the drying process. Flatten the paper out, then dry it the rest of the way. Finished. ",
  "sentences":[
    " Using Fabric Dye Put on a pair of gloves and protect your work surface.",
    "Pull on a pair of rubber, vinyl, plastic, or latex gloves.",
    "Cover your work surface with a cheap, plastic tablecloth or some newspapers.",
    "This will keep the dye from staining your hands and your work surface.",
    "If the dye spills, wipe it up immediately with rubbing alcohol.",
    "It might be a good idea to wear an apron or old clothes that you don't mind possibly staining.",
    "Fill a jar with ½ to 1 cup (120 to 240 milliliters) of hot water.",
    "The more water you use, the lighter your dye will be.",
    "It might be a better idea to start off with ½ cup (120 milliliters) first, do a test swatch, then add more water as needed.",
    "Add 1 teaspoon of liquid dye or 2 teaspoons of powder dye.",
    "Stir the solution with a spoon or skewer.",
    "If you are using liquid dye, shake the bottle first.",
    "Don't add salt or vinegar.",
    "Pour the dye into a shallow tray.",
    "The tray needs to be big enough to fit your paper.",
    "You can also use a baking dish or a rimmed baking sheet.",
    "Dip the paper into dye.",
    "Choose thick paper, such as watercolor paper or hardcover book pages.",
    "Set the paper into the tray, then press down on it with your hands so that it sinks into the dye.",
    "If you are working with expensive paper, consider doing a test swatch using a scrap instead.",
    "Lift the paper out of the dye.",
    "Allow the excess dye to drip off of the paper.",
    "Don't worry if the paper looks dark.",
    "It will lighten slightly as it dries.",
    "Dry the paper between two sheets of paper towel.",
    "Sandwich the dyed paper between two stacks of paper towels.",
    "Gently press down on the paper towels to absorb the excess dye.",
    "Iron the paper dry.",
    "Cover your ironing board with a thin cloth.",
    "Place the dyed paper on top of the cloth.",
    "Cover the paper with another cloth.",
    "Turn your iron to the lowest setting.",
    "Pass the iron over the paper.",
    "This will help keep the paper nice and flat as well.",
    "Using Coffee or Tea Brew some strong coffee or tea.",
    "Brew coffee in a coffee maker or tea in a large mug.",
    "You can also brew loose-leaf tea or tea bags for 10 minutes.",
    "If you are using loose-leaf tea, be sure to strain it through a fine, mesh sieve lined with muslin cloth.",
    "Black tea is the most common, but you can experiment with different types of tea as well, such as hibiscus.",
    "The coffee can be hot or cold.",
    "Pour the coffee or tea into a large tray.",
    "The tray needs to be big enough to fit your paper.",
    "You can also use a baking dish or a rimmed baking sheet instead.",
    "Set the paper into the tray.",
    "Press it down under the liquid with your hands.",
    "Tap it gently to get rid of air bubbles.",
    "Allow the paper to soak for 5 to 10 minutes.",
    "The longer you let the paper soak, the darker the color will be.",
    "Lift the paper out.",
    "Hold it over the tray so that the excess liquid can drip back.",
    "Do not wring the paper.",
    "You can crumple it later to create an aged effect.",
    "Blot the paper.",
    "Set the paper down on a stack of paper towels.",
    "Place another paper towel on top of it, and pat it gently to soak up any excess liquid.",
    "Keep patting the paper with clean paper towels until most of the liquid had been absorbed and the paper is damp.",
    "Dry the paper.",
    "You can dry the paper with a heat gun, a hair dryer, or an oven.",
    "The heat gun/hair dryer will give you a smoother finish.",
    "Begin by setting the paper down onto a baking sheet, then do one of the following:\nBlow dry the paper with a heat gun or hair dryer.",
    "Alternate between blotting the paper with a paper towel and flipping it over.",
    "Wipe the baking sheet down if it gets wet.",
    "Dry the paper in the oven at 200°F (94°C) for 5 to 10 minutes.",
    "Create an aged effect by crumpling the paper halfway through the drying process.",
    "Flatten the paper out, then dry it the rest of the way.",
    "Finished."
  ],
  "tyn_section":[
    "Paper",
    "Fabric dye",
    "½ to 1 cup (120 to 240 milliliters) water",
    "Jar",
    "Spoon",
    "Tray",
    "Paper towels",
    "Thin cloth",
    "Iron",
    "Plastic gloves",
    "Plastic tablecloth or newspaper",
    "Coffee or tea",
    "Water",
    "Baking sheet",
    "Oven, hair dryer, or heat gun"
  ],
  "tyn_model":[
    "paper",
    "baking sheet",
    "tray",
    "paper towels",
    "paper towel",
    "iron",
    "heat gun",
    "hair dryer",
    "water",
    "baking dish",
    "tea",
    "oven",
    "rubbing alcohol",
    "hot water",
    "liquid dye",
    "spoon",
    "vinegar",
    "dye",
    "ironing board",
    "coffee maker",
    "tea bags",
    "sieve",
    "muslin cloth",
    "coffee"
  ],
  "simple_metrics":{
    "r":0.4666666667,
    "p":0.2916666667,
    "f1":0.358974359,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5333333333,
    "p":0.4166666667,
    "f1":0.4678362573
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7333333333,
    "p":0.6666666667,
    "f1":0.6984126984
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4666666667,
    "p":0.2916666667,
    "f1":0.358974359
  }
}