{
  "title":"How to Make White Wine",
  "url":"https://www.wikihow.com/Make-White-Wine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "steps":[
    {
      "headline":"Sanitize all of your equipment.",
      "description":"Sanitizing every piece of equipment that will come in contact with your wine is crucial to reduce any off-flavors and harmful bacteria. There are many different sanitation methods, so you will just need to find which one makes the most sense for your case."
    },
    {
      "headline":"Pour the white grape juice into the 5 liter (1.3 US gal) bottle.",
      "description":"Put the lid on and shake the bottle."
    },
    {
      "headline":"Add the cup of sugar.",
      "description":"Put the lid on and shake the bottle."
    },
    {
      "headline":"Add the yeast and a small amount of sugar to a small amount of lukewarm water.",
      "description":""
    },
    {
      "headline":"When it starts foaming, add it straight to the bottle.",
      "description":""
    },
    {
      "headline":"Put on the lid and shake.",
      "description":"(It is important to move straight on to the next step after completing this)."
    },
    {
      "headline":"Remove the lid from the bottle.",
      "description":""
    },
    {
      "headline":"Put a few holes in the balloon with the pin.",
      "description":""
    },
    {
      "headline":"Stretch the balloon over the top of the bottle.",
      "description":""
    },
    {
      "headline":"Leave the fermentation bottle somewhere warm but out of direct sunlight.",
      "description":""
    },
    {
      "headline":"After 12 hours it will start fizzing.",
      "description":"If it doesn’t start fizzing, start again. This is the yeast at work. The gasses will be released through the holes in the balloon. When the balloon is no longer inflated (usually after about 2-3 weeks), move on to the next step."
    },
    {
      "headline":"Once the primary fermentation has stopped (after 2-3 weeks) the alcohol  content should be sufficient and can be bottled.",
      "description":"You should now have 5-6 bottles of wine with an alcohol content of 11-12%! You can vary and experiment with the recipe!"
    }
  ],
  "text":" Sanitize all of your equipment. Sanitizing every piece of equipment that will come in contact with your wine is crucial to reduce any off-flavors and harmful bacteria. There are many different sanitation methods, so you will just need to find which one makes the most sense for your case. Pour the white grape juice into the 5 liter (1.3 US gal) bottle. Put the lid on and shake the bottle. Add the cup of sugar. Put the lid on and shake the bottle. Add the yeast and a small amount of sugar to a small amount of lukewarm water.  When it starts foaming, add it straight to the bottle.  Put on the lid and shake. (It is important to move straight on to the next step after completing this). Remove the lid from the bottle.  Put a few holes in the balloon with the pin.  Stretch the balloon over the top of the bottle.  Leave the fermentation bottle somewhere warm but out of direct sunlight.  After 12 hours it will start fizzing. If it doesn’t start fizzing, start again. This is the yeast at work. The gasses will be released through the holes in the balloon. When the balloon is no longer inflated (usually after about 2-3 weeks), move on to the next step. Once the primary fermentation has stopped (after 2-3 weeks) the alcohol  content should be sufficient and can be bottled. You should now have 5-6 bottles of wine with an alcohol content of 11-12%! You can vary and experiment with the recipe!",
  "sentences":[
    " Sanitize all of your equipment.",
    "Sanitizing every piece of equipment that will come in contact with your wine is crucial to reduce any off-flavors and harmful bacteria.",
    "There are many different sanitation methods, so you will just need to find which one makes the most sense for your case.",
    "Pour the white grape juice into the 5 liter (1.3 US gal) bottle.",
    "Put the lid on and shake the bottle.",
    "Add the cup of sugar.",
    "Put the lid on and shake the bottle.",
    "Add the yeast and a small amount of sugar to a small amount of lukewarm water.",
    "When it starts foaming, add it straight to the bottle.",
    "Put on the lid and shake.",
    "(It is important to move straight on to the next step after completing this).",
    "Remove the lid from the bottle.",
    "Put a few holes in the balloon with the pin.",
    "Stretch the balloon over the top of the bottle.",
    "Leave the fermentation bottle somewhere warm but out of direct sunlight.",
    "After 12 hours it will start fizzing.",
    "If it doesn’t start fizzing, start again.",
    "This is the yeast at work.",
    "The gasses will be released through the holes in the balloon.",
    "When the balloon is no longer inflated (usually after about 2-3 weeks), move on to the next step.",
    "Once the primary fermentation has stopped (after 2-3 weeks) the alcohol  content should be sufficient and can be bottled.",
    "You should now have 5-6 bottles of wine with an alcohol content of 11-12%!",
    "You can vary and experiment with the recipe!"
  ],
  "tyn_section":[
    "5 liters (1.3 US gal) of white grape juice",
    "A cup of sugar",
    "Baker’s Yeast (7 gram Sachet)",
    "A 5 liter (1.3 US gal) Bottle",
    "A Balloon",
    "A Pin"
  ],
  "tyn_model":[
    "balloon",
    "wine",
    "sugar",
    "yeast",
    "bottle",
    "white grape juice",
    "water",
    "fermentation bottle"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.1666666667,
    "p":0.125,
    "f1":0.1428571429
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.25,
    "f1":0.2857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}