{
  "title":"How to Add Algae to Your Diet",
  "url":"https://www.wikihow.com/Add-Algae-to-Your-Diet",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Supplementing Your Diet with Algae",
      "steps":[
        {
          "headline":"Use caution with spirulina supplements.",
          "description":"While spirulina is being touted by some as a \"miracle\" food, the National Institutes of Health (NIH) has not found enough scientific evidence to prove that spirulina is effective in treating any health condition. And though spirulina contains many essential nutrients (calcium, niacin, potassium, magnesium, B vitamins, iron, essential amino acids) it is not known how much of the nutrient your body can actually absorb from spirulina. Spirulina is probably safe for most healthy adults, but if contaminated, it can cause liver damage, nausea, vomiting, thirst, weakness, rapid heartbeat, shock and even death. Carefully research the source of any supplements to ensure they are tested for toxins and are grown in safe conditions. Speak with your doctor, registered dietitian, and/or pharmacist before trying spirulina. Get advice on dosing from your doctor, as there has not been enough testing to establish a safe dose range. People with multiple sclerosis (MS), lupus (systemic lupus erythematosus, SLE), rheumatoid arthritis, and other autoimmune conditions should not take spirulina. Do not give spirulina to children. Pregnant or breastfeeding women should avoid spirulina. Note that the FDA does not regulate supplements for content, labeling, or safety. Look for products that have been tested by an outside source, such as USP or NSF."
        },
        {
          "headline":"Consider chlorella supplements.",
          "description":"This fresh-water algae is thought to help with a multitude of conditions, from preventing cancer to treating skin ulcers. It contains protein, fats, carbohydrates, fiber, chlorophyll, vitamins, and minerals. The quality of the product can vary wildly, so it is important that you thoroughly research the source of the supplement before purchasing. Speak with your doctor, registered dietitian, and/or pharmacist before trying chlorella. An  appropriate range of doses for chlorella has not yet been established, so consult with your doctor about how much to take. People with multiple sclerosis (MS), lupus (systemic lupus erythematosus, SLE), rheumatoid arthritis, and other autoimmune conditions should not take chlorella. Do not give chlorella to children. Pregnant or breastfeeding women should avoid chlorella. You can find chlorella supplements in tablet or capsule form. Chlorella supplements can be purchased at most health food stores or online health retailers. Note that the FDA does not regulate supplements for content, labeling, or safety. Look for products that have been tested by an outside source, such as USP or NSF and ask your pharmacist to recommend a reputable brand."
        },
        {
          "headline":"Add algae to your recipes.",
          "description":"You may be able to purchase spirulina powder at your local health food store or online. Likewise, you can find nori seaweed and even kelp at many health food and grocery stores. Try picking up some spirulina powder, kelp and nori and experiment with adding these various algae to your recipes. Add nori to a salad. Simply shred up the algae and add it to a salad recipe. It will add a hint of saltiness to your recipe, so you may not need to add salt to the dressing. Add some kelp or spirulina powder in a smoothie. You may want to also add lemon juice or another citrus flavor with the algae powders because of the strong taste of algae. Experiment with a small amount such as half a teaspoon and work your way up to larger amounts as you become comfortable with the flavor of algae. Sprinkle spirulina on air-popped popcorn for a high-fiber, low-calorie snack. Remember to consult with your doctor before using spirulina."
        }
      ]
    },
    {
      "name":"Putting Algae in Your Breakfast",
      "steps":[
        {
          "headline":"Make spinach and spirulina pancakes.",
          "description":"Put the ingredients in a blender or food processor and thoroughly blend for a few minutes. Heat up a griddle or pan. Add butter or oil to the pan. Use a ladle to put a small portion on the griddle and cook on each side for a minute or two. Serve the pancakes with either Agave syrup or, for a savory option, a spoonful of hummus."
        },
        {
          "headline":"Mix a spirulina green machine smoothie.",
          "description":"Put all of the ingredients in a blender. Turn the blender on the high setting. Blend for thirty to sixty seconds. You will know it is done when it looks smooth, without any chunks. Serve alongside the rest of your breakfast, such as yogurt and granola or spinach and spirulina pancakes."
        },
        {
          "headline":"Blend a spirulina smoothie with strawberry and banana.",
          "description":"Put all of the ingredients in your blender. Put the blender on high for thirty to sixty seconds. When the smoothie looks smooth, without any remaining chunks, you know it is done."
        }
      ]
    },
    {
      "name":"Using Algae in Lunch and Dinner Recipes",
      "steps":[
        {
          "headline":"Serve a spirulina, purple kale and spinach salad.",
          "description":"In a small bowl, add the celery, lemon juice, garlic, olive oil, pepper and salt. Whisk the dressing until it looks adequately mixed. In another bowl, add the kale, lettuce, spinach, alfalfa sprouts, yellow and orange bell pepper, prunes, spirulina, sunflower seeds, chlorella, and maca powder. Mix all of the greens together. Finally, pour the dressing over the salad and serve. When you mix the salad dressing with the salad and spirulina powder, the powder will get mixed into the dressing and add a bit of a green color to the salad."
        },
        {
          "headline":"Make spirulina and roasted garlic green hummus.",
          "description":"In a blender or food processor, add the chickpeas, olive oil, lemon juice, tahini, spirulina, garlic, chipotle chile powder and salt. Blend the ingredients together until you get a smooth consistency. If the mixture looks too thick, you can add some more lemon juice or a bit of water until it has the desired consistency. Serve the hummus with small strips of pita bread, carrots, broccoli or other fresh vegetables."
        },
        {
          "headline":"Enjoy a bowl of miso soup.",
          "description":"Cut up the nori into rectangles that will fit into your bowl. Add the water to a saucepan and bring it to a simmer. Add the nori and simmer it for five minutes. In a small bowl, add the miso and a couple tablespoons of hot water. Mix the nori and the hot water, then add it to the saucepan. Add the rest of the ingredients and cook for five minutes. Serve the soup warm."
        },
        {
          "headline":"Prepare sushi.",
          "description":"In a rice cooker or on the stovetop, make the rice. Mix the rice vinegar, salt and sugar in a small bowl and then add it to the cooked rice. Place the sheets of nori on a baking sheet. Preheat the oven to 300 °F (150 °C). Bake the nori for one or two minutes to warm it up."
        },
        {
          "headline":"Make sushi.",
          "description":"Place one sheet of nori on a bamboo sushi mat. Spread a thin layer of rice on top of the sushi. Then, add one quarter of all of the vegetables and the crab meat. The ingredients should be on the center of the rice. Lifting one end of the mat, roll the nori up to create a sushi roll. Repeat the process with the other sheets of nori. Cut the rolls into bite-size pieces and then serve. Serve sushi with miso soup."
        }
      ]
    }
  ],
  "text":" Supplementing Your Diet with Algae Use caution with spirulina supplements. While spirulina is being touted by some as a \"miracle\" food, the National Institutes of Health (NIH) has not found enough scientific evidence to prove that spirulina is effective in treating any health condition. And though spirulina contains many essential nutrients (calcium, niacin, potassium, magnesium, B vitamins, iron, essential amino acids) it is not known how much of the nutrient your body can actually absorb from spirulina. Spirulina is probably safe for most healthy adults, but if contaminated, it can cause liver damage, nausea, vomiting, thirst, weakness, rapid heartbeat, shock and even death. Carefully research the source of any supplements to ensure they are tested for toxins and are grown in safe conditions. Speak with your doctor, registered dietitian, and/or pharmacist before trying spirulina. Get advice on dosing from your doctor, as there has not been enough testing to establish a safe dose range. People with multiple sclerosis (MS), lupus (systemic lupus erythematosus, SLE), rheumatoid arthritis, and other autoimmune conditions should not take spirulina. Do not give spirulina to children. Pregnant or breastfeeding women should avoid spirulina. Note that the FDA does not regulate supplements for content, labeling, or safety. Look for products that have been tested by an outside source, such as USP or NSF. Consider chlorella supplements. This fresh-water algae is thought to help with a multitude of conditions, from preventing cancer to treating skin ulcers. It contains protein, fats, carbohydrates, fiber, chlorophyll, vitamins, and minerals. The quality of the product can vary wildly, so it is important that you thoroughly research the source of the supplement before purchasing. Speak with your doctor, registered dietitian, and/or pharmacist before trying chlorella. An  appropriate range of doses for chlorella has not yet been established, so consult with your doctor about how much to take. People with multiple sclerosis (MS), lupus (systemic lupus erythematosus, SLE), rheumatoid arthritis, and other autoimmune conditions should not take chlorella. Do not give chlorella to children. Pregnant or breastfeeding women should avoid chlorella. You can find chlorella supplements in tablet or capsule form. Chlorella supplements can be purchased at most health food stores or online health retailers. Note that the FDA does not regulate supplements for content, labeling, or safety. Look for products that have been tested by an outside source, such as USP or NSF and ask your pharmacist to recommend a reputable brand. Add algae to your recipes. You may be able to purchase spirulina powder at your local health food store or online. Likewise, you can find nori seaweed and even kelp at many health food and grocery stores. Try picking up some spirulina powder, kelp and nori and experiment with adding these various algae to your recipes. Add nori to a salad. Simply shred up the algae and add it to a salad recipe. It will add a hint of saltiness to your recipe, so you may not need to add salt to the dressing. Add some kelp or spirulina powder in a smoothie. You may want to also add lemon juice or another citrus flavor with the algae powders because of the strong taste of algae. Experiment with a small amount such as half a teaspoon and work your way up to larger amounts as you become comfortable with the flavor of algae. Sprinkle spirulina on air-popped popcorn for a high-fiber, low-calorie snack. Remember to consult with your doctor before using spirulina. Putting Algae in Your Breakfast Make spinach and spirulina pancakes. Put the ingredients in a blender or food processor and thoroughly blend for a few minutes. Heat up a griddle or pan. Add butter or oil to the pan. Use a ladle to put a small portion on the griddle and cook on each side for a minute or two. Serve the pancakes with either Agave syrup or, for a savory option, a spoonful of hummus. Mix a spirulina green machine smoothie. Put all of the ingredients in a blender. Turn the blender on the high setting. Blend for thirty to sixty seconds. You will know it is done when it looks smooth, without any chunks. Serve alongside the rest of your breakfast, such as yogurt and granola or spinach and spirulina pancakes. Blend a spirulina smoothie with strawberry and banana. Put all of the ingredients in your blender. Put the blender on high for thirty to sixty seconds. When the smoothie looks smooth, without any remaining chunks, you know it is done. Using Algae in Lunch and Dinner Recipes Serve a spirulina, purple kale and spinach salad. In a small bowl, add the celery, lemon juice, garlic, olive oil, pepper and salt. Whisk the dressing until it looks adequately mixed. In another bowl, add the kale, lettuce, spinach, alfalfa sprouts, yellow and orange bell pepper, prunes, spirulina, sunflower seeds, chlorella, and maca powder. Mix all of the greens together. Finally, pour the dressing over the salad and serve. When you mix the salad dressing with the salad and spirulina powder, the powder will get mixed into the dressing and add a bit of a green color to the salad. Make spirulina and roasted garlic green hummus. In a blender or food processor, add the chickpeas, olive oil, lemon juice, tahini, spirulina, garlic, chipotle chile powder and salt. Blend the ingredients together until you get a smooth consistency. If the mixture looks too thick, you can add some more lemon juice or a bit of water until it has the desired consistency. Serve the hummus with small strips of pita bread, carrots, broccoli or other fresh vegetables. Enjoy a bowl of miso soup. Cut up the nori into rectangles that will fit into your bowl. Add the water to a saucepan and bring it to a simmer. Add the nori and simmer it for five minutes. In a small bowl, add the miso and a couple tablespoons of hot water. Mix the nori and the hot water, then add it to the saucepan. Add the rest of the ingredients and cook for five minutes. Serve the soup warm. Prepare sushi. In a rice cooker or on the stovetop, make the rice. Mix the rice vinegar, salt and sugar in a small bowl and then add it to the cooked rice. Place the sheets of nori on a baking sheet. Preheat the oven to 300 °F (150 °C). Bake the nori for one or two minutes to warm it up. Make sushi. Place one sheet of nori on a bamboo sushi mat. Spread a thin layer of rice on top of the sushi. Then, add one quarter of all of the vegetables and the crab meat. The ingredients should be on the center of the rice. Lifting one end of the mat, roll the nori up to create a sushi roll. Repeat the process with the other sheets of nori. Cut the rolls into bite-size pieces and then serve. Serve sushi with miso soup.",
  "sentences":[
    " Supplementing Your Diet with Algae Use caution with spirulina supplements.",
    "While spirulina is being touted by some as a \"miracle\" food, the National Institutes of Health (NIH) has not found enough scientific evidence to prove that spirulina is effective in treating any health condition.",
    "And though spirulina contains many essential nutrients (calcium, niacin, potassium, magnesium, B vitamins, iron, essential amino acids) it is not known how much of the nutrient your body can actually absorb from spirulina.",
    "Spirulina is probably safe for most healthy adults, but if contaminated, it can cause liver damage, nausea, vomiting, thirst, weakness, rapid heartbeat, shock and even death.",
    "Carefully research the source of any supplements to ensure they are tested for toxins and are grown in safe conditions.",
    "Speak with your doctor, registered dietitian, and/or pharmacist before trying spirulina.",
    "Get advice on dosing from your doctor, as there has not been enough testing to establish a safe dose range.",
    "People with multiple sclerosis (MS), lupus (systemic lupus erythematosus, SLE), rheumatoid arthritis, and other autoimmune conditions should not take spirulina.",
    "Do not give spirulina to children.",
    "Pregnant or breastfeeding women should avoid spirulina.",
    "Note that the FDA does not regulate supplements for content, labeling, or safety.",
    "Look for products that have been tested by an outside source, such as USP or NSF.",
    "Consider chlorella supplements.",
    "This fresh-water algae is thought to help with a multitude of conditions, from preventing cancer to treating skin ulcers.",
    "It contains protein, fats, carbohydrates, fiber, chlorophyll, vitamins, and minerals.",
    "The quality of the product can vary wildly, so it is important that you thoroughly research the source of the supplement before purchasing.",
    "Speak with your doctor, registered dietitian, and/or pharmacist before trying chlorella.",
    "An  appropriate range of doses for chlorella has not yet been established, so consult with your doctor about how much to take.",
    "People with multiple sclerosis (MS), lupus (systemic lupus erythematosus, SLE), rheumatoid arthritis, and other autoimmune conditions should not take chlorella.",
    "Do not give chlorella to children.",
    "Pregnant or breastfeeding women should avoid chlorella.",
    "You can find chlorella supplements in tablet or capsule form.",
    "Chlorella supplements can be purchased at most health food stores or online health retailers.",
    "Note that the FDA does not regulate supplements for content, labeling, or safety.",
    "Look for products that have been tested by an outside source, such as USP or NSF and ask your pharmacist to recommend a reputable brand.",
    "Add algae to your recipes.",
    "You may be able to purchase spirulina powder at your local health food store or online.",
    "Likewise, you can find nori seaweed and even kelp at many health food and grocery stores.",
    "Try picking up some spirulina powder, kelp and nori and experiment with adding these various algae to your recipes.",
    "Add nori to a salad.",
    "Simply shred up the algae and add it to a salad recipe.",
    "It will add a hint of saltiness to your recipe, so you may not need to add salt to the dressing.",
    "Add some kelp or spirulina powder in a smoothie.",
    "You may want to also add lemon juice or another citrus flavor with the algae powders because of the strong taste of algae.",
    "Experiment with a small amount such as half a teaspoon and work your way up to larger amounts as you become comfortable with the flavor of algae.",
    "Sprinkle spirulina on air-popped popcorn for a high-fiber, low-calorie snack.",
    "Remember to consult with your doctor before using spirulina.",
    "Putting Algae in Your Breakfast Make spinach and spirulina pancakes.",
    "Put the ingredients in a blender or food processor and thoroughly blend for a few minutes.",
    "Heat up a griddle or pan.",
    "Add butter or oil to the pan.",
    "Use a ladle to put a small portion on the griddle and cook on each side for a minute or two.",
    "Serve the pancakes with either Agave syrup or, for a savory option, a spoonful of hummus.",
    "Mix a spirulina green machine smoothie.",
    "Put all of the ingredients in a blender.",
    "Turn the blender on the high setting.",
    "Blend for thirty to sixty seconds.",
    "You will know it is done when it looks smooth, without any chunks.",
    "Serve alongside the rest of your breakfast, such as yogurt and granola or spinach and spirulina pancakes.",
    "Blend a spirulina smoothie with strawberry and banana.",
    "Put all of the ingredients in your blender.",
    "Put the blender on high for thirty to sixty seconds.",
    "When the smoothie looks smooth, without any remaining chunks, you know it is done.",
    "Using Algae in Lunch and Dinner Recipes Serve a spirulina, purple kale and spinach salad.",
    "In a small bowl, add the celery, lemon juice, garlic, olive oil, pepper and salt.",
    "Whisk the dressing until it looks adequately mixed.",
    "In another bowl, add the kale, lettuce, spinach, alfalfa sprouts, yellow and orange bell pepper, prunes, spirulina, sunflower seeds, chlorella, and maca powder.",
    "Mix all of the greens together.",
    "Finally, pour the dressing over the salad and serve.",
    "When you mix the salad dressing with the salad and spirulina powder, the powder will get mixed into the dressing and add a bit of a green color to the salad.",
    "Make spirulina and roasted garlic green hummus.",
    "In a blender or food processor, add the chickpeas, olive oil, lemon juice, tahini, spirulina, garlic, chipotle chile powder and salt.",
    "Blend the ingredients together until you get a smooth consistency.",
    "If the mixture looks too thick, you can add some more lemon juice or a bit of water until it has the desired consistency.",
    "Serve the hummus with small strips of pita bread, carrots, broccoli or other fresh vegetables.",
    "Enjoy a bowl of miso soup.",
    "Cut up the nori into rectangles that will fit into your bowl.",
    "Add the water to a saucepan and bring it to a simmer.",
    "Add the nori and simmer it for five minutes.",
    "In a small bowl, add the miso and a couple tablespoons of hot water.",
    "Mix the nori and the hot water, then add it to the saucepan.",
    "Add the rest of the ingredients and cook for five minutes.",
    "Serve the soup warm.",
    "Prepare sushi.",
    "In a rice cooker or on the stovetop, make the rice.",
    "Mix the rice vinegar, salt and sugar in a small bowl and then add it to the cooked rice.",
    "Place the sheets of nori on a baking sheet.",
    "Preheat the oven to 300 °F (150 °C).",
    "Bake the nori for one or two minutes to warm it up.",
    "Make sushi.",
    "Place one sheet of nori on a bamboo sushi mat.",
    "Spread a thin layer of rice on top of the sushi.",
    "Then, add one quarter of all of the vegetables and the crab meat.",
    "The ingredients should be on the center of the rice.",
    "Lifting one end of the mat, roll the nori up to create a sushi roll.",
    "Repeat the process with the other sheets of nori.",
    "Cut the rolls into bite-size pieces and then serve.",
    "Serve sushi with miso soup."
  ],
  "tyn_section":[
    "Bamboo sushi mat",
    "Ladle",
    "Saucepan",
    "Blender or food processor"
  ],
  "tyn_model":[
    "spirulina",
    "chlorella",
    "nori",
    "blender",
    "algae",
    "spirulina powder",
    "salt",
    "lemon juice",
    "supplements",
    "spinach",
    "kelp",
    "spirulina pancakes",
    "food processor",
    "garlic",
    "olive oil",
    "pepper",
    "water",
    "miso soup",
    "saucepan",
    "hot water",
    "rice",
    "spirulina supplements",
    "potassium",
    "magnesium",
    "fresh-water algae",
    "vitamins",
    "chlorella supplements",
    "nori seaweed",
    "kelp or",
    "algae powders",
    "griddle or pan",
    "butter",
    "oil",
    "griddle",
    "agave syrup",
    "hummus",
    "spirulina green machine smoothie",
    "yogurt",
    "granola",
    "spirulina smoothie",
    "strawberry",
    "banana",
    "spirulina,",
    "purple kale",
    "celery",
    "dressing",
    "kale",
    "lettuce",
    "alfalfa sprouts",
    "prunes",
    "sunflower seeds",
    "maca powder",
    "salad dressing",
    "salad",
    "spirulina and roasted garlic",
    "chickpeas",
    "tahini",
    "chipotle chile powder",
    "carrots",
    "small bowl",
    "miso",
    "rice cooker",
    "rice vinegar",
    "sugar",
    "baking sheet",
    "oven",
    "bamboo sushi mat",
    "vegetables",
    "crab meat"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.0289855072,
    "f1":0.0547945205,
    "avg_pos":0.9565217391
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.0434782609,
    "f1":0.0821917808
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.0434782609,
    "f1":0.0821917808
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0289855072,
    "f1":0.0547945205
  }
}