{
  "title":"How to Make Marbled Doughnuts",
  "url":"https://www.wikihow.com/Make-Marbled-Doughnuts",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Donuts and Doughnuts"
  ],
  "methods":[
    {
      "name":"Making Marble Glazed Doughnuts",
      "steps":[
        {
          "headline":"Have some doughnuts ready.",
          "description":"You can make some using your favorite recipe, or you can buy some unglazed doughnuts from the bakery. You could even use mini doughnuts for a cute treat! This recipe makes enough to cover about 12, regular-sized doughnuts."
        },
        {
          "headline":"Sift the icing sugar into a large mixing bowl.",
          "description":"Sifting the sugar first will help reduce any lumps or clumps. It might be a good idea to have a few cups of extra sugar on hand, in case the icing is too thin."
        },
        {
          "headline":"Stir in some milk with a whisk.",
          "description":"Start with 3 tablespoons (45 milliliters). Keep stirring until everything is smooth and no lumps remain. The icing should have a syrup-like consistency. If the icing is too thick, add another tablespoon (15 milliliters) of milk. If the icing is too thin, add more icing sugar, 1 tablespoon (7.5 grams) at a time. Whisk well after each addition. For more flavor, add 2 teaspoons of vanilla extract. For a lighter icing, use water instead of milk."
        },
        {
          "headline":"Add a few drops of food coloring.",
          "description":"Plan on using two different colors. You can use liquid food coloring or gel food coloring. If you are using liquid food coloring, simply squeeze a few drops straight from the bottle. If you are using gel food coloring, use a toothpick to scoop a small amount out, and dip it into the icing. You can use more than two colors. Be sure to use a new toothpick for each color."
        },
        {
          "headline":"Swirl the food coloring together using a clean toothpick.",
          "description":"This goes for both liquid and gel food coloring. Do not over-stir the food coloring, or it will mix into your icing and make a muddy color. A few stirs is all that you need. You want the dots to turn into streaks."
        },
        {
          "headline":"Dip the doughnut into the icing.",
          "description":"Pick up a doughnut and hold it upside side with the bottom facing up. Dip the top of the doughnut into the icing. Hold it in the icing for a few seconds, then pull it out."
        },
        {
          "headline":"Let the excess icing drip off before setting the doughnut onto a wire cooling rack.",
          "description":"Hold the doughnut upside down and wait for the excess icing to drip off. Turn the doughnut over and set it down on a wire cooling rack. For easy clean up, slip a sheet of wax paper or parchment paper under the wire rack. This will catch any drips from the icing and keep your work surface clean."
        },
        {
          "headline":"Continue dipping the doughnuts into the icing, one by one.",
          "description":"At one point, your icing may turn white again. If this happens, simply add a few more drops of food coloring and swirl them together with another toothpick. If you are glazing mini doughnuts, the icing may get stuck in the hole. If this bugs you, use a clean toothpick to open up the hole again."
        },
        {
          "headline":"Let the icing dry.",
          "description":"This will take about 1 hour. If you want to add some sprinkles, let the wet icing dry for 1 minute before shaking any on. Let the icing dry completely before serving. Store any leftover icing in the fridge for up to 1 week."
        }
      ]
    },
    {
      "name":"Making Tie Dye Doughnuts",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F (177°C) and grease a doughnut pan.",
          "description":"You can use butter, flavorless cooking oil, or non-stick cooking spray. Set the pan aside when you are done."
        },
        {
          "headline":"Mix the dry ingredients, except for the sugar, together in a large bowl.",
          "description":"Pour the flour, baking powder, baking soda, and nutmeg into a bowl. Stir everything together until evenly combined."
        },
        {
          "headline":"Mix the sugar and the wet ingredients in a separate bowl.",
          "description":"Pour the brown sugar into a clean bowl. Add the egg, melted butter, milk, Greek yogurt, and vanilla extract. Stir everything together until combined."
        },
        {
          "headline":"Stir the dry ingredients into the wet ingredients.",
          "description":"Pour half of the flour mixture into the egg mixture. Stir it with a whisk. Pour in the rest of the flour mixture, and stir it again. Adding the dry ingredients into the wet gradually gives you a smoother batter."
        },
        {
          "headline":"Separate the batter into four small bowls.",
          "description":"Make sure that each bowl gets the same amount. You can use a soup ladle to measure the batter out, if you'd like. You will be adding food coloring into these bowls to make multi-colored batter."
        },
        {
          "headline":"Stir food coloring into each bowl.",
          "description":"Add a few drops of red food coloring into the first bowl, yellow into the second, green to the third, and blue into the fourth. Stir the batter in each bowl until the color is even and there are no streaks. Use a clean spoon for each bowl and color. The more food coloring you use, the darker and more vibrant the batter will be. You can also other colors as well, such as pink instead of red, or purple instead of blue."
        },
        {
          "headline":"Transfer the batter into piping bags.",
          "description":"Use a spatula to help guide each color of batter into a separate piping bag. You will have four piping bags when you are done. Place each one into a bowl or cup so that the batter does not spill. Do not snip the ends of the piping bags just yet."
        },
        {
          "headline":"Pipe the red batter into each well.",
          "description":"Pick up the red piping bag and snip off the tip so that you get a ½ inch (1.27 centimeters) wide opening. Fill the bottom right corner of each cavity about three-quarters deep with batter. Do not fill the entire bottom of the cavities with batter. Think of them as being divided into four sections. You are only filling the first section. Do not fill the wells all the way to the rim, or the doughnuts will overflow."
        },
        {
          "headline":"Fill the doughnut pan with the remaining three colors.",
          "description":"Once you are done with the red batter, repeat the process with the remaining batter. Add the yellow one into the bottom left corner, the green one into the upper left corner, and the blue one into the upper right. Make sure that all of the colors are touching. Fill each well only ¾ of the way. Do not fill them to the rim, or the doughnuts will overflow."
        },
        {
          "headline":"Swirl the colors together.",
          "description":"Pick up a toothpick and dip it into the first well. Stir it a few times until the colors swirl together, then move on to the next well. Do not over-stir the colors, or they will mix together and make brown instead."
        },
        {
          "headline":"Bake the doughnuts for 8 to 9 minutes.",
          "description":"Allow the doughnuts cool for about 5 minutes in the pan, then take them out. Let them finish cooling on a wire cooling rack for 10 to 15 minutes. During this time, you can start preparing the glaze."
        },
        {
          "headline":"Prepare the glaze.",
          "description":"Sift the icing sugar into a large mixing bowl. Stir in the vanilla extract and 3 tablespoons (45 milliliters) of milk. Keep stirring the glaze until it is smooth, without any lumps or clumps. You want it to be thick enough to cover the back of a spoon. If this icing is too thick, stir in 1 tablespoon (15 milliliters) of milk. If the icing is too thin, stir in more icing sugar, 1 tablespoon (7.5 grams) at a time."
        },
        {
          "headline":"Dip the doughnuts into the glaze.",
          "description":"Pick up a doughnut and turn it upside down with the bottom facing up. Dip the top part into the glaze, lift it out, and let the excess glaze drip off. Place the doughnut back onto the wire rack. Repeat this step for the other doughnuts. For easy clean up, place a sheet of wax paper or parchment paper under the wire cooling rack to catch any drips."
        },
        {
          "headline":"Let the icing dry for 1 hour before you serve the doughnuts.",
          "description":"After about a minute or so, you could add some sprinkles on top of the wet icing. Let the icing dry all the way before serving."
        }
      ]
    },
    {
      "name":"Making Chocolate Swirl Doughnuts",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F (177°C) and grease a doughnut pan.",
          "description":"You can use butter, flavorless cooking oil, or non-stick cooking spray. Put the pan aside when you're finished."
        },
        {
          "headline":"Mix the dry ingredients together, except for the sugar.",
          "description":"Sift the flour into a large mixing bowl. Add the baking powder, baking soda, and salt. Stir everything together until well-mixed."
        },
        {
          "headline":"Combine the sugar with the wet ingredients.",
          "description":"Pour the white granulated sugar into a separate bowl. Add the egg, buttermilk, melted butter, and vanilla extract. Stir the ingredients together with a whisk until smooth. Be sure to scrape the bottom and sides of the bowl often. There should be no streaks of egg yolk or clumps of sugar. Do not use all of the buttermilk. You are only using ½ cup (120 milliliters) of buttermilk for now."
        },
        {
          "headline":"Gradually add the flour mixture into the sugar mixture.",
          "description":"Pour half of the flour mixture into the sugar mixture. Stir it in with a spatula, then add in the rest. Keep stirring, scraping the bottom and sides of the bowl, until the mixture is smooth and there are no streaks or clumps."
        },
        {
          "headline":"Transfer half of the batter into a piping bag.",
          "description":"Leave the rest of the batter in the bowl. The batter that's in the bowl will eventually become the chocolate swirl. Do not snip the tip of the piping bag just yet. Keep the piping bag upright in a bowl or cup to keep it from tipping over."
        },
        {
          "headline":"Stir in the melted chocolate, cocoa powder, and remaining buttermilk.",
          "description":"Melt the chocolate first, then pour it into the remaining batter. Sift in the cocoa powder, and pour in the remaining 1 tablespoon (15 milliliters) of buttermilk. Stir everything together until smooth and no streaks remain. You can melt the chocolate in the microwave or in a small double boiler."
        },
        {
          "headline":"Transfer the chocolate batter into a separate piping bag.",
          "description":"Snip the tip of the piping bag with a pair of scissors until the opening is about ½ inch (1.27 centimeters) wide."
        },
        {
          "headline":"Fill the left side of each cavity with the chocolate batter.",
          "description":"Do not squeeze the batter into the bottom of each well. Rather, fill just the left side of each well. You will be filling the other half with the plain batter. Make sure that you only fill the cavity three-quarters deep. If you fill it all the way to the rim, the doughnuts will overflow as they bake."
        },
        {
          "headline":"Fill the right side of each cavity with the plain batter.",
          "description":"Make sure that the plain batter touches the chocolate batter. Again, fill the cavities no more than three-quarters of the way. If you fill them all the way to the brim, the doughnuts will overflow."
        },
        {
          "headline":"Swirl the batters together with a toothpick.",
          "description":"Stick a toothpick into the first well, and stir it around until the two batters swirl together. Repeat this step for the remaining wells. Do not over-stir the batter; you want it to be streaky."
        },
        {
          "headline":"Bake the doughnuts for 10 to 11 minutes.",
          "description":"Let them cool for 5 minutes in the pan before turning them out onto a wire cooling rack. Let them finish cooling, about 10 to 15 minutes. You can prepare the glaze during this time, but don't get impatient and try to glaze the doughnuts while they are still warm."
        },
        {
          "headline":"Prepare the glaze.",
          "description":"Heat the heavy cream in a small saucepan on the stove or in a cup in the microwave. Bring it to just below a boil, then set it aside. Sift together the icing sugar and the cocoa powder in a mixing bowl. Stir in the hot heavy cream with a whisk. Keep stirring until it is smooth. The glaze should be thick enough to coat the back of a spoon. If the glaze is too thin, add more icing sugar, 1 tablespoon (7.5 grams) at a time. Heat the cream over medium-low to medium heat in a saucepan for a few minutes. Heat the cream in the microwave on high for 2 to 3 minutes."
        },
        {
          "headline":"Dip the doughnuts into the icing.",
          "description":"Pick up your first doughnut and turn it upside down so that the bottom is facing up. Dip the top of the doughnut into the icing. Pull the doughnut up and let the excess icing drip off. Turn the doughnut right-side-up, then set it down onto the wire cooling rack. Repeat this step for the other doughnuts. Make clean up easier by placing a sheet of parchment paper or wax paper under the wire rack to catch any drips."
        },
        {
          "headline":"Let the icing set 1 hour before serving.",
          "description":"You could also add some white or chocolate sprinkles on top of the icing while it is still wet for a hint of color. Let the icing set all the way before you serve the doughnuts."
        }
      ]
    }
  ],
  "text":" Making Marble Glazed Doughnuts Have some doughnuts ready. You can make some using your favorite recipe, or you can buy some unglazed doughnuts from the bakery. You could even use mini doughnuts for a cute treat! This recipe makes enough to cover about 12, regular-sized doughnuts. Sift the icing sugar into a large mixing bowl. Sifting the sugar first will help reduce any lumps or clumps. It might be a good idea to have a few cups of extra sugar on hand, in case the icing is too thin. Stir in some milk with a whisk. Start with 3 tablespoons (45 milliliters). Keep stirring until everything is smooth and no lumps remain. The icing should have a syrup-like consistency. If the icing is too thick, add another tablespoon (15 milliliters) of milk. If the icing is too thin, add more icing sugar, 1 tablespoon (7.5 grams) at a time. Whisk well after each addition. For more flavor, add 2 teaspoons of vanilla extract. For a lighter icing, use water instead of milk. Add a few drops of food coloring. Plan on using two different colors. You can use liquid food coloring or gel food coloring. If you are using liquid food coloring, simply squeeze a few drops straight from the bottle. If you are using gel food coloring, use a toothpick to scoop a small amount out, and dip it into the icing. You can use more than two colors. Be sure to use a new toothpick for each color. Swirl the food coloring together using a clean toothpick. This goes for both liquid and gel food coloring. Do not over-stir the food coloring, or it will mix into your icing and make a muddy color. A few stirs is all that you need. You want the dots to turn into streaks. Dip the doughnut into the icing. Pick up a doughnut and hold it upside side with the bottom facing up. Dip the top of the doughnut into the icing. Hold it in the icing for a few seconds, then pull it out. Let the excess icing drip off before setting the doughnut onto a wire cooling rack. Hold the doughnut upside down and wait for the excess icing to drip off. Turn the doughnut over and set it down on a wire cooling rack. For easy clean up, slip a sheet of wax paper or parchment paper under the wire rack. This will catch any drips from the icing and keep your work surface clean. Continue dipping the doughnuts into the icing, one by one. At one point, your icing may turn white again. If this happens, simply add a few more drops of food coloring and swirl them together with another toothpick. If you are glazing mini doughnuts, the icing may get stuck in the hole. If this bugs you, use a clean toothpick to open up the hole again. Let the icing dry. This will take about 1 hour. If you want to add some sprinkles, let the wet icing dry for 1 minute before shaking any on. Let the icing dry completely before serving. Store any leftover icing in the fridge for up to 1 week. Making Tie Dye Doughnuts Preheat your oven to 350°F (177°C) and grease a doughnut pan. You can use butter, flavorless cooking oil, or non-stick cooking spray. Set the pan aside when you are done. Mix the dry ingredients, except for the sugar, together in a large bowl. Pour the flour, baking powder, baking soda, and nutmeg into a bowl. Stir everything together until evenly combined. Mix the sugar and the wet ingredients in a separate bowl. Pour the brown sugar into a clean bowl. Add the egg, melted butter, milk, Greek yogurt, and vanilla extract. Stir everything together until combined. Stir the dry ingredients into the wet ingredients. Pour half of the flour mixture into the egg mixture. Stir it with a whisk. Pour in the rest of the flour mixture, and stir it again. Adding the dry ingredients into the wet gradually gives you a smoother batter. Separate the batter into four small bowls. Make sure that each bowl gets the same amount. You can use a soup ladle to measure the batter out, if you'd like. You will be adding food coloring into these bowls to make multi-colored batter. Stir food coloring into each bowl. Add a few drops of red food coloring into the first bowl, yellow into the second, green to the third, and blue into the fourth. Stir the batter in each bowl until the color is even and there are no streaks. Use a clean spoon for each bowl and color. The more food coloring you use, the darker and more vibrant the batter will be. You can also other colors as well, such as pink instead of red, or purple instead of blue. Transfer the batter into piping bags. Use a spatula to help guide each color of batter into a separate piping bag. You will have four piping bags when you are done. Place each one into a bowl or cup so that the batter does not spill. Do not snip the ends of the piping bags just yet. Pipe the red batter into each well. Pick up the red piping bag and snip off the tip so that you get a ½ inch (1.27 centimeters) wide opening. Fill the bottom right corner of each cavity about three-quarters deep with batter. Do not fill the entire bottom of the cavities with batter. Think of them as being divided into four sections. You are only filling the first section. Do not fill the wells all the way to the rim, or the doughnuts will overflow. Fill the doughnut pan with the remaining three colors. Once you are done with the red batter, repeat the process with the remaining batter. Add the yellow one into the bottom left corner, the green one into the upper left corner, and the blue one into the upper right. Make sure that all of the colors are touching. Fill each well only ¾ of the way. Do not fill them to the rim, or the doughnuts will overflow. Swirl the colors together. Pick up a toothpick and dip it into the first well. Stir it a few times until the colors swirl together, then move on to the next well. Do not over-stir the colors, or they will mix together and make brown instead. Bake the doughnuts for 8 to 9 minutes. Allow the doughnuts cool for about 5 minutes in the pan, then take them out. Let them finish cooling on a wire cooling rack for 10 to 15 minutes. During this time, you can start preparing the glaze. Prepare the glaze. Sift the icing sugar into a large mixing bowl. Stir in the vanilla extract and 3 tablespoons (45 milliliters) of milk. Keep stirring the glaze until it is smooth, without any lumps or clumps. You want it to be thick enough to cover the back of a spoon. If this icing is too thick, stir in 1 tablespoon (15 milliliters) of milk. If the icing is too thin, stir in more icing sugar, 1 tablespoon (7.5 grams) at a time. Dip the doughnuts into the glaze. Pick up a doughnut and turn it upside down with the bottom facing up. Dip the top part into the glaze, lift it out, and let the excess glaze drip off. Place the doughnut back onto the wire rack. Repeat this step for the other doughnuts. For easy clean up, place a sheet of wax paper or parchment paper under the wire cooling rack to catch any drips. Let the icing dry for 1 hour before you serve the doughnuts. After about a minute or so, you could add some sprinkles on top of the wet icing. Let the icing dry all the way before serving. Making Chocolate Swirl Doughnuts Preheat your oven to 350°F (177°C) and grease a doughnut pan. You can use butter, flavorless cooking oil, or non-stick cooking spray. Put the pan aside when you're finished. Mix the dry ingredients together, except for the sugar. Sift the flour into a large mixing bowl. Add the baking powder, baking soda, and salt. Stir everything together until well-mixed. Combine the sugar with the wet ingredients. Pour the white granulated sugar into a separate bowl. Add the egg, buttermilk, melted butter, and vanilla extract. Stir the ingredients together with a whisk until smooth. Be sure to scrape the bottom and sides of the bowl often. There should be no streaks of egg yolk or clumps of sugar. Do not use all of the buttermilk. You are only using ½ cup (120 milliliters) of buttermilk for now. Gradually add the flour mixture into the sugar mixture. Pour half of the flour mixture into the sugar mixture. Stir it in with a spatula, then add in the rest. Keep stirring, scraping the bottom and sides of the bowl, until the mixture is smooth and there are no streaks or clumps. Transfer half of the batter into a piping bag. Leave the rest of the batter in the bowl. The batter that's in the bowl will eventually become the chocolate swirl. Do not snip the tip of the piping bag just yet. Keep the piping bag upright in a bowl or cup to keep it from tipping over. Stir in the melted chocolate, cocoa powder, and remaining buttermilk. Melt the chocolate first, then pour it into the remaining batter. Sift in the cocoa powder, and pour in the remaining 1 tablespoon (15 milliliters) of buttermilk. Stir everything together until smooth and no streaks remain. You can melt the chocolate in the microwave or in a small double boiler. Transfer the chocolate batter into a separate piping bag. Snip the tip of the piping bag with a pair of scissors until the opening is about ½ inch (1.27 centimeters) wide. Fill the left side of each cavity with the chocolate batter. Do not squeeze the batter into the bottom of each well. Rather, fill just the left side of each well. You will be filling the other half with the plain batter. Make sure that you only fill the cavity three-quarters deep. If you fill it all the way to the rim, the doughnuts will overflow as they bake. Fill the right side of each cavity with the plain batter. Make sure that the plain batter touches the chocolate batter. Again, fill the cavities no more than three-quarters of the way. If you fill them all the way to the brim, the doughnuts will overflow. Swirl the batters together with a toothpick. Stick a toothpick into the first well, and stir it around until the two batters swirl together. Repeat this step for the remaining wells. Do not over-stir the batter; you want it to be streaky. Bake the doughnuts for 10 to 11 minutes. Let them cool for 5 minutes in the pan before turning them out onto a wire cooling rack. Let them finish cooling, about 10 to 15 minutes. You can prepare the glaze during this time, but don't get impatient and try to glaze the doughnuts while they are still warm. Prepare the glaze. Heat the heavy cream in a small saucepan on the stove or in a cup in the microwave. Bring it to just below a boil, then set it aside. Sift together the icing sugar and the cocoa powder in a mixing bowl. Stir in the hot heavy cream with a whisk. Keep stirring until it is smooth. The glaze should be thick enough to coat the back of a spoon. If the glaze is too thin, add more icing sugar, 1 tablespoon (7.5 grams) at a time. Heat the cream over medium-low to medium heat in a saucepan for a few minutes. Heat the cream in the microwave on high for 2 to 3 minutes. Dip the doughnuts into the icing. Pick up your first doughnut and turn it upside down so that the bottom is facing up. Dip the top of the doughnut into the icing. Pull the doughnut up and let the excess icing drip off. Turn the doughnut right-side-up, then set it down onto the wire cooling rack. Repeat this step for the other doughnuts. Make clean up easier by placing a sheet of parchment paper or wax paper under the wire rack to catch any drips. Let the icing set 1 hour before serving. You could also add some white or chocolate sprinkles on top of the icing while it is still wet for a hint of color. Let the icing set all the way before you serve the doughnuts.",
  "sentences":[
    " Making Marble Glazed Doughnuts Have some doughnuts ready.",
    "You can make some using your favorite recipe, or you can buy some unglazed doughnuts from the bakery.",
    "You could even use mini doughnuts for a cute treat!",
    "This recipe makes enough to cover about 12, regular-sized doughnuts.",
    "Sift the icing sugar into a large mixing bowl.",
    "Sifting the sugar first will help reduce any lumps or clumps.",
    "It might be a good idea to have a few cups of extra sugar on hand, in case the icing is too thin.",
    "Stir in some milk with a whisk.",
    "Start with 3 tablespoons (45 milliliters).",
    "Keep stirring until everything is smooth and no lumps remain.",
    "The icing should have a syrup-like consistency.",
    "If the icing is too thick, add another tablespoon (15 milliliters) of milk.",
    "If the icing is too thin, add more icing sugar, 1 tablespoon (7.5 grams) at a time.",
    "Whisk well after each addition.",
    "For more flavor, add 2 teaspoons of vanilla extract.",
    "For a lighter icing, use water instead of milk.",
    "Add a few drops of food coloring.",
    "Plan on using two different colors.",
    "You can use liquid food coloring or gel food coloring.",
    "If you are using liquid food coloring, simply squeeze a few drops straight from the bottle.",
    "If you are using gel food coloring, use a toothpick to scoop a small amount out, and dip it into the icing.",
    "You can use more than two colors.",
    "Be sure to use a new toothpick for each color.",
    "Swirl the food coloring together using a clean toothpick.",
    "This goes for both liquid and gel food coloring.",
    "Do not over-stir the food coloring, or it will mix into your icing and make a muddy color.",
    "A few stirs is all that you need.",
    "You want the dots to turn into streaks.",
    "Dip the doughnut into the icing.",
    "Pick up a doughnut and hold it upside side with the bottom facing up.",
    "Dip the top of the doughnut into the icing.",
    "Hold it in the icing for a few seconds, then pull it out.",
    "Let the excess icing drip off before setting the doughnut onto a wire cooling rack.",
    "Hold the doughnut upside down and wait for the excess icing to drip off.",
    "Turn the doughnut over and set it down on a wire cooling rack.",
    "For easy clean up, slip a sheet of wax paper or parchment paper under the wire rack.",
    "This will catch any drips from the icing and keep your work surface clean.",
    "Continue dipping the doughnuts into the icing, one by one.",
    "At one point, your icing may turn white again.",
    "If this happens, simply add a few more drops of food coloring and swirl them together with another toothpick.",
    "If you are glazing mini doughnuts, the icing may get stuck in the hole.",
    "If this bugs you, use a clean toothpick to open up the hole again.",
    "Let the icing dry.",
    "This will take about 1 hour.",
    "If you want to add some sprinkles, let the wet icing dry for 1 minute before shaking any on.",
    "Let the icing dry completely before serving.",
    "Store any leftover icing in the fridge for up to 1 week.",
    "Making Tie Dye Doughnuts Preheat your oven to 350°F (177°C) and grease a doughnut pan.",
    "You can use butter, flavorless cooking oil, or non-stick cooking spray.",
    "Set the pan aside when you are done.",
    "Mix the dry ingredients, except for the sugar, together in a large bowl.",
    "Pour the flour, baking powder, baking soda, and nutmeg into a bowl.",
    "Stir everything together until evenly combined.",
    "Mix the sugar and the wet ingredients in a separate bowl.",
    "Pour the brown sugar into a clean bowl.",
    "Add the egg, melted butter, milk, Greek yogurt, and vanilla extract.",
    "Stir everything together until combined.",
    "Stir the dry ingredients into the wet ingredients.",
    "Pour half of the flour mixture into the egg mixture.",
    "Stir it with a whisk.",
    "Pour in the rest of the flour mixture, and stir it again.",
    "Adding the dry ingredients into the wet gradually gives you a smoother batter.",
    "Separate the batter into four small bowls.",
    "Make sure that each bowl gets the same amount.",
    "You can use a soup ladle to measure the batter out, if you'd like.",
    "You will be adding food coloring into these bowls to make multi-colored batter.",
    "Stir food coloring into each bowl.",
    "Add a few drops of red food coloring into the first bowl, yellow into the second, green to the third, and blue into the fourth.",
    "Stir the batter in each bowl until the color is even and there are no streaks.",
    "Use a clean spoon for each bowl and color.",
    "The more food coloring you use, the darker and more vibrant the batter will be.",
    "You can also other colors as well, such as pink instead of red, or purple instead of blue.",
    "Transfer the batter into piping bags.",
    "Use a spatula to help guide each color of batter into a separate piping bag.",
    "You will have four piping bags when you are done.",
    "Place each one into a bowl or cup so that the batter does not spill.",
    "Do not snip the ends of the piping bags just yet.",
    "Pipe the red batter into each well.",
    "Pick up the red piping bag and snip off the tip so that you get a ½ inch (1.27 centimeters) wide opening.",
    "Fill the bottom right corner of each cavity about three-quarters deep with batter.",
    "Do not fill the entire bottom of the cavities with batter.",
    "Think of them as being divided into four sections.",
    "You are only filling the first section.",
    "Do not fill the wells all the way to the rim, or the doughnuts will overflow.",
    "Fill the doughnut pan with the remaining three colors.",
    "Once you are done with the red batter, repeat the process with the remaining batter.",
    "Add the yellow one into the bottom left corner, the green one into the upper left corner, and the blue one into the upper right.",
    "Make sure that all of the colors are touching.",
    "Fill each well only ¾ of the way.",
    "Do not fill them to the rim, or the doughnuts will overflow.",
    "Swirl the colors together.",
    "Pick up a toothpick and dip it into the first well.",
    "Stir it a few times until the colors swirl together, then move on to the next well.",
    "Do not over-stir the colors, or they will mix together and make brown instead.",
    "Bake the doughnuts for 8 to 9 minutes.",
    "Allow the doughnuts cool for about 5 minutes in the pan, then take them out.",
    "Let them finish cooling on a wire cooling rack for 10 to 15 minutes.",
    "During this time, you can start preparing the glaze.",
    "Prepare the glaze.",
    "Sift the icing sugar into a large mixing bowl.",
    "Stir in the vanilla extract and 3 tablespoons (45 milliliters) of milk.",
    "Keep stirring the glaze until it is smooth, without any lumps or clumps.",
    "You want it to be thick enough to cover the back of a spoon.",
    "If this icing is too thick, stir in 1 tablespoon (15 milliliters) of milk.",
    "If the icing is too thin, stir in more icing sugar, 1 tablespoon (7.5 grams) at a time.",
    "Dip the doughnuts into the glaze.",
    "Pick up a doughnut and turn it upside down with the bottom facing up.",
    "Dip the top part into the glaze, lift it out, and let the excess glaze drip off.",
    "Place the doughnut back onto the wire rack.",
    "Repeat this step for the other doughnuts.",
    "For easy clean up, place a sheet of wax paper or parchment paper under the wire cooling rack to catch any drips.",
    "Let the icing dry for 1 hour before you serve the doughnuts.",
    "After about a minute or so, you could add some sprinkles on top of the wet icing.",
    "Let the icing dry all the way before serving.",
    "Making Chocolate Swirl Doughnuts Preheat your oven to 350°F (177°C) and grease a doughnut pan.",
    "You can use butter, flavorless cooking oil, or non-stick cooking spray.",
    "Put the pan aside when you're finished.",
    "Mix the dry ingredients together, except for the sugar.",
    "Sift the flour into a large mixing bowl.",
    "Add the baking powder, baking soda, and salt.",
    "Stir everything together until well-mixed.",
    "Combine the sugar with the wet ingredients.",
    "Pour the white granulated sugar into a separate bowl.",
    "Add the egg, buttermilk, melted butter, and vanilla extract.",
    "Stir the ingredients together with a whisk until smooth.",
    "Be sure to scrape the bottom and sides of the bowl often.",
    "There should be no streaks of egg yolk or clumps of sugar.",
    "Do not use all of the buttermilk.",
    "You are only using ½ cup (120 milliliters) of buttermilk for now.",
    "Gradually add the flour mixture into the sugar mixture.",
    "Pour half of the flour mixture into the sugar mixture.",
    "Stir it in with a spatula, then add in the rest.",
    "Keep stirring, scraping the bottom and sides of the bowl, until the mixture is smooth and there are no streaks or clumps.",
    "Transfer half of the batter into a piping bag.",
    "Leave the rest of the batter in the bowl.",
    "The batter that's in the bowl will eventually become the chocolate swirl.",
    "Do not snip the tip of the piping bag just yet.",
    "Keep the piping bag upright in a bowl or cup to keep it from tipping over.",
    "Stir in the melted chocolate, cocoa powder, and remaining buttermilk.",
    "Melt the chocolate first, then pour it into the remaining batter.",
    "Sift in the cocoa powder, and pour in the remaining 1 tablespoon (15 milliliters) of buttermilk.",
    "Stir everything together until smooth and no streaks remain.",
    "You can melt the chocolate in the microwave or in a small double boiler.",
    "Transfer the chocolate batter into a separate piping bag.",
    "Snip the tip of the piping bag with a pair of scissors until the opening is about ½ inch (1.27 centimeters) wide.",
    "Fill the left side of each cavity with the chocolate batter.",
    "Do not squeeze the batter into the bottom of each well.",
    "Rather, fill just the left side of each well.",
    "You will be filling the other half with the plain batter.",
    "Make sure that you only fill the cavity three-quarters deep.",
    "If you fill it all the way to the rim, the doughnuts will overflow as they bake.",
    "Fill the right side of each cavity with the plain batter.",
    "Make sure that the plain batter touches the chocolate batter.",
    "Again, fill the cavities no more than three-quarters of the way.",
    "If you fill them all the way to the brim, the doughnuts will overflow.",
    "Swirl the batters together with a toothpick.",
    "Stick a toothpick into the first well, and stir it around until the two batters swirl together.",
    "Repeat this step for the remaining wells.",
    "Do not over-stir the batter; you want it to be streaky.",
    "Bake the doughnuts for 10 to 11 minutes.",
    "Let them cool for 5 minutes in the pan before turning them out onto a wire cooling rack.",
    "Let them finish cooling, about 10 to 15 minutes.",
    "You can prepare the glaze during this time, but don't get impatient and try to glaze the doughnuts while they are still warm.",
    "Prepare the glaze.",
    "Heat the heavy cream in a small saucepan on the stove or in a cup in the microwave.",
    "Bring it to just below a boil, then set it aside.",
    "Sift together the icing sugar and the cocoa powder in a mixing bowl.",
    "Stir in the hot heavy cream with a whisk.",
    "Keep stirring until it is smooth.",
    "The glaze should be thick enough to coat the back of a spoon.",
    "If the glaze is too thin, add more icing sugar, 1 tablespoon (7.5 grams) at a time.",
    "Heat the cream over medium-low to medium heat in a saucepan for a few minutes.",
    "Heat the cream in the microwave on high for 2 to 3 minutes.",
    "Dip the doughnuts into the icing.",
    "Pick up your first doughnut and turn it upside down so that the bottom is facing up.",
    "Dip the top of the doughnut into the icing.",
    "Pull the doughnut up and let the excess icing drip off.",
    "Turn the doughnut right-side-up, then set it down onto the wire cooling rack.",
    "Repeat this step for the other doughnuts.",
    "Make clean up easier by placing a sheet of parchment paper or wax paper under the wire rack to catch any drips.",
    "Let the icing set 1 hour before serving.",
    "You could also add some white or chocolate sprinkles on top of the icing while it is still wet for a hint of color.",
    "Let the icing set all the way before you serve the doughnuts."
  ],
  "tyn_section":[
    "Marble Glazed Doughnuts",
    "Large mixing bowl",
    "Whisk or mixing spoon",
    "Toothpicks",
    "Tie Dye Doughnuts",
    "2 large mixing bowls",
    "4 small mixing bowls",
    "Mixing spoon",
    "Whisk",
    "Doughnut baking pan",
    "4 piping bags",
    "Wire cooling rack",
    "Chocolate Swirl Doughnuts",
    "2 piping bags"
  ],
  "tyn_model":[
    "food coloring",
    "bowl",
    "sugar",
    "icing",
    "icing sugar",
    "milk",
    "flour",
    "whisk",
    "piping bag",
    "buttermilk",
    "vanilla extract",
    "butter",
    "chocolate",
    "wax paper",
    "parchment paper",
    "wire rack",
    "doughnut pan",
    "spoon",
    "toothpick",
    "cocoa powder",
    "microwave",
    "chocolate batter",
    "plain batter",
    "mixing bowl",
    "oven",
    "flavorless cooking oil",
    "non-stick cooking spray",
    "baking powder",
    "baking soda",
    "egg",
    "piping bags",
    "spatula",
    "batter",
    "doughnuts",
    "large mixing bowl",
    "heavy cream",
    "cream",
    "water",
    "wire cooling rack",
    "tie dye doughnuts",
    "large bowl",
    "nutmeg",
    "brown sugar",
    "greek yogurt",
    "soup ladle",
    "doughnut",
    "salt",
    "white granulated sugar",
    "double boiler",
    "scissors",
    "small saucepan",
    "saucepan"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0769230769,
    "f1":0.1212121212,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.1923076923,
    "f1":0.2877697842
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7857142857,
    "p":0.2692307692,
    "f1":0.4010416667
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1730769231,
    "f1":0.2571428571
  }
}