{
  "title":"How to Enhance Boxed Brownie Mix",
  "url":"https://www.wikihow.com/Enhance-Boxed-Brownie-Mix",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "methods":[
    {
      "name":"Adding Mix-Ins",
      "steps":[
        {
          "headline":"Pour in some chopped nuts.",
          "description":"You can purchase chopped nuts at the grocery store, or buy some regular nuts and chop them yourself. Use whichever kind you prefer – pecans, almonds, cashews, walnuts, and so on. Not only will they add that nutty taste, but they'll add some delicious texture to your otherwise gooey brownies!"
        },
        {
          "headline":"Mix in your favorite candy.",
          "description":"Grab a bag of your favorite candy or a couple of your favorite candy bars. Then, chop them up into chunks and toss them into your batter – pretty easy! You can do this with Reeses, Snickers, peppermints, Butterfingers, M&Ms, Milky Way, or whatever candy you love. Avoid the chewy, fruity candies like Skittles or Sour Patch Kids. Those will not do well in the oven (and probably wouldn't taste great with chocolate! )."
        },
        {
          "headline":"Swirl cream cheese into the mix.",
          "description":"Cream cheese is a popular ingredient for decadent frostings, so try putting it directly in the brownies for an extra treat. Purchase a package of cream cheese (8 ounces, 226 grams) and warm it up in the microwave to soften it. Place it in a bowl, and then add half a cup of sugar, one egg, and one teaspoon of vanilla. Stir all of these together thoroughly. Once the ingredients are mixed, pour it over the uncooked brownie batter in the pan. Take a knife and swirl the cream cheese mixture throughout the brownie batter, making a neat marbleized pattern. Bake your brownies like normal."
        },
        {
          "headline":"Throw in some fruit.",
          "description":"You can add a sweet kick to your brownies without a ton of extra calories by adding in some different kinds of fruit. Coconut flakes are simple to mix into the batter. Other options are maraschino cherries, raspberries, or even blueberries. If you're adding canned fruit to your brownies, you can substitute the oil in the brownie recipe for the juices in the can. This will make your brownies deliciously fruity and lower in fat. If your goal is healthy (or healthier) brownies, add in some flaxseed. Flaxseed is a super food that is high in fiber and Omega-3 fatty acids."
        }
      ]
    },
    {
      "name":"Creating Layers",
      "steps":[
        {
          "headline":"Add a layer of Oreos.",
          "description":"Once you've mixed up your boxed brownie mix, pour about half of it into your pan. Put the second half of batter to the side. Then, carefully place a layer of Oreos over the layer of brownie batter. Leave the Oreos whole, placing them side-by-side until the batter is covered. Pour the second half of the brownie batter over the Oreos. Bake your brownies according to the box instructions. The Oreos will soften and form a delicious, smooth middle layer. You aren't limited to using traditional Oreos. Use Golden Oreos or flavored Oreos for a unique taste. Cookies like Nutter Butters, Milanos, and chewy Chips Ahoy work as well."
        },
        {
          "headline":"Make a caramel layer.",
          "description":"This boxed brownie enhancement involves adding candy to your mix, but in a much more methodical way. Mix up your boxed brownie mix according to the instructions on the box. Pour half of the batter into the pan. Then, carefully add a layer of caramel-filled chocolates. You should be able to find several different brands and versions of this kind of candy at your local grocery store. After you've carefully laid the candy over the batter and filled the entire pan, add the second half of your batter over the candies. Bake your brownies according to instructions. When you slice them, you'll have a decadent layer of caramel in the middle! The candies work well to hold the caramel in a layer. You can use a store-bought caramel sauce, but it will be a bit runnier and form less of a solid \"layer.\""
        },
        {
          "headline":"Use cookie dough as a base.",
          "description":"If you love brownies and you love cookies, why not combine the two? Don't worry, you can buy store-bought cookie dough for this, so it doesn't require any extra mixing. Simply press your cookie dough into the bottom of your pan, covering the entire thing as if you were making one huge cookie. Then, pour your brownie batter over the top. Bake your brownie cookie hybrid for the lowest amount of time on the box. Then, check it by sticking a toothpick into the brownie portion. When it comes out clean, your cookie brownies are all done!"
        },
        {
          "headline":"Make a graham cracker crust.",
          "description":"Smash up some graham crackers and measure out two cups of crumbs. Put them in a bowl, and add a quarter cup of granulated sugar and 6 tablespoons of melted butter. Mix that all up to create a dough. Line your baking pan with foil and then press the graham cracker mixture into the bottom of the pan. Pour your brownie batter over those graham crackers and bake! The finished product will taste a bit like s'mores."
        }
      ]
    },
    {
      "name":"Topping Your Brownies",
      "steps":[
        {
          "headline":"Frost your brownies.",
          "description":"You frost cookies and cupcakes, so why not frost your brownies? You can whip up some homemade frosting or buy a tub of store-bought frosting. With vanilla frosting and a little food coloring, you can even create colorful brownies with designs. Frosting is a perfect way to transform normal brownies into festive brownies for any occasion. Write “Happy Birthday” or “Congratulations!” on a pan of brownies, and they're instantly more special. Experiment with different kinds of frostings to find your favorite. Try decadent frostings like German chocolate or cream cheese frosting. Add a bit of fruitiness to your brownies with a raspberry frosting. Add lemon, lavender, or honey to a vanilla buttercream frosting to create all sorts of brownies."
        },
        {
          "headline":"Top your brownies with fruit.",
          "description":"Chocolate and fruit are a traditional dessert combination, after all. Top your brownies with your frosting of choice, and cut them into squares. Then, top each one with a raspberry, a strawberry slice, or whatever fruit you want to use. The culinary combination is great, and the box mix brownies immediately look more sophisticated."
        },
        {
          "headline":"Use nuts or candy as a topping.",
          "description":"Anything you used as a mix-in can be used as a topping as well! While the brownies are still warm, top them with crushed candy, nuts, mini marshmallows, or any other sweet or crunchy treat. As the brownies cool, the toppings will meld to the tops, so they won't be messy. This is great for easily adding color or texture to your brownies."
        },
        {
          "headline":"Throw chocolate chips on top.",
          "description":"As soon as you pull your brownies out of the oven, toss a layer of your favorite chips on top. You can use dark chocolate, milk chocolate, white chocolate, or even peanut butter chips. The warmth from your brownies will melt the chips to the surface of your fresh brownies. When the chips are soft, you can spread them along the surface of the brownies with a knife or leave them as they are. Enjoy!"
        }
      ]
    }
  ],
  "text":" Adding Mix-Ins Pour in some chopped nuts. You can purchase chopped nuts at the grocery store, or buy some regular nuts and chop them yourself. Use whichever kind you prefer – pecans, almonds, cashews, walnuts, and so on. Not only will they add that nutty taste, but they'll add some delicious texture to your otherwise gooey brownies! Mix in your favorite candy. Grab a bag of your favorite candy or a couple of your favorite candy bars. Then, chop them up into chunks and toss them into your batter – pretty easy! You can do this with Reeses, Snickers, peppermints, Butterfingers, M&Ms, Milky Way, or whatever candy you love. Avoid the chewy, fruity candies like Skittles or Sour Patch Kids. Those will not do well in the oven (and probably wouldn't taste great with chocolate! ). Swirl cream cheese into the mix. Cream cheese is a popular ingredient for decadent frostings, so try putting it directly in the brownies for an extra treat. Purchase a package of cream cheese (8 ounces, 226 grams) and warm it up in the microwave to soften it. Place it in a bowl, and then add half a cup of sugar, one egg, and one teaspoon of vanilla. Stir all of these together thoroughly. Once the ingredients are mixed, pour it over the uncooked brownie batter in the pan. Take a knife and swirl the cream cheese mixture throughout the brownie batter, making a neat marbleized pattern. Bake your brownies like normal. Throw in some fruit. You can add a sweet kick to your brownies without a ton of extra calories by adding in some different kinds of fruit. Coconut flakes are simple to mix into the batter. Other options are maraschino cherries, raspberries, or even blueberries. If you're adding canned fruit to your brownies, you can substitute the oil in the brownie recipe for the juices in the can. This will make your brownies deliciously fruity and lower in fat. If your goal is healthy (or healthier) brownies, add in some flaxseed. Flaxseed is a super food that is high in fiber and Omega-3 fatty acids. Creating Layers Add a layer of Oreos. Once you've mixed up your boxed brownie mix, pour about half of it into your pan. Put the second half of batter to the side. Then, carefully place a layer of Oreos over the layer of brownie batter. Leave the Oreos whole, placing them side-by-side until the batter is covered. Pour the second half of the brownie batter over the Oreos. Bake your brownies according to the box instructions. The Oreos will soften and form a delicious, smooth middle layer. You aren't limited to using traditional Oreos. Use Golden Oreos or flavored Oreos for a unique taste. Cookies like Nutter Butters, Milanos, and chewy Chips Ahoy work as well. Make a caramel layer. This boxed brownie enhancement involves adding candy to your mix, but in a much more methodical way. Mix up your boxed brownie mix according to the instructions on the box. Pour half of the batter into the pan. Then, carefully add a layer of caramel-filled chocolates. You should be able to find several different brands and versions of this kind of candy at your local grocery store. After you've carefully laid the candy over the batter and filled the entire pan, add the second half of your batter over the candies. Bake your brownies according to instructions. When you slice them, you'll have a decadent layer of caramel in the middle! The candies work well to hold the caramel in a layer. You can use a store-bought caramel sauce, but it will be a bit runnier and form less of a solid \"layer.\" Use cookie dough as a base. If you love brownies and you love cookies, why not combine the two? Don't worry, you can buy store-bought cookie dough for this, so it doesn't require any extra mixing. Simply press your cookie dough into the bottom of your pan, covering the entire thing as if you were making one huge cookie. Then, pour your brownie batter over the top. Bake your brownie cookie hybrid for the lowest amount of time on the box. Then, check it by sticking a toothpick into the brownie portion. When it comes out clean, your cookie brownies are all done! Make a graham cracker crust. Smash up some graham crackers and measure out two cups of crumbs. Put them in a bowl, and add a quarter cup of granulated sugar and 6 tablespoons of melted butter. Mix that all up to create a dough. Line your baking pan with foil and then press the graham cracker mixture into the bottom of the pan. Pour your brownie batter over those graham crackers and bake! The finished product will taste a bit like s'mores. Topping Your Brownies Frost your brownies. You frost cookies and cupcakes, so why not frost your brownies? You can whip up some homemade frosting or buy a tub of store-bought frosting. With vanilla frosting and a little food coloring, you can even create colorful brownies with designs. Frosting is a perfect way to transform normal brownies into festive brownies for any occasion. Write “Happy Birthday” or “Congratulations!” on a pan of brownies, and they're instantly more special. Experiment with different kinds of frostings to find your favorite. Try decadent frostings like German chocolate or cream cheese frosting. Add a bit of fruitiness to your brownies with a raspberry frosting. Add lemon, lavender, or honey to a vanilla buttercream frosting to create all sorts of brownies. Top your brownies with fruit. Chocolate and fruit are a traditional dessert combination, after all. Top your brownies with your frosting of choice, and cut them into squares. Then, top each one with a raspberry, a strawberry slice, or whatever fruit you want to use. The culinary combination is great, and the box mix brownies immediately look more sophisticated. Use nuts or candy as a topping. Anything you used as a mix-in can be used as a topping as well! While the brownies are still warm, top them with crushed candy, nuts, mini marshmallows, or any other sweet or crunchy treat. As the brownies cool, the toppings will meld to the tops, so they won't be messy. This is great for easily adding color or texture to your brownies. Throw chocolate chips on top. As soon as you pull your brownies out of the oven, toss a layer of your favorite chips on top. You can use dark chocolate, milk chocolate, white chocolate, or even peanut butter chips. The warmth from your brownies will melt the chips to the surface of your fresh brownies. When the chips are soft, you can spread them along the surface of the brownies with a knife or leave them as they are. Enjoy!",
  "sentences":[
    " Adding Mix-Ins Pour in some chopped nuts.",
    "You can purchase chopped nuts at the grocery store, or buy some regular nuts and chop them yourself.",
    "Use whichever kind you prefer – pecans, almonds, cashews, walnuts, and so on.",
    "Not only will they add that nutty taste, but they'll add some delicious texture to your otherwise gooey brownies!",
    "Mix in your favorite candy.",
    "Grab a bag of your favorite candy or a couple of your favorite candy bars.",
    "Then, chop them up into chunks and toss them into your batter – pretty easy!",
    "You can do this with Reeses, Snickers, peppermints, Butterfingers, M&Ms, Milky Way, or whatever candy you love.",
    "Avoid the chewy, fruity candies like Skittles or Sour Patch Kids.",
    "Those will not do well in the oven (and probably wouldn't taste great with chocolate!",
    ").",
    "Swirl cream cheese into the mix.",
    "Cream cheese is a popular ingredient for decadent frostings, so try putting it directly in the brownies for an extra treat.",
    "Purchase a package of cream cheese (8 ounces, 226 grams) and warm it up in the microwave to soften it.",
    "Place it in a bowl, and then add half a cup of sugar, one egg, and one teaspoon of vanilla.",
    "Stir all of these together thoroughly.",
    "Once the ingredients are mixed, pour it over the uncooked brownie batter in the pan.",
    "Take a knife and swirl the cream cheese mixture throughout the brownie batter, making a neat marbleized pattern.",
    "Bake your brownies like normal.",
    "Throw in some fruit.",
    "You can add a sweet kick to your brownies without a ton of extra calories by adding in some different kinds of fruit.",
    "Coconut flakes are simple to mix into the batter.",
    "Other options are maraschino cherries, raspberries, or even blueberries.",
    "If you're adding canned fruit to your brownies, you can substitute the oil in the brownie recipe for the juices in the can.",
    "This will make your brownies deliciously fruity and lower in fat.",
    "If your goal is healthy (or healthier) brownies, add in some flaxseed.",
    "Flaxseed is a super food that is high in fiber and Omega-3 fatty acids.",
    "Creating Layers Add a layer of Oreos.",
    "Once you've mixed up your boxed brownie mix, pour about half of it into your pan.",
    "Put the second half of batter to the side.",
    "Then, carefully place a layer of Oreos over the layer of brownie batter.",
    "Leave the Oreos whole, placing them side-by-side until the batter is covered.",
    "Pour the second half of the brownie batter over the Oreos.",
    "Bake your brownies according to the box instructions.",
    "The Oreos will soften and form a delicious, smooth middle layer.",
    "You aren't limited to using traditional Oreos.",
    "Use Golden Oreos or flavored Oreos for a unique taste.",
    "Cookies like Nutter Butters, Milanos, and chewy Chips Ahoy work as well.",
    "Make a caramel layer.",
    "This boxed brownie enhancement involves adding candy to your mix, but in a much more methodical way.",
    "Mix up your boxed brownie mix according to the instructions on the box.",
    "Pour half of the batter into the pan.",
    "Then, carefully add a layer of caramel-filled chocolates.",
    "You should be able to find several different brands and versions of this kind of candy at your local grocery store.",
    "After you've carefully laid the candy over the batter and filled the entire pan, add the second half of your batter over the candies.",
    "Bake your brownies according to instructions.",
    "When you slice them, you'll have a decadent layer of caramel in the middle!",
    "The candies work well to hold the caramel in a layer.",
    "You can use a store-bought caramel sauce, but it will be a bit runnier and form less of a solid \"layer.\"",
    "Use cookie dough as a base.",
    "If you love brownies and you love cookies, why not combine the two?",
    "Don't worry, you can buy store-bought cookie dough for this, so it doesn't require any extra mixing.",
    "Simply press your cookie dough into the bottom of your pan, covering the entire thing as if you were making one huge cookie.",
    "Then, pour your brownie batter over the top.",
    "Bake your brownie cookie hybrid for the lowest amount of time on the box.",
    "Then, check it by sticking a toothpick into the brownie portion.",
    "When it comes out clean, your cookie brownies are all done!",
    "Make a graham cracker crust.",
    "Smash up some graham crackers and measure out two cups of crumbs.",
    "Put them in a bowl, and add a quarter cup of granulated sugar and 6 tablespoons of melted butter.",
    "Mix that all up to create a dough.",
    "Line your baking pan with foil and then press the graham cracker mixture into the bottom of the pan.",
    "Pour your brownie batter over those graham crackers and bake!",
    "The finished product will taste a bit like s'mores.",
    "Topping Your Brownies Frost your brownies.",
    "You frost cookies and cupcakes, so why not frost your brownies?",
    "You can whip up some homemade frosting or buy a tub of store-bought frosting.",
    "With vanilla frosting and a little food coloring, you can even create colorful brownies with designs.",
    "Frosting is a perfect way to transform normal brownies into festive brownies for any occasion.",
    "Write “Happy Birthday” or “Congratulations!” on a pan of brownies, and they're instantly more special.",
    "Experiment with different kinds of frostings to find your favorite.",
    "Try decadent frostings like German chocolate or cream cheese frosting.",
    "Add a bit of fruitiness to your brownies with a raspberry frosting.",
    "Add lemon, lavender, or honey to a vanilla buttercream frosting to create all sorts of brownies.",
    "Top your brownies with fruit.",
    "Chocolate and fruit are a traditional dessert combination, after all.",
    "Top your brownies with your frosting of choice, and cut them into squares.",
    "Then, top each one with a raspberry, a strawberry slice, or whatever fruit you want to use.",
    "The culinary combination is great, and the box mix brownies immediately look more sophisticated.",
    "Use nuts or candy as a topping.",
    "Anything you used as a mix-in can be used as a topping as well!",
    "While the brownies are still warm, top them with crushed candy, nuts, mini marshmallows, or any other sweet or crunchy treat.",
    "As the brownies cool, the toppings will meld to the tops, so they won't be messy.",
    "This is great for easily adding color or texture to your brownies.",
    "Throw chocolate chips on top.",
    "As soon as you pull your brownies out of the oven, toss a layer of your favorite chips on top.",
    "You can use dark chocolate, milk chocolate, white chocolate, or even peanut butter chips.",
    "The warmth from your brownies will melt the chips to the surface of your fresh brownies.",
    "When the chips are soft, you can spread them along the surface of the brownies with a knife or leave them as they are.",
    "Enjoy!"
  ],
  "tyn_section":[
    "Boxed brownie mix",
    "Baking pan",
    "Large mixing spoon",
    "Mixing bowls (2)",
    "Knife",
    "Aluminum foil (for graham cracker variation)",
    "Measuring cups"
  ],
  "tyn_model":[
    "candy",
    "nuts",
    "brownie batter",
    "cream cheese",
    "oreos",
    "cookie dough",
    "frosting",
    "chocolate",
    "bowl",
    "knife",
    "fruit",
    "flaxseed",
    "graham crackers",
    "– pecans",
    "almonds",
    "cashews",
    "walnuts",
    "candy bars",
    "– pretty",
    "snickers",
    "peppermints",
    "butterfingers",
    "sour patch kids",
    "microwave",
    "sugar",
    "egg",
    "vanilla",
    "coconut flakes",
    "raspberries",
    "blueberries",
    "oil",
    "nutter butters",
    "chips ahoy work",
    "caramel",
    "caramel sauce",
    "cookies",
    "brownie cookie",
    "graham cracker crust",
    "granulated sugar",
    "butter",
    "baking pan",
    "foil",
    "graham cracker",
    "vanilla frosting",
    "food coloring",
    "“happy",
    "” or",
    "“congratulations",
    "” on",
    "frostings",
    "cream cheese frosting",
    "raspberry frosting",
    "vanilla buttercream frosting",
    "chocolate chips",
    "oven",
    "milk chocolate",
    "peanut butter chips"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0350877193,
    "f1":0.0625,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2857142857,
    "p":0.0350877193,
    "f1":0.0625
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4285714286,
    "p":0.0526315789,
    "f1":0.09375
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.0350877193,
    "f1":0.0625
  }
}