{
  "title":"How to Make an Omelette in a Jar",
  "url":"https://www.wikihow.com/Make-an-Omelette-in-a-Jar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Omelets"
  ],
  "parts":[
    {
      "name":"Sauteing the Vegetables",
      "steps":[
        {
          "headline":"Heat the olive oil.",
          "description":"Place a large skillet on the stove, and add 1 tablespoon (15 ml) of olive oil. Turn the heat to medium-high, and allow the oil to heat until it starts to shimmer, which should take approximately 5 minutes. You can substitute butter for the olive oil if you prefer."
        },
        {
          "headline":"Cook the onions until they are tender.",
          "description":"When the oil is hot, add a quarter of a large onion that’s been diced to the skillet. Allow the onion to cook until it is soft and tender, which should take 5 to 7 minutes. Stir the onion frequently with a wooden spoon or heatproof spatula while you’re sauteing it to ensure that it cooks evenly."
        },
        {
          "headline":"Add the pepper and saute until they are soft.",
          "description":"Once the onion is soft, mix in 1 cup (175 g) of diced red bell pepper. Cook the pepper with the onion until it is tender, which should take 3 to 5 minutes. You can substitute your favorite type of pepper, such as yellow, green, or orange, for the red bell pepper. You can add and/or substitute any of your favorite vegetables. Mushrooms and asparagus are tasty options. Soft vegetables, such as tomatoes or avocado, don’t require sauteing. You can mix them into the eggs with the cheese and meat."
        },
        {
          "headline":"Mix in the spinach and stir until it’s wilted.",
          "description":"When the pepper is soft, add ½ cup (115 g) of spinach that’s been shredded into ½-inch (1.3-cm) pieces to the skillet. Turn off the heat, and stir the spinach in until it’s just wilted, which should take about 1 minute. You can substitute your favorite leafy green for the spinach. Arugula and Swiss chard are delicious options. If you’re not a fan of leafy greens, leave out the spinach."
        }
      ]
    },
    {
      "name":"Beating the Eggs",
      "steps":[
        {
          "headline":"Preheat the oven.",
          "description":"To ensure that the oven will be warm enough to cook the omelettes, it’s important to preheat it. Set the temperature to 350 degrees (177 degrees Celsius), and allow it to heat fully. Make sure that you understand how your oven indicates that it’s reached the desired temperature. It will probably flash an indicator light or beep to let you know."
        },
        {
          "headline":"Grease the jars.",
          "description":"For the omelettes, you’ll need 2 8-ounce (237 ml) glass mason jars. To ensure that the omelettes don’t stick, spray the inside of the jars with a generous amount of nonstick cooking spray. If you prefer to use butter to grease the jars, soften it slightly and use a pastry brush or piece of parchment paper that’s folded into a strip to apply it to the inside of the jars."
        },
        {
          "headline":"Mix the eggs, egg whites, and milk.",
          "description":"Add 4 large eggs, 4 egg whites, and 2 tablespoons (30 ml) of milk to a medium bowl. Whisk the ingredients together until the eggs are fluffy and thick. To separate the whites from the eggs, break them on a flat surface, such as a countertop or table. Separate the egg into two halves over a bowl, allowing the yolk to fall into the lower half. Move the yolk back and forth between the halves, while the white drips out into the bowl below. Continue moving the yolk until all of the white is removed. You can substitute heavy cream for the milk if you want your omelettes to have a richer texture."
        },
        {
          "headline":"Season the egg mixture with garlic powder, salt, and pepper.",
          "description":"After you’ve beaten the eggs, add salt and pepper to the mixture to taste as well as a ½ tbsp (5 g) of garlic powder. Whisk the seasonings in until they’re fully incorporated. You can omit the garlic powder if you prefer. You can also substitute or add your favorite spices or herbs, such as chopped parsley, basil, thyme, crushed red pepper flakes, or cayenne pepper."
        }
      ]
    },
    {
      "name":"Cooking the Omelettes",
      "steps":[
        {
          "headline":"Add the sauted vegetables, cheese, and meat to the jars.",
          "description":"Once the eggs are mixed, you can begin preparing the jars. Divide the sauteed vegetables evenly between the two jars and add 2 tablespoons (20 g) of the shredded cheese of your choice and 2 tablespoons (27 ½ g) of the chopped, cooked meat of your choice to each jar. Use your favorite cheese in the omelettes. Swiss, cheddar, monterey jack, pepper jack, and mozzarella are tasty options. Use your favorite meat in the omelettes. Bacon, sausage, and ham are delicious options. For a healthier version of the omelettes, consider using turkey bacon or sausage. You can use vegetable meat substitutes, such as veggie bacon strips or veggie sausage patties, if you're a vegetarian. If you prefer, you can also omit the cheese and/or the meat completely."
        },
        {
          "headline":"Pour the egg mixture into the jars and shake well.",
          "description":"When you’ve added the vegetables, cheese, and meat to the jars, divide the egg mixture between the two jars. You should fill them approximately three-quarters of the way full. Next, place the lids and shake the jars well to mix all of the ingredients through the eggs. You shouldn’t fill the jars all the way to the top because the eggs puff as they cook."
        },
        {
          "headline":"Bake the omelettes until the tops are browned.",
          "description":"After you’ve mixed the omelettes, remove the lids from the jars. Place the jars on a baking sheet, and set them in the preheated oven. Allow them to cook until the tops of the omelettes start to brown, which should take approximately 15 to 20 minutes. If you like, you can sprinkle a pinch of shredded cheese over the top of the jars before placing them in the oven."
        },
        {
          "headline":"Cool the omelettes briefly and serve.",
          "description":"When the omelettes are finished baking, remove them from the oven. Allow them to cool for 5 to 10 minutes before serving them. You can eat the omelettes directly from the jar or run a knife around them to loosen them from the jar so you can turn them out on plates."
        },
        {
          "headline":"Add the lids to the jars and refrigerate them if making ahead.",
          "description":"If you are making the omelettes ahead of time, allow them to cool for 10 to 15 minutes. Place the lids on them, and store them in the refrigerator .They will keep for up 5 days. You can reheat the omelettes in the microwave. Heat them on high in 30 second intervals until they’re warm enough."
        }
      ]
    }
  ],
  "text":" Sauteing the Vegetables Heat the olive oil. Place a large skillet on the stove, and add 1 tablespoon (15 ml) of olive oil. Turn the heat to medium-high, and allow the oil to heat until it starts to shimmer, which should take approximately 5 minutes. You can substitute butter for the olive oil if you prefer. Cook the onions until they are tender. When the oil is hot, add a quarter of a large onion that’s been diced to the skillet. Allow the onion to cook until it is soft and tender, which should take 5 to 7 minutes. Stir the onion frequently with a wooden spoon or heatproof spatula while you’re sauteing it to ensure that it cooks evenly. Add the pepper and saute until they are soft. Once the onion is soft, mix in 1 cup (175 g) of diced red bell pepper. Cook the pepper with the onion until it is tender, which should take 3 to 5 minutes. You can substitute your favorite type of pepper, such as yellow, green, or orange, for the red bell pepper. You can add and/or substitute any of your favorite vegetables. Mushrooms and asparagus are tasty options. Soft vegetables, such as tomatoes or avocado, don’t require sauteing. You can mix them into the eggs with the cheese and meat. Mix in the spinach and stir until it’s wilted. When the pepper is soft, add ½ cup (115 g) of spinach that’s been shredded into ½-inch (1.3-cm) pieces to the skillet. Turn off the heat, and stir the spinach in until it’s just wilted, which should take about 1 minute. You can substitute your favorite leafy green for the spinach. Arugula and Swiss chard are delicious options. If you’re not a fan of leafy greens, leave out the spinach. Beating the Eggs Preheat the oven. To ensure that the oven will be warm enough to cook the omelettes, it’s important to preheat it. Set the temperature to 350 degrees (177 degrees Celsius), and allow it to heat fully. Make sure that you understand how your oven indicates that it’s reached the desired temperature. It will probably flash an indicator light or beep to let you know. Grease the jars. For the omelettes, you’ll need 2 8-ounce (237 ml) glass mason jars. To ensure that the omelettes don’t stick, spray the inside of the jars with a generous amount of nonstick cooking spray. If you prefer to use butter to grease the jars, soften it slightly and use a pastry brush or piece of parchment paper that’s folded into a strip to apply it to the inside of the jars. Mix the eggs, egg whites, and milk. Add 4 large eggs, 4 egg whites, and 2 tablespoons (30 ml) of milk to a medium bowl. Whisk the ingredients together until the eggs are fluffy and thick. To separate the whites from the eggs, break them on a flat surface, such as a countertop or table. Separate the egg into two halves over a bowl, allowing the yolk to fall into the lower half. Move the yolk back and forth between the halves, while the white drips out into the bowl below. Continue moving the yolk until all of the white is removed. You can substitute heavy cream for the milk if you want your omelettes to have a richer texture. Season the egg mixture with garlic powder, salt, and pepper. After you’ve beaten the eggs, add salt and pepper to the mixture to taste as well as a ½ tbsp (5 g) of garlic powder. Whisk the seasonings in until they’re fully incorporated. You can omit the garlic powder if you prefer. You can also substitute or add your favorite spices or herbs, such as chopped parsley, basil, thyme, crushed red pepper flakes, or cayenne pepper. Cooking the Omelettes Add the sauted vegetables, cheese, and meat to the jars. Once the eggs are mixed, you can begin preparing the jars. Divide the sauteed vegetables evenly between the two jars and add 2 tablespoons (20 g) of the shredded cheese of your choice and 2 tablespoons (27 ½ g) of the chopped, cooked meat of your choice to each jar. Use your favorite cheese in the omelettes. Swiss, cheddar, monterey jack, pepper jack, and mozzarella are tasty options. Use your favorite meat in the omelettes. Bacon, sausage, and ham are delicious options. For a healthier version of the omelettes, consider using turkey bacon or sausage. You can use vegetable meat substitutes, such as veggie bacon strips or veggie sausage patties, if you're a vegetarian. If you prefer, you can also omit the cheese and/or the meat completely. Pour the egg mixture into the jars and shake well. When you’ve added the vegetables, cheese, and meat to the jars, divide the egg mixture between the two jars. You should fill them approximately three-quarters of the way full. Next, place the lids and shake the jars well to mix all of the ingredients through the eggs. You shouldn’t fill the jars all the way to the top because the eggs puff as they cook. Bake the omelettes until the tops are browned. After you’ve mixed the omelettes, remove the lids from the jars. Place the jars on a baking sheet, and set them in the preheated oven. Allow them to cook until the tops of the omelettes start to brown, which should take approximately 15 to 20 minutes. If you like, you can sprinkle a pinch of shredded cheese over the top of the jars before placing them in the oven. Cool the omelettes briefly and serve. When the omelettes are finished baking, remove them from the oven. Allow them to cool for 5 to 10 minutes before serving them. You can eat the omelettes directly from the jar or run a knife around them to loosen them from the jar so you can turn them out on plates. Add the lids to the jars and refrigerate them if making ahead. If you are making the omelettes ahead of time, allow them to cool for 10 to 15 minutes. Place the lids on them, and store them in the refrigerator .They will keep for up 5 days. You can reheat the omelettes in the microwave. Heat them on high in 30 second intervals until they’re warm enough.",
  "sentences":[
    " Sauteing the Vegetables Heat the olive oil.",
    "Place a large skillet on the stove, and add 1 tablespoon (15 ml) of olive oil.",
    "Turn the heat to medium-high, and allow the oil to heat until it starts to shimmer, which should take approximately 5 minutes.",
    "You can substitute butter for the olive oil if you prefer.",
    "Cook the onions until they are tender.",
    "When the oil is hot, add a quarter of a large onion that’s been diced to the skillet.",
    "Allow the onion to cook until it is soft and tender, which should take 5 to 7 minutes.",
    "Stir the onion frequently with a wooden spoon or heatproof spatula while you’re sauteing it to ensure that it cooks evenly.",
    "Add the pepper and saute until they are soft.",
    "Once the onion is soft, mix in 1 cup (175 g) of diced red bell pepper.",
    "Cook the pepper with the onion until it is tender, which should take 3 to 5 minutes.",
    "You can substitute your favorite type of pepper, such as yellow, green, or orange, for the red bell pepper.",
    "You can add and/or substitute any of your favorite vegetables.",
    "Mushrooms and asparagus are tasty options.",
    "Soft vegetables, such as tomatoes or avocado, don’t require sauteing.",
    "You can mix them into the eggs with the cheese and meat.",
    "Mix in the spinach and stir until it’s wilted.",
    "When the pepper is soft, add ½ cup (115 g) of spinach that’s been shredded into ½-inch (1.3-cm) pieces to the skillet.",
    "Turn off the heat, and stir the spinach in until it’s just wilted, which should take about 1 minute.",
    "You can substitute your favorite leafy green for the spinach.",
    "Arugula and Swiss chard are delicious options.",
    "If you’re not a fan of leafy greens, leave out the spinach.",
    "Beating the Eggs Preheat the oven.",
    "To ensure that the oven will be warm enough to cook the omelettes, it’s important to preheat it.",
    "Set the temperature to 350 degrees (177 degrees Celsius), and allow it to heat fully.",
    "Make sure that you understand how your oven indicates that it’s reached the desired temperature.",
    "It will probably flash an indicator light or beep to let you know.",
    "Grease the jars.",
    "For the omelettes, you’ll need 2 8-ounce (237 ml) glass mason jars.",
    "To ensure that the omelettes don’t stick, spray the inside of the jars with a generous amount of nonstick cooking spray.",
    "If you prefer to use butter to grease the jars, soften it slightly and use a pastry brush or piece of parchment paper that’s folded into a strip to apply it to the inside of the jars.",
    "Mix the eggs, egg whites, and milk.",
    "Add 4 large eggs, 4 egg whites, and 2 tablespoons (30 ml) of milk to a medium bowl.",
    "Whisk the ingredients together until the eggs are fluffy and thick.",
    "To separate the whites from the eggs, break them on a flat surface, such as a countertop or table.",
    "Separate the egg into two halves over a bowl, allowing the yolk to fall into the lower half.",
    "Move the yolk back and forth between the halves, while the white drips out into the bowl below.",
    "Continue moving the yolk until all of the white is removed.",
    "You can substitute heavy cream for the milk if you want your omelettes to have a richer texture.",
    "Season the egg mixture with garlic powder, salt, and pepper.",
    "After you’ve beaten the eggs, add salt and pepper to the mixture to taste as well as a ½ tbsp (5 g) of garlic powder.",
    "Whisk the seasonings in until they’re fully incorporated.",
    "You can omit the garlic powder if you prefer.",
    "You can also substitute or add your favorite spices or herbs, such as chopped parsley, basil, thyme, crushed red pepper flakes, or cayenne pepper.",
    "Cooking the Omelettes Add the sauted vegetables, cheese, and meat to the jars.",
    "Once the eggs are mixed, you can begin preparing the jars.",
    "Divide the sauteed vegetables evenly between the two jars and add 2 tablespoons (20 g) of the shredded cheese of your choice and 2 tablespoons (27 ½ g) of the chopped, cooked meat of your choice to each jar.",
    "Use your favorite cheese in the omelettes.",
    "Swiss, cheddar, monterey jack, pepper jack, and mozzarella are tasty options.",
    "Use your favorite meat in the omelettes.",
    "Bacon, sausage, and ham are delicious options.",
    "For a healthier version of the omelettes, consider using turkey bacon or sausage.",
    "You can use vegetable meat substitutes, such as veggie bacon strips or veggie sausage patties, if you're a vegetarian.",
    "If you prefer, you can also omit the cheese and/or the meat completely.",
    "Pour the egg mixture into the jars and shake well.",
    "When you’ve added the vegetables, cheese, and meat to the jars, divide the egg mixture between the two jars.",
    "You should fill them approximately three-quarters of the way full.",
    "Next, place the lids and shake the jars well to mix all of the ingredients through the eggs.",
    "You shouldn’t fill the jars all the way to the top because the eggs puff as they cook.",
    "Bake the omelettes until the tops are browned.",
    "After you’ve mixed the omelettes, remove the lids from the jars.",
    "Place the jars on a baking sheet, and set them in the preheated oven.",
    "Allow them to cook until the tops of the omelettes start to brown, which should take approximately 15 to 20 minutes.",
    "If you like, you can sprinkle a pinch of shredded cheese over the top of the jars before placing them in the oven.",
    "Cool the omelettes briefly and serve.",
    "When the omelettes are finished baking, remove them from the oven.",
    "Allow them to cool for 5 to 10 minutes before serving them.",
    "You can eat the omelettes directly from the jar or run a knife around them to loosen them from the jar so you can turn them out on plates.",
    "Add the lids to the jars and refrigerate them if making ahead.",
    "If you are making the omelettes ahead of time, allow them to cool for 10 to 15 minutes.",
    "Place the lids on them, and store them in the refrigerator .They will keep for up 5 days.",
    "You can reheat the omelettes in the microwave.",
    "Heat them on high in 30 second intervals until they’re warm enough."
  ],
  "tyn_section":[
    "Large skillet",
    "Wooden spoon or heat-safe spatula",
    "2 8-ounce (237 ml) glass mason jars",
    "Nonstick cooking spray",
    "Medium bowl",
    "Whisk",
    "Baking sheet"
  ],
  "tyn_model":[
    "eggs",
    "jars",
    "oven",
    "pepper",
    "cheese",
    "spinach",
    "olive oil",
    "onion",
    "milk",
    "garlic powder",
    "vegetables",
    "oil",
    "butter",
    "skillet",
    "red bell pepper",
    "meat",
    "bowl",
    "large skillet",
    "stove",
    "onions",
    "wooden spoon",
    "heatproof spatula",
    "mushrooms",
    "tomatoes",
    "arugula",
    "swiss chard",
    "glass mason jars",
    "nonstick cooking spray",
    "pastry brush",
    "parchment paper",
    "medium bowl",
    "heavy cream",
    "salt",
    "salt and pepper",
    "seasonings",
    "herbs",
    "parsley",
    "basil",
    "thyme",
    "crushed red pepper flakes",
    "cayenne pepper",
    "cheddar",
    "monterey jack",
    "pepper jack",
    "mozzarella",
    "bacon",
    "sausage",
    "egg",
    "baking sheet",
    "shredded cheese",
    "knife",
    "plates",
    "refrigerator",
    "microwave"
  ],
  "simple_metrics":{
    "r":0.5714285714,
    "p":0.0740740741,
    "f1":0.131147541,
    "avg_pos":0.3148148148
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.1111111111,
    "f1":0.1860465116
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.1481481481,
    "f1":0.2526315789
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.0740740741,
    "f1":0.131147541
  }
}