{
  "title":"How to Reuse Jewelry for Home Decor",
  "url":"https://www.wikihow.com/Reuse-Jewelry-for-Home-Decor",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating",
    "Home Decor"
  ],
  "methods":[
    {
      "name":"Using Earrings",
      "steps":[
        {
          "headline":"Make magnets with old earrings.",
          "description":"If you have old earrings that are broken, or ones you don't wear anymore, you can turn them into magnets. Simply buy magnet backs at a local craft store. Small disc magnet backs work best for this project. Superglue the magnet backs on your earrings and then place them on your fridge to spruce up your kitchen. You should use pliers to remove any wires or backs that are still on the jewelry. This works best on larger jewelry. Small earrings, like gold balls, may look awkward glued to a magnet back."
        },
        {
          "headline":"Add an old earring to a decorative box.",
          "description":"If you have any larger earrings, these can be glued to a decorative box. If you have a decorative box sitting out on a mantel or elsewhere in your home, it may look a little dull. Try to add a little extra decoration by super-gluing an earring to the box. If you have a lot of earrings you no longer use, glue a lot of them to a decorative box. You can try to make a design, like a heart shape, or simply scatter jewels all over the front of the box."
        },
        {
          "headline":"Use old earrings as charms for a mobile.",
          "description":"If you have a mobile hanging in your home, enhance it with earrings. Earrings can be glued or tied to the strings of a mobile. They can also be glued to hanging pieces of a mobile to give them extra flare. Earrings can make a run-of-the-mill mobile sparkle in your home. For example, if you have a mobile of the sun, moon, and stars, superglue shiny earrings to the hanging pieces. This will make the cosmos shine a little."
        },
        {
          "headline":"Add earrings to the ends of a table runner.",
          "description":"If you have a fabric table runner and earrings with the wire still in place, you can add some fringe to the edge of your runner. Take a series of old earrings and feed the wire end through either end of the runner. This will give your runner a fun, somewhat bohemian fringe. If you don't have a table runner, but do have a lot of old earrings, consider springing for a inexpensive fabric runner at a department store. A somewhat dull runner will be brightened up if you decorate it with earrings."
        },
        {
          "headline":"Frame old earrings.",
          "description":"Stop by a local department store or art store. Pick up some picture frames that have backs wrapped with linen. Then, remove hooks and wires from old earrings with pliers. You can then hot glue the earrings onto the linen, creating fun, decorative frames with old earrings. You can also use other old items, like old postcards or birthday cards, on the back of your linen if the earrings dull on their own. You can make a fun collage using picture frames, old jewelry, and other supplies."
        }
      ]
    },
    {
      "name":"Decorating with Necklaces",
      "steps":[
        {
          "headline":"Use a necklace chain on a lamp.",
          "description":"If you have a lamp that turns on and off when pulling a chain, you can spruce up the chain with an old necklace. You can try weaving an old necklace around the existing chain to attach it. You can also snip off most of the existing chain with pliers, leaving only a small end sticking out, and then glue one end of the necklace to the end of the old chain. Use industrial strength glue to secure the necklace to the chain. This will work best."
        },
        {
          "headline":"Make a chandelier using broken necklaces.",
          "description":"Stop by a local thrift store, craft store, or department store. Get a large, circular ring, such as a wire ring you would use for a sewing project. You can then make a chandelier by stringing old necklaces around the ring. Attach some wires or strings to hang the object from your ceiling when you're done. Some necklaces can be tied to the wire ring. However, things like gold and silver chains will probably need to be glued."
        },
        {
          "headline":"Wind old pearls around a vase.",
          "description":"Pearls can make an elegant decoration, and look particularly striking on a vase. Remove pearls from their existing string and insert them into light-gauge wires. You can do this by cutting off any snaps or holders on the edge of the string of pearls. Then, remove the pearls with your fingers. Wrap the wire around a vase for an attractive embellishment."
        },
        {
          "headline":"Frame old necklaces.",
          "description":"Cover the back of a picture frame in decorative cardboard from a craft store. Then, hang an old necklace over the cardboard, so the pendant hangs halfway down the frame. You can then frame the cardboard and hang up your new decoration in your home. Make sure to pick decorative cardboard that matches the color of your necklace."
        }
      ]
    },
    {
      "name":"Making Use of Miscellaneous Items",
      "steps":[
        {
          "headline":"Embellish dull Christmas ornaments with pieces of shattered jewelry.",
          "description":"If you have jewelry that's shattered or broken, you do not have to throw it away. You can glue pieces of, say, a shattered brooch or pendant on a plain Christmas ornament, like a plain white bulb. This adds some glimmer to an otherwise dull ornament you can then hang on your tree."
        },
        {
          "headline":"Superglue large pieces of jewelry onto doorknobs.",
          "description":"Old brooches and large pendants work best here. You can simply use superglue or industrial strength glue to secure these items to doorknobs in your home. This gives doorknobs a little extra beauty. Smaller pieces, like bits of earrings, can be glued to tiny knobs, like the knobs of cabinets in your kitchen or bathroom."
        },
        {
          "headline":"Pin old brooches on white lampshades.",
          "description":"If you have any white lampshades in your home, they can look a little dull. You can embellish them by pinning old brooches onto them. If you have lots of brooches, but no white lampshades, lampshades are cheap to buy at most department stores."
        },
        {
          "headline":"Stack bracelets to make candle holders.",
          "description":"You can wrap old bracelets around candle holders. You can also glue together a stack of similarly sized bracelets and slip them over existing candleholders. This can spruce up plain glass candleholders in your home."
        }
      ]
    }
  ],
  "text":" Using Earrings Make magnets with old earrings. If you have old earrings that are broken, or ones you don't wear anymore, you can turn them into magnets. Simply buy magnet backs at a local craft store. Small disc magnet backs work best for this project. Superglue the magnet backs on your earrings and then place them on your fridge to spruce up your kitchen. You should use pliers to remove any wires or backs that are still on the jewelry. This works best on larger jewelry. Small earrings, like gold balls, may look awkward glued to a magnet back. Add an old earring to a decorative box. If you have any larger earrings, these can be glued to a decorative box. If you have a decorative box sitting out on a mantel or elsewhere in your home, it may look a little dull. Try to add a little extra decoration by super-gluing an earring to the box. If you have a lot of earrings you no longer use, glue a lot of them to a decorative box. You can try to make a design, like a heart shape, or simply scatter jewels all over the front of the box. Use old earrings as charms for a mobile. If you have a mobile hanging in your home, enhance it with earrings. Earrings can be glued or tied to the strings of a mobile. They can also be glued to hanging pieces of a mobile to give them extra flare. Earrings can make a run-of-the-mill mobile sparkle in your home. For example, if you have a mobile of the sun, moon, and stars, superglue shiny earrings to the hanging pieces. This will make the cosmos shine a little. Add earrings to the ends of a table runner. If you have a fabric table runner and earrings with the wire still in place, you can add some fringe to the edge of your runner. Take a series of old earrings and feed the wire end through either end of the runner. This will give your runner a fun, somewhat bohemian fringe. If you don't have a table runner, but do have a lot of old earrings, consider springing for a inexpensive fabric runner at a department store. A somewhat dull runner will be brightened up if you decorate it with earrings. Frame old earrings. Stop by a local department store or art store. Pick up some picture frames that have backs wrapped with linen. Then, remove hooks and wires from old earrings with pliers. You can then hot glue the earrings onto the linen, creating fun, decorative frames with old earrings. You can also use other old items, like old postcards or birthday cards, on the back of your linen if the earrings dull on their own. You can make a fun collage using picture frames, old jewelry, and other supplies. Decorating with Necklaces Use a necklace chain on a lamp. If you have a lamp that turns on and off when pulling a chain, you can spruce up the chain with an old necklace. You can try weaving an old necklace around the existing chain to attach it. You can also snip off most of the existing chain with pliers, leaving only a small end sticking out, and then glue one end of the necklace to the end of the old chain. Use industrial strength glue to secure the necklace to the chain. This will work best. Make a chandelier using broken necklaces. Stop by a local thrift store, craft store, or department store. Get a large, circular ring, such as a wire ring you would use for a sewing project. You can then make a chandelier by stringing old necklaces around the ring. Attach some wires or strings to hang the object from your ceiling when you're done. Some necklaces can be tied to the wire ring. However, things like gold and silver chains will probably need to be glued. Wind old pearls around a vase. Pearls can make an elegant decoration, and look particularly striking on a vase. Remove pearls from their existing string and insert them into light-gauge wires. You can do this by cutting off any snaps or holders on the edge of the string of pearls. Then, remove the pearls with your fingers. Wrap the wire around a vase for an attractive embellishment. Frame old necklaces. Cover the back of a picture frame in decorative cardboard from a craft store. Then, hang an old necklace over the cardboard, so the pendant hangs halfway down the frame. You can then frame the cardboard and hang up your new decoration in your home. Make sure to pick decorative cardboard that matches the color of your necklace. Making Use of Miscellaneous Items Embellish dull Christmas ornaments with pieces of shattered jewelry. If you have jewelry that's shattered or broken, you do not have to throw it away. You can glue pieces of, say, a shattered brooch or pendant on a plain Christmas ornament, like a plain white bulb. This adds some glimmer to an otherwise dull ornament you can then hang on your tree. Superglue large pieces of jewelry onto doorknobs. Old brooches and large pendants work best here. You can simply use superglue or industrial strength glue to secure these items to doorknobs in your home. This gives doorknobs a little extra beauty. Smaller pieces, like bits of earrings, can be glued to tiny knobs, like the knobs of cabinets in your kitchen or bathroom. Pin old brooches on white lampshades. If you have any white lampshades in your home, they can look a little dull. You can embellish them by pinning old brooches onto them. If you have lots of brooches, but no white lampshades, lampshades are cheap to buy at most department stores. Stack bracelets to make candle holders. You can wrap old bracelets around candle holders. You can also glue together a stack of similarly sized bracelets and slip them over existing candleholders. This can spruce up plain glass candleholders in your home.",
  "sentences":[
    " Using Earrings Make magnets with old earrings.",
    "If you have old earrings that are broken, or ones you don't wear anymore, you can turn them into magnets.",
    "Simply buy magnet backs at a local craft store.",
    "Small disc magnet backs work best for this project.",
    "Superglue the magnet backs on your earrings and then place them on your fridge to spruce up your kitchen.",
    "You should use pliers to remove any wires or backs that are still on the jewelry.",
    "This works best on larger jewelry.",
    "Small earrings, like gold balls, may look awkward glued to a magnet back.",
    "Add an old earring to a decorative box.",
    "If you have any larger earrings, these can be glued to a decorative box.",
    "If you have a decorative box sitting out on a mantel or elsewhere in your home, it may look a little dull.",
    "Try to add a little extra decoration by super-gluing an earring to the box.",
    "If you have a lot of earrings you no longer use, glue a lot of them to a decorative box.",
    "You can try to make a design, like a heart shape, or simply scatter jewels all over the front of the box.",
    "Use old earrings as charms for a mobile.",
    "If you have a mobile hanging in your home, enhance it with earrings.",
    "Earrings can be glued or tied to the strings of a mobile.",
    "They can also be glued to hanging pieces of a mobile to give them extra flare.",
    "Earrings can make a run-of-the-mill mobile sparkle in your home.",
    "For example, if you have a mobile of the sun, moon, and stars, superglue shiny earrings to the hanging pieces.",
    "This will make the cosmos shine a little.",
    "Add earrings to the ends of a table runner.",
    "If you have a fabric table runner and earrings with the wire still in place, you can add some fringe to the edge of your runner.",
    "Take a series of old earrings and feed the wire end through either end of the runner.",
    "This will give your runner a fun, somewhat bohemian fringe.",
    "If you don't have a table runner, but do have a lot of old earrings, consider springing for a inexpensive fabric runner at a department store.",
    "A somewhat dull runner will be brightened up if you decorate it with earrings.",
    "Frame old earrings.",
    "Stop by a local department store or art store.",
    "Pick up some picture frames that have backs wrapped with linen.",
    "Then, remove hooks and wires from old earrings with pliers.",
    "You can then hot glue the earrings onto the linen, creating fun, decorative frames with old earrings.",
    "You can also use other old items, like old postcards or birthday cards, on the back of your linen if the earrings dull on their own.",
    "You can make a fun collage using picture frames, old jewelry, and other supplies.",
    "Decorating with Necklaces Use a necklace chain on a lamp.",
    "If you have a lamp that turns on and off when pulling a chain, you can spruce up the chain with an old necklace.",
    "You can try weaving an old necklace around the existing chain to attach it.",
    "You can also snip off most of the existing chain with pliers, leaving only a small end sticking out, and then glue one end of the necklace to the end of the old chain.",
    "Use industrial strength glue to secure the necklace to the chain.",
    "This will work best.",
    "Make a chandelier using broken necklaces.",
    "Stop by a local thrift store, craft store, or department store.",
    "Get a large, circular ring, such as a wire ring you would use for a sewing project.",
    "You can then make a chandelier by stringing old necklaces around the ring.",
    "Attach some wires or strings to hang the object from your ceiling when you're done.",
    "Some necklaces can be tied to the wire ring.",
    "However, things like gold and silver chains will probably need to be glued.",
    "Wind old pearls around a vase.",
    "Pearls can make an elegant decoration, and look particularly striking on a vase.",
    "Remove pearls from their existing string and insert them into light-gauge wires.",
    "You can do this by cutting off any snaps or holders on the edge of the string of pearls.",
    "Then, remove the pearls with your fingers.",
    "Wrap the wire around a vase for an attractive embellishment.",
    "Frame old necklaces.",
    "Cover the back of a picture frame in decorative cardboard from a craft store.",
    "Then, hang an old necklace over the cardboard, so the pendant hangs halfway down the frame.",
    "You can then frame the cardboard and hang up your new decoration in your home.",
    "Make sure to pick decorative cardboard that matches the color of your necklace.",
    "Making Use of Miscellaneous Items Embellish dull Christmas ornaments with pieces of shattered jewelry.",
    "If you have jewelry that's shattered or broken, you do not have to throw it away.",
    "You can glue pieces of, say, a shattered brooch or pendant on a plain Christmas ornament, like a plain white bulb.",
    "This adds some glimmer to an otherwise dull ornament you can then hang on your tree.",
    "Superglue large pieces of jewelry onto doorknobs.",
    "Old brooches and large pendants work best here.",
    "You can simply use superglue or industrial strength glue to secure these items to doorknobs in your home.",
    "This gives doorknobs a little extra beauty.",
    "Smaller pieces, like bits of earrings, can be glued to tiny knobs, like the knobs of cabinets in your kitchen or bathroom.",
    "Pin old brooches on white lampshades.",
    "If you have any white lampshades in your home, they can look a little dull.",
    "You can embellish them by pinning old brooches onto them.",
    "If you have lots of brooches, but no white lampshades, lampshades are cheap to buy at most department stores.",
    "Stack bracelets to make candle holders.",
    "You can wrap old bracelets around candle holders.",
    "You can also glue together a stack of similarly sized bracelets and slip them over existing candleholders.",
    "This can spruce up plain glass candleholders in your home."
  ],
  "tyn_section":[
    "Old jewelry (necklaces, earrings, brooches, etc.)",
    "Super glue",
    "Industrial strength glue",
    "Picture frames",
    "Pliers",
    "Magnet backs"
  ],
  "tyn_model":[
    "earrings",
    "jewelry",
    "pliers",
    "linen",
    "necklace",
    "vase",
    "brooches",
    "lampshades",
    "bracelets",
    "magnets",
    "magnet",
    "decorative box",
    "table runner",
    "wire",
    "lamp",
    "industrial strength glue",
    "pearls",
    "decorative cardboard",
    "cardboard",
    "magnet backs",
    "jewels",
    "fabric runner",
    "chandelier",
    "necklaces",
    "wires",
    "wire ring",
    "picture frame",
    "glue",
    "superglue",
    "candle holders"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1,
    "f1":0.1666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.1666666667,
    "f1":0.2666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8333333333,
    "p":0.2,
    "f1":0.3225806452
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1,
    "f1":0.1666666667
  }
}