{
  "title":"How to Make a Pretzel Cake",
  "url":"https://www.wikihow.com/Make-a-Pretzel-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Shaped and Themed Cakes"
  ],
  "methods":[
    {
      "name":"Making a Fudgy One-Bowl Chocolate Peanut Butter Pretzel Cake",
      "steps":[
        {
          "headline":"Preheat your oven to 350 degrees F (176 degrees C).",
          "description":"By the time you finish preparing the rest of the recipe, your oven will be fully heated and ready for the cake."
        },
        {
          "headline":"Grease two 8-inch round cake pans.",
          "description":"Line both cake pans with parchment paper, then spray their surfaces with cooking spray."
        },
        {
          "headline":"Mix the dry ingredients together.",
          "description":"Measure out the flour, sugar, cocoa powder, baking soda and salt and place them into a large mixing bowl. Use a whisk or spoon to mix the dry ingredients together."
        },
        {
          "headline":"Make a well and add the wet ingredients.",
          "description":"Use your fingers or a spoon to scoop out the dry ingredients in the center of the bowl. This will create a “well” for the wet ingredients. Add the eggs, buttermilk, canola oil and vanilla to the bowl, placing them directly in the \"well.\""
        },
        {
          "headline":"Whisk the eggs and then mix everything well.",
          "description":"Use a whisk to quickly break up the eggs a bit, then switch to a spoon. Mix all off the ingredients together, making sure that the wet and dry ingredients are full incorporated. Continue to mix until the consistency of the batter is mostly smooth."
        },
        {
          "headline":"Add hot coffee and chocolate chips.",
          "description":"Pour the freshly-brewed coffee into the batter. Use a spoon to mix the coffee into the batter. Once the coffee is fully incorporated, the batter should be just thin enough to be pourable. Add a little more coffee if the consistency is too thick. Then stir in the chocolate chips."
        },
        {
          "headline":"Divide the batter between the two pans.",
          "description":"Carefully pour half of the cake batter into one of your round pans, then pour the other half into the second round pan. Try to make them as even as possible, but they don’t have to be perfectly identical."
        },
        {
          "headline":"Bake the cakes for 20 to 25 minutes.",
          "description":"Place both pans in your oven and let them bake. After about 20 minutes, check on them. They are ready to pull out when the tops of both cakes are set and the center no longer wiggles. Let them cool for about five minutes."
        },
        {
          "headline":"Transfer the cakes onto plates.",
          "description":"Line two large, flat plates with parchment paper. Run a knife around the perimeter of each cake to loosen them from their pans, then invert them – one at a time – on the paper-lined plates. Cover the cakes and allow them to cool."
        },
        {
          "headline":"Make the ganache.",
          "description":"Pour the chocolate, cream and peanut butter into a small saucepan. Place the pan on your stove’s burner and set the heat to low. Stir the ingredients frequently as they begin to melt together. The ganache can burn easily, so make sure you are nearby to stir it regularly."
        },
        {
          "headline":"Assemble the first layer of cake.",
          "description":"Put one of the cakes, flat side up, onto a large plate or cake stand. Sprinkle a layer of pretzels on the surface of the cake. Then sprinkle the chopped peanut butter cups on top. Carefully drizzle about half of the prepared ganache on top of the pretzels."
        },
        {
          "headline":"Assemble the final layer of cake.",
          "description":"Lift the second cake and place it directly on top of the already-assembled layer. Spread a layer of pretzels on top. Use the remaining ganache to drizzle all over the cake. Sprinkle more of the chopped peanut butter cups on top. If you like, you can wait ten minutes to allow the ganache to set, but this isn’t necessary. You can serve it immediately if you want to."
        }
      ]
    },
    {
      "name":"Baking a Salted Caramel Pretzel Chocolate Sheet Cake",
      "steps":[
        {
          "headline":"Preheat your oven to 350 degrees F (176 degrees C).",
          "description":"Prepare the rest of the recipe as it heats up. By the time you finish, your oven will be fully heated and ready. Grease a 12½ x 17½ baking pan (standard cookie sheet)."
        },
        {
          "headline":"Mix the butter, water, and cocoa together.",
          "description":"Measure out these ingredients and place them in a medium-sized sauce pan over low heat. Stir the mixture until the butter has melted completely. Remove the pan from the heat."
        },
        {
          "headline":"Add the sugar, vanilla, salt and sour cream.",
          "description":"Measure out these ingredients and place them in the sauce pan with the butter mixture. Stir briskly until all of the ingredients are fully incorporated. Add the eggs and continue to stir until everything is completely mixed together."
        },
        {
          "headline":"Add the dry ingredients.",
          "description":"Measure out the flour and baking soda and put them in a small bowl together. Give the ingredients a quick stir to blend them together. Fold the dry flour mixture into the cake batter. Stir briskly. Keep mixing until all of the dry spots have been eliminated. Do not continue to mix once this has been achieved to avoid a rubbery cake."
        },
        {
          "headline":"Pour the batter on the cookie sheet and bake for 17-20 minutes.",
          "description":"Carefully pour the batter onto the prepared cookie sheet and slide it into the oven. The cake is ready to take out when you can insert a toothpick into the center and it comes out clean."
        },
        {
          "headline":"Make the frosting.",
          "description":"Measure out and put the butter and brown sugar into a sauce pan over low-medium heat. Bring the mixture to a simmer, stirring constantly. Continue to stir and allow it to simmer for about two minutes. Then remove it from the heat. Add the cream or milk, vanilla, salt, and powdered sugar and whisk everything together until the consistency is smooth."
        },
        {
          "headline":"Frost the cake while it is still warm.",
          "description":"Use a spoon or spatula to spread the frosting all over the cake. Crush the pretzels and sprinkle them on top. Serve immediately."
        }
      ]
    }
  ],
  "text":" Making a Fudgy One-Bowl Chocolate Peanut Butter Pretzel Cake Preheat your oven to 350 degrees F (176 degrees C). By the time you finish preparing the rest of the recipe, your oven will be fully heated and ready for the cake. Grease two 8-inch round cake pans. Line both cake pans with parchment paper, then spray their surfaces with cooking spray. Mix the dry ingredients together. Measure out the flour, sugar, cocoa powder, baking soda and salt and place them into a large mixing bowl. Use a whisk or spoon to mix the dry ingredients together. Make a well and add the wet ingredients. Use your fingers or a spoon to scoop out the dry ingredients in the center of the bowl. This will create a “well” for the wet ingredients. Add the eggs, buttermilk, canola oil and vanilla to the bowl, placing them directly in the \"well.\" Whisk the eggs and then mix everything well. Use a whisk to quickly break up the eggs a bit, then switch to a spoon. Mix all off the ingredients together, making sure that the wet and dry ingredients are full incorporated. Continue to mix until the consistency of the batter is mostly smooth. Add hot coffee and chocolate chips. Pour the freshly-brewed coffee into the batter. Use a spoon to mix the coffee into the batter. Once the coffee is fully incorporated, the batter should be just thin enough to be pourable. Add a little more coffee if the consistency is too thick. Then stir in the chocolate chips. Divide the batter between the two pans. Carefully pour half of the cake batter into one of your round pans, then pour the other half into the second round pan. Try to make them as even as possible, but they don’t have to be perfectly identical. Bake the cakes for 20 to 25 minutes. Place both pans in your oven and let them bake. After about 20 minutes, check on them. They are ready to pull out when the tops of both cakes are set and the center no longer wiggles. Let them cool for about five minutes. Transfer the cakes onto plates. Line two large, flat plates with parchment paper. Run a knife around the perimeter of each cake to loosen them from their pans, then invert them – one at a time – on the paper-lined plates. Cover the cakes and allow them to cool. Make the ganache. Pour the chocolate, cream and peanut butter into a small saucepan. Place the pan on your stove’s burner and set the heat to low. Stir the ingredients frequently as they begin to melt together. The ganache can burn easily, so make sure you are nearby to stir it regularly. Assemble the first layer of cake. Put one of the cakes, flat side up, onto a large plate or cake stand. Sprinkle a layer of pretzels on the surface of the cake. Then sprinkle the chopped peanut butter cups on top. Carefully drizzle about half of the prepared ganache on top of the pretzels. Assemble the final layer of cake. Lift the second cake and place it directly on top of the already-assembled layer. Spread a layer of pretzels on top. Use the remaining ganache to drizzle all over the cake. Sprinkle more of the chopped peanut butter cups on top. If you like, you can wait ten minutes to allow the ganache to set, but this isn’t necessary. You can serve it immediately if you want to. Baking a Salted Caramel Pretzel Chocolate Sheet Cake Preheat your oven to 350 degrees F (176 degrees C). Prepare the rest of the recipe as it heats up. By the time you finish, your oven will be fully heated and ready. Grease a 12½ x 17½ baking pan (standard cookie sheet). Mix the butter, water, and cocoa together. Measure out these ingredients and place them in a medium-sized sauce pan over low heat. Stir the mixture until the butter has melted completely. Remove the pan from the heat. Add the sugar, vanilla, salt and sour cream. Measure out these ingredients and place them in the sauce pan with the butter mixture. Stir briskly until all of the ingredients are fully incorporated. Add the eggs and continue to stir until everything is completely mixed together. Add the dry ingredients. Measure out the flour and baking soda and put them in a small bowl together. Give the ingredients a quick stir to blend them together. Fold the dry flour mixture into the cake batter. Stir briskly. Keep mixing until all of the dry spots have been eliminated. Do not continue to mix once this has been achieved to avoid a rubbery cake. Pour the batter on the cookie sheet and bake for 17-20 minutes. Carefully pour the batter onto the prepared cookie sheet and slide it into the oven. The cake is ready to take out when you can insert a toothpick into the center and it comes out clean. Make the frosting. Measure out and put the butter and brown sugar into a sauce pan over low-medium heat. Bring the mixture to a simmer, stirring constantly. Continue to stir and allow it to simmer for about two minutes. Then remove it from the heat. Add the cream or milk, vanilla, salt, and powdered sugar and whisk everything together until the consistency is smooth. Frost the cake while it is still warm. Use a spoon or spatula to spread the frosting all over the cake. Crush the pretzels and sprinkle them on top. Serve immediately.",
  "sentences":[
    " Making a Fudgy One-Bowl Chocolate Peanut Butter Pretzel Cake Preheat your oven to 350 degrees F (176 degrees C).",
    "By the time you finish preparing the rest of the recipe, your oven will be fully heated and ready for the cake.",
    "Grease two 8-inch round cake pans.",
    "Line both cake pans with parchment paper, then spray their surfaces with cooking spray.",
    "Mix the dry ingredients together.",
    "Measure out the flour, sugar, cocoa powder, baking soda and salt and place them into a large mixing bowl.",
    "Use a whisk or spoon to mix the dry ingredients together.",
    "Make a well and add the wet ingredients.",
    "Use your fingers or a spoon to scoop out the dry ingredients in the center of the bowl.",
    "This will create a “well” for the wet ingredients.",
    "Add the eggs, buttermilk, canola oil and vanilla to the bowl, placing them directly in the \"well.\"",
    "Whisk the eggs and then mix everything well.",
    "Use a whisk to quickly break up the eggs a bit, then switch to a spoon.",
    "Mix all off the ingredients together, making sure that the wet and dry ingredients are full incorporated.",
    "Continue to mix until the consistency of the batter is mostly smooth.",
    "Add hot coffee and chocolate chips.",
    "Pour the freshly-brewed coffee into the batter.",
    "Use a spoon to mix the coffee into the batter.",
    "Once the coffee is fully incorporated, the batter should be just thin enough to be pourable.",
    "Add a little more coffee if the consistency is too thick.",
    "Then stir in the chocolate chips.",
    "Divide the batter between the two pans.",
    "Carefully pour half of the cake batter into one of your round pans, then pour the other half into the second round pan.",
    "Try to make them as even as possible, but they don’t have to be perfectly identical.",
    "Bake the cakes for 20 to 25 minutes.",
    "Place both pans in your oven and let them bake.",
    "After about 20 minutes, check on them.",
    "They are ready to pull out when the tops of both cakes are set and the center no longer wiggles.",
    "Let them cool for about five minutes.",
    "Transfer the cakes onto plates.",
    "Line two large, flat plates with parchment paper.",
    "Run a knife around the perimeter of each cake to loosen them from their pans, then invert them – one at a time – on the paper-lined plates.",
    "Cover the cakes and allow them to cool.",
    "Make the ganache.",
    "Pour the chocolate, cream and peanut butter into a small saucepan.",
    "Place the pan on your stove’s burner and set the heat to low.",
    "Stir the ingredients frequently as they begin to melt together.",
    "The ganache can burn easily, so make sure you are nearby to stir it regularly.",
    "Assemble the first layer of cake.",
    "Put one of the cakes, flat side up, onto a large plate or cake stand.",
    "Sprinkle a layer of pretzels on the surface of the cake.",
    "Then sprinkle the chopped peanut butter cups on top.",
    "Carefully drizzle about half of the prepared ganache on top of the pretzels.",
    "Assemble the final layer of cake.",
    "Lift the second cake and place it directly on top of the already-assembled layer.",
    "Spread a layer of pretzels on top.",
    "Use the remaining ganache to drizzle all over the cake.",
    "Sprinkle more of the chopped peanut butter cups on top.",
    "If you like, you can wait ten minutes to allow the ganache to set, but this isn’t necessary.",
    "You can serve it immediately if you want to.",
    "Baking a Salted Caramel Pretzel Chocolate Sheet Cake Preheat your oven to 350 degrees F (176 degrees C).",
    "Prepare the rest of the recipe as it heats up.",
    "By the time you finish, your oven will be fully heated and ready.",
    "Grease a 12½ x 17½ baking pan (standard cookie sheet).",
    "Mix the butter, water, and cocoa together.",
    "Measure out these ingredients and place them in a medium-sized sauce pan over low heat.",
    "Stir the mixture until the butter has melted completely.",
    "Remove the pan from the heat.",
    "Add the sugar, vanilla, salt and sour cream.",
    "Measure out these ingredients and place them in the sauce pan with the butter mixture.",
    "Stir briskly until all of the ingredients are fully incorporated.",
    "Add the eggs and continue to stir until everything is completely mixed together.",
    "Add the dry ingredients.",
    "Measure out the flour and baking soda and put them in a small bowl together.",
    "Give the ingredients a quick stir to blend them together.",
    "Fold the dry flour mixture into the cake batter.",
    "Stir briskly.",
    "Keep mixing until all of the dry spots have been eliminated.",
    "Do not continue to mix once this has been achieved to avoid a rubbery cake.",
    "Pour the batter on the cookie sheet and bake for 17-20 minutes.",
    "Carefully pour the batter onto the prepared cookie sheet and slide it into the oven.",
    "The cake is ready to take out when you can insert a toothpick into the center and it comes out clean.",
    "Make the frosting.",
    "Measure out and put the butter and brown sugar into a sauce pan over low-medium heat.",
    "Bring the mixture to a simmer, stirring constantly.",
    "Continue to stir and allow it to simmer for about two minutes.",
    "Then remove it from the heat.",
    "Add the cream or milk, vanilla, salt, and powdered sugar and whisk everything together until the consistency is smooth.",
    "Frost the cake while it is still warm.",
    "Use a spoon or spatula to spread the frosting all over the cake.",
    "Crush the pretzels and sprinkle them on top.",
    "Serve immediately."
  ],
  "tyn_section":[
    "Fudgy One-Bowl Chocolate Peanut Butter Pretzel Cake",
    "Two 8-inch round cake pans",
    "Parchment paper",
    "Cooking spray",
    "Large mixing bowl",
    "Spoon or spatula",
    "Whisk",
    "Two large plates",
    "Cake stand (optional)",
    "Salted Caramel Pretzel Chocolate Sheet Cake",
    "Standard cookie sheet",
    "Sauce pan",
    "Spoon",
    "Medium bowl"
  ],
  "tyn_model":[
    "oven",
    "spoon",
    "coffee",
    "eggs",
    "pretzels",
    "butter",
    "flour",
    "salt",
    "whisk",
    "vanilla",
    "plates",
    "cookie sheet",
    "cake pans",
    "parchment paper",
    "sugar",
    "baking soda",
    "chocolate chips",
    "cake batter",
    "peanut butter",
    "cake",
    "sauce pan",
    "cooking spray",
    "cocoa powder",
    "large mixing bowl",
    "“well",
    "” for",
    "buttermilk",
    "canola oil",
    "bowl",
    "knife",
    "pans",
    "– one",
    "– on",
    "chocolate",
    "cream",
    "small saucepan",
    "stove",
    "large plate",
    "cake stand",
    "peanut butter cups",
    "salted caramel pretzel",
    "baking pan",
    "water",
    "cocoa",
    "medium-sized sauce pan",
    "sour cream",
    "small bowl",
    "brown sugar",
    "cream or milk",
    "powdered sugar",
    "spatula"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.1176470588,
    "f1":0.1846153846,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.2156862745,
    "f1":0.3313253012
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9285714286,
    "p":0.3333333333,
    "f1":0.4905660377
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.1764705882,
    "f1":0.2696629213
  }
}