{
  "title":"How to Make Slow Cooker Sticky Buns",
  "url":"https://www.wikihow.com/Make-Slow-Cooker-Sticky-Buns",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes"
  ],
  "parts":[
    {
      "name":"Making the Glaze",
      "steps":[
        {
          "headline":"Grease the inside of the slow cooker.",
          "description":"To ensure that the buns don’t stick to the slow cooker when they’re finished, it’s important to grease the insert. Spray the interior lightly with nonstick cooking spray. You substitute softened butter for the cooking spray if you prefer."
        },
        {
          "headline":"Combine some of the melted butter and brown sugar.",
          "description":"Add ½ cup (113 ½ g) of melted butter and ½ cup (100 g) of packed brown sugar to a medium size bowl. Stir the two ingredients together until the mixture is smooth. You can use either light or dark brown sugar for the sticky buns."
        },
        {
          "headline":"Spread half of the butter and sugar mixture in the slow cooker.",
          "description":"Once the butter and brown sugar are fully mixed, use a spoon to transfer half of the mixture to the bottom of the slow cooker. Make sure to spread the mixture in an even layer. You can set the bowl with the remaining butter and brown sugar mixture aside. You won’t need it until after you’ve added the biscuits to the slow cooker."
        },
        {
          "headline":"Add half of the pecans.",
          "description":"After you’ve spread some of the butter and brown sugar mixture over the bottom of the slow cooker, sprinkle ½ cup (63 ½ g) of pecan halves over it. Distribute the nuts as evenly as possible throughout the slow cooker. Pecans are traditionally used for sticky buns, but you can substitute walnuts if you prefer. You can sprinkle ½ cup (75 g) of raisins into the slow cooker with the pecans if you like."
        }
      ]
    },
    {
      "name":"Coating the Dough",
      "steps":[
        {
          "headline":"Add the remaining butter and cinnamon sugar to separate bowls.",
          "description":"Pour the remaining ½ cup (113 ½ g) of melted butter into a shallow dish. Add ½ cup (100 g) of cinnamon sugar to a separate shallow dish, and set it next to the dish with the butter. You can use store-bought cinnamon sugar or make you own. Combine ½ cup (100 g) granulated sugar with 2 tablespoons (16 g) of ground cinnamon."
        },
        {
          "headline":"Dip each biscuit in the butter.",
          "description":"Open 1 16-ounce (454 g) can of refrigerated biscuit dough and separate the biscuits on a piece of wax paper or parchment paper. With clean fingers, dunk a biscuit into the melted butter to cover it completely. It’s best to work with one biscuit at a time, so dip one in the butter and move immediately onto the next step before repeating the process with the remaining biscuits. If you want to dip all of the biscuits in the butter before moving onto the next step, set them down on the wax or parchment paper until you’re ready to coat them with the cinnamon sugar."
        },
        {
          "headline":"Roll each biscuit in the cinnamon sugar.",
          "description":"After you’ve dipped the biscuit in the melted butter, place it in the dish with the cinnamon sugar. Toss it through the cinnamon sugar to ensure that it’s completely covered. After you’ve coated each biscuit with the cinnamon sugar, set them down on wax or parchment paper so you don’t make a mess."
        }
      ]
    },
    {
      "name":"Cooking the Sticky Buns",
      "steps":[
        {
          "headline":"Place the coated biscuits in the slow cooker.",
          "description":"Once all of the biscuits are coated in cinnamon sugar, transfer them to the slow cooker. Place them side by side on top of the brown sugar, butter, and pecan mixture. Don’t worry if the biscuits are pressed together in the slow cooker. You’ll be able to separate them later."
        },
        {
          "headline":"Pour the remaining butter and brown sugar mixture and pecans over the biscuits.",
          "description":"When the biscuits are in the slow cooker, drizzle the remaining butter and brown sugar mixture over them, making sure to coat all of the biscuits. Next, sprinkle the remaining ½ cup (63 ½ g) of pecan halves over them. If you added raisins earlier, you can also sprinkle another ½ cup (75 g) over the biscuits."
        },
        {
          "headline":"Cook the biscuits for a couple of hours.",
          "description":"Cover the slow cooker, and and set it to high. Allow the sticky buns to cook for 1 ½ to 2 hours or until the dough is completely cooked through."
        }
      ]
    },
    {
      "name":"Plating the Sticky Buns",
      "steps":[
        {
          "headline":"Remove the slow cooker’s insert.",
          "description":"When the sticky buns are finished cooking, use potholders to carefully lift the insert out of the slow cooker. Set it down on a heat-safe surface, and allow it to cool for approximately 5 minutes. Don’t allow the buns to cool for too long. The syrup may begin to harden, so you’ll have a more difficult time removing the buns."
        },
        {
          "headline":"Run a knife along the inside to loosen the buns.",
          "description":"Once the slow cooker insert has cooled slightly, use a butter knife to loosen the edges of the buns. Be sure to move the knife all around the sides of insert, so the buns don’t stick in any spots. Be sure to use a potholder to hold the insert as you run the butter knife around the edges. It may still be hot enough to burn you."
        },
        {
          "headline":"Turn the insert over  over a plate to free the buns.",
          "description":"After you’ve loosened the sticky buns, carefully invert the insert over a plate, serving platter, or wire cooling rack. If any of the buns are stuck together, use a knife to carefully cut them apart. Serve the sticky buns while they’re still warm. Place any leftover sticky buns in an airtight container and store at room temperature. They should keep for 3 to 4 days."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Glaze Grease the inside of the slow cooker. To ensure that the buns don’t stick to the slow cooker when they’re finished, it’s important to grease the insert. Spray the interior lightly with nonstick cooking spray. You substitute softened butter for the cooking spray if you prefer. Combine some of the melted butter and brown sugar. Add ½ cup (113 ½ g) of melted butter and ½ cup (100 g) of packed brown sugar to a medium size bowl. Stir the two ingredients together until the mixture is smooth. You can use either light or dark brown sugar for the sticky buns. Spread half of the butter and sugar mixture in the slow cooker. Once the butter and brown sugar are fully mixed, use a spoon to transfer half of the mixture to the bottom of the slow cooker. Make sure to spread the mixture in an even layer. You can set the bowl with the remaining butter and brown sugar mixture aside. You won’t need it until after you’ve added the biscuits to the slow cooker. Add half of the pecans. After you’ve spread some of the butter and brown sugar mixture over the bottom of the slow cooker, sprinkle ½ cup (63 ½ g) of pecan halves over it. Distribute the nuts as evenly as possible throughout the slow cooker. Pecans are traditionally used for sticky buns, but you can substitute walnuts if you prefer. You can sprinkle ½ cup (75 g) of raisins into the slow cooker with the pecans if you like. Coating the Dough Add the remaining butter and cinnamon sugar to separate bowls. Pour the remaining ½ cup (113 ½ g) of melted butter into a shallow dish. Add ½ cup (100 g) of cinnamon sugar to a separate shallow dish, and set it next to the dish with the butter. You can use store-bought cinnamon sugar or make you own. Combine ½ cup (100 g) granulated sugar with 2 tablespoons (16 g) of ground cinnamon. Dip each biscuit in the butter. Open 1 16-ounce (454 g) can of refrigerated biscuit dough and separate the biscuits on a piece of wax paper or parchment paper. With clean fingers, dunk a biscuit into the melted butter to cover it completely. It’s best to work with one biscuit at a time, so dip one in the butter and move immediately onto the next step before repeating the process with the remaining biscuits. If you want to dip all of the biscuits in the butter before moving onto the next step, set them down on the wax or parchment paper until you’re ready to coat them with the cinnamon sugar. Roll each biscuit in the cinnamon sugar. After you’ve dipped the biscuit in the melted butter, place it in the dish with the cinnamon sugar. Toss it through the cinnamon sugar to ensure that it’s completely covered. After you’ve coated each biscuit with the cinnamon sugar, set them down on wax or parchment paper so you don’t make a mess. Cooking the Sticky Buns Place the coated biscuits in the slow cooker. Once all of the biscuits are coated in cinnamon sugar, transfer them to the slow cooker. Place them side by side on top of the brown sugar, butter, and pecan mixture. Don’t worry if the biscuits are pressed together in the slow cooker. You’ll be able to separate them later. Pour the remaining butter and brown sugar mixture and pecans over the biscuits. When the biscuits are in the slow cooker, drizzle the remaining butter and brown sugar mixture over them, making sure to coat all of the biscuits. Next, sprinkle the remaining ½ cup (63 ½ g) of pecan halves over them. If you added raisins earlier, you can also sprinkle another ½ cup (75 g) over the biscuits. Cook the biscuits for a couple of hours. Cover the slow cooker, and and set it to high. Allow the sticky buns to cook for 1 ½ to 2 hours or until the dough is completely cooked through. Plating the Sticky Buns Remove the slow cooker’s insert. When the sticky buns are finished cooking, use potholders to carefully lift the insert out of the slow cooker. Set it down on a heat-safe surface, and allow it to cool for approximately 5 minutes. Don’t allow the buns to cool for too long. The syrup may begin to harden, so you’ll have a more difficult time removing the buns. Run a knife along the inside to loosen the buns. Once the slow cooker insert has cooled slightly, use a butter knife to loosen the edges of the buns. Be sure to move the knife all around the sides of insert, so the buns don’t stick in any spots. Be sure to use a potholder to hold the insert as you run the butter knife around the edges. It may still be hot enough to burn you. Turn the insert over  over a plate to free the buns. After you’ve loosened the sticky buns, carefully invert the insert over a plate, serving platter, or wire cooling rack. If any of the buns are stuck together, use a knife to carefully cut them apart. Serve the sticky buns while they’re still warm. Place any leftover sticky buns in an airtight container and store at room temperature. They should keep for 3 to 4 days. Finished. ",
  "sentences":[
    " Making the Glaze Grease the inside of the slow cooker.",
    "To ensure that the buns don’t stick to the slow cooker when they’re finished, it’s important to grease the insert.",
    "Spray the interior lightly with nonstick cooking spray.",
    "You substitute softened butter for the cooking spray if you prefer.",
    "Combine some of the melted butter and brown sugar.",
    "Add ½ cup (113 ½ g) of melted butter and ½ cup (100 g) of packed brown sugar to a medium size bowl.",
    "Stir the two ingredients together until the mixture is smooth.",
    "You can use either light or dark brown sugar for the sticky buns.",
    "Spread half of the butter and sugar mixture in the slow cooker.",
    "Once the butter and brown sugar are fully mixed, use a spoon to transfer half of the mixture to the bottom of the slow cooker.",
    "Make sure to spread the mixture in an even layer.",
    "You can set the bowl with the remaining butter and brown sugar mixture aside.",
    "You won’t need it until after you’ve added the biscuits to the slow cooker.",
    "Add half of the pecans.",
    "After you’ve spread some of the butter and brown sugar mixture over the bottom of the slow cooker, sprinkle ½ cup (63 ½ g) of pecan halves over it.",
    "Distribute the nuts as evenly as possible throughout the slow cooker.",
    "Pecans are traditionally used for sticky buns, but you can substitute walnuts if you prefer.",
    "You can sprinkle ½ cup (75 g) of raisins into the slow cooker with the pecans if you like.",
    "Coating the Dough Add the remaining butter and cinnamon sugar to separate bowls.",
    "Pour the remaining ½ cup (113 ½ g) of melted butter into a shallow dish.",
    "Add ½ cup (100 g) of cinnamon sugar to a separate shallow dish, and set it next to the dish with the butter.",
    "You can use store-bought cinnamon sugar or make you own.",
    "Combine ½ cup (100 g) granulated sugar with 2 tablespoons (16 g) of ground cinnamon.",
    "Dip each biscuit in the butter.",
    "Open 1 16-ounce (454 g) can of refrigerated biscuit dough and separate the biscuits on a piece of wax paper or parchment paper.",
    "With clean fingers, dunk a biscuit into the melted butter to cover it completely.",
    "It’s best to work with one biscuit at a time, so dip one in the butter and move immediately onto the next step before repeating the process with the remaining biscuits.",
    "If you want to dip all of the biscuits in the butter before moving onto the next step, set them down on the wax or parchment paper until you’re ready to coat them with the cinnamon sugar.",
    "Roll each biscuit in the cinnamon sugar.",
    "After you’ve dipped the biscuit in the melted butter, place it in the dish with the cinnamon sugar.",
    "Toss it through the cinnamon sugar to ensure that it’s completely covered.",
    "After you’ve coated each biscuit with the cinnamon sugar, set them down on wax or parchment paper so you don’t make a mess.",
    "Cooking the Sticky Buns Place the coated biscuits in the slow cooker.",
    "Once all of the biscuits are coated in cinnamon sugar, transfer them to the slow cooker.",
    "Place them side by side on top of the brown sugar, butter, and pecan mixture.",
    "Don’t worry if the biscuits are pressed together in the slow cooker.",
    "You’ll be able to separate them later.",
    "Pour the remaining butter and brown sugar mixture and pecans over the biscuits.",
    "When the biscuits are in the slow cooker, drizzle the remaining butter and brown sugar mixture over them, making sure to coat all of the biscuits.",
    "Next, sprinkle the remaining ½ cup (63 ½ g) of pecan halves over them.",
    "If you added raisins earlier, you can also sprinkle another ½ cup (75 g) over the biscuits.",
    "Cook the biscuits for a couple of hours.",
    "Cover the slow cooker, and and set it to high.",
    "Allow the sticky buns to cook for 1 ½ to 2 hours or until the dough is completely cooked through.",
    "Plating the Sticky Buns Remove the slow cooker’s insert.",
    "When the sticky buns are finished cooking, use potholders to carefully lift the insert out of the slow cooker.",
    "Set it down on a heat-safe surface, and allow it to cool for approximately 5 minutes.",
    "Don’t allow the buns to cool for too long.",
    "The syrup may begin to harden, so you’ll have a more difficult time removing the buns.",
    "Run a knife along the inside to loosen the buns.",
    "Once the slow cooker insert has cooled slightly, use a butter knife to loosen the edges of the buns.",
    "Be sure to move the knife all around the sides of insert, so the buns don’t stick in any spots.",
    "Be sure to use a potholder to hold the insert as you run the butter knife around the edges.",
    "It may still be hot enough to burn you.",
    "Turn the insert over  over a plate to free the buns.",
    "After you’ve loosened the sticky buns, carefully invert the insert over a plate, serving platter, or wire cooling rack.",
    "If any of the buns are stuck together, use a knife to carefully cut them apart.",
    "Serve the sticky buns while they’re still warm.",
    "Place any leftover sticky buns in an airtight container and store at room temperature.",
    "They should keep for 3 to 4 days.",
    "Finished."
  ],
  "tyn_section":[
    "Slow cooker",
    "Nonstick cooking spray",
    "Medium size bowl",
    "Wooden spoon",
    "Two shallow dishes",
    "Wax or parchment paper",
    "Potholders",
    "Butter knife",
    "Plate, platter, or cooling rack"
  ],
  "tyn_model":[
    "butter",
    "slow cooker",
    "brown sugar",
    "cinnamon sugar",
    "pecans",
    "knife",
    "pecan",
    "raisins",
    "shallow dish",
    "wax or parchment paper",
    "butter knife",
    "plate",
    "nonstick cooking spray",
    "cooking spray",
    "medium size bowl",
    "sugar",
    "spoon",
    "bowl",
    "biscuits",
    "walnuts",
    "granulated sugar",
    "cinnamon",
    "refrigerated biscuit dough",
    "wax paper or parchment paper",
    "dish",
    "pecan halves",
    "airtight container"
  ],
  "simple_metrics":{
    "r":0.5555555556,
    "p":0.1851851852,
    "f1":0.2777777778,
    "avg_pos":0.037037037
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.3703703704,
    "f1":0.4761904762
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.4074074074,
    "f1":0.5057471264
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5555555556,
    "p":0.2592592593,
    "f1":0.3535353535
  }
}