{
  "title":"How to Make Dessert Kabobs",
  "url":"https://www.wikihow.com/Make-Dessert-Kabobs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "parts":[
    {
      "name":"Choosing Your Fruits",
      "steps":[
        {
          "headline":"Use fresh strawberries.",
          "description":"Strawberries are a popular dessert kabob choice. Trim the tops off of fresh strawberries and then thread them onto kabobs. You can also cut the strawberries in halves or quarters, if they're large. Consider filling the strawberries with a squirt of cream cheese or a chocolate chip."
        },
        {
          "headline":"Add pineapple.",
          "description":"You can slice your own fresh pineapple or use pineapple chunks from a can. Pineapple is a great way to add a little tart flavor to your dessert kabobs. Pineapple is a good fruit to consider grilling before or after assembling your dessert kabob. Coconut and caramel flavors work well with pineapple."
        },
        {
          "headline":"Slice up bananas.",
          "description":"Choose bananas that are starting to show brown spots. Avoid bananas that have green stems (these won't be sweet enough) or have lots of brown spots (these may be too mushy). Slice the bananas into large chunks and thread them onto the skewers. Try slicing a small banana in half lengthwise. Thread the entire half onto a kabob and then lay it flat. Add dessert ingredients on top of the banana split kabob."
        },
        {
          "headline":"Use fresh berries.",
          "description":"Berries are a good way to add unique sweetness and beautiful color to the dessert kabobs. Since they're small, you may want to thread 2 or 3 berries at a time onto the kabob. You could use:\nBlueberries\nRaspberries\nBlackberries\nGrapes"
        }
      ]
    },
    {
      "name":"Adding Desserts to the Kabobs",
      "steps":[
        {
          "headline":"Add cubes of angel food cake.",
          "description":"To make a classic strawberry shortcake dessert kabob, thread fresh strawberries and cubes of angel food cake. Since angel food cake has a mild flavor, it works with most fruits. For something a little richer, try cubes of pound cake."
        },
        {
          "headline":"Make a batch of brownies.",
          "description":"Bake a batch of your favorite brownies. You can then cut them into bite-sized pieces to slide onto the kabobs or use cookie cutters to cut out fun shapes. For example, use a star cookie cutter to make cute brownie stars for your kabobs. You can also purchase mini brownies and thread them directly onto the skewers."
        },
        {
          "headline":"Use mini-cupcakes.",
          "description":"You can buy mini-cupcakes that are already frosted or just make a batch of your own. Slide a few mini-cupcakes onto the skewer alternating with fresh fruit. You can use several different flavors of cupcakes, so your guests can choose their favorite. For another bakery favorite, use donut holes in place of the mini-cupcakes. Look for chocolate covered, crunchy coated, or powdered sugar donut holes."
        },
        {
          "headline":"Add marshmallows.",
          "description":"If you're looking for a few inexpensive ingredients to use in your dessert kabobs, use marshmallows. You can use regular sized marshmallows or even thread miniature marshmallows. Keep in mind that marshmallows on dessert kabobs are easier to eat if they're not grilled. For a rich ingredient, use mini-cream puffs. Just defrost them according to the manufacturer's instructions and slide them onto the skewers."
        },
        {
          "headline":"Make rice krispy treats.",
          "description":"Mix up a batch of no-bake rice krispy treats or purchase them. Cut the treats into bite-sized cubes and insert them onto your dessert kebab skewers. You can also use fun cookie cutters to make shapes. Rice krispy treats work well with strawberries, bananas, and chocolate drizzle."
        }
      ]
    },
    {
      "name":"Garnishing and Serving the Kabobs",
      "steps":[
        {
          "headline":"Consider grilling the dessert kabobs.",
          "description":"If you plan on serving dessert kabobs to a small group, you may want to toss them on the grill for a few minutes. Only grill the dessert kabobs if you'll be using ingredients that would benefit from grilling. For example, you can grill:\nStrawberries\nPound cake\nPineapple\nBananas\nDonut holes"
        },
        {
          "headline":"Drizzle the kabobs with a sauce.",
          "description":"Make your favorite dessert sauces and place them in squeeze bottles. Once you've assembled your kabobs, gently drizzle the kabobs with the sauce. You can also purchase sauces, but you may need to thin them out with a little water in order to drizzle them. Try using:\nChocolate sauce\nCaramel sauce\nWhite chocolate sauce\nRaspberry sauce"
        },
        {
          "headline":"Make a dipping sauce.",
          "description":"If you'd rather give your guests the option of dipping their dessert kabobs into sauces, set out several small bowls of dipping sauces. Just pay attention to which sauces (anything with dairy) will need to be refrigerated until you're ready to serve the kabobs. Set out small bowls of:\nMarshmallow fluff\nCream cheese dip\nFlavored yogurt sauce\nLemon curd"
        },
        {
          "headline":"Garnish the kabobs.",
          "description":"Once you've assembled and set out the kabobs, you may want to sprinkle them with a little garnish, especially if you're not drizzling them with a sauce. You can garnish the kabobs with your favorite sprinkles, flaked coconut, crushed nuts, or whipped cream. Use several of these garnishes, so your guests are sure to find a dessert kabob that they'll enjoy."
        }
      ]
    }
  ],
  "text":" Choosing Your Fruits Use fresh strawberries. Strawberries are a popular dessert kabob choice. Trim the tops off of fresh strawberries and then thread them onto kabobs. You can also cut the strawberries in halves or quarters, if they're large. Consider filling the strawberries with a squirt of cream cheese or a chocolate chip. Add pineapple. You can slice your own fresh pineapple or use pineapple chunks from a can. Pineapple is a great way to add a little tart flavor to your dessert kabobs. Pineapple is a good fruit to consider grilling before or after assembling your dessert kabob. Coconut and caramel flavors work well with pineapple. Slice up bananas. Choose bananas that are starting to show brown spots. Avoid bananas that have green stems (these won't be sweet enough) or have lots of brown spots (these may be too mushy). Slice the bananas into large chunks and thread them onto the skewers. Try slicing a small banana in half lengthwise. Thread the entire half onto a kabob and then lay it flat. Add dessert ingredients on top of the banana split kabob. Use fresh berries. Berries are a good way to add unique sweetness and beautiful color to the dessert kabobs. Since they're small, you may want to thread 2 or 3 berries at a time onto the kabob. You could use:\nBlueberries\nRaspberries\nBlackberries\nGrapes Adding Desserts to the Kabobs Add cubes of angel food cake. To make a classic strawberry shortcake dessert kabob, thread fresh strawberries and cubes of angel food cake. Since angel food cake has a mild flavor, it works with most fruits. For something a little richer, try cubes of pound cake. Make a batch of brownies. Bake a batch of your favorite brownies. You can then cut them into bite-sized pieces to slide onto the kabobs or use cookie cutters to cut out fun shapes. For example, use a star cookie cutter to make cute brownie stars for your kabobs. You can also purchase mini brownies and thread them directly onto the skewers. Use mini-cupcakes. You can buy mini-cupcakes that are already frosted or just make a batch of your own. Slide a few mini-cupcakes onto the skewer alternating with fresh fruit. You can use several different flavors of cupcakes, so your guests can choose their favorite. For another bakery favorite, use donut holes in place of the mini-cupcakes. Look for chocolate covered, crunchy coated, or powdered sugar donut holes. Add marshmallows. If you're looking for a few inexpensive ingredients to use in your dessert kabobs, use marshmallows. You can use regular sized marshmallows or even thread miniature marshmallows. Keep in mind that marshmallows on dessert kabobs are easier to eat if they're not grilled. For a rich ingredient, use mini-cream puffs. Just defrost them according to the manufacturer's instructions and slide them onto the skewers. Make rice krispy treats. Mix up a batch of no-bake rice krispy treats or purchase them. Cut the treats into bite-sized cubes and insert them onto your dessert kebab skewers. You can also use fun cookie cutters to make shapes. Rice krispy treats work well with strawberries, bananas, and chocolate drizzle. Garnishing and Serving the Kabobs Consider grilling the dessert kabobs. If you plan on serving dessert kabobs to a small group, you may want to toss them on the grill for a few minutes. Only grill the dessert kabobs if you'll be using ingredients that would benefit from grilling. For example, you can grill:\nStrawberries\nPound cake\nPineapple\nBananas\nDonut holes Drizzle the kabobs with a sauce. Make your favorite dessert sauces and place them in squeeze bottles. Once you've assembled your kabobs, gently drizzle the kabobs with the sauce. You can also purchase sauces, but you may need to thin them out with a little water in order to drizzle them. Try using:\nChocolate sauce\nCaramel sauce\nWhite chocolate sauce\nRaspberry sauce Make a dipping sauce. If you'd rather give your guests the option of dipping their dessert kabobs into sauces, set out several small bowls of dipping sauces. Just pay attention to which sauces (anything with dairy) will need to be refrigerated until you're ready to serve the kabobs. Set out small bowls of:\nMarshmallow fluff\nCream cheese dip\nFlavored yogurt sauce\nLemon curd Garnish the kabobs. Once you've assembled and set out the kabobs, you may want to sprinkle them with a little garnish, especially if you're not drizzling them with a sauce. You can garnish the kabobs with your favorite sprinkles, flaked coconut, crushed nuts, or whipped cream. Use several of these garnishes, so your guests are sure to find a dessert kabob that they'll enjoy.",
  "sentences":[
    " Choosing Your Fruits Use fresh strawberries.",
    "Strawberries are a popular dessert kabob choice.",
    "Trim the tops off of fresh strawberries and then thread them onto kabobs.",
    "You can also cut the strawberries in halves or quarters, if they're large.",
    "Consider filling the strawberries with a squirt of cream cheese or a chocolate chip.",
    "Add pineapple.",
    "You can slice your own fresh pineapple or use pineapple chunks from a can.",
    "Pineapple is a great way to add a little tart flavor to your dessert kabobs.",
    "Pineapple is a good fruit to consider grilling before or after assembling your dessert kabob.",
    "Coconut and caramel flavors work well with pineapple.",
    "Slice up bananas.",
    "Choose bananas that are starting to show brown spots.",
    "Avoid bananas that have green stems (these won't be sweet enough) or have lots of brown spots (these may be too mushy).",
    "Slice the bananas into large chunks and thread them onto the skewers.",
    "Try slicing a small banana in half lengthwise.",
    "Thread the entire half onto a kabob and then lay it flat.",
    "Add dessert ingredients on top of the banana split kabob.",
    "Use fresh berries.",
    "Berries are a good way to add unique sweetness and beautiful color to the dessert kabobs.",
    "Since they're small, you may want to thread 2 or 3 berries at a time onto the kabob.",
    "You could use:\nBlueberries\nRaspberries\nBlackberries\nGrapes Adding Desserts to the Kabobs Add cubes of angel food cake.",
    "To make a classic strawberry shortcake dessert kabob, thread fresh strawberries and cubes of angel food cake.",
    "Since angel food cake has a mild flavor, it works with most fruits.",
    "For something a little richer, try cubes of pound cake.",
    "Make a batch of brownies.",
    "Bake a batch of your favorite brownies.",
    "You can then cut them into bite-sized pieces to slide onto the kabobs or use cookie cutters to cut out fun shapes.",
    "For example, use a star cookie cutter to make cute brownie stars for your kabobs.",
    "You can also purchase mini brownies and thread them directly onto the skewers.",
    "Use mini-cupcakes.",
    "You can buy mini-cupcakes that are already frosted or just make a batch of your own.",
    "Slide a few mini-cupcakes onto the skewer alternating with fresh fruit.",
    "You can use several different flavors of cupcakes, so your guests can choose their favorite.",
    "For another bakery favorite, use donut holes in place of the mini-cupcakes.",
    "Look for chocolate covered, crunchy coated, or powdered sugar donut holes.",
    "Add marshmallows.",
    "If you're looking for a few inexpensive ingredients to use in your dessert kabobs, use marshmallows.",
    "You can use regular sized marshmallows or even thread miniature marshmallows.",
    "Keep in mind that marshmallows on dessert kabobs are easier to eat if they're not grilled.",
    "For a rich ingredient, use mini-cream puffs.",
    "Just defrost them according to the manufacturer's instructions and slide them onto the skewers.",
    "Make rice krispy treats.",
    "Mix up a batch of no-bake rice krispy treats or purchase them.",
    "Cut the treats into bite-sized cubes and insert them onto your dessert kebab skewers.",
    "You can also use fun cookie cutters to make shapes.",
    "Rice krispy treats work well with strawberries, bananas, and chocolate drizzle.",
    "Garnishing and Serving the Kabobs Consider grilling the dessert kabobs.",
    "If you plan on serving dessert kabobs to a small group, you may want to toss them on the grill for a few minutes.",
    "Only grill the dessert kabobs if you'll be using ingredients that would benefit from grilling.",
    "For example, you can grill:\nStrawberries\nPound cake\nPineapple\nBananas\nDonut holes Drizzle the kabobs with a sauce.",
    "Make your favorite dessert sauces and place them in squeeze bottles.",
    "Once you've assembled your kabobs, gently drizzle the kabobs with the sauce.",
    "You can also purchase sauces, but you may need to thin them out with a little water in order to drizzle them.",
    "Try using:\nChocolate sauce\nCaramel sauce\nWhite chocolate sauce\nRaspberry sauce Make a dipping sauce.",
    "If you'd rather give your guests the option of dipping their dessert kabobs into sauces, set out several small bowls of dipping sauces.",
    "Just pay attention to which sauces (anything with dairy) will need to be refrigerated until you're ready to serve the kabobs.",
    "Set out small bowls of:\nMarshmallow fluff\nCream cheese dip\nFlavored yogurt sauce\nLemon curd Garnish the kabobs.",
    "Once you've assembled and set out the kabobs, you may want to sprinkle them with a little garnish, especially if you're not drizzling them with a sauce.",
    "You can garnish the kabobs with your favorite sprinkles, flaked coconut, crushed nuts, or whipped cream.",
    "Use several of these garnishes, so your guests are sure to find a dessert kabob that they'll enjoy."
  ],
  "tyn_section":[
    "Skewers",
    "Knife and cutting board",
    "Prep bowls"
  ],
  "tyn_model":[
    "strawberries",
    "pineapple",
    "bananas",
    "cupcakes",
    "marshmallows",
    "berries",
    "angel food cake",
    "rice krispy treats",
    "dessert kabobs",
    "skewers",
    "cookie cutters",
    "donut",
    "cream cheese",
    "chocolate chip",
    "banana",
    "kabob",
    "banana split",
    "blueberries",
    "raspberries",
    "blackberries",
    "grapes",
    "strawberry shortcake dessert",
    "pound cake",
    "star cookie cutter",
    "brownies",
    "skewer",
    "powdered sugar",
    "dessert kebab skewers",
    "chocolate",
    "grill",
    "dessert sauces",
    "squeeze bottles",
    "sauces",
    "water",
    "chocolate sauce",
    "raspberry",
    "dipping sauce",
    "marshmallow fluff",
    "cream cheese dip",
    "yogurt sauce",
    "lemon curd",
    "coconut",
    "whipped cream",
    "dessert kabob"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0227272727,
    "f1":0.0425531915,
    "avg_pos":0.2045454545
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0227272727,
    "f1":0.0425531915
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.0454545455,
    "f1":0.08
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0227272727,
    "f1":0.0425531915
  }
}