{
  "title":"How to Plant Snowdrops",
  "url":"https://www.wikihow.com/Plant-Snowdrops",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "methods":[
    {
      "name":"Growing Snowdrops in the Ground",
      "steps":[
        {
          "headline":"Plan your snowdrop planting.",
          "description":"Snowdrops do best in soil that drains well. If 5 to 6 hours after a heavy rain there are still puddles of water in an area, choose a different spot for your planting. Plan to leave at least 3 in (7.6 cm) between plants. Prioritize locations that receive full sunlight to light shade. Generally, full sunlight means that plants will receive 6 to 8 hours of sun throughout the day. Watch the location where you'll plant your snowdrops throughout the day. At certain times, the angle of the sun might be blocked by trees or foliage."
        },
        {
          "headline":"Improve drainage in your soil, if necessary.",
          "description":"If your garden is in an area with poor drainage but you still want to plant some snowdrops, you’ll need to add organic material to make the soil more hospitable. Do this by adding peat moss, compost, ground bark, or decomposed manure to raise the soil level at least 2 to 3 in (5 to 7.6 cm). You can find many kinds of organic, soil drainage improving materials (like decomposed manure) at most home and garden centers, nurseries, and florists."
        },
        {
          "headline":"Plant your snowdrops.",
          "description":"Use a shovel or a spade to dig holes that are deep enough that the pointed top of the snowdrop bulb will be 2 to 3 in (5 to 7.6 cm) beneath the ground. Remember to keep at least 3 in (7.6 cm) of space between plants. When inserting a snowdrop bulb into a hole, orient it so the pointed end of the bulb faces upwards. The best time to plant snowdrop bulbs is in late spring when the initial growth of foliage is dying back. If you cannot plant your bulbs late in spring, buy grown plants that have just flowered but are still green and use these instead. Grown snowdrops should be planted in late spring according to their care instructions. Buy these plants from nurseries and garden centers."
        },
        {
          "headline":"Water your snowdrops well after planting them.",
          "description":"Water will help the bulb settle in the ground. Expect most bulbs to sprout roots in roughly 1 to 2 weeks. However, even though the roots will be active, snowdrops won’t push up out of the soil until late winter or early spring. After your initial heavy watering of newly planted bulbs, you’ll only need to lightly water it. In dry spells, you may need to water moderately, but do so cautiously. Snowdrops are sensitive to overwatering."
        },
        {
          "headline":"Remove foliage after the plant withers.",
          "description":"Allow your snowdrops to keep their foliage until it withers and turns yellow. This will allow your plants to absorb and store more energy for next year. Once the leaves have withered, feel free to cut them with garden shears and remove them. Trimming your snowdrops too early will diminish their health and appearance next year."
        },
        {
          "headline":"Encourage full blooms and growth with fertilizer.",
          "description":"Use a water-soluble fertilizer a few times throughout fall and winter in the areas your snowdrops will grow. This step is not required, but additional nutrients will enable next years’ plants to grow larger, healthier, and with fuller blooms. Regular fertilizing can also extend the life of your bulbs. If you want your snowdrops to last as long as possible before having to replant them, be sure to fertilize."
        },
        {
          "headline":"Treat pests and disease immediately.",
          "description":"Use a gentle antibacterial soap or a natural insecticide. To use soap, you can mix the soap with water in a spray bottle. Then spray the mixture onto the plants. You can find natural insecticides that contain rapeseed oils, which suffocate smaller pests while leaving helpful bugs unharmed."
        }
      ]
    },
    {
      "name":"Cultivating Snowdrops in Pots",
      "steps":[
        {
          "headline":"Fill your pot with soil.",
          "description":"Most kinds of potting soil will be suitable for planting your snowdrops. So long as the soil drains well and the container you’ve chosen had adequate drainage, your snowdrops should flourish. Buy potting soil and pots at your local garden center or nursery. Pots without enough draining can cause your bulbs to rot or become diseased before they can bloom. Check the bottoms of planting containers to verify they have holes in the bottom for drainage."
        },
        {
          "headline":"Plant your snowdrop bulbs.",
          "description":"In a container, you can create a more colorful composition by planting bulbs roughly an inch (2.5 cm) apart. Plant each bulb so its top is 2 to 3 in (5 to 7.6 cm) below the surface of your soil. Bulbs should be planted with the pointed end of the bulb facing upwards. Early blooming snow crocuses are a nice companion plant to go with your snowdrops. Use these to fill out extra space in your pots."
        },
        {
          "headline":"Water your bulbs liberally after planting.",
          "description":"This will help the soil to settle around the bulb, creating a more hospitable environment for it. After doing this, you should only water your snowdrops lightly to moderately. Overwatering is harmful to snowdrops."
        },
        {
          "headline":"Trim dead foliage from snowdrops.",
          "description":"Once the leaves have fully withered and turned yellow, you can remove these from the plant. This can help prevent the buildup of debris in your pot and will keep your plants healthy."
        },
        {
          "headline":"Fertilize your snowdrops.",
          "description":"It’s especially important to fertilize potted plants. Even though the snowdrop is hardy, it won’t have as wide a range of nutrients in its pot as it would in the earth. For this reason, use a water-soluble fertilizer a few times throughout autumn and winter."
        }
      ]
    },
    {
      "name":"Troubleshooting Problems with Your Snowdrops",
      "steps":[
        {
          "headline":"Allow plants damaged by frost time to heal.",
          "description":"Due to the fact that snowdrops are an early blooming flower, it’s common for a late frost to do some damage to them. Winter plants, like snowdrops, are usually able to recover from such shocks naturally with enough time. If you’re concerned your snowdrops might be damaged by a heavy frost or cold snap, lay down some groundcover to protect them, like a layer of hay or a blanket. When using groundcover like a blanket, be careful not to crush new growth. Remember to remove your blanket in the morning so your plants receive sun."
        },
        {
          "headline":"Prevent squirrels from eating planted bulbs.",
          "description":"Squirrels are the most common pest to plague freshly planted bulbs. These animals can be difficult to keep away from your plantings. Play music or have a radio running around bulbs to scare off squirrels, or spray a squirrel repellant around your plants. Predator urine is a common kind of squirrel repellant. It’s available at many home and garden centers and hardware stores."
        },
        {
          "headline":"Avoid overwatering your snowdrops.",
          "description":"If your snowdrops start to die or are looking unhealthy, you may be overwatering them. Snowdrops require only light to moderate watering, and overwatering can cause plants to die or become diseased. Soil that is too damp can also cause fungi or mold to grow on the bulb or roots of snowdrops. Fungi and mold are dangerous to the health of your snowdrops."
        },
        {
          "headline":"Destroy contaminated bulbs.",
          "description":"Fungus can usually be detected in snowdrops when bulbs fail to emerge or the plant collapses amidst a white colored growth. Mold is present when the leaves and flowers of your plants are covered in fuzzy, gray substance. In both cases, you should remove and destroy infected plants/bulbs. There are no chemical treatments to remedy these common snowdrop ailments. Your best option, if you have a fungi or mold outbreak, is to separate and destroying the diseased plants. By adequately spacing your and watering your plants, you can reduce the chances of your plants catching these afflictions."
        }
      ]
    }
  ],
  "text":" Growing Snowdrops in the Ground Plan your snowdrop planting. Snowdrops do best in soil that drains well. If 5 to 6 hours after a heavy rain there are still puddles of water in an area, choose a different spot for your planting. Plan to leave at least 3 in (7.6 cm) between plants. Prioritize locations that receive full sunlight to light shade. Generally, full sunlight means that plants will receive 6 to 8 hours of sun throughout the day. Watch the location where you'll plant your snowdrops throughout the day. At certain times, the angle of the sun might be blocked by trees or foliage. Improve drainage in your soil, if necessary. If your garden is in an area with poor drainage but you still want to plant some snowdrops, you’ll need to add organic material to make the soil more hospitable. Do this by adding peat moss, compost, ground bark, or decomposed manure to raise the soil level at least 2 to 3 in (5 to 7.6 cm). You can find many kinds of organic, soil drainage improving materials (like decomposed manure) at most home and garden centers, nurseries, and florists. Plant your snowdrops. Use a shovel or a spade to dig holes that are deep enough that the pointed top of the snowdrop bulb will be 2 to 3 in (5 to 7.6 cm) beneath the ground. Remember to keep at least 3 in (7.6 cm) of space between plants. When inserting a snowdrop bulb into a hole, orient it so the pointed end of the bulb faces upwards. The best time to plant snowdrop bulbs is in late spring when the initial growth of foliage is dying back. If you cannot plant your bulbs late in spring, buy grown plants that have just flowered but are still green and use these instead. Grown snowdrops should be planted in late spring according to their care instructions. Buy these plants from nurseries and garden centers. Water your snowdrops well after planting them. Water will help the bulb settle in the ground. Expect most bulbs to sprout roots in roughly 1 to 2 weeks. However, even though the roots will be active, snowdrops won’t push up out of the soil until late winter or early spring. After your initial heavy watering of newly planted bulbs, you’ll only need to lightly water it. In dry spells, you may need to water moderately, but do so cautiously. Snowdrops are sensitive to overwatering. Remove foliage after the plant withers. Allow your snowdrops to keep their foliage until it withers and turns yellow. This will allow your plants to absorb and store more energy for next year. Once the leaves have withered, feel free to cut them with garden shears and remove them. Trimming your snowdrops too early will diminish their health and appearance next year. Encourage full blooms and growth with fertilizer. Use a water-soluble fertilizer a few times throughout fall and winter in the areas your snowdrops will grow. This step is not required, but additional nutrients will enable next years’ plants to grow larger, healthier, and with fuller blooms. Regular fertilizing can also extend the life of your bulbs. If you want your snowdrops to last as long as possible before having to replant them, be sure to fertilize. Treat pests and disease immediately. Use a gentle antibacterial soap or a natural insecticide. To use soap, you can mix the soap with water in a spray bottle. Then spray the mixture onto the plants. You can find natural insecticides that contain rapeseed oils, which suffocate smaller pests while leaving helpful bugs unharmed. Cultivating Snowdrops in Pots Fill your pot with soil. Most kinds of potting soil will be suitable for planting your snowdrops. So long as the soil drains well and the container you’ve chosen had adequate drainage, your snowdrops should flourish. Buy potting soil and pots at your local garden center or nursery. Pots without enough draining can cause your bulbs to rot or become diseased before they can bloom. Check the bottoms of planting containers to verify they have holes in the bottom for drainage. Plant your snowdrop bulbs. In a container, you can create a more colorful composition by planting bulbs roughly an inch (2.5 cm) apart. Plant each bulb so its top is 2 to 3 in (5 to 7.6 cm) below the surface of your soil. Bulbs should be planted with the pointed end of the bulb facing upwards. Early blooming snow crocuses are a nice companion plant to go with your snowdrops. Use these to fill out extra space in your pots. Water your bulbs liberally after planting. This will help the soil to settle around the bulb, creating a more hospitable environment for it. After doing this, you should only water your snowdrops lightly to moderately. Overwatering is harmful to snowdrops. Trim dead foliage from snowdrops. Once the leaves have fully withered and turned yellow, you can remove these from the plant. This can help prevent the buildup of debris in your pot and will keep your plants healthy. Fertilize your snowdrops. It’s especially important to fertilize potted plants. Even though the snowdrop is hardy, it won’t have as wide a range of nutrients in its pot as it would in the earth. For this reason, use a water-soluble fertilizer a few times throughout autumn and winter. Troubleshooting Problems with Your Snowdrops Allow plants damaged by frost time to heal. Due to the fact that snowdrops are an early blooming flower, it’s common for a late frost to do some damage to them. Winter plants, like snowdrops, are usually able to recover from such shocks naturally with enough time. If you’re concerned your snowdrops might be damaged by a heavy frost or cold snap, lay down some groundcover to protect them, like a layer of hay or a blanket. When using groundcover like a blanket, be careful not to crush new growth. Remember to remove your blanket in the morning so your plants receive sun. Prevent squirrels from eating planted bulbs. Squirrels are the most common pest to plague freshly planted bulbs. These animals can be difficult to keep away from your plantings. Play music or have a radio running around bulbs to scare off squirrels, or spray a squirrel repellant around your plants. Predator urine is a common kind of squirrel repellant. It’s available at many home and garden centers and hardware stores. Avoid overwatering your snowdrops. If your snowdrops start to die or are looking unhealthy, you may be overwatering them. Snowdrops require only light to moderate watering, and overwatering can cause plants to die or become diseased. Soil that is too damp can also cause fungi or mold to grow on the bulb or roots of snowdrops. Fungi and mold are dangerous to the health of your snowdrops. Destroy contaminated bulbs. Fungus can usually be detected in snowdrops when bulbs fail to emerge or the plant collapses amidst a white colored growth. Mold is present when the leaves and flowers of your plants are covered in fuzzy, gray substance. In both cases, you should remove and destroy infected plants/bulbs. There are no chemical treatments to remedy these common snowdrop ailments. Your best option, if you have a fungi or mold outbreak, is to separate and destroying the diseased plants. By adequately spacing your and watering your plants, you can reduce the chances of your plants catching these afflictions.",
  "sentences":[
    " Growing Snowdrops in the Ground Plan your snowdrop planting.",
    "Snowdrops do best in soil that drains well.",
    "If 5 to 6 hours after a heavy rain there are still puddles of water in an area, choose a different spot for your planting.",
    "Plan to leave at least 3 in (7.6 cm) between plants.",
    "Prioritize locations that receive full sunlight to light shade.",
    "Generally, full sunlight means that plants will receive 6 to 8 hours of sun throughout the day.",
    "Watch the location where you'll plant your snowdrops throughout the day.",
    "At certain times, the angle of the sun might be blocked by trees or foliage.",
    "Improve drainage in your soil, if necessary.",
    "If your garden is in an area with poor drainage but you still want to plant some snowdrops, you’ll need to add organic material to make the soil more hospitable.",
    "Do this by adding peat moss, compost, ground bark, or decomposed manure to raise the soil level at least 2 to 3 in (5 to 7.6 cm).",
    "You can find many kinds of organic, soil drainage improving materials (like decomposed manure) at most home and garden centers, nurseries, and florists.",
    "Plant your snowdrops.",
    "Use a shovel or a spade to dig holes that are deep enough that the pointed top of the snowdrop bulb will be 2 to 3 in (5 to 7.6 cm) beneath the ground.",
    "Remember to keep at least 3 in (7.6 cm) of space between plants.",
    "When inserting a snowdrop bulb into a hole, orient it so the pointed end of the bulb faces upwards.",
    "The best time to plant snowdrop bulbs is in late spring when the initial growth of foliage is dying back.",
    "If you cannot plant your bulbs late in spring, buy grown plants that have just flowered but are still green and use these instead.",
    "Grown snowdrops should be planted in late spring according to their care instructions.",
    "Buy these plants from nurseries and garden centers.",
    "Water your snowdrops well after planting them.",
    "Water will help the bulb settle in the ground.",
    "Expect most bulbs to sprout roots in roughly 1 to 2 weeks.",
    "However, even though the roots will be active, snowdrops won’t push up out of the soil until late winter or early spring.",
    "After your initial heavy watering of newly planted bulbs, you’ll only need to lightly water it.",
    "In dry spells, you may need to water moderately, but do so cautiously.",
    "Snowdrops are sensitive to overwatering.",
    "Remove foliage after the plant withers.",
    "Allow your snowdrops to keep their foliage until it withers and turns yellow.",
    "This will allow your plants to absorb and store more energy for next year.",
    "Once the leaves have withered, feel free to cut them with garden shears and remove them.",
    "Trimming your snowdrops too early will diminish their health and appearance next year.",
    "Encourage full blooms and growth with fertilizer.",
    "Use a water-soluble fertilizer a few times throughout fall and winter in the areas your snowdrops will grow.",
    "This step is not required, but additional nutrients will enable next years’ plants to grow larger, healthier, and with fuller blooms.",
    "Regular fertilizing can also extend the life of your bulbs.",
    "If you want your snowdrops to last as long as possible before having to replant them, be sure to fertilize.",
    "Treat pests and disease immediately.",
    "Use a gentle antibacterial soap or a natural insecticide.",
    "To use soap, you can mix the soap with water in a spray bottle.",
    "Then spray the mixture onto the plants.",
    "You can find natural insecticides that contain rapeseed oils, which suffocate smaller pests while leaving helpful bugs unharmed.",
    "Cultivating Snowdrops in Pots Fill your pot with soil.",
    "Most kinds of potting soil will be suitable for planting your snowdrops.",
    "So long as the soil drains well and the container you’ve chosen had adequate drainage, your snowdrops should flourish.",
    "Buy potting soil and pots at your local garden center or nursery.",
    "Pots without enough draining can cause your bulbs to rot or become diseased before they can bloom.",
    "Check the bottoms of planting containers to verify they have holes in the bottom for drainage.",
    "Plant your snowdrop bulbs.",
    "In a container, you can create a more colorful composition by planting bulbs roughly an inch (2.5 cm) apart.",
    "Plant each bulb so its top is 2 to 3 in (5 to 7.6 cm) below the surface of your soil.",
    "Bulbs should be planted with the pointed end of the bulb facing upwards.",
    "Early blooming snow crocuses are a nice companion plant to go with your snowdrops.",
    "Use these to fill out extra space in your pots.",
    "Water your bulbs liberally after planting.",
    "This will help the soil to settle around the bulb, creating a more hospitable environment for it.",
    "After doing this, you should only water your snowdrops lightly to moderately.",
    "Overwatering is harmful to snowdrops.",
    "Trim dead foliage from snowdrops.",
    "Once the leaves have fully withered and turned yellow, you can remove these from the plant.",
    "This can help prevent the buildup of debris in your pot and will keep your plants healthy.",
    "Fertilize your snowdrops.",
    "It’s especially important to fertilize potted plants.",
    "Even though the snowdrop is hardy, it won’t have as wide a range of nutrients in its pot as it would in the earth.",
    "For this reason, use a water-soluble fertilizer a few times throughout autumn and winter.",
    "Troubleshooting Problems with Your Snowdrops Allow plants damaged by frost time to heal.",
    "Due to the fact that snowdrops are an early blooming flower, it’s common for a late frost to do some damage to them.",
    "Winter plants, like snowdrops, are usually able to recover from such shocks naturally with enough time.",
    "If you’re concerned your snowdrops might be damaged by a heavy frost or cold snap, lay down some groundcover to protect them, like a layer of hay or a blanket.",
    "When using groundcover like a blanket, be careful not to crush new growth.",
    "Remember to remove your blanket in the morning so your plants receive sun.",
    "Prevent squirrels from eating planted bulbs.",
    "Squirrels are the most common pest to plague freshly planted bulbs.",
    "These animals can be difficult to keep away from your plantings.",
    "Play music or have a radio running around bulbs to scare off squirrels, or spray a squirrel repellant around your plants.",
    "Predator urine is a common kind of squirrel repellant.",
    "It’s available at many home and garden centers and hardware stores.",
    "Avoid overwatering your snowdrops.",
    "If your snowdrops start to die or are looking unhealthy, you may be overwatering them.",
    "Snowdrops require only light to moderate watering, and overwatering can cause plants to die or become diseased.",
    "Soil that is too damp can also cause fungi or mold to grow on the bulb or roots of snowdrops.",
    "Fungi and mold are dangerous to the health of your snowdrops.",
    "Destroy contaminated bulbs.",
    "Fungus can usually be detected in snowdrops when bulbs fail to emerge or the plant collapses amidst a white colored growth.",
    "Mold is present when the leaves and flowers of your plants are covered in fuzzy, gray substance.",
    "In both cases, you should remove and destroy infected plants/bulbs.",
    "There are no chemical treatments to remedy these common snowdrop ailments.",
    "Your best option, if you have a fungi or mold outbreak, is to separate and destroying the diseased plants.",
    "By adequately spacing your and watering your plants, you can reduce the chances of your plants catching these afflictions."
  ],
  "tyn_section":[
    "Fertilizer (optional)",
    "Hose (or watering can)",
    "Shovel (or spade)",
    "Snowdrop bulbs",
    "Tape measure",
    "Fertilizer",
    "Potting soil",
    "Spade",
    "Terra cotta pot (or other suitable container)"
  ],
  "tyn_model":[
    "snowdrops",
    "water",
    "fertilizer",
    "soap",
    "potting soil",
    "organic material",
    "peat moss",
    "compost",
    "ground bark",
    "shovel",
    "spade",
    "snowdrop bulb",
    "snowdrop bulbs",
    "garden shears",
    "’ plants",
    "antibacterial soap",
    "natural insecticide",
    "rapeseed oils",
    "soil",
    "pots",
    "garden center",
    "container",
    "snow crocuses",
    "water-soluble fertilizer",
    "frost",
    "hay",
    "groundcover",
    "blanket",
    "squirrel repellant",
    "predator urine"
  ],
  "simple_metrics":{
    "r":0.4444444444,
    "p":0.1333333333,
    "f1":0.2051282051,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5555555556,
    "p":0.2,
    "f1":0.2941176471
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.2666666667,
    "f1":0.380952381
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4444444444,
    "p":0.1333333333,
    "f1":0.2051282051
  }
}