{
  "title":"How to Make Egg Carton Chicks",
  "url":"https://www.wikihow.com/Make-Egg-Carton-Chicks",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "parts":[
    {
      "name":"Making the Body",
      "steps":[
        {
          "headline":"Cut two cups from an egg carton.",
          "description":"The best type of carton to use is the cardboard kind. It soaks up paint much better. You can try using the foam kind, but the paint may not stick as well. Make sure that you cut the cups apart so that they are two separate pieces. Trim the edges so that they are nice and smooth. You want a nice round shape."
        },
        {
          "headline":"Tape the cups together along one edge.",
          "description":"Set the cups down, side by side, with the inside facing up. Fold a strip of masking tape over the edges where the cups are touching. This tape will act as a hinge. For extra security, close the cups, and add a strip of tape on the outside. Make sure that it's on the same side as the inside tape. You want to be able to open and close your chick."
        },
        {
          "headline":"Paint the outside of the cups.",
          "description":"Hold the cups from the inside, with the hinge resting loosely between your thumb and forefinger. Apply a coat of yellow acrylic or tempera paint. Make sure that you get the paint inside the crease between the two cups as well."
        },
        {
          "headline":"Let the paint dry.",
          "description":"If the color looks dull or dark, you may need to apply another coat or two of paint. Let the coat dry before applying the next one."
        },
        {
          "headline":"Consider painting the inside of the chicks.",
          "description":"You don't have to do this, but it will give them a nicer finish. You can use the same color as you did for the outside, or a different color. If you plan on filling the chick with candy, try to use a non-toxic paint. Most children's paints are, but double-check the label to make sure."
        }
      ]
    },
    {
      "name":"Making the Beak, Wings, and Feet",
      "steps":[
        {
          "headline":"Get some orange and yellow paper.",
          "description":"You can use construction paper or cardstock. You can also paint plain paper orange/yellow on both sides, and use that instead."
        },
        {
          "headline":"Cut two triangle shapes out of orange paper for the beak.",
          "description":"Make the beaks a little bit taller than you want them to be. This will allow you to attach them to the chick. The triangles should be the same size, and no larger than the bottom of your egg cups."
        },
        {
          "headline":"Cut two triangle shapes out of yellow paper for the wings.",
          "description":"The triangles can be the same size as the beak, or a little bit bigger. Again, make the wings a little bit longer than you want them to be, so that you can attach them to the chick."
        },
        {
          "headline":"Draw feet shapes onto orange paper.",
          "description":"Chicks have three toes, so draw something that looks like three skinny triangles attached together at the base. You will need two pieces. Make sure that they are smaller than the base of your egg carton cup."
        },
        {
          "headline":"Cut the feet shapes out.",
          "description":"Don't worry about folding the bottom edges to make a hinge."
        }
      ]
    },
    {
      "name":"Putting the Chick Together",
      "steps":[
        {
          "headline":"Glue the feet to the bottom of your chick.",
          "description":"Close the chick and glue the feet to the bottom cup. Make sure that the toes are pointing away from the hinge, and that they are sticking out from under the chick. The hinge will be on the back of the chick."
        },
        {
          "headline":"Open the chick back up.",
          "description":"Set the chick down on the table so that the inside hinge is facing up. Turn the cups so that one cup is facing you and the other is facing away from you."
        },
        {
          "headline":"Glue the beak pieces to the top and bottom cups.",
          "description":"Draw a line of glue along the bottom edges of the orange triangles. Press the triangles against the inside top and bottom edges of the egg cups. The beaks should be parallel to the hinge."
        },
        {
          "headline":"Glue the wings in a similar fashion to the sides of the bottom cup.",
          "description":"This is the cup that has the feet attached. The upper cup should only have the beak piece attached."
        },
        {
          "headline":"Fold the beak and wings down.",
          "description":"When you glued the beak and wing pieces down, they were sticking straight up. This is not very chick-like, so fold them down over the edges of the egg cup. Don't worry if they stick out a little."
        },
        {
          "headline":"Add some eyes to the top cup.",
          "description":"Close the chick and turn it so that the beak is facing you. Use a black marker to draw two dots on the top cup, right above the beak. You can also glue on two tiny googly eyes instead."
        },
        {
          "headline":"Fill the chick with candy, if desired.",
          "description":"You can also turn it into a mini Easter basket by stuffing the bottom cup with Easter grass, and placing a few chocolate eggs on top."
        },
        {
          "headline":"Close the chick.",
          "description":"Set the chick down so that its feet are planted on the floor. You can adjust the beak and wing pieces as well, so that they stick up or down."
        }
      ]
    }
  ],
  "text":" Making the Body Cut two cups from an egg carton. The best type of carton to use is the cardboard kind. It soaks up paint much better. You can try using the foam kind, but the paint may not stick as well. Make sure that you cut the cups apart so that they are two separate pieces. Trim the edges so that they are nice and smooth. You want a nice round shape. Tape the cups together along one edge. Set the cups down, side by side, with the inside facing up. Fold a strip of masking tape over the edges where the cups are touching. This tape will act as a hinge. For extra security, close the cups, and add a strip of tape on the outside. Make sure that it's on the same side as the inside tape. You want to be able to open and close your chick. Paint the outside of the cups. Hold the cups from the inside, with the hinge resting loosely between your thumb and forefinger. Apply a coat of yellow acrylic or tempera paint. Make sure that you get the paint inside the crease between the two cups as well. Let the paint dry. If the color looks dull or dark, you may need to apply another coat or two of paint. Let the coat dry before applying the next one. Consider painting the inside of the chicks. You don't have to do this, but it will give them a nicer finish. You can use the same color as you did for the outside, or a different color. If you plan on filling the chick with candy, try to use a non-toxic paint. Most children's paints are, but double-check the label to make sure. Making the Beak, Wings, and Feet Get some orange and yellow paper. You can use construction paper or cardstock. You can also paint plain paper orange/yellow on both sides, and use that instead. Cut two triangle shapes out of orange paper for the beak. Make the beaks a little bit taller than you want them to be. This will allow you to attach them to the chick. The triangles should be the same size, and no larger than the bottom of your egg cups. Cut two triangle shapes out of yellow paper for the wings. The triangles can be the same size as the beak, or a little bit bigger. Again, make the wings a little bit longer than you want them to be, so that you can attach them to the chick. Draw feet shapes onto orange paper. Chicks have three toes, so draw something that looks like three skinny triangles attached together at the base. You will need two pieces. Make sure that they are smaller than the base of your egg carton cup. Cut the feet shapes out. Don't worry about folding the bottom edges to make a hinge. Putting the Chick Together Glue the feet to the bottom of your chick. Close the chick and glue the feet to the bottom cup. Make sure that the toes are pointing away from the hinge, and that they are sticking out from under the chick. The hinge will be on the back of the chick. Open the chick back up. Set the chick down on the table so that the inside hinge is facing up. Turn the cups so that one cup is facing you and the other is facing away from you. Glue the beak pieces to the top and bottom cups. Draw a line of glue along the bottom edges of the orange triangles. Press the triangles against the inside top and bottom edges of the egg cups. The beaks should be parallel to the hinge. Glue the wings in a similar fashion to the sides of the bottom cup. This is the cup that has the feet attached. The upper cup should only have the beak piece attached. Fold the beak and wings down. When you glued the beak and wing pieces down, they were sticking straight up. This is not very chick-like, so fold them down over the edges of the egg cup. Don't worry if they stick out a little. Add some eyes to the top cup. Close the chick and turn it so that the beak is facing you. Use a black marker to draw two dots on the top cup, right above the beak. You can also glue on two tiny googly eyes instead. Fill the chick with candy, if desired. You can also turn it into a mini Easter basket by stuffing the bottom cup with Easter grass, and placing a few chocolate eggs on top. Close the chick. Set the chick down so that its feet are planted on the floor. You can adjust the beak and wing pieces as well, so that they stick up or down.",
  "sentences":[
    " Making the Body Cut two cups from an egg carton.",
    "The best type of carton to use is the cardboard kind.",
    "It soaks up paint much better.",
    "You can try using the foam kind, but the paint may not stick as well.",
    "Make sure that you cut the cups apart so that they are two separate pieces.",
    "Trim the edges so that they are nice and smooth.",
    "You want a nice round shape.",
    "Tape the cups together along one edge.",
    "Set the cups down, side by side, with the inside facing up.",
    "Fold a strip of masking tape over the edges where the cups are touching.",
    "This tape will act as a hinge.",
    "For extra security, close the cups, and add a strip of tape on the outside.",
    "Make sure that it's on the same side as the inside tape.",
    "You want to be able to open and close your chick.",
    "Paint the outside of the cups.",
    "Hold the cups from the inside, with the hinge resting loosely between your thumb and forefinger.",
    "Apply a coat of yellow acrylic or tempera paint.",
    "Make sure that you get the paint inside the crease between the two cups as well.",
    "Let the paint dry.",
    "If the color looks dull or dark, you may need to apply another coat or two of paint.",
    "Let the coat dry before applying the next one.",
    "Consider painting the inside of the chicks.",
    "You don't have to do this, but it will give them a nicer finish.",
    "You can use the same color as you did for the outside, or a different color.",
    "If you plan on filling the chick with candy, try to use a non-toxic paint.",
    "Most children's paints are, but double-check the label to make sure.",
    "Making the Beak, Wings, and Feet Get some orange and yellow paper.",
    "You can use construction paper or cardstock.",
    "You can also paint plain paper orange/yellow on both sides, and use that instead.",
    "Cut two triangle shapes out of orange paper for the beak.",
    "Make the beaks a little bit taller than you want them to be.",
    "This will allow you to attach them to the chick.",
    "The triangles should be the same size, and no larger than the bottom of your egg cups.",
    "Cut two triangle shapes out of yellow paper for the wings.",
    "The triangles can be the same size as the beak, or a little bit bigger.",
    "Again, make the wings a little bit longer than you want them to be, so that you can attach them to the chick.",
    "Draw feet shapes onto orange paper.",
    "Chicks have three toes, so draw something that looks like three skinny triangles attached together at the base.",
    "You will need two pieces.",
    "Make sure that they are smaller than the base of your egg carton cup.",
    "Cut the feet shapes out.",
    "Don't worry about folding the bottom edges to make a hinge.",
    "Putting the Chick Together Glue the feet to the bottom of your chick.",
    "Close the chick and glue the feet to the bottom cup.",
    "Make sure that the toes are pointing away from the hinge, and that they are sticking out from under the chick.",
    "The hinge will be on the back of the chick.",
    "Open the chick back up.",
    "Set the chick down on the table so that the inside hinge is facing up.",
    "Turn the cups so that one cup is facing you and the other is facing away from you.",
    "Glue the beak pieces to the top and bottom cups.",
    "Draw a line of glue along the bottom edges of the orange triangles.",
    "Press the triangles against the inside top and bottom edges of the egg cups.",
    "The beaks should be parallel to the hinge.",
    "Glue the wings in a similar fashion to the sides of the bottom cup.",
    "This is the cup that has the feet attached.",
    "The upper cup should only have the beak piece attached.",
    "Fold the beak and wings down.",
    "When you glued the beak and wing pieces down, they were sticking straight up.",
    "This is not very chick-like, so fold them down over the edges of the egg cup.",
    "Don't worry if they stick out a little.",
    "Add some eyes to the top cup.",
    "Close the chick and turn it so that the beak is facing you.",
    "Use a black marker to draw two dots on the top cup, right above the beak.",
    "You can also glue on two tiny googly eyes instead.",
    "Fill the chick with candy, if desired.",
    "You can also turn it into a mini Easter basket by stuffing the bottom cup with Easter grass, and placing a few chocolate eggs on top.",
    "Close the chick.",
    "Set the chick down so that its feet are planted on the floor.",
    "You can adjust the beak and wing pieces as well, so that they stick up or down."
  ],
  "tyn_section":[
    "Cardboard egg carton",
    "Yellow acrylic or tempera paint",
    "Paint brush",
    "Yellow paper",
    "Orange paper",
    "Scissors",
    "Glue",
    "Black marker or googly eyes"
  ],
  "tyn_model":[
    "glue",
    "paint",
    "egg carton",
    "tape",
    "candy",
    "orange paper",
    "masking tape",
    "yellow acrylic or tempera paint",
    "children's paints",
    "construction paper",
    "egg cups",
    "yellow paper",
    "table",
    "cups",
    "black marker",
    "easter grass"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.375,
    "f1":0.5
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.5,
    "f1":0.6363636364
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.3125,
    "f1":0.4166666667
  }
}