{
  "title":"How to Make Beer Cheese",
  "url":"https://www.wikihow.com/Make-Beer-Cheese",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Cheese"
  ],
  "methods":[
    {
      "name":"Cooking Mild Garlic Beer Cheese",
      "steps":[
        {
          "headline":"Rub garlic on your saucepan and then grease it.",
          "description":"Take your peeled and halved garlic and rub it on the inside of your saucepan. Discard the garlic afterwards. Insert the butter into the pan and heat it over a low heat. Roll the melted butter in the pan to evenly distribute it."
        },
        {
          "headline":"Add flour and beer.",
          "description":"Sprinkle your flour into the butter a little at time, stirring it in with a whisk as you do so. Continue to stir these ingredients while cooking them like this for about 2 minutes. Then stir in your beer."
        },
        {
          "headline":"Bring the mixture to a boil.",
          "description":"At this point, you should increase the heat to your saucepan to medium-high. Heat the mixture until it boils, then reduce the heat so it stays at a steady boil. Stir it constantly throughout this process, and allow the mixture to boil for roughly 2 to 3 minutes. When the mixture is thick and smooth, it’s done. Depending on your stove top, it may take more or less time for the mixture to reach this consistency."
        },
        {
          "headline":"Pour your cheese into the mixture a little at a time.",
          "description":"Reduce the saucepan’s heat to low. Add your cheese to the mixture in ½ cup (118 ml) increments. While doing so, stir it with a wooden spoon or a similar kitchen utensil until the cheese is fully melted and the mixture is smooth. Add cheese in this way until no more cheese remains. Continue stirring throughout the process with a utensil."
        },
        {
          "headline":"Serve your beer cheese.",
          "description":"Pour your beer cheese from the saucepan into a serving container, a crockpot, or a fondue pot. If you use a serving container, eat your cheese quickly so it doesn’t cool down too much or thicken excessively. Crockpots and fondue pots will keep your beer cheese warm throughout a party or event. You may want to add some garnish to your beer cheese to improve its presentation or modify the recipe. Chopped onions and parsley flakes, for example, are an excellent addition. Store leftovers in an airtight container in the refrigerator. In most cases, this recipe will keep for at least 5 to 7 days."
        }
      ]
    },
    {
      "name":"Preparing Rich and Creamy Beer Cheese",
      "steps":[
        {
          "headline":"Combine your cheese and cornstarch in a bowl.",
          "description":"In a medium sized mixing bowl, use your clean hands or a kitchen implement to toss your cheese and cornstarch together. Do so until the two are evenly mixed. The cornstarch will create a creamier, thicker, cheesier consistency. When you’ve finished mixing these two ingredients, set the bowl off to the side to be used later."
        },
        {
          "headline":"Mix the beer, milk, mustard, and Worcestershire sauce.",
          "description":"Blend these ingredients together in your saucepan with a whisk while the pan is still cold. When thoroughly mixed, heat this over medium heat until the mixture is steaming lightly. While heating these ingredients, stir them frequently with your whisk. This will prevent the ingredients from getting scorched."
        },
        {
          "headline":"Stir in your cheese.",
          "description":"Little by little, stir in your cheese. The mixture will thicken as you add cheese, so you should use a sturdy utensil like a wooden spoon to mix it. Continue stirring and adding cheese until no more cheese remains and the mixture is thick and lightly bubbling."
        },
        {
          "headline":"Add hot sauce and salt to the mixture, then enjoy.",
          "description":"Use your wooden spoon to stir in and evenly distribute the hot sauce in the mixture. Taste it and add salt to taste. Now it is finished and should be served immediately. You can keep your beer cheese hot and prevent it from thickening too much with a fondue pot or a crockpot."
        }
      ]
    },
    {
      "name":"Making the Most of Your Beer Cheese",
      "steps":[
        {
          "headline":"Enjoy your beer cheese with chips and pretzels.",
          "description":"These classic dippers are perfect for scooping up and enjoying beer cheese. This combination, however, can sometimes be a little salty, so you might want to serve chips and pretzels with assorted vegetables, like carrot sticks and cucumbers. There are many different kinds of chip you can use for your beer cheese. Thicker chips, like pita chips, will be sturdier and allow for bigger bites of cheese."
        },
        {
          "headline":"Drizzle your beer cheese on pretzel bread.",
          "description":"Pretzel bread has a salty, brown outer crust but a tender texture. This texture pairs very well with beer cheese. Try drizzling the cheese over the tops of pretzel rolls or dipping pretzel rolls into the cheese. Pretzel bread can be bought at many bakeries. Even if it's not a normal menu item, you can frequently special order it."
        },
        {
          "headline":"Dip finger food into the beer cheese.",
          "description":"Cut a hearty bread, like a baguette or peasant bread, into cubes. Do this also for ham and cucumbers. Cut onions into strips. Arrange these on a tray and serve them with your beer cheese. Dip these cubed foods into the cheese and enjoy. Carrot sticks and whole pieces of broccoli also work well as dippers for beer cheese. Experiment with various veggies to find which best suit your tastes."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Cooking Mild Garlic Beer Cheese Rub garlic on your saucepan and then grease it. Take your peeled and halved garlic and rub it on the inside of your saucepan. Discard the garlic afterwards. Insert the butter into the pan and heat it over a low heat. Roll the melted butter in the pan to evenly distribute it. Add flour and beer. Sprinkle your flour into the butter a little at time, stirring it in with a whisk as you do so. Continue to stir these ingredients while cooking them like this for about 2 minutes. Then stir in your beer. Bring the mixture to a boil. At this point, you should increase the heat to your saucepan to medium-high. Heat the mixture until it boils, then reduce the heat so it stays at a steady boil. Stir it constantly throughout this process, and allow the mixture to boil for roughly 2 to 3 minutes. When the mixture is thick and smooth, it’s done. Depending on your stove top, it may take more or less time for the mixture to reach this consistency. Pour your cheese into the mixture a little at a time. Reduce the saucepan’s heat to low. Add your cheese to the mixture in ½ cup (118 ml) increments. While doing so, stir it with a wooden spoon or a similar kitchen utensil until the cheese is fully melted and the mixture is smooth. Add cheese in this way until no more cheese remains. Continue stirring throughout the process with a utensil. Serve your beer cheese. Pour your beer cheese from the saucepan into a serving container, a crockpot, or a fondue pot. If you use a serving container, eat your cheese quickly so it doesn’t cool down too much or thicken excessively. Crockpots and fondue pots will keep your beer cheese warm throughout a party or event. You may want to add some garnish to your beer cheese to improve its presentation or modify the recipe. Chopped onions and parsley flakes, for example, are an excellent addition. Store leftovers in an airtight container in the refrigerator. In most cases, this recipe will keep for at least 5 to 7 days. Preparing Rich and Creamy Beer Cheese Combine your cheese and cornstarch in a bowl. In a medium sized mixing bowl, use your clean hands or a kitchen implement to toss your cheese and cornstarch together. Do so until the two are evenly mixed. The cornstarch will create a creamier, thicker, cheesier consistency. When you’ve finished mixing these two ingredients, set the bowl off to the side to be used later. Mix the beer, milk, mustard, and Worcestershire sauce. Blend these ingredients together in your saucepan with a whisk while the pan is still cold. When thoroughly mixed, heat this over medium heat until the mixture is steaming lightly. While heating these ingredients, stir them frequently with your whisk. This will prevent the ingredients from getting scorched. Stir in your cheese. Little by little, stir in your cheese. The mixture will thicken as you add cheese, so you should use a sturdy utensil like a wooden spoon to mix it. Continue stirring and adding cheese until no more cheese remains and the mixture is thick and lightly bubbling. Add hot sauce and salt to the mixture, then enjoy. Use your wooden spoon to stir in and evenly distribute the hot sauce in the mixture. Taste it and add salt to taste. Now it is finished and should be served immediately. You can keep your beer cheese hot and prevent it from thickening too much with a fondue pot or a crockpot. Making the Most of Your Beer Cheese Enjoy your beer cheese with chips and pretzels. These classic dippers are perfect for scooping up and enjoying beer cheese. This combination, however, can sometimes be a little salty, so you might want to serve chips and pretzels with assorted vegetables, like carrot sticks and cucumbers. There are many different kinds of chip you can use for your beer cheese. Thicker chips, like pita chips, will be sturdier and allow for bigger bites of cheese. Drizzle your beer cheese on pretzel bread. Pretzel bread has a salty, brown outer crust but a tender texture. This texture pairs very well with beer cheese. Try drizzling the cheese over the tops of pretzel rolls or dipping pretzel rolls into the cheese. Pretzel bread can be bought at many bakeries. Even if it's not a normal menu item, you can frequently special order it. Dip finger food into the beer cheese. Cut a hearty bread, like a baguette or peasant bread, into cubes. Do this also for ham and cucumbers. Cut onions into strips. Arrange these on a tray and serve them with your beer cheese. Dip these cubed foods into the cheese and enjoy. Carrot sticks and whole pieces of broccoli also work well as dippers for beer cheese. Experiment with various veggies to find which best suit your tastes. Finished. ",
  "sentences":[
    " Cooking Mild Garlic Beer Cheese Rub garlic on your saucepan and then grease it.",
    "Take your peeled and halved garlic and rub it on the inside of your saucepan.",
    "Discard the garlic afterwards.",
    "Insert the butter into the pan and heat it over a low heat.",
    "Roll the melted butter in the pan to evenly distribute it.",
    "Add flour and beer.",
    "Sprinkle your flour into the butter a little at time, stirring it in with a whisk as you do so.",
    "Continue to stir these ingredients while cooking them like this for about 2 minutes.",
    "Then stir in your beer.",
    "Bring the mixture to a boil.",
    "At this point, you should increase the heat to your saucepan to medium-high.",
    "Heat the mixture until it boils, then reduce the heat so it stays at a steady boil.",
    "Stir it constantly throughout this process, and allow the mixture to boil for roughly 2 to 3 minutes.",
    "When the mixture is thick and smooth, it’s done.",
    "Depending on your stove top, it may take more or less time for the mixture to reach this consistency.",
    "Pour your cheese into the mixture a little at a time.",
    "Reduce the saucepan’s heat to low.",
    "Add your cheese to the mixture in ½ cup (118 ml) increments.",
    "While doing so, stir it with a wooden spoon or a similar kitchen utensil until the cheese is fully melted and the mixture is smooth.",
    "Add cheese in this way until no more cheese remains.",
    "Continue stirring throughout the process with a utensil.",
    "Serve your beer cheese.",
    "Pour your beer cheese from the saucepan into a serving container, a crockpot, or a fondue pot.",
    "If you use a serving container, eat your cheese quickly so it doesn’t cool down too much or thicken excessively.",
    "Crockpots and fondue pots will keep your beer cheese warm throughout a party or event.",
    "You may want to add some garnish to your beer cheese to improve its presentation or modify the recipe.",
    "Chopped onions and parsley flakes, for example, are an excellent addition.",
    "Store leftovers in an airtight container in the refrigerator.",
    "In most cases, this recipe will keep for at least 5 to 7 days.",
    "Preparing Rich and Creamy Beer Cheese Combine your cheese and cornstarch in a bowl.",
    "In a medium sized mixing bowl, use your clean hands or a kitchen implement to toss your cheese and cornstarch together.",
    "Do so until the two are evenly mixed.",
    "The cornstarch will create a creamier, thicker, cheesier consistency.",
    "When you’ve finished mixing these two ingredients, set the bowl off to the side to be used later.",
    "Mix the beer, milk, mustard, and Worcestershire sauce.",
    "Blend these ingredients together in your saucepan with a whisk while the pan is still cold.",
    "When thoroughly mixed, heat this over medium heat until the mixture is steaming lightly.",
    "While heating these ingredients, stir them frequently with your whisk.",
    "This will prevent the ingredients from getting scorched.",
    "Stir in your cheese.",
    "Little by little, stir in your cheese.",
    "The mixture will thicken as you add cheese, so you should use a sturdy utensil like a wooden spoon to mix it.",
    "Continue stirring and adding cheese until no more cheese remains and the mixture is thick and lightly bubbling.",
    "Add hot sauce and salt to the mixture, then enjoy.",
    "Use your wooden spoon to stir in and evenly distribute the hot sauce in the mixture.",
    "Taste it and add salt to taste.",
    "Now it is finished and should be served immediately.",
    "You can keep your beer cheese hot and prevent it from thickening too much with a fondue pot or a crockpot.",
    "Making the Most of Your Beer Cheese Enjoy your beer cheese with chips and pretzels.",
    "These classic dippers are perfect for scooping up and enjoying beer cheese.",
    "This combination, however, can sometimes be a little salty, so you might want to serve chips and pretzels with assorted vegetables, like carrot sticks and cucumbers.",
    "There are many different kinds of chip you can use for your beer cheese.",
    "Thicker chips, like pita chips, will be sturdier and allow for bigger bites of cheese.",
    "Drizzle your beer cheese on pretzel bread.",
    "Pretzel bread has a salty, brown outer crust but a tender texture.",
    "This texture pairs very well with beer cheese.",
    "Try drizzling the cheese over the tops of pretzel rolls or dipping pretzel rolls into the cheese.",
    "Pretzel bread can be bought at many bakeries.",
    "Even if it's not a normal menu item, you can frequently special order it.",
    "Dip finger food into the beer cheese.",
    "Cut a hearty bread, like a baguette or peasant bread, into cubes.",
    "Do this also for ham and cucumbers.",
    "Cut onions into strips.",
    "Arrange these on a tray and serve them with your beer cheese.",
    "Dip these cubed foods into the cheese and enjoy.",
    "Carrot sticks and whole pieces of broccoli also work well as dippers for beer cheese.",
    "Experiment with various veggies to find which best suit your tastes.",
    "Finished."
  ],
  "tyn_section":[
    "Mild Garlic Beer Cheese",
    "Fondue pot (or similar serving container)",
    "Saucepan (at least 3 quarts (2.8 L) large)",
    "Whisk (or fork)",
    "Wooden soon (or similar utensil)",
    "Rich and Creamy Beer Cheese",
    "Mixing bowl (medium size)",
    "Saucepan (medium size)",
    "Wooden spoon (or similar utensil)"
  ],
  "tyn_model":[
    "saucepan",
    "cheese",
    "beer cheese",
    "garlic",
    "butter",
    "beer",
    "whisk",
    "cornstarch",
    "pretzel bread",
    "flour",
    "wooden spoon",
    "crockpot",
    "fondue pot",
    "onions",
    "bowl",
    "hot sauce",
    "salt",
    "pretzels",
    "cucumbers",
    "pretzel rolls",
    "garlic beer cheese",
    "stove top",
    "kitchen utensil",
    "crockpots",
    "fondue pots",
    "parsley",
    "airtight container",
    "refrigerator",
    "mixing bowl",
    "kitchen implement",
    "milk",
    "mustard",
    "worcestershire sauce",
    "chips",
    "carrot sticks",
    "pita chips",
    "ham",
    "tray",
    "carrot",
    "broccoli"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2222222222,
    "p":0.075,
    "f1":0.1121495327
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7777777778,
    "p":0.175,
    "f1":0.2857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1111111111,
    "p":0.025,
    "f1":0.0408163265
  }
}