{
  "title":"How to Make Cheesy Monkey Bread",
  "url":"https://www.wikihow.com/Make-Cheesy-Monkey-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Bread Making Tips"
  ],
  "methods":[
    {
      "name":"Making Cheesy Monkey Bread With Refrigerator Biscuits",
      "steps":[
        {
          "headline":"Prepare the oven, pan, and cheesy spice mixture.",
          "description":"Turn the oven on to 350 degrees F (180 C) and move a rack to the lower third of the oven. Spray a Bundt or tube pan with cooking spray. Set it aside while you mix together the cheesy spice mixture. Get out a small bowl and mix together:\n1 cup (100 g) of finely grated Parmesan\n1 teaspoon of dried oregano\n1/4 teaspoon of granulated garlic\n1/4 teaspoon of dried rosemary\n1/4 teaspoon of dried thyme"
        },
        {
          "headline":"Roll the biscuits into balls and coat them with oil.",
          "description":"Open 2 packages (920 g total) of prepared refrigerator biscuits. Use kitchen shears or a sharp knife to cut each biscuit in half. Roll each half between your palms to make a dough ball. Put 8 dough balls in a mixing bowl and pour 2 tablespoons of the extra-virgin olive oil over them. Toss them gently. You'll need to oil and roll the dough balls in batches, so they're evenly coated with oil and cheesy spice."
        },
        {
          "headline":"Roll the dough balls in the cheesy spice mixture.",
          "description":"Transfer the oiled dough balls to the bowl with the cheesy spice mixture. Roll them, so they're completely coated and place them in the prepared Bundt or tube pan. Roll the remaining dough balls in the oil and cheesy spice mixture in batches of 8. You'll need to add 2 teaspoons of oil to each batch. You may need to overlap some of the seasoned dough balls to get them to fit in the pan."
        },
        {
          "headline":"Bake the cheesy monkey bread.",
          "description":"Put the pan of cheesy monkey bread dough in the preheated oven and bake it for 50 minutes. The monkey bread should puff up and turn golden brown. Remember to place it on the lower rack of the oven, so the pan will fit. Check the monkey bread after about 30 minutes of baking. If the monkey bread is turning brown quickly, you can lay a sheet of aluminum foil over it, so it can finish cooking."
        },
        {
          "headline":"Cool and serve the monkey bread.",
          "description":"Remove the bread from the oven and let it cool for 10 minutes in the pan. Run a thin, offset spatula around the sides of the pan to loosen the monkey bread. Set baking sheet on the pan and carefully flip the bread over and onto the baking sheet. You can transfer the bread to a serving plate. Remember to wear oven mitts while you invert the monkey bread onto the baking sheet since the pan will be hot."
        }
      ]
    },
    {
      "name":"Making Cheesy Monkey Bread From Scratch",
      "steps":[
        {
          "headline":"Combine the liquid dough ingredients with the sugar and yeast.",
          "description":"Get out a large mixing bowl. Melt 2 tablespoons of unsalted butter in the bowl and add 1 cup (240 ml) of warm milk and 1/3 cup (80 ml) of warm water. Whisk in 2 tablespoons of granulated sugar and 1 tablespoon of instant yeast until the sugar and yeast dissolve. The sugar will help feed the yeast, so it activates and foams a little."
        },
        {
          "headline":"Beat the flour and salt with the liquid dough ingredients.",
          "description":"Get out another mixing bowl that you can fit into a stand mixer. Place 3 1/4 cups (406 g) of all-purpose flour in the bowl along with 2 teaspoons of kosher salt. Turn the mixer on low speed and gradually pour in the liquid mixture. Turn the speed up to medium and beat the dough for 6 to 7 minutes. The dough should become smooth. If it's still sticking to the sides of the bowl, you can add a tablespoon of extra flour at a time until the dough forms a shiny ball. If you don’t have a stand mixer, you can beat the dough in a large bowl with a wooden spoon. It may just take longer for the dough to come together."
        },
        {
          "headline":"Knead the dough and let it prove.",
          "description":"Sprinkle some flour onto your work surface and dump the dough out onto it. Knead the dough (turning and folding the dough with your palms) for about 5 to 6 minutes. The dough should become smooth and elastic. Rub a little vegetable oil along the inside of a large bowl and place the ball of dough in it. Turn the ball, so it's coated with the oil. Cover the mixing bowl with plastic wrap and put it in a warm place to prove. Let it set for 1 hour. The dough should double in volume, so you'll need to put it in a large mixing bowl."
        },
        {
          "headline":"Combine the cheese filling mixture.",
          "description":"While the dough proves, grate 3 cups (300 g) of cheddar cheese. Put 2 cups (200 g) of the cheese into a prep bowl and set the other cup (100 g) of cheese aside. Mince 4 scallions and add it to the prep bowl with the 2 cups (200 g) of cheese. You'll use the reserved cheddar cheese for sprinkling over the top of the monkey bread."
        },
        {
          "headline":"Fill the dough and form small cheesy pieces.",
          "description":"Once the dough has doubled in size, sprinkle more flour on your work surface and dump the dough onto it. Use your hands to form the dough into a 10-inch (25 cm) square. Spread the cheese and scallion mixture across half of the dough. Fold the other side of dough over the filling and use a rolling pin to roll the dough into a square. Cut the dough into 1-inch (2.5 cm) pieces. You can use a sharp knife or a bench scraper to cut the dough into even pieces."
        },
        {
          "headline":"Combine the butter coating and prepare your pan.",
          "description":"Get out another small bowl and melt 8 tablespoons (113 g) of unsalted butter in it. Stir in 1 teaspoon of garlic powder, 1 teaspoon of paprika, and 1/2 teaspoon of black pepper. You should also spread a Bundt pan with a few tablespoons of softened butter. This will keep the monkey bread from sticking to it. You can use your fingers or a pastry brush to coat the pan with the butter."
        },
        {
          "headline":"Roll the dough pieces in the butter coating.",
          "description":"Take each piece of cheesy dough and roll it in the melted butter mixture. Place each coated piece in the prepared Bundt pan. Once you have a layer of dough balls, sprinkle them with some of the reserved cheddar cheese and continue to layer the rest of the dough on top. You can place each piece of dough on a fork and dip it into the butter. This will allow the extra butter to drip back into the bowl."
        },
        {
          "headline":"Prove the cheesy monkey bread and preheat the oven.",
          "description":"Wrap the top of the Bundt pan with plastic wrap and set the pan in a warm place to prove. Let it sit for 1 hour, so the dough balls rise to about 2-inches (5 cm) below the top of the pan. You should turn on the oven to 350 degrees F (180 C) once the bread has almost finished proving. It may take a little longer for your bread to prove enough. For example, you might need to prove the dough for 1 hour to 1 1/2 hours."
        },
        {
          "headline":"Bake the bread and invert it onto a plate.",
          "description":"Take the plastic wrap off of the bread and place the bread in the oven. Bake it for 35 to 40 minutes. It should turn a dark, golden brown once it's finished baking. Remove the pan from the oven and let the bread cool for 5 minutes. Set a plate over the pan and carefully flip it over, so the bread is inverted onto the plate. Finish cooling the bread for 10 more minutes before you serve it. You should wear oven mitts when you invert the bread since the Bundt pan will still be hot."
        }
      ]
    }
  ],
  "text":" Making Cheesy Monkey Bread With Refrigerator Biscuits Prepare the oven, pan, and cheesy spice mixture. Turn the oven on to 350 degrees F (180 C) and move a rack to the lower third of the oven. Spray a Bundt or tube pan with cooking spray. Set it aside while you mix together the cheesy spice mixture. Get out a small bowl and mix together:\n1 cup (100 g) of finely grated Parmesan\n1 teaspoon of dried oregano\n1/4 teaspoon of granulated garlic\n1/4 teaspoon of dried rosemary\n1/4 teaspoon of dried thyme Roll the biscuits into balls and coat them with oil. Open 2 packages (920 g total) of prepared refrigerator biscuits. Use kitchen shears or a sharp knife to cut each biscuit in half. Roll each half between your palms to make a dough ball. Put 8 dough balls in a mixing bowl and pour 2 tablespoons of the extra-virgin olive oil over them. Toss them gently. You'll need to oil and roll the dough balls in batches, so they're evenly coated with oil and cheesy spice. Roll the dough balls in the cheesy spice mixture. Transfer the oiled dough balls to the bowl with the cheesy spice mixture. Roll them, so they're completely coated and place them in the prepared Bundt or tube pan. Roll the remaining dough balls in the oil and cheesy spice mixture in batches of 8. You'll need to add 2 teaspoons of oil to each batch. You may need to overlap some of the seasoned dough balls to get them to fit in the pan. Bake the cheesy monkey bread. Put the pan of cheesy monkey bread dough in the preheated oven and bake it for 50 minutes. The monkey bread should puff up and turn golden brown. Remember to place it on the lower rack of the oven, so the pan will fit. Check the monkey bread after about 30 minutes of baking. If the monkey bread is turning brown quickly, you can lay a sheet of aluminum foil over it, so it can finish cooking. Cool and serve the monkey bread. Remove the bread from the oven and let it cool for 10 minutes in the pan. Run a thin, offset spatula around the sides of the pan to loosen the monkey bread. Set baking sheet on the pan and carefully flip the bread over and onto the baking sheet. You can transfer the bread to a serving plate. Remember to wear oven mitts while you invert the monkey bread onto the baking sheet since the pan will be hot. Making Cheesy Monkey Bread From Scratch Combine the liquid dough ingredients with the sugar and yeast. Get out a large mixing bowl. Melt 2 tablespoons of unsalted butter in the bowl and add 1 cup (240 ml) of warm milk and 1/3 cup (80 ml) of warm water. Whisk in 2 tablespoons of granulated sugar and 1 tablespoon of instant yeast until the sugar and yeast dissolve. The sugar will help feed the yeast, so it activates and foams a little. Beat the flour and salt with the liquid dough ingredients. Get out another mixing bowl that you can fit into a stand mixer. Place 3 1/4 cups (406 g) of all-purpose flour in the bowl along with 2 teaspoons of kosher salt. Turn the mixer on low speed and gradually pour in the liquid mixture. Turn the speed up to medium and beat the dough for 6 to 7 minutes. The dough should become smooth. If it's still sticking to the sides of the bowl, you can add a tablespoon of extra flour at a time until the dough forms a shiny ball. If you don’t have a stand mixer, you can beat the dough in a large bowl with a wooden spoon. It may just take longer for the dough to come together. Knead the dough and let it prove. Sprinkle some flour onto your work surface and dump the dough out onto it. Knead the dough (turning and folding the dough with your palms) for about 5 to 6 minutes. The dough should become smooth and elastic. Rub a little vegetable oil along the inside of a large bowl and place the ball of dough in it. Turn the ball, so it's coated with the oil. Cover the mixing bowl with plastic wrap and put it in a warm place to prove. Let it set for 1 hour. The dough should double in volume, so you'll need to put it in a large mixing bowl. Combine the cheese filling mixture. While the dough proves, grate 3 cups (300 g) of cheddar cheese. Put 2 cups (200 g) of the cheese into a prep bowl and set the other cup (100 g) of cheese aside. Mince 4 scallions and add it to the prep bowl with the 2 cups (200 g) of cheese. You'll use the reserved cheddar cheese for sprinkling over the top of the monkey bread. Fill the dough and form small cheesy pieces. Once the dough has doubled in size, sprinkle more flour on your work surface and dump the dough onto it. Use your hands to form the dough into a 10-inch (25 cm) square. Spread the cheese and scallion mixture across half of the dough. Fold the other side of dough over the filling and use a rolling pin to roll the dough into a square. Cut the dough into 1-inch (2.5 cm) pieces. You can use a sharp knife or a bench scraper to cut the dough into even pieces. Combine the butter coating and prepare your pan. Get out another small bowl and melt 8 tablespoons (113 g) of unsalted butter in it. Stir in 1 teaspoon of garlic powder, 1 teaspoon of paprika, and 1/2 teaspoon of black pepper. You should also spread a Bundt pan with a few tablespoons of softened butter. This will keep the monkey bread from sticking to it. You can use your fingers or a pastry brush to coat the pan with the butter. Roll the dough pieces in the butter coating. Take each piece of cheesy dough and roll it in the melted butter mixture. Place each coated piece in the prepared Bundt pan. Once you have a layer of dough balls, sprinkle them with some of the reserved cheddar cheese and continue to layer the rest of the dough on top. You can place each piece of dough on a fork and dip it into the butter. This will allow the extra butter to drip back into the bowl. Prove the cheesy monkey bread and preheat the oven. Wrap the top of the Bundt pan with plastic wrap and set the pan in a warm place to prove. Let it sit for 1 hour, so the dough balls rise to about 2-inches (5 cm) below the top of the pan. You should turn on the oven to 350 degrees F (180 C) once the bread has almost finished proving. It may take a little longer for your bread to prove enough. For example, you might need to prove the dough for 1 hour to 1 1/2 hours. Bake the bread and invert it onto a plate. Take the plastic wrap off of the bread and place the bread in the oven. Bake it for 35 to 40 minutes. It should turn a dark, golden brown once it's finished baking. Remove the pan from the oven and let the bread cool for 5 minutes. Set a plate over the pan and carefully flip it over, so the bread is inverted onto the plate. Finish cooling the bread for 10 more minutes before you serve it. You should wear oven mitts when you invert the bread since the Bundt pan will still be hot.",
  "sentences":[
    " Making Cheesy Monkey Bread With Refrigerator Biscuits Prepare the oven, pan, and cheesy spice mixture.",
    "Turn the oven on to 350 degrees F (180 C) and move a rack to the lower third of the oven.",
    "Spray a Bundt or tube pan with cooking spray.",
    "Set it aside while you mix together the cheesy spice mixture.",
    "Get out a small bowl and mix together:\n1 cup (100 g) of finely grated Parmesan\n1 teaspoon of dried oregano\n1/4 teaspoon of granulated garlic\n1/4 teaspoon of dried rosemary\n1/4 teaspoon of dried thyme Roll the biscuits into balls and coat them with oil.",
    "Open 2 packages (920 g total) of prepared refrigerator biscuits.",
    "Use kitchen shears or a sharp knife to cut each biscuit in half.",
    "Roll each half between your palms to make a dough ball.",
    "Put 8 dough balls in a mixing bowl and pour 2 tablespoons of the extra-virgin olive oil over them.",
    "Toss them gently.",
    "You'll need to oil and roll the dough balls in batches, so they're evenly coated with oil and cheesy spice.",
    "Roll the dough balls in the cheesy spice mixture.",
    "Transfer the oiled dough balls to the bowl with the cheesy spice mixture.",
    "Roll them, so they're completely coated and place them in the prepared Bundt or tube pan.",
    "Roll the remaining dough balls in the oil and cheesy spice mixture in batches of 8.",
    "You'll need to add 2 teaspoons of oil to each batch.",
    "You may need to overlap some of the seasoned dough balls to get them to fit in the pan.",
    "Bake the cheesy monkey bread.",
    "Put the pan of cheesy monkey bread dough in the preheated oven and bake it for 50 minutes.",
    "The monkey bread should puff up and turn golden brown.",
    "Remember to place it on the lower rack of the oven, so the pan will fit.",
    "Check the monkey bread after about 30 minutes of baking.",
    "If the monkey bread is turning brown quickly, you can lay a sheet of aluminum foil over it, so it can finish cooking.",
    "Cool and serve the monkey bread.",
    "Remove the bread from the oven and let it cool for 10 minutes in the pan.",
    "Run a thin, offset spatula around the sides of the pan to loosen the monkey bread.",
    "Set baking sheet on the pan and carefully flip the bread over and onto the baking sheet.",
    "You can transfer the bread to a serving plate.",
    "Remember to wear oven mitts while you invert the monkey bread onto the baking sheet since the pan will be hot.",
    "Making Cheesy Monkey Bread From Scratch Combine the liquid dough ingredients with the sugar and yeast.",
    "Get out a large mixing bowl.",
    "Melt 2 tablespoons of unsalted butter in the bowl and add 1 cup (240 ml) of warm milk and 1/3 cup (80 ml) of warm water.",
    "Whisk in 2 tablespoons of granulated sugar and 1 tablespoon of instant yeast until the sugar and yeast dissolve.",
    "The sugar will help feed the yeast, so it activates and foams a little.",
    "Beat the flour and salt with the liquid dough ingredients.",
    "Get out another mixing bowl that you can fit into a stand mixer.",
    "Place 3 1/4 cups (406 g) of all-purpose flour in the bowl along with 2 teaspoons of kosher salt.",
    "Turn the mixer on low speed and gradually pour in the liquid mixture.",
    "Turn the speed up to medium and beat the dough for 6 to 7 minutes.",
    "The dough should become smooth.",
    "If it's still sticking to the sides of the bowl, you can add a tablespoon of extra flour at a time until the dough forms a shiny ball.",
    "If you don’t have a stand mixer, you can beat the dough in a large bowl with a wooden spoon.",
    "It may just take longer for the dough to come together.",
    "Knead the dough and let it prove.",
    "Sprinkle some flour onto your work surface and dump the dough out onto it.",
    "Knead the dough (turning and folding the dough with your palms) for about 5 to 6 minutes.",
    "The dough should become smooth and elastic.",
    "Rub a little vegetable oil along the inside of a large bowl and place the ball of dough in it.",
    "Turn the ball, so it's coated with the oil.",
    "Cover the mixing bowl with plastic wrap and put it in a warm place to prove.",
    "Let it set for 1 hour.",
    "The dough should double in volume, so you'll need to put it in a large mixing bowl.",
    "Combine the cheese filling mixture.",
    "While the dough proves, grate 3 cups (300 g) of cheddar cheese.",
    "Put 2 cups (200 g) of the cheese into a prep bowl and set the other cup (100 g) of cheese aside.",
    "Mince 4 scallions and add it to the prep bowl with the 2 cups (200 g) of cheese.",
    "You'll use the reserved cheddar cheese for sprinkling over the top of the monkey bread.",
    "Fill the dough and form small cheesy pieces.",
    "Once the dough has doubled in size, sprinkle more flour on your work surface and dump the dough onto it.",
    "Use your hands to form the dough into a 10-inch (25 cm) square.",
    "Spread the cheese and scallion mixture across half of the dough.",
    "Fold the other side of dough over the filling and use a rolling pin to roll the dough into a square.",
    "Cut the dough into 1-inch (2.5 cm) pieces.",
    "You can use a sharp knife or a bench scraper to cut the dough into even pieces.",
    "Combine the butter coating and prepare your pan.",
    "Get out another small bowl and melt 8 tablespoons (113 g) of unsalted butter in it.",
    "Stir in 1 teaspoon of garlic powder, 1 teaspoon of paprika, and 1/2 teaspoon of black pepper.",
    "You should also spread a Bundt pan with a few tablespoons of softened butter.",
    "This will keep the monkey bread from sticking to it.",
    "You can use your fingers or a pastry brush to coat the pan with the butter.",
    "Roll the dough pieces in the butter coating.",
    "Take each piece of cheesy dough and roll it in the melted butter mixture.",
    "Place each coated piece in the prepared Bundt pan.",
    "Once you have a layer of dough balls, sprinkle them with some of the reserved cheddar cheese and continue to layer the rest of the dough on top.",
    "You can place each piece of dough on a fork and dip it into the butter.",
    "This will allow the extra butter to drip back into the bowl.",
    "Prove the cheesy monkey bread and preheat the oven.",
    "Wrap the top of the Bundt pan with plastic wrap and set the pan in a warm place to prove.",
    "Let it sit for 1 hour, so the dough balls rise to about 2-inches (5 cm) below the top of the pan.",
    "You should turn on the oven to 350 degrees F (180 C) once the bread has almost finished proving.",
    "It may take a little longer for your bread to prove enough.",
    "For example, you might need to prove the dough for 1 hour to 1 1/2 hours.",
    "Bake the bread and invert it onto a plate.",
    "Take the plastic wrap off of the bread and place the bread in the oven.",
    "Bake it for 35 to 40 minutes.",
    "It should turn a dark, golden brown once it's finished baking.",
    "Remove the pan from the oven and let the bread cool for 5 minutes.",
    "Set a plate over the pan and carefully flip it over, so the bread is inverted onto the plate.",
    "Finish cooling the bread for 10 more minutes before you serve it.",
    "You should wear oven mitts when you invert the bread since the Bundt pan will still be hot."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Bundt or tube pan",
    "Prep bowls",
    "Mixing bowls",
    "Kitchen shears or knife",
    "Bench scraper",
    "Baking sheet",
    "Thin, offset spatula",
    "Serving plate",
    "Oven mitts",
    "Stand mixer with dough hook attachment",
    "Whisk",
    "Fork",
    "Rolling pin",
    "Aluminum foil, optional",
    "Plastic wrap",
    "Pastry brush, optional"
  ],
  "tyn_model":[
    "oven",
    "butter",
    "oil",
    "cheesy spice",
    "flour",
    "bundt pan",
    "mixing bowl",
    "bowl",
    "baking sheet",
    "sugar",
    "plastic wrap",
    "cheddar cheese",
    "plate",
    "refrigerator biscuits",
    "cheesy spice mixture",
    "bundt or tube pan",
    "small bowl",
    "sharp knife",
    "oven mitts",
    "large mixing bowl",
    "unsalted butter",
    "stand mixer",
    "large bowl",
    "prep bowl",
    "cooking spray",
    "parmesan",
    "oregano",
    "granulated garlic",
    "dried rosemary",
    "dried thyme",
    "kitchen shears",
    "extra-virgin olive oil",
    "cheesy monkey bread",
    "aluminum foil",
    "spatula",
    "serving plate",
    "yeast",
    "warm milk",
    "warm water",
    "granulated sugar",
    "instant yeast",
    "salt",
    "liquid dough",
    "all-purpose flour",
    "kosher salt",
    "mixer",
    "wooden spoon",
    "vegetable oil",
    "cheese filling",
    "scallions",
    "monkey bread",
    "cheese",
    "scallion",
    "rolling pin",
    "bench scraper",
    "garlic powder",
    "paprika",
    "black pepper",
    "pastry brush",
    "fork"
  ],
  "simple_metrics":{
    "r":0.4705882353,
    "p":0.1333333333,
    "f1":0.2077922078,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5294117647,
    "p":0.2,
    "f1":0.2903225806
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7647058824,
    "p":0.2666666667,
    "f1":0.3954372624
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4705882353,
    "p":0.1333333333,
    "f1":0.2077922078
  }
}