{
  "title":"How to Remove Pet Hair from Your Car",
  "url":"https://www.wikihow.com/Remove-Pet-Hair-from-Your-Car",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Using Static Electricity",
      "steps":[
        {
          "headline":"Create a water and fabric softener solution.",
          "description":"You can either use 100% water or create a solution that consists of equal parts fabric softener and water. The ingredients used in fabric softener help to loosen hair and will make it easier to clean the pet hair from your car."
        },
        {
          "headline":"Wet the area with the solution.",
          "description":"Once you have created the solution, you need to wet the upholstery or carpeting in your car. You can do this by wearing a pair of rubber gloves and dipping the fingertips into the solution, or by filling a small spray bottle with the solution and spritzing the desired area."
        },
        {
          "headline":"Rub the seats with your gloved hand.",
          "description":"While wearing a rubber glove, brush your hand along the desired area. The hair should collect on your glove. Every so often dip your gloved hand into the solution to remove the hair and keep your finger tips wet. Alternatively, you could scrub the area with a pumice stone to collect the hair."
        },
        {
          "headline":"Vacuum the loose hair.",
          "description":"Vacuum over the area once it has dried in order to collect any excess hair. For the best results, use a vacuum attachment that has small rubber bristles."
        },
        {
          "headline":"Remove hair with a balloon.",
          "description":"You can also blow up a balloon and rub it across the desired area. The balloon will create static electricity and as a result, the pet hair will stick to the balloon. Once the balloon is covered with hair, use your hand to collect the hair and throw it in the garbage."
        }
      ]
    },
    {
      "name":"Creating a Sticky Surface",
      "steps":[
        {
          "headline":"Collect hair with a lint brush.",
          "description":"Purchase a lint brush from your local drug store. Remove the protective layer and then roll the brush along the desired area of your car. Your pet's hair will stick to the lint brush and can easily be removed from your vehicle."
        },
        {
          "headline":"Gather hair with tape.",
          "description":"Wrap a piece of duct tape or packaging tape around your hand with the sticky side facing outwards. Then pat the area of your car that is covered with hair with your taped hand. The hair will stick to the tape and be easily removed from your car."
        },
        {
          "headline":"Replace the tape periodically.",
          "description":"Check the tape periodically to make sure that it is still collecting hair. Once the piece of tape is completely covered with hair it will lose its adhesiveness. When this happens, throw that piece of tape in the garbage and resume the process with a new piece of tape."
        }
      ]
    },
    {
      "name":"Preventing Pet Hair in Your Car",
      "steps":[
        {
          "headline":"Brush your pet before each car ride.",
          "description":"In order to prevent your pet's hair from getting all over your car, you should brush your pet thoroughly before each car ride. This will remove any loose hairs from your animal and can help to decrease the amount of hair your pet leaves behind. Depending on your pet and the breed, you should brush their hair regularly to manage shedding."
        },
        {
          "headline":"Cover your seats with a blanket.",
          "description":"Place a blanket or towel on the seats or floor of your car. This can help to reduce the amount of hair that will get into your upholstery. It is also much easier to remove the blanket from the car to wash it once it is covered in your pet's hair."
        },
        {
          "headline":"Crate your pet in the car.",
          "description":"Keep your pet contained in their travel carrier while you are in the car. This is not only safe for you and your animal, but it will also help reduce the amount of pet hair in your car. Place the crate on the floor or secure it to a seat using a seatbelt so that the crate can not roll around while you are driving."
        }
      ]
    }
  ],
  "text":" Using Static Electricity Create a water and fabric softener solution. You can either use 100% water or create a solution that consists of equal parts fabric softener and water. The ingredients used in fabric softener help to loosen hair and will make it easier to clean the pet hair from your car. Wet the area with the solution. Once you have created the solution, you need to wet the upholstery or carpeting in your car. You can do this by wearing a pair of rubber gloves and dipping the fingertips into the solution, or by filling a small spray bottle with the solution and spritzing the desired area. Rub the seats with your gloved hand. While wearing a rubber glove, brush your hand along the desired area. The hair should collect on your glove. Every so often dip your gloved hand into the solution to remove the hair and keep your finger tips wet. Alternatively, you could scrub the area with a pumice stone to collect the hair. Vacuum the loose hair. Vacuum over the area once it has dried in order to collect any excess hair. For the best results, use a vacuum attachment that has small rubber bristles. Remove hair with a balloon. You can also blow up a balloon and rub it across the desired area. The balloon will create static electricity and as a result, the pet hair will stick to the balloon. Once the balloon is covered with hair, use your hand to collect the hair and throw it in the garbage. Creating a Sticky Surface Collect hair with a lint brush. Purchase a lint brush from your local drug store. Remove the protective layer and then roll the brush along the desired area of your car. Your pet's hair will stick to the lint brush and can easily be removed from your vehicle. Gather hair with tape. Wrap a piece of duct tape or packaging tape around your hand with the sticky side facing outwards. Then pat the area of your car that is covered with hair with your taped hand. The hair will stick to the tape and be easily removed from your car. Replace the tape periodically. Check the tape periodically to make sure that it is still collecting hair. Once the piece of tape is completely covered with hair it will lose its adhesiveness. When this happens, throw that piece of tape in the garbage and resume the process with a new piece of tape. Preventing Pet Hair in Your Car Brush your pet before each car ride. In order to prevent your pet's hair from getting all over your car, you should brush your pet thoroughly before each car ride. This will remove any loose hairs from your animal and can help to decrease the amount of hair your pet leaves behind. Depending on your pet and the breed, you should brush their hair regularly to manage shedding. Cover your seats with a blanket. Place a blanket or towel on the seats or floor of your car. This can help to reduce the amount of hair that will get into your upholstery. It is also much easier to remove the blanket from the car to wash it once it is covered in your pet's hair. Crate your pet in the car. Keep your pet contained in their travel carrier while you are in the car. This is not only safe for you and your animal, but it will also help reduce the amount of pet hair in your car. Place the crate on the floor or secure it to a seat using a seatbelt so that the crate can not roll around while you are driving.",
  "sentences":[
    " Using Static Electricity Create a water and fabric softener solution.",
    "You can either use 100% water or create a solution that consists of equal parts fabric softener and water.",
    "The ingredients used in fabric softener help to loosen hair and will make it easier to clean the pet hair from your car.",
    "Wet the area with the solution.",
    "Once you have created the solution, you need to wet the upholstery or carpeting in your car.",
    "You can do this by wearing a pair of rubber gloves and dipping the fingertips into the solution, or by filling a small spray bottle with the solution and spritzing the desired area.",
    "Rub the seats with your gloved hand.",
    "While wearing a rubber glove, brush your hand along the desired area.",
    "The hair should collect on your glove.",
    "Every so often dip your gloved hand into the solution to remove the hair and keep your finger tips wet.",
    "Alternatively, you could scrub the area with a pumice stone to collect the hair.",
    "Vacuum the loose hair.",
    "Vacuum over the area once it has dried in order to collect any excess hair.",
    "For the best results, use a vacuum attachment that has small rubber bristles.",
    "Remove hair with a balloon.",
    "You can also blow up a balloon and rub it across the desired area.",
    "The balloon will create static electricity and as a result, the pet hair will stick to the balloon.",
    "Once the balloon is covered with hair, use your hand to collect the hair and throw it in the garbage.",
    "Creating a Sticky Surface Collect hair with a lint brush.",
    "Purchase a lint brush from your local drug store.",
    "Remove the protective layer and then roll the brush along the desired area of your car.",
    "Your pet's hair will stick to the lint brush and can easily be removed from your vehicle.",
    "Gather hair with tape.",
    "Wrap a piece of duct tape or packaging tape around your hand with the sticky side facing outwards.",
    "Then pat the area of your car that is covered with hair with your taped hand.",
    "The hair will stick to the tape and be easily removed from your car.",
    "Replace the tape periodically.",
    "Check the tape periodically to make sure that it is still collecting hair.",
    "Once the piece of tape is completely covered with hair it will lose its adhesiveness.",
    "When this happens, throw that piece of tape in the garbage and resume the process with a new piece of tape.",
    "Preventing Pet Hair in Your Car Brush your pet before each car ride.",
    "In order to prevent your pet's hair from getting all over your car, you should brush your pet thoroughly before each car ride.",
    "This will remove any loose hairs from your animal and can help to decrease the amount of hair your pet leaves behind.",
    "Depending on your pet and the breed, you should brush their hair regularly to manage shedding.",
    "Cover your seats with a blanket.",
    "Place a blanket or towel on the seats or floor of your car.",
    "This can help to reduce the amount of hair that will get into your upholstery.",
    "It is also much easier to remove the blanket from the car to wash it once it is covered in your pet's hair.",
    "Crate your pet in the car.",
    "Keep your pet contained in their travel carrier while you are in the car.",
    "This is not only safe for you and your animal, but it will also help reduce the amount of pet hair in your car.",
    "Place the crate on the floor or secure it to a seat using a seatbelt so that the crate can not roll around while you are driving."
  ],
  "tyn_section":[
    "Vacuum cleaner",
    "Rubber gloves",
    "Water",
    "Fabric Softener",
    "Duct tape or packaging tape",
    "Lint brush",
    "Balloon",
    "Dog/cat brush",
    "Blanket",
    "Pet carrier"
  ],
  "tyn_model":[
    "tape",
    "balloon",
    "water",
    "fabric softener",
    "lint brush",
    "blanket",
    "crate",
    "rubber gloves",
    "spray bottle",
    "rubber glove",
    "pumice stone",
    "vacuum attachment",
    "duct tape",
    "packaging tape",
    "towel",
    "travel carrier"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.375,
    "f1":0.4615384615,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7,
    "p":0.5,
    "f1":0.5833333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.6875,
    "f1":0.8148148148
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.375,
    "f1":0.4615384615
  }
}