{
  "title":"How to Remove Permanent Marker from Tile",
  "url":"https://www.wikihow.com/Remove-Permanent-Marker-from-Tile",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "methods":[
    {
      "name":"Making a Homemade Cleaning Solution",
      "steps":[
        {
          "headline":"Combine the ingredients.",
          "description":"Combine ⁄4 cup (59 mL) of white vinegar, ¼ cup (35 g) of washing soda, 1 tablespoon (15 mL) of liquid dish soap, and 2 gallons (7.6 L) of hot tap water in a bucket. Use a large spoon or another mixing tool to mix the ingredients. Mix until well combined. If this recipe produces too much solution, then half the recipe."
        },
        {
          "headline":"Test on a small surface.",
          "description":"Apply the product to a hidden spot. Let it set for three seconds. Then use a paper towel or rag to remove the product. Look for any kind of stains, discoloration, or residue left by the product. If there are any unwanted effects, then choose a different method. Before using any type of solution or product on your tile floors, always test out the product on a small, inconspicuous spot first. This way, you can ensure that the product you are using does not produce any unwanted effects such as stains or discoloration."
        },
        {
          "headline":"Pour the solution onto a rag or a cloth.",
          "description":"Then, begin wiping the stain with the rag. Wipe the spot until the stain is removed. If the affected area is large, pour more solution onto the rag as needed."
        }
      ]
    },
    {
      "name":"Removing Marker from Textured Tile with Toothpaste",
      "steps":[
        {
          "headline":"Use regular white toothpaste.",
          "description":"Do not use gel toothpaste. If possible, choose a toothpaste product that contains baking soda Toothpaste is great for removing marks from tile that is textured."
        },
        {
          "headline":"Apply the toothpaste to the mark.",
          "description":"Cover the affected area with the toothpaste. Let the toothpaste set for a minute or two. The longer the stain has been on the tile, the longer you will want to let the toothpaste set. For example, if the marker has been on the tile for a 24-hour period, then let the toothpaste set for at least 5 minutes."
        },
        {
          "headline":"Use a sponge to wipe off the toothpaste.",
          "description":"After the toothpaste has set, begin wiping it off with a sponge. If your tile is textured, then you may want to use a toothbrush or a scrubbing brush to remove traces of the stain from smaller crevices in the tile. Once the stain is removed, clean the affected area with soap and water to remove any residue."
        }
      ]
    },
    {
      "name":"Using a Dry Erase Marker on Smooth Tile",
      "steps":[
        {
          "headline":"Purchase a black dry erase marker.",
          "description":"You can purchase dry erase markers from your local pharmacy, arts and crafts store, or discounted retailer. Make sure to purchase a black dry erase marker as opposed to a colored one. Remember to test a small, hidden area first before using it on larger, affected areas."
        },
        {
          "headline":"Trace the affected area with the marker.",
          "description":"Instead of tracing the entire stain, start by tracing a small part of the stain first. This method works best on smooth tile. For textured tile, the toothpaste or all-purpose solution may be more effective."
        },
        {
          "headline":"Wipe off the marker with a paper towel.",
          "description":"Or you may use a rag or cloth to wipe off the traced sections. If the stain isn’t completely removed the first time, then re-trace the remaining spots with the dry erase marker. Wipe until the stain is removed. Use warm water and soap to clean the affected area after the stain is removed."
        }
      ]
    },
    {
      "name":"Trying Other Removal Methods",
      "steps":[
        {
          "headline":"Use melamine foam for a quick option.",
          "description":"Melamine foam, commonly known as a “Magic Eraser,” can quickly and easily remove permanent marker from various surfaces. Wet the foam, then use it to scrub the stained area. Keep scrubbing until all the marker is removed."
        },
        {
          "headline":"Try hairspray if that’s what you have on hand.",
          "description":"Surprisingly, hairspray can be an effective cleaning agent. Simply spray the stain with hairspray and let it sit for 5-10 minutes. Then, use a damp rag to scrub the stain away."
        },
        {
          "headline":"Use nail polish remover if all else fails.",
          "description":"Be sure to test this product on an inconspicuous area first, as it can damage your tile. If you don’t see any negative results, apply a little nail polish remover to the marker stain. Wipe the stain away using a damp rag."
        }
      ]
    }
  ],
  "text":" Making a Homemade Cleaning Solution Combine the ingredients. Combine ⁄4 cup (59 mL) of white vinegar, ¼ cup (35 g) of washing soda, 1 tablespoon (15 mL) of liquid dish soap, and 2 gallons (7.6 L) of hot tap water in a bucket. Use a large spoon or another mixing tool to mix the ingredients. Mix until well combined. If this recipe produces too much solution, then half the recipe. Test on a small surface. Apply the product to a hidden spot. Let it set for three seconds. Then use a paper towel or rag to remove the product. Look for any kind of stains, discoloration, or residue left by the product. If there are any unwanted effects, then choose a different method. Before using any type of solution or product on your tile floors, always test out the product on a small, inconspicuous spot first. This way, you can ensure that the product you are using does not produce any unwanted effects such as stains or discoloration. Pour the solution onto a rag or a cloth. Then, begin wiping the stain with the rag. Wipe the spot until the stain is removed. If the affected area is large, pour more solution onto the rag as needed. Removing Marker from Textured Tile with Toothpaste Use regular white toothpaste. Do not use gel toothpaste. If possible, choose a toothpaste product that contains baking soda Toothpaste is great for removing marks from tile that is textured. Apply the toothpaste to the mark. Cover the affected area with the toothpaste. Let the toothpaste set for a minute or two. The longer the stain has been on the tile, the longer you will want to let the toothpaste set. For example, if the marker has been on the tile for a 24-hour period, then let the toothpaste set for at least 5 minutes. Use a sponge to wipe off the toothpaste. After the toothpaste has set, begin wiping it off with a sponge. If your tile is textured, then you may want to use a toothbrush or a scrubbing brush to remove traces of the stain from smaller crevices in the tile. Once the stain is removed, clean the affected area with soap and water to remove any residue. Using a Dry Erase Marker on Smooth Tile Purchase a black dry erase marker. You can purchase dry erase markers from your local pharmacy, arts and crafts store, or discounted retailer. Make sure to purchase a black dry erase marker as opposed to a colored one. Remember to test a small, hidden area first before using it on larger, affected areas. Trace the affected area with the marker. Instead of tracing the entire stain, start by tracing a small part of the stain first. This method works best on smooth tile. For textured tile, the toothpaste or all-purpose solution may be more effective. Wipe off the marker with a paper towel. Or you may use a rag or cloth to wipe off the traced sections. If the stain isn’t completely removed the first time, then re-trace the remaining spots with the dry erase marker. Wipe until the stain is removed. Use warm water and soap to clean the affected area after the stain is removed. Trying Other Removal Methods Use melamine foam for a quick option. Melamine foam, commonly known as a “Magic Eraser,” can quickly and easily remove permanent marker from various surfaces. Wet the foam, then use it to scrub the stained area. Keep scrubbing until all the marker is removed. Try hairspray if that’s what you have on hand. Surprisingly, hairspray can be an effective cleaning agent. Simply spray the stain with hairspray and let it sit for 5-10 minutes. Then, use a damp rag to scrub the stain away. Use nail polish remover if all else fails. Be sure to test this product on an inconspicuous area first, as it can damage your tile. If you don’t see any negative results, apply a little nail polish remover to the marker stain. Wipe the stain away using a damp rag.",
  "sentences":[
    " Making a Homemade Cleaning Solution Combine the ingredients.",
    "Combine ⁄4 cup (59 mL) of white vinegar, ¼ cup (35 g) of washing soda, 1 tablespoon (15 mL) of liquid dish soap, and 2 gallons (7.6 L) of hot tap water in a bucket.",
    "Use a large spoon or another mixing tool to mix the ingredients.",
    "Mix until well combined.",
    "If this recipe produces too much solution, then half the recipe.",
    "Test on a small surface.",
    "Apply the product to a hidden spot.",
    "Let it set for three seconds.",
    "Then use a paper towel or rag to remove the product.",
    "Look for any kind of stains, discoloration, or residue left by the product.",
    "If there are any unwanted effects, then choose a different method.",
    "Before using any type of solution or product on your tile floors, always test out the product on a small, inconspicuous spot first.",
    "This way, you can ensure that the product you are using does not produce any unwanted effects such as stains or discoloration.",
    "Pour the solution onto a rag or a cloth.",
    "Then, begin wiping the stain with the rag.",
    "Wipe the spot until the stain is removed.",
    "If the affected area is large, pour more solution onto the rag as needed.",
    "Removing Marker from Textured Tile with Toothpaste Use regular white toothpaste.",
    "Do not use gel toothpaste.",
    "If possible, choose a toothpaste product that contains baking soda Toothpaste is great for removing marks from tile that is textured.",
    "Apply the toothpaste to the mark.",
    "Cover the affected area with the toothpaste.",
    "Let the toothpaste set for a minute or two.",
    "The longer the stain has been on the tile, the longer you will want to let the toothpaste set.",
    "For example, if the marker has been on the tile for a 24-hour period, then let the toothpaste set for at least 5 minutes.",
    "Use a sponge to wipe off the toothpaste.",
    "After the toothpaste has set, begin wiping it off with a sponge.",
    "If your tile is textured, then you may want to use a toothbrush or a scrubbing brush to remove traces of the stain from smaller crevices in the tile.",
    "Once the stain is removed, clean the affected area with soap and water to remove any residue.",
    "Using a Dry Erase Marker on Smooth Tile Purchase a black dry erase marker.",
    "You can purchase dry erase markers from your local pharmacy, arts and crafts store, or discounted retailer.",
    "Make sure to purchase a black dry erase marker as opposed to a colored one.",
    "Remember to test a small, hidden area first before using it on larger, affected areas.",
    "Trace the affected area with the marker.",
    "Instead of tracing the entire stain, start by tracing a small part of the stain first.",
    "This method works best on smooth tile.",
    "For textured tile, the toothpaste or all-purpose solution may be more effective.",
    "Wipe off the marker with a paper towel.",
    "Or you may use a rag or cloth to wipe off the traced sections.",
    "If the stain isn’t completely removed the first time, then re-trace the remaining spots with the dry erase marker.",
    "Wipe until the stain is removed.",
    "Use warm water and soap to clean the affected area after the stain is removed.",
    "Trying Other Removal Methods Use melamine foam for a quick option.",
    "Melamine foam, commonly known as a “Magic Eraser,” can quickly and easily remove permanent marker from various surfaces.",
    "Wet the foam, then use it to scrub the stained area.",
    "Keep scrubbing until all the marker is removed.",
    "Try hairspray if that’s what you have on hand.",
    "Surprisingly, hairspray can be an effective cleaning agent.",
    "Simply spray the stain with hairspray and let it sit for 5-10 minutes.",
    "Then, use a damp rag to scrub the stain away.",
    "Use nail polish remover if all else fails.",
    "Be sure to test this product on an inconspicuous area first, as it can damage your tile.",
    "If you don’t see any negative results, apply a little nail polish remover to the marker stain.",
    "Wipe the stain away using a damp rag."
  ],
  "tyn_section":[
    "White vinegar",
    "Washing soda",
    "Liquid dish soap",
    "White toothpaste",
    "Dry erase marker",
    "Paper towels or rag/cloth",
    "Toothbrush or scrub brush",
    "Melamine foam",
    "Hairspray",
    "Nail polish remover"
  ],
  "tyn_model":[
    "toothpaste",
    "dry erase marker",
    "marker",
    "hairspray",
    "paper towel",
    "sponge",
    "soap",
    "melamine foam",
    "nail polish remover",
    "white vinegar",
    "washing soda",
    "liquid dish soap",
    "hot tap water",
    "bucket",
    "rag",
    "cloth",
    "toothpaste product",
    "baking soda",
    "scrubbing brush",
    "water",
    "dry erase markers",
    "toothpaste or",
    "all-purpose solution",
    "“magic eraser",
    "” can",
    "permanent marker",
    "damp rag"
  ],
  "simple_metrics":{
    "r":0.7,
    "p":0.2592592593,
    "f1":0.3783783784,
    "avg_pos":0.3333333333
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.3333333333,
    "f1":0.4705882353
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.5185185185,
    "f1":0.6292134831
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7,
    "p":0.2592592593,
    "f1":0.3783783784
  }
}