{
  "title":"How to Re‐Season a Nonstick Pan",
  "url":"https://www.wikihow.com/Re%E2%80%90Season-a-Nonstick-Pan",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking Equipment",
    "Cookware",
    "Pots and Pans"
  ],
  "methods":[
    {
      "name":"Deep Cleaning a Non-Stick Pan",
      "steps":[
        {
          "headline":"Add water, baking soda and vinegar to the pan.",
          "description":"Before you season a non-stick pan, it's a good idea to deep clean it to take off any stains or food particles that can be partially responsible for the pan's stickiness. Begin by adding 1 cup (236.59 ml) water, 2 tablespoons (29.57 ml) baking soda and ½ cup (118.3 ml) of white vinegar to the pan."
        },
        {
          "headline":"Heat on medium until boiling.",
          "description":"Place the non-stick pan onto the stovetop over medium heat. Heat the pan until the vinegar mixture is boiling, about ten minutes, then take the pan off the heat."
        },
        {
          "headline":"Wash the pan.",
          "description":"After you take the pan off the stove, pour out the vinegar mixture into the sink. Then wash the pan as usual with gentle dish soap, being sure not to use steel wool or other abrasive tools that can scratch the non-stick pan further."
        },
        {
          "headline":"Dry the pan.",
          "description":"After washing out the pan, dry it with a soft dry cloth. It's important to have a completely dry pan before you season it with oil so that the oil can stick to the surface of the pan."
        }
      ]
    },
    {
      "name":"Seasoning the Pan With Vegetable Oil",
      "steps":[
        {
          "headline":"Warm the pan over low heat.",
          "description":"Once you have thoroughly cleaned the pan, you can begin the process of seasoning it and reviving its non-stick surface. Place the clean, dry pan on the stovetop over low heat and let it warm."
        },
        {
          "headline":"Preheat the oven to 300 degrees F. While the pan is warming, preheat the oven to 300 degrees Fahrenheit (148.88 C).",
          "description":"You will bake the oil into the pan to thoroughly coat the bottom."
        },
        {
          "headline":"Coat the pan with vegetable oil.",
          "description":"Pour a non-salted vegetable oil into the pan. Use enough so that the oil coats the entire bottom of the pan and is about a ½ inch (1.27 cm) high."
        },
        {
          "headline":"Heat the pan in the oven for 2 hours.",
          "description":"After pouring the oil into the pan, place the pan in the oven and let it heat for 2 hours. The heat of the oven will let the vegetable oil bake into and coat the bottom of the pan. Only use this method if you have a pan that is oven-safe. The oven doesn't have to be completely preheated before you put in the pan."
        },
        {
          "headline":"Turn off the oven and keep the pan inside overnight.",
          "description":"After two hours, turn the oven off. Instead of taking out the non-stick pan, leave the pan in overnight to keep it heating and drying."
        },
        {
          "headline":"Take the pan out and use.",
          "description":"After leaving the pan inside the oven overnight, take the pan out. Your non-stick pan should be revived and ready to use!"
        }
      ]
    },
    {
      "name":"Seasoning With Coconut Oil",
      "steps":[
        {
          "headline":"Heat a pan on medium heat for 3 minutes.",
          "description":"If you aren't confident that your pan is oven-safe, you can also season a pan on the stovetop. Begin by heating the clean, dry pan on medium heat for 3 minutes."
        },
        {
          "headline":"Add 2 tablespoons of coconut oil to the pan.",
          "description":"Once the pan has heated for 3 minutes, add 2 tablespoons (29.57 ml) of coconut oil to the pan and wait for it to melt, about 2 minutes. You can also use vegetable oil if you prefer or don't have access to coconut oil."
        },
        {
          "headline":"Swirl the oil to coat the pan.",
          "description":"Once the coconut oil has melted, pick the pan up off the stove and roll your wrist to tilt it around in a circular motion. This should swirl the oil around in the bottom of the pan so that it coats the entire bottom."
        },
        {
          "headline":"Heat the oil until it smokes.",
          "description":"After swirling the oil, place the pan back down on the burner. Let the pan sit over the heat until the coconut oil begins to smoke. This means that the oil is getting hot and is starting to bake into pan."
        },
        {
          "headline":"Set the pan aside to cool.",
          "description":"When you start seeing the oil smoke, take the non-stick pan off the heat and set it aside to cool. Keep the oil inside the pan and let the pan cool until it is room temperature."
        },
        {
          "headline":"Rub the oil into the pan.",
          "description":"Once the pan cools, you should still see some coconut oil coating the bottom. Take a paper towel and gently rub the oil into the pan. The rubbing should force some coconut oil into the pores of the pan, while absorbing the excess with the paper towel. Your pan is seasoned and should be ready to use."
        }
      ]
    },
    {
      "name":"Seasoning Pans Before Cooking",
      "steps":[
        {
          "headline":"Clean and dry the pan.",
          "description":"Even if you have used vegetable or coconut oil to season and restore a non-stick pan, it's still a good idea to do a quick seasoning of the pan before each use to lubricate it and protect the non-stick surface. Make sure your pan is clean and completely dry before seasoning."
        },
        {
          "headline":"Pour oil onto a paper towel.",
          "description":"Pour about 2 teaspoons (9.46 ml) of a neutral-tasting oil such as vegetable or canola onto a paper towel. You can also use butter if you prefer by placing a few shavings of butter inside the pan. You only need a small amount of oil, which is why it's best to apply it first to the paper towel instead of putting it directly into the pan."
        },
        {
          "headline":"Rub the pan with the oil or butter.",
          "description":"Use the paper towel to rub the oil or butter around the bottom of the pan and absorb any with the paper towel so that what you are cooking isn't affected. Then use your non-stick pan to cook as usual."
        }
      ]
    }
  ],
  "text":" Deep Cleaning a Non-Stick Pan Add water, baking soda and vinegar to the pan. Before you season a non-stick pan, it's a good idea to deep clean it to take off any stains or food particles that can be partially responsible for the pan's stickiness. Begin by adding 1 cup (236.59 ml) water, 2 tablespoons (29.57 ml) baking soda and ½ cup (118.3 ml) of white vinegar to the pan. Heat on medium until boiling. Place the non-stick pan onto the stovetop over medium heat. Heat the pan until the vinegar mixture is boiling, about ten minutes, then take the pan off the heat. Wash the pan. After you take the pan off the stove, pour out the vinegar mixture into the sink. Then wash the pan as usual with gentle dish soap, being sure not to use steel wool or other abrasive tools that can scratch the non-stick pan further. Dry the pan. After washing out the pan, dry it with a soft dry cloth. It's important to have a completely dry pan before you season it with oil so that the oil can stick to the surface of the pan. Seasoning the Pan With Vegetable Oil Warm the pan over low heat. Once you have thoroughly cleaned the pan, you can begin the process of seasoning it and reviving its non-stick surface. Place the clean, dry pan on the stovetop over low heat and let it warm. Preheat the oven to 300 degrees F. While the pan is warming, preheat the oven to 300 degrees Fahrenheit (148.88 C). You will bake the oil into the pan to thoroughly coat the bottom. Coat the pan with vegetable oil. Pour a non-salted vegetable oil into the pan. Use enough so that the oil coats the entire bottom of the pan and is about a ½ inch (1.27 cm) high. Heat the pan in the oven for 2 hours. After pouring the oil into the pan, place the pan in the oven and let it heat for 2 hours. The heat of the oven will let the vegetable oil bake into and coat the bottom of the pan. Only use this method if you have a pan that is oven-safe. The oven doesn't have to be completely preheated before you put in the pan. Turn off the oven and keep the pan inside overnight. After two hours, turn the oven off. Instead of taking out the non-stick pan, leave the pan in overnight to keep it heating and drying. Take the pan out and use. After leaving the pan inside the oven overnight, take the pan out. Your non-stick pan should be revived and ready to use! Seasoning With Coconut Oil Heat a pan on medium heat for 3 minutes. If you aren't confident that your pan is oven-safe, you can also season a pan on the stovetop. Begin by heating the clean, dry pan on medium heat for 3 minutes. Add 2 tablespoons of coconut oil to the pan. Once the pan has heated for 3 minutes, add 2 tablespoons (29.57 ml) of coconut oil to the pan and wait for it to melt, about 2 minutes. You can also use vegetable oil if you prefer or don't have access to coconut oil. Swirl the oil to coat the pan. Once the coconut oil has melted, pick the pan up off the stove and roll your wrist to tilt it around in a circular motion. This should swirl the oil around in the bottom of the pan so that it coats the entire bottom. Heat the oil until it smokes. After swirling the oil, place the pan back down on the burner. Let the pan sit over the heat until the coconut oil begins to smoke. This means that the oil is getting hot and is starting to bake into pan. Set the pan aside to cool. When you start seeing the oil smoke, take the non-stick pan off the heat and set it aside to cool. Keep the oil inside the pan and let the pan cool until it is room temperature. Rub the oil into the pan. Once the pan cools, you should still see some coconut oil coating the bottom. Take a paper towel and gently rub the oil into the pan. The rubbing should force some coconut oil into the pores of the pan, while absorbing the excess with the paper towel. Your pan is seasoned and should be ready to use. Seasoning Pans Before Cooking Clean and dry the pan. Even if you have used vegetable or coconut oil to season and restore a non-stick pan, it's still a good idea to do a quick seasoning of the pan before each use to lubricate it and protect the non-stick surface. Make sure your pan is clean and completely dry before seasoning. Pour oil onto a paper towel. Pour about 2 teaspoons (9.46 ml) of a neutral-tasting oil such as vegetable or canola onto a paper towel. You can also use butter if you prefer by placing a few shavings of butter inside the pan. You only need a small amount of oil, which is why it's best to apply it first to the paper towel instead of putting it directly into the pan. Rub the pan with the oil or butter. Use the paper towel to rub the oil or butter around the bottom of the pan and absorb any with the paper towel so that what you are cooking isn't affected. Then use your non-stick pan to cook as usual.",
  "sentences":[
    " Deep Cleaning a Non-Stick Pan Add water, baking soda and vinegar to the pan.",
    "Before you season a non-stick pan, it's a good idea to deep clean it to take off any stains or food particles that can be partially responsible for the pan's stickiness.",
    "Begin by adding 1 cup (236.59 ml) water, 2 tablespoons (29.57 ml) baking soda and ½ cup (118.3 ml) of white vinegar to the pan.",
    "Heat on medium until boiling.",
    "Place the non-stick pan onto the stovetop over medium heat.",
    "Heat the pan until the vinegar mixture is boiling, about ten minutes, then take the pan off the heat.",
    "Wash the pan.",
    "After you take the pan off the stove, pour out the vinegar mixture into the sink.",
    "Then wash the pan as usual with gentle dish soap, being sure not to use steel wool or other abrasive tools that can scratch the non-stick pan further.",
    "Dry the pan.",
    "After washing out the pan, dry it with a soft dry cloth.",
    "It's important to have a completely dry pan before you season it with oil so that the oil can stick to the surface of the pan.",
    "Seasoning the Pan With Vegetable Oil Warm the pan over low heat.",
    "Once you have thoroughly cleaned the pan, you can begin the process of seasoning it and reviving its non-stick surface.",
    "Place the clean, dry pan on the stovetop over low heat and let it warm.",
    "Preheat the oven to 300 degrees F. While the pan is warming, preheat the oven to 300 degrees Fahrenheit (148.88 C).",
    "You will bake the oil into the pan to thoroughly coat the bottom.",
    "Coat the pan with vegetable oil.",
    "Pour a non-salted vegetable oil into the pan.",
    "Use enough so that the oil coats the entire bottom of the pan and is about a ½ inch (1.27 cm) high.",
    "Heat the pan in the oven for 2 hours.",
    "After pouring the oil into the pan, place the pan in the oven and let it heat for 2 hours.",
    "The heat of the oven will let the vegetable oil bake into and coat the bottom of the pan.",
    "Only use this method if you have a pan that is oven-safe.",
    "The oven doesn't have to be completely preheated before you put in the pan.",
    "Turn off the oven and keep the pan inside overnight.",
    "After two hours, turn the oven off.",
    "Instead of taking out the non-stick pan, leave the pan in overnight to keep it heating and drying.",
    "Take the pan out and use.",
    "After leaving the pan inside the oven overnight, take the pan out.",
    "Your non-stick pan should be revived and ready to use!",
    "Seasoning With Coconut Oil Heat a pan on medium heat for 3 minutes.",
    "If you aren't confident that your pan is oven-safe, you can also season a pan on the stovetop.",
    "Begin by heating the clean, dry pan on medium heat for 3 minutes.",
    "Add 2 tablespoons of coconut oil to the pan.",
    "Once the pan has heated for 3 minutes, add 2 tablespoons (29.57 ml) of coconut oil to the pan and wait for it to melt, about 2 minutes.",
    "You can also use vegetable oil if you prefer or don't have access to coconut oil.",
    "Swirl the oil to coat the pan.",
    "Once the coconut oil has melted, pick the pan up off the stove and roll your wrist to tilt it around in a circular motion.",
    "This should swirl the oil around in the bottom of the pan so that it coats the entire bottom.",
    "Heat the oil until it smokes.",
    "After swirling the oil, place the pan back down on the burner.",
    "Let the pan sit over the heat until the coconut oil begins to smoke.",
    "This means that the oil is getting hot and is starting to bake into pan.",
    "Set the pan aside to cool.",
    "When you start seeing the oil smoke, take the non-stick pan off the heat and set it aside to cool.",
    "Keep the oil inside the pan and let the pan cool until it is room temperature.",
    "Rub the oil into the pan.",
    "Once the pan cools, you should still see some coconut oil coating the bottom.",
    "Take a paper towel and gently rub the oil into the pan.",
    "The rubbing should force some coconut oil into the pores of the pan, while absorbing the excess with the paper towel.",
    "Your pan is seasoned and should be ready to use.",
    "Seasoning Pans Before Cooking Clean and dry the pan.",
    "Even if you have used vegetable or coconut oil to season and restore a non-stick pan, it's still a good idea to do a quick seasoning of the pan before each use to lubricate it and protect the non-stick surface.",
    "Make sure your pan is clean and completely dry before seasoning.",
    "Pour oil onto a paper towel.",
    "Pour about 2 teaspoons (9.46 ml) of a neutral-tasting oil such as vegetable or canola onto a paper towel.",
    "You can also use butter if you prefer by placing a few shavings of butter inside the pan.",
    "You only need a small amount of oil, which is why it's best to apply it first to the paper towel instead of putting it directly into the pan.",
    "Rub the pan with the oil or butter.",
    "Use the paper towel to rub the oil or butter around the bottom of the pan and absorb any with the paper towel so that what you are cooking isn't affected.",
    "Then use your non-stick pan to cook as usual."
  ],
  "tyn_section":[
    "Vegetable or coconut oil",
    "Paper towels",
    "Baking soda",
    "Vinegar",
    "Gentle dish soap"
  ],
  "tyn_model":[
    "oil",
    "oven",
    "coconut oil",
    "non-stick pan",
    "paper towel",
    "vegetable oil",
    "pan",
    "butter",
    "vinegar",
    "water",
    "baking soda",
    "stovetop",
    "stove",
    "white vinegar",
    "dish soap",
    "vegetable or coconut oil",
    "vegetable or canola"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.1764705882,
    "f1":0.2727272727,
    "avg_pos":0.8823529412
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.4117647059,
    "f1":0.5436893204
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.5294117647,
    "f1":0.6923076923
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8,
    "p":0.2352941176,
    "f1":0.3636363636
  }
}