{
  "title":"How to Make Biscuit Bowls",
  "url":"https://www.wikihow.com/Make-Biscuit-Bowls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits"
  ],
  "methods":[
    {
      "name":"Mixing Up Biscuit Bowls from Scratch",
      "steps":[
        {
          "headline":"Preheat the oven.",
          "description":"To ensure that your oven is warm enough to bake the biscuit bowls, it’s important to preheat your oven. Set the temperature to 450 degrees Fahrenheit (230 degrees Celsius), and allow it to heat fully. Keep an eye on your oven so you know when it’s reached the right temperature. Most models will either beep and/or flash an indicator light to alert you."
        },
        {
          "headline":"Combine the baking mix, milk, and cayenne pepper.",
          "description":"Add 2 cups (240 g) of biscuit baking mix, ⅔ cup (158 ml) of whole milk, and ½ teaspoon (1 g) of cayenne pepper to a large bowl. Mix the ingredients together until they are fully combined and a dough forms. You can use a store-bought biscuit baking mix, such as Bisquick, or use your own homemade version."
        },
        {
          "headline":"Transfer the dough to a floured surface and knead.",
          "description":"Once the dough has formed, transfer it to a lightly floured surface. Use clean hands to knead the dough three to four times. Be careful not to overwork the dough or you may wind up with tough biscuit bowls."
        },
        {
          "headline":"Divide the dough and roll the pieces out.",
          "description":"After you’ve kneaded the dough, use your hands to separate the dough into six equal pieces. With a rolling pin, roll each piece into a 6-inch (15-cm) circle. If you don’t have a rolling pin, you can use a wine bottle, thermos, glass jar, or other heavy, round object to roll out the dough."
        },
        {
          "headline":"Turn a muffin tin over and grease it.",
          "description":"For the biscuit cups, you’ll need a muffin tin with at least 6 cups. Flip the tin over, and use a vegetable oil cooking spray to grease the underside of the muffin cups. You can use butter to grease the muffin tin if you prefer."
        },
        {
          "headline":"Press the dough over the inverted cups.",
          "description":"After you’ve greased the bottom of the muffin tin, place the dough circles on the back of the muffin cups. Press the dough around each cup to form a bowl shape. If you find that the dough is sticking to your hands as you try to shape them on the muffin tin, lightly dust your skin with flour."
        },
        {
          "headline":"Bake the biscuit bowls until golden.",
          "description":"With the dough on the underside of the muffin tin, place the tin in the preheated oven. Allow the biscuit bowls to bake for 10 to 12 minutes, or until they are a light golden brown color. The biscuit bowls can burn fairly easily, so keep a close eye on them as they're baking, particularly toward the end of the baking time."
        }
      ]
    },
    {
      "name":"Creating Biscuit Bowls from Refrigerated Dough",
      "steps":[
        {
          "headline":"Preheat the oven.",
          "description":"To ensure that the oven is hot enough when the biscuit bowls are ready, you must preheat the oven. Set the temperature to 350 degrees Fahrenheit (177 degrees Celsius), and let the oven heat fully."
        },
        {
          "headline":"Invert several ramekins on a baking sheet and grease.",
          "description":"For the biscuit bowls, you’ll need 8 6-ounce (170 g) ramekins. Turn them over on a large baking sheet, and use nonstick cooking spray to grease the backs and sides of the ramekins. If you prefer, you can use butter to grease the ramekins. If you prefer, you can use a muffin tin and grease the backside of it."
        },
        {
          "headline":"Separate the dough into individual biscuits.",
          "description":"Open a 16.3 ounce (462 g) can of refrigerated biscuit dough according to the package instructions. Use clean fingers to separate the dough into 8 individual biscuits. If the dough is sticking to your hands, dust them lightly with flour to make it easier to handle the biscuits."
        },
        {
          "headline":"Roll the dough pieces into circles.",
          "description":"With the dough separated into 8 pieces, use a rolling pin to roll each one out on a lightly floured surface. Work each piece of dough into a 5-inch (13-cm) circle. It helps to lightly dust your rolling pin with flour before rolling out the dough."
        },
        {
          "headline":"Mold the dough around the ramekins.",
          "description":"After you’ve rolled out the biscuit dough, lift each circle and place it on the back of one of the ramekins. Use your fingers to gently press the dough all around the ramekin to create a bowl shape. Be careful not to tear any holes in the dough as you shape it around the ramekins. If any occur, use your fingers to gently seal them closed so the bowl will remain in tact."
        },
        {
          "headline":"Bake the biscuit bowls until golden.",
          "description":"After you’ve molded all of the biscuit dough onto the backs of the ramekins, place the cookie sheet that they’re on in the preheated oven. Allow the biscuits to bake for approximately 14 minutes, or until they are lightly browned. If you’re using frozen biscuit dough, make sure to allow it to thaw for at least 30 minutes at room temperature and bake them for 16 to 18 minutes."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Mixing Up Biscuit Bowls from Scratch Preheat the oven. To ensure that your oven is warm enough to bake the biscuit bowls, it’s important to preheat your oven. Set the temperature to 450 degrees Fahrenheit (230 degrees Celsius), and allow it to heat fully. Keep an eye on your oven so you know when it’s reached the right temperature. Most models will either beep and/or flash an indicator light to alert you. Combine the baking mix, milk, and cayenne pepper. Add 2 cups (240 g) of biscuit baking mix, ⅔ cup (158 ml) of whole milk, and ½ teaspoon (1 g) of cayenne pepper to a large bowl. Mix the ingredients together until they are fully combined and a dough forms. You can use a store-bought biscuit baking mix, such as Bisquick, or use your own homemade version. Transfer the dough to a floured surface and knead. Once the dough has formed, transfer it to a lightly floured surface. Use clean hands to knead the dough three to four times. Be careful not to overwork the dough or you may wind up with tough biscuit bowls. Divide the dough and roll the pieces out. After you’ve kneaded the dough, use your hands to separate the dough into six equal pieces. With a rolling pin, roll each piece into a 6-inch (15-cm) circle. If you don’t have a rolling pin, you can use a wine bottle, thermos, glass jar, or other heavy, round object to roll out the dough. Turn a muffin tin over and grease it. For the biscuit cups, you’ll need a muffin tin with at least 6 cups. Flip the tin over, and use a vegetable oil cooking spray to grease the underside of the muffin cups. You can use butter to grease the muffin tin if you prefer. Press the dough over the inverted cups. After you’ve greased the bottom of the muffin tin, place the dough circles on the back of the muffin cups. Press the dough around each cup to form a bowl shape. If you find that the dough is sticking to your hands as you try to shape them on the muffin tin, lightly dust your skin with flour. Bake the biscuit bowls until golden. With the dough on the underside of the muffin tin, place the tin in the preheated oven. Allow the biscuit bowls to bake for 10 to 12 minutes, or until they are a light golden brown color. The biscuit bowls can burn fairly easily, so keep a close eye on them as they're baking, particularly toward the end of the baking time. Creating Biscuit Bowls from Refrigerated Dough Preheat the oven. To ensure that the oven is hot enough when the biscuit bowls are ready, you must preheat the oven. Set the temperature to 350 degrees Fahrenheit (177 degrees Celsius), and let the oven heat fully. Invert several ramekins on a baking sheet and grease. For the biscuit bowls, you’ll need 8 6-ounce (170 g) ramekins. Turn them over on a large baking sheet, and use nonstick cooking spray to grease the backs and sides of the ramekins. If you prefer, you can use butter to grease the ramekins. If you prefer, you can use a muffin tin and grease the backside of it. Separate the dough into individual biscuits. Open a 16.3 ounce (462 g) can of refrigerated biscuit dough according to the package instructions. Use clean fingers to separate the dough into 8 individual biscuits. If the dough is sticking to your hands, dust them lightly with flour to make it easier to handle the biscuits. Roll the dough pieces into circles. With the dough separated into 8 pieces, use a rolling pin to roll each one out on a lightly floured surface. Work each piece of dough into a 5-inch (13-cm) circle. It helps to lightly dust your rolling pin with flour before rolling out the dough. Mold the dough around the ramekins. After you’ve rolled out the biscuit dough, lift each circle and place it on the back of one of the ramekins. Use your fingers to gently press the dough all around the ramekin to create a bowl shape. Be careful not to tear any holes in the dough as you shape it around the ramekins. If any occur, use your fingers to gently seal them closed so the bowl will remain in tact. Bake the biscuit bowls until golden. After you’ve molded all of the biscuit dough onto the backs of the ramekins, place the cookie sheet that they’re on in the preheated oven. Allow the biscuits to bake for approximately 14 minutes, or until they are lightly browned. If you’re using frozen biscuit dough, make sure to allow it to thaw for at least 30 minutes at room temperature and bake them for 16 to 18 minutes. Finished. ",
  "sentences":[
    " Mixing Up Biscuit Bowls from Scratch Preheat the oven.",
    "To ensure that your oven is warm enough to bake the biscuit bowls, it’s important to preheat your oven.",
    "Set the temperature to 450 degrees Fahrenheit (230 degrees Celsius), and allow it to heat fully.",
    "Keep an eye on your oven so you know when it’s reached the right temperature.",
    "Most models will either beep and/or flash an indicator light to alert you.",
    "Combine the baking mix, milk, and cayenne pepper.",
    "Add 2 cups (240 g) of biscuit baking mix, ⅔ cup (158 ml) of whole milk, and ½ teaspoon (1 g) of cayenne pepper to a large bowl.",
    "Mix the ingredients together until they are fully combined and a dough forms.",
    "You can use a store-bought biscuit baking mix, such as Bisquick, or use your own homemade version.",
    "Transfer the dough to a floured surface and knead.",
    "Once the dough has formed, transfer it to a lightly floured surface.",
    "Use clean hands to knead the dough three to four times.",
    "Be careful not to overwork the dough or you may wind up with tough biscuit bowls.",
    "Divide the dough and roll the pieces out.",
    "After you’ve kneaded the dough, use your hands to separate the dough into six equal pieces.",
    "With a rolling pin, roll each piece into a 6-inch (15-cm) circle.",
    "If you don’t have a rolling pin, you can use a wine bottle, thermos, glass jar, or other heavy, round object to roll out the dough.",
    "Turn a muffin tin over and grease it.",
    "For the biscuit cups, you’ll need a muffin tin with at least 6 cups.",
    "Flip the tin over, and use a vegetable oil cooking spray to grease the underside of the muffin cups.",
    "You can use butter to grease the muffin tin if you prefer.",
    "Press the dough over the inverted cups.",
    "After you’ve greased the bottom of the muffin tin, place the dough circles on the back of the muffin cups.",
    "Press the dough around each cup to form a bowl shape.",
    "If you find that the dough is sticking to your hands as you try to shape them on the muffin tin, lightly dust your skin with flour.",
    "Bake the biscuit bowls until golden.",
    "With the dough on the underside of the muffin tin, place the tin in the preheated oven.",
    "Allow the biscuit bowls to bake for 10 to 12 minutes, or until they are a light golden brown color.",
    "The biscuit bowls can burn fairly easily, so keep a close eye on them as they're baking, particularly toward the end of the baking time.",
    "Creating Biscuit Bowls from Refrigerated Dough Preheat the oven.",
    "To ensure that the oven is hot enough when the biscuit bowls are ready, you must preheat the oven.",
    "Set the temperature to 350 degrees Fahrenheit (177 degrees Celsius), and let the oven heat fully.",
    "Invert several ramekins on a baking sheet and grease.",
    "For the biscuit bowls, you’ll need 8 6-ounce (170 g) ramekins.",
    "Turn them over on a large baking sheet, and use nonstick cooking spray to grease the backs and sides of the ramekins.",
    "If you prefer, you can use butter to grease the ramekins.",
    "If you prefer, you can use a muffin tin and grease the backside of it.",
    "Separate the dough into individual biscuits.",
    "Open a 16.3 ounce (462 g) can of refrigerated biscuit dough according to the package instructions.",
    "Use clean fingers to separate the dough into 8 individual biscuits.",
    "If the dough is sticking to your hands, dust them lightly with flour to make it easier to handle the biscuits.",
    "Roll the dough pieces into circles.",
    "With the dough separated into 8 pieces, use a rolling pin to roll each one out on a lightly floured surface.",
    "Work each piece of dough into a 5-inch (13-cm) circle.",
    "It helps to lightly dust your rolling pin with flour before rolling out the dough.",
    "Mold the dough around the ramekins.",
    "After you’ve rolled out the biscuit dough, lift each circle and place it on the back of one of the ramekins.",
    "Use your fingers to gently press the dough all around the ramekin to create a bowl shape.",
    "Be careful not to tear any holes in the dough as you shape it around the ramekins.",
    "If any occur, use your fingers to gently seal them closed so the bowl will remain in tact.",
    "Bake the biscuit bowls until golden.",
    "After you’ve molded all of the biscuit dough onto the backs of the ramekins, place the cookie sheet that they’re on in the preheated oven.",
    "Allow the biscuits to bake for approximately 14 minutes, or until they are lightly browned.",
    "If you’re using frozen biscuit dough, make sure to allow it to thaw for at least 30 minutes at room temperature and bake them for 16 to 18 minutes.",
    "Finished."
  ],
  "tyn_section":[
    "Biscuit Bowls From Scratch",
    "Large bowl",
    "Wooden spoon",
    "Rolling pin",
    "Muffin tin",
    "Nonstick cooking spray",
    "Biscuit Bowls with Refrigerated Dough",
    "8 ramekins",
    "Baking sheet"
  ],
  "tyn_model":[
    "oven",
    "biscuit bowls",
    "muffin tin",
    "rolling pin",
    "flour",
    "biscuit baking mix",
    "butter",
    "ramekins",
    "baking sheet",
    "baking mix",
    "milk",
    "cayenne",
    "⅔ cup",
    "whole milk",
    "cayenne pepper",
    "large bowl",
    "wine bottle",
    "biscuit cups",
    "vegetable oil",
    "muffin cups",
    "nonstick cooking spray",
    "refrigerated biscuit dough",
    "bowl",
    "cookie sheet",
    "biscuit dough"
  ],
  "simple_metrics":{
    "r":0.5555555556,
    "p":0.2,
    "f1":0.2941176471,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8888888889,
    "p":0.36,
    "f1":0.512455516
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.52,
    "f1":0.6561514196
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5555555556,
    "p":0.2,
    "f1":0.2941176471
  }
}