{
  "title":"How to Make Liquid Starch",
  "url":"https://www.wikihow.com/Make-Liquid-Starch",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing",
    "Sewing Tools and Supplies"
  ],
  "methods":[
    {
      "name":"Using Vodka and Water",
      "steps":[
        {
          "headline":"Pour 24 ounces (950 milliliters) of water into a spray bottle.",
          "description":"Try to use distilled or filtered water if you can. If you plan on making scented liquid starch with essential oil, you must use a glass bottle. This is because the essential oils will degrade a plastic bottle overtime."
        },
        {
          "headline":"Add 3 ounces (90 milliliters) of vodka.",
          "description":"Any type of vodka will do; in fact, many quilters and seamstresses claim that cheap vodka is the best."
        },
        {
          "headline":"Add 2 to 3 drops of essential oil, if desired.",
          "description":"You don't have to do this, but it will give your clothes a nice fragrance. You can use any type of essential oil you want, but a refreshing scent, such as lavender or lemon, would work best."
        },
        {
          "headline":"Close the bottle and shake it up.",
          "description":"This will mix all of the ingredients together. After a few shakes, the spray starch is ready to use!"
        },
        {
          "headline":"Use the spray starch.",
          "description":"Lightly spray the garment after laundering it, then let it air dry. You can also spray the garment before ironing it for a nice, crisp finish. Spray it enough so that the fabric is wet, but not soaking or dripping. If you need to starch a large amount of fabric, pour the starch into a bucket, tub, or sink. Dip the fabric into it, wring out the excess water, then iron it. You may need to double or triple the recipe."
        }
      ]
    },
    {
      "name":"Using Cornstarch and Water",
      "steps":[
        {
          "headline":"Stir 1 tablespoon (7.5 grams) of cornstarch into ¼ cup (60 milliliters) of cold water.",
          "description":"Pour the water a cup, then add the cornstarch. Stir the two together until the cornstarch dissolves, then set the cup aside. If you can't find cornstarch where you live, use cornflour instead (not cornmeal)."
        },
        {
          "headline":"Boil 3¾ cups (480 milliliters) of water.",
          "description":"Pour the water into a saucepan, then set the saucepan on the stove. Bring the water to a boil over medium-high to high heat."
        },
        {
          "headline":"Pour the cornstarch water into the boiling water.",
          "description":"Keep stirring while you pour the cornstarch water into the boiling water. Do not remove the saucepan from the burner yet."
        },
        {
          "headline":"Add 2 to 3 drops of essential oil, if desired.",
          "description":"You don't need to do this, but it will give your starch a nice fragrance. Choose something that smells refreshing, such as lavender or lemon."
        },
        {
          "headline":"Cook the mixture for 1 minute.",
          "description":"Keep stirring the mixture as it cooks. Boiling the cornstarch will help keep it suspended in the water and reducing settling/clogging."
        },
        {
          "headline":"Allow the cornstarch to cool before pouring it into a spray bottle.",
          "description":"Once the cooking time is up, take the saucepan off the burner. Let the mixture cool down to room temperature before pouring it into a spray bottle. If you added any essential oils, you must use a glass spray bottle, as the oils will degrade a plastic one."
        },
        {
          "headline":"Use the spray starch.",
          "description":"Lightly spray the fabric after washing it, then let it air dry. You can also spray the fabric just before ironing it for a crisp finish. You want the fabric to be wet, but not dripping or soaking. If you need to starch a lot of fabric, pour the starch into a bucket, tub, or sink. Dunk the fabric into it, wring it out, then iron it. You may need to double or triple the recipe."
        }
      ]
    }
  ],
  "text":" Using Vodka and Water Pour 24 ounces (950 milliliters) of water into a spray bottle. Try to use distilled or filtered water if you can. If you plan on making scented liquid starch with essential oil, you must use a glass bottle. This is because the essential oils will degrade a plastic bottle overtime. Add 3 ounces (90 milliliters) of vodka. Any type of vodka will do; in fact, many quilters and seamstresses claim that cheap vodka is the best. Add 2 to 3 drops of essential oil, if desired. You don't have to do this, but it will give your clothes a nice fragrance. You can use any type of essential oil you want, but a refreshing scent, such as lavender or lemon, would work best. Close the bottle and shake it up. This will mix all of the ingredients together. After a few shakes, the spray starch is ready to use! Use the spray starch. Lightly spray the garment after laundering it, then let it air dry. You can also spray the garment before ironing it for a nice, crisp finish. Spray it enough so that the fabric is wet, but not soaking or dripping. If you need to starch a large amount of fabric, pour the starch into a bucket, tub, or sink. Dip the fabric into it, wring out the excess water, then iron it. You may need to double or triple the recipe. Using Cornstarch and Water Stir 1 tablespoon (7.5 grams) of cornstarch into ¼ cup (60 milliliters) of cold water. Pour the water a cup, then add the cornstarch. Stir the two together until the cornstarch dissolves, then set the cup aside. If you can't find cornstarch where you live, use cornflour instead (not cornmeal). Boil 3¾ cups (480 milliliters) of water. Pour the water into a saucepan, then set the saucepan on the stove. Bring the water to a boil over medium-high to high heat. Pour the cornstarch water into the boiling water. Keep stirring while you pour the cornstarch water into the boiling water. Do not remove the saucepan from the burner yet. Add 2 to 3 drops of essential oil, if desired. You don't need to do this, but it will give your starch a nice fragrance. Choose something that smells refreshing, such as lavender or lemon. Cook the mixture for 1 minute. Keep stirring the mixture as it cooks. Boiling the cornstarch will help keep it suspended in the water and reducing settling/clogging. Allow the cornstarch to cool before pouring it into a spray bottle. Once the cooking time is up, take the saucepan off the burner. Let the mixture cool down to room temperature before pouring it into a spray bottle. If you added any essential oils, you must use a glass spray bottle, as the oils will degrade a plastic one. Use the spray starch. Lightly spray the fabric after washing it, then let it air dry. You can also spray the fabric just before ironing it for a crisp finish. You want the fabric to be wet, but not dripping or soaking. If you need to starch a lot of fabric, pour the starch into a bucket, tub, or sink. Dunk the fabric into it, wring it out, then iron it. You may need to double or triple the recipe.",
  "sentences":[
    " Using Vodka and Water Pour 24 ounces (950 milliliters) of water into a spray bottle.",
    "Try to use distilled or filtered water if you can.",
    "If you plan on making scented liquid starch with essential oil, you must use a glass bottle.",
    "This is because the essential oils will degrade a plastic bottle overtime.",
    "Add 3 ounces (90 milliliters) of vodka.",
    "Any type of vodka will do; in fact, many quilters and seamstresses claim that cheap vodka is the best.",
    "Add 2 to 3 drops of essential oil, if desired.",
    "You don't have to do this, but it will give your clothes a nice fragrance.",
    "You can use any type of essential oil you want, but a refreshing scent, such as lavender or lemon, would work best.",
    "Close the bottle and shake it up.",
    "This will mix all of the ingredients together.",
    "After a few shakes, the spray starch is ready to use!",
    "Use the spray starch.",
    "Lightly spray the garment after laundering it, then let it air dry.",
    "You can also spray the garment before ironing it for a nice, crisp finish.",
    "Spray it enough so that the fabric is wet, but not soaking or dripping.",
    "If you need to starch a large amount of fabric, pour the starch into a bucket, tub, or sink.",
    "Dip the fabric into it, wring out the excess water, then iron it.",
    "You may need to double or triple the recipe.",
    "Using Cornstarch and Water Stir 1 tablespoon (7.5 grams) of cornstarch into ¼ cup (60 milliliters) of cold water.",
    "Pour the water a cup, then add the cornstarch.",
    "Stir the two together until the cornstarch dissolves, then set the cup aside.",
    "If you can't find cornstarch where you live, use cornflour instead (not cornmeal).",
    "Boil 3¾ cups (480 milliliters) of water.",
    "Pour the water into a saucepan, then set the saucepan on the stove.",
    "Bring the water to a boil over medium-high to high heat.",
    "Pour the cornstarch water into the boiling water.",
    "Keep stirring while you pour the cornstarch water into the boiling water.",
    "Do not remove the saucepan from the burner yet.",
    "Add 2 to 3 drops of essential oil, if desired.",
    "You don't need to do this, but it will give your starch a nice fragrance.",
    "Choose something that smells refreshing, such as lavender or lemon.",
    "Cook the mixture for 1 minute.",
    "Keep stirring the mixture as it cooks.",
    "Boiling the cornstarch will help keep it suspended in the water and reducing settling/clogging.",
    "Allow the cornstarch to cool before pouring it into a spray bottle.",
    "Once the cooking time is up, take the saucepan off the burner.",
    "Let the mixture cool down to room temperature before pouring it into a spray bottle.",
    "If you added any essential oils, you must use a glass spray bottle, as the oils will degrade a plastic one.",
    "Use the spray starch.",
    "Lightly spray the fabric after washing it, then let it air dry.",
    "You can also spray the fabric just before ironing it for a crisp finish.",
    "You want the fabric to be wet, but not dripping or soaking.",
    "If you need to starch a lot of fabric, pour the starch into a bucket, tub, or sink.",
    "Dunk the fabric into it, wring it out, then iron it.",
    "You may need to double or triple the recipe."
  ],
  "tyn_section":[
    "24 ounces (950 milliliters) distilled water",
    "3 ounces (90 milliliters) vodka",
    "Essential oil",
    "Spray bottle",
    "Using Cornstarch",
    "¼ cup (60 milliliters) cold water",
    "1 tablespoon (7.5 grams) cornstarch",
    "3¾ cups (480 milliliters) boiled water",
    "Saucepan",
    "Spoon"
  ],
  "tyn_model":[
    "water",
    "spray bottle",
    "essential oil",
    "saucepan",
    "fabric",
    "vodka",
    "spray starch",
    "essential oils",
    "bucket",
    "cold water",
    "cornflour",
    "cornstarch water",
    "lemon",
    "iron"
  ],
  "simple_metrics":{
    "r":0.3,
    "p":0.2142857143,
    "f1":0.25,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3,
    "p":0.2142857143,
    "f1":0.25
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.5,
    "f1":0.5
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3,
    "p":0.2142857143,
    "f1":0.25
  }
}