{
  "title":"How to Clean a Gas Tank",
  "url":"https://www.wikihow.com/Clean-a-Gas-Tank",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Cleaning a Motorcycle or Small Engine Tank",
      "steps":[
        {
          "headline":"Disconnect the tank.",
          "description":"Before doing anything, you need to disconnect the tank from the motorcycle or other machinery. Without disconnecting it, you won’t be able to access it or safely clean it. Unstrap the tank and unscrew screws or bolts that secure it. For lawnmowers and similar items, you’ll need to remove the fuel line and spark plugs. For motorcycles, remove the petcock, gas cap, and all hoses that might be attached to it."
        },
        {
          "headline":"Seal the fuel line.",
          "description":"After disconnecting the fuel line, you’ll need to seal it. Without sealing it, not only can residual gasoline come out of the line, but dirt or other objects could wind up in the fuel line – causing problems for your engine. Take some sort of smooth-faced clamp and attach it to the line near the carburetor. Separate the line and the carburetor. Position the line over a bucket and take off the clamp. Allow the line to drain into the bucket."
        },
        {
          "headline":"Empty the tank.",
          "description":"Pour any remaining fuel into a gasoline-safe container. If you can’t get everything out, use a suction hose or a similar device to remove fuel from the tank. Allow the tank to dry completely. Without draining any remaining fuel, you won’t be able to clean the engine properly. Thus, you need to make sure you get all fuel out of the tank."
        },
        {
          "headline":"Inspect the tank.",
          "description":"Take the time to properly examine the tank to look for any problems that might undermine its integrity. Defects, rust, or other problems could pose potential safety hazards or might endanger your engine. Put the tank out in the open daylight so you can see inside. If you need more light, shine a flashlight into the tank. Pay special attention to rust spots, wear, or defects in the material of the tank itself. Make sure to look at the fuel filter to make sure it is clean. If it is not, it should be replaced."
        },
        {
          "headline":"Spray high pressure water into the tank.",
          "description":"By using high pressure water, you’ll break lose any buildup or accumulation on the bottom of the tank. At the same time, you won’t be introducing chemicals – like soap – that could cause problems for your engine. Set your hose and sprayer to a high-pressure setting. You may need to get down and point the sprayer in various locations in the tank. Consider using a pressure washer or blaster if you have substantial rust buildup in the tank."
        }
      ]
    },
    {
      "name":"Cleaning an Automobile Gas Tank",
      "steps":[
        {
          "headline":"Jack the car up.",
          "description":"Before removing the tank, you'll have to jack the car up. Do this by positioning a car jack underneath the car and slowly moving it into the air. This will provide space for you to get underneath the vehicle. Consider using two jacks to securely lift your vehicle. Position the jack or jacks under the jack points of the car. Consult your owner's manual for these locations."
        },
        {
          "headline":"Remove the gas tank from the car.",
          "description":"Before cleaning the tank, make sure to remove it from the car. By removing it, you’ll be able to properly drain, inspect, and clean it. To remove the tank, disconnect screws and straps that hold it in place. Make sure you are not directly below the tank when disconnecting it. Use another jack, preferably a transmission jack, to lower the fuel tank."
        },
        {
          "headline":"Drain the tank.",
          "description":"After you’ve removed the tank, you need to drain it completely of any fuel that might remain in it. The extent of this process may depend on the age of the tank, how much fuel is left, or the style of the tank. To drain it:\nUse a suction device to transfer the gasoline into a storage container. If there is some liquid you still can’t’ remove, turn the tank upside down and allow it to drain into a container. You may find that sludge or other debris will move out with any remaining gasoline"
        },
        {
          "headline":"Degrease the tank.",
          "description":"If your tank still smells of gasoline after you’ve drained it, you may need to degrease it. You’ll find that you get much better results by degreasing the tank. Use a degreaser like Marine Clean. Try mixing dish detergent with hot water. Let the degreaser or soap and water mix sit in the tank for up to 24 hours. If the degreaser or soap mixture does not work after 24 hours, consider degreasing the tank again for a longer period of time."
        },
        {
          "headline":"Pressure wash the tank.",
          "description":"After removing the tank, you’ll want to take a pressure washer and spray down the inside of the tank. This will help dislodge dirt, debris, and small flakes of rust. It will also help rinse out gasoline sediment. Use a pressure washer or a regular garden hose and sprayer to clean the inside of the tank. You may need to point the sprayer at different angles to remove light rust and other sediment buildup from inside the tank."
        },
        {
          "headline":"Use cleaning solution.",
          "description":"If the tank has substantial rust or other grime in it, you may need to use commercial solutions to remove it. These solutions work by chemically breaking down rust. After using them, you’ll be able to rinse and remove debris from your tank. Think about professional grade acid solutions that will dissolve rust in a tank. Cleaning solutions should only be used on tanks that have been sitting for a long time."
        },
        {
          "headline":"Rinse the tank.",
          "description":"After you’ve used cleaning solution or even a degreaser like a light soap, you’ll need to rinse the tanks several times so suds or soap residue is completely removed. If you don’t remove all chemical residue from the tank, you may wind up damaging your engine. After you’ve loosened built up sediment and rust, empty the tank and refill it again to get any more debris that did not wash away. Rinse the tank until there are no bubbles or foam present in the water. This might require you to rinse it 2 to 3 times.."
        }
      ]
    },
    {
      "name":"Practicing Safety",
      "steps":[
        {
          "headline":"Allow the tank to dry before reattaching it.",
          "description":"Once you’ve cleaned the inside of the tank, you need to allow it to dry completely. If you don’t, the water may mix with new gasoline and damage your engine or fuel system. Turn the tank upside down if possible to allow it to drain better. Sit the tank out overnight. Make sure the tank is not in a moist or humid location."
        },
        {
          "headline":"Dispose of gasoline appropriately.",
          "description":"After draining a tank of gasoline, you need to dispose of it in a proper fashion. If you don’t dispose of it appropriately, it may contaminate the ground water in your community. Store gasoline in approved containers. Contact your local waste disposal service to find out where you can dispose of your gasoline. You may be able to bring your old gasoline to a toxic waste disposal site near you."
        },
        {
          "headline":"Consult a mechanic if you have any questions.",
          "description":"If you encounter any issues while cleaning the tank, or you have a problem you’re unsure about how to resolve, consult a professional mechanic. A professional has likely dealt with cleaning gas tanks before and will advise you appropriately. If you’re unsure as to whether you can lift and remove a tank from a vehicle safely, contact a mechanic. They’ll be able to do it safely."
        },
        {
          "headline":"Wear proper safety equipment.",
          "description":"When working with gasoline or cleaning solvents, you should always use safety equip. Without safety equipment, you might wind causing yourself permanent injury. Use:\nSafety goggles. Gloves. Other protective clothing. Also, remember to properly ventilate your garage and to work on your tank outside, if possible."
        }
      ]
    }
  ],
  "text":" Cleaning a Motorcycle or Small Engine Tank Disconnect the tank. Before doing anything, you need to disconnect the tank from the motorcycle or other machinery. Without disconnecting it, you won’t be able to access it or safely clean it. Unstrap the tank and unscrew screws or bolts that secure it. For lawnmowers and similar items, you’ll need to remove the fuel line and spark plugs. For motorcycles, remove the petcock, gas cap, and all hoses that might be attached to it. Seal the fuel line. After disconnecting the fuel line, you’ll need to seal it. Without sealing it, not only can residual gasoline come out of the line, but dirt or other objects could wind up in the fuel line – causing problems for your engine. Take some sort of smooth-faced clamp and attach it to the line near the carburetor. Separate the line and the carburetor. Position the line over a bucket and take off the clamp. Allow the line to drain into the bucket. Empty the tank. Pour any remaining fuel into a gasoline-safe container. If you can’t get everything out, use a suction hose or a similar device to remove fuel from the tank. Allow the tank to dry completely. Without draining any remaining fuel, you won’t be able to clean the engine properly. Thus, you need to make sure you get all fuel out of the tank. Inspect the tank. Take the time to properly examine the tank to look for any problems that might undermine its integrity. Defects, rust, or other problems could pose potential safety hazards or might endanger your engine. Put the tank out in the open daylight so you can see inside. If you need more light, shine a flashlight into the tank. Pay special attention to rust spots, wear, or defects in the material of the tank itself. Make sure to look at the fuel filter to make sure it is clean. If it is not, it should be replaced. Spray high pressure water into the tank. By using high pressure water, you’ll break lose any buildup or accumulation on the bottom of the tank. At the same time, you won’t be introducing chemicals – like soap – that could cause problems for your engine. Set your hose and sprayer to a high-pressure setting. You may need to get down and point the sprayer in various locations in the tank. Consider using a pressure washer or blaster if you have substantial rust buildup in the tank. Cleaning an Automobile Gas Tank Jack the car up. Before removing the tank, you'll have to jack the car up. Do this by positioning a car jack underneath the car and slowly moving it into the air. This will provide space for you to get underneath the vehicle. Consider using two jacks to securely lift your vehicle. Position the jack or jacks under the jack points of the car. Consult your owner's manual for these locations. Remove the gas tank from the car. Before cleaning the tank, make sure to remove it from the car. By removing it, you’ll be able to properly drain, inspect, and clean it. To remove the tank, disconnect screws and straps that hold it in place. Make sure you are not directly below the tank when disconnecting it. Use another jack, preferably a transmission jack, to lower the fuel tank. Drain the tank. After you’ve removed the tank, you need to drain it completely of any fuel that might remain in it. The extent of this process may depend on the age of the tank, how much fuel is left, or the style of the tank. To drain it:\nUse a suction device to transfer the gasoline into a storage container. If there is some liquid you still can’t’ remove, turn the tank upside down and allow it to drain into a container. You may find that sludge or other debris will move out with any remaining gasoline Degrease the tank. If your tank still smells of gasoline after you’ve drained it, you may need to degrease it. You’ll find that you get much better results by degreasing the tank. Use a degreaser like Marine Clean. Try mixing dish detergent with hot water. Let the degreaser or soap and water mix sit in the tank for up to 24 hours. If the degreaser or soap mixture does not work after 24 hours, consider degreasing the tank again for a longer period of time. Pressure wash the tank. After removing the tank, you’ll want to take a pressure washer and spray down the inside of the tank. This will help dislodge dirt, debris, and small flakes of rust. It will also help rinse out gasoline sediment. Use a pressure washer or a regular garden hose and sprayer to clean the inside of the tank. You may need to point the sprayer at different angles to remove light rust and other sediment buildup from inside the tank. Use cleaning solution. If the tank has substantial rust or other grime in it, you may need to use commercial solutions to remove it. These solutions work by chemically breaking down rust. After using them, you’ll be able to rinse and remove debris from your tank. Think about professional grade acid solutions that will dissolve rust in a tank. Cleaning solutions should only be used on tanks that have been sitting for a long time. Rinse the tank. After you’ve used cleaning solution or even a degreaser like a light soap, you’ll need to rinse the tanks several times so suds or soap residue is completely removed. If you don’t remove all chemical residue from the tank, you may wind up damaging your engine. After you’ve loosened built up sediment and rust, empty the tank and refill it again to get any more debris that did not wash away. Rinse the tank until there are no bubbles or foam present in the water. This might require you to rinse it 2 to 3 times.. Practicing Safety Allow the tank to dry before reattaching it. Once you’ve cleaned the inside of the tank, you need to allow it to dry completely. If you don’t, the water may mix with new gasoline and damage your engine or fuel system. Turn the tank upside down if possible to allow it to drain better. Sit the tank out overnight. Make sure the tank is not in a moist or humid location. Dispose of gasoline appropriately. After draining a tank of gasoline, you need to dispose of it in a proper fashion. If you don’t dispose of it appropriately, it may contaminate the ground water in your community. Store gasoline in approved containers. Contact your local waste disposal service to find out where you can dispose of your gasoline. You may be able to bring your old gasoline to a toxic waste disposal site near you. Consult a mechanic if you have any questions. If you encounter any issues while cleaning the tank, or you have a problem you’re unsure about how to resolve, consult a professional mechanic. A professional has likely dealt with cleaning gas tanks before and will advise you appropriately. If you’re unsure as to whether you can lift and remove a tank from a vehicle safely, contact a mechanic. They’ll be able to do it safely. Wear proper safety equipment. When working with gasoline or cleaning solvents, you should always use safety equip. Without safety equipment, you might wind causing yourself permanent injury. Use:\nSafety goggles. Gloves. Other protective clothing. Also, remember to properly ventilate your garage and to work on your tank outside, if possible.",
  "sentences":[
    " Cleaning a Motorcycle or Small Engine Tank Disconnect the tank.",
    "Before doing anything, you need to disconnect the tank from the motorcycle or other machinery.",
    "Without disconnecting it, you won’t be able to access it or safely clean it.",
    "Unstrap the tank and unscrew screws or bolts that secure it.",
    "For lawnmowers and similar items, you’ll need to remove the fuel line and spark plugs.",
    "For motorcycles, remove the petcock, gas cap, and all hoses that might be attached to it.",
    "Seal the fuel line.",
    "After disconnecting the fuel line, you’ll need to seal it.",
    "Without sealing it, not only can residual gasoline come out of the line, but dirt or other objects could wind up in the fuel line – causing problems for your engine.",
    "Take some sort of smooth-faced clamp and attach it to the line near the carburetor.",
    "Separate the line and the carburetor.",
    "Position the line over a bucket and take off the clamp.",
    "Allow the line to drain into the bucket.",
    "Empty the tank.",
    "Pour any remaining fuel into a gasoline-safe container.",
    "If you can’t get everything out, use a suction hose or a similar device to remove fuel from the tank.",
    "Allow the tank to dry completely.",
    "Without draining any remaining fuel, you won’t be able to clean the engine properly.",
    "Thus, you need to make sure you get all fuel out of the tank.",
    "Inspect the tank.",
    "Take the time to properly examine the tank to look for any problems that might undermine its integrity.",
    "Defects, rust, or other problems could pose potential safety hazards or might endanger your engine.",
    "Put the tank out in the open daylight so you can see inside.",
    "If you need more light, shine a flashlight into the tank.",
    "Pay special attention to rust spots, wear, or defects in the material of the tank itself.",
    "Make sure to look at the fuel filter to make sure it is clean.",
    "If it is not, it should be replaced.",
    "Spray high pressure water into the tank.",
    "By using high pressure water, you’ll break lose any buildup or accumulation on the bottom of the tank.",
    "At the same time, you won’t be introducing chemicals – like soap – that could cause problems for your engine.",
    "Set your hose and sprayer to a high-pressure setting.",
    "You may need to get down and point the sprayer in various locations in the tank.",
    "Consider using a pressure washer or blaster if you have substantial rust buildup in the tank.",
    "Cleaning an Automobile Gas Tank Jack the car up.",
    "Before removing the tank, you'll have to jack the car up.",
    "Do this by positioning a car jack underneath the car and slowly moving it into the air.",
    "This will provide space for you to get underneath the vehicle.",
    "Consider using two jacks to securely lift your vehicle.",
    "Position the jack or jacks under the jack points of the car.",
    "Consult your owner's manual for these locations.",
    "Remove the gas tank from the car.",
    "Before cleaning the tank, make sure to remove it from the car.",
    "By removing it, you’ll be able to properly drain, inspect, and clean it.",
    "To remove the tank, disconnect screws and straps that hold it in place.",
    "Make sure you are not directly below the tank when disconnecting it.",
    "Use another jack, preferably a transmission jack, to lower the fuel tank.",
    "Drain the tank.",
    "After you’ve removed the tank, you need to drain it completely of any fuel that might remain in it.",
    "The extent of this process may depend on the age of the tank, how much fuel is left, or the style of the tank.",
    "To drain it:\nUse a suction device to transfer the gasoline into a storage container.",
    "If there is some liquid you still can’t’ remove, turn the tank upside down and allow it to drain into a container.",
    "You may find that sludge or other debris will move out with any remaining gasoline Degrease the tank.",
    "If your tank still smells of gasoline after you’ve drained it, you may need to degrease it.",
    "You’ll find that you get much better results by degreasing the tank.",
    "Use a degreaser like Marine Clean.",
    "Try mixing dish detergent with hot water.",
    "Let the degreaser or soap and water mix sit in the tank for up to 24 hours.",
    "If the degreaser or soap mixture does not work after 24 hours, consider degreasing the tank again for a longer period of time.",
    "Pressure wash the tank.",
    "After removing the tank, you’ll want to take a pressure washer and spray down the inside of the tank.",
    "This will help dislodge dirt, debris, and small flakes of rust.",
    "It will also help rinse out gasoline sediment.",
    "Use a pressure washer or a regular garden hose and sprayer to clean the inside of the tank.",
    "You may need to point the sprayer at different angles to remove light rust and other sediment buildup from inside the tank.",
    "Use cleaning solution.",
    "If the tank has substantial rust or other grime in it, you may need to use commercial solutions to remove it.",
    "These solutions work by chemically breaking down rust.",
    "After using them, you’ll be able to rinse and remove debris from your tank.",
    "Think about professional grade acid solutions that will dissolve rust in a tank.",
    "Cleaning solutions should only be used on tanks that have been sitting for a long time.",
    "Rinse the tank.",
    "After you’ve used cleaning solution or even a degreaser like a light soap, you’ll need to rinse the tanks several times so suds or soap residue is completely removed.",
    "If you don’t remove all chemical residue from the tank, you may wind up damaging your engine.",
    "After you’ve loosened built up sediment and rust, empty the tank and refill it again to get any more debris that did not wash away.",
    "Rinse the tank until there are no bubbles or foam present in the water.",
    "This might require you to rinse it 2 to 3 times..",
    "Practicing Safety Allow the tank to dry before reattaching it.",
    "Once you’ve cleaned the inside of the tank, you need to allow it to dry completely.",
    "If you don’t, the water may mix with new gasoline and damage your engine or fuel system.",
    "Turn the tank upside down if possible to allow it to drain better.",
    "Sit the tank out overnight.",
    "Make sure the tank is not in a moist or humid location.",
    "Dispose of gasoline appropriately.",
    "After draining a tank of gasoline, you need to dispose of it in a proper fashion.",
    "If you don’t dispose of it appropriately, it may contaminate the ground water in your community.",
    "Store gasoline in approved containers.",
    "Contact your local waste disposal service to find out where you can dispose of your gasoline.",
    "You may be able to bring your old gasoline to a toxic waste disposal site near you.",
    "Consult a mechanic if you have any questions.",
    "If you encounter any issues while cleaning the tank, or you have a problem you’re unsure about how to resolve, consult a professional mechanic.",
    "A professional has likely dealt with cleaning gas tanks before and will advise you appropriately.",
    "If you’re unsure as to whether you can lift and remove a tank from a vehicle safely, contact a mechanic.",
    "They’ll be able to do it safely.",
    "Wear proper safety equipment.",
    "When working with gasoline or cleaning solvents, you should always use safety equip.",
    "Without safety equipment, you might wind causing yourself permanent injury.",
    "Use:\nSafety goggles.",
    "Gloves.",
    "Other protective clothing.",
    "Also, remember to properly ventilate your garage and to work on your tank outside, if possible."
  ],
  "tyn_section":[
    "1 or 2 car jacks",
    "A transmission jack",
    "Screw drivers",
    "Safety equipment like goggles and gloves",
    "Clamps",
    "A garden hose or a high pressure sprayer",
    "Cleaning solution",
    "Degreaser",
    "Dish detergent"
  ],
  "tyn_model":[
    "gasoline",
    "water",
    "sprayer",
    "pressure washer",
    "fuel",
    "soap",
    "cleaning solution",
    "spark plugs",
    "– causing",
    "bucket",
    "gasoline-safe container",
    "suction hose",
    "flashlight",
    "– like",
    "– that",
    "hose",
    "gas tank",
    "transmission jack",
    "suction device",
    "’ remove",
    "container",
    "marine clean",
    "dish detergent",
    "hot water",
    "garden hose",
    "cleaning solutions",
    "degreaser",
    "toxic waste disposal site",
    "safety goggles",
    "gloves"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.1,
    "f1":0.1538461538,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4444444444,
    "p":0.1333333333,
    "f1":0.2051282051
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5555555556,
    "p":0.2,
    "f1":0.2941176471
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4444444444,
    "p":0.1333333333,
    "f1":0.2051282051
  }
}