{
  "title":"How to Clean an Acrylic Tub",
  "url":"https://www.wikihow.com/Clean-an-Acrylic-Tub",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "methods":[
    {
      "name":"Using Natural Products",
      "steps":[
        {
          "headline":"Fill the tub with hot water and vinegar.",
          "description":"If your acrylic tub is heavily stained or dirty, consider filling the tub with hot water and vinegar. This will help loosen the dirt and grime before you clean the tub. Fill the tub with hot water and pour in 2 cups (470 mL) of vinegar. Let it sit for about 15 minutes and then drain the tub. The acid in the vinegar will help loosen the dirt without damaging the acrylic tub."
        },
        {
          "headline":"Sprinkle the tub with baking soda.",
          "description":"Sprinkle baking soda all over the tub while it's still wet. If you didn't fill the tub with hot water and vinegar, just pour or spray water along the inside and sides of the tub. Let the baking soda sit on the tub for a few minutes. The baking soda can clean mold, mildew, and soap scum. It's also gentle to use on the acrylic tub. For a stronger cleanser, you could use borax instead of baking soda."
        },
        {
          "headline":"Scrub the acrylic tub.",
          "description":"Dip a soft cloth or sponge into water and scrub the baking soda in the tub. The baking soda will form a bit of a paste as you clean the tub. Ensure that you're using a non-abrasive sponge or you may scratch the acrylic tub. Gently scrub the entire tub. Avoid using scrubbers or sponges that have a rough side designed for heavy-duty cleaning. Instead, look for a gentle sponge or just use a soft cloth."
        },
        {
          "headline":"Use a toothbrush to scrub corners and edges.",
          "description":"If you have hard to reach edges or places where the tub meets fixtures (like the faucets), get an old toothbrush and scrub the spots. The toothbrush will be gentle enough to remove tough dirt and grime. You can also use a long-handled scrub brush, as long as the bristles are soft."
        },
        {
          "headline":"Rinse the tub and treat any stains with lemon.",
          "description":"Fill a bucket with water and pour it over the tub to rinse away the baking soda and dirt. Continue rinsing until the tub is clean. If you notice stains, rub half of a lemon over the stains until they lift. Rinse the stains with water and wipe them dry with a soft cloth. Lemon works well for removing hard-water deposits."
        }
      ]
    },
    {
      "name":"Using Commercial Products",
      "steps":[
        {
          "headline":"Wash the tub with a mild cleanser.",
          "description":"Choose a safe and gentle cleanser to clean your tub out. This will prevent dirt and grime from building up. Just wet a soft cloth or sponge with antibacterial dish soap and use it to scrub the entire tub. Rinse the tub to completely remove the dirt and soap. You can use a mild antibacterial soap that you'd use for hand washing your dishes. This is gentle enough to regularly use on your acrylic tub."
        },
        {
          "headline":"Choose a safe deep-cleaning commercial product.",
          "description":"You should deep clean your acrylic tub occasionally, especially if you notice hard-water deposits or grime that's difficult to wash away with soap and water. Read labels to find a tub cleaner that's safe to use on acrylic. You can also check with your tub manufacturer for a list of approved commercial cleaners to use on the tub. Most tub manufacturers update their approved cleaner list every few years, so ensure that you find the most recent list available."
        },
        {
          "headline":"Scrub and rinse the tub.",
          "description":"Most commercial cleaning products will have you spray the product. Keep the bottle about 4–6 inches (10–15 cm) from the tub as you spray. Let the cleaner sit on the tub for 30 seconds to a few minutes. Rinse the cleanser off and wipe the tub dry with a soft cloth. Always follow the manufacturer's instructions for cleaning the tub."
        },
        {
          "headline":"Avoid abrasive cleaners.",
          "description":"Acrylic tubs can scratch easily, even from chemical cleaners. This is why it's important to avoid using aerosol cleaners that come in cans or solvents (like acetone). You should also avoid using abrasive sponges that can scratch or damage the acrylic tub. If you're unsure if a product is safe to use, only use it if it says it's safe to use on acrylic surfaces."
        }
      ]
    },
    {
      "name":"Maintaining Your Acrylic Tub",
      "steps":[
        {
          "headline":"Clean the tub out weekly.",
          "description":"Get in the habit of washing down the tub with a mild soapy cleanser and water every week. This will prevent dirt and grime from building up which would take longer to remove. Regular washing will also keep stains from forming in the acrylic tub and tile near the tub."
        },
        {
          "headline":"Avoid using rough sponges and cloths.",
          "description":"Don't clean your acrylic tub with materials that can scratch the surface. Never use abrasive scrubbing pads or sponges. You should also avoid using steel wool which will also damage the surface. Instead, use soft cloths and sponges. For example, you could use a microfiber or terry cloth towel."
        },
        {
          "headline":"Rinse the drains thoroughly.",
          "description":"You may need to use a drain cleaner or tub clog remover every once in a while. If you do pour this down your tub's drain, you'll need to rinse it away completely, so there's no cleaner or remover left standing in the drain area. If you leave cleanser or clog remover in the drain area, it could damage the acrylic surface."
        },
        {
          "headline":"Avoid smoking around the tub.",
          "description":"To avoid discoloring the tub, most acrylic tub manufacturers recommend that you never smoke in or around it. This is because tobacco smoke can permanently damage the tub."
        }
      ]
    }
  ],
  "text":" Using Natural Products Fill the tub with hot water and vinegar. If your acrylic tub is heavily stained or dirty, consider filling the tub with hot water and vinegar. This will help loosen the dirt and grime before you clean the tub. Fill the tub with hot water and pour in 2 cups (470 mL) of vinegar. Let it sit for about 15 minutes and then drain the tub. The acid in the vinegar will help loosen the dirt without damaging the acrylic tub. Sprinkle the tub with baking soda. Sprinkle baking soda all over the tub while it's still wet. If you didn't fill the tub with hot water and vinegar, just pour or spray water along the inside and sides of the tub. Let the baking soda sit on the tub for a few minutes. The baking soda can clean mold, mildew, and soap scum. It's also gentle to use on the acrylic tub. For a stronger cleanser, you could use borax instead of baking soda. Scrub the acrylic tub. Dip a soft cloth or sponge into water and scrub the baking soda in the tub. The baking soda will form a bit of a paste as you clean the tub. Ensure that you're using a non-abrasive sponge or you may scratch the acrylic tub. Gently scrub the entire tub. Avoid using scrubbers or sponges that have a rough side designed for heavy-duty cleaning. Instead, look for a gentle sponge or just use a soft cloth. Use a toothbrush to scrub corners and edges. If you have hard to reach edges or places where the tub meets fixtures (like the faucets), get an old toothbrush and scrub the spots. The toothbrush will be gentle enough to remove tough dirt and grime. You can also use a long-handled scrub brush, as long as the bristles are soft. Rinse the tub and treat any stains with lemon. Fill a bucket with water and pour it over the tub to rinse away the baking soda and dirt. Continue rinsing until the tub is clean. If you notice stains, rub half of a lemon over the stains until they lift. Rinse the stains with water and wipe them dry with a soft cloth. Lemon works well for removing hard-water deposits. Using Commercial Products Wash the tub with a mild cleanser. Choose a safe and gentle cleanser to clean your tub out. This will prevent dirt and grime from building up. Just wet a soft cloth or sponge with antibacterial dish soap and use it to scrub the entire tub. Rinse the tub to completely remove the dirt and soap. You can use a mild antibacterial soap that you'd use for hand washing your dishes. This is gentle enough to regularly use on your acrylic tub. Choose a safe deep-cleaning commercial product. You should deep clean your acrylic tub occasionally, especially if you notice hard-water deposits or grime that's difficult to wash away with soap and water. Read labels to find a tub cleaner that's safe to use on acrylic. You can also check with your tub manufacturer for a list of approved commercial cleaners to use on the tub. Most tub manufacturers update their approved cleaner list every few years, so ensure that you find the most recent list available. Scrub and rinse the tub. Most commercial cleaning products will have you spray the product. Keep the bottle about 4–6 inches (10–15 cm) from the tub as you spray. Let the cleaner sit on the tub for 30 seconds to a few minutes. Rinse the cleanser off and wipe the tub dry with a soft cloth. Always follow the manufacturer's instructions for cleaning the tub. Avoid abrasive cleaners. Acrylic tubs can scratch easily, even from chemical cleaners. This is why it's important to avoid using aerosol cleaners that come in cans or solvents (like acetone). You should also avoid using abrasive sponges that can scratch or damage the acrylic tub. If you're unsure if a product is safe to use, only use it if it says it's safe to use on acrylic surfaces. Maintaining Your Acrylic Tub Clean the tub out weekly. Get in the habit of washing down the tub with a mild soapy cleanser and water every week. This will prevent dirt and grime from building up which would take longer to remove. Regular washing will also keep stains from forming in the acrylic tub and tile near the tub. Avoid using rough sponges and cloths. Don't clean your acrylic tub with materials that can scratch the surface. Never use abrasive scrubbing pads or sponges. You should also avoid using steel wool which will also damage the surface. Instead, use soft cloths and sponges. For example, you could use a microfiber or terry cloth towel. Rinse the drains thoroughly. You may need to use a drain cleaner or tub clog remover every once in a while. If you do pour this down your tub's drain, you'll need to rinse it away completely, so there's no cleaner or remover left standing in the drain area. If you leave cleanser or clog remover in the drain area, it could damage the acrylic surface. Avoid smoking around the tub. To avoid discoloring the tub, most acrylic tub manufacturers recommend that you never smoke in or around it. This is because tobacco smoke can permanently damage the tub.",
  "sentences":[
    " Using Natural Products Fill the tub with hot water and vinegar.",
    "If your acrylic tub is heavily stained or dirty, consider filling the tub with hot water and vinegar.",
    "This will help loosen the dirt and grime before you clean the tub.",
    "Fill the tub with hot water and pour in 2 cups (470 mL) of vinegar.",
    "Let it sit for about 15 minutes and then drain the tub.",
    "The acid in the vinegar will help loosen the dirt without damaging the acrylic tub.",
    "Sprinkle the tub with baking soda.",
    "Sprinkle baking soda all over the tub while it's still wet.",
    "If you didn't fill the tub with hot water and vinegar, just pour or spray water along the inside and sides of the tub.",
    "Let the baking soda sit on the tub for a few minutes.",
    "The baking soda can clean mold, mildew, and soap scum.",
    "It's also gentle to use on the acrylic tub.",
    "For a stronger cleanser, you could use borax instead of baking soda.",
    "Scrub the acrylic tub.",
    "Dip a soft cloth or sponge into water and scrub the baking soda in the tub.",
    "The baking soda will form a bit of a paste as you clean the tub.",
    "Ensure that you're using a non-abrasive sponge or you may scratch the acrylic tub.",
    "Gently scrub the entire tub.",
    "Avoid using scrubbers or sponges that have a rough side designed for heavy-duty cleaning.",
    "Instead, look for a gentle sponge or just use a soft cloth.",
    "Use a toothbrush to scrub corners and edges.",
    "If you have hard to reach edges or places where the tub meets fixtures (like the faucets), get an old toothbrush and scrub the spots.",
    "The toothbrush will be gentle enough to remove tough dirt and grime.",
    "You can also use a long-handled scrub brush, as long as the bristles are soft.",
    "Rinse the tub and treat any stains with lemon.",
    "Fill a bucket with water and pour it over the tub to rinse away the baking soda and dirt.",
    "Continue rinsing until the tub is clean.",
    "If you notice stains, rub half of a lemon over the stains until they lift.",
    "Rinse the stains with water and wipe them dry with a soft cloth.",
    "Lemon works well for removing hard-water deposits.",
    "Using Commercial Products Wash the tub with a mild cleanser.",
    "Choose a safe and gentle cleanser to clean your tub out.",
    "This will prevent dirt and grime from building up.",
    "Just wet a soft cloth or sponge with antibacterial dish soap and use it to scrub the entire tub.",
    "Rinse the tub to completely remove the dirt and soap.",
    "You can use a mild antibacterial soap that you'd use for hand washing your dishes.",
    "This is gentle enough to regularly use on your acrylic tub.",
    "Choose a safe deep-cleaning commercial product.",
    "You should deep clean your acrylic tub occasionally, especially if you notice hard-water deposits or grime that's difficult to wash away with soap and water.",
    "Read labels to find a tub cleaner that's safe to use on acrylic.",
    "You can also check with your tub manufacturer for a list of approved commercial cleaners to use on the tub.",
    "Most tub manufacturers update their approved cleaner list every few years, so ensure that you find the most recent list available.",
    "Scrub and rinse the tub.",
    "Most commercial cleaning products will have you spray the product.",
    "Keep the bottle about 4–6 inches (10–15 cm) from the tub as you spray.",
    "Let the cleaner sit on the tub for 30 seconds to a few minutes.",
    "Rinse the cleanser off and wipe the tub dry with a soft cloth.",
    "Always follow the manufacturer's instructions for cleaning the tub.",
    "Avoid abrasive cleaners.",
    "Acrylic tubs can scratch easily, even from chemical cleaners.",
    "This is why it's important to avoid using aerosol cleaners that come in cans or solvents (like acetone).",
    "You should also avoid using abrasive sponges that can scratch or damage the acrylic tub.",
    "If you're unsure if a product is safe to use, only use it if it says it's safe to use on acrylic surfaces.",
    "Maintaining Your Acrylic Tub Clean the tub out weekly.",
    "Get in the habit of washing down the tub with a mild soapy cleanser and water every week.",
    "This will prevent dirt and grime from building up which would take longer to remove.",
    "Regular washing will also keep stains from forming in the acrylic tub and tile near the tub.",
    "Avoid using rough sponges and cloths.",
    "Don't clean your acrylic tub with materials that can scratch the surface.",
    "Never use abrasive scrubbing pads or sponges.",
    "You should also avoid using steel wool which will also damage the surface.",
    "Instead, use soft cloths and sponges.",
    "For example, you could use a microfiber or terry cloth towel.",
    "Rinse the drains thoroughly.",
    "You may need to use a drain cleaner or tub clog remover every once in a while.",
    "If you do pour this down your tub's drain, you'll need to rinse it away completely, so there's no cleaner or remover left standing in the drain area.",
    "If you leave cleanser or clog remover in the drain area, it could damage the acrylic surface.",
    "Avoid smoking around the tub.",
    "To avoid discoloring the tub, most acrylic tub manufacturers recommend that you never smoke in or around it.",
    "This is because tobacco smoke can permanently damage the tub."
  ],
  "tyn_section":[
    "Commercial cleaner",
    "Bucket",
    "Toothbrush",
    "Bleach",
    "Baking soda",
    "Vinegar",
    "Lemon",
    "Soft sponge",
    "Gloves"
  ],
  "tyn_model":[
    "baking soda",
    "acrylic tub",
    "water",
    "vinegar",
    "sponges",
    "hot water",
    "sponge",
    "lemon",
    "cleaners",
    "cleaner",
    "cleanser",
    "natural products",
    "borax",
    "scrubbers",
    "toothbrush",
    "scrub brush",
    "bucket",
    "antibacterial dish soap",
    "antibacterial soap",
    "tub cleaner",
    "tub manufacturers",
    "mild soapy cleanser",
    "microfiber or terry cloth towel",
    "drain cleaner",
    "tub clog remover",
    "tub"
  ],
  "simple_metrics":{
    "r":0.5555555556,
    "p":0.1923076923,
    "f1":0.2857142857,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7777777778,
    "p":0.2692307692,
    "f1":0.4
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7777777778,
    "p":0.3461538462,
    "f1":0.4790874525
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5555555556,
    "p":0.1923076923,
    "f1":0.2857142857
  }
}