{
  "title":"How to Clean Anodized Aluminum",
  "url":"https://www.wikihow.com/Clean-Anodized-Aluminum",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Scrubbing Anodized Aluminum",
      "steps":[
        {
          "headline":"Pick a neutral cleaner.",
          "description":"The best cleaners for anodized aluminum are in the pH range of six to eight. Seven is neutral (as opposed to acidic or alkaline), so you want cleaners that are close to neutral. Anything too acidic or too basic can damage the surface. Avoid cleaners with chlorine. Dishwashing soap or Bar Keepers Friend are a good choices. While you may reach for baking soda as an easy and natural cleaner, it's not a good choice for anodized aluminum, as it is on the basic side of the pH scale. It can end up damaging the metal, which you don't want. However, the opposite is also true: acidic cleaners aren't great either. Basically, don't use anything too harsh on anodized aluminum."
        },
        {
          "headline":"Test the cleaner on an inconspicuous area.",
          "description":"Before you use the cleaner on the whole area, try it out on an area that can't be seen well. Make sure the cleaner doesn't stain or damage the anodized aluminum before using it to clean the rest of the aluminum."
        },
        {
          "headline":"Use a little abrasion if needed.",
          "description":"A sponge with a bit of abrasion can help clean the tough surface of anodized aluminum. However, stick to something with mild abrasive properties, such as a scrubby sponge, not a steel wool scrubber. If it's only lightly soiled, stick to a clean rag or washcloth."
        },
        {
          "headline":"Scrub it down.",
          "description":"Scrub the area with soap and water, focusing on particularly dirty areas. Start with a less abrasive tool, such as a clean rag or washcloth. If that doesn't work, use the scrubby side of a sponge to clean it off. Rub the metal in the direction of the grain. If you're washing an anodized aluminum pot, make sure you always wash it by hand. It shouldn't go in the dishwasher. Also, never plunge a hot pot into water, as it can warp it."
        }
      ]
    },
    {
      "name":"Rinsing and Drying Anodized Aluminum",
      "steps":[
        {
          "headline":"Rinse the metal thoroughly.",
          "description":"Once the aluminum is clean, wash it off until the surface is free from residue. Any residue left on the aluminum could damage it. This step is especially important if you used any kind of harsh cleaner. It needs to be removed from the surface."
        },
        {
          "headline":"Move from top to bottom.",
          "description":"When rinsing, it's important to start at the top and work your way down. That way, you're not rinsing residue back on to an area you've already cleaned off. It's more efficient and better for the metal overall."
        },
        {
          "headline":"Dry off the area.",
          "description":"If possible, dry the metal off with a cloth to prevent streaking and spots. Plus, using a cloth can help remove any remaining residue. However, if the area is too big, you can just let it dry by itself. If you notice streaking, use a cloth on it to remove the streaking."
        }
      ]
    },
    {
      "name":"Maintaining Anodized Aluminum",
      "steps":[
        {
          "headline":"Buff out rub marks with an abrasive pad.",
          "description":"If you have rub marks on your surface, try using a somewhat abrasive pad (like an abrasive sponge) on it. It should take out minor rub marks on the surface, helping it to look nice again."
        },
        {
          "headline":"Consider retreatment with wax.",
          "description":"If your aluminum had an additional coating, such as beeswax, it can be beneficial to reapply a layer after cleaning. You'll likely need to melt beeswax first, then apply it with a rag, rubbing it into the metal."
        },
        {
          "headline":"Apply other types of protective coatings.",
          "description":"You can use other protective coatings to seal your aluminum, applied in different ways. For instance, you can paint on a protective coating, letting it even out on its own as you go. You can also use methylated spirits or any number of spray products meant to seal anodized aluminum."
        }
      ]
    }
  ],
  "text":" Scrubbing Anodized Aluminum Pick a neutral cleaner. The best cleaners for anodized aluminum are in the pH range of six to eight. Seven is neutral (as opposed to acidic or alkaline), so you want cleaners that are close to neutral. Anything too acidic or too basic can damage the surface. Avoid cleaners with chlorine. Dishwashing soap or Bar Keepers Friend are a good choices. While you may reach for baking soda as an easy and natural cleaner, it's not a good choice for anodized aluminum, as it is on the basic side of the pH scale. It can end up damaging the metal, which you don't want. However, the opposite is also true: acidic cleaners aren't great either. Basically, don't use anything too harsh on anodized aluminum. Test the cleaner on an inconspicuous area. Before you use the cleaner on the whole area, try it out on an area that can't be seen well. Make sure the cleaner doesn't stain or damage the anodized aluminum before using it to clean the rest of the aluminum. Use a little abrasion if needed. A sponge with a bit of abrasion can help clean the tough surface of anodized aluminum. However, stick to something with mild abrasive properties, such as a scrubby sponge, not a steel wool scrubber. If it's only lightly soiled, stick to a clean rag or washcloth. Scrub it down. Scrub the area with soap and water, focusing on particularly dirty areas. Start with a less abrasive tool, such as a clean rag or washcloth. If that doesn't work, use the scrubby side of a sponge to clean it off. Rub the metal in the direction of the grain. If you're washing an anodized aluminum pot, make sure you always wash it by hand. It shouldn't go in the dishwasher. Also, never plunge a hot pot into water, as it can warp it. Rinsing and Drying Anodized Aluminum Rinse the metal thoroughly. Once the aluminum is clean, wash it off until the surface is free from residue. Any residue left on the aluminum could damage it. This step is especially important if you used any kind of harsh cleaner. It needs to be removed from the surface. Move from top to bottom. When rinsing, it's important to start at the top and work your way down. That way, you're not rinsing residue back on to an area you've already cleaned off. It's more efficient and better for the metal overall. Dry off the area. If possible, dry the metal off with a cloth to prevent streaking and spots. Plus, using a cloth can help remove any remaining residue. However, if the area is too big, you can just let it dry by itself. If you notice streaking, use a cloth on it to remove the streaking. Maintaining Anodized Aluminum Buff out rub marks with an abrasive pad. If you have rub marks on your surface, try using a somewhat abrasive pad (like an abrasive sponge) on it. It should take out minor rub marks on the surface, helping it to look nice again. Consider retreatment with wax. If your aluminum had an additional coating, such as beeswax, it can be beneficial to reapply a layer after cleaning. You'll likely need to melt beeswax first, then apply it with a rag, rubbing it into the metal. Apply other types of protective coatings. You can use other protective coatings to seal your aluminum, applied in different ways. For instance, you can paint on a protective coating, letting it even out on its own as you go. You can also use methylated spirits or any number of spray products meant to seal anodized aluminum.",
  "sentences":[
    " Scrubbing Anodized Aluminum Pick a neutral cleaner.",
    "The best cleaners for anodized aluminum are in the pH range of six to eight.",
    "Seven is neutral (as opposed to acidic or alkaline), so you want cleaners that are close to neutral.",
    "Anything too acidic or too basic can damage the surface.",
    "Avoid cleaners with chlorine.",
    "Dishwashing soap or Bar Keepers Friend are a good choices.",
    "While you may reach for baking soda as an easy and natural cleaner, it's not a good choice for anodized aluminum, as it is on the basic side of the pH scale.",
    "It can end up damaging the metal, which you don't want.",
    "However, the opposite is also true: acidic cleaners aren't great either.",
    "Basically, don't use anything too harsh on anodized aluminum.",
    "Test the cleaner on an inconspicuous area.",
    "Before you use the cleaner on the whole area, try it out on an area that can't be seen well.",
    "Make sure the cleaner doesn't stain or damage the anodized aluminum before using it to clean the rest of the aluminum.",
    "Use a little abrasion if needed.",
    "A sponge with a bit of abrasion can help clean the tough surface of anodized aluminum.",
    "However, stick to something with mild abrasive properties, such as a scrubby sponge, not a steel wool scrubber.",
    "If it's only lightly soiled, stick to a clean rag or washcloth.",
    "Scrub it down.",
    "Scrub the area with soap and water, focusing on particularly dirty areas.",
    "Start with a less abrasive tool, such as a clean rag or washcloth.",
    "If that doesn't work, use the scrubby side of a sponge to clean it off.",
    "Rub the metal in the direction of the grain.",
    "If you're washing an anodized aluminum pot, make sure you always wash it by hand.",
    "It shouldn't go in the dishwasher.",
    "Also, never plunge a hot pot into water, as it can warp it.",
    "Rinsing and Drying Anodized Aluminum Rinse the metal thoroughly.",
    "Once the aluminum is clean, wash it off until the surface is free from residue.",
    "Any residue left on the aluminum could damage it.",
    "This step is especially important if you used any kind of harsh cleaner.",
    "It needs to be removed from the surface.",
    "Move from top to bottom.",
    "When rinsing, it's important to start at the top and work your way down.",
    "That way, you're not rinsing residue back on to an area you've already cleaned off.",
    "It's more efficient and better for the metal overall.",
    "Dry off the area.",
    "If possible, dry the metal off with a cloth to prevent streaking and spots.",
    "Plus, using a cloth can help remove any remaining residue.",
    "However, if the area is too big, you can just let it dry by itself.",
    "If you notice streaking, use a cloth on it to remove the streaking.",
    "Maintaining Anodized Aluminum Buff out rub marks with an abrasive pad.",
    "If you have rub marks on your surface, try using a somewhat abrasive pad (like an abrasive sponge) on it.",
    "It should take out minor rub marks on the surface, helping it to look nice again.",
    "Consider retreatment with wax.",
    "If your aluminum had an additional coating, such as beeswax, it can be beneficial to reapply a layer after cleaning.",
    "You'll likely need to melt beeswax first, then apply it with a rag, rubbing it into the metal.",
    "Apply other types of protective coatings.",
    "You can use other protective coatings to seal your aluminum, applied in different ways.",
    "For instance, you can paint on a protective coating, letting it even out on its own as you go.",
    "You can also use methylated spirits or any number of spray products meant to seal anodized aluminum."
  ],
  "tyn_section":[
    "Gentle cleaner",
    "Non-abrasive sponge or rag",
    "Water",
    "Coating"
  ],
  "tyn_model":[
    "cleaner",
    "cleaners",
    "aluminum",
    "cloth",
    "sponge",
    "water",
    "protective coatings",
    "chlorine",
    "dishwashing soap",
    "bar keepers friend",
    "baking soda",
    "scrubby sponge",
    "steel wool scrubber",
    "soap",
    "harsh cleaner",
    "abrasive pad",
    "abrasive sponge",
    "wax",
    "beeswax",
    "rag",
    "paint"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0476190476,
    "f1":0.08,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.0952380952,
    "f1":0.16
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.1428571429,
    "f1":0.2222222222
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0476190476,
    "f1":0.08
  }
}