{
  "title":"How to Clean Grout with Vinegar",
  "url":"https://www.wikihow.com/Clean-Grout-with-Vinegar",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Using Vinegar Alone",
      "steps":[
        {
          "headline":"Apply vinegar to the grout.",
          "description":"Use a vinegar-soaked cloth or a spray bottle filled with vinegar to coat the grout you wish to get clean. If you are trying to clean grout on a vertical surface, a spray bottle is probably your best bet. After applying the vinegar, wait ten minutes before moving on to the next step. Always use distilled white vinegar or specialized cleaning vinegar to clean grout."
        },
        {
          "headline":"Scrub the grout.",
          "description":"Ten minutes after applying the grout, use a toothbrush to scrub the grout. Use firm up-and-down motions to scrub the grout clean."
        },
        {
          "headline":"Wipe the grout.",
          "description":"Use a dry or damp rag to remove the loosened grout grime. Allow the area to dry, then evaluate it. If the grout still needs cleaning, try a different method."
        }
      ]
    },
    {
      "name":"Using Baking Soda Paste",
      "steps":[
        {
          "headline":"Make a baking soda paste.",
          "description":"Combine about two tablespoons of baking soda with about one tablespoon (15 milliliters) of water. The mixture should not be too thin. If it sloshes about in the bowl you mixed it in, add some more baking soda to help it achieve a more paste-like texture. It also shouldn't be too thick. If the mixture is thick and dry, and doesn't adhere well to the fork or spoon you use to mix it, add some water to thin it out. The more grout you have to clean, the more paste you'll need."
        },
        {
          "headline":"Apply the paste to the grout.",
          "description":"The easiest way to apply the paste to the grout is with your finger. Simply scoop a little dollop of the paste onto your finger tip and smear it in an even layer across the grout you wish to clean."
        },
        {
          "headline":"Mix water and vinegar.",
          "description":"In a spray bottle, combine water and vinegar in a one-to-one ratio. For instance, you might combine 1.5 cups (354 milliliters) vinegar with 1.5 cups (354 milliliters) water. To prevent grout from accumulating grime in the shower, just spray this mixture onto the shower grout two or three times weekly after getting out of the shower."
        },
        {
          "headline":"Spray the mixture onto the paste.",
          "description":"Point the nozzle of the spray bottle toward the baking soda paste you've smeared along the grout. Squeeze the handle of the bottle. Repeat as necessary until all of the paste has bubbled up somewhat. You may have to wait about five minutes for the vinegar and baking soda to react."
        },
        {
          "headline":"Scrub the grout.",
          "description":"Once the paste has become fizzy with the application of the vinegar mixture, use a stiff-bristled toothbrush to scrub the grout clean. Use a toothbrush you aren't planning on using again for anything but detail cleaning."
        },
        {
          "headline":"Wipe the grout.",
          "description":"Once you've loosened the grime and grit along your grout, it should wipe away with ease. Take a damp rag or paper towel and wipe it along the grout you've cleaned. Wipe the area along the edges of the grout, too, to soak up any of the lingering water/vinegar. If you want to give your floor an additional level of shine, mop the whole thing after you're done."
        }
      ]
    },
    {
      "name":"Making Vinegar Sprays",
      "steps":[
        {
          "headline":"Make a citrus vinegar spray.",
          "description":"Mix 3.5 cups (828 milliliters) hot water, ½ cup (170 grams) baking soda, 1/6 cup (40 milliliters) vinegar, and 1/3 cup (80 milliliters) lemon juice in a spray bottle. Aim the nozzle of the spray bottle at the grout you wish to clean. Spray the bottle so that the grout is evenly covered. After one hour, scrub the grout with the scouring side of a sponge to remove the dirt crusted into the grout."
        },
        {
          "headline":"Try a salty vinegar mix.",
          "description":"Combine ¼ cup (21 grams) salt, ¼ cup (21 grams) baking soda, and ¼ cup vinegar (60 milliliters) in a tall cup or small bowl. Let the solution sit for 20 minutes, then use a small spoon to apply the mixture to the grout. Using a toothbrush or scouring pad, scrub the grout until clean. Once you're finished, mop the grout or use a damp cloth to wipe the grime away."
        },
        {
          "headline":"Use an ammonia solution.",
          "description":"Mix 3.5 cups (828 milliliters) hot water, ¼ cup (21 grams) baking soda, 1/3 cup (80 milliliters) ammonia, and ¼ cup (60 milliliters) vinegar. Pour the mixture into a spray bottle. Wait 60 minutes, then spray the grout you wish to clean. Use a scouring sponge to remove the dirt from the grout. Wipe the grime away with a damp rag."
        }
      ]
    }
  ],
  "text":" Using Vinegar Alone Apply vinegar to the grout. Use a vinegar-soaked cloth or a spray bottle filled with vinegar to coat the grout you wish to get clean. If you are trying to clean grout on a vertical surface, a spray bottle is probably your best bet. After applying the vinegar, wait ten minutes before moving on to the next step. Always use distilled white vinegar or specialized cleaning vinegar to clean grout. Scrub the grout. Ten minutes after applying the grout, use a toothbrush to scrub the grout. Use firm up-and-down motions to scrub the grout clean. Wipe the grout. Use a dry or damp rag to remove the loosened grout grime. Allow the area to dry, then evaluate it. If the grout still needs cleaning, try a different method. Using Baking Soda Paste Make a baking soda paste. Combine about two tablespoons of baking soda with about one tablespoon (15 milliliters) of water. The mixture should not be too thin. If it sloshes about in the bowl you mixed it in, add some more baking soda to help it achieve a more paste-like texture. It also shouldn't be too thick. If the mixture is thick and dry, and doesn't adhere well to the fork or spoon you use to mix it, add some water to thin it out. The more grout you have to clean, the more paste you'll need. Apply the paste to the grout. The easiest way to apply the paste to the grout is with your finger. Simply scoop a little dollop of the paste onto your finger tip and smear it in an even layer across the grout you wish to clean. Mix water and vinegar. In a spray bottle, combine water and vinegar in a one-to-one ratio. For instance, you might combine 1.5 cups (354 milliliters) vinegar with 1.5 cups (354 milliliters) water. To prevent grout from accumulating grime in the shower, just spray this mixture onto the shower grout two or three times weekly after getting out of the shower. Spray the mixture onto the paste. Point the nozzle of the spray bottle toward the baking soda paste you've smeared along the grout. Squeeze the handle of the bottle. Repeat as necessary until all of the paste has bubbled up somewhat. You may have to wait about five minutes for the vinegar and baking soda to react. Scrub the grout. Once the paste has become fizzy with the application of the vinegar mixture, use a stiff-bristled toothbrush to scrub the grout clean. Use a toothbrush you aren't planning on using again for anything but detail cleaning. Wipe the grout. Once you've loosened the grime and grit along your grout, it should wipe away with ease. Take a damp rag or paper towel and wipe it along the grout you've cleaned. Wipe the area along the edges of the grout, too, to soak up any of the lingering water/vinegar. If you want to give your floor an additional level of shine, mop the whole thing after you're done. Making Vinegar Sprays Make a citrus vinegar spray. Mix 3.5 cups (828 milliliters) hot water, ½ cup (170 grams) baking soda, 1/6 cup (40 milliliters) vinegar, and 1/3 cup (80 milliliters) lemon juice in a spray bottle. Aim the nozzle of the spray bottle at the grout you wish to clean. Spray the bottle so that the grout is evenly covered. After one hour, scrub the grout with the scouring side of a sponge to remove the dirt crusted into the grout. Try a salty vinegar mix. Combine ¼ cup (21 grams) salt, ¼ cup (21 grams) baking soda, and ¼ cup vinegar (60 milliliters) in a tall cup or small bowl. Let the solution sit for 20 minutes, then use a small spoon to apply the mixture to the grout. Using a toothbrush or scouring pad, scrub the grout until clean. Once you're finished, mop the grout or use a damp cloth to wipe the grime away. Use an ammonia solution. Mix 3.5 cups (828 milliliters) hot water, ¼ cup (21 grams) baking soda, 1/3 cup (80 milliliters) ammonia, and ¼ cup (60 milliliters) vinegar. Pour the mixture into a spray bottle. Wait 60 minutes, then spray the grout you wish to clean. Use a scouring sponge to remove the dirt from the grout. Wipe the grime away with a damp rag.",
  "sentences":[
    " Using Vinegar Alone Apply vinegar to the grout.",
    "Use a vinegar-soaked cloth or a spray bottle filled with vinegar to coat the grout you wish to get clean.",
    "If you are trying to clean grout on a vertical surface, a spray bottle is probably your best bet.",
    "After applying the vinegar, wait ten minutes before moving on to the next step.",
    "Always use distilled white vinegar or specialized cleaning vinegar to clean grout.",
    "Scrub the grout.",
    "Ten minutes after applying the grout, use a toothbrush to scrub the grout.",
    "Use firm up-and-down motions to scrub the grout clean.",
    "Wipe the grout.",
    "Use a dry or damp rag to remove the loosened grout grime.",
    "Allow the area to dry, then evaluate it.",
    "If the grout still needs cleaning, try a different method.",
    "Using Baking Soda Paste Make a baking soda paste.",
    "Combine about two tablespoons of baking soda with about one tablespoon (15 milliliters) of water.",
    "The mixture should not be too thin.",
    "If it sloshes about in the bowl you mixed it in, add some more baking soda to help it achieve a more paste-like texture.",
    "It also shouldn't be too thick.",
    "If the mixture is thick and dry, and doesn't adhere well to the fork or spoon you use to mix it, add some water to thin it out.",
    "The more grout you have to clean, the more paste you'll need.",
    "Apply the paste to the grout.",
    "The easiest way to apply the paste to the grout is with your finger.",
    "Simply scoop a little dollop of the paste onto your finger tip and smear it in an even layer across the grout you wish to clean.",
    "Mix water and vinegar.",
    "In a spray bottle, combine water and vinegar in a one-to-one ratio.",
    "For instance, you might combine 1.5 cups (354 milliliters) vinegar with 1.5 cups (354 milliliters) water.",
    "To prevent grout from accumulating grime in the shower, just spray this mixture onto the shower grout two or three times weekly after getting out of the shower.",
    "Spray the mixture onto the paste.",
    "Point the nozzle of the spray bottle toward the baking soda paste you've smeared along the grout.",
    "Squeeze the handle of the bottle.",
    "Repeat as necessary until all of the paste has bubbled up somewhat.",
    "You may have to wait about five minutes for the vinegar and baking soda to react.",
    "Scrub the grout.",
    "Once the paste has become fizzy with the application of the vinegar mixture, use a stiff-bristled toothbrush to scrub the grout clean.",
    "Use a toothbrush you aren't planning on using again for anything but detail cleaning.",
    "Wipe the grout.",
    "Once you've loosened the grime and grit along your grout, it should wipe away with ease.",
    "Take a damp rag or paper towel and wipe it along the grout you've cleaned.",
    "Wipe the area along the edges of the grout, too, to soak up any of the lingering water/vinegar.",
    "If you want to give your floor an additional level of shine, mop the whole thing after you're done.",
    "Making Vinegar Sprays Make a citrus vinegar spray.",
    "Mix 3.5 cups (828 milliliters) hot water, ½ cup (170 grams) baking soda, 1/6 cup (40 milliliters) vinegar, and 1/3 cup (80 milliliters) lemon juice in a spray bottle.",
    "Aim the nozzle of the spray bottle at the grout you wish to clean.",
    "Spray the bottle so that the grout is evenly covered.",
    "After one hour, scrub the grout with the scouring side of a sponge to remove the dirt crusted into the grout.",
    "Try a salty vinegar mix.",
    "Combine ¼ cup (21 grams) salt, ¼ cup (21 grams) baking soda, and ¼ cup vinegar (60 milliliters) in a tall cup or small bowl.",
    "Let the solution sit for 20 minutes, then use a small spoon to apply the mixture to the grout.",
    "Using a toothbrush or scouring pad, scrub the grout until clean.",
    "Once you're finished, mop the grout or use a damp cloth to wipe the grime away.",
    "Use an ammonia solution.",
    "Mix 3.5 cups (828 milliliters) hot water, ¼ cup (21 grams) baking soda, 1/3 cup (80 milliliters) ammonia, and ¼ cup (60 milliliters) vinegar.",
    "Pour the mixture into a spray bottle.",
    "Wait 60 minutes, then spray the grout you wish to clean.",
    "Use a scouring sponge to remove the dirt from the grout.",
    "Wipe the grime away with a damp rag."
  ],
  "tyn_section":[
    "vinegar",
    "spray bottle",
    "toothbrush",
    "baking soda",
    "ammonia",
    "salt",
    "lemon juice",
    "dishrag",
    "scouring sponge"
  ],
  "tyn_model":[
    "vinegar",
    "baking soda",
    "spray bottle",
    "water",
    "hot water",
    "ammonia",
    "distilled white vinegar",
    "specialized cleaning vinegar",
    "fork",
    "shower grout",
    "paper towel",
    "vinegar sprays",
    "citrus vinegar",
    "lemon juice",
    "sponge",
    "salt",
    "tall cup or small bowl",
    "small spoon",
    "scouring pad",
    "scouring sponge",
    "damp rag"
  ],
  "simple_metrics":{
    "r":0.7777777778,
    "p":0.3333333333,
    "f1":0.4666666667,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.7777777778,
    "p":0.4761904762,
    "f1":0.5907172996
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7777777778,
    "p":0.619047619,
    "f1":0.6893939394
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7777777778,
    "p":0.3333333333,
    "f1":0.4666666667
  }
}