{
  "title":"How to Grow a Moringa Tree",
  "url":"https://www.wikihow.com/Grow-a-Moringa-Tree",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Trees and Shrubs"
  ],
  "parts":[
    {
      "name":"Planting a Moringa Tree",
      "steps":[
        {
          "headline":"Purchase moringa seeds online.",
          "description":"Since they are not common plants, local gardening stores may not carry moringa seeds. Many retailers online offer the seeds for sale in large quantities. Purchase a number of seeds that is right for you. If you have leftovers, a moringa seed may be eaten once the outer shell is removed. Chew the seed thoroughly."
        },
        {
          "headline":"Plant a cutting instead of seeds if you have access to a mature tree.",
          "description":"Moringas can grow from a healthy branch cut from a mature tree. Cut off a branch 3 feet (0.91 m) long and 1 inch (2.5 cm) in diameter. Choose a healthy looking branch from the tree to remove. Use pruning shears to make a diagonal cut on the branch at both ends. Keep the branch at least 3 feet (0.91 m) long."
        },
        {
          "headline":"Fill a 10 US gal (38 L) pot with 85% soil, 10% sand, and 5% compost.",
          "description":"Moringas need a well-draining potting mixture, otherwise, the seeds will become waterlogged. Mixing potting soil with sand and compost will create a nutritious and well-drained mix for your new moringa seeds. Use more or less sand and compost depending on the soil you use."
        },
        {
          "headline":"Plant your moringa in the pot.",
          "description":"Moringas cannot survive the winter if it drops below 32 °F (0 °C), so keep moringas in pots to transport them inside and outside easily. If your climate does not drop below freezing, you can plant moringas directly outside in a similar soil mixture. If you’re planting seeds, remove the shell and plant them 1 inch (2.5 cm) deep and 2 inches (5.1 cm) apart. Use your finger to push holes into the potting mixture. If you’re planting a cutting, expose the nodes of a cutting and push it ⅓ of the way into a 15 US gal (57 L) pot. Pack the dirt tightly with your hands so that the cutting is able to stand on its own and so the potting mixture is firm around it."
        },
        {
          "headline":"Water the soil with a watering can until it is damp.",
          "description":"The soil should be saturated, but not overwatered. If there is standing water on the top of the soil, you’ve watered too much and your soil likely has poor drainage. Check the moisture by sticking your finger into the soil down to the first knuckle. Water once a week or more depending on your climate so the soil stays damp."
        },
        {
          "headline":"Transplant moringas grown from seeds when they are 6 to 8 in (15 to 20 cm).",
          "description":"When moringas reach this size, they will begin competing for resources in the soil and need to be moved to individual pots. Carefully use a ruler or transplant tool to loosen the soil around one of the seedlings. Lift the root system and place it into the pot."
        }
      ]
    },
    {
      "name":"Caring for Your Moringa Tree",
      "steps":[
        {
          "headline":"Keep your moringa in a sunny indoor or outdoor spot.",
          "description":"To grow healthy and strong, your moringa tree will need around 6 hours of direct sunlight. Moringa trees are from a tropical climate, so they need the maximum amount of sunlight you can provide. Keep them in an area that receives full sun throughout the day."
        },
        {
          "headline":"Water your moringa once a week.",
          "description":"Even though moringas are drought-tolerant, they should still have a weekly watering while they are establishing. Put your finger into the soil up to the second knuckle. If it feels dry, water. Be careful not to overwater the soil, or else the roots will become waterlogged and possibly develop rot. If it has rained during the week, your moringa has gotten enough water for the week."
        },
        {
          "headline":"Use pruning shears to cut back moringa trees.",
          "description":"When moringas start to grow, they will grow rapidly over the course of a year. Once the trees reach 8 to 10 feet (2.4 to 3.0 m), cut them back so they are at your desired level. Any branches you remove can be dried and propagated to plant another tree."
        },
        {
          "headline":"Store moringa indoors when temperatures are below freezing.",
          "description":"If you live in a temperate climate, you will want to store your tree inside your home or in a greenhouse during the winter. Moringas are susceptible to the frost and will not survive through the winter. Moringas can grow up to 6 feet (1.8 m) tall in a year, so plan accordingly with how much space you have available. Moringa can be restarted each year with cuttings taken from the previous season. Cuttings from moringa trees are the same age as the tree it was cut from."
        }
      ]
    },
    {
      "name":"Harvesting and Using Moringa",
      "steps":[
        {
          "headline":"Harvest seed pods when they are ⁄8 to ⁄2 inch (9.5 to 12.7 mm) in diameter.",
          "description":"The seed pods, or “drumsticks,” can be pulled and used in recipes and teas. If you wait until they ripen, the inside may have a stringy and less desirable consistency. Boil the seed pods until they are soft and squeeze the inner flesh out to eat. The exterior of the pod is fibrous and inedible."
        },
        {
          "headline":"Pull leaves after the moringa is 3 feet (0.91 m) tall.",
          "description":"Moringa leaves are considered a “superfood” and can be pulled at any time once the tree is over 3 feet (0.91 m) tall. This way, as you pull the leaves off by hand, the branches will have grown strong enough and won’t break. Steep the moringa leaves to make an herbal tea, or add them to your smoothies or salads for added nutrients."
        },
        {
          "headline":"Grind the leaves into a powder.",
          "description":"Dry the leaves in a dehydrator or by hanging them. Once the leaves feel crinkly and crispy, remove them from the stem by hand. To grind them into a powder, use a food processor or grinder until it is fine. Moringa powder can be added to any meal 1 tsp (3 g) at a time. The leaves can also be dried or eaten fresh."
        },
        {
          "headline":"Use moringa for medical and nutritional needs.",
          "description":"Moringa is filled with antioxidants as well as necessary vitamins and minerals. People have eaten moringa to help combat inflammation, arthritis, stomach pains, and asthma. The seeds, fruit, and leaves can all be consumed. The roots of moringa have the aroma of horseradish and should not be eaten, since they contain toxins."
        }
      ]
    }
  ],
  "text":" Planting a Moringa Tree Purchase moringa seeds online. Since they are not common plants, local gardening stores may not carry moringa seeds. Many retailers online offer the seeds for sale in large quantities. Purchase a number of seeds that is right for you. If you have leftovers, a moringa seed may be eaten once the outer shell is removed. Chew the seed thoroughly. Plant a cutting instead of seeds if you have access to a mature tree. Moringas can grow from a healthy branch cut from a mature tree. Cut off a branch 3 feet (0.91 m) long and 1 inch (2.5 cm) in diameter. Choose a healthy looking branch from the tree to remove. Use pruning shears to make a diagonal cut on the branch at both ends. Keep the branch at least 3 feet (0.91 m) long. Fill a 10 US gal (38 L) pot with 85% soil, 10% sand, and 5% compost. Moringas need a well-draining potting mixture, otherwise, the seeds will become waterlogged. Mixing potting soil with sand and compost will create a nutritious and well-drained mix for your new moringa seeds. Use more or less sand and compost depending on the soil you use. Plant your moringa in the pot. Moringas cannot survive the winter if it drops below 32 °F (0 °C), so keep moringas in pots to transport them inside and outside easily. If your climate does not drop below freezing, you can plant moringas directly outside in a similar soil mixture. If you’re planting seeds, remove the shell and plant them 1 inch (2.5 cm) deep and 2 inches (5.1 cm) apart. Use your finger to push holes into the potting mixture. If you’re planting a cutting, expose the nodes of a cutting and push it ⅓ of the way into a 15 US gal (57 L) pot. Pack the dirt tightly with your hands so that the cutting is able to stand on its own and so the potting mixture is firm around it. Water the soil with a watering can until it is damp. The soil should be saturated, but not overwatered. If there is standing water on the top of the soil, you’ve watered too much and your soil likely has poor drainage. Check the moisture by sticking your finger into the soil down to the first knuckle. Water once a week or more depending on your climate so the soil stays damp. Transplant moringas grown from seeds when they are 6 to 8 in (15 to 20 cm). When moringas reach this size, they will begin competing for resources in the soil and need to be moved to individual pots. Carefully use a ruler or transplant tool to loosen the soil around one of the seedlings. Lift the root system and place it into the pot. Caring for Your Moringa Tree Keep your moringa in a sunny indoor or outdoor spot. To grow healthy and strong, your moringa tree will need around 6 hours of direct sunlight. Moringa trees are from a tropical climate, so they need the maximum amount of sunlight you can provide. Keep them in an area that receives full sun throughout the day. Water your moringa once a week. Even though moringas are drought-tolerant, they should still have a weekly watering while they are establishing. Put your finger into the soil up to the second knuckle. If it feels dry, water. Be careful not to overwater the soil, or else the roots will become waterlogged and possibly develop rot. If it has rained during the week, your moringa has gotten enough water for the week. Use pruning shears to cut back moringa trees. When moringas start to grow, they will grow rapidly over the course of a year. Once the trees reach 8 to 10 feet (2.4 to 3.0 m), cut them back so they are at your desired level. Any branches you remove can be dried and propagated to plant another tree. Store moringa indoors when temperatures are below freezing. If you live in a temperate climate, you will want to store your tree inside your home or in a greenhouse during the winter. Moringas are susceptible to the frost and will not survive through the winter. Moringas can grow up to 6 feet (1.8 m) tall in a year, so plan accordingly with how much space you have available. Moringa can be restarted each year with cuttings taken from the previous season. Cuttings from moringa trees are the same age as the tree it was cut from. Harvesting and Using Moringa Harvest seed pods when they are ⁄8 to ⁄2 inch (9.5 to 12.7 mm) in diameter. The seed pods, or “drumsticks,” can be pulled and used in recipes and teas. If you wait until they ripen, the inside may have a stringy and less desirable consistency. Boil the seed pods until they are soft and squeeze the inner flesh out to eat. The exterior of the pod is fibrous and inedible. Pull leaves after the moringa is 3 feet (0.91 m) tall. Moringa leaves are considered a “superfood” and can be pulled at any time once the tree is over 3 feet (0.91 m) tall. This way, as you pull the leaves off by hand, the branches will have grown strong enough and won’t break. Steep the moringa leaves to make an herbal tea, or add them to your smoothies or salads for added nutrients. Grind the leaves into a powder. Dry the leaves in a dehydrator or by hanging them. Once the leaves feel crinkly and crispy, remove them from the stem by hand. To grind them into a powder, use a food processor or grinder until it is fine. Moringa powder can be added to any meal 1 tsp (3 g) at a time. The leaves can also be dried or eaten fresh. Use moringa for medical and nutritional needs. Moringa is filled with antioxidants as well as necessary vitamins and minerals. People have eaten moringa to help combat inflammation, arthritis, stomach pains, and asthma. The seeds, fruit, and leaves can all be consumed. The roots of moringa have the aroma of horseradish and should not be eaten, since they contain toxins.",
  "sentences":[
    " Planting a Moringa Tree Purchase moringa seeds online.",
    "Since they are not common plants, local gardening stores may not carry moringa seeds.",
    "Many retailers online offer the seeds for sale in large quantities.",
    "Purchase a number of seeds that is right for you.",
    "If you have leftovers, a moringa seed may be eaten once the outer shell is removed.",
    "Chew the seed thoroughly.",
    "Plant a cutting instead of seeds if you have access to a mature tree.",
    "Moringas can grow from a healthy branch cut from a mature tree.",
    "Cut off a branch 3 feet (0.91 m) long and 1 inch (2.5 cm) in diameter.",
    "Choose a healthy looking branch from the tree to remove.",
    "Use pruning shears to make a diagonal cut on the branch at both ends.",
    "Keep the branch at least 3 feet (0.91 m) long.",
    "Fill a 10 US gal (38 L) pot with 85% soil, 10% sand, and 5% compost.",
    "Moringas need a well-draining potting mixture, otherwise, the seeds will become waterlogged.",
    "Mixing potting soil with sand and compost will create a nutritious and well-drained mix for your new moringa seeds.",
    "Use more or less sand and compost depending on the soil you use.",
    "Plant your moringa in the pot.",
    "Moringas cannot survive the winter if it drops below 32 °F (0 °C), so keep moringas in pots to transport them inside and outside easily.",
    "If your climate does not drop below freezing, you can plant moringas directly outside in a similar soil mixture.",
    "If you’re planting seeds, remove the shell and plant them 1 inch (2.5 cm) deep and 2 inches (5.1 cm) apart.",
    "Use your finger to push holes into the potting mixture.",
    "If you’re planting a cutting, expose the nodes of a cutting and push it ⅓ of the way into a 15 US gal (57 L) pot.",
    "Pack the dirt tightly with your hands so that the cutting is able to stand on its own and so the potting mixture is firm around it.",
    "Water the soil with a watering can until it is damp.",
    "The soil should be saturated, but not overwatered.",
    "If there is standing water on the top of the soil, you’ve watered too much and your soil likely has poor drainage.",
    "Check the moisture by sticking your finger into the soil down to the first knuckle.",
    "Water once a week or more depending on your climate so the soil stays damp.",
    "Transplant moringas grown from seeds when they are 6 to 8 in (15 to 20 cm).",
    "When moringas reach this size, they will begin competing for resources in the soil and need to be moved to individual pots.",
    "Carefully use a ruler or transplant tool to loosen the soil around one of the seedlings.",
    "Lift the root system and place it into the pot.",
    "Caring for Your Moringa Tree Keep your moringa in a sunny indoor or outdoor spot.",
    "To grow healthy and strong, your moringa tree will need around 6 hours of direct sunlight.",
    "Moringa trees are from a tropical climate, so they need the maximum amount of sunlight you can provide.",
    "Keep them in an area that receives full sun throughout the day.",
    "Water your moringa once a week.",
    "Even though moringas are drought-tolerant, they should still have a weekly watering while they are establishing.",
    "Put your finger into the soil up to the second knuckle.",
    "If it feels dry, water.",
    "Be careful not to overwater the soil, or else the roots will become waterlogged and possibly develop rot.",
    "If it has rained during the week, your moringa has gotten enough water for the week.",
    "Use pruning shears to cut back moringa trees.",
    "When moringas start to grow, they will grow rapidly over the course of a year.",
    "Once the trees reach 8 to 10 feet (2.4 to 3.0 m), cut them back so they are at your desired level.",
    "Any branches you remove can be dried and propagated to plant another tree.",
    "Store moringa indoors when temperatures are below freezing.",
    "If you live in a temperate climate, you will want to store your tree inside your home or in a greenhouse during the winter.",
    "Moringas are susceptible to the frost and will not survive through the winter.",
    "Moringas can grow up to 6 feet (1.8 m) tall in a year, so plan accordingly with how much space you have available.",
    "Moringa can be restarted each year with cuttings taken from the previous season.",
    "Cuttings from moringa trees are the same age as the tree it was cut from.",
    "Harvesting and Using Moringa Harvest seed pods when they are ⁄8 to ⁄2 inch (9.5 to 12.7 mm) in diameter.",
    "The seed pods, or “drumsticks,” can be pulled and used in recipes and teas.",
    "If you wait until they ripen, the inside may have a stringy and less desirable consistency.",
    "Boil the seed pods until they are soft and squeeze the inner flesh out to eat.",
    "The exterior of the pod is fibrous and inedible.",
    "Pull leaves after the moringa is 3 feet (0.91 m) tall.",
    "Moringa leaves are considered a “superfood” and can be pulled at any time once the tree is over 3 feet (0.91 m) tall.",
    "This way, as you pull the leaves off by hand, the branches will have grown strong enough and won’t break.",
    "Steep the moringa leaves to make an herbal tea, or add them to your smoothies or salads for added nutrients.",
    "Grind the leaves into a powder.",
    "Dry the leaves in a dehydrator or by hanging them.",
    "Once the leaves feel crinkly and crispy, remove them from the stem by hand.",
    "To grind them into a powder, use a food processor or grinder until it is fine.",
    "Moringa powder can be added to any meal 1 tsp (3 g) at a time.",
    "The leaves can also be dried or eaten fresh.",
    "Use moringa for medical and nutritional needs.",
    "Moringa is filled with antioxidants as well as necessary vitamins and minerals.",
    "People have eaten moringa to help combat inflammation, arthritis, stomach pains, and asthma.",
    "The seeds, fruit, and leaves can all be consumed.",
    "The roots of moringa have the aroma of horseradish and should not be eaten, since they contain toxins."
  ],
  "tyn_section":[
    "Moringa seeds",
    "2 US gal (7.6 L) pot",
    "Potting mixture of soil, sand, and compost",
    "Watering can",
    "Pruning shears",
    "15 US gal (57 L) pot"
  ],
  "tyn_model":[
    "moringa",
    "water",
    "pot",
    "compost",
    "moringas",
    "moringa seeds",
    "seeds",
    "pruning shears",
    "sand",
    "moringa leaves",
    "moringa seed",
    "soil",
    "potting soil",
    "pots",
    "⅓ of",
    "potting mixture",
    "watering can",
    "ruler",
    "moringa tree",
    "moringa trees",
    "“drumsticks",
    "” can",
    "“superfood",
    "” and",
    "herbal tea",
    "dehydrator",
    "food processor",
    "moringa powder",
    "horseradish"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1034482759,
    "f1":0.1714285714,
    "avg_pos":0.1724137931
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1724137931,
    "f1":0.2564102564
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.3793103448,
    "f1":0.431372549
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1034482759,
    "f1":0.1714285714
  }
}