{
  "title":"How to Remove Hardwood Floor",
  "url":"https://www.wikihow.com/Remove-Hardwood-Floor",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Floor Types"
  ],
  "parts":[
    {
      "name":"Preparing Your Work Area",
      "steps":[
        {
          "headline":"Map out the removal area.",
          "description":"Determine exactly how much flooring you need to pull up and where you’ll start. You may want to do away with the entire floor and put in a new one, or you might decide to only remove a particular section in order to have carpet, tile or laminate installed to change the layout of your floorplan. Having a clear idea in mind of how best to proceed will help you carry out the project more efficiently. Generally, it’s easiest to remove one or two central boards and work your way outward from there. Use to tape to mark off specific boundaries and make cutting and prying more precise."
        },
        {
          "headline":"Lay down tarps to control the spread of dust and debris.",
          "description":"Use tarps to cover light fixtures, furniture, appliances and anything else that you don’t want coated in sawdust once you begin sawing. You should also remove as much clutter from the work area as possible beforehand to give yourself a maximum amount of room to work. Remove any computers, gaming systems, TVs, and other sensitive electronics from the room completely. Even they are covered, the internal components can still be damaged. Tack up your tarps with masking or painter’s tape that can be peeled away easily when you’re done. While it may be tempting to skip this step, it’s not recommended. Cleaning sawdust from unprotected surfaces is an exhaustive effort that will add greatly to your overall project time."
        },
        {
          "headline":"Equip with the proper safety gear.",
          "description":"Before you get started, make sure you’re prepared to tackle the project safely. Put on rugged work gloves to protect your hands while operating the circular saw, some protective eyewear and a breathing mask to filter out sawdust and mold. You should also make a point of wearing closed-toed shoes with thick soles, as you’ll be surrounded by loose nails and other exposed edges. Long-sleeved clothing will keep your skin from being exposed to dust and hazardous objects. Since you’ll be spending hours kneeling to pry up the planks, a pair of knee pads can be a lifesaver."
        }
      ]
    },
    {
      "name":"Cutting and Prying up Hardwood Floors",
      "steps":[
        {
          "headline":"Saw the boards into small sections 3 feet (0.91 m) wide.",
          "description":"Cut across the boards perpendicularly at intervals. This will reduce them to a more manageable size and make them easier to pry up later. Run the saw in a straight line from one end of the work area to the other, then turn and continue in the opposite direction. Set the depth of the saw blade to the same thickness as the hardwood so that you don’t accidentally scar your subflooring. For instance, if your flooring is ⁄8 inch (16 mm) thick, your saw guard should also be positioned at ⁄8 inch (16 mm). Make your cuts approximately every one to two feet, and be sure to avoid sawing over the “tongue” end of the board."
        },
        {
          "headline":"Use a pry bar to pull up the boards.",
          "description":"Wedge the tip of the pry bar underneath a section of flooring. Pull back sharply on the handle to wrench the board from its place. Assuming you’ve sawed the boards into small enough sections, they should pop right out. Repeat this process until all the flooring has been removed. Always pry up the boards in the same direction that they’re nailed down. This will help prevent cracking and splintering. If the boards are stuck too firmly to be budged, strike the underside of the board where it meets the subflooring with a chisel to create separation. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMitchell Newman\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPrincipal, Habitar Design and Stratagem Construction\t\t\t\t\t\t\t\tMitchell Newman is the Principal at Habitar Design and its sister company Stratagem Construction in Chicago, Illinois. He has 20 years of experience in construction, interior design and real estate development. Mitchell Newman\t\t\tPrincipal, Habitar Design and Stratagem Construction\t\t\t\tRemoving the flooring will be simple if it isn't glued. Mitchell Newman, the Principal of Habitar Design and Stratagem Construction, says: \"If you're removing regular tongue-and-groove flooring that isn't glued to the floor, the hardest part will be prying the first few boards loose with your crowbar. Once you do that, you can just use your crowbar to keep pulling up the boards all the way across the floor. If the floor is glued, you can just set your saw up for a cut that's the exact thickness of the board, then pull it up with a crowbar after you cut it.\""
        },
        {
          "headline":"Dispose of the old flooring.",
          "description":"Keep a large, lined trash receptacle in your work area so that you’ll have something to drop the discarded wood fragments into as you go. This is a much safer and more organized approach than throwing everything into a loose pile. When you’re finished, the old flooring will be carted off to the dump or recycling center. Be careful around the disposal bin, as there will likely be lots of stray nails and jagged edges exposed."
        },
        {
          "headline":"Pick up remaining nails and staples.",
          "description":"There will likely be a few loose metal fasteners littering the floor, so be careful moving throughout your work area. You can collect these materials by hand or use a powerful handheld magnet to pick up whatever metal scraps happen to be lying around. Spent nails and staples should go straight into the trash. Protruding nails can be bent prior to disposal to make them less of a hazard. Keep your work gloves on throughout the cleanup process in case you come into contact with any sharp objects."
        },
        {
          "headline":"Clean your work area thoroughly.",
          "description":"Sweep the sawdust, wood chips and other debris into small piles, then use a shop vac to suction them up. Take down the tarps, roll them up carefully and move them outside to be cleaned or thrown away. If necessary, go over the area again with a vacuum or mop to clear away any especially fine dust remaining. For deep cleaning jobs, use dust-attracting sprays and a microfiber towel to small particles."
        }
      ]
    },
    {
      "name":"Salvaging Hardwood for Other Projects",
      "steps":[
        {
          "headline":"Cut one board in half lengthwise.",
          "description":"If your hardwood flooring is still in good condition, you may decide that it’s worth keeping and putting to use elsewhere. To successfully salvage hardwood, you’ll need to first saw one board straight down the middle along its length. After tearing out both halves of this board, you’ll have a sufficient amount of space to begin working on the others. It may be necessary to sacrifice one or two boards to put you in a position to remove the others. Dig out a central board and work outward in both directions."
        },
        {
          "headline":"Pry up the remaining boards individually.",
          "description":"Start at one end of the board and work your way down, keeping the tip of the pry bar positioned directly beneath the nails or staples. You’ll want to pull up on the boards rather gingerly to prevent them from splintering. Work slowly, doing your best to keep each board intact. Move the pry bar along about half a foot at a time, focusing on areas that are held down by fasteners or adhesives. Preserving your flooring is a time consuming process, but the payoff is a fresh supply of useful hardwood."
        },
        {
          "headline":"Extract all nails and staples.",
          "description":"Once you’ve got all the boards up, go through them one at a time and ease out the fasteners that were used to secure them. The best tools for this task are a nail claw or the back of a hammer and a pair of locking pliers. Be patient—it will take a while to remove every last nail and staple. Work slowly and delicately to avoid causing unnecessary damage to the wood. Use a handheld magnet to speed up the collection and disposal of small metal pieces."
        },
        {
          "headline":"Clean and store the salvaged wood.",
          "description":"From here, you’re free to hang onto the hardwood or employ it in other projects. Wipe down each board with a damp cloth and keep them in a cool, dry environment until you’re ready to use them. If you wish, you can polish or sand and stain older wood to restore it like-new condition. Recycled wood can be used to provide flooring for another room in your home, create unique, rustic wall paneling, construct a garden footpath or any number of other projects. In some cases, you may be able to sell reclaimed wood to other companies or individuals seeking inexpensive building materials. The longer the pieces are, the more valuable they are."
        }
      ]
    }
  ],
  "text":" Preparing Your Work Area Map out the removal area. Determine exactly how much flooring you need to pull up and where you’ll start. You may want to do away with the entire floor and put in a new one, or you might decide to only remove a particular section in order to have carpet, tile or laminate installed to change the layout of your floorplan. Having a clear idea in mind of how best to proceed will help you carry out the project more efficiently. Generally, it’s easiest to remove one or two central boards and work your way outward from there. Use to tape to mark off specific boundaries and make cutting and prying more precise. Lay down tarps to control the spread of dust and debris. Use tarps to cover light fixtures, furniture, appliances and anything else that you don’t want coated in sawdust once you begin sawing. You should also remove as much clutter from the work area as possible beforehand to give yourself a maximum amount of room to work. Remove any computers, gaming systems, TVs, and other sensitive electronics from the room completely. Even they are covered, the internal components can still be damaged. Tack up your tarps with masking or painter’s tape that can be peeled away easily when you’re done. While it may be tempting to skip this step, it’s not recommended. Cleaning sawdust from unprotected surfaces is an exhaustive effort that will add greatly to your overall project time. Equip with the proper safety gear. Before you get started, make sure you’re prepared to tackle the project safely. Put on rugged work gloves to protect your hands while operating the circular saw, some protective eyewear and a breathing mask to filter out sawdust and mold. You should also make a point of wearing closed-toed shoes with thick soles, as you’ll be surrounded by loose nails and other exposed edges. Long-sleeved clothing will keep your skin from being exposed to dust and hazardous objects. Since you’ll be spending hours kneeling to pry up the planks, a pair of knee pads can be a lifesaver. Cutting and Prying up Hardwood Floors Saw the boards into small sections 3 feet (0.91 m) wide. Cut across the boards perpendicularly at intervals. This will reduce them to a more manageable size and make them easier to pry up later. Run the saw in a straight line from one end of the work area to the other, then turn and continue in the opposite direction. Set the depth of the saw blade to the same thickness as the hardwood so that you don’t accidentally scar your subflooring. For instance, if your flooring is ⁄8 inch (16 mm) thick, your saw guard should also be positioned at ⁄8 inch (16 mm). Make your cuts approximately every one to two feet, and be sure to avoid sawing over the “tongue” end of the board. Use a pry bar to pull up the boards. Wedge the tip of the pry bar underneath a section of flooring. Pull back sharply on the handle to wrench the board from its place. Assuming you’ve sawed the boards into small enough sections, they should pop right out. Repeat this process until all the flooring has been removed. Always pry up the boards in the same direction that they’re nailed down. This will help prevent cracking and splintering. If the boards are stuck too firmly to be budged, strike the underside of the board where it meets the subflooring with a chisel to create separation. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMitchell Newman\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPrincipal, Habitar Design and Stratagem Construction\t\t\t\t\t\t\t\tMitchell Newman is the Principal at Habitar Design and its sister company Stratagem Construction in Chicago, Illinois. He has 20 years of experience in construction, interior design and real estate development. Mitchell Newman\t\t\tPrincipal, Habitar Design and Stratagem Construction\t\t\t\tRemoving the flooring will be simple if it isn't glued. Mitchell Newman, the Principal of Habitar Design and Stratagem Construction, says: \"If you're removing regular tongue-and-groove flooring that isn't glued to the floor, the hardest part will be prying the first few boards loose with your crowbar. Once you do that, you can just use your crowbar to keep pulling up the boards all the way across the floor. If the floor is glued, you can just set your saw up for a cut that's the exact thickness of the board, then pull it up with a crowbar after you cut it.\" Dispose of the old flooring. Keep a large, lined trash receptacle in your work area so that you’ll have something to drop the discarded wood fragments into as you go. This is a much safer and more organized approach than throwing everything into a loose pile. When you’re finished, the old flooring will be carted off to the dump or recycling center. Be careful around the disposal bin, as there will likely be lots of stray nails and jagged edges exposed. Pick up remaining nails and staples. There will likely be a few loose metal fasteners littering the floor, so be careful moving throughout your work area. You can collect these materials by hand or use a powerful handheld magnet to pick up whatever metal scraps happen to be lying around. Spent nails and staples should go straight into the trash. Protruding nails can be bent prior to disposal to make them less of a hazard. Keep your work gloves on throughout the cleanup process in case you come into contact with any sharp objects. Clean your work area thoroughly. Sweep the sawdust, wood chips and other debris into small piles, then use a shop vac to suction them up. Take down the tarps, roll them up carefully and move them outside to be cleaned or thrown away. If necessary, go over the area again with a vacuum or mop to clear away any especially fine dust remaining. For deep cleaning jobs, use dust-attracting sprays and a microfiber towel to small particles. Salvaging Hardwood for Other Projects Cut one board in half lengthwise. If your hardwood flooring is still in good condition, you may decide that it’s worth keeping and putting to use elsewhere. To successfully salvage hardwood, you’ll need to first saw one board straight down the middle along its length. After tearing out both halves of this board, you’ll have a sufficient amount of space to begin working on the others. It may be necessary to sacrifice one or two boards to put you in a position to remove the others. Dig out a central board and work outward in both directions. Pry up the remaining boards individually. Start at one end of the board and work your way down, keeping the tip of the pry bar positioned directly beneath the nails or staples. You’ll want to pull up on the boards rather gingerly to prevent them from splintering. Work slowly, doing your best to keep each board intact. Move the pry bar along about half a foot at a time, focusing on areas that are held down by fasteners or adhesives. Preserving your flooring is a time consuming process, but the payoff is a fresh supply of useful hardwood. Extract all nails and staples. Once you’ve got all the boards up, go through them one at a time and ease out the fasteners that were used to secure them. The best tools for this task are a nail claw or the back of a hammer and a pair of locking pliers. Be patient—it will take a while to remove every last nail and staple. Work slowly and delicately to avoid causing unnecessary damage to the wood. Use a handheld magnet to speed up the collection and disposal of small metal pieces. Clean and store the salvaged wood. From here, you’re free to hang onto the hardwood or employ it in other projects. Wipe down each board with a damp cloth and keep them in a cool, dry environment until you’re ready to use them. If you wish, you can polish or sand and stain older wood to restore it like-new condition. Recycled wood can be used to provide flooring for another room in your home, create unique, rustic wall paneling, construct a garden footpath or any number of other projects. In some cases, you may be able to sell reclaimed wood to other companies or individuals seeking inexpensive building materials. The longer the pieces are, the more valuable they are.",
  "sentences":[
    " Preparing Your Work Area Map out the removal area.",
    "Determine exactly how much flooring you need to pull up and where you’ll start.",
    "You may want to do away with the entire floor and put in a new one, or you might decide to only remove a particular section in order to have carpet, tile or laminate installed to change the layout of your floorplan.",
    "Having a clear idea in mind of how best to proceed will help you carry out the project more efficiently.",
    "Generally, it’s easiest to remove one or two central boards and work your way outward from there.",
    "Use to tape to mark off specific boundaries and make cutting and prying more precise.",
    "Lay down tarps to control the spread of dust and debris.",
    "Use tarps to cover light fixtures, furniture, appliances and anything else that you don’t want coated in sawdust once you begin sawing.",
    "You should also remove as much clutter from the work area as possible beforehand to give yourself a maximum amount of room to work.",
    "Remove any computers, gaming systems, TVs, and other sensitive electronics from the room completely.",
    "Even they are covered, the internal components can still be damaged.",
    "Tack up your tarps with masking or painter’s tape that can be peeled away easily when you’re done.",
    "While it may be tempting to skip this step, it’s not recommended.",
    "Cleaning sawdust from unprotected surfaces is an exhaustive effort that will add greatly to your overall project time.",
    "Equip with the proper safety gear.",
    "Before you get started, make sure you’re prepared to tackle the project safely.",
    "Put on rugged work gloves to protect your hands while operating the circular saw, some protective eyewear and a breathing mask to filter out sawdust and mold.",
    "You should also make a point of wearing closed-toed shoes with thick soles, as you’ll be surrounded by loose nails and other exposed edges.",
    "Long-sleeved clothing will keep your skin from being exposed to dust and hazardous objects.",
    "Since you’ll be spending hours kneeling to pry up the planks, a pair of knee pads can be a lifesaver.",
    "Cutting and Prying up Hardwood Floors Saw the boards into small sections 3 feet (0.91 m) wide.",
    "Cut across the boards perpendicularly at intervals.",
    "This will reduce them to a more manageable size and make them easier to pry up later.",
    "Run the saw in a straight line from one end of the work area to the other, then turn and continue in the opposite direction.",
    "Set the depth of the saw blade to the same thickness as the hardwood so that you don’t accidentally scar your subflooring.",
    "For instance, if your flooring is ⁄8 inch (16 mm) thick, your saw guard should also be positioned at ⁄8 inch (16 mm).",
    "Make your cuts approximately every one to two feet, and be sure to avoid sawing over the “tongue” end of the board.",
    "Use a pry bar to pull up the boards.",
    "Wedge the tip of the pry bar underneath a section of flooring.",
    "Pull back sharply on the handle to wrench the board from its place.",
    "Assuming you’ve sawed the boards into small enough sections, they should pop right out.",
    "Repeat this process until all the flooring has been removed.",
    "Always pry up the boards in the same direction that they’re nailed down.",
    "This will help prevent cracking and splintering.",
    "If the boards are stuck too firmly to be budged, strike the underside of the board where it meets the subflooring with a chisel to create separation.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMitchell Newman\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPrincipal, Habitar Design and Stratagem Construction\t\t\t\t\t\t\t\tMitchell Newman is the Principal at Habitar Design and its sister company Stratagem Construction in Chicago, Illinois.",
    "He has 20 years of experience in construction, interior design and real estate development.",
    "Mitchell Newman\t\t\tPrincipal, Habitar Design and Stratagem Construction\t\t\t\tRemoving the flooring will be simple if it isn't glued.",
    "Mitchell Newman, the Principal of Habitar Design and Stratagem Construction, says: \"If you're removing regular tongue-and-groove flooring that isn't glued to the floor, the hardest part will be prying the first few boards loose with your crowbar.",
    "Once you do that, you can just use your crowbar to keep pulling up the boards all the way across the floor.",
    "If the floor is glued, you can just set your saw up for a cut that's the exact thickness of the board, then pull it up with a crowbar after you cut it.\"",
    "Dispose of the old flooring.",
    "Keep a large, lined trash receptacle in your work area so that you’ll have something to drop the discarded wood fragments into as you go.",
    "This is a much safer and more organized approach than throwing everything into a loose pile.",
    "When you’re finished, the old flooring will be carted off to the dump or recycling center.",
    "Be careful around the disposal bin, as there will likely be lots of stray nails and jagged edges exposed.",
    "Pick up remaining nails and staples.",
    "There will likely be a few loose metal fasteners littering the floor, so be careful moving throughout your work area.",
    "You can collect these materials by hand or use a powerful handheld magnet to pick up whatever metal scraps happen to be lying around.",
    "Spent nails and staples should go straight into the trash.",
    "Protruding nails can be bent prior to disposal to make them less of a hazard.",
    "Keep your work gloves on throughout the cleanup process in case you come into contact with any sharp objects.",
    "Clean your work area thoroughly.",
    "Sweep the sawdust, wood chips and other debris into small piles, then use a shop vac to suction them up.",
    "Take down the tarps, roll them up carefully and move them outside to be cleaned or thrown away.",
    "If necessary, go over the area again with a vacuum or mop to clear away any especially fine dust remaining.",
    "For deep cleaning jobs, use dust-attracting sprays and a microfiber towel to small particles.",
    "Salvaging Hardwood for Other Projects Cut one board in half lengthwise.",
    "If your hardwood flooring is still in good condition, you may decide that it’s worth keeping and putting to use elsewhere.",
    "To successfully salvage hardwood, you’ll need to first saw one board straight down the middle along its length.",
    "After tearing out both halves of this board, you’ll have a sufficient amount of space to begin working on the others.",
    "It may be necessary to sacrifice one or two boards to put you in a position to remove the others.",
    "Dig out a central board and work outward in both directions.",
    "Pry up the remaining boards individually.",
    "Start at one end of the board and work your way down, keeping the tip of the pry bar positioned directly beneath the nails or staples.",
    "You’ll want to pull up on the boards rather gingerly to prevent them from splintering.",
    "Work slowly, doing your best to keep each board intact.",
    "Move the pry bar along about half a foot at a time, focusing on areas that are held down by fasteners or adhesives.",
    "Preserving your flooring is a time consuming process, but the payoff is a fresh supply of useful hardwood.",
    "Extract all nails and staples.",
    "Once you’ve got all the boards up, go through them one at a time and ease out the fasteners that were used to secure them.",
    "The best tools for this task are a nail claw or the back of a hammer and a pair of locking pliers.",
    "Be patient—it will take a while to remove every last nail and staple.",
    "Work slowly and delicately to avoid causing unnecessary damage to the wood.",
    "Use a handheld magnet to speed up the collection and disposal of small metal pieces.",
    "Clean and store the salvaged wood.",
    "From here, you’re free to hang onto the hardwood or employ it in other projects.",
    "Wipe down each board with a damp cloth and keep them in a cool, dry environment until you’re ready to use them.",
    "If you wish, you can polish or sand and stain older wood to restore it like-new condition.",
    "Recycled wood can be used to provide flooring for another room in your home, create unique, rustic wall paneling, construct a garden footpath or any number of other projects.",
    "In some cases, you may be able to sell reclaimed wood to other companies or individuals seeking inexpensive building materials.",
    "The longer the pieces are, the more valuable they are."
  ],
  "tyn_section":[
    "Circular saw",
    "Pry bar",
    "Hammer or nail claw",
    "Locking pliers",
    "Chisel",
    "Plastic tarps",
    "Painter's tape",
    "Breathing mask",
    "Protective goggles or work glasses",
    "Work gloves",
    "Construction knee pads",
    "Closed-toed footwear"
  ],
  "tyn_model":[
    "nails",
    "saw",
    "tarps",
    "pry bar",
    "habitar design",
    "stratagem construction",
    "crowbar",
    "staples",
    "hardwood",
    "wood",
    "tile",
    "laminate",
    "tape",
    "painter’s tape",
    "circular saw",
    "breathing mask",
    "“tongue",
    "” end",
    "board",
    "chisel",
    "interior design and real estate development.",
    "habitar design and stratagem construction",
    "work gloves",
    "wood chips",
    "shop vac",
    "vacuum",
    "microfiber towel",
    "pry",
    "hammer",
    "pliers",
    "—it"
  ],
  "simple_metrics":{
    "r":0.4166666667,
    "p":0.1612903226,
    "f1":0.2325581395,
    "avg_pos":0.4516129032
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.3225806452,
    "f1":0.4347826087
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.3548387097,
    "f1":0.4631578947
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4166666667,
    "p":0.1612903226,
    "f1":0.2325581395
  }
}