{
  "title":"How to Make Ube Ice Cream",
  "url":"https://www.wikihow.com/Make-Ube-Ice-Cream",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Fruit Ice Cream"
  ],
  "parts":[
    {
      "name":"Making Classic Ube Ice Cream",
      "steps":[
        {
          "headline":"Set up a steamer and steam the grated ube.",
          "description":"Take a bag of purchased grated ube and measure out 1 cup (250 g). Put the grated ube into a steamer basket over a few inches (5 cm) of simmering water and put the lid on. Steam the ube for 15 minutes. It should become completely soft. You can also buy whole ube and prepare it yourself. Wear kitchen gloves to peel the ube, since it can make your hands itchy and use a box grater to grate the ube."
        },
        {
          "headline":"Mash the steamed ube.",
          "description":"Take the lid off of the steamer and remove the steamed ube. Transfer the ube to a small bowl and use a fork to mash the steamed ube until it's smooth."
        },
        {
          "headline":"Heat the milk and sugar.",
          "description":"Get out a medium saucepan and measure 1 cup (240 ml) of whole milk and 2/3 cup (145 g) of sugar into it. Turn the heat on to medium and stir the mixture until the liquid barely starts bubbling. Turn off the heat. Heating the milk and sugar should make the sugar dissolve. This will give you smooth ube ice cream."
        },
        {
          "headline":"Blend in the ube and heavy whipping cream.",
          "description":"Add 1½ cups (360 ml) of heavy whipping cream and the steamed ube to the saucepan. Carefully place an immersion blender into the saucepan and turn it on. Blend the mixture until it's totally smooth. If you don't have an immersion blender, you could pour the ice cream mixture into a blender. Puree the mixture until it's completely smooth."
        },
        {
          "headline":"Strain and chill the ube ice cream mixture.",
          "description":"Set a mesh strainer or sieve over a medium mixing bowl. Slowly pour the ice cream mixture through the strainer, so the liquid is transferred to the bowl. Cover the bowl with plastic wrap and chill it in the refrigerator for at least 2 hours. It needs to be completely cold before you freeze it. You can throw away the solids that end up in the strainer."
        },
        {
          "headline":"Freeze the mixture in an ice cream maker.",
          "description":"Set up your ice cream maker according to the manufacturer's instructions. Remove the chilled ice cream mixture from the fridge and pour it into the frozen part of the ice cream maker. Turn the maker on, so the machine churns the ice cream. It should take about 10 to 15 minutes for the ice cream to form. If you prefer more of a soft-serve texture, you can serve the ube ice cream right out of the ice cream maker. For a firmer ice cream, freeze it for a few hours in the freezer before you serve."
        }
      ]
    },
    {
      "name":"Making Vegan Ube Ice Cream",
      "steps":[
        {
          "headline":"Prepare the ube.",
          "description":"If you want to make ube ice cream using whole ube, you'll need to peel one ube. Carefully chop the ube into chunks, so you get 3/4 cup of ube chunks. Place these in a pot with enough water to cover them and bring it to a boil. Boil the ube until it's totally soft. Drain the water and transfer the cooked ube to a blender. You may want to wear gloves to prevent the ube from making your fingers and hands itchy. If you want to purchase ube puree, you'll need to buy and thaw 1/2 cup (100 g) of ube puree. Place the puree in a blender."
        },
        {
          "headline":"Blend the ube ice cream ingredients.",
          "description":"Measure 1½ cups (360 ml) of full-fat coconut milk into the blender with the prepared ube. Add 1 tablespoon of arrowroot powder and ¼ cup (60 ml) maple syrup. Put the lid on the blender and blitz it until the mixture is completely smooth. If you can't find arrowroot powder, you can use tapioca flour or cornstarch."
        },
        {
          "headline":"Boil the ube ice cream mixture.",
          "description":"Remove the blender lid and pour the ice cream mixture into a medium saucepan. Turn the heat on to medium-high, so the mixture starts to boil. Stir it occasionally to keep it from sticking. Turn off the heat and whisk the mixture. The ice cream mixture will thicken a little as it cooks. Whisking can prevent lumps from forming."
        },
        {
          "headline":"Whisk in the vanilla and chill the ice cream mixture.",
          "description":"Once you've removed the ice cream mixture from the heat, stir in 2 teaspoons of vanilla extract. Pour the ice cream mixture into an airtight container and put it in the fridge to chill. It should chill at least 2 hours or overnight. The ice cream mixture will need to be totally cold before you freeze the ice cream in your machine."
        },
        {
          "headline":"Churn the ice cream in a machine.",
          "description":"Prepare your ice cream maker according to the manufacturer's instructions. Pour the chilled ice cream base into the frozen bowl of the machine and turn it on. Churn the ice cream until it sets up and is firm. You can serve it immediately if you like it a little soft. For a firmer ice cream, scoop the ice cream into a container and freeze the ice cream until it's hard."
        }
      ]
    }
  ],
  "text":" Making Classic Ube Ice Cream Set up a steamer and steam the grated ube. Take a bag of purchased grated ube and measure out 1 cup (250 g). Put the grated ube into a steamer basket over a few inches (5 cm) of simmering water and put the lid on. Steam the ube for 15 minutes. It should become completely soft. You can also buy whole ube and prepare it yourself. Wear kitchen gloves to peel the ube, since it can make your hands itchy and use a box grater to grate the ube. Mash the steamed ube. Take the lid off of the steamer and remove the steamed ube. Transfer the ube to a small bowl and use a fork to mash the steamed ube until it's smooth. Heat the milk and sugar. Get out a medium saucepan and measure 1 cup (240 ml) of whole milk and 2/3 cup (145 g) of sugar into it. Turn the heat on to medium and stir the mixture until the liquid barely starts bubbling. Turn off the heat. Heating the milk and sugar should make the sugar dissolve. This will give you smooth ube ice cream. Blend in the ube and heavy whipping cream. Add 1½ cups (360 ml) of heavy whipping cream and the steamed ube to the saucepan. Carefully place an immersion blender into the saucepan and turn it on. Blend the mixture until it's totally smooth. If you don't have an immersion blender, you could pour the ice cream mixture into a blender. Puree the mixture until it's completely smooth. Strain and chill the ube ice cream mixture. Set a mesh strainer or sieve over a medium mixing bowl. Slowly pour the ice cream mixture through the strainer, so the liquid is transferred to the bowl. Cover the bowl with plastic wrap and chill it in the refrigerator for at least 2 hours. It needs to be completely cold before you freeze it. You can throw away the solids that end up in the strainer. Freeze the mixture in an ice cream maker. Set up your ice cream maker according to the manufacturer's instructions. Remove the chilled ice cream mixture from the fridge and pour it into the frozen part of the ice cream maker. Turn the maker on, so the machine churns the ice cream. It should take about 10 to 15 minutes for the ice cream to form. If you prefer more of a soft-serve texture, you can serve the ube ice cream right out of the ice cream maker. For a firmer ice cream, freeze it for a few hours in the freezer before you serve. Making Vegan Ube Ice Cream Prepare the ube. If you want to make ube ice cream using whole ube, you'll need to peel one ube. Carefully chop the ube into chunks, so you get 3/4 cup of ube chunks. Place these in a pot with enough water to cover them and bring it to a boil. Boil the ube until it's totally soft. Drain the water and transfer the cooked ube to a blender. You may want to wear gloves to prevent the ube from making your fingers and hands itchy. If you want to purchase ube puree, you'll need to buy and thaw 1/2 cup (100 g) of ube puree. Place the puree in a blender. Blend the ube ice cream ingredients. Measure 1½ cups (360 ml) of full-fat coconut milk into the blender with the prepared ube. Add 1 tablespoon of arrowroot powder and ¼ cup (60 ml) maple syrup. Put the lid on the blender and blitz it until the mixture is completely smooth. If you can't find arrowroot powder, you can use tapioca flour or cornstarch. Boil the ube ice cream mixture. Remove the blender lid and pour the ice cream mixture into a medium saucepan. Turn the heat on to medium-high, so the mixture starts to boil. Stir it occasionally to keep it from sticking. Turn off the heat and whisk the mixture. The ice cream mixture will thicken a little as it cooks. Whisking can prevent lumps from forming. Whisk in the vanilla and chill the ice cream mixture. Once you've removed the ice cream mixture from the heat, stir in 2 teaspoons of vanilla extract. Pour the ice cream mixture into an airtight container and put it in the fridge to chill. It should chill at least 2 hours or overnight. The ice cream mixture will need to be totally cold before you freeze the ice cream in your machine. Churn the ice cream in a machine. Prepare your ice cream maker according to the manufacturer's instructions. Pour the chilled ice cream base into the frozen bowl of the machine and turn it on. Churn the ice cream until it sets up and is firm. You can serve it immediately if you like it a little soft. For a firmer ice cream, scoop the ice cream into a container and freeze the ice cream until it's hard.",
  "sentences":[
    " Making Classic Ube Ice Cream Set up a steamer and steam the grated ube.",
    "Take a bag of purchased grated ube and measure out 1 cup (250 g).",
    "Put the grated ube into a steamer basket over a few inches (5 cm) of simmering water and put the lid on.",
    "Steam the ube for 15 minutes.",
    "It should become completely soft.",
    "You can also buy whole ube and prepare it yourself.",
    "Wear kitchen gloves to peel the ube, since it can make your hands itchy and use a box grater to grate the ube.",
    "Mash the steamed ube.",
    "Take the lid off of the steamer and remove the steamed ube.",
    "Transfer the ube to a small bowl and use a fork to mash the steamed ube until it's smooth.",
    "Heat the milk and sugar.",
    "Get out a medium saucepan and measure 1 cup (240 ml) of whole milk and 2/3 cup (145 g) of sugar into it.",
    "Turn the heat on to medium and stir the mixture until the liquid barely starts bubbling.",
    "Turn off the heat.",
    "Heating the milk and sugar should make the sugar dissolve.",
    "This will give you smooth ube ice cream.",
    "Blend in the ube and heavy whipping cream.",
    "Add 1½ cups (360 ml) of heavy whipping cream and the steamed ube to the saucepan.",
    "Carefully place an immersion blender into the saucepan and turn it on.",
    "Blend the mixture until it's totally smooth.",
    "If you don't have an immersion blender, you could pour the ice cream mixture into a blender.",
    "Puree the mixture until it's completely smooth.",
    "Strain and chill the ube ice cream mixture.",
    "Set a mesh strainer or sieve over a medium mixing bowl.",
    "Slowly pour the ice cream mixture through the strainer, so the liquid is transferred to the bowl.",
    "Cover the bowl with plastic wrap and chill it in the refrigerator for at least 2 hours.",
    "It needs to be completely cold before you freeze it.",
    "You can throw away the solids that end up in the strainer.",
    "Freeze the mixture in an ice cream maker.",
    "Set up your ice cream maker according to the manufacturer's instructions.",
    "Remove the chilled ice cream mixture from the fridge and pour it into the frozen part of the ice cream maker.",
    "Turn the maker on, so the machine churns the ice cream.",
    "It should take about 10 to 15 minutes for the ice cream to form.",
    "If you prefer more of a soft-serve texture, you can serve the ube ice cream right out of the ice cream maker.",
    "For a firmer ice cream, freeze it for a few hours in the freezer before you serve.",
    "Making Vegan Ube Ice Cream Prepare the ube.",
    "If you want to make ube ice cream using whole ube, you'll need to peel one ube.",
    "Carefully chop the ube into chunks, so you get 3/4 cup of ube chunks.",
    "Place these in a pot with enough water to cover them and bring it to a boil.",
    "Boil the ube until it's totally soft.",
    "Drain the water and transfer the cooked ube to a blender.",
    "You may want to wear gloves to prevent the ube from making your fingers and hands itchy.",
    "If you want to purchase ube puree, you'll need to buy and thaw 1/2 cup (100 g) of ube puree.",
    "Place the puree in a blender.",
    "Blend the ube ice cream ingredients.",
    "Measure 1½ cups (360 ml) of full-fat coconut milk into the blender with the prepared ube.",
    "Add 1 tablespoon of arrowroot powder and ¼ cup (60 ml) maple syrup.",
    "Put the lid on the blender and blitz it until the mixture is completely smooth.",
    "If you can't find arrowroot powder, you can use tapioca flour or cornstarch.",
    "Boil the ube ice cream mixture.",
    "Remove the blender lid and pour the ice cream mixture into a medium saucepan.",
    "Turn the heat on to medium-high, so the mixture starts to boil.",
    "Stir it occasionally to keep it from sticking.",
    "Turn off the heat and whisk the mixture.",
    "The ice cream mixture will thicken a little as it cooks.",
    "Whisking can prevent lumps from forming.",
    "Whisk in the vanilla and chill the ice cream mixture.",
    "Once you've removed the ice cream mixture from the heat, stir in 2 teaspoons of vanilla extract.",
    "Pour the ice cream mixture into an airtight container and put it in the fridge to chill.",
    "It should chill at least 2 hours or overnight.",
    "The ice cream mixture will need to be totally cold before you freeze the ice cream in your machine.",
    "Churn the ice cream in a machine.",
    "Prepare your ice cream maker according to the manufacturer's instructions.",
    "Pour the chilled ice cream base into the frozen bowl of the machine and turn it on.",
    "Churn the ice cream until it sets up and is firm.",
    "You can serve it immediately if you like it a little soft.",
    "For a firmer ice cream, scoop the ice cream into a container and freeze the ice cream until it's hard."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Steamer with lid",
    "Fork",
    "Ice cream maker",
    "Immersion blender",
    "Blender, optional",
    "Medium saucepan",
    "Whisk, optional",
    "Strainer or mesh sieve",
    "Medium bowl",
    "Plastic wrap",
    "Knife and cutting board",
    "Airtight container"
  ],
  "tyn_model":[
    "ice cream",
    "blender",
    "ice cream maker",
    "sugar",
    "water",
    "steamer",
    "milk",
    "medium saucepan",
    "heavy whipping cream",
    "saucepan",
    "immersion blender",
    "strainer",
    "arrowroot powder",
    "steamer basket",
    "box grater",
    "small bowl",
    "fork",
    "whole milk",
    "mesh strainer",
    "sieve",
    "medium mixing bowl",
    "plastic wrap",
    "refrigerator",
    "pot",
    "ube puree",
    "full-fat coconut milk",
    "maple syrup",
    "tapioca flour",
    "whisk",
    "vanilla",
    "vanilla extract",
    "airtight container",
    "container"
  ],
  "simple_metrics":{
    "r":0.4615384615,
    "p":0.1818181818,
    "f1":0.2608695652,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6153846154,
    "p":0.3636363636,
    "f1":0.4571428571
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6923076923,
    "p":0.4242424242,
    "f1":0.5260960334
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5384615385,
    "p":0.2424242424,
    "f1":0.3343283582
  }
}