{
  "title":"How to Use a Citrus Squeezer",
  "url":"https://www.wikihow.com/Use-a-Citrus-Squeezer",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "parts":[
    {
      "name":"Choosing and Cutting Fruit",
      "steps":[
        {
          "headline":"Feel the firmness of the fruit.",
          "description":"Select a fresh, ripe fruit. Choose a fruit that’s slightly (and evenly) soft, but not mushy. Avoid juicing a fruit that feels hard. The harder the fruit, the more difficult it will be to juice. The heavier the fruit feels, the juicier it will be! The best citrus fruit has a rind free of blemishes, and a bold, sweet scent."
        },
        {
          "headline":"Ensure the fruit is at least room temperature.",
          "description":"Leave it sitting at room temperature until it is no longer cold to the touch. Warm the fruit in the microwave, on high, for twenty to thirty seconds, if desired. Allow it to cool for one minute. Warm fruit is easier to juice. Warming the fruit is especially useful if it was refrigerated."
        },
        {
          "headline":"Roll the fruit with your hands.",
          "description":"Hold the fruit against a countertop or other surface. Apply gentle pressure. Roll the fruit back and forth. Rolling the fruit loosens its inner segments, to prepare the fruit for juicing."
        },
        {
          "headline":"Cut the fruit with a large chef’s knife.",
          "description":"Make the cut a bit off-center. Cut the fruit lengthwise if it will fit that way into your squeezer. If not, cut the fruit crosswise, then slice off pointy tip of the rind (if applicable). You can get more juice out of fruits like lemons and limes by cutting them lengthwise instead of crosswise. Cutting off the rind tip will give you more leverage for using a manual squeezer."
        }
      ]
    },
    {
      "name":"Extracting the Juice",
      "steps":[
        {
          "headline":"Place the fruit into the squeezer.",
          "description":"Make sure to place the cut side of the fruit facing down. The interior dome of the squeezer should press towards the rind-end of the fruit. Placing the cut side face-down may appear counter-intuitive at first. However, if you leave the cut side facing up, the juice will squirt upwards!"
        },
        {
          "headline":"Bring the handles together.",
          "description":"Hold the squeezer over a bowl. Place the bottom handle in your non-dominant hand. Press down the top handle with your dominant hand, until the handles are close enough together that you can grip them with both hands at once. If you know exactly how much fruit you need to juice, you can skip the separate container and squeeze directly into a pot or other cookware."
        },
        {
          "headline":"Squeeze the handles.",
          "description":"Place one hand in front of the other. Grip the handles of the squeezer with both hands at the same time. Squeeze several times, until juice stops flowing from the squeezer. The squeezer will invert the rind so that it’s almost inside-out."
        }
      ]
    }
  ],
  "text":" Choosing and Cutting Fruit Feel the firmness of the fruit. Select a fresh, ripe fruit. Choose a fruit that’s slightly (and evenly) soft, but not mushy. Avoid juicing a fruit that feels hard. The harder the fruit, the more difficult it will be to juice. The heavier the fruit feels, the juicier it will be! The best citrus fruit has a rind free of blemishes, and a bold, sweet scent. Ensure the fruit is at least room temperature. Leave it sitting at room temperature until it is no longer cold to the touch. Warm the fruit in the microwave, on high, for twenty to thirty seconds, if desired. Allow it to cool for one minute. Warm fruit is easier to juice. Warming the fruit is especially useful if it was refrigerated. Roll the fruit with your hands. Hold the fruit against a countertop or other surface. Apply gentle pressure. Roll the fruit back and forth. Rolling the fruit loosens its inner segments, to prepare the fruit for juicing. Cut the fruit with a large chef’s knife. Make the cut a bit off-center. Cut the fruit lengthwise if it will fit that way into your squeezer. If not, cut the fruit crosswise, then slice off pointy tip of the rind (if applicable). You can get more juice out of fruits like lemons and limes by cutting them lengthwise instead of crosswise. Cutting off the rind tip will give you more leverage for using a manual squeezer. Extracting the Juice Place the fruit into the squeezer. Make sure to place the cut side of the fruit facing down. The interior dome of the squeezer should press towards the rind-end of the fruit. Placing the cut side face-down may appear counter-intuitive at first. However, if you leave the cut side facing up, the juice will squirt upwards! Bring the handles together. Hold the squeezer over a bowl. Place the bottom handle in your non-dominant hand. Press down the top handle with your dominant hand, until the handles are close enough together that you can grip them with both hands at once. If you know exactly how much fruit you need to juice, you can skip the separate container and squeeze directly into a pot or other cookware. Squeeze the handles. Place one hand in front of the other. Grip the handles of the squeezer with both hands at the same time. Squeeze several times, until juice stops flowing from the squeezer. The squeezer will invert the rind so that it’s almost inside-out.",
  "sentences":[
    " Choosing and Cutting Fruit Feel the firmness of the fruit.",
    "Select a fresh, ripe fruit.",
    "Choose a fruit that’s slightly (and evenly) soft, but not mushy.",
    "Avoid juicing a fruit that feels hard.",
    "The harder the fruit, the more difficult it will be to juice.",
    "The heavier the fruit feels, the juicier it will be!",
    "The best citrus fruit has a rind free of blemishes, and a bold, sweet scent.",
    "Ensure the fruit is at least room temperature.",
    "Leave it sitting at room temperature until it is no longer cold to the touch.",
    "Warm the fruit in the microwave, on high, for twenty to thirty seconds, if desired.",
    "Allow it to cool for one minute.",
    "Warm fruit is easier to juice.",
    "Warming the fruit is especially useful if it was refrigerated.",
    "Roll the fruit with your hands.",
    "Hold the fruit against a countertop or other surface.",
    "Apply gentle pressure.",
    "Roll the fruit back and forth.",
    "Rolling the fruit loosens its inner segments, to prepare the fruit for juicing.",
    "Cut the fruit with a large chef’s knife.",
    "Make the cut a bit off-center.",
    "Cut the fruit lengthwise if it will fit that way into your squeezer.",
    "If not, cut the fruit crosswise, then slice off pointy tip of the rind (if applicable).",
    "You can get more juice out of fruits like lemons and limes by cutting them lengthwise instead of crosswise.",
    "Cutting off the rind tip will give you more leverage for using a manual squeezer.",
    "Extracting the Juice Place the fruit into the squeezer.",
    "Make sure to place the cut side of the fruit facing down.",
    "The interior dome of the squeezer should press towards the rind-end of the fruit.",
    "Placing the cut side face-down may appear counter-intuitive at first.",
    "However, if you leave the cut side facing up, the juice will squirt upwards!",
    "Bring the handles together.",
    "Hold the squeezer over a bowl.",
    "Place the bottom handle in your non-dominant hand.",
    "Press down the top handle with your dominant hand, until the handles are close enough together that you can grip them with both hands at once.",
    "If you know exactly how much fruit you need to juice, you can skip the separate container and squeeze directly into a pot or other cookware.",
    "Squeeze the handles.",
    "Place one hand in front of the other.",
    "Grip the handles of the squeezer with both hands at the same time.",
    "Squeeze several times, until juice stops flowing from the squeezer.",
    "The squeezer will invert the rind so that it’s almost inside-out."
  ],
  "tyn_section":[
    "Citrus fruit",
    "Citrus squeezer",
    "Bowl",
    "Chef’s knife",
    "Cutting board"
  ],
  "tyn_model":[
    "squeezer",
    "fruit",
    "citrus fruit",
    "microwave",
    "chef’s knife",
    "lemons",
    "limes",
    "bowl",
    "pot"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.3333333333,
    "f1":0.4285714286,
    "avg_pos":0.2222222222
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.5555555556,
    "f1":0.6557377049
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.5555555556,
    "f1":0.6557377049
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.3333333333,
    "f1":0.4285714286
  }
}