{
  "title":"How to Clean a Gas Stove Top",
  "url":"https://www.wikihow.com/Clean-a-Gas-Stove-Top",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Doing Routine Cleaning",
      "steps":[
        {
          "headline":"Remove grates and burner caps.",
          "description":"Fill your sink with a few drops of dish soap and run some warm water. Then, remove the grates and burner caps from the stove and place them in the water to soak. This will help soften any stuck on food particles. Use mild dish soap such as Dawn or Palmolive. Any soap you would typically use to hand wash dishes will work."
        },
        {
          "headline":"Wipe the stove with a dry cloth to remove loose food particles.",
          "description":"Use a paper towel or dry dishtowel to wipe up any loose bits of dried food on the stovetop itself. There is no need to scrub at this stage, the goal is simply to clear any food debris from the area you want to clean."
        },
        {
          "headline":"Clear the fuel ports and remove any blockages.",
          "description":"Examine the fuel ports of all the burners. Sometimes, burnt bits of food can clog the fuel ports, preventing your stove from lighting properly or creating a burning hazard. To clear any food material, use a small object such as a paperclip to pick any burnt food out of the port. If there are lots of food bits blocking the port, you can use a dry toothbrush to gently brush debris away from the port."
        },
        {
          "headline":"Scrub the stovetop with dish soap and water.",
          "description":"Use the scrubbing side of a wet sponge and a few drops of dish soap to scrub the stovetop. Work in circular motions to remove stubborn spills, wringing and rewetting sponge as it gets dirty. Be careful not to use too much water when cleaning the stovetop, as it can make the fuel ports saturated. Wring your sponge regularly while cleaning. If the fuel ports get too wet, they will temporarily have trouble igniting. When they dry out, this problem will resolve."
        },
        {
          "headline":"Rinse the stovetop with water and dry with a clean towel.",
          "description":"When you’re finished cleaning the stove with the soap, rinse the sponge completely. Then wipe the stovetop once more with just water to rinse. Dry with a clean dishtowel."
        },
        {
          "headline":"Scrub grates and burner caps with soap and water.",
          "description":"Use your scrubbing sponge to clean the grates and burner caps that have been soaking in the soapy solution in the sink. The food bits on them should have softened and will come off easily. Rinse them with plain water once you’ve scrubbed off all food bits, drying with a clean dishtowel."
        }
      ]
    },
    {
      "name":"Removing Tough Messes",
      "steps":[
        {
          "headline":"Heat a wet towel.",
          "description":"If the crust of food on your stove isn’t coming off with soap and water, try a towel “mask.” Wet a dishtowel, wring it, and warm it in the microwave for 30 seconds. If your microwave is particularly powerful, be careful of any hot steam coming off the towel when you open the microwave."
        },
        {
          "headline":"Cover stuck-on grime with your warm towel.",
          "description":"Use the damp, warm towel to cover any stuck on bits on the stove, leaving the towel in place for 15 minutes. You can repeat this step several times. The warm steam helps loosen stuck on gunk on the stove. When the mess on the stove is loose, scrub as normal with warm water and soap."
        },
        {
          "headline":"Use a solution of white vinegar and water.",
          "description":"If soap and water alone aren’t cutting the grime on your stove, you can create a mix of 50% white vinegar and 50% water as a homemade cleaning solution. Scrub your stove using the solution with the rough side of a sponge. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndrii Gurskyi\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\t\t\t\t\tAndrii Gurskyi is the owner and founder of Rainbow Cleaning Service, a New York City cleaning company specializing in apartments, homes, and moving cleanup using non-toxic and artificial fragrance free cleaning solutions. Founded in 2010, Andrii and Rainbow Cleaning Service has served over 35,000 customers. Andrii Gurskyi\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\tIf the mess isn't that bad, you can use vinegar, water, and dish soap. If the stovetop is very dirty, try using a stronger chemical like Easy-Off. If you're using a strong chemical, make sure you wear a mask and gloves and that there is adequate ventilation."
        },
        {
          "headline":"Rinse the vinegar-water solution.",
          "description":"When finished, rinse your sponge and clean the stove with plain water to cut the strong smell of the vinegar. Dry the stovetop with a clean kitchen towel. It may help to open a window for ventilation."
        },
        {
          "headline":"Employ a commercial oven cleaner.",
          "description":"If your stains have been set for months, you may want to try a commercial over cleaner on the stovetop, such as Easy-Off Oven Cleaner or Goo Gone Oven Cleaner. As most stovetops and ovens are made of the same materials, a solution that is cleared for your oven should be no issue on the stove. Follow the cleaner’s directions carefully, ventilating the area if necessary. EXPERT TIP\t\t\tFF\t\t\t\t\tFabricio Ferraz\t\t\tCleaning Consultant & Co-Owner, Hire a Cleaning\t\t\t\tOur Expert Agrees: Easy Off is one of the best products to use on your gas stovetop. Try covering the glass stove first so that nothing leaks and then applying Easy Off, which can remove grease in 30 seconds."
        }
      ]
    },
    {
      "name":"Maintaining a Clean Stovetop",
      "steps":[
        {
          "headline":"Clean your stovetop once a week.",
          "description":"Cleaning your stove once a week will minimize surface grime. The more often you do routine cleanings, the less frequently you will need to do serious deep cleans with a hot towel or commercial cleaning solution. Put a regular cleaning reminder on your calendar so you don’t forget."
        },
        {
          "headline":"Clean food right when it spills or boils over.",
          "description":"Stovetops can be difficult to clean because food that spills or boils over usually gets charred onto the stove by the heat. This sets the stain and makes it more difficult to remove. Make a habit of wiping up any spilled messes right after they occur to keep food from getting fused to the stovetop by the heat."
        },
        {
          "headline":"Spend 10 minutes cleaning at the end of the meal.",
          "description":"When you’re cleaning pots at pans at the end of a meal, run your sponge over the stovetop to clean up the mess created by your cooking too. By implementing this simple 10-minute routine, you can avoid marathon cleaning sessions."
        }
      ]
    }
  ],
  "text":" Doing Routine Cleaning Remove grates and burner caps. Fill your sink with a few drops of dish soap and run some warm water. Then, remove the grates and burner caps from the stove and place them in the water to soak. This will help soften any stuck on food particles. Use mild dish soap such as Dawn or Palmolive. Any soap you would typically use to hand wash dishes will work. Wipe the stove with a dry cloth to remove loose food particles. Use a paper towel or dry dishtowel to wipe up any loose bits of dried food on the stovetop itself. There is no need to scrub at this stage, the goal is simply to clear any food debris from the area you want to clean. Clear the fuel ports and remove any blockages. Examine the fuel ports of all the burners. Sometimes, burnt bits of food can clog the fuel ports, preventing your stove from lighting properly or creating a burning hazard. To clear any food material, use a small object such as a paperclip to pick any burnt food out of the port. If there are lots of food bits blocking the port, you can use a dry toothbrush to gently brush debris away from the port. Scrub the stovetop with dish soap and water. Use the scrubbing side of a wet sponge and a few drops of dish soap to scrub the stovetop. Work in circular motions to remove stubborn spills, wringing and rewetting sponge as it gets dirty. Be careful not to use too much water when cleaning the stovetop, as it can make the fuel ports saturated. Wring your sponge regularly while cleaning. If the fuel ports get too wet, they will temporarily have trouble igniting. When they dry out, this problem will resolve. Rinse the stovetop with water and dry with a clean towel. When you’re finished cleaning the stove with the soap, rinse the sponge completely. Then wipe the stovetop once more with just water to rinse. Dry with a clean dishtowel. Scrub grates and burner caps with soap and water. Use your scrubbing sponge to clean the grates and burner caps that have been soaking in the soapy solution in the sink. The food bits on them should have softened and will come off easily. Rinse them with plain water once you’ve scrubbed off all food bits, drying with a clean dishtowel. Removing Tough Messes Heat a wet towel. If the crust of food on your stove isn’t coming off with soap and water, try a towel “mask.” Wet a dishtowel, wring it, and warm it in the microwave for 30 seconds. If your microwave is particularly powerful, be careful of any hot steam coming off the towel when you open the microwave. Cover stuck-on grime with your warm towel. Use the damp, warm towel to cover any stuck on bits on the stove, leaving the towel in place for 15 minutes. You can repeat this step several times. The warm steam helps loosen stuck on gunk on the stove. When the mess on the stove is loose, scrub as normal with warm water and soap. Use a solution of white vinegar and water. If soap and water alone aren’t cutting the grime on your stove, you can create a mix of 50% white vinegar and 50% water as a homemade cleaning solution. Scrub your stove using the solution with the rough side of a sponge. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndrii Gurskyi\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\t\t\t\t\tAndrii Gurskyi is the owner and founder of Rainbow Cleaning Service, a New York City cleaning company specializing in apartments, homes, and moving cleanup using non-toxic and artificial fragrance free cleaning solutions. Founded in 2010, Andrii and Rainbow Cleaning Service has served over 35,000 customers. Andrii Gurskyi\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\tIf the mess isn't that bad, you can use vinegar, water, and dish soap. If the stovetop is very dirty, try using a stronger chemical like Easy-Off. If you're using a strong chemical, make sure you wear a mask and gloves and that there is adequate ventilation. Rinse the vinegar-water solution. When finished, rinse your sponge and clean the stove with plain water to cut the strong smell of the vinegar. Dry the stovetop with a clean kitchen towel. It may help to open a window for ventilation. Employ a commercial oven cleaner. If your stains have been set for months, you may want to try a commercial over cleaner on the stovetop, such as Easy-Off Oven Cleaner or Goo Gone Oven Cleaner. As most stovetops and ovens are made of the same materials, a solution that is cleared for your oven should be no issue on the stove. Follow the cleaner’s directions carefully, ventilating the area if necessary. EXPERT TIP\t\t\tFF\t\t\t\t\tFabricio Ferraz\t\t\tCleaning Consultant & Co-Owner, Hire a Cleaning\t\t\t\tOur Expert Agrees: Easy Off is one of the best products to use on your gas stovetop. Try covering the glass stove first so that nothing leaks and then applying Easy Off, which can remove grease in 30 seconds. Maintaining a Clean Stovetop Clean your stovetop once a week. Cleaning your stove once a week will minimize surface grime. The more often you do routine cleanings, the less frequently you will need to do serious deep cleans with a hot towel or commercial cleaning solution. Put a regular cleaning reminder on your calendar so you don’t forget. Clean food right when it spills or boils over. Stovetops can be difficult to clean because food that spills or boils over usually gets charred onto the stove by the heat. This sets the stain and makes it more difficult to remove. Make a habit of wiping up any spilled messes right after they occur to keep food from getting fused to the stovetop by the heat. Spend 10 minutes cleaning at the end of the meal. When you’re cleaning pots at pans at the end of a meal, run your sponge over the stovetop to clean up the mess created by your cooking too. By implementing this simple 10-minute routine, you can avoid marathon cleaning sessions.",
  "sentences":[
    " Doing Routine Cleaning Remove grates and burner caps.",
    "Fill your sink with a few drops of dish soap and run some warm water.",
    "Then, remove the grates and burner caps from the stove and place them in the water to soak.",
    "This will help soften any stuck on food particles.",
    "Use mild dish soap such as Dawn or Palmolive.",
    "Any soap you would typically use to hand wash dishes will work.",
    "Wipe the stove with a dry cloth to remove loose food particles.",
    "Use a paper towel or dry dishtowel to wipe up any loose bits of dried food on the stovetop itself.",
    "There is no need to scrub at this stage, the goal is simply to clear any food debris from the area you want to clean.",
    "Clear the fuel ports and remove any blockages.",
    "Examine the fuel ports of all the burners.",
    "Sometimes, burnt bits of food can clog the fuel ports, preventing your stove from lighting properly or creating a burning hazard.",
    "To clear any food material, use a small object such as a paperclip to pick any burnt food out of the port.",
    "If there are lots of food bits blocking the port, you can use a dry toothbrush to gently brush debris away from the port.",
    "Scrub the stovetop with dish soap and water.",
    "Use the scrubbing side of a wet sponge and a few drops of dish soap to scrub the stovetop.",
    "Work in circular motions to remove stubborn spills, wringing and rewetting sponge as it gets dirty.",
    "Be careful not to use too much water when cleaning the stovetop, as it can make the fuel ports saturated.",
    "Wring your sponge regularly while cleaning.",
    "If the fuel ports get too wet, they will temporarily have trouble igniting.",
    "When they dry out, this problem will resolve.",
    "Rinse the stovetop with water and dry with a clean towel.",
    "When you’re finished cleaning the stove with the soap, rinse the sponge completely.",
    "Then wipe the stovetop once more with just water to rinse.",
    "Dry with a clean dishtowel.",
    "Scrub grates and burner caps with soap and water.",
    "Use your scrubbing sponge to clean the grates and burner caps that have been soaking in the soapy solution in the sink.",
    "The food bits on them should have softened and will come off easily.",
    "Rinse them with plain water once you’ve scrubbed off all food bits, drying with a clean dishtowel.",
    "Removing Tough Messes Heat a wet towel.",
    "If the crust of food on your stove isn’t coming off with soap and water, try a towel “mask.” Wet a dishtowel, wring it, and warm it in the microwave for 30 seconds.",
    "If your microwave is particularly powerful, be careful of any hot steam coming off the towel when you open the microwave.",
    "Cover stuck-on grime with your warm towel.",
    "Use the damp, warm towel to cover any stuck on bits on the stove, leaving the towel in place for 15 minutes.",
    "You can repeat this step several times.",
    "The warm steam helps loosen stuck on gunk on the stove.",
    "When the mess on the stove is loose, scrub as normal with warm water and soap.",
    "Use a solution of white vinegar and water.",
    "If soap and water alone aren’t cutting the grime on your stove, you can create a mix of 50% white vinegar and 50% water as a homemade cleaning solution.",
    "Scrub your stove using the solution with the rough side of a sponge.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAndrii Gurskyi\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\t\t\t\t\tAndrii Gurskyi is the owner and founder of Rainbow Cleaning Service, a New York City cleaning company specializing in apartments, homes, and moving cleanup using non-toxic and artificial fragrance free cleaning solutions.",
    "Founded in 2010, Andrii and Rainbow Cleaning Service has served over 35,000 customers.",
    "Andrii Gurskyi\t\t\tCleaning Guru & Owner, Rainbow Cleaning Service\t\t\t\tIf the mess isn't that bad, you can use vinegar, water, and dish soap.",
    "If the stovetop is very dirty, try using a stronger chemical like Easy-Off.",
    "If you're using a strong chemical, make sure you wear a mask and gloves and that there is adequate ventilation.",
    "Rinse the vinegar-water solution.",
    "When finished, rinse your sponge and clean the stove with plain water to cut the strong smell of the vinegar.",
    "Dry the stovetop with a clean kitchen towel.",
    "It may help to open a window for ventilation.",
    "Employ a commercial oven cleaner.",
    "If your stains have been set for months, you may want to try a commercial over cleaner on the stovetop, such as Easy-Off Oven Cleaner or Goo Gone Oven Cleaner.",
    "As most stovetops and ovens are made of the same materials, a solution that is cleared for your oven should be no issue on the stove.",
    "Follow the cleaner’s directions carefully, ventilating the area if necessary.",
    "EXPERT TIP\t\t\tFF\t\t\t\t\tFabricio Ferraz\t\t\tCleaning Consultant & Co-Owner, Hire a Cleaning\t\t\t\tOur Expert Agrees: Easy Off is one of the best products to use on your gas stovetop.",
    "Try covering the glass stove first so that nothing leaks and then applying Easy Off, which can remove grease in 30 seconds.",
    "Maintaining a Clean Stovetop Clean your stovetop once a week.",
    "Cleaning your stove once a week will minimize surface grime.",
    "The more often you do routine cleanings, the less frequently you will need to do serious deep cleans with a hot towel or commercial cleaning solution.",
    "Put a regular cleaning reminder on your calendar so you don’t forget.",
    "Clean food right when it spills or boils over.",
    "Stovetops can be difficult to clean because food that spills or boils over usually gets charred onto the stove by the heat.",
    "This sets the stain and makes it more difficult to remove.",
    "Make a habit of wiping up any spilled messes right after they occur to keep food from getting fused to the stovetop by the heat.",
    "Spend 10 minutes cleaning at the end of the meal.",
    "When you’re cleaning pots at pans at the end of a meal, run your sponge over the stovetop to clean up the mess created by your cooking too.",
    "By implementing this simple 10-minute routine, you can avoid marathon cleaning sessions."
  ],
  "tyn_section":[
    "Dish soap",
    "Water",
    "Sponge",
    "Dishtowel",
    "White vinegar",
    "Commercial oven cleaner"
  ],
  "tyn_model":[
    "water",
    "sponge",
    "dish soap",
    "stove",
    "soap",
    "dishtowel",
    "towel",
    "microwave",
    "vinegar",
    "white vinegar",
    "rainbow cleaning service",
    "easy off",
    "palmolive",
    "paper towel",
    "scrubbing sponge",
    "“mask",
    "” wet",
    "cleaning guru",
    "cleaning service",
    "kitchen towel",
    "oven cleaner",
    "easy-off oven cleaner",
    "goo gone oven cleaner",
    "cleaner",
    "cleaning consultant",
    "cleaning\t\t\t\tour",
    "gas stovetop",
    "stovetop",
    "hot towel",
    "stovetops"
  ],
  "simple_metrics":{
    "r":0.8333333333,
    "p":0.1666666667,
    "f1":0.2777777778,
    "avg_pos":0.0666666667
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.4,
    "f1":0.5714285714
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.2,
    "f1":0.3333333333
  }
}