{
  "title":"How to Clean a Foam Mattress",
  "url":"https://www.wikihow.com/Clean-a-Foam-Mattress",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Vacuuming Your Foam Mattress",
      "steps":[
        {
          "headline":"Take off your bedding.",
          "description":"Start by removing the blankets, duvet, sheets, pillows and mattress cover. Wash your sheets and mattress cover. To keep a clean mattress, you will need to regularly clean all of the layers that go on top, such as the mattress cover. With everything off the mattress, you are ready to vacuum. It is a good idea to clean your mattress cover at the same time as your foam mattress. Look on the label of the mattress cover to determine the washing cycle. Likely, you can put in a normal wash cycle."
        },
        {
          "headline":"Choose the upholstery attachment on your vacuum cleaner.",
          "description":"You will be using the upholstery attachment to clean your mattress. If the attachment is clean, go ahead and attach it to your vacuum cleaner. If it is dirty, you should remove all of the bits of fabric and dust from the upholstery attachment using your fingers. Then, wash it with soapy water. Rinse it and then let it dry for twenty-four hours."
        },
        {
          "headline":"Vacuum the mattress.",
          "description":"Use the upholstery attachment to vacuum your foam mattress. Get rid of any hair, dust or crumbs from late night snacks. Start by vacuuming the top of the mattress. Then, clean the sides of the mattress. Flip the mattress or put it against a wall to clean the bottom."
        }
      ]
    },
    {
      "name":"Cleaning Stains",
      "steps":[
        {
          "headline":"Exercise caution in your use of water and cleaning liquids.",
          "description":"Foam mattresses should not be exposed to excessive water, so you need to take a cautious approach when spot cleaning stains. It is easy to get too aggressive when removing stains from a foam mattress, which can have the unintended effect of either pushing stains deeper into the mattress or getting the mattress too wet. If the mattress gets wet, it could easily get mildew. Never saturate the mattress with water or a cleaning agent. Instead of using a steam cleaner or a wet rag, you should use a spray bottle. You are less likely to get the mattress excessively wet if you mist the mattress with a small amount of water using a spray bottle."
        },
        {
          "headline":"Choose a cleaning agent.",
          "description":"To get stains out of a foam mattress, you will need vinegar, baking soda or an enzymatic commercial cleaner. Another option is to create your own cleaning agent by mixing a few drops of dish soap into 3 tablespoons (24 g) of baking soda and 10 fluid ounces (300 mL) of hydrogen peroxide. Enzymatic cleaners work very well, but vinegar is a trusted option that is also inexpensive. You can use a mix of half white vinegar and half water in a spray bottle. You can sprinkle baking soda directly on the stain. Follow the directions on the bottle of enzymatic cleaner."
        },
        {
          "headline":"Spray the stain.",
          "description":"After spraying a moderate amount of cleaning agent on the stain, let it sit for five minutes."
        },
        {
          "headline":"Remove as much of the stain as possible.",
          "description":"After the cleaning agent has had a chance to break down the stain, use a clean rag to remove it. Use a dabbing, up and down motion, as opposed to a circular rubbing motion. If you rub the cleaning agent around too much, you could end up spreading the stain."
        },
        {
          "headline":"Sprinkle baking soda on the stain.",
          "description":"Let the baking soda sit on the stain overnight. In the morning, vacuum up the baking soda. This process should help remove any odors associated with the stain."
        },
        {
          "headline":"Dry out the mattress.",
          "description":"Since foam mattresses do not do well when they are wet, you need to get your mattress dry as soon as possible. If you have access to an outdoor area and it is good weather, you could let the mattress dry out in the sun. If the weather is not amenable, you could set up a fan in your room to let the mattress dry out."
        }
      ]
    },
    {
      "name":"Cleaning up Spills",
      "steps":[
        {
          "headline":"Dry out the mattress.",
          "description":"You should take steps to dry out your mattress right away. If it is a sunny day and it isn’t too hard to take the mattress out to the porch or backyard, you could let it dry out in the sun. Once the spill is dried up, you can address any stains with appropriate cleaning agents, such as baking soda."
        },
        {
          "headline":"Dab the stain to remove liquid.",
          "description":"If you get a foam mattress wet, you should use a clean rag or an absorbent towel to dab the stain. Press down on the wet area with the clean rag or towel. Adjust the rag or towel so that you have a dry part to use and then repeat the dabbing motion. You should avoid scrubbing the stain with a circular or aggressive motion, since this approach could cause the stain to set. You may need to use many rags or towels, depending on the size of the stain."
        },
        {
          "headline":"Set up a fan.",
          "description":"Station a fan in front of the foam mattress. Put the fan on high and direct it towards the part of the mattress where the spill occurred."
        },
        {
          "headline":"Let the foam mattress dry out.",
          "description":"After removing as much of the stain as possible, you should leave the mattress to dry out for a few hours. Avoid putting any bedding on the mattress until it is completely dry. If there is a window in the room, you could open it up to improve air circulation and speed up the drying time."
        }
      ]
    },
    {
      "name":"Deodorizing Your Foam Mattress",
      "steps":[
        {
          "headline":"Sprinkle baking soda on the mattress.",
          "description":"Spread a thin layer of baking soda over the entire surface of the foam mattress. Leave the baking soda on the mattress overnight or during the day while you are at work. Then, vacuum up the baking soda."
        },
        {
          "headline":"Mist the foam mattress with a citrus based cleaner.",
          "description":"You can use a lemon or other citrus based cleaner to remove odors from a foam mattress. Spray a light layer of citrus cleaner. Then, let it dry completely. You can make your own citrus based cleaner. Put some orange or lemon peels in an airtight container. Fill the container with white vinegar and let it sit for two weeks. Then, strain out the orange peels. Put the liquid in a spray bottle and clean."
        },
        {
          "headline":"Give it some fresh air.",
          "description":"Put your mattress out on the front porch or backyard for an hour or two. The breeze and sun will help eliminate bacteria and deodorize the mattress. Airing out your mattress may be easiest in a rural or suburban location. Remember to bring it back inside and keep an eye on the weather, since you don’t want to get your foam mattress wet. If you live in a city with a lot of air pollution or traffic, you may want to skip this step."
        },
        {
          "headline":"Put on the mattress cover.",
          "description":"Once you have vacuumed, cleaned and deodorized your foam mattress, you can go ahead and put on the clean mattress cover. The mattress cover will help keep your foam mattress nice and clean. If you tend to drink a lot of coffee or wine in bed or own a pet, you may want to use a waterproof mattress cover. A waterproof cover will help you avoid the disaster of a soaking foam mattress."
        }
      ]
    }
  ],
  "text":" Vacuuming Your Foam Mattress Take off your bedding. Start by removing the blankets, duvet, sheets, pillows and mattress cover. Wash your sheets and mattress cover. To keep a clean mattress, you will need to regularly clean all of the layers that go on top, such as the mattress cover. With everything off the mattress, you are ready to vacuum. It is a good idea to clean your mattress cover at the same time as your foam mattress. Look on the label of the mattress cover to determine the washing cycle. Likely, you can put in a normal wash cycle. Choose the upholstery attachment on your vacuum cleaner. You will be using the upholstery attachment to clean your mattress. If the attachment is clean, go ahead and attach it to your vacuum cleaner. If it is dirty, you should remove all of the bits of fabric and dust from the upholstery attachment using your fingers. Then, wash it with soapy water. Rinse it and then let it dry for twenty-four hours. Vacuum the mattress. Use the upholstery attachment to vacuum your foam mattress. Get rid of any hair, dust or crumbs from late night snacks. Start by vacuuming the top of the mattress. Then, clean the sides of the mattress. Flip the mattress or put it against a wall to clean the bottom. Cleaning Stains Exercise caution in your use of water and cleaning liquids. Foam mattresses should not be exposed to excessive water, so you need to take a cautious approach when spot cleaning stains. It is easy to get too aggressive when removing stains from a foam mattress, which can have the unintended effect of either pushing stains deeper into the mattress or getting the mattress too wet. If the mattress gets wet, it could easily get mildew. Never saturate the mattress with water or a cleaning agent. Instead of using a steam cleaner or a wet rag, you should use a spray bottle. You are less likely to get the mattress excessively wet if you mist the mattress with a small amount of water using a spray bottle. Choose a cleaning agent. To get stains out of a foam mattress, you will need vinegar, baking soda or an enzymatic commercial cleaner. Another option is to create your own cleaning agent by mixing a few drops of dish soap into 3 tablespoons (24 g) of baking soda and 10 fluid ounces (300 mL) of hydrogen peroxide. Enzymatic cleaners work very well, but vinegar is a trusted option that is also inexpensive. You can use a mix of half white vinegar and half water in a spray bottle. You can sprinkle baking soda directly on the stain. Follow the directions on the bottle of enzymatic cleaner. Spray the stain. After spraying a moderate amount of cleaning agent on the stain, let it sit for five minutes. Remove as much of the stain as possible. After the cleaning agent has had a chance to break down the stain, use a clean rag to remove it. Use a dabbing, up and down motion, as opposed to a circular rubbing motion. If you rub the cleaning agent around too much, you could end up spreading the stain. Sprinkle baking soda on the stain. Let the baking soda sit on the stain overnight. In the morning, vacuum up the baking soda. This process should help remove any odors associated with the stain. Dry out the mattress. Since foam mattresses do not do well when they are wet, you need to get your mattress dry as soon as possible. If you have access to an outdoor area and it is good weather, you could let the mattress dry out in the sun. If the weather is not amenable, you could set up a fan in your room to let the mattress dry out. Cleaning up Spills Dry out the mattress. You should take steps to dry out your mattress right away. If it is a sunny day and it isn’t too hard to take the mattress out to the porch or backyard, you could let it dry out in the sun. Once the spill is dried up, you can address any stains with appropriate cleaning agents, such as baking soda. Dab the stain to remove liquid. If you get a foam mattress wet, you should use a clean rag or an absorbent towel to dab the stain. Press down on the wet area with the clean rag or towel. Adjust the rag or towel so that you have a dry part to use and then repeat the dabbing motion. You should avoid scrubbing the stain with a circular or aggressive motion, since this approach could cause the stain to set. You may need to use many rags or towels, depending on the size of the stain. Set up a fan. Station a fan in front of the foam mattress. Put the fan on high and direct it towards the part of the mattress where the spill occurred. Let the foam mattress dry out. After removing as much of the stain as possible, you should leave the mattress to dry out for a few hours. Avoid putting any bedding on the mattress until it is completely dry. If there is a window in the room, you could open it up to improve air circulation and speed up the drying time. Deodorizing Your Foam Mattress Sprinkle baking soda on the mattress. Spread a thin layer of baking soda over the entire surface of the foam mattress. Leave the baking soda on the mattress overnight or during the day while you are at work. Then, vacuum up the baking soda. Mist the foam mattress with a citrus based cleaner. You can use a lemon or other citrus based cleaner to remove odors from a foam mattress. Spray a light layer of citrus cleaner. Then, let it dry completely. You can make your own citrus based cleaner. Put some orange or lemon peels in an airtight container. Fill the container with white vinegar and let it sit for two weeks. Then, strain out the orange peels. Put the liquid in a spray bottle and clean. Give it some fresh air. Put your mattress out on the front porch or backyard for an hour or two. The breeze and sun will help eliminate bacteria and deodorize the mattress. Airing out your mattress may be easiest in a rural or suburban location. Remember to bring it back inside and keep an eye on the weather, since you don’t want to get your foam mattress wet. If you live in a city with a lot of air pollution or traffic, you may want to skip this step. Put on the mattress cover. Once you have vacuumed, cleaned and deodorized your foam mattress, you can go ahead and put on the clean mattress cover. The mattress cover will help keep your foam mattress nice and clean. If you tend to drink a lot of coffee or wine in bed or own a pet, you may want to use a waterproof mattress cover. A waterproof cover will help you avoid the disaster of a soaking foam mattress.",
  "sentences":[
    " Vacuuming Your Foam Mattress Take off your bedding.",
    "Start by removing the blankets, duvet, sheets, pillows and mattress cover.",
    "Wash your sheets and mattress cover.",
    "To keep a clean mattress, you will need to regularly clean all of the layers that go on top, such as the mattress cover.",
    "With everything off the mattress, you are ready to vacuum.",
    "It is a good idea to clean your mattress cover at the same time as your foam mattress.",
    "Look on the label of the mattress cover to determine the washing cycle.",
    "Likely, you can put in a normal wash cycle.",
    "Choose the upholstery attachment on your vacuum cleaner.",
    "You will be using the upholstery attachment to clean your mattress.",
    "If the attachment is clean, go ahead and attach it to your vacuum cleaner.",
    "If it is dirty, you should remove all of the bits of fabric and dust from the upholstery attachment using your fingers.",
    "Then, wash it with soapy water.",
    "Rinse it and then let it dry for twenty-four hours.",
    "Vacuum the mattress.",
    "Use the upholstery attachment to vacuum your foam mattress.",
    "Get rid of any hair, dust or crumbs from late night snacks.",
    "Start by vacuuming the top of the mattress.",
    "Then, clean the sides of the mattress.",
    "Flip the mattress or put it against a wall to clean the bottom.",
    "Cleaning Stains Exercise caution in your use of water and cleaning liquids.",
    "Foam mattresses should not be exposed to excessive water, so you need to take a cautious approach when spot cleaning stains.",
    "It is easy to get too aggressive when removing stains from a foam mattress, which can have the unintended effect of either pushing stains deeper into the mattress or getting the mattress too wet.",
    "If the mattress gets wet, it could easily get mildew.",
    "Never saturate the mattress with water or a cleaning agent.",
    "Instead of using a steam cleaner or a wet rag, you should use a spray bottle.",
    "You are less likely to get the mattress excessively wet if you mist the mattress with a small amount of water using a spray bottle.",
    "Choose a cleaning agent.",
    "To get stains out of a foam mattress, you will need vinegar, baking soda or an enzymatic commercial cleaner.",
    "Another option is to create your own cleaning agent by mixing a few drops of dish soap into 3 tablespoons (24 g) of baking soda and 10 fluid ounces (300 mL) of hydrogen peroxide.",
    "Enzymatic cleaners work very well, but vinegar is a trusted option that is also inexpensive.",
    "You can use a mix of half white vinegar and half water in a spray bottle.",
    "You can sprinkle baking soda directly on the stain.",
    "Follow the directions on the bottle of enzymatic cleaner.",
    "Spray the stain.",
    "After spraying a moderate amount of cleaning agent on the stain, let it sit for five minutes.",
    "Remove as much of the stain as possible.",
    "After the cleaning agent has had a chance to break down the stain, use a clean rag to remove it.",
    "Use a dabbing, up and down motion, as opposed to a circular rubbing motion.",
    "If you rub the cleaning agent around too much, you could end up spreading the stain.",
    "Sprinkle baking soda on the stain.",
    "Let the baking soda sit on the stain overnight.",
    "In the morning, vacuum up the baking soda.",
    "This process should help remove any odors associated with the stain.",
    "Dry out the mattress.",
    "Since foam mattresses do not do well when they are wet, you need to get your mattress dry as soon as possible.",
    "If you have access to an outdoor area and it is good weather, you could let the mattress dry out in the sun.",
    "If the weather is not amenable, you could set up a fan in your room to let the mattress dry out.",
    "Cleaning up Spills Dry out the mattress.",
    "You should take steps to dry out your mattress right away.",
    "If it is a sunny day and it isn’t too hard to take the mattress out to the porch or backyard, you could let it dry out in the sun.",
    "Once the spill is dried up, you can address any stains with appropriate cleaning agents, such as baking soda.",
    "Dab the stain to remove liquid.",
    "If you get a foam mattress wet, you should use a clean rag or an absorbent towel to dab the stain.",
    "Press down on the wet area with the clean rag or towel.",
    "Adjust the rag or towel so that you have a dry part to use and then repeat the dabbing motion.",
    "You should avoid scrubbing the stain with a circular or aggressive motion, since this approach could cause the stain to set.",
    "You may need to use many rags or towels, depending on the size of the stain.",
    "Set up a fan.",
    "Station a fan in front of the foam mattress.",
    "Put the fan on high and direct it towards the part of the mattress where the spill occurred.",
    "Let the foam mattress dry out.",
    "After removing as much of the stain as possible, you should leave the mattress to dry out for a few hours.",
    "Avoid putting any bedding on the mattress until it is completely dry.",
    "If there is a window in the room, you could open it up to improve air circulation and speed up the drying time.",
    "Deodorizing Your Foam Mattress Sprinkle baking soda on the mattress.",
    "Spread a thin layer of baking soda over the entire surface of the foam mattress.",
    "Leave the baking soda on the mattress overnight or during the day while you are at work.",
    "Then, vacuum up the baking soda.",
    "Mist the foam mattress with a citrus based cleaner.",
    "You can use a lemon or other citrus based cleaner to remove odors from a foam mattress.",
    "Spray a light layer of citrus cleaner.",
    "Then, let it dry completely.",
    "You can make your own citrus based cleaner.",
    "Put some orange or lemon peels in an airtight container.",
    "Fill the container with white vinegar and let it sit for two weeks.",
    "Then, strain out the orange peels.",
    "Put the liquid in a spray bottle and clean.",
    "Give it some fresh air.",
    "Put your mattress out on the front porch or backyard for an hour or two.",
    "The breeze and sun will help eliminate bacteria and deodorize the mattress.",
    "Airing out your mattress may be easiest in a rural or suburban location.",
    "Remember to bring it back inside and keep an eye on the weather, since you don’t want to get your foam mattress wet.",
    "If you live in a city with a lot of air pollution or traffic, you may want to skip this step.",
    "Put on the mattress cover.",
    "Once you have vacuumed, cleaned and deodorized your foam mattress, you can go ahead and put on the clean mattress cover.",
    "The mattress cover will help keep your foam mattress nice and clean.",
    "If you tend to drink a lot of coffee or wine in bed or own a pet, you may want to use a waterproof mattress cover.",
    "A waterproof cover will help you avoid the disaster of a soaking foam mattress."
  ],
  "tyn_section":[
    "Spray bottle",
    "Vinegar",
    "Baking Soda",
    "Enzymatic cleaner",
    "Citrus based cleaner",
    "Vacuum cleaner",
    "Upholstery attachment for the vacuum cleaner",
    "Clean rags or absorbent towels"
  ],
  "tyn_model":[
    "baking soda",
    "water",
    "cleaning agent",
    "spray bottle",
    "mattress cover",
    "upholstery attachment",
    "fan",
    "vacuum",
    "vacuum cleaner",
    "vinegar",
    "white vinegar",
    "rag",
    "towel",
    "citrus based cleaner",
    "steam cleaner",
    "wet rag",
    "enzymatic commercial cleaner",
    "dish soap",
    "hydrogen peroxide",
    "enzymatic cleaner",
    "absorbent towel",
    "rags",
    "towels",
    "citrus cleaner",
    "airtight container",
    "waterproof cover"
  ],
  "simple_metrics":{
    "r":0.75,
    "p":0.2307692308,
    "f1":0.3529411765,
    "avg_pos":0.1153846154
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.3846153846,
    "f1":0.5084745763
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.4615384615,
    "f1":0.6043165468
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.3076923077,
    "f1":0.4363636364
  }
}