{
  "title":"How to Make an Easter Bunny Wreath",
  "url":"https://www.wikihow.com/Make-an-Easter-Bunny-Wreath",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects",
    "Wreath Projects"
  ],
  "methods":[
    {
      "name":"Using Grapevine Wreaths",
      "steps":[
        {
          "headline":"Start with four different wreathes.",
          "description":"You can purchase wicker wreaths at any department store. You will need four different wreaths in three different sizes. Purchase the following wicker wreaths:\nTwo six-inch wreaths\nOne eight-inch wreath\nOne ten-inch wreath"
        },
        {
          "headline":"Squeeze the six-inch wreaths into ears.",
          "description":"Take the two six-inch wreathes. Use your hands to squeeze them into diamond shapes. These will be your bunny ears on the wreaths. Wicker wreaths are not very strong, so you should be able to push them into the right shapes using your hands. Wicker wreaths do have pointy parts. It's a good idea to wear thick gloves while shaping your ears."
        },
        {
          "headline":"Tie the two larger wreathes together.",
          "description":"Use floral wire to tie the eight-inch wreath and ten-inch wreath together. This will be the body of your bunny. Wrap the wire around both wreathes several times. Make sure the wreaths are securely together before proceeding."
        },
        {
          "headline":"Secure the ears with floral wire.",
          "description":"Use floral wire to tie your bunny ears on top of the eight-inch wreath. This is your bunny's head. Make several loops using the floral wire so your wreath is completely secure. How close together or far apart you want your ears is a matter of personal preference."
        },
        {
          "headline":"Glue silk flowers onto the wreath.",
          "description":"Take your silk flowers. You want flowers with longer stems and smaller flowers. As this is an Easter wreath, pastel colors work best. Place your flowers over all four wicker wreathes and hot glue them onto the wreaths. This will give your bunny shape a pleasant spring-like appearance. You can use as many flowers as you want. How flowery your wreath is comes down to personal preference."
        },
        {
          "headline":"Finish with a bow.",
          "description":"Take a piece of ribbon and tie it into a bow. Hot glue the ribbon onto your wreath between the eight-inch and ten-inch wreath. This makes it look like your bunny is wearing a bow tie. You can use any color ribbon you want, but pastels match well with the season."
        }
      ]
    },
    {
      "name":"Making a Fuzzy-Eared Wreath",
      "steps":[
        {
          "headline":"Shape your wire hanger into a circle.",
          "description":"You need one wire hanger to make a bunny wreath. Use your hands to bend the hanger into a circular shape. Leave the hanger part of the wire untouched. Later, you will use this to hang up your wreath. Strive to get as round of a circle as possible. However, you will be covering your wreath in plastic bags. Parts that are slightly bent or crooked will not be noticeable as long as you have a roughly circular shape."
        },
        {
          "headline":"Make a circular loop with a plastic bag.",
          "description":"Take a plastic sandwich bag without a Ziploc top. Poke your fingers through the bottom of the bag. Then, pull apart the bottom and stretch out the bag until you have a circle-shaped loop of plastic."
        },
        {
          "headline":"Tie your plastic bag around your hanger.",
          "description":"Take the circular loop you made. Flatten it together into a single line. Then, tie it around the wreath using one knot. When you're done, there should be two looped semi-circles of plastic bag sticking out from either side of the knot."
        },
        {
          "headline":"Repeat this process across the hanger.",
          "description":"Make loops with more paper bags. Then, tie them to the hanger like you did with the first loop. Use as many plastic bags as necessary to cover the entire circle with looped knots. Push the loops together as you go so you have a very thick ring of plastic."
        },
        {
          "headline":"Cut the loops with your scissors.",
          "description":"Use a pair of scissors to cut open each loop surrounding your wreath. When you're done, the paper bags will create a fuzzy effect that resembles bunny fur. You should be left with a fuzzy, white circle."
        },
        {
          "headline":"Add the bunny ears.",
          "description":"Use fuzzy bunny ears on a headband, which you can buy in most department stores and craft shops around easter. Cut off each ear with a pair of scissors. Then, hot glue them to the top of your circle. Place them on either side of the hanger coming out of the top of your wreath. You can glue the ears as close together or as far apart as you want. It comes down to personal preference."
        },
        {
          "headline":"Make a nose with a plastic egg and pipe cleaner.",
          "description":"Take a plastic egg. Hot glue it on the bottom of the wreath, at roughly the opposite side of the hanger. Then, hot glue three pipe cleaners on each side of the egg. This will create what looks like a nose and whiskers. You can choose any color of egg and pipe cleaners you want. Pastel colors work great for easter."
        }
      ]
    },
    {
      "name":"Using Hangers as Bunny Ears",
      "steps":[
        {
          "headline":"Cut your fabric into three-inch wide strips.",
          "description":"Use two different colors of fabric. Pastels work best for a spring wreath. You can choose solid colors or opt for patterns like polka dots. Cut your fabric into long three-inch wide strips. The precise size depends on the size of your wreathes. Bigger wreaths will require more fabric."
        },
        {
          "headline":"Wrap fabric around your wreath.",
          "description":"Take two sawdust wreathes of the same size. Pin one end of your fabric strip onto one of your sawdust wreathes. Wrap the fabric as snuggly as possible around the wreath, moving across the wreath until you reach the end of your strip. When the ends of your strips are connecting, place one end on top of the other. Secure the strips with a pin. You may need to use more than one strip if necessary. Overlap slightly as you wrap your fabric. This will prevent any sawdust from peaking through."
        },
        {
          "headline":"Wrap the other wreath in fabric.",
          "description":"Use your other color to wrap the second wreath in the same fashion. Remember to wrap the fabric snuggly and overlap it slightly with each loop. You do not want any sawdust to peak through."
        },
        {
          "headline":"Cut your hangers in half.",
          "description":"Take two hangers. Cut each hanger into two equal halves using a pair of wire cutters. Remove the loop on top of the hanger when you cut them in half. Discard the loop, as you do not need it for the project."
        },
        {
          "headline":"Make tips on the ends of your hangers.",
          "description":"Use a pair of scissors to cut the ends of each hanger into pointed tips. This will make them easier to insert in your wreathes."
        },
        {
          "headline":"Make holes for each ear.",
          "description":"Using a pair of scissors, make four holes on one of your wreathes. You are making two holes for each ear, where you will insert your hangers. Leave about three inches between each ear. Each set of two holes should be about two and a half inches apart."
        },
        {
          "headline":"Insert your bunny ears.",
          "description":"Take your hangers. One at a time, fit them into both sets of two holes. You should be left with one wreath with two triangular bunny ears sticking out."
        },
        {
          "headline":"Wrap the ears in fabric.",
          "description":"Take your leftover fabric strips. Glue one end of the strip to hanger, near where it attaches to the wreathe. Wrap the strip around the entire hanger, overlapping slightly to cover any bare spots. When the whole ear is wrapped, glue the other end of the fabric strip down as well. Repeat with the other hanger. When you're done, you should have your bunny's head done. You should have one wreath with two colorful bunny ears."
        },
        {
          "headline":"Attach your two wreaths with a bow.",
          "description":"Use a ribbon to tie your two wreathes together. Tie the wreathes together tightly so your bunny wreath does not fall apart. Tie the ribbon into the bow for an attractive finish. You can use any color you want, but pastels may work best for spring."
        }
      ]
    }
  ],
  "text":" Using Grapevine Wreaths Start with four different wreathes. You can purchase wicker wreaths at any department store. You will need four different wreaths in three different sizes. Purchase the following wicker wreaths:\nTwo six-inch wreaths\nOne eight-inch wreath\nOne ten-inch wreath Squeeze the six-inch wreaths into ears. Take the two six-inch wreathes. Use your hands to squeeze them into diamond shapes. These will be your bunny ears on the wreaths. Wicker wreaths are not very strong, so you should be able to push them into the right shapes using your hands. Wicker wreaths do have pointy parts. It's a good idea to wear thick gloves while shaping your ears. Tie the two larger wreathes together. Use floral wire to tie the eight-inch wreath and ten-inch wreath together. This will be the body of your bunny. Wrap the wire around both wreathes several times. Make sure the wreaths are securely together before proceeding. Secure the ears with floral wire. Use floral wire to tie your bunny ears on top of the eight-inch wreath. This is your bunny's head. Make several loops using the floral wire so your wreath is completely secure. How close together or far apart you want your ears is a matter of personal preference. Glue silk flowers onto the wreath. Take your silk flowers. You want flowers with longer stems and smaller flowers. As this is an Easter wreath, pastel colors work best. Place your flowers over all four wicker wreathes and hot glue them onto the wreaths. This will give your bunny shape a pleasant spring-like appearance. You can use as many flowers as you want. How flowery your wreath is comes down to personal preference. Finish with a bow. Take a piece of ribbon and tie it into a bow. Hot glue the ribbon onto your wreath between the eight-inch and ten-inch wreath. This makes it look like your bunny is wearing a bow tie. You can use any color ribbon you want, but pastels match well with the season. Making a Fuzzy-Eared Wreath Shape your wire hanger into a circle. You need one wire hanger to make a bunny wreath. Use your hands to bend the hanger into a circular shape. Leave the hanger part of the wire untouched. Later, you will use this to hang up your wreath. Strive to get as round of a circle as possible. However, you will be covering your wreath in plastic bags. Parts that are slightly bent or crooked will not be noticeable as long as you have a roughly circular shape. Make a circular loop with a plastic bag. Take a plastic sandwich bag without a Ziploc top. Poke your fingers through the bottom of the bag. Then, pull apart the bottom and stretch out the bag until you have a circle-shaped loop of plastic. Tie your plastic bag around your hanger. Take the circular loop you made. Flatten it together into a single line. Then, tie it around the wreath using one knot. When you're done, there should be two looped semi-circles of plastic bag sticking out from either side of the knot. Repeat this process across the hanger. Make loops with more paper bags. Then, tie them to the hanger like you did with the first loop. Use as many plastic bags as necessary to cover the entire circle with looped knots. Push the loops together as you go so you have a very thick ring of plastic. Cut the loops with your scissors. Use a pair of scissors to cut open each loop surrounding your wreath. When you're done, the paper bags will create a fuzzy effect that resembles bunny fur. You should be left with a fuzzy, white circle. Add the bunny ears. Use fuzzy bunny ears on a headband, which you can buy in most department stores and craft shops around easter. Cut off each ear with a pair of scissors. Then, hot glue them to the top of your circle. Place them on either side of the hanger coming out of the top of your wreath. You can glue the ears as close together or as far apart as you want. It comes down to personal preference. Make a nose with a plastic egg and pipe cleaner. Take a plastic egg. Hot glue it on the bottom of the wreath, at roughly the opposite side of the hanger. Then, hot glue three pipe cleaners on each side of the egg. This will create what looks like a nose and whiskers. You can choose any color of egg and pipe cleaners you want. Pastel colors work great for easter. Using Hangers as Bunny Ears Cut your fabric into three-inch wide strips. Use two different colors of fabric. Pastels work best for a spring wreath. You can choose solid colors or opt for patterns like polka dots. Cut your fabric into long three-inch wide strips. The precise size depends on the size of your wreathes. Bigger wreaths will require more fabric. Wrap fabric around your wreath. Take two sawdust wreathes of the same size. Pin one end of your fabric strip onto one of your sawdust wreathes. Wrap the fabric as snuggly as possible around the wreath, moving across the wreath until you reach the end of your strip. When the ends of your strips are connecting, place one end on top of the other. Secure the strips with a pin. You may need to use more than one strip if necessary. Overlap slightly as you wrap your fabric. This will prevent any sawdust from peaking through. Wrap the other wreath in fabric. Use your other color to wrap the second wreath in the same fashion. Remember to wrap the fabric snuggly and overlap it slightly with each loop. You do not want any sawdust to peak through. Cut your hangers in half. Take two hangers. Cut each hanger into two equal halves using a pair of wire cutters. Remove the loop on top of the hanger when you cut them in half. Discard the loop, as you do not need it for the project. Make tips on the ends of your hangers. Use a pair of scissors to cut the ends of each hanger into pointed tips. This will make them easier to insert in your wreathes. Make holes for each ear. Using a pair of scissors, make four holes on one of your wreathes. You are making two holes for each ear, where you will insert your hangers. Leave about three inches between each ear. Each set of two holes should be about two and a half inches apart. Insert your bunny ears. Take your hangers. One at a time, fit them into both sets of two holes. You should be left with one wreath with two triangular bunny ears sticking out. Wrap the ears in fabric. Take your leftover fabric strips. Glue one end of the strip to hanger, near where it attaches to the wreathe. Wrap the strip around the entire hanger, overlapping slightly to cover any bare spots. When the whole ear is wrapped, glue the other end of the fabric strip down as well. Repeat with the other hanger. When you're done, you should have your bunny's head done. You should have one wreath with two colorful bunny ears. Attach your two wreaths with a bow. Use a ribbon to tie your two wreathes together. Tie the wreathes together tightly so your bunny wreath does not fall apart. Tie the ribbon into the bow for an attractive finish. You can use any color you want, but pastels may work best for spring.",
  "sentences":[
    " Using Grapevine Wreaths Start with four different wreathes.",
    "You can purchase wicker wreaths at any department store.",
    "You will need four different wreaths in three different sizes.",
    "Purchase the following wicker wreaths:\nTwo six-inch wreaths\nOne eight-inch wreath\nOne ten-inch wreath Squeeze the six-inch wreaths into ears.",
    "Take the two six-inch wreathes.",
    "Use your hands to squeeze them into diamond shapes.",
    "These will be your bunny ears on the wreaths.",
    "Wicker wreaths are not very strong, so you should be able to push them into the right shapes using your hands.",
    "Wicker wreaths do have pointy parts.",
    "It's a good idea to wear thick gloves while shaping your ears.",
    "Tie the two larger wreathes together.",
    "Use floral wire to tie the eight-inch wreath and ten-inch wreath together.",
    "This will be the body of your bunny.",
    "Wrap the wire around both wreathes several times.",
    "Make sure the wreaths are securely together before proceeding.",
    "Secure the ears with floral wire.",
    "Use floral wire to tie your bunny ears on top of the eight-inch wreath.",
    "This is your bunny's head.",
    "Make several loops using the floral wire so your wreath is completely secure.",
    "How close together or far apart you want your ears is a matter of personal preference.",
    "Glue silk flowers onto the wreath.",
    "Take your silk flowers.",
    "You want flowers with longer stems and smaller flowers.",
    "As this is an Easter wreath, pastel colors work best.",
    "Place your flowers over all four wicker wreathes and hot glue them onto the wreaths.",
    "This will give your bunny shape a pleasant spring-like appearance.",
    "You can use as many flowers as you want.",
    "How flowery your wreath is comes down to personal preference.",
    "Finish with a bow.",
    "Take a piece of ribbon and tie it into a bow.",
    "Hot glue the ribbon onto your wreath between the eight-inch and ten-inch wreath.",
    "This makes it look like your bunny is wearing a bow tie.",
    "You can use any color ribbon you want, but pastels match well with the season.",
    "Making a Fuzzy-Eared Wreath Shape your wire hanger into a circle.",
    "You need one wire hanger to make a bunny wreath.",
    "Use your hands to bend the hanger into a circular shape.",
    "Leave the hanger part of the wire untouched.",
    "Later, you will use this to hang up your wreath.",
    "Strive to get as round of a circle as possible.",
    "However, you will be covering your wreath in plastic bags.",
    "Parts that are slightly bent or crooked will not be noticeable as long as you have a roughly circular shape.",
    "Make a circular loop with a plastic bag.",
    "Take a plastic sandwich bag without a Ziploc top.",
    "Poke your fingers through the bottom of the bag.",
    "Then, pull apart the bottom and stretch out the bag until you have a circle-shaped loop of plastic.",
    "Tie your plastic bag around your hanger.",
    "Take the circular loop you made.",
    "Flatten it together into a single line.",
    "Then, tie it around the wreath using one knot.",
    "When you're done, there should be two looped semi-circles of plastic bag sticking out from either side of the knot.",
    "Repeat this process across the hanger.",
    "Make loops with more paper bags.",
    "Then, tie them to the hanger like you did with the first loop.",
    "Use as many plastic bags as necessary to cover the entire circle with looped knots.",
    "Push the loops together as you go so you have a very thick ring of plastic.",
    "Cut the loops with your scissors.",
    "Use a pair of scissors to cut open each loop surrounding your wreath.",
    "When you're done, the paper bags will create a fuzzy effect that resembles bunny fur.",
    "You should be left with a fuzzy, white circle.",
    "Add the bunny ears.",
    "Use fuzzy bunny ears on a headband, which you can buy in most department stores and craft shops around easter.",
    "Cut off each ear with a pair of scissors.",
    "Then, hot glue them to the top of your circle.",
    "Place them on either side of the hanger coming out of the top of your wreath.",
    "You can glue the ears as close together or as far apart as you want.",
    "It comes down to personal preference.",
    "Make a nose with a plastic egg and pipe cleaner.",
    "Take a plastic egg.",
    "Hot glue it on the bottom of the wreath, at roughly the opposite side of the hanger.",
    "Then, hot glue three pipe cleaners on each side of the egg.",
    "This will create what looks like a nose and whiskers.",
    "You can choose any color of egg and pipe cleaners you want.",
    "Pastel colors work great for easter.",
    "Using Hangers as Bunny Ears Cut your fabric into three-inch wide strips.",
    "Use two different colors of fabric.",
    "Pastels work best for a spring wreath.",
    "You can choose solid colors or opt for patterns like polka dots.",
    "Cut your fabric into long three-inch wide strips.",
    "The precise size depends on the size of your wreathes.",
    "Bigger wreaths will require more fabric.",
    "Wrap fabric around your wreath.",
    "Take two sawdust wreathes of the same size.",
    "Pin one end of your fabric strip onto one of your sawdust wreathes.",
    "Wrap the fabric as snuggly as possible around the wreath, moving across the wreath until you reach the end of your strip.",
    "When the ends of your strips are connecting, place one end on top of the other.",
    "Secure the strips with a pin.",
    "You may need to use more than one strip if necessary.",
    "Overlap slightly as you wrap your fabric.",
    "This will prevent any sawdust from peaking through.",
    "Wrap the other wreath in fabric.",
    "Use your other color to wrap the second wreath in the same fashion.",
    "Remember to wrap the fabric snuggly and overlap it slightly with each loop.",
    "You do not want any sawdust to peak through.",
    "Cut your hangers in half.",
    "Take two hangers.",
    "Cut each hanger into two equal halves using a pair of wire cutters.",
    "Remove the loop on top of the hanger when you cut them in half.",
    "Discard the loop, as you do not need it for the project.",
    "Make tips on the ends of your hangers.",
    "Use a pair of scissors to cut the ends of each hanger into pointed tips.",
    "This will make them easier to insert in your wreathes.",
    "Make holes for each ear.",
    "Using a pair of scissors, make four holes on one of your wreathes.",
    "You are making two holes for each ear, where you will insert your hangers.",
    "Leave about three inches between each ear.",
    "Each set of two holes should be about two and a half inches apart.",
    "Insert your bunny ears.",
    "Take your hangers.",
    "One at a time, fit them into both sets of two holes.",
    "You should be left with one wreath with two triangular bunny ears sticking out.",
    "Wrap the ears in fabric.",
    "Take your leftover fabric strips.",
    "Glue one end of the strip to hanger, near where it attaches to the wreathe.",
    "Wrap the strip around the entire hanger, overlapping slightly to cover any bare spots.",
    "When the whole ear is wrapped, glue the other end of the fabric strip down as well.",
    "Repeat with the other hanger.",
    "When you're done, you should have your bunny's head done.",
    "You should have one wreath with two colorful bunny ears.",
    "Attach your two wreaths with a bow.",
    "Use a ribbon to tie your two wreathes together.",
    "Tie the wreathes together tightly so your bunny wreath does not fall apart.",
    "Tie the ribbon into the bow for an attractive finish.",
    "You can use any color you want, but pastels may work best for spring."
  ],
  "tyn_section":[
    "Scissors",
    "Pipe cleaners",
    "Plastic eggs",
    "Wire hanger",
    "Plastic bag without a Ziploc top",
    "Bunny ears headband",
    "Wicker wreathes",
    "Floral wire",
    "Silk flowers",
    "Ribbon",
    "Hot glue",
    "Sawdust wreathes",
    "Wire cutters",
    "Fabric",
    "Plastic hangers"
  ],
  "tyn_model":[
    "fabric",
    "hot glue",
    "ribbon",
    "scissors",
    "floral wire",
    "flowers",
    "plastic bag",
    "wire",
    "silk flowers",
    "wire hanger",
    "plastic bags",
    "plastic",
    "plastic egg",
    "pipe cleaners",
    "pastels",
    "hangers",
    "wicker wreaths",
    "wreaths",
    "plastic sandwich bag",
    "ziploc top",
    "paper bags",
    "pipe cleaner",
    "pin",
    "wire cutters",
    "bunny ears",
    "glue"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.3461538462,
    "f1":0.4390243902,
    "avg_pos":0.1153846154
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.5769230769,
    "f1":0.6703910615
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9333333333,
    "p":0.8076923077,
    "f1":0.8659793814
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.3846153846,
    "f1":0.487804878
  }
}