{
  "title":"How to Clean a Composite Deck",
  "url":"https://www.wikihow.com/Clean-a-Composite-Deck",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Decks"
  ],
  "methods":[
    {
      "name":"Doing Routine Cleaning",
      "steps":[
        {
          "headline":"Sweep away debris at least once per week.",
          "description":"Keep your deck clear of dirt and debris with frequent sweeping. Depending on how much traffic your deck gets and what the current season is, you may want to sweep once a day, or every few days. At minimum, sweep it once per week. If you have a very large deck, a leaf blower may be ideal. If you have one, a shop vacuum works well for getting dirt and debris from between the decking boards using the crevice tool and the brush attachments."
        },
        {
          "headline":"Remove stubborn dirt with mild soap and a soft bristled brush.",
          "description":"Hose your deck off thoroughly with a water hose fitted with a good variable fan spray nozzle to loosen and remove surface debris. Mix warm water and mild dish soap in a bucket. Use a soft bristled brush and the cleaning solution to scrub your deck clean. Make sure to get down in the crevices and corners thoroughly. Use your water hose to rinse away the soap. This will also get rid of any mold or mildew growing on your deck. Make sure you do this, at minimum, twice per year."
        },
        {
          "headline":"Use a pressure washer.",
          "description":"This isn’t more effective than scrubbing by hand, but it’s much faster. If you have a large deck, you may prefer this approach. Use a pressure washer with no greater than 3100 psi and make sure it has a fan attachment and soap dispenser. Spray down your deck with the mild soap. Use a soft bristled brush to scrub the boards. Use the fan attachment to spray each individual deck board and rinse away the soap and debris. Pressure washers can damage the boards of your deck if they're not used carefully. Never point or spray the full pressure at yourself, another person, or pets. Small pieces of flying debris can also cause harm or damage. Stay at least 8 inches (20.32 cm) away from the deck surface at all times and spray in the direction of the wood grain to avoid possible damage. Make sure you rinse away the soap thoroughly; otherwise, it may leave a film on the deck surface."
        }
      ]
    },
    {
      "name":"Removing Stains",
      "steps":[
        {
          "headline":"Use dish soap and hot water on oil based stains.",
          "description":"Mild dish soap, like Dawn, is a great degreaser. Address the oily stain as soon as you notice it; the longer it sits on the surface of your deck, the more difficult it will be to remove. Use a soft bristled brush and soapy water to scrub at the stain. Rinse the soap away thoroughly with hot water. If the oil based stain has set and mild dish soap isn’t removing it, try an oil stain remover product like OSR or Pour-N-Restore. You can buy these products at home improvement stores."
        },
        {
          "headline":"Use a deck brighter than contains oxalic acid on tannin stains.",
          "description":"Water spots, also known as tannin stains, are normal occurrences on wood. Over time, you will likely start to notice some on your deck. Sweep the deck free of all dirt and debris. Make sure the surface is completely dry and then apply a deck brightener product that contains oxalic acid on the surface of your deck. Check your particular product for any additional directions. Deck brightener products can be purchased at home improvement stores."
        },
        {
          "headline":"Use oxalic acid on rust stains and other stubborn spots.",
          "description":"Deck brightener products will also work on these tougher stains. Sweep the deck and apply the product directly to the stain. Saturate the area and allow it to sit on the stain for about 15 minutes. Rinse the spot thoroughly with a water hose."
        }
      ]
    },
    {
      "name":"Maintaining Your Deck",
      "steps":[
        {
          "headline":"Keep your deck surface dry and debris-free.",
          "description":"The combination of moisture and dirt/pollen will cause mold to start growing on your deck. To prevent this, keep the surface of your deck as clean and dry as possible. Make sure your deck has effective drainage around its perimeter and between the deck planks."
        },
        {
          "headline":"Watch for drainage issues.",
          "description":"Your deck should have, at minimum, 6 inches (15.24 cm) between the wooden planks and the ground beneath for ventilation. This allows the water to drain off the deck and into the soil without the wooden planks being forced to sit in the soggy ground. There should never be standing water underneath your deck. If you notice standing water underneath, you may need to use a different grade of soil around your deck to improve drainage."
        },
        {
          "headline":"Keep the gaps between deck boards free of debris.",
          "description":"Pollen, leaves, dirt and other debris often get lodged in between the wooden planks. It’s easy to overlook this debris since it can’t be seen by glancing over the surface. Make sure you inspect the gaps and keep the spaces between the deck boards clean and free of debris."
        }
      ]
    }
  ],
  "text":" Doing Routine Cleaning Sweep away debris at least once per week. Keep your deck clear of dirt and debris with frequent sweeping. Depending on how much traffic your deck gets and what the current season is, you may want to sweep once a day, or every few days. At minimum, sweep it once per week. If you have a very large deck, a leaf blower may be ideal. If you have one, a shop vacuum works well for getting dirt and debris from between the decking boards using the crevice tool and the brush attachments. Remove stubborn dirt with mild soap and a soft bristled brush. Hose your deck off thoroughly with a water hose fitted with a good variable fan spray nozzle to loosen and remove surface debris. Mix warm water and mild dish soap in a bucket. Use a soft bristled brush and the cleaning solution to scrub your deck clean. Make sure to get down in the crevices and corners thoroughly. Use your water hose to rinse away the soap. This will also get rid of any mold or mildew growing on your deck. Make sure you do this, at minimum, twice per year. Use a pressure washer. This isn’t more effective than scrubbing by hand, but it’s much faster. If you have a large deck, you may prefer this approach. Use a pressure washer with no greater than 3100 psi and make sure it has a fan attachment and soap dispenser. Spray down your deck with the mild soap. Use a soft bristled brush to scrub the boards. Use the fan attachment to spray each individual deck board and rinse away the soap and debris. Pressure washers can damage the boards of your deck if they're not used carefully. Never point or spray the full pressure at yourself, another person, or pets. Small pieces of flying debris can also cause harm or damage. Stay at least 8 inches (20.32 cm) away from the deck surface at all times and spray in the direction of the wood grain to avoid possible damage. Make sure you rinse away the soap thoroughly; otherwise, it may leave a film on the deck surface. Removing Stains Use dish soap and hot water on oil based stains. Mild dish soap, like Dawn, is a great degreaser. Address the oily stain as soon as you notice it; the longer it sits on the surface of your deck, the more difficult it will be to remove. Use a soft bristled brush and soapy water to scrub at the stain. Rinse the soap away thoroughly with hot water. If the oil based stain has set and mild dish soap isn’t removing it, try an oil stain remover product like OSR or Pour-N-Restore. You can buy these products at home improvement stores. Use a deck brighter than contains oxalic acid on tannin stains. Water spots, also known as tannin stains, are normal occurrences on wood. Over time, you will likely start to notice some on your deck. Sweep the deck free of all dirt and debris. Make sure the surface is completely dry and then apply a deck brightener product that contains oxalic acid on the surface of your deck. Check your particular product for any additional directions. Deck brightener products can be purchased at home improvement stores. Use oxalic acid on rust stains and other stubborn spots. Deck brightener products will also work on these tougher stains. Sweep the deck and apply the product directly to the stain. Saturate the area and allow it to sit on the stain for about 15 minutes. Rinse the spot thoroughly with a water hose. Maintaining Your Deck Keep your deck surface dry and debris-free. The combination of moisture and dirt/pollen will cause mold to start growing on your deck. To prevent this, keep the surface of your deck as clean and dry as possible. Make sure your deck has effective drainage around its perimeter and between the deck planks. Watch for drainage issues. Your deck should have, at minimum, 6 inches (15.24 cm) between the wooden planks and the ground beneath for ventilation. This allows the water to drain off the deck and into the soil without the wooden planks being forced to sit in the soggy ground. There should never be standing water underneath your deck. If you notice standing water underneath, you may need to use a different grade of soil around your deck to improve drainage. Keep the gaps between deck boards free of debris. Pollen, leaves, dirt and other debris often get lodged in between the wooden planks. It’s easy to overlook this debris since it can’t be seen by glancing over the surface. Make sure you inspect the gaps and keep the spaces between the deck boards clean and free of debris.",
  "sentences":[
    " Doing Routine Cleaning Sweep away debris at least once per week.",
    "Keep your deck clear of dirt and debris with frequent sweeping.",
    "Depending on how much traffic your deck gets and what the current season is, you may want to sweep once a day, or every few days.",
    "At minimum, sweep it once per week.",
    "If you have a very large deck, a leaf blower may be ideal.",
    "If you have one, a shop vacuum works well for getting dirt and debris from between the decking boards using the crevice tool and the brush attachments.",
    "Remove stubborn dirt with mild soap and a soft bristled brush.",
    "Hose your deck off thoroughly with a water hose fitted with a good variable fan spray nozzle to loosen and remove surface debris.",
    "Mix warm water and mild dish soap in a bucket.",
    "Use a soft bristled brush and the cleaning solution to scrub your deck clean.",
    "Make sure to get down in the crevices and corners thoroughly.",
    "Use your water hose to rinse away the soap.",
    "This will also get rid of any mold or mildew growing on your deck.",
    "Make sure you do this, at minimum, twice per year.",
    "Use a pressure washer.",
    "This isn’t more effective than scrubbing by hand, but it’s much faster.",
    "If you have a large deck, you may prefer this approach.",
    "Use a pressure washer with no greater than 3100 psi and make sure it has a fan attachment and soap dispenser.",
    "Spray down your deck with the mild soap.",
    "Use a soft bristled brush to scrub the boards.",
    "Use the fan attachment to spray each individual deck board and rinse away the soap and debris.",
    "Pressure washers can damage the boards of your deck if they're not used carefully.",
    "Never point or spray the full pressure at yourself, another person, or pets.",
    "Small pieces of flying debris can also cause harm or damage.",
    "Stay at least 8 inches (20.32 cm) away from the deck surface at all times and spray in the direction of the wood grain to avoid possible damage.",
    "Make sure you rinse away the soap thoroughly; otherwise, it may leave a film on the deck surface.",
    "Removing Stains Use dish soap and hot water on oil based stains.",
    "Mild dish soap, like Dawn, is a great degreaser.",
    "Address the oily stain as soon as you notice it; the longer it sits on the surface of your deck, the more difficult it will be to remove.",
    "Use a soft bristled brush and soapy water to scrub at the stain.",
    "Rinse the soap away thoroughly with hot water.",
    "If the oil based stain has set and mild dish soap isn’t removing it, try an oil stain remover product like OSR or Pour-N-Restore.",
    "You can buy these products at home improvement stores.",
    "Use a deck brighter than contains oxalic acid on tannin stains.",
    "Water spots, also known as tannin stains, are normal occurrences on wood.",
    "Over time, you will likely start to notice some on your deck.",
    "Sweep the deck free of all dirt and debris.",
    "Make sure the surface is completely dry and then apply a deck brightener product that contains oxalic acid on the surface of your deck.",
    "Check your particular product for any additional directions.",
    "Deck brightener products can be purchased at home improvement stores.",
    "Use oxalic acid on rust stains and other stubborn spots.",
    "Deck brightener products will also work on these tougher stains.",
    "Sweep the deck and apply the product directly to the stain.",
    "Saturate the area and allow it to sit on the stain for about 15 minutes.",
    "Rinse the spot thoroughly with a water hose.",
    "Maintaining Your Deck Keep your deck surface dry and debris-free.",
    "The combination of moisture and dirt/pollen will cause mold to start growing on your deck.",
    "To prevent this, keep the surface of your deck as clean and dry as possible.",
    "Make sure your deck has effective drainage around its perimeter and between the deck planks.",
    "Watch for drainage issues.",
    "Your deck should have, at minimum, 6 inches (15.24 cm) between the wooden planks and the ground beneath for ventilation.",
    "This allows the water to drain off the deck and into the soil without the wooden planks being forced to sit in the soggy ground.",
    "There should never be standing water underneath your deck.",
    "If you notice standing water underneath, you may need to use a different grade of soil around your deck to improve drainage.",
    "Keep the gaps between deck boards free of debris.",
    "Pollen, leaves, dirt and other debris often get lodged in between the wooden planks.",
    "It’s easy to overlook this debris since it can’t be seen by glancing over the surface.",
    "Make sure you inspect the gaps and keep the spaces between the deck boards clean and free of debris."
  ],
  "tyn_section":[
    "Bucket",
    "Mild dish soap",
    "Soft bristled brush",
    "Deck brightener product containing oxalic acid",
    "Water hose",
    "Pressure washer (optional)",
    "Leaf blower (optional)"
  ],
  "tyn_model":[
    "water",
    "water hose",
    "dish soap",
    "oxalic acid",
    "deck brightener",
    "mild soap",
    "pressure washer",
    "soap",
    "hot water",
    "leaf blower",
    "vacuum",
    "mild dish soap",
    "bucket",
    "pressure washers",
    "soapy water",
    "oil stain remover",
    "pollen"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.1764705882,
    "f1":0.25,
    "avg_pos":0.7058823529
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.4705882353,
    "f1":0.5673758865
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.7647058824,
    "f1":0.8082901554
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7142857143,
    "p":0.4117647059,
    "f1":0.5223880597
  }
}