{
  "title":"How to Make Chipotle Ketchup",
  "url":"https://www.wikihow.com/Make-Chipotle-Ketchup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Sauces",
    "Tomato Sauces"
  ],
  "methods":[
    {
      "name":"Creating Simple Chipotle Ketchup",
      "steps":[
        {
          "headline":"Combine ingredients in a blender.",
          "description":"Place 14 ounces (30 ml) of ketchup, 2-3 chipotle peppers, and 1 tablespoon of adobo sauce in a blender. You can add more peppers if you would like to make a spicier sauce."
        },
        {
          "headline":"Mix until smooth.",
          "description":"Turn on the blender at medium speed and mix the ingredients until they create a smooth sauce. Alternatively, you could whisk together the ingredients in a small bowl, using a handheld whisk."
        },
        {
          "headline":"Transfer to a bowl or jar.",
          "description":"Once you have finished blending the ingredients, transfer the sauce into a sealed bowl or jar and refrigerate. You can also serve the sauce immediately. The sauce will last for up to one month in the refrigerator."
        }
      ]
    },
    {
      "name":"Making Chipotle Ketchup from Scratch",
      "steps":[
        {
          "headline":"Puree tomatoes in a food processor.",
          "description":"Pour a 12 ounce (355 ml) can of whole tomatoes into a food processor. Puree the tomatoes until they reach a smooth consistency. Then, strain any liquid from the tomato puree. Discard the liquid and put the pureed tomatoes aside for later use."
        },
        {
          "headline":"Cook onion over medium heat.",
          "description":"Heat 1 tablespoon of olive oil in a saucepan on the stove over medium heat. Once the oil is hot, add a diced yellow onion. Cook the onion until it becomes soft and translucent."
        },
        {
          "headline":"Add brown sugar.",
          "description":"Add two tablespoons of brown sugar to the onions. Continue to cook for an additional two minutes. The brown sugar should coat the onions."
        },
        {
          "headline":"Stir in remaining ingredients.",
          "description":"Then, add the tomato puree, two minced chipotle peppers, two tablespoons of cider vinegar, two teaspoons of tomato paste, and two teaspoons of coriander. Stir the ingredients in order to fully combine them."
        },
        {
          "headline":"Let simmer for 25 minutes.",
          "description":"Let the ingredients simmer on the stove until the sauce thickens. This will take approximately 25 minutes, but could take longer depending on your desired thickness. Once the sauce is ready, add salt and pepper to taste and then let it cool before serving."
        },
        {
          "headline":"Store remaining chipotle ketchup in a sealed container.",
          "description":"After the ketchup has cooled, place it in a tightly sealed container and store it in the refrigerator. This chipotle ketchup will last in the fridge for approximately one month."
        },
        {
          "headline":"Add additional seasoning.",
          "description":"You can include additional spices in this recipe in order to gain a more complex flavour. For example, try adding cinnamon, cloves, molasses, cayenne pepper, smoked paprika, or allspice. Experiment with different spices until you find a flavour that you enjoy."
        }
      ]
    },
    {
      "name":"Preparing Chipotle Ketchup Using Chipotle Paste",
      "steps":[
        {
          "headline":"Combine ingredients in a saucepan.",
          "description":"In a medium saucepan over medium heat combine: 6 oz (177 ml) can of tomato paste, ¼ cup (59 ml) of honey, ½ cup (118 ml) of white vinegar, ¼ cup (59 ml) of water, 1 tablespoon of chipotle paste, ¾ teaspoon of salt, ¼ teaspoon of onion powder, and ⅛ teaspoon of garlic powder. Whisk the ingredients together until the sauce reaches a smooth consistency."
        },
        {
          "headline":"Let simmer for 20 minutes.",
          "description":"Once the mixture has come to a boil, reduce the heat to low and let simmer for approximately 20 minutes. Continue to stir the mixture frequently so that it doesn’t burn to the bottom of the saucepan."
        },
        {
          "headline":"Remove from heat and cool.",
          "description":"Once the sauce is cooked, remove it from the heat and let it cool. Then, place it in the refrigerator in a tightly sealed container. The sauce will last up to one month in the refrigerator."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Creating Simple Chipotle Ketchup Combine ingredients in a blender. Place 14 ounces (30 ml) of ketchup, 2-3 chipotle peppers, and 1 tablespoon of adobo sauce in a blender. You can add more peppers if you would like to make a spicier sauce. Mix until smooth. Turn on the blender at medium speed and mix the ingredients until they create a smooth sauce. Alternatively, you could whisk together the ingredients in a small bowl, using a handheld whisk. Transfer to a bowl or jar. Once you have finished blending the ingredients, transfer the sauce into a sealed bowl or jar and refrigerate. You can also serve the sauce immediately. The sauce will last for up to one month in the refrigerator. Making Chipotle Ketchup from Scratch Puree tomatoes in a food processor. Pour a 12 ounce (355 ml) can of whole tomatoes into a food processor. Puree the tomatoes until they reach a smooth consistency. Then, strain any liquid from the tomato puree. Discard the liquid and put the pureed tomatoes aside for later use. Cook onion over medium heat. Heat 1 tablespoon of olive oil in a saucepan on the stove over medium heat. Once the oil is hot, add a diced yellow onion. Cook the onion until it becomes soft and translucent. Add brown sugar. Add two tablespoons of brown sugar to the onions. Continue to cook for an additional two minutes. The brown sugar should coat the onions. Stir in remaining ingredients. Then, add the tomato puree, two minced chipotle peppers, two tablespoons of cider vinegar, two teaspoons of tomato paste, and two teaspoons of coriander. Stir the ingredients in order to fully combine them. Let simmer for 25 minutes. Let the ingredients simmer on the stove until the sauce thickens. This will take approximately 25 minutes, but could take longer depending on your desired thickness. Once the sauce is ready, add salt and pepper to taste and then let it cool before serving. Store remaining chipotle ketchup in a sealed container. After the ketchup has cooled, place it in a tightly sealed container and store it in the refrigerator. This chipotle ketchup will last in the fridge for approximately one month. Add additional seasoning. You can include additional spices in this recipe in order to gain a more complex flavour. For example, try adding cinnamon, cloves, molasses, cayenne pepper, smoked paprika, or allspice. Experiment with different spices until you find a flavour that you enjoy. Preparing Chipotle Ketchup Using Chipotle Paste Combine ingredients in a saucepan. In a medium saucepan over medium heat combine: 6 oz (177 ml) can of tomato paste, ¼ cup (59 ml) of honey, ½ cup (118 ml) of white vinegar, ¼ cup (59 ml) of water, 1 tablespoon of chipotle paste, ¾ teaspoon of salt, ¼ teaspoon of onion powder, and ⅛ teaspoon of garlic powder. Whisk the ingredients together until the sauce reaches a smooth consistency. Let simmer for 20 minutes. Once the mixture has come to a boil, reduce the heat to low and let simmer for approximately 20 minutes. Continue to stir the mixture frequently so that it doesn’t burn to the bottom of the saucepan. Remove from heat and cool. Once the sauce is cooked, remove it from the heat and let it cool. Then, place it in the refrigerator in a tightly sealed container. The sauce will last up to one month in the refrigerator. Finished. ",
  "sentences":[
    " Creating Simple Chipotle Ketchup Combine ingredients in a blender.",
    "Place 14 ounces (30 ml) of ketchup, 2-3 chipotle peppers, and 1 tablespoon of adobo sauce in a blender.",
    "You can add more peppers if you would like to make a spicier sauce.",
    "Mix until smooth.",
    "Turn on the blender at medium speed and mix the ingredients until they create a smooth sauce.",
    "Alternatively, you could whisk together the ingredients in a small bowl, using a handheld whisk.",
    "Transfer to a bowl or jar.",
    "Once you have finished blending the ingredients, transfer the sauce into a sealed bowl or jar and refrigerate.",
    "You can also serve the sauce immediately.",
    "The sauce will last for up to one month in the refrigerator.",
    "Making Chipotle Ketchup from Scratch Puree tomatoes in a food processor.",
    "Pour a 12 ounce (355 ml) can of whole tomatoes into a food processor.",
    "Puree the tomatoes until they reach a smooth consistency.",
    "Then, strain any liquid from the tomato puree.",
    "Discard the liquid and put the pureed tomatoes aside for later use.",
    "Cook onion over medium heat.",
    "Heat 1 tablespoon of olive oil in a saucepan on the stove over medium heat.",
    "Once the oil is hot, add a diced yellow onion.",
    "Cook the onion until it becomes soft and translucent.",
    "Add brown sugar.",
    "Add two tablespoons of brown sugar to the onions.",
    "Continue to cook for an additional two minutes.",
    "The brown sugar should coat the onions.",
    "Stir in remaining ingredients.",
    "Then, add the tomato puree, two minced chipotle peppers, two tablespoons of cider vinegar, two teaspoons of tomato paste, and two teaspoons of coriander.",
    "Stir the ingredients in order to fully combine them.",
    "Let simmer for 25 minutes.",
    "Let the ingredients simmer on the stove until the sauce thickens.",
    "This will take approximately 25 minutes, but could take longer depending on your desired thickness.",
    "Once the sauce is ready, add salt and pepper to taste and then let it cool before serving.",
    "Store remaining chipotle ketchup in a sealed container.",
    "After the ketchup has cooled, place it in a tightly sealed container and store it in the refrigerator.",
    "This chipotle ketchup will last in the fridge for approximately one month.",
    "Add additional seasoning.",
    "You can include additional spices in this recipe in order to gain a more complex flavour.",
    "For example, try adding cinnamon, cloves, molasses, cayenne pepper, smoked paprika, or allspice.",
    "Experiment with different spices until you find a flavour that you enjoy.",
    "Preparing Chipotle Ketchup Using Chipotle Paste Combine ingredients in a saucepan.",
    "In a medium saucepan over medium heat combine: 6 oz (177 ml) can of tomato paste, ¼ cup (59 ml) of honey, ½ cup (118 ml) of white vinegar, ¼ cup (59 ml) of water, 1 tablespoon of chipotle paste, ¾ teaspoon of salt, ¼ teaspoon of onion powder, and ⅛ teaspoon of garlic powder.",
    "Whisk the ingredients together until the sauce reaches a smooth consistency.",
    "Let simmer for 20 minutes.",
    "Once the mixture has come to a boil, reduce the heat to low and let simmer for approximately 20 minutes.",
    "Continue to stir the mixture frequently so that it doesn’t burn to the bottom of the saucepan.",
    "Remove from heat and cool.",
    "Once the sauce is cooked, remove it from the heat and let it cool.",
    "Then, place it in the refrigerator in a tightly sealed container.",
    "The sauce will last up to one month in the refrigerator.",
    "Finished."
  ],
  "tyn_section":[
    "Measuring cups",
    "Food processor",
    "Non-stick saucepan",
    "Sealable containers"
  ],
  "tyn_model":[
    "tomatoes",
    "blender",
    "saucepan",
    "brown sugar",
    "chipotle ketchup",
    "refrigerator",
    "chipotle peppers",
    "food processor",
    "tomato puree",
    "stove",
    "tomato paste",
    "chipotle paste",
    "ketchup",
    "adobo sauce",
    "whisk",
    "bowl",
    "onion",
    "olive oil",
    "oil",
    "yellow onion",
    "cider vinegar",
    "coriander",
    "salt and pepper",
    "cinnamon",
    "cloves",
    "molasses",
    "smoked paprika",
    "allspice",
    "honey",
    "white vinegar",
    "water",
    "salt",
    "onion powder",
    "⅛ teaspoon",
    "garlic powder"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0285714286,
    "f1":0.0512820513,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.0571428571,
    "f1":0.1025641026
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.0571428571,
    "f1":0.1025641026
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0285714286,
    "f1":0.0512820513
  }
}