{
  "title":"How to Clean a Stone Tile Shower",
  "url":"https://www.wikihow.com/Clean-a-Stone-Tile-Shower",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "methods":[
    {
      "name":"Doing Routine Cleaning",
      "steps":[
        {
          "headline":"Wipe away loose buildup and grime.",
          "description":"Wet a clean, soft cloth, like one made of microfiber, in warm water. Firmly wipe down all of your shower's stone tiles and the grout in between. This will make it easier for you to find and target more severe buildup and hidden stains. Soft clothes will be the gentlest on the finish of your stone. Rough fabric, over time, could cause the surface of your stone to pit or cloud."
        },
        {
          "headline":"Scrub grout with a toothbrush and a mild detergent.",
          "description":"The narrow crevices between tiles and filled with grout are a prime location for buildup. Use a mild detergent, like dish soap, warm water, and a toothbrush to scrub the grouted cracks between tiles. Rinse the area thoroughly afterwards and repeat as necessary until the grout is clean. Because grout is often dirtier than the tile itself, clean the grout first to prevent it from spreading to the tile. Avoid using general grout cleaners when cleaning the grout of natural stone tile. These often have ingredients that can damage your stone. Stiff bristle brushes can harm the finish of your stone and cause scratches. Only use soft bristle brushes and soft cloths when cleaning."
        },
        {
          "headline":"Clean the stone with a mild detergent or stone soap.",
          "description":"Mix together warm water and a couple drops of mild detergent, like dish soap. Stir the solution to distribute the soap. Dip a soft rag into the solution, wring excess liquid from it, and use it to wipe down the tiles. Rinse the tiles frequently as you do so. Soaps that are formulated for the natural stone used in your shower can be found at most hardware stores. Cleaners that are acidic can damage your stone tile. Only use cleaners that are pH neutral (a 7 pH rating), which should be indicated on the cleaner's label information. Using more soap isn't always better. Too much soap in your solution could result in streaks or a film remaining on the tiles after cleaning."
        },
        {
          "headline":"Cut through soap scum with an ammonia and water solution.",
          "description":"Soap scum is a common problem and it can be difficult to remove. Cut through it with a solution of a half cup (237 ml) ammonia and a gallon (3.8 L) of water. Apply the solution to the tile with a clean, soft cloth. Using ammonia to clean your stone too frequently can negatively impact its appearance, causing it to dull. Stay on top of general cleaning to prevent soap scum from building up. This way, you'll only have to infrequently use ammonia."
        },
        {
          "headline":"Dry the stone after cleaning.",
          "description":"Avoid leaving cleaners on your stone for long periods of time, especially ones that can cause dulling or fading, like ammonia or hydrogen peroxide. Rinse the tiles thoroughly and then wipe them dry with a clean, soft towel."
        }
      ]
    },
    {
      "name":"Removing Stains",
      "steps":[
        {
          "headline":"Investigate the location of the stain.",
          "description":"This can provide useful information for what caused the stain. Certain stains will need special cleaning procedures to be removed from the stone. Note the color, size, shape, and pattern of the stain, along with anything in the area that might have caused it."
        },
        {
          "headline":"Cleanse oil based stains with a household detergent or ammonia.",
          "description":"Some common examples of oil based stains include grease, tar, or cosmetics. These will cause your tile to darken. To dissolve oil based stains, clean the area by gently wiping it with a soft cloth and a household detergent, like dish soap, or ammonia. Afterwards, dry the area with a soft towel. If detergent and ammonia fail to remove the stain, try mineral spirits or acetone. Use these sparingly and as a last resort. Flush these cleaners with water after applying, then dry the area."
        },
        {
          "headline":"Eliminate mildew and algae with a heavy-duty cleaner.",
          "description":"Mix a diluted cleaning solution containing a half cup (237 ml) of ammonia, bleach, or hydrogen peroxide with a gallon (3.8 L) of water. Clean the surface with the solution with a soft cloth, rinse the area well, then dry it with a soft cloth or towel. Never mix bleach and ammonia. Doing so will create toxic fumes that can result in serious harm or death. EXPERT TIP\t\"To kill mold in your shower, use a cleaner that's labelled as being able to kill 99.9% of germs.\" Ashley Matuska\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley MatuskaCleaning Guru"
        },
        {
          "headline":"Erase organic stains with hydrogen peroxide and ammonia.",
          "description":"The most common kinds of organic stains come from bodily fluids, like urine or feces, tobacco, paper, and food. These may create a brown-pink stain. Clean these areas as you would normally with 12% hydrogen peroxide and a couple of drops of ammonia. In some cases, you may be able to get rid of an organic stain just by removing its source. After removal, wait a few days to see if the stain disappears. Hydrogen peroxide may fade or lighten the color of your stone. Test it on an out of sight location before you use it. Only use this technique occasionally to prevent color loss."
        },
        {
          "headline":"Use a stone poultice for metal stains.",
          "description":"Mix the poultice according to its directions. Usually this will result in a paste that is the consistency of peanut butter. Wet the stain with distilled water. Apply the paste to the stain so it is roughly ¼ to ½ in (.64 to 1.3 cm) thick. The paste should extend beyond the stain by roughly an inch (2.5 cm). Tape plastic over the poultice, wait the time indicated on the label, then remove it according to its directions. For severe stains, you may have to reapply the poultice a few times before it is fully removed. Some stains may take five applications or more. Stain removing poultices can be purchased from your local hardware store or home center. Look for it among stone care products. Some kinds of poultice are sold as pre-made strips of treated paper. These are generally applied to stains similarly to paste poultices."
        },
        {
          "headline":"Buff out water spots and rings with 0000 steel wool as necessary.",
          "description":"Hard water can leave rings, a white film, or scale on your stone. When the stone is dry, buff the surface in a circular motion with a dry piece of 0000 rated steel wool. Wipe the surface with a clean, dry, soft cloth or rag after. Use light to moderate pressure when buffing your countertop. Too much pressure may harm the appearance of your stone."
        }
      ]
    },
    {
      "name":"Maintaining Your Stone Tile",
      "steps":[
        {
          "headline":"Evaluate the condition of your stone.",
          "description":"Cracked tiles will accumulate buildup and dirtiness more quickly than those without any. These may need to be replaced or repaired. Uneven tiles may require a professional to grind, hone, and polish them flat. Note any stains and try to determine what caused these. Knowing the source of a stain will make it easier for you to eliminate later if general cleaning techniques don't work."
        },
        {
          "headline":"Avoid abrasive and acidic cleaners.",
          "description":"Abrasive and acidic cleaners will damage to your stone. Check the labels of all cleaners before using them to make sure they don't contain either of these. Before using a cleaner, test it on an out of sight part of the stone to verify that it won't damage or discolor. Cleaners that are specially formulated for the kind of stone used in your shower will likely be the safest to use."
        },
        {
          "headline":"Remove excess moisture from the tile after showering.",
          "description":"Water remaining on your tile will eventually evaporate, leaving behind minerals that cloud your stone, dirtiness, and more. After every shower, use a squeegee or soft towel to wipe away excess water and prevent this from happening. Many squeegees come with suction cup hangers that you can attach to the wall of your shower. This way, your squeegee will be easily accessible after showering."
        },
        {
          "headline":"Protect the condition of the tile with a non-slip mat.",
          "description":"Your feet can grind small debris, like dirt, into your stone tile, wearing it down over time. This can cause it to lose its luster. Place a non-slip mat on the tile and vacuum under it occasionally to suck up these small particles. Clean mats at least once a month to prevent stains from hiding underneath them and increasing in severity over time."
        },
        {
          "headline":"Polish out etch marks.",
          "description":"Etch marks are usually caused by an acid. Remove any dirtiness first with general cleaning methods. Apply a suitable stone polishing powder to the tile. Use a damp cloth to rub the powder into the stone in a circular motion. Continue rubbing until the etch mark disappears. Some of your shower products may contain acids. Take care to keep these off your stone to prevent etching. Etching that is especially deep may be impossible to remove with polishing powder. In these cases, call a stone repair or maintenance professional."
        },
        {
          "headline":"Hire a professional to deep-clean your stone tile.",
          "description":"Professional cleaners have special tools and techniques that can extract dirt or grime that may have impacted the pores of the stone, which causes dullness. Have your tile cleaned by a professional when thorough cleaning fails to restore the stone's luster. Persistent stains or blemishes that are difficult to treat may require an expert. Call a stone care professional, installer, or restoration specialist to treat problems like these."
        }
      ]
    }
  ],
  "text":" Doing Routine Cleaning Wipe away loose buildup and grime. Wet a clean, soft cloth, like one made of microfiber, in warm water. Firmly wipe down all of your shower's stone tiles and the grout in between. This will make it easier for you to find and target more severe buildup and hidden stains. Soft clothes will be the gentlest on the finish of your stone. Rough fabric, over time, could cause the surface of your stone to pit or cloud. Scrub grout with a toothbrush and a mild detergent. The narrow crevices between tiles and filled with grout are a prime location for buildup. Use a mild detergent, like dish soap, warm water, and a toothbrush to scrub the grouted cracks between tiles. Rinse the area thoroughly afterwards and repeat as necessary until the grout is clean. Because grout is often dirtier than the tile itself, clean the grout first to prevent it from spreading to the tile. Avoid using general grout cleaners when cleaning the grout of natural stone tile. These often have ingredients that can damage your stone. Stiff bristle brushes can harm the finish of your stone and cause scratches. Only use soft bristle brushes and soft cloths when cleaning. Clean the stone with a mild detergent or stone soap. Mix together warm water and a couple drops of mild detergent, like dish soap. Stir the solution to distribute the soap. Dip a soft rag into the solution, wring excess liquid from it, and use it to wipe down the tiles. Rinse the tiles frequently as you do so. Soaps that are formulated for the natural stone used in your shower can be found at most hardware stores. Cleaners that are acidic can damage your stone tile. Only use cleaners that are pH neutral (a 7 pH rating), which should be indicated on the cleaner's label information. Using more soap isn't always better. Too much soap in your solution could result in streaks or a film remaining on the tiles after cleaning. Cut through soap scum with an ammonia and water solution. Soap scum is a common problem and it can be difficult to remove. Cut through it with a solution of a half cup (237 ml) ammonia and a gallon (3.8 L) of water. Apply the solution to the tile with a clean, soft cloth. Using ammonia to clean your stone too frequently can negatively impact its appearance, causing it to dull. Stay on top of general cleaning to prevent soap scum from building up. This way, you'll only have to infrequently use ammonia. Dry the stone after cleaning. Avoid leaving cleaners on your stone for long periods of time, especially ones that can cause dulling or fading, like ammonia or hydrogen peroxide. Rinse the tiles thoroughly and then wipe them dry with a clean, soft towel. Removing Stains Investigate the location of the stain. This can provide useful information for what caused the stain. Certain stains will need special cleaning procedures to be removed from the stone. Note the color, size, shape, and pattern of the stain, along with anything in the area that might have caused it. Cleanse oil based stains with a household detergent or ammonia. Some common examples of oil based stains include grease, tar, or cosmetics. These will cause your tile to darken. To dissolve oil based stains, clean the area by gently wiping it with a soft cloth and a household detergent, like dish soap, or ammonia. Afterwards, dry the area with a soft towel. If detergent and ammonia fail to remove the stain, try mineral spirits or acetone. Use these sparingly and as a last resort. Flush these cleaners with water after applying, then dry the area. Eliminate mildew and algae with a heavy-duty cleaner. Mix a diluted cleaning solution containing a half cup (237 ml) of ammonia, bleach, or hydrogen peroxide with a gallon (3.8 L) of water. Clean the surface with the solution with a soft cloth, rinse the area well, then dry it with a soft cloth or towel. Never mix bleach and ammonia. Doing so will create toxic fumes that can result in serious harm or death. EXPERT TIP\t\"To kill mold in your shower, use a cleaner that's labelled as being able to kill 99.9% of germs.\" Ashley Matuska\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado. She has worked in the cleaning industry for over 5 years. Ashley MatuskaCleaning Guru Erase organic stains with hydrogen peroxide and ammonia. The most common kinds of organic stains come from bodily fluids, like urine or feces, tobacco, paper, and food. These may create a brown-pink stain. Clean these areas as you would normally with 12% hydrogen peroxide and a couple of drops of ammonia. In some cases, you may be able to get rid of an organic stain just by removing its source. After removal, wait a few days to see if the stain disappears. Hydrogen peroxide may fade or lighten the color of your stone. Test it on an out of sight location before you use it. Only use this technique occasionally to prevent color loss. Use a stone poultice for metal stains. Mix the poultice according to its directions. Usually this will result in a paste that is the consistency of peanut butter. Wet the stain with distilled water. Apply the paste to the stain so it is roughly ¼ to ½ in (.64 to 1.3 cm) thick. The paste should extend beyond the stain by roughly an inch (2.5 cm). Tape plastic over the poultice, wait the time indicated on the label, then remove it according to its directions. For severe stains, you may have to reapply the poultice a few times before it is fully removed. Some stains may take five applications or more. Stain removing poultices can be purchased from your local hardware store or home center. Look for it among stone care products. Some kinds of poultice are sold as pre-made strips of treated paper. These are generally applied to stains similarly to paste poultices. Buff out water spots and rings with 0000 steel wool as necessary. Hard water can leave rings, a white film, or scale on your stone. When the stone is dry, buff the surface in a circular motion with a dry piece of 0000 rated steel wool. Wipe the surface with a clean, dry, soft cloth or rag after. Use light to moderate pressure when buffing your countertop. Too much pressure may harm the appearance of your stone. Maintaining Your Stone Tile Evaluate the condition of your stone. Cracked tiles will accumulate buildup and dirtiness more quickly than those without any. These may need to be replaced or repaired. Uneven tiles may require a professional to grind, hone, and polish them flat. Note any stains and try to determine what caused these. Knowing the source of a stain will make it easier for you to eliminate later if general cleaning techniques don't work. Avoid abrasive and acidic cleaners. Abrasive and acidic cleaners will damage to your stone. Check the labels of all cleaners before using them to make sure they don't contain either of these. Before using a cleaner, test it on an out of sight part of the stone to verify that it won't damage or discolor. Cleaners that are specially formulated for the kind of stone used in your shower will likely be the safest to use. Remove excess moisture from the tile after showering. Water remaining on your tile will eventually evaporate, leaving behind minerals that cloud your stone, dirtiness, and more. After every shower, use a squeegee or soft towel to wipe away excess water and prevent this from happening. Many squeegees come with suction cup hangers that you can attach to the wall of your shower. This way, your squeegee will be easily accessible after showering. Protect the condition of the tile with a non-slip mat. Your feet can grind small debris, like dirt, into your stone tile, wearing it down over time. This can cause it to lose its luster. Place a non-slip mat on the tile and vacuum under it occasionally to suck up these small particles. Clean mats at least once a month to prevent stains from hiding underneath them and increasing in severity over time. Polish out etch marks. Etch marks are usually caused by an acid. Remove any dirtiness first with general cleaning methods. Apply a suitable stone polishing powder to the tile. Use a damp cloth to rub the powder into the stone in a circular motion. Continue rubbing until the etch mark disappears. Some of your shower products may contain acids. Take care to keep these off your stone to prevent etching. Etching that is especially deep may be impossible to remove with polishing powder. In these cases, call a stone repair or maintenance professional. Hire a professional to deep-clean your stone tile. Professional cleaners have special tools and techniques that can extract dirt or grime that may have impacted the pores of the stone, which causes dullness. Have your tile cleaned by a professional when thorough cleaning fails to restore the stone's luster. Persistent stains or blemishes that are difficult to treat may require an expert. Call a stone care professional, installer, or restoration specialist to treat problems like these.",
  "sentences":[
    " Doing Routine Cleaning Wipe away loose buildup and grime.",
    "Wet a clean, soft cloth, like one made of microfiber, in warm water.",
    "Firmly wipe down all of your shower's stone tiles and the grout in between.",
    "This will make it easier for you to find and target more severe buildup and hidden stains.",
    "Soft clothes will be the gentlest on the finish of your stone.",
    "Rough fabric, over time, could cause the surface of your stone to pit or cloud.",
    "Scrub grout with a toothbrush and a mild detergent.",
    "The narrow crevices between tiles and filled with grout are a prime location for buildup.",
    "Use a mild detergent, like dish soap, warm water, and a toothbrush to scrub the grouted cracks between tiles.",
    "Rinse the area thoroughly afterwards and repeat as necessary until the grout is clean.",
    "Because grout is often dirtier than the tile itself, clean the grout first to prevent it from spreading to the tile.",
    "Avoid using general grout cleaners when cleaning the grout of natural stone tile.",
    "These often have ingredients that can damage your stone.",
    "Stiff bristle brushes can harm the finish of your stone and cause scratches.",
    "Only use soft bristle brushes and soft cloths when cleaning.",
    "Clean the stone with a mild detergent or stone soap.",
    "Mix together warm water and a couple drops of mild detergent, like dish soap.",
    "Stir the solution to distribute the soap.",
    "Dip a soft rag into the solution, wring excess liquid from it, and use it to wipe down the tiles.",
    "Rinse the tiles frequently as you do so.",
    "Soaps that are formulated for the natural stone used in your shower can be found at most hardware stores.",
    "Cleaners that are acidic can damage your stone tile.",
    "Only use cleaners that are pH neutral (a 7 pH rating), which should be indicated on the cleaner's label information.",
    "Using more soap isn't always better.",
    "Too much soap in your solution could result in streaks or a film remaining on the tiles after cleaning.",
    "Cut through soap scum with an ammonia and water solution.",
    "Soap scum is a common problem and it can be difficult to remove.",
    "Cut through it with a solution of a half cup (237 ml) ammonia and a gallon (3.8 L) of water.",
    "Apply the solution to the tile with a clean, soft cloth.",
    "Using ammonia to clean your stone too frequently can negatively impact its appearance, causing it to dull.",
    "Stay on top of general cleaning to prevent soap scum from building up.",
    "This way, you'll only have to infrequently use ammonia.",
    "Dry the stone after cleaning.",
    "Avoid leaving cleaners on your stone for long periods of time, especially ones that can cause dulling or fading, like ammonia or hydrogen peroxide.",
    "Rinse the tiles thoroughly and then wipe them dry with a clean, soft towel.",
    "Removing Stains Investigate the location of the stain.",
    "This can provide useful information for what caused the stain.",
    "Certain stains will need special cleaning procedures to be removed from the stone.",
    "Note the color, size, shape, and pattern of the stain, along with anything in the area that might have caused it.",
    "Cleanse oil based stains with a household detergent or ammonia.",
    "Some common examples of oil based stains include grease, tar, or cosmetics.",
    "These will cause your tile to darken.",
    "To dissolve oil based stains, clean the area by gently wiping it with a soft cloth and a household detergent, like dish soap, or ammonia.",
    "Afterwards, dry the area with a soft towel.",
    "If detergent and ammonia fail to remove the stain, try mineral spirits or acetone.",
    "Use these sparingly and as a last resort.",
    "Flush these cleaners with water after applying, then dry the area.",
    "Eliminate mildew and algae with a heavy-duty cleaner.",
    "Mix a diluted cleaning solution containing a half cup (237 ml) of ammonia, bleach, or hydrogen peroxide with a gallon (3.8 L) of water.",
    "Clean the surface with the solution with a soft cloth, rinse the area well, then dry it with a soft cloth or towel.",
    "Never mix bleach and ammonia.",
    "Doing so will create toxic fumes that can result in serious harm or death.",
    "EXPERT TIP\t\"To kill mold in your shower, use a cleaner that's labelled as being able to kill 99.9% of germs.\"",
    "Ashley Matuska\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tAshley Matuska is the owner and founder of Dashing Maids, a sustainably focused cleaning agency in Denver, Colorado.",
    "She has worked in the cleaning industry for over 5 years.",
    "Ashley MatuskaCleaning Guru Erase organic stains with hydrogen peroxide and ammonia.",
    "The most common kinds of organic stains come from bodily fluids, like urine or feces, tobacco, paper, and food.",
    "These may create a brown-pink stain.",
    "Clean these areas as you would normally with 12% hydrogen peroxide and a couple of drops of ammonia.",
    "In some cases, you may be able to get rid of an organic stain just by removing its source.",
    "After removal, wait a few days to see if the stain disappears.",
    "Hydrogen peroxide may fade or lighten the color of your stone.",
    "Test it on an out of sight location before you use it.",
    "Only use this technique occasionally to prevent color loss.",
    "Use a stone poultice for metal stains.",
    "Mix the poultice according to its directions.",
    "Usually this will result in a paste that is the consistency of peanut butter.",
    "Wet the stain with distilled water.",
    "Apply the paste to the stain so it is roughly ¼ to ½ in (.64 to 1.3 cm) thick.",
    "The paste should extend beyond the stain by roughly an inch (2.5 cm).",
    "Tape plastic over the poultice, wait the time indicated on the label, then remove it according to its directions.",
    "For severe stains, you may have to reapply the poultice a few times before it is fully removed.",
    "Some stains may take five applications or more.",
    "Stain removing poultices can be purchased from your local hardware store or home center.",
    "Look for it among stone care products.",
    "Some kinds of poultice are sold as pre-made strips of treated paper.",
    "These are generally applied to stains similarly to paste poultices.",
    "Buff out water spots and rings with 0000 steel wool as necessary.",
    "Hard water can leave rings, a white film, or scale on your stone.",
    "When the stone is dry, buff the surface in a circular motion with a dry piece of 0000 rated steel wool.",
    "Wipe the surface with a clean, dry, soft cloth or rag after.",
    "Use light to moderate pressure when buffing your countertop.",
    "Too much pressure may harm the appearance of your stone.",
    "Maintaining Your Stone Tile Evaluate the condition of your stone.",
    "Cracked tiles will accumulate buildup and dirtiness more quickly than those without any.",
    "These may need to be replaced or repaired.",
    "Uneven tiles may require a professional to grind, hone, and polish them flat.",
    "Note any stains and try to determine what caused these.",
    "Knowing the source of a stain will make it easier for you to eliminate later if general cleaning techniques don't work.",
    "Avoid abrasive and acidic cleaners.",
    "Abrasive and acidic cleaners will damage to your stone.",
    "Check the labels of all cleaners before using them to make sure they don't contain either of these.",
    "Before using a cleaner, test it on an out of sight part of the stone to verify that it won't damage or discolor.",
    "Cleaners that are specially formulated for the kind of stone used in your shower will likely be the safest to use.",
    "Remove excess moisture from the tile after showering.",
    "Water remaining on your tile will eventually evaporate, leaving behind minerals that cloud your stone, dirtiness, and more.",
    "After every shower, use a squeegee or soft towel to wipe away excess water and prevent this from happening.",
    "Many squeegees come with suction cup hangers that you can attach to the wall of your shower.",
    "This way, your squeegee will be easily accessible after showering.",
    "Protect the condition of the tile with a non-slip mat.",
    "Your feet can grind small debris, like dirt, into your stone tile, wearing it down over time.",
    "This can cause it to lose its luster.",
    "Place a non-slip mat on the tile and vacuum under it occasionally to suck up these small particles.",
    "Clean mats at least once a month to prevent stains from hiding underneath them and increasing in severity over time.",
    "Polish out etch marks.",
    "Etch marks are usually caused by an acid.",
    "Remove any dirtiness first with general cleaning methods.",
    "Apply a suitable stone polishing powder to the tile.",
    "Use a damp cloth to rub the powder into the stone in a circular motion.",
    "Continue rubbing until the etch mark disappears.",
    "Some of your shower products may contain acids.",
    "Take care to keep these off your stone to prevent etching.",
    "Etching that is especially deep may be impossible to remove with polishing powder.",
    "In these cases, call a stone repair or maintenance professional.",
    "Hire a professional to deep-clean your stone tile.",
    "Professional cleaners have special tools and techniques that can extract dirt or grime that may have impacted the pores of the stone, which causes dullness.",
    "Have your tile cleaned by a professional when thorough cleaning fails to restore the stone's luster.",
    "Persistent stains or blemishes that are difficult to treat may require an expert.",
    "Call a stone care professional, installer, or restoration specialist to treat problems like these."
  ],
  "tyn_section":[
    "0000 steel wool (optional)",
    "Ammonia",
    "Bucket",
    "Mild dish soap",
    "Rubber gloves",
    "Soft cleaning rags (microfiber preferred)",
    "Soft towel (for drying)",
    "Squeegee",
    "Toothbrush"
  ],
  "tyn_model":[
    "ammonia",
    "water",
    "grout",
    "cleaners",
    "hydrogen peroxide",
    "mild detergent",
    "dish soap",
    "soap",
    "cleaner",
    "toothbrush",
    "soap scum",
    "household detergent",
    "bleach",
    "tiles",
    "non-slip mat",
    "grout cleaners",
    "stone soap",
    "soaps",
    "detergent",
    "mineral spirits",
    "acetone",
    "heavy-duty cleaner",
    "dashing maids",
    "stone poultice",
    "peanut butter",
    "distilled water",
    "plastic",
    "stone care products",
    "treated paper",
    "0000 steel wool",
    "0000 rated steel wool",
    "squeegee",
    "squeegees",
    "suction cup hangers",
    "vacuum",
    "mats",
    "acid",
    "stone polishing powder",
    "polishing powder",
    "stone repair or maintenance professional",
    "stone care professional"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0731707317,
    "f1":0.12,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5555555556,
    "p":0.1463414634,
    "f1":0.2316602317
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5555555556,
    "p":0.1707317073,
    "f1":0.2611940299
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5555555556,
    "p":0.1219512195,
    "f1":0.2
  }
}