{
  "title":"How to Make Quinoa Lasagna",
  "url":"https://www.wikihow.com/Make-Quinoa-Lasagna",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Lasagna"
  ],
  "methods":[
    {
      "name":"Baking Vegetable Lasagna",
      "steps":[
        {
          "headline":"Chop vegetables while the oven preheats.",
          "description":"Preheat the oven to 375 °F (191 °C). Use a large chopping knife to dice the mushrooms. Dice the onions more finely than the mushrooms."
        },
        {
          "headline":"Line a greased casserole dish with veggies and quinoa.",
          "description":"Spray the dish generously with coconut oil cooking spray. Place the spinach, mushrooms and onions into the dish. Sprinkle the uncooked quinoa on top."
        },
        {
          "headline":"Mix up the marinara in a medium bowl.",
          "description":"Combine the marinara sauce with the vegetable broth, cottage and ricotta cheese, Italian seasoning, garlic powder, sea salt and ground pepper. You can use 1% cottage cheese and full-fat ricotta cheese, or opt for whatever type you like of each."
        },
        {
          "headline":"Combine the marinara with the contents of the casserole dish.",
          "description":"Pour the marinara mixture over the veggies and quinoa. Mix all of the ingredients together with a large spoon. Ensure that the sauce mixture mostly covers the other ingredients."
        },
        {
          "headline":"Bake the covered casserole for one hour.",
          "description":"Cover the dish with tin foil. After 30 minutes, remove the lasagna and stir it. Replace the foil cover and put the dish back in the oven for another 30 minutes. At the halfway mark, it’s normal for the dish to appear a bit watery."
        },
        {
          "headline":"Add the toppings and cook for two minutes.",
          "description":"Arrange sliced tomatoes and shredded mozzarella to the top of the lasagna. Replace the tin foil. After cooking, let the dish cool for about ten minutes before serving it."
        },
        {
          "headline":"Refrigerate or freeze leftovers.",
          "description":"Store the lasagna in an air tight container. Refrigerate for up to five days. If freezing, allow the lasagna to cool completely first. Let it thaw in the refrigerator overnight before re-heating. Try a glass pyrex dish for refrigeration. Try a disposable aluminum casserole dish for freezing. Add a sheet of plastic wrap on top of the lasagna and push all of the air out before wrapping the whole dish in tin foil."
        }
      ]
    },
    {
      "name":"Making Spinach and Chicken Lasagna",
      "steps":[
        {
          "headline":"Boil the quinoa in a small pot.",
          "description":"Add rinsed and drained quinoa to a pot with 1½ cups (350 ml) of water. Bring the contents to a boil over high heat. Turn the heat to low and put a lid on the pot. Continue cooking for about fourteen minutes. Remove the pot from heat and let it sit, covered, for five minutes. Fluff the cooked quinoa with a fork. The quinoa is finished cooking when the liquid has all been absorbed."
        },
        {
          "headline":"Sautee onion, garlic and mushrooms.",
          "description":"Heat olive oil over medium heat in a large saucepan. Pour in the vegetables. Cook for five minutes, stirring occasionally, until the vegetables are tender and the onions are translucent."
        },
        {
          "headline":"Cook ground chicken with the veggies.",
          "description":"Over low to medium heat, cook the chicken for six to seven minutes in with the onion, garlic and mushroom you just sauteed. Use a spatula or wooden spoon to break up the meat as it cooks, until it is no longer pink."
        },
        {
          "headline":"Add spinach, tomatoes and seasonings.",
          "description":"Add spinach to the saucepan and cook it for two minutes, stirring continually, until the spinach leaves wilt. Mix in tomatoes, basil, salt, red pepper, oregano and sugar. Bring the mixture to a simmer and cook for about ten minutes, until the mixture thickens. Remove from heat. The mixture must be thick, not runny, for the lasagna to set properly."
        },
        {
          "headline":"Combine quinoa, cheese and sauce as the oven preheats.",
          "description":"Preheat the oven to 375 °F (191 °C). Add the quinoa, ricotta and 1/2 cup (95 g) of grated mozzarella into the sauce mixture and fold it in, then mix well. Pour the mixture into a baking dish. You can use a 9” (23 cm) x 13” (33 cm) oven-safe casserole dish."
        },
        {
          "headline":"Add the topping to the lasagna.",
          "description":"Smooth the top of the lasagna with a spatula. Sprinkle the rest of the mozzarella on top in a single layer. Pour the Parmesan and breadcrumbs on top."
        },
        {
          "headline":"Bake the lasagna for 30-35 minutes.",
          "description":"Allow it to cool for at least five minutes before you serve it. The lasagna is done when the top is bubbling and lightly browned. If you want it browner, you can put it under the boiler for about a minute at the end."
        },
        {
          "headline":"Refrigerate or freeze leftovers.",
          "description":"Store your lasagna in an air tight container. Refrigerate the lasagna for up to five days. If you want to freeze it, allow the lasagna to cool entirely first. Allow it thaw in the refrigerator overnight before re-heating. For example, you can refrigerate the lasagna in a glass pyrex dish with a lid. For instance, place the lasagna in a disposable casserole dish. Add a sheet of plastic wrap on top, then push all of the air out. Wrap the entire dish in foil, and freeze."
        }
      ]
    },
    {
      "name":"Complimenting Quinoa Lasagna",
      "steps":[
        {
          "headline":"Serve the lasagna with vegetables.",
          "description":"Add chopped fresh basil to the top of the lasagna, or fresh basil leaves on the side of the plate. Serve a tossed salad, steamed vegetables, or roasted vegetables alongside the lasagna. For example, thickly-sliced, cooked zucchini goes well with quinoa lasagna. Serve cooked spinach, or fresh spinach as a side salad. Make sweet potatoes, which go well with quinoa lasagna."
        },
        {
          "headline":"Serve complimentary beverages.",
          "description":"Red sauce goes well with a glass of red wine. If you prefer white, opt for something crisp and dry. Other options are non-alcoholic beer, or sparkling water with muddled herbs. Try a red wine from southern Italy, such as from Tuscany. Another option is a light Sicilian red wine. Try a white wine like Pinot Grigio or Verdicchio."
        },
        {
          "headline":"Serve thick, crusty bread with dipping oil on the side.",
          "description":"Combine olive oil with lemon juice, grated Parmesan cheese, and dried herbs/seasonings, to taste. For example, try 1/4 cup (60 ml) olive oil, a squirt of lemon juice, and a teaspoon (4 g) of Parmesan. Tap out a small sprinkle – 1/2 teaspoon (2 g) or less – each of dried basil, parsley, thyme, oregano, black pepper, rosemary, salt, and red pepper. Mix in 1/2 teaspoon (2 g) of minced garlic, if desired."
        }
      ]
    }
  ],
  "text":" Baking Vegetable Lasagna Chop vegetables while the oven preheats. Preheat the oven to 375 °F (191 °C). Use a large chopping knife to dice the mushrooms. Dice the onions more finely than the mushrooms. Line a greased casserole dish with veggies and quinoa. Spray the dish generously with coconut oil cooking spray. Place the spinach, mushrooms and onions into the dish. Sprinkle the uncooked quinoa on top. Mix up the marinara in a medium bowl. Combine the marinara sauce with the vegetable broth, cottage and ricotta cheese, Italian seasoning, garlic powder, sea salt and ground pepper. You can use 1% cottage cheese and full-fat ricotta cheese, or opt for whatever type you like of each. Combine the marinara with the contents of the casserole dish. Pour the marinara mixture over the veggies and quinoa. Mix all of the ingredients together with a large spoon. Ensure that the sauce mixture mostly covers the other ingredients. Bake the covered casserole for one hour. Cover the dish with tin foil. After 30 minutes, remove the lasagna and stir it. Replace the foil cover and put the dish back in the oven for another 30 minutes. At the halfway mark, it’s normal for the dish to appear a bit watery. Add the toppings and cook for two minutes. Arrange sliced tomatoes and shredded mozzarella to the top of the lasagna. Replace the tin foil. After cooking, let the dish cool for about ten minutes before serving it. Refrigerate or freeze leftovers. Store the lasagna in an air tight container. Refrigerate for up to five days. If freezing, allow the lasagna to cool completely first. Let it thaw in the refrigerator overnight before re-heating. Try a glass pyrex dish for refrigeration. Try a disposable aluminum casserole dish for freezing. Add a sheet of plastic wrap on top of the lasagna and push all of the air out before wrapping the whole dish in tin foil. Making Spinach and Chicken Lasagna Boil the quinoa in a small pot. Add rinsed and drained quinoa to a pot with 1½ cups (350 ml) of water. Bring the contents to a boil over high heat. Turn the heat to low and put a lid on the pot. Continue cooking for about fourteen minutes. Remove the pot from heat and let it sit, covered, for five minutes. Fluff the cooked quinoa with a fork. The quinoa is finished cooking when the liquid has all been absorbed. Sautee onion, garlic and mushrooms. Heat olive oil over medium heat in a large saucepan. Pour in the vegetables. Cook for five minutes, stirring occasionally, until the vegetables are tender and the onions are translucent. Cook ground chicken with the veggies. Over low to medium heat, cook the chicken for six to seven minutes in with the onion, garlic and mushroom you just sauteed. Use a spatula or wooden spoon to break up the meat as it cooks, until it is no longer pink. Add spinach, tomatoes and seasonings. Add spinach to the saucepan and cook it for two minutes, stirring continually, until the spinach leaves wilt. Mix in tomatoes, basil, salt, red pepper, oregano and sugar. Bring the mixture to a simmer and cook for about ten minutes, until the mixture thickens. Remove from heat. The mixture must be thick, not runny, for the lasagna to set properly. Combine quinoa, cheese and sauce as the oven preheats. Preheat the oven to 375 °F (191 °C). Add the quinoa, ricotta and 1/2 cup (95 g) of grated mozzarella into the sauce mixture and fold it in, then mix well. Pour the mixture into a baking dish. You can use a 9” (23 cm) x 13” (33 cm) oven-safe casserole dish. Add the topping to the lasagna. Smooth the top of the lasagna with a spatula. Sprinkle the rest of the mozzarella on top in a single layer. Pour the Parmesan and breadcrumbs on top. Bake the lasagna for 30-35 minutes. Allow it to cool for at least five minutes before you serve it. The lasagna is done when the top is bubbling and lightly browned. If you want it browner, you can put it under the boiler for about a minute at the end. Refrigerate or freeze leftovers. Store your lasagna in an air tight container. Refrigerate the lasagna for up to five days. If you want to freeze it, allow the lasagna to cool entirely first. Allow it thaw in the refrigerator overnight before re-heating. For example, you can refrigerate the lasagna in a glass pyrex dish with a lid. For instance, place the lasagna in a disposable casserole dish. Add a sheet of plastic wrap on top, then push all of the air out. Wrap the entire dish in foil, and freeze. Complimenting Quinoa Lasagna Serve the lasagna with vegetables. Add chopped fresh basil to the top of the lasagna, or fresh basil leaves on the side of the plate. Serve a tossed salad, steamed vegetables, or roasted vegetables alongside the lasagna. For example, thickly-sliced, cooked zucchini goes well with quinoa lasagna. Serve cooked spinach, or fresh spinach as a side salad. Make sweet potatoes, which go well with quinoa lasagna. Serve complimentary beverages. Red sauce goes well with a glass of red wine. If you prefer white, opt for something crisp and dry. Other options are non-alcoholic beer, or sparkling water with muddled herbs. Try a red wine from southern Italy, such as from Tuscany. Another option is a light Sicilian red wine. Try a white wine like Pinot Grigio or Verdicchio. Serve thick, crusty bread with dipping oil on the side. Combine olive oil with lemon juice, grated Parmesan cheese, and dried herbs/seasonings, to taste. For example, try 1/4 cup (60 ml) olive oil, a squirt of lemon juice, and a teaspoon (4 g) of Parmesan. Tap out a small sprinkle – 1/2 teaspoon (2 g) or less – each of dried basil, parsley, thyme, oregano, black pepper, rosemary, salt, and red pepper. Mix in 1/2 teaspoon (2 g) of minced garlic, if desired.",
  "sentences":[
    " Baking Vegetable Lasagna Chop vegetables while the oven preheats.",
    "Preheat the oven to 375 °F (191 °C).",
    "Use a large chopping knife to dice the mushrooms.",
    "Dice the onions more finely than the mushrooms.",
    "Line a greased casserole dish with veggies and quinoa.",
    "Spray the dish generously with coconut oil cooking spray.",
    "Place the spinach, mushrooms and onions into the dish.",
    "Sprinkle the uncooked quinoa on top.",
    "Mix up the marinara in a medium bowl.",
    "Combine the marinara sauce with the vegetable broth, cottage and ricotta cheese, Italian seasoning, garlic powder, sea salt and ground pepper.",
    "You can use 1% cottage cheese and full-fat ricotta cheese, or opt for whatever type you like of each.",
    "Combine the marinara with the contents of the casserole dish.",
    "Pour the marinara mixture over the veggies and quinoa.",
    "Mix all of the ingredients together with a large spoon.",
    "Ensure that the sauce mixture mostly covers the other ingredients.",
    "Bake the covered casserole for one hour.",
    "Cover the dish with tin foil.",
    "After 30 minutes, remove the lasagna and stir it.",
    "Replace the foil cover and put the dish back in the oven for another 30 minutes.",
    "At the halfway mark, it’s normal for the dish to appear a bit watery.",
    "Add the toppings and cook for two minutes.",
    "Arrange sliced tomatoes and shredded mozzarella to the top of the lasagna.",
    "Replace the tin foil.",
    "After cooking, let the dish cool for about ten minutes before serving it.",
    "Refrigerate or freeze leftovers.",
    "Store the lasagna in an air tight container.",
    "Refrigerate for up to five days.",
    "If freezing, allow the lasagna to cool completely first.",
    "Let it thaw in the refrigerator overnight before re-heating.",
    "Try a glass pyrex dish for refrigeration.",
    "Try a disposable aluminum casserole dish for freezing.",
    "Add a sheet of plastic wrap on top of the lasagna and push all of the air out before wrapping the whole dish in tin foil.",
    "Making Spinach and Chicken Lasagna Boil the quinoa in a small pot.",
    "Add rinsed and drained quinoa to a pot with 1½ cups (350 ml) of water.",
    "Bring the contents to a boil over high heat.",
    "Turn the heat to low and put a lid on the pot.",
    "Continue cooking for about fourteen minutes.",
    "Remove the pot from heat and let it sit, covered, for five minutes.",
    "Fluff the cooked quinoa with a fork.",
    "The quinoa is finished cooking when the liquid has all been absorbed.",
    "Sautee onion, garlic and mushrooms.",
    "Heat olive oil over medium heat in a large saucepan.",
    "Pour in the vegetables.",
    "Cook for five minutes, stirring occasionally, until the vegetables are tender and the onions are translucent.",
    "Cook ground chicken with the veggies.",
    "Over low to medium heat, cook the chicken for six to seven minutes in with the onion, garlic and mushroom you just sauteed.",
    "Use a spatula or wooden spoon to break up the meat as it cooks, until it is no longer pink.",
    "Add spinach, tomatoes and seasonings.",
    "Add spinach to the saucepan and cook it for two minutes, stirring continually, until the spinach leaves wilt.",
    "Mix in tomatoes, basil, salt, red pepper, oregano and sugar.",
    "Bring the mixture to a simmer and cook for about ten minutes, until the mixture thickens.",
    "Remove from heat.",
    "The mixture must be thick, not runny, for the lasagna to set properly.",
    "Combine quinoa, cheese and sauce as the oven preheats.",
    "Preheat the oven to 375 °F (191 °C).",
    "Add the quinoa, ricotta and 1/2 cup (95 g) of grated mozzarella into the sauce mixture and fold it in, then mix well.",
    "Pour the mixture into a baking dish.",
    "You can use a 9” (23 cm) x 13” (33 cm) oven-safe casserole dish.",
    "Add the topping to the lasagna.",
    "Smooth the top of the lasagna with a spatula.",
    "Sprinkle the rest of the mozzarella on top in a single layer.",
    "Pour the Parmesan and breadcrumbs on top.",
    "Bake the lasagna for 30-35 minutes.",
    "Allow it to cool for at least five minutes before you serve it.",
    "The lasagna is done when the top is bubbling and lightly browned.",
    "If you want it browner, you can put it under the boiler for about a minute at the end.",
    "Refrigerate or freeze leftovers.",
    "Store your lasagna in an air tight container.",
    "Refrigerate the lasagna for up to five days.",
    "If you want to freeze it, allow the lasagna to cool entirely first.",
    "Allow it thaw in the refrigerator overnight before re-heating.",
    "For example, you can refrigerate the lasagna in a glass pyrex dish with a lid.",
    "For instance, place the lasagna in a disposable casserole dish.",
    "Add a sheet of plastic wrap on top, then push all of the air out.",
    "Wrap the entire dish in foil, and freeze.",
    "Complimenting Quinoa Lasagna Serve the lasagna with vegetables.",
    "Add chopped fresh basil to the top of the lasagna, or fresh basil leaves on the side of the plate.",
    "Serve a tossed salad, steamed vegetables, or roasted vegetables alongside the lasagna.",
    "For example, thickly-sliced, cooked zucchini goes well with quinoa lasagna.",
    "Serve cooked spinach, or fresh spinach as a side salad.",
    "Make sweet potatoes, which go well with quinoa lasagna.",
    "Serve complimentary beverages.",
    "Red sauce goes well with a glass of red wine.",
    "If you prefer white, opt for something crisp and dry.",
    "Other options are non-alcoholic beer, or sparkling water with muddled herbs.",
    "Try a red wine from southern Italy, such as from Tuscany.",
    "Another option is a light Sicilian red wine.",
    "Try a white wine like Pinot Grigio or Verdicchio.",
    "Serve thick, crusty bread with dipping oil on the side.",
    "Combine olive oil with lemon juice, grated Parmesan cheese, and dried herbs/seasonings, to taste.",
    "For example, try 1/4 cup (60 ml) olive oil, a squirt of lemon juice, and a teaspoon (4 g) of Parmesan.",
    "Tap out a small sprinkle – 1/2 teaspoon (2 g) or less – each of dried basil, parsley, thyme, oregano, black pepper, rosemary, salt, and red pepper.",
    "Mix in 1/2 teaspoon (2 g) of minced garlic, if desired."
  ],
  "tyn_section":[
    "Vegetable Lasagna",
    "Large chopping knife",
    "Casserole dish",
    "Coconut oil cooking spray",
    "Medium bowl",
    "Large spoon",
    "Aluminum foil",
    "Airtight container",
    "Spinach and Chicken Lasagna",
    "Small lidded pot",
    "Sieve",
    "Fork",
    "Large saucepan",
    "Spatula or wooden spoon"
  ],
  "tyn_model":[
    "quinoa",
    "spinach",
    "oven",
    "mushrooms",
    "basil",
    "vegetables",
    "onions",
    "casserole dish",
    "marinara",
    "tin foil",
    "tomatoes",
    "mozzarella",
    "pot",
    "olive oil",
    "red wine",
    "ricotta",
    "foil",
    "air tight container",
    "refrigerator",
    "pyrex dish",
    "plastic wrap",
    "onion",
    "garlic",
    "chicken",
    "spatula",
    "salt",
    "red pepper",
    "oregano",
    "” (",
    "parmesan",
    "lemon juice",
    "baking vegetable lasagna",
    "large chopping knife",
    "veggies",
    "coconut oil",
    "medium bowl",
    "vegetable broth",
    "cottage and ricotta cheese",
    "italian seasoning",
    "garlic powder",
    "sea salt",
    "ground pepper",
    "cottage cheese",
    "large spoon",
    "small pot",
    "water",
    "fork",
    "large saucepan",
    "mushroom",
    "wooden spoon",
    "seasonings",
    "saucepan",
    "sugar",
    "cheese",
    "sauce",
    "baking dish",
    "oven-safe casserole dish",
    "boiler",
    "disposable casserole dish",
    "tossed salad",
    "zucchini",
    "sweet potatoes",
    "sparkling water",
    "dipping oil",
    "parmesan cheese",
    "herbs",
    "– 1/2",
    "– each",
    "parsley",
    "thyme",
    "black pepper",
    "rosemary",
    "minced garlic"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.0821917808,
    "f1":0.1379310345,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7857142857,
    "p":0.1917808219,
    "f1":0.3083083083
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7857142857,
    "p":0.2602739726,
    "f1":0.3910196445
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5714285714,
    "p":0.1369863014,
    "f1":0.2209944751
  }
}