{
  "title":"How to Make Almond Pulp Crackers",
  "url":"https://www.wikihow.com/Make-Almond-Pulp-Crackers",
  "category_hierarchy":[
    "Food and Entertaining",
    "Nuts and Seeds"
  ],
  "methods":[
    {
      "name":"Making Savory Crackers",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F (177°C).",
          "description":""
        },
        {
          "headline":"Place the almond pulp into a large mixing bowl.",
          "description":"When you make a batch of almond milk, you will usually end up with about 1 cup (225 grams) of wet almond pulp. What you have leftover is just enough for this recipe."
        },
        {
          "headline":"Add the oil, ground flax or chia seeds, salt, herbs, and minced garlic.",
          "description":"Stir everything together with a wooden spoon. You don't have to add the garlic, but it will lend the crackers a nice flavor. If you don't have any fresh herbs, use 2 teaspoons of dried herbs instead. Great herbs to use include: chives, parsley, and rosemary. You can use just one type, or you can mix-and-match."
        },
        {
          "headline":"Add some water, if needed.",
          "description":"Your pulp might be wet enough to mold. If it feels too dry, stir in some water, 1 tablespoon (15 milliliters) at a time. Keep adding water until you can press the dough between your fingers."
        },
        {
          "headline":"Roll the dough out between two sheets of parchment paper.",
          "description":"Cover your work surface with a sheet of parchment paper. Place the dough on top, then cover it with more parchment paper. Use a rolling pin to roll the dough out until it is ⅛-inch (0.32-centimeters) thick. You can roll the dough out thinner. The thinner it is, the more crispy your crackers will turn out."
        },
        {
          "headline":"Score the dough into squares.",
          "description":"Peel off the top sheet of parchment paper. Use a sharp knife or pizza cutter to cut the dough into equal-sized squares. You should have enough dough to make about 20 crackers. Don't worry about cutting the dough all the way through. You want to cut it deep enough so that you can easily break it later on, however."
        },
        {
          "headline":"Poke some holes into the center of each cracker with a fork.",
          "description":"This will help the crackers bake more evenly. You can make as many or as few holes as you want. One prick of a fork for each cracker will be enough, however."
        },
        {
          "headline":"Bake the crackers for 20 minutes.",
          "description":"Use the parchment paper to transfer the crackers onto a large baking sheet. Place the baking sheet into the oven. Let the crackers bake for 20 minutes."
        },
        {
          "headline":"Flip the crackers over and bake them for 15 to 20 more minutes.",
          "description":"Gently break apart the crackers first. Use a spatula to flip them over. Place them back into the oven for another 15 to 20 minutes. They are ready when they turn golden and crispy."
        },
        {
          "headline":"Let the crackers cool before you serve them.",
          "description":"If you have any leftovers, store them in the fridge in an airtight container."
        }
      ]
    },
    {
      "name":"Making Sweet Crackers",
      "steps":[
        {
          "headline":"Mix together the dry ingredients.",
          "description":"Place the almond pulp into a large mixing bowl. Add the rice flour, ground cinnamon, baking powder, and salt. Stir everything together, making sure to break up any large chunks. You can try using ground flax seed or chia seeds instead of rice flour."
        },
        {
          "headline":"Add in the butter and honey.",
          "description":"Continue stirring the mixture until it starts to come together. Don't worry if it looks a little crumbly at this point. If you are vegan, you can use olive oil, coconut oil, or even vegan/dairy-free butter. If you are vegan, try agave nectar or maple syrup instead of honey."
        },
        {
          "headline":"Stir in some water, if needed.",
          "description":"If the mixture is still too dry, stir in some water, 1 tablespoon (15 milliliters) at a time until it starts to stick together."
        },
        {
          "headline":"Form the dough into a disk on a sheet of parchment paper.",
          "description":"Place a sheet of parchment paper on your work surface. Set the dough on top, and form it into a disk using your hands. Use a rubber spatula to scrape everything out of the bowl, if needed."
        },
        {
          "headline":"Cover and refrigerate the dough for 20 to 30 minutes.",
          "description":"Loosely wrap the parchment paper around the dough, and secure it with a piece of tape, if needed. Place the wrapped dough into the fridge, and leave it there for 20 to 30 minutes. This allows the dough to firm up and makes it more workable. Towards the end of the chilling process, preheat your oven to 375°F (191°C)."
        },
        {
          "headline":"Roll the dough out between two sheets of parchment paper.",
          "description":"Once the dough is firm again, take it out of the fridge and set it down on the counter. Unwrap the dough, and place another sheet of parchment paper on top of it. Use a rolling pin to roll it out flat until it is 1/8-inch (0.32-centimeter) thick."
        },
        {
          "headline":"Cut the dough into squares.",
          "description":"Remove the top sheet of parchment paper first. Use a sharp knife or a pizza cutter to slice the dough into squares or rectangles. You should have enough dough to make about 20 crackers."
        },
        {
          "headline":"Use a fork to poke some holes in the crackers.",
          "description":"This will help make the crackers bake more evenly. You'll need to prick each cracker at least once. Since these crackers taste similar to graham crackers, you can make several rows of holes to make them look more like graham crackers. For something even more graham cracker like, sprinkle the tops of the crackers with a mixture of cinnamon and sugar."
        },
        {
          "headline":"Bake the crackers in a pre-heated oven at 375°F (191°C).",
          "description":"Use the parchment paper to transfer the crackers to a baking sheet. Bake them for about 10 to 15 minutes, or until the edges turn golden brown. If you want them to be crispier, you can bake them a little longer. Turn the pan around about half-way through the baking. This will help the crackers bake more evenly."
        },
        {
          "headline":"Let the crackers cool before you serve them.",
          "description":"Store any leftover crackers in an airtight container in the fridge."
        }
      ]
    }
  ],
  "text":" Making Savory Crackers Preheat your oven to 350°F (177°C).  Place the almond pulp into a large mixing bowl. When you make a batch of almond milk, you will usually end up with about 1 cup (225 grams) of wet almond pulp. What you have leftover is just enough for this recipe. Add the oil, ground flax or chia seeds, salt, herbs, and minced garlic. Stir everything together with a wooden spoon. You don't have to add the garlic, but it will lend the crackers a nice flavor. If you don't have any fresh herbs, use 2 teaspoons of dried herbs instead. Great herbs to use include: chives, parsley, and rosemary. You can use just one type, or you can mix-and-match. Add some water, if needed. Your pulp might be wet enough to mold. If it feels too dry, stir in some water, 1 tablespoon (15 milliliters) at a time. Keep adding water until you can press the dough between your fingers. Roll the dough out between two sheets of parchment paper. Cover your work surface with a sheet of parchment paper. Place the dough on top, then cover it with more parchment paper. Use a rolling pin to roll the dough out until it is ⅛-inch (0.32-centimeters) thick. You can roll the dough out thinner. The thinner it is, the more crispy your crackers will turn out. Score the dough into squares. Peel off the top sheet of parchment paper. Use a sharp knife or pizza cutter to cut the dough into equal-sized squares. You should have enough dough to make about 20 crackers. Don't worry about cutting the dough all the way through. You want to cut it deep enough so that you can easily break it later on, however. Poke some holes into the center of each cracker with a fork. This will help the crackers bake more evenly. You can make as many or as few holes as you want. One prick of a fork for each cracker will be enough, however. Bake the crackers for 20 minutes. Use the parchment paper to transfer the crackers onto a large baking sheet. Place the baking sheet into the oven. Let the crackers bake for 20 minutes. Flip the crackers over and bake them for 15 to 20 more minutes. Gently break apart the crackers first. Use a spatula to flip them over. Place them back into the oven for another 15 to 20 minutes. They are ready when they turn golden and crispy. Let the crackers cool before you serve them. If you have any leftovers, store them in the fridge in an airtight container. Making Sweet Crackers Mix together the dry ingredients. Place the almond pulp into a large mixing bowl. Add the rice flour, ground cinnamon, baking powder, and salt. Stir everything together, making sure to break up any large chunks. You can try using ground flax seed or chia seeds instead of rice flour. Add in the butter and honey. Continue stirring the mixture until it starts to come together. Don't worry if it looks a little crumbly at this point. If you are vegan, you can use olive oil, coconut oil, or even vegan/dairy-free butter. If you are vegan, try agave nectar or maple syrup instead of honey. Stir in some water, if needed. If the mixture is still too dry, stir in some water, 1 tablespoon (15 milliliters) at a time until it starts to stick together. Form the dough into a disk on a sheet of parchment paper. Place a sheet of parchment paper on your work surface. Set the dough on top, and form it into a disk using your hands. Use a rubber spatula to scrape everything out of the bowl, if needed. Cover and refrigerate the dough for 20 to 30 minutes. Loosely wrap the parchment paper around the dough, and secure it with a piece of tape, if needed. Place the wrapped dough into the fridge, and leave it there for 20 to 30 minutes. This allows the dough to firm up and makes it more workable. Towards the end of the chilling process, preheat your oven to 375°F (191°C). Roll the dough out between two sheets of parchment paper. Once the dough is firm again, take it out of the fridge and set it down on the counter. Unwrap the dough, and place another sheet of parchment paper on top of it. Use a rolling pin to roll it out flat until it is 1/8-inch (0.32-centimeter) thick. Cut the dough into squares. Remove the top sheet of parchment paper first. Use a sharp knife or a pizza cutter to slice the dough into squares or rectangles. You should have enough dough to make about 20 crackers. Use a fork to poke some holes in the crackers. This will help make the crackers bake more evenly. You'll need to prick each cracker at least once. Since these crackers taste similar to graham crackers, you can make several rows of holes to make them look more like graham crackers. For something even more graham cracker like, sprinkle the tops of the crackers with a mixture of cinnamon and sugar. Bake the crackers in a pre-heated oven at 375°F (191°C). Use the parchment paper to transfer the crackers to a baking sheet. Bake them for about 10 to 15 minutes, or until the edges turn golden brown. If you want them to be crispier, you can bake them a little longer. Turn the pan around about half-way through the baking. This will help the crackers bake more evenly. Let the crackers cool before you serve them. Store any leftover crackers in an airtight container in the fridge.",
  "sentences":[
    " Making Savory Crackers Preheat your oven to 350°F (177°C).",
    "Place the almond pulp into a large mixing bowl.",
    "When you make a batch of almond milk, you will usually end up with about 1 cup (225 grams) of wet almond pulp.",
    "What you have leftover is just enough for this recipe.",
    "Add the oil, ground flax or chia seeds, salt, herbs, and minced garlic.",
    "Stir everything together with a wooden spoon.",
    "You don't have to add the garlic, but it will lend the crackers a nice flavor.",
    "If you don't have any fresh herbs, use 2 teaspoons of dried herbs instead.",
    "Great herbs to use include: chives, parsley, and rosemary.",
    "You can use just one type, or you can mix-and-match.",
    "Add some water, if needed.",
    "Your pulp might be wet enough to mold.",
    "If it feels too dry, stir in some water, 1 tablespoon (15 milliliters) at a time.",
    "Keep adding water until you can press the dough between your fingers.",
    "Roll the dough out between two sheets of parchment paper.",
    "Cover your work surface with a sheet of parchment paper.",
    "Place the dough on top, then cover it with more parchment paper.",
    "Use a rolling pin to roll the dough out until it is ⅛-inch (0.32-centimeters) thick.",
    "You can roll the dough out thinner.",
    "The thinner it is, the more crispy your crackers will turn out.",
    "Score the dough into squares.",
    "Peel off the top sheet of parchment paper.",
    "Use a sharp knife or pizza cutter to cut the dough into equal-sized squares.",
    "You should have enough dough to make about 20 crackers.",
    "Don't worry about cutting the dough all the way through.",
    "You want to cut it deep enough so that you can easily break it later on, however.",
    "Poke some holes into the center of each cracker with a fork.",
    "This will help the crackers bake more evenly.",
    "You can make as many or as few holes as you want.",
    "One prick of a fork for each cracker will be enough, however.",
    "Bake the crackers for 20 minutes.",
    "Use the parchment paper to transfer the crackers onto a large baking sheet.",
    "Place the baking sheet into the oven.",
    "Let the crackers bake for 20 minutes.",
    "Flip the crackers over and bake them for 15 to 20 more minutes.",
    "Gently break apart the crackers first.",
    "Use a spatula to flip them over.",
    "Place them back into the oven for another 15 to 20 minutes.",
    "They are ready when they turn golden and crispy.",
    "Let the crackers cool before you serve them.",
    "If you have any leftovers, store them in the fridge in an airtight container.",
    "Making Sweet Crackers Mix together the dry ingredients.",
    "Place the almond pulp into a large mixing bowl.",
    "Add the rice flour, ground cinnamon, baking powder, and salt.",
    "Stir everything together, making sure to break up any large chunks.",
    "You can try using ground flax seed or chia seeds instead of rice flour.",
    "Add in the butter and honey.",
    "Continue stirring the mixture until it starts to come together.",
    "Don't worry if it looks a little crumbly at this point.",
    "If you are vegan, you can use olive oil, coconut oil, or even vegan/dairy-free butter.",
    "If you are vegan, try agave nectar or maple syrup instead of honey.",
    "Stir in some water, if needed.",
    "If the mixture is still too dry, stir in some water, 1 tablespoon (15 milliliters) at a time until it starts to stick together.",
    "Form the dough into a disk on a sheet of parchment paper.",
    "Place a sheet of parchment paper on your work surface.",
    "Set the dough on top, and form it into a disk using your hands.",
    "Use a rubber spatula to scrape everything out of the bowl, if needed.",
    "Cover and refrigerate the dough for 20 to 30 minutes.",
    "Loosely wrap the parchment paper around the dough, and secure it with a piece of tape, if needed.",
    "Place the wrapped dough into the fridge, and leave it there for 20 to 30 minutes.",
    "This allows the dough to firm up and makes it more workable.",
    "Towards the end of the chilling process, preheat your oven to 375°F (191°C).",
    "Roll the dough out between two sheets of parchment paper.",
    "Once the dough is firm again, take it out of the fridge and set it down on the counter.",
    "Unwrap the dough, and place another sheet of parchment paper on top of it.",
    "Use a rolling pin to roll it out flat until it is 1/8-inch (0.32-centimeter) thick.",
    "Cut the dough into squares.",
    "Remove the top sheet of parchment paper first.",
    "Use a sharp knife or a pizza cutter to slice the dough into squares or rectangles.",
    "You should have enough dough to make about 20 crackers.",
    "Use a fork to poke some holes in the crackers.",
    "This will help make the crackers bake more evenly.",
    "You'll need to prick each cracker at least once.",
    "Since these crackers taste similar to graham crackers, you can make several rows of holes to make them look more like graham crackers.",
    "For something even more graham cracker like, sprinkle the tops of the crackers with a mixture of cinnamon and sugar.",
    "Bake the crackers in a pre-heated oven at 375°F (191°C).",
    "Use the parchment paper to transfer the crackers to a baking sheet.",
    "Bake them for about 10 to 15 minutes, or until the edges turn golden brown.",
    "If you want them to be crispier, you can bake them a little longer.",
    "Turn the pan around about half-way through the baking.",
    "This will help the crackers bake more evenly.",
    "Let the crackers cool before you serve them.",
    "Store any leftover crackers in an airtight container in the fridge."
  ],
  "tyn_section":[
    "Large mixing bowl",
    "Wooden spoon",
    "Parchment paper",
    "Baking sheet",
    "Spatula",
    "Oven"
  ],
  "tyn_model":[
    "parchment paper",
    "oven",
    "water",
    "almond pulp",
    "fork",
    "baking sheet",
    "fridge",
    "large mixing bowl",
    "salt",
    "herbs",
    "garlic",
    "rolling pin",
    "crackers",
    "pizza cutter",
    "airtight container",
    "rice flour",
    "cinnamon",
    "butter",
    "honey",
    "almond milk",
    "oil",
    "wooden spoon",
    "dried herbs",
    "chives",
    "parsley",
    "rosemary",
    "spatula",
    "baking powder",
    "olive oil",
    "coconut oil",
    "agave nectar or",
    "maple syrup",
    "rubber spatula",
    "bowl",
    "tape",
    "sharp knife",
    "graham crackers",
    "sugar",
    "pan"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.1538461538,
    "f1":0.2666666667,
    "avg_pos":0.1794871795
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.1794871795,
    "f1":0.3043478261
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2307692308,
    "f1":0.375
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.1538461538,
    "f1":0.2666666667
  }
}