{
  "title":"How to Clean a Warm Mist Humidifier",
  "url":"https://www.wikihow.com/Clean-a-Warm-Mist-Humidifier",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "parts":[
    {
      "name":"Cleaning Your Humidifier’s Removable Parts",
      "steps":[
        {
          "headline":"Unplug your humidifier and let it cool.",
          "description":"Before cleaning your humidifier, be sure to unplug it from the wall. If it’s been running, let the humidifier cool down until it is completely cool to the touch."
        },
        {
          "headline":"Remove all detachable parts from your humidifier.",
          "description":"Gently remove any detachable parts of your humidifier for cleaning, so you can better access the water reservoir inside. It may be helpful to consult your owner’s manual, which usually has directions on how to take your unit apart for cleaning."
        },
        {
          "headline":"Place all removable parts in a white vinegar bath for 30 minutes.",
          "description":"Fill your sink with household white vinegar, and place the detachable parts of your humidifier in to soak. Let them sit for 30 minutes."
        },
        {
          "headline":"Wash the parts with a sponge.",
          "description":"Using a regular kitchen sponge, wipe all the components with the vinegar in the sink. Focus on any areas of mineral or mildew build up, rinsing and wringing the sponge as necessary."
        },
        {
          "headline":"Rinse the removable parts with distilled water.",
          "description":"Using distilled water, rinse the parts after soaking to remove all traces of the vinegar. Dry thoroughly with a clean towel. Set these aside."
        }
      ]
    },
    {
      "name":"Cleaning Inside Your Humidifier",
      "steps":[
        {
          "headline":"Dump out any water from the humidifier.",
          "description":"Dump out any residual misting water from the humidifier, shaking if necessary to remove as much as possible. Set the humidifier down on its base as if you were going to use it."
        },
        {
          "headline":"Fill the water reservoir with white vinegar.",
          "description":"Pour household white vinegar into the water reservoir of the humidifier, filling to within a half inch (1.5 cm) of the top. Let the vinegar sit in the humidifier for 30 minutes to kill any bacteria and loosen scum."
        },
        {
          "headline":"Use an old toothbrush to scour any areas of minerality or mildew.",
          "description":"Use a toothbrush or baby-bottle brush to scrub any gray or brown areas of mineral staining or mildew. Be sure to focus your attention on any crevices where water pools as the humidifier’s tank empties with use."
        },
        {
          "headline":"Rinse the humidifier with distilled water.",
          "description":"Dump the vinegar out of the humidifier into the sink. Fill the reservoir with distilled water and dump out two times to rinse the vinegar completely. Let the humidifier air-dry."
        },
        {
          "headline":"Reassemble the humidifier.",
          "description":"Using your owner’s manual, reassemble the humidifier with its clean component parts. The humidifier is now ready for use. Clean your humidifier every three days for optimal functioning."
        }
      ]
    },
    {
      "name":"Minimizing Risks of Warm-Mist Humidifiers",
      "steps":[
        {
          "headline":"Empty your humidifier’s tank between uses.",
          "description":"It can seem convenient to fill your humidifier full of water and run it on and off until all the water is gone. To minimize the growth of bacteria and mold however, it’s really best to dump out your humidifier between uses so stagnant water is not sitting inside the machine for long periods of time. Only use distilled water in your humidifier, as its lower mineral content will lead to less buildup inside your machine. Refill the machine with clean water each time you’d like to use it."
        },
        {
          "headline":"Keep your humidifier away from upholstery and fabric.",
          "description":"Excess humidity can cause mold to grow on upholstered surfaces, such as curtains or carpets. Run your humidifier on a heat-safe surface away from any fabric."
        },
        {
          "headline":"Use only cool-mist humidifiers for children to avoid burns.",
          "description":"Warm mist humidifiers can release mist of varying heats, from lukewarm to hot. To protect your child from possible steam burns, use only cold-mist humidifiers in children’s rooms. Supervise your child whenever they are around your warm-mist humidifier."
        }
      ]
    }
  ],
  "text":" Cleaning Your Humidifier’s Removable Parts Unplug your humidifier and let it cool. Before cleaning your humidifier, be sure to unplug it from the wall. If it’s been running, let the humidifier cool down until it is completely cool to the touch. Remove all detachable parts from your humidifier. Gently remove any detachable parts of your humidifier for cleaning, so you can better access the water reservoir inside. It may be helpful to consult your owner’s manual, which usually has directions on how to take your unit apart for cleaning. Place all removable parts in a white vinegar bath for 30 minutes. Fill your sink with household white vinegar, and place the detachable parts of your humidifier in to soak. Let them sit for 30 minutes. Wash the parts with a sponge. Using a regular kitchen sponge, wipe all the components with the vinegar in the sink. Focus on any areas of mineral or mildew build up, rinsing and wringing the sponge as necessary. Rinse the removable parts with distilled water. Using distilled water, rinse the parts after soaking to remove all traces of the vinegar. Dry thoroughly with a clean towel. Set these aside. Cleaning Inside Your Humidifier Dump out any water from the humidifier. Dump out any residual misting water from the humidifier, shaking if necessary to remove as much as possible. Set the humidifier down on its base as if you were going to use it. Fill the water reservoir with white vinegar. Pour household white vinegar into the water reservoir of the humidifier, filling to within a half inch (1.5 cm) of the top. Let the vinegar sit in the humidifier for 30 minutes to kill any bacteria and loosen scum. Use an old toothbrush to scour any areas of minerality or mildew. Use a toothbrush or baby-bottle brush to scrub any gray or brown areas of mineral staining or mildew. Be sure to focus your attention on any crevices where water pools as the humidifier’s tank empties with use. Rinse the humidifier with distilled water. Dump the vinegar out of the humidifier into the sink. Fill the reservoir with distilled water and dump out two times to rinse the vinegar completely. Let the humidifier air-dry. Reassemble the humidifier. Using your owner’s manual, reassemble the humidifier with its clean component parts. The humidifier is now ready for use. Clean your humidifier every three days for optimal functioning. Minimizing Risks of Warm-Mist Humidifiers Empty your humidifier’s tank between uses. It can seem convenient to fill your humidifier full of water and run it on and off until all the water is gone. To minimize the growth of bacteria and mold however, it’s really best to dump out your humidifier between uses so stagnant water is not sitting inside the machine for long periods of time. Only use distilled water in your humidifier, as its lower mineral content will lead to less buildup inside your machine. Refill the machine with clean water each time you’d like to use it. Keep your humidifier away from upholstery and fabric. Excess humidity can cause mold to grow on upholstered surfaces, such as curtains or carpets. Run your humidifier on a heat-safe surface away from any fabric. Use only cool-mist humidifiers for children to avoid burns. Warm mist humidifiers can release mist of varying heats, from lukewarm to hot. To protect your child from possible steam burns, use only cold-mist humidifiers in children’s rooms. Supervise your child whenever they are around your warm-mist humidifier.",
  "sentences":[
    " Cleaning Your Humidifier’s Removable Parts Unplug your humidifier and let it cool.",
    "Before cleaning your humidifier, be sure to unplug it from the wall.",
    "If it’s been running, let the humidifier cool down until it is completely cool to the touch.",
    "Remove all detachable parts from your humidifier.",
    "Gently remove any detachable parts of your humidifier for cleaning, so you can better access the water reservoir inside.",
    "It may be helpful to consult your owner’s manual, which usually has directions on how to take your unit apart for cleaning.",
    "Place all removable parts in a white vinegar bath for 30 minutes.",
    "Fill your sink with household white vinegar, and place the detachable parts of your humidifier in to soak.",
    "Let them sit for 30 minutes.",
    "Wash the parts with a sponge.",
    "Using a regular kitchen sponge, wipe all the components with the vinegar in the sink.",
    "Focus on any areas of mineral or mildew build up, rinsing and wringing the sponge as necessary.",
    "Rinse the removable parts with distilled water.",
    "Using distilled water, rinse the parts after soaking to remove all traces of the vinegar.",
    "Dry thoroughly with a clean towel.",
    "Set these aside.",
    "Cleaning Inside Your Humidifier Dump out any water from the humidifier.",
    "Dump out any residual misting water from the humidifier, shaking if necessary to remove as much as possible.",
    "Set the humidifier down on its base as if you were going to use it.",
    "Fill the water reservoir with white vinegar.",
    "Pour household white vinegar into the water reservoir of the humidifier, filling to within a half inch (1.5 cm) of the top.",
    "Let the vinegar sit in the humidifier for 30 minutes to kill any bacteria and loosen scum.",
    "Use an old toothbrush to scour any areas of minerality or mildew.",
    "Use a toothbrush or baby-bottle brush to scrub any gray or brown areas of mineral staining or mildew.",
    "Be sure to focus your attention on any crevices where water pools as the humidifier’s tank empties with use.",
    "Rinse the humidifier with distilled water.",
    "Dump the vinegar out of the humidifier into the sink.",
    "Fill the reservoir with distilled water and dump out two times to rinse the vinegar completely.",
    "Let the humidifier air-dry.",
    "Reassemble the humidifier.",
    "Using your owner’s manual, reassemble the humidifier with its clean component parts.",
    "The humidifier is now ready for use.",
    "Clean your humidifier every three days for optimal functioning.",
    "Minimizing Risks of Warm-Mist Humidifiers Empty your humidifier’s tank between uses.",
    "It can seem convenient to fill your humidifier full of water and run it on and off until all the water is gone.",
    "To minimize the growth of bacteria and mold however, it’s really best to dump out your humidifier between uses so stagnant water is not sitting inside the machine for long periods of time.",
    "Only use distilled water in your humidifier, as its lower mineral content will lead to less buildup inside your machine.",
    "Refill the machine with clean water each time you’d like to use it.",
    "Keep your humidifier away from upholstery and fabric.",
    "Excess humidity can cause mold to grow on upholstered surfaces, such as curtains or carpets.",
    "Run your humidifier on a heat-safe surface away from any fabric.",
    "Use only cool-mist humidifiers for children to avoid burns.",
    "Warm mist humidifiers can release mist of varying heats, from lukewarm to hot.",
    "To protect your child from possible steam burns, use only cold-mist humidifiers in children’s rooms.",
    "Supervise your child whenever they are around your warm-mist humidifier."
  ],
  "tyn_section":[
    "White vinegar",
    "Distilled water",
    "Toothbrush",
    "Towel"
  ],
  "tyn_model":[
    "humidifier",
    "water",
    "vinegar",
    "distilled water",
    "white vinegar",
    "sponge",
    "household white vinegar",
    "kitchen sponge",
    "water reservoir",
    "baby-bottle brush",
    "cool-mist humidifiers",
    "warm mist humidifiers",
    "cold-mist humidifiers",
    "warm-mist humidifier"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1428571429,
    "f1":0.2222222222,
    "avg_pos":0.2857142857
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.3571428571,
    "f1":0.4166666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.4285714286,
    "f1":0.4615384615
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.2142857143,
    "f1":0.3
  }
}