{
  "title":"How to Clean Copper Roof",
  "url":"https://www.wikihow.com/Clean-Copper-Roof",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "House Cleaning",
    "External House Cleaning"
  ],
  "methods":[
    {
      "name":"Taking Safety Precautions",
      "steps":[
        {
          "headline":"Wear non-slip shoes with a good tread.",
          "description":"When working on your rooftop, it's important to have the proper footwear so that you can stay steady and keep your balance. Otherwise, there's the potential to slip and injure yourself. Sneakers or boots with a deep tread are typically best for working on rooftops. There are also boots that are made specifically for those who do roofing work. These boots have a special pad on the bottom of the shoe."
        },
        {
          "headline":"Wear a safety belt or harness.",
          "description":"A harness will keep you from falling off your roof if you slip or lose your balance. Strap the harness on according to the manufacturer instructions and make sure that it's completely secured. Attach the other end of the harness to the chimney or a window on the opposite side of the house. Only leave enough slack on the chord so that you can clean the area. You can purchase a complete roof harness system at department stores or online."
        },
        {
          "headline":"Wait for a cool and sunny day to clean the roof.",
          "description":"Do not try to wash your roof if it's raining, snowing, or windy. These conditions can make you unstable while you wash it, which could be hazardous. If it's recently rained, make sure that the roof is dry before trying to stand on it. You also need to make sure that it's not overly hot outside, or the copper roof could get too hot to clean. The best day to clean a copper roof is a cool and sunny day."
        }
      ]
    },
    {
      "name":"Removing Dirt and Debris",
      "steps":[
        {
          "headline":"Brush all the leaves and debris off the roof.",
          "description":"Use a soft bristled push broom to get dirt, plant matter, and other debris off the roof. Work the broom in a pushing motion to get all loose debris off the rooftop. To prevent buildup on the roof, you can trim low-hanging branches around your house. The soft bristles on the brush will not scratch your copper."
        },
        {
          "headline":"Scrape up any bird droppings on the roof.",
          "description":"Because bird droppings contain acid, they can cause corrosion on your copper roof. Use a plastic or wooden spatula to scrape up the bird droppings. You can use a damp cotton cloth to wipe up the rest of the bird droppings after you scrape."
        },
        {
          "headline":"Rinse the roof with buckets of distilled water.",
          "description":"Use buckets of distilled water to rinse off the rest of the roof. Distilled water does not contain the minerals that could discolor the patina or harm the copper in the roof. If you don't have distilled water, you can boil water from your tap."
        },
        {
          "headline":"Dry off the roof with clean rags.",
          "description":"Work in circular motions to dry off the roof. This will prevent water streaks and marks when the water on your roof dries. Do not use rags that were washed with fabric softener because it could leave streaks on your copper roof."
        }
      ]
    },
    {
      "name":"Performing a Deep Cleaning",
      "steps":[
        {
          "headline":"Combine 5 cups (125 g) of flour and 1.5 (11.72 g) tablespoons of salt.",
          "description":"Use a 5-gallon bucket to create your deep cleaning paste. Once the dry ingredients are in the bucket, mix the them together until they are well incorporated."
        },
        {
          "headline":"Pour white vinegar into the bucket.",
          "description":"Slowly pour 30 oz. of distilled white vinegar into the bucket and combine it with the flour and salt. You can purchase distilled white vinegar from the grocery store. Vinegar is acidic and will work away any tarnish that's on your copper roof."
        },
        {
          "headline":"Mix the solution together until it forms a paste.",
          "description":"Mix the solution together in the bucket with a paint mixing stick. The consistency of the paste should resemble toothpaste when it's ready. If the paste is too thick, add more vinegar to the bucket."
        },
        {
          "headline":"Apply the paste to a portion of your copper roof.",
          "description":"Smear the paste onto your roof with a painter's brush. Make sure that you create even layers of the paste so that the roof cleans uniformly. Test a small portion of the roof with this method before you clean the entire roof to make sure that the paste doesn't have any adverse reaction to your roof."
        },
        {
          "headline":"Let the paste dry for 15 minutes.",
          "description":"As the paste dries, the acid in the vinegar will pick up some of the copper's old patina and restore the roof to it's original shiny and pink color."
        },
        {
          "headline":"Scrub the paste off with a damp cloth or sponge.",
          "description":"Work in small sections to make the cleaning manageable. When cleaning, use large circular motions to remove the rest of the dried paste from the roof."
        },
        {
          "headline":"Rinse off the roof with distilled water.",
          "description":"Fill buckets up with distilled or boiled water that's been cooled. Pour the buckets over the loosened paste so that it drains off the side of the roof."
        },
        {
          "headline":"Dry off the roof with clean cotton rags.",
          "description":"Pick up all the remaining moisture from the roof with a clean cloth. Completely drying the roof will prevent water marks."
        }
      ]
    }
  ],
  "text":" Taking Safety Precautions Wear non-slip shoes with a good tread. When working on your rooftop, it's important to have the proper footwear so that you can stay steady and keep your balance. Otherwise, there's the potential to slip and injure yourself. Sneakers or boots with a deep tread are typically best for working on rooftops. There are also boots that are made specifically for those who do roofing work. These boots have a special pad on the bottom of the shoe. Wear a safety belt or harness. A harness will keep you from falling off your roof if you slip or lose your balance. Strap the harness on according to the manufacturer instructions and make sure that it's completely secured. Attach the other end of the harness to the chimney or a window on the opposite side of the house. Only leave enough slack on the chord so that you can clean the area. You can purchase a complete roof harness system at department stores or online. Wait for a cool and sunny day to clean the roof. Do not try to wash your roof if it's raining, snowing, or windy. These conditions can make you unstable while you wash it, which could be hazardous. If it's recently rained, make sure that the roof is dry before trying to stand on it. You also need to make sure that it's not overly hot outside, or the copper roof could get too hot to clean. The best day to clean a copper roof is a cool and sunny day. Removing Dirt and Debris Brush all the leaves and debris off the roof. Use a soft bristled push broom to get dirt, plant matter, and other debris off the roof. Work the broom in a pushing motion to get all loose debris off the rooftop. To prevent buildup on the roof, you can trim low-hanging branches around your house. The soft bristles on the brush will not scratch your copper. Scrape up any bird droppings on the roof. Because bird droppings contain acid, they can cause corrosion on your copper roof. Use a plastic or wooden spatula to scrape up the bird droppings. You can use a damp cotton cloth to wipe up the rest of the bird droppings after you scrape. Rinse the roof with buckets of distilled water. Use buckets of distilled water to rinse off the rest of the roof. Distilled water does not contain the minerals that could discolor the patina or harm the copper in the roof. If you don't have distilled water, you can boil water from your tap. Dry off the roof with clean rags. Work in circular motions to dry off the roof. This will prevent water streaks and marks when the water on your roof dries. Do not use rags that were washed with fabric softener because it could leave streaks on your copper roof. Performing a Deep Cleaning Combine 5 cups (125 g) of flour and 1.5 (11.72 g) tablespoons of salt. Use a 5-gallon bucket to create your deep cleaning paste. Once the dry ingredients are in the bucket, mix the them together until they are well incorporated. Pour white vinegar into the bucket. Slowly pour 30 oz. of distilled white vinegar into the bucket and combine it with the flour and salt. You can purchase distilled white vinegar from the grocery store. Vinegar is acidic and will work away any tarnish that's on your copper roof. Mix the solution together until it forms a paste. Mix the solution together in the bucket with a paint mixing stick. The consistency of the paste should resemble toothpaste when it's ready. If the paste is too thick, add more vinegar to the bucket. Apply the paste to a portion of your copper roof. Smear the paste onto your roof with a painter's brush. Make sure that you create even layers of the paste so that the roof cleans uniformly. Test a small portion of the roof with this method before you clean the entire roof to make sure that the paste doesn't have any adverse reaction to your roof. Let the paste dry for 15 minutes. As the paste dries, the acid in the vinegar will pick up some of the copper's old patina and restore the roof to it's original shiny and pink color. Scrub the paste off with a damp cloth or sponge. Work in small sections to make the cleaning manageable. When cleaning, use large circular motions to remove the rest of the dried paste from the roof. Rinse off the roof with distilled water. Fill buckets up with distilled or boiled water that's been cooled. Pour the buckets over the loosened paste so that it drains off the side of the roof. Dry off the roof with clean cotton rags. Pick up all the remaining moisture from the roof with a clean cloth. Completely drying the roof will prevent water marks.",
  "sentences":[
    " Taking Safety Precautions Wear non-slip shoes with a good tread.",
    "When working on your rooftop, it's important to have the proper footwear so that you can stay steady and keep your balance.",
    "Otherwise, there's the potential to slip and injure yourself.",
    "Sneakers or boots with a deep tread are typically best for working on rooftops.",
    "There are also boots that are made specifically for those who do roofing work.",
    "These boots have a special pad on the bottom of the shoe.",
    "Wear a safety belt or harness.",
    "A harness will keep you from falling off your roof if you slip or lose your balance.",
    "Strap the harness on according to the manufacturer instructions and make sure that it's completely secured.",
    "Attach the other end of the harness to the chimney or a window on the opposite side of the house.",
    "Only leave enough slack on the chord so that you can clean the area.",
    "You can purchase a complete roof harness system at department stores or online.",
    "Wait for a cool and sunny day to clean the roof.",
    "Do not try to wash your roof if it's raining, snowing, or windy.",
    "These conditions can make you unstable while you wash it, which could be hazardous.",
    "If it's recently rained, make sure that the roof is dry before trying to stand on it.",
    "You also need to make sure that it's not overly hot outside, or the copper roof could get too hot to clean.",
    "The best day to clean a copper roof is a cool and sunny day.",
    "Removing Dirt and Debris Brush all the leaves and debris off the roof.",
    "Use a soft bristled push broom to get dirt, plant matter, and other debris off the roof.",
    "Work the broom in a pushing motion to get all loose debris off the rooftop.",
    "To prevent buildup on the roof, you can trim low-hanging branches around your house.",
    "The soft bristles on the brush will not scratch your copper.",
    "Scrape up any bird droppings on the roof.",
    "Because bird droppings contain acid, they can cause corrosion on your copper roof.",
    "Use a plastic or wooden spatula to scrape up the bird droppings.",
    "You can use a damp cotton cloth to wipe up the rest of the bird droppings after you scrape.",
    "Rinse the roof with buckets of distilled water.",
    "Use buckets of distilled water to rinse off the rest of the roof.",
    "Distilled water does not contain the minerals that could discolor the patina or harm the copper in the roof.",
    "If you don't have distilled water, you can boil water from your tap.",
    "Dry off the roof with clean rags.",
    "Work in circular motions to dry off the roof.",
    "This will prevent water streaks and marks when the water on your roof dries.",
    "Do not use rags that were washed with fabric softener because it could leave streaks on your copper roof.",
    "Performing a Deep Cleaning Combine 5 cups (125 g) of flour and 1.5 (11.72 g) tablespoons of salt.",
    "Use a 5-gallon bucket to create your deep cleaning paste.",
    "Once the dry ingredients are in the bucket, mix the them together until they are well incorporated.",
    "Pour white vinegar into the bucket.",
    "Slowly pour 30 oz.",
    "of distilled white vinegar into the bucket and combine it with the flour and salt.",
    "You can purchase distilled white vinegar from the grocery store.",
    "Vinegar is acidic and will work away any tarnish that's on your copper roof.",
    "Mix the solution together until it forms a paste.",
    "Mix the solution together in the bucket with a paint mixing stick.",
    "The consistency of the paste should resemble toothpaste when it's ready.",
    "If the paste is too thick, add more vinegar to the bucket.",
    "Apply the paste to a portion of your copper roof.",
    "Smear the paste onto your roof with a painter's brush.",
    "Make sure that you create even layers of the paste so that the roof cleans uniformly.",
    "Test a small portion of the roof with this method before you clean the entire roof to make sure that the paste doesn't have any adverse reaction to your roof.",
    "Let the paste dry for 15 minutes.",
    "As the paste dries, the acid in the vinegar will pick up some of the copper's old patina and restore the roof to it's original shiny and pink color.",
    "Scrub the paste off with a damp cloth or sponge.",
    "Work in small sections to make the cleaning manageable.",
    "When cleaning, use large circular motions to remove the rest of the dried paste from the roof.",
    "Rinse off the roof with distilled water.",
    "Fill buckets up with distilled or boiled water that's been cooled.",
    "Pour the buckets over the loosened paste so that it drains off the side of the roof.",
    "Dry off the roof with clean cotton rags.",
    "Pick up all the remaining moisture from the roof with a clean cloth.",
    "Completely drying the roof will prevent water marks."
  ],
  "tyn_section":[
    "Non-slip shoes",
    "Safety belt or harness",
    "Soft bristled push broom",
    "Distilled water",
    "Cotton rags or cloths",
    "Flour",
    "Salt",
    "Vinegar",
    "Paint brush",
    "Bucket"
  ],
  "tyn_model":[
    "distilled water",
    "water",
    "bucket",
    "buckets",
    "boots",
    "vinegar",
    "harness",
    "rags",
    "flour",
    "salt",
    "distilled white vinegar",
    "footwear",
    "sneakers",
    "safety belt",
    "roof harness",
    "push broom",
    "broom",
    "spatula",
    "fabric softener because it",
    "5-gallon bucket",
    "deep cleaning paste",
    "white vinegar",
    "paint mixing stick",
    "painter's brush",
    "damp cloth",
    "sponge"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1923076923,
    "f1":0.2777777778,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7,
    "p":0.3846153846,
    "f1":0.4964539007
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.4615384615,
    "f1":0.5853658537
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1923076923,
    "f1":0.2777777778
  }
}