{
  "title":"How to Clean Makeup Brushes with Alcohol",
  "url":"https://www.wikihow.com/Clean-Makeup-Brushes-with-Alcohol",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Dipping Brushes into Alcohol",
      "steps":[
        {
          "headline":"Pour alcohol into a shallow bowl.",
          "description":"Simply pour a small amount of alcohol into a shallow dish. You want to make sure the bowl is not too deep because you do not want to dip the entire brush into the alcohol."
        },
        {
          "headline":"Swish the brush around.",
          "description":"Only dip the bristles into the alcohol and make sure that the barrel of the brush does not get wet. You will notice makeup coming off the brush and the alcohol will likely change colour. Continue to swirl the brush around for approximately 10 to 20 seconds.While you don't want to dip the entire brush into the alcohol, it's a good idea to occasionally swab the base of the brush with alcohol to remove debris and oil buildup."
        },
        {
          "headline":"Wipe the bristles on a towel.",
          "description":"Remove the bristles from the alcohol and wipe them on a clean towel. Avoid using a towel that is nice and/or new, as the makeup will likely leave a mark on the towel as it is removed from the brush. Consider setting aside an old towel to use each time you clean your makeup brushes."
        },
        {
          "headline":"Repeat until the alcohol is clear.",
          "description":"Dump the used alcohol down the drain and then refill the dish with more alcohol. Dip the brush back into the alcohol and swirl around. Then, pat it dry on the towel. Continue this process until no more makeup comes off the brush in the alcohol solution. This indicates that the brush is clean."
        },
        {
          "headline":"Squeeze and reshape the brushes.",
          "description":"Once your brushes are clean, you should squeeze out excess alcohol from the brushes. This will help speed up the drying process. It is also important to reshape the bristles after cleaning. This can help keep your brushes in good condition. Use a comb or your fingers to comb the bristles into place. For example, the bristles may splay out from being rubbed on the towel. Use a comb or your fingers to collect all the bristles together and ensure they are all facing in the same direction."
        },
        {
          "headline":"Lay flat to dry.",
          "description":"After you have wiped the brush off on the towel, lay it flat to dry. Small brushes will dry very quickly, but larger brushes may take one or more hours to completely dry."
        }
      ]
    },
    {
      "name":"Spraying Brushes with Alcohol",
      "steps":[
        {
          "headline":"Pour alcohol into a small spray bottle.",
          "description":"Fill a small spray bottle, which can be purchased at your local drug store, with rubbing alcohol."
        },
        {
          "headline":"Spray the bristles with alcohol.",
          "description":"Lay your makeup brushes on a towel and spray the bristles with alcohol. You want to make sure that the bristles are completely saturated. In order to do this, you will need to flip the brushes over so that you can spray both sides of the brush."
        },
        {
          "headline":"Wipe the brush on a towel.",
          "description":"Once the brushes are saturated, wipe the bristles back and forth on a towel. You will notice makeup coming off of the brushes and onto the towel."
        },
        {
          "headline":"Repeat until clean.",
          "description":"Spray the brushes again with alcohol and then wipe them off on the towel. Continue to repeat the process until makeup no longer comes off of the brushes. This means that you have adequately removed all of the makeup and oils from your brushes."
        },
        {
          "headline":"Squeeze the brushes.",
          "description":"Once your makeup brushes are clean, squeeze out any remaining alcohol from the brushes using a towel. This will help to speed up the drying process."
        },
        {
          "headline":"Let the brush dry.",
          "description":"After squeezing the bristles, reshape them and then lay them on a countertop to dry. Do not use your makeup brushes until they are completely dry. Makeup could stick onto the brushes or it could cause your makeup to clump."
        }
      ]
    },
    {
      "name":"Cleaning the Handles with Alcohol",
      "steps":[
        {
          "headline":"Dip a paper towel or cloth into alcohol.",
          "description":"It is also a good idea to sanitize and disinfect the handles of your makeup brushes. Although you should always wash your hands immediately before applying makeup, the handles may begin to develop a layer of oil and bacteria from your hands. Dip a paper towel or cloth into a small dish of rubbing alcohol."
        },
        {
          "headline":"Wipe the handles with alcohol.",
          "description":"Squeeze out any excess alcohol to ensure that it does not drip into the barrel of the brush. Then, wipe the handle with the towel to disinfect it."
        },
        {
          "headline":"Lay flat to dry.",
          "description":"Once you have finished wiping down the handle, lay the brush on a flat surface to dry. Rubbing alcohol dries very quickly, so it should not take longer than 15 minutes to completely dry."
        }
      ]
    }
  ],
  "text":" Dipping Brushes into Alcohol Pour alcohol into a shallow bowl. Simply pour a small amount of alcohol into a shallow dish. You want to make sure the bowl is not too deep because you do not want to dip the entire brush into the alcohol. Swish the brush around. Only dip the bristles into the alcohol and make sure that the barrel of the brush does not get wet. You will notice makeup coming off the brush and the alcohol will likely change colour. Continue to swirl the brush around for approximately 10 to 20 seconds.While you don't want to dip the entire brush into the alcohol, it's a good idea to occasionally swab the base of the brush with alcohol to remove debris and oil buildup. Wipe the bristles on a towel. Remove the bristles from the alcohol and wipe them on a clean towel. Avoid using a towel that is nice and/or new, as the makeup will likely leave a mark on the towel as it is removed from the brush. Consider setting aside an old towel to use each time you clean your makeup brushes. Repeat until the alcohol is clear. Dump the used alcohol down the drain and then refill the dish with more alcohol. Dip the brush back into the alcohol and swirl around. Then, pat it dry on the towel. Continue this process until no more makeup comes off the brush in the alcohol solution. This indicates that the brush is clean. Squeeze and reshape the brushes. Once your brushes are clean, you should squeeze out excess alcohol from the brushes. This will help speed up the drying process. It is also important to reshape the bristles after cleaning. This can help keep your brushes in good condition. Use a comb or your fingers to comb the bristles into place. For example, the bristles may splay out from being rubbed on the towel. Use a comb or your fingers to collect all the bristles together and ensure they are all facing in the same direction. Lay flat to dry. After you have wiped the brush off on the towel, lay it flat to dry. Small brushes will dry very quickly, but larger brushes may take one or more hours to completely dry. Spraying Brushes with Alcohol Pour alcohol into a small spray bottle. Fill a small spray bottle, which can be purchased at your local drug store, with rubbing alcohol. Spray the bristles with alcohol. Lay your makeup brushes on a towel and spray the bristles with alcohol. You want to make sure that the bristles are completely saturated. In order to do this, you will need to flip the brushes over so that you can spray both sides of the brush. Wipe the brush on a towel. Once the brushes are saturated, wipe the bristles back and forth on a towel. You will notice makeup coming off of the brushes and onto the towel. Repeat until clean. Spray the brushes again with alcohol and then wipe them off on the towel. Continue to repeat the process until makeup no longer comes off of the brushes. This means that you have adequately removed all of the makeup and oils from your brushes. Squeeze the brushes. Once your makeup brushes are clean, squeeze out any remaining alcohol from the brushes using a towel. This will help to speed up the drying process. Let the brush dry. After squeezing the bristles, reshape them and then lay them on a countertop to dry. Do not use your makeup brushes until they are completely dry. Makeup could stick onto the brushes or it could cause your makeup to clump. Cleaning the Handles with Alcohol Dip a paper towel or cloth into alcohol. It is also a good idea to sanitize and disinfect the handles of your makeup brushes. Although you should always wash your hands immediately before applying makeup, the handles may begin to develop a layer of oil and bacteria from your hands. Dip a paper towel or cloth into a small dish of rubbing alcohol. Wipe the handles with alcohol. Squeeze out any excess alcohol to ensure that it does not drip into the barrel of the brush. Then, wipe the handle with the towel to disinfect it. Lay flat to dry. Once you have finished wiping down the handle, lay the brush on a flat surface to dry. Rubbing alcohol dries very quickly, so it should not take longer than 15 minutes to completely dry.",
  "sentences":[
    " Dipping Brushes into Alcohol Pour alcohol into a shallow bowl.",
    "Simply pour a small amount of alcohol into a shallow dish.",
    "You want to make sure the bowl is not too deep because you do not want to dip the entire brush into the alcohol.",
    "Swish the brush around.",
    "Only dip the bristles into the alcohol and make sure that the barrel of the brush does not get wet.",
    "You will notice makeup coming off the brush and the alcohol will likely change colour.",
    "Continue to swirl the brush around for approximately 10 to 20 seconds.While you don't want to dip the entire brush into the alcohol, it's a good idea to occasionally swab the base of the brush with alcohol to remove debris and oil buildup.",
    "Wipe the bristles on a towel.",
    "Remove the bristles from the alcohol and wipe them on a clean towel.",
    "Avoid using a towel that is nice and/or new, as the makeup will likely leave a mark on the towel as it is removed from the brush.",
    "Consider setting aside an old towel to use each time you clean your makeup brushes.",
    "Repeat until the alcohol is clear.",
    "Dump the used alcohol down the drain and then refill the dish with more alcohol.",
    "Dip the brush back into the alcohol and swirl around.",
    "Then, pat it dry on the towel.",
    "Continue this process until no more makeup comes off the brush in the alcohol solution.",
    "This indicates that the brush is clean.",
    "Squeeze and reshape the brushes.",
    "Once your brushes are clean, you should squeeze out excess alcohol from the brushes.",
    "This will help speed up the drying process.",
    "It is also important to reshape the bristles after cleaning.",
    "This can help keep your brushes in good condition.",
    "Use a comb or your fingers to comb the bristles into place.",
    "For example, the bristles may splay out from being rubbed on the towel.",
    "Use a comb or your fingers to collect all the bristles together and ensure they are all facing in the same direction.",
    "Lay flat to dry.",
    "After you have wiped the brush off on the towel, lay it flat to dry.",
    "Small brushes will dry very quickly, but larger brushes may take one or more hours to completely dry.",
    "Spraying Brushes with Alcohol Pour alcohol into a small spray bottle.",
    "Fill a small spray bottle, which can be purchased at your local drug store, with rubbing alcohol.",
    "Spray the bristles with alcohol.",
    "Lay your makeup brushes on a towel and spray the bristles with alcohol.",
    "You want to make sure that the bristles are completely saturated.",
    "In order to do this, you will need to flip the brushes over so that you can spray both sides of the brush.",
    "Wipe the brush on a towel.",
    "Once the brushes are saturated, wipe the bristles back and forth on a towel.",
    "You will notice makeup coming off of the brushes and onto the towel.",
    "Repeat until clean.",
    "Spray the brushes again with alcohol and then wipe them off on the towel.",
    "Continue to repeat the process until makeup no longer comes off of the brushes.",
    "This means that you have adequately removed all of the makeup and oils from your brushes.",
    "Squeeze the brushes.",
    "Once your makeup brushes are clean, squeeze out any remaining alcohol from the brushes using a towel.",
    "This will help to speed up the drying process.",
    "Let the brush dry.",
    "After squeezing the bristles, reshape them and then lay them on a countertop to dry.",
    "Do not use your makeup brushes until they are completely dry.",
    "Makeup could stick onto the brushes or it could cause your makeup to clump.",
    "Cleaning the Handles with Alcohol Dip a paper towel or cloth into alcohol.",
    "It is also a good idea to sanitize and disinfect the handles of your makeup brushes.",
    "Although you should always wash your hands immediately before applying makeup, the handles may begin to develop a layer of oil and bacteria from your hands.",
    "Dip a paper towel or cloth into a small dish of rubbing alcohol.",
    "Wipe the handles with alcohol.",
    "Squeeze out any excess alcohol to ensure that it does not drip into the barrel of the brush.",
    "Then, wipe the handle with the towel to disinfect it.",
    "Lay flat to dry.",
    "Once you have finished wiping down the handle, lay the brush on a flat surface to dry.",
    "Rubbing alcohol dries very quickly, so it should not take longer than 15 minutes to completely dry."
  ],
  "tyn_section":[
    "99% rubbing alcohol",
    "Small dish",
    "Towel",
    "Spray bottle"
  ],
  "tyn_model":[
    "alcohol",
    "towel",
    "makeup brushes",
    "rubbing alcohol",
    "bowl",
    "comb",
    "spray bottle",
    "paper towel",
    "shallow dish",
    "dish"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.2,
    "f1":0.2857142857,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.5,
    "f1":0.6666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.7,
    "f1":0.8235294118
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.3,
    "f1":0.4285714286
  }
}