{
  "title":"How to Prepare Shaved Asparagus",
  "url":"https://www.wikihow.com/Prepare-Shaved-Asparagus",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "parts":[
    {
      "name":"Shaving the Asparagus",
      "steps":[
        {
          "headline":"Trim the tips from the asparagus.",
          "description":"You can shave as many asparagus spears as you’d like, but 10 to 12 spears typically makes 4 servings. Place the spears flat on a cutting board, and use a sharp knife to remove the woody tips. Discard the ends. Make sure the asparagus is clean by rinsing the spears under cool water at the sink to remove any dirt. Dry them by rolling them between two kitchen towels."
        },
        {
          "headline":"Peel the stalks into long strips.",
          "description":"To shave the asparagus, take 1 spear at a time and use a vegetable peeler to create long, thin shavings. Gather the shavings in a medium bowl, and continue working until you’ve shaved all of the spears. A swivel-blade vegetable peeler works best for shaving the asparagus. If the asparagus slips or moves while you peel it, shave one side completely to create a flat surface and place it with the flat side down to steady it."
        },
        {
          "headline":"Cut the final layer of the stalks into thin strips.",
          "description":"In many cases, you’ll be able to shave the entire spear with the vegetable peeler. However, if you find that the final layer of the stalk is too hard to peel, use a sharp knife to cut it into thin strips. Don’t worry if the strips you cut aren’t as thin as the shavings. They’ll blend in just fine."
        }
      ]
    },
    {
      "name":"Making the Vinaigrette",
      "steps":[
        {
          "headline":"Mix the cheese and lemon juice.",
          "description":"Add ¼ cup (25 g) of finely grated Parmesan cheese and 1 ½ tablespoons (22 ½ ml) of fresh lemon juice to a small bowl. Stir the two together until they’re completely blended. You can substitute grated Pecorino Romano, Grana Padano, or Asiago cheese for the Parmesan if you prefer."
        },
        {
          "headline":"Whisk in the oil and season the mixture.",
          "description":"When the grated cheese and lemon juice are combined, gradually pour ¼ cup (59 ml) of extra virgin olive oil. Slowly whisk the oil into the cheese mixture until it’s fully blended in. Next, add some kosher salt and freshly ground black pepper to season it. Be sure to taste the dressing as you add the salt and pepper, so you don’t overseason it."
        },
        {
          "headline":"Toss the shaved asparagus with the dressing.",
          "description":"Once the dressing is fully mixed and seasoned, add the shaved asparagus to the bowl. Carefully toss the shavings with the vinaigrette until they are fully coated."
        },
        {
          "headline":"Shave some more Parmesan over the asparagus before serving.",
          "description":"When the shavings are coated with the dressing, divide them between four plates. Use the vegetable peeler to shave a little more of the Parmesan cheese over the shaved asparagus and serve as a first course. If you like, you can spoon some of the vinaigrette that’s left in the bowl after you plate the asparagus over the shavings for more flavor."
        }
      ]
    },
    {
      "name":"Making Other Dishes with Shaved Asparagus",
      "steps":[
        {
          "headline":"Add the shaved asparagus to a salad.",
          "description":"While the asparagus shavings make a delicious salad on their own, you can also mix them into whatever salad you like. They pair especially well with avocado and mint for a tasty summer salad. Shaved asparagus also mixes well with grain salads, such as barley, quinoa, farro, or tabbouleh."
        },
        {
          "headline":"Top pizza or focaccia with shaved asparagus.",
          "description":"Shaved asparagus makes a tasty, unique topping for pizza. Add it to the dough on top of the sauce and then cover with cheese before baking it in the oven. You can also use the shaved asparagus to replace lettuce or other greens on a focaccia. Shaved asparagus is also makes a tasty replacement for lettuce or other greens on a sandwich. You can also use asparagus as a topping for simple toast. Spread a little ricotta or mashed avocado on the toasted bread, and add a few curls of asparagus to finish it off."
        },
        {
          "headline":"Mix the shaved asparagus into pasta.",
          "description":"Because shaved asparagus has a similar shape and size to fettucine, it’s an ideal mix-in for pasta dishes. Mix it into a simple fettuccine alfredo or carbonara to give it some delicious spring flavor. Asparagus shavings don’t just work with cream pasta sauces. Mix it into your favorite tomato-based pasta, garlic and oil recipe, or other pasta dishes."
        },
        {
          "headline":"Combine the shaved asparagus with eggs.",
          "description":"If you want to dress up your usual breakfast of scrambled eggs or an omelet, add some shaved asparagus to the eggs. It pairs especially well with goat cheese and grated Fontina, so you can have creamy, delicious eggs with the earthy flavor of the asparagus. Adding asparagus ribbons to scrambled eggs or omelets is an especially tasty option if you’re preparing them for brunch or dinner."
        }
      ]
    }
  ],
  "text":" Shaving the Asparagus Trim the tips from the asparagus. You can shave as many asparagus spears as you’d like, but 10 to 12 spears typically makes 4 servings. Place the spears flat on a cutting board, and use a sharp knife to remove the woody tips. Discard the ends. Make sure the asparagus is clean by rinsing the spears under cool water at the sink to remove any dirt. Dry them by rolling them between two kitchen towels. Peel the stalks into long strips. To shave the asparagus, take 1 spear at a time and use a vegetable peeler to create long, thin shavings. Gather the shavings in a medium bowl, and continue working until you’ve shaved all of the spears. A swivel-blade vegetable peeler works best for shaving the asparagus. If the asparagus slips or moves while you peel it, shave one side completely to create a flat surface and place it with the flat side down to steady it. Cut the final layer of the stalks into thin strips. In many cases, you’ll be able to shave the entire spear with the vegetable peeler. However, if you find that the final layer of the stalk is too hard to peel, use a sharp knife to cut it into thin strips. Don’t worry if the strips you cut aren’t as thin as the shavings. They’ll blend in just fine. Making the Vinaigrette Mix the cheese and lemon juice. Add ¼ cup (25 g) of finely grated Parmesan cheese and 1 ½ tablespoons (22 ½ ml) of fresh lemon juice to a small bowl. Stir the two together until they’re completely blended. You can substitute grated Pecorino Romano, Grana Padano, or Asiago cheese for the Parmesan if you prefer. Whisk in the oil and season the mixture. When the grated cheese and lemon juice are combined, gradually pour ¼ cup (59 ml) of extra virgin olive oil. Slowly whisk the oil into the cheese mixture until it’s fully blended in. Next, add some kosher salt and freshly ground black pepper to season it. Be sure to taste the dressing as you add the salt and pepper, so you don’t overseason it. Toss the shaved asparagus with the dressing. Once the dressing is fully mixed and seasoned, add the shaved asparagus to the bowl. Carefully toss the shavings with the vinaigrette until they are fully coated. Shave some more Parmesan over the asparagus before serving. When the shavings are coated with the dressing, divide them between four plates. Use the vegetable peeler to shave a little more of the Parmesan cheese over the shaved asparagus and serve as a first course. If you like, you can spoon some of the vinaigrette that’s left in the bowl after you plate the asparagus over the shavings for more flavor. Making Other Dishes with Shaved Asparagus Add the shaved asparagus to a salad. While the asparagus shavings make a delicious salad on their own, you can also mix them into whatever salad you like. They pair especially well with avocado and mint for a tasty summer salad. Shaved asparagus also mixes well with grain salads, such as barley, quinoa, farro, or tabbouleh. Top pizza or focaccia with shaved asparagus. Shaved asparagus makes a tasty, unique topping for pizza. Add it to the dough on top of the sauce and then cover with cheese before baking it in the oven. You can also use the shaved asparagus to replace lettuce or other greens on a focaccia. Shaved asparagus is also makes a tasty replacement for lettuce or other greens on a sandwich. You can also use asparagus as a topping for simple toast. Spread a little ricotta or mashed avocado on the toasted bread, and add a few curls of asparagus to finish it off. Mix the shaved asparagus into pasta. Because shaved asparagus has a similar shape and size to fettucine, it’s an ideal mix-in for pasta dishes. Mix it into a simple fettuccine alfredo or carbonara to give it some delicious spring flavor. Asparagus shavings don’t just work with cream pasta sauces. Mix it into your favorite tomato-based pasta, garlic and oil recipe, or other pasta dishes. Combine the shaved asparagus with eggs. If you want to dress up your usual breakfast of scrambled eggs or an omelet, add some shaved asparagus to the eggs. It pairs especially well with goat cheese and grated Fontina, so you can have creamy, delicious eggs with the earthy flavor of the asparagus. Adding asparagus ribbons to scrambled eggs or omelets is an especially tasty option if you’re preparing them for brunch or dinner.",
  "sentences":[
    " Shaving the Asparagus Trim the tips from the asparagus.",
    "You can shave as many asparagus spears as you’d like, but 10 to 12 spears typically makes 4 servings.",
    "Place the spears flat on a cutting board, and use a sharp knife to remove the woody tips.",
    "Discard the ends.",
    "Make sure the asparagus is clean by rinsing the spears under cool water at the sink to remove any dirt.",
    "Dry them by rolling them between two kitchen towels.",
    "Peel the stalks into long strips.",
    "To shave the asparagus, take 1 spear at a time and use a vegetable peeler to create long, thin shavings.",
    "Gather the shavings in a medium bowl, and continue working until you’ve shaved all of the spears.",
    "A swivel-blade vegetable peeler works best for shaving the asparagus.",
    "If the asparagus slips or moves while you peel it, shave one side completely to create a flat surface and place it with the flat side down to steady it.",
    "Cut the final layer of the stalks into thin strips.",
    "In many cases, you’ll be able to shave the entire spear with the vegetable peeler.",
    "However, if you find that the final layer of the stalk is too hard to peel, use a sharp knife to cut it into thin strips.",
    "Don’t worry if the strips you cut aren’t as thin as the shavings.",
    "They’ll blend in just fine.",
    "Making the Vinaigrette Mix the cheese and lemon juice.",
    "Add ¼ cup (25 g) of finely grated Parmesan cheese and 1 ½ tablespoons (22 ½ ml) of fresh lemon juice to a small bowl.",
    "Stir the two together until they’re completely blended.",
    "You can substitute grated Pecorino Romano, Grana Padano, or Asiago cheese for the Parmesan if you prefer.",
    "Whisk in the oil and season the mixture.",
    "When the grated cheese and lemon juice are combined, gradually pour ¼ cup (59 ml) of extra virgin olive oil.",
    "Slowly whisk the oil into the cheese mixture until it’s fully blended in.",
    "Next, add some kosher salt and freshly ground black pepper to season it.",
    "Be sure to taste the dressing as you add the salt and pepper, so you don’t overseason it.",
    "Toss the shaved asparagus with the dressing.",
    "Once the dressing is fully mixed and seasoned, add the shaved asparagus to the bowl.",
    "Carefully toss the shavings with the vinaigrette until they are fully coated.",
    "Shave some more Parmesan over the asparagus before serving.",
    "When the shavings are coated with the dressing, divide them between four plates.",
    "Use the vegetable peeler to shave a little more of the Parmesan cheese over the shaved asparagus and serve as a first course.",
    "If you like, you can spoon some of the vinaigrette that’s left in the bowl after you plate the asparagus over the shavings for more flavor.",
    "Making Other Dishes with Shaved Asparagus Add the shaved asparagus to a salad.",
    "While the asparagus shavings make a delicious salad on their own, you can also mix them into whatever salad you like.",
    "They pair especially well with avocado and mint for a tasty summer salad.",
    "Shaved asparagus also mixes well with grain salads, such as barley, quinoa, farro, or tabbouleh.",
    "Top pizza or focaccia with shaved asparagus.",
    "Shaved asparagus makes a tasty, unique topping for pizza.",
    "Add it to the dough on top of the sauce and then cover with cheese before baking it in the oven.",
    "You can also use the shaved asparagus to replace lettuce or other greens on a focaccia.",
    "Shaved asparagus is also makes a tasty replacement for lettuce or other greens on a sandwich.",
    "You can also use asparagus as a topping for simple toast.",
    "Spread a little ricotta or mashed avocado on the toasted bread, and add a few curls of asparagus to finish it off.",
    "Mix the shaved asparagus into pasta.",
    "Because shaved asparagus has a similar shape and size to fettucine, it’s an ideal mix-in for pasta dishes.",
    "Mix it into a simple fettuccine alfredo or carbonara to give it some delicious spring flavor.",
    "Asparagus shavings don’t just work with cream pasta sauces.",
    "Mix it into your favorite tomato-based pasta, garlic and oil recipe, or other pasta dishes.",
    "Combine the shaved asparagus with eggs.",
    "If you want to dress up your usual breakfast of scrambled eggs or an omelet, add some shaved asparagus to the eggs.",
    "It pairs especially well with goat cheese and grated Fontina, so you can have creamy, delicious eggs with the earthy flavor of the asparagus.",
    "Adding asparagus ribbons to scrambled eggs or omelets is an especially tasty option if you’re preparing them for brunch or dinner."
  ],
  "tyn_section":[
    "Sharp knife",
    "Swivel-blade vegetable peeler",
    "Medium bowl",
    "Small bowl",
    "Whisk",
    "Spatula"
  ],
  "tyn_model":[
    "asparagus",
    "vegetable peeler",
    "eggs",
    "parmesan cheese",
    "oil",
    "bowl",
    "avocado",
    "scrambled eggs",
    "asparagus spears",
    "cutting board",
    "sharp knife",
    "water",
    "kitchen towels",
    "swivel-blade",
    "knife",
    "lemon",
    "fresh lemon",
    "small bowl",
    "pecorino romano",
    "asiago cheese",
    "lemon juice",
    "extra virgin olive oil",
    "kosher salt",
    "freshly ground black pepper",
    "salt",
    "pepper",
    "vinaigrette",
    "parmesan",
    "plates",
    "mint",
    "barley",
    "quinoa",
    "pizza",
    "cheese",
    "oven",
    "ricotta",
    "pasta",
    "fettucine",
    "asparagus shavings",
    "garlic",
    "goat cheese"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.0487804878,
    "f1":0.085106383,
    "avg_pos":0.243902439
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.1219512195,
    "f1":0.206185567
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.1463414634,
    "f1":0.24
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.0731707317,
    "f1":0.1276595745
  }
}