{
  "title":"How to Make Paint Can Planters",
  "url":"https://www.wikihow.com/Make-Paint-Can-Planters",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "parts":[
    {
      "name":"Readying the Paint Can",
      "steps":[
        {
          "headline":"Remove any old paint from the can.",
          "description":"To make the planter, you can use a new or recycled metal paint can. If you are using a used can, you must remove any dried paint inside the container. Use a paint scraper tool to carefully scrape the paint away and discard appropriately. You can use any size paint can that you like for your planter. You can purchase new, unused paint cans at your local hardware store or home improvement center. If there is still wet paint inside the can, be sure to follow your local municipal guidelines for proper disposal. If there is any dried paint on the outside of the can, scrape it away as well."
        },
        {
          "headline":"Wash and dry the can.",
          "description":"Whether you are using a new or recycled paint can for the planter, you must wash it first. Use soap and water to thoroughly clean the interior, and dry it well with a clean rag. Liquid dish washing soap works well to clean the paint can."
        },
        {
          "headline":"Remove the label.",
          "description":"If you are using a recycled paint can, you should remove the label from the exterior. Peel or scrape it off, and use an adhesive remover product to get rid of any residue on the outside of the can."
        },
        {
          "headline":"Use a nail to create a few drainage holes in the can’s bottom.",
          "description":"When the paint can is completely clean and dry, turn it over so you can easily reach the bottom. Set a nail against the center of the can and use a hammer to strike it and create a drainage hole. Repeat the process until you have at least 3 or 4 holes to allow drainage."
        }
      ]
    },
    {
      "name":"Painting the Planter",
      "steps":[
        {
          "headline":"Spray paint the can.",
          "description":"Once you’ve cleaned and punctured the paint can, choose a spray paint shade to serve as the planter’s base color. Carefully spray the exterior of the can with the paint to cover it an even coat. Allow it to dry thoroughly for at least 5 to 6 hours. Don’t worry about getting any paint inside the can. It will be hidden when you add the potting soil and plants. If you are using a recycled paint can and there is any rust on the exterior, use a piece of medium grit sandpaper to buff it away before spray painting it."
        },
        {
          "headline":"Paint the can freehand.",
          "description":"If you aren’t comfortable using spray paint on the can’s exterior, you can use traditional paint and apply it with a brush. For a metal paint can, an oil-based paint is your best option. After you’ve painted the can, allow it to dry for at least 24 hours. Latex and acrylic paint can also work on the exterior of the paint can."
        },
        {
          "headline":"Use stencils to embellish the planter.",
          "description":"After the base coat of paint on the can has dried completely, you can decorate the planter further. Use stencils to add a design with fun shapes, such as flowers, stars, hearts, or polka dots, in other paint colors. Allow the painted design to dry for at least 24 hours before adding soil to the planter. It’s best to use the same type of paint for the stenciled design that you used for the base color. If you don’t want to bother with stencils, you can wrap painter’s tape around the can to create stripes on the planter."
        }
      ]
    },
    {
      "name":"Using Fabric to Decorate the Planter",
      "steps":[
        {
          "headline":"Measure the circumference and height of the can.",
          "description":"To figure out the proper amount of fabric to cover the can, use a tape measure to determine its circumference. Next, measure the height of the can."
        },
        {
          "headline":"Cut a piece of fabric to fit the can.",
          "description":"Once you know the can’s measurements, mark a piece of fabric in your chosen pattern or color to fit the can’s dimensions. Carefully cut it with fabric scissors so it’s the right size. Depending the size of your fabric, you may need to cut multiple pieces to cover the entire exterior of the can."
        },
        {
          "headline":"Spray the fabric with adhesive and wrap it over the can.",
          "description":"Once you’ve cut the fabric to fit the can, turn it over so its underside faces up. Carefully apply an all-purpose spray adhesive to the fabric, and then wrap it around the can, smoothing it in place. You can use a traditional glue to adhere the fabric to the exterior of the can, but it may cause lumps or dimples."
        }
      ]
    },
    {
      "name":"Assembling the Planter",
      "steps":[
        {
          "headline":"Place some gravel in the bottom of the can.",
          "description":"Before you add the soil and plants to your planter, it’s a good idea to add some gravel. The gravel will help improve drainage in the planter so the roots aren’t overwatered. Fill the planter with an approximately 1-inch (2.5-cm) layer of gravel. Pea gravel is the best option for the planter."
        },
        {
          "headline":"Layer potting soil over the gravel.",
          "description":"Once the gravel is in place in the planter, pour some potting soil into the can. You don’t need to fill the entire planter with soil, but you should add at least 10- to 12-inches (25- to 30-cm) so the roots have sufficient space to grow. Potting soil is sometimes sold as potting mix or container mix. Don’t use soil from your garden or yard even if it’s high quality soil. It is usually too heavy to drain properly in a container."
        },
        {
          "headline":"Add the plant(s) of your choice to the planter.",
          "description":"When the gravel and soil are in place, you can place the plant(s) in the container. Lift the plant(s) from the nursery container, making sure to support the root ball with your fingers. Set the plant(s) down on top of the potting soil and carefully pat the soil around the roots to cover it. It’s a good idea to water the plant(s) in the nursery container at least one hour before moving it to the planter. That will make it easier to remove it. Water the plant after you’ve added to the planter. That will help the roots settle into the soil. If you’re adding more than one plant to your paint can planter, make sure that there’s at least 1-inch (2.5-cm) between their root balls."
        }
      ]
    }
  ],
  "text":" Readying the Paint Can Remove any old paint from the can. To make the planter, you can use a new or recycled metal paint can. If you are using a used can, you must remove any dried paint inside the container. Use a paint scraper tool to carefully scrape the paint away and discard appropriately. You can use any size paint can that you like for your planter. You can purchase new, unused paint cans at your local hardware store or home improvement center. If there is still wet paint inside the can, be sure to follow your local municipal guidelines for proper disposal. If there is any dried paint on the outside of the can, scrape it away as well. Wash and dry the can. Whether you are using a new or recycled paint can for the planter, you must wash it first. Use soap and water to thoroughly clean the interior, and dry it well with a clean rag. Liquid dish washing soap works well to clean the paint can. Remove the label. If you are using a recycled paint can, you should remove the label from the exterior. Peel or scrape it off, and use an adhesive remover product to get rid of any residue on the outside of the can. Use a nail to create a few drainage holes in the can’s bottom. When the paint can is completely clean and dry, turn it over so you can easily reach the bottom. Set a nail against the center of the can and use a hammer to strike it and create a drainage hole. Repeat the process until you have at least 3 or 4 holes to allow drainage. Painting the Planter Spray paint the can. Once you’ve cleaned and punctured the paint can, choose a spray paint shade to serve as the planter’s base color. Carefully spray the exterior of the can with the paint to cover it an even coat. Allow it to dry thoroughly for at least 5 to 6 hours. Don’t worry about getting any paint inside the can. It will be hidden when you add the potting soil and plants. If you are using a recycled paint can and there is any rust on the exterior, use a piece of medium grit sandpaper to buff it away before spray painting it. Paint the can freehand. If you aren’t comfortable using spray paint on the can’s exterior, you can use traditional paint and apply it with a brush. For a metal paint can, an oil-based paint is your best option. After you’ve painted the can, allow it to dry for at least 24 hours. Latex and acrylic paint can also work on the exterior of the paint can. Use stencils to embellish the planter. After the base coat of paint on the can has dried completely, you can decorate the planter further. Use stencils to add a design with fun shapes, such as flowers, stars, hearts, or polka dots, in other paint colors. Allow the painted design to dry for at least 24 hours before adding soil to the planter. It’s best to use the same type of paint for the stenciled design that you used for the base color. If you don’t want to bother with stencils, you can wrap painter’s tape around the can to create stripes on the planter. Using Fabric to Decorate the Planter Measure the circumference and height of the can. To figure out the proper amount of fabric to cover the can, use a tape measure to determine its circumference. Next, measure the height of the can. Cut a piece of fabric to fit the can. Once you know the can’s measurements, mark a piece of fabric in your chosen pattern or color to fit the can’s dimensions. Carefully cut it with fabric scissors so it’s the right size. Depending the size of your fabric, you may need to cut multiple pieces to cover the entire exterior of the can. Spray the fabric with adhesive and wrap it over the can. Once you’ve cut the fabric to fit the can, turn it over so its underside faces up. Carefully apply an all-purpose spray adhesive to the fabric, and then wrap it around the can, smoothing it in place. You can use a traditional glue to adhere the fabric to the exterior of the can, but it may cause lumps or dimples. Assembling the Planter Place some gravel in the bottom of the can. Before you add the soil and plants to your planter, it’s a good idea to add some gravel. The gravel will help improve drainage in the planter so the roots aren’t overwatered. Fill the planter with an approximately 1-inch (2.5-cm) layer of gravel. Pea gravel is the best option for the planter. Layer potting soil over the gravel. Once the gravel is in place in the planter, pour some potting soil into the can. You don’t need to fill the entire planter with soil, but you should add at least 10- to 12-inches (25- to 30-cm) so the roots have sufficient space to grow. Potting soil is sometimes sold as potting mix or container mix. Don’t use soil from your garden or yard even if it’s high quality soil. It is usually too heavy to drain properly in a container. Add the plant(s) of your choice to the planter. When the gravel and soil are in place, you can place the plant(s) in the container. Lift the plant(s) from the nursery container, making sure to support the root ball with your fingers. Set the plant(s) down on top of the potting soil and carefully pat the soil around the roots to cover it. It’s a good idea to water the plant(s) in the nursery container at least one hour before moving it to the planter. That will make it easier to remove it. Water the plant after you’ve added to the planter. That will help the roots settle into the soil. If you’re adding more than one plant to your paint can planter, make sure that there’s at least 1-inch (2.5-cm) between their root balls.",
  "sentences":[
    " Readying the Paint Can Remove any old paint from the can.",
    "To make the planter, you can use a new or recycled metal paint can.",
    "If you are using a used can, you must remove any dried paint inside the container.",
    "Use a paint scraper tool to carefully scrape the paint away and discard appropriately.",
    "You can use any size paint can that you like for your planter.",
    "You can purchase new, unused paint cans at your local hardware store or home improvement center.",
    "If there is still wet paint inside the can, be sure to follow your local municipal guidelines for proper disposal.",
    "If there is any dried paint on the outside of the can, scrape it away as well.",
    "Wash and dry the can.",
    "Whether you are using a new or recycled paint can for the planter, you must wash it first.",
    "Use soap and water to thoroughly clean the interior, and dry it well with a clean rag.",
    "Liquid dish washing soap works well to clean the paint can.",
    "Remove the label.",
    "If you are using a recycled paint can, you should remove the label from the exterior.",
    "Peel or scrape it off, and use an adhesive remover product to get rid of any residue on the outside of the can.",
    "Use a nail to create a few drainage holes in the can’s bottom.",
    "When the paint can is completely clean and dry, turn it over so you can easily reach the bottom.",
    "Set a nail against the center of the can and use a hammer to strike it and create a drainage hole.",
    "Repeat the process until you have at least 3 or 4 holes to allow drainage.",
    "Painting the Planter Spray paint the can.",
    "Once you’ve cleaned and punctured the paint can, choose a spray paint shade to serve as the planter’s base color.",
    "Carefully spray the exterior of the can with the paint to cover it an even coat.",
    "Allow it to dry thoroughly for at least 5 to 6 hours.",
    "Don’t worry about getting any paint inside the can.",
    "It will be hidden when you add the potting soil and plants.",
    "If you are using a recycled paint can and there is any rust on the exterior, use a piece of medium grit sandpaper to buff it away before spray painting it.",
    "Paint the can freehand.",
    "If you aren’t comfortable using spray paint on the can’s exterior, you can use traditional paint and apply it with a brush.",
    "For a metal paint can, an oil-based paint is your best option.",
    "After you’ve painted the can, allow it to dry for at least 24 hours.",
    "Latex and acrylic paint can also work on the exterior of the paint can.",
    "Use stencils to embellish the planter.",
    "After the base coat of paint on the can has dried completely, you can decorate the planter further.",
    "Use stencils to add a design with fun shapes, such as flowers, stars, hearts, or polka dots, in other paint colors.",
    "Allow the painted design to dry for at least 24 hours before adding soil to the planter.",
    "It’s best to use the same type of paint for the stenciled design that you used for the base color.",
    "If you don’t want to bother with stencils, you can wrap painter’s tape around the can to create stripes on the planter.",
    "Using Fabric to Decorate the Planter Measure the circumference and height of the can.",
    "To figure out the proper amount of fabric to cover the can, use a tape measure to determine its circumference.",
    "Next, measure the height of the can.",
    "Cut a piece of fabric to fit the can.",
    "Once you know the can’s measurements, mark a piece of fabric in your chosen pattern or color to fit the can’s dimensions.",
    "Carefully cut it with fabric scissors so it’s the right size.",
    "Depending the size of your fabric, you may need to cut multiple pieces to cover the entire exterior of the can.",
    "Spray the fabric with adhesive and wrap it over the can.",
    "Once you’ve cut the fabric to fit the can, turn it over so its underside faces up.",
    "Carefully apply an all-purpose spray adhesive to the fabric, and then wrap it around the can, smoothing it in place.",
    "You can use a traditional glue to adhere the fabric to the exterior of the can, but it may cause lumps or dimples.",
    "Assembling the Planter Place some gravel in the bottom of the can.",
    "Before you add the soil and plants to your planter, it’s a good idea to add some gravel.",
    "The gravel will help improve drainage in the planter so the roots aren’t overwatered.",
    "Fill the planter with an approximately 1-inch (2.5-cm) layer of gravel.",
    "Pea gravel is the best option for the planter.",
    "Layer potting soil over the gravel.",
    "Once the gravel is in place in the planter, pour some potting soil into the can.",
    "You don’t need to fill the entire planter with soil, but you should add at least 10- to 12-inches (25- to 30-cm) so the roots have sufficient space to grow.",
    "Potting soil is sometimes sold as potting mix or container mix.",
    "Don’t use soil from your garden or yard even if it’s high quality soil.",
    "It is usually too heavy to drain properly in a container.",
    "Add the plant(s) of your choice to the planter.",
    "When the gravel and soil are in place, you can place the plant(s) in the container.",
    "Lift the plant(s) from the nursery container, making sure to support the root ball with your fingers.",
    "Set the plant(s) down on top of the potting soil and carefully pat the soil around the roots to cover it.",
    "It’s a good idea to water the plant(s) in the nursery container at least one hour before moving it to the planter.",
    "That will make it easier to remove it.",
    "Water the plant after you’ve added to the planter.",
    "That will help the roots settle into the soil.",
    "If you’re adding more than one plant to your paint can planter, make sure that there’s at least 1-inch (2.5-cm) between their root balls."
  ],
  "tyn_section":[
    "Metal paint can in any size",
    "Paint scraper",
    "Soap",
    "Towels",
    "Nail",
    "Hammer",
    "Spray paint, optional",
    "Oil-based paint, optional",
    "Paint brush, optional",
    "Stencils, optional",
    "Tape measure",
    "Fabric in any color or pattern",
    "Spray adhesive",
    "Gravel",
    "Potting soil",
    "Plants"
  ],
  "tyn_model":[
    "planter",
    "paint",
    "fabric",
    "gravel",
    "potting soil",
    "paint can",
    "soil",
    "water",
    "nail",
    "spray paint",
    "paint scraper",
    "paint cans",
    "soap",
    "dish washing soap",
    "recycled paint",
    "hammer",
    "medium grit sandpaper",
    "oil-based paint",
    "latex and",
    "painter’s tape",
    "tape measure",
    "fabric scissors",
    "adhesive",
    "all-purpose spray adhesive",
    "glue",
    "plants",
    "pea gravel",
    "potting mix",
    "paint can planter"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.275862069,
    "f1":0.3555555556,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5625,
    "p":0.4482758621,
    "f1":0.4989339019
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6875,
    "p":0.724137931,
    "f1":0.7053435115
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5625,
    "p":0.3103448276,
    "f1":0.4
  }
}