{
  "title":"How to Make Chocolate Macarons",
  "url":"https://www.wikihow.com/Make-Chocolate-Macarons",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "parts":[
    {
      "name":"Making the Macaron Shells",
      "steps":[
        {
          "headline":"Sift the dry ingredients together.",
          "description":"In a medium-sized bowl, sift the powdered sugar, cocoa powder, and almond flour two times only. Set aside for later use."
        },
        {
          "headline":"Beat the egg whites in a separate bowl.",
          "description":"Using an electric mixer, beat the whites on medium speed until they're foamy."
        },
        {
          "headline":"Fold in the cream of tartar and keep blending.",
          "description":""
        },
        {
          "headline":"Pour in the sugar, adding a tablespoon at a time.",
          "description":"Pick up the speed to medium-high and keep beating the whites. Peaks should begin to form."
        },
        {
          "headline":"Sift in the almond flour mixture into the egg whites.",
          "description":"Combine the ingredients together using a rubber spatula. Do not over-mix. Mix the batter together clockwise from the bottom, going up around the sides, and then cutting the batter in half. The batter will be a little thick at first, but that's normal. It begins to thin out the more you mix. Test the batter's consistency by doing the macaron ribbon test. To do it, scoop small amounts of macaron batter on a tray. After ten seconds, the edges of the ribbon should dissolve. If it doesn't dissolve, keep continuing to fold the batter together, but if it does dissolve then stop mixing at once."
        },
        {
          "headline":"Scoop the macaron batter in a pastry bag with a tip.",
          "description":""
        },
        {
          "headline":"Pipe the batter on a baking tray covered with parchment paper.",
          "description":"Pipe small amounts of batter, about 1.5-inch rounds. Keep each amount one inch away from one another. There will be approximately 42 shells. If air bubbles appear, firmly tap the baking tray down to pop them. Air bubbles can crack macaron shells when they bake."
        }
      ]
    },
    {
      "name":"Baking and Making the Ganache",
      "steps":[
        {
          "headline":"Preheat the oven to 300° Fahrenheit (150° Celsius).",
          "description":""
        },
        {
          "headline":"Allow the macarons to sit for about 15-30 minutes.",
          "description":"Before getting baked, let the shells dry. You can test the shells to see if they're ready to bake by touching one of them gently. If the batter does not stick to your finger, they're ready for baking. Sprinkle over the salt, if desired."
        },
        {
          "headline":"Bake the macarons for about 18-20 minutes.",
          "description":"The macarons will be ready when they're easy to remove off the tray and do not stick to it."
        },
        {
          "headline":"Let the macarons cool for about 15 minutes.",
          "description":"Lay the tray on a wire rack and after several minutes of cooling, transfer the shells on the rack using a spatula. While the macarons chill, make the chocolate ganache filling."
        },
        {
          "headline":"Start making the ganache filling.",
          "description":"Simmer the chocolate and heavy cream in a large saucepan over medium heat. Heat the ingredients up until it begins to bubble. Mix with a wooden spoon and let the filling rest for about a minute or so. Stir in the butter and mix until smooth. Chill until the filling slightly thickens, but is still easy enough to spread. It's recommended to chill the ganache filling for about thirty minutes."
        },
        {
          "headline":"Pipe the ganache filling onto the macaron shells.",
          "description":"Close each one together to form the macaron."
        },
        {
          "headline":"Serve.",
          "description":"Place the chocolate macarons on a serving plate. Garnish with powdered sugar, if desired. Enjoy!"
        }
      ]
    }
  ],
  "text":" Making the Macaron Shells Sift the dry ingredients together. In a medium-sized bowl, sift the powdered sugar, cocoa powder, and almond flour two times only. Set aside for later use. Beat the egg whites in a separate bowl. Using an electric mixer, beat the whites on medium speed until they're foamy. Fold in the cream of tartar and keep blending.  Pour in the sugar, adding a tablespoon at a time. Pick up the speed to medium-high and keep beating the whites. Peaks should begin to form. Sift in the almond flour mixture into the egg whites. Combine the ingredients together using a rubber spatula. Do not over-mix. Mix the batter together clockwise from the bottom, going up around the sides, and then cutting the batter in half. The batter will be a little thick at first, but that's normal. It begins to thin out the more you mix. Test the batter's consistency by doing the macaron ribbon test. To do it, scoop small amounts of macaron batter on a tray. After ten seconds, the edges of the ribbon should dissolve. If it doesn't dissolve, keep continuing to fold the batter together, but if it does dissolve then stop mixing at once. Scoop the macaron batter in a pastry bag with a tip.  Pipe the batter on a baking tray covered with parchment paper. Pipe small amounts of batter, about 1.5-inch rounds. Keep each amount one inch away from one another. There will be approximately 42 shells. If air bubbles appear, firmly tap the baking tray down to pop them. Air bubbles can crack macaron shells when they bake. Baking and Making the Ganache Preheat the oven to 300° Fahrenheit (150° Celsius).  Allow the macarons to sit for about 15-30 minutes. Before getting baked, let the shells dry. You can test the shells to see if they're ready to bake by touching one of them gently. If the batter does not stick to your finger, they're ready for baking. Sprinkle over the salt, if desired. Bake the macarons for about 18-20 minutes. The macarons will be ready when they're easy to remove off the tray and do not stick to it. Let the macarons cool for about 15 minutes. Lay the tray on a wire rack and after several minutes of cooling, transfer the shells on the rack using a spatula. While the macarons chill, make the chocolate ganache filling. Start making the ganache filling. Simmer the chocolate and heavy cream in a large saucepan over medium heat. Heat the ingredients up until it begins to bubble. Mix with a wooden spoon and let the filling rest for about a minute or so. Stir in the butter and mix until smooth. Chill until the filling slightly thickens, but is still easy enough to spread. It's recommended to chill the ganache filling for about thirty minutes. Pipe the ganache filling onto the macaron shells. Close each one together to form the macaron. Serve. Place the chocolate macarons on a serving plate. Garnish with powdered sugar, if desired. Enjoy!",
  "sentences":[
    " Making the Macaron Shells Sift the dry ingredients together.",
    "In a medium-sized bowl, sift the powdered sugar, cocoa powder, and almond flour two times only.",
    "Set aside for later use.",
    "Beat the egg whites in a separate bowl.",
    "Using an electric mixer, beat the whites on medium speed until they're foamy.",
    "Fold in the cream of tartar and keep blending.",
    "Pour in the sugar, adding a tablespoon at a time.",
    "Pick up the speed to medium-high and keep beating the whites.",
    "Peaks should begin to form.",
    "Sift in the almond flour mixture into the egg whites.",
    "Combine the ingredients together using a rubber spatula.",
    "Do not over-mix.",
    "Mix the batter together clockwise from the bottom, going up around the sides, and then cutting the batter in half.",
    "The batter will be a little thick at first, but that's normal.",
    "It begins to thin out the more you mix.",
    "Test the batter's consistency by doing the macaron ribbon test.",
    "To do it, scoop small amounts of macaron batter on a tray.",
    "After ten seconds, the edges of the ribbon should dissolve.",
    "If it doesn't dissolve, keep continuing to fold the batter together, but if it does dissolve then stop mixing at once.",
    "Scoop the macaron batter in a pastry bag with a tip.",
    "Pipe the batter on a baking tray covered with parchment paper.",
    "Pipe small amounts of batter, about 1.5-inch rounds.",
    "Keep each amount one inch away from one another.",
    "There will be approximately 42 shells.",
    "If air bubbles appear, firmly tap the baking tray down to pop them.",
    "Air bubbles can crack macaron shells when they bake.",
    "Baking and Making the Ganache Preheat the oven to 300° Fahrenheit (150° Celsius).",
    "Allow the macarons to sit for about 15-30 minutes.",
    "Before getting baked, let the shells dry.",
    "You can test the shells to see if they're ready to bake by touching one of them gently.",
    "If the batter does not stick to your finger, they're ready for baking.",
    "Sprinkle over the salt, if desired.",
    "Bake the macarons for about 18-20 minutes.",
    "The macarons will be ready when they're easy to remove off the tray and do not stick to it.",
    "Let the macarons cool for about 15 minutes.",
    "Lay the tray on a wire rack and after several minutes of cooling, transfer the shells on the rack using a spatula.",
    "While the macarons chill, make the chocolate ganache filling.",
    "Start making the ganache filling.",
    "Simmer the chocolate and heavy cream in a large saucepan over medium heat.",
    "Heat the ingredients up until it begins to bubble.",
    "Mix with a wooden spoon and let the filling rest for about a minute or so.",
    "Stir in the butter and mix until smooth.",
    "Chill until the filling slightly thickens, but is still easy enough to spread.",
    "It's recommended to chill the ganache filling for about thirty minutes.",
    "Pipe the ganache filling onto the macaron shells.",
    "Close each one together to form the macaron.",
    "Serve.",
    "Place the chocolate macarons on a serving plate.",
    "Garnish with powdered sugar, if desired.",
    "Enjoy!"
  ],
  "tyn_section":[
    "Oven",
    "Baking tray",
    "Parchment paper",
    "Electric mixer",
    "2 bowls",
    "Sifter",
    "Rubber spatula",
    "Wooden spoon",
    "Saucepan",
    "Stovetop",
    "Metal spatula",
    "Pastry bag with tip",
    "Serving plate"
  ],
  "tyn_model":[
    "tray",
    "powdered sugar",
    "almond flour",
    "macaron batter",
    "baking tray",
    "macaron shells",
    "cocoa powder",
    "electric mixer",
    "cream of tartar",
    "sugar",
    "rubber spatula",
    "macaron ribbon",
    "pastry bag",
    "parchment paper",
    "oven",
    "salt",
    "wire rack",
    "spatula",
    "chocolate ganache",
    "chocolate",
    "heavy cream",
    "large saucepan",
    "wooden spoon",
    "butter",
    "macaron",
    "chocolate macarons",
    "serving plate"
  ],
  "simple_metrics":{
    "r":0.5384615385,
    "p":0.2592592593,
    "f1":0.35,
    "avg_pos":0.5185185185
  },
  "jacc_metrics_0.5":{
    "r":0.7692307692,
    "p":0.4074074074,
    "f1":0.5326876513
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7692307692,
    "p":0.4074074074,
    "f1":0.5326876513
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5384615385,
    "p":0.2592592593,
    "f1":0.35
  }
}