{
  "title":"How to Make Turmeric Soap",
  "url":"https://www.wikihow.com/Make-Turmeric-Soap",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Making Melt-and-Pour Soap",
      "steps":[
        {
          "headline":"Cut the melt-and-pour soap base into 1-inch (2.54-centimeter) chunks.",
          "description":"This will make the soap easier to melt in the next step. Some melt-and-pour soap bases have a grid molded into them; you can use this as a cutting guide. You can use any type of base you want. White glycerin is popular, but goat milk or shea butter would be more luxurious!"
        },
        {
          "headline":"Melt the soap base in the microwave.",
          "description":"Place the cubes into a glass, microwave-safe bowl. Heat them in the microwave at 15 to 30-second intervals until the soap base melts. Stir the base between each interval."
        },
        {
          "headline":"Stir in the ground turmeric.",
          "description":"Plan on using about 1 teaspoon. This will give your soap a bright, golden-yellow color. If you want something deeper, you can add in a little bit more."
        },
        {
          "headline":"Add in some essential oil or soap making fragrance oil.",
          "description":"You will need 2 teaspoons total of  either oil. You can use just one type of oil or a combination of 2 to 3 oils for a unique fragrance. Great choices include lemon and lavender. Thyme essential oil pairs especially well with turmeric. For a more subtle fragrance, use less essential oil. If you are using essential oils instead of soap making fragrance oils, make sure that they are skin safe. Do not use candle-making fragrance oils. They are not the same thing, nor are they skin-safe."
        },
        {
          "headline":"Add in an exfoliant, if desired.",
          "description":"A great choice would be ground oatmeal because of how beneficial it is for skin, especially acne-prone skin. You can also use other exfoliants as well, such as ground apricot seeds, which you can get in the soap making section of an arts and crafts store. Plan on using about 1 tablespoon of your desired exfoliant."
        },
        {
          "headline":"Stir everything together with a rubber spatula.",
          "description":"Keep stirring until the color and texture are consistent. Scrape the bottom and sides of the bowl often. If you added in an exfoliant, be aware that it may settle. This is normal."
        },
        {
          "headline":"Pour the soap into a plastic or silicone soap making mold.",
          "description":"Use the rubber spatula to help scrape the bowl clean so that you don't waste any of your soap base. You can find soap making molds in the soap making aisle of an arts and crafts shop. You can also find them in online stores that specialize in soap making supplies. Make sure that the soap is less than 145°F (63°C) before pouring it into plastic molds, or the molds may warp."
        },
        {
          "headline":"Tap the mold gently.",
          "description":"This will bring any air bubbles to the surface. If you see any, lightly mist them with rubbing alcohol."
        },
        {
          "headline":"Allow the soap to cool for 12 to 24 hours.",
          "description":"Do not put them into the fridge or freezer. Even though this seems like a good idea, it will affect the interior temperature of your fridge or freezer. Your food may also get a soapy taste. For a smoother finish, cover the top of the soap with plastic wrap before setting it aside to cool. Be sure to press the wrap into the soap."
        },
        {
          "headline":"De-mold the soap.",
          "description":"If the soap is hard to remove, you can put it into the freezer for up to 1 hour. This will help loosen the soap from the mold. Since the soap is already cooled off, it won't affect the interior temperature of your freezer. It also won't be long enough for it to impart a soapy flavor. If you used a lager mold, cut the soap into smaller bars using a sharp knife. You should be able to get about 6 to 8 bars."
        },
        {
          "headline":"Use the soap.",
          "description":"Unlike cold process soap, melt-and-pour soap does not require a curing time. Once you de-mold the soap, it is ready to use!"
        }
      ]
    },
    {
      "name":"Making Cold Process Turmeric Soap",
      "steps":[
        {
          "headline":"Brew the green tea the night before, if you wish to use it.",
          "description":"Fill a pitcher with 15 ounces (425.243 grams) of water and add two bags of cold brew green tea. Leave the pitcher in the fridge overnight. Squeeze the bags the next morning, then discard them. Green tea is a great substitute for water thanks to its antioxidant properties. If you don't want to use green tea, you can skip this step and use plain water instead."
        },
        {
          "headline":"Pour the tea into a heat-safe pitcher.",
          "description":"Use a digital scale to measure out 11.8 ounces (334.52 grams) of the prepared green tea. Pour it into a heat-safe pitcher. You can drink any leftover tea, discard it, or use it in another recipe. You must measure the water by weight. Don't use a measuring glass. If you don't want to use green tea, fill the pitcher with 11.8 ounces (334.52 grams) of water instead."
        },
        {
          "headline":"Put on protective gear and have good ventilation.",
          "description":"Put on a pair of safety goggles and heavy-duty rubber gloves. The type that you use to clean your kitchen work well. Open up a window. If you are working over your stove, turn on the exhaust fan. Lye is caustic, and the solution in the next step will get hot; it will also produce fumes."
        },
        {
          "headline":"Stir the lye to the pitcher.",
          "description":"Use the digital scale to measure out 4.9 ounces (138.91 grams) of lye (sodium hydroxide). Slowly add the lye into the pitcher. Give the solution a stir with a plastic or wooden spoon. Never add water to lye, or the solution will erupt."
        },
        {
          "headline":"Melt the oils and butters in a stainless steel pot over medium heat.",
          "description":"Use the digital scale to measure out the oils and the butters first. Stir them together in a stainless steel pot, then melt them on the stove over medium heat. Do not use an aluminum pot for this."
        },
        {
          "headline":"Wait for the solution and mixture to reach 95 to 110°F (35 to 44°C).",
          "description":"Once that happens, stir the sodium lactate to the lye solution. Mix the turmeric powder into the oil-and-butter mixture using a stick blender. If you are using a wooden soap mold, use this time to line it with parchment paper."
        },
        {
          "headline":"Mix the lye solution into the oil-and-butter mixture.",
          "description":"Use a stick blender to mix the two together. When the mixture reaches a light trace, you can add a fragrance oil if you want to."
        },
        {
          "headline":"Blend the mixture it reaches a medium trace.",
          "description":"Once that happens, you are ready to add it to your mold. You have to work quickly during the next few steps as the soap base will start to set."
        },
        {
          "headline":"Pour the soap base into a soap making mold.",
          "description":"The soap will likely form a rippled texture on top, similar to whipped cream. If you don't want this, use a rubber spatula to smooth it down. For extra texture, you could add a sprinkle of calendula petals on top of the soap."
        },
        {
          "headline":"Insulate and dry the soap.",
          "description":"Cover the soap with plastic wrap, then place a folded towel or blanket on top. If you are using a wooden mold, wait 1 day before continuing. If you are using a silicone mold, wait 2 to 3 days."
        },
        {
          "headline":"Remove the soap from the mold, then cut it.",
          "description":"Carefully de-mold the soap. Cut the soap into 10 to 12 bars. If you used a silicone mold, remove it, then wait 1 day before cutting it. If you used smaller molds to make individual bars, you don't have to cut them."
        },
        {
          "headline":"Let the soap cure for 4 to 6 weeks.",
          "description":"Place the soap someplace out of the way where it won't get disturbed, bumped, or moved. Once the soap has cured, it is ready to use."
        }
      ]
    }
  ],
  "text":" Making Melt-and-Pour Soap Cut the melt-and-pour soap base into 1-inch (2.54-centimeter) chunks. This will make the soap easier to melt in the next step. Some melt-and-pour soap bases have a grid molded into them; you can use this as a cutting guide. You can use any type of base you want. White glycerin is popular, but goat milk or shea butter would be more luxurious! Melt the soap base in the microwave. Place the cubes into a glass, microwave-safe bowl. Heat them in the microwave at 15 to 30-second intervals until the soap base melts. Stir the base between each interval. Stir in the ground turmeric. Plan on using about 1 teaspoon. This will give your soap a bright, golden-yellow color. If you want something deeper, you can add in a little bit more. Add in some essential oil or soap making fragrance oil. You will need 2 teaspoons total of  either oil. You can use just one type of oil or a combination of 2 to 3 oils for a unique fragrance. Great choices include lemon and lavender. Thyme essential oil pairs especially well with turmeric. For a more subtle fragrance, use less essential oil. If you are using essential oils instead of soap making fragrance oils, make sure that they are skin safe. Do not use candle-making fragrance oils. They are not the same thing, nor are they skin-safe. Add in an exfoliant, if desired. A great choice would be ground oatmeal because of how beneficial it is for skin, especially acne-prone skin. You can also use other exfoliants as well, such as ground apricot seeds, which you can get in the soap making section of an arts and crafts store. Plan on using about 1 tablespoon of your desired exfoliant. Stir everything together with a rubber spatula. Keep stirring until the color and texture are consistent. Scrape the bottom and sides of the bowl often. If you added in an exfoliant, be aware that it may settle. This is normal. Pour the soap into a plastic or silicone soap making mold. Use the rubber spatula to help scrape the bowl clean so that you don't waste any of your soap base. You can find soap making molds in the soap making aisle of an arts and crafts shop. You can also find them in online stores that specialize in soap making supplies. Make sure that the soap is less than 145°F (63°C) before pouring it into plastic molds, or the molds may warp. Tap the mold gently. This will bring any air bubbles to the surface. If you see any, lightly mist them with rubbing alcohol. Allow the soap to cool for 12 to 24 hours. Do not put them into the fridge or freezer. Even though this seems like a good idea, it will affect the interior temperature of your fridge or freezer. Your food may also get a soapy taste. For a smoother finish, cover the top of the soap with plastic wrap before setting it aside to cool. Be sure to press the wrap into the soap. De-mold the soap. If the soap is hard to remove, you can put it into the freezer for up to 1 hour. This will help loosen the soap from the mold. Since the soap is already cooled off, it won't affect the interior temperature of your freezer. It also won't be long enough for it to impart a soapy flavor. If you used a lager mold, cut the soap into smaller bars using a sharp knife. You should be able to get about 6 to 8 bars. Use the soap. Unlike cold process soap, melt-and-pour soap does not require a curing time. Once you de-mold the soap, it is ready to use! Making Cold Process Turmeric Soap Brew the green tea the night before, if you wish to use it. Fill a pitcher with 15 ounces (425.243 grams) of water and add two bags of cold brew green tea. Leave the pitcher in the fridge overnight. Squeeze the bags the next morning, then discard them. Green tea is a great substitute for water thanks to its antioxidant properties. If you don't want to use green tea, you can skip this step and use plain water instead. Pour the tea into a heat-safe pitcher. Use a digital scale to measure out 11.8 ounces (334.52 grams) of the prepared green tea. Pour it into a heat-safe pitcher. You can drink any leftover tea, discard it, or use it in another recipe. You must measure the water by weight. Don't use a measuring glass. If you don't want to use green tea, fill the pitcher with 11.8 ounces (334.52 grams) of water instead. Put on protective gear and have good ventilation. Put on a pair of safety goggles and heavy-duty rubber gloves. The type that you use to clean your kitchen work well. Open up a window. If you are working over your stove, turn on the exhaust fan. Lye is caustic, and the solution in the next step will get hot; it will also produce fumes. Stir the lye to the pitcher. Use the digital scale to measure out 4.9 ounces (138.91 grams) of lye (sodium hydroxide). Slowly add the lye into the pitcher. Give the solution a stir with a plastic or wooden spoon. Never add water to lye, or the solution will erupt. Melt the oils and butters in a stainless steel pot over medium heat. Use the digital scale to measure out the oils and the butters first. Stir them together in a stainless steel pot, then melt them on the stove over medium heat. Do not use an aluminum pot for this. Wait for the solution and mixture to reach 95 to 110°F (35 to 44°C). Once that happens, stir the sodium lactate to the lye solution. Mix the turmeric powder into the oil-and-butter mixture using a stick blender. If you are using a wooden soap mold, use this time to line it with parchment paper. Mix the lye solution into the oil-and-butter mixture. Use a stick blender to mix the two together. When the mixture reaches a light trace, you can add a fragrance oil if you want to. Blend the mixture it reaches a medium trace. Once that happens, you are ready to add it to your mold. You have to work quickly during the next few steps as the soap base will start to set. Pour the soap base into a soap making mold. The soap will likely form a rippled texture on top, similar to whipped cream. If you don't want this, use a rubber spatula to smooth it down. For extra texture, you could add a sprinkle of calendula petals on top of the soap. Insulate and dry the soap. Cover the soap with plastic wrap, then place a folded towel or blanket on top. If you are using a wooden mold, wait 1 day before continuing. If you are using a silicone mold, wait 2 to 3 days. Remove the soap from the mold, then cut it. Carefully de-mold the soap. Cut the soap into 10 to 12 bars. If you used a silicone mold, remove it, then wait 1 day before cutting it. If you used smaller molds to make individual bars, you don't have to cut them. Let the soap cure for 4 to 6 weeks. Place the soap someplace out of the way where it won't get disturbed, bumped, or moved. Once the soap has cured, it is ready to use.",
  "sentences":[
    " Making Melt-and-Pour Soap Cut the melt-and-pour soap base into 1-inch (2.54-centimeter) chunks.",
    "This will make the soap easier to melt in the next step.",
    "Some melt-and-pour soap bases have a grid molded into them; you can use this as a cutting guide.",
    "You can use any type of base you want.",
    "White glycerin is popular, but goat milk or shea butter would be more luxurious!",
    "Melt the soap base in the microwave.",
    "Place the cubes into a glass, microwave-safe bowl.",
    "Heat them in the microwave at 15 to 30-second intervals until the soap base melts.",
    "Stir the base between each interval.",
    "Stir in the ground turmeric.",
    "Plan on using about 1 teaspoon.",
    "This will give your soap a bright, golden-yellow color.",
    "If you want something deeper, you can add in a little bit more.",
    "Add in some essential oil or soap making fragrance oil.",
    "You will need 2 teaspoons total of  either oil.",
    "You can use just one type of oil or a combination of 2 to 3 oils for a unique fragrance.",
    "Great choices include lemon and lavender.",
    "Thyme essential oil pairs especially well with turmeric.",
    "For a more subtle fragrance, use less essential oil.",
    "If you are using essential oils instead of soap making fragrance oils, make sure that they are skin safe.",
    "Do not use candle-making fragrance oils.",
    "They are not the same thing, nor are they skin-safe.",
    "Add in an exfoliant, if desired.",
    "A great choice would be ground oatmeal because of how beneficial it is for skin, especially acne-prone skin.",
    "You can also use other exfoliants as well, such as ground apricot seeds, which you can get in the soap making section of an arts and crafts store.",
    "Plan on using about 1 tablespoon of your desired exfoliant.",
    "Stir everything together with a rubber spatula.",
    "Keep stirring until the color and texture are consistent.",
    "Scrape the bottom and sides of the bowl often.",
    "If you added in an exfoliant, be aware that it may settle.",
    "This is normal.",
    "Pour the soap into a plastic or silicone soap making mold.",
    "Use the rubber spatula to help scrape the bowl clean so that you don't waste any of your soap base.",
    "You can find soap making molds in the soap making aisle of an arts and crafts shop.",
    "You can also find them in online stores that specialize in soap making supplies.",
    "Make sure that the soap is less than 145°F (63°C) before pouring it into plastic molds, or the molds may warp.",
    "Tap the mold gently.",
    "This will bring any air bubbles to the surface.",
    "If you see any, lightly mist them with rubbing alcohol.",
    "Allow the soap to cool for 12 to 24 hours.",
    "Do not put them into the fridge or freezer.",
    "Even though this seems like a good idea, it will affect the interior temperature of your fridge or freezer.",
    "Your food may also get a soapy taste.",
    "For a smoother finish, cover the top of the soap with plastic wrap before setting it aside to cool.",
    "Be sure to press the wrap into the soap.",
    "De-mold the soap.",
    "If the soap is hard to remove, you can put it into the freezer for up to 1 hour.",
    "This will help loosen the soap from the mold.",
    "Since the soap is already cooled off, it won't affect the interior temperature of your freezer.",
    "It also won't be long enough for it to impart a soapy flavor.",
    "If you used a lager mold, cut the soap into smaller bars using a sharp knife.",
    "You should be able to get about 6 to 8 bars.",
    "Use the soap.",
    "Unlike cold process soap, melt-and-pour soap does not require a curing time.",
    "Once you de-mold the soap, it is ready to use!",
    "Making Cold Process Turmeric Soap Brew the green tea the night before, if you wish to use it.",
    "Fill a pitcher with 15 ounces (425.243 grams) of water and add two bags of cold brew green tea.",
    "Leave the pitcher in the fridge overnight.",
    "Squeeze the bags the next morning, then discard them.",
    "Green tea is a great substitute for water thanks to its antioxidant properties.",
    "If you don't want to use green tea, you can skip this step and use plain water instead.",
    "Pour the tea into a heat-safe pitcher.",
    "Use a digital scale to measure out 11.8 ounces (334.52 grams) of the prepared green tea.",
    "Pour it into a heat-safe pitcher.",
    "You can drink any leftover tea, discard it, or use it in another recipe.",
    "You must measure the water by weight.",
    "Don't use a measuring glass.",
    "If you don't want to use green tea, fill the pitcher with 11.8 ounces (334.52 grams) of water instead.",
    "Put on protective gear and have good ventilation.",
    "Put on a pair of safety goggles and heavy-duty rubber gloves.",
    "The type that you use to clean your kitchen work well.",
    "Open up a window.",
    "If you are working over your stove, turn on the exhaust fan.",
    "Lye is caustic, and the solution in the next step will get hot; it will also produce fumes.",
    "Stir the lye to the pitcher.",
    "Use the digital scale to measure out 4.9 ounces (138.91 grams) of lye (sodium hydroxide).",
    "Slowly add the lye into the pitcher.",
    "Give the solution a stir with a plastic or wooden spoon.",
    "Never add water to lye, or the solution will erupt.",
    "Melt the oils and butters in a stainless steel pot over medium heat.",
    "Use the digital scale to measure out the oils and the butters first.",
    "Stir them together in a stainless steel pot, then melt them on the stove over medium heat.",
    "Do not use an aluminum pot for this.",
    "Wait for the solution and mixture to reach 95 to 110°F (35 to 44°C).",
    "Once that happens, stir the sodium lactate to the lye solution.",
    "Mix the turmeric powder into the oil-and-butter mixture using a stick blender.",
    "If you are using a wooden soap mold, use this time to line it with parchment paper.",
    "Mix the lye solution into the oil-and-butter mixture.",
    "Use a stick blender to mix the two together.",
    "When the mixture reaches a light trace, you can add a fragrance oil if you want to.",
    "Blend the mixture it reaches a medium trace.",
    "Once that happens, you are ready to add it to your mold.",
    "You have to work quickly during the next few steps as the soap base will start to set.",
    "Pour the soap base into a soap making mold.",
    "The soap will likely form a rippled texture on top, similar to whipped cream.",
    "If you don't want this, use a rubber spatula to smooth it down.",
    "For extra texture, you could add a sprinkle of calendula petals on top of the soap.",
    "Insulate and dry the soap.",
    "Cover the soap with plastic wrap, then place a folded towel or blanket on top.",
    "If you are using a wooden mold, wait 1 day before continuing.",
    "If you are using a silicone mold, wait 2 to 3 days.",
    "Remove the soap from the mold, then cut it.",
    "Carefully de-mold the soap.",
    "Cut the soap into 10 to 12 bars.",
    "If you used a silicone mold, remove it, then wait 1 day before cutting it.",
    "If you used smaller molds to make individual bars, you don't have to cut them.",
    "Let the soap cure for 4 to 6 weeks.",
    "Place the soap someplace out of the way where it won't get disturbed, bumped, or moved.",
    "Once the soap has cured, it is ready to use."
  ],
  "tyn_section":[
    "1.5 pounds (680 grams) melt-and-pour soap base",
    "1 teaspoon ground turmeric",
    "1 tablespoon ground oatmeal or other exfoliant of choice (optional)",
    "2 teaspoons soap making fragrance oil or essential oil",
    "Glass, microwave-safe bowl",
    "Rubber spatula",
    "Soap making mold",
    "4.9 ounces (138.91 grams) lye/sodium hydroxide",
    "11.8 ounces (334.52 grams) green tea or water",
    "8 ounces (226.8 grams) coconut oil",
    "2 ounces (56.7 grams) cocoa butter",
    "1.5 ounces (42.52 grams) mango butter",
    "2.5 ounces (70.9 grams) safflower oil",
    "1 ounce (28.35 grams) shea butter",
    "3 ounces (85.05 grams) castor oil",
    "1 ounce (28.35 grams) hemp seed oil",
    "2 ounces (56.7 grams) avocado oil",
    "15 ounces (425.243 grams) olive oil",
    "1 ounce (28.35 grams) 60% solution liquid sodium lactate",
    "1.5 ounces (42.52 grams) ground turmeric",
    "2 ounces (56.7 grams) fragrance oil, optional",
    "Dried calendula flowers, optional",
    "Digital kitchen scale",
    "Heat-safe pitcher",
    "Plastic or wooden spoon",
    "Stick blender",
    "Stainless steel pot",
    "Thermometer",
    "Safety goggles",
    "Heavy-duty rubber gloves"
  ],
  "tyn_model":[
    "soap",
    "pitcher",
    "water",
    "lye",
    "green tea",
    "turmeric",
    "soap making",
    "microwave",
    "essential oil",
    "rubber spatula",
    "plastic wrap",
    "freezer",
    "stove",
    "digital scale",
    "stainless steel pot",
    "butter",
    "stick blender",
    "white glycerin",
    "goat milk",
    "shea butter",
    "soap making fragrance oil",
    "lemon",
    "lavender",
    "thyme essential oil",
    "essential oils",
    "oatmeal",
    "bowl",
    "soap making mold",
    "soap making aisle",
    "soap making supplies",
    "rubbing alcohol",
    "lager mold",
    "cold process soap",
    "cold process turmeric soap",
    "cold brew green tea",
    "measuring glass",
    "sodium hydroxide",
    "spoon",
    "butters",
    "sodium lactate",
    "oil",
    "parchment paper",
    "oil-",
    "fragrance oil",
    "whipped cream",
    "calendula petals"
  ],
  "simple_metrics":{
    "r":0.1333333333,
    "p":0.0869565217,
    "f1":0.1052631579,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2333333333,
    "p":0.2173913043,
    "f1":0.2250803859
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3,
    "p":0.2826086957,
    "f1":0.2910447761
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1666666667,
    "p":0.1304347826,
    "f1":0.1463414634
  }
}