{
  "title":"How to Clean Tiles",
  "url":"https://www.wikihow.com/Clean-Tiles",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "methods":[
    {
      "name":"Cleaning Tile Floors",
      "steps":[
        {
          "headline":"Sweep up any dust and dirt with a dustpan and brush.",
          "description":"Use the brush to push any debris and dust into the dustpan. This avoids you spreading the dirt around the floor when you mop it later. If you don’t have a dustpan and brush, use a broom instead."
        },
        {
          "headline":"Mix water and tile cleaner in a bucket.",
          "description":"Choose a tile cleaner that is designed for your type of tiles. For example, look for a commercial cleaner marketed as “ceramic-friendly” or “safe for stone floors.” Fill a mop bucket with water and add the tile cleaner, as directed on the back of the container. Purchase tile cleaner from a cleaning store. Most tile cleaners require approximately 1 capful of tile cleaner per bucket of water. Avoid using citrus cleaners on stone as this can damage the tiles. Try not to use cleaners containing soap or detergent, as these can make your tile floors slippery. If you want to make your own tile cleaner, mix equal parts of vinegar and water in a bucket. This can be used on all types of tiles."
        },
        {
          "headline":"Wipe the cleaner over the tiles with a mop.",
          "description":"Dip the mop into the bucket of water and tile cleaner, and then squeeze out any excess liquid to avoid drips. Push the mop back and forth over the entire area until the tiles are clean. Press the mop down firmly when cleaning any stained areas, as the tile cleaner and the pressure of the mop will help to remove the stains. This process removes the dirt and sanitizes the tiles. A sponge mop works best for this method; however, any mop will do the job. Change the water in your bucket if it turns brown or grey so you don’t leave a film on your tiles."
        },
        {
          "headline":"Buff and dry the tiles with an old towel.",
          "description":"Rub an old towel over the tiles to dry the area. Press down on the towel while you rub it back and forth to buff the tiles and give them a shiny clean look."
        }
      ]
    },
    {
      "name":"Removing Greasy Marks from Tiles",
      "steps":[
        {
          "headline":"Wipe up oil splatters as soon as they happen, if possible.",
          "description":"Tile splashbacks look fantastic but can get greasy quickly. Oil marks are easiest to remove when they are fresh. If you notice oil splashing on the tiles while you are cooking, use a paper towel to blot the oil. If you don’t have a paper towel on hand, use a clean dishcloth instead. This method will remove greasy marks from all types of tiles."
        },
        {
          "headline":"Fill a bucket with warm water and 2 drops of dishwashing liquid.",
          "description":"If you notice greasy marks on the tiles that have likely been there a while, use this method to get rid of them. The warm water and dishwashing liquid help to break down the oil and remove the stains. Add the water and dishwashing liquid into the bucket and then use your hand to gently stir them together. Any dishwashing liquid or detergent works for this method."
        },
        {
          "headline":"Dip a sponge into the soapy water and use it to wipe up the grease.",
          "description":"Soak the sponge in the water and then squeeze it to remove any drips. Press the sponge onto the greasy marks for 5 seconds and then wipe in circular motions until all the marks are gone. If you are cleaning a large area, dunk your sponge in the soapy water regularly to ensure that it has fresh dish soap on it. If there’s is a lot of excess build-up on your tiles, you may need to clean with a store-bought degreaser or use a vinegar solution."
        },
        {
          "headline":"Wipe the soap suds off the tiles with warm water and a dishcloth.",
          "description":"Dunk a clean dishcloth in warm water and wring it out to remove any excess water. Wipe the entire tile surface until all the soap suds are gone. If the dishcloth get soapy, rinse it in warm water and then carry on wiping the tiles."
        },
        {
          "headline":"Dry the area with a tea towel.",
          "description":"This avoids the tiles from growing mold or mildew. Use a clean tea towel to dry all the moisture from the tiles and grout. If you don’t have spare tea towel, use paper towels instead."
        }
      ]
    },
    {
      "name":"Cleaning Grout with Vinegar and Baking Soda",
      "steps":[
        {
          "headline":"Mix 1  c (240 mL) of vinegar and 1  c (240 mL) of water in a spray bottle.",
          "description":"Measure the vinegar and water into a spray bottle. Screw the lid on tightly and then shake the spray bottle vigorously for 5 seconds to combine the water and vinegar. Malt vinegar and white vinegar both work well for this method. This method works on all types of tiles and surfaces, such as flooring, backsplashes, or countertops."
        },
        {
          "headline":"Spray the solution liberally over the grout and let it sit for 5 minutes.",
          "description":"Ensure that all the grout is coated with the water and vinegar spray. Leave it for 5 minutes to soak into the grout."
        },
        {
          "headline":"Mix 1 cup (180 g) of baking soda and ½ cup (125 mL) of water in a bowl.",
          "description":"Measure the baking soda and water into a small bowl. Use a spoon to stir them together until they are fully combined and form a paste. If you are cleaning a very small area, halve this recipe."
        },
        {
          "headline":"Scrub the paste into the grout with a grout brush.",
          "description":"A grout brush is a thin brush that is designed to easily remove the dirt from between tiles. Dip the brush into the baking soda paste and then scrub it over the tiles until all the dirt is gone. Use a scrubbing brush or a toothbrush if you don’t have a grout brush."
        },
        {
          "headline":"Spray the vinegar solution over the areas that you have scrubbed.",
          "description":"The vinegar will mix with the baking soda paste and start bubbling vigorously. This chemical reaction helps to dissolve any remaining dirt and grime from the grout. Spray enough vinegar solution to completely cover the baking soda paste."
        },
        {
          "headline":"Use warm water and a dishcloth to wipe up the baking soda and vinegar.",
          "description":"Dip a clean dishcloth in water and then squeeze it to remove any excess water. Wipe up all the baking soda and vinegar paste from the grout. Rinse your cloth after each wipe to avoid spreading the baking soda over the tiles. This also helps to remove the vinegar smell from the grout."
        }
      ]
    }
  ],
  "text":" Cleaning Tile Floors Sweep up any dust and dirt with a dustpan and brush. Use the brush to push any debris and dust into the dustpan. This avoids you spreading the dirt around the floor when you mop it later. If you don’t have a dustpan and brush, use a broom instead. Mix water and tile cleaner in a bucket. Choose a tile cleaner that is designed for your type of tiles. For example, look for a commercial cleaner marketed as “ceramic-friendly” or “safe for stone floors.” Fill a mop bucket with water and add the tile cleaner, as directed on the back of the container. Purchase tile cleaner from a cleaning store. Most tile cleaners require approximately 1 capful of tile cleaner per bucket of water. Avoid using citrus cleaners on stone as this can damage the tiles. Try not to use cleaners containing soap or detergent, as these can make your tile floors slippery. If you want to make your own tile cleaner, mix equal parts of vinegar and water in a bucket. This can be used on all types of tiles. Wipe the cleaner over the tiles with a mop. Dip the mop into the bucket of water and tile cleaner, and then squeeze out any excess liquid to avoid drips. Push the mop back and forth over the entire area until the tiles are clean. Press the mop down firmly when cleaning any stained areas, as the tile cleaner and the pressure of the mop will help to remove the stains. This process removes the dirt and sanitizes the tiles. A sponge mop works best for this method; however, any mop will do the job. Change the water in your bucket if it turns brown or grey so you don’t leave a film on your tiles. Buff and dry the tiles with an old towel. Rub an old towel over the tiles to dry the area. Press down on the towel while you rub it back and forth to buff the tiles and give them a shiny clean look. Removing Greasy Marks from Tiles Wipe up oil splatters as soon as they happen, if possible. Tile splashbacks look fantastic but can get greasy quickly. Oil marks are easiest to remove when they are fresh. If you notice oil splashing on the tiles while you are cooking, use a paper towel to blot the oil. If you don’t have a paper towel on hand, use a clean dishcloth instead. This method will remove greasy marks from all types of tiles. Fill a bucket with warm water and 2 drops of dishwashing liquid. If you notice greasy marks on the tiles that have likely been there a while, use this method to get rid of them. The warm water and dishwashing liquid help to break down the oil and remove the stains. Add the water and dishwashing liquid into the bucket and then use your hand to gently stir them together. Any dishwashing liquid or detergent works for this method. Dip a sponge into the soapy water and use it to wipe up the grease. Soak the sponge in the water and then squeeze it to remove any drips. Press the sponge onto the greasy marks for 5 seconds and then wipe in circular motions until all the marks are gone. If you are cleaning a large area, dunk your sponge in the soapy water regularly to ensure that it has fresh dish soap on it. If there’s is a lot of excess build-up on your tiles, you may need to clean with a store-bought degreaser or use a vinegar solution. Wipe the soap suds off the tiles with warm water and a dishcloth. Dunk a clean dishcloth in warm water and wring it out to remove any excess water. Wipe the entire tile surface until all the soap suds are gone. If the dishcloth get soapy, rinse it in warm water and then carry on wiping the tiles. Dry the area with a tea towel. This avoids the tiles from growing mold or mildew. Use a clean tea towel to dry all the moisture from the tiles and grout. If you don’t have spare tea towel, use paper towels instead. Cleaning Grout with Vinegar and Baking Soda Mix 1  c (240 mL) of vinegar and 1  c (240 mL) of water in a spray bottle. Measure the vinegar and water into a spray bottle. Screw the lid on tightly and then shake the spray bottle vigorously for 5 seconds to combine the water and vinegar. Malt vinegar and white vinegar both work well for this method. This method works on all types of tiles and surfaces, such as flooring, backsplashes, or countertops. Spray the solution liberally over the grout and let it sit for 5 minutes. Ensure that all the grout is coated with the water and vinegar spray. Leave it for 5 minutes to soak into the grout. Mix 1 cup (180 g) of baking soda and ½ cup (125 mL) of water in a bowl. Measure the baking soda and water into a small bowl. Use a spoon to stir them together until they are fully combined and form a paste. If you are cleaning a very small area, halve this recipe. Scrub the paste into the grout with a grout brush. A grout brush is a thin brush that is designed to easily remove the dirt from between tiles. Dip the brush into the baking soda paste and then scrub it over the tiles until all the dirt is gone. Use a scrubbing brush or a toothbrush if you don’t have a grout brush. Spray the vinegar solution over the areas that you have scrubbed. The vinegar will mix with the baking soda paste and start bubbling vigorously. This chemical reaction helps to dissolve any remaining dirt and grime from the grout. Spray enough vinegar solution to completely cover the baking soda paste. Use warm water and a dishcloth to wipe up the baking soda and vinegar. Dip a clean dishcloth in water and then squeeze it to remove any excess water. Wipe up all the baking soda and vinegar paste from the grout. Rinse your cloth after each wipe to avoid spreading the baking soda over the tiles. This also helps to remove the vinegar smell from the grout.",
  "sentences":[
    " Cleaning Tile Floors Sweep up any dust and dirt with a dustpan and brush.",
    "Use the brush to push any debris and dust into the dustpan.",
    "This avoids you spreading the dirt around the floor when you mop it later.",
    "If you don’t have a dustpan and brush, use a broom instead.",
    "Mix water and tile cleaner in a bucket.",
    "Choose a tile cleaner that is designed for your type of tiles.",
    "For example, look for a commercial cleaner marketed as “ceramic-friendly” or “safe for stone floors.” Fill a mop bucket with water and add the tile cleaner, as directed on the back of the container.",
    "Purchase tile cleaner from a cleaning store.",
    "Most tile cleaners require approximately 1 capful of tile cleaner per bucket of water.",
    "Avoid using citrus cleaners on stone as this can damage the tiles.",
    "Try not to use cleaners containing soap or detergent, as these can make your tile floors slippery.",
    "If you want to make your own tile cleaner, mix equal parts of vinegar and water in a bucket.",
    "This can be used on all types of tiles.",
    "Wipe the cleaner over the tiles with a mop.",
    "Dip the mop into the bucket of water and tile cleaner, and then squeeze out any excess liquid to avoid drips.",
    "Push the mop back and forth over the entire area until the tiles are clean.",
    "Press the mop down firmly when cleaning any stained areas, as the tile cleaner and the pressure of the mop will help to remove the stains.",
    "This process removes the dirt and sanitizes the tiles.",
    "A sponge mop works best for this method; however, any mop will do the job.",
    "Change the water in your bucket if it turns brown or grey so you don’t leave a film on your tiles.",
    "Buff and dry the tiles with an old towel.",
    "Rub an old towel over the tiles to dry the area.",
    "Press down on the towel while you rub it back and forth to buff the tiles and give them a shiny clean look.",
    "Removing Greasy Marks from Tiles Wipe up oil splatters as soon as they happen, if possible.",
    "Tile splashbacks look fantastic but can get greasy quickly.",
    "Oil marks are easiest to remove when they are fresh.",
    "If you notice oil splashing on the tiles while you are cooking, use a paper towel to blot the oil.",
    "If you don’t have a paper towel on hand, use a clean dishcloth instead.",
    "This method will remove greasy marks from all types of tiles.",
    "Fill a bucket with warm water and 2 drops of dishwashing liquid.",
    "If you notice greasy marks on the tiles that have likely been there a while, use this method to get rid of them.",
    "The warm water and dishwashing liquid help to break down the oil and remove the stains.",
    "Add the water and dishwashing liquid into the bucket and then use your hand to gently stir them together.",
    "Any dishwashing liquid or detergent works for this method.",
    "Dip a sponge into the soapy water and use it to wipe up the grease.",
    "Soak the sponge in the water and then squeeze it to remove any drips.",
    "Press the sponge onto the greasy marks for 5 seconds and then wipe in circular motions until all the marks are gone.",
    "If you are cleaning a large area, dunk your sponge in the soapy water regularly to ensure that it has fresh dish soap on it.",
    "If there’s is a lot of excess build-up on your tiles, you may need to clean with a store-bought degreaser or use a vinegar solution.",
    "Wipe the soap suds off the tiles with warm water and a dishcloth.",
    "Dunk a clean dishcloth in warm water and wring it out to remove any excess water.",
    "Wipe the entire tile surface until all the soap suds are gone.",
    "If the dishcloth get soapy, rinse it in warm water and then carry on wiping the tiles.",
    "Dry the area with a tea towel.",
    "This avoids the tiles from growing mold or mildew.",
    "Use a clean tea towel to dry all the moisture from the tiles and grout.",
    "If you don’t have spare tea towel, use paper towels instead.",
    "Cleaning Grout with Vinegar and Baking Soda Mix 1  c (240 mL) of vinegar and 1  c (240 mL) of water in a spray bottle.",
    "Measure the vinegar and water into a spray bottle.",
    "Screw the lid on tightly and then shake the spray bottle vigorously for 5 seconds to combine the water and vinegar.",
    "Malt vinegar and white vinegar both work well for this method.",
    "This method works on all types of tiles and surfaces, such as flooring, backsplashes, or countertops.",
    "Spray the solution liberally over the grout and let it sit for 5 minutes.",
    "Ensure that all the grout is coated with the water and vinegar spray.",
    "Leave it for 5 minutes to soak into the grout.",
    "Mix 1 cup (180 g) of baking soda and ½ cup (125 mL) of water in a bowl.",
    "Measure the baking soda and water into a small bowl.",
    "Use a spoon to stir them together until they are fully combined and form a paste.",
    "If you are cleaning a very small area, halve this recipe.",
    "Scrub the paste into the grout with a grout brush.",
    "A grout brush is a thin brush that is designed to easily remove the dirt from between tiles.",
    "Dip the brush into the baking soda paste and then scrub it over the tiles until all the dirt is gone.",
    "Use a scrubbing brush or a toothbrush if you don’t have a grout brush.",
    "Spray the vinegar solution over the areas that you have scrubbed.",
    "The vinegar will mix with the baking soda paste and start bubbling vigorously.",
    "This chemical reaction helps to dissolve any remaining dirt and grime from the grout.",
    "Spray enough vinegar solution to completely cover the baking soda paste.",
    "Use warm water and a dishcloth to wipe up the baking soda and vinegar.",
    "Dip a clean dishcloth in water and then squeeze it to remove any excess water.",
    "Wipe up all the baking soda and vinegar paste from the grout.",
    "Rinse your cloth after each wipe to avoid spreading the baking soda over the tiles.",
    "This also helps to remove the vinegar smell from the grout."
  ],
  "tyn_section":[
    "Dustpan and brush",
    "Tile cleaner",
    "Mop",
    "Old towel",
    "Cleaning Greasy Walls",
    "Paper towels",
    "Sponge",
    "Bucket",
    "Dishwashing liquid",
    "Dishcloth",
    "Tea towel",
    "Grout brush",
    "Water",
    "Baking soda",
    "Spray bottle",
    "Vinegar",
    "Spoon"
  ],
  "tyn_model":[
    "water",
    "vinegar",
    "baking soda",
    "tile cleaner",
    "bucket",
    "mop",
    "dishcloth",
    "dishwashing liquid",
    "sponge",
    "towel",
    "tea towel",
    "spray bottle",
    "grout brush",
    "dustpan",
    "oil",
    "paper towel",
    "broom",
    "“ceramic",
    "” or",
    "“safe",
    "” fill",
    "mop bucket",
    "tile cleaners",
    "sponge mop",
    "dish soap",
    "malt vinegar",
    "white vinegar",
    "bowl",
    "spoon",
    "scrubbing brush",
    "dishcloth to"
  ],
  "simple_metrics":{
    "r":0.7647058824,
    "p":0.4193548387,
    "f1":0.5416666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8235294118,
    "p":0.6129032258,
    "f1":0.7027741083
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9411764706,
    "p":0.7419354839,
    "f1":0.8297632469
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7647058824,
    "p":0.4193548387,
    "f1":0.5416666667
  }
}