{
  "title":"How to Can Syrup",
  "url":"https://www.wikihow.com/Can-Syrup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques"
  ],
  "methods":[
    {
      "name":"Cooking Fruit Syrup",
      "steps":[
        {
          "headline":"Wash and prepare your fruit.",
          "description":"Decide what kind of fruit syrup you'd like to make. Wash your fresh fruit and trim off any stems, peels, or ends. Roughly chop the fruit and place it in a large pot. Keep track of how many cups of fruit you use. To make a fruit syrup, you'll use four parts fruit, two parts sugar, and one part water. For example, if you want to make a blueberry syrup, you could use 4 cups of blueberries, 2 cups of sugar, and 1 cup of water. Or if you're using the metric system, try 400 g of blueberries, 200 g of sugar, and 100 ml of water. Consider making syrup using strawberries, raspberries, blueberries, blackberries, rhubarb, or oranges."
        },
        {
          "headline":"Cook the fruit with the sugar and water.",
          "description":"Add two parts of sugar for every four parts of fruit you prepared. Stir in one part of water and turn the heat on to medium. Let the fruit mixture bubble gently. Simmer the mixture and stir it occasionally until the fruit is completely softened and has released extra liquid. This may take anywhere from 5 minutes to 20 or 30 minutes, depending on the type of fruit you're using. The liquid in the pot should thicken and become syrupy."
        },
        {
          "headline":"Strain and reserve the fruit liquid.",
          "description":"Place a fine mesh strainer over a measuring jug or bowl. Slowly pour the cooked fruit mixture into the strainer. The syrup should drain through the strainer. Discard the solids that are left in the strainer."
        },
        {
          "headline":"Stir in additional herbs or spices (optional).",
          "description":"If you'd like to add fresh herbs or spices to your syrups, you can stir them in now. Consider adding a few pinches of ground cinnamon or nutmeg. If you want to add herbs, consider adding:\nThyme\nBasil\nBay leaves"
        }
      ]
    },
    {
      "name":"Making Simple Syrup",
      "steps":[
        {
          "headline":"Make a simple syrup for canning fruit.",
          "description":"If you'll be canning fresh fruit (like plums or peaches) and want a sweet syrup to pour in the jars, make a simple syrup. You can create a thick, sweet syrup or a light, thin syrup. Just place the sugar and water in a pot and heat it over medium heat until the sugar dissolves. To make:\nHeavy syrup: use 4 1/4 cups of sugar (900 g) and 4 1/4 cups (1 liter) of water to make 7 cups (2.27 kg) of syrup\nMedium syrup: use 3 1/4 cups (650 g) of sugar and 5 cups (1.2 liters) of water to make 7 cups (2.27 kg)syrup\nLight syrup: use 2 1/4 cups (450 g) of sugar and 5 1/4 cups (1.25 liters) of water to make 6 1/2 cups (2.1 kg) syrup"
        },
        {
          "headline":"Consider adding fresh herbs or spices to the simple syrup.",
          "description":"For spiced preserved fruit, add a little ground cinnamon, nutmeg, allspice, or star anise. For slightly savory flavorings, you can add fresh sprigs of rosemary, thyme, basil or a few dried bay leaves. You can add the dried herbs or spices to the syrup itself or place the fresh sprigs directly into the jars."
        },
        {
          "headline":"Use the simple syrup to can fruit.",
          "description":"Place the fruit you'd like to preserve into your sterilized jars. Follow your recipe to prepare the fruit. Pour the simple syrup over the fruit in the jars until it comes 1/2-inch (12 mm) from the top. Apply warm lids and screw on the bands until they're fingertip tight. Process the jars in a water bath for 10 minutes. You can store properly canned fruit in simple syrup for up to one year."
        }
      ]
    },
    {
      "name":"Processing and Storing the Canned Syrup",
      "steps":[
        {
          "headline":"Prepare a water bath canner and sterilize half-pint jars.",
          "description":"Place a large water bath canner or pot on the stove. Place a wire rack in the bottom of the pot and fill the pot about three-quarters full of water. Bring the water to a boil. To sterilize the jars, you can either place several half-pint (250 ml) jars in the pot so they boil along with the water or you can run them through the dishwasher. Keep the jars warm while you're preparing the syrup or fruit."
        },
        {
          "headline":"Simmer the lids.",
          "description":"Put new lids that have a fresh seal into a small pot. Cover them with water and turn the heat to medium. Let the lids simmer while you prepare the syrup. This will soften the lids so they create a good seal with the jars. You won't need to sterilize or heat the bands. Just have clean bands out on your work space."
        },
        {
          "headline":"Fill the sterilized jars with the syrup or fruit.",
          "description":"Set the warm, empty jars on a kitchen towel on your work space. Place a funnel in the jar and use a ladle to carefully fill the jars. Leave 1/2 inch (12 mm) headspace at the top of the jar. Remove the funnel and use a clean cloth to wipe around the rim of the jar. Repeat this until you've used all of the syrup. Keep in mind that if you aren't able to completely fill the last jar, you'll need to store it in the fridge and use it within several weeks. If you have more than 1/2 inch (12 mm) headspace, there will be too much space in the jar to safely can the syrup."
        },
        {
          "headline":"Apply the lids and bands.",
          "description":"Carefully lift the warm lids from the small pot. Place a lid on each jar and screw a clean band on it. Avoid screwing the band on tightly or the air in the jar will not have a way to escape while it's processing. The band should only be fingertip tight. You may want to use a kitchen towel to handle the jars since they will be hot."
        },
        {
          "headline":"Process the jars.",
          "description":"Turn the heat to high on your water bath canner and gently lower the filled jars into the water. They should set on the wire rack and the jars shouldn't be touching each other. Bring the water to a boil and put the lid on the pot. Process (boil) the jars for 10 minutes."
        },
        {
          "headline":"Cool the jars and store the syrup.",
          "description":"Turn off the heat and use a jar lifter to carefully pull the canned syrup out of the water bath canner. Place the jars on a kitchen towel on your work space. Let the jars cool completely. Check the seals the next day to ensure that the jars were processed correctly. You can store the jars of syrup for up to one year. Remember to check the seals before you open the syrup. Touch the center of the lid to test the seal. If it springs back or is flexible, the jar is not sealed properly. You could also look at the lid at eye level. It should bend down slightly in the center. If it's flat or bulging up, it's not sealed properly."
        }
      ]
    }
  ],
  "text":" Cooking Fruit Syrup Wash and prepare your fruit. Decide what kind of fruit syrup you'd like to make. Wash your fresh fruit and trim off any stems, peels, or ends. Roughly chop the fruit and place it in a large pot. Keep track of how many cups of fruit you use. To make a fruit syrup, you'll use four parts fruit, two parts sugar, and one part water. For example, if you want to make a blueberry syrup, you could use 4 cups of blueberries, 2 cups of sugar, and 1 cup of water. Or if you're using the metric system, try 400 g of blueberries, 200 g of sugar, and 100 ml of water. Consider making syrup using strawberries, raspberries, blueberries, blackberries, rhubarb, or oranges. Cook the fruit with the sugar and water. Add two parts of sugar for every four parts of fruit you prepared. Stir in one part of water and turn the heat on to medium. Let the fruit mixture bubble gently. Simmer the mixture and stir it occasionally until the fruit is completely softened and has released extra liquid. This may take anywhere from 5 minutes to 20 or 30 minutes, depending on the type of fruit you're using. The liquid in the pot should thicken and become syrupy. Strain and reserve the fruit liquid. Place a fine mesh strainer over a measuring jug or bowl. Slowly pour the cooked fruit mixture into the strainer. The syrup should drain through the strainer. Discard the solids that are left in the strainer. Stir in additional herbs or spices (optional). If you'd like to add fresh herbs or spices to your syrups, you can stir them in now. Consider adding a few pinches of ground cinnamon or nutmeg. If you want to add herbs, consider adding:\nThyme\nBasil\nBay leaves Making Simple Syrup Make a simple syrup for canning fruit. If you'll be canning fresh fruit (like plums or peaches) and want a sweet syrup to pour in the jars, make a simple syrup. You can create a thick, sweet syrup or a light, thin syrup. Just place the sugar and water in a pot and heat it over medium heat until the sugar dissolves. To make:\nHeavy syrup: use 4 1/4 cups of sugar (900 g) and 4 1/4 cups (1 liter) of water to make 7 cups (2.27 kg) of syrup\nMedium syrup: use 3 1/4 cups (650 g) of sugar and 5 cups (1.2 liters) of water to make 7 cups (2.27 kg)syrup\nLight syrup: use 2 1/4 cups (450 g) of sugar and 5 1/4 cups (1.25 liters) of water to make 6 1/2 cups (2.1 kg) syrup Consider adding fresh herbs or spices to the simple syrup. For spiced preserved fruit, add a little ground cinnamon, nutmeg, allspice, or star anise. For slightly savory flavorings, you can add fresh sprigs of rosemary, thyme, basil or a few dried bay leaves. You can add the dried herbs or spices to the syrup itself or place the fresh sprigs directly into the jars. Use the simple syrup to can fruit. Place the fruit you'd like to preserve into your sterilized jars. Follow your recipe to prepare the fruit. Pour the simple syrup over the fruit in the jars until it comes 1/2-inch (12 mm) from the top. Apply warm lids and screw on the bands until they're fingertip tight. Process the jars in a water bath for 10 minutes. You can store properly canned fruit in simple syrup for up to one year. Processing and Storing the Canned Syrup Prepare a water bath canner and sterilize half-pint jars. Place a large water bath canner or pot on the stove. Place a wire rack in the bottom of the pot and fill the pot about three-quarters full of water. Bring the water to a boil. To sterilize the jars, you can either place several half-pint (250 ml) jars in the pot so they boil along with the water or you can run them through the dishwasher. Keep the jars warm while you're preparing the syrup or fruit. Simmer the lids. Put new lids that have a fresh seal into a small pot. Cover them with water and turn the heat to medium. Let the lids simmer while you prepare the syrup. This will soften the lids so they create a good seal with the jars. You won't need to sterilize or heat the bands. Just have clean bands out on your work space. Fill the sterilized jars with the syrup or fruit. Set the warm, empty jars on a kitchen towel on your work space. Place a funnel in the jar and use a ladle to carefully fill the jars. Leave 1/2 inch (12 mm) headspace at the top of the jar. Remove the funnel and use a clean cloth to wipe around the rim of the jar. Repeat this until you've used all of the syrup. Keep in mind that if you aren't able to completely fill the last jar, you'll need to store it in the fridge and use it within several weeks. If you have more than 1/2 inch (12 mm) headspace, there will be too much space in the jar to safely can the syrup. Apply the lids and bands. Carefully lift the warm lids from the small pot. Place a lid on each jar and screw a clean band on it. Avoid screwing the band on tightly or the air in the jar will not have a way to escape while it's processing. The band should only be fingertip tight. You may want to use a kitchen towel to handle the jars since they will be hot. Process the jars. Turn the heat to high on your water bath canner and gently lower the filled jars into the water. They should set on the wire rack and the jars shouldn't be touching each other. Bring the water to a boil and put the lid on the pot. Process (boil) the jars for 10 minutes. Cool the jars and store the syrup. Turn off the heat and use a jar lifter to carefully pull the canned syrup out of the water bath canner. Place the jars on a kitchen towel on your work space. Let the jars cool completely. Check the seals the next day to ensure that the jars were processed correctly. You can store the jars of syrup for up to one year. Remember to check the seals before you open the syrup. Touch the center of the lid to test the seal. If it springs back or is flexible, the jar is not sealed properly. You could also look at the lid at eye level. It should bend down slightly in the center. If it's flat or bulging up, it's not sealed properly.",
  "sentences":[
    " Cooking Fruit Syrup Wash and prepare your fruit.",
    "Decide what kind of fruit syrup you'd like to make.",
    "Wash your fresh fruit and trim off any stems, peels, or ends.",
    "Roughly chop the fruit and place it in a large pot.",
    "Keep track of how many cups of fruit you use.",
    "To make a fruit syrup, you'll use four parts fruit, two parts sugar, and one part water.",
    "For example, if you want to make a blueberry syrup, you could use 4 cups of blueberries, 2 cups of sugar, and 1 cup of water.",
    "Or if you're using the metric system, try 400 g of blueberries, 200 g of sugar, and 100 ml of water.",
    "Consider making syrup using strawberries, raspberries, blueberries, blackberries, rhubarb, or oranges.",
    "Cook the fruit with the sugar and water.",
    "Add two parts of sugar for every four parts of fruit you prepared.",
    "Stir in one part of water and turn the heat on to medium.",
    "Let the fruit mixture bubble gently.",
    "Simmer the mixture and stir it occasionally until the fruit is completely softened and has released extra liquid.",
    "This may take anywhere from 5 minutes to 20 or 30 minutes, depending on the type of fruit you're using.",
    "The liquid in the pot should thicken and become syrupy.",
    "Strain and reserve the fruit liquid.",
    "Place a fine mesh strainer over a measuring jug or bowl.",
    "Slowly pour the cooked fruit mixture into the strainer.",
    "The syrup should drain through the strainer.",
    "Discard the solids that are left in the strainer.",
    "Stir in additional herbs or spices (optional).",
    "If you'd like to add fresh herbs or spices to your syrups, you can stir them in now.",
    "Consider adding a few pinches of ground cinnamon or nutmeg.",
    "If you want to add herbs, consider adding:\nThyme\nBasil\nBay leaves Making Simple Syrup Make a simple syrup for canning fruit.",
    "If you'll be canning fresh fruit (like plums or peaches) and want a sweet syrup to pour in the jars, make a simple syrup.",
    "You can create a thick, sweet syrup or a light, thin syrup.",
    "Just place the sugar and water in a pot and heat it over medium heat until the sugar dissolves.",
    "To make:\nHeavy syrup: use 4 1/4 cups of sugar (900 g) and 4 1/4 cups (1 liter) of water to make 7 cups (2.27 kg) of syrup\nMedium syrup: use 3 1/4 cups (650 g) of sugar and 5 cups (1.2 liters) of water to make 7 cups (2.27 kg)syrup\nLight syrup: use 2 1/4 cups (450 g) of sugar and 5 1/4 cups (1.25 liters) of water to make 6 1/2 cups (2.1 kg) syrup Consider adding fresh herbs or spices to the simple syrup.",
    "For spiced preserved fruit, add a little ground cinnamon, nutmeg, allspice, or star anise.",
    "For slightly savory flavorings, you can add fresh sprigs of rosemary, thyme, basil or a few dried bay leaves.",
    "You can add the dried herbs or spices to the syrup itself or place the fresh sprigs directly into the jars.",
    "Use the simple syrup to can fruit.",
    "Place the fruit you'd like to preserve into your sterilized jars.",
    "Follow your recipe to prepare the fruit.",
    "Pour the simple syrup over the fruit in the jars until it comes 1/2-inch (12 mm) from the top.",
    "Apply warm lids and screw on the bands until they're fingertip tight.",
    "Process the jars in a water bath for 10 minutes.",
    "You can store properly canned fruit in simple syrup for up to one year.",
    "Processing and Storing the Canned Syrup Prepare a water bath canner and sterilize half-pint jars.",
    "Place a large water bath canner or pot on the stove.",
    "Place a wire rack in the bottom of the pot and fill the pot about three-quarters full of water.",
    "Bring the water to a boil.",
    "To sterilize the jars, you can either place several half-pint (250 ml) jars in the pot so they boil along with the water or you can run them through the dishwasher.",
    "Keep the jars warm while you're preparing the syrup or fruit.",
    "Simmer the lids.",
    "Put new lids that have a fresh seal into a small pot.",
    "Cover them with water and turn the heat to medium.",
    "Let the lids simmer while you prepare the syrup.",
    "This will soften the lids so they create a good seal with the jars.",
    "You won't need to sterilize or heat the bands.",
    "Just have clean bands out on your work space.",
    "Fill the sterilized jars with the syrup or fruit.",
    "Set the warm, empty jars on a kitchen towel on your work space.",
    "Place a funnel in the jar and use a ladle to carefully fill the jars.",
    "Leave 1/2 inch (12 mm) headspace at the top of the jar.",
    "Remove the funnel and use a clean cloth to wipe around the rim of the jar.",
    "Repeat this until you've used all of the syrup.",
    "Keep in mind that if you aren't able to completely fill the last jar, you'll need to store it in the fridge and use it within several weeks.",
    "If you have more than 1/2 inch (12 mm) headspace, there will be too much space in the jar to safely can the syrup.",
    "Apply the lids and bands.",
    "Carefully lift the warm lids from the small pot.",
    "Place a lid on each jar and screw a clean band on it.",
    "Avoid screwing the band on tightly or the air in the jar will not have a way to escape while it's processing.",
    "The band should only be fingertip tight.",
    "You may want to use a kitchen towel to handle the jars since they will be hot.",
    "Process the jars.",
    "Turn the heat to high on your water bath canner and gently lower the filled jars into the water.",
    "They should set on the wire rack and the jars shouldn't be touching each other.",
    "Bring the water to a boil and put the lid on the pot.",
    "Process (boil) the jars for 10 minutes.",
    "Cool the jars and store the syrup.",
    "Turn off the heat and use a jar lifter to carefully pull the canned syrup out of the water bath canner.",
    "Place the jars on a kitchen towel on your work space.",
    "Let the jars cool completely.",
    "Check the seals the next day to ensure that the jars were processed correctly.",
    "You can store the jars of syrup for up to one year.",
    "Remember to check the seals before you open the syrup.",
    "Touch the center of the lid to test the seal.",
    "If it springs back or is flexible, the jar is not sealed properly.",
    "You could also look at the lid at eye level.",
    "It should bend down slightly in the center.",
    "If it's flat or bulging up, it's not sealed properly."
  ],
  "tyn_section":[
    "Large pot",
    "Fine mesh strainer",
    "Measuring jug or bowl",
    "Water bath canner",
    "Jar lifter",
    "Funnel",
    "Kitchen towels",
    "Small pot",
    "Tongs",
    "Wire rack",
    "Timer",
    "Ladle"
  ],
  "tyn_model":[
    "water",
    "sugar",
    "simple syrup",
    "syrup",
    "pot",
    "jars",
    "water bath canner",
    "fruit syrup",
    "blueberries",
    "strainer",
    "herbs",
    "fruit",
    "nutmeg",
    "thyme",
    "basil",
    "small pot",
    "funnel",
    "large pot",
    "blueberry syrup",
    "strawberries",
    "blackberries",
    "oranges",
    "fine mesh strainer",
    "measuring jug",
    "bowl",
    "ground cinnamon",
    "cinnamon",
    "allspice",
    "star anise",
    "rosemary",
    "water bath",
    "stove",
    "kitchen towel",
    "ladle",
    "jar lifter",
    "jar"
  ],
  "simple_metrics":{
    "r":0.5833333333,
    "p":0.1944444444,
    "f1":0.2916666667,
    "avg_pos":0.4722222222
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.3055555556,
    "f1":0.419047619
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.3888888889,
    "f1":0.512195122
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5833333333,
    "p":0.2222222222,
    "f1":0.3218390805
  }
}