{
  "title":"How to Make Quinoa Crusted Fish",
  "url":"https://www.wikihow.com/Make-Quinoa-Crusted-Fish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Preparing the Quinoa",
      "steps":[
        {
          "headline":"Prepare your oven and baking sheet.",
          "description":"First, line a large baking sheet with some parchment paper. Then give the paper a light spray of cooking spray and set it aside. Next, set the oven to 425 degrees Fahrenheit (218 degrees Celsius) if you’re making your fish to serve immediately, as opposed to prepping a meal to serve later on in the week."
        },
        {
          "headline":"Saute the quinoa.",
          "description":"While the oven continues to preheat, coat the bottom of a large skillet with a light layer of vegetable oil. Turn the burner to medium-high heat. Once the skillet heats up, add the quinoa. Stir periodically for three to four minutes, or until the quinoa begins to toast."
        },
        {
          "headline":"Grind the quinoa.",
          "description":"Give it about ten minutes to cool off, since steam from hot foods can upset the lid to your food processor while you’re using it. Once it’s cooled down, add it to the processor. Pulse for about 20 seconds."
        }
      ]
    },
    {
      "name":"Battering Your Fish",
      "steps":[
        {
          "headline":"Slice your fish, if desired.",
          "description":"How to present your fish is up to you, so follow your own instincts. For bite-sized pieces, slice your fillets up into 1-inch (2.5 cm) pieces. But if you’d rather serve your fillets whole, go right ahead and skip this step."
        },
        {
          "headline":"Set up your station.",
          "description":"First, in one shallow dish, combine the flour, paprika, thyme, and half a teaspoon of your pepper. Then break your egg in a second shallow dish and whisk in the buttermilk until they’re evenly mixed. Finally, pour your ground quinoa into a third dish."
        },
        {
          "headline":"Batter your fish.",
          "description":"With each piece of fish, dredge in the flour mixture first until all sides are covered. Give it a shake to get rid of the excess. Then dunk it into the egg mix. Next, dredge it through the quinoa, adding pressure as you do so to ensure the quinoa sticks to it. Place it on your baking sheet once finished."
        }
      ]
    },
    {
      "name":"Cooking Your Fish While Making Your Sauce",
      "steps":[
        {
          "headline":"Freeze your fish for later if desired.",
          "description":"At this point, you can set the fish aside to cook later on if you like to prepare meals in advance. Simply place the fish on your tray and place it in the freezer. Check periodically until the fish has frozen solid. Once it has, transfer it to sealable freezer bags and put it back in the freezer until it’s time to bake. Once you’re ready to cook, there’s no need to thaw them."
        },
        {
          "headline":"Bake your fish.",
          "description":"First, give the fish a light spray with more cooking spray. Then place the baking sheet in the oven once it’s finished preheating. Set a timer for seven minutes."
        },
        {
          "headline":"Make your tartar sauce.",
          "description":"In a small bowl, combine the mayo, yogurt, vinegar, and mustard until evenly mixed. Then add the pickles, dill, and remaining pepper. Stir until evenly combined."
        },
        {
          "headline":"Flip the fish and continue baking until done.",
          "description":"At the seven-minute mark, remove the tray and turn each piece of fish over for an even bake. Return it to the oven and bake for another six to eight minutes, or until they’ve turned golden. Frozen fish may take a couple extra minutes to cook all the way through."
        }
      ]
    }
  ],
  "text":" Preparing the Quinoa Prepare your oven and baking sheet. First, line a large baking sheet with some parchment paper. Then give the paper a light spray of cooking spray and set it aside. Next, set the oven to 425 degrees Fahrenheit (218 degrees Celsius) if you’re making your fish to serve immediately, as opposed to prepping a meal to serve later on in the week. Saute the quinoa. While the oven continues to preheat, coat the bottom of a large skillet with a light layer of vegetable oil. Turn the burner to medium-high heat. Once the skillet heats up, add the quinoa. Stir periodically for three to four minutes, or until the quinoa begins to toast. Grind the quinoa. Give it about ten minutes to cool off, since steam from hot foods can upset the lid to your food processor while you’re using it. Once it’s cooled down, add it to the processor. Pulse for about 20 seconds. Battering Your Fish Slice your fish, if desired. How to present your fish is up to you, so follow your own instincts. For bite-sized pieces, slice your fillets up into 1-inch (2.5 cm) pieces. But if you’d rather serve your fillets whole, go right ahead and skip this step. Set up your station. First, in one shallow dish, combine the flour, paprika, thyme, and half a teaspoon of your pepper. Then break your egg in a second shallow dish and whisk in the buttermilk until they’re evenly mixed. Finally, pour your ground quinoa into a third dish. Batter your fish. With each piece of fish, dredge in the flour mixture first until all sides are covered. Give it a shake to get rid of the excess. Then dunk it into the egg mix. Next, dredge it through the quinoa, adding pressure as you do so to ensure the quinoa sticks to it. Place it on your baking sheet once finished. Cooking Your Fish While Making Your Sauce Freeze your fish for later if desired. At this point, you can set the fish aside to cook later on if you like to prepare meals in advance. Simply place the fish on your tray and place it in the freezer. Check periodically until the fish has frozen solid. Once it has, transfer it to sealable freezer bags and put it back in the freezer until it’s time to bake. Once you’re ready to cook, there’s no need to thaw them. Bake your fish. First, give the fish a light spray with more cooking spray. Then place the baking sheet in the oven once it’s finished preheating. Set a timer for seven minutes. Make your tartar sauce. In a small bowl, combine the mayo, yogurt, vinegar, and mustard until evenly mixed. Then add the pickles, dill, and remaining pepper. Stir until evenly combined. Flip the fish and continue baking until done. At the seven-minute mark, remove the tray and turn each piece of fish over for an even bake. Return it to the oven and bake for another six to eight minutes, or until they’ve turned golden. Frozen fish may take a couple extra minutes to cook all the way through.",
  "sentences":[
    " Preparing the Quinoa Prepare your oven and baking sheet.",
    "First, line a large baking sheet with some parchment paper.",
    "Then give the paper a light spray of cooking spray and set it aside.",
    "Next, set the oven to 425 degrees Fahrenheit (218 degrees Celsius) if you’re making your fish to serve immediately, as opposed to prepping a meal to serve later on in the week.",
    "Saute the quinoa.",
    "While the oven continues to preheat, coat the bottom of a large skillet with a light layer of vegetable oil.",
    "Turn the burner to medium-high heat.",
    "Once the skillet heats up, add the quinoa.",
    "Stir periodically for three to four minutes, or until the quinoa begins to toast.",
    "Grind the quinoa.",
    "Give it about ten minutes to cool off, since steam from hot foods can upset the lid to your food processor while you’re using it.",
    "Once it’s cooled down, add it to the processor.",
    "Pulse for about 20 seconds.",
    "Battering Your Fish Slice your fish, if desired.",
    "How to present your fish is up to you, so follow your own instincts.",
    "For bite-sized pieces, slice your fillets up into 1-inch (2.5 cm) pieces.",
    "But if you’d rather serve your fillets whole, go right ahead and skip this step.",
    "Set up your station.",
    "First, in one shallow dish, combine the flour, paprika, thyme, and half a teaspoon of your pepper.",
    "Then break your egg in a second shallow dish and whisk in the buttermilk until they’re evenly mixed.",
    "Finally, pour your ground quinoa into a third dish.",
    "Batter your fish.",
    "With each piece of fish, dredge in the flour mixture first until all sides are covered.",
    "Give it a shake to get rid of the excess.",
    "Then dunk it into the egg mix.",
    "Next, dredge it through the quinoa, adding pressure as you do so to ensure the quinoa sticks to it.",
    "Place it on your baking sheet once finished.",
    "Cooking Your Fish While Making Your Sauce Freeze your fish for later if desired.",
    "At this point, you can set the fish aside to cook later on if you like to prepare meals in advance.",
    "Simply place the fish on your tray and place it in the freezer.",
    "Check periodically until the fish has frozen solid.",
    "Once it has, transfer it to sealable freezer bags and put it back in the freezer until it’s time to bake.",
    "Once you’re ready to cook, there’s no need to thaw them.",
    "Bake your fish.",
    "First, give the fish a light spray with more cooking spray.",
    "Then place the baking sheet in the oven once it’s finished preheating.",
    "Set a timer for seven minutes.",
    "Make your tartar sauce.",
    "In a small bowl, combine the mayo, yogurt, vinegar, and mustard until evenly mixed.",
    "Then add the pickles, dill, and remaining pepper.",
    "Stir until evenly combined.",
    "Flip the fish and continue baking until done.",
    "At the seven-minute mark, remove the tray and turn each piece of fish over for an even bake.",
    "Return it to the oven and bake for another six to eight minutes, or until they’ve turned golden.",
    "Frozen fish may take a couple extra minutes to cook all the way through."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Oven",
    "Baking sheet",
    "Parchment paper",
    "Cooking spray",
    "Skillet",
    "Spoon for stirring",
    "Food processor",
    "Three shallow dishes"
  ],
  "tyn_model":[
    "fish",
    "oven",
    "quinoa",
    "baking sheet",
    "cooking spray",
    "flour",
    "pepper",
    "egg",
    "freezer",
    "parchment paper",
    "large skillet",
    "vegetable oil",
    "burner",
    "skillet",
    "food processor",
    "processor",
    "paprika",
    "thyme",
    "buttermilk",
    "freezer bags",
    "tartar sauce",
    "mayo",
    "yogurt",
    "vinegar",
    "mustard",
    "pickles",
    "dill",
    "tray"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.2142857143,
    "f1":0.3243243243,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.2857142857,
    "f1":0.4
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.2857142857,
    "f1":0.4
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.2142857143,
    "f1":0.3243243243
  }
}