{
  "title":"How to Clean a Roomba",
  "url":"https://www.wikihow.com/Clean-a-Roomba",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Cleaning Floors"
  ],
  "parts":[
    {
      "name":"Vacuuming the Tray and Filter",
      "steps":[
        {
          "headline":"Empty your Roomba.",
          "description":"On the rear of your Roomba there is a tray that fills with dirt and dust as it vacuums (also called the \"bin\"). Press the button on top of this tray and remove it. Dump the contents of this tray into the trashcan."
        },
        {
          "headline":"Remove the filter.",
          "description":"You should be able to see a red semi-circle inside the tray (which may be covered with gray dirt and dust). This is your filter. This filter will easily slide out of the tray, while remaining attached on one end. Slide this out, and knock any loose dirt/dust off into the trashcan."
        },
        {
          "headline":"Vacuum the tray and filter using a regular vacuum and the crevice tool.",
          "description":"Attach the crevice tool (the long, thin attachment) to the hose of a regular vacuum cleaner. Then turn the vacuum on and use this attachment to remove dirt and grime from the Roomba collection tray and filter."
        },
        {
          "headline":"Switch to the brush tool.",
          "description":"Remove the crevice tool from your vacuum hose, and instead attach the brush tool. Turn your vacuum back on and go over the filter and tray once again. This time, pay extra attention to the surface of the filter, the rubber seals, and the vents on the back of the tray. When you are finished, snap the filter back into place."
        }
      ]
    },
    {
      "name":"Cleaning the Side-sweeper, Brush, and Rubber Roller",
      "steps":[
        {
          "headline":"Remove the side-sweeper.",
          "description":"Turn the Roomba upside down, and locate the side-sweeper: a circular, three-pronged plastic piece at the top left of your Roomba. Using your Phillips screwdriver, remove the single screw that holds the side-sweeper in place, and remove the side-sweeper. Using your hands or your crevice tool, clean off any hair/debris that is attached to the side-sweeper and the place where the side-sweeper attaches."
        },
        {
          "headline":"Remove the front wheel.",
          "description":"The front wheel--positioned front and center on the bottom of your Roomba--should easily pop out. Use your hands to remove any hair or string attached to the wheel itself. Then use your vacuum with the crevice tool to vacuum the opening where the wheel goes."
        },
        {
          "headline":"Remove the brush.",
          "description":"On the bottom of your Roomba, you will notice a rectangular flap, that should lift open. Under this flap, you'll find your cylindrical brush, which is likely to be very dirty. Lift out this brush."
        },
        {
          "headline":"Remove the bearings.",
          "description":"On either end of your brush there will be small bearings. (On many models, these bearings are yellow). Remove these bearings and set them aside. Then, using your hand, pull off any hair that has gotten tangled around the ends of your brush."
        },
        {
          "headline":"Use the iRobot Roomba bristle brush.",
          "description":"Take out the iRobot Roomba bristle brush and slide it onto the end of your cylindrical brush. Pull the bristle brush down the length of your cylindrical brush in order to remove hair and debris. Remove the hair/debris from the bristle brush with your fingers, and repeat this process 2-3 more times. An iRobot Roomba bristle brush should have been included with your Roomba. If you have misplaced this item, you can purchase one online for around $5."
        },
        {
          "headline":"Remove the rubber roller.",
          "description":"Below the the space that held the cylindrical brush, you will see a cylindrical rubber roller. This will slide out. Remove the (yellow) bearings, and pull off any dirt/hair from the ends."
        },
        {
          "headline":"Vacuum the brush, roller, and compartment.",
          "description":"Using the brush attachment on your vacuum, go over all sides of the brush and roller to remove dust, dirt, and hair. Set the brush and roller aside, and switch to your crevice tool. Now vacuum the compartment where the brush and roller go, paying careful attention to the gray flap that seals the compartment."
        }
      ]
    },
    {
      "name":"Deep Cleaning the Underside and Motor",
      "steps":[
        {
          "headline":"Clean the rear wheels.",
          "description":"You do not need to remove the rear two wheels in order to clean them. Instead, push the left wheel down and use the crevice tool to vacuum around it. Repeat this on the other side."
        },
        {
          "headline":"Remove the bottom cover.",
          "description":"Using your Phillips screwdriver, remove the four small screws that hold the black bottom cover in place. These screws may be a bit difficult to remove. Then slide off the bottom cover and set it aside."
        },
        {
          "headline":"Remove the motor unit.",
          "description":"Locate the four tiny screws that hold the rectangular motor unit in place, and carefully remove them. Pull the rectangular unit out of the Roomba (on many models this is blue). With the motor compartment removed, run your vacuum crevice tool over the inside of your Roomba. These screws are very small and delicate. Be careful not to strip the tops of them as you remove them, and set them in a safe place."
        },
        {
          "headline":"Clean the motor with compressed air.",
          "description":"Using a can of compressed air, carefully work to remove any dust or debris from the motor unit. Pay attention to any crevices and openings. If you do not have compressed air, you can go over the motor with your vacuum crevice tool. However, be very careful not to disturb any wires."
        },
        {
          "headline":"Reassemble your Roomba.",
          "description":"Place the motor compartment back inside the Roomba and secure it with the four tiny screws. Then replace the bottom cover and secure it with its four screws. Pop the front wheel back in place. Next, return the bearings to the rubber roller and brush, and return them to the proper compartment (in that order),and close the flap. Then, replace the side-sweeper and secure it with a single screw. Finally, reinsert the collection tray."
        }
      ]
    }
  ],
  "text":" Vacuuming the Tray and Filter Empty your Roomba. On the rear of your Roomba there is a tray that fills with dirt and dust as it vacuums (also called the \"bin\"). Press the button on top of this tray and remove it. Dump the contents of this tray into the trashcan. Remove the filter. You should be able to see a red semi-circle inside the tray (which may be covered with gray dirt and dust). This is your filter. This filter will easily slide out of the tray, while remaining attached on one end. Slide this out, and knock any loose dirt/dust off into the trashcan. Vacuum the tray and filter using a regular vacuum and the crevice tool. Attach the crevice tool (the long, thin attachment) to the hose of a regular vacuum cleaner. Then turn the vacuum on and use this attachment to remove dirt and grime from the Roomba collection tray and filter. Switch to the brush tool. Remove the crevice tool from your vacuum hose, and instead attach the brush tool. Turn your vacuum back on and go over the filter and tray once again. This time, pay extra attention to the surface of the filter, the rubber seals, and the vents on the back of the tray. When you are finished, snap the filter back into place. Cleaning the Side-sweeper, Brush, and Rubber Roller Remove the side-sweeper. Turn the Roomba upside down, and locate the side-sweeper: a circular, three-pronged plastic piece at the top left of your Roomba. Using your Phillips screwdriver, remove the single screw that holds the side-sweeper in place, and remove the side-sweeper. Using your hands or your crevice tool, clean off any hair/debris that is attached to the side-sweeper and the place where the side-sweeper attaches. Remove the front wheel. The front wheel--positioned front and center on the bottom of your Roomba--should easily pop out. Use your hands to remove any hair or string attached to the wheel itself. Then use your vacuum with the crevice tool to vacuum the opening where the wheel goes. Remove the brush. On the bottom of your Roomba, you will notice a rectangular flap, that should lift open. Under this flap, you'll find your cylindrical brush, which is likely to be very dirty. Lift out this brush. Remove the bearings. On either end of your brush there will be small bearings. (On many models, these bearings are yellow). Remove these bearings and set them aside. Then, using your hand, pull off any hair that has gotten tangled around the ends of your brush. Use the iRobot Roomba bristle brush. Take out the iRobot Roomba bristle brush and slide it onto the end of your cylindrical brush. Pull the bristle brush down the length of your cylindrical brush in order to remove hair and debris. Remove the hair/debris from the bristle brush with your fingers, and repeat this process 2-3 more times. An iRobot Roomba bristle brush should have been included with your Roomba. If you have misplaced this item, you can purchase one online for around $5. Remove the rubber roller. Below the the space that held the cylindrical brush, you will see a cylindrical rubber roller. This will slide out. Remove the (yellow) bearings, and pull off any dirt/hair from the ends. Vacuum the brush, roller, and compartment. Using the brush attachment on your vacuum, go over all sides of the brush and roller to remove dust, dirt, and hair. Set the brush and roller aside, and switch to your crevice tool. Now vacuum the compartment where the brush and roller go, paying careful attention to the gray flap that seals the compartment. Deep Cleaning the Underside and Motor Clean the rear wheels. You do not need to remove the rear two wheels in order to clean them. Instead, push the left wheel down and use the crevice tool to vacuum around it. Repeat this on the other side. Remove the bottom cover. Using your Phillips screwdriver, remove the four small screws that hold the black bottom cover in place. These screws may be a bit difficult to remove. Then slide off the bottom cover and set it aside. Remove the motor unit. Locate the four tiny screws that hold the rectangular motor unit in place, and carefully remove them. Pull the rectangular unit out of the Roomba (on many models this is blue). With the motor compartment removed, run your vacuum crevice tool over the inside of your Roomba. These screws are very small and delicate. Be careful not to strip the tops of them as you remove them, and set them in a safe place. Clean the motor with compressed air. Using a can of compressed air, carefully work to remove any dust or debris from the motor unit. Pay attention to any crevices and openings. If you do not have compressed air, you can go over the motor with your vacuum crevice tool. However, be very careful not to disturb any wires. Reassemble your Roomba. Place the motor compartment back inside the Roomba and secure it with the four tiny screws. Then replace the bottom cover and secure it with its four screws. Pop the front wheel back in place. Next, return the bearings to the rubber roller and brush, and return them to the proper compartment (in that order),and close the flap. Then, replace the side-sweeper and secure it with a single screw. Finally, reinsert the collection tray.",
  "sentences":[
    " Vacuuming the Tray and Filter Empty your Roomba.",
    "On the rear of your Roomba there is a tray that fills with dirt and dust as it vacuums (also called the \"bin\").",
    "Press the button on top of this tray and remove it.",
    "Dump the contents of this tray into the trashcan.",
    "Remove the filter.",
    "You should be able to see a red semi-circle inside the tray (which may be covered with gray dirt and dust).",
    "This is your filter.",
    "This filter will easily slide out of the tray, while remaining attached on one end.",
    "Slide this out, and knock any loose dirt/dust off into the trashcan.",
    "Vacuum the tray and filter using a regular vacuum and the crevice tool.",
    "Attach the crevice tool (the long, thin attachment) to the hose of a regular vacuum cleaner.",
    "Then turn the vacuum on and use this attachment to remove dirt and grime from the Roomba collection tray and filter.",
    "Switch to the brush tool.",
    "Remove the crevice tool from your vacuum hose, and instead attach the brush tool.",
    "Turn your vacuum back on and go over the filter and tray once again.",
    "This time, pay extra attention to the surface of the filter, the rubber seals, and the vents on the back of the tray.",
    "When you are finished, snap the filter back into place.",
    "Cleaning the Side-sweeper, Brush, and Rubber Roller Remove the side-sweeper.",
    "Turn the Roomba upside down, and locate the side-sweeper: a circular, three-pronged plastic piece at the top left of your Roomba.",
    "Using your Phillips screwdriver, remove the single screw that holds the side-sweeper in place, and remove the side-sweeper.",
    "Using your hands or your crevice tool, clean off any hair/debris that is attached to the side-sweeper and the place where the side-sweeper attaches.",
    "Remove the front wheel.",
    "The front wheel--positioned front and center on the bottom of your Roomba--should easily pop out.",
    "Use your hands to remove any hair or string attached to the wheel itself.",
    "Then use your vacuum with the crevice tool to vacuum the opening where the wheel goes.",
    "Remove the brush.",
    "On the bottom of your Roomba, you will notice a rectangular flap, that should lift open.",
    "Under this flap, you'll find your cylindrical brush, which is likely to be very dirty.",
    "Lift out this brush.",
    "Remove the bearings.",
    "On either end of your brush there will be small bearings.",
    "(On many models, these bearings are yellow).",
    "Remove these bearings and set them aside.",
    "Then, using your hand, pull off any hair that has gotten tangled around the ends of your brush.",
    "Use the iRobot Roomba bristle brush.",
    "Take out the iRobot Roomba bristle brush and slide it onto the end of your cylindrical brush.",
    "Pull the bristle brush down the length of your cylindrical brush in order to remove hair and debris.",
    "Remove the hair/debris from the bristle brush with your fingers, and repeat this process 2-3 more times.",
    "An iRobot Roomba bristle brush should have been included with your Roomba.",
    "If you have misplaced this item, you can purchase one online for around $5.",
    "Remove the rubber roller.",
    "Below the the space that held the cylindrical brush, you will see a cylindrical rubber roller.",
    "This will slide out.",
    "Remove the (yellow) bearings, and pull off any dirt/hair from the ends.",
    "Vacuum the brush, roller, and compartment.",
    "Using the brush attachment on your vacuum, go over all sides of the brush and roller to remove dust, dirt, and hair.",
    "Set the brush and roller aside, and switch to your crevice tool.",
    "Now vacuum the compartment where the brush and roller go, paying careful attention to the gray flap that seals the compartment.",
    "Deep Cleaning the Underside and Motor Clean the rear wheels.",
    "You do not need to remove the rear two wheels in order to clean them.",
    "Instead, push the left wheel down and use the crevice tool to vacuum around it.",
    "Repeat this on the other side.",
    "Remove the bottom cover.",
    "Using your Phillips screwdriver, remove the four small screws that hold the black bottom cover in place.",
    "These screws may be a bit difficult to remove.",
    "Then slide off the bottom cover and set it aside.",
    "Remove the motor unit.",
    "Locate the four tiny screws that hold the rectangular motor unit in place, and carefully remove them.",
    "Pull the rectangular unit out of the Roomba (on many models this is blue).",
    "With the motor compartment removed, run your vacuum crevice tool over the inside of your Roomba.",
    "These screws are very small and delicate.",
    "Be careful not to strip the tops of them as you remove them, and set them in a safe place.",
    "Clean the motor with compressed air.",
    "Using a can of compressed air, carefully work to remove any dust or debris from the motor unit.",
    "Pay attention to any crevices and openings.",
    "If you do not have compressed air, you can go over the motor with your vacuum crevice tool.",
    "However, be very careful not to disturb any wires.",
    "Reassemble your Roomba.",
    "Place the motor compartment back inside the Roomba and secure it with the four tiny screws.",
    "Then replace the bottom cover and secure it with its four screws.",
    "Pop the front wheel back in place.",
    "Next, return the bearings to the rubber roller and brush, and return them to the proper compartment (in that order),and close the flap.",
    "Then, replace the side-sweeper and secure it with a single screw.",
    "Finally, reinsert the collection tray."
  ],
  "tyn_section":[
    "Traditional vacuum cleaner with hose",
    "Crevice tool",
    "Brush attachment",
    "iRobot Roomba bristle brush (included with your Roomba)",
    "Phillips screwdriver",
    "Can of compressed air (optional)",
    "Trashcan (or plastic bag)"
  ],
  "tyn_model":[
    "roomba",
    "brush",
    "vacuum",
    "tray",
    "rubber roller",
    "sweeper",
    "irobot roomba bristle brush",
    "compressed air",
    "phillips screwdriver",
    "bristle brush",
    "vacuum crevice",
    "trashcan",
    "regular vacuum",
    "regular vacuum cleaner",
    "roomba collection tray",
    "vacuum hose",
    "crevice tool"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.1176470588,
    "f1":0.1666666667,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.2352941176,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.5294117647,
    "f1":0.6545454545
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2857142857,
    "p":0.1176470588,
    "f1":0.1666666667
  }
}