{
  "title":"How to Make Maple Candy",
  "url":"https://www.wikihow.com/Make-Maple-Candy",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Sugar Treats"
  ],
  "parts":[
    {
      "name":"Cooking the Maple Syrup",
      "steps":[
        {
          "headline":"Grease candy molds.",
          "description":"Use non-stick cooking spray to grease your candy molds. You don’t need much, just a light spray to help keep the candy from sticking in the mold after it has set."
        },
        {
          "headline":"Pour the maple syrup and oil into the pan.",
          "description":"1 cup of maple syrup will make about ½ pound of candy. If you want to make more, just increase the amount of syrup. The oil just keeps the maple syrup from foaming too much when you boil it."
        },
        {
          "headline":"Bring the maple syrup to a boil.",
          "description":"Cook the maple syrup on medium heat until it comes to a boil. After the maple syrup begins to boil, measure the temperature using the candy thermometer. When the syrup reaches 235 degrees, remove it from the heat."
        },
        {
          "headline":"Allow the maple syrup to cool for ten minutes.",
          "description":"Set a timer so that you do not exceed this time. If you wait too long, the maples syrup may harden and need to be diluted with water and re-boiled. As the maple syrup cools, it will begin to look cloudy."
        }
      ]
    },
    {
      "name":"Transferring Maple Candy to Candy Molds",
      "steps":[
        {
          "headline":"Stir for five minutes.",
          "description":"Use a wooden spoon to stir the cooled maple syrup for about five minutes. It will begin to thicken and look cloudy. If you like, you can also add nuts to the maple syrup at this point."
        },
        {
          "headline":"Transfer the thickened maple syrup to the greased candy molds.",
          "description":"Spoon the maple candy into each of the molds. Use a plastic or silicon spatula to scrap the sides of the pan as well."
        },
        {
          "headline":"Allow the maple candy to set.",
          "description":"Let the candies cool and set for about an hour or more. Wait until the candies feel hard before you attempt to remove them from the molds. After you remove the candies from the molds, store them in airtight containers. Your maple candy will keep in these containers for up to a month."
        }
      ]
    }
  ],
  "text":" Cooking the Maple Syrup Grease candy molds. Use non-stick cooking spray to grease your candy molds. You don’t need much, just a light spray to help keep the candy from sticking in the mold after it has set. Pour the maple syrup and oil into the pan. 1 cup of maple syrup will make about ½ pound of candy. If you want to make more, just increase the amount of syrup. The oil just keeps the maple syrup from foaming too much when you boil it. Bring the maple syrup to a boil. Cook the maple syrup on medium heat until it comes to a boil. After the maple syrup begins to boil, measure the temperature using the candy thermometer. When the syrup reaches 235 degrees, remove it from the heat. Allow the maple syrup to cool for ten minutes. Set a timer so that you do not exceed this time. If you wait too long, the maples syrup may harden and need to be diluted with water and re-boiled. As the maple syrup cools, it will begin to look cloudy. Transferring Maple Candy to Candy Molds Stir for five minutes. Use a wooden spoon to stir the cooled maple syrup for about five minutes. It will begin to thicken and look cloudy. If you like, you can also add nuts to the maple syrup at this point. Transfer the thickened maple syrup to the greased candy molds. Spoon the maple candy into each of the molds. Use a plastic or silicon spatula to scrap the sides of the pan as well. Allow the maple candy to set. Let the candies cool and set for about an hour or more. Wait until the candies feel hard before you attempt to remove them from the molds. After you remove the candies from the molds, store them in airtight containers. Your maple candy will keep in these containers for up to a month.",
  "sentences":[
    " Cooking the Maple Syrup Grease candy molds.",
    "Use non-stick cooking spray to grease your candy molds.",
    "You don’t need much, just a light spray to help keep the candy from sticking in the mold after it has set.",
    "Pour the maple syrup and oil into the pan.",
    "1 cup of maple syrup will make about ½ pound of candy.",
    "If you want to make more, just increase the amount of syrup.",
    "The oil just keeps the maple syrup from foaming too much when you boil it.",
    "Bring the maple syrup to a boil.",
    "Cook the maple syrup on medium heat until it comes to a boil.",
    "After the maple syrup begins to boil, measure the temperature using the candy thermometer.",
    "When the syrup reaches 235 degrees, remove it from the heat.",
    "Allow the maple syrup to cool for ten minutes.",
    "Set a timer so that you do not exceed this time.",
    "If you wait too long, the maples syrup may harden and need to be diluted with water and re-boiled.",
    "As the maple syrup cools, it will begin to look cloudy.",
    "Transferring Maple Candy to Candy Molds Stir for five minutes.",
    "Use a wooden spoon to stir the cooled maple syrup for about five minutes.",
    "It will begin to thicken and look cloudy.",
    "If you like, you can also add nuts to the maple syrup at this point.",
    "Transfer the thickened maple syrup to the greased candy molds.",
    "Spoon the maple candy into each of the molds.",
    "Use a plastic or silicon spatula to scrap the sides of the pan as well.",
    "Allow the maple candy to set.",
    "Let the candies cool and set for about an hour or more.",
    "Wait until the candies feel hard before you attempt to remove them from the molds.",
    "After you remove the candies from the molds, store them in airtight containers.",
    "Your maple candy will keep in these containers for up to a month."
  ],
  "tyn_section":[
    "Heavy bottomed saucepan",
    "Wooden spoon",
    "Plastic or silicon spatula",
    "Candy molds",
    "Air-tight containers"
  ],
  "tyn_model":[
    "maple syrup",
    "candy molds",
    "maple candy",
    "oil",
    "non-stick cooking spray",
    "candy thermometer",
    "maples syrup",
    "water",
    "wooden spoon",
    "nuts",
    "airtight containers"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1818181818,
    "f1":0.25,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.1818181818,
    "f1":0.25
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.4545454545,
    "f1":0.5172413793
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.1818181818,
    "f1":0.25
  }
}