{
  "title":"How to Build Simple Floating Shelves",
  "url":"https://www.wikihow.com/Build-Simple-Floating-Shelves",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture",
    "Cabinets and Cupboards"
  ],
  "methods":[
    {
      "name":"Traditional Method",
      "steps":[
        {
          "headline":"Cut out (or purchase) two identically-sized wooden panels for each shelf.",
          "description":"The size of the panel will correspond with the size of the finished shelf, so choose accordingly. You can either use a nice wood or plywood/MDF (medium-density fiberboard) and then apply paint or a nicer veneer later. You should start with:\n1 – 2×4\n2 – Cedar Pickets\n\nThese boards are great, simple projects that work equally well will plywood, cedar, or nice sheets of maple or walnut. When possible, use a table saw for clean, well-cut lines."
        },
        {
          "headline":"Cut out (or purchase) at least two long 1-by-2-inch strips of wood.",
          "description":"The first one will be cut into pieces and placed between your panels to create a hollow-core shelf that can fit over a shelf mount on your wall. The second will form the shelf mount itself. Note that the pieces forming the internal shelf framework will be placed narrow-side down within the paneling; this will add an extra 2 inches of height to your shelf. The wood should be 1/2-1\" thick. This piece forms the u-shaped frame of your shelf."
        },
        {
          "headline":"Cut the 1-by-2-inch strip into three pieces, one as long as the length of the panels and two as long as the width.",
          "description":"The two shorter pieces need to fit the width of your wood panels. The longer piece fits between these two pieces and covers the width. After cutting, place the strips onto the panel as a \"dry run.\" They should form a perfect frame around three sides of the panel. To get a perfect diagonal joint, cut one end of each short piece and both ends of the long piece at 45-degree angles so that all three pieces can fit together to form 90-degree angles in the corners. Leave the front strip as is and cut an inch off of both shorter pieces, enabling you to tuck them behind the longer one once placed between the panels. Always err on the side of \"too long\" when cutting. You can always cut off a little more, but you can't add it back."
        },
        {
          "headline":"Attach all three 1-by-2-inch strips to one of the two panels.",
          "description":"Set one panel down, place the three strips on the panel to form three continuous edges (a u-shape). Then run a line of wood glue along the top of each strip and place the second panel on top. Use finishing nails or a nail gun to attach the top panel to each strip. If using wood glue, you'll need to use clamps to ensure that the board stays in place as it dries. For thicker wood, or for a sturdier build, skip the nail gun and use a power drill."
        },
        {
          "headline":"Attach the second panel on top of the frame.",
          "description":"Flip the first panel, the one that is now attached to the shelf framework, to expose the bottoms of the wooden strips. Again, run a line of wood glue along the top of each strip, place the free panel on top, and nail it to each strip."
        },
        {
          "headline":"Let the wood glue dry for 1-2 hours.",
          "description":"The more time, the better. Keep the clamps on to ensure it dries well, then leave the shelf until it is hardened and you can move on. Take the clamps off when it is finished drying."
        },
        {
          "headline":"Use an orbital sander and 220 grit paper to smooth the finished shelf.",
          "description":"Once you've finished building, take your sander and even out the entire shelf. This makes it smoother and more receptive to finishing."
        },
        {
          "headline":"Finish the shelf with paint, veneer, stain, or a finishing solution.",
          "description":"If using veneer, be sure to keep the grain of the wood consistent. From here,  leave the stain to dry as you move on to the support bracket that holds your shelf to the wall."
        },
        {
          "headline":"Measure the length and width of the hollow space within your three-sided shelf.",
          "description":"Do not confuse this with the overall dimensions of the shelf; the mount you make to fix the shelf to the wall will fit inside this hollow. This is why the shelf \"floats.\" The hollow part of the shelf hangs on a hidden u-shaped mount attached to the wall."
        },
        {
          "headline":"Cut another 1-by-2-inch strip of wood to the length of the hollow space.",
          "description":"Cut the strip so that it could fit perfectly as the 4th wall of your little shelf. When done, gently test it by trying to fit the board snugly into your shelf. This will form the base of the wall mount. This should be at least 3/4\" thick. Some builders prefer to make this mount first. Then you can build the shelf around the mount, using it as a guide for measurements. Neither way is better, just personal opinion."
        },
        {
          "headline":"Cut out two more 1-by-2-inch strips that are as long as the hollow space.",
          "description":"These two strips are the \"arms\" that extend off the wall and hold the shelf up. They must fit perfectly into the hollow space or the shelf won't be flush. To find it the right measurement, simply measure the total width of the shelf and subtract the width of the thin strip of wood that is at the top of the frame."
        },
        {
          "headline":"Screw the two support strips perpendicular to the long mounting strip.",
          "description":"You are basically just remaking your framework, but a little thinner so that it fits inside the shelf. Using wood glue and a nail gun, create another u-shaped frame. Make sure you use a square edge to get the mounts perfectly 90-degrees. For bigger shelves or heavy wood, use a pocket joiner and power drill to create the mount -- it will be much sturdier. For peace of mind, create a third or fourth support strip, identical to the two on the outside. You then end up with an E-shaped bracket that can hold much more weight."
        },
        {
          "headline":"Test the wall mount.",
          "description":"Does it fit snugly inside the hollow shelf? If not, adjust it as necessary, sanding and cutting wood so that the mount fits as snugly as possible. The wall mount will be hidden, so there is no need to polish or finish it."
        },
        {
          "headline":"Attach the shelf mount to the wall.",
          "description":"The best way to do this is to attach it directly to the wall studs within the wall. These can be located either with a stud locator or by knocking on the wall to search for places that don’t sound hollow."
        },
        {
          "headline":"Slide the shelf onto the shelf mount.",
          "description":"It should fit like a glove. You can either leave it sitting over the mount or take it back off, apply glue to the mount, and attach the shelf permanently."
        },
        {
          "headline":"Repeat steps to make additional shelves as desired.",
          "description":"Note that the shelves can be different dimensions."
        }
      ]
    },
    {
      "name":"Hollow-Core Door Method",
      "steps":[
        {
          "headline":"Cut an 18-inch hollow-core door.",
          "description":"Clamp a straightedge guide to the door and make a  lengthwise cut using a 40-tooth carbide blade.Don’t exceed 9 inches (22.9 cm) wide or you’ll start to weaken the cantilever strength of the shelf."
        },
        {
          "headline":"Cut cleats from a 2x4.",
          "description":"Measure the space between the outer veneers of the door. This measurement will tell you how thick to cut your cleats. They should be as long as the inside of the door."
        },
        {
          "headline":"Use a pencil and 4-foot level to mark where you want the shelf to sit.",
          "description":"Use a stud finder to mark the locations of the studs, marking these with a strip of masking tape."
        },
        {
          "headline":"Pre-drill 1/4-inch-diameter holes at the stud locations.",
          "description":"Hold the cleat straight against the line on the wall. Drill into the stud with a 1/8-in. bit and install a 1/4-in. x 3-1/2 in. lag screw into each stud. Make sure the screw is tight and straight."
        },
        {
          "headline":"Cut away the corrugated cardboard cores at least 1-1/2 inches from the cut edge.",
          "description":"Use a bread knife works to scrape off the glue, being careful not to gouge the wood."
        },
        {
          "headline":"Test-fit the shelf.",
          "description":"The blank should fit over the cleat. If the shelf doesn't lay tight against the wall, use a block plane or sander along the back edge."
        },
        {
          "headline":"Install the shelf.",
          "description":"Slide the shelf over the cleat. If you want the shelf to be permanently mounted, glue together the top of the cleat and the inside bottom edge of the door blank."
        },
        {
          "headline":"Nail the shelf to the cleat.",
          "description":"Start at the middle, using a square as a guide, and work your way to each end. Use 1-inch brad nails spaced 8 inches (20.3 cm) apart. Nail the bottom as well. If you wish for the shelf to be removable (and didn't apply glue), use counter-sunk screws instead of brads. Install them from the top and use a small sticker to cover the heads. The paint used on the shelf can be used to touch up the stickers to match."
        }
      ]
    }
  ],
  "text":" Traditional Method Cut out (or purchase) two identically-sized wooden panels for each shelf. The size of the panel will correspond with the size of the finished shelf, so choose accordingly. You can either use a nice wood or plywood/MDF (medium-density fiberboard) and then apply paint or a nicer veneer later. You should start with:\n1 – 2×4\n2 – Cedar Pickets\n\nThese boards are great, simple projects that work equally well will plywood, cedar, or nice sheets of maple or walnut. When possible, use a table saw for clean, well-cut lines. Cut out (or purchase) at least two long 1-by-2-inch strips of wood. The first one will be cut into pieces and placed between your panels to create a hollow-core shelf that can fit over a shelf mount on your wall. The second will form the shelf mount itself. Note that the pieces forming the internal shelf framework will be placed narrow-side down within the paneling; this will add an extra 2 inches of height to your shelf. The wood should be 1/2-1\" thick. This piece forms the u-shaped frame of your shelf. Cut the 1-by-2-inch strip into three pieces, one as long as the length of the panels and two as long as the width. The two shorter pieces need to fit the width of your wood panels. The longer piece fits between these two pieces and covers the width. After cutting, place the strips onto the panel as a \"dry run.\" They should form a perfect frame around three sides of the panel. To get a perfect diagonal joint, cut one end of each short piece and both ends of the long piece at 45-degree angles so that all three pieces can fit together to form 90-degree angles in the corners. Leave the front strip as is and cut an inch off of both shorter pieces, enabling you to tuck them behind the longer one once placed between the panels. Always err on the side of \"too long\" when cutting. You can always cut off a little more, but you can't add it back. Attach all three 1-by-2-inch strips to one of the two panels. Set one panel down, place the three strips on the panel to form three continuous edges (a u-shape). Then run a line of wood glue along the top of each strip and place the second panel on top. Use finishing nails or a nail gun to attach the top panel to each strip. If using wood glue, you'll need to use clamps to ensure that the board stays in place as it dries. For thicker wood, or for a sturdier build, skip the nail gun and use a power drill. Attach the second panel on top of the frame. Flip the first panel, the one that is now attached to the shelf framework, to expose the bottoms of the wooden strips. Again, run a line of wood glue along the top of each strip, place the free panel on top, and nail it to each strip. Let the wood glue dry for 1-2 hours. The more time, the better. Keep the clamps on to ensure it dries well, then leave the shelf until it is hardened and you can move on. Take the clamps off when it is finished drying. Use an orbital sander and 220 grit paper to smooth the finished shelf. Once you've finished building, take your sander and even out the entire shelf. This makes it smoother and more receptive to finishing. Finish the shelf with paint, veneer, stain, or a finishing solution. If using veneer, be sure to keep the grain of the wood consistent. From here,  leave the stain to dry as you move on to the support bracket that holds your shelf to the wall. Measure the length and width of the hollow space within your three-sided shelf. Do not confuse this with the overall dimensions of the shelf; the mount you make to fix the shelf to the wall will fit inside this hollow. This is why the shelf \"floats.\" The hollow part of the shelf hangs on a hidden u-shaped mount attached to the wall. Cut another 1-by-2-inch strip of wood to the length of the hollow space. Cut the strip so that it could fit perfectly as the 4th wall of your little shelf. When done, gently test it by trying to fit the board snugly into your shelf. This will form the base of the wall mount. This should be at least 3/4\" thick. Some builders prefer to make this mount first. Then you can build the shelf around the mount, using it as a guide for measurements. Neither way is better, just personal opinion. Cut out two more 1-by-2-inch strips that are as long as the hollow space. These two strips are the \"arms\" that extend off the wall and hold the shelf up. They must fit perfectly into the hollow space or the shelf won't be flush. To find it the right measurement, simply measure the total width of the shelf and subtract the width of the thin strip of wood that is at the top of the frame. Screw the two support strips perpendicular to the long mounting strip. You are basically just remaking your framework, but a little thinner so that it fits inside the shelf. Using wood glue and a nail gun, create another u-shaped frame. Make sure you use a square edge to get the mounts perfectly 90-degrees. For bigger shelves or heavy wood, use a pocket joiner and power drill to create the mount -- it will be much sturdier. For peace of mind, create a third or fourth support strip, identical to the two on the outside. You then end up with an E-shaped bracket that can hold much more weight. Test the wall mount. Does it fit snugly inside the hollow shelf? If not, adjust it as necessary, sanding and cutting wood so that the mount fits as snugly as possible. The wall mount will be hidden, so there is no need to polish or finish it. Attach the shelf mount to the wall. The best way to do this is to attach it directly to the wall studs within the wall. These can be located either with a stud locator or by knocking on the wall to search for places that don’t sound hollow. Slide the shelf onto the shelf mount. It should fit like a glove. You can either leave it sitting over the mount or take it back off, apply glue to the mount, and attach the shelf permanently. Repeat steps to make additional shelves as desired. Note that the shelves can be different dimensions. Hollow-Core Door Method Cut an 18-inch hollow-core door. Clamp a straightedge guide to the door and make a  lengthwise cut using a 40-tooth carbide blade.Don’t exceed 9 inches (22.9 cm) wide or you’ll start to weaken the cantilever strength of the shelf. Cut cleats from a 2x4. Measure the space between the outer veneers of the door. This measurement will tell you how thick to cut your cleats. They should be as long as the inside of the door. Use a pencil and 4-foot level to mark where you want the shelf to sit. Use a stud finder to mark the locations of the studs, marking these with a strip of masking tape. Pre-drill 1/4-inch-diameter holes at the stud locations. Hold the cleat straight against the line on the wall. Drill into the stud with a 1/8-in. bit and install a 1/4-in. x 3-1/2 in. lag screw into each stud. Make sure the screw is tight and straight. Cut away the corrugated cardboard cores at least 1-1/2 inches from the cut edge. Use a bread knife works to scrape off the glue, being careful not to gouge the wood. Test-fit the shelf. The blank should fit over the cleat. If the shelf doesn't lay tight against the wall, use a block plane or sander along the back edge. Install the shelf. Slide the shelf over the cleat. If you want the shelf to be permanently mounted, glue together the top of the cleat and the inside bottom edge of the door blank. Nail the shelf to the cleat. Start at the middle, using a square as a guide, and work your way to each end. Use 1-inch brad nails spaced 8 inches (20.3 cm) apart. Nail the bottom as well. If you wish for the shelf to be removable (and didn't apply glue), use counter-sunk screws instead of brads. Install them from the top and use a small sticker to cover the heads. The paint used on the shelf can be used to touch up the stickers to match.",
  "sentences":[
    " Traditional Method Cut out (or purchase) two identically-sized wooden panels for each shelf.",
    "The size of the panel will correspond with the size of the finished shelf, so choose accordingly.",
    "You can either use a nice wood or plywood/MDF (medium-density fiberboard) and then apply paint or a nicer veneer later.",
    "You should start with:\n1 – 2×4\n2 – Cedar Pickets\n\nThese boards are great, simple projects that work equally well will plywood, cedar, or nice sheets of maple or walnut.",
    "When possible, use a table saw for clean, well-cut lines.",
    "Cut out (or purchase) at least two long 1-by-2-inch strips of wood.",
    "The first one will be cut into pieces and placed between your panels to create a hollow-core shelf that can fit over a shelf mount on your wall.",
    "The second will form the shelf mount itself.",
    "Note that the pieces forming the internal shelf framework will be placed narrow-side down within the paneling; this will add an extra 2 inches of height to your shelf.",
    "The wood should be 1/2-1\" thick.",
    "This piece forms the u-shaped frame of your shelf.",
    "Cut the 1-by-2-inch strip into three pieces, one as long as the length of the panels and two as long as the width.",
    "The two shorter pieces need to fit the width of your wood panels.",
    "The longer piece fits between these two pieces and covers the width.",
    "After cutting, place the strips onto the panel as a \"dry run.\"",
    "They should form a perfect frame around three sides of the panel.",
    "To get a perfect diagonal joint, cut one end of each short piece and both ends of the long piece at 45-degree angles so that all three pieces can fit together to form 90-degree angles in the corners.",
    "Leave the front strip as is and cut an inch off of both shorter pieces, enabling you to tuck them behind the longer one once placed between the panels.",
    "Always err on the side of \"too long\" when cutting.",
    "You can always cut off a little more, but you can't add it back.",
    "Attach all three 1-by-2-inch strips to one of the two panels.",
    "Set one panel down, place the three strips on the panel to form three continuous edges (a u-shape).",
    "Then run a line of wood glue along the top of each strip and place the second panel on top.",
    "Use finishing nails or a nail gun to attach the top panel to each strip.",
    "If using wood glue, you'll need to use clamps to ensure that the board stays in place as it dries.",
    "For thicker wood, or for a sturdier build, skip the nail gun and use a power drill.",
    "Attach the second panel on top of the frame.",
    "Flip the first panel, the one that is now attached to the shelf framework, to expose the bottoms of the wooden strips.",
    "Again, run a line of wood glue along the top of each strip, place the free panel on top, and nail it to each strip.",
    "Let the wood glue dry for 1-2 hours.",
    "The more time, the better.",
    "Keep the clamps on to ensure it dries well, then leave the shelf until it is hardened and you can move on.",
    "Take the clamps off when it is finished drying.",
    "Use an orbital sander and 220 grit paper to smooth the finished shelf.",
    "Once you've finished building, take your sander and even out the entire shelf.",
    "This makes it smoother and more receptive to finishing.",
    "Finish the shelf with paint, veneer, stain, or a finishing solution.",
    "If using veneer, be sure to keep the grain of the wood consistent.",
    "From here,  leave the stain to dry as you move on to the support bracket that holds your shelf to the wall.",
    "Measure the length and width of the hollow space within your three-sided shelf.",
    "Do not confuse this with the overall dimensions of the shelf; the mount you make to fix the shelf to the wall will fit inside this hollow.",
    "This is why the shelf \"floats.\"",
    "The hollow part of the shelf hangs on a hidden u-shaped mount attached to the wall.",
    "Cut another 1-by-2-inch strip of wood to the length of the hollow space.",
    "Cut the strip so that it could fit perfectly as the 4th wall of your little shelf.",
    "When done, gently test it by trying to fit the board snugly into your shelf.",
    "This will form the base of the wall mount.",
    "This should be at least 3/4\" thick.",
    "Some builders prefer to make this mount first.",
    "Then you can build the shelf around the mount, using it as a guide for measurements.",
    "Neither way is better, just personal opinion.",
    "Cut out two more 1-by-2-inch strips that are as long as the hollow space.",
    "These two strips are the \"arms\" that extend off the wall and hold the shelf up.",
    "They must fit perfectly into the hollow space or the shelf won't be flush.",
    "To find it the right measurement, simply measure the total width of the shelf and subtract the width of the thin strip of wood that is at the top of the frame.",
    "Screw the two support strips perpendicular to the long mounting strip.",
    "You are basically just remaking your framework, but a little thinner so that it fits inside the shelf.",
    "Using wood glue and a nail gun, create another u-shaped frame.",
    "Make sure you use a square edge to get the mounts perfectly 90-degrees.",
    "For bigger shelves or heavy wood, use a pocket joiner and power drill to create the mount -- it will be much sturdier.",
    "For peace of mind, create a third or fourth support strip, identical to the two on the outside.",
    "You then end up with an E-shaped bracket that can hold much more weight.",
    "Test the wall mount.",
    "Does it fit snugly inside the hollow shelf?",
    "If not, adjust it as necessary, sanding and cutting wood so that the mount fits as snugly as possible.",
    "The wall mount will be hidden, so there is no need to polish or finish it.",
    "Attach the shelf mount to the wall.",
    "The best way to do this is to attach it directly to the wall studs within the wall.",
    "These can be located either with a stud locator or by knocking on the wall to search for places that don’t sound hollow.",
    "Slide the shelf onto the shelf mount.",
    "It should fit like a glove.",
    "You can either leave it sitting over the mount or take it back off, apply glue to the mount, and attach the shelf permanently.",
    "Repeat steps to make additional shelves as desired.",
    "Note that the shelves can be different dimensions.",
    "Hollow-Core Door Method Cut an 18-inch hollow-core door.",
    "Clamp a straightedge guide to the door and make a  lengthwise cut using a 40-tooth carbide blade.Don’t exceed 9 inches (22.9 cm) wide or you’ll start to weaken the cantilever strength of the shelf.",
    "Cut cleats from a 2x4.",
    "Measure the space between the outer veneers of the door.",
    "This measurement will tell you how thick to cut your cleats.",
    "They should be as long as the inside of the door.",
    "Use a pencil and 4-foot level to mark where you want the shelf to sit.",
    "Use a stud finder to mark the locations of the studs, marking these with a strip of masking tape.",
    "Pre-drill 1/4-inch-diameter holes at the stud locations.",
    "Hold the cleat straight against the line on the wall.",
    "Drill into the stud with a 1/8-in.",
    "bit and install a 1/4-in.",
    "x 3-1/2 in.",
    "lag screw into each stud.",
    "Make sure the screw is tight and straight.",
    "Cut away the corrugated cardboard cores at least 1-1/2 inches from the cut edge.",
    "Use a bread knife works to scrape off the glue, being careful not to gouge the wood.",
    "Test-fit the shelf.",
    "The blank should fit over the cleat.",
    "If the shelf doesn't lay tight against the wall, use a block plane or sander along the back edge.",
    "Install the shelf.",
    "Slide the shelf over the cleat.",
    "If you want the shelf to be permanently mounted, glue together the top of the cleat and the inside bottom edge of the door blank.",
    "Nail the shelf to the cleat.",
    "Start at the middle, using a square as a guide, and work your way to each end.",
    "Use 1-inch brad nails spaced 8 inches (20.3 cm) apart.",
    "Nail the bottom as well.",
    "If you wish for the shelf to be removable (and didn't apply glue), use counter-sunk screws instead of brads.",
    "Install them from the top and use a small sticker to cover the heads.",
    "The paint used on the shelf can be used to touch up the stickers to match."
  ],
  "tyn_section":[
    "Tape measure",
    "Saw",
    "Hammer and nails or nailgun",
    "Screws and screwdriver",
    "Carpenter’s glue",
    "Level",
    "Paint or veneer (optional)",
    "Stud-finder (optional)",
    "1/2-inch wood for paneling",
    "Two long 1x2-inch wooden strips",
    "A hollow-core door (try your local rebuilding center to recycle an old one)",
    "Chisel",
    "Wrench",
    "1-inch brads",
    "3.5-inch lag screws"
  ],
  "tyn_model":[
    "shelf",
    "wood glue",
    "wood",
    "glue",
    "paint",
    "shelf mount",
    "nail gun",
    "power drill",
    "sander",
    "veneer",
    "hollow-core door",
    "– 2×4",
    "– cedar",
    "table saw",
    "nails",
    "orbital sander",
    "220 grit paper",
    "stain",
    "board",
    "framework",
    "pocket joiner",
    "wall mount",
    "40-tooth carbide blade",
    "pencil",
    "level",
    "stud finder",
    "masking tape",
    "cardboard",
    "knife",
    "block plane",
    "counter-sunk screws"
  ],
  "simple_metrics":{
    "r":0.0666666667,
    "p":0.0322580645,
    "f1":0.0434782609,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2,
    "p":0.0967741935,
    "f1":0.1304347826
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.2666666667,
    "p":0.1612903226,
    "f1":0.2010050251
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0666666667,
    "p":0.0322580645,
    "f1":0.0434782609
  }
}