{
  "title":"How to Taste Whiskey",
  "url":"https://www.wikihow.com/Taste-Whiskey",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs"
  ],
  "parts":[
    {
      "name":"Choosing the Right Tasting Glasses",
      "steps":[
        {
          "headline":"Opt for a tulip-shaped glass.",
          "description":"Instead of the wide glasses that are usually used for whiskey at bars, a curved glass that narrows at the top works best. The narrower shape at the top concentrates the aromas for sniffing, while the wide bottom allows you to swirl the whiskey before you sip it. A snifter glass is the best option for whiskey tastings."
        },
        {
          "headline":"Use a stemmed glass.",
          "description":"Tasting the whiskey in a stemmed glass prevents the heat of your hand from warming it. The stem also creates distance between your hand and the whiskey so odors from your skin don’t interfere with its aroma. Many snifters have stems, but you can substitute a wine glass if you don’t have a snifter."
        },
        {
          "headline":"Avoid glasses that are too deep.",
          "description":"If the bowl of the glass is extremely deep, you won’t be able to get a true sense of the whiskey’s aromas. That’s because the heaviest of the volatile compounds that make up the whiskey won’t be able to rise to the top of the glass."
        }
      ]
    },
    {
      "name":"Pouring the Whiskey",
      "steps":[
        {
          "headline":"Serve the whiskey at room temperature.",
          "description":"Whiskey can taste different when it’s chilled, so it’s best to taste it a more moderate temperature first. Taste the whiskey when it’s between 64° and 72°F (18° and 22°C) to get the truest sense of its flavor."
        },
        {
          "headline":"Add a small amount of whiskey to the glass.",
          "description":"You may be tempted to fill your glass to the brim, but you don’t want to be overwhelmed. Pour ⁄4–1 ⁄2  fl oz (22–44 mL) so you have just enough to smell and taste the whiskey."
        },
        {
          "headline":"Tilt the glass to coat it.",
          "description":"Once you’ve poured the whiskey, roll the glass sideways in a complete circle. That will evenly distribute the whiskey throughout the glass and coat the inner surface of the glass’ bowl, which helps draw out the aromas that are at the bottom."
        }
      ]
    },
    {
      "name":"Observing and Smelling the Whiskey",
      "steps":[
        {
          "headline":"Study the color of the whiskey.",
          "description":"Before sipping or even smelling the whiskey, hold the glass up to eye level. The whiskey’s color can help indicate its age or what type of cask was used to age it, so try to determine what shade you see. Most whiskeys are a yellow, gold, or amber shade, though you may observe some orange or peach tones as well. In most cases, the darker that the whiskey is, the longer that it’s been aged."
        },
        {
          "headline":"Swirl the whiskey to look for its legs.",
          "description":"Tilt the glass around again to move the whiskey throughout the glass. Check out the way it moves down the sides of the glass; the streaks that it makes are known as its legs, which help indicate how thick the whiskey is. A whiskey with thick legs typically has a more pleasant feel in the mouth. A whiskey with a more pleasant feel in the mouth typically has smooth, creamy texture."
        },
        {
          "headline":"Shake the whiskey to look for bubbles.",
          "description":"Place the palm of your hand over the top of the glass, and agitate it slightly to create bubbles. Pay attention to how long it takes for the bubbles to disappear; the longer it takes for the bubbles to go away, the higher the whiskey’s alcohol by volume (abv) is."
        },
        {
          "headline":"Hold the glass beneath your nose and sniff.",
          "description":"Since your senses of smell and taste are so closely linked, you should smell the whiskey before you sip it. Bring the glass up directly beneath your nose and allow the aromas to drift up. Don’t breathe in deeply; let the scents come to you. The initial scent of the whiskey will have a strong alcohol scent. By letting the whiskey’s aroma drift up to you, you give your nose time to adjust to the amount of alcohol in it. Otherwise, your nose may feel like it’s burning. Keep your mouth open as you sniff the whiskey to experience a more powerful aroma."
        },
        {
          "headline":"Turn the glass perpendicular to your face and sniff again.",
          "description":"After you’ve gotten an initial sense of the aroma, tilt the glass on its side so it’s parallel with the floor. Be careful not to spill any of the whiskey, and raise the glass up in a straight line while you smell it. You should be able to take in the aromas of the heavier compounds that are usually at the bottom of the glass. The heavier compounds in the whiskey typically have woody, smoky, and earthy aromas."
        },
        {
          "headline":"Place the glass beneath your nose and sniff.",
          "description":"With the glass still parallel to your face, move it down so your nose is about ⁄2 inch (1.3 cm) above its rim. Smell the whiskey again, paying attention to the lighter notes in its scent. The lighter compounds in the whiskey often have floral or sour aromas."
        }
      ]
    },
    {
      "name":"Tasting the Whiskey",
      "steps":[
        {
          "headline":"Take a small sip.",
          "description":"When you have a good sense of the whiskey’s scent, it’s time to taste it. Start with a small sip. Keep your lips puckered in an “O” shape, and slide your tongue against your lips to move the whiskey around. The first few times that you try this technique, it may make you feel like gagging. That's usually due to how strong the whiskey is -- the burning sensation that it provides can make you cough, which can trigger your gag reflex. Don’t try to look for any particular flavors; just see what notes you detect."
        },
        {
          "headline":"Roll the whiskey in your mouth.",
          "description":"After your initial taste, move the whiskey back and forth in your mouth like you are gargling with it. Don’t do it too quickly or you may not be able to pick up all of the whiskey’s flavors. Overall, you should hold the whiskey in your mouth for about 30 seconds before you swallow it to really take in all of its flavors. You'll likely taste woodsy and spicy flavors when you first take in the flavor. Depending on the type of whiskey, you may also taste hints of citrus, nuttiness, caramel, and other flavors."
        },
        {
          "headline":"Swallow the whiskey and pay attention to the finish.",
          "description":"Once you’ve moved the whiskey around a little and have gotten a good taste of it, you can swallow it down. The burning feeling that you experience as it goes down is known as the finish. Try to notice exactly how it feels -- it could be short, long, mellow, or unpleasant, depending on your alcohol tolerance. A short finish doesn't linger long in the mouth so the flavor disappears quickly. A long finish lingers in the mouth so the flavor stays with you after you swallow the whiskey. A mellow finish has a smooth, pleasant flavor. An unpleasant finish may have a bitter flavor or burn as it goes down."
        }
      ]
    },
    {
      "name":"Adding Water",
      "steps":[
        {
          "headline":"Use room-temperature water.",
          "description":"After you’ve tasted the whiskey neat, it’s a good idea to add a little water. That helps open up the whiskey so you can pick up more of its flavors. Be sure to use room-temperature water, though, so differences in temperature don’t affect the whiskey’s taste. Mix still or flat water into your whiskey, not carbonated or sparkling."
        },
        {
          "headline":"Add 1 drop of water to the whiskey at a time.",
          "description":"It’s important not to add too much water to the whiskey at once or you may alter its aroma and taste. Use a pipette or a straw to add just 1 drop at a time so you don’t wind up diluting the whiskey rather than opening it up. If you don’t have a pipette or straw, you can use the cap from your bottle of water to add a small amount at a time. If you don’t feel like you’re picking up any new aroma or flavors from the whiskey after adding a drop of water, you can add another."
        },
        {
          "headline":"Let the whiskey sit for up to 20 minutes.",
          "description":"After adding the water, allow the whiskey to sit for as long as 20 minutes. During this time, the water slowly changes the flavor of the whiskey, which will allow you to notice more of a difference when you taste the whiskey again. Adding the water to the whiskey can help bring out subtle flavors that you didn't pick up when it was neat. For example, you may be able to taste citrus notes or a nutty flavor that you didn't detect at first tasting. The water can also help tone down the alcohol taste of the whiskey, so if it had an unpleasant finish, you may find that you like it better with the water."
        },
        {
          "headline":"Sniff the whiskey again and taste it.",
          "description":"Once the water is added to the whiskey, smell it once more. See if you can pick up any different aromas that you didn’t earlier. Next, sip the whiskey in the same fashion you did earlier and look for any changes in the aroma or flavor."
        }
      ]
    }
  ],
  "text":" Choosing the Right Tasting Glasses Opt for a tulip-shaped glass. Instead of the wide glasses that are usually used for whiskey at bars, a curved glass that narrows at the top works best. The narrower shape at the top concentrates the aromas for sniffing, while the wide bottom allows you to swirl the whiskey before you sip it. A snifter glass is the best option for whiskey tastings. Use a stemmed glass. Tasting the whiskey in a stemmed glass prevents the heat of your hand from warming it. The stem also creates distance between your hand and the whiskey so odors from your skin don’t interfere with its aroma. Many snifters have stems, but you can substitute a wine glass if you don’t have a snifter. Avoid glasses that are too deep. If the bowl of the glass is extremely deep, you won’t be able to get a true sense of the whiskey’s aromas. That’s because the heaviest of the volatile compounds that make up the whiskey won’t be able to rise to the top of the glass. Pouring the Whiskey Serve the whiskey at room temperature. Whiskey can taste different when it’s chilled, so it’s best to taste it a more moderate temperature first. Taste the whiskey when it’s between 64° and 72°F (18° and 22°C) to get the truest sense of its flavor. Add a small amount of whiskey to the glass. You may be tempted to fill your glass to the brim, but you don’t want to be overwhelmed. Pour ⁄4–1 ⁄2  fl oz (22–44 mL) so you have just enough to smell and taste the whiskey. Tilt the glass to coat it. Once you’ve poured the whiskey, roll the glass sideways in a complete circle. That will evenly distribute the whiskey throughout the glass and coat the inner surface of the glass’ bowl, which helps draw out the aromas that are at the bottom. Observing and Smelling the Whiskey Study the color of the whiskey. Before sipping or even smelling the whiskey, hold the glass up to eye level. The whiskey’s color can help indicate its age or what type of cask was used to age it, so try to determine what shade you see. Most whiskeys are a yellow, gold, or amber shade, though you may observe some orange or peach tones as well. In most cases, the darker that the whiskey is, the longer that it’s been aged. Swirl the whiskey to look for its legs. Tilt the glass around again to move the whiskey throughout the glass. Check out the way it moves down the sides of the glass; the streaks that it makes are known as its legs, which help indicate how thick the whiskey is. A whiskey with thick legs typically has a more pleasant feel in the mouth. A whiskey with a more pleasant feel in the mouth typically has smooth, creamy texture. Shake the whiskey to look for bubbles. Place the palm of your hand over the top of the glass, and agitate it slightly to create bubbles. Pay attention to how long it takes for the bubbles to disappear; the longer it takes for the bubbles to go away, the higher the whiskey’s alcohol by volume (abv) is. Hold the glass beneath your nose and sniff. Since your senses of smell and taste are so closely linked, you should smell the whiskey before you sip it. Bring the glass up directly beneath your nose and allow the aromas to drift up. Don’t breathe in deeply; let the scents come to you. The initial scent of the whiskey will have a strong alcohol scent. By letting the whiskey’s aroma drift up to you, you give your nose time to adjust to the amount of alcohol in it. Otherwise, your nose may feel like it’s burning. Keep your mouth open as you sniff the whiskey to experience a more powerful aroma. Turn the glass perpendicular to your face and sniff again. After you’ve gotten an initial sense of the aroma, tilt the glass on its side so it’s parallel with the floor. Be careful not to spill any of the whiskey, and raise the glass up in a straight line while you smell it. You should be able to take in the aromas of the heavier compounds that are usually at the bottom of the glass. The heavier compounds in the whiskey typically have woody, smoky, and earthy aromas. Place the glass beneath your nose and sniff. With the glass still parallel to your face, move it down so your nose is about ⁄2 inch (1.3 cm) above its rim. Smell the whiskey again, paying attention to the lighter notes in its scent. The lighter compounds in the whiskey often have floral or sour aromas. Tasting the Whiskey Take a small sip. When you have a good sense of the whiskey’s scent, it’s time to taste it. Start with a small sip. Keep your lips puckered in an “O” shape, and slide your tongue against your lips to move the whiskey around. The first few times that you try this technique, it may make you feel like gagging. That's usually due to how strong the whiskey is -- the burning sensation that it provides can make you cough, which can trigger your gag reflex. Don’t try to look for any particular flavors; just see what notes you detect. Roll the whiskey in your mouth. After your initial taste, move the whiskey back and forth in your mouth like you are gargling with it. Don’t do it too quickly or you may not be able to pick up all of the whiskey’s flavors. Overall, you should hold the whiskey in your mouth for about 30 seconds before you swallow it to really take in all of its flavors. You'll likely taste woodsy and spicy flavors when you first take in the flavor. Depending on the type of whiskey, you may also taste hints of citrus, nuttiness, caramel, and other flavors. Swallow the whiskey and pay attention to the finish. Once you’ve moved the whiskey around a little and have gotten a good taste of it, you can swallow it down. The burning feeling that you experience as it goes down is known as the finish. Try to notice exactly how it feels -- it could be short, long, mellow, or unpleasant, depending on your alcohol tolerance. A short finish doesn't linger long in the mouth so the flavor disappears quickly. A long finish lingers in the mouth so the flavor stays with you after you swallow the whiskey. A mellow finish has a smooth, pleasant flavor. An unpleasant finish may have a bitter flavor or burn as it goes down. Adding Water Use room-temperature water. After you’ve tasted the whiskey neat, it’s a good idea to add a little water. That helps open up the whiskey so you can pick up more of its flavors. Be sure to use room-temperature water, though, so differences in temperature don’t affect the whiskey’s taste. Mix still or flat water into your whiskey, not carbonated or sparkling. Add 1 drop of water to the whiskey at a time. It’s important not to add too much water to the whiskey at once or you may alter its aroma and taste. Use a pipette or a straw to add just 1 drop at a time so you don’t wind up diluting the whiskey rather than opening it up. If you don’t have a pipette or straw, you can use the cap from your bottle of water to add a small amount at a time. If you don’t feel like you’re picking up any new aroma or flavors from the whiskey after adding a drop of water, you can add another. Let the whiskey sit for up to 20 minutes. After adding the water, allow the whiskey to sit for as long as 20 minutes. During this time, the water slowly changes the flavor of the whiskey, which will allow you to notice more of a difference when you taste the whiskey again. Adding the water to the whiskey can help bring out subtle flavors that you didn't pick up when it was neat. For example, you may be able to taste citrus notes or a nutty flavor that you didn't detect at first tasting. The water can also help tone down the alcohol taste of the whiskey, so if it had an unpleasant finish, you may find that you like it better with the water. Sniff the whiskey again and taste it. Once the water is added to the whiskey, smell it once more. See if you can pick up any different aromas that you didn’t earlier. Next, sip the whiskey in the same fashion you did earlier and look for any changes in the aroma or flavor.",
  "sentences":[
    " Choosing the Right Tasting Glasses Opt for a tulip-shaped glass.",
    "Instead of the wide glasses that are usually used for whiskey at bars, a curved glass that narrows at the top works best.",
    "The narrower shape at the top concentrates the aromas for sniffing, while the wide bottom allows you to swirl the whiskey before you sip it.",
    "A snifter glass is the best option for whiskey tastings.",
    "Use a stemmed glass.",
    "Tasting the whiskey in a stemmed glass prevents the heat of your hand from warming it.",
    "The stem also creates distance between your hand and the whiskey so odors from your skin don’t interfere with its aroma.",
    "Many snifters have stems, but you can substitute a wine glass if you don’t have a snifter.",
    "Avoid glasses that are too deep.",
    "If the bowl of the glass is extremely deep, you won’t be able to get a true sense of the whiskey’s aromas.",
    "That’s because the heaviest of the volatile compounds that make up the whiskey won’t be able to rise to the top of the glass.",
    "Pouring the Whiskey Serve the whiskey at room temperature.",
    "Whiskey can taste different when it’s chilled, so it’s best to taste it a more moderate temperature first.",
    "Taste the whiskey when it’s between 64° and 72°F (18° and 22°C) to get the truest sense of its flavor.",
    "Add a small amount of whiskey to the glass.",
    "You may be tempted to fill your glass to the brim, but you don’t want to be overwhelmed.",
    "Pour ⁄4–1 ⁄2  fl oz (22–44 mL) so you have just enough to smell and taste the whiskey.",
    "Tilt the glass to coat it.",
    "Once you’ve poured the whiskey, roll the glass sideways in a complete circle.",
    "That will evenly distribute the whiskey throughout the glass and coat the inner surface of the glass’ bowl, which helps draw out the aromas that are at the bottom.",
    "Observing and Smelling the Whiskey Study the color of the whiskey.",
    "Before sipping or even smelling the whiskey, hold the glass up to eye level.",
    "The whiskey’s color can help indicate its age or what type of cask was used to age it, so try to determine what shade you see.",
    "Most whiskeys are a yellow, gold, or amber shade, though you may observe some orange or peach tones as well.",
    "In most cases, the darker that the whiskey is, the longer that it’s been aged.",
    "Swirl the whiskey to look for its legs.",
    "Tilt the glass around again to move the whiskey throughout the glass.",
    "Check out the way it moves down the sides of the glass; the streaks that it makes are known as its legs, which help indicate how thick the whiskey is.",
    "A whiskey with thick legs typically has a more pleasant feel in the mouth.",
    "A whiskey with a more pleasant feel in the mouth typically has smooth, creamy texture.",
    "Shake the whiskey to look for bubbles.",
    "Place the palm of your hand over the top of the glass, and agitate it slightly to create bubbles.",
    "Pay attention to how long it takes for the bubbles to disappear; the longer it takes for the bubbles to go away, the higher the whiskey’s alcohol by volume (abv) is.",
    "Hold the glass beneath your nose and sniff.",
    "Since your senses of smell and taste are so closely linked, you should smell the whiskey before you sip it.",
    "Bring the glass up directly beneath your nose and allow the aromas to drift up.",
    "Don’t breathe in deeply; let the scents come to you.",
    "The initial scent of the whiskey will have a strong alcohol scent.",
    "By letting the whiskey’s aroma drift up to you, you give your nose time to adjust to the amount of alcohol in it.",
    "Otherwise, your nose may feel like it’s burning.",
    "Keep your mouth open as you sniff the whiskey to experience a more powerful aroma.",
    "Turn the glass perpendicular to your face and sniff again.",
    "After you’ve gotten an initial sense of the aroma, tilt the glass on its side so it’s parallel with the floor.",
    "Be careful not to spill any of the whiskey, and raise the glass up in a straight line while you smell it.",
    "You should be able to take in the aromas of the heavier compounds that are usually at the bottom of the glass.",
    "The heavier compounds in the whiskey typically have woody, smoky, and earthy aromas.",
    "Place the glass beneath your nose and sniff.",
    "With the glass still parallel to your face, move it down so your nose is about ⁄2 inch (1.3 cm) above its rim.",
    "Smell the whiskey again, paying attention to the lighter notes in its scent.",
    "The lighter compounds in the whiskey often have floral or sour aromas.",
    "Tasting the Whiskey Take a small sip.",
    "When you have a good sense of the whiskey’s scent, it’s time to taste it.",
    "Start with a small sip.",
    "Keep your lips puckered in an “O” shape, and slide your tongue against your lips to move the whiskey around.",
    "The first few times that you try this technique, it may make you feel like gagging.",
    "That's usually due to how strong the whiskey is -- the burning sensation that it provides can make you cough, which can trigger your gag reflex.",
    "Don’t try to look for any particular flavors; just see what notes you detect.",
    "Roll the whiskey in your mouth.",
    "After your initial taste, move the whiskey back and forth in your mouth like you are gargling with it.",
    "Don’t do it too quickly or you may not be able to pick up all of the whiskey’s flavors.",
    "Overall, you should hold the whiskey in your mouth for about 30 seconds before you swallow it to really take in all of its flavors.",
    "You'll likely taste woodsy and spicy flavors when you first take in the flavor.",
    "Depending on the type of whiskey, you may also taste hints of citrus, nuttiness, caramel, and other flavors.",
    "Swallow the whiskey and pay attention to the finish.",
    "Once you’ve moved the whiskey around a little and have gotten a good taste of it, you can swallow it down.",
    "The burning feeling that you experience as it goes down is known as the finish.",
    "Try to notice exactly how it feels -- it could be short, long, mellow, or unpleasant, depending on your alcohol tolerance.",
    "A short finish doesn't linger long in the mouth so the flavor disappears quickly.",
    "A long finish lingers in the mouth so the flavor stays with you after you swallow the whiskey.",
    "A mellow finish has a smooth, pleasant flavor.",
    "An unpleasant finish may have a bitter flavor or burn as it goes down.",
    "Adding Water Use room-temperature water.",
    "After you’ve tasted the whiskey neat, it’s a good idea to add a little water.",
    "That helps open up the whiskey so you can pick up more of its flavors.",
    "Be sure to use room-temperature water, though, so differences in temperature don’t affect the whiskey’s taste.",
    "Mix still or flat water into your whiskey, not carbonated or sparkling.",
    "Add 1 drop of water to the whiskey at a time.",
    "It’s important not to add too much water to the whiskey at once or you may alter its aroma and taste.",
    "Use a pipette or a straw to add just 1 drop at a time so you don’t wind up diluting the whiskey rather than opening it up.",
    "If you don’t have a pipette or straw, you can use the cap from your bottle of water to add a small amount at a time.",
    "If you don’t feel like you’re picking up any new aroma or flavors from the whiskey after adding a drop of water, you can add another.",
    "Let the whiskey sit for up to 20 minutes.",
    "After adding the water, allow the whiskey to sit for as long as 20 minutes.",
    "During this time, the water slowly changes the flavor of the whiskey, which will allow you to notice more of a difference when you taste the whiskey again.",
    "Adding the water to the whiskey can help bring out subtle flavors that you didn't pick up when it was neat.",
    "For example, you may be able to taste citrus notes or a nutty flavor that you didn't detect at first tasting.",
    "The water can also help tone down the alcohol taste of the whiskey, so if it had an unpleasant finish, you may find that you like it better with the water.",
    "Sniff the whiskey again and taste it.",
    "Once the water is added to the whiskey, smell it once more.",
    "See if you can pick up any different aromas that you didn’t earlier.",
    "Next, sip the whiskey in the same fashion you did earlier and look for any changes in the aroma or flavor."
  ],
  "tyn_section":[
    "Whiskey",
    "Tulip-shaped glass with a stem",
    "Still water",
    "Pipette or straw"
  ],
  "tyn_model":[
    "whiskey",
    "glass",
    "water",
    "stemmed glass",
    "snifter glass",
    "snifters",
    "wine glass",
    "snifter",
    "glasses",
    "’ bowl",
    "whiskeys",
    "“o",
    "” shape",
    "room-temperature water",
    "straw"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0666666667,
    "f1":0.1052631579,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1333333333,
    "f1":0.2105263158
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2666666667,
    "f1":0.393442623
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0666666667,
    "f1":0.1052631579
  }
}