{
  "title":"How to Adhere Plastic to Wood",
  "url":"https://www.wikihow.com/Adhere-Plastic-to-Wood",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Plastic"
  ],
  "methods":[
    {
      "name":"Using Super Glue",
      "steps":[
        {
          "headline":"Buy a tube of high-strength super glue.",
          "description":"Super glue typically comes in small tubes, so it will work best for small projects and repairs. For a hold that will last, invest in a heavy-duty adhesive like Loctite or Gorilla Glue rather than a bargain glue. One of these products will give you more lasting results than ordinary types of glue. If you’re working on something that requires a lot of assembling, stock up on multiple tubes. It never hurts to have a little extra super glue on hand. Some types of porous wood may absorb regular super glue before it bonds with the plastic. If you're working with a porous wood, look for a gel-based super glue."
        },
        {
          "headline":"Sand the plastic surface lightly.",
          "description":"Go over the broadest area of the plastic piece with a square of high-grit sandpaper before you get gluing. Sanding the plastic will make it more porous and increase its overall surface area, allowing it to bond to the wood more easily. Use only a few smooth, delicate strokes to avoid roughing up the plastic too much. If there's a chance you might damage the piece you're sanding, it may be better to skip this step."
        },
        {
          "headline":"Clean the wooden piece with a damp cloth.",
          "description":"A quick wipedown will remove dust and dirt that might interfere with the hold. Allow the wood to air dry, the wipe it down lightly with rubbing alcohol. This removes excess dust and oils, and helps pull out any remaining moisture. To avoid oversaturating the wood, wring the excess water out of the cloth after wetting it. Applying the glue while the wood is still damp may weaken its ability to hold."
        },
        {
          "headline":"Add the glue to both surfaces.",
          "description":"Squeeze the tube slowly to control the flow of the glue. Super glues are designed to be extra grippy, so only use as much as needed—a little bit goes a long way. Depending on the size and shape of the surface you’re gluing, it may be better to use stripes, dots or even swirls. For small or irregularly shaped objects, try applying the glue with a toothpick."
        },
        {
          "headline":"Press the surfaces together.",
          "description":"Guide the smaller piece into place on the larger piece. Once you’ve put them together, keep constant pressure on them until the glue has dried enough to hold securely. Find a flat, stable surface to set the pieces as they finish drying. Practice a couple dry runs beforehand to make sure you fit both pieces together precisely."
        },
        {
          "headline":"Give the glue time to set.",
          "description":"Most super glues will begin drying within seconds, but it may take as long as two hours for them to harden completely. During this time, avoid handling the glued objects as much as possible. Keep the objects somewhere cool and dry while they dry. Moisture can interfere with the glue’s ability to set up properly. Use acetone to dissolve super glue after it’s dried."
        }
      ]
    },
    {
      "name":"Using Hot Glue",
      "steps":[
        {
          "headline":"Plug in and turn on the glue gun.",
          "description":"Use the outlet closest to your work area so you can work comfortably. If your glue gun has a separate power switch, make sure it’s set to the “On” position. Give the glue gun a couple minutes to heat up before loading it. Be careful when working with an active glue gun—only grip the handle and body of the gun, never the tip."
        },
        {
          "headline":"Load a glue stick into the backside of the gun.",
          "description":"Once inside, the heating elements will begin to melt the glue. This may take several minutes. Choose high temperature glue sticks. These provide the strongest bond for plastics, and you won’t have to worry about the glue melting in warm weather or hot working conditions. To check to see if you’re ready to begin gluing, squeeze the trigger lightly and look for melted glue strings to emerge. Wipe off the tip of your glue gun with a thick rag before you start working with your wood. This keeps contaminants off your project and controls glue strings as you work."
        },
        {
          "headline":"Apply the glue to one or both surfaces.",
          "description":"Press the trigger on the gun to release the glue. Concentrate the glue on the broadest, flattest areas of the objects you’re joining. Use the gun’s tapered tip to direct the glue more precisely, and don’t use more than you have to. Hot glue can burn if it come into contact with your skin. Work next to the sink or keep a cup of cold water nearby in case you happen to get any on you by accident."
        },
        {
          "headline":"Fit the objects together.",
          "description":"Move the smaller piece into position over the larger one, making sure they’re properly spaced and aligned. Hold the pieces together firmly for 30 seconds to a minute while the glue begins to set. Test fit the pieces beforehand so you don’t make a mistake. When working with hot glue, you’ll need to work quickly to get your pieces together before the adhesive begins to dry."
        },
        {
          "headline":"Let the glue dry overnight.",
          "description":"Hot glue dries fast, but it can take a while to fully set. For best results, leave your pieces to sit for at least 8-10 hours. By the time you check back in the morning, the glue should be for maximum hold. A quick blast with a hair dryer can cause stray glue strings to vanish. Should you need to separate the glued surfaces for any reason, a hair dryer on a high heat setting can also be used to melt the dried glue."
        }
      ]
    },
    {
      "name":"Using Epoxy",
      "steps":[
        {
          "headline":"Purchase an epoxy applicator kit.",
          "description":"Epoxies are most commonly sold as a two-part system, which consist of a couple separate components: a resin and a hardener. These components have to be combined in order to be effective. Though not as common, one-part epoxies are also available, and can be applied straight out of the package. You can find basic epoxy kits at hardware stores, art supply shops and pharmacies, and in the home improvement aisle of most supercenters."
        },
        {
          "headline":"Mix the resin and hardener.",
          "description":"Squeeze a small glob of each component onto a smooth, disposable surface, like a paper plate. Swirl the two substances together using a toothpick, coffee stirrer or similar utensil. Once combined, they’ll form one super-strong adhesive. Pull on a pair of gloves before you get to work."
        },
        {
          "headline":"Apply the epoxy.",
          "description":"Spread a thin layer of adhesive onto the surfaces you need to glue. You can do this with the same toothpick or coffee stirrer you used to mix it, though you may have better results using something like a cotton swab that offers you more control over where it ends up. Brush an even coating over the entire surface, being careful not to leave any large gaps uncovered. For a superior hold, apply a small amount of epoxy to both pieces rather than globbing it all onto one."
        },
        {
          "headline":"Position the pieces as needed.",
          "description":"Take your time configuring your work surfaces. Epoxy dries fairly slowly compared to other types of adhesives, so you won’t need to rush to get everything in place. Clamping the pieces together or resting a heavy object on top can help the epoxy form a more solid bond."
        },
        {
          "headline":"Leave the epoxy to harden overnight.",
          "description":"Find an out of the way place to let the adhesive set up. It should dry to the touch within about 5 minutes, but it may take as long as 20 hours for it to cure completely. Try not to touch either piece too much in the meantime, if you can help it. Epoxies solidify as they dry, which makes for a longer-lasting connection, even in wet conditions. The drying time of a particular brand of epoxy will usually be listed on the packaging."
        }
      ]
    },
    {
      "name":"Using Contact Cement",
      "steps":[
        {
          "headline":"Use the proper safety gear.",
          "description":"Always wear gloves and eye protection when working with contact cement. It might even be a good idea to don a respirator if you have sensitive airways. Since it contains potent chemicals, you'll want to limit direct exposure to the adhesive as much as possible. Short-sleeved or snug-fitting clothing is a must. You don't want to accidentally drag a sleeve through industry-grade adhesive! Contact cement is most often used in construction and industrial projects. Due to its involved application process, it isn’t the best choice for arts and crafts or minor repair jobs. Instead, it's useful for activities like applying Formica to countertops."
        },
        {
          "headline":"Work in a well-ventilated space.",
          "description":"Contact cement emits flammable fumes which may be unsafe to breathe. Set up your materials outside, if possible. If you’re confined to an indoor workshop, open a door or crack a couple of windows and keep a fan running to allow the fumes to escape. If your project is taking a while, take frequent breaks to limit your exposure to fumes."
        },
        {
          "headline":"Roll or brush the contact cement onto both pieces.",
          "description":"Spread a thin coat across the entire surface, being cautious evenly cover the edges, but not to let the cement overlap them. Contact cement only sticks to itself, so it will be necessary to apply it to both pieces. When the adhesive is sticky to the touch but doesn't rub off on your fingers, it will be ready for joining. Use the smallest amount of adhesive possible. Before you start brushing on the contact cement, clean both surfaces thoroughly. Contaminants on your project surface can affect your bond and create an uneven surface."
        },
        {
          "headline":"Use spacers to help align your materials.",
          "description":"Arrange a series of dowels or scrap wood across the bottom piece and set the other piece on top. This will allow you to make minute adjustments. Once you’ve got the pieces where you want them, slide the spacers out one by one. Spacers will come in handy when joining pieces with precise edges, such as countertops or laminate and substrate. The cement won’t bond to the spacers because they don’t have any adhesive on them."
        },
        {
          "headline":"Apply direct pressure to the joined pieces.",
          "description":"Go over the top piece with a roller, or tap it lightly all over with a rubber mallet or similar object. This will complete the bonding process and help form a stronger connection—no extended drying time required. If you don’t have any other tools on hand, you can use a piece of lumber wrapped in a towel to flatten the top piece and work out bubbles and other inconsistencies."
        },
        {
          "headline":"Correct mistakes with a clothes iron.",
          "description":"The heat of the iron will reactivate the cement, making it pliable again. Run the iron over the area that needs fixing for a few seconds until the pieces begin to lose their hold. Then, adjust them carefully by hand and leave them to dry. Keep the iron on a low-medium setting to avoid damaging either surface. Clean up accidental drips, streaks, and smudges using lacquer thinner."
        }
      ]
    }
  ],
  "text":" Using Super Glue Buy a tube of high-strength super glue. Super glue typically comes in small tubes, so it will work best for small projects and repairs. For a hold that will last, invest in a heavy-duty adhesive like Loctite or Gorilla Glue rather than a bargain glue. One of these products will give you more lasting results than ordinary types of glue. If you’re working on something that requires a lot of assembling, stock up on multiple tubes. It never hurts to have a little extra super glue on hand. Some types of porous wood may absorb regular super glue before it bonds with the plastic. If you're working with a porous wood, look for a gel-based super glue. Sand the plastic surface lightly. Go over the broadest area of the plastic piece with a square of high-grit sandpaper before you get gluing. Sanding the plastic will make it more porous and increase its overall surface area, allowing it to bond to the wood more easily. Use only a few smooth, delicate strokes to avoid roughing up the plastic too much. If there's a chance you might damage the piece you're sanding, it may be better to skip this step. Clean the wooden piece with a damp cloth. A quick wipedown will remove dust and dirt that might interfere with the hold. Allow the wood to air dry, the wipe it down lightly with rubbing alcohol. This removes excess dust and oils, and helps pull out any remaining moisture. To avoid oversaturating the wood, wring the excess water out of the cloth after wetting it. Applying the glue while the wood is still damp may weaken its ability to hold. Add the glue to both surfaces. Squeeze the tube slowly to control the flow of the glue. Super glues are designed to be extra grippy, so only use as much as needed—a little bit goes a long way. Depending on the size and shape of the surface you’re gluing, it may be better to use stripes, dots or even swirls. For small or irregularly shaped objects, try applying the glue with a toothpick. Press the surfaces together. Guide the smaller piece into place on the larger piece. Once you’ve put them together, keep constant pressure on them until the glue has dried enough to hold securely. Find a flat, stable surface to set the pieces as they finish drying. Practice a couple dry runs beforehand to make sure you fit both pieces together precisely. Give the glue time to set. Most super glues will begin drying within seconds, but it may take as long as two hours for them to harden completely. During this time, avoid handling the glued objects as much as possible. Keep the objects somewhere cool and dry while they dry. Moisture can interfere with the glue’s ability to set up properly. Use acetone to dissolve super glue after it’s dried. Using Hot Glue Plug in and turn on the glue gun. Use the outlet closest to your work area so you can work comfortably. If your glue gun has a separate power switch, make sure it’s set to the “On” position. Give the glue gun a couple minutes to heat up before loading it. Be careful when working with an active glue gun—only grip the handle and body of the gun, never the tip. Load a glue stick into the backside of the gun. Once inside, the heating elements will begin to melt the glue. This may take several minutes. Choose high temperature glue sticks. These provide the strongest bond for plastics, and you won’t have to worry about the glue melting in warm weather or hot working conditions. To check to see if you’re ready to begin gluing, squeeze the trigger lightly and look for melted glue strings to emerge. Wipe off the tip of your glue gun with a thick rag before you start working with your wood. This keeps contaminants off your project and controls glue strings as you work. Apply the glue to one or both surfaces. Press the trigger on the gun to release the glue. Concentrate the glue on the broadest, flattest areas of the objects you’re joining. Use the gun’s tapered tip to direct the glue more precisely, and don’t use more than you have to. Hot glue can burn if it come into contact with your skin. Work next to the sink or keep a cup of cold water nearby in case you happen to get any on you by accident. Fit the objects together. Move the smaller piece into position over the larger one, making sure they’re properly spaced and aligned. Hold the pieces together firmly for 30 seconds to a minute while the glue begins to set. Test fit the pieces beforehand so you don’t make a mistake. When working with hot glue, you’ll need to work quickly to get your pieces together before the adhesive begins to dry. Let the glue dry overnight. Hot glue dries fast, but it can take a while to fully set. For best results, leave your pieces to sit for at least 8-10 hours. By the time you check back in the morning, the glue should be for maximum hold. A quick blast with a hair dryer can cause stray glue strings to vanish. Should you need to separate the glued surfaces for any reason, a hair dryer on a high heat setting can also be used to melt the dried glue. Using Epoxy Purchase an epoxy applicator kit. Epoxies are most commonly sold as a two-part system, which consist of a couple separate components: a resin and a hardener. These components have to be combined in order to be effective. Though not as common, one-part epoxies are also available, and can be applied straight out of the package. You can find basic epoxy kits at hardware stores, art supply shops and pharmacies, and in the home improvement aisle of most supercenters. Mix the resin and hardener. Squeeze a small glob of each component onto a smooth, disposable surface, like a paper plate. Swirl the two substances together using a toothpick, coffee stirrer or similar utensil. Once combined, they’ll form one super-strong adhesive. Pull on a pair of gloves before you get to work. Apply the epoxy. Spread a thin layer of adhesive onto the surfaces you need to glue. You can do this with the same toothpick or coffee stirrer you used to mix it, though you may have better results using something like a cotton swab that offers you more control over where it ends up. Brush an even coating over the entire surface, being careful not to leave any large gaps uncovered. For a superior hold, apply a small amount of epoxy to both pieces rather than globbing it all onto one. Position the pieces as needed. Take your time configuring your work surfaces. Epoxy dries fairly slowly compared to other types of adhesives, so you won’t need to rush to get everything in place. Clamping the pieces together or resting a heavy object on top can help the epoxy form a more solid bond. Leave the epoxy to harden overnight. Find an out of the way place to let the adhesive set up. It should dry to the touch within about 5 minutes, but it may take as long as 20 hours for it to cure completely. Try not to touch either piece too much in the meantime, if you can help it. Epoxies solidify as they dry, which makes for a longer-lasting connection, even in wet conditions. The drying time of a particular brand of epoxy will usually be listed on the packaging. Using Contact Cement Use the proper safety gear. Always wear gloves and eye protection when working with contact cement. It might even be a good idea to don a respirator if you have sensitive airways. Since it contains potent chemicals, you'll want to limit direct exposure to the adhesive as much as possible. Short-sleeved or snug-fitting clothing is a must. You don't want to accidentally drag a sleeve through industry-grade adhesive! Contact cement is most often used in construction and industrial projects. Due to its involved application process, it isn’t the best choice for arts and crafts or minor repair jobs. Instead, it's useful for activities like applying Formica to countertops. Work in a well-ventilated space. Contact cement emits flammable fumes which may be unsafe to breathe. Set up your materials outside, if possible. If you’re confined to an indoor workshop, open a door or crack a couple of windows and keep a fan running to allow the fumes to escape. If your project is taking a while, take frequent breaks to limit your exposure to fumes. Roll or brush the contact cement onto both pieces. Spread a thin coat across the entire surface, being cautious evenly cover the edges, but not to let the cement overlap them. Contact cement only sticks to itself, so it will be necessary to apply it to both pieces. When the adhesive is sticky to the touch but doesn't rub off on your fingers, it will be ready for joining. Use the smallest amount of adhesive possible. Before you start brushing on the contact cement, clean both surfaces thoroughly. Contaminants on your project surface can affect your bond and create an uneven surface. Use spacers to help align your materials. Arrange a series of dowels or scrap wood across the bottom piece and set the other piece on top. This will allow you to make minute adjustments. Once you’ve got the pieces where you want them, slide the spacers out one by one. Spacers will come in handy when joining pieces with precise edges, such as countertops or laminate and substrate. The cement won’t bond to the spacers because they don’t have any adhesive on them. Apply direct pressure to the joined pieces. Go over the top piece with a roller, or tap it lightly all over with a rubber mallet or similar object. This will complete the bonding process and help form a stronger connection—no extended drying time required. If you don’t have any other tools on hand, you can use a piece of lumber wrapped in a towel to flatten the top piece and work out bubbles and other inconsistencies. Correct mistakes with a clothes iron. The heat of the iron will reactivate the cement, making it pliable again. Run the iron over the area that needs fixing for a few seconds until the pieces begin to lose their hold. Then, adjust them carefully by hand and leave them to dry. Keep the iron on a low-medium setting to avoid damaging either surface. Clean up accidental drips, streaks, and smudges using lacquer thinner.",
  "sentences":[
    " Using Super Glue Buy a tube of high-strength super glue.",
    "Super glue typically comes in small tubes, so it will work best for small projects and repairs.",
    "For a hold that will last, invest in a heavy-duty adhesive like Loctite or Gorilla Glue rather than a bargain glue.",
    "One of these products will give you more lasting results than ordinary types of glue.",
    "If you’re working on something that requires a lot of assembling, stock up on multiple tubes.",
    "It never hurts to have a little extra super glue on hand.",
    "Some types of porous wood may absorb regular super glue before it bonds with the plastic.",
    "If you're working with a porous wood, look for a gel-based super glue.",
    "Sand the plastic surface lightly.",
    "Go over the broadest area of the plastic piece with a square of high-grit sandpaper before you get gluing.",
    "Sanding the plastic will make it more porous and increase its overall surface area, allowing it to bond to the wood more easily.",
    "Use only a few smooth, delicate strokes to avoid roughing up the plastic too much.",
    "If there's a chance you might damage the piece you're sanding, it may be better to skip this step.",
    "Clean the wooden piece with a damp cloth.",
    "A quick wipedown will remove dust and dirt that might interfere with the hold.",
    "Allow the wood to air dry, the wipe it down lightly with rubbing alcohol.",
    "This removes excess dust and oils, and helps pull out any remaining moisture.",
    "To avoid oversaturating the wood, wring the excess water out of the cloth after wetting it.",
    "Applying the glue while the wood is still damp may weaken its ability to hold.",
    "Add the glue to both surfaces.",
    "Squeeze the tube slowly to control the flow of the glue.",
    "Super glues are designed to be extra grippy, so only use as much as needed—a little bit goes a long way.",
    "Depending on the size and shape of the surface you’re gluing, it may be better to use stripes, dots or even swirls.",
    "For small or irregularly shaped objects, try applying the glue with a toothpick.",
    "Press the surfaces together.",
    "Guide the smaller piece into place on the larger piece.",
    "Once you’ve put them together, keep constant pressure on them until the glue has dried enough to hold securely.",
    "Find a flat, stable surface to set the pieces as they finish drying.",
    "Practice a couple dry runs beforehand to make sure you fit both pieces together precisely.",
    "Give the glue time to set.",
    "Most super glues will begin drying within seconds, but it may take as long as two hours for them to harden completely.",
    "During this time, avoid handling the glued objects as much as possible.",
    "Keep the objects somewhere cool and dry while they dry.",
    "Moisture can interfere with the glue’s ability to set up properly.",
    "Use acetone to dissolve super glue after it’s dried.",
    "Using Hot Glue Plug in and turn on the glue gun.",
    "Use the outlet closest to your work area so you can work comfortably.",
    "If your glue gun has a separate power switch, make sure it’s set to the “On” position.",
    "Give the glue gun a couple minutes to heat up before loading it.",
    "Be careful when working with an active glue gun—only grip the handle and body of the gun, never the tip.",
    "Load a glue stick into the backside of the gun.",
    "Once inside, the heating elements will begin to melt the glue.",
    "This may take several minutes.",
    "Choose high temperature glue sticks.",
    "These provide the strongest bond for plastics, and you won’t have to worry about the glue melting in warm weather or hot working conditions.",
    "To check to see if you’re ready to begin gluing, squeeze the trigger lightly and look for melted glue strings to emerge.",
    "Wipe off the tip of your glue gun with a thick rag before you start working with your wood.",
    "This keeps contaminants off your project and controls glue strings as you work.",
    "Apply the glue to one or both surfaces.",
    "Press the trigger on the gun to release the glue.",
    "Concentrate the glue on the broadest, flattest areas of the objects you’re joining.",
    "Use the gun’s tapered tip to direct the glue more precisely, and don’t use more than you have to.",
    "Hot glue can burn if it come into contact with your skin.",
    "Work next to the sink or keep a cup of cold water nearby in case you happen to get any on you by accident.",
    "Fit the objects together.",
    "Move the smaller piece into position over the larger one, making sure they’re properly spaced and aligned.",
    "Hold the pieces together firmly for 30 seconds to a minute while the glue begins to set.",
    "Test fit the pieces beforehand so you don’t make a mistake.",
    "When working with hot glue, you’ll need to work quickly to get your pieces together before the adhesive begins to dry.",
    "Let the glue dry overnight.",
    "Hot glue dries fast, but it can take a while to fully set.",
    "For best results, leave your pieces to sit for at least 8-10 hours.",
    "By the time you check back in the morning, the glue should be for maximum hold.",
    "A quick blast with a hair dryer can cause stray glue strings to vanish.",
    "Should you need to separate the glued surfaces for any reason, a hair dryer on a high heat setting can also be used to melt the dried glue.",
    "Using Epoxy Purchase an epoxy applicator kit.",
    "Epoxies are most commonly sold as a two-part system, which consist of a couple separate components: a resin and a hardener.",
    "These components have to be combined in order to be effective.",
    "Though not as common, one-part epoxies are also available, and can be applied straight out of the package.",
    "You can find basic epoxy kits at hardware stores, art supply shops and pharmacies, and in the home improvement aisle of most supercenters.",
    "Mix the resin and hardener.",
    "Squeeze a small glob of each component onto a smooth, disposable surface, like a paper plate.",
    "Swirl the two substances together using a toothpick, coffee stirrer or similar utensil.",
    "Once combined, they’ll form one super-strong adhesive.",
    "Pull on a pair of gloves before you get to work.",
    "Apply the epoxy.",
    "Spread a thin layer of adhesive onto the surfaces you need to glue.",
    "You can do this with the same toothpick or coffee stirrer you used to mix it, though you may have better results using something like a cotton swab that offers you more control over where it ends up.",
    "Brush an even coating over the entire surface, being careful not to leave any large gaps uncovered.",
    "For a superior hold, apply a small amount of epoxy to both pieces rather than globbing it all onto one.",
    "Position the pieces as needed.",
    "Take your time configuring your work surfaces.",
    "Epoxy dries fairly slowly compared to other types of adhesives, so you won’t need to rush to get everything in place.",
    "Clamping the pieces together or resting a heavy object on top can help the epoxy form a more solid bond.",
    "Leave the epoxy to harden overnight.",
    "Find an out of the way place to let the adhesive set up.",
    "It should dry to the touch within about 5 minutes, but it may take as long as 20 hours for it to cure completely.",
    "Try not to touch either piece too much in the meantime, if you can help it.",
    "Epoxies solidify as they dry, which makes for a longer-lasting connection, even in wet conditions.",
    "The drying time of a particular brand of epoxy will usually be listed on the packaging.",
    "Using Contact Cement Use the proper safety gear.",
    "Always wear gloves and eye protection when working with contact cement.",
    "It might even be a good idea to don a respirator if you have sensitive airways.",
    "Since it contains potent chemicals, you'll want to limit direct exposure to the adhesive as much as possible.",
    "Short-sleeved or snug-fitting clothing is a must.",
    "You don't want to accidentally drag a sleeve through industry-grade adhesive!",
    "Contact cement is most often used in construction and industrial projects.",
    "Due to its involved application process, it isn’t the best choice for arts and crafts or minor repair jobs.",
    "Instead, it's useful for activities like applying Formica to countertops.",
    "Work in a well-ventilated space.",
    "Contact cement emits flammable fumes which may be unsafe to breathe.",
    "Set up your materials outside, if possible.",
    "If you’re confined to an indoor workshop, open a door or crack a couple of windows and keep a fan running to allow the fumes to escape.",
    "If your project is taking a while, take frequent breaks to limit your exposure to fumes.",
    "Roll or brush the contact cement onto both pieces.",
    "Spread a thin coat across the entire surface, being cautious evenly cover the edges, but not to let the cement overlap them.",
    "Contact cement only sticks to itself, so it will be necessary to apply it to both pieces.",
    "When the adhesive is sticky to the touch but doesn't rub off on your fingers, it will be ready for joining.",
    "Use the smallest amount of adhesive possible.",
    "Before you start brushing on the contact cement, clean both surfaces thoroughly.",
    "Contaminants on your project surface can affect your bond and create an uneven surface.",
    "Use spacers to help align your materials.",
    "Arrange a series of dowels or scrap wood across the bottom piece and set the other piece on top.",
    "This will allow you to make minute adjustments.",
    "Once you’ve got the pieces where you want them, slide the spacers out one by one.",
    "Spacers will come in handy when joining pieces with precise edges, such as countertops or laminate and substrate.",
    "The cement won’t bond to the spacers because they don’t have any adhesive on them.",
    "Apply direct pressure to the joined pieces.",
    "Go over the top piece with a roller, or tap it lightly all over with a rubber mallet or similar object.",
    "This will complete the bonding process and help form a stronger connection—no extended drying time required.",
    "If you don’t have any other tools on hand, you can use a piece of lumber wrapped in a towel to flatten the top piece and work out bubbles and other inconsistencies.",
    "Correct mistakes with a clothes iron.",
    "The heat of the iron will reactivate the cement, making it pliable again.",
    "Run the iron over the area that needs fixing for a few seconds until the pieces begin to lose their hold.",
    "Then, adjust them carefully by hand and leave them to dry.",
    "Keep the iron on a low-medium setting to avoid damaging either surface.",
    "Clean up accidental drips, streaks, and smudges using lacquer thinner."
  ],
  "tyn_section":[
    "Super glue",
    "Hot glue gun",
    "High-temperature glue sticks",
    "One or two-part epoxy system",
    "Disposable surface (for mixing)",
    "Toothpick or wooden coffee stirrer (for application)",
    "Industry-grade contact cement",
    "Paintbrush or roller",
    "Wooden dowels or scrap wood",
    "Rubber roller",
    "Hairdryer (optional)",
    "Clothes iron (optional)",
    "Acetone (optional)"
  ],
  "tyn_model":[
    "glue",
    "super glue",
    "epoxy",
    "contact cement",
    "adhesive",
    "glue gun",
    "hot glue",
    "cement",
    "iron",
    "plastic",
    "hair dryer",
    "resin",
    "hardener",
    "coffee stirrer",
    "loctite or gorilla glue",
    "high-grit sandpaper",
    "rubbing alcohol",
    "water",
    "cloth",
    "glues",
    "—a",
    "toothpick",
    "acetone",
    "“on",
    "” position",
    "—only",
    "glue stick",
    "glue sticks",
    "glue strings",
    "cold water",
    "epoxy applicator",
    "epoxies",
    "epoxy kits",
    "cotton swab",
    "adhesives",
    "formica",
    "fan",
    "spacers",
    "dowels",
    "scrap wood",
    "roller",
    "rubber mallet",
    "—no",
    "clothes iron",
    "lacquer thinner"
  ],
  "simple_metrics":{
    "r":0.0769230769,
    "p":0.0222222222,
    "f1":0.0344827586,
    "avg_pos":0.0222222222
  },
  "jacc_metrics_0.5":{
    "r":0.5384615385,
    "p":0.2,
    "f1":0.2916666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6923076923,
    "p":0.3333333333,
    "f1":0.45
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3846153846,
    "p":0.1333333333,
    "f1":0.198019802
  }
}