{
  "title":"How to Macerate Blackberries",
  "url":"https://www.wikihow.com/Macerate-Blackberries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Berries"
  ],
  "parts":[
    {
      "name":"Washing and Slicing the Berries",
      "steps":[
        {
          "headline":"Set out a pound of blackberries.",
          "description":"Start with a pound (453 g) of blackberries. You can use more or less blackberries, depending on need. If one pound of blackberries is too much for you, you can use a half pound (227 g) of berries. It’s also an option to combine the blackberries with other berries—like strawberries and blueberries."
        },
        {
          "headline":"Rinse the berries thoroughly with clean water.",
          "description":"It’s important to wash the blackberries if you haven’t done so already. Simply run the blackberries under tap water for about 30 seconds. This will allow any dirt particles or chemicals to wash off."
        },
        {
          "headline":"Slice the berries if you want to speed up the process.",
          "description":"Slicing bigger berries will speed up the maceration process, but it’s not a necessity. Take a sharp knife and slice the berries in half. You may find this too time consuming, however, if you are macerating a lot of blackberries."
        },
        {
          "headline":"Place the berries in a bowl.",
          "description":"This is the bowl that you will add the macerating ingredient to. Make sure the bowl is big enough so that it will not overfill once the berries start to macerate. Blackberries can stain surfaces, so it is best to use a bowl you don’t mind staining."
        }
      ]
    },
    {
      "name":"Combining the Ingredients",
      "steps":[
        {
          "headline":"Choose a macerating ingredient.",
          "description":"Berries are commonly macerated with sugar, but there are several other ingredients you can choose. For example, you can use gin and maple syrup, vanilla extract, citrus juice, or strong wine. Keep in mind that the ingredient you choose will affect the flavor of the berries. For example, sugar and vanilla extract will make the berries sweeter, but strong wine will give it an alcoholic flavor."
        },
        {
          "headline":"Use two tablespoons of syrup or sugar.",
          "description":"Measure two tablespoons (30 g) of sugar or 2 tablespoons (29.5 mL) of syrup. If you’re combining ingredients, you can use 2 tablespoons of each ingredient. For example, you can use 2 tablespoons of maple syrup and 2 tablespoons of gin if you plan to combine them. Two tablespoons is recommended, but you can add slightly more if you feel that it is not enough."
        },
        {
          "headline":"Mix the ingredients.",
          "description":"Pour the sugar, liquid, or syrup over the blackberries. Use wooden spoon to thoroughly combine the ingredients together. Continue to combine the ingredients until it appears that all of the blackberries have been covered in the sugar or syrup."
        },
        {
          "headline":"Cover the bowl with plastic wrap.",
          "description":"Once the ingredients have been combined, cover the bowl in plastic wrap. Make sure the plastic wrap is tightly secured over the bowl. This will help speed up the maceration process."
        },
        {
          "headline":"Let the bowl sit for 30 minutes to overnight.",
          "description":"The maceration process begins within a few minutes, but you will need to let it sit for at least 30 minutes for a good result. It’s an option to let it sit for 30 minutes or overnight. Keep the bowl out on the counter or put it in the refrigerator; the choice is up to you. After that, your berries are ready to be served."
        },
        {
          "headline":"Store the extra berries in an airtight container for a few days.",
          "description":"If you won’t be eating all of the macerated berries at once, it’s possible to keep them fresh for 3 to 4 days. Store the extra berries in an airtight container and put them in the refrigerator. You can keep the macerated berries good for a few more days if you store them in the freezer."
        }
      ]
    },
    {
      "name":"Serving the Macerated Blackberries",
      "steps":[
        {
          "headline":"Put the berries over plain yogurt or ice cream.",
          "description":"Macerated berries are commonly used as a topping for plain ice cream or yogurt. Once the berries are done macerating, simply pour them over your preferred treat. You can add as few or as many berries as you’d like."
        },
        {
          "headline":"Use it as a cake topping.",
          "description":"Using macerated berries as a cake topping is a great alternative or addition to icing, depending on how sweet you’d like your cake to be. Pour the macerated berries, including the syrup, over the cake. Pour enough so that the cake is covered in the berries and sweet syrup."
        },
        {
          "headline":"Make a homemade soda.",
          "description":"It’s easy to make a homemade soda out of macerated berries and club soda. First, drain the syrup from the berries using a strainer or by simply pouring the syrup out. Then, add the syrup to club soda and enjoy. You can add the remaining berries to yogurt or ice cream."
        },
        {
          "headline":"Add the berries to sangria or champagne.",
          "description":"Macerated berries are also a great addition to an alcoholic beverage. The result will be better if you use berries that have been macerated in something sweet, like sugar or maple syrup, rather than another alcohol. Pour a small amount of the berries into sangria or champagne in order to avoid over-sweetening the beverage."
        }
      ]
    }
  ],
  "text":" Washing and Slicing the Berries Set out a pound of blackberries. Start with a pound (453 g) of blackberries. You can use more or less blackberries, depending on need. If one pound of blackberries is too much for you, you can use a half pound (227 g) of berries. It’s also an option to combine the blackberries with other berries—like strawberries and blueberries. Rinse the berries thoroughly with clean water. It’s important to wash the blackberries if you haven’t done so already. Simply run the blackberries under tap water for about 30 seconds. This will allow any dirt particles or chemicals to wash off. Slice the berries if you want to speed up the process. Slicing bigger berries will speed up the maceration process, but it’s not a necessity. Take a sharp knife and slice the berries in half. You may find this too time consuming, however, if you are macerating a lot of blackberries. Place the berries in a bowl. This is the bowl that you will add the macerating ingredient to. Make sure the bowl is big enough so that it will not overfill once the berries start to macerate. Blackberries can stain surfaces, so it is best to use a bowl you don’t mind staining. Combining the Ingredients Choose a macerating ingredient. Berries are commonly macerated with sugar, but there are several other ingredients you can choose. For example, you can use gin and maple syrup, vanilla extract, citrus juice, or strong wine. Keep in mind that the ingredient you choose will affect the flavor of the berries. For example, sugar and vanilla extract will make the berries sweeter, but strong wine will give it an alcoholic flavor. Use two tablespoons of syrup or sugar. Measure two tablespoons (30 g) of sugar or 2 tablespoons (29.5 mL) of syrup. If you’re combining ingredients, you can use 2 tablespoons of each ingredient. For example, you can use 2 tablespoons of maple syrup and 2 tablespoons of gin if you plan to combine them. Two tablespoons is recommended, but you can add slightly more if you feel that it is not enough. Mix the ingredients. Pour the sugar, liquid, or syrup over the blackberries. Use wooden spoon to thoroughly combine the ingredients together. Continue to combine the ingredients until it appears that all of the blackberries have been covered in the sugar or syrup. Cover the bowl with plastic wrap. Once the ingredients have been combined, cover the bowl in plastic wrap. Make sure the plastic wrap is tightly secured over the bowl. This will help speed up the maceration process. Let the bowl sit for 30 minutes to overnight. The maceration process begins within a few minutes, but you will need to let it sit for at least 30 minutes for a good result. It’s an option to let it sit for 30 minutes or overnight. Keep the bowl out on the counter or put it in the refrigerator; the choice is up to you. After that, your berries are ready to be served. Store the extra berries in an airtight container for a few days. If you won’t be eating all of the macerated berries at once, it’s possible to keep them fresh for 3 to 4 days. Store the extra berries in an airtight container and put them in the refrigerator. You can keep the macerated berries good for a few more days if you store them in the freezer. Serving the Macerated Blackberries Put the berries over plain yogurt or ice cream. Macerated berries are commonly used as a topping for plain ice cream or yogurt. Once the berries are done macerating, simply pour them over your preferred treat. You can add as few or as many berries as you’d like. Use it as a cake topping. Using macerated berries as a cake topping is a great alternative or addition to icing, depending on how sweet you’d like your cake to be. Pour the macerated berries, including the syrup, over the cake. Pour enough so that the cake is covered in the berries and sweet syrup. Make a homemade soda. It’s easy to make a homemade soda out of macerated berries and club soda. First, drain the syrup from the berries using a strainer or by simply pouring the syrup out. Then, add the syrup to club soda and enjoy. You can add the remaining berries to yogurt or ice cream. Add the berries to sangria or champagne. Macerated berries are also a great addition to an alcoholic beverage. The result will be better if you use berries that have been macerated in something sweet, like sugar or maple syrup, rather than another alcohol. Pour a small amount of the berries into sangria or champagne in order to avoid over-sweetening the beverage.",
  "sentences":[
    " Washing and Slicing the Berries Set out a pound of blackberries.",
    "Start with a pound (453 g) of blackberries.",
    "You can use more or less blackberries, depending on need.",
    "If one pound of blackberries is too much for you, you can use a half pound (227 g) of berries.",
    "It’s also an option to combine the blackberries with other berries—like strawberries and blueberries.",
    "Rinse the berries thoroughly with clean water.",
    "It’s important to wash the blackberries if you haven’t done so already.",
    "Simply run the blackberries under tap water for about 30 seconds.",
    "This will allow any dirt particles or chemicals to wash off.",
    "Slice the berries if you want to speed up the process.",
    "Slicing bigger berries will speed up the maceration process, but it’s not a necessity.",
    "Take a sharp knife and slice the berries in half.",
    "You may find this too time consuming, however, if you are macerating a lot of blackberries.",
    "Place the berries in a bowl.",
    "This is the bowl that you will add the macerating ingredient to.",
    "Make sure the bowl is big enough so that it will not overfill once the berries start to macerate.",
    "Blackberries can stain surfaces, so it is best to use a bowl you don’t mind staining.",
    "Combining the Ingredients Choose a macerating ingredient.",
    "Berries are commonly macerated with sugar, but there are several other ingredients you can choose.",
    "For example, you can use gin and maple syrup, vanilla extract, citrus juice, or strong wine.",
    "Keep in mind that the ingredient you choose will affect the flavor of the berries.",
    "For example, sugar and vanilla extract will make the berries sweeter, but strong wine will give it an alcoholic flavor.",
    "Use two tablespoons of syrup or sugar.",
    "Measure two tablespoons (30 g) of sugar or 2 tablespoons (29.5 mL) of syrup.",
    "If you’re combining ingredients, you can use 2 tablespoons of each ingredient.",
    "For example, you can use 2 tablespoons of maple syrup and 2 tablespoons of gin if you plan to combine them.",
    "Two tablespoons is recommended, but you can add slightly more if you feel that it is not enough.",
    "Mix the ingredients.",
    "Pour the sugar, liquid, or syrup over the blackberries.",
    "Use wooden spoon to thoroughly combine the ingredients together.",
    "Continue to combine the ingredients until it appears that all of the blackberries have been covered in the sugar or syrup.",
    "Cover the bowl with plastic wrap.",
    "Once the ingredients have been combined, cover the bowl in plastic wrap.",
    "Make sure the plastic wrap is tightly secured over the bowl.",
    "This will help speed up the maceration process.",
    "Let the bowl sit for 30 minutes to overnight.",
    "The maceration process begins within a few minutes, but you will need to let it sit for at least 30 minutes for a good result.",
    "It’s an option to let it sit for 30 minutes or overnight.",
    "Keep the bowl out on the counter or put it in the refrigerator; the choice is up to you.",
    "After that, your berries are ready to be served.",
    "Store the extra berries in an airtight container for a few days.",
    "If you won’t be eating all of the macerated berries at once, it’s possible to keep them fresh for 3 to 4 days.",
    "Store the extra berries in an airtight container and put them in the refrigerator.",
    "You can keep the macerated berries good for a few more days if you store them in the freezer.",
    "Serving the Macerated Blackberries Put the berries over plain yogurt or ice cream.",
    "Macerated berries are commonly used as a topping for plain ice cream or yogurt.",
    "Once the berries are done macerating, simply pour them over your preferred treat.",
    "You can add as few or as many berries as you’d like.",
    "Use it as a cake topping.",
    "Using macerated berries as a cake topping is a great alternative or addition to icing, depending on how sweet you’d like your cake to be.",
    "Pour the macerated berries, including the syrup, over the cake.",
    "Pour enough so that the cake is covered in the berries and sweet syrup.",
    "Make a homemade soda.",
    "It’s easy to make a homemade soda out of macerated berries and club soda.",
    "First, drain the syrup from the berries using a strainer or by simply pouring the syrup out.",
    "Then, add the syrup to club soda and enjoy.",
    "You can add the remaining berries to yogurt or ice cream.",
    "Add the berries to sangria or champagne.",
    "Macerated berries are also a great addition to an alcoholic beverage.",
    "The result will be better if you use berries that have been macerated in something sweet, like sugar or maple syrup, rather than another alcohol.",
    "Pour a small amount of the berries into sangria or champagne in order to avoid over-sweetening the beverage."
  ],
  "tyn_section":[
    "Knife",
    "Bowl",
    "Plastic wrap"
  ],
  "tyn_model":[
    "berries",
    "blackberries",
    "bowl",
    "sugar",
    "maple syrup",
    "syrup",
    "plastic wrap",
    "ice cream",
    "gin",
    "refrigerator",
    "airtight container",
    "yogurt",
    "club soda",
    "—like",
    "strawberries",
    "blueberries",
    "water",
    "tap water",
    "knife",
    "vanilla",
    "citrus juice",
    "vanilla extract",
    "wine",
    "wooden spoon",
    "freezer",
    "plain yogurt",
    "cake topping",
    "sweet syrup",
    "strainer",
    "sangria or",
    "champagne"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.0967741935,
    "f1":0.1764705882,
    "avg_pos":0.5806451613
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.0967741935,
    "f1":0.1764705882
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.0967741935,
    "f1":0.1764705882
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.0967741935,
    "f1":0.1764705882
  }
}