{
  "title":"How to Color Concrete",
  "url":"https://www.wikihow.com/Color-Concrete",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Concrete",
    "Decorating Concrete"
  ],
  "methods":[
    {
      "name":"Using Integral Dye",
      "steps":[
        {
          "headline":"Transfer the dye to a plain paper bag.",
          "description":"Integral dye is usually separated into a pre-weighed container intended for a specific amount of concrete (like a cubic yard). To more easily and completely distribute the dye, transfer it from its container to a plain paper bag. Prevent dye from escaping the bag by rolling or folding its top closed. Pouring dye straight from its container into a mixer can be difficult and result in lost dye. Once in a paper bag, the bag and dye can be tossed into the mixer together because the paper will dissolve in the cement. To limit contamination, avoid using paper bags with any ink. Although unlikely, ink from labels or lettering could slightly alter the color of the integral dye."
        },
        {
          "headline":"Check the consistency of the concrete.",
          "description":"This is especially important if you'll be adding a large amount of dye to the concrete. Dye can cause concrete to thicken, so you may want to add a little more water to the mixer before putting in the dye. Try to get the consistency of your concrete as perfect as possible before adding the dye. Once you add the dye, avoid adding more water. Adding water can noticeably lighten the concrete's color."
        },
        {
          "headline":"Insert the dye bag into the concrete mixer.",
          "description":"Set your concrete mixer to its max speed and toss the dye bag inside. Dye should distribute with concrete in a mixer for about 15 minutes at the max mixing speed or for about 130 revolutions of the mixer. After your dye is finished mixing, you'll be ready to pour the concrete into your forms. The whole batch of concrete should be dyed one consistent color throughout. When pouring the concrete, keep an eye out for any large pieces of paper bag. Although rare, sometimes pieces of the bag do not dissolve. Simply fish out these pieces and throw them away."
        },
        {
          "headline":"Avoid dyeing in rainy weather.",
          "description":"Check a weather report before attempting to pour integrally dyed concrete. If water splashes on its surface before it finishes curing, the color may lighten or change. Covering dyed concrete before it fully cures can also significantly alter its final color."
        }
      ]
    },
    {
      "name":"Staining Concrete",
      "steps":[
        {
          "headline":"Clean the surface of the concrete thoroughly.",
          "description":"Imperfections and dirtiness will still be visible after you apply stain to the concrete and seal it. All adhesives, dust, flaking paint, and stains should be removed with a thorough cleaning before you stain the concrete. If your concrete is fresh poured or relatively clean, you may only need to give it a good rinse with water. Light dirtiness can usually be cleaned with a deck brush, mild soap, and water. Stubborn stains and grease can resist many conventional cleaners. When all else fails, use a little bit of degreaser with a deck brush to remove difficult blemishes. Freshly poured concrete generally needs to cure fully before stain can be applied. To make sure you don't waste supplies, wait at least 20 days after pouring before you stain."
        },
        {
          "headline":"Protect floor molding, doors, and walls with tape.",
          "description":"Just like the stain will color your concrete, if you get it on floor molding or the bottoms of doors and walls, it will color these parts of your home as well. Carefully tape off all edges where the concrete comes in contact with other parts of your home. When taping, use overlapping segments to decrease the chances of stain finding a crack in your tape job."
        },
        {
          "headline":"Dilute the stain to your preferred tint, if necessary.",
          "description":"In most situations, you'll be able to dilute the color of your stain to adjust its tint. Each brand of stain will be different, so you'll have to follow the label directions to ensure you dilute the color correctly. When you think you've got the tint just right, use a paintbrush to apply a little stain to an out of sight spot on the concrete so you have a better impression of how it'll look when applied."
        },
        {
          "headline":"Apply the stain to the concrete.",
          "description":"For most kinds of concrete stain, you'll need to lightly dampen the concrete with a hose before applying. Then, working from one end to the opposite side, brush the stain onto the concrete in an even layer. If your stain is acid based, you'll need to wear latex gloves and safety glasses when applying it to protect yourself from getting burned. To make the job go quicker, use a sprayer. However, most concrete stains are acid based, so you'll want the sprayer to be made out of plastic, which can withstand the acid. Pay close attention to corners and edges when applying stain to concrete. Stain has a tendency to collect in these areas unevenly."
        },
        {
          "headline":"Allow the stain to dry.",
          "description":"Each brand and color will be different, so you'll have to check the label of your stain to determine how long it'll need to dry. Most stains will be dry to the touch in about 15 to 20 minutes, but will need 24 hours to fully cure. If your stain appears to be taking longer than usual to dry, this may be because of environmental factors, like the temperature or humidity."
        },
        {
          "headline":"Use a second coat to improve the color's intensity.",
          "description":"If your first application doesn't quite have the pop you envisioned, wait a few hours and repeat the process. Generally, with each coat you apply, the color will become even more vibrant."
        },
        {
          "headline":"Rinse and neutralize the stain when necessary.",
          "description":"After the stain has dried and cured, rinse the surface of the concrete with water until the water runs off clean. A rinse is all you'll need for water based stains, but acid bases must be deactivated with baking soda and water. The label of acid based stains should list the ideal proportion and method of application for the neutralizing agent. Rinse your deck brush clean, if necessary, and use it to lightly brush the concrete when rinsing and neutralizing. This will help loosen stubborn residue."
        },
        {
          "headline":"Seal the stain.",
          "description":"Now that your floor is stained, all you need to do is roll on an even layer of sealer with a paint roller. Consider adding a second layer when the first dries for improved durability and to prevent fading in your stained concrete. Most indoor concrete is sealed with a wax based product. Outdoor or high-traffic areas may benefit from a stronger sealant, like epoxy and urethane."
        }
      ]
    }
  ],
  "text":" Using Integral Dye Transfer the dye to a plain paper bag. Integral dye is usually separated into a pre-weighed container intended for a specific amount of concrete (like a cubic yard). To more easily and completely distribute the dye, transfer it from its container to a plain paper bag. Prevent dye from escaping the bag by rolling or folding its top closed. Pouring dye straight from its container into a mixer can be difficult and result in lost dye. Once in a paper bag, the bag and dye can be tossed into the mixer together because the paper will dissolve in the cement. To limit contamination, avoid using paper bags with any ink. Although unlikely, ink from labels or lettering could slightly alter the color of the integral dye. Check the consistency of the concrete. This is especially important if you'll be adding a large amount of dye to the concrete. Dye can cause concrete to thicken, so you may want to add a little more water to the mixer before putting in the dye. Try to get the consistency of your concrete as perfect as possible before adding the dye. Once you add the dye, avoid adding more water. Adding water can noticeably lighten the concrete's color. Insert the dye bag into the concrete mixer. Set your concrete mixer to its max speed and toss the dye bag inside. Dye should distribute with concrete in a mixer for about 15 minutes at the max mixing speed or for about 130 revolutions of the mixer. After your dye is finished mixing, you'll be ready to pour the concrete into your forms. The whole batch of concrete should be dyed one consistent color throughout. When pouring the concrete, keep an eye out for any large pieces of paper bag. Although rare, sometimes pieces of the bag do not dissolve. Simply fish out these pieces and throw them away. Avoid dyeing in rainy weather. Check a weather report before attempting to pour integrally dyed concrete. If water splashes on its surface before it finishes curing, the color may lighten or change. Covering dyed concrete before it fully cures can also significantly alter its final color. Staining Concrete Clean the surface of the concrete thoroughly. Imperfections and dirtiness will still be visible after you apply stain to the concrete and seal it. All adhesives, dust, flaking paint, and stains should be removed with a thorough cleaning before you stain the concrete. If your concrete is fresh poured or relatively clean, you may only need to give it a good rinse with water. Light dirtiness can usually be cleaned with a deck brush, mild soap, and water. Stubborn stains and grease can resist many conventional cleaners. When all else fails, use a little bit of degreaser with a deck brush to remove difficult blemishes. Freshly poured concrete generally needs to cure fully before stain can be applied. To make sure you don't waste supplies, wait at least 20 days after pouring before you stain. Protect floor molding, doors, and walls with tape. Just like the stain will color your concrete, if you get it on floor molding or the bottoms of doors and walls, it will color these parts of your home as well. Carefully tape off all edges where the concrete comes in contact with other parts of your home. When taping, use overlapping segments to decrease the chances of stain finding a crack in your tape job. Dilute the stain to your preferred tint, if necessary. In most situations, you'll be able to dilute the color of your stain to adjust its tint. Each brand of stain will be different, so you'll have to follow the label directions to ensure you dilute the color correctly. When you think you've got the tint just right, use a paintbrush to apply a little stain to an out of sight spot on the concrete so you have a better impression of how it'll look when applied. Apply the stain to the concrete. For most kinds of concrete stain, you'll need to lightly dampen the concrete with a hose before applying. Then, working from one end to the opposite side, brush the stain onto the concrete in an even layer. If your stain is acid based, you'll need to wear latex gloves and safety glasses when applying it to protect yourself from getting burned. To make the job go quicker, use a sprayer. However, most concrete stains are acid based, so you'll want the sprayer to be made out of plastic, which can withstand the acid. Pay close attention to corners and edges when applying stain to concrete. Stain has a tendency to collect in these areas unevenly. Allow the stain to dry. Each brand and color will be different, so you'll have to check the label of your stain to determine how long it'll need to dry. Most stains will be dry to the touch in about 15 to 20 minutes, but will need 24 hours to fully cure. If your stain appears to be taking longer than usual to dry, this may be because of environmental factors, like the temperature or humidity. Use a second coat to improve the color's intensity. If your first application doesn't quite have the pop you envisioned, wait a few hours and repeat the process. Generally, with each coat you apply, the color will become even more vibrant. Rinse and neutralize the stain when necessary. After the stain has dried and cured, rinse the surface of the concrete with water until the water runs off clean. A rinse is all you'll need for water based stains, but acid bases must be deactivated with baking soda and water. The label of acid based stains should list the ideal proportion and method of application for the neutralizing agent. Rinse your deck brush clean, if necessary, and use it to lightly brush the concrete when rinsing and neutralizing. This will help loosen stubborn residue. Seal the stain. Now that your floor is stained, all you need to do is roll on an even layer of sealer with a paint roller. Consider adding a second layer when the first dries for improved durability and to prevent fading in your stained concrete. Most indoor concrete is sealed with a wax based product. Outdoor or high-traffic areas may benefit from a stronger sealant, like epoxy and urethane.",
  "sentences":[
    " Using Integral Dye Transfer the dye to a plain paper bag.",
    "Integral dye is usually separated into a pre-weighed container intended for a specific amount of concrete (like a cubic yard).",
    "To more easily and completely distribute the dye, transfer it from its container to a plain paper bag.",
    "Prevent dye from escaping the bag by rolling or folding its top closed.",
    "Pouring dye straight from its container into a mixer can be difficult and result in lost dye.",
    "Once in a paper bag, the bag and dye can be tossed into the mixer together because the paper will dissolve in the cement.",
    "To limit contamination, avoid using paper bags with any ink.",
    "Although unlikely, ink from labels or lettering could slightly alter the color of the integral dye.",
    "Check the consistency of the concrete.",
    "This is especially important if you'll be adding a large amount of dye to the concrete.",
    "Dye can cause concrete to thicken, so you may want to add a little more water to the mixer before putting in the dye.",
    "Try to get the consistency of your concrete as perfect as possible before adding the dye.",
    "Once you add the dye, avoid adding more water.",
    "Adding water can noticeably lighten the concrete's color.",
    "Insert the dye bag into the concrete mixer.",
    "Set your concrete mixer to its max speed and toss the dye bag inside.",
    "Dye should distribute with concrete in a mixer for about 15 minutes at the max mixing speed or for about 130 revolutions of the mixer.",
    "After your dye is finished mixing, you'll be ready to pour the concrete into your forms.",
    "The whole batch of concrete should be dyed one consistent color throughout.",
    "When pouring the concrete, keep an eye out for any large pieces of paper bag.",
    "Although rare, sometimes pieces of the bag do not dissolve.",
    "Simply fish out these pieces and throw them away.",
    "Avoid dyeing in rainy weather.",
    "Check a weather report before attempting to pour integrally dyed concrete.",
    "If water splashes on its surface before it finishes curing, the color may lighten or change.",
    "Covering dyed concrete before it fully cures can also significantly alter its final color.",
    "Staining Concrete Clean the surface of the concrete thoroughly.",
    "Imperfections and dirtiness will still be visible after you apply stain to the concrete and seal it.",
    "All adhesives, dust, flaking paint, and stains should be removed with a thorough cleaning before you stain the concrete.",
    "If your concrete is fresh poured or relatively clean, you may only need to give it a good rinse with water.",
    "Light dirtiness can usually be cleaned with a deck brush, mild soap, and water.",
    "Stubborn stains and grease can resist many conventional cleaners.",
    "When all else fails, use a little bit of degreaser with a deck brush to remove difficult blemishes.",
    "Freshly poured concrete generally needs to cure fully before stain can be applied.",
    "To make sure you don't waste supplies, wait at least 20 days after pouring before you stain.",
    "Protect floor molding, doors, and walls with tape.",
    "Just like the stain will color your concrete, if you get it on floor molding or the bottoms of doors and walls, it will color these parts of your home as well.",
    "Carefully tape off all edges where the concrete comes in contact with other parts of your home.",
    "When taping, use overlapping segments to decrease the chances of stain finding a crack in your tape job.",
    "Dilute the stain to your preferred tint, if necessary.",
    "In most situations, you'll be able to dilute the color of your stain to adjust its tint.",
    "Each brand of stain will be different, so you'll have to follow the label directions to ensure you dilute the color correctly.",
    "When you think you've got the tint just right, use a paintbrush to apply a little stain to an out of sight spot on the concrete so you have a better impression of how it'll look when applied.",
    "Apply the stain to the concrete.",
    "For most kinds of concrete stain, you'll need to lightly dampen the concrete with a hose before applying.",
    "Then, working from one end to the opposite side, brush the stain onto the concrete in an even layer.",
    "If your stain is acid based, you'll need to wear latex gloves and safety glasses when applying it to protect yourself from getting burned.",
    "To make the job go quicker, use a sprayer.",
    "However, most concrete stains are acid based, so you'll want the sprayer to be made out of plastic, which can withstand the acid.",
    "Pay close attention to corners and edges when applying stain to concrete.",
    "Stain has a tendency to collect in these areas unevenly.",
    "Allow the stain to dry.",
    "Each brand and color will be different, so you'll have to check the label of your stain to determine how long it'll need to dry.",
    "Most stains will be dry to the touch in about 15 to 20 minutes, but will need 24 hours to fully cure.",
    "If your stain appears to be taking longer than usual to dry, this may be because of environmental factors, like the temperature or humidity.",
    "Use a second coat to improve the color's intensity.",
    "If your first application doesn't quite have the pop you envisioned, wait a few hours and repeat the process.",
    "Generally, with each coat you apply, the color will become even more vibrant.",
    "Rinse and neutralize the stain when necessary.",
    "After the stain has dried and cured, rinse the surface of the concrete with water until the water runs off clean.",
    "A rinse is all you'll need for water based stains, but acid bases must be deactivated with baking soda and water.",
    "The label of acid based stains should list the ideal proportion and method of application for the neutralizing agent.",
    "Rinse your deck brush clean, if necessary, and use it to lightly brush the concrete when rinsing and neutralizing.",
    "This will help loosen stubborn residue.",
    "Seal the stain.",
    "Now that your floor is stained, all you need to do is roll on an even layer of sealer with a paint roller.",
    "Consider adding a second layer when the first dries for improved durability and to prevent fading in your stained concrete.",
    "Most indoor concrete is sealed with a wax based product.",
    "Outdoor or high-traffic areas may benefit from a stronger sealant, like epoxy and urethane."
  ],
  "tyn_section":[
    "Concrete mixer (and ",
    "concrete",
    ")",
    "Integral concrete dye",
    "Plain paper bag (like an unmarked paper grocery bag)",
    "Baking soda",
    "Concrete sealer",
    "Concrete stain",
    "Deck brush (for cleaning concrete)",
    "Degreaser (optional)",
    "Latex gloves (optional)",
    "Masking tape",
    "Paintbrush (or similar stain applicator)",
    "Paint roller",
    "Safety glasses (optional)"
  ],
  "tyn_model":[
    "concrete",
    "water",
    "mixer",
    "deck brush",
    "integral dye",
    "plain paper bag",
    "dye",
    "concrete mixer",
    "stain",
    "tape",
    "sprayer",
    "mild soap",
    "paintbrush",
    "concrete stain",
    "hose",
    "baking soda",
    "acid based stains",
    "sealer",
    "paint roller",
    "epoxy",
    "urethane"
  ],
  "simple_metrics":{
    "r":0.2666666667,
    "p":0.1904761905,
    "f1":0.2222222222,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5333333333,
    "p":0.4285714286,
    "f1":0.4752475248
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.619047619,
    "f1":0.6419753086
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.2857142857,
    "f1":0.3333333333
  }
}