{
  "title":"How to Get Silly Putty Out of Carpet",
  "url":"https://www.wikihow.com/Get-Silly-Putty-Out-of-Carpet",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Carpets and Rugs"
  ],
  "parts":[
    {
      "name":"Freezing the Silly Putty",
      "steps":[
        {
          "headline":"Fill a plastic bag with ice.",
          "description":"The number of ice cubes you use will depend on the size of the putty stain, but try to use at least three or four. You want there to be enough ice in the bag to cover the entire surface of the silly putty."
        },
        {
          "headline":"Place the bag of ice on top of the silly putty.",
          "description":"Make sure all the silly putty is covered by the bag."
        },
        {
          "headline":"Let the silly putty harden under the ice for 2 - 3 hours.",
          "description":"Refill the bag with new ice if the old ice melts during the wait."
        },
        {
          "headline":"Break up the hardened silly putty with a knife.",
          "description":"You want it to break apart into tinier pieces that you can easily pull up from the carpet. Discard the hardened bits of silly putty that you're able to remove."
        }
      ]
    },
    {
      "name":"Cleaning the Carpet with Detergent",
      "steps":[
        {
          "headline":"Mix two spoonfuls of mild laundry detergent into a cup of warm water.",
          "description":"Make sure the detergent is free of bleaches or chemicals that could stain the carpet."
        },
        {
          "headline":"Soak a cotton ball in the diluted detergent mixture.",
          "description":"If you don't have a cotton ball, you can also use towel or wash cloth."
        },
        {
          "headline":"Use the cotton ball to blot the carpet stain and any remaining silly putty.",
          "description":"Make sure the entire surface of the stain is covered in detergent."
        },
        {
          "headline":"Let the detergent soak into the carpet and leftover silly putty for 20 minutes.",
          "description":"After 20 minutes, place a dry cloth over the silly putty and press down to absorb the detergent."
        },
        {
          "headline":"Use a damp cloth to wipe the stained area.",
          "description":"The stain from the silly putty should be gone, and some of the leftover particles from the silly putty should be easier to remove."
        }
      ]
    },
    {
      "name":"Using Nail Polish Remover",
      "steps":[
        {
          "headline":"Soak a cotton ball in acetone nail polish remover.",
          "description":"You can also use rubbing alcohol if you don’t have access to nail polish remover."
        },
        {
          "headline":"Blot the silly putty with the cotton ball.",
          "description":"Make sure the surface of the silly putty gets completely covered in nail polish remover."
        },
        {
          "headline":"Use a knife to scrape away the silly putty.",
          "description":"Discard the pieces of silly putty as you scrape them off."
        },
        {
          "headline":"Repeat the process until all the silly putty is gone.",
          "description":"If the silly putty won’t come up from the carpet, try using more nail polish remover or freezing the silly putty with an ice pack before applying the nail polish remover."
        }
      ]
    }
  ],
  "text":" Freezing the Silly Putty Fill a plastic bag with ice. The number of ice cubes you use will depend on the size of the putty stain, but try to use at least three or four. You want there to be enough ice in the bag to cover the entire surface of the silly putty. Place the bag of ice on top of the silly putty. Make sure all the silly putty is covered by the bag. Let the silly putty harden under the ice for 2 - 3 hours. Refill the bag with new ice if the old ice melts during the wait. Break up the hardened silly putty with a knife. You want it to break apart into tinier pieces that you can easily pull up from the carpet. Discard the hardened bits of silly putty that you're able to remove. Cleaning the Carpet with Detergent Mix two spoonfuls of mild laundry detergent into a cup of warm water. Make sure the detergent is free of bleaches or chemicals that could stain the carpet. Soak a cotton ball in the diluted detergent mixture. If you don't have a cotton ball, you can also use towel or wash cloth. Use the cotton ball to blot the carpet stain and any remaining silly putty. Make sure the entire surface of the stain is covered in detergent. Let the detergent soak into the carpet and leftover silly putty for 20 minutes. After 20 minutes, place a dry cloth over the silly putty and press down to absorb the detergent. Use a damp cloth to wipe the stained area. The stain from the silly putty should be gone, and some of the leftover particles from the silly putty should be easier to remove. Using Nail Polish Remover Soak a cotton ball in acetone nail polish remover. You can also use rubbing alcohol if you don’t have access to nail polish remover. Blot the silly putty with the cotton ball. Make sure the surface of the silly putty gets completely covered in nail polish remover. Use a knife to scrape away the silly putty. Discard the pieces of silly putty as you scrape them off. Repeat the process until all the silly putty is gone. If the silly putty won’t come up from the carpet, try using more nail polish remover or freezing the silly putty with an ice pack before applying the nail polish remover.",
  "sentences":[
    " Freezing the Silly Putty Fill a plastic bag with ice.",
    "The number of ice cubes you use will depend on the size of the putty stain, but try to use at least three or four.",
    "You want there to be enough ice in the bag to cover the entire surface of the silly putty.",
    "Place the bag of ice on top of the silly putty.",
    "Make sure all the silly putty is covered by the bag.",
    "Let the silly putty harden under the ice for 2 - 3 hours.",
    "Refill the bag with new ice if the old ice melts during the wait.",
    "Break up the hardened silly putty with a knife.",
    "You want it to break apart into tinier pieces that you can easily pull up from the carpet.",
    "Discard the hardened bits of silly putty that you're able to remove.",
    "Cleaning the Carpet with Detergent Mix two spoonfuls of mild laundry detergent into a cup of warm water.",
    "Make sure the detergent is free of bleaches or chemicals that could stain the carpet.",
    "Soak a cotton ball in the diluted detergent mixture.",
    "If you don't have a cotton ball, you can also use towel or wash cloth.",
    "Use the cotton ball to blot the carpet stain and any remaining silly putty.",
    "Make sure the entire surface of the stain is covered in detergent.",
    "Let the detergent soak into the carpet and leftover silly putty for 20 minutes.",
    "After 20 minutes, place a dry cloth over the silly putty and press down to absorb the detergent.",
    "Use a damp cloth to wipe the stained area.",
    "The stain from the silly putty should be gone, and some of the leftover particles from the silly putty should be easier to remove.",
    "Using Nail Polish Remover Soak a cotton ball in acetone nail polish remover.",
    "You can also use rubbing alcohol if you don’t have access to nail polish remover.",
    "Blot the silly putty with the cotton ball.",
    "Make sure the surface of the silly putty gets completely covered in nail polish remover.",
    "Use a knife to scrape away the silly putty.",
    "Discard the pieces of silly putty as you scrape them off.",
    "Repeat the process until all the silly putty is gone.",
    "If the silly putty won’t come up from the carpet, try using more nail polish remover or freezing the silly putty with an ice pack before applying the nail polish remover."
  ],
  "tyn_section":[
    "Ice",
    "Plastic bag",
    "Knife",
    "Vacuum",
    "WD-40",
    "Cotton balls",
    "Nail polish remover",
    "Rubbing alcohol"
  ],
  "tyn_model":[
    "ice",
    "silly putty",
    "nail polish remover",
    "cotton ball",
    "knife",
    "detergent",
    "plastic bag",
    "ice cubes",
    "mild laundry detergent",
    "warm water",
    "diluted detergent",
    "nail polish",
    "acetone nail polish remover",
    "rubbing alcohol",
    "ice pack"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.3333333333,
    "f1":0.4347826087,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.625,
    "p":0.6,
    "f1":0.612244898
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.6666666667,
    "f1":0.7058823529
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.625,
    "p":0.4666666667,
    "f1":0.534351145
  }
}