{
  "title":"How to Gauge Wire",
  "url":"https://www.wikihow.com/Gauge-Wire",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Electrical Maintenance",
    "Electrical Wiring and Safety Switches"
  ],
  "methods":[
    {
      "name":"Stripping Insulation",
      "steps":[
        {
          "headline":"Purchase a wire-stripping tool.",
          "description":"As it’s impossible to gauge a wire with the insulation on, you’ll need to remove this thin plastic protective coating before measuring the wire gauge. The wire-stripping tool is specifically designed for this task: it looks a little like a pair of pliers. The tool has a small hole near its tip, which is lined with a sharp blade to cut through and remove plastic insulation. You should be able to find a wire-stripping tool at any local hardware store."
        },
        {
          "headline":"Place two inches of wire through the stripping tool.",
          "description":"Your insulated wire should fit tightly into the small, sharp hole in the wire-stripping tool. Stripping the insulation off of about 2 inches (5 cm) of wire will give you plenty to work with when measuring gauge. Rather than providing a one-size-fits-all wire-gauging hole, many pairs of wire strippers are themselves gauged. A gauged stripper will have about 10 holes of varying gauge sizes running up and down the interior of the tool’s ‘blades.’\nThis means that you’ll need to approximate the gauge of the wire (even if you don’t know it beforehand) to remove the insulation from the wire."
        },
        {
          "headline":"Clamp down and pull off the insulation.",
          "description":"Once the wire has been inserted into the stripper tool’s hole, squeeze the handles together. Pull the stripper tool away from the full piece of wire to slice through the plastic insulation and slide it off the end of the wire. At this point, you should have 2 inches (5 cm) of exposed wiring, of which you can measure the gauge."
        },
        {
          "headline":"Contact the wire manufacturer for the diameter of insulated wire.",
          "description":"If it’s important to your electrical project that you know the exact diameter of insulated wire, you’ll need to get in touch with the manufacturer directly. If you’re unsure which company manufactured the wire, take it to your local hardware store. They may be able to identify the company, and if not, they can measure the wire for you anyway. Although gauge sizes are universal, different companies put different amounts of plastic insulation around their wires. The diameter measurement will not be an actual gauge size, since only uninsulated solid wires are gauged."
        }
      ]
    },
    {
      "name":"Gauging Round Solid Wire",
      "steps":[
        {
          "headline":"Purchase a wire gauging tool.",
          "description":"A wire gauging tool is a piece of metal (typically circular or rectangular) which is studded with dozens of holes around its perimeter. Each hole is labeled with—and corresponds to—a different gauge size. Make sure that the gauge tool specifies which measurement system it corresponds with. If you’re located in North America, your tool will probably measure on the AWG scale. You can purchase a wire gauging tool at your local hardware store or home-supply store)."
        },
        {
          "headline":"Estimate the gauge size of the wire.",
          "description":"Begin by eyeballing the approximate size of the wire and see which gauge holes are roughly the same size. This will save you time that you’d otherwise spend on trying to fit the wire into many too-large or too-small gauge grooves."
        },
        {
          "headline":"Slide your wire into the gauge groove and see where it fits.",
          "description":"Place the wire into each groove until you find the best fit. Your wire will correspond with the size of the smallest gauge groove that it slides into. The fit should be snug but not too tight. Note that each of the grooves will have a slightly larger hole located next to it. These holes are not used to measure gauge size. They’re simply on the tool to allow you to easily remove the wire from the grooves."
        },
        {
          "headline":"Compare the wire against another wire whose gauge is known.",
          "description":"If you do not have a wire gauge tool, you can still find a wire’s gauge by measuring it against another wire of known gauge size. For example, if you have a small-diameter section of wire, hold it next to wires of known gauge (e.g. 20, 21, and 22) to see which your segment matches. If you don’t have any other wires whose gauge you know, take your wire strand to a local hardware store. They’ll likely have enough gauged wire in their inventory that they can pull out various sizes of wire for you to compare your strand with."
        }
      ]
    },
    {
      "name":"Gauging Stranded Wire",
      "steps":[
        {
          "headline":"Measure the diameter of a single wire.",
          "description":"Stranded wire consists of multiple thin wire filaments that have been twisted together to form a single composite “wire.” To calculate the gauge of stranded wire, you’ll need to find the diameter of a single wire strand in either millimeters or inches. If the wire is of a very large gauge (very small diameter) and can’t be measure with a ruler, use a wire and conduit measuring device. This tool can also be purchased at any hardware store."
        },
        {
          "headline":"Multiply the wire’s diameter by itself.",
          "description":"To calculate the gauge of stranded wire, you’ll need to double the diameter. So, if you’ve measured a wire’s diameter to be 0.005 inches (0.127 mm), multiply this value by itself. The result will be 0.000025 in (0.000635 mm)."
        },
        {
          "headline":"Multiply the result by the number of strands in the wire.",
          "description":"Depending on the size of the wire, it could have any number of individual, entwined strands. Count the individual strands, and multiply the result of the squared wire diameter by the number of strands. In this example, if the wire has 21 strands, multiply 0.000025 in (0.000635 mm) by 21. The result will be 0.000525 in (0.013335 mm). This calculation will give you the Circular Mils (CMA) value for the stranded wire. CMA is another commonly used wire-gauge scale which calculates the circular area of wires. As a general rule, larger-gauge wire (smaller diameter) contains fewer strands. Large-gauge wires may contain as few as 7 or 8 strands, while small-gauge (large diameter) wires may contain as many as 20, 40, or even 100 strands."
        },
        {
          "headline":"Find the wire’s corresponding AWG value.",
          "description":"Once you’ve found the Circular Mils value of stranded wire, you’ll need to consult an online table in order to find the corresponding AWG value. Alternately, your local hardware store may have a physical copy of gauge-comparison table. For example, if you measure the diameter of a wire strand as 0.005 inches (0.127 mm) and the stranded wire has 21 strands, this corresponds to a CMA of 525 and to an AWG of 22."
        }
      ]
    }
  ],
  "text":" Stripping Insulation Purchase a wire-stripping tool. As it’s impossible to gauge a wire with the insulation on, you’ll need to remove this thin plastic protective coating before measuring the wire gauge. The wire-stripping tool is specifically designed for this task: it looks a little like a pair of pliers. The tool has a small hole near its tip, which is lined with a sharp blade to cut through and remove plastic insulation. You should be able to find a wire-stripping tool at any local hardware store. Place two inches of wire through the stripping tool. Your insulated wire should fit tightly into the small, sharp hole in the wire-stripping tool. Stripping the insulation off of about 2 inches (5 cm) of wire will give you plenty to work with when measuring gauge. Rather than providing a one-size-fits-all wire-gauging hole, many pairs of wire strippers are themselves gauged. A gauged stripper will have about 10 holes of varying gauge sizes running up and down the interior of the tool’s ‘blades.’\nThis means that you’ll need to approximate the gauge of the wire (even if you don’t know it beforehand) to remove the insulation from the wire. Clamp down and pull off the insulation. Once the wire has been inserted into the stripper tool’s hole, squeeze the handles together. Pull the stripper tool away from the full piece of wire to slice through the plastic insulation and slide it off the end of the wire. At this point, you should have 2 inches (5 cm) of exposed wiring, of which you can measure the gauge. Contact the wire manufacturer for the diameter of insulated wire. If it’s important to your electrical project that you know the exact diameter of insulated wire, you’ll need to get in touch with the manufacturer directly. If you’re unsure which company manufactured the wire, take it to your local hardware store. They may be able to identify the company, and if not, they can measure the wire for you anyway. Although gauge sizes are universal, different companies put different amounts of plastic insulation around their wires. The diameter measurement will not be an actual gauge size, since only uninsulated solid wires are gauged. Gauging Round Solid Wire Purchase a wire gauging tool. A wire gauging tool is a piece of metal (typically circular or rectangular) which is studded with dozens of holes around its perimeter. Each hole is labeled with—and corresponds to—a different gauge size. Make sure that the gauge tool specifies which measurement system it corresponds with. If you’re located in North America, your tool will probably measure on the AWG scale. You can purchase a wire gauging tool at your local hardware store or home-supply store). Estimate the gauge size of the wire. Begin by eyeballing the approximate size of the wire and see which gauge holes are roughly the same size. This will save you time that you’d otherwise spend on trying to fit the wire into many too-large or too-small gauge grooves. Slide your wire into the gauge groove and see where it fits. Place the wire into each groove until you find the best fit. Your wire will correspond with the size of the smallest gauge groove that it slides into. The fit should be snug but not too tight. Note that each of the grooves will have a slightly larger hole located next to it. These holes are not used to measure gauge size. They’re simply on the tool to allow you to easily remove the wire from the grooves. Compare the wire against another wire whose gauge is known. If you do not have a wire gauge tool, you can still find a wire’s gauge by measuring it against another wire of known gauge size. For example, if you have a small-diameter section of wire, hold it next to wires of known gauge (e.g. 20, 21, and 22) to see which your segment matches. If you don’t have any other wires whose gauge you know, take your wire strand to a local hardware store. They’ll likely have enough gauged wire in their inventory that they can pull out various sizes of wire for you to compare your strand with. Gauging Stranded Wire Measure the diameter of a single wire. Stranded wire consists of multiple thin wire filaments that have been twisted together to form a single composite “wire.” To calculate the gauge of stranded wire, you’ll need to find the diameter of a single wire strand in either millimeters or inches. If the wire is of a very large gauge (very small diameter) and can’t be measure with a ruler, use a wire and conduit measuring device. This tool can also be purchased at any hardware store. Multiply the wire’s diameter by itself. To calculate the gauge of stranded wire, you’ll need to double the diameter. So, if you’ve measured a wire’s diameter to be 0.005 inches (0.127 mm), multiply this value by itself. The result will be 0.000025 in (0.000635 mm). Multiply the result by the number of strands in the wire. Depending on the size of the wire, it could have any number of individual, entwined strands. Count the individual strands, and multiply the result of the squared wire diameter by the number of strands. In this example, if the wire has 21 strands, multiply 0.000025 in (0.000635 mm) by 21. The result will be 0.000525 in (0.013335 mm). This calculation will give you the Circular Mils (CMA) value for the stranded wire. CMA is another commonly used wire-gauge scale which calculates the circular area of wires. As a general rule, larger-gauge wire (smaller diameter) contains fewer strands. Large-gauge wires may contain as few as 7 or 8 strands, while small-gauge (large diameter) wires may contain as many as 20, 40, or even 100 strands. Find the wire’s corresponding AWG value. Once you’ve found the Circular Mils value of stranded wire, you’ll need to consult an online table in order to find the corresponding AWG value. Alternately, your local hardware store may have a physical copy of gauge-comparison table. For example, if you measure the diameter of a wire strand as 0.005 inches (0.127 mm) and the stranded wire has 21 strands, this corresponds to a CMA of 525 and to an AWG of 22.",
  "sentences":[
    " Stripping Insulation Purchase a wire-stripping tool.",
    "As it’s impossible to gauge a wire with the insulation on, you’ll need to remove this thin plastic protective coating before measuring the wire gauge.",
    "The wire-stripping tool is specifically designed for this task: it looks a little like a pair of pliers.",
    "The tool has a small hole near its tip, which is lined with a sharp blade to cut through and remove plastic insulation.",
    "You should be able to find a wire-stripping tool at any local hardware store.",
    "Place two inches of wire through the stripping tool.",
    "Your insulated wire should fit tightly into the small, sharp hole in the wire-stripping tool.",
    "Stripping the insulation off of about 2 inches (5 cm) of wire will give you plenty to work with when measuring gauge.",
    "Rather than providing a one-size-fits-all wire-gauging hole, many pairs of wire strippers are themselves gauged.",
    "A gauged stripper will have about 10 holes of varying gauge sizes running up and down the interior of the tool’s ‘blades.’\nThis means that you’ll need to approximate the gauge of the wire (even if you don’t know it beforehand) to remove the insulation from the wire.",
    "Clamp down and pull off the insulation.",
    "Once the wire has been inserted into the stripper tool’s hole, squeeze the handles together.",
    "Pull the stripper tool away from the full piece of wire to slice through the plastic insulation and slide it off the end of the wire.",
    "At this point, you should have 2 inches (5 cm) of exposed wiring, of which you can measure the gauge.",
    "Contact the wire manufacturer for the diameter of insulated wire.",
    "If it’s important to your electrical project that you know the exact diameter of insulated wire, you’ll need to get in touch with the manufacturer directly.",
    "If you’re unsure which company manufactured the wire, take it to your local hardware store.",
    "They may be able to identify the company, and if not, they can measure the wire for you anyway.",
    "Although gauge sizes are universal, different companies put different amounts of plastic insulation around their wires.",
    "The diameter measurement will not be an actual gauge size, since only uninsulated solid wires are gauged.",
    "Gauging Round Solid Wire Purchase a wire gauging tool.",
    "A wire gauging tool is a piece of metal (typically circular or rectangular) which is studded with dozens of holes around its perimeter.",
    "Each hole is labeled with—and corresponds to—a different gauge size.",
    "Make sure that the gauge tool specifies which measurement system it corresponds with.",
    "If you’re located in North America, your tool will probably measure on the AWG scale.",
    "You can purchase a wire gauging tool at your local hardware store or home-supply store).",
    "Estimate the gauge size of the wire.",
    "Begin by eyeballing the approximate size of the wire and see which gauge holes are roughly the same size.",
    "This will save you time that you’d otherwise spend on trying to fit the wire into many too-large or too-small gauge grooves.",
    "Slide your wire into the gauge groove and see where it fits.",
    "Place the wire into each groove until you find the best fit.",
    "Your wire will correspond with the size of the smallest gauge groove that it slides into.",
    "The fit should be snug but not too tight.",
    "Note that each of the grooves will have a slightly larger hole located next to it.",
    "These holes are not used to measure gauge size.",
    "They’re simply on the tool to allow you to easily remove the wire from the grooves.",
    "Compare the wire against another wire whose gauge is known.",
    "If you do not have a wire gauge tool, you can still find a wire’s gauge by measuring it against another wire of known gauge size.",
    "For example, if you have a small-diameter section of wire, hold it next to wires of known gauge (e.g.",
    "20, 21, and 22) to see which your segment matches.",
    "If you don’t have any other wires whose gauge you know, take your wire strand to a local hardware store.",
    "They’ll likely have enough gauged wire in their inventory that they can pull out various sizes of wire for you to compare your strand with.",
    "Gauging Stranded Wire Measure the diameter of a single wire.",
    "Stranded wire consists of multiple thin wire filaments that have been twisted together to form a single composite “wire.” To calculate the gauge of stranded wire, you’ll need to find the diameter of a single wire strand in either millimeters or inches.",
    "If the wire is of a very large gauge (very small diameter) and can’t be measure with a ruler, use a wire and conduit measuring device.",
    "This tool can also be purchased at any hardware store.",
    "Multiply the wire’s diameter by itself.",
    "To calculate the gauge of stranded wire, you’ll need to double the diameter.",
    "So, if you’ve measured a wire’s diameter to be 0.005 inches (0.127 mm), multiply this value by itself.",
    "The result will be 0.000025 in (0.000635 mm).",
    "Multiply the result by the number of strands in the wire.",
    "Depending on the size of the wire, it could have any number of individual, entwined strands.",
    "Count the individual strands, and multiply the result of the squared wire diameter by the number of strands.",
    "In this example, if the wire has 21 strands, multiply 0.000025 in (0.000635 mm) by 21.",
    "The result will be 0.000525 in (0.013335 mm).",
    "This calculation will give you the Circular Mils (CMA) value for the stranded wire.",
    "CMA is another commonly used wire-gauge scale which calculates the circular area of wires.",
    "As a general rule, larger-gauge wire (smaller diameter) contains fewer strands.",
    "Large-gauge wires may contain as few as 7 or 8 strands, while small-gauge (large diameter) wires may contain as many as 20, 40, or even 100 strands.",
    "Find the wire’s corresponding AWG value.",
    "Once you’ve found the Circular Mils value of stranded wire, you’ll need to consult an online table in order to find the corresponding AWG value.",
    "Alternately, your local hardware store may have a physical copy of gauge-comparison table.",
    "For example, if you measure the diameter of a wire strand as 0.005 inches (0.127 mm) and the stranded wire has 21 strands, this corresponds to a CMA of 525 and to an AWG of 22."
  ],
  "tyn_section":[
    "wire",
    "wire-stripping tool",
    "wire-gauging tool",
    "a range of gauged wires (optional)",
    "wire and conduit measuring device",
    "calculator (optional)"
  ],
  "tyn_model":[
    "wire",
    "wire-stripping tool",
    "insulation",
    "insulated wire",
    "wire gauging tool",
    "stripper tool",
    "plastic insulation",
    "pliers",
    "wire-gauging",
    "wire strippers",
    "‘blades",
    "’\n",
    "electrical project",
    "—and",
    "—a",
    "wire gauge tool",
    "thin wire filaments",
    "“wire",
    "” to",
    "ruler",
    "wire and conduit measuring device",
    "wires",
    "gauge-comparison table"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1304347826,
    "f1":0.2068965517,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.2608695652,
    "f1":0.375
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.4347826087,
    "f1":0.5263157895
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.1304347826,
    "f1":0.2068965517
  }
}