{
  "title":"How to Cook Without a Food Processor",
  "url":"https://www.wikihow.com/Cook-Without-a-Food-Processor",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Using a Blender, Mixer, or Grinder",
      "steps":[
        {
          "headline":"Use a blender to mince, chop, or puree foods.",
          "description":"Your blender is more versatile than just making smoothies. If your recipe calls for a finely minced or chopped ingredient, pulse the blender a few times until it reaches the right consistency. For pureed foods, leave the blender on a little longer. Try pulsing carrots, garlic, and herbs in the blender to chop them. Puree your vegetables in the blender before adding them to a soup or a sauce for a perfectly smooth texture. If you're having a hard time blending firmer foods, like nuts, or fibrous foods like celery, make sure your blender blades are sharp. If you're not sure how to sharpen them, read the manufacturer's instructions."
        },
        {
          "headline":"Combine liquids and solids in a mixer.",
          "description":"Whether you're using a hand mixer, a stand mixer, or an immersion blender, your mixer can function as a useful substitute for a food processor. Just place the food into a large, durable bowl and lower in the mixer, then turn it on. A mixer is especially helpful when you're combining a liquid mixture with a dry mixture, like for baked goods. You can also use a mixer to whip meringues, mayo, and homemade whipped cream. A hand-held immersion blender is perfect for blending homemade mayo or pesto, and its compact design will take up a lot less space in your kitchen than a food processor would. If you have a hook attachment, you can use your stand mixer to mix dough for bread, pies, and cookies."
        },
        {
          "headline":"Chop nuts and spices in a coffee grinder if you have one.",
          "description":"If you love a freshly-brewed cup of coffee in the morning, you may already have a coffee grinder. Just measure out the ingredients you need and pulse the grinder for a few seconds, or until everything's broken down. This is a great option if you want to add chopped nuts to a delicious dessert. If you have whole spices like allspice or cardamom seeds, grind them to release their fragrance before you use them in a dish! Tip: Be sure to clean your grinder well before and after you use it. Otherwise, your recipe might taste like coffee, or vice versa!"
        },
        {
          "headline":"Grind softer food in a ricer or a food mill.",
          "description":"If you need to turn an ingredient into a rice- or flour-like consistency, a manual grinder can make quick work of the job. Just place the food into the bowl on the grinder, then turn it on if it's electric, or crank the handle if it's manual. The result you'll get will depend on the size of the holes in your grinder and the type of food that you're grinding. This is a great way to make riced cauliflower, a popular low-carb alternative to traditional rice. You can also use your food mill to quickly process cooked potatoes for a creamy mash."
        }
      ]
    },
    {
      "name":"Processing Food by Hand",
      "steps":[
        {
          "headline":"Chop most of your food with a good chef's knife.",
          "description":"Most of the time, when a recipe calls for a food processor, it's because the food needs to be chopped or minced finely. While it may take a little longer, you can do the same work with a sharp chef's knife. Just place the food on a cutting board and carefully cut it into small pieces. The size of the pieces will depend on what you're chopping and what the recipe calls for. Garlic, onions, and celery can all be finely minced by hand, for instance. Of course, always remember to be careful when you're cutting anything with a knife. Hold the knife firmly in your dominant hand. With your other hand, curl your fingers in so they look like a bear claw, then use that claw to hold the food you're cutting. This way, even if the knife slips, it will just brush against the back of your knuckles. Tip: It often helps to cut your food into larger pieces first. Try slicing the ingredients in half, quarters, or slices before you start the fine knife-work."
        },
        {
          "headline":"Use a grater to finely shred firm vegetables.",
          "description":"Instead of using a food processor to shred hard veggies like carrots or potatoes, you can instead run the food across a box grater or a microplaner. Press down slightly as you slide the food back and forth over the holes in the grater. If you're using a microplaner, always use the handle on the tool so you don't accidentally cut yourself. Graters are perfect when you're making a slaw, salad, or hash. This is also a good option if you need grated ginger for a sauce, stir-fry, or drink. Be sure to keep your fingers free of the grater, or you could get a nasty scrape!"
        },
        {
          "headline":"Puree food by cooking it until it's soft, then mashing it.",
          "description":"One of the most popular uses for a food processor is to puree food, but you can do it by hand if you need to. To start, simmer, boil, or stew the food until it's soft and almost falling apart. Then, mash the food with a fork or a potato masher until it takes on a smooth, even consistency. For an even finer texture, pour the puree through a sieve and push it through with the back of a spoon. This is perfect for creating fruit toppings for ice cream or your own homemade tomato sauce!"
        },
        {
          "headline":"Crush foods by using a rolling pin and plastic bag.",
          "description":"If you need to quickly break down food into small pieces, place the ingredient in a resealable plastic bag and place it on a sturdy cutting board. Then, roll back and forth over the bag with a rolling pin to crush the food. If you have stubborn pieces, you can even hit them with the flat side of the rolling pin to break them up. This is a great way to break up chips or cookies for a crunchy topping for casseroles and desserts! You can also use this method to crush chickpeas for homemade hummus."
        },
        {
          "headline":"Knead bread dough or pie dough with your hands.",
          "description":"While many bread recipes call for a food processor, you can almost always knead the dough with your hands instead. Turn the dough out onto a floured or oiled surface, then use your hands to knead together the ingredients until they're completely mixed. If you have a very wet dough, like cookie batter, mix it with a wooden spoon instead."
        }
      ]
    }
  ],
  "text":" Using a Blender, Mixer, or Grinder Use a blender to mince, chop, or puree foods. Your blender is more versatile than just making smoothies. If your recipe calls for a finely minced or chopped ingredient, pulse the blender a few times until it reaches the right consistency. For pureed foods, leave the blender on a little longer. Try pulsing carrots, garlic, and herbs in the blender to chop them. Puree your vegetables in the blender before adding them to a soup or a sauce for a perfectly smooth texture. If you're having a hard time blending firmer foods, like nuts, or fibrous foods like celery, make sure your blender blades are sharp. If you're not sure how to sharpen them, read the manufacturer's instructions. Combine liquids and solids in a mixer. Whether you're using a hand mixer, a stand mixer, or an immersion blender, your mixer can function as a useful substitute for a food processor. Just place the food into a large, durable bowl and lower in the mixer, then turn it on. A mixer is especially helpful when you're combining a liquid mixture with a dry mixture, like for baked goods. You can also use a mixer to whip meringues, mayo, and homemade whipped cream. A hand-held immersion blender is perfect for blending homemade mayo or pesto, and its compact design will take up a lot less space in your kitchen than a food processor would. If you have a hook attachment, you can use your stand mixer to mix dough for bread, pies, and cookies. Chop nuts and spices in a coffee grinder if you have one. If you love a freshly-brewed cup of coffee in the morning, you may already have a coffee grinder. Just measure out the ingredients you need and pulse the grinder for a few seconds, or until everything's broken down. This is a great option if you want to add chopped nuts to a delicious dessert. If you have whole spices like allspice or cardamom seeds, grind them to release their fragrance before you use them in a dish! Tip: Be sure to clean your grinder well before and after you use it. Otherwise, your recipe might taste like coffee, or vice versa! Grind softer food in a ricer or a food mill. If you need to turn an ingredient into a rice- or flour-like consistency, a manual grinder can make quick work of the job. Just place the food into the bowl on the grinder, then turn it on if it's electric, or crank the handle if it's manual. The result you'll get will depend on the size of the holes in your grinder and the type of food that you're grinding. This is a great way to make riced cauliflower, a popular low-carb alternative to traditional rice. You can also use your food mill to quickly process cooked potatoes for a creamy mash. Processing Food by Hand Chop most of your food with a good chef's knife. Most of the time, when a recipe calls for a food processor, it's because the food needs to be chopped or minced finely. While it may take a little longer, you can do the same work with a sharp chef's knife. Just place the food on a cutting board and carefully cut it into small pieces. The size of the pieces will depend on what you're chopping and what the recipe calls for. Garlic, onions, and celery can all be finely minced by hand, for instance. Of course, always remember to be careful when you're cutting anything with a knife. Hold the knife firmly in your dominant hand. With your other hand, curl your fingers in so they look like a bear claw, then use that claw to hold the food you're cutting. This way, even if the knife slips, it will just brush against the back of your knuckles. Tip: It often helps to cut your food into larger pieces first. Try slicing the ingredients in half, quarters, or slices before you start the fine knife-work. Use a grater to finely shred firm vegetables. Instead of using a food processor to shred hard veggies like carrots or potatoes, you can instead run the food across a box grater or a microplaner. Press down slightly as you slide the food back and forth over the holes in the grater. If you're using a microplaner, always use the handle on the tool so you don't accidentally cut yourself. Graters are perfect when you're making a slaw, salad, or hash. This is also a good option if you need grated ginger for a sauce, stir-fry, or drink. Be sure to keep your fingers free of the grater, or you could get a nasty scrape! Puree food by cooking it until it's soft, then mashing it. One of the most popular uses for a food processor is to puree food, but you can do it by hand if you need to. To start, simmer, boil, or stew the food until it's soft and almost falling apart. Then, mash the food with a fork or a potato masher until it takes on a smooth, even consistency. For an even finer texture, pour the puree through a sieve and push it through with the back of a spoon. This is perfect for creating fruit toppings for ice cream or your own homemade tomato sauce! Crush foods by using a rolling pin and plastic bag. If you need to quickly break down food into small pieces, place the ingredient in a resealable plastic bag and place it on a sturdy cutting board. Then, roll back and forth over the bag with a rolling pin to crush the food. If you have stubborn pieces, you can even hit them with the flat side of the rolling pin to break them up. This is a great way to break up chips or cookies for a crunchy topping for casseroles and desserts! You can also use this method to crush chickpeas for homemade hummus. Knead bread dough or pie dough with your hands. While many bread recipes call for a food processor, you can almost always knead the dough with your hands instead. Turn the dough out onto a floured or oiled surface, then use your hands to knead together the ingredients until they're completely mixed. If you have a very wet dough, like cookie batter, mix it with a wooden spoon instead.",
  "sentences":[
    " Using a Blender, Mixer, or Grinder Use a blender to mince, chop, or puree foods.",
    "Your blender is more versatile than just making smoothies.",
    "If your recipe calls for a finely minced or chopped ingredient, pulse the blender a few times until it reaches the right consistency.",
    "For pureed foods, leave the blender on a little longer.",
    "Try pulsing carrots, garlic, and herbs in the blender to chop them.",
    "Puree your vegetables in the blender before adding them to a soup or a sauce for a perfectly smooth texture.",
    "If you're having a hard time blending firmer foods, like nuts, or fibrous foods like celery, make sure your blender blades are sharp.",
    "If you're not sure how to sharpen them, read the manufacturer's instructions.",
    "Combine liquids and solids in a mixer.",
    "Whether you're using a hand mixer, a stand mixer, or an immersion blender, your mixer can function as a useful substitute for a food processor.",
    "Just place the food into a large, durable bowl and lower in the mixer, then turn it on.",
    "A mixer is especially helpful when you're combining a liquid mixture with a dry mixture, like for baked goods.",
    "You can also use a mixer to whip meringues, mayo, and homemade whipped cream.",
    "A hand-held immersion blender is perfect for blending homemade mayo or pesto, and its compact design will take up a lot less space in your kitchen than a food processor would.",
    "If you have a hook attachment, you can use your stand mixer to mix dough for bread, pies, and cookies.",
    "Chop nuts and spices in a coffee grinder if you have one.",
    "If you love a freshly-brewed cup of coffee in the morning, you may already have a coffee grinder.",
    "Just measure out the ingredients you need and pulse the grinder for a few seconds, or until everything's broken down.",
    "This is a great option if you want to add chopped nuts to a delicious dessert.",
    "If you have whole spices like allspice or cardamom seeds, grind them to release their fragrance before you use them in a dish!",
    "Tip: Be sure to clean your grinder well before and after you use it.",
    "Otherwise, your recipe might taste like coffee, or vice versa!",
    "Grind softer food in a ricer or a food mill.",
    "If you need to turn an ingredient into a rice- or flour-like consistency, a manual grinder can make quick work of the job.",
    "Just place the food into the bowl on the grinder, then turn it on if it's electric, or crank the handle if it's manual.",
    "The result you'll get will depend on the size of the holes in your grinder and the type of food that you're grinding.",
    "This is a great way to make riced cauliflower, a popular low-carb alternative to traditional rice.",
    "You can also use your food mill to quickly process cooked potatoes for a creamy mash.",
    "Processing Food by Hand Chop most of your food with a good chef's knife.",
    "Most of the time, when a recipe calls for a food processor, it's because the food needs to be chopped or minced finely.",
    "While it may take a little longer, you can do the same work with a sharp chef's knife.",
    "Just place the food on a cutting board and carefully cut it into small pieces.",
    "The size of the pieces will depend on what you're chopping and what the recipe calls for.",
    "Garlic, onions, and celery can all be finely minced by hand, for instance.",
    "Of course, always remember to be careful when you're cutting anything with a knife.",
    "Hold the knife firmly in your dominant hand.",
    "With your other hand, curl your fingers in so they look like a bear claw, then use that claw to hold the food you're cutting.",
    "This way, even if the knife slips, it will just brush against the back of your knuckles.",
    "Tip: It often helps to cut your food into larger pieces first.",
    "Try slicing the ingredients in half, quarters, or slices before you start the fine knife-work.",
    "Use a grater to finely shred firm vegetables.",
    "Instead of using a food processor to shred hard veggies like carrots or potatoes, you can instead run the food across a box grater or a microplaner.",
    "Press down slightly as you slide the food back and forth over the holes in the grater.",
    "If you're using a microplaner, always use the handle on the tool so you don't accidentally cut yourself.",
    "Graters are perfect when you're making a slaw, salad, or hash.",
    "This is also a good option if you need grated ginger for a sauce, stir-fry, or drink.",
    "Be sure to keep your fingers free of the grater, or you could get a nasty scrape!",
    "Puree food by cooking it until it's soft, then mashing it.",
    "One of the most popular uses for a food processor is to puree food, but you can do it by hand if you need to.",
    "To start, simmer, boil, or stew the food until it's soft and almost falling apart.",
    "Then, mash the food with a fork or a potato masher until it takes on a smooth, even consistency.",
    "For an even finer texture, pour the puree through a sieve and push it through with the back of a spoon.",
    "This is perfect for creating fruit toppings for ice cream or your own homemade tomato sauce!",
    "Crush foods by using a rolling pin and plastic bag.",
    "If you need to quickly break down food into small pieces, place the ingredient in a resealable plastic bag and place it on a sturdy cutting board.",
    "Then, roll back and forth over the bag with a rolling pin to crush the food.",
    "If you have stubborn pieces, you can even hit them with the flat side of the rolling pin to break them up.",
    "This is a great way to break up chips or cookies for a crunchy topping for casseroles and desserts!",
    "You can also use this method to crush chickpeas for homemade hummus.",
    "Knead bread dough or pie dough with your hands.",
    "While many bread recipes call for a food processor, you can almost always knead the dough with your hands instead.",
    "Turn the dough out onto a floured or oiled surface, then use your hands to knead together the ingredients until they're completely mixed.",
    "If you have a very wet dough, like cookie batter, mix it with a wooden spoon instead."
  ],
  "tyn_section":[
    "Blender",
    "Mixer",
    "Grinder",
    "Sharp knife",
    "Grater or microplaner",
    "Grinder or food mill",
    "Fork, potato masher, or sieve",
    "Resealable plastic bag",
    "Rolling pin",
    "Wooden spoon"
  ],
  "tyn_model":[
    "blender",
    "mixer",
    "grinder",
    "food processor",
    "knife",
    "grater",
    "rolling pin",
    "garlic",
    "celery",
    "stand mixer",
    "immersion blender",
    "bowl",
    "nuts",
    "coffee grinder",
    "food mill",
    "chef's knife",
    "microplaner",
    "carrots",
    "herbs",
    "vegetables",
    "whipped cream",
    "ricer",
    "cauliflower",
    "rice",
    "potatoes",
    "onions",
    "box grater",
    "graters",
    "ginger",
    "fork",
    "potato masher",
    "sieve",
    "spoon",
    "ice cream",
    "tomato sauce",
    "plastic bag",
    "resealable plastic bag",
    "chickpeas",
    "wooden spoon"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.1538461538,
    "f1":0.2448979592,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.3333333333,
    "f1":0.4705882353
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.9,
    "p":0.4102564103,
    "f1":0.5636007828
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6,
    "p":0.1794871795,
    "f1":0.2763157895
  }
}