{
  "title":"How to Make Briquettes",
  "url":"https://www.wikihow.com/Make-Briquettes",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Fire",
    "Fire Making"
  ],
  "parts":[
    {
      "name":"Working Your Waste into a Paste",
      "steps":[
        {
          "headline":"Put on old clothes and wear gloves.",
          "description":"Making briquettes is an incredibly messy process. Before you begin, you should wear gloves to protect your hands and also put on old clothing."
        },
        {
          "headline":"Shred scrap papers into small pieces.",
          "description":"Find scrap paper around your home. Old mail, flyers, and work papers work well. Shred them into tiny pieces."
        },
        {
          "headline":"Soak your paper for a few days.",
          "description":"Place the papers in a bowl or bucket and cover them with water. Let the papers soak for two days. This allows the papers to soften and also releases fibers from the papers, which act as a binding agent for your briquettes. Reuse old scrap paper, such as mail, to make briquettes. This way, you're reusing old waste during the process."
        },
        {
          "headline":"Work the paper into a porridge-like paste.",
          "description":"After two days have passed, use your hands to knead and squeeze the paper. Keep going until you have a porridge-like mixture. The precise amount of time this will take depends on how much paper you're using."
        },
        {
          "headline":"Add in your organic material.",
          "description":"Organic material must be mixed into the paper to make briquettes. You can use saw dust, pine needles, rice husks, or chopped leaves and grass. Mix one part soaked paper with three parts of your organic material. Most organic material will already be fine enough that it should not require shredding. If you're using larger leaves, however, it can't hurt to break them up a bit."
        },
        {
          "headline":"Add water.",
          "description":"Start with a small amount of water and mix it into the paper mixture using your hands. Keep adding water until the paper mixture becomes easily moldable. When squeezed, your mixture should hold together easily."
        }
      ]
    },
    {
      "name":"Molding Your Briquettes",
      "steps":[
        {
          "headline":"Cut off the upper quarter of a soda bottle.",
          "description":"Use a 2-liter soda bottle to make your briquette mold. Use an x-acto knife, or any sharp knife from your kitchen, to cut off the upper quarter of the bottle."
        },
        {
          "headline":"Make drainage holes in the bottom.",
          "description":"Turn the bottle over so the bottom is facing upward. Use a sharp knife to cut a dozen small holes circling the bottom of the bottle. These are drainage holes, where the water will leak out as your briquettes set."
        },
        {
          "headline":"Punch holes in a small plastic bag to create a liner.",
          "description":"Take any small plastic bag you have on hand, such as a bag from the grocery store. Use a twig or something similar to punch a dozen holes in the bottom of the bag. These are also drainage holes."
        },
        {
          "headline":"Add your briquettes to the mold.",
          "description":"Take a handful of your briquette mixture and place it in the plastic bag. Then, place the bag in the soda bottle. If necessary, add more briquette mixture to fill the soda bottle to the brim."
        },
        {
          "headline":"Squeeze out excess water with a can.",
          "description":"Place a can of some kind of food, like beans, over the briquette mixture inside of the mold. Place the mold on the ground and put your foot over the can and press down with your foot. Keep pressing the can until you can't move the mixture down any further. Water will seep out during this part of the process, so you should press the mixture outside."
        }
      ]
    },
    {
      "name":"Drying the Briquettes",
      "steps":[
        {
          "headline":"Remove your briquette from the mold.",
          "description":"Take hold of the sides of the plastic bag. Slowly pull the bag upward, removing the briquette from the mold. Then, remove the briquette from the plastic. Your briquette should now be in the form a small, cylinder shape."
        },
        {
          "headline":"Set your briquettes in a dry place.",
          "description":"Briquettes need time to dry before you can use them. Find a dry place, either in your home or outdoors, where the briquettes will not be disturbed. For example, store the briquettes in a closet in your living room. Avoid humid areas of the home, like the bathroom or kitchen. If you store the briquettes outside, do not leave them in the open air in case it rains. Instead, you could store them in a shed."
        },
        {
          "headline":"Let the briquettes dry for three to seven days.",
          "description":"Once the briquettes are stored safely, simply let them sit for three to seven days. When done, briquettes should be completely dry to the touch and compact. After they're finished drying, you can burn your briquettes."
        }
      ]
    }
  ],
  "text":" Working Your Waste into a Paste Put on old clothes and wear gloves. Making briquettes is an incredibly messy process. Before you begin, you should wear gloves to protect your hands and also put on old clothing. Shred scrap papers into small pieces. Find scrap paper around your home. Old mail, flyers, and work papers work well. Shred them into tiny pieces. Soak your paper for a few days. Place the papers in a bowl or bucket and cover them with water. Let the papers soak for two days. This allows the papers to soften and also releases fibers from the papers, which act as a binding agent for your briquettes. Reuse old scrap paper, such as mail, to make briquettes. This way, you're reusing old waste during the process. Work the paper into a porridge-like paste. After two days have passed, use your hands to knead and squeeze the paper. Keep going until you have a porridge-like mixture. The precise amount of time this will take depends on how much paper you're using. Add in your organic material. Organic material must be mixed into the paper to make briquettes. You can use saw dust, pine needles, rice husks, or chopped leaves and grass. Mix one part soaked paper with three parts of your organic material. Most organic material will already be fine enough that it should not require shredding. If you're using larger leaves, however, it can't hurt to break them up a bit. Add water. Start with a small amount of water and mix it into the paper mixture using your hands. Keep adding water until the paper mixture becomes easily moldable. When squeezed, your mixture should hold together easily. Molding Your Briquettes Cut off the upper quarter of a soda bottle. Use a 2-liter soda bottle to make your briquette mold. Use an x-acto knife, or any sharp knife from your kitchen, to cut off the upper quarter of the bottle. Make drainage holes in the bottom. Turn the bottle over so the bottom is facing upward. Use a sharp knife to cut a dozen small holes circling the bottom of the bottle. These are drainage holes, where the water will leak out as your briquettes set. Punch holes in a small plastic bag to create a liner. Take any small plastic bag you have on hand, such as a bag from the grocery store. Use a twig or something similar to punch a dozen holes in the bottom of the bag. These are also drainage holes. Add your briquettes to the mold. Take a handful of your briquette mixture and place it in the plastic bag. Then, place the bag in the soda bottle. If necessary, add more briquette mixture to fill the soda bottle to the brim. Squeeze out excess water with a can. Place a can of some kind of food, like beans, over the briquette mixture inside of the mold. Place the mold on the ground and put your foot over the can and press down with your foot. Keep pressing the can until you can't move the mixture down any further. Water will seep out during this part of the process, so you should press the mixture outside. Drying the Briquettes Remove your briquette from the mold. Take hold of the sides of the plastic bag. Slowly pull the bag upward, removing the briquette from the mold. Then, remove the briquette from the plastic. Your briquette should now be in the form a small, cylinder shape. Set your briquettes in a dry place. Briquettes need time to dry before you can use them. Find a dry place, either in your home or outdoors, where the briquettes will not be disturbed. For example, store the briquettes in a closet in your living room. Avoid humid areas of the home, like the bathroom or kitchen. If you store the briquettes outside, do not leave them in the open air in case it rains. Instead, you could store them in a shed. Let the briquettes dry for three to seven days. Once the briquettes are stored safely, simply let them sit for three to seven days. When done, briquettes should be completely dry to the touch and compact. After they're finished drying, you can burn your briquettes.",
  "sentences":[
    " Working Your Waste into a Paste Put on old clothes and wear gloves.",
    "Making briquettes is an incredibly messy process.",
    "Before you begin, you should wear gloves to protect your hands and also put on old clothing.",
    "Shred scrap papers into small pieces.",
    "Find scrap paper around your home.",
    "Old mail, flyers, and work papers work well.",
    "Shred them into tiny pieces.",
    "Soak your paper for a few days.",
    "Place the papers in a bowl or bucket and cover them with water.",
    "Let the papers soak for two days.",
    "This allows the papers to soften and also releases fibers from the papers, which act as a binding agent for your briquettes.",
    "Reuse old scrap paper, such as mail, to make briquettes.",
    "This way, you're reusing old waste during the process.",
    "Work the paper into a porridge-like paste.",
    "After two days have passed, use your hands to knead and squeeze the paper.",
    "Keep going until you have a porridge-like mixture.",
    "The precise amount of time this will take depends on how much paper you're using.",
    "Add in your organic material.",
    "Organic material must be mixed into the paper to make briquettes.",
    "You can use saw dust, pine needles, rice husks, or chopped leaves and grass.",
    "Mix one part soaked paper with three parts of your organic material.",
    "Most organic material will already be fine enough that it should not require shredding.",
    "If you're using larger leaves, however, it can't hurt to break them up a bit.",
    "Add water.",
    "Start with a small amount of water and mix it into the paper mixture using your hands.",
    "Keep adding water until the paper mixture becomes easily moldable.",
    "When squeezed, your mixture should hold together easily.",
    "Molding Your Briquettes Cut off the upper quarter of a soda bottle.",
    "Use a 2-liter soda bottle to make your briquette mold.",
    "Use an x-acto knife, or any sharp knife from your kitchen, to cut off the upper quarter of the bottle.",
    "Make drainage holes in the bottom.",
    "Turn the bottle over so the bottom is facing upward.",
    "Use a sharp knife to cut a dozen small holes circling the bottom of the bottle.",
    "These are drainage holes, where the water will leak out as your briquettes set.",
    "Punch holes in a small plastic bag to create a liner.",
    "Take any small plastic bag you have on hand, such as a bag from the grocery store.",
    "Use a twig or something similar to punch a dozen holes in the bottom of the bag.",
    "These are also drainage holes.",
    "Add your briquettes to the mold.",
    "Take a handful of your briquette mixture and place it in the plastic bag.",
    "Then, place the bag in the soda bottle.",
    "If necessary, add more briquette mixture to fill the soda bottle to the brim.",
    "Squeeze out excess water with a can.",
    "Place a can of some kind of food, like beans, over the briquette mixture inside of the mold.",
    "Place the mold on the ground and put your foot over the can and press down with your foot.",
    "Keep pressing the can until you can't move the mixture down any further.",
    "Water will seep out during this part of the process, so you should press the mixture outside.",
    "Drying the Briquettes Remove your briquette from the mold.",
    "Take hold of the sides of the plastic bag.",
    "Slowly pull the bag upward, removing the briquette from the mold.",
    "Then, remove the briquette from the plastic.",
    "Your briquette should now be in the form a small, cylinder shape.",
    "Set your briquettes in a dry place.",
    "Briquettes need time to dry before you can use them.",
    "Find a dry place, either in your home or outdoors, where the briquettes will not be disturbed.",
    "For example, store the briquettes in a closet in your living room.",
    "Avoid humid areas of the home, like the bathroom or kitchen.",
    "If you store the briquettes outside, do not leave them in the open air in case it rains.",
    "Instead, you could store them in a shed.",
    "Let the briquettes dry for three to seven days.",
    "Once the briquettes are stored safely, simply let them sit for three to seven days.",
    "When done, briquettes should be completely dry to the touch and compact.",
    "After they're finished drying, you can burn your briquettes."
  ],
  "tyn_section":[
    "Scrap paper",
    "Bucket",
    "Organic material (i.e., sawdust,  pine needles, rice husks, grass/leaves)",
    "2-liter soda bottle",
    "Plastic bag",
    "Can of food (i.e., can of beans)"
  ],
  "tyn_model":[
    "paper",
    "water",
    "organic material",
    "soda bottle",
    "briquette",
    "plastic bag",
    "scrap papers",
    "scrap paper",
    "bowl",
    "saw dust",
    "2-liter soda bottle",
    "x-acto knife",
    "bottle",
    "sharp knife",
    "twig",
    "plastic"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.1875,
    "f1":0.2727272727,
    "avg_pos":0.4375
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.375,
    "f1":0.4285714286
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.5,
    "f1":0.5
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333
  }
}