{
  "title":"How to Make Fluffy Bread",
  "url":"https://www.wikihow.com/Make-Fluffy-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Bread Making Tips"
  ],
  "parts":[
    {
      "name":"Mixing Your Dough",
      "steps":[
        {
          "headline":"Add the egg, milk, water, flour, sugar, and yeast to a mixer or mixing bowl.",
          "description":"Ideally, you should use a stand mixer to mix your ingredients. If you don't have one, however, use an electronic mixer instead. Transfer the egg, milk, water, flour, sugar, and yeast to a stand mixer or large mixing bowl."
        },
        {
          "headline":"Mix the egg, milk, water, flour, sugar, and yeast for three minutes.",
          "description":"Beat your ingredients on the lowest speed for about three minutes. The dough should just be beginning to form."
        },
        {
          "headline":"Increase the speed and beat your ingredients for 4 minutes.",
          "description":"Switch to the second highest speed on your mixer. Beat the dough at this speed for 4 minutes."
        },
        {
          "headline":"Beat in the butter at a lower speed for 12 minutes.",
          "description":"Switch back to the lower speed. Add the butter. Beat the dough for an additional 12 minutes. When you're done, all the ingredients should be evenly mixed. Make sure to use room temperature butter so it blends easily into your dough. The ingredients should make a firm, uniform dough when you're done."
        },
        {
          "headline":"Cover the bowl for 90 minutes and allow the dough to rise.",
          "description":"Place plastic wrap over the mixing bowl that contains the dough. Place the bowl in a room temperature space and let the dough rise for 90 minutes. When it's done rising, it should have roughly doubled in size."
        }
      ]
    },
    {
      "name":"Forming and Baking Your Bread",
      "steps":[
        {
          "headline":"Break the bread into three pieces.",
          "description":"After the bread has been sitting for 90 minutes, place the dough on a lightly floured surface. Break the dough into three even portions."
        },
        {
          "headline":"Let the pieces rise for 10 to 15 minutes.",
          "description":"Cover the portions of bread with a clean paper towel. Keep them in an area where they will not be disturbed while they spend an additional 10 to 15 minutes rising."
        },
        {
          "headline":"Roll the pieces into cylinders.",
          "description":"Roll each piece on a lightly floured surface using your hands. Roll the pieces into cylinder shapes one at a time. The shapes should be about 11 by 6 inches (28 by 15 centimeters)."
        },
        {
          "headline":"Shape each cylinder.",
          "description":"Take one of the cylinder pieces you made. Roll the short ends of the cylinder inward until they touch. This will form a small, rectangular shape that has a seam in the middle where the end pieces of your dough meet. With the seam side facing upward, roll this small rectangle into another, tighter cylinder. Repeat this process with the other two cylinders."
        },
        {
          "headline":"Arrange your dough in a baking pan.",
          "description":"Grease a 9-inch (23 centimeter) loaf pan with non-stick spray. Set each piece of dough in the tray. Keep them evenly spaced. They should be close together but not touching. There should be just enough space in your pan for them all to fit neatly. The dough will blend together during the baking process, creating a fluffy, aerated bread."
        },
        {
          "headline":"Let the dough rise more.",
          "description":"Cover the pan in plastic wrap. Set the dough in a room temperature space and let it rise for an additional 60 to 75 minutes. The dough should just be rising over the baking pan when it's done."
        },
        {
          "headline":"Bake your bread at 375 °F (191 °C) for 35 to 40 minutes.",
          "description":"Place your bread in a preheated oven and bake it for 35 to 40 minutes. When done, the bread should be golden brown. Start by baking the bread for 35 minutes and, if it's not done, bake it for two or three more minutes. Continue increasing the baking time in two or three minute intervals until your bread is done."
        },
        {
          "headline":"Let your bread cool.",
          "description":"Remove the bread from the oven and set it on  a cooling rack. Cool the bread for 15 minutes before removing it from the pan. Then, set it on a wire rack and let it cool for an additional hour before cutting."
        }
      ]
    },
    {
      "name":"Ensuring a Light Final Product",
      "steps":[
        {
          "headline":"Make sure your yeast is fresh.",
          "description":"Even if you follow instructions carefully, bread may not come out as fluffy if your ingredients aren't fresh. Yeast plays a huge role in helping bread rise and aerate, so check the expiration date on your yeast to make sure it's not expired."
        },
        {
          "headline":"Make sure your dough passes the finger density test.",
          "description":"Test your dough by sprinkling a small amount of flour over the dough and press your finger about 1 inch (2.5 cm) into the dough. If the dough is ready to go in the oven, the dough will spring back up slowly. It will not completely spring back up, however, and will leave a small dent on the surface of the bread."
        },
        {
          "headline":"Splurge on your bread flour.",
          "description":"You get what you pay for when it comes to fluffy bread. Spend a little extra on the pricier varieties of bread flour in your supermarket. It's worth the extra price to get a lighter, fluffier final product. Make sure to use flour specifically made for baking bread. Conventional all purpose flour will not yield the best results."
        }
      ]
    }
  ],
  "text":" Mixing Your Dough Add the egg, milk, water, flour, sugar, and yeast to a mixer or mixing bowl. Ideally, you should use a stand mixer to mix your ingredients. If you don't have one, however, use an electronic mixer instead. Transfer the egg, milk, water, flour, sugar, and yeast to a stand mixer or large mixing bowl. Mix the egg, milk, water, flour, sugar, and yeast for three minutes. Beat your ingredients on the lowest speed for about three minutes. The dough should just be beginning to form. Increase the speed and beat your ingredients for 4 minutes. Switch to the second highest speed on your mixer. Beat the dough at this speed for 4 minutes. Beat in the butter at a lower speed for 12 minutes. Switch back to the lower speed. Add the butter. Beat the dough for an additional 12 minutes. When you're done, all the ingredients should be evenly mixed. Make sure to use room temperature butter so it blends easily into your dough. The ingredients should make a firm, uniform dough when you're done. Cover the bowl for 90 minutes and allow the dough to rise. Place plastic wrap over the mixing bowl that contains the dough. Place the bowl in a room temperature space and let the dough rise for 90 minutes. When it's done rising, it should have roughly doubled in size. Forming and Baking Your Bread Break the bread into three pieces. After the bread has been sitting for 90 minutes, place the dough on a lightly floured surface. Break the dough into three even portions. Let the pieces rise for 10 to 15 minutes. Cover the portions of bread with a clean paper towel. Keep them in an area where they will not be disturbed while they spend an additional 10 to 15 minutes rising. Roll the pieces into cylinders. Roll each piece on a lightly floured surface using your hands. Roll the pieces into cylinder shapes one at a time. The shapes should be about 11 by 6 inches (28 by 15 centimeters). Shape each cylinder. Take one of the cylinder pieces you made. Roll the short ends of the cylinder inward until they touch. This will form a small, rectangular shape that has a seam in the middle where the end pieces of your dough meet. With the seam side facing upward, roll this small rectangle into another, tighter cylinder. Repeat this process with the other two cylinders. Arrange your dough in a baking pan. Grease a 9-inch (23 centimeter) loaf pan with non-stick spray. Set each piece of dough in the tray. Keep them evenly spaced. They should be close together but not touching. There should be just enough space in your pan for them all to fit neatly. The dough will blend together during the baking process, creating a fluffy, aerated bread. Let the dough rise more. Cover the pan in plastic wrap. Set the dough in a room temperature space and let it rise for an additional 60 to 75 minutes. The dough should just be rising over the baking pan when it's done. Bake your bread at 375 °F (191 °C) for 35 to 40 minutes. Place your bread in a preheated oven and bake it for 35 to 40 minutes. When done, the bread should be golden brown. Start by baking the bread for 35 minutes and, if it's not done, bake it for two or three more minutes. Continue increasing the baking time in two or three minute intervals until your bread is done. Let your bread cool. Remove the bread from the oven and set it on  a cooling rack. Cool the bread for 15 minutes before removing it from the pan. Then, set it on a wire rack and let it cool for an additional hour before cutting. Ensuring a Light Final Product Make sure your yeast is fresh. Even if you follow instructions carefully, bread may not come out as fluffy if your ingredients aren't fresh. Yeast plays a huge role in helping bread rise and aerate, so check the expiration date on your yeast to make sure it's not expired. Make sure your dough passes the finger density test. Test your dough by sprinkling a small amount of flour over the dough and press your finger about 1 inch (2.5 cm) into the dough. If the dough is ready to go in the oven, the dough will spring back up slowly. It will not completely spring back up, however, and will leave a small dent on the surface of the bread. Splurge on your bread flour. You get what you pay for when it comes to fluffy bread. Spend a little extra on the pricier varieties of bread flour in your supermarket. It's worth the extra price to get a lighter, fluffier final product. Make sure to use flour specifically made for baking bread. Conventional all purpose flour will not yield the best results.",
  "sentences":[
    " Mixing Your Dough Add the egg, milk, water, flour, sugar, and yeast to a mixer or mixing bowl.",
    "Ideally, you should use a stand mixer to mix your ingredients.",
    "If you don't have one, however, use an electronic mixer instead.",
    "Transfer the egg, milk, water, flour, sugar, and yeast to a stand mixer or large mixing bowl.",
    "Mix the egg, milk, water, flour, sugar, and yeast for three minutes.",
    "Beat your ingredients on the lowest speed for about three minutes.",
    "The dough should just be beginning to form.",
    "Increase the speed and beat your ingredients for 4 minutes.",
    "Switch to the second highest speed on your mixer.",
    "Beat the dough at this speed for 4 minutes.",
    "Beat in the butter at a lower speed for 12 minutes.",
    "Switch back to the lower speed.",
    "Add the butter.",
    "Beat the dough for an additional 12 minutes.",
    "When you're done, all the ingredients should be evenly mixed.",
    "Make sure to use room temperature butter so it blends easily into your dough.",
    "The ingredients should make a firm, uniform dough when you're done.",
    "Cover the bowl for 90 minutes and allow the dough to rise.",
    "Place plastic wrap over the mixing bowl that contains the dough.",
    "Place the bowl in a room temperature space and let the dough rise for 90 minutes.",
    "When it's done rising, it should have roughly doubled in size.",
    "Forming and Baking Your Bread Break the bread into three pieces.",
    "After the bread has been sitting for 90 minutes, place the dough on a lightly floured surface.",
    "Break the dough into three even portions.",
    "Let the pieces rise for 10 to 15 minutes.",
    "Cover the portions of bread with a clean paper towel.",
    "Keep them in an area where they will not be disturbed while they spend an additional 10 to 15 minutes rising.",
    "Roll the pieces into cylinders.",
    "Roll each piece on a lightly floured surface using your hands.",
    "Roll the pieces into cylinder shapes one at a time.",
    "The shapes should be about 11 by 6 inches (28 by 15 centimeters).",
    "Shape each cylinder.",
    "Take one of the cylinder pieces you made.",
    "Roll the short ends of the cylinder inward until they touch.",
    "This will form a small, rectangular shape that has a seam in the middle where the end pieces of your dough meet.",
    "With the seam side facing upward, roll this small rectangle into another, tighter cylinder.",
    "Repeat this process with the other two cylinders.",
    "Arrange your dough in a baking pan.",
    "Grease a 9-inch (23 centimeter) loaf pan with non-stick spray.",
    "Set each piece of dough in the tray.",
    "Keep them evenly spaced.",
    "They should be close together but not touching.",
    "There should be just enough space in your pan for them all to fit neatly.",
    "The dough will blend together during the baking process, creating a fluffy, aerated bread.",
    "Let the dough rise more.",
    "Cover the pan in plastic wrap.",
    "Set the dough in a room temperature space and let it rise for an additional 60 to 75 minutes.",
    "The dough should just be rising over the baking pan when it's done.",
    "Bake your bread at 375 °F (191 °C) for 35 to 40 minutes.",
    "Place your bread in a preheated oven and bake it for 35 to 40 minutes.",
    "When done, the bread should be golden brown.",
    "Start by baking the bread for 35 minutes and, if it's not done, bake it for two or three more minutes.",
    "Continue increasing the baking time in two or three minute intervals until your bread is done.",
    "Let your bread cool.",
    "Remove the bread from the oven and set it on  a cooling rack.",
    "Cool the bread for 15 minutes before removing it from the pan.",
    "Then, set it on a wire rack and let it cool for an additional hour before cutting.",
    "Ensuring a Light Final Product Make sure your yeast is fresh.",
    "Even if you follow instructions carefully, bread may not come out as fluffy if your ingredients aren't fresh.",
    "Yeast plays a huge role in helping bread rise and aerate, so check the expiration date on your yeast to make sure it's not expired.",
    "Make sure your dough passes the finger density test.",
    "Test your dough by sprinkling a small amount of flour over the dough and press your finger about 1 inch (2.5 cm) into the dough.",
    "If the dough is ready to go in the oven, the dough will spring back up slowly.",
    "It will not completely spring back up, however, and will leave a small dent on the surface of the bread.",
    "Splurge on your bread flour.",
    "You get what you pay for when it comes to fluffy bread.",
    "Spend a little extra on the pricier varieties of bread flour in your supermarket.",
    "It's worth the extra price to get a lighter, fluffier final product.",
    "Make sure to use flour specifically made for baking bread.",
    "Conventional all purpose flour will not yield the best results."
  ],
  "tyn_section":[
    "Stand mixer",
    "Electronic mixer",
    "Baking pan",
    "Paper towel"
  ],
  "tyn_model":[
    "yeast",
    "flour",
    "egg",
    "milk",
    "water",
    "sugar",
    "butter",
    "stand mixer",
    "bowl",
    "plastic wrap",
    "bread",
    "baking pan",
    "oven",
    "bread flour",
    "mixer or mixing",
    "electronic mixer",
    "large mixing bowl",
    "mixer",
    "mixing bowl",
    "loaf pan",
    "non-stick spray",
    "tray",
    "preheated oven",
    "wire rack",
    "all purpose flour"
  ],
  "simple_metrics":{
    "r":0.75,
    "p":0.12,
    "f1":0.2068965517,
    "avg_pos":0.28
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.16,
    "f1":0.2637362637
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2,
    "f1":0.3157894737
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.12,
    "f1":0.2068965517
  }
}