{
  "title":"How to Store Banana Bread",
  "url":"https://www.wikihow.com/Store-Banana-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Storing Banana Bread at Room Temperature",
      "steps":[
        {
          "headline":"Make sure the banana bread is fully cooled before you try to store it.",
          "description":"Use your hands to feel the banana bread; if it's still warm, let it cool longer. Storing warm banana bread in a sealed container can cause condensation to form, which will make the bread soggy."
        },
        {
          "headline":"Place a paper towel on the bottom of a plastic container.",
          "description":"Use a container that’s large enough the hold the banana bread. If you don’t have a plastic container, use a sealable plastic bag instead. Lay the plastic bag on its side and put a paper towel inside."
        },
        {
          "headline":"Set the banana bread on top of the paper towel in the container.",
          "description":"If you’re using a sealable plastic bag instead, keep the bag flat on its side and put the banana bread inside on top of the paper towel."
        },
        {
          "headline":"Cover the banana bread with a new paper towel.",
          "description":"The banana bread should be sandwiched between the two paper towels. The paper towels will absorb moisture from the bread and prevent it from getting soggy during storage."
        },
        {
          "headline":"Cover the plastic container with the lid and set aside for storage.",
          "description":"If you’re using a sealable plastic bag, press out the excess air from the bag using your hand and then zip the bag closed. Stored at room temperature, the banana bread should be safe to eat for two to four days. After two to four days, toss the bread in the trash or  freeze it. Store the banana bread in a dry, cool place to maximize it's shelf life. If the banana bread has developed a bad odor, looks discolored, or has mold on it, it's gone bad and you should throw it away."
        }
      ]
    },
    {
      "name":"Freezing Banana Bread",
      "steps":[
        {
          "headline":"Let the bread completely cool before freezing it.",
          "description":"If the bread feels warm to the touch, wait longer for it to cool. Storing warm foods in a freezer can disrupt the freezer's internal temperature and prevent the food from freezing properly."
        },
        {
          "headline":"Tear off a piece of plastic wrap to wrap the bread in.",
          "description":"Make sure the piece is long enough to wrap around the bread two to three times, around 20-30 inches (51-76 cm) long."
        },
        {
          "headline":"Wrap the banana bread in the plastic wrap.",
          "description":"Set the bread on the edge of the plastic wrap so the long side of the plastic wrap runs parallel to the width of the bread. Wrap the plastic wrap around the bread several times until you've used up the whole piece you tore off. Fold the edges of the plastic wrap in and around the loaf of bread so none of the bread is exposed. The plastic wrap will keep air away from the surface of the bread so it stays fresh longer."
        },
        {
          "headline":"Tear off a piece of aluminum foil about 10 inches (25.4 cm) long.",
          "description":"You want enough foil to wrap around the loaf of banana bread at least once."
        },
        {
          "headline":"Wrap the bread in the foil so the edges of the foil are on the bottom.",
          "description":"Center the sheet of foil over the top of the bread so the long side of the foil is parallel with the width of the bread. Fold the foil down and under the bread. Make sure the foil is tightly wrapped so it stays on in the freezer. The foil will add another layer of protection from the air so your bread stays nice and fresh."
        },
        {
          "headline":"Put the wrapped banana bread in a freezer bag.",
          "description":"Use your hands to press out any excess air in the bag before you zip it closed. You can also use a straw to suck out excess air from the bag."
        },
        {
          "headline":"Store the banana bread in the freezer for up to three months.",
          "description":"Write the date you made the bread on the plastic bag so you'll know how long it's been in the freezer. To eat a slice, remove the bread from the freezer and let it thaw at room temperature on a counter. After you cut yourself a slice, reseal the plastic wrap and aluminum foil around the bread and set it back in the freezer in the freezer bag. After three months the banana bread may develop freezer burn. If the banana bread has ice particles on it or looks discolored, it's most likely gone bad."
        }
      ]
    }
  ],
  "text":" Storing Banana Bread at Room Temperature Make sure the banana bread is fully cooled before you try to store it. Use your hands to feel the banana bread; if it's still warm, let it cool longer. Storing warm banana bread in a sealed container can cause condensation to form, which will make the bread soggy. Place a paper towel on the bottom of a plastic container. Use a container that’s large enough the hold the banana bread. If you don’t have a plastic container, use a sealable plastic bag instead. Lay the plastic bag on its side and put a paper towel inside. Set the banana bread on top of the paper towel in the container. If you’re using a sealable plastic bag instead, keep the bag flat on its side and put the banana bread inside on top of the paper towel. Cover the banana bread with a new paper towel. The banana bread should be sandwiched between the two paper towels. The paper towels will absorb moisture from the bread and prevent it from getting soggy during storage. Cover the plastic container with the lid and set aside for storage. If you’re using a sealable plastic bag, press out the excess air from the bag using your hand and then zip the bag closed. Stored at room temperature, the banana bread should be safe to eat for two to four days. After two to four days, toss the bread in the trash or  freeze it. Store the banana bread in a dry, cool place to maximize it's shelf life. If the banana bread has developed a bad odor, looks discolored, or has mold on it, it's gone bad and you should throw it away. Freezing Banana Bread Let the bread completely cool before freezing it. If the bread feels warm to the touch, wait longer for it to cool. Storing warm foods in a freezer can disrupt the freezer's internal temperature and prevent the food from freezing properly. Tear off a piece of plastic wrap to wrap the bread in. Make sure the piece is long enough to wrap around the bread two to three times, around 20-30 inches (51-76 cm) long. Wrap the banana bread in the plastic wrap. Set the bread on the edge of the plastic wrap so the long side of the plastic wrap runs parallel to the width of the bread. Wrap the plastic wrap around the bread several times until you've used up the whole piece you tore off. Fold the edges of the plastic wrap in and around the loaf of bread so none of the bread is exposed. The plastic wrap will keep air away from the surface of the bread so it stays fresh longer. Tear off a piece of aluminum foil about 10 inches (25.4 cm) long. You want enough foil to wrap around the loaf of banana bread at least once. Wrap the bread in the foil so the edges of the foil are on the bottom. Center the sheet of foil over the top of the bread so the long side of the foil is parallel with the width of the bread. Fold the foil down and under the bread. Make sure the foil is tightly wrapped so it stays on in the freezer. The foil will add another layer of protection from the air so your bread stays nice and fresh. Put the wrapped banana bread in a freezer bag. Use your hands to press out any excess air in the bag before you zip it closed. You can also use a straw to suck out excess air from the bag. Store the banana bread in the freezer for up to three months. Write the date you made the bread on the plastic bag so you'll know how long it's been in the freezer. To eat a slice, remove the bread from the freezer and let it thaw at room temperature on a counter. After you cut yourself a slice, reseal the plastic wrap and aluminum foil around the bread and set it back in the freezer in the freezer bag. After three months the banana bread may develop freezer burn. If the banana bread has ice particles on it or looks discolored, it's most likely gone bad.",
  "sentences":[
    " Storing Banana Bread at Room Temperature Make sure the banana bread is fully cooled before you try to store it.",
    "Use your hands to feel the banana bread; if it's still warm, let it cool longer.",
    "Storing warm banana bread in a sealed container can cause condensation to form, which will make the bread soggy.",
    "Place a paper towel on the bottom of a plastic container.",
    "Use a container that’s large enough the hold the banana bread.",
    "If you don’t have a plastic container, use a sealable plastic bag instead.",
    "Lay the plastic bag on its side and put a paper towel inside.",
    "Set the banana bread on top of the paper towel in the container.",
    "If you’re using a sealable plastic bag instead, keep the bag flat on its side and put the banana bread inside on top of the paper towel.",
    "Cover the banana bread with a new paper towel.",
    "The banana bread should be sandwiched between the two paper towels.",
    "The paper towels will absorb moisture from the bread and prevent it from getting soggy during storage.",
    "Cover the plastic container with the lid and set aside for storage.",
    "If you’re using a sealable plastic bag, press out the excess air from the bag using your hand and then zip the bag closed.",
    "Stored at room temperature, the banana bread should be safe to eat for two to four days.",
    "After two to four days, toss the bread in the trash or  freeze it.",
    "Store the banana bread in a dry, cool place to maximize it's shelf life.",
    "If the banana bread has developed a bad odor, looks discolored, or has mold on it, it's gone bad and you should throw it away.",
    "Freezing Banana Bread Let the bread completely cool before freezing it.",
    "If the bread feels warm to the touch, wait longer for it to cool.",
    "Storing warm foods in a freezer can disrupt the freezer's internal temperature and prevent the food from freezing properly.",
    "Tear off a piece of plastic wrap to wrap the bread in.",
    "Make sure the piece is long enough to wrap around the bread two to three times, around 20-30 inches (51-76 cm) long.",
    "Wrap the banana bread in the plastic wrap.",
    "Set the bread on the edge of the plastic wrap so the long side of the plastic wrap runs parallel to the width of the bread.",
    "Wrap the plastic wrap around the bread several times until you've used up the whole piece you tore off.",
    "Fold the edges of the plastic wrap in and around the loaf of bread so none of the bread is exposed.",
    "The plastic wrap will keep air away from the surface of the bread so it stays fresh longer.",
    "Tear off a piece of aluminum foil about 10 inches (25.4 cm) long.",
    "You want enough foil to wrap around the loaf of banana bread at least once.",
    "Wrap the bread in the foil so the edges of the foil are on the bottom.",
    "Center the sheet of foil over the top of the bread so the long side of the foil is parallel with the width of the bread.",
    "Fold the foil down and under the bread.",
    "Make sure the foil is tightly wrapped so it stays on in the freezer.",
    "The foil will add another layer of protection from the air so your bread stays nice and fresh.",
    "Put the wrapped banana bread in a freezer bag.",
    "Use your hands to press out any excess air in the bag before you zip it closed.",
    "You can also use a straw to suck out excess air from the bag.",
    "Store the banana bread in the freezer for up to three months.",
    "Write the date you made the bread on the plastic bag so you'll know how long it's been in the freezer.",
    "To eat a slice, remove the bread from the freezer and let it thaw at room temperature on a counter.",
    "After you cut yourself a slice, reseal the plastic wrap and aluminum foil around the bread and set it back in the freezer in the freezer bag.",
    "After three months the banana bread may develop freezer burn.",
    "If the banana bread has ice particles on it or looks discolored, it's most likely gone bad."
  ],
  "tyn_section":[
    "Paper towels",
    "Plastic container",
    "Plastic wrap",
    "Foil",
    "Freezer bag"
  ],
  "tyn_model":[
    "banana bread",
    "plastic wrap",
    "foil",
    "freezer",
    "paper towel",
    "sealable plastic bag",
    "plastic container",
    "plastic bag",
    "paper towels",
    "aluminum foil",
    "freezer bag",
    "straw",
    "freezer burn"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.3846153846,
    "f1":0.5555555556,
    "avg_pos":0.6153846154
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.5384615385,
    "f1":0.7
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.7692307692,
    "f1":0.8695652174
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.3846153846,
    "f1":0.5555555556
  }
}