{
  "title":"How to Remove Old Dog Urine Stains",
  "url":"https://www.wikihow.com/Remove-Old-Dog-Urine-Stains",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Applying Dish Soap",
      "steps":[
        {
          "headline":"Mix ½ teaspoon (2.5 mL) of dish soap with 1 cup (0.24 L) of warm water.",
          "description":"Stir the mixture thoroughly until the water becomes sudsy."
        },
        {
          "headline":"Pour the mixture directly onto the stain.",
          "description":"Make sure the entire stain is covered with the mixture. You want the affected area to be soaked with the mixture."
        },
        {
          "headline":"Blot the stained area dry with a paper towel.",
          "description":"Try to soak up as much of the liquid from the soap mixture as you can with the paper towel. Vacuum over the area if you’re having a hard time removing the excess liquid from the mixture."
        },
        {
          "headline":"Repeat the dish soap and blotting steps until the stain is gone.",
          "description":"Make sure you rinse the stained area with warm water after you finish so there's no leftover soap. Dry the affected area with paper towel when you're all finished."
        }
      ]
    },
    {
      "name":"Using Vinegar, Baking Soda, and Peroxide",
      "steps":[
        {
          "headline":"Mix together 1 part white vinegar with 1 part water.",
          "description":"Make enough of the solution that you’ll be able to fully soak the stained area with the mixture."
        },
        {
          "headline":"Blot the stain with a rag soaked in the vinegar solution.",
          "description":"Press firmly as you're blotting with the rag so the solution gets worked deep down into the stain. Don't rub the stain with the rag."
        },
        {
          "headline":"Pour some of the solution directly onto the stain.",
          "description":"Cover the entire stain so it's soaked with the solution. Take care not to get a lot of the solution on unaffected areas of the carpet."
        },
        {
          "headline":"Scrub the solution into the stain using a scrub brush.",
          "description":"Firmly press down on the brush and scrub in back and forth motions across the surface of the stain. If you don’t have a scrub brush, a toothbrush will also work."
        },
        {
          "headline":"Blot the stain with a paper towel until the stained area is dry.",
          "description":"Use more paper towels as needed."
        },
        {
          "headline":"Sprinkle baking soda over the stain.",
          "description":"Regular store-bought baking soda will work. Leave a thin layer of baking soda over the entire surface of the stain."
        },
        {
          "headline":"Mix ½ cup (0.12 L) of hydrogen peroxide with 1 teaspoon (4.9 mL) of dish soap.",
          "description":"Use 3 percent hydrogen peroxide. Stir the mixture thoroughly."
        },
        {
          "headline":"Pour some of the peroxide solution onto the stain and scrub it in.",
          "description":"Use back and forth motions as you scrub. Press firmly down on the scrub brush to help work the solution and baking soda deep into the stain."
        },
        {
          "headline":"Dry the stained area with a paper towel.",
          "description":"Try to leave the stain as dry as possible when you're finished so there's no leftover solution on the carpet. You can also run a vacuum over the area to remove any leftover liquid. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSusan Stocker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreen Cleaning Expert\t\t\t\t\t\t\t\tSusan Stocker runs and owns Susan’s Green Cleaning, the #1 Green Cleaning Company in Seattle. She is well known in the region for outstanding customer service protocols — winning the 2017 Better Business Torch Award for Ethics & Integrity —and her energetic support of fair wages, employee benefits, and green cleaning practices. Susan Stocker\t\t\tGreen Cleaning Expert\t\t\t\tTry this approach from our expert: First, clean the area with a mixture of dish soap and warm water. Scrub the area thoroughly with a clean white rag, then rinse the area, making sure you get all of the dish soap out. Dry the carpet very thoroughly. Then, do the same thing all over again, but this time with a mixture of 1 part vinegar and 1 part water. This will help neutralize any odors. Dry the carpet again, then sprinkle baking soda liberally over the entire area. Leave it on for at least an hour, then vacuum it away."
        }
      ]
    },
    {
      "name":"Trying Other Solutions",
      "steps":[
        {
          "headline":"Buy a commercial dog-urine stain remover at the store.",
          "description":"Commercial stain fighting products come with built in enzymes that help eliminate urine stains and odors. Apply the stain remover to the urine stain and follow the directions on the label. Look for products that are specifically designed for use on dog urine stains. If you’re worried about the ingredients in a commercial stain remover affecting your dog or your family, look for a stain remover that’s labeled “green” or “all natural.”"
        },
        {
          "headline":"Rent a carpet-cleaning machine to remove tough stains.",
          "description":"Search online for “carpet-cleaning machine rentals near me.” If you don’t want to use the chemical cleaner that comes with the machine, replace it with an all natural cleaner or a homemade cleaning solution. Follow the instructions given by the rental company to remove the stain."
        },
        {
          "headline":"Hire a professional to remove the stain.",
          "description":"Contact a local carpet cleaner and pay to have them come treat the stain. A carpet cleaner should have the machinery and solutions necessary to fully eliminate the stain and odor from your carpet."
        }
      ]
    }
  ],
  "text":" Applying Dish Soap Mix ½ teaspoon (2.5 mL) of dish soap with 1 cup (0.24 L) of warm water. Stir the mixture thoroughly until the water becomes sudsy. Pour the mixture directly onto the stain. Make sure the entire stain is covered with the mixture. You want the affected area to be soaked with the mixture. Blot the stained area dry with a paper towel. Try to soak up as much of the liquid from the soap mixture as you can with the paper towel. Vacuum over the area if you’re having a hard time removing the excess liquid from the mixture. Repeat the dish soap and blotting steps until the stain is gone. Make sure you rinse the stained area with warm water after you finish so there's no leftover soap. Dry the affected area with paper towel when you're all finished. Using Vinegar, Baking Soda, and Peroxide Mix together 1 part white vinegar with 1 part water. Make enough of the solution that you’ll be able to fully soak the stained area with the mixture. Blot the stain with a rag soaked in the vinegar solution. Press firmly as you're blotting with the rag so the solution gets worked deep down into the stain. Don't rub the stain with the rag. Pour some of the solution directly onto the stain. Cover the entire stain so it's soaked with the solution. Take care not to get a lot of the solution on unaffected areas of the carpet. Scrub the solution into the stain using a scrub brush. Firmly press down on the brush and scrub in back and forth motions across the surface of the stain. If you don’t have a scrub brush, a toothbrush will also work. Blot the stain with a paper towel until the stained area is dry. Use more paper towels as needed. Sprinkle baking soda over the stain. Regular store-bought baking soda will work. Leave a thin layer of baking soda over the entire surface of the stain. Mix ½ cup (0.12 L) of hydrogen peroxide with 1 teaspoon (4.9 mL) of dish soap. Use 3 percent hydrogen peroxide. Stir the mixture thoroughly. Pour some of the peroxide solution onto the stain and scrub it in. Use back and forth motions as you scrub. Press firmly down on the scrub brush to help work the solution and baking soda deep into the stain. Dry the stained area with a paper towel. Try to leave the stain as dry as possible when you're finished so there's no leftover solution on the carpet. You can also run a vacuum over the area to remove any leftover liquid. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSusan Stocker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreen Cleaning Expert\t\t\t\t\t\t\t\tSusan Stocker runs and owns Susan’s Green Cleaning, the #1 Green Cleaning Company in Seattle. She is well known in the region for outstanding customer service protocols — winning the 2017 Better Business Torch Award for Ethics & Integrity —and her energetic support of fair wages, employee benefits, and green cleaning practices. Susan Stocker\t\t\tGreen Cleaning Expert\t\t\t\tTry this approach from our expert: First, clean the area with a mixture of dish soap and warm water. Scrub the area thoroughly with a clean white rag, then rinse the area, making sure you get all of the dish soap out. Dry the carpet very thoroughly. Then, do the same thing all over again, but this time with a mixture of 1 part vinegar and 1 part water. This will help neutralize any odors. Dry the carpet again, then sprinkle baking soda liberally over the entire area. Leave it on for at least an hour, then vacuum it away. Trying Other Solutions Buy a commercial dog-urine stain remover at the store. Commercial stain fighting products come with built in enzymes that help eliminate urine stains and odors. Apply the stain remover to the urine stain and follow the directions on the label. Look for products that are specifically designed for use on dog urine stains. If you’re worried about the ingredients in a commercial stain remover affecting your dog or your family, look for a stain remover that’s labeled “green” or “all natural.” Rent a carpet-cleaning machine to remove tough stains. Search online for “carpet-cleaning machine rentals near me.” If you don’t want to use the chemical cleaner that comes with the machine, replace it with an all natural cleaner or a homemade cleaning solution. Follow the instructions given by the rental company to remove the stain. Hire a professional to remove the stain. Contact a local carpet cleaner and pay to have them come treat the stain. A carpet cleaner should have the machinery and solutions necessary to fully eliminate the stain and odor from your carpet.",
  "sentences":[
    " Applying Dish Soap Mix ½ teaspoon (2.5 mL) of dish soap with 1 cup (0.24 L) of warm water.",
    "Stir the mixture thoroughly until the water becomes sudsy.",
    "Pour the mixture directly onto the stain.",
    "Make sure the entire stain is covered with the mixture.",
    "You want the affected area to be soaked with the mixture.",
    "Blot the stained area dry with a paper towel.",
    "Try to soak up as much of the liquid from the soap mixture as you can with the paper towel.",
    "Vacuum over the area if you’re having a hard time removing the excess liquid from the mixture.",
    "Repeat the dish soap and blotting steps until the stain is gone.",
    "Make sure you rinse the stained area with warm water after you finish so there's no leftover soap.",
    "Dry the affected area with paper towel when you're all finished.",
    "Using Vinegar, Baking Soda, and Peroxide Mix together 1 part white vinegar with 1 part water.",
    "Make enough of the solution that you’ll be able to fully soak the stained area with the mixture.",
    "Blot the stain with a rag soaked in the vinegar solution.",
    "Press firmly as you're blotting with the rag so the solution gets worked deep down into the stain.",
    "Don't rub the stain with the rag.",
    "Pour some of the solution directly onto the stain.",
    "Cover the entire stain so it's soaked with the solution.",
    "Take care not to get a lot of the solution on unaffected areas of the carpet.",
    "Scrub the solution into the stain using a scrub brush.",
    "Firmly press down on the brush and scrub in back and forth motions across the surface of the stain.",
    "If you don’t have a scrub brush, a toothbrush will also work.",
    "Blot the stain with a paper towel until the stained area is dry.",
    "Use more paper towels as needed.",
    "Sprinkle baking soda over the stain.",
    "Regular store-bought baking soda will work.",
    "Leave a thin layer of baking soda over the entire surface of the stain.",
    "Mix ½ cup (0.12 L) of hydrogen peroxide with 1 teaspoon (4.9 mL) of dish soap.",
    "Use 3 percent hydrogen peroxide.",
    "Stir the mixture thoroughly.",
    "Pour some of the peroxide solution onto the stain and scrub it in.",
    "Use back and forth motions as you scrub.",
    "Press firmly down on the scrub brush to help work the solution and baking soda deep into the stain.",
    "Dry the stained area with a paper towel.",
    "Try to leave the stain as dry as possible when you're finished so there's no leftover solution on the carpet.",
    "You can also run a vacuum over the area to remove any leftover liquid.",
    "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSusan Stocker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreen Cleaning Expert\t\t\t\t\t\t\t\tSusan Stocker runs and owns Susan’s Green Cleaning, the #1 Green Cleaning Company in Seattle.",
    "She is well known in the region for outstanding customer service protocols — winning the 2017 Better Business Torch Award for Ethics & Integrity —and her energetic support of fair wages, employee benefits, and green cleaning practices.",
    "Susan Stocker\t\t\tGreen Cleaning Expert\t\t\t\tTry this approach from our expert: First, clean the area with a mixture of dish soap and warm water.",
    "Scrub the area thoroughly with a clean white rag, then rinse the area, making sure you get all of the dish soap out.",
    "Dry the carpet very thoroughly.",
    "Then, do the same thing all over again, but this time with a mixture of 1 part vinegar and 1 part water.",
    "This will help neutralize any odors.",
    "Dry the carpet again, then sprinkle baking soda liberally over the entire area.",
    "Leave it on for at least an hour, then vacuum it away.",
    "Trying Other Solutions Buy a commercial dog-urine stain remover at the store.",
    "Commercial stain fighting products come with built in enzymes that help eliminate urine stains and odors.",
    "Apply the stain remover to the urine stain and follow the directions on the label.",
    "Look for products that are specifically designed for use on dog urine stains.",
    "If you’re worried about the ingredients in a commercial stain remover affecting your dog or your family, look for a stain remover that’s labeled “green” or “all natural.” Rent a carpet-cleaning machine to remove tough stains.",
    "Search online for “carpet-cleaning machine rentals near me.” If you don’t want to use the chemical cleaner that comes with the machine, replace it with an all natural cleaner or a homemade cleaning solution.",
    "Follow the instructions given by the rental company to remove the stain.",
    "Hire a professional to remove the stain.",
    "Contact a local carpet cleaner and pay to have them come treat the stain.",
    "A carpet cleaner should have the machinery and solutions necessary to fully eliminate the stain and odor from your carpet."
  ],
  "tyn_section":[
    "Liquid dish soap",
    "Paper towels",
    "Ammonia",
    "Vacuum",
    "White vinegar",
    "Scrub brush",
    "Baking soda",
    "Hydrogen peroxide",
    "Rag"
  ],
  "tyn_model":[
    "dish soap",
    "water",
    "baking soda",
    "paper towel",
    "green cleaning",
    "vinegar",
    "scrub brush",
    "hydrogen peroxide",
    "carpet cleaner",
    "soap",
    "peroxide",
    "white vinegar",
    "rag",
    "paper towels",
    "vacuum",
    "green cleaning expert",
    "— winning",
    "—and",
    "stain remover",
    "“green",
    "” or",
    "“all",
    "” rent",
    "“carpet-cleaning machine",
    "” if",
    "chemical cleaner",
    "all natural cleaner",
    "cleaning solution"
  ],
  "simple_metrics":{
    "r":0.7777777778,
    "p":0.25,
    "f1":0.3783783784,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8888888889,
    "p":0.3571428571,
    "f1":0.5095541401
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8888888889,
    "p":0.4285714286,
    "f1":0.578313253
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8888888889,
    "p":0.2857142857,
    "f1":0.4324324324
  }
}