{
  "title":"How to Make Orgonite Jewelry",
  "url":"https://www.wikihow.com/Make-Orgonite-Jewelry",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "parts":[
    {
      "name":"Preparing the Resin and Molds",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"Making orgonite pendants requires a variety of materials and tools, so make sure that you have everything before you get started. You will need:\nCrafting epoxy or resin with hardener. Jewelry resin molds. Newspaper or paper towels to cover your work area. Latex or vinyl gloves. A squeeze bottle. Small plastic cups for mixing the resin. Wooden popsicle sticks. Blow dryer. Cardboard box to cover up the molds while they dry. Copper and aluminum shavings or wire. Crystals or crystal pieces. Amethyst, tourmaline, and/or other precious gems or stones that you want to include (optional). Eye pins, jump rings, earring hooks, chains, and other jewelry findings. Two pairs of pliers."
        },
        {
          "headline":"Cover your work area and put on your gloves.",
          "description":"When working with resin, it is very important to cover your work area and protect your skin. The resin can damage your surfaces and irritate your skin. Lay down some newspapers or paper towels and put on your gloves before you begin working."
        },
        {
          "headline":"Place the resin and hardener solution into a bowl of very warm water.",
          "description":"Placing your resin and the hardener into a bowl of very warm water will help to reduce the amount of air bubbles in your resin. Let them sit in the water while you prepare everything else. The water should be very warm to hot, but not boiling!"
        },
        {
          "headline":"Arrange the metal, crystals, and other items in your molds.",
          "description":"While you wait for the resin and hardener to warm up, place a layer of aluminum, copper, and crystal into your molds along with any other precious gems or stones that you would like to include. Arrange these items in a manner that is pleasing to you."
        },
        {
          "headline":"Prepare your resin.",
          "description":"Next, you will need to prepare your resin. Most products require equal parts of resin and hardener, but make sure to follow the instructions on the product’s packaging. Mix the two substances using a wooden popsicle stick."
        }
      ]
    },
    {
      "name":"Pouring and Setting the Resin",
      "steps":[
        {
          "headline":"Pour resin into the molds up to the top.",
          "description":"After you have finished mixing your resin, begin pouring resin into the molds. Pour the resin slowly and carefully and only fill them up to the top of the mold or just below it. Do not overfill the molds."
        },
        {
          "headline":"Add an eye pin to the top of the molds.",
          "description":"To ensure that you can easily attach your orgonite pendants to a chain or earring hooks, you will need to add an eye pin. It is best to do this right after pouring your resin to ensure that the eye pin is secure. Place the eye pin into the resin so that the loop is sticking out and the pin is submerged in the resin. You may have to wiggle the eye pin into place to get it into the resin. If needed, you can also pour a small amount of resin over the eye pin."
        },
        {
          "headline":"Allow the resin to set overnight.",
          "description":"When you have finished pouring the resin into the molds and positioning the eye pins, leave your resin to dry overnight. Cover the molds with the cardboard box to ensure that no dust falls into the molds. Make sure that the molds are out of the reach of pets and children as well. If you notice any air bubbles in the resin, then you can use a blow dryer set on low to gently warm up the resin and release the air bubbles."
        }
      ]
    },
    {
      "name":"Using the Pendants",
      "steps":[
        {
          "headline":"Remove the pendants from their molds.",
          "description":"After the pendants have dried completely, you can remove them from their molds. Pop the pendants out of the molds and onto your work surface. If the pendants do not come out easily, then you can put the molds into your freezer and leave them there for about 10 minutes. When the resin cools, the orgonite pendants should easily pop out from their molds."
        },
        {
          "headline":"Add jump rings to the eye pins.",
          "description":"Use the pliers to open a jump ring and slide the eye pin loop onto the jump ring. To open the jump ring, squeeze the pliers to close the jaws around the edges near the opening of the jump ring. Then, push one side of the ring away from you while you pull the other side of the ring towards you. Keep the jump ring open."
        },
        {
          "headline":"Attach the pendants to a chain or earring hooks.",
          "description":"Next, slide the jump ring through the eye of an earring hook or onto a chain and then close the jump ring again. If you are making a pair of earrings, then make a second earring to match. Your orgonite jewelry item is now ready to wear! Try it on and see how it looks!"
        }
      ]
    }
  ],
  "text":" Preparing the Resin and Molds Gather your materials. Making orgonite pendants requires a variety of materials and tools, so make sure that you have everything before you get started. You will need:\nCrafting epoxy or resin with hardener. Jewelry resin molds. Newspaper or paper towels to cover your work area. Latex or vinyl gloves. A squeeze bottle. Small plastic cups for mixing the resin. Wooden popsicle sticks. Blow dryer. Cardboard box to cover up the molds while they dry. Copper and aluminum shavings or wire. Crystals or crystal pieces. Amethyst, tourmaline, and/or other precious gems or stones that you want to include (optional). Eye pins, jump rings, earring hooks, chains, and other jewelry findings. Two pairs of pliers. Cover your work area and put on your gloves. When working with resin, it is very important to cover your work area and protect your skin. The resin can damage your surfaces and irritate your skin. Lay down some newspapers or paper towels and put on your gloves before you begin working. Place the resin and hardener solution into a bowl of very warm water. Placing your resin and the hardener into a bowl of very warm water will help to reduce the amount of air bubbles in your resin. Let them sit in the water while you prepare everything else. The water should be very warm to hot, but not boiling! Arrange the metal, crystals, and other items in your molds. While you wait for the resin and hardener to warm up, place a layer of aluminum, copper, and crystal into your molds along with any other precious gems or stones that you would like to include. Arrange these items in a manner that is pleasing to you. Prepare your resin. Next, you will need to prepare your resin. Most products require equal parts of resin and hardener, but make sure to follow the instructions on the product’s packaging. Mix the two substances using a wooden popsicle stick. Pouring and Setting the Resin Pour resin into the molds up to the top. After you have finished mixing your resin, begin pouring resin into the molds. Pour the resin slowly and carefully and only fill them up to the top of the mold or just below it. Do not overfill the molds. Add an eye pin to the top of the molds. To ensure that you can easily attach your orgonite pendants to a chain or earring hooks, you will need to add an eye pin. It is best to do this right after pouring your resin to ensure that the eye pin is secure. Place the eye pin into the resin so that the loop is sticking out and the pin is submerged in the resin. You may have to wiggle the eye pin into place to get it into the resin. If needed, you can also pour a small amount of resin over the eye pin. Allow the resin to set overnight. When you have finished pouring the resin into the molds and positioning the eye pins, leave your resin to dry overnight. Cover the molds with the cardboard box to ensure that no dust falls into the molds. Make sure that the molds are out of the reach of pets and children as well. If you notice any air bubbles in the resin, then you can use a blow dryer set on low to gently warm up the resin and release the air bubbles. Using the Pendants Remove the pendants from their molds. After the pendants have dried completely, you can remove them from their molds. Pop the pendants out of the molds and onto your work surface. If the pendants do not come out easily, then you can put the molds into your freezer and leave them there for about 10 minutes. When the resin cools, the orgonite pendants should easily pop out from their molds. Add jump rings to the eye pins. Use the pliers to open a jump ring and slide the eye pin loop onto the jump ring. To open the jump ring, squeeze the pliers to close the jaws around the edges near the opening of the jump ring. Then, push one side of the ring away from you while you pull the other side of the ring towards you. Keep the jump ring open. Attach the pendants to a chain or earring hooks. Next, slide the jump ring through the eye of an earring hook or onto a chain and then close the jump ring again. If you are making a pair of earrings, then make a second earring to match. Your orgonite jewelry item is now ready to wear! Try it on and see how it looks!",
  "sentences":[
    " Preparing the Resin and Molds Gather your materials.",
    "Making orgonite pendants requires a variety of materials and tools, so make sure that you have everything before you get started.",
    "You will need:\nCrafting epoxy or resin with hardener.",
    "Jewelry resin molds.",
    "Newspaper or paper towels to cover your work area.",
    "Latex or vinyl gloves.",
    "A squeeze bottle.",
    "Small plastic cups for mixing the resin.",
    "Wooden popsicle sticks.",
    "Blow dryer.",
    "Cardboard box to cover up the molds while they dry.",
    "Copper and aluminum shavings or wire.",
    "Crystals or crystal pieces.",
    "Amethyst, tourmaline, and/or other precious gems or stones that you want to include (optional).",
    "Eye pins, jump rings, earring hooks, chains, and other jewelry findings.",
    "Two pairs of pliers.",
    "Cover your work area and put on your gloves.",
    "When working with resin, it is very important to cover your work area and protect your skin.",
    "The resin can damage your surfaces and irritate your skin.",
    "Lay down some newspapers or paper towels and put on your gloves before you begin working.",
    "Place the resin and hardener solution into a bowl of very warm water.",
    "Placing your resin and the hardener into a bowl of very warm water will help to reduce the amount of air bubbles in your resin.",
    "Let them sit in the water while you prepare everything else.",
    "The water should be very warm to hot, but not boiling!",
    "Arrange the metal, crystals, and other items in your molds.",
    "While you wait for the resin and hardener to warm up, place a layer of aluminum, copper, and crystal into your molds along with any other precious gems or stones that you would like to include.",
    "Arrange these items in a manner that is pleasing to you.",
    "Prepare your resin.",
    "Next, you will need to prepare your resin.",
    "Most products require equal parts of resin and hardener, but make sure to follow the instructions on the product’s packaging.",
    "Mix the two substances using a wooden popsicle stick.",
    "Pouring and Setting the Resin Pour resin into the molds up to the top.",
    "After you have finished mixing your resin, begin pouring resin into the molds.",
    "Pour the resin slowly and carefully and only fill them up to the top of the mold or just below it.",
    "Do not overfill the molds.",
    "Add an eye pin to the top of the molds.",
    "To ensure that you can easily attach your orgonite pendants to a chain or earring hooks, you will need to add an eye pin.",
    "It is best to do this right after pouring your resin to ensure that the eye pin is secure.",
    "Place the eye pin into the resin so that the loop is sticking out and the pin is submerged in the resin.",
    "You may have to wiggle the eye pin into place to get it into the resin.",
    "If needed, you can also pour a small amount of resin over the eye pin.",
    "Allow the resin to set overnight.",
    "When you have finished pouring the resin into the molds and positioning the eye pins, leave your resin to dry overnight.",
    "Cover the molds with the cardboard box to ensure that no dust falls into the molds.",
    "Make sure that the molds are out of the reach of pets and children as well.",
    "If you notice any air bubbles in the resin, then you can use a blow dryer set on low to gently warm up the resin and release the air bubbles.",
    "Using the Pendants Remove the pendants from their molds.",
    "After the pendants have dried completely, you can remove them from their molds.",
    "Pop the pendants out of the molds and onto your work surface.",
    "If the pendants do not come out easily, then you can put the molds into your freezer and leave them there for about 10 minutes.",
    "When the resin cools, the orgonite pendants should easily pop out from their molds.",
    "Add jump rings to the eye pins.",
    "Use the pliers to open a jump ring and slide the eye pin loop onto the jump ring.",
    "To open the jump ring, squeeze the pliers to close the jaws around the edges near the opening of the jump ring.",
    "Then, push one side of the ring away from you while you pull the other side of the ring towards you.",
    "Keep the jump ring open.",
    "Attach the pendants to a chain or earring hooks.",
    "Next, slide the jump ring through the eye of an earring hook or onto a chain and then close the jump ring again.",
    "If you are making a pair of earrings, then make a second earring to match.",
    "Your orgonite jewelry item is now ready to wear!",
    "Try it on and see how it looks!"
  ],
  "tyn_section":[
    "Crafting epoxy or resin with hardener",
    "Jewelry resin molds",
    "Newspaper or paper towels to cover your work area",
    "Latex or vinyl gloves",
    "A squeeze bottle",
    "Small plastic cups for mixing the resin",
    "Wooden popsicle sticks",
    "Blow dryer",
    "Cardboard box to cover up the molds while they dry",
    "Copper and aluminum shavings or wire",
    "Crystals or crystal pieces",
    "Amethyst, tourmaline, and/or other precious gems or stones (optional)",
    "Eye pins, jump rings, earring hooks, chains, and other jewelry findings",
    "Two pairs of pliers"
  ],
  "tyn_model":[
    "resin",
    "water",
    "orgonite pendants",
    "pliers",
    "blow dryer",
    "bowl",
    "jewelry resin molds",
    "newspaper or paper towels",
    "latex or vinyl gloves",
    "squeeze bottle",
    "popsicle sticks",
    "wire",
    "tourmaline",
    "eye pins",
    "gloves",
    "towels",
    "metal",
    "aluminum",
    "hardener",
    "popsicle stick",
    "cardboard",
    "freezer",
    "pendants",
    "earring hooks",
    "jump ring",
    "orgonite jewelry"
  ],
  "simple_metrics":{
    "r":0.2142857143,
    "p":0.1153846154,
    "f1":0.15,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3571428571,
    "p":0.1923076923,
    "f1":0.25
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4285714286,
    "p":0.2692307692,
    "f1":0.3307086614
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3571428571,
    "p":0.1923076923,
    "f1":0.25
  }
}