{
  "title":"How to Cook a Cucumber",
  "url":"https://www.wikihow.com/Cook-a-Cucumber",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Baking a Cucumber",
      "steps":[
        {
          "headline":"Use a knife to cut a cucumber in half lengthwise.",
          "description":"Cut the cucumber on a cutting board so you don’t damage the surface underneath. You should have two long halves with all of the cucumber’s seeds exposed when you’re finished."
        },
        {
          "headline":"Use a spoon to seed the two halves of the cucumber.",
          "description":"Starting with one half of the cucumber, scoop out all of the flesh and seeds with the spoon until the center of that half is completely carved out. Repeat on the other half of the cucumber. Don't worry about this step if you're baking a seedless cucumber."
        },
        {
          "headline":"Cut the cucumber halves into lengthwise strips using the knife.",
          "description":"You want each strip to be about ⅜ inch (0.95 cm) wide. Once you’ve cut all of the strips, use the knife to cut each strip down so it’s 2 inches (5.1 cm) long."
        },
        {
          "headline":"Put the strips in a large bowl with 1 ½ teaspoons (7.4 mL) of salt.",
          "description":"Toss the cucumbers and salt with a spoon. The salt will prevent the cucumbers from being too watery. Set the cucumbers aside for 30 minutes. You can add 2 tablespoons (29.6 mL) of wine vinegar and a ⅛ teaspoon (0.6 mL) of sugar to the bowl of cucumber strips to give them extra flavor."
        },
        {
          "headline":"Put the cucumber strips in a colander and rinse them under cold water.",
          "description":"Let the colander drain completely. Use a paper towel to pat dry each of the cucumber strips."
        },
        {
          "headline":"Spread out the cucumber strips in a baking dish and season them.",
          "description":"You can also add other vegetables, like scallions, to the dish to bake in the oven with the cucumbers."
        },
        {
          "headline":"Bake the strips in the oven at 375 degrees (190C) for one hour.",
          "description":"Leave the baking dish uncovered and stir the cucumber strips every 20 minutes. After an hour, use an oven mitt to remove the baking dish. Transfer the cucumber strips to a plate using a spatula."
        }
      ]
    },
    {
      "name":"Frying a Cucumber",
      "steps":[
        {
          "headline":"Cut a cucumber in half lengthwise using a knife.",
          "description":"Do it over a cutting board to protect your counter or table from scratches."
        },
        {
          "headline":"Scoop out the seeds from both halves of the cucumber with a spoon.",
          "description":"Run the spoon from one end of the cucumber to the other, scooping up all the seeds and everything in the center of the cucumber along the way. When you’re finished, you should have two carved out halves of the cucumber. If you’re cooking with a seedless cucumber, you can skip this step."
        },
        {
          "headline":"Cut the cucumber halves crosswise into ¼ inch (0.64 cm) slices.",
          "description":"Make sure the slices aren’t any thinner or they may wilt when you fry them. Each cucumber slice should look like a tiny letter \"C.\""
        },
        {
          "headline":"Mix the slices with 1 ½ teaspoons (7.4 mL) of salt in a large bowl.",
          "description":"Stir the cucumber slices and salt with a spoon for one minute, or until the slices are thoroughly coated with the salt."
        },
        {
          "headline":"Set the bowl of cucumber slices aside for 30 minutes.",
          "description":"During this time the salt will draw out excess water from inside the cucumber slices, improving their texture and making them less watery."
        },
        {
          "headline":"Rinse the slices under cold water in a colander and let them dry.",
          "description":"While the water drains from the colander, blot the surface of the cucumber slices with a paper towel to dry them off. You don't want a lot of excess water when you fry them."
        },
        {
          "headline":"Add 1 tablespoon (14.8 mL) of cooking oil to a skillet.",
          "description":"Heat the skillet over high heat on a stovetop. Wait for the cooking oil to start lightly smoking."
        },
        {
          "headline":"Pour the cucumber slices into the skillet.",
          "description":"Use a spoon to stir the cucumber slices continuously in the skillet for around three to four minutes. You’ll know the cucumber slices are finished frying when they have a glossy appearance. When they’re done, transfer them to a plate and turn off the stovetop."
        }
      ]
    },
    {
      "name":"Trying Different Cucumber Recipes",
      "steps":[
        {
          "headline":"Mix in fried cucumbers with garlic and spicy pork for a good stir-fry.",
          "description":"Cook ground pork in a wok and add chili flakes to make it spicy. In a separate wok, fry some garlic and sliced cucumbers. Pour the ground pork in with the garlic and cucumber and stir until they're all mixed together. Serve over rice."
        },
        {
          "headline":"Prepare a tasty sour cream sauce to dip fried cucumber strips in.",
          "description":"To make the sauce, mix 1 cup (0.24 liters) of sour cream, 2 mashed cloves of garlic, ¼ yellow onion, and 2 tablespoons (29.6 mL) of milk. Add lemon juice, chives, parsley, tarragon, salt, and pepper to taste. Store the sauce in the fridge until you're ready to serve it."
        },
        {
          "headline":"Make baked cucumber salt and vinegar strips.",
          "description":"Before you bake the cucumber strips in the oven, toss them in a bowl with olive oil, vinegar, and salt. Bake the cucumber strips at 175 degrees Fahrenheit (79C) for three to four hours."
        },
        {
          "headline":"Add whipping cream to baked cucumbers to make creamed cucumbers.",
          "description":"Boil 1 cup (0.24 liters) of whipping cream. Pour the boiled whipping cream over the baked cucumbers. Season with salt, pepper, and parsley."
        }
      ]
    }
  ],
  "text":" Baking a Cucumber Use a knife to cut a cucumber in half lengthwise. Cut the cucumber on a cutting board so you don’t damage the surface underneath. You should have two long halves with all of the cucumber’s seeds exposed when you’re finished. Use a spoon to seed the two halves of the cucumber. Starting with one half of the cucumber, scoop out all of the flesh and seeds with the spoon until the center of that half is completely carved out. Repeat on the other half of the cucumber. Don't worry about this step if you're baking a seedless cucumber. Cut the cucumber halves into lengthwise strips using the knife. You want each strip to be about ⅜ inch (0.95 cm) wide. Once you’ve cut all of the strips, use the knife to cut each strip down so it’s 2 inches (5.1 cm) long. Put the strips in a large bowl with 1 ½ teaspoons (7.4 mL) of salt. Toss the cucumbers and salt with a spoon. The salt will prevent the cucumbers from being too watery. Set the cucumbers aside for 30 minutes. You can add 2 tablespoons (29.6 mL) of wine vinegar and a ⅛ teaspoon (0.6 mL) of sugar to the bowl of cucumber strips to give them extra flavor. Put the cucumber strips in a colander and rinse them under cold water. Let the colander drain completely. Use a paper towel to pat dry each of the cucumber strips. Spread out the cucumber strips in a baking dish and season them. You can also add other vegetables, like scallions, to the dish to bake in the oven with the cucumbers. Bake the strips in the oven at 375 degrees (190C) for one hour. Leave the baking dish uncovered and stir the cucumber strips every 20 minutes. After an hour, use an oven mitt to remove the baking dish. Transfer the cucumber strips to a plate using a spatula. Frying a Cucumber Cut a cucumber in half lengthwise using a knife. Do it over a cutting board to protect your counter or table from scratches. Scoop out the seeds from both halves of the cucumber with a spoon. Run the spoon from one end of the cucumber to the other, scooping up all the seeds and everything in the center of the cucumber along the way. When you’re finished, you should have two carved out halves of the cucumber. If you’re cooking with a seedless cucumber, you can skip this step. Cut the cucumber halves crosswise into ¼ inch (0.64 cm) slices. Make sure the slices aren’t any thinner or they may wilt when you fry them. Each cucumber slice should look like a tiny letter \"C.\" Mix the slices with 1 ½ teaspoons (7.4 mL) of salt in a large bowl. Stir the cucumber slices and salt with a spoon for one minute, or until the slices are thoroughly coated with the salt. Set the bowl of cucumber slices aside for 30 minutes. During this time the salt will draw out excess water from inside the cucumber slices, improving their texture and making them less watery. Rinse the slices under cold water in a colander and let them dry. While the water drains from the colander, blot the surface of the cucumber slices with a paper towel to dry them off. You don't want a lot of excess water when you fry them. Add 1 tablespoon (14.8 mL) of cooking oil to a skillet. Heat the skillet over high heat on a stovetop. Wait for the cooking oil to start lightly smoking. Pour the cucumber slices into the skillet. Use a spoon to stir the cucumber slices continuously in the skillet for around three to four minutes. You’ll know the cucumber slices are finished frying when they have a glossy appearance. When they’re done, transfer them to a plate and turn off the stovetop. Trying Different Cucumber Recipes Mix in fried cucumbers with garlic and spicy pork for a good stir-fry. Cook ground pork in a wok and add chili flakes to make it spicy. In a separate wok, fry some garlic and sliced cucumbers. Pour the ground pork in with the garlic and cucumber and stir until they're all mixed together. Serve over rice. Prepare a tasty sour cream sauce to dip fried cucumber strips in. To make the sauce, mix 1 cup (0.24 liters) of sour cream, 2 mashed cloves of garlic, ¼ yellow onion, and 2 tablespoons (29.6 mL) of milk. Add lemon juice, chives, parsley, tarragon, salt, and pepper to taste. Store the sauce in the fridge until you're ready to serve it. Make baked cucumber salt and vinegar strips. Before you bake the cucumber strips in the oven, toss them in a bowl with olive oil, vinegar, and salt. Bake the cucumber strips at 175 degrees Fahrenheit (79C) for three to four hours. Add whipping cream to baked cucumbers to make creamed cucumbers. Boil 1 cup (0.24 liters) of whipping cream. Pour the boiled whipping cream over the baked cucumbers. Season with salt, pepper, and parsley.",
  "sentences":[
    " Baking a Cucumber Use a knife to cut a cucumber in half lengthwise.",
    "Cut the cucumber on a cutting board so you don’t damage the surface underneath.",
    "You should have two long halves with all of the cucumber’s seeds exposed when you’re finished.",
    "Use a spoon to seed the two halves of the cucumber.",
    "Starting with one half of the cucumber, scoop out all of the flesh and seeds with the spoon until the center of that half is completely carved out.",
    "Repeat on the other half of the cucumber.",
    "Don't worry about this step if you're baking a seedless cucumber.",
    "Cut the cucumber halves into lengthwise strips using the knife.",
    "You want each strip to be about ⅜ inch (0.95 cm) wide.",
    "Once you’ve cut all of the strips, use the knife to cut each strip down so it’s 2 inches (5.1 cm) long.",
    "Put the strips in a large bowl with 1 ½ teaspoons (7.4 mL) of salt.",
    "Toss the cucumbers and salt with a spoon.",
    "The salt will prevent the cucumbers from being too watery.",
    "Set the cucumbers aside for 30 minutes.",
    "You can add 2 tablespoons (29.6 mL) of wine vinegar and a ⅛ teaspoon (0.6 mL) of sugar to the bowl of cucumber strips to give them extra flavor.",
    "Put the cucumber strips in a colander and rinse them under cold water.",
    "Let the colander drain completely.",
    "Use a paper towel to pat dry each of the cucumber strips.",
    "Spread out the cucumber strips in a baking dish and season them.",
    "You can also add other vegetables, like scallions, to the dish to bake in the oven with the cucumbers.",
    "Bake the strips in the oven at 375 degrees (190C) for one hour.",
    "Leave the baking dish uncovered and stir the cucumber strips every 20 minutes.",
    "After an hour, use an oven mitt to remove the baking dish.",
    "Transfer the cucumber strips to a plate using a spatula.",
    "Frying a Cucumber Cut a cucumber in half lengthwise using a knife.",
    "Do it over a cutting board to protect your counter or table from scratches.",
    "Scoop out the seeds from both halves of the cucumber with a spoon.",
    "Run the spoon from one end of the cucumber to the other, scooping up all the seeds and everything in the center of the cucumber along the way.",
    "When you’re finished, you should have two carved out halves of the cucumber.",
    "If you’re cooking with a seedless cucumber, you can skip this step.",
    "Cut the cucumber halves crosswise into ¼ inch (0.64 cm) slices.",
    "Make sure the slices aren’t any thinner or they may wilt when you fry them.",
    "Each cucumber slice should look like a tiny letter \"C.\" Mix the slices with 1 ½ teaspoons (7.4 mL) of salt in a large bowl.",
    "Stir the cucumber slices and salt with a spoon for one minute, or until the slices are thoroughly coated with the salt.",
    "Set the bowl of cucumber slices aside for 30 minutes.",
    "During this time the salt will draw out excess water from inside the cucumber slices, improving their texture and making them less watery.",
    "Rinse the slices under cold water in a colander and let them dry.",
    "While the water drains from the colander, blot the surface of the cucumber slices with a paper towel to dry them off.",
    "You don't want a lot of excess water when you fry them.",
    "Add 1 tablespoon (14.8 mL) of cooking oil to a skillet.",
    "Heat the skillet over high heat on a stovetop.",
    "Wait for the cooking oil to start lightly smoking.",
    "Pour the cucumber slices into the skillet.",
    "Use a spoon to stir the cucumber slices continuously in the skillet for around three to four minutes.",
    "You’ll know the cucumber slices are finished frying when they have a glossy appearance.",
    "When they’re done, transfer them to a plate and turn off the stovetop.",
    "Trying Different Cucumber Recipes Mix in fried cucumbers with garlic and spicy pork for a good stir-fry.",
    "Cook ground pork in a wok and add chili flakes to make it spicy.",
    "In a separate wok, fry some garlic and sliced cucumbers.",
    "Pour the ground pork in with the garlic and cucumber and stir until they're all mixed together.",
    "Serve over rice.",
    "Prepare a tasty sour cream sauce to dip fried cucumber strips in.",
    "To make the sauce, mix 1 cup (0.24 liters) of sour cream, 2 mashed cloves of garlic, ¼ yellow onion, and 2 tablespoons (29.6 mL) of milk.",
    "Add lemon juice, chives, parsley, tarragon, salt, and pepper to taste.",
    "Store the sauce in the fridge until you're ready to serve it.",
    "Make baked cucumber salt and vinegar strips.",
    "Before you bake the cucumber strips in the oven, toss them in a bowl with olive oil, vinegar, and salt.",
    "Bake the cucumber strips at 175 degrees Fahrenheit (79C) for three to four hours.",
    "Add whipping cream to baked cucumbers to make creamed cucumbers.",
    "Boil 1 cup (0.24 liters) of whipping cream.",
    "Pour the boiled whipping cream over the baked cucumbers.",
    "Season with salt, pepper, and parsley."
  ],
  "tyn_section":[
    "Cucumber",
    "Sharp knife",
    "Cutting board",
    "Spoon",
    "Large bowl",
    "Salt",
    "Colander",
    "Baking dish",
    "Cooking oil"
  ],
  "tyn_model":[
    "cucumber",
    "salt",
    "spoon",
    "cucumbers",
    "knife",
    "colander",
    "skillet",
    "garlic",
    "bowl",
    "water",
    "baking dish",
    "pork",
    "whipping cream",
    "large bowl",
    "oven",
    "plate",
    "cooking oil",
    "wok",
    "sour cream",
    "parsley",
    "pepper",
    "vinegar",
    "cutting board",
    "⅜ inch",
    "wine vinegar",
    "⅛ teaspoon",
    "sugar",
    "scallions",
    "oven mitt",
    "spatula",
    "paper towel",
    "stovetop",
    "chili flakes",
    "rice",
    "yellow onion",
    "milk",
    "lemon",
    "chives",
    "tarragon",
    "baked cucumber salt",
    "olive oil"
  ],
  "simple_metrics":{
    "r":0.8888888889,
    "p":0.1951219512,
    "f1":0.32,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.243902439,
    "f1":0.3921568627
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.2926829268,
    "f1":0.4528301887
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8888888889,
    "p":0.1951219512,
    "f1":0.32
  }
}