{
  "title":"How to Make Rice Vinegar",
  "url":"https://www.wikihow.com/Make-Rice-Vinegar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes"
  ],
  "parts":[
    {
      "name":"Combining the Rice, Starter, and Water",
      "steps":[
        {
          "headline":"Transfer the rice and any cooking water to an airtight container.",
          "description":"To make the rice vinegar, you’ll need 2 cups (500 g) of cooked white rice. Place the rice, along with any leftover cooking water, in an airtight glass or stoneware bottle or jar. If you use a glass jar or bottle, opt for a dark style because it will allow for better fermentation."
        },
        {
          "headline":"Add the starter to the rice.",
          "description":"To make vinegar, you need a culture referred to as Mother Vinegar. If you have homemade rice vinegar that hasn’t been filtered, you can scoop the Mother off the top and add 1 to 2 fluid ounces (30 to 59 ml) of it to the rice. If you don’t have Mother Vinegar, add the same amount of rice wine to the rice instead. Making the vinegar with wine takes longer, but the process is still effective. You can purchase Mother Vinegar from a variety of online retailers. Shaoxing rice wine is a good option for making rice wine vinegar. You can usually find it at Asian markets."
        },
        {
          "headline":"Top the container off with the water.",
          "description":"After you’ve added the rice and starter to your container, pour approximately 34 fluid ounces (1 l) of filtered or bottled water into the container. Don’t use tap water, which may contain bacteria or other impurities that affect the fermentation process."
        }
      ]
    },
    {
      "name":"Fermenting the Vinegar",
      "steps":[
        {
          "headline":"Cover the container with cheesecloth.",
          "description":"For the vinegar to ferment properly, it needs air. However, you don’t want dust, dirt, or insects to get into the mixture. Set two to three pieces of cheesecloth over the mouth of the container and secure them in place with a rubber band."
        },
        {
          "headline":"Place the mixture in a dark, warm place.",
          "description":"Fermentation happens more quickly in warmer temperatures, so ideally, you should place the container in a space with a temperature between 60 and 80°F (15 to 27°C). Make sure that it’s dark as well because fermentation requires darkness to occur. A basement or pantry shelf is a good spot to ferment the vinegar."
        },
        {
          "headline":"Check on the mixture in three weeks.",
          "description":"The time that it takes for the vinegar to fully ferment depends on the temperature, the starting material, and how much bacteria is present. It can take anywhere from 3 weeks to 6 months. After you’ve left the mixture alone for 3 weeks, open the container and smell it. If it smells like vinegar, taste it to check for the right flavor. If it hasn’t turned to vinegar yet, recover the container and let it set again. It’s normal for the vinegar to have strange odors during the fermentation process. The smell you should be looking for is the sharp, acidic scent of store-bought vinegar. The flavor should be sour, tart, and acidic like store-bought vinegar. It shouldn't taste like alcohol."
        },
        {
          "headline":"Continue to test the mixture until it turns to vinegar.",
          "description":"Depending on the smell and taste of the mixture when you initially test it, you may want to check on it weekly or monthly. When it has the scent and taste of vinegar, you’ll know that it’s ready. You can't really ferment the vinegar too long. Its taste will change the longer that you allow it to ferment, so it's really a matter of personal taste when to stop. If you don't want a sharply acidic vinegar, you may want to allow it to ferment a little longer."
        }
      ]
    },
    {
      "name":"Straining the Vinegar",
      "steps":[
        {
          "headline":"Filter the mixture through cheesecloth.",
          "description":"Once the vinegar has finished fermenting, remove the cheesecloth covering. Place the cheesecloth over the mouth of another clean container and pour the vinegar through it slowly to filter out the rice and any other solid bits. You may find it easier to place the cheesecloth over a funnel to pour the vinegar through so you avoid spills. If you want to make additional vinegar, you should save the slimy film on the cheesecloth after you filter it. This is the Mother Vinegar, and will allow you to make vinegar more quickly in the future. Store it in a stone or dark glass bottle with cheesecloth over the opening, so it's covered but it still receives the air it needs to live. Keep it in a location with a temperature between 60 and 80°F (15 to 27°C)."
        },
        {
          "headline":"Store the vinegar in the fridge for a couple of hours.",
          "description":"The vinegar will be cloudy while it’s still warm, so it helps to cool it down. Cover the container with cheesecloth again, and chill it in the refrigerator for 1 to 2 hours."
        },
        {
          "headline":"Use cheesecloth to filter the vinegar again.",
          "description":"After the vinegar has cooled and become clearer, take it out of the fridge. Place fresh cheesecloth over the mouth of another clean, airtight container and pour the vinegar through it to filter it again. Once it’s filtered, it’s ready for use in any recipe. Fresh vinegar should be stored in the fridge. It will keep for 3 to 4 months. If you want the vinegar to last longer and to be able to store it at room temperature, you should pasteurize it. Bring the vinegar to a temperature of 170°F (77°C) in a pan, and allow it to maintain the temperature for 10 minutes. It’s usually easiest to do it in a slow cooker set on low for 1 to 2 hours. Pasteurized vinegar will last for years, if not indefinitely."
        }
      ]
    }
  ],
  "text":" Combining the Rice, Starter, and Water Transfer the rice and any cooking water to an airtight container. To make the rice vinegar, you’ll need 2 cups (500 g) of cooked white rice. Place the rice, along with any leftover cooking water, in an airtight glass or stoneware bottle or jar. If you use a glass jar or bottle, opt for a dark style because it will allow for better fermentation. Add the starter to the rice. To make vinegar, you need a culture referred to as Mother Vinegar. If you have homemade rice vinegar that hasn’t been filtered, you can scoop the Mother off the top and add 1 to 2 fluid ounces (30 to 59 ml) of it to the rice. If you don’t have Mother Vinegar, add the same amount of rice wine to the rice instead. Making the vinegar with wine takes longer, but the process is still effective. You can purchase Mother Vinegar from a variety of online retailers. Shaoxing rice wine is a good option for making rice wine vinegar. You can usually find it at Asian markets. Top the container off with the water. After you’ve added the rice and starter to your container, pour approximately 34 fluid ounces (1 l) of filtered or bottled water into the container. Don’t use tap water, which may contain bacteria or other impurities that affect the fermentation process. Fermenting the Vinegar Cover the container with cheesecloth. For the vinegar to ferment properly, it needs air. However, you don’t want dust, dirt, or insects to get into the mixture. Set two to three pieces of cheesecloth over the mouth of the container and secure them in place with a rubber band. Place the mixture in a dark, warm place. Fermentation happens more quickly in warmer temperatures, so ideally, you should place the container in a space with a temperature between 60 and 80°F (15 to 27°C). Make sure that it’s dark as well because fermentation requires darkness to occur. A basement or pantry shelf is a good spot to ferment the vinegar. Check on the mixture in three weeks. The time that it takes for the vinegar to fully ferment depends on the temperature, the starting material, and how much bacteria is present. It can take anywhere from 3 weeks to 6 months. After you’ve left the mixture alone for 3 weeks, open the container and smell it. If it smells like vinegar, taste it to check for the right flavor. If it hasn’t turned to vinegar yet, recover the container and let it set again. It’s normal for the vinegar to have strange odors during the fermentation process. The smell you should be looking for is the sharp, acidic scent of store-bought vinegar. The flavor should be sour, tart, and acidic like store-bought vinegar. It shouldn't taste like alcohol. Continue to test the mixture until it turns to vinegar. Depending on the smell and taste of the mixture when you initially test it, you may want to check on it weekly or monthly. When it has the scent and taste of vinegar, you’ll know that it’s ready. You can't really ferment the vinegar too long. Its taste will change the longer that you allow it to ferment, so it's really a matter of personal taste when to stop. If you don't want a sharply acidic vinegar, you may want to allow it to ferment a little longer. Straining the Vinegar Filter the mixture through cheesecloth. Once the vinegar has finished fermenting, remove the cheesecloth covering. Place the cheesecloth over the mouth of another clean container and pour the vinegar through it slowly to filter out the rice and any other solid bits. You may find it easier to place the cheesecloth over a funnel to pour the vinegar through so you avoid spills. If you want to make additional vinegar, you should save the slimy film on the cheesecloth after you filter it. This is the Mother Vinegar, and will allow you to make vinegar more quickly in the future. Store it in a stone or dark glass bottle with cheesecloth over the opening, so it's covered but it still receives the air it needs to live. Keep it in a location with a temperature between 60 and 80°F (15 to 27°C). Store the vinegar in the fridge for a couple of hours. The vinegar will be cloudy while it’s still warm, so it helps to cool it down. Cover the container with cheesecloth again, and chill it in the refrigerator for 1 to 2 hours. Use cheesecloth to filter the vinegar again. After the vinegar has cooled and become clearer, take it out of the fridge. Place fresh cheesecloth over the mouth of another clean, airtight container and pour the vinegar through it to filter it again. Once it’s filtered, it’s ready for use in any recipe. Fresh vinegar should be stored in the fridge. It will keep for 3 to 4 months. If you want the vinegar to last longer and to be able to store it at room temperature, you should pasteurize it. Bring the vinegar to a temperature of 170°F (77°C) in a pan, and allow it to maintain the temperature for 10 minutes. It’s usually easiest to do it in a slow cooker set on low for 1 to 2 hours. Pasteurized vinegar will last for years, if not indefinitely.",
  "sentences":[
    " Combining the Rice, Starter, and Water Transfer the rice and any cooking water to an airtight container.",
    "To make the rice vinegar, you’ll need 2 cups (500 g) of cooked white rice.",
    "Place the rice, along with any leftover cooking water, in an airtight glass or stoneware bottle or jar.",
    "If you use a glass jar or bottle, opt for a dark style because it will allow for better fermentation.",
    "Add the starter to the rice.",
    "To make vinegar, you need a culture referred to as Mother Vinegar.",
    "If you have homemade rice vinegar that hasn’t been filtered, you can scoop the Mother off the top and add 1 to 2 fluid ounces (30 to 59 ml) of it to the rice.",
    "If you don’t have Mother Vinegar, add the same amount of rice wine to the rice instead.",
    "Making the vinegar with wine takes longer, but the process is still effective.",
    "You can purchase Mother Vinegar from a variety of online retailers.",
    "Shaoxing rice wine is a good option for making rice wine vinegar.",
    "You can usually find it at Asian markets.",
    "Top the container off with the water.",
    "After you’ve added the rice and starter to your container, pour approximately 34 fluid ounces (1 l) of filtered or bottled water into the container.",
    "Don’t use tap water, which may contain bacteria or other impurities that affect the fermentation process.",
    "Fermenting the Vinegar Cover the container with cheesecloth.",
    "For the vinegar to ferment properly, it needs air.",
    "However, you don’t want dust, dirt, or insects to get into the mixture.",
    "Set two to three pieces of cheesecloth over the mouth of the container and secure them in place with a rubber band.",
    "Place the mixture in a dark, warm place.",
    "Fermentation happens more quickly in warmer temperatures, so ideally, you should place the container in a space with a temperature between 60 and 80°F (15 to 27°C).",
    "Make sure that it’s dark as well because fermentation requires darkness to occur.",
    "A basement or pantry shelf is a good spot to ferment the vinegar.",
    "Check on the mixture in three weeks.",
    "The time that it takes for the vinegar to fully ferment depends on the temperature, the starting material, and how much bacteria is present.",
    "It can take anywhere from 3 weeks to 6 months.",
    "After you’ve left the mixture alone for 3 weeks, open the container and smell it.",
    "If it smells like vinegar, taste it to check for the right flavor.",
    "If it hasn’t turned to vinegar yet, recover the container and let it set again.",
    "It’s normal for the vinegar to have strange odors during the fermentation process.",
    "The smell you should be looking for is the sharp, acidic scent of store-bought vinegar.",
    "The flavor should be sour, tart, and acidic like store-bought vinegar.",
    "It shouldn't taste like alcohol.",
    "Continue to test the mixture until it turns to vinegar.",
    "Depending on the smell and taste of the mixture when you initially test it, you may want to check on it weekly or monthly.",
    "When it has the scent and taste of vinegar, you’ll know that it’s ready.",
    "You can't really ferment the vinegar too long.",
    "Its taste will change the longer that you allow it to ferment, so it's really a matter of personal taste when to stop.",
    "If you don't want a sharply acidic vinegar, you may want to allow it to ferment a little longer.",
    "Straining the Vinegar Filter the mixture through cheesecloth.",
    "Once the vinegar has finished fermenting, remove the cheesecloth covering.",
    "Place the cheesecloth over the mouth of another clean container and pour the vinegar through it slowly to filter out the rice and any other solid bits.",
    "You may find it easier to place the cheesecloth over a funnel to pour the vinegar through so you avoid spills.",
    "If you want to make additional vinegar, you should save the slimy film on the cheesecloth after you filter it.",
    "This is the Mother Vinegar, and will allow you to make vinegar more quickly in the future.",
    "Store it in a stone or dark glass bottle with cheesecloth over the opening, so it's covered but it still receives the air it needs to live.",
    "Keep it in a location with a temperature between 60 and 80°F (15 to 27°C).",
    "Store the vinegar in the fridge for a couple of hours.",
    "The vinegar will be cloudy while it’s still warm, so it helps to cool it down.",
    "Cover the container with cheesecloth again, and chill it in the refrigerator for 1 to 2 hours.",
    "Use cheesecloth to filter the vinegar again.",
    "After the vinegar has cooled and become clearer, take it out of the fridge.",
    "Place fresh cheesecloth over the mouth of another clean, airtight container and pour the vinegar through it to filter it again.",
    "Once it’s filtered, it’s ready for use in any recipe.",
    "Fresh vinegar should be stored in the fridge.",
    "It will keep for 3 to 4 months.",
    "If you want the vinegar to last longer and to be able to store it at room temperature, you should pasteurize it.",
    "Bring the vinegar to a temperature of 170°F (77°C) in a pan, and allow it to maintain the temperature for 10 minutes.",
    "It’s usually easiest to do it in a slow cooker set on low for 1 to 2 hours.",
    "Pasteurized vinegar will last for years, if not indefinitely."
  ],
  "tyn_section":[
    "Glass or stoneware jar or bottle",
    "Several pieces of cheesecloth",
    "Rubberband"
  ],
  "tyn_model":[
    "vinegar",
    "cheesecloth",
    "rice",
    "water",
    "container",
    "cooking water",
    "airtight container",
    "rice vinegar",
    "rice wine",
    "fridge",
    "white rice",
    "airtight glass or stoneware bottle",
    "starter",
    "mother vinegar",
    "wine",
    "rice wine vinegar",
    "filtered or bottled water",
    "rubber band",
    "funnel",
    "refrigerator",
    "pan",
    "slow cooker",
    "pasteurized vinegar"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0434782609,
    "f1":0.0769230769
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.0434782609,
    "f1":0.0769230769
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.0434782609,
    "f1":0.0769230769
  }
}