{
  "title":"How to Make Slime with Borax",
  "url":"https://www.wikihow.com/Make-Slime-with-Borax",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids",
    "Putty Dough and Slime"
  ],
  "methods":[
    {
      "name":"Making Normal Slime",
      "steps":[
        {
          "headline":"Make the borax solution.",
          "description":"Add 1 teaspoon (4.9 ml) of borax powder into 1 cup (240 ml) of hot water, and stir until the water is fully clear. Set aside for later use."
        },
        {
          "headline":"Pour 4 ounces (110 g) of glue into a bowl.",
          "description":""
        },
        {
          "headline":"Add food coloring, if you want.",
          "description":"If you want your slime to be colorful, take a food coloring of your choice and add it into the glue, then mix well so it blends thoroughly. Start off by just adding a drop or two of food coloring - adding too much food coloring can result in your slime staining things."
        },
        {
          "headline":"Begin adding the borax solution into the glue.",
          "description":"Don't add it all at once - your slime will harden if you do that! Just add a few teaspoons of the borax solution into the glue at a time, and then mix your slime. It should begin to clump and stick together. You probably won't use all your borax solution, so don't be surprised if you have a fair amount left over."
        },
        {
          "headline":"Knead the slime with your hands.",
          "description":"Once your slime has clumped up and has begin to pull away from the bowl, take it out and knead it with your hands. This will help make it less sticky. If your slime is still too sticky, add about a teaspoon of the borax solution and stir or knead it in. Try not to get too much on your hands."
        },
        {
          "headline":"Play with your slime!",
          "description":"Once your slime has reached the consistency you want, you're free to play with it and stretch it. When you're finished, store it in an airtight container."
        }
      ]
    },
    {
      "name":"Making Fluffy Slime",
      "steps":[
        {
          "headline":"Make the borax solution.",
          "description":"Add 1 teaspoon (4.9 ml) of borax powder into 1 cup (240 ml) of hot water, and stir until the water is fully clear. Set aside for later use."
        },
        {
          "headline":"Pour 4 ounces (110 g) of glue into a bowl.",
          "description":""
        },
        {
          "headline":"Add in ⁄2 cup (120 ml) of shaving cream.",
          "description":"Mix the glue and the shaving cream together. The resulting texture should be fluffy, thick, and soft."
        },
        {
          "headline":"Put in a few drops of food coloring, if you want.",
          "description":"If you want colorful fluffy slime, pick out a food coloring of your choice and add a few drops to the glue and shaving cream mixture, then mix it until there are no more white streaks. Start off with just a drop or two of food coloring - adding too much can result in your slime staining things."
        },
        {
          "headline":"Begin adding the borax solution.",
          "description":"Be careful not to add it all at once, since that will make your slime harden. Instead, add it a few teaspoons at a time, and stir. The slime should begin to clump up and pull away from the bowl. It's unlikely that you'll use all of your borax solution, so don't be surprised if you have a fair amount left over."
        },
        {
          "headline":"Knead the slime with your hands.",
          "description":"Once your slime has clumped into a solid form, take it out of the bowl and begin to knead it with your hands, to make it less sticky. If your slime is too sticky to knead, add in a bit more of the borax solution and knead it in. Be careful not to get too much on your hands."
        },
        {
          "headline":"Play with your slime!",
          "description":"Once your slime has reached the right consistency, you'll have a fluffy, soft slime that you can twist, stretch, and squeeze as much as you want. Keep it in an airtight container when finished."
        }
      ]
    },
    {
      "name":"Making Clear Slime",
      "steps":[
        {
          "headline":"Make the borax solution.",
          "description":"Add 1 teaspoon (4.9 ml) of borax powder into 1 cup (240 ml) of hot water, and stir until the water is fully clear. Set aside for later use."
        },
        {
          "headline":"Add 4 ounces (110 g) of clear glue into a bowl.",
          "description":""
        },
        {
          "headline":"Begin adding the borax solution.",
          "description":"Avoid adding it all at once - your slime will harden that way! Instead, carefully add 1 teaspoon (4.9 ml) at a time of the borax solution, and stir it in slowly so that it doesn't form bubbles. You should see the glue begin to clump and pull away from the bowl. You're probably not going to use all of your borax solution, so don't be surprised if you have a fair amount left over."
        },
        {
          "headline":"Knead the slime with your hands.",
          "description":"Once your slime has fully clumped together, pull it out of the bowl with your hands and begin to knead it. This will get rid of any residual stickiness. If your slime is still too sticky, add in a little bit more borax solution and then knead it in, being careful not to get it on your hands."
        },
        {
          "headline":"Allow your slime to sit.",
          "description":"Chances are, while kneading your clear slime, it became white and hard to see through. Letting it sit in an airtight container for a few days will allow it to become clear again."
        },
        {
          "headline":"Play with your slime!",
          "description":"Once your slime has cleared up, stretch it, poke it, and play with it as you see fit. Store it in an airtight container when finished."
        }
      ]
    }
  ],
  "text":" Making Normal Slime Make the borax solution. Add 1 teaspoon (4.9 ml) of borax powder into 1 cup (240 ml) of hot water, and stir until the water is fully clear. Set aside for later use. Pour 4 ounces (110 g) of glue into a bowl.  Add food coloring, if you want. If you want your slime to be colorful, take a food coloring of your choice and add it into the glue, then mix well so it blends thoroughly. Start off by just adding a drop or two of food coloring - adding too much food coloring can result in your slime staining things. Begin adding the borax solution into the glue. Don't add it all at once - your slime will harden if you do that! Just add a few teaspoons of the borax solution into the glue at a time, and then mix your slime. It should begin to clump and stick together. You probably won't use all your borax solution, so don't be surprised if you have a fair amount left over. Knead the slime with your hands. Once your slime has clumped up and has begin to pull away from the bowl, take it out and knead it with your hands. This will help make it less sticky. If your slime is still too sticky, add about a teaspoon of the borax solution and stir or knead it in. Try not to get too much on your hands. Play with your slime! Once your slime has reached the consistency you want, you're free to play with it and stretch it. When you're finished, store it in an airtight container. Making Fluffy Slime Make the borax solution. Add 1 teaspoon (4.9 ml) of borax powder into 1 cup (240 ml) of hot water, and stir until the water is fully clear. Set aside for later use. Pour 4 ounces (110 g) of glue into a bowl.  Add in ⁄2 cup (120 ml) of shaving cream. Mix the glue and the shaving cream together. The resulting texture should be fluffy, thick, and soft. Put in a few drops of food coloring, if you want. If you want colorful fluffy slime, pick out a food coloring of your choice and add a few drops to the glue and shaving cream mixture, then mix it until there are no more white streaks. Start off with just a drop or two of food coloring - adding too much can result in your slime staining things. Begin adding the borax solution. Be careful not to add it all at once, since that will make your slime harden. Instead, add it a few teaspoons at a time, and stir. The slime should begin to clump up and pull away from the bowl. It's unlikely that you'll use all of your borax solution, so don't be surprised if you have a fair amount left over. Knead the slime with your hands. Once your slime has clumped into a solid form, take it out of the bowl and begin to knead it with your hands, to make it less sticky. If your slime is too sticky to knead, add in a bit more of the borax solution and knead it in. Be careful not to get too much on your hands. Play with your slime! Once your slime has reached the right consistency, you'll have a fluffy, soft slime that you can twist, stretch, and squeeze as much as you want. Keep it in an airtight container when finished. Making Clear Slime Make the borax solution. Add 1 teaspoon (4.9 ml) of borax powder into 1 cup (240 ml) of hot water, and stir until the water is fully clear. Set aside for later use. Add 4 ounces (110 g) of clear glue into a bowl.  Begin adding the borax solution. Avoid adding it all at once - your slime will harden that way! Instead, carefully add 1 teaspoon (4.9 ml) at a time of the borax solution, and stir it in slowly so that it doesn't form bubbles. You should see the glue begin to clump and pull away from the bowl. You're probably not going to use all of your borax solution, so don't be surprised if you have a fair amount left over. Knead the slime with your hands. Once your slime has fully clumped together, pull it out of the bowl with your hands and begin to knead it. This will get rid of any residual stickiness. If your slime is still too sticky, add in a little bit more borax solution and then knead it in, being careful not to get it on your hands. Allow your slime to sit. Chances are, while kneading your clear slime, it became white and hard to see through. Letting it sit in an airtight container for a few days will allow it to become clear again. Play with your slime! Once your slime has cleared up, stretch it, poke it, and play with it as you see fit. Store it in an airtight container when finished.",
  "sentences":[
    " Making Normal Slime Make the borax solution.",
    "Add 1 teaspoon (4.9 ml) of borax powder into 1 cup (240 ml) of hot water, and stir until the water is fully clear.",
    "Set aside for later use.",
    "Pour 4 ounces (110 g) of glue into a bowl.",
    "Add food coloring, if you want.",
    "If you want your slime to be colorful, take a food coloring of your choice and add it into the glue, then mix well so it blends thoroughly.",
    "Start off by just adding a drop or two of food coloring - adding too much food coloring can result in your slime staining things.",
    "Begin adding the borax solution into the glue.",
    "Don't add it all at once - your slime will harden if you do that!",
    "Just add a few teaspoons of the borax solution into the glue at a time, and then mix your slime.",
    "It should begin to clump and stick together.",
    "You probably won't use all your borax solution, so don't be surprised if you have a fair amount left over.",
    "Knead the slime with your hands.",
    "Once your slime has clumped up and has begin to pull away from the bowl, take it out and knead it with your hands.",
    "This will help make it less sticky.",
    "If your slime is still too sticky, add about a teaspoon of the borax solution and stir or knead it in.",
    "Try not to get too much on your hands.",
    "Play with your slime!",
    "Once your slime has reached the consistency you want, you're free to play with it and stretch it.",
    "When you're finished, store it in an airtight container.",
    "Making Fluffy Slime Make the borax solution.",
    "Add 1 teaspoon (4.9 ml) of borax powder into 1 cup (240 ml) of hot water, and stir until the water is fully clear.",
    "Set aside for later use.",
    "Pour 4 ounces (110 g) of glue into a bowl.",
    "Add in ⁄2 cup (120 ml) of shaving cream.",
    "Mix the glue and the shaving cream together.",
    "The resulting texture should be fluffy, thick, and soft.",
    "Put in a few drops of food coloring, if you want.",
    "If you want colorful fluffy slime, pick out a food coloring of your choice and add a few drops to the glue and shaving cream mixture, then mix it until there are no more white streaks.",
    "Start off with just a drop or two of food coloring - adding too much can result in your slime staining things.",
    "Begin adding the borax solution.",
    "Be careful not to add it all at once, since that will make your slime harden.",
    "Instead, add it a few teaspoons at a time, and stir.",
    "The slime should begin to clump up and pull away from the bowl.",
    "It's unlikely that you'll use all of your borax solution, so don't be surprised if you have a fair amount left over.",
    "Knead the slime with your hands.",
    "Once your slime has clumped into a solid form, take it out of the bowl and begin to knead it with your hands, to make it less sticky.",
    "If your slime is too sticky to knead, add in a bit more of the borax solution and knead it in.",
    "Be careful not to get too much on your hands.",
    "Play with your slime!",
    "Once your slime has reached the right consistency, you'll have a fluffy, soft slime that you can twist, stretch, and squeeze as much as you want.",
    "Keep it in an airtight container when finished.",
    "Making Clear Slime Make the borax solution.",
    "Add 1 teaspoon (4.9 ml) of borax powder into 1 cup (240 ml) of hot water, and stir until the water is fully clear.",
    "Set aside for later use.",
    "Add 4 ounces (110 g) of clear glue into a bowl.",
    "Begin adding the borax solution.",
    "Avoid adding it all at once - your slime will harden that way!",
    "Instead, carefully add 1 teaspoon (4.9 ml) at a time of the borax solution, and stir it in slowly so that it doesn't form bubbles.",
    "You should see the glue begin to clump and pull away from the bowl.",
    "You're probably not going to use all of your borax solution, so don't be surprised if you have a fair amount left over.",
    "Knead the slime with your hands.",
    "Once your slime has fully clumped together, pull it out of the bowl with your hands and begin to knead it.",
    "This will get rid of any residual stickiness.",
    "If your slime is still too sticky, add in a little bit more borax solution and then knead it in, being careful not to get it on your hands.",
    "Allow your slime to sit.",
    "Chances are, while kneading your clear slime, it became white and hard to see through.",
    "Letting it sit in an airtight container for a few days will allow it to become clear again.",
    "Play with your slime!",
    "Once your slime has cleared up, stretch it, poke it, and play with it as you see fit.",
    "Store it in an airtight container when finished."
  ],
  "tyn_section":[
    "Bowls",
    "Stirring stick or spoon",
    "Measuring materials"
  ],
  "tyn_model":[
    "borax",
    "glue",
    "bowl",
    "food coloring",
    "borax solution",
    "airtight container",
    "borax powder",
    "hot water",
    "water",
    "shaving cream",
    "clear glue"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}