{
  "title":"How to Grey Wash Wood",
  "url":"https://www.wikihow.com/Grey-Wash-Wood",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Washing with Paint and Water",
      "steps":[
        {
          "headline":"Lay down a tarp or dropcloth.",
          "description":"Choose a well-ventilated area to work in, and set down something to protect your floor. Newspaper is fine if the object is fairly small, but a tarp or large dropcloth will work better if it's a piece of furniture."
        },
        {
          "headline":"Sand the wood to remove paint and imperfections.",
          "description":"Use a coarse sandpaper all over the surface of the wood you plan to apply the wash to. Any prior paint needs to be removed completely. Sand off any imperfections or rough spots, but leave behind any knots in the wood that add interest to its appearance."
        },
        {
          "headline":"Apply a wood stain with a foam brush.",
          "description":"The stain will provide the undertone for the finished wood, so choose your stain based on how light or dark you want the wood to appear. Use a foam brush to apply the stain onto the wood in the direction of the grain. Complete the entire staining and washing process on one side before flipping it over to do another side."
        },
        {
          "headline":"Let the stain sit for five minutes before you wipe it off.",
          "description":"Once you finish applying the stain to all parts of the wood that you can reach, allow the stain to dry for five minutes. Use a lint-free cloth (that you don’t mind throwing away afterward) to wipe away any excess stain that’s sitting on the surface of the wood."
        },
        {
          "headline":"Select a grey latex paint to use for the wash. Be sure you're getting a latex, water-based paint, or it won't mix properly with the water.",
          "description":"Choose the shade of grey that best matches the tone you want to achieve. For example, a blue-toned grey may give your wood some cool tones. A yellow-toned grey will likely create a brownish-grey effect."
        },
        {
          "headline":"Mix four parts water to one part paint.",
          "description":"Create your wash solution in a disposable container. It should be about four parts water to one part paint. If you're just washing a small piece of furniture, start with about 1 cup (0.2 L) of water and mix more as needed."
        },
        {
          "headline":"Use a foam brush to paint the wood with the wash solution.",
          "description":"Spread the grey wash across the wood in the direction of the grain, just as you did with the stain. If you don't think the grey is prominent enough after it dries, apply another coat. Wait until all coats are dry before you flip the wood to stain and wash another side."
        },
        {
          "headline":"Repeat on all sides.",
          "description":"Once the grey wash feels dry to the touch, flip the wood over. Stain and then apply the wash to any other parts you’ve prepped."
        }
      ]
    },
    {
      "name":"Washing with Paint and Wax",
      "steps":[
        {
          "headline":"Lay down a tarp or dropcloth.",
          "description":"Choose a well-ventilated area to work in, and set down something to protect your floor. A tarp or large dropcloth will work well for a piece of furniture."
        },
        {
          "headline":"Sand the wood to prepare it for painting.",
          "description":"If your wood has any dark paint or stain on it, sand it down with a coarse sandpaper until the paint or stain is gone. If the wood is untreated, just sand away any rough spots. If your wood is already painted a very light color and you don’t want to change it, you can skip the sanding and painting steps."
        },
        {
          "headline":"Paint the wood with a light-colored latex paint.",
          "description":"In order for the gray wax to show up, the wood will need to be painted a light color. White or cream will offer the best result. Use a paintbrush to apply the paint in the direction of the grain, then allow it to dry completely. Apply another coat if the first one didn't provide enough coverage. Drying times will typically be between 24 and 48 hours, but check your paint’s packaging for exact instructions."
        },
        {
          "headline":"Apply a base coat of clear wax.",
          "description":"Purchase a small can of paste finishing wax, then use an old, lint-free rag to wipe a coat of it onto the wood. Cover the entire area that you want to grey wash. This base coat will allow you to control how much of the grey-tinted wax stays on in the coming steps. Clear paste finishing wax can be purchased at home improvement and hardware stores."
        },
        {
          "headline":"Mix dark grey paint and clear wax.",
          "description":"Opt for a dark grey paint since a light grey is unlikely to show up well on the wood when mixed with the wax. Start by mixing about 1 tablespoon (14 g) of wax and 1 tablespoon (15 mL) of paint in a disposable container. Use a plastic spoon or a popsicle stick to smash up the wax with the paint until it’s well mixed. Adjust the recipe to your preference. If you want a darker wax, add more paint. For a lighter finish, add more wax. Work with small batches since the paint/wax combo will begin to harden after a while."
        },
        {
          "headline":"Wipe the wax on with a lint-free cloth.",
          "description":"Wipe in the direction of the grain as you rub the tinted wax onto the wood. Apply as much or as little as you want to achieve your desired effect. If a spot gets too dark, apply a little clear wax to lighten it. If it's not dark enough, allow it to dry for 15 to 20 minutes and then apply another coat. Allow the final coat to dry for 15 to 20 minutes before moving on to the next step."
        },
        {
          "headline":"Sand and buff the wood.",
          "description":"Find any uneven spots in the wax and rub with a fine-grit (about 220-grit) sandpaper to even them out. Then rub the wood one final time with a clean cloth to buff it until it’s as shiny as you would like it to be. Complete the waxing and buffing of each side before flipping the wood to wax another side."
        }
      ]
    }
  ],
  "text":" Washing with Paint and Water Lay down a tarp or dropcloth. Choose a well-ventilated area to work in, and set down something to protect your floor. Newspaper is fine if the object is fairly small, but a tarp or large dropcloth will work better if it's a piece of furniture. Sand the wood to remove paint and imperfections. Use a coarse sandpaper all over the surface of the wood you plan to apply the wash to. Any prior paint needs to be removed completely. Sand off any imperfections or rough spots, but leave behind any knots in the wood that add interest to its appearance. Apply a wood stain with a foam brush. The stain will provide the undertone for the finished wood, so choose your stain based on how light or dark you want the wood to appear. Use a foam brush to apply the stain onto the wood in the direction of the grain. Complete the entire staining and washing process on one side before flipping it over to do another side. Let the stain sit for five minutes before you wipe it off. Once you finish applying the stain to all parts of the wood that you can reach, allow the stain to dry for five minutes. Use a lint-free cloth (that you don’t mind throwing away afterward) to wipe away any excess stain that’s sitting on the surface of the wood. Select a grey latex paint to use for the wash. Be sure you're getting a latex, water-based paint, or it won't mix properly with the water. Choose the shade of grey that best matches the tone you want to achieve. For example, a blue-toned grey may give your wood some cool tones. A yellow-toned grey will likely create a brownish-grey effect. Mix four parts water to one part paint. Create your wash solution in a disposable container. It should be about four parts water to one part paint. If you're just washing a small piece of furniture, start with about 1 cup (0.2 L) of water and mix more as needed. Use a foam brush to paint the wood with the wash solution. Spread the grey wash across the wood in the direction of the grain, just as you did with the stain. If you don't think the grey is prominent enough after it dries, apply another coat. Wait until all coats are dry before you flip the wood to stain and wash another side. Repeat on all sides. Once the grey wash feels dry to the touch, flip the wood over. Stain and then apply the wash to any other parts you’ve prepped. Washing with Paint and Wax Lay down a tarp or dropcloth. Choose a well-ventilated area to work in, and set down something to protect your floor. A tarp or large dropcloth will work well for a piece of furniture. Sand the wood to prepare it for painting. If your wood has any dark paint or stain on it, sand it down with a coarse sandpaper until the paint or stain is gone. If the wood is untreated, just sand away any rough spots. If your wood is already painted a very light color and you don’t want to change it, you can skip the sanding and painting steps. Paint the wood with a light-colored latex paint. In order for the gray wax to show up, the wood will need to be painted a light color. White or cream will offer the best result. Use a paintbrush to apply the paint in the direction of the grain, then allow it to dry completely. Apply another coat if the first one didn't provide enough coverage. Drying times will typically be between 24 and 48 hours, but check your paint’s packaging for exact instructions. Apply a base coat of clear wax. Purchase a small can of paste finishing wax, then use an old, lint-free rag to wipe a coat of it onto the wood. Cover the entire area that you want to grey wash. This base coat will allow you to control how much of the grey-tinted wax stays on in the coming steps. Clear paste finishing wax can be purchased at home improvement and hardware stores. Mix dark grey paint and clear wax. Opt for a dark grey paint since a light grey is unlikely to show up well on the wood when mixed with the wax. Start by mixing about 1 tablespoon (14 g) of wax and 1 tablespoon (15 mL) of paint in a disposable container. Use a plastic spoon or a popsicle stick to smash up the wax with the paint until it’s well mixed. Adjust the recipe to your preference. If you want a darker wax, add more paint. For a lighter finish, add more wax. Work with small batches since the paint/wax combo will begin to harden after a while. Wipe the wax on with a lint-free cloth. Wipe in the direction of the grain as you rub the tinted wax onto the wood. Apply as much or as little as you want to achieve your desired effect. If a spot gets too dark, apply a little clear wax to lighten it. If it's not dark enough, allow it to dry for 15 to 20 minutes and then apply another coat. Allow the final coat to dry for 15 to 20 minutes before moving on to the next step. Sand and buff the wood. Find any uneven spots in the wax and rub with a fine-grit (about 220-grit) sandpaper to even them out. Then rub the wood one final time with a clean cloth to buff it until it’s as shiny as you would like it to be. Complete the waxing and buffing of each side before flipping the wood to wax another side.",
  "sentences":[
    " Washing with Paint and Water Lay down a tarp or dropcloth.",
    "Choose a well-ventilated area to work in, and set down something to protect your floor.",
    "Newspaper is fine if the object is fairly small, but a tarp or large dropcloth will work better if it's a piece of furniture.",
    "Sand the wood to remove paint and imperfections.",
    "Use a coarse sandpaper all over the surface of the wood you plan to apply the wash to.",
    "Any prior paint needs to be removed completely.",
    "Sand off any imperfections or rough spots, but leave behind any knots in the wood that add interest to its appearance.",
    "Apply a wood stain with a foam brush.",
    "The stain will provide the undertone for the finished wood, so choose your stain based on how light or dark you want the wood to appear.",
    "Use a foam brush to apply the stain onto the wood in the direction of the grain.",
    "Complete the entire staining and washing process on one side before flipping it over to do another side.",
    "Let the stain sit for five minutes before you wipe it off.",
    "Once you finish applying the stain to all parts of the wood that you can reach, allow the stain to dry for five minutes.",
    "Use a lint-free cloth (that you don’t mind throwing away afterward) to wipe away any excess stain that’s sitting on the surface of the wood.",
    "Select a grey latex paint to use for the wash. Be sure you're getting a latex, water-based paint, or it won't mix properly with the water.",
    "Choose the shade of grey that best matches the tone you want to achieve.",
    "For example, a blue-toned grey may give your wood some cool tones.",
    "A yellow-toned grey will likely create a brownish-grey effect.",
    "Mix four parts water to one part paint.",
    "Create your wash solution in a disposable container.",
    "It should be about four parts water to one part paint.",
    "If you're just washing a small piece of furniture, start with about 1 cup (0.2 L) of water and mix more as needed.",
    "Use a foam brush to paint the wood with the wash solution.",
    "Spread the grey wash across the wood in the direction of the grain, just as you did with the stain.",
    "If you don't think the grey is prominent enough after it dries, apply another coat.",
    "Wait until all coats are dry before you flip the wood to stain and wash another side.",
    "Repeat on all sides.",
    "Once the grey wash feels dry to the touch, flip the wood over.",
    "Stain and then apply the wash to any other parts you’ve prepped.",
    "Washing with Paint and Wax Lay down a tarp or dropcloth.",
    "Choose a well-ventilated area to work in, and set down something to protect your floor.",
    "A tarp or large dropcloth will work well for a piece of furniture.",
    "Sand the wood to prepare it for painting.",
    "If your wood has any dark paint or stain on it, sand it down with a coarse sandpaper until the paint or stain is gone.",
    "If the wood is untreated, just sand away any rough spots.",
    "If your wood is already painted a very light color and you don’t want to change it, you can skip the sanding and painting steps.",
    "Paint the wood with a light-colored latex paint.",
    "In order for the gray wax to show up, the wood will need to be painted a light color.",
    "White or cream will offer the best result.",
    "Use a paintbrush to apply the paint in the direction of the grain, then allow it to dry completely.",
    "Apply another coat if the first one didn't provide enough coverage.",
    "Drying times will typically be between 24 and 48 hours, but check your paint’s packaging for exact instructions.",
    "Apply a base coat of clear wax.",
    "Purchase a small can of paste finishing wax, then use an old, lint-free rag to wipe a coat of it onto the wood.",
    "Cover the entire area that you want to grey wash.",
    "This base coat will allow you to control how much of the grey-tinted wax stays on in the coming steps.",
    "Clear paste finishing wax can be purchased at home improvement and hardware stores.",
    "Mix dark grey paint and clear wax.",
    "Opt for a dark grey paint since a light grey is unlikely to show up well on the wood when mixed with the wax.",
    "Start by mixing about 1 tablespoon (14 g) of wax and 1 tablespoon (15 mL) of paint in a disposable container.",
    "Use a plastic spoon or a popsicle stick to smash up the wax with the paint until it’s well mixed.",
    "Adjust the recipe to your preference.",
    "If you want a darker wax, add more paint.",
    "For a lighter finish, add more wax.",
    "Work with small batches since the paint/wax combo will begin to harden after a while.",
    "Wipe the wax on with a lint-free cloth.",
    "Wipe in the direction of the grain as you rub the tinted wax onto the wood.",
    "Apply as much or as little as you want to achieve your desired effect.",
    "If a spot gets too dark, apply a little clear wax to lighten it.",
    "If it's not dark enough, allow it to dry for 15 to 20 minutes and then apply another coat.",
    "Allow the final coat to dry for 15 to 20 minutes before moving on to the next step.",
    "Sand and buff the wood.",
    "Find any uneven spots in the wax and rub with a fine-grit (about 220-grit) sandpaper to even them out.",
    "Then rub the wood one final time with a clean cloth to buff it until it’s as shiny as you would like it to be.",
    "Complete the waxing and buffing of each side before flipping the wood to wax another side."
  ],
  "tyn_section":[
    "Dropcloth or tarp",
    "Sandpaper (80-grit and 220-grit)",
    "Wood stain",
    "Grey latex paint",
    "Foam brushes",
    "Paintbrush",
    "White or cream-colored paint",
    "Clear finishing wax",
    "Lint-free cloths or rags"
  ],
  "tyn_model":[
    "paint",
    "wax",
    "water",
    "tarp",
    "sandpaper",
    "foam brush",
    "clear wax",
    "newspaper",
    "latex paint",
    "paintbrush",
    "paste finishing wax",
    "clear paste finishing wax",
    "disposable container",
    "plastic spoon",
    "popsicle stick",
    "lint-free cloth",
    "fine-grit ("
  ],
  "simple_metrics":{
    "r":0.1111111111,
    "p":0.0588235294,
    "f1":0.0769230769,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.2941176471,
    "f1":0.3125
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5555555556,
    "p":0.5294117647,
    "f1":0.5421686747
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.2352941176,
    "f1":0.275862069
  }
}