{
  "title":"How to Mist Coat with Paint",
  "url":"https://www.wikihow.com/Mist-Coat-with-Paint",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Preparing the Mist Coat",
      "steps":[
        {
          "headline":"Get an emulsion paint that does not contain vinyl.",
          "description":"You can make your own mist coat by buying paint that is labeled “emulsion,” as this means it is water based. Check the ingredients to confirm there is no vinyl, only acrylic, in the paint. Look for emulsion paint at your local hardware store or online. Go for an emulsion paint that comes in a large batch and is relatively cheap, as you are going to be diluting it with more water anyway."
        },
        {
          "headline":"Pick a color that matches the top coat color.",
          "description":"This will allow you to apply only one layer of top coat, as the mist coat and the top coat will match. Look at paint swatches to confirm the colors match. For example, if your top coat color is white, get white emulsion paint. Try to find a shade of white that matches the top coat as closely as possible. Try buying the top coat and the emulsion paint from the same brand to make matching them easier."
        },
        {
          "headline":"Use a 50/50 ratio of paint and water.",
          "description":"Pour one part paint and one part water into a plastic bucket. Use a paint mixer to combine the water and the paint. You want the paint to appear watery and runny. Having a 50/50 ratio will ensure the paint is wet enough to absorb into the plaster and seal it. Mix the mist coat right before you plan to paint, as this will ensure it does not sit for too long."
        },
        {
          "headline":"Buy a pre-made mist coat at your local hardware store.",
          "description":"If you’d prefer not to make your own mist coat, you can buy a pre-made product. Make sure it is water-based and matches the color of your top coat. You can also buy plaster paints, which are made for applying over plaster and allow the mist coat to dry faster. If you are not sure which paint brand to buy, speak to a representative at your local hardware store for guidance."
        }
      ]
    },
    {
      "name":"Applying the Mist Coat",
      "steps":[
        {
          "headline":"Make sure the plaster is completely dry.",
          "description":"Do not apply the mist coat to plaster that is still wet, as this can damage the plaster. It usually takes plaster around one to two days to dry. Touch the plaster with your hand to confirm there are no wet spots."
        },
        {
          "headline":"Put tarp or sheets down on the floor.",
          "description":"Applying the mist coat can be a messy job, as the paint will be very wet and runny. Lay down tarps or paint sheets to protect the floors in the room. Tape them down so they are secure. Remove any furniture in the room so it does not get covered with paint. You can also cover the furniture with a tarp or sheet. You should also wear clothing you don’t mind getting paint on, such as an old shirt and jeans."
        },
        {
          "headline":"Roll the mist coat onto the paint roller.",
          "description":"Pour the mist coat into the paint tray. Then, place the paint roller into the tray and roll a nice, even amount of paint on the roller. The roller should not be too wet with paint. It should just have an even layer and be wet enough for you to spread the paint onto the wall."
        },
        {
          "headline":"Apply one, even layer of the mist coat.",
          "description":"Roll the paint onto the plaster in smooth, fluid upward motions. Start in the lower bottom corner of the wall and roll the paint towards the top of the room. You can go over an area with more mist coat if it does not appear covered. You want the wall to be painted with an even layer of the mist coat so the plaster is sealed. Do not roll over the same spot over and over again, just enough to cover the spot with the paint."
        },
        {
          "headline":"Use a small paint brush to get at the corners of the room.",
          "description":"The small paint brush can be used to paint any spots you can't reach with the roller. Dip the paintbrush in the mist coat and use it on any hard to reach areas, such as the corners of the room or just above the baseboards."
        }
      ]
    },
    {
      "name":"Putting on the Top Coat",
      "steps":[
        {
          "headline":"Allow the mist coat to air dry overnight.",
          "description":"The mist coat will require some time to dry properly. Do not touch the mist coat for 24 hours or overnight so it has time to dry. Leave the windows in the room open to help it dry. You can also position small circulating fans in the room to help the mist coat dry faster. Make sure the fans are not stuck on one spot in the room, as you want the paint to dry at the same rate in the room. If you plan to leave the windows open, check the weather report to make sure that damp or wet conditions aren't in the forecast."
        },
        {
          "headline":"Confirm the mist coat has dried.",
          "description":"Touch the mist coat to make sure it has dried completely before you apply any paint over it. It should have no wet spots and be dry to the touch."
        },
        {
          "headline":"Apply the top coat.",
          "description":"Once the mist coat has dried, you can apply two layers of the top coat of your choice. Pour the top coat color into a new paint pan. Use a clean roller to apply the top coat in an upward motion over the mist coat. You can also get a small paintbrush to help you paint any hard to reach spots, such as the corners or above the baseboards. Allow the first layer of top coat to dry overnight. Then, apply the second layer. Depending on how dark you want the walls to appear, you may apply a third layer of top coat. Make sure you allow the second layer to dry overnight before applying the third layer."
        }
      ]
    }
  ],
  "text":" Preparing the Mist Coat Get an emulsion paint that does not contain vinyl. You can make your own mist coat by buying paint that is labeled “emulsion,” as this means it is water based. Check the ingredients to confirm there is no vinyl, only acrylic, in the paint. Look for emulsion paint at your local hardware store or online. Go for an emulsion paint that comes in a large batch and is relatively cheap, as you are going to be diluting it with more water anyway. Pick a color that matches the top coat color. This will allow you to apply only one layer of top coat, as the mist coat and the top coat will match. Look at paint swatches to confirm the colors match. For example, if your top coat color is white, get white emulsion paint. Try to find a shade of white that matches the top coat as closely as possible. Try buying the top coat and the emulsion paint from the same brand to make matching them easier. Use a 50/50 ratio of paint and water. Pour one part paint and one part water into a plastic bucket. Use a paint mixer to combine the water and the paint. You want the paint to appear watery and runny. Having a 50/50 ratio will ensure the paint is wet enough to absorb into the plaster and seal it. Mix the mist coat right before you plan to paint, as this will ensure it does not sit for too long. Buy a pre-made mist coat at your local hardware store. If you’d prefer not to make your own mist coat, you can buy a pre-made product. Make sure it is water-based and matches the color of your top coat. You can also buy plaster paints, which are made for applying over plaster and allow the mist coat to dry faster. If you are not sure which paint brand to buy, speak to a representative at your local hardware store for guidance. Applying the Mist Coat Make sure the plaster is completely dry. Do not apply the mist coat to plaster that is still wet, as this can damage the plaster. It usually takes plaster around one to two days to dry. Touch the plaster with your hand to confirm there are no wet spots. Put tarp or sheets down on the floor. Applying the mist coat can be a messy job, as the paint will be very wet and runny. Lay down tarps or paint sheets to protect the floors in the room. Tape them down so they are secure. Remove any furniture in the room so it does not get covered with paint. You can also cover the furniture with a tarp or sheet. You should also wear clothing you don’t mind getting paint on, such as an old shirt and jeans. Roll the mist coat onto the paint roller. Pour the mist coat into the paint tray. Then, place the paint roller into the tray and roll a nice, even amount of paint on the roller. The roller should not be too wet with paint. It should just have an even layer and be wet enough for you to spread the paint onto the wall. Apply one, even layer of the mist coat. Roll the paint onto the plaster in smooth, fluid upward motions. Start in the lower bottom corner of the wall and roll the paint towards the top of the room. You can go over an area with more mist coat if it does not appear covered. You want the wall to be painted with an even layer of the mist coat so the plaster is sealed. Do not roll over the same spot over and over again, just enough to cover the spot with the paint. Use a small paint brush to get at the corners of the room. The small paint brush can be used to paint any spots you can't reach with the roller. Dip the paintbrush in the mist coat and use it on any hard to reach areas, such as the corners of the room or just above the baseboards. Putting on the Top Coat Allow the mist coat to air dry overnight. The mist coat will require some time to dry properly. Do not touch the mist coat for 24 hours or overnight so it has time to dry. Leave the windows in the room open to help it dry. You can also position small circulating fans in the room to help the mist coat dry faster. Make sure the fans are not stuck on one spot in the room, as you want the paint to dry at the same rate in the room. If you plan to leave the windows open, check the weather report to make sure that damp or wet conditions aren't in the forecast. Confirm the mist coat has dried. Touch the mist coat to make sure it has dried completely before you apply any paint over it. It should have no wet spots and be dry to the touch. Apply the top coat. Once the mist coat has dried, you can apply two layers of the top coat of your choice. Pour the top coat color into a new paint pan. Use a clean roller to apply the top coat in an upward motion over the mist coat. You can also get a small paintbrush to help you paint any hard to reach spots, such as the corners or above the baseboards. Allow the first layer of top coat to dry overnight. Then, apply the second layer. Depending on how dark you want the walls to appear, you may apply a third layer of top coat. Make sure you allow the second layer to dry overnight before applying the third layer.",
  "sentences":[
    " Preparing the Mist Coat Get an emulsion paint that does not contain vinyl.",
    "You can make your own mist coat by buying paint that is labeled “emulsion,” as this means it is water based.",
    "Check the ingredients to confirm there is no vinyl, only acrylic, in the paint.",
    "Look for emulsion paint at your local hardware store or online.",
    "Go for an emulsion paint that comes in a large batch and is relatively cheap, as you are going to be diluting it with more water anyway.",
    "Pick a color that matches the top coat color.",
    "This will allow you to apply only one layer of top coat, as the mist coat and the top coat will match.",
    "Look at paint swatches to confirm the colors match.",
    "For example, if your top coat color is white, get white emulsion paint.",
    "Try to find a shade of white that matches the top coat as closely as possible.",
    "Try buying the top coat and the emulsion paint from the same brand to make matching them easier.",
    "Use a 50/50 ratio of paint and water.",
    "Pour one part paint and one part water into a plastic bucket.",
    "Use a paint mixer to combine the water and the paint.",
    "You want the paint to appear watery and runny.",
    "Having a 50/50 ratio will ensure the paint is wet enough to absorb into the plaster and seal it.",
    "Mix the mist coat right before you plan to paint, as this will ensure it does not sit for too long.",
    "Buy a pre-made mist coat at your local hardware store.",
    "If you’d prefer not to make your own mist coat, you can buy a pre-made product.",
    "Make sure it is water-based and matches the color of your top coat.",
    "You can also buy plaster paints, which are made for applying over plaster and allow the mist coat to dry faster.",
    "If you are not sure which paint brand to buy, speak to a representative at your local hardware store for guidance.",
    "Applying the Mist Coat Make sure the plaster is completely dry.",
    "Do not apply the mist coat to plaster that is still wet, as this can damage the plaster.",
    "It usually takes plaster around one to two days to dry.",
    "Touch the plaster with your hand to confirm there are no wet spots.",
    "Put tarp or sheets down on the floor.",
    "Applying the mist coat can be a messy job, as the paint will be very wet and runny.",
    "Lay down tarps or paint sheets to protect the floors in the room.",
    "Tape them down so they are secure.",
    "Remove any furniture in the room so it does not get covered with paint.",
    "You can also cover the furniture with a tarp or sheet.",
    "You should also wear clothing you don’t mind getting paint on, such as an old shirt and jeans.",
    "Roll the mist coat onto the paint roller.",
    "Pour the mist coat into the paint tray.",
    "Then, place the paint roller into the tray and roll a nice, even amount of paint on the roller.",
    "The roller should not be too wet with paint.",
    "It should just have an even layer and be wet enough for you to spread the paint onto the wall.",
    "Apply one, even layer of the mist coat.",
    "Roll the paint onto the plaster in smooth, fluid upward motions.",
    "Start in the lower bottom corner of the wall and roll the paint towards the top of the room.",
    "You can go over an area with more mist coat if it does not appear covered.",
    "You want the wall to be painted with an even layer of the mist coat so the plaster is sealed.",
    "Do not roll over the same spot over and over again, just enough to cover the spot with the paint.",
    "Use a small paint brush to get at the corners of the room.",
    "The small paint brush can be used to paint any spots you can't reach with the roller.",
    "Dip the paintbrush in the mist coat and use it on any hard to reach areas, such as the corners of the room or just above the baseboards.",
    "Putting on the Top Coat Allow the mist coat to air dry overnight.",
    "The mist coat will require some time to dry properly.",
    "Do not touch the mist coat for 24 hours or overnight so it has time to dry.",
    "Leave the windows in the room open to help it dry.",
    "You can also position small circulating fans in the room to help the mist coat dry faster.",
    "Make sure the fans are not stuck on one spot in the room, as you want the paint to dry at the same rate in the room.",
    "If you plan to leave the windows open, check the weather report to make sure that damp or wet conditions aren't in the forecast.",
    "Confirm the mist coat has dried.",
    "Touch the mist coat to make sure it has dried completely before you apply any paint over it.",
    "It should have no wet spots and be dry to the touch.",
    "Apply the top coat.",
    "Once the mist coat has dried, you can apply two layers of the top coat of your choice.",
    "Pour the top coat color into a new paint pan.",
    "Use a clean roller to apply the top coat in an upward motion over the mist coat.",
    "You can also get a small paintbrush to help you paint any hard to reach spots, such as the corners or above the baseboards.",
    "Allow the first layer of top coat to dry overnight.",
    "Then, apply the second layer.",
    "Depending on how dark you want the walls to appear, you may apply a third layer of top coat.",
    "Make sure you allow the second layer to dry overnight before applying the third layer."
  ],
  "tyn_section":[
    "Emulsion paint",
    "Water",
    "A bucket",
    "Paint tarp or sheet",
    "A paint roller with an extendable arm",
    "A paint brush",
    "A fan"
  ],
  "tyn_model":[
    "paint",
    "emulsion paint",
    "water",
    "plaster",
    "mist coat",
    "tarp",
    "paint roller",
    "roller",
    "paintbrush",
    "“emulsion",
    "” as",
    "acrylic",
    "white emulsion paint",
    "plastic bucket",
    "paint mixer",
    "plaster paints",
    "sheets",
    "tarps",
    "paint sheets",
    "paint tray",
    "paint brush",
    "small paint brush",
    "fans",
    "paint pan"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0833333333,
    "f1":0.1290322581,
    "avg_pos":0.0416666667
  },
  "jacc_metrics_0.5":{
    "r":0.4285714286,
    "p":0.25,
    "f1":0.3157894737
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5714285714,
    "p":0.5,
    "f1":0.5333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.1666666667,
    "f1":0.24
  }
}