{
  "title":"How to Make Soft Bread",
  "url":"https://www.wikihow.com/Make-Soft-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads"
  ],
  "parts":[
    {
      "name":"Creating the Yeast Mixture",
      "steps":[
        {
          "headline":"Warm up milk in your microwave.",
          "description":"Pour ½ cup (118 ml) milk into a microwave safe mixing bowl. Heat it a minute at a time until it is warm to the touch. Once warmed, remove the milk from the microwave."
        },
        {
          "headline":"Combine the sugar, salt, and butter with warmed milk.",
          "description":"Mix in 3 tbsp (44.4 ml) sugar, 2 tsp (9.9 ml) salt, 3 tbsp (44.4  ml) butter. If the milk isn’t warm enough to melt the butter, heat the mixture in the microwave again at minute intervals until it melts. The warm milk should absorb ingredients easily. If you notice undissolved ingredients, whisk the mixture until it is consistent throughout. You can also heat milk in a sauce pan on your stovetop. However, the milk should never be hotter than warm to the touch."
        },
        {
          "headline":"Heat up 1½ cups (355 ml) of water and add it to the mixer’s bowl.",
          "description":"Set the milk mixture off to the side to cool. Microwave the water until it is about 110 °F (43 °C). The warmed water can be poured into the bowl of your mixer. The ideal water temperature range for activating yeast is between 105 and 110 °F (41 and 43 °C). Use a thermometer to ensure your water's the right temperature. If your tap water is hot enough, feel free to use it straight from the faucet. When the water is so hot it stings, it's generally hot enough to activate yeast."
        },
        {
          "headline":"Add the yeast and 1 cup (236.6 ml) of flour and mix for 2 - 3 minutes.",
          "description":"After you add the yeast and flour, turn on your mixer. Allow the mixer to work the water, yeast, and flour for 2 or 3 minutes."
        }
      ]
    },
    {
      "name":"Thickening the Mixture into Dough",
      "steps":[
        {
          "headline":"Stop the mixer and add in flour and the milk mixture.",
          "description":"When the mixer is stopped, pour in 1 cup (236.6 ml) of flour and the cooled milk mixture. Turn on your mixer for another 2 minutes, then get ready to add some more flour. The milk mixture should be cool to the touch and its ingredients should be fully dissolved before it is added to the mixing bowl."
        },
        {
          "headline":"Run the mixer at intervals as you add flour 1 cup (236.6 ml) at a time.",
          "description":"Stop the mixer after 2 minutes and pour a cup of flour into the mixing bowl. Resume mixing until the mixture is smooth, then add another cup of flour. Continue mixing in the flour until 5 cups (1.2 L) have been added."
        },
        {
          "headline":"Add a little extra flour as necessary.",
          "description":"Depending on your yeast, you may only need to add a very little bit of flour, though you may need as much as a full cup. Mix for about 6 minutes after adding the fifth cup of flour. Mix flour into the dough until it forms a puffy ball around the hook."
        },
        {
          "headline":"Sprinkle your countertop or a cutting board with flour.",
          "description":"This will prevent your dough from sticking to your counters or cutting board as you knead it. A thin dusting should be enough. If the dough begins sticking while kneading, lightly sprinkle more flour."
        },
        {
          "headline":"Knead the dough.",
          "description":"The dough ball should come off the dough hook and out of the mixing bowl easily. Roll the doughball onto the flour. To knead the dough with your clean hands:\nFlatten the dough by pushing into its middle with the heel of your hand. Fold the flattened dough over on itself. Gather the dough back together into a ball. Repeat this process until the dough is a smooth, glutinous consistency."
        }
      ]
    },
    {
      "name":"Rising the Dough",
      "steps":[
        {
          "headline":"Spray the mixer’s bowl and doughball with cooking spray.",
          "description":"Hold the mixer’s bowl over your sink and coat its inside completely with cooking spray. Transfer the kneaded dough into the mixing bowl, then spray the doughball until it is also coated in cooking spray."
        },
        {
          "headline":"Place a dish towel over the bowl and allow it to rise for 35 minutes.",
          "description":"Drape a clean dish towel over the mouth of the mixer’s bowl to cover the dough. When the dough has roughly doubled in size, it’s to be kneaded again. Dough that is warm generally rises faster than dough that is cold or cool. Slightly warmer than room temperature is ideal. Rising dough in a location that is too hot could rush the fermentation process of the yeast, negatively impacting the quality of the bread when finished."
        },
        {
          "headline":"Punch down the dough.",
          "description":"The dough should be poofy and of smooth consistency. Punch directly into the middle of the doughball from above with your fist until you reach the bottom of the mixing bowl. Working outward from the center, punch down the dough until you reach the edge of the bowl."
        },
        {
          "headline":"Cut the dough ball in half and knead it again.",
          "description":"Knead the dough in the same fashion you did earlier until it is malleable and smooth. Use a piece of wire or knife to cut the dough in half. Shape each half to roughly the size of a single loaf bread pan. A single loaf bread pan is usually 8.5 by 4.5 by 2.75 inches (21.6 by 11.4 by 7.0 cm). When the dough is ready, it should look like a miniature loaf or a doughy football."
        },
        {
          "headline":"Grease your bread pans with cooking spray.",
          "description":"Take your bread pans over to the sink and coat their insides completely in cooking spray. Make sure the insides of each pan are completely coated in a thin layer of spray."
        },
        {
          "headline":"Insert each half into a greased bread pans.",
          "description":"Insert each half of the dough into its own bread pan, then spray the dough with cooking spray. The dough will need about 55 minutes to rise again. Moisten the dough as it rises in the bread pans. If it looks dry, give it a spritz of cooking spray or a fine misting of water. Cover the dough with a towel as it rises. However, the dough will eventually expand farther than the top of the pan. When this happens, remove the towel."
        }
      ]
    },
    {
      "name":"Baking the Bread",
      "steps":[
        {
          "headline":"Preheat your oven to 400 °F (204 °C).",
          "description":"Most ovens take about 15 minutes to preheat. If your oven does not have a preheat feature, set your oven to 400 °F (204 °C) and check it with an oven thermometer. Adjust the temperature until the thermometer reads a steady 400 °F (204 °C)."
        },
        {
          "headline":"Insert the bread into the oven and lower the heat after 15 minutes.",
          "description":"Allow the bread to bake for 15 minutes at 400 °F (204 °C). After that, drop the oven temperature to 350 °F (177 °C)."
        },
        {
          "headline":"Continue baking at 350 °F (177 °C) for about 35 minutes.",
          "description":"Keep an eye on your bread as it bakes. Depending on your oven, your dough might bake in more or less time. After 35 minutes, or when it's golden brown, it can be removed."
        },
        {
          "headline":"Remove the bread, allow it to cool, and it’s ready to eat.",
          "description":"The bread and pans will be hot, so use an oven mitt or potholder to remove them from the oven. Tilt the bread pans on an angle to remove the baked loaves. Cut the bread into slices when cooled and enjoy."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Creating the Yeast Mixture Warm up milk in your microwave. Pour ½ cup (118 ml) milk into a microwave safe mixing bowl. Heat it a minute at a time until it is warm to the touch. Once warmed, remove the milk from the microwave. Combine the sugar, salt, and butter with warmed milk. Mix in 3 tbsp (44.4 ml) sugar, 2 tsp (9.9 ml) salt, 3 tbsp (44.4  ml) butter. If the milk isn’t warm enough to melt the butter, heat the mixture in the microwave again at minute intervals until it melts. The warm milk should absorb ingredients easily. If you notice undissolved ingredients, whisk the mixture until it is consistent throughout. You can also heat milk in a sauce pan on your stovetop. However, the milk should never be hotter than warm to the touch. Heat up 1½ cups (355 ml) of water and add it to the mixer’s bowl. Set the milk mixture off to the side to cool. Microwave the water until it is about 110 °F (43 °C). The warmed water can be poured into the bowl of your mixer. The ideal water temperature range for activating yeast is between 105 and 110 °F (41 and 43 °C). Use a thermometer to ensure your water's the right temperature. If your tap water is hot enough, feel free to use it straight from the faucet. When the water is so hot it stings, it's generally hot enough to activate yeast. Add the yeast and 1 cup (236.6 ml) of flour and mix for 2 - 3 minutes. After you add the yeast and flour, turn on your mixer. Allow the mixer to work the water, yeast, and flour for 2 or 3 minutes. Thickening the Mixture into Dough Stop the mixer and add in flour and the milk mixture. When the mixer is stopped, pour in 1 cup (236.6 ml) of flour and the cooled milk mixture. Turn on your mixer for another 2 minutes, then get ready to add some more flour. The milk mixture should be cool to the touch and its ingredients should be fully dissolved before it is added to the mixing bowl. Run the mixer at intervals as you add flour 1 cup (236.6 ml) at a time. Stop the mixer after 2 minutes and pour a cup of flour into the mixing bowl. Resume mixing until the mixture is smooth, then add another cup of flour. Continue mixing in the flour until 5 cups (1.2 L) have been added. Add a little extra flour as necessary. Depending on your yeast, you may only need to add a very little bit of flour, though you may need as much as a full cup. Mix for about 6 minutes after adding the fifth cup of flour. Mix flour into the dough until it forms a puffy ball around the hook. Sprinkle your countertop or a cutting board with flour. This will prevent your dough from sticking to your counters or cutting board as you knead it. A thin dusting should be enough. If the dough begins sticking while kneading, lightly sprinkle more flour. Knead the dough. The dough ball should come off the dough hook and out of the mixing bowl easily. Roll the doughball onto the flour. To knead the dough with your clean hands:\nFlatten the dough by pushing into its middle with the heel of your hand. Fold the flattened dough over on itself. Gather the dough back together into a ball. Repeat this process until the dough is a smooth, glutinous consistency. Rising the Dough Spray the mixer’s bowl and doughball with cooking spray. Hold the mixer’s bowl over your sink and coat its inside completely with cooking spray. Transfer the kneaded dough into the mixing bowl, then spray the doughball until it is also coated in cooking spray. Place a dish towel over the bowl and allow it to rise for 35 minutes. Drape a clean dish towel over the mouth of the mixer’s bowl to cover the dough. When the dough has roughly doubled in size, it’s to be kneaded again. Dough that is warm generally rises faster than dough that is cold or cool. Slightly warmer than room temperature is ideal. Rising dough in a location that is too hot could rush the fermentation process of the yeast, negatively impacting the quality of the bread when finished. Punch down the dough. The dough should be poofy and of smooth consistency. Punch directly into the middle of the doughball from above with your fist until you reach the bottom of the mixing bowl. Working outward from the center, punch down the dough until you reach the edge of the bowl. Cut the dough ball in half and knead it again. Knead the dough in the same fashion you did earlier until it is malleable and smooth. Use a piece of wire or knife to cut the dough in half. Shape each half to roughly the size of a single loaf bread pan. A single loaf bread pan is usually 8.5 by 4.5 by 2.75 inches (21.6 by 11.4 by 7.0 cm). When the dough is ready, it should look like a miniature loaf or a doughy football. Grease your bread pans with cooking spray. Take your bread pans over to the sink and coat their insides completely in cooking spray. Make sure the insides of each pan are completely coated in a thin layer of spray. Insert each half into a greased bread pans. Insert each half of the dough into its own bread pan, then spray the dough with cooking spray. The dough will need about 55 minutes to rise again. Moisten the dough as it rises in the bread pans. If it looks dry, give it a spritz of cooking spray or a fine misting of water. Cover the dough with a towel as it rises. However, the dough will eventually expand farther than the top of the pan. When this happens, remove the towel. Baking the Bread Preheat your oven to 400 °F (204 °C). Most ovens take about 15 minutes to preheat. If your oven does not have a preheat feature, set your oven to 400 °F (204 °C) and check it with an oven thermometer. Adjust the temperature until the thermometer reads a steady 400 °F (204 °C). Insert the bread into the oven and lower the heat after 15 minutes. Allow the bread to bake for 15 minutes at 400 °F (204 °C). After that, drop the oven temperature to 350 °F (177 °C). Continue baking at 350 °F (177 °C) for about 35 minutes. Keep an eye on your bread as it bakes. Depending on your oven, your dough might bake in more or less time. After 35 minutes, or when it's golden brown, it can be removed. Remove the bread, allow it to cool, and it’s ready to eat. The bread and pans will be hot, so use an oven mitt or potholder to remove them from the oven. Tilt the bread pans on an angle to remove the baked loaves. Cut the bread into slices when cooled and enjoy. Finished. ",
  "sentences":[
    " Creating the Yeast Mixture Warm up milk in your microwave.",
    "Pour ½ cup (118 ml) milk into a microwave safe mixing bowl.",
    "Heat it a minute at a time until it is warm to the touch.",
    "Once warmed, remove the milk from the microwave.",
    "Combine the sugar, salt, and butter with warmed milk.",
    "Mix in 3 tbsp (44.4 ml) sugar, 2 tsp (9.9 ml) salt, 3 tbsp (44.4  ml) butter.",
    "If the milk isn’t warm enough to melt the butter, heat the mixture in the microwave again at minute intervals until it melts.",
    "The warm milk should absorb ingredients easily.",
    "If you notice undissolved ingredients, whisk the mixture until it is consistent throughout.",
    "You can also heat milk in a sauce pan on your stovetop.",
    "However, the milk should never be hotter than warm to the touch.",
    "Heat up 1½ cups (355 ml) of water and add it to the mixer’s bowl.",
    "Set the milk mixture off to the side to cool.",
    "Microwave the water until it is about 110 °F (43 °C).",
    "The warmed water can be poured into the bowl of your mixer.",
    "The ideal water temperature range for activating yeast is between 105 and 110 °F (41 and 43 °C).",
    "Use a thermometer to ensure your water's the right temperature.",
    "If your tap water is hot enough, feel free to use it straight from the faucet.",
    "When the water is so hot it stings, it's generally hot enough to activate yeast.",
    "Add the yeast and 1 cup (236.6 ml) of flour and mix for 2 - 3 minutes.",
    "After you add the yeast and flour, turn on your mixer.",
    "Allow the mixer to work the water, yeast, and flour for 2 or 3 minutes.",
    "Thickening the Mixture into Dough Stop the mixer and add in flour and the milk mixture.",
    "When the mixer is stopped, pour in 1 cup (236.6 ml) of flour and the cooled milk mixture.",
    "Turn on your mixer for another 2 minutes, then get ready to add some more flour.",
    "The milk mixture should be cool to the touch and its ingredients should be fully dissolved before it is added to the mixing bowl.",
    "Run the mixer at intervals as you add flour 1 cup (236.6 ml) at a time.",
    "Stop the mixer after 2 minutes and pour a cup of flour into the mixing bowl.",
    "Resume mixing until the mixture is smooth, then add another cup of flour.",
    "Continue mixing in the flour until 5 cups (1.2 L) have been added.",
    "Add a little extra flour as necessary.",
    "Depending on your yeast, you may only need to add a very little bit of flour, though you may need as much as a full cup.",
    "Mix for about 6 minutes after adding the fifth cup of flour.",
    "Mix flour into the dough until it forms a puffy ball around the hook.",
    "Sprinkle your countertop or a cutting board with flour.",
    "This will prevent your dough from sticking to your counters or cutting board as you knead it.",
    "A thin dusting should be enough.",
    "If the dough begins sticking while kneading, lightly sprinkle more flour.",
    "Knead the dough.",
    "The dough ball should come off the dough hook and out of the mixing bowl easily.",
    "Roll the doughball onto the flour.",
    "To knead the dough with your clean hands:\nFlatten the dough by pushing into its middle with the heel of your hand.",
    "Fold the flattened dough over on itself.",
    "Gather the dough back together into a ball.",
    "Repeat this process until the dough is a smooth, glutinous consistency.",
    "Rising the Dough Spray the mixer’s bowl and doughball with cooking spray.",
    "Hold the mixer’s bowl over your sink and coat its inside completely with cooking spray.",
    "Transfer the kneaded dough into the mixing bowl, then spray the doughball until it is also coated in cooking spray.",
    "Place a dish towel over the bowl and allow it to rise for 35 minutes.",
    "Drape a clean dish towel over the mouth of the mixer’s bowl to cover the dough.",
    "When the dough has roughly doubled in size, it’s to be kneaded again.",
    "Dough that is warm generally rises faster than dough that is cold or cool.",
    "Slightly warmer than room temperature is ideal.",
    "Rising dough in a location that is too hot could rush the fermentation process of the yeast, negatively impacting the quality of the bread when finished.",
    "Punch down the dough.",
    "The dough should be poofy and of smooth consistency.",
    "Punch directly into the middle of the doughball from above with your fist until you reach the bottom of the mixing bowl.",
    "Working outward from the center, punch down the dough until you reach the edge of the bowl.",
    "Cut the dough ball in half and knead it again.",
    "Knead the dough in the same fashion you did earlier until it is malleable and smooth.",
    "Use a piece of wire or knife to cut the dough in half.",
    "Shape each half to roughly the size of a single loaf bread pan.",
    "A single loaf bread pan is usually 8.5 by 4.5 by 2.75 inches (21.6 by 11.4 by 7.0 cm).",
    "When the dough is ready, it should look like a miniature loaf or a doughy football.",
    "Grease your bread pans with cooking spray.",
    "Take your bread pans over to the sink and coat their insides completely in cooking spray.",
    "Make sure the insides of each pan are completely coated in a thin layer of spray.",
    "Insert each half into a greased bread pans.",
    "Insert each half of the dough into its own bread pan, then spray the dough with cooking spray.",
    "The dough will need about 55 minutes to rise again.",
    "Moisten the dough as it rises in the bread pans.",
    "If it looks dry, give it a spritz of cooking spray or a fine misting of water.",
    "Cover the dough with a towel as it rises.",
    "However, the dough will eventually expand farther than the top of the pan.",
    "When this happens, remove the towel.",
    "Baking the Bread Preheat your oven to 400 °F (204 °C).",
    "Most ovens take about 15 minutes to preheat.",
    "If your oven does not have a preheat feature, set your oven to 400 °F (204 °C) and check it with an oven thermometer.",
    "Adjust the temperature until the thermometer reads a steady 400 °F (204 °C).",
    "Insert the bread into the oven and lower the heat after 15 minutes.",
    "Allow the bread to bake for 15 minutes at 400 °F (204 °C).",
    "After that, drop the oven temperature to 350 °F (177 °C).",
    "Continue baking at 350 °F (177 °C) for about 35 minutes.",
    "Keep an eye on your bread as it bakes.",
    "Depending on your oven, your dough might bake in more or less time.",
    "After 35 minutes, or when it's golden brown, it can be removed.",
    "Remove the bread, allow it to cool, and it’s ready to eat.",
    "The bread and pans will be hot, so use an oven mitt or potholder to remove them from the oven.",
    "Tilt the bread pans on an angle to remove the baked loaves.",
    "Cut the bread into slices when cooled and enjoy.",
    "Finished."
  ],
  "tyn_section":[
    "Microwave safe bowl",
    "Microwave (or stove)",
    "Pot (optional)",
    "Stirring utensil (like a fork or whisk)",
    "Mixer with dough hook",
    "Cooking spray",
    "Clean dish towel",
    "Spray bottle (filled with clean water; optional)",
    "Oven",
    "Oven mitt (or potholder)"
  ],
  "tyn_model":[
    "flour",
    "milk",
    "mixer",
    "water",
    "cooking spray",
    "oven",
    "bread",
    "mixing bowl",
    "bread pans",
    "yeast",
    "microwave",
    "butter",
    "bowl",
    "sugar",
    "salt",
    "dish towel",
    "towel",
    "microwave safe mixing bowl",
    "sauce pan",
    "knife",
    "single loaf bread pan",
    "bread pan",
    "oven thermometer",
    "pans",
    "oven mitt"
  ],
  "simple_metrics":{
    "r":0.2,
    "p":0.08,
    "f1":0.1142857143,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.24,
    "f1":0.3243243243
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.36,
    "f1":0.45
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.16,
    "f1":0.2285714286
  }
}