{
  "title":"How to Make Nigerian Afang Soup",
  "url":"https://www.wikihow.com/Make-Nigerian-Afang-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Soups"
  ],
  "parts":[
    {
      "name":"Preparing the Okazi Leaves",
      "steps":[
        {
          "headline":"Soak the okazi leaves for several minutes.",
          "description":"Place 5 cups (500 g) of dried okazi leaves in a large bowl. Cover them with hot water, and allow them to soak for at least 10 minutes to soften them a bit. Also known as afang leaves, okazi leaves are a dark green, leafy vegetable with a slight bitter taste that are usually found in Africa, Asia, and South American. You can usually purchase dried okazi leaves in African grocery stores or from online retailers."
        },
        {
          "headline":"Wash the leaves.",
          "description":"After the leaves have soaked for a while, dump out the water. Leave the okazi in the bowl, and run fresh water over them. Use your hands to move the leaves as the water falls over them to clean them thoroughly."
        },
        {
          "headline":"Drain the leaves completely.",
          "description":"Once you’ve washed the leaves, transfer them to a colander to get rid of all of the water. Shake the colander well to ensure that you remove all of the excess moisture. Set the leaves aside for the moment."
        }
      ]
    },
    {
      "name":"Boiling the Meat",
      "steps":[
        {
          "headline":"Combine the water, meat, salt, pepper, maggi, and onion in a pot.",
          "description":"Add 2 to 3 cups (473 to 710 ml) of water, 1 to 2 pounds (454 to 907 g) of cubed beef, ½ medium onion that’s been chopped, 2 maggi cubes, and some salt and pepper to a large stock pot. Mix the ingredients well to ensure that they’re well blended. The amount of water that you use depends on the amount of meat that you use. The meat should be fully covered by the water. You can substitute goat meat for the beef or use assorted meats, such as cow skin, tripe, and the meat, if you prefer. Maggi cubes are concentrated seasoning blocks that are similar to bouillon cubes. They are available at African grocery stores, the international food aisle of some mainstream grocery stores, and many online retailers."
        },
        {
          "headline":"Bring the mixture to a boil.",
          "description":"Place the pot with the mixture on the stove, and turn the heat to medium-high. Allow the mixture to come to a boil, which may take 10 to 15 minutes."
        },
        {
          "headline":"Cook the mixture until the beef is tender.",
          "description":"Once the mixture comes to a boil, lower the heat to medium. Cover the pot, and allow the mixture to simmer until the meat is extremely tender, which should take approximately 1 to 2 hours."
        }
      ]
    },
    {
      "name":"Adding the Fish",
      "steps":[
        {
          "headline":"Mix in the shredded fish, crayfish, pepper, and palm oil.",
          "description":"When the beef is tender, add ½ pound (227 g) of smoked fish, ½ cup (73 g) of crayfish, freshly ground black pepper to taste, and 2 cups (473 ml) of red palm oil to the pot. Stir well to ensure that all of the ingredients are combined. You can use whatever type of smoked fish you like for the soup. Make sure to remove any bones before adding them, though. You can usually find crayfish at seafood markets. Red palm oil is derived from the fruit of the oil palm tree. You can usually find it at health food stores."
        },
        {
          "headline":"Cover the pot and simmer the soup for several minutes.",
          "description":"When all of the ingredients are mixed, place the lid on the pot. Allow the soup to simmer on medium for 10 minutes, so the flavors have time to meld."
        },
        {
          "headline":"Stir well and taste the mixture to adjust seasoning.",
          "description":"After the soup has simmered for a while, mix it up to well to ensure that the flavors are blended. Taste a little of it, and add more salt and pepper if necessary."
        }
      ]
    },
    {
      "name":"Finishing the Soup",
      "steps":[
        {
          "headline":"Blend the okazi leaves to soften and smooth them.",
          "description":"Place the soaked okazi leaves in a blender with 1 to 2 tablespoons (15 to 30 ml) of water. Pulse the leaves several times until they reach your desired level of smoothness. You can substitute a food processor for the blender if you prefer. If you don’t have either, use a sharp knife to chop the leaves extremely finely."
        },
        {
          "headline":"Stir the okazi into the soup.",
          "description":"When the okazi leaves have reached your desired smoothness, add them to the soup mixture. Mix well to ensure that the leaves are fully incorporated."
        },
        {
          "headline":"Add the water leaves.",
          "description":"Stir 6 cups (1350 g) of finely chopped fresh water leaves to the soup. Mix well to ensure that they’re fully incorporated. Water leaves are a common Nigerian leafy vegetable. You may be able to find them at African grocery stores. If you can’t find water leaves, you can substitute spinach."
        },
        {
          "headline":"Simmer the mixture for several minutes.",
          "description":"When all of the ingredients are combined, allow the soup to cook for another 5 to 10 minutes to wilt the greens and blend the flavors. Taste the soup again, and add more salt and pepper if necessary."
        },
        {
          "headline":"Remove the soup from the heat and enjoy.",
          "description":"When you’re happy with the flavor of the soup, take the pot off the heat. Ladle it into bowls, and serve while it’s still hot."
        }
      ]
    }
  ],
  "text":" Preparing the Okazi Leaves Soak the okazi leaves for several minutes. Place 5 cups (500 g) of dried okazi leaves in a large bowl. Cover them with hot water, and allow them to soak for at least 10 minutes to soften them a bit. Also known as afang leaves, okazi leaves are a dark green, leafy vegetable with a slight bitter taste that are usually found in Africa, Asia, and South American. You can usually purchase dried okazi leaves in African grocery stores or from online retailers. Wash the leaves. After the leaves have soaked for a while, dump out the water. Leave the okazi in the bowl, and run fresh water over them. Use your hands to move the leaves as the water falls over them to clean them thoroughly. Drain the leaves completely. Once you’ve washed the leaves, transfer them to a colander to get rid of all of the water. Shake the colander well to ensure that you remove all of the excess moisture. Set the leaves aside for the moment. Boiling the Meat Combine the water, meat, salt, pepper, maggi, and onion in a pot. Add 2 to 3 cups (473 to 710 ml) of water, 1 to 2 pounds (454 to 907 g) of cubed beef, ½ medium onion that’s been chopped, 2 maggi cubes, and some salt and pepper to a large stock pot. Mix the ingredients well to ensure that they’re well blended. The amount of water that you use depends on the amount of meat that you use. The meat should be fully covered by the water. You can substitute goat meat for the beef or use assorted meats, such as cow skin, tripe, and the meat, if you prefer. Maggi cubes are concentrated seasoning blocks that are similar to bouillon cubes. They are available at African grocery stores, the international food aisle of some mainstream grocery stores, and many online retailers. Bring the mixture to a boil. Place the pot with the mixture on the stove, and turn the heat to medium-high. Allow the mixture to come to a boil, which may take 10 to 15 minutes. Cook the mixture until the beef is tender. Once the mixture comes to a boil, lower the heat to medium. Cover the pot, and allow the mixture to simmer until the meat is extremely tender, which should take approximately 1 to 2 hours. Adding the Fish Mix in the shredded fish, crayfish, pepper, and palm oil. When the beef is tender, add ½ pound (227 g) of smoked fish, ½ cup (73 g) of crayfish, freshly ground black pepper to taste, and 2 cups (473 ml) of red palm oil to the pot. Stir well to ensure that all of the ingredients are combined. You can use whatever type of smoked fish you like for the soup. Make sure to remove any bones before adding them, though. You can usually find crayfish at seafood markets. Red palm oil is derived from the fruit of the oil palm tree. You can usually find it at health food stores. Cover the pot and simmer the soup for several minutes. When all of the ingredients are mixed, place the lid on the pot. Allow the soup to simmer on medium for 10 minutes, so the flavors have time to meld. Stir well and taste the mixture to adjust seasoning. After the soup has simmered for a while, mix it up to well to ensure that the flavors are blended. Taste a little of it, and add more salt and pepper if necessary. Finishing the Soup Blend the okazi leaves to soften and smooth them. Place the soaked okazi leaves in a blender with 1 to 2 tablespoons (15 to 30 ml) of water. Pulse the leaves several times until they reach your desired level of smoothness. You can substitute a food processor for the blender if you prefer. If you don’t have either, use a sharp knife to chop the leaves extremely finely. Stir the okazi into the soup. When the okazi leaves have reached your desired smoothness, add them to the soup mixture. Mix well to ensure that the leaves are fully incorporated. Add the water leaves. Stir 6 cups (1350 g) of finely chopped fresh water leaves to the soup. Mix well to ensure that they’re fully incorporated. Water leaves are a common Nigerian leafy vegetable. You may be able to find them at African grocery stores. If you can’t find water leaves, you can substitute spinach. Simmer the mixture for several minutes. When all of the ingredients are combined, allow the soup to cook for another 5 to 10 minutes to wilt the greens and blend the flavors. Taste the soup again, and add more salt and pepper if necessary. Remove the soup from the heat and enjoy. When you’re happy with the flavor of the soup, take the pot off the heat. Ladle it into bowls, and serve while it’s still hot.",
  "sentences":[
    " Preparing the Okazi Leaves Soak the okazi leaves for several minutes.",
    "Place 5 cups (500 g) of dried okazi leaves in a large bowl.",
    "Cover them with hot water, and allow them to soak for at least 10 minutes to soften them a bit.",
    "Also known as afang leaves, okazi leaves are a dark green, leafy vegetable with a slight bitter taste that are usually found in Africa, Asia, and South American.",
    "You can usually purchase dried okazi leaves in African grocery stores or from online retailers.",
    "Wash the leaves.",
    "After the leaves have soaked for a while, dump out the water.",
    "Leave the okazi in the bowl, and run fresh water over them.",
    "Use your hands to move the leaves as the water falls over them to clean them thoroughly.",
    "Drain the leaves completely.",
    "Once you’ve washed the leaves, transfer them to a colander to get rid of all of the water.",
    "Shake the colander well to ensure that you remove all of the excess moisture.",
    "Set the leaves aside for the moment.",
    "Boiling the Meat Combine the water, meat, salt, pepper, maggi, and onion in a pot.",
    "Add 2 to 3 cups (473 to 710 ml) of water, 1 to 2 pounds (454 to 907 g) of cubed beef, ½ medium onion that’s been chopped, 2 maggi cubes, and some salt and pepper to a large stock pot.",
    "Mix the ingredients well to ensure that they’re well blended.",
    "The amount of water that you use depends on the amount of meat that you use.",
    "The meat should be fully covered by the water.",
    "You can substitute goat meat for the beef or use assorted meats, such as cow skin, tripe, and the meat, if you prefer.",
    "Maggi cubes are concentrated seasoning blocks that are similar to bouillon cubes.",
    "They are available at African grocery stores, the international food aisle of some mainstream grocery stores, and many online retailers.",
    "Bring the mixture to a boil.",
    "Place the pot with the mixture on the stove, and turn the heat to medium-high.",
    "Allow the mixture to come to a boil, which may take 10 to 15 minutes.",
    "Cook the mixture until the beef is tender.",
    "Once the mixture comes to a boil, lower the heat to medium.",
    "Cover the pot, and allow the mixture to simmer until the meat is extremely tender, which should take approximately 1 to 2 hours.",
    "Adding the Fish Mix in the shredded fish, crayfish, pepper, and palm oil.",
    "When the beef is tender, add ½ pound (227 g) of smoked fish, ½ cup (73 g) of crayfish, freshly ground black pepper to taste, and 2 cups (473 ml) of red palm oil to the pot.",
    "Stir well to ensure that all of the ingredients are combined.",
    "You can use whatever type of smoked fish you like for the soup.",
    "Make sure to remove any bones before adding them, though.",
    "You can usually find crayfish at seafood markets.",
    "Red palm oil is derived from the fruit of the oil palm tree.",
    "You can usually find it at health food stores.",
    "Cover the pot and simmer the soup for several minutes.",
    "When all of the ingredients are mixed, place the lid on the pot.",
    "Allow the soup to simmer on medium for 10 minutes, so the flavors have time to meld.",
    "Stir well and taste the mixture to adjust seasoning.",
    "After the soup has simmered for a while, mix it up to well to ensure that the flavors are blended.",
    "Taste a little of it, and add more salt and pepper if necessary.",
    "Finishing the Soup Blend the okazi leaves to soften and smooth them.",
    "Place the soaked okazi leaves in a blender with 1 to 2 tablespoons (15 to 30 ml) of water.",
    "Pulse the leaves several times until they reach your desired level of smoothness.",
    "You can substitute a food processor for the blender if you prefer.",
    "If you don’t have either, use a sharp knife to chop the leaves extremely finely.",
    "Stir the okazi into the soup.",
    "When the okazi leaves have reached your desired smoothness, add them to the soup mixture.",
    "Mix well to ensure that the leaves are fully incorporated.",
    "Add the water leaves.",
    "Stir 6 cups (1350 g) of finely chopped fresh water leaves to the soup.",
    "Mix well to ensure that they’re fully incorporated.",
    "Water leaves are a common Nigerian leafy vegetable.",
    "You may be able to find them at African grocery stores.",
    "If you can’t find water leaves, you can substitute spinach.",
    "Simmer the mixture for several minutes.",
    "When all of the ingredients are combined, allow the soup to cook for another 5 to 10 minutes to wilt the greens and blend the flavors.",
    "Taste the soup again, and add more salt and pepper if necessary.",
    "Remove the soup from the heat and enjoy.",
    "When you’re happy with the flavor of the soup, take the pot off the heat.",
    "Ladle it into bowls, and serve while it’s still hot."
  ],
  "tyn_section":[
    "Large bowl",
    "Colander",
    "Large stock pot with lid",
    "Wooden spoon"
  ],
  "tyn_model":[
    "water",
    "pot",
    "pepper",
    "salt and pepper",
    "crayfish",
    "okazi leaves",
    "colander",
    "onion",
    "smoked fish",
    "red palm oil",
    "blender",
    "hot water",
    "bowl",
    "salt",
    "large stock pot",
    "tripe",
    "maggi cubes",
    "bouillon cubes",
    "stove",
    "beef",
    "fish",
    "shredded fish",
    "palm oil",
    "oil palm tree",
    "food processor",
    "okazi",
    "fresh water",
    "water leaves",
    "spinach"
  ],
  "simple_metrics":{
    "r":0.25,
    "p":0.0344827586,
    "f1":0.0606060606,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.1034482759,
    "f1":0.1818181818
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.1034482759,
    "f1":0.1818181818
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0344827586,
    "f1":0.0606060606
  }
}