{
  "title":"How to Grill Bratwurst",
  "url":"https://www.wikihow.com/Grill-Bratwurst",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Sausage"
  ],
  "parts":[
    {
      "name":"Heating up the Grill",
      "steps":[
        {
          "headline":"Clean the grill thoroughly.",
          "description":"Before you kick things off, use a wire grill brush to scrub the grates until they shine. Caked-on char and leftover drippings from past cookouts will increase the likelihood of the sausages sticking. Slide the brush along the grates lengthwise, not straight across. You'll be able scrape off more gunk this way. To deal with heavier buildup, wait until the grill is hot to brush it. The heat will help burn off the worst of the stuck-on mess."
        },
        {
          "headline":"Fire up the grill.",
          "description":"If you're using a gas grill, make sure the tank valve is open and flowing before you ignite the burner. On a charcoal grill, you'll want to get the coals lit and give them a chance to warm up before adding the meat. A medium-low heat of around 300–350 °F (149–177 °C) is ideal. Either type of grill is acceptable, and there shouldn't be much of a difference in the finished flavor. That being said, charcoal is the traditional fan-favorite for the extra tinge of smokiness it imparts. Keeping the grill temperature on the lower side will heat the brats at a steady rate and allow you to take your time getting them just right."
        },
        {
          "headline":"Heat only one side of the grill (optional).",
          "description":"Some grill masters claim that the secret to perfectly cooked brats is creating “heat zones.” To do this, only light the burners on half of the grill, or heap the briquettes over to one side of the grill if you're using charcoal. That way, you'll be able to move the sausages to a \"cold\" zone as needed to keep them from cooking too fast. If you're committed to grilling “low and slow,” zone heating won't be necessary. However, it may make a helpful safety net for inexperienced grillers."
        },
        {
          "headline":"Brush the grill with canola oil.",
          "description":"You don't need to use much—just enough to lightly coat the grates. Like a good cleaning, a little bit of oil will go a long way in preventing the brats from sticking. Try not to apply the oil so heavily that it drips onto the coals or burners. Doing so can produce thick plumes of smoke, which may leave the sausages with a slight burnt taste. Other conventional cooking oils, such as peanut or sunflower, will also do the trick, provided that they have a high smoke point."
        }
      ]
    },
    {
      "name":"Grilling the Brats",
      "steps":[
        {
          "headline":"Arrange the brats on the grill.",
          "description":"Once the grill is nice and hot, it's time to add the meat. Lay out the sausages vertically along the grate. Keep them evenly spaced so they'll heat more evenly and won't bump up against one another. Place all of the brats on the grill at once to make it easier to track their progress. If you decide to use zone heating, it's important that the brats be centered around the active burners or hottest coals."
        },
        {
          "headline":"Grill the brats for 15-20 minutes.",
          "description":"While there's no exact timeframe that you should be shooting for, it will ordinarily take around 15 minutes for the meat to reach a safe internal temperature. Your brats may need slightly more or less time, so use your best judgment instead of leaving it up to the clock. Keep the grill lid up so you can watch the sausages closely. Since brats can vary in size, thickness, density, and juiciness, each batch will cook a little bit differently. If you're grilling pre-cooked brats, they'll really only need to stay on the grill long enough to heat them up."
        },
        {
          "headline":"Turn the brats frequently as they cook.",
          "description":"Use a pair of tongs to gently reposition each sausage every 3-5 minutes. That way, they won't end up burned to a crisp on one side and raw on the other. Quarter turns are best. Otherwise, you'll just be flipping them back and forth between the same two sides. Tongs will be your best friend during the grilling process, as they'll allow you to grip the brats without stabbing them, which releases the succulent juices (and the flavor along with them)."
        },
        {
          "headline":"Keep an eye on the color and texture of the brats.",
          "description":"A perfectly cooked bratwurst will be a dull reddish-brown, with a skin that's just beginning to wrinkle. If you notice yours turning gray or becoming drawn and shriveled, chances are they're overcooked. On the other hand, a sausage that's the right color but still has a smooth exterior may not be cooked all the way through. A firm, taut skin can also be a useful indication that your brats are nearing completion. Unlike a steak or burger, which can cook for minutes on end on each side, brats require that you be a little more vigilant."
        }
      ]
    },
    {
      "name":"Knowing When the Brats are Done",
      "steps":[
        {
          "headline":"Use a meat thermometer to take their temperature.",
          "description":"Stick the thermometer into the center of one of the sausages on the outer edge of the heat to see how they're coming along. You're looking for a temperature of at least 160 °F (71 °C)—any lower and the meat may not be safe to eat. You can take the brats off the grill when they're sufficiently done, or leave them on a little longer if you prefer a crispier finish."
        },
        {
          "headline":"Cut into one of the sausages if necessary.",
          "description":"Assuming you don't have a meat thermometer, or you're worried about sinking your teeth into an undercooked bratwurst, open one up for a closer look. Choose a sacrificial brat and slice into the center just enough to get a glimpse of the color. You can then determine how much longer they need. Breaking the skin of the bratwurst may cause some of the juices to escape. However, it's preferable for them to be a little dry than a little raw. Make the cut as shallow as possible so the sausage doesn't break apart or lose too much flavor."
        },
        {
          "headline":"Move the sausages that are done away from the heat.",
          "description":"Even if you're turning the brats constantly, you may run into the problem of some cooking faster than others. When this happens, relocate them to one of the upper racks to keep them warm while the rest finish. With  zone heating, you can also simply slide them over to the unlit side of the grill."
        },
        {
          "headline":"Remove the brats from the grill and serve.",
          "description":"Bratwursts can be enjoyed solo or on a steamed bun with a squirt of mustard or ketchup. For more of a Midwestern style, try dressing them up with sauerkraut and caramelized onions. Whatever way you choose, be sure to get them while they're hot! Bratwurst is also delicious when paired with sides like potato salad, chili, deviled eggs, baked beans, and grilled peppers and onions."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Heating up the Grill Clean the grill thoroughly. Before you kick things off, use a wire grill brush to scrub the grates until they shine. Caked-on char and leftover drippings from past cookouts will increase the likelihood of the sausages sticking. Slide the brush along the grates lengthwise, not straight across. You'll be able scrape off more gunk this way. To deal with heavier buildup, wait until the grill is hot to brush it. The heat will help burn off the worst of the stuck-on mess. Fire up the grill. If you're using a gas grill, make sure the tank valve is open and flowing before you ignite the burner. On a charcoal grill, you'll want to get the coals lit and give them a chance to warm up before adding the meat. A medium-low heat of around 300–350 °F (149–177 °C) is ideal. Either type of grill is acceptable, and there shouldn't be much of a difference in the finished flavor. That being said, charcoal is the traditional fan-favorite for the extra tinge of smokiness it imparts. Keeping the grill temperature on the lower side will heat the brats at a steady rate and allow you to take your time getting them just right. Heat only one side of the grill (optional). Some grill masters claim that the secret to perfectly cooked brats is creating “heat zones.” To do this, only light the burners on half of the grill, or heap the briquettes over to one side of the grill if you're using charcoal. That way, you'll be able to move the sausages to a \"cold\" zone as needed to keep them from cooking too fast. If you're committed to grilling “low and slow,” zone heating won't be necessary. However, it may make a helpful safety net for inexperienced grillers. Brush the grill with canola oil. You don't need to use much—just enough to lightly coat the grates. Like a good cleaning, a little bit of oil will go a long way in preventing the brats from sticking. Try not to apply the oil so heavily that it drips onto the coals or burners. Doing so can produce thick plumes of smoke, which may leave the sausages with a slight burnt taste. Other conventional cooking oils, such as peanut or sunflower, will also do the trick, provided that they have a high smoke point. Grilling the Brats Arrange the brats on the grill. Once the grill is nice and hot, it's time to add the meat. Lay out the sausages vertically along the grate. Keep them evenly spaced so they'll heat more evenly and won't bump up against one another. Place all of the brats on the grill at once to make it easier to track their progress. If you decide to use zone heating, it's important that the brats be centered around the active burners or hottest coals. Grill the brats for 15-20 minutes. While there's no exact timeframe that you should be shooting for, it will ordinarily take around 15 minutes for the meat to reach a safe internal temperature. Your brats may need slightly more or less time, so use your best judgment instead of leaving it up to the clock. Keep the grill lid up so you can watch the sausages closely. Since brats can vary in size, thickness, density, and juiciness, each batch will cook a little bit differently. If you're grilling pre-cooked brats, they'll really only need to stay on the grill long enough to heat them up. Turn the brats frequently as they cook. Use a pair of tongs to gently reposition each sausage every 3-5 minutes. That way, they won't end up burned to a crisp on one side and raw on the other. Quarter turns are best. Otherwise, you'll just be flipping them back and forth between the same two sides. Tongs will be your best friend during the grilling process, as they'll allow you to grip the brats without stabbing them, which releases the succulent juices (and the flavor along with them). Keep an eye on the color and texture of the brats. A perfectly cooked bratwurst will be a dull reddish-brown, with a skin that's just beginning to wrinkle. If you notice yours turning gray or becoming drawn and shriveled, chances are they're overcooked. On the other hand, a sausage that's the right color but still has a smooth exterior may not be cooked all the way through. A firm, taut skin can also be a useful indication that your brats are nearing completion. Unlike a steak or burger, which can cook for minutes on end on each side, brats require that you be a little more vigilant. Knowing When the Brats are Done Use a meat thermometer to take their temperature. Stick the thermometer into the center of one of the sausages on the outer edge of the heat to see how they're coming along. You're looking for a temperature of at least 160 °F (71 °C)—any lower and the meat may not be safe to eat. You can take the brats off the grill when they're sufficiently done, or leave them on a little longer if you prefer a crispier finish. Cut into one of the sausages if necessary. Assuming you don't have a meat thermometer, or you're worried about sinking your teeth into an undercooked bratwurst, open one up for a closer look. Choose a sacrificial brat and slice into the center just enough to get a glimpse of the color. You can then determine how much longer they need. Breaking the skin of the bratwurst may cause some of the juices to escape. However, it's preferable for them to be a little dry than a little raw. Make the cut as shallow as possible so the sausage doesn't break apart or lose too much flavor. Move the sausages that are done away from the heat. Even if you're turning the brats constantly, you may run into the problem of some cooking faster than others. When this happens, relocate them to one of the upper racks to keep them warm while the rest finish. With  zone heating, you can also simply slide them over to the unlit side of the grill. Remove the brats from the grill and serve. Bratwursts can be enjoyed solo or on a steamed bun with a squirt of mustard or ketchup. For more of a Midwestern style, try dressing them up with sauerkraut and caramelized onions. Whatever way you choose, be sure to get them while they're hot! Bratwurst is also delicious when paired with sides like potato salad, chili, deviled eggs, baked beans, and grilled peppers and onions. Finished. ",
  "sentences":[
    " Heating up the Grill Clean the grill thoroughly.",
    "Before you kick things off, use a wire grill brush to scrub the grates until they shine.",
    "Caked-on char and leftover drippings from past cookouts will increase the likelihood of the sausages sticking.",
    "Slide the brush along the grates lengthwise, not straight across.",
    "You'll be able scrape off more gunk this way.",
    "To deal with heavier buildup, wait until the grill is hot to brush it.",
    "The heat will help burn off the worst of the stuck-on mess.",
    "Fire up the grill.",
    "If you're using a gas grill, make sure the tank valve is open and flowing before you ignite the burner.",
    "On a charcoal grill, you'll want to get the coals lit and give them a chance to warm up before adding the meat.",
    "A medium-low heat of around 300–350 °F (149–177 °C) is ideal.",
    "Either type of grill is acceptable, and there shouldn't be much of a difference in the finished flavor.",
    "That being said, charcoal is the traditional fan-favorite for the extra tinge of smokiness it imparts.",
    "Keeping the grill temperature on the lower side will heat the brats at a steady rate and allow you to take your time getting them just right.",
    "Heat only one side of the grill (optional).",
    "Some grill masters claim that the secret to perfectly cooked brats is creating “heat zones.” To do this, only light the burners on half of the grill, or heap the briquettes over to one side of the grill if you're using charcoal.",
    "That way, you'll be able to move the sausages to a \"cold\" zone as needed to keep them from cooking too fast.",
    "If you're committed to grilling “low and slow,” zone heating won't be necessary.",
    "However, it may make a helpful safety net for inexperienced grillers.",
    "Brush the grill with canola oil.",
    "You don't need to use much—just enough to lightly coat the grates.",
    "Like a good cleaning, a little bit of oil will go a long way in preventing the brats from sticking.",
    "Try not to apply the oil so heavily that it drips onto the coals or burners.",
    "Doing so can produce thick plumes of smoke, which may leave the sausages with a slight burnt taste.",
    "Other conventional cooking oils, such as peanut or sunflower, will also do the trick, provided that they have a high smoke point.",
    "Grilling the Brats Arrange the brats on the grill.",
    "Once the grill is nice and hot, it's time to add the meat.",
    "Lay out the sausages vertically along the grate.",
    "Keep them evenly spaced so they'll heat more evenly and won't bump up against one another.",
    "Place all of the brats on the grill at once to make it easier to track their progress.",
    "If you decide to use zone heating, it's important that the brats be centered around the active burners or hottest coals.",
    "Grill the brats for 15-20 minutes.",
    "While there's no exact timeframe that you should be shooting for, it will ordinarily take around 15 minutes for the meat to reach a safe internal temperature.",
    "Your brats may need slightly more or less time, so use your best judgment instead of leaving it up to the clock.",
    "Keep the grill lid up so you can watch the sausages closely.",
    "Since brats can vary in size, thickness, density, and juiciness, each batch will cook a little bit differently.",
    "If you're grilling pre-cooked brats, they'll really only need to stay on the grill long enough to heat them up.",
    "Turn the brats frequently as they cook.",
    "Use a pair of tongs to gently reposition each sausage every 3-5 minutes.",
    "That way, they won't end up burned to a crisp on one side and raw on the other.",
    "Quarter turns are best.",
    "Otherwise, you'll just be flipping them back and forth between the same two sides.",
    "Tongs will be your best friend during the grilling process, as they'll allow you to grip the brats without stabbing them, which releases the succulent juices (and the flavor along with them).",
    "Keep an eye on the color and texture of the brats.",
    "A perfectly cooked bratwurst will be a dull reddish-brown, with a skin that's just beginning to wrinkle.",
    "If you notice yours turning gray or becoming drawn and shriveled, chances are they're overcooked.",
    "On the other hand, a sausage that's the right color but still has a smooth exterior may not be cooked all the way through.",
    "A firm, taut skin can also be a useful indication that your brats are nearing completion.",
    "Unlike a steak or burger, which can cook for minutes on end on each side, brats require that you be a little more vigilant.",
    "Knowing When the Brats are Done Use a meat thermometer to take their temperature.",
    "Stick the thermometer into the center of one of the sausages on the outer edge of the heat to see how they're coming along.",
    "You're looking for a temperature of at least 160 °F (71 °C)—any lower and the meat may not be safe to eat.",
    "You can take the brats off the grill when they're sufficiently done, or leave them on a little longer if you prefer a crispier finish.",
    "Cut into one of the sausages if necessary.",
    "Assuming you don't have a meat thermometer, or you're worried about sinking your teeth into an undercooked bratwurst, open one up for a closer look.",
    "Choose a sacrificial brat and slice into the center just enough to get a glimpse of the color.",
    "You can then determine how much longer they need.",
    "Breaking the skin of the bratwurst may cause some of the juices to escape.",
    "However, it's preferable for them to be a little dry than a little raw.",
    "Make the cut as shallow as possible so the sausage doesn't break apart or lose too much flavor.",
    "Move the sausages that are done away from the heat.",
    "Even if you're turning the brats constantly, you may run into the problem of some cooking faster than others.",
    "When this happens, relocate them to one of the upper racks to keep them warm while the rest finish.",
    "With  zone heating, you can also simply slide them over to the unlit side of the grill.",
    "Remove the brats from the grill and serve.",
    "Bratwursts can be enjoyed solo or on a steamed bun with a squirt of mustard or ketchup.",
    "For more of a Midwestern style, try dressing them up with sauerkraut and caramelized onions.",
    "Whatever way you choose, be sure to get them while they're hot!",
    "Bratwurst is also delicious when paired with sides like potato salad, chili, deviled eggs, baked beans, and grilled peppers and onions.",
    "Finished."
  ],
  "tyn_section":[
    "Fresh or packaged bratwursts",
    "Gas or charcoal grill",
    "Metal tongs",
    "Grill brush",
    "Meat thermometer",
    "Canola oil",
    "Lighter fluid"
  ],
  "tyn_model":[
    "grill",
    "sausage",
    "bratwurst",
    "sausages",
    "charcoal",
    "oil",
    "tongs",
    "meat thermometer",
    "wire grill brush",
    "gas grill",
    "charcoal grill",
    "“heat",
    "” to",
    "“low",
    "” zone",
    "canola oil",
    "—just",
    "cooking oils",
    "coals",
    "brats",
    "thermometer",
    "mustard",
    "sauerkraut",
    "chili",
    "deviled eggs",
    "baked beans",
    "grilled peppers"
  ],
  "simple_metrics":{
    "r":0.2857142857,
    "p":0.0740740741,
    "f1":0.1176470588,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.3333333333,
    "f1":0.4545454545
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.3333333333,
    "f1":0.4545454545
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.1111111111,
    "f1":0.1764705882
  }
}