{
  "title":"How to Cook Pininyahang Manok",
  "url":"https://www.wikihow.com/Cook-Pininyahang-Manok",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Philippine Dishes"
  ],
  "methods":[
    {
      "name":"Making Pininyahang Manok With Tomato Sauce",
      "steps":[
        {
          "headline":"Heat the oil and chop the ginger, garlic, and onion.",
          "description":"Pour 2 tablespoons (30 ml) of oil into a large skillet and turn the heat to medium. While the oil heats, peel 2-inches (5 cm) of fresh ginger, 3 cloves of garlic, and 1 small onion. Mince the garlic and ginger. You should get 2 tablespoons (12 g) of minced ginger. You'll also need to slice the onion into thin strips."
        },
        {
          "headline":"Sauté the ginger, garlic, and onion for five to seven minutes.",
          "description":"Place the ginger, garlic, and onion in the hot oil and stir the mixture. Sauté and stir the mixture until the onion softens a little. This should take five to seven minutes."
        },
        {
          "headline":"Add the chicken thighs and fish sauce.",
          "description":"Get out 1.1 pounds (500 g) of chicken thighs and lay them in the skillet, so they're in a single layer. Stir in 2 tablespoons (30 ml) of fish sauce (patis)."
        },
        {
          "headline":"Brown the chicken for 10 minutes.",
          "description":"Cook the chicken thighs over medium heat for 5 minutes. Use tongs to turn the chicken thighs over and cook them for another 5 minutes, so they're browned on both sides."
        },
        {
          "headline":"Stir in tomato sauce and bring the mixture to a boil.",
          "description":"Pour in 1 cup (225 g) of tomato sauce and salt and pepper according to your taste. Stir the chicken mixture well and turn the heat up to medium-high, so the mixture begins to boil."
        },
        {
          "headline":"Simmer the chicken mixture for 15 minutes.",
          "description":"Turn the heat down to medium or medium-low so the mixture bubbles gently. Simmer the chicken for 15 minutes. It should finish cooking and become tender. You can check the internal temperature of the chicken thighs using an instant-read thermometer. The chicken is finished cooking once it reaches 160 °F (71 °C)."
        },
        {
          "headline":"Stir in the pineapple with the juice and simmer the mixture for five to ten minutes.",
          "description":"Open 1 14-ounce or 400 g can of pineapple chunks. Stir the pineapple chunks and its juice into the pot. Simmer the pininyahang manok for five to ten minutes."
        },
        {
          "headline":"Serve the pininyahang manok.",
          "description":"Once the pineapple is hot, you can serve the dish. Consider serving pininyahang manok with steamed rice, tortillas, boiled potatoes, or noodles. Store leftover pininyahang manok in an airtight container in the refrigerator for three to four days."
        }
      ]
    },
    {
      "name":"Making Pininyahang Manok With Coconut Milk",
      "steps":[
        {
          "headline":"Drain the pineapple juice and combine it with the chicken pieces.",
          "description":"Open one 14-ounce or 400 g can of pineapple chunks and drain the juice into a shallow dish. Set the pineapple chunks aside. Get out 1½ pounds (680 g) of chicken pieces and place them in the dish with the pineapple juice."
        },
        {
          "headline":"Marinate the chicken in the juice for at least 30 minutes.",
          "description":"Cover the dish with plastic wrap and refrigerate the chicken in the pineapple juice for at least 30 minutes or up to 2 hours."
        },
        {
          "headline":"Heat the oil and chop the onion, tomato, and garlic.",
          "description":"Pour 3 tablespoons (45 ml) of cooking oil into a large pot and turn the heat to medium. Peel 1 small onion and dice it into small 1/2-inch (12 mm) pieces. You'll also need to dice 1 medium plum or roma tomato. Mince enough garlic to get 1 teaspoon (2 g)."
        },
        {
          "headline":"Sauté the onion, tomato, and garlic for five minutes.",
          "description":"Put the diced onion, tomato, and garlic into the hot oil and stir the vegetables as they cook. Sauté the mixture over medium heat until the onion softens a little and the garlic smells fragrant. This should take about 5 minutes."
        },
        {
          "headline":"Stir in ground pepper and add the marinated chicken pieces.",
          "description":"Stir ¼ teaspoon (0.5 g) of ground black pepper into the vegetable mixture and remove the marinated chicken from the refrigerator. Place the pieces of chicken in the pot in a single layer."
        },
        {
          "headline":"Sear the chicken pieces for 6 to 8 minutes.",
          "description":"Turn the heat up to medium-high and brown the chicken for 3 to 4 minutes. Use tongs to turn the chicken pieces over, so they brown on the other side. This should take another 3 to 4 minutes."
        },
        {
          "headline":"Pour the pineapple juice into the pot and bring it to a boil.",
          "description":"Pour the pineapple juice from the marinating dish into the pot with the chicken pieces and vegetables. Heat the mixture over medium-high heat until the pineapple juice boils."
        },
        {
          "headline":"Stir in the coconut milk and reduce the heat.",
          "description":"Pour in 1 cup (240 ml) of coconut milk and turn the heat down to medium. The liquids in the pot should bubble gently. If you prefer to make a classic pininyahang manok, you could use milk or evaporated milk instead of coconut milk."
        },
        {
          "headline":"Cover and simmer the chicken for 40 minutes.",
          "description":"Put the lid on the pot and let the chicken mixture bubble gently until the chicken pieces are completely cooked. This should take about 40 minutes or until they reach 160 °F (71 °C) with an instant read thermometer."
        },
        {
          "headline":"Stir in the fish sauce and pineapple chunks.",
          "description":"Stir in 1½ tablespoons (22 ml) of fish sauce and the reserved pineapple chunks from the can. Keep simmering the mixture over medium heat for another five minutes."
        },
        {
          "headline":"Add the carrots and simmer the mixture for 5 more minutes.",
          "description":"Peel 2 small carrots and use a knife to slice them into 1/2 inch (12 mm) thick diagonal slices. Stir the carrot slices into the pot and simmer the chicken mixture for another 5 minutes."
        },
        {
          "headline":"Add the bell peppers and simmer them for three minutes.",
          "description":"Wash and trim the stems from 1 small red bell pepper and 1 small green bell pepper. Rinse out the seeds and use a knife to slice the peppers into 1-inch (2.5 cm) chunks. Stir the peppers into the pot and simmer the mixture for three more minutes, so the vegetables soften."
        },
        {
          "headline":"Serve the pininyahang manok.",
          "description":"Once the vegetables soften a little, serve the pininyahang manok while it's still hot. Consider serving the dish with steamed rice, boiled potatoes, or rustic bread. Store the leftover pininyahang manok in an airtight container in the refrigerator for three to four days."
        }
      ]
    }
  ],
  "text":" Making Pininyahang Manok With Tomato Sauce Heat the oil and chop the ginger, garlic, and onion. Pour 2 tablespoons (30 ml) of oil into a large skillet and turn the heat to medium. While the oil heats, peel 2-inches (5 cm) of fresh ginger, 3 cloves of garlic, and 1 small onion. Mince the garlic and ginger. You should get 2 tablespoons (12 g) of minced ginger. You'll also need to slice the onion into thin strips. Sauté the ginger, garlic, and onion for five to seven minutes. Place the ginger, garlic, and onion in the hot oil and stir the mixture. Sauté and stir the mixture until the onion softens a little. This should take five to seven minutes. Add the chicken thighs and fish sauce. Get out 1.1 pounds (500 g) of chicken thighs and lay them in the skillet, so they're in a single layer. Stir in 2 tablespoons (30 ml) of fish sauce (patis). Brown the chicken for 10 minutes. Cook the chicken thighs over medium heat for 5 minutes. Use tongs to turn the chicken thighs over and cook them for another 5 minutes, so they're browned on both sides. Stir in tomato sauce and bring the mixture to a boil. Pour in 1 cup (225 g) of tomato sauce and salt and pepper according to your taste. Stir the chicken mixture well and turn the heat up to medium-high, so the mixture begins to boil. Simmer the chicken mixture for 15 minutes. Turn the heat down to medium or medium-low so the mixture bubbles gently. Simmer the chicken for 15 minutes. It should finish cooking and become tender. You can check the internal temperature of the chicken thighs using an instant-read thermometer. The chicken is finished cooking once it reaches 160 °F (71 °C). Stir in the pineapple with the juice and simmer the mixture for five to ten minutes. Open 1 14-ounce or 400 g can of pineapple chunks. Stir the pineapple chunks and its juice into the pot. Simmer the pininyahang manok for five to ten minutes. Serve the pininyahang manok. Once the pineapple is hot, you can serve the dish. Consider serving pininyahang manok with steamed rice, tortillas, boiled potatoes, or noodles. Store leftover pininyahang manok in an airtight container in the refrigerator for three to four days. Making Pininyahang Manok With Coconut Milk Drain the pineapple juice and combine it with the chicken pieces. Open one 14-ounce or 400 g can of pineapple chunks and drain the juice into a shallow dish. Set the pineapple chunks aside. Get out 1½ pounds (680 g) of chicken pieces and place them in the dish with the pineapple juice. Marinate the chicken in the juice for at least 30 minutes. Cover the dish with plastic wrap and refrigerate the chicken in the pineapple juice for at least 30 minutes or up to 2 hours. Heat the oil and chop the onion, tomato, and garlic. Pour 3 tablespoons (45 ml) of cooking oil into a large pot and turn the heat to medium. Peel 1 small onion and dice it into small 1/2-inch (12 mm) pieces. You'll also need to dice 1 medium plum or roma tomato. Mince enough garlic to get 1 teaspoon (2 g). Sauté the onion, tomato, and garlic for five minutes. Put the diced onion, tomato, and garlic into the hot oil and stir the vegetables as they cook. Sauté the mixture over medium heat until the onion softens a little and the garlic smells fragrant. This should take about 5 minutes. Stir in ground pepper and add the marinated chicken pieces. Stir ¼ teaspoon (0.5 g) of ground black pepper into the vegetable mixture and remove the marinated chicken from the refrigerator. Place the pieces of chicken in the pot in a single layer. Sear the chicken pieces for 6 to 8 minutes. Turn the heat up to medium-high and brown the chicken for 3 to 4 minutes. Use tongs to turn the chicken pieces over, so they brown on the other side. This should take another 3 to 4 minutes. Pour the pineapple juice into the pot and bring it to a boil. Pour the pineapple juice from the marinating dish into the pot with the chicken pieces and vegetables. Heat the mixture over medium-high heat until the pineapple juice boils. Stir in the coconut milk and reduce the heat. Pour in 1 cup (240 ml) of coconut milk and turn the heat down to medium. The liquids in the pot should bubble gently. If you prefer to make a classic pininyahang manok, you could use milk or evaporated milk instead of coconut milk. Cover and simmer the chicken for 40 minutes. Put the lid on the pot and let the chicken mixture bubble gently until the chicken pieces are completely cooked. This should take about 40 minutes or until they reach 160 °F (71 °C) with an instant read thermometer. Stir in the fish sauce and pineapple chunks. Stir in 1½ tablespoons (22 ml) of fish sauce and the reserved pineapple chunks from the can. Keep simmering the mixture over medium heat for another five minutes. Add the carrots and simmer the mixture for 5 more minutes. Peel 2 small carrots and use a knife to slice them into 1/2 inch (12 mm) thick diagonal slices. Stir the carrot slices into the pot and simmer the chicken mixture for another 5 minutes. Add the bell peppers and simmer them for three minutes. Wash and trim the stems from 1 small red bell pepper and 1 small green bell pepper. Rinse out the seeds and use a knife to slice the peppers into 1-inch (2.5 cm) chunks. Stir the peppers into the pot and simmer the mixture for three more minutes, so the vegetables soften. Serve the pininyahang manok. Once the vegetables soften a little, serve the pininyahang manok while it's still hot. Consider serving the dish with steamed rice, boiled potatoes, or rustic bread. Store the leftover pininyahang manok in an airtight container in the refrigerator for three to four days.",
  "sentences":[
    " Making Pininyahang Manok With Tomato Sauce Heat the oil and chop the ginger, garlic, and onion.",
    "Pour 2 tablespoons (30 ml) of oil into a large skillet and turn the heat to medium.",
    "While the oil heats, peel 2-inches (5 cm) of fresh ginger, 3 cloves of garlic, and 1 small onion.",
    "Mince the garlic and ginger.",
    "You should get 2 tablespoons (12 g) of minced ginger.",
    "You'll also need to slice the onion into thin strips.",
    "Sauté the ginger, garlic, and onion for five to seven minutes.",
    "Place the ginger, garlic, and onion in the hot oil and stir the mixture.",
    "Sauté and stir the mixture until the onion softens a little.",
    "This should take five to seven minutes.",
    "Add the chicken thighs and fish sauce.",
    "Get out 1.1 pounds (500 g) of chicken thighs and lay them in the skillet, so they're in a single layer.",
    "Stir in 2 tablespoons (30 ml) of fish sauce (patis).",
    "Brown the chicken for 10 minutes.",
    "Cook the chicken thighs over medium heat for 5 minutes.",
    "Use tongs to turn the chicken thighs over and cook them for another 5 minutes, so they're browned on both sides.",
    "Stir in tomato sauce and bring the mixture to a boil.",
    "Pour in 1 cup (225 g) of tomato sauce and salt and pepper according to your taste.",
    "Stir the chicken mixture well and turn the heat up to medium-high, so the mixture begins to boil.",
    "Simmer the chicken mixture for 15 minutes.",
    "Turn the heat down to medium or medium-low so the mixture bubbles gently.",
    "Simmer the chicken for 15 minutes.",
    "It should finish cooking and become tender.",
    "You can check the internal temperature of the chicken thighs using an instant-read thermometer.",
    "The chicken is finished cooking once it reaches 160 °F (71 °C).",
    "Stir in the pineapple with the juice and simmer the mixture for five to ten minutes.",
    "Open 1 14-ounce or 400 g can of pineapple chunks.",
    "Stir the pineapple chunks and its juice into the pot.",
    "Simmer the pininyahang manok for five to ten minutes.",
    "Serve the pininyahang manok.",
    "Once the pineapple is hot, you can serve the dish.",
    "Consider serving pininyahang manok with steamed rice, tortillas, boiled potatoes, or noodles.",
    "Store leftover pininyahang manok in an airtight container in the refrigerator for three to four days.",
    "Making Pininyahang Manok With Coconut Milk Drain the pineapple juice and combine it with the chicken pieces.",
    "Open one 14-ounce or 400 g can of pineapple chunks and drain the juice into a shallow dish.",
    "Set the pineapple chunks aside.",
    "Get out 1½ pounds (680 g) of chicken pieces and place them in the dish with the pineapple juice.",
    "Marinate the chicken in the juice for at least 30 minutes.",
    "Cover the dish with plastic wrap and refrigerate the chicken in the pineapple juice for at least 30 minutes or up to 2 hours.",
    "Heat the oil and chop the onion, tomato, and garlic.",
    "Pour 3 tablespoons (45 ml) of cooking oil into a large pot and turn the heat to medium.",
    "Peel 1 small onion and dice it into small 1/2-inch (12 mm) pieces.",
    "You'll also need to dice 1 medium plum or roma tomato.",
    "Mince enough garlic to get 1 teaspoon (2 g).",
    "Sauté the onion, tomato, and garlic for five minutes.",
    "Put the diced onion, tomato, and garlic into the hot oil and stir the vegetables as they cook.",
    "Sauté the mixture over medium heat until the onion softens a little and the garlic smells fragrant.",
    "This should take about 5 minutes.",
    "Stir in ground pepper and add the marinated chicken pieces.",
    "Stir ¼ teaspoon (0.5 g) of ground black pepper into the vegetable mixture and remove the marinated chicken from the refrigerator.",
    "Place the pieces of chicken in the pot in a single layer.",
    "Sear the chicken pieces for 6 to 8 minutes.",
    "Turn the heat up to medium-high and brown the chicken for 3 to 4 minutes.",
    "Use tongs to turn the chicken pieces over, so they brown on the other side.",
    "This should take another 3 to 4 minutes.",
    "Pour the pineapple juice into the pot and bring it to a boil.",
    "Pour the pineapple juice from the marinating dish into the pot with the chicken pieces and vegetables.",
    "Heat the mixture over medium-high heat until the pineapple juice boils.",
    "Stir in the coconut milk and reduce the heat.",
    "Pour in 1 cup (240 ml) of coconut milk and turn the heat down to medium.",
    "The liquids in the pot should bubble gently.",
    "If you prefer to make a classic pininyahang manok, you could use milk or evaporated milk instead of coconut milk.",
    "Cover and simmer the chicken for 40 minutes.",
    "Put the lid on the pot and let the chicken mixture bubble gently until the chicken pieces are completely cooked.",
    "This should take about 40 minutes or until they reach 160 °F (71 °C) with an instant read thermometer.",
    "Stir in the fish sauce and pineapple chunks.",
    "Stir in 1½ tablespoons (22 ml) of fish sauce and the reserved pineapple chunks from the can.",
    "Keep simmering the mixture over medium heat for another five minutes.",
    "Add the carrots and simmer the mixture for 5 more minutes.",
    "Peel 2 small carrots and use a knife to slice them into 1/2 inch (12 mm) thick diagonal slices.",
    "Stir the carrot slices into the pot and simmer the chicken mixture for another 5 minutes.",
    "Add the bell peppers and simmer them for three minutes.",
    "Wash and trim the stems from 1 small red bell pepper and 1 small green bell pepper.",
    "Rinse out the seeds and use a knife to slice the peppers into 1-inch (2.5 cm) chunks.",
    "Stir the peppers into the pot and simmer the mixture for three more minutes, so the vegetables soften.",
    "Serve the pininyahang manok.",
    "Once the vegetables soften a little, serve the pininyahang manok while it's still hot.",
    "Consider serving the dish with steamed rice, boiled potatoes, or rustic bread.",
    "Store the leftover pininyahang manok in an airtight container in the refrigerator for three to four days."
  ],
  "tyn_section":[
    "Pininyahang Manok With Tomato Sauce",
    "Measuring cups and spoons",
    "Digital scale",
    "Knife and cutting board",
    "Large skillet",
    "Tongs",
    "Spoon",
    "Instant-read thermometer, optional",
    "Pininyahang Manok With Coconut Milk",
    "Shallow dish",
    "Can opener",
    "Plastic wrap",
    "Large pot with lid"
  ],
  "tyn_model":[
    "chicken",
    "garlic",
    "onion",
    "pot",
    "oil",
    "pineapple",
    "ginger",
    "pineapple juice",
    "fish sauce",
    "coconut milk",
    "tomato",
    "tomato sauce",
    "pineapple chunks",
    "refrigerator",
    "chicken thighs",
    "steamed rice",
    "boiled potatoes",
    "airtight container",
    "vegetables",
    "carrots",
    "knife",
    "peppers",
    "large skillet",
    "fresh ginger",
    "skillet",
    "patis",
    "salt and pepper",
    "instant-read thermometer",
    "tortillas",
    "noodles",
    "shallow dish",
    "plastic wrap",
    "cooking oil",
    "large pot",
    "ground pepper",
    "ground black pepper",
    "vegetable",
    "marinating dish",
    "milk",
    "evaporated milk",
    "instant read thermometer",
    "carrot",
    "bell peppers",
    "green bell pepper"
  ],
  "simple_metrics":{
    "r":0.2307692308,
    "p":0.0681818182,
    "f1":0.1052631579,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3076923077,
    "p":0.1136363636,
    "f1":0.1659751037
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4615384615,
    "p":0.1818181818,
    "f1":0.2608695652
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2307692308,
    "p":0.0681818182,
    "f1":0.1052631579
  }
}