{
  "title":"How to Make a Woodwick Candle out of Leftover Candle Wax",
  "url":"https://www.wikihow.com/Make-a-Woodwick-Candle-out-of-Leftover-Candle-Wax",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Candles"
  ],
  "parts":[
    {
      "name":"Preparing the Wicks",
      "steps":[
        {
          "headline":"Trim the wood wick.",
          "description":"Take the scissors and snip the balsa wood stick. Cut the stick so that it is about 1/4 above the top of the new candle jar. The wick can be trimmed up later if needed after the wax has been poured and hardened. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/65\\/IMG_2718.jpg\\/460px-IMG_2718.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/65\\/IMG_2718.jpg\",\"smallWidth\":460,\"smallHeight\":532,\"bigWidth\":760,\"bigHeight\":879.3388429752066,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Soak it in olive oil.",
          "description":"Place trimmed balsa wood sticks into the small bowl of olive oil. Soak them in the olive oil for 20 minutes. The oil soaks into the wood which helps with the burning quality of the wick. This process will aid in the crackling fire sound that is achieved with wood wick candles."
        },
        {
          "headline":"Dry off the wood wick.",
          "description":"Remove from oil and wipe clean with a paper towel. Having a wick that is overly saturated with oil will take a longer time."
        },
        {
          "headline":"Place wood wick into wood clip/tab.",
          "description":"Place the oil treated wood pieces into a wick clip. Squeezing the open part of the clip around the wick will ensure a firm grip and lessen the chance of the wick falling over while oil is being poured around it."
        },
        {
          "headline":"Insert wood wick into jar.",
          "description":"Using the wax adhesive, press the wick clip firmly onto the bottom center of the empty glass jar. If it is a larger candle more wicks can be added. Try to keep the wicks at least a half of an inch apart."
        }
      ]
    },
    {
      "name":"Melting Old Candle Wax and Creating New Candle",
      "steps":[
        {
          "headline":"Put water in saucepan.",
          "description":"Take small saucepan and fill with a small amount of water."
        },
        {
          "headline":"Use the double boiler method.",
          "description":"Place used candle in saucepan. Make sure the candle is not floating. If candle floats, pour a little water out of saucepan till candle stands up."
        },
        {
          "headline":"Heat the wax.",
          "description":"Heat saucepan of water and candle on stove over a low heat until wax is melted. Wax should be semi-clear or transparent. Fragrant oil can be added at this time to make it scented."
        },
        {
          "headline":"Remove the hot pan.",
          "description":"Wearing heat-safe gloves, a hot pad, or oven mitt, carefully remove saucepan from stove top, then carefully remove the melted candle out of pot."
        },
        {
          "headline":"Pour in the hot wax.",
          "description":"Slowly pour the hot wax into the wood wick prepared glass jar, filling the jar to the base of the rim. If more wax is needed to fill completely, repeat steps 1-4."
        },
        {
          "headline":"Allow the wax to harden and cool completely.",
          "description":"This will take approximately four to six hours. You could place them on a cookie sheet or glass plate and store them in the fridge for about 2 hours till the wax is firm and the glass is no longer warm to the touch."
        },
        {
          "headline":"Light and enjoy.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Wicks Trim the wood wick. Take the scissors and snip the balsa wood stick. Cut the stick so that it is about 1/4 above the top of the new candle jar. The wick can be trimmed up later if needed after the wax has been poured and hardened. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/65\\/IMG_2718.jpg\\/460px-IMG_2718.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/65\\/IMG_2718.jpg\",\"smallWidth\":460,\"smallHeight\":532,\"bigWidth\":760,\"bigHeight\":879.3388429752066,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"} Soak it in olive oil. Place trimmed balsa wood sticks into the small bowl of olive oil. Soak them in the olive oil for 20 minutes. The oil soaks into the wood which helps with the burning quality of the wick. This process will aid in the crackling fire sound that is achieved with wood wick candles. Dry off the wood wick. Remove from oil and wipe clean with a paper towel. Having a wick that is overly saturated with oil will take a longer time. Place wood wick into wood clip/tab. Place the oil treated wood pieces into a wick clip. Squeezing the open part of the clip around the wick will ensure a firm grip and lessen the chance of the wick falling over while oil is being poured around it. Insert wood wick into jar. Using the wax adhesive, press the wick clip firmly onto the bottom center of the empty glass jar. If it is a larger candle more wicks can be added. Try to keep the wicks at least a half of an inch apart. Melting Old Candle Wax and Creating New Candle Put water in saucepan. Take small saucepan and fill with a small amount of water. Use the double boiler method. Place used candle in saucepan. Make sure the candle is not floating. If candle floats, pour a little water out of saucepan till candle stands up. Heat the wax. Heat saucepan of water and candle on stove over a low heat until wax is melted. Wax should be semi-clear or transparent. Fragrant oil can be added at this time to make it scented. Remove the hot pan. Wearing heat-safe gloves, a hot pad, or oven mitt, carefully remove saucepan from stove top, then carefully remove the melted candle out of pot. Pour in the hot wax. Slowly pour the hot wax into the wood wick prepared glass jar, filling the jar to the base of the rim. If more wax is needed to fill completely, repeat steps 1-4. Allow the wax to harden and cool completely. This will take approximately four to six hours. You could place them on a cookie sheet or glass plate and store them in the fridge for about 2 hours till the wax is firm and the glass is no longer warm to the touch. Light and enjoy. ",
  "sentences":[
    " Preparing the Wicks Trim the wood wick.",
    "Take the scissors and snip the balsa wood stick.",
    "Cut the stick so that it is about 1/4 above the top of the new candle jar.",
    "The wick can be trimmed up later if needed after the wax has been poured and hardened.",
    "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/65\\/IMG_2718.jpg\\/460px-IMG_2718.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/65\\/IMG_2718.jpg\",\"smallWidth\":460,\"smallHeight\":532,\"bigWidth\":760,\"bigHeight\":879.3388429752066,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"} Soak it in olive oil.",
    "Place trimmed balsa wood sticks into the small bowl of olive oil.",
    "Soak them in the olive oil for 20 minutes.",
    "The oil soaks into the wood which helps with the burning quality of the wick.",
    "This process will aid in the crackling fire sound that is achieved with wood wick candles.",
    "Dry off the wood wick.",
    "Remove from oil and wipe clean with a paper towel.",
    "Having a wick that is overly saturated with oil will take a longer time.",
    "Place wood wick into wood clip/tab.",
    "Place the oil treated wood pieces into a wick clip.",
    "Squeezing the open part of the clip around the wick will ensure a firm grip and lessen the chance of the wick falling over while oil is being poured around it.",
    "Insert wood wick into jar.",
    "Using the wax adhesive, press the wick clip firmly onto the bottom center of the empty glass jar.",
    "If it is a larger candle more wicks can be added.",
    "Try to keep the wicks at least a half of an inch apart.",
    "Melting Old Candle Wax and Creating New Candle Put water in saucepan.",
    "Take small saucepan and fill with a small amount of water.",
    "Use the double boiler method.",
    "Place used candle in saucepan.",
    "Make sure the candle is not floating.",
    "If candle floats, pour a little water out of saucepan till candle stands up.",
    "Heat the wax.",
    "Heat saucepan of water and candle on stove over a low heat until wax is melted.",
    "Wax should be semi-clear or transparent.",
    "Fragrant oil can be added at this time to make it scented.",
    "Remove the hot pan.",
    "Wearing heat-safe gloves, a hot pad, or oven mitt, carefully remove saucepan from stove top, then carefully remove the melted candle out of pot.",
    "Pour in the hot wax.",
    "Slowly pour the hot wax into the wood wick prepared glass jar, filling the jar to the base of the rim.",
    "If more wax is needed to fill completely, repeat steps 1-4.",
    "Allow the wax to harden and cool completely.",
    "This will take approximately four to six hours.",
    "You could place them on a cookie sheet or glass plate and store them in the fridge for about 2 hours till the wax is firm and the glass is no longer warm to the touch.",
    "Light and enjoy."
  ],
  "tyn_section":[
    "Balsa wood sticks and wick clips/tabs with wax adhesive",
    "Scissors",
    "Old saucepan or small pan",
    "Small bowl of olive oil",
    "Used candles",
    "Stove",
    "Water",
    "Glass jar",
    "Paper towel",
    "Heatproof gloves, hot pad, or oven mitt"
  ],
  "tyn_model":[
    "saucepan",
    "water",
    "olive oil",
    "oil",
    "balsa wood",
    "candle",
    "wood wick",
    "scissors",
    "wax",
    "small bowl",
    "wood wick candles",
    "paper towel",
    "wax adhesive",
    "double boiler",
    "stove",
    "pan",
    "hot pad",
    "oven mitt",
    "pot",
    "wood wick prepared glass jar",
    "cookie sheet or",
    "glass plate"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.1818181818,
    "f1":0.25,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.1818181818,
    "f1":0.25
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6,
    "p":0.3636363636,
    "f1":0.4528301887
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.1818181818,
    "f1":0.25
  }
}