{
  "title":"How to Decorate Wine Bottles",
  "url":"https://www.wikihow.com/Decorate-Wine-Bottles",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Glass and Stained Glass Projects",
    "Glass Bottle Projects"
  ],
  "methods":[
    {
      "name":"Painting Wine Bottles",
      "steps":[
        {
          "headline":"Get acrylic paints.",
          "description":"Acrylic paints will stick to glass, so you won't have to worry about paint coming off your wine bottles. Get paints in multiple colors if you want to paint a more intricate design."
        },
        {
          "headline":"Clean your wine bottles with soap and water.",
          "description":"Soak a section of a rag in soapy water and wipe down the outside of the bottles. Rinse the inside of the bottles out to remove any leftover residue. Let the bottles dry completely after you clean them."
        },
        {
          "headline":"Put tape on the bottles if you want a striped design.",
          "description":"Use painter’s tape or masking tape. The spots you cover with tape won’t get paint on them, so they'll look like empty stripes when you remove the tape after painting. Wrap a piece of tape around the base of the bottle to create a thick stripe going around the whole bottle. Run a piece of tape from the bottom of the bottle up to the mouthpiece to make a vertical stripe."
        },
        {
          "headline":"Paint your wine bottles with a paint brush.",
          "description":"If you’re doing one solid color, use a large paint brush to work faster. If you’re painting multiple colors on a single bottle, use a smaller paint brush so you can be more precise. Don’t forget to paint the bottom of the bottle and the rim around the mouthpiece. You don't have to paint your wine bottles a solid color. Pick designs or patterns you like and paint those on the bottles instead."
        },
        {
          "headline":"Let your painted wine bottles dry overnight.",
          "description":"After they've dried overnight, touch them with your finger to see if they're fully dry. If they're still wet, let them continue to dry before you cure them."
        },
        {
          "headline":"Cure your wine bottles in the oven for 30 minutes.",
          "description":"Place your wine bottles in the oven and set the temperature to 350 °F (177 °C). Set a timer for 30 minutes, then remove the bottles from the oven."
        },
        {
          "headline":"Add decorations to your painted wine bottles.",
          "description":"Glue on rhinestones or decorative gems. Add glitter to your painted bottles using an acrylic sealer as an adhesive. You can also hot glue decorative flowers onto the bottles. Make sure you wait to add decorations after you've cured your wine bottles in the oven."
        }
      ]
    },
    {
      "name":"Making Wine Bottle Lights",
      "steps":[
        {
          "headline":"Drill a hole at the base of your wine bottle.",
          "description":"Use a diamond drill bit designed specifically for glass. Make sure the drill bit is larger than the cord on the string lights you’ll be using. Lay your wine bottle on a flat surface over a towel so it’s steady. Slowly drill down into the base of the wine bottle (on the side, not the bottom of the bottle). As you’re drilling, spray water from a spray bottle onto the drill bit to lubricate it. Ask someone to help you with this part. One of you can drill the hole while the other sprays the drill bit with water."
        },
        {
          "headline":"Remove the piece of glass you drilled out and rinse the bottle with water.",
          "description":"Rinse directly over the hole you drilled to wash away any small pieces of glass around the hole. Let the bottle dry completely."
        },
        {
          "headline":"Feed the string lights through the hole in the bottle.",
          "description":"Make sure you use string lights that have a plug on only one side or they won’t fit through the hole. Slide the end without a plug through the hole and keep feeding the cord through until all the lights are inside the bottle."
        },
        {
          "headline":"Use a bent coat hanger to pull some of the lights up the neck of the bottle.",
          "description":"Bend a metal coat hanger so there’s a hook at the end. Slide the hook down through the neck of the bottle and use it to grab part of the string lights. Carefully pull the lights up through the neck of the bottle. Stop once the lights reach the mouthpiece and unhook the coat hanger from the cord. Pull up 2 or 3 sections of the lights so they are firmly packed in the neck of the bottle. This will prevent them from sliding back down into the base."
        }
      ]
    },
    {
      "name":"Decorating Wine Bottles with Glitter",
      "steps":[
        {
          "headline":"Scratch up the surface of your wine bottle with fine-grit sandpaper.",
          "description":"Look for sandpaper with a grade between 120 and 220. Rub the sandpaper over the wine bottle in a circular motion until it’s completely covered with scratches. The scratches will make it easier for the adhesive you’re going to use to stick to the bottle."
        },
        {
          "headline":"Set up your work space in a well-ventilated area.",
          "description":"Work outside if possible. If you have to work inside, open any windows in the room you’ll be working in and plug in a box fan. Lay down tarp or newspaper on a flat surface so glitter and adhesive don't get everywhere. Lay your wine bottle down on the flat surface."
        },
        {
          "headline":"Spray a section of the bottle with a spray-on acrylic sealer.",
          "description":"The acrylic sealer will work as an adhesive for the glitter to stick to. Hold the sealer 3 inches (7.6 cm) away from the bottle and spray from the base of the bottle to the mouthpiece. You can find spray-on acrylic sealer at your local crafts store."
        },
        {
          "headline":"Sprinkle craft glitter over the sealer.",
          "description":"Add the glitter directly from the canister. Completely cover the adhesive with glitter so there aren’t any empty spots. Look for craft glitter at your local crafts store."
        },
        {
          "headline":"Turn the bottle and apply sealer and glitter to a new section.",
          "description":"Continue to turn the bottle and add more sealer and glitter until the entire bottle is covered. If you notice bare spots, spray sealer over them and cover them with glitter."
        },
        {
          "headline":"Spray the whole bottle with sealer to seal the glitter in place.",
          "description":"The extra coat of acrylic sealer will help the glitter stay on the bottle. Keep in mind that some glitter will come off the bottle when you touch it. Be careful when you're handling the bottle so glitter doesn't get on your clothes."
        }
      ]
    },
    {
      "name":"Wrapping Wine Bottles with Twine",
      "steps":[
        {
          "headline":"Glue the end of a roll of coarse twine to the bottom rim of your wine bottle.",
          "description":"Use a hot glue gun so the twine is secure on the bottle. Apply a drop of hot glue to the bottom rim of the bottle (on the side of the bottle) and press the end of the twine into the glue. Let the glue dry for at least 1 minute."
        },
        {
          "headline":"Wrap the twine around the bottom rim of the bottle.",
          "description":"Add a drop of hot glue every 2 inches (5.1 cm). Stop wrapping the twine once you get back to where you started. Let the hot glue dry for 1 minute."
        },
        {
          "headline":"Tightly wrap the twine around and up the bottle until you reach the neck.",
          "description":"Don't leave any gaps between the rings of twine as you wrap it around. You shouldn't be able to see the glass wine bottle through the twine. Don't apply any hot glue to the rings of twine going up the base of the bottle."
        },
        {
          "headline":"Wrap the twine around the base of the neck of the bottle and apply hot glue.",
          "description":"Add hot glue every 2 inches (5.1 cm) like you did to the ring of twine at the bottom rim of the bottle. Stop once you reach the point where you first started wrapping the twine around the neck of the bottle. Wait 1 minute for the hot glue to dry before continuing."
        },
        {
          "headline":"Tightly wrap the twine around and up the neck of the bottle.",
          "description":"Layer the rings right on top of each other so there aren't any gaps, like you did with the twine on the base of the bottle. Stop wrapping when you reach the lip at the top of the neck."
        },
        {
          "headline":"Cut the twine from the roll with scissors and glue the end to the bottle.",
          "description":"Apply a dot of hot glue right below the lip at the top of the bottle. Press the end of the twine into the hot glue. Once the hot glue dries, your bottle is ready to be displayed!"
        }
      ]
    }
  ],
  "text":" Painting Wine Bottles Get acrylic paints. Acrylic paints will stick to glass, so you won't have to worry about paint coming off your wine bottles. Get paints in multiple colors if you want to paint a more intricate design. Clean your wine bottles with soap and water. Soak a section of a rag in soapy water and wipe down the outside of the bottles. Rinse the inside of the bottles out to remove any leftover residue. Let the bottles dry completely after you clean them. Put tape on the bottles if you want a striped design. Use painter’s tape or masking tape. The spots you cover with tape won’t get paint on them, so they'll look like empty stripes when you remove the tape after painting. Wrap a piece of tape around the base of the bottle to create a thick stripe going around the whole bottle. Run a piece of tape from the bottom of the bottle up to the mouthpiece to make a vertical stripe. Paint your wine bottles with a paint brush. If you’re doing one solid color, use a large paint brush to work faster. If you’re painting multiple colors on a single bottle, use a smaller paint brush so you can be more precise. Don’t forget to paint the bottom of the bottle and the rim around the mouthpiece. You don't have to paint your wine bottles a solid color. Pick designs or patterns you like and paint those on the bottles instead. Let your painted wine bottles dry overnight. After they've dried overnight, touch them with your finger to see if they're fully dry. If they're still wet, let them continue to dry before you cure them. Cure your wine bottles in the oven for 30 minutes. Place your wine bottles in the oven and set the temperature to 350 °F (177 °C). Set a timer for 30 minutes, then remove the bottles from the oven. Add decorations to your painted wine bottles. Glue on rhinestones or decorative gems. Add glitter to your painted bottles using an acrylic sealer as an adhesive. You can also hot glue decorative flowers onto the bottles. Make sure you wait to add decorations after you've cured your wine bottles in the oven. Making Wine Bottle Lights Drill a hole at the base of your wine bottle. Use a diamond drill bit designed specifically for glass. Make sure the drill bit is larger than the cord on the string lights you’ll be using. Lay your wine bottle on a flat surface over a towel so it’s steady. Slowly drill down into the base of the wine bottle (on the side, not the bottom of the bottle). As you’re drilling, spray water from a spray bottle onto the drill bit to lubricate it. Ask someone to help you with this part. One of you can drill the hole while the other sprays the drill bit with water. Remove the piece of glass you drilled out and rinse the bottle with water. Rinse directly over the hole you drilled to wash away any small pieces of glass around the hole. Let the bottle dry completely. Feed the string lights through the hole in the bottle. Make sure you use string lights that have a plug on only one side or they won’t fit through the hole. Slide the end without a plug through the hole and keep feeding the cord through until all the lights are inside the bottle. Use a bent coat hanger to pull some of the lights up the neck of the bottle. Bend a metal coat hanger so there’s a hook at the end. Slide the hook down through the neck of the bottle and use it to grab part of the string lights. Carefully pull the lights up through the neck of the bottle. Stop once the lights reach the mouthpiece and unhook the coat hanger from the cord. Pull up 2 or 3 sections of the lights so they are firmly packed in the neck of the bottle. This will prevent them from sliding back down into the base. Decorating Wine Bottles with Glitter Scratch up the surface of your wine bottle with fine-grit sandpaper. Look for sandpaper with a grade between 120 and 220. Rub the sandpaper over the wine bottle in a circular motion until it’s completely covered with scratches. The scratches will make it easier for the adhesive you’re going to use to stick to the bottle. Set up your work space in a well-ventilated area. Work outside if possible. If you have to work inside, open any windows in the room you’ll be working in and plug in a box fan. Lay down tarp or newspaper on a flat surface so glitter and adhesive don't get everywhere. Lay your wine bottle down on the flat surface. Spray a section of the bottle with a spray-on acrylic sealer. The acrylic sealer will work as an adhesive for the glitter to stick to. Hold the sealer 3 inches (7.6 cm) away from the bottle and spray from the base of the bottle to the mouthpiece. You can find spray-on acrylic sealer at your local crafts store. Sprinkle craft glitter over the sealer. Add the glitter directly from the canister. Completely cover the adhesive with glitter so there aren’t any empty spots. Look for craft glitter at your local crafts store. Turn the bottle and apply sealer and glitter to a new section. Continue to turn the bottle and add more sealer and glitter until the entire bottle is covered. If you notice bare spots, spray sealer over them and cover them with glitter. Spray the whole bottle with sealer to seal the glitter in place. The extra coat of acrylic sealer will help the glitter stay on the bottle. Keep in mind that some glitter will come off the bottle when you touch it. Be careful when you're handling the bottle so glitter doesn't get on your clothes. Wrapping Wine Bottles with Twine Glue the end of a roll of coarse twine to the bottom rim of your wine bottle. Use a hot glue gun so the twine is secure on the bottle. Apply a drop of hot glue to the bottom rim of the bottle (on the side of the bottle) and press the end of the twine into the glue. Let the glue dry for at least 1 minute. Wrap the twine around the bottom rim of the bottle. Add a drop of hot glue every 2 inches (5.1 cm). Stop wrapping the twine once you get back to where you started. Let the hot glue dry for 1 minute. Tightly wrap the twine around and up the bottle until you reach the neck. Don't leave any gaps between the rings of twine as you wrap it around. You shouldn't be able to see the glass wine bottle through the twine. Don't apply any hot glue to the rings of twine going up the base of the bottle. Wrap the twine around the base of the neck of the bottle and apply hot glue. Add hot glue every 2 inches (5.1 cm) like you did to the ring of twine at the bottom rim of the bottle. Stop once you reach the point where you first started wrapping the twine around the neck of the bottle. Wait 1 minute for the hot glue to dry before continuing. Tightly wrap the twine around and up the neck of the bottle. Layer the rings right on top of each other so there aren't any gaps, like you did with the twine on the base of the bottle. Stop wrapping when you reach the lip at the top of the neck. Cut the twine from the roll with scissors and glue the end to the bottle. Apply a dot of hot glue right below the lip at the top of the bottle. Press the end of the twine into the hot glue. Once the hot glue dries, your bottle is ready to be displayed!",
  "sentences":[
    " Painting Wine Bottles Get acrylic paints.",
    "Acrylic paints will stick to glass, so you won't have to worry about paint coming off your wine bottles.",
    "Get paints in multiple colors if you want to paint a more intricate design.",
    "Clean your wine bottles with soap and water.",
    "Soak a section of a rag in soapy water and wipe down the outside of the bottles.",
    "Rinse the inside of the bottles out to remove any leftover residue.",
    "Let the bottles dry completely after you clean them.",
    "Put tape on the bottles if you want a striped design.",
    "Use painter’s tape or masking tape.",
    "The spots you cover with tape won’t get paint on them, so they'll look like empty stripes when you remove the tape after painting.",
    "Wrap a piece of tape around the base of the bottle to create a thick stripe going around the whole bottle.",
    "Run a piece of tape from the bottom of the bottle up to the mouthpiece to make a vertical stripe.",
    "Paint your wine bottles with a paint brush.",
    "If you’re doing one solid color, use a large paint brush to work faster.",
    "If you’re painting multiple colors on a single bottle, use a smaller paint brush so you can be more precise.",
    "Don’t forget to paint the bottom of the bottle and the rim around the mouthpiece.",
    "You don't have to paint your wine bottles a solid color.",
    "Pick designs or patterns you like and paint those on the bottles instead.",
    "Let your painted wine bottles dry overnight.",
    "After they've dried overnight, touch them with your finger to see if they're fully dry.",
    "If they're still wet, let them continue to dry before you cure them.",
    "Cure your wine bottles in the oven for 30 minutes.",
    "Place your wine bottles in the oven and set the temperature to 350 °F (177 °C).",
    "Set a timer for 30 minutes, then remove the bottles from the oven.",
    "Add decorations to your painted wine bottles.",
    "Glue on rhinestones or decorative gems.",
    "Add glitter to your painted bottles using an acrylic sealer as an adhesive.",
    "You can also hot glue decorative flowers onto the bottles.",
    "Make sure you wait to add decorations after you've cured your wine bottles in the oven.",
    "Making Wine Bottle Lights Drill a hole at the base of your wine bottle.",
    "Use a diamond drill bit designed specifically for glass.",
    "Make sure the drill bit is larger than the cord on the string lights you’ll be using.",
    "Lay your wine bottle on a flat surface over a towel so it’s steady.",
    "Slowly drill down into the base of the wine bottle (on the side, not the bottom of the bottle).",
    "As you’re drilling, spray water from a spray bottle onto the drill bit to lubricate it.",
    "Ask someone to help you with this part.",
    "One of you can drill the hole while the other sprays the drill bit with water.",
    "Remove the piece of glass you drilled out and rinse the bottle with water.",
    "Rinse directly over the hole you drilled to wash away any small pieces of glass around the hole.",
    "Let the bottle dry completely.",
    "Feed the string lights through the hole in the bottle.",
    "Make sure you use string lights that have a plug on only one side or they won’t fit through the hole.",
    "Slide the end without a plug through the hole and keep feeding the cord through until all the lights are inside the bottle.",
    "Use a bent coat hanger to pull some of the lights up the neck of the bottle.",
    "Bend a metal coat hanger so there’s a hook at the end.",
    "Slide the hook down through the neck of the bottle and use it to grab part of the string lights.",
    "Carefully pull the lights up through the neck of the bottle.",
    "Stop once the lights reach the mouthpiece and unhook the coat hanger from the cord.",
    "Pull up 2 or 3 sections of the lights so they are firmly packed in the neck of the bottle.",
    "This will prevent them from sliding back down into the base.",
    "Decorating Wine Bottles with Glitter Scratch up the surface of your wine bottle with fine-grit sandpaper.",
    "Look for sandpaper with a grade between 120 and 220.",
    "Rub the sandpaper over the wine bottle in a circular motion until it’s completely covered with scratches.",
    "The scratches will make it easier for the adhesive you’re going to use to stick to the bottle.",
    "Set up your work space in a well-ventilated area.",
    "Work outside if possible.",
    "If you have to work inside, open any windows in the room you’ll be working in and plug in a box fan.",
    "Lay down tarp or newspaper on a flat surface so glitter and adhesive don't get everywhere.",
    "Lay your wine bottle down on the flat surface.",
    "Spray a section of the bottle with a spray-on acrylic sealer.",
    "The acrylic sealer will work as an adhesive for the glitter to stick to.",
    "Hold the sealer 3 inches (7.6 cm) away from the bottle and spray from the base of the bottle to the mouthpiece.",
    "You can find spray-on acrylic sealer at your local crafts store.",
    "Sprinkle craft glitter over the sealer.",
    "Add the glitter directly from the canister.",
    "Completely cover the adhesive with glitter so there aren’t any empty spots.",
    "Look for craft glitter at your local crafts store.",
    "Turn the bottle and apply sealer and glitter to a new section.",
    "Continue to turn the bottle and add more sealer and glitter until the entire bottle is covered.",
    "If you notice bare spots, spray sealer over them and cover them with glitter.",
    "Spray the whole bottle with sealer to seal the glitter in place.",
    "The extra coat of acrylic sealer will help the glitter stay on the bottle.",
    "Keep in mind that some glitter will come off the bottle when you touch it.",
    "Be careful when you're handling the bottle so glitter doesn't get on your clothes.",
    "Wrapping Wine Bottles with Twine Glue the end of a roll of coarse twine to the bottom rim of your wine bottle.",
    "Use a hot glue gun so the twine is secure on the bottle.",
    "Apply a drop of hot glue to the bottom rim of the bottle (on the side of the bottle) and press the end of the twine into the glue.",
    "Let the glue dry for at least 1 minute.",
    "Wrap the twine around the bottom rim of the bottle.",
    "Add a drop of hot glue every 2 inches (5.1 cm).",
    "Stop wrapping the twine once you get back to where you started.",
    "Let the hot glue dry for 1 minute.",
    "Tightly wrap the twine around and up the bottle until you reach the neck.",
    "Don't leave any gaps between the rings of twine as you wrap it around.",
    "You shouldn't be able to see the glass wine bottle through the twine.",
    "Don't apply any hot glue to the rings of twine going up the base of the bottle.",
    "Wrap the twine around the base of the neck of the bottle and apply hot glue.",
    "Add hot glue every 2 inches (5.1 cm) like you did to the ring of twine at the bottom rim of the bottle.",
    "Stop once you reach the point where you first started wrapping the twine around the neck of the bottle.",
    "Wait 1 minute for the hot glue to dry before continuing.",
    "Tightly wrap the twine around and up the neck of the bottle.",
    "Layer the rings right on top of each other so there aren't any gaps, like you did with the twine on the base of the bottle.",
    "Stop wrapping when you reach the lip at the top of the neck.",
    "Cut the twine from the roll with scissors and glue the end to the bottle.",
    "Apply a dot of hot glue right below the lip at the top of the bottle.",
    "Press the end of the twine into the hot glue.",
    "Once the hot glue dries, your bottle is ready to be displayed!"
  ],
  "tyn_section":[
    "Acrylic paint",
    "Rag",
    "Tape",
    "Paint brush",
    "Oven",
    "Drill",
    "Diamond drill bit",
    "String lights",
    "Metal coat hanger",
    "Decorating Wine Bottles",
    "Fine-grit sandpaper",
    "Spray-on acrylic sealer",
    "Craft glitter",
    "Coarse twine",
    "Hot glue gun",
    "Scissors"
  ],
  "tyn_model":[
    "twine",
    "hot glue",
    "glitter",
    "wine bottle",
    "wine bottles",
    "tape",
    "water",
    "oven",
    "sealer",
    "paint brush",
    "acrylic sealer",
    "drill bit",
    "acrylic paints",
    "decorations",
    "coat hanger",
    "sandpaper",
    "spray-on acrylic sealer",
    "craft glitter",
    "glue",
    "paint",
    "paints",
    "soap",
    "soapy water",
    "painter’s tape",
    "masking tape",
    "wine bottle lights",
    "diamond drill bit",
    "towel",
    "spray bottle",
    "bent coat hanger",
    "fine-grit sandpaper",
    "newspaper",
    "coarse twine",
    "glass wine bottle",
    "scissors"
  ],
  "simple_metrics":{
    "r":0.5625,
    "p":0.2571428571,
    "f1":0.3529411765,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.875,
    "p":0.6,
    "f1":0.7118644068
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.875,
    "p":0.6857142857,
    "f1":0.7688787185
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.4,
    "f1":0.5217391304
  }
}