{
  "title":"How to Bake Hot Dogs",
  "url":"https://www.wikihow.com/Bake-Hot-Dogs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Fast Food",
    "Hot Dogs"
  ],
  "methods":[
    {
      "name":"Baking Plain Hot Dogs",
      "steps":[
        {
          "headline":"Turn on the oven and prepare a baking sheet.",
          "description":"Preheat the oven to 400°F (204°C). Spread the hot dogs you want to bake out on the baking sheet so they’re not touching. If you can’t fit all the hot dogs on one baking sheet, use a second sheet."
        },
        {
          "headline":"Use a knife to slice the hot dogs down the middle lengthwise.",
          "description":"Cut halfway down into the hot dogs with the knife. Cut all the way from one end of each hot dog to the other."
        },
        {
          "headline":"Put the hot dogs in the oven for 15 minutes.",
          "description":"Set a timer so you don’t forget about them. After 15 minutes, open the oven to check on the hot dogs. If they look slightly brown and curled at the edges, they’re finished. If not, leave them in for a few more minutes. For a slightly browner, crispier hot dog, set your oven to broil for the last 2-3 minutes of baking."
        },
        {
          "headline":"Take the hot dogs out of the oven and serve.",
          "description":"Use a spatula to transfer the hot dogs from the baking sheet to a plate. Serve them in hot dog buns and add toppings like cheese, mustard, ketchup, and relish. If you want melted cheese on your hot dogs, top them with cheese and put them back in the oven for 1 minute."
        }
      ]
    },
    {
      "name":"Baking Hot Dogs with Buns",
      "steps":[
        {
          "headline":"Turn on the oven and line a baking pan with aluminum foil.",
          "description":"Preheat the oven to 350°F (177°C). Make sure the aluminum foil comes up the sides of the pan. Use a pan that’s large enough to hold all the hot dogs you want to bake. If you don’t have one that’s big enough, line two baking pans."
        },
        {
          "headline":"Arrange hot dog buns side by side in the lined baking pan.",
          "description":"Place the hot dog buns in the pan so they’re touching. Fill the pan completely with a single layer of hot dog buns so none of them tip over when they’re baking. Use one hot dog bun for every hot dog you want to bake. For extra flavor, coat the insides of the hot dog buns with butter or mayonnaise before you put them in the baking pan."
        },
        {
          "headline":"Fill the buns with hot dogs and your favorite toppings.",
          "description":"Place one hot dog in each hot dog bun. Add toppings like mustard, cheese, onions, chili, and relish. Sprinkle the toppings directly on the hot dogs in the buns."
        },
        {
          "headline":"Cover the pan with aluminum foil and put it in the oven for 45 minutes.",
          "description":"Wrap the edges of the aluminum foil over the sides of the pan so it stays on in the oven. Set a timer for 45 minutes. After 45 minutes, take the pan out of the oven. The toppings on your hot dogs should be melted and the hot dog buns should be slightly browned."
        },
        {
          "headline":"Serve the hot dogs.",
          "description":"Carefully transfer the hot dogs from the pan to a plate using a spatula. Eat the hot dogs with your hands or use a fork and knife."
        }
      ]
    },
    {
      "name":"Broiling Hot Dogs",
      "steps":[
        {
          "headline":"Set your oven to \"broil\" and prepare a baking sheet.",
          "description":"Look on your oven's temperature knob for the broil setting. Place your hot dogs on a baking sheet so they're in a single layer. None of the hot dogs should be touching."
        },
        {
          "headline":"Put the hot dogs in the oven and broil for 4 minutes.",
          "description":"Place the baking sheet on the top rack of the oven so it's directly under the broiler's heat source. Set a timer for 4 minutes."
        },
        {
          "headline":"Flip the hot dogs with tongs and broil them for 4 more minutes.",
          "description":"Use an oven mitt to pull out the baking sheet so you can easily flip the hot dogs. Put the hot dogs back on the top rack of the oven and set another timer for 4 minutes."
        },
        {
          "headline":"Take the broiled hot dogs out of the oven and serve.",
          "description":"Carefully transfer the hot dogs to a plate using the tongs. Put the broiled hot dogs in buns and serve with your favorite toppings."
        }
      ]
    }
  ],
  "text":" Baking Plain Hot Dogs Turn on the oven and prepare a baking sheet. Preheat the oven to 400°F (204°C). Spread the hot dogs you want to bake out on the baking sheet so they’re not touching. If you can’t fit all the hot dogs on one baking sheet, use a second sheet. Use a knife to slice the hot dogs down the middle lengthwise. Cut halfway down into the hot dogs with the knife. Cut all the way from one end of each hot dog to the other. Put the hot dogs in the oven for 15 minutes. Set a timer so you don’t forget about them. After 15 minutes, open the oven to check on the hot dogs. If they look slightly brown and curled at the edges, they’re finished. If not, leave them in for a few more minutes. For a slightly browner, crispier hot dog, set your oven to broil for the last 2-3 minutes of baking. Take the hot dogs out of the oven and serve. Use a spatula to transfer the hot dogs from the baking sheet to a plate. Serve them in hot dog buns and add toppings like cheese, mustard, ketchup, and relish. If you want melted cheese on your hot dogs, top them with cheese and put them back in the oven for 1 minute. Baking Hot Dogs with Buns Turn on the oven and line a baking pan with aluminum foil. Preheat the oven to 350°F (177°C). Make sure the aluminum foil comes up the sides of the pan. Use a pan that’s large enough to hold all the hot dogs you want to bake. If you don’t have one that’s big enough, line two baking pans. Arrange hot dog buns side by side in the lined baking pan. Place the hot dog buns in the pan so they’re touching. Fill the pan completely with a single layer of hot dog buns so none of them tip over when they’re baking. Use one hot dog bun for every hot dog you want to bake. For extra flavor, coat the insides of the hot dog buns with butter or mayonnaise before you put them in the baking pan. Fill the buns with hot dogs and your favorite toppings. Place one hot dog in each hot dog bun. Add toppings like mustard, cheese, onions, chili, and relish. Sprinkle the toppings directly on the hot dogs in the buns. Cover the pan with aluminum foil and put it in the oven for 45 minutes. Wrap the edges of the aluminum foil over the sides of the pan so it stays on in the oven. Set a timer for 45 minutes. After 45 minutes, take the pan out of the oven. The toppings on your hot dogs should be melted and the hot dog buns should be slightly browned. Serve the hot dogs. Carefully transfer the hot dogs from the pan to a plate using a spatula. Eat the hot dogs with your hands or use a fork and knife. Broiling Hot Dogs Set your oven to \"broil\" and prepare a baking sheet. Look on your oven's temperature knob for the broil setting. Place your hot dogs on a baking sheet so they're in a single layer. None of the hot dogs should be touching. Put the hot dogs in the oven and broil for 4 minutes. Place the baking sheet on the top rack of the oven so it's directly under the broiler's heat source. Set a timer for 4 minutes. Flip the hot dogs with tongs and broil them for 4 more minutes. Use an oven mitt to pull out the baking sheet so you can easily flip the hot dogs. Put the hot dogs back on the top rack of the oven and set another timer for 4 minutes. Take the broiled hot dogs out of the oven and serve. Carefully transfer the hot dogs to a plate using the tongs. Put the broiled hot dogs in buns and serve with your favorite toppings.",
  "sentences":[
    " Baking Plain Hot Dogs Turn on the oven and prepare a baking sheet.",
    "Preheat the oven to 400°F (204°C).",
    "Spread the hot dogs you want to bake out on the baking sheet so they’re not touching.",
    "If you can’t fit all the hot dogs on one baking sheet, use a second sheet.",
    "Use a knife to slice the hot dogs down the middle lengthwise.",
    "Cut halfway down into the hot dogs with the knife.",
    "Cut all the way from one end of each hot dog to the other.",
    "Put the hot dogs in the oven for 15 minutes.",
    "Set a timer so you don’t forget about them.",
    "After 15 minutes, open the oven to check on the hot dogs.",
    "If they look slightly brown and curled at the edges, they’re finished.",
    "If not, leave them in for a few more minutes.",
    "For a slightly browner, crispier hot dog, set your oven to broil for the last 2-3 minutes of baking.",
    "Take the hot dogs out of the oven and serve.",
    "Use a spatula to transfer the hot dogs from the baking sheet to a plate.",
    "Serve them in hot dog buns and add toppings like cheese, mustard, ketchup, and relish.",
    "If you want melted cheese on your hot dogs, top them with cheese and put them back in the oven for 1 minute.",
    "Baking Hot Dogs with Buns Turn on the oven and line a baking pan with aluminum foil.",
    "Preheat the oven to 350°F (177°C).",
    "Make sure the aluminum foil comes up the sides of the pan.",
    "Use a pan that’s large enough to hold all the hot dogs you want to bake.",
    "If you don’t have one that’s big enough, line two baking pans.",
    "Arrange hot dog buns side by side in the lined baking pan.",
    "Place the hot dog buns in the pan so they’re touching.",
    "Fill the pan completely with a single layer of hot dog buns so none of them tip over when they’re baking.",
    "Use one hot dog bun for every hot dog you want to bake.",
    "For extra flavor, coat the insides of the hot dog buns with butter or mayonnaise before you put them in the baking pan.",
    "Fill the buns with hot dogs and your favorite toppings.",
    "Place one hot dog in each hot dog bun.",
    "Add toppings like mustard, cheese, onions, chili, and relish.",
    "Sprinkle the toppings directly on the hot dogs in the buns.",
    "Cover the pan with aluminum foil and put it in the oven for 45 minutes.",
    "Wrap the edges of the aluminum foil over the sides of the pan so it stays on in the oven.",
    "Set a timer for 45 minutes.",
    "After 45 minutes, take the pan out of the oven.",
    "The toppings on your hot dogs should be melted and the hot dog buns should be slightly browned.",
    "Serve the hot dogs.",
    "Carefully transfer the hot dogs from the pan to a plate using a spatula.",
    "Eat the hot dogs with your hands or use a fork and knife.",
    "Broiling Hot Dogs Set your oven to \"broil\" and prepare a baking sheet.",
    "Look on your oven's temperature knob for the broil setting.",
    "Place your hot dogs on a baking sheet so they're in a single layer.",
    "None of the hot dogs should be touching.",
    "Put the hot dogs in the oven and broil for 4 minutes.",
    "Place the baking sheet on the top rack of the oven so it's directly under the broiler's heat source.",
    "Set a timer for 4 minutes.",
    "Flip the hot dogs with tongs and broil them for 4 more minutes.",
    "Use an oven mitt to pull out the baking sheet so you can easily flip the hot dogs.",
    "Put the hot dogs back on the top rack of the oven and set another timer for 4 minutes.",
    "Take the broiled hot dogs out of the oven and serve.",
    "Carefully transfer the hot dogs to a plate using the tongs.",
    "Put the broiled hot dogs in buns and serve with your favorite toppings."
  ],
  "tyn_section":[
    "Hot dogs",
    "Baking sheet",
    "Knife",
    "Toppings",
    "Baking pan",
    "Aluminum foil",
    "Hot dog buns",
    "Tongs"
  ],
  "tyn_model":[
    "oven",
    "baking sheet",
    "hot dog",
    "aluminum foil",
    "plate",
    "baking pan",
    "hot dogs",
    "knife",
    "spatula",
    "mustard",
    "cheese",
    "baking pans",
    "butter or mayonnaise",
    "hot dog bun",
    "onions",
    "chili",
    "fork and knife",
    "broiler",
    "oven mitt"
  ],
  "simple_metrics":{
    "r":0.625,
    "p":0.2631578947,
    "f1":0.3703703704,
    "avg_pos":0.3157894737
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.3684210526,
    "f1":0.4941176471
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.4736842105,
    "f1":0.5806451613
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.3157894737,
    "f1":0.4444444444
  }
}