{
  "title":"How to Adjust Rainbird Sprinklers",
  "url":"https://www.wikihow.com/Adjust-Rainbird-Sprinklers",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Changing the Watering Direction and Distance",
      "steps":[
        {
          "headline":"Set the fixed left edge on the sprinkler head.",
          "description":"Before you adjust the watering direction or distance, you will need to set the starting point for the water rotation. Find the center cap on the rotor case. Move it all the way to the right until it stops and you can no longer turn it. Then, move it to the left until it stops. Rotate the entire rotor case to line up the left edge in the correct position. Do not rotate the rotor case past the left edge, as this can damage the case. The instructions to set the fix left edge will work for the Rain Bird 2SA, 42SA, 42SA+, 52SA Series."
        },
        {
          "headline":"Move the sprinkler head by hand to adjust the watering direction.",
          "description":"Grip the spray head between two fingers. Then, rotate it by hand so it is aimed at the direction you want the water to spray. For example, if you want the water to spray towards the right, rotate the head to the right. If you want the water to spray more to the left, rotate the head to the left."
        },
        {
          "headline":"Adjust the spray distance using a flat-bladed screwdriver.",
          "description":"You can have the water on or off when you adjust the spray distance, though it may be easier with the water off. Take a flat-bladed screwdriver and place it on the center screw on the head. Then, turn the screw clockwise to decrease the spray distance up to 25 percent. Be careful not to turn the screw so far that it goes into the head. It should sit just in front of the nozzle so the head is secure. The spray distance on Rain Bird models is 19 to 32 feet (5.8 to 9.8 m). If you want the distance to be any higher or shorter, you will need to change the rotor nozzles or adjust the water pressure."
        }
      ]
    },
    {
      "name":"Adjusting the Spray Pattern",
      "steps":[
        {
          "headline":"Twist the collar to the left or right if you have an adjustable sprinkler head.",
          "description":"If you have a Rain Bird sprinkler model that has an adjustable head (the 18/15/12 AP series), you can use your fingers to twist the collar. It can be adjusted from 0-360 degrees. To increase the spray pattern, move the threaded collar to the left. To decrease the spray pattern, move the threaded collar to the right. Adjust the spray pattern while the sprinkler is on so you can determine how much of an increase or decrease you want. Adjusting the spray pattern is useful if you want to water a certain area of your lawn or spray only to a certain point in your yard."
        },
        {
          "headline":"Find the adjustable tab if you have the Rain Bird 2SA, 42SA, 42SA+, or 52SA Series.",
          "description":"These models have an adjustable tab for the spray pattern on the top of the head. The tab will have a plus and minus symbol. There will also be a screw in the center of the plus and minus symbol."
        },
        {
          "headline":"Adjust the arc adjustable tab with a screwdriver.",
          "description":"Take a flat-headed screwdriver. Place it on the screw on the top of the head. Then, twist the screw towards the plus symbol, or clockwise, to increase the spray pattern. To decrease the spray pattern, twist the screw towards the minus symbol, or counterclockwise."
        }
      ]
    },
    {
      "name":"Changing the Sprinkler Nozzle",
      "steps":[
        {
          "headline":"Shut off the sprinkler.",
          "description":"Make sure the sprinkler is not hooked up to running water. This will make changing the sprinkler nozzle easier. You may want to change the sprinkler nozzle if it stops working properly. You can also remove the nozzle and check the filter screen if the water dribbles or does not spray properly. You can then clean it or change it."
        },
        {
          "headline":"Twist off the nozzle with pliers.",
          "description":"Use pliers to grip the nozzle. Then, turn the nozzle to the left, or counterclockwise, to unscrew the nozzle from the sprinkler head."
        },
        {
          "headline":"Take out the filter screen below the nozzle.",
          "description":"Look into the sprinkler head. You should see a small filter screen in the head, below where the nozzle sits. Use your fingers or small pliers to carefully remove the filter screen."
        },
        {
          "headline":"Clean or replace the filter screen, depending on its condition.",
          "description":"Look for any dirt, debris, or buildup on the filter screen. You may opt to rinse off the debris with water to clean the filter screen and reuse it if it is still in good condition. If the filter screen is old or in rough shape, replace it with a new one. You can buy filter screens for the Rain Bird sprinkler at your local hardware store or online. You can use a standard sprinkler filter screen for all Rain Bird sprinkler models."
        },
        {
          "headline":"Place the filter screen in the sprinkler head.",
          "description":"Once you have cleaned or replaced the filter screen, put it in the sprinkler head."
        },
        {
          "headline":"Put the new nozzle on.",
          "description":"Use pliers to place the new nozzle on the sprinkler head. Then, turn it to the right, or clockwise, until it is secure. You can buy a new nozzle online or at your local hardware store. Look for the Rain Bird nozzle that matches the Rain Bird sprinkler model you own."
        }
      ]
    }
  ],
  "text":" Changing the Watering Direction and Distance Set the fixed left edge on the sprinkler head. Before you adjust the watering direction or distance, you will need to set the starting point for the water rotation. Find the center cap on the rotor case. Move it all the way to the right until it stops and you can no longer turn it. Then, move it to the left until it stops. Rotate the entire rotor case to line up the left edge in the correct position. Do not rotate the rotor case past the left edge, as this can damage the case. The instructions to set the fix left edge will work for the Rain Bird 2SA, 42SA, 42SA+, 52SA Series. Move the sprinkler head by hand to adjust the watering direction. Grip the spray head between two fingers. Then, rotate it by hand so it is aimed at the direction you want the water to spray. For example, if you want the water to spray towards the right, rotate the head to the right. If you want the water to spray more to the left, rotate the head to the left. Adjust the spray distance using a flat-bladed screwdriver. You can have the water on or off when you adjust the spray distance, though it may be easier with the water off. Take a flat-bladed screwdriver and place it on the center screw on the head. Then, turn the screw clockwise to decrease the spray distance up to 25 percent. Be careful not to turn the screw so far that it goes into the head. It should sit just in front of the nozzle so the head is secure. The spray distance on Rain Bird models is 19 to 32 feet (5.8 to 9.8 m). If you want the distance to be any higher or shorter, you will need to change the rotor nozzles or adjust the water pressure. Adjusting the Spray Pattern Twist the collar to the left or right if you have an adjustable sprinkler head. If you have a Rain Bird sprinkler model that has an adjustable head (the 18/15/12 AP series), you can use your fingers to twist the collar. It can be adjusted from 0-360 degrees. To increase the spray pattern, move the threaded collar to the left. To decrease the spray pattern, move the threaded collar to the right. Adjust the spray pattern while the sprinkler is on so you can determine how much of an increase or decrease you want. Adjusting the spray pattern is useful if you want to water a certain area of your lawn or spray only to a certain point in your yard. Find the adjustable tab if you have the Rain Bird 2SA, 42SA, 42SA+, or 52SA Series. These models have an adjustable tab for the spray pattern on the top of the head. The tab will have a plus and minus symbol. There will also be a screw in the center of the plus and minus symbol. Adjust the arc adjustable tab with a screwdriver. Take a flat-headed screwdriver. Place it on the screw on the top of the head. Then, twist the screw towards the plus symbol, or clockwise, to increase the spray pattern. To decrease the spray pattern, twist the screw towards the minus symbol, or counterclockwise. Changing the Sprinkler Nozzle Shut off the sprinkler. Make sure the sprinkler is not hooked up to running water. This will make changing the sprinkler nozzle easier. You may want to change the sprinkler nozzle if it stops working properly. You can also remove the nozzle and check the filter screen if the water dribbles or does not spray properly. You can then clean it or change it. Twist off the nozzle with pliers. Use pliers to grip the nozzle. Then, turn the nozzle to the left, or counterclockwise, to unscrew the nozzle from the sprinkler head. Take out the filter screen below the nozzle. Look into the sprinkler head. You should see a small filter screen in the head, below where the nozzle sits. Use your fingers or small pliers to carefully remove the filter screen. Clean or replace the filter screen, depending on its condition. Look for any dirt, debris, or buildup on the filter screen. You may opt to rinse off the debris with water to clean the filter screen and reuse it if it is still in good condition. If the filter screen is old or in rough shape, replace it with a new one. You can buy filter screens for the Rain Bird sprinkler at your local hardware store or online. You can use a standard sprinkler filter screen for all Rain Bird sprinkler models. Place the filter screen in the sprinkler head. Once you have cleaned or replaced the filter screen, put it in the sprinkler head. Put the new nozzle on. Use pliers to place the new nozzle on the sprinkler head. Then, turn it to the right, or clockwise, until it is secure. You can buy a new nozzle online or at your local hardware store. Look for the Rain Bird nozzle that matches the Rain Bird sprinkler model you own.",
  "sentences":[
    " Changing the Watering Direction and Distance Set the fixed left edge on the sprinkler head.",
    "Before you adjust the watering direction or distance, you will need to set the starting point for the water rotation.",
    "Find the center cap on the rotor case.",
    "Move it all the way to the right until it stops and you can no longer turn it.",
    "Then, move it to the left until it stops.",
    "Rotate the entire rotor case to line up the left edge in the correct position.",
    "Do not rotate the rotor case past the left edge, as this can damage the case.",
    "The instructions to set the fix left edge will work for the Rain Bird 2SA, 42SA, 42SA+, 52SA Series.",
    "Move the sprinkler head by hand to adjust the watering direction.",
    "Grip the spray head between two fingers.",
    "Then, rotate it by hand so it is aimed at the direction you want the water to spray.",
    "For example, if you want the water to spray towards the right, rotate the head to the right.",
    "If you want the water to spray more to the left, rotate the head to the left.",
    "Adjust the spray distance using a flat-bladed screwdriver.",
    "You can have the water on or off when you adjust the spray distance, though it may be easier with the water off.",
    "Take a flat-bladed screwdriver and place it on the center screw on the head.",
    "Then, turn the screw clockwise to decrease the spray distance up to 25 percent.",
    "Be careful not to turn the screw so far that it goes into the head.",
    "It should sit just in front of the nozzle so the head is secure.",
    "The spray distance on Rain Bird models is 19 to 32 feet (5.8 to 9.8 m).",
    "If you want the distance to be any higher or shorter, you will need to change the rotor nozzles or adjust the water pressure.",
    "Adjusting the Spray Pattern Twist the collar to the left or right if you have an adjustable sprinkler head.",
    "If you have a Rain Bird sprinkler model that has an adjustable head (the 18/15/12 AP series), you can use your fingers to twist the collar.",
    "It can be adjusted from 0-360 degrees.",
    "To increase the spray pattern, move the threaded collar to the left.",
    "To decrease the spray pattern, move the threaded collar to the right.",
    "Adjust the spray pattern while the sprinkler is on so you can determine how much of an increase or decrease you want.",
    "Adjusting the spray pattern is useful if you want to water a certain area of your lawn or spray only to a certain point in your yard.",
    "Find the adjustable tab if you have the Rain Bird 2SA, 42SA, 42SA+, or 52SA Series.",
    "These models have an adjustable tab for the spray pattern on the top of the head.",
    "The tab will have a plus and minus symbol.",
    "There will also be a screw in the center of the plus and minus symbol.",
    "Adjust the arc adjustable tab with a screwdriver.",
    "Take a flat-headed screwdriver.",
    "Place it on the screw on the top of the head.",
    "Then, twist the screw towards the plus symbol, or clockwise, to increase the spray pattern.",
    "To decrease the spray pattern, twist the screw towards the minus symbol, or counterclockwise.",
    "Changing the Sprinkler Nozzle Shut off the sprinkler.",
    "Make sure the sprinkler is not hooked up to running water.",
    "This will make changing the sprinkler nozzle easier.",
    "You may want to change the sprinkler nozzle if it stops working properly.",
    "You can also remove the nozzle and check the filter screen if the water dribbles or does not spray properly.",
    "You can then clean it or change it.",
    "Twist off the nozzle with pliers.",
    "Use pliers to grip the nozzle.",
    "Then, turn the nozzle to the left, or counterclockwise, to unscrew the nozzle from the sprinkler head.",
    "Take out the filter screen below the nozzle.",
    "Look into the sprinkler head.",
    "You should see a small filter screen in the head, below where the nozzle sits.",
    "Use your fingers or small pliers to carefully remove the filter screen.",
    "Clean or replace the filter screen, depending on its condition.",
    "Look for any dirt, debris, or buildup on the filter screen.",
    "You may opt to rinse off the debris with water to clean the filter screen and reuse it if it is still in good condition.",
    "If the filter screen is old or in rough shape, replace it with a new one.",
    "You can buy filter screens for the Rain Bird sprinkler at your local hardware store or online.",
    "You can use a standard sprinkler filter screen for all Rain Bird sprinkler models.",
    "Place the filter screen in the sprinkler head.",
    "Once you have cleaned or replaced the filter screen, put it in the sprinkler head.",
    "Put the new nozzle on.",
    "Use pliers to place the new nozzle on the sprinkler head.",
    "Then, turn it to the right, or clockwise, until it is secure.",
    "You can buy a new nozzle online or at your local hardware store.",
    "Look for the Rain Bird nozzle that matches the Rain Bird sprinkler model you own."
  ],
  "tyn_section":[
    "A flat-bladed screwdriver",
    "A filter screen",
    "A new sprinkler nozzle"
  ],
  "tyn_model":[
    "water",
    "rain bird",
    "pliers",
    "sprinkler",
    "screwdriver",
    "rain bird sprinkler",
    "flat-bladed",
    "flat-bladed screwdriver"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.125,
    "f1":0.1818181818
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.375,
    "f1":0.3529411765
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.125,
    "f1":0.1818181818
  }
}