{
  "title":"How to Use Tracing Paper",
  "url":"https://www.wikihow.com/Use-Tracing-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Tracing and Copying Drawing"
  ],
  "parts":[
    {
      "name":"Tracing Your Drawing",
      "steps":[
        {
          "headline":"Place a sheet of tracing paper over a drawing or image you want to trace.",
          "description":"The simpler the image you use, the easier it will be to trace. Make sure the entire image is covered with the tracing paper."
        },
        {
          "headline":"Use masking tape to hold the tracing paper in place.",
          "description":"Fold the edges of the tracing paper over the edges of the paper the original drawing or image is on and tape them down. If the tracing paper is smaller than the piece of paper you’re tracing over, tape the corners of the tracing paper to the front of the other paper."
        },
        {
          "headline":"Trace the original image onto the tracing paper with a graphite pencil.",
          "description":"Don’t use a pen, marker, or colored pencil or you won’t be able to transfer your traced image onto another sheet of paper. Carefully follow the lines of the original image with the pencil. Don’t worry about tracing the shading in the original image. Just focus on getting all the lines from the original image onto the tracing paper. If the tracing paper slips out of place as you’re working, line it back up using the lines you’ve already traced. Erase mistakes with an eraser, but be gentle so you don't tear the tracing paper."
        },
        {
          "headline":"Remove the tracing paper.",
          "description":"Peel off the tape that was holding the tracing paper in place, and set the sheet of tracing paper next to the original image. Look at the two side by side. They should look identical (except for any shading and coloring). If you notice you missed a spot, place the tracing paper back over the original drawing and trace over the line you missed."
        }
      ]
    },
    {
      "name":"Transferring Your Drawing",
      "steps":[
        {
          "headline":"Find something you want to transfer your traced drawing onto.",
          "description":"Use a sheet of sketchbook paper, watercolor paper, a canvas, or any other medium that pencil will show up on. Make sure you’re transferring the traced drawing onto something that’s light-colored so the pencil shows up."
        },
        {
          "headline":"Tape your traced drawing face down on your new medium.",
          "description":"Use masking tape or office tape. Position the tracing paper so the traced drawing is lined up with the spot you want it to transfer onto. The side of the tracing paper you drew on should be facing down."
        },
        {
          "headline":"Rub the back of the traced drawing to transfer it onto the medium below.",
          "description":"Use your pencil, the end of a marker, or another hard object. Apply pressure as you rub over all of the lines in your traced drawing. The pressure will cause the graphite on the other side of the tracing paper to transfer onto the medium below it."
        },
        {
          "headline":"Remove the tracing paper.",
          "description":"Peel off the tape and set the tracing paper aside. There should be a faded copy of the drawing you traced on the new medium. If there are spots that didn't transfer, fill them in with the pencil."
        },
        {
          "headline":"Finish your transferred drawing.",
          "description":"Go over the lines with the pencil so they're more defined. When you're finished, you can leave it as is or enhance your drawing with ink, colored pencil, or paint."
        }
      ]
    }
  ],
  "text":" Tracing Your Drawing Place a sheet of tracing paper over a drawing or image you want to trace. The simpler the image you use, the easier it will be to trace. Make sure the entire image is covered with the tracing paper. Use masking tape to hold the tracing paper in place. Fold the edges of the tracing paper over the edges of the paper the original drawing or image is on and tape them down. If the tracing paper is smaller than the piece of paper you’re tracing over, tape the corners of the tracing paper to the front of the other paper. Trace the original image onto the tracing paper with a graphite pencil. Don’t use a pen, marker, or colored pencil or you won’t be able to transfer your traced image onto another sheet of paper. Carefully follow the lines of the original image with the pencil. Don’t worry about tracing the shading in the original image. Just focus on getting all the lines from the original image onto the tracing paper. If the tracing paper slips out of place as you’re working, line it back up using the lines you’ve already traced. Erase mistakes with an eraser, but be gentle so you don't tear the tracing paper. Remove the tracing paper. Peel off the tape that was holding the tracing paper in place, and set the sheet of tracing paper next to the original image. Look at the two side by side. They should look identical (except for any shading and coloring). If you notice you missed a spot, place the tracing paper back over the original drawing and trace over the line you missed. Transferring Your Drawing Find something you want to transfer your traced drawing onto. Use a sheet of sketchbook paper, watercolor paper, a canvas, or any other medium that pencil will show up on. Make sure you’re transferring the traced drawing onto something that’s light-colored so the pencil shows up. Tape your traced drawing face down on your new medium. Use masking tape or office tape. Position the tracing paper so the traced drawing is lined up with the spot you want it to transfer onto. The side of the tracing paper you drew on should be facing down. Rub the back of the traced drawing to transfer it onto the medium below. Use your pencil, the end of a marker, or another hard object. Apply pressure as you rub over all of the lines in your traced drawing. The pressure will cause the graphite on the other side of the tracing paper to transfer onto the medium below it. Remove the tracing paper. Peel off the tape and set the tracing paper aside. There should be a faded copy of the drawing you traced on the new medium. If there are spots that didn't transfer, fill them in with the pencil. Finish your transferred drawing. Go over the lines with the pencil so they're more defined. When you're finished, you can leave it as is or enhance your drawing with ink, colored pencil, or paint.",
  "sentences":[
    " Tracing Your Drawing Place a sheet of tracing paper over a drawing or image you want to trace.",
    "The simpler the image you use, the easier it will be to trace.",
    "Make sure the entire image is covered with the tracing paper.",
    "Use masking tape to hold the tracing paper in place.",
    "Fold the edges of the tracing paper over the edges of the paper the original drawing or image is on and tape them down.",
    "If the tracing paper is smaller than the piece of paper you’re tracing over, tape the corners of the tracing paper to the front of the other paper.",
    "Trace the original image onto the tracing paper with a graphite pencil.",
    "Don’t use a pen, marker, or colored pencil or you won’t be able to transfer your traced image onto another sheet of paper.",
    "Carefully follow the lines of the original image with the pencil.",
    "Don’t worry about tracing the shading in the original image.",
    "Just focus on getting all the lines from the original image onto the tracing paper.",
    "If the tracing paper slips out of place as you’re working, line it back up using the lines you’ve already traced.",
    "Erase mistakes with an eraser, but be gentle so you don't tear the tracing paper.",
    "Remove the tracing paper.",
    "Peel off the tape that was holding the tracing paper in place, and set the sheet of tracing paper next to the original image.",
    "Look at the two side by side.",
    "They should look identical (except for any shading and coloring).",
    "If you notice you missed a spot, place the tracing paper back over the original drawing and trace over the line you missed.",
    "Transferring Your Drawing Find something you want to transfer your traced drawing onto.",
    "Use a sheet of sketchbook paper, watercolor paper, a canvas, or any other medium that pencil will show up on.",
    "Make sure you’re transferring the traced drawing onto something that’s light-colored so the pencil shows up.",
    "Tape your traced drawing face down on your new medium.",
    "Use masking tape or office tape.",
    "Position the tracing paper so the traced drawing is lined up with the spot you want it to transfer onto.",
    "The side of the tracing paper you drew on should be facing down.",
    "Rub the back of the traced drawing to transfer it onto the medium below.",
    "Use your pencil, the end of a marker, or another hard object.",
    "Apply pressure as you rub over all of the lines in your traced drawing.",
    "The pressure will cause the graphite on the other side of the tracing paper to transfer onto the medium below it.",
    "Remove the tracing paper.",
    "Peel off the tape and set the tracing paper aside.",
    "There should be a faded copy of the drawing you traced on the new medium.",
    "If there are spots that didn't transfer, fill them in with the pencil.",
    "Finish your transferred drawing.",
    "Go over the lines with the pencil so they're more defined.",
    "When you're finished, you can leave it as is or enhance your drawing with ink, colored pencil, or paint."
  ],
  "tyn_section":[
    "Graphite pencil",
    "Tracing paper",
    "Masking tape"
  ],
  "tyn_model":[
    "tracing paper",
    "pencil",
    "paper",
    "masking tape",
    "colored pencil",
    "tape",
    "graphite pencil",
    "pen, marker",
    "eraser",
    "sketchbook paper",
    "watercolor paper",
    "canvas",
    "office tape",
    "marker",
    "graphite",
    "ink",
    "paint"
  ],
  "simple_metrics":{
    "r":1.0,
    "p":0.1764705882,
    "f1":0.3,
    "avg_pos":0.3529411765
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.4117647059,
    "f1":0.5833333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.6470588235,
    "f1":0.7857142857
  },
  "jacc_metrics_0.6666666666666666":{
    "r":1.0,
    "p":0.1764705882,
    "f1":0.3
  }
}