{
  "title":"How to Make Thai Tea",
  "url":"https://www.wikihow.com/Make-Thai-Tea",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Thai Dishes"
  ],
  "methods":[
    {
      "name":"Hot Thai Tea",
      "steps":[
        {
          "headline":"Bring a cup of water to boil.",
          "description":"Pour water into a kettle and turn it on so it begins to boil. Turn off the heat or unplug your kettle."
        },
        {
          "headline":"Measure sugar into the mug and place the tea in a ball.",
          "description":"Place 1 tablespoon (12.5 g) of sugar into the bottom of the serving mug or tea cup. Measure 1 to 2 tablespoons (2 to 4 g) of Thai tea into a tea ball infuser. Set the ball infuser over the mug or tea cup. Use the full 2 tablespoons (4 g) of tea if you a stronger drink. If you don't have a tea ball strainer, you could use a tea bag filter."
        },
        {
          "headline":"Pour boiling water over the tea.",
          "description":"Measure about 1 cup (240 ml) of boiling water and pour it into the mug or tea cup. The sugar should dissolve and the water will pass through the tea ball or filter."
        },
        {
          "headline":"Steep the tea for 3 to 4 minutes.",
          "description":"Let the tea steep until the water darkens and the tea is steeped as much as you like. This could take 3 to 4 minutes. If you prefer weaker tea, remove the tea ball or filter sooner."
        },
        {
          "headline":"Remove the ball or filter and serve the tea.",
          "description":"Lift out the tea ball or filter and stir the tea so the sugar dissolves completely. Sip the tea while it's still hot. If you like creamy tea, stir in a little milk, half and half, or evaporated milk."
        }
      ]
    },
    {
      "name":"Making Quick Thai Iced Tea",
      "steps":[
        {
          "headline":"Bring water to boil in a saucepan and stir in the Thai tea mix.",
          "description":"Pour 4 cups (960 ml) of water into a medium saucepan and turn the heat to high. Once the water boils, pour in 1 cup (80 g) of Thai tea mix. Stir the tea mix until it dissolves."
        },
        {
          "headline":"Stir in the sugar and boil the tea for 3 minutes.",
          "description":"Measure 3/4 cup (150 g) of granulated sugar into the tea and stir it until it dissolves. Let the tea come back to a boil over high heat and boil it for 3 minutes."
        },
        {
          "headline":"Steep the tea for at least 30 minutes.",
          "description":"Turn off the heat and let the tea sit for at least 30 minutes so it steeps and cools. If you prefer a stronger tea, you can steep it for an hour."
        },
        {
          "headline":"Strain the tea, if necessary.",
          "description":"Depending on the type of Thai tea mix you used, you may need to strain out tea leaves. Set a fine mesh strainer over a large pitcher. Slowly pour the tea through the strainer to catch the tea leaves and discard them."
        },
        {
          "headline":"Chill the tea for at least a few hours.",
          "description":"Place the pitcher of Thai tea in the refrigerate so it becomes becomes completely cold. The flavors will also intensify as it chills. You can make the Thai tea mixture up to 1 day ahead of serving it."
        },
        {
          "headline":"Put ice in the serving glasses and pour in the chilled Thai tea.",
          "description":"Get out 4 to 6 tall serving glasses. Fill the glasses with ice cubes and pour the cold Thai tea into each glass. Leave 1 to 2 inches (2.5 to 5 cm) of space at the top of each glass."
        },
        {
          "headline":"Pour half and half in the drinks and serve them.",
          "description":"Get out 1 cup (240 ml) of half and half and pour 2 to 3 tablespoons (30 to 45 ml) in the top of each glass. Avoid stirring the drinks. Instead, let the half and half slowly fall to the bottom. Serve the Thai iced tea immediately. If you prefer a sweeter Thai iced tea, you can use sweetened condensed milk instead of the half and half."
        }
      ]
    },
    {
      "name":"Making Homemade Thai Iced Tea",
      "steps":[
        {
          "headline":"Bring the water to a boil and add the tea, sugar, and seasonings.",
          "description":"Pour 4 cups (960 ml) of water into a medium saucepan. Turn the heat on to high so the water begins to boil. Add:\n4 black tea bags\n3/4 cup (150 g) granulated sugar\n2 anise stars\n1 smashed green cardamom pod\n2 whole cloves"
        },
        {
          "headline":"Stir and boil the Thai tea for 3 minutes.",
          "description":"Use a long spoon to stir the tea as it boils over high heat. The sugar should dissolve and the water will become dark. Boil the tea for 3 minutes."
        },
        {
          "headline":"Steep the tea for 30 minutes and cool it.",
          "description":"Turn off the heat and set the Thai tea aside. The tea will infuse with flavors as it cools. You can steep the tea for up to 2 hours."
        },
        {
          "headline":"Remove the solids and chill the tea.",
          "description":"Use a handled strainer to scoop out the solid seasonings (anise stars, cardamom pod, and cloves) that are floating in the tea. Discard the solids and pour the tea into a pitcher. Put the pitcher in the refrigerator and chill the tea for a few hours so it becomes completely cold."
        },
        {
          "headline":"Fill the serving glasses with ice and pour in the chilled Thai tea.",
          "description":"Get out 4 to 6 tall serving glasses. Put ice cubes in the glasses and pour the cold Thai tea into each glass. Leave 1 to 2 inches (2.5 to 5 cm) of space at the top of each glass."
        },
        {
          "headline":"Top the tea with half and half and serve them.",
          "description":"Get out 1 cup (240 ml) of half and half and pour 2 to 3 tablespoons (30 to 45 ml) in the top of each glass. Avoid stirring the drinks. Instead, let the half and half slowly fall to the bottom. Serve the Thai iced tea immediately. For a different flavor, you can use sweetened condensed milk, coconut milk, or evaporated milk, instead of the half and half."
        }
      ]
    }
  ],
  "text":" Hot Thai Tea Bring a cup of water to boil. Pour water into a kettle and turn it on so it begins to boil. Turn off the heat or unplug your kettle. Measure sugar into the mug and place the tea in a ball. Place 1 tablespoon (12.5 g) of sugar into the bottom of the serving mug or tea cup. Measure 1 to 2 tablespoons (2 to 4 g) of Thai tea into a tea ball infuser. Set the ball infuser over the mug or tea cup. Use the full 2 tablespoons (4 g) of tea if you a stronger drink. If you don't have a tea ball strainer, you could use a tea bag filter. Pour boiling water over the tea. Measure about 1 cup (240 ml) of boiling water and pour it into the mug or tea cup. The sugar should dissolve and the water will pass through the tea ball or filter. Steep the tea for 3 to 4 minutes. Let the tea steep until the water darkens and the tea is steeped as much as you like. This could take 3 to 4 minutes. If you prefer weaker tea, remove the tea ball or filter sooner. Remove the ball or filter and serve the tea. Lift out the tea ball or filter and stir the tea so the sugar dissolves completely. Sip the tea while it's still hot. If you like creamy tea, stir in a little milk, half and half, or evaporated milk. Making Quick Thai Iced Tea Bring water to boil in a saucepan and stir in the Thai tea mix. Pour 4 cups (960 ml) of water into a medium saucepan and turn the heat to high. Once the water boils, pour in 1 cup (80 g) of Thai tea mix. Stir the tea mix until it dissolves. Stir in the sugar and boil the tea for 3 minutes. Measure 3/4 cup (150 g) of granulated sugar into the tea and stir it until it dissolves. Let the tea come back to a boil over high heat and boil it for 3 minutes. Steep the tea for at least 30 minutes. Turn off the heat and let the tea sit for at least 30 minutes so it steeps and cools. If you prefer a stronger tea, you can steep it for an hour. Strain the tea, if necessary. Depending on the type of Thai tea mix you used, you may need to strain out tea leaves. Set a fine mesh strainer over a large pitcher. Slowly pour the tea through the strainer to catch the tea leaves and discard them. Chill the tea for at least a few hours. Place the pitcher of Thai tea in the refrigerate so it becomes becomes completely cold. The flavors will also intensify as it chills. You can make the Thai tea mixture up to 1 day ahead of serving it. Put ice in the serving glasses and pour in the chilled Thai tea. Get out 4 to 6 tall serving glasses. Fill the glasses with ice cubes and pour the cold Thai tea into each glass. Leave 1 to 2 inches (2.5 to 5 cm) of space at the top of each glass. Pour half and half in the drinks and serve them. Get out 1 cup (240 ml) of half and half and pour 2 to 3 tablespoons (30 to 45 ml) in the top of each glass. Avoid stirring the drinks. Instead, let the half and half slowly fall to the bottom. Serve the Thai iced tea immediately. If you prefer a sweeter Thai iced tea, you can use sweetened condensed milk instead of the half and half. Making Homemade Thai Iced Tea Bring the water to a boil and add the tea, sugar, and seasonings. Pour 4 cups (960 ml) of water into a medium saucepan. Turn the heat on to high so the water begins to boil. Add:\n4 black tea bags\n3/4 cup (150 g) granulated sugar\n2 anise stars\n1 smashed green cardamom pod\n2 whole cloves Stir and boil the Thai tea for 3 minutes. Use a long spoon to stir the tea as it boils over high heat. The sugar should dissolve and the water will become dark. Boil the tea for 3 minutes. Steep the tea for 30 minutes and cool it. Turn off the heat and set the Thai tea aside. The tea will infuse with flavors as it cools. You can steep the tea for up to 2 hours. Remove the solids and chill the tea. Use a handled strainer to scoop out the solid seasonings (anise stars, cardamom pod, and cloves) that are floating in the tea. Discard the solids and pour the tea into a pitcher. Put the pitcher in the refrigerator and chill the tea for a few hours so it becomes completely cold. Fill the serving glasses with ice and pour in the chilled Thai tea. Get out 4 to 6 tall serving glasses. Put ice cubes in the glasses and pour the cold Thai tea into each glass. Leave 1 to 2 inches (2.5 to 5 cm) of space at the top of each glass. Top the tea with half and half and serve them. Get out 1 cup (240 ml) of half and half and pour 2 to 3 tablespoons (30 to 45 ml) in the top of each glass. Avoid stirring the drinks. Instead, let the half and half slowly fall to the bottom. Serve the Thai iced tea immediately. For a different flavor, you can use sweetened condensed milk, coconut milk, or evaporated milk, instead of the half and half.",
  "sentences":[
    " Hot Thai Tea Bring a cup of water to boil.",
    "Pour water into a kettle and turn it on so it begins to boil.",
    "Turn off the heat or unplug your kettle.",
    "Measure sugar into the mug and place the tea in a ball.",
    "Place 1 tablespoon (12.5 g) of sugar into the bottom of the serving mug or tea cup.",
    "Measure 1 to 2 tablespoons (2 to 4 g) of Thai tea into a tea ball infuser.",
    "Set the ball infuser over the mug or tea cup.",
    "Use the full 2 tablespoons (4 g) of tea if you a stronger drink.",
    "If you don't have a tea ball strainer, you could use a tea bag filter.",
    "Pour boiling water over the tea.",
    "Measure about 1 cup (240 ml) of boiling water and pour it into the mug or tea cup.",
    "The sugar should dissolve and the water will pass through the tea ball or filter.",
    "Steep the tea for 3 to 4 minutes.",
    "Let the tea steep until the water darkens and the tea is steeped as much as you like.",
    "This could take 3 to 4 minutes.",
    "If you prefer weaker tea, remove the tea ball or filter sooner.",
    "Remove the ball or filter and serve the tea.",
    "Lift out the tea ball or filter and stir the tea so the sugar dissolves completely.",
    "Sip the tea while it's still hot.",
    "If you like creamy tea, stir in a little milk, half and half, or evaporated milk.",
    "Making Quick Thai Iced Tea Bring water to boil in a saucepan and stir in the Thai tea mix.",
    "Pour 4 cups (960 ml) of water into a medium saucepan and turn the heat to high.",
    "Once the water boils, pour in 1 cup (80 g) of Thai tea mix.",
    "Stir the tea mix until it dissolves.",
    "Stir in the sugar and boil the tea for 3 minutes.",
    "Measure 3/4 cup (150 g) of granulated sugar into the tea and stir it until it dissolves.",
    "Let the tea come back to a boil over high heat and boil it for 3 minutes.",
    "Steep the tea for at least 30 minutes.",
    "Turn off the heat and let the tea sit for at least 30 minutes so it steeps and cools.",
    "If you prefer a stronger tea, you can steep it for an hour.",
    "Strain the tea, if necessary.",
    "Depending on the type of Thai tea mix you used, you may need to strain out tea leaves.",
    "Set a fine mesh strainer over a large pitcher.",
    "Slowly pour the tea through the strainer to catch the tea leaves and discard them.",
    "Chill the tea for at least a few hours.",
    "Place the pitcher of Thai tea in the refrigerate so it becomes becomes completely cold.",
    "The flavors will also intensify as it chills.",
    "You can make the Thai tea mixture up to 1 day ahead of serving it.",
    "Put ice in the serving glasses and pour in the chilled Thai tea.",
    "Get out 4 to 6 tall serving glasses.",
    "Fill the glasses with ice cubes and pour the cold Thai tea into each glass.",
    "Leave 1 to 2 inches (2.5 to 5 cm) of space at the top of each glass.",
    "Pour half and half in the drinks and serve them.",
    "Get out 1 cup (240 ml) of half and half and pour 2 to 3 tablespoons (30 to 45 ml) in the top of each glass.",
    "Avoid stirring the drinks.",
    "Instead, let the half and half slowly fall to the bottom.",
    "Serve the Thai iced tea immediately.",
    "If you prefer a sweeter Thai iced tea, you can use sweetened condensed milk instead of the half and half.",
    "Making Homemade Thai Iced Tea Bring the water to a boil and add the tea, sugar, and seasonings.",
    "Pour 4 cups (960 ml) of water into a medium saucepan.",
    "Turn the heat on to high so the water begins to boil.",
    "Add:\n4 black tea bags\n3/4 cup (150 g) granulated sugar\n2 anise stars\n1 smashed green cardamom pod\n2 whole cloves Stir and boil the Thai tea for 3 minutes.",
    "Use a long spoon to stir the tea as it boils over high heat.",
    "The sugar should dissolve and the water will become dark.",
    "Boil the tea for 3 minutes.",
    "Steep the tea for 30 minutes and cool it.",
    "Turn off the heat and set the Thai tea aside.",
    "The tea will infuse with flavors as it cools.",
    "You can steep the tea for up to 2 hours.",
    "Remove the solids and chill the tea.",
    "Use a handled strainer to scoop out the solid seasonings (anise stars, cardamom pod, and cloves) that are floating in the tea.",
    "Discard the solids and pour the tea into a pitcher.",
    "Put the pitcher in the refrigerator and chill the tea for a few hours so it becomes completely cold.",
    "Fill the serving glasses with ice and pour in the chilled Thai tea.",
    "Get out 4 to 6 tall serving glasses.",
    "Put ice cubes in the glasses and pour the cold Thai tea into each glass.",
    "Leave 1 to 2 inches (2.5 to 5 cm) of space at the top of each glass.",
    "Top the tea with half and half and serve them.",
    "Get out 1 cup (240 ml) of half and half and pour 2 to 3 tablespoons (30 to 45 ml) in the top of each glass.",
    "Avoid stirring the drinks.",
    "Instead, let the half and half slowly fall to the bottom.",
    "Serve the Thai iced tea immediately.",
    "For a different flavor, you can use sweetened condensed milk, coconut milk, or evaporated milk, instead of the half and half."
  ],
  "tyn_section":[
    "Measuring cups and spoons",
    "Digital scale",
    "Water kettle",
    "Serving mug or tea cup",
    "Spoon",
    "Tea ball infuser or tea filter",
    "Quick Thai Iced Tea",
    "Medium saucepan",
    "Pitcher",
    "Fine mesh strainer",
    "4 to 6 tall serving glasses",
    "Homemade Thai Iced Tea",
    "Long spoon",
    "Handled strainer"
  ],
  "tyn_model":[
    "water",
    "tea",
    "half and half",
    "sugar",
    "thai tea",
    "pitcher",
    "tea cup",
    "iced tea",
    "kettle",
    "tea ball",
    "medium saucepan",
    "tea mix",
    "granulated sugar",
    "strainer",
    "ice",
    "ice cubes",
    "sweetened condensed milk",
    "anise stars",
    "serving mug",
    "tea ball infuser",
    "tea ball strainer",
    "tea bag filter",
    "milk",
    "half and half, or evaporated milk",
    "saucepan",
    "thai tea mix",
    "tea leaves",
    "fine mesh strainer",
    "refrigerate",
    "seasonings",
    "tea bags",
    "green cardamom",
    "cloves",
    "refrigerator",
    "coconut milk",
    "evaporated milk"
  ],
  "simple_metrics":{
    "r":0.2142857143,
    "p":0.0833333333,
    "f1":0.12,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.2777777778,
    "f1":0.3738317757
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6428571429,
    "p":0.4444444444,
    "f1":0.5255474453
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2142857143,
    "p":0.0833333333,
    "f1":0.12
  }
}