{
  "title":"How to Hang Lights Outside",
  "url":"https://www.wikihow.com/Hang-Lights-Outside",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting"
  ],
  "parts":[
    {
      "name":"Mapping Out the Pattern",
      "steps":[
        {
          "headline":"Use existing architecture.",
          "description":"Before you do anything else, consider how you can use existing architecture to hang and anchor the lights. For instance, the roof of your home, trees on your property, fence posts along borders, and patio structures or awnings can be utilized to hang outdoor lights so that you don’t have to create separate posts to mount/anchor them to. For example, string lights between your home and garage over your lawn. Alternatively, hang lights between your deck and posts you place throughout the yard."
        },
        {
          "headline":"Factor in outlet locations.",
          "description":"Obviously, you’ll need to be able to plug in the lights, so consider where the outdoor electrical outlets are located on your property. You’ll need to begin near an outlet with enough voltage to power the strings you want to use. Use an outlet on a circuit that does not have a lot of equipment plugged into it. If you plug too much equipment into one circuit, you'll trip the breaker and it will shut the power off."
        },
        {
          "headline":"Design a pattern for the lights.",
          "description":"You may want taut strings or draping lines. Common patterns for outdoor lights include straight lines, v patterns or diamonds, x patterns, and checkerboards. Think about how much light you need and where you want to concentrate it. Also, consider how far from the ground the lights should be so that people can easily walk underneath them, if applicable. For example, you may want to zigzag a string of lights over your fire pit or patio area. Alternatively, you could wind strings of lights between patio posts."
        },
        {
          "headline":"Choose your mounting points.",
          "description":"Use eaves, beams, posts, or trees for mounting points. Pick mounting points at regular intervals, such as every 5 feet (1.5 m). Use at least 2 mounting points per string, and make sure that each mounting point is at the same height."
        },
        {
          "headline":"Decide how to anchor the lights.",
          "description":"You can purchase guide wire, wire rope clamps, eye to eye turnbuckles, zip ties, and screw hooks to add extra stability if you’re stringing the lights between structures. Or, for a simpler attachment, you can use a staple gun to secure the strings of lights directly to wooden fixtures."
        },
        {
          "headline":"Install wooden posts to anchor the lights to, if necessary.",
          "description":"If you don’t have enough existing beams, structures, or trees, you can easily make wooden posts to anchor the lights to. Put 4 by 4 in (10 by 10 cm) wooden posts of the desired height in stainless steel buckets. Mix cement and pour it into the buckets. Allow the cement to dry completely, then place the buckets around your property at the desired mounting points."
        },
        {
          "headline":"Measure the desired pattern using string.",
          "description":"String is the perfect tool to help you determine how many lights you’ll need. Run a string from the outlet you intend to use to each mounting point. Then, measure the string to determine how long the light string should be or many sets of strings you’ll need to complete the pattern."
        },
        {
          "headline":"Buy enough outdoor lights to cover the pattern and a few spares.",
          "description":"There are many different types of string lights, from icicle and fairy lights to globe or rope lights. Choose what you like best, and make sure you get a little more than enough to create the pattern you mapped out. Always buy lights designed specifically for outdoor locations to ensure they can withstand the elements. Star-shaped string lights would provide soft light and enhance the outdoor ambience. Colored lights would provide a party-like feel to your outdoor space, and could be tailored to holiday colors."
        }
      ]
    },
    {
      "name":"Installing the Lights",
      "steps":[
        {
          "headline":"Plug in and test the lights.",
          "description":"Before you go any further, plug the lights into the outlet you plan to use. This is a good way to test if the circuit can handle the additional power for the lights. Then, connect all the strings together and replace any broken or burnt-out bulbs, if necessary. You can unplug the strings from each other and the lights from the outlet before hanging them, but be sure to leave enough slack so you can reach the outlet to plug them back in when you’re done."
        },
        {
          "headline":"Install the screw hooks and guide wire, if desired.",
          "description":"For a sturdier and longer-lasting installation, screw hooks into the structure at each of the chosen mounting points. Then, attach an eye to eye turnbuckle to each screw hook, run guide wire between each turnbuckle, and secure the guidewire to the turnbuckles with wire clamps. This reduces stress on the string light wires and keeps them from drooping."
        },
        {
          "headline":"Wind the lights along the chosen pattern.",
          "description":"Start at the outlet you will use to power the lights and work your way out from that point. Attach the light string to the guidewire with zip ties, if using a guidewire."
        },
        {
          "headline":"Anchor the lights as you go if using a staple gun.",
          "description":"If you aren’t using a guidewire, you can use a staple gun to secure the lights as you drape them around the space. Staple the strings at equal heights to wooden objects, like beams, patio or fence posts, trees, and the wooden posts you placed around the space, if applicable. Make sure not to staple into the wire, because that could make the light short out or spark. The points of the staple should go on either side of the wire, so that you don’t puncture it."
        },
        {
          "headline":"Plug in the lights and enjoy!",
          "description":"Once you’ve strung the lights around the space, ensure that they are securely mounted and level. Make adjustments, if necessary. Then, plug the lights into the outlet and enjoy your illuminated space."
        }
      ]
    }
  ],
  "text":" Mapping Out the Pattern Use existing architecture. Before you do anything else, consider how you can use existing architecture to hang and anchor the lights. For instance, the roof of your home, trees on your property, fence posts along borders, and patio structures or awnings can be utilized to hang outdoor lights so that you don’t have to create separate posts to mount/anchor them to. For example, string lights between your home and garage over your lawn. Alternatively, hang lights between your deck and posts you place throughout the yard. Factor in outlet locations. Obviously, you’ll need to be able to plug in the lights, so consider where the outdoor electrical outlets are located on your property. You’ll need to begin near an outlet with enough voltage to power the strings you want to use. Use an outlet on a circuit that does not have a lot of equipment plugged into it. If you plug too much equipment into one circuit, you'll trip the breaker and it will shut the power off. Design a pattern for the lights. You may want taut strings or draping lines. Common patterns for outdoor lights include straight lines, v patterns or diamonds, x patterns, and checkerboards. Think about how much light you need and where you want to concentrate it. Also, consider how far from the ground the lights should be so that people can easily walk underneath them, if applicable. For example, you may want to zigzag a string of lights over your fire pit or patio area. Alternatively, you could wind strings of lights between patio posts. Choose your mounting points. Use eaves, beams, posts, or trees for mounting points. Pick mounting points at regular intervals, such as every 5 feet (1.5 m). Use at least 2 mounting points per string, and make sure that each mounting point is at the same height. Decide how to anchor the lights. You can purchase guide wire, wire rope clamps, eye to eye turnbuckles, zip ties, and screw hooks to add extra stability if you’re stringing the lights between structures. Or, for a simpler attachment, you can use a staple gun to secure the strings of lights directly to wooden fixtures. Install wooden posts to anchor the lights to, if necessary. If you don’t have enough existing beams, structures, or trees, you can easily make wooden posts to anchor the lights to. Put 4 by 4 in (10 by 10 cm) wooden posts of the desired height in stainless steel buckets. Mix cement and pour it into the buckets. Allow the cement to dry completely, then place the buckets around your property at the desired mounting points. Measure the desired pattern using string. String is the perfect tool to help you determine how many lights you’ll need. Run a string from the outlet you intend to use to each mounting point. Then, measure the string to determine how long the light string should be or many sets of strings you’ll need to complete the pattern. Buy enough outdoor lights to cover the pattern and a few spares. There are many different types of string lights, from icicle and fairy lights to globe or rope lights. Choose what you like best, and make sure you get a little more than enough to create the pattern you mapped out. Always buy lights designed specifically for outdoor locations to ensure they can withstand the elements. Star-shaped string lights would provide soft light and enhance the outdoor ambience. Colored lights would provide a party-like feel to your outdoor space, and could be tailored to holiday colors. Installing the Lights Plug in and test the lights. Before you go any further, plug the lights into the outlet you plan to use. This is a good way to test if the circuit can handle the additional power for the lights. Then, connect all the strings together and replace any broken or burnt-out bulbs, if necessary. You can unplug the strings from each other and the lights from the outlet before hanging them, but be sure to leave enough slack so you can reach the outlet to plug them back in when you’re done. Install the screw hooks and guide wire, if desired. For a sturdier and longer-lasting installation, screw hooks into the structure at each of the chosen mounting points. Then, attach an eye to eye turnbuckle to each screw hook, run guide wire between each turnbuckle, and secure the guidewire to the turnbuckles with wire clamps. This reduces stress on the string light wires and keeps them from drooping. Wind the lights along the chosen pattern. Start at the outlet you will use to power the lights and work your way out from that point. Attach the light string to the guidewire with zip ties, if using a guidewire. Anchor the lights as you go if using a staple gun. If you aren’t using a guidewire, you can use a staple gun to secure the lights as you drape them around the space. Staple the strings at equal heights to wooden objects, like beams, patio or fence posts, trees, and the wooden posts you placed around the space, if applicable. Make sure not to staple into the wire, because that could make the light short out or spark. The points of the staple should go on either side of the wire, so that you don’t puncture it. Plug in the lights and enjoy! Once you’ve strung the lights around the space, ensure that they are securely mounted and level. Make adjustments, if necessary. Then, plug the lights into the outlet and enjoy your illuminated space.",
  "sentences":[
    " Mapping Out the Pattern Use existing architecture.",
    "Before you do anything else, consider how you can use existing architecture to hang and anchor the lights.",
    "For instance, the roof of your home, trees on your property, fence posts along borders, and patio structures or awnings can be utilized to hang outdoor lights so that you don’t have to create separate posts to mount/anchor them to.",
    "For example, string lights between your home and garage over your lawn.",
    "Alternatively, hang lights between your deck and posts you place throughout the yard.",
    "Factor in outlet locations.",
    "Obviously, you’ll need to be able to plug in the lights, so consider where the outdoor electrical outlets are located on your property.",
    "You’ll need to begin near an outlet with enough voltage to power the strings you want to use.",
    "Use an outlet on a circuit that does not have a lot of equipment plugged into it.",
    "If you plug too much equipment into one circuit, you'll trip the breaker and it will shut the power off.",
    "Design a pattern for the lights.",
    "You may want taut strings or draping lines.",
    "Common patterns for outdoor lights include straight lines, v patterns or diamonds, x patterns, and checkerboards.",
    "Think about how much light you need and where you want to concentrate it.",
    "Also, consider how far from the ground the lights should be so that people can easily walk underneath them, if applicable.",
    "For example, you may want to zigzag a string of lights over your fire pit or patio area.",
    "Alternatively, you could wind strings of lights between patio posts.",
    "Choose your mounting points.",
    "Use eaves, beams, posts, or trees for mounting points.",
    "Pick mounting points at regular intervals, such as every 5 feet (1.5 m).",
    "Use at least 2 mounting points per string, and make sure that each mounting point is at the same height.",
    "Decide how to anchor the lights.",
    "You can purchase guide wire, wire rope clamps, eye to eye turnbuckles, zip ties, and screw hooks to add extra stability if you’re stringing the lights between structures.",
    "Or, for a simpler attachment, you can use a staple gun to secure the strings of lights directly to wooden fixtures.",
    "Install wooden posts to anchor the lights to, if necessary.",
    "If you don’t have enough existing beams, structures, or trees, you can easily make wooden posts to anchor the lights to.",
    "Put 4 by 4 in (10 by 10 cm) wooden posts of the desired height in stainless steel buckets.",
    "Mix cement and pour it into the buckets.",
    "Allow the cement to dry completely, then place the buckets around your property at the desired mounting points.",
    "Measure the desired pattern using string.",
    "String is the perfect tool to help you determine how many lights you’ll need.",
    "Run a string from the outlet you intend to use to each mounting point.",
    "Then, measure the string to determine how long the light string should be or many sets of strings you’ll need to complete the pattern.",
    "Buy enough outdoor lights to cover the pattern and a few spares.",
    "There are many different types of string lights, from icicle and fairy lights to globe or rope lights.",
    "Choose what you like best, and make sure you get a little more than enough to create the pattern you mapped out.",
    "Always buy lights designed specifically for outdoor locations to ensure they can withstand the elements.",
    "Star-shaped string lights would provide soft light and enhance the outdoor ambience.",
    "Colored lights would provide a party-like feel to your outdoor space, and could be tailored to holiday colors.",
    "Installing the Lights Plug in and test the lights.",
    "Before you go any further, plug the lights into the outlet you plan to use.",
    "This is a good way to test if the circuit can handle the additional power for the lights.",
    "Then, connect all the strings together and replace any broken or burnt-out bulbs, if necessary.",
    "You can unplug the strings from each other and the lights from the outlet before hanging them, but be sure to leave enough slack so you can reach the outlet to plug them back in when you’re done.",
    "Install the screw hooks and guide wire, if desired.",
    "For a sturdier and longer-lasting installation, screw hooks into the structure at each of the chosen mounting points.",
    "Then, attach an eye to eye turnbuckle to each screw hook, run guide wire between each turnbuckle, and secure the guidewire to the turnbuckles with wire clamps.",
    "This reduces stress on the string light wires and keeps them from drooping.",
    "Wind the lights along the chosen pattern.",
    "Start at the outlet you will use to power the lights and work your way out from that point.",
    "Attach the light string to the guidewire with zip ties, if using a guidewire.",
    "Anchor the lights as you go if using a staple gun.",
    "If you aren’t using a guidewire, you can use a staple gun to secure the lights as you drape them around the space.",
    "Staple the strings at equal heights to wooden objects, like beams, patio or fence posts, trees, and the wooden posts you placed around the space, if applicable.",
    "Make sure not to staple into the wire, because that could make the light short out or spark.",
    "The points of the staple should go on either side of the wire, so that you don’t puncture it.",
    "Plug in the lights and enjoy!",
    "Once you’ve strung the lights around the space, ensure that they are securely mounted and level.",
    "Make adjustments, if necessary.",
    "Then, plug the lights into the outlet and enjoy your illuminated space."
  ],
  "tyn_section":[
    "String",
    "Tape measure",
    "Outdoor lights",
    "Staple gun and staples OR",
    "Guide wire, wire rope clamps, eye to eye turnbuckles, zip ties, and screw hooks",
    "Wooden Posts for Anchoring (Optional)",
    "Stainless steel buckets",
    "4 by 4 in (10 by 10 cm) wooden posts",
    "Cement mix, water, and stir stick"
  ],
  "tyn_model":[
    "lights",
    "outlet",
    "guide wire",
    "screw hooks",
    "staple gun",
    "zip ties",
    "cement",
    "buckets",
    "string",
    "electrical outlets",
    "checkerboards",
    "wire rope",
    "stainless steel buckets",
    "wire clamps",
    "wire",
    "staple"
  ],
  "simple_metrics":{
    "r":0.2222222222,
    "p":0.125,
    "f1":0.16,
    "avg_pos":0.5
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1875,
    "f1":0.24
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4444444444,
    "p":0.3125,
    "f1":0.3669724771
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2222222222,
    "p":0.125,
    "f1":0.16
  }
}