{
  "title":"How to Remove Wine Stains",
  "url":"https://www.wikihow.com/Remove-Wine-Stains",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal",
    "Drink Stains",
    "Treating Wine Stains"
  ],
  "methods":[
    {
      "name":"Responding Immediately to the Stain",
      "steps":[
        {
          "headline":"Blot the stain.",
          "description":"As soon as you notice the red wine stain, blot it using paper towels. Try to soak up as much of the red wine as possible. Take care not to scrub the stain or you will actually make it harder to remove."
        },
        {
          "headline":"Apply a dry material that will lift the stain.",
          "description":"Once you've blotted away as much of the red wine as you can, sprinkle a lot of dry material that will pull the stain up and out of your material. Sprinkle enough to completely cover the stain. You can use:\nTable salt\nBaking soda\nSodium percarbonate (a granulated form of hydrogen peroxide found in laundry boosters)\nDry soap powder\nTalcum powder (such as baby powder)\nClay kitty litter"
        },
        {
          "headline":"Let the dry material sit for 2 minutes.",
          "description":"Avoid rubbing the dry material into the stain. Instead, let it just sit on top of the stain for a couple of minutes so the stain begins to lift. This blotting and drying method works well for carpet. Unlike fabrics, you won't be able to toss the carpet in the washing machine."
        },
        {
          "headline":"Vacuum up the dry material and check the stain.",
          "description":"Use a vacuum to suck up all of the dry material that you spread on the stain. Don't use any vacuum attachments that might rub the material deeper. Look at the space to see if the stain is gone. If it isn't, you'll need to deep treat the stain. If you responded quickly and the stain wasn't deep, the dry material might easily lift the stain."
        }
      ]
    },
    {
      "name":"Treating a Stubborn Stain",
      "steps":[
        {
          "headline":"Pour boiling water through the material.",
          "description":"If you're treating a stain on a piece of fabric or clothing, stretch the fabric over a large bowl. Position the stain in the center and wrap a rubber band around the outside of the bowl to hold the fabric in place. Bring a kettle of water to a boil and slowly pour the hot water through the stain and into the bowl. The hot water can loosen the stain and force it out of the fabric. If you're cleaning a fabric stain on a couch, you'll need to remove the cover or cushion to get to the stain."
        },
        {
          "headline":"Apply a brightening dish soap solution.",
          "description":"Get out a small bowl and pour in 1/4 cup (60 ml) of gentle dishwashing liquid. Stir in 1/4 cup (60 ml) of hydrogen peroxide until it's combined. Apply the solution to the stain and let it just soak in for 20 minutes. Once the stain looks like it's lifting, wash the material in the washing machine. Only use the brightening dish soap solution on light fabrics since it can lighten dark fabrics."
        },
        {
          "headline":"Apply vinegar and liquid laundry detergent.",
          "description":"Another way to lift stubborn stains is to coat the stain with white vinegar. Take a few spoonfuls of liquid laundry detergent and rub the soap in. This should loosen the stain. Wash the fabric in hot water to completely remove the stain."
        },
        {
          "headline":"Spray and blot up a club soda and white vinegar mixture.",
          "description":"If you don't have very many materials to make a deep cleaning solution, just spray club soda mixed with equal parts of white vinegar over the stain. Use paper towels or an old towel to blot up the mixture. You can repeat spraying and blotting until you see the stain lifting."
        }
      ]
    },
    {
      "name":"Lifting Dried Red Wine Stains",
      "steps":[
        {
          "headline":"Pour boiling water over the stain.",
          "description":"If you're removing the stain from fabric or clothing (not carpet), spread it tightly across a large bowl. Secure the fabric to the bowl with a rubber band and pour lots of boiling water right over the stain and into the bowl. The hot water should loosen the stain. If the stain was light, the water may be enough. If the stain is still there, it should be loosened and easier to treat now."
        },
        {
          "headline":"Mix together a cleaning solution.",
          "description":"Pour 2 cups (475 ml) of warm water into a spray bottle. Add 1 tablespoon (15 ml) of hydrogen peroxide or distilled white vinegar to the bottle along with 1 tablespoon (15 ml) of dishwashing liquid. Put the lid on the spray bottle and shake the bottle until the ingredients are combined."
        },
        {
          "headline":"Spray the solution on the dried stain.",
          "description":"Spray the mixture until the stain is completely covered. The area should be damp to the touch."
        },
        {
          "headline":"Blot and check the stain.",
          "description":"Use paper towels or an old cloth towel to blot the stained area. The towels will absorb the cleaning solution. Look at the area to see if the stain has lifted."
        },
        {
          "headline":"Repeat the spraying and blotting as needed.",
          "description":"If the stain is still visible, spray it with the cleaning solution again. Blot the area with dry towels and check it again. Continue spraying and blotting until the stain is gone."
        },
        {
          "headline":"Blot the area with cold water.",
          "description":"Once the stain isn't visible anymore, take a spray bottle with cold water and spray it over the area. Blot the area with a clean, dry towel or paper towels. Let the area dry. The water will rinse away any of the cleaning solution that's still in the fibers of the material."
        }
      ]
    }
  ],
  "text":" Responding Immediately to the Stain Blot the stain. As soon as you notice the red wine stain, blot it using paper towels. Try to soak up as much of the red wine as possible. Take care not to scrub the stain or you will actually make it harder to remove. Apply a dry material that will lift the stain. Once you've blotted away as much of the red wine as you can, sprinkle a lot of dry material that will pull the stain up and out of your material. Sprinkle enough to completely cover the stain. You can use:\nTable salt\nBaking soda\nSodium percarbonate (a granulated form of hydrogen peroxide found in laundry boosters)\nDry soap powder\nTalcum powder (such as baby powder)\nClay kitty litter Let the dry material sit for 2 minutes. Avoid rubbing the dry material into the stain. Instead, let it just sit on top of the stain for a couple of minutes so the stain begins to lift. This blotting and drying method works well for carpet. Unlike fabrics, you won't be able to toss the carpet in the washing machine. Vacuum up the dry material and check the stain. Use a vacuum to suck up all of the dry material that you spread on the stain. Don't use any vacuum attachments that might rub the material deeper. Look at the space to see if the stain is gone. If it isn't, you'll need to deep treat the stain. If you responded quickly and the stain wasn't deep, the dry material might easily lift the stain. Treating a Stubborn Stain Pour boiling water through the material. If you're treating a stain on a piece of fabric or clothing, stretch the fabric over a large bowl. Position the stain in the center and wrap a rubber band around the outside of the bowl to hold the fabric in place. Bring a kettle of water to a boil and slowly pour the hot water through the stain and into the bowl. The hot water can loosen the stain and force it out of the fabric. If you're cleaning a fabric stain on a couch, you'll need to remove the cover or cushion to get to the stain. Apply a brightening dish soap solution. Get out a small bowl and pour in 1/4 cup (60 ml) of gentle dishwashing liquid. Stir in 1/4 cup (60 ml) of hydrogen peroxide until it's combined. Apply the solution to the stain and let it just soak in for 20 minutes. Once the stain looks like it's lifting, wash the material in the washing machine. Only use the brightening dish soap solution on light fabrics since it can lighten dark fabrics. Apply vinegar and liquid laundry detergent. Another way to lift stubborn stains is to coat the stain with white vinegar. Take a few spoonfuls of liquid laundry detergent and rub the soap in. This should loosen the stain. Wash the fabric in hot water to completely remove the stain. Spray and blot up a club soda and white vinegar mixture. If you don't have very many materials to make a deep cleaning solution, just spray club soda mixed with equal parts of white vinegar over the stain. Use paper towels or an old towel to blot up the mixture. You can repeat spraying and blotting until you see the stain lifting. Lifting Dried Red Wine Stains Pour boiling water over the stain. If you're removing the stain from fabric or clothing (not carpet), spread it tightly across a large bowl. Secure the fabric to the bowl with a rubber band and pour lots of boiling water right over the stain and into the bowl. The hot water should loosen the stain. If the stain was light, the water may be enough. If the stain is still there, it should be loosened and easier to treat now. Mix together a cleaning solution. Pour 2 cups (475 ml) of warm water into a spray bottle. Add 1 tablespoon (15 ml) of hydrogen peroxide or distilled white vinegar to the bottle along with 1 tablespoon (15 ml) of dishwashing liquid. Put the lid on the spray bottle and shake the bottle until the ingredients are combined. Spray the solution on the dried stain. Spray the mixture until the stain is completely covered. The area should be damp to the touch. Blot and check the stain. Use paper towels or an old cloth towel to blot the stained area. The towels will absorb the cleaning solution. Look at the area to see if the stain has lifted. Repeat the spraying and blotting as needed. If the stain is still visible, spray it with the cleaning solution again. Blot the area with dry towels and check it again. Continue spraying and blotting until the stain is gone. Blot the area with cold water. Once the stain isn't visible anymore, take a spray bottle with cold water and spray it over the area. Blot the area with a clean, dry towel or paper towels. Let the area dry. The water will rinse away any of the cleaning solution that's still in the fibers of the material.",
  "sentences":[
    " Responding Immediately to the Stain Blot the stain.",
    "As soon as you notice the red wine stain, blot it using paper towels.",
    "Try to soak up as much of the red wine as possible.",
    "Take care not to scrub the stain or you will actually make it harder to remove.",
    "Apply a dry material that will lift the stain.",
    "Once you've blotted away as much of the red wine as you can, sprinkle a lot of dry material that will pull the stain up and out of your material.",
    "Sprinkle enough to completely cover the stain.",
    "You can use:\nTable salt\nBaking soda\nSodium percarbonate (a granulated form of hydrogen peroxide found in laundry boosters)\nDry soap powder\nTalcum powder (such as baby powder)\nClay kitty litter Let the dry material sit for 2 minutes.",
    "Avoid rubbing the dry material into the stain.",
    "Instead, let it just sit on top of the stain for a couple of minutes so the stain begins to lift.",
    "This blotting and drying method works well for carpet.",
    "Unlike fabrics, you won't be able to toss the carpet in the washing machine.",
    "Vacuum up the dry material and check the stain.",
    "Use a vacuum to suck up all of the dry material that you spread on the stain.",
    "Don't use any vacuum attachments that might rub the material deeper.",
    "Look at the space to see if the stain is gone.",
    "If it isn't, you'll need to deep treat the stain.",
    "If you responded quickly and the stain wasn't deep, the dry material might easily lift the stain.",
    "Treating a Stubborn Stain Pour boiling water through the material.",
    "If you're treating a stain on a piece of fabric or clothing, stretch the fabric over a large bowl.",
    "Position the stain in the center and wrap a rubber band around the outside of the bowl to hold the fabric in place.",
    "Bring a kettle of water to a boil and slowly pour the hot water through the stain and into the bowl.",
    "The hot water can loosen the stain and force it out of the fabric.",
    "If you're cleaning a fabric stain on a couch, you'll need to remove the cover or cushion to get to the stain.",
    "Apply a brightening dish soap solution.",
    "Get out a small bowl and pour in 1/4 cup (60 ml) of gentle dishwashing liquid.",
    "Stir in 1/4 cup (60 ml) of hydrogen peroxide until it's combined.",
    "Apply the solution to the stain and let it just soak in for 20 minutes.",
    "Once the stain looks like it's lifting, wash the material in the washing machine.",
    "Only use the brightening dish soap solution on light fabrics since it can lighten dark fabrics.",
    "Apply vinegar and liquid laundry detergent.",
    "Another way to lift stubborn stains is to coat the stain with white vinegar.",
    "Take a few spoonfuls of liquid laundry detergent and rub the soap in.",
    "This should loosen the stain.",
    "Wash the fabric in hot water to completely remove the stain.",
    "Spray and blot up a club soda and white vinegar mixture.",
    "If you don't have very many materials to make a deep cleaning solution, just spray club soda mixed with equal parts of white vinegar over the stain.",
    "Use paper towels or an old towel to blot up the mixture.",
    "You can repeat spraying and blotting until you see the stain lifting.",
    "Lifting Dried Red Wine Stains Pour boiling water over the stain.",
    "If you're removing the stain from fabric or clothing (not carpet), spread it tightly across a large bowl.",
    "Secure the fabric to the bowl with a rubber band and pour lots of boiling water right over the stain and into the bowl.",
    "The hot water should loosen the stain.",
    "If the stain was light, the water may be enough.",
    "If the stain is still there, it should be loosened and easier to treat now.",
    "Mix together a cleaning solution.",
    "Pour 2 cups (475 ml) of warm water into a spray bottle.",
    "Add 1 tablespoon (15 ml) of hydrogen peroxide or distilled white vinegar to the bottle along with 1 tablespoon (15 ml) of dishwashing liquid.",
    "Put the lid on the spray bottle and shake the bottle until the ingredients are combined.",
    "Spray the solution on the dried stain.",
    "Spray the mixture until the stain is completely covered.",
    "The area should be damp to the touch.",
    "Blot and check the stain.",
    "Use paper towels or an old cloth towel to blot the stained area.",
    "The towels will absorb the cleaning solution.",
    "Look at the area to see if the stain has lifted.",
    "Repeat the spraying and blotting as needed.",
    "If the stain is still visible, spray it with the cleaning solution again.",
    "Blot the area with dry towels and check it again.",
    "Continue spraying and blotting until the stain is gone.",
    "Blot the area with cold water.",
    "Once the stain isn't visible anymore, take a spray bottle with cold water and spray it over the area.",
    "Blot the area with a clean, dry towel or paper towels.",
    "Let the area dry.",
    "The water will rinse away any of the cleaning solution that's still in the fibers of the material."
  ],
  "tyn_section":[
    "For Immediate Removal",
    "Paper towels",
    "Dry material (such as kitty litter, talc, salt, or baking soda)",
    "Vacuum",
    "For Stubborn Stains",
    "Large bowl",
    "Rubber band",
    "Water kettle",
    "Gentle dishwashing liquid",
    "Hydrogen peroxide",
    "Small bowl",
    "Spoon",
    "Liquid laundry detergent",
    "White vinegar",
    "Club soda",
    "Spray bottle",
    "Measuring cups",
    "For Dried Stains",
    "Measuring cups and spoons",
    "Dishwashing liquid",
    "Distilled white vinegar",
    "Spray bottles",
    "Paper towels or cloth towels"
  ],
  "tyn_model":[
    "water",
    "paper towels",
    "red wine",
    "hydrogen peroxide",
    "white vinegar",
    "spray bottle",
    "vacuum",
    "boiling water",
    "rubber band",
    "bowl",
    "liquid laundry detergent",
    "club soda",
    "cold water",
    "table salt",
    "baking soda",
    "sodium percarbonate",
    "laundry boosters",
    "dry soap powder",
    "talcum powder",
    "baby powder",
    "clay kitty litter",
    "hot water",
    "brightening dish soap",
    "gentle dishwashing liquid",
    "washing machine",
    "dish soap",
    "vinegar",
    "soap",
    "warm water",
    "distilled white vinegar",
    "dishwashing liquid",
    "cleaning solution",
    "dry towels"
  ],
  "simple_metrics":{
    "r":0.4782608696,
    "p":0.3333333333,
    "f1":0.3928571429,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.652173913,
    "p":0.4242424242,
    "f1":0.5140758874
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6956521739,
    "p":0.6060606061,
    "f1":0.6477732794
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4782608696,
    "p":0.3333333333,
    "f1":0.3928571429
  }
}