{
  "title":"How to Hang a Tree Swing",
  "url":"https://www.wikihow.com/Hang-a-Tree-Swing",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games"
  ],
  "methods":[
    {
      "name":"Choosing a Sturdy Tree and Branch",
      "steps":[
        {
          "headline":"Select a hardwood tree.",
          "description":"Sturdy, hardwood trees are the best for installing swings. These include oak trees, sugar maples, or ash trees. Avoid putting swings on pine trees or fruit trees."
        },
        {
          "headline":"Evaluate the condition of the tree and branches.",
          "description":"Both the tree and the individual branch need to be healthy and strong to hold a swing. Make sure that the tree is not diseased or infested with bugs. The branch should not be cracked or peeling. Never attach a swing to a dead branch. If you’re uncertain about the condition of the tree, ask an arborist to check it out for you."
        },
        {
          "headline":"Find a long branch that is parallel to the ground.",
          "description":"The branch should make an “L” shape as it extends from the tree. You will need a branch that is at least 6 feet (1.8 m) long. The branch should not be more than 20 feet (6.1 m) off the ground. The swing will need to be at least 3–5 feet (0.91–1.52 m) away from the trunk so that it does not hit the tree. It also shouldn't, however, be near the end of the branch, where it is weakest. The branch should be very strong in the middle."
        },
        {
          "headline":"Look for a branch that is at least 8 inches (200 mm) in diameter.",
          "description":"The branch needs to be thick enough that it will not break under the force the swing exerts. Make sure that the branch does not get significantly narrower as it goes out from the tree."
        }
      ]
    },
    {
      "name":"Bolting a Swing to the Tree",
      "steps":[
        {
          "headline":"Find eye bolts that are ⁄8 inch (16 mm) in diameter.",
          "description":"You can use larger eye bolts but not smaller. Get stainless or galvanized steel eye bolts that are longer than the branch is thick. If your branch is 8 inches (200 mm) thick, find an eye bolt that is longer than 8 inches (200 mm)"
        },
        {
          "headline":"Drill holes on the underside of the branch.",
          "description":"Place the holes about 3–5 feet (0.91–1.52 m) away from the trunk. Make them slightly larger than the screw’s diameter. So if you used ⁄8 inch (16 mm) bolts, drill a hole that is about ⁄4 inch (19 mm) in diameter. Drill all the way through the center of the branch. If you are hanging a tire swing or a disc swing, you may only need 1 hole. If you are hanging a rectangular swing, you will need 2 holes. The distance between the holes should be slightly larger than the swing. This will help stabilize the swing. You will likely need a ladder to reach the branch. Make sure that you have someone spotting you as you use the ladder."
        },
        {
          "headline":"Screw the eye bolts in on the underside of the tree.",
          "description":"Place the shank of the eye bolt into the hole under the branch. The loop should face down towards the ground. Turn the bolt in all the way. The end of the bolt should stick out the top of the branch. Screw a washer and a nut down onto the threads until they are pressed against the branch. This will secure the bolt to the tree. After you install the swing, check the eye bolts regularly to make sure that they are in good condition. If the bolts have rusted or bent, replace them. Healthy trees will grow around the eye bolts. If the wood is cracking near the bolts, however, you may need to move the swing to a different branch."
        },
        {
          "headline":"Attach an S-hook, quick link, or carabiner to the eye bolt.",
          "description":"No matter what type of hardware you use, make sure it is the highest possible weight rating that you can get. If you use an S-hook, hook 1 loop on top; the bottom hook will be used for the rope. Unscrew the quick link and hook it on to the eye bolt before screwing it closed. If you use a carabiner, clip it through the loop."
        },
        {
          "headline":"Knot the rope onto the link.",
          "description":"Use a braided polyester rope with as high a weight rating as possible. You can attach the rope to the hook, link, or carabiner using a double square knot or a double running bowline knot. You will need at least as much rope as the branch is high, plus a few extra feet just to be safe. Do not attach the rope to the swing yet. It is fine if the swing came with the rope already attached, but it is easier to hang the rope without the swing attached. Alternatively, you can attach a metal chain to the link for the swing instead. Simply hook or loop the chain onto the link."
        },
        {
          "headline":"Attach the swing to the other end of the rope.",
          "description":"Place the rope through the holes of the swing. Adjust the height until it is to your satisfaction. Knot the rope using a bowline knot. Cut off any extra rope. If the swing is for a child, you may need to set the seat about 13 inches (330 mm) off the ground. If it is for adults, make it the same height as the seat of your pants."
        }
      ]
    },
    {
      "name":"Tying a Rope Swing to the Tree",
      "steps":[
        {
          "headline":"Use a braided polyester rope.",
          "description":"Polyester rope is strong enough to hold up the swing, but it won’t fray or fade in the elements. When purchasing rope, make sure that you get the highest weight rating possible. Unless the swing came with the rope already attached, do not attach the rope to the swing yet. If your swing came with a metal chain attached, you must attach it using an eye bolt. You cannot tie a chain to a tree."
        },
        {
          "headline":"Loop the rope over the tree branch.",
          "description":"Use a ladder to reach the tree branch and toss the rope over the branch. Make sure that the rope is at least 3–5 feet (0.91–1.52 m) away from the trunk."
        },
        {
          "headline":"Secure the rope using a bowline knot.",
          "description":"Make 2 loops with the rope. Place one end through the loops, then wrap it under the second end of the rope. Bring the first end back over the second end and put it back through the double loop. Pull both ends until tight. Leave about 3 inches (76 mm) of tail at the end of the knot. It is a good idea to check the knot regularly after putting the swing up. Make sure that the knot is still tight. If the rope is fraying, replace it."
        },
        {
          "headline":"Attach the swing to the other end of the rope.",
          "description":"Stick the ends of the rope through the holes of the swing. Move the swing up the rope until the height is right. Make a bowline or figure eight knot immediately under the swing, and cut off any extra rope. If the swing is for a child, you can place the seat about 13 inches (330 mm) off the ground. If adults will be using the swing too, try to find a height based on what would be comfortable for you."
        }
      ]
    }
  ],
  "text":" Choosing a Sturdy Tree and Branch Select a hardwood tree. Sturdy, hardwood trees are the best for installing swings. These include oak trees, sugar maples, or ash trees. Avoid putting swings on pine trees or fruit trees. Evaluate the condition of the tree and branches. Both the tree and the individual branch need to be healthy and strong to hold a swing. Make sure that the tree is not diseased or infested with bugs. The branch should not be cracked or peeling. Never attach a swing to a dead branch. If you’re uncertain about the condition of the tree, ask an arborist to check it out for you. Find a long branch that is parallel to the ground. The branch should make an “L” shape as it extends from the tree. You will need a branch that is at least 6 feet (1.8 m) long. The branch should not be more than 20 feet (6.1 m) off the ground. The swing will need to be at least 3–5 feet (0.91–1.52 m) away from the trunk so that it does not hit the tree. It also shouldn't, however, be near the end of the branch, where it is weakest. The branch should be very strong in the middle. Look for a branch that is at least 8 inches (200 mm) in diameter. The branch needs to be thick enough that it will not break under the force the swing exerts. Make sure that the branch does not get significantly narrower as it goes out from the tree. Bolting a Swing to the Tree Find eye bolts that are ⁄8 inch (16 mm) in diameter. You can use larger eye bolts but not smaller. Get stainless or galvanized steel eye bolts that are longer than the branch is thick. If your branch is 8 inches (200 mm) thick, find an eye bolt that is longer than 8 inches (200 mm) Drill holes on the underside of the branch. Place the holes about 3–5 feet (0.91–1.52 m) away from the trunk. Make them slightly larger than the screw’s diameter. So if you used ⁄8 inch (16 mm) bolts, drill a hole that is about ⁄4 inch (19 mm) in diameter. Drill all the way through the center of the branch. If you are hanging a tire swing or a disc swing, you may only need 1 hole. If you are hanging a rectangular swing, you will need 2 holes. The distance between the holes should be slightly larger than the swing. This will help stabilize the swing. You will likely need a ladder to reach the branch. Make sure that you have someone spotting you as you use the ladder. Screw the eye bolts in on the underside of the tree. Place the shank of the eye bolt into the hole under the branch. The loop should face down towards the ground. Turn the bolt in all the way. The end of the bolt should stick out the top of the branch. Screw a washer and a nut down onto the threads until they are pressed against the branch. This will secure the bolt to the tree. After you install the swing, check the eye bolts regularly to make sure that they are in good condition. If the bolts have rusted or bent, replace them. Healthy trees will grow around the eye bolts. If the wood is cracking near the bolts, however, you may need to move the swing to a different branch. Attach an S-hook, quick link, or carabiner to the eye bolt. No matter what type of hardware you use, make sure it is the highest possible weight rating that you can get. If you use an S-hook, hook 1 loop on top; the bottom hook will be used for the rope. Unscrew the quick link and hook it on to the eye bolt before screwing it closed. If you use a carabiner, clip it through the loop. Knot the rope onto the link. Use a braided polyester rope with as high a weight rating as possible. You can attach the rope to the hook, link, or carabiner using a double square knot or a double running bowline knot. You will need at least as much rope as the branch is high, plus a few extra feet just to be safe. Do not attach the rope to the swing yet. It is fine if the swing came with the rope already attached, but it is easier to hang the rope without the swing attached. Alternatively, you can attach a metal chain to the link for the swing instead. Simply hook or loop the chain onto the link. Attach the swing to the other end of the rope. Place the rope through the holes of the swing. Adjust the height until it is to your satisfaction. Knot the rope using a bowline knot. Cut off any extra rope. If the swing is for a child, you may need to set the seat about 13 inches (330 mm) off the ground. If it is for adults, make it the same height as the seat of your pants. Tying a Rope Swing to the Tree Use a braided polyester rope. Polyester rope is strong enough to hold up the swing, but it won’t fray or fade in the elements. When purchasing rope, make sure that you get the highest weight rating possible. Unless the swing came with the rope already attached, do not attach the rope to the swing yet. If your swing came with a metal chain attached, you must attach it using an eye bolt. You cannot tie a chain to a tree. Loop the rope over the tree branch. Use a ladder to reach the tree branch and toss the rope over the branch. Make sure that the rope is at least 3–5 feet (0.91–1.52 m) away from the trunk. Secure the rope using a bowline knot. Make 2 loops with the rope. Place one end through the loops, then wrap it under the second end of the rope. Bring the first end back over the second end and put it back through the double loop. Pull both ends until tight. Leave about 3 inches (76 mm) of tail at the end of the knot. It is a good idea to check the knot regularly after putting the swing up. Make sure that the knot is still tight. If the rope is fraying, replace it. Attach the swing to the other end of the rope. Stick the ends of the rope through the holes of the swing. Move the swing up the rope until the height is right. Make a bowline or figure eight knot immediately under the swing, and cut off any extra rope. If the swing is for a child, you can place the seat about 13 inches (330 mm) off the ground. If adults will be using the swing too, try to find a height based on what would be comfortable for you.",
  "sentences":[
    " Choosing a Sturdy Tree and Branch Select a hardwood tree.",
    "Sturdy, hardwood trees are the best for installing swings.",
    "These include oak trees, sugar maples, or ash trees.",
    "Avoid putting swings on pine trees or fruit trees.",
    "Evaluate the condition of the tree and branches.",
    "Both the tree and the individual branch need to be healthy and strong to hold a swing.",
    "Make sure that the tree is not diseased or infested with bugs.",
    "The branch should not be cracked or peeling.",
    "Never attach a swing to a dead branch.",
    "If you’re uncertain about the condition of the tree, ask an arborist to check it out for you.",
    "Find a long branch that is parallel to the ground.",
    "The branch should make an “L” shape as it extends from the tree.",
    "You will need a branch that is at least 6 feet (1.8 m) long.",
    "The branch should not be more than 20 feet (6.1 m) off the ground.",
    "The swing will need to be at least 3–5 feet (0.91–1.52 m) away from the trunk so that it does not hit the tree.",
    "It also shouldn't, however, be near the end of the branch, where it is weakest.",
    "The branch should be very strong in the middle.",
    "Look for a branch that is at least 8 inches (200 mm) in diameter.",
    "The branch needs to be thick enough that it will not break under the force the swing exerts.",
    "Make sure that the branch does not get significantly narrower as it goes out from the tree.",
    "Bolting a Swing to the Tree Find eye bolts that are ⁄8 inch (16 mm) in diameter.",
    "You can use larger eye bolts but not smaller.",
    "Get stainless or galvanized steel eye bolts that are longer than the branch is thick.",
    "If your branch is 8 inches (200 mm) thick, find an eye bolt that is longer than 8 inches (200 mm) Drill holes on the underside of the branch.",
    "Place the holes about 3–5 feet (0.91–1.52 m) away from the trunk.",
    "Make them slightly larger than the screw’s diameter.",
    "So if you used ⁄8 inch (16 mm) bolts, drill a hole that is about ⁄4 inch (19 mm) in diameter.",
    "Drill all the way through the center of the branch.",
    "If you are hanging a tire swing or a disc swing, you may only need 1 hole.",
    "If you are hanging a rectangular swing, you will need 2 holes.",
    "The distance between the holes should be slightly larger than the swing.",
    "This will help stabilize the swing.",
    "You will likely need a ladder to reach the branch.",
    "Make sure that you have someone spotting you as you use the ladder.",
    "Screw the eye bolts in on the underside of the tree.",
    "Place the shank of the eye bolt into the hole under the branch.",
    "The loop should face down towards the ground.",
    "Turn the bolt in all the way.",
    "The end of the bolt should stick out the top of the branch.",
    "Screw a washer and a nut down onto the threads until they are pressed against the branch.",
    "This will secure the bolt to the tree.",
    "After you install the swing, check the eye bolts regularly to make sure that they are in good condition.",
    "If the bolts have rusted or bent, replace them.",
    "Healthy trees will grow around the eye bolts.",
    "If the wood is cracking near the bolts, however, you may need to move the swing to a different branch.",
    "Attach an S-hook, quick link, or carabiner to the eye bolt.",
    "No matter what type of hardware you use, make sure it is the highest possible weight rating that you can get.",
    "If you use an S-hook, hook 1 loop on top; the bottom hook will be used for the rope.",
    "Unscrew the quick link and hook it on to the eye bolt before screwing it closed.",
    "If you use a carabiner, clip it through the loop.",
    "Knot the rope onto the link.",
    "Use a braided polyester rope with as high a weight rating as possible.",
    "You can attach the rope to the hook, link, or carabiner using a double square knot or a double running bowline knot.",
    "You will need at least as much rope as the branch is high, plus a few extra feet just to be safe.",
    "Do not attach the rope to the swing yet.",
    "It is fine if the swing came with the rope already attached, but it is easier to hang the rope without the swing attached.",
    "Alternatively, you can attach a metal chain to the link for the swing instead.",
    "Simply hook or loop the chain onto the link.",
    "Attach the swing to the other end of the rope.",
    "Place the rope through the holes of the swing.",
    "Adjust the height until it is to your satisfaction.",
    "Knot the rope using a bowline knot.",
    "Cut off any extra rope.",
    "If the swing is for a child, you may need to set the seat about 13 inches (330 mm) off the ground.",
    "If it is for adults, make it the same height as the seat of your pants.",
    "Tying a Rope Swing to the Tree Use a braided polyester rope.",
    "Polyester rope is strong enough to hold up the swing, but it won’t fray or fade in the elements.",
    "When purchasing rope, make sure that you get the highest weight rating possible.",
    "Unless the swing came with the rope already attached, do not attach the rope to the swing yet.",
    "If your swing came with a metal chain attached, you must attach it using an eye bolt.",
    "You cannot tie a chain to a tree.",
    "Loop the rope over the tree branch.",
    "Use a ladder to reach the tree branch and toss the rope over the branch.",
    "Make sure that the rope is at least 3–5 feet (0.91–1.52 m) away from the trunk.",
    "Secure the rope using a bowline knot.",
    "Make 2 loops with the rope.",
    "Place one end through the loops, then wrap it under the second end of the rope.",
    "Bring the first end back over the second end and put it back through the double loop.",
    "Pull both ends until tight.",
    "Leave about 3 inches (76 mm) of tail at the end of the knot.",
    "It is a good idea to check the knot regularly after putting the swing up.",
    "Make sure that the knot is still tight.",
    "If the rope is fraying, replace it.",
    "Attach the swing to the other end of the rope.",
    "Stick the ends of the rope through the holes of the swing.",
    "Move the swing up the rope until the height is right.",
    "Make a bowline or figure eight knot immediately under the swing, and cut off any extra rope.",
    "If the swing is for a child, you can place the seat about 13 inches (330 mm) off the ground.",
    "If adults will be using the swing too, try to find a height based on what would be comfortable for you."
  ],
  "tyn_section":[
    "Eye bolts",
    "Drill",
    "Washers and nuts",
    "Measuring tape",
    "Extension ladder",
    "Polyester rope",
    "Metal Chain",
    "Swing"
  ],
  "tyn_model":[
    "rope",
    "eye bolts",
    "ladder",
    "carabiner",
    "swing",
    "drill",
    "quick link",
    "polyester rope",
    "swings",
    "arborist",
    "“l",
    "” shape",
    "eye bolt",
    "tree",
    "washer",
    "chain"
  ],
  "simple_metrics":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333,
    "avg_pos":0.0625
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.4375,
    "f1":0.5526315789
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.5,
    "f1":0.6
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333
  }
}