{
  "title":"How to Store Slime",
  "url":"https://www.wikihow.com/Store-Slime",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids",
    "Putty Dough and Slime"
  ],
  "methods":[
    {
      "name":"Using a Ziplock Bag",
      "steps":[
        {
          "headline":"Stick the slime in a plastic bag.",
          "description":"A simple ziplock bag from the kitchen will suffice for storing your slime. Pick one that's just big enough to hold your slime. You don't want one that's too big, as you want as little air in the bag as possible."
        },
        {
          "headline":"Squeeze out the air.",
          "description":"Zip up the bag partway, and then squeeze out as much of the air in the bag as you can. Air will cause your slime to dry out, so getting it out will help preserve your slime."
        },
        {
          "headline":"Zip up the bag.",
          "description":"Once you have as much air out as you can, zip the bag up tight. Go over the zipper again to ensure it's fully closed. Keep in mind the slime may stick to the bag."
        },
        {
          "headline":"Place the bag in the refrigerator.",
          "description":"Sticking the bag in the refrigerator will help preserve the slime. The slime can grow bacteria, which will make the slime gross, but the refrigerator can slow that process down. Keep in mind that some slimes get hard when you refrigerate them, though."
        }
      ]
    },
    {
      "name":"Keeping Slime in an Airtight Container",
      "steps":[
        {
          "headline":"Pick a container just large enough to hold your slime.",
          "description":"You don't want your slime to dry out, so air is your enemy. Go for a container that just barely holds your slime. It can also help to tuck some plastic wrap on top of the slime to keep it from drying out. Press the plastic wrap onto the slime. A plastic food container will work just fine."
        },
        {
          "headline":"Seal up the container.",
          "description":"Close up the container tightly, making sure it's sealed all the way around. You can also use a screw-top container or jar. You want to keep that air out as best you can!"
        },
        {
          "headline":"Put the slime in the refrigerator.",
          "description":"The best place to keep your slime is in the refrigerator. The cold will help slow down the growth of bacteria, mold, and other yucky stuff."
        }
      ]
    },
    {
      "name":"Keeping Your Slime Fresh",
      "steps":[
        {
          "headline":"Keep the slime away from dirty surfaces.",
          "description":"If your slime lands somewhere gross, such as in the dirt, you'll likely need to toss it. It's best to just keep it away from these areas to help preserve it."
        },
        {
          "headline":"Wash your hands before playing with your slime.",
          "description":"The bacteria on your hands can increase the chances of nasty stuff growing on your slime. Try washing your hands thoroughly before playing with your slime. Use soap and warm water, and be sure to scrub for 20 seconds."
        },
        {
          "headline":"Add water to dry slime.",
          "description":"If your slime has dried out a bit, you can put it in a bowl and add some water. Mix it together with your hands until it softens. You can also use a drop or two of antibacterial gel in place of the water."
        }
      ]
    },
    {
      "name":"Disposing of Slime",
      "steps":[
        {
          "headline":"Check on the slime before a week is up.",
          "description":"Your slime won't last terribly long, usually a week or less. Make sure you play with it before it goes bad, and check on it in a week to see if it has."
        },
        {
          "headline":"Throw out moldy slime.",
          "description":"If your slime starts growing anything, it's time to toss it out. It might grow white or blue fuzz on top of it, which is mold. If you see it, just think of it as a sign to make new slime."
        },
        {
          "headline":"Look for dirtiness.",
          "description":"If you notice your slime is getting grungy, it's time to toss it. You may notice it's a different color or that it smells funny. It's also time to toss it if you accidentally drop it somewhere gross."
        },
        {
          "headline":"Toss the slime in the garbage.",
          "description":"You might be tempted to throw slime down the drain because it seems liquidy. However, it's much better to toss it in the trash, as it can clog up the drain."
        }
      ]
    }
  ],
  "text":" Using a Ziplock Bag Stick the slime in a plastic bag. A simple ziplock bag from the kitchen will suffice for storing your slime. Pick one that's just big enough to hold your slime. You don't want one that's too big, as you want as little air in the bag as possible. Squeeze out the air. Zip up the bag partway, and then squeeze out as much of the air in the bag as you can. Air will cause your slime to dry out, so getting it out will help preserve your slime. Zip up the bag. Once you have as much air out as you can, zip the bag up tight. Go over the zipper again to ensure it's fully closed. Keep in mind the slime may stick to the bag. Place the bag in the refrigerator. Sticking the bag in the refrigerator will help preserve the slime. The slime can grow bacteria, which will make the slime gross, but the refrigerator can slow that process down. Keep in mind that some slimes get hard when you refrigerate them, though. Keeping Slime in an Airtight Container Pick a container just large enough to hold your slime. You don't want your slime to dry out, so air is your enemy. Go for a container that just barely holds your slime. It can also help to tuck some plastic wrap on top of the slime to keep it from drying out. Press the plastic wrap onto the slime. A plastic food container will work just fine. Seal up the container. Close up the container tightly, making sure it's sealed all the way around. You can also use a screw-top container or jar. You want to keep that air out as best you can! Put the slime in the refrigerator. The best place to keep your slime is in the refrigerator. The cold will help slow down the growth of bacteria, mold, and other yucky stuff. Keeping Your Slime Fresh Keep the slime away from dirty surfaces. If your slime lands somewhere gross, such as in the dirt, you'll likely need to toss it. It's best to just keep it away from these areas to help preserve it. Wash your hands before playing with your slime. The bacteria on your hands can increase the chances of nasty stuff growing on your slime. Try washing your hands thoroughly before playing with your slime. Use soap and warm water, and be sure to scrub for 20 seconds. Add water to dry slime. If your slime has dried out a bit, you can put it in a bowl and add some water. Mix it together with your hands until it softens. You can also use a drop or two of antibacterial gel in place of the water. Disposing of Slime Check on the slime before a week is up. Your slime won't last terribly long, usually a week or less. Make sure you play with it before it goes bad, and check on it in a week to see if it has. Throw out moldy slime. If your slime starts growing anything, it's time to toss it out. It might grow white or blue fuzz on top of it, which is mold. If you see it, just think of it as a sign to make new slime. Look for dirtiness. If you notice your slime is getting grungy, it's time to toss it. You may notice it's a different color or that it smells funny. It's also time to toss it if you accidentally drop it somewhere gross. Toss the slime in the garbage. You might be tempted to throw slime down the drain because it seems liquidy. However, it's much better to toss it in the trash, as it can clog up the drain.",
  "sentences":[
    " Using a Ziplock Bag Stick the slime in a plastic bag.",
    "A simple ziplock bag from the kitchen will suffice for storing your slime.",
    "Pick one that's just big enough to hold your slime.",
    "You don't want one that's too big, as you want as little air in the bag as possible.",
    "Squeeze out the air.",
    "Zip up the bag partway, and then squeeze out as much of the air in the bag as you can.",
    "Air will cause your slime to dry out, so getting it out will help preserve your slime.",
    "Zip up the bag.",
    "Once you have as much air out as you can, zip the bag up tight.",
    "Go over the zipper again to ensure it's fully closed.",
    "Keep in mind the slime may stick to the bag.",
    "Place the bag in the refrigerator.",
    "Sticking the bag in the refrigerator will help preserve the slime.",
    "The slime can grow bacteria, which will make the slime gross, but the refrigerator can slow that process down.",
    "Keep in mind that some slimes get hard when you refrigerate them, though.",
    "Keeping Slime in an Airtight Container Pick a container just large enough to hold your slime.",
    "You don't want your slime to dry out, so air is your enemy.",
    "Go for a container that just barely holds your slime.",
    "It can also help to tuck some plastic wrap on top of the slime to keep it from drying out.",
    "Press the plastic wrap onto the slime.",
    "A plastic food container will work just fine.",
    "Seal up the container.",
    "Close up the container tightly, making sure it's sealed all the way around.",
    "You can also use a screw-top container or jar.",
    "You want to keep that air out as best you can!",
    "Put the slime in the refrigerator.",
    "The best place to keep your slime is in the refrigerator.",
    "The cold will help slow down the growth of bacteria, mold, and other yucky stuff.",
    "Keeping Your Slime Fresh Keep the slime away from dirty surfaces.",
    "If your slime lands somewhere gross, such as in the dirt, you'll likely need to toss it.",
    "It's best to just keep it away from these areas to help preserve it.",
    "Wash your hands before playing with your slime.",
    "The bacteria on your hands can increase the chances of nasty stuff growing on your slime.",
    "Try washing your hands thoroughly before playing with your slime.",
    "Use soap and warm water, and be sure to scrub for 20 seconds.",
    "Add water to dry slime.",
    "If your slime has dried out a bit, you can put it in a bowl and add some water.",
    "Mix it together with your hands until it softens.",
    "You can also use a drop or two of antibacterial gel in place of the water.",
    "Disposing of Slime Check on the slime before a week is up.",
    "Your slime won't last terribly long, usually a week or less.",
    "Make sure you play with it before it goes bad, and check on it in a week to see if it has.",
    "Throw out moldy slime.",
    "If your slime starts growing anything, it's time to toss it out.",
    "It might grow white or blue fuzz on top of it, which is mold.",
    "If you see it, just think of it as a sign to make new slime.",
    "Look for dirtiness.",
    "If you notice your slime is getting grungy, it's time to toss it.",
    "You may notice it's a different color or that it smells funny.",
    "It's also time to toss it if you accidentally drop it somewhere gross.",
    "Toss the slime in the garbage.",
    "You might be tempted to throw slime down the drain because it seems liquidy.",
    "However, it's much better to toss it in the trash, as it can clog up the drain."
  ],
  "tyn_section":[
    "Dirty Slime",
    "Ziplock bag or airtight container",
    "Plastic wrap, optional"
  ],
  "tyn_model":[
    "refrigerator",
    "container",
    "water",
    "slime",
    "ziplock bag",
    "plastic wrap",
    "plastic bag",
    "air",
    "plastic food container",
    "screw-top container",
    "jar",
    "soap",
    "bowl",
    "antibacterial gel",
    "garbage"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.0666666667,
    "f1":0.1111111111
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.1333333333,
    "f1":0.2222222222
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}