{
  "title":"How to Repair Loose Bricks",
  "url":"https://www.wikihow.com/Repair-Loose-Bricks",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Brickwork and Stone Masonry"
  ],
  "parts":[
    {
      "name":"Removing the Old Mortar",
      "steps":[
        {
          "headline":"Put on your safety gear.",
          "description":"Wear safety glasses, good leather gloves, a long-sleeved shirt, and a dust mask to stay safe. You'll be kicking up a lot of dust and mortar fragments. Protect your eyes by wearing safety glasses. When using the chisel or an angle grinder, put on a respirator to ensure you don't breathe in airborne mortar particles. Make sure the area is well-ventilated, especially if you use a grinder."
        },
        {
          "headline":"Chip away the old mortar with a hammer and chisel.",
          "description":"Point a flat-headed chisel directly at the mortar around the loosened brick. Lay the flat side of the chisel firmly on the brick and strike at the edge of the mortar connecting it to the brick, as though you are trying to slide a spatula under a pancake. Work around the brick, breaking apart the mortar one side at a time. Be careful not to strike the brick and damage it."
        },
        {
          "headline":"Cut into stubborn mortar with an angle grinder.",
          "description":"Pick up a 4 in (10 cm) angle grinder at the home improvement store. Start with the vertical joints. Position the grinding disc to cut ⁄2 in (1.3 cm) into the mortar. Repeat this with the horizontal joints to free the brick. Make sure that you choose a masonry-specific grinding disc. Be very careful when using the angle grinder. It's easy to slip and cut into the brick. Before using the grinder on bricks you plan to use, it's best to practice on an old brick or a cheap practice brick."
        },
        {
          "headline":"Brush away the debris with a whisk broom.",
          "description":"Clear out the wall space with a mortar whisk broom or another stiff-bristle brush. If you have an air compressor, it'll also help clear out any remaining dust. Remember to wear your protective eye wear and face mask, especially if you use an air compressor. You should also watch where the debris goes so that you don't hurt yourself or others."
        },
        {
          "headline":"Chisel the old mortar off the brick.",
          "description":"Set the brick down on a flat surface. Hold the chisel at an angle above it. Hammer the chisel quickly and lightly while moving the tip over the mortar. If the brick needs to be replaced, bring the old brick to the store. Try to match the size and color."
        },
        {
          "headline":"Brush and rinse off the brick.",
          "description":"Clear off the debris with a wire brush or air compressor. Finish cleaning the brick by spraying it with water. Keep the brick and wall hole damp with a hose or misting bottle so the mortar sticks and cures better."
        }
      ]
    },
    {
      "name":"Mixing Mortar",
      "steps":[
        {
          "headline":"Put on safety glasses and gloves.",
          "description":"The chemicals in the mortar can burn your skin. In addition to continuing to wear eye protection, slip on a pair of waterproof gloves. Long-sleeved clothing is also recommended to ensure dripping mortar can't reach you."
        },
        {
          "headline":"Place dry mortar mix in a bucket.",
          "description":"The kind of product you want is labeled as mortar mix. Avoid sand or concrete mixes. Add the amount of mortar you need into a mixing container, such as a wheelbarrow or dishpan. Match the type of mortar you get to the type that's in the rest of your wall, if possible. Mortar mixes come in different grades. M is the strongest and meant for walls bearing heavy loads. S is a little more flexible, N is for most walls exposed to the weather, and O is for interior and non-load-bearing exterior walls. If you don't know what's in your wall, you might need to guess based on the grading scale."
        },
        {
          "headline":"Mix the mortar with water until it's thick.",
          "description":"Follow the manufacturer's instructions to figure out how much water to add. Stir the water and mortar mix together with a hand trowel. Try to get the mortar into a consistency similar to peanut butter. You may also purchase latex additive from a home improvement store and add a little bit to make the mixture stronger. Start with small batches. You'll have an hour or less to use the mortar before it dries."
        }
      ]
    },
    {
      "name":"Adding and Protecting New Mortar",
      "steps":[
        {
          "headline":"Spread a layer of mortar inside the hole.",
          "description":"Dip your trowel into the mortar to scoop up a small coating. Spread about ⁄2 in (13 mm) of mortar over the left and right sides of the cavity. Finish by coating the bottom of the hole with an equal amount of mortar. If the mortar begins drying out while you're mixing and applying more mortar, lightly moisten it with a hose or misting bottle."
        },
        {
          "headline":"Cover the top of the brick in mortar.",
          "description":"Add another ½ inch layer of mortar to the brick's top. Even and smooth out the mortar before putting the brick in place."
        },
        {
          "headline":"Slide the brick into the hole.",
          "description":"Pick up the brick and push it into the hole. Mortar will ooze out, so make sure you're still wearing sturdy gloves."
        },
        {
          "headline":"Fill the joints with mortar.",
          "description":"Use the trowel or a tuckpointing tool to catch the oozing mortar and push it back into the spaces around the brick. Load more mortar onto one of these tools and push it into these joint spaces until they're full."
        },
        {
          "headline":"Smooth out the mortar to match the rest of the wall.",
          "description":"After you've finished filling the joints, stroke a flat blade over the mortar to even it out. In addition to the trowel or tuckpointing tool, you may use a brick jointer. Blend in your work by making it match the joints around other bricks as much as possible. Let the joint mortar set up until it just gives when you press your finger into it, and then use the brick jointer tool to create the dimpled beveled joint lines. If the mortar is too wet when you create the beveled joint lines, then it may just scrape out of the joints."
        },
        {
          "headline":"Wipe away excess mortar with a soft-bristle brush.",
          "description":"Use the brush to remove any mortar that has spilled over the bricks. Dampen the mortar first if it has begun to solidify. It's important to do this immediately or else you'll need muriatic acid or a commercial cleaner to remove the mortar. Take special care when using muriatic acid."
        },
        {
          "headline":"Spray the mortar daily for 3 days.",
          "description":"Fill a spray bottle with water and immediately use it to lightly mist the new mortar today. This allows the mortar to cure properly. Do this once a day until the mortar is strong."
        },
        {
          "headline":"Cover the mortar when you're not misting it.",
          "description":"Purchase a tarp and tape it over the new mortar right after you've misted it the first time. The tarp keeps the mortar safe from the sun and rain. You will need to pull down the tarp to mist the mortar, but after 72 hours it should be safe to remove permanently."
        }
      ]
    }
  ],
  "text":" Removing the Old Mortar Put on your safety gear. Wear safety glasses, good leather gloves, a long-sleeved shirt, and a dust mask to stay safe. You'll be kicking up a lot of dust and mortar fragments. Protect your eyes by wearing safety glasses. When using the chisel or an angle grinder, put on a respirator to ensure you don't breathe in airborne mortar particles. Make sure the area is well-ventilated, especially if you use a grinder. Chip away the old mortar with a hammer and chisel. Point a flat-headed chisel directly at the mortar around the loosened brick. Lay the flat side of the chisel firmly on the brick and strike at the edge of the mortar connecting it to the brick, as though you are trying to slide a spatula under a pancake. Work around the brick, breaking apart the mortar one side at a time. Be careful not to strike the brick and damage it. Cut into stubborn mortar with an angle grinder. Pick up a 4 in (10 cm) angle grinder at the home improvement store. Start with the vertical joints. Position the grinding disc to cut ⁄2 in (1.3 cm) into the mortar. Repeat this with the horizontal joints to free the brick. Make sure that you choose a masonry-specific grinding disc. Be very careful when using the angle grinder. It's easy to slip and cut into the brick. Before using the grinder on bricks you plan to use, it's best to practice on an old brick or a cheap practice brick. Brush away the debris with a whisk broom. Clear out the wall space with a mortar whisk broom or another stiff-bristle brush. If you have an air compressor, it'll also help clear out any remaining dust. Remember to wear your protective eye wear and face mask, especially if you use an air compressor. You should also watch where the debris goes so that you don't hurt yourself or others. Chisel the old mortar off the brick. Set the brick down on a flat surface. Hold the chisel at an angle above it. Hammer the chisel quickly and lightly while moving the tip over the mortar. If the brick needs to be replaced, bring the old brick to the store. Try to match the size and color. Brush and rinse off the brick. Clear off the debris with a wire brush or air compressor. Finish cleaning the brick by spraying it with water. Keep the brick and wall hole damp with a hose or misting bottle so the mortar sticks and cures better. Mixing Mortar Put on safety glasses and gloves. The chemicals in the mortar can burn your skin. In addition to continuing to wear eye protection, slip on a pair of waterproof gloves. Long-sleeved clothing is also recommended to ensure dripping mortar can't reach you. Place dry mortar mix in a bucket. The kind of product you want is labeled as mortar mix. Avoid sand or concrete mixes. Add the amount of mortar you need into a mixing container, such as a wheelbarrow or dishpan. Match the type of mortar you get to the type that's in the rest of your wall, if possible. Mortar mixes come in different grades. M is the strongest and meant for walls bearing heavy loads. S is a little more flexible, N is for most walls exposed to the weather, and O is for interior and non-load-bearing exterior walls. If you don't know what's in your wall, you might need to guess based on the grading scale. Mix the mortar with water until it's thick. Follow the manufacturer's instructions to figure out how much water to add. Stir the water and mortar mix together with a hand trowel. Try to get the mortar into a consistency similar to peanut butter. You may also purchase latex additive from a home improvement store and add a little bit to make the mixture stronger. Start with small batches. You'll have an hour or less to use the mortar before it dries. Adding and Protecting New Mortar Spread a layer of mortar inside the hole. Dip your trowel into the mortar to scoop up a small coating. Spread about ⁄2 in (13 mm) of mortar over the left and right sides of the cavity. Finish by coating the bottom of the hole with an equal amount of mortar. If the mortar begins drying out while you're mixing and applying more mortar, lightly moisten it with a hose or misting bottle. Cover the top of the brick in mortar. Add another ½ inch layer of mortar to the brick's top. Even and smooth out the mortar before putting the brick in place. Slide the brick into the hole. Pick up the brick and push it into the hole. Mortar will ooze out, so make sure you're still wearing sturdy gloves. Fill the joints with mortar. Use the trowel or a tuckpointing tool to catch the oozing mortar and push it back into the spaces around the brick. Load more mortar onto one of these tools and push it into these joint spaces until they're full. Smooth out the mortar to match the rest of the wall. After you've finished filling the joints, stroke a flat blade over the mortar to even it out. In addition to the trowel or tuckpointing tool, you may use a brick jointer. Blend in your work by making it match the joints around other bricks as much as possible. Let the joint mortar set up until it just gives when you press your finger into it, and then use the brick jointer tool to create the dimpled beveled joint lines. If the mortar is too wet when you create the beveled joint lines, then it may just scrape out of the joints. Wipe away excess mortar with a soft-bristle brush. Use the brush to remove any mortar that has spilled over the bricks. Dampen the mortar first if it has begun to solidify. It's important to do this immediately or else you'll need muriatic acid or a commercial cleaner to remove the mortar. Take special care when using muriatic acid. Spray the mortar daily for 3 days. Fill a spray bottle with water and immediately use it to lightly mist the new mortar today. This allows the mortar to cure properly. Do this once a day until the mortar is strong. Cover the mortar when you're not misting it. Purchase a tarp and tape it over the new mortar right after you've misted it the first time. The tarp keeps the mortar safe from the sun and rain. You will need to pull down the tarp to mist the mortar, but after 72 hours it should be safe to remove permanently.",
  "sentences":[
    " Removing the Old Mortar Put on your safety gear.",
    "Wear safety glasses, good leather gloves, a long-sleeved shirt, and a dust mask to stay safe.",
    "You'll be kicking up a lot of dust and mortar fragments.",
    "Protect your eyes by wearing safety glasses.",
    "When using the chisel or an angle grinder, put on a respirator to ensure you don't breathe in airborne mortar particles.",
    "Make sure the area is well-ventilated, especially if you use a grinder.",
    "Chip away the old mortar with a hammer and chisel.",
    "Point a flat-headed chisel directly at the mortar around the loosened brick.",
    "Lay the flat side of the chisel firmly on the brick and strike at the edge of the mortar connecting it to the brick, as though you are trying to slide a spatula under a pancake.",
    "Work around the brick, breaking apart the mortar one side at a time.",
    "Be careful not to strike the brick and damage it.",
    "Cut into stubborn mortar with an angle grinder.",
    "Pick up a 4 in (10 cm) angle grinder at the home improvement store.",
    "Start with the vertical joints.",
    "Position the grinding disc to cut ⁄2 in (1.3 cm) into the mortar.",
    "Repeat this with the horizontal joints to free the brick.",
    "Make sure that you choose a masonry-specific grinding disc.",
    "Be very careful when using the angle grinder.",
    "It's easy to slip and cut into the brick.",
    "Before using the grinder on bricks you plan to use, it's best to practice on an old brick or a cheap practice brick.",
    "Brush away the debris with a whisk broom.",
    "Clear out the wall space with a mortar whisk broom or another stiff-bristle brush.",
    "If you have an air compressor, it'll also help clear out any remaining dust.",
    "Remember to wear your protective eye wear and face mask, especially if you use an air compressor.",
    "You should also watch where the debris goes so that you don't hurt yourself or others.",
    "Chisel the old mortar off the brick.",
    "Set the brick down on a flat surface.",
    "Hold the chisel at an angle above it.",
    "Hammer the chisel quickly and lightly while moving the tip over the mortar.",
    "If the brick needs to be replaced, bring the old brick to the store.",
    "Try to match the size and color.",
    "Brush and rinse off the brick.",
    "Clear off the debris with a wire brush or air compressor.",
    "Finish cleaning the brick by spraying it with water.",
    "Keep the brick and wall hole damp with a hose or misting bottle so the mortar sticks and cures better.",
    "Mixing Mortar Put on safety glasses and gloves.",
    "The chemicals in the mortar can burn your skin.",
    "In addition to continuing to wear eye protection, slip on a pair of waterproof gloves.",
    "Long-sleeved clothing is also recommended to ensure dripping mortar can't reach you.",
    "Place dry mortar mix in a bucket.",
    "The kind of product you want is labeled as mortar mix.",
    "Avoid sand or concrete mixes.",
    "Add the amount of mortar you need into a mixing container, such as a wheelbarrow or dishpan.",
    "Match the type of mortar you get to the type that's in the rest of your wall, if possible.",
    "Mortar mixes come in different grades.",
    "M is the strongest and meant for walls bearing heavy loads.",
    "S is a little more flexible, N is for most walls exposed to the weather, and O is for interior and non-load-bearing exterior walls.",
    "If you don't know what's in your wall, you might need to guess based on the grading scale.",
    "Mix the mortar with water until it's thick.",
    "Follow the manufacturer's instructions to figure out how much water to add.",
    "Stir the water and mortar mix together with a hand trowel.",
    "Try to get the mortar into a consistency similar to peanut butter.",
    "You may also purchase latex additive from a home improvement store and add a little bit to make the mixture stronger.",
    "Start with small batches.",
    "You'll have an hour or less to use the mortar before it dries.",
    "Adding and Protecting New Mortar Spread a layer of mortar inside the hole.",
    "Dip your trowel into the mortar to scoop up a small coating.",
    "Spread about ⁄2 in (13 mm) of mortar over the left and right sides of the cavity.",
    "Finish by coating the bottom of the hole with an equal amount of mortar.",
    "If the mortar begins drying out while you're mixing and applying more mortar, lightly moisten it with a hose or misting bottle.",
    "Cover the top of the brick in mortar.",
    "Add another ½ inch layer of mortar to the brick's top.",
    "Even and smooth out the mortar before putting the brick in place.",
    "Slide the brick into the hole.",
    "Pick up the brick and push it into the hole.",
    "Mortar will ooze out, so make sure you're still wearing sturdy gloves.",
    "Fill the joints with mortar.",
    "Use the trowel or a tuckpointing tool to catch the oozing mortar and push it back into the spaces around the brick.",
    "Load more mortar onto one of these tools and push it into these joint spaces until they're full.",
    "Smooth out the mortar to match the rest of the wall.",
    "After you've finished filling the joints, stroke a flat blade over the mortar to even it out.",
    "In addition to the trowel or tuckpointing tool, you may use a brick jointer.",
    "Blend in your work by making it match the joints around other bricks as much as possible.",
    "Let the joint mortar set up until it just gives when you press your finger into it, and then use the brick jointer tool to create the dimpled beveled joint lines.",
    "If the mortar is too wet when you create the beveled joint lines, then it may just scrape out of the joints.",
    "Wipe away excess mortar with a soft-bristle brush.",
    "Use the brush to remove any mortar that has spilled over the bricks.",
    "Dampen the mortar first if it has begun to solidify.",
    "It's important to do this immediately or else you'll need muriatic acid or a commercial cleaner to remove the mortar.",
    "Take special care when using muriatic acid.",
    "Spray the mortar daily for 3 days.",
    "Fill a spray bottle with water and immediately use it to lightly mist the new mortar today.",
    "This allows the mortar to cure properly.",
    "Do this once a day until the mortar is strong.",
    "Cover the mortar when you're not misting it.",
    "Purchase a tarp and tape it over the new mortar right after you've misted it the first time.",
    "The tarp keeps the mortar safe from the sun and rain.",
    "You will need to pull down the tarp to mist the mortar, but after 72 hours it should be safe to remove permanently."
  ],
  "tyn_section":[
    "Safety glasses",
    "Waterproof gloves",
    "Bucket",
    "Chisel",
    "Hammer",
    "Trowel",
    "Angle grinder",
    "Masonry grinding disc",
    "Grounded electrical cord",
    "Tuckpointing tool",
    "Whisk broom",
    "Soft-bristle brush",
    "Mortar mix",
    "Water"
  ],
  "tyn_model":[
    "mortar",
    "chisel",
    "water",
    "angle grinder",
    "air compressor",
    "trowel",
    "tarp",
    "grinder",
    "brick jointer",
    "muriatic acid",
    "dust mask",
    "hammer and chisel",
    "spatula",
    "home improvement store",
    "whisk broom",
    "mortar whisk broom",
    "stiff-bristle brush",
    "wire brush",
    "waterproof gloves",
    "bucket",
    "mortar mix",
    "hand trowel",
    "hose",
    "misting bottle",
    "soft-bristle brush",
    "spray bottle"
  ],
  "simple_metrics":{
    "r":0.6428571429,
    "p":0.3461538462,
    "f1":0.45,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.6428571429,
    "p":0.5,
    "f1":0.5625
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.6153846154,
    "f1":0.6611570248
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6428571429,
    "p":0.3846153846,
    "f1":0.4812834225
  }
}