{
  "title":"How to Roast Ham",
  "url":"https://www.wikihow.com/Roast-Ham",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork"
  ],
  "methods":[
    {
      "name":"Roasting a City Ham",
      "steps":[
        {
          "headline":"Preheat the oven to 275 °F (135 °C).",
          "description":"275 °F (135 °C) is an average temperature for long, slow roasting. You may adjust the temperature, but don't go below 200 °F (93 °C). Use higher temperatures to cut down on cooking time. City ham is what's commonly sold in supermarkets. They're often pre-cooked, so they won't need to spend as much time in the oven as uncooked hams. Spiral-sliced ham is basically a pre-cut type of city ham. It's also pre-cooked. The labeling on the packaging will tell you what kind of ham you have so you know how to heat it. Uncooked city hams exist, but are harder to find. They'll need to cook a bit longer than pre-cooked ham."
        },
        {
          "headline":"Place the ham in a roasting pan.",
          "description":"Try to keep the side thicker with white-colored fat facing upwards. You may need to cut off a little bit of fat off the bottom to get the ham to lay flat. Leave most of it until later. When roasting half a ham, place the cut side on the pan. Baking sheets, broiler pans, and casserole dishes may also be used. Keep in mind that pans with elevated sides are better than flatter pans."
        },
        {
          "headline":"Cut a diamond pattern into the fat with a chef's knife.",
          "description":"Hold the ham flat and, using your chef's knife, begin scoring lines into the fat. Cut lines across the ham, then cut more down the ham's length. The pattern looks similar to a checkerboard. If there's a lot of fat, you can slice off some of it. Leave a thin layer about ⁄4 in (6.4 mm) thick. Avoid cutting into the meat."
        },
        {
          "headline":"Pour 1 cup of water into the roasting pan.",
          "description":"Fill the bottom of the pan with 1 cup (240 mL) of water. If your pan doesn't have high sides, you'll need to check the pan as it cooks and replace the water as needed. The steam provides extra heat and protects the pan from burns. If you choose to cook the ham uncovered in the next step, you'll only need ⁄4 in (6.4 mm) of water."
        },
        {
          "headline":"Cover the ham with foil to prevent the ham from drying out.",
          "description":"Place a sheet of foil all the way over the pan. Wrap it tight around the pan's edges so it forms a tent over the ham. Using foil is optional, but it'll lead to a juicier, tastier ham. Alternatively, wrap the ham directly in foil or place it in a cooking bag. Include the water inside the foil or bag. You may also leave the ham uncovered and cook with less water."
        },
        {
          "headline":"Cook the ham for about 2 hours.",
          "description":"2 hours is an average amount of time to wait before checking the ham's temperature. The specific amount of time will depend on the size of your ham. Estimate it'll take about 20 minutes per 1 lb (0.45 kg) of meat for an uncooked or partially-cooked ham and 15 minutes or less per pound for a fully-cooked ham. Bone-in hams have a little less meat than boneless hams, so adjust the timing as needed. If you're planning on glazing the ham, it's a good idea to make the glaze while the ham's cooking."
        },
        {
          "headline":"Check the ham's temperature with a meat thermometer.",
          "description":"Pull out the ham after 2 hours and unwrap the foil. Push the end of the thermometer into the thickest part of the ham. The temperature should read about 120 °F (49 °C). If it isn't, rewrap the foil and continue cooking."
        },
        {
          "headline":"Spread the glaze over the ham if you're using one.",
          "description":"Remove the ham when it reaches the proper temperature. When using a liquid glaze, use a pastry brush to coat the outside of the ham. For dry glazes, carefully pat the glaze on by hand. The score marks you made will hold the glaze in place. Generally, the glaze should be added within the last 30 minutes of cooking time. You can also pull the ham out halfway through the cooking time to reapply the glaze."
        },
        {
          "headline":"Cook the ham uncovered for another 20 minutes.",
          "description":"Put the ham back into the oven. After 20 minutes, the glaze will have finished cooking. Pull out the ham and test it again with the thermometer. Look for an internal temperature of 135 °F (57 °C) and continue roasting as needed to reach this temperature. If you used a cooking bag, you should skip this and let the ham rest for 15 minutes. If you need to glaze it and continue cooking, you can use a roasting pan."
        },
        {
          "headline":"Let the ham rest for 15 minutes before cutting.",
          "description":"During these 15 minutes, the inside of the ham continues to cook. It also causes the ham to hold onto juices, preventing it from drying out. After the 15 minutes are up, slice the ham and serve it."
        }
      ]
    },
    {
      "name":"Roasting a Country Ham",
      "steps":[
        {
          "headline":"Soak the ham in cold water if it is uncooked.",
          "description":"Get a large pot and place the ham inside it. Add enough cold water to completely submerge the ham. Change the water out every 6 to 8 hours as salt crystals cloud the water. Soaking removes some of the salt prevalent in country hams. You can safely soak the ham for up to 72 hours. Country hams are typically uncooked and will need to be in the oven longer than cooked hams."
        },
        {
          "headline":"Scrub the mold off the ham if it is uncooked.",
          "description":"Move the ham to a stream of warm water. Using a stiff-bristled brush, rub away any dark spots you see. These spots are mold and dirt, so you'll want to take care of them before cooking. Don't worry, the mold isn't harmful. It comes from the curing and aging process, similar to some cheeses."
        },
        {
          "headline":"Preheat the oven to 325 °F (163 °C).",
          "description":"325 °F (163 °C) is an average temperature for roasting country ham. You can raise it a little to shorten the cooking time on your ham. Avoid going over 375 °F (191 °C) so the ham doesn't dry out."
        },
        {
          "headline":"Place the ham on a roasting pan.",
          "description":"Keep the fat side facing upwards. A roasting pan is the best choice, since it'll be deep enough to hold the ham and the amount of water you'll add to it. You'll usually need a pan with sides about 3 in (7.6 cm) tall."
        },
        {
          "headline":"Score the ham with a chef's knife.",
          "description":"First, cut away most of the outside fat. Leave a layer ⁄4 in (6.4 mm) thick. Then use the end of a chef's knife to score the ham in a diamond pattern. Be careful to avoid cutting into the meat."
        },
        {
          "headline":"Add 5 cups of water to the pan.",
          "description":"Pour in 5 cups (1183 mL) of water to protect the pan and keep the ham from drying out. If you're using a shallow pan, be sure to check it from time to time to replace the water. If you wish to cook the ham uncovered, only add 2 cups (473 mL) of water."
        },
        {
          "headline":"Cover the ham with foil to prevent it from drying out.",
          "description":"Wrap the foil tightly around the pan and over the ham. It's not necessary to cook it this way, but the the foil does hold in a lot of heat and moisture,"
        },
        {
          "headline":"Cook the ham for 4 hours.",
          "description":"When the time is up, pull the ham out and remove the foil. Stick a meat thermometer in the thickest part of the ham. The temperature should read somewhere between 155 to 160 °F (68 to 71 °C). If it isn't at 155 ℉, cook the ham a little longer. If you're concerned about the cooking time, estimate that the ham will need about 20 minutes per 1 lb (0.45 kg). It doesn't hurt to check the ham every hour or so. Depending on the size of the ham and your oven, yours might finish cooking in less time."
        },
        {
          "headline":"Spread a glaze over the ham (if desired).",
          "description":"Pour the glaze over the fat side of the ham, using a pastry brush to spread it. Dry glazes can be patted on by hand instead. Always apply the glaze during the last 30 minutes of the ham's cooking time. You may pull the ham out halfway through that time and reapply the glaze."
        },
        {
          "headline":"Roast the ham uncovered for an additional 30 minutes.",
          "description":"After the 30 minutes are up, pull the ham back out of the oven and test it with the thermometer. At a minimum, it needs to be 155 °F (68 °C). If it was that temperature earlier, it'll be around 170 °F (77 °C) now. Both show that the ham was cooked safely. Ham under 155 ℉ won't be cooked all the way through and could be unsafe."
        },
        {
          "headline":"Let the ham rest 20 minutes before carving.",
          "description":"Set the ham aside. This will allow the juices to seal inside while the inner portion of the ham cooks a little further. Afterwards, the ham is ready to be carved and served."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Roasting a City Ham Preheat the oven to 275 °F (135 °C). 275 °F (135 °C) is an average temperature for long, slow roasting. You may adjust the temperature, but don't go below 200 °F (93 °C). Use higher temperatures to cut down on cooking time. City ham is what's commonly sold in supermarkets. They're often pre-cooked, so they won't need to spend as much time in the oven as uncooked hams. Spiral-sliced ham is basically a pre-cut type of city ham. It's also pre-cooked. The labeling on the packaging will tell you what kind of ham you have so you know how to heat it. Uncooked city hams exist, but are harder to find. They'll need to cook a bit longer than pre-cooked ham. Place the ham in a roasting pan. Try to keep the side thicker with white-colored fat facing upwards. You may need to cut off a little bit of fat off the bottom to get the ham to lay flat. Leave most of it until later. When roasting half a ham, place the cut side on the pan. Baking sheets, broiler pans, and casserole dishes may also be used. Keep in mind that pans with elevated sides are better than flatter pans. Cut a diamond pattern into the fat with a chef's knife. Hold the ham flat and, using your chef's knife, begin scoring lines into the fat. Cut lines across the ham, then cut more down the ham's length. The pattern looks similar to a checkerboard. If there's a lot of fat, you can slice off some of it. Leave a thin layer about ⁄4 in (6.4 mm) thick. Avoid cutting into the meat. Pour 1 cup of water into the roasting pan. Fill the bottom of the pan with 1 cup (240 mL) of water. If your pan doesn't have high sides, you'll need to check the pan as it cooks and replace the water as needed. The steam provides extra heat and protects the pan from burns. If you choose to cook the ham uncovered in the next step, you'll only need ⁄4 in (6.4 mm) of water. Cover the ham with foil to prevent the ham from drying out. Place a sheet of foil all the way over the pan. Wrap it tight around the pan's edges so it forms a tent over the ham. Using foil is optional, but it'll lead to a juicier, tastier ham. Alternatively, wrap the ham directly in foil or place it in a cooking bag. Include the water inside the foil or bag. You may also leave the ham uncovered and cook with less water. Cook the ham for about 2 hours. 2 hours is an average amount of time to wait before checking the ham's temperature. The specific amount of time will depend on the size of your ham. Estimate it'll take about 20 minutes per 1 lb (0.45 kg) of meat for an uncooked or partially-cooked ham and 15 minutes or less per pound for a fully-cooked ham. Bone-in hams have a little less meat than boneless hams, so adjust the timing as needed. If you're planning on glazing the ham, it's a good idea to make the glaze while the ham's cooking. Check the ham's temperature with a meat thermometer. Pull out the ham after 2 hours and unwrap the foil. Push the end of the thermometer into the thickest part of the ham. The temperature should read about 120 °F (49 °C). If it isn't, rewrap the foil and continue cooking. Spread the glaze over the ham if you're using one. Remove the ham when it reaches the proper temperature. When using a liquid glaze, use a pastry brush to coat the outside of the ham. For dry glazes, carefully pat the glaze on by hand. The score marks you made will hold the glaze in place. Generally, the glaze should be added within the last 30 minutes of cooking time. You can also pull the ham out halfway through the cooking time to reapply the glaze. Cook the ham uncovered for another 20 minutes. Put the ham back into the oven. After 20 minutes, the glaze will have finished cooking. Pull out the ham and test it again with the thermometer. Look for an internal temperature of 135 °F (57 °C) and continue roasting as needed to reach this temperature. If you used a cooking bag, you should skip this and let the ham rest for 15 minutes. If you need to glaze it and continue cooking, you can use a roasting pan. Let the ham rest for 15 minutes before cutting. During these 15 minutes, the inside of the ham continues to cook. It also causes the ham to hold onto juices, preventing it from drying out. After the 15 minutes are up, slice the ham and serve it. Roasting a Country Ham Soak the ham in cold water if it is uncooked. Get a large pot and place the ham inside it. Add enough cold water to completely submerge the ham. Change the water out every 6 to 8 hours as salt crystals cloud the water. Soaking removes some of the salt prevalent in country hams. You can safely soak the ham for up to 72 hours. Country hams are typically uncooked and will need to be in the oven longer than cooked hams. Scrub the mold off the ham if it is uncooked. Move the ham to a stream of warm water. Using a stiff-bristled brush, rub away any dark spots you see. These spots are mold and dirt, so you'll want to take care of them before cooking. Don't worry, the mold isn't harmful. It comes from the curing and aging process, similar to some cheeses. Preheat the oven to 325 °F (163 °C). 325 °F (163 °C) is an average temperature for roasting country ham. You can raise it a little to shorten the cooking time on your ham. Avoid going over 375 °F (191 °C) so the ham doesn't dry out. Place the ham on a roasting pan. Keep the fat side facing upwards. A roasting pan is the best choice, since it'll be deep enough to hold the ham and the amount of water you'll add to it. You'll usually need a pan with sides about 3 in (7.6 cm) tall. Score the ham with a chef's knife. First, cut away most of the outside fat. Leave a layer ⁄4 in (6.4 mm) thick. Then use the end of a chef's knife to score the ham in a diamond pattern. Be careful to avoid cutting into the meat. Add 5 cups of water to the pan. Pour in 5 cups (1183 mL) of water to protect the pan and keep the ham from drying out. If you're using a shallow pan, be sure to check it from time to time to replace the water. If you wish to cook the ham uncovered, only add 2 cups (473 mL) of water. Cover the ham with foil to prevent it from drying out. Wrap the foil tightly around the pan and over the ham. It's not necessary to cook it this way, but the the foil does hold in a lot of heat and moisture, Cook the ham for 4 hours. When the time is up, pull the ham out and remove the foil. Stick a meat thermometer in the thickest part of the ham. The temperature should read somewhere between 155 to 160 °F (68 to 71 °C). If it isn't at 155 ℉, cook the ham a little longer. If you're concerned about the cooking time, estimate that the ham will need about 20 minutes per 1 lb (0.45 kg). It doesn't hurt to check the ham every hour or so. Depending on the size of the ham and your oven, yours might finish cooking in less time. Spread a glaze over the ham (if desired). Pour the glaze over the fat side of the ham, using a pastry brush to spread it. Dry glazes can be patted on by hand instead. Always apply the glaze during the last 30 minutes of the ham's cooking time. You may pull the ham out halfway through that time and reapply the glaze. Roast the ham uncovered for an additional 30 minutes. After the 30 minutes are up, pull the ham back out of the oven and test it with the thermometer. At a minimum, it needs to be 155 °F (68 °C). If it was that temperature earlier, it'll be around 170 °F (77 °C) now. Both show that the ham was cooked safely. Ham under 155 ℉ won't be cooked all the way through and could be unsafe. Let the ham rest 20 minutes before carving. Set the ham aside. This will allow the juices to seal inside while the inner portion of the ham cooks a little further. Afterwards, the ham is ready to be carved and served. Finished. ",
  "sentences":[
    " Roasting a City Ham Preheat the oven to 275 °F (135 °C).",
    "275 °F (135 °C) is an average temperature for long, slow roasting.",
    "You may adjust the temperature, but don't go below 200 °F (93 °C).",
    "Use higher temperatures to cut down on cooking time.",
    "City ham is what's commonly sold in supermarkets.",
    "They're often pre-cooked, so they won't need to spend as much time in the oven as uncooked hams.",
    "Spiral-sliced ham is basically a pre-cut type of city ham.",
    "It's also pre-cooked.",
    "The labeling on the packaging will tell you what kind of ham you have so you know how to heat it.",
    "Uncooked city hams exist, but are harder to find.",
    "They'll need to cook a bit longer than pre-cooked ham.",
    "Place the ham in a roasting pan.",
    "Try to keep the side thicker with white-colored fat facing upwards.",
    "You may need to cut off a little bit of fat off the bottom to get the ham to lay flat.",
    "Leave most of it until later.",
    "When roasting half a ham, place the cut side on the pan.",
    "Baking sheets, broiler pans, and casserole dishes may also be used.",
    "Keep in mind that pans with elevated sides are better than flatter pans.",
    "Cut a diamond pattern into the fat with a chef's knife.",
    "Hold the ham flat and, using your chef's knife, begin scoring lines into the fat.",
    "Cut lines across the ham, then cut more down the ham's length.",
    "The pattern looks similar to a checkerboard.",
    "If there's a lot of fat, you can slice off some of it.",
    "Leave a thin layer about ⁄4 in (6.4 mm) thick.",
    "Avoid cutting into the meat.",
    "Pour 1 cup of water into the roasting pan.",
    "Fill the bottom of the pan with 1 cup (240 mL) of water.",
    "If your pan doesn't have high sides, you'll need to check the pan as it cooks and replace the water as needed.",
    "The steam provides extra heat and protects the pan from burns.",
    "If you choose to cook the ham uncovered in the next step, you'll only need ⁄4 in (6.4 mm) of water.",
    "Cover the ham with foil to prevent the ham from drying out.",
    "Place a sheet of foil all the way over the pan.",
    "Wrap it tight around the pan's edges so it forms a tent over the ham.",
    "Using foil is optional, but it'll lead to a juicier, tastier ham.",
    "Alternatively, wrap the ham directly in foil or place it in a cooking bag.",
    "Include the water inside the foil or bag.",
    "You may also leave the ham uncovered and cook with less water.",
    "Cook the ham for about 2 hours.",
    "2 hours is an average amount of time to wait before checking the ham's temperature.",
    "The specific amount of time will depend on the size of your ham.",
    "Estimate it'll take about 20 minutes per 1 lb (0.45 kg) of meat for an uncooked or partially-cooked ham and 15 minutes or less per pound for a fully-cooked ham.",
    "Bone-in hams have a little less meat than boneless hams, so adjust the timing as needed.",
    "If you're planning on glazing the ham, it's a good idea to make the glaze while the ham's cooking.",
    "Check the ham's temperature with a meat thermometer.",
    "Pull out the ham after 2 hours and unwrap the foil.",
    "Push the end of the thermometer into the thickest part of the ham.",
    "The temperature should read about 120 °F (49 °C).",
    "If it isn't, rewrap the foil and continue cooking.",
    "Spread the glaze over the ham if you're using one.",
    "Remove the ham when it reaches the proper temperature.",
    "When using a liquid glaze, use a pastry brush to coat the outside of the ham.",
    "For dry glazes, carefully pat the glaze on by hand.",
    "The score marks you made will hold the glaze in place.",
    "Generally, the glaze should be added within the last 30 minutes of cooking time.",
    "You can also pull the ham out halfway through the cooking time to reapply the glaze.",
    "Cook the ham uncovered for another 20 minutes.",
    "Put the ham back into the oven.",
    "After 20 minutes, the glaze will have finished cooking.",
    "Pull out the ham and test it again with the thermometer.",
    "Look for an internal temperature of 135 °F (57 °C) and continue roasting as needed to reach this temperature.",
    "If you used a cooking bag, you should skip this and let the ham rest for 15 minutes.",
    "If you need to glaze it and continue cooking, you can use a roasting pan.",
    "Let the ham rest for 15 minutes before cutting.",
    "During these 15 minutes, the inside of the ham continues to cook.",
    "It also causes the ham to hold onto juices, preventing it from drying out.",
    "After the 15 minutes are up, slice the ham and serve it.",
    "Roasting a Country Ham Soak the ham in cold water if it is uncooked.",
    "Get a large pot and place the ham inside it.",
    "Add enough cold water to completely submerge the ham.",
    "Change the water out every 6 to 8 hours as salt crystals cloud the water.",
    "Soaking removes some of the salt prevalent in country hams.",
    "You can safely soak the ham for up to 72 hours.",
    "Country hams are typically uncooked and will need to be in the oven longer than cooked hams.",
    "Scrub the mold off the ham if it is uncooked.",
    "Move the ham to a stream of warm water.",
    "Using a stiff-bristled brush, rub away any dark spots you see.",
    "These spots are mold and dirt, so you'll want to take care of them before cooking.",
    "Don't worry, the mold isn't harmful.",
    "It comes from the curing and aging process, similar to some cheeses.",
    "Preheat the oven to 325 °F (163 °C).",
    "325 °F (163 °C) is an average temperature for roasting country ham.",
    "You can raise it a little to shorten the cooking time on your ham.",
    "Avoid going over 375 °F (191 °C) so the ham doesn't dry out.",
    "Place the ham on a roasting pan.",
    "Keep the fat side facing upwards.",
    "A roasting pan is the best choice, since it'll be deep enough to hold the ham and the amount of water you'll add to it.",
    "You'll usually need a pan with sides about 3 in (7.6 cm) tall.",
    "Score the ham with a chef's knife.",
    "First, cut away most of the outside fat.",
    "Leave a layer ⁄4 in (6.4 mm) thick.",
    "Then use the end of a chef's knife to score the ham in a diamond pattern.",
    "Be careful to avoid cutting into the meat.",
    "Add 5 cups of water to the pan.",
    "Pour in 5 cups (1183 mL) of water to protect the pan and keep the ham from drying out.",
    "If you're using a shallow pan, be sure to check it from time to time to replace the water.",
    "If you wish to cook the ham uncovered, only add 2 cups (473 mL) of water.",
    "Cover the ham with foil to prevent it from drying out.",
    "Wrap the foil tightly around the pan and over the ham.",
    "It's not necessary to cook it this way, but the the foil does hold in a lot of heat and moisture, Cook the ham for 4 hours.",
    "When the time is up, pull the ham out and remove the foil.",
    "Stick a meat thermometer in the thickest part of the ham.",
    "The temperature should read somewhere between 155 to 160 °F (68 to 71 °C).",
    "If it isn't at 155 ℉, cook the ham a little longer.",
    "If you're concerned about the cooking time, estimate that the ham will need about 20 minutes per 1 lb (0.45 kg).",
    "It doesn't hurt to check the ham every hour or so.",
    "Depending on the size of the ham and your oven, yours might finish cooking in less time.",
    "Spread a glaze over the ham (if desired).",
    "Pour the glaze over the fat side of the ham, using a pastry brush to spread it.",
    "Dry glazes can be patted on by hand instead.",
    "Always apply the glaze during the last 30 minutes of the ham's cooking time.",
    "You may pull the ham out halfway through that time and reapply the glaze.",
    "Roast the ham uncovered for an additional 30 minutes.",
    "After the 30 minutes are up, pull the ham back out of the oven and test it with the thermometer.",
    "At a minimum, it needs to be 155 °F (68 °C).",
    "If it was that temperature earlier, it'll be around 170 °F (77 °C) now.",
    "Both show that the ham was cooked safely.",
    "Ham under 155 ℉ won't be cooked all the way through and could be unsafe.",
    "Let the ham rest 20 minutes before carving.",
    "Set the ham aside.",
    "This will allow the juices to seal inside while the inner portion of the ham cooks a little further.",
    "Afterwards, the ham is ready to be carved and served.",
    "Finished."
  ],
  "tyn_section":[
    "Roasting City Ham",
    "Oven",
    "Roasting pan",
    "Tin foil",
    "Chef's knife",
    "Pastry brush",
    "Roasting Country Ham",
    "Large pot",
    "Water",
    "Stiff-bristled brush"
  ],
  "tyn_model":[
    "ham",
    "water",
    "foil",
    "oven",
    "roasting pan",
    "chef's knife",
    "pans",
    "meat thermometer",
    "thermometer",
    "pastry brush",
    "city ham",
    "hams",
    "baking sheets",
    "broiler pans",
    "casserole dishes",
    "large pot",
    "cold water",
    "salt",
    "pan",
    "℉,",
    "℉ wo"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.2857142857,
    "f1":0.3870967742,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.4761904762,
    "f1":0.5970149254
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.5238095238,
    "f1":0.6875
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7,
    "p":0.3333333333,
    "f1":0.4516129032
  }
}