{
  "title":"How to Remove Duct Tape Residue",
  "url":"https://www.wikihow.com/Remove-Duct-Tape-Residue",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal",
    "Adhesive Stains"
  ],
  "methods":[
    {
      "name":"Cleaning with Rubbing Alcohol",
      "steps":[
        {
          "headline":"Scrape the residue off with a dull blade.",
          "description":"A butter knife is ideal, but you may also use a putty knife or a razor with an attached guard. Hold the blade flat against the surface and slowly slide the knife over it to scrape off the residue. Be gentle to avoid scratching the surface. If you’re worried about scratches, skip scraping."
        },
        {
          "headline":"Soak a soft cloth in rubbing alcohol and rub at the area.",
          "description":"Dampen the cloth with isopropyl rubbing alcohol from the medical section at any drug or general store. Make sure the cloth is clean and soft to avoid damaging the surface you’re treating. Then, gently rub the cloth back and forth over the area until the adhesive comes off. The combination of the rubbing alcohol and friction from rubbing will remove most of it. Acetone or nail polish remover may be used instead, but are more likely to damage painted surfaces."
        },
        {
          "headline":"Scrub the area with a mixture of dish soap and warm water.",
          "description":"Place about a tablespoon of liquid dish detergent in two cups of water and stir until the mixture is bubbly. Then, dip a soft cloth into the soapy water and use it to gently scrub the residue. Keep rubbing the area until it no longer feels slippery or sticky to the touch. Any gentle or medium-strength soap can be used. Avoid ones that are designed for grease and other tough stains."
        },
        {
          "headline":"Dry the surface with a cloth.",
          "description":"Rub the surface with a clean cloth or paper towel to absorb the water. The surface should no longer feel rough or sticky from the residue."
        }
      ]
    },
    {
      "name":"Treating Residue with Cooking Oil",
      "steps":[
        {
          "headline":"Soak a paper towel in cooking oil and lay it over the residue.",
          "description":"Dab a paper towel into any type of cooking oil you have on hand. Lay the paper towel over the residue, then lift it after a few minutes. You can then rub or scrape the residue to get most of it off. Other oily products are also effective, such as baby oil, peanut butter, or mayonnaise. Be careful around absorbent material such as carpeting and clothing. The oil may cause stains. If you’re concerned, try a baking soda paste instead."
        },
        {
          "headline":"Mix together some coconut oil and baking soda.",
          "description":"In a small bowl, combine an equal amount of the oil and baking soda. Mix them together to form a paste. If you don’t have coconut oil, try mixing the baking soda or vinegar into warm water."
        },
        {
          "headline":"Apply the paste and let it rest for 30 minutes.",
          "description":"Dip something soft, such as a cloth or old toothbrush, into the paste. Transfer it over to the surface you’re treating and spread it across the residue. Come back within 30 minutes to an hour to finish cleaning."
        },
        {
          "headline":"Wash off the paste with warm water.",
          "description":"Get a clean cloth and dampen it in warm water. The remaining residue will likely come off as you rub it with the damp cloth."
        },
        {
          "headline":"Dry the surface with a cloth.",
          "description":"Use a soft cloth or paper towel to dry the water and check for any remaining residue. You may also use a knife or paint scraper to loosen any remaining residue."
        }
      ]
    },
    {
      "name":"Removing Stubborn Residue",
      "steps":[
        {
          "headline":"Heat the residue with a hairdryer for a quick removal.",
          "description":"Aim the hairdryer at the residue to soften it. After a minute, it should be heated enough to remove. Scrape it off carefully with a knife or other implement. If it doesn’t come off all the way, switch to a different treatment."
        },
        {
          "headline":"Spray WD-40 to treat metal surfaces.",
          "description":"WD-40 is available at most general and home improvement stores. You can spray it directly onto areas with a lot of residue or dampen a terry cloth to treat smaller patches of residue. Leave it on for a minute, then scrub it off with soap and water. WD-40 is perfect for surfaces such as cars. Read the warnings on the canister to avoid using it on surfaces that it’ll stain. Vaseline or car wax works as an alternative to WD-40."
        },
        {
          "headline":"Apply a commercial residue remover for a stronger treatment.",
          "description":"These products are also available at general stores. There are brands out there designed to remove the residue from commercial tape. Follow the directions on the label and the product will also work well for you at home."
        },
        {
          "headline":"Use water pressure or sandblasting to clean rock and concrete.",
          "description":"This can only be done on strong construction materials such as rock, brick, and concrete. Aim a high-pressure water system or sandblaster at the material. Briefly turn it on and off until the residue is gone. Be very careful when doing this. These machines can leave marks on most surfaces."
        }
      ]
    }
  ],
  "text":" Cleaning with Rubbing Alcohol Scrape the residue off with a dull blade. A butter knife is ideal, but you may also use a putty knife or a razor with an attached guard. Hold the blade flat against the surface and slowly slide the knife over it to scrape off the residue. Be gentle to avoid scratching the surface. If you’re worried about scratches, skip scraping. Soak a soft cloth in rubbing alcohol and rub at the area. Dampen the cloth with isopropyl rubbing alcohol from the medical section at any drug or general store. Make sure the cloth is clean and soft to avoid damaging the surface you’re treating. Then, gently rub the cloth back and forth over the area until the adhesive comes off. The combination of the rubbing alcohol and friction from rubbing will remove most of it. Acetone or nail polish remover may be used instead, but are more likely to damage painted surfaces. Scrub the area with a mixture of dish soap and warm water. Place about a tablespoon of liquid dish detergent in two cups of water and stir until the mixture is bubbly. Then, dip a soft cloth into the soapy water and use it to gently scrub the residue. Keep rubbing the area until it no longer feels slippery or sticky to the touch. Any gentle or medium-strength soap can be used. Avoid ones that are designed for grease and other tough stains. Dry the surface with a cloth. Rub the surface with a clean cloth or paper towel to absorb the water. The surface should no longer feel rough or sticky from the residue. Treating Residue with Cooking Oil Soak a paper towel in cooking oil and lay it over the residue. Dab a paper towel into any type of cooking oil you have on hand. Lay the paper towel over the residue, then lift it after a few minutes. You can then rub or scrape the residue to get most of it off. Other oily products are also effective, such as baby oil, peanut butter, or mayonnaise. Be careful around absorbent material such as carpeting and clothing. The oil may cause stains. If you’re concerned, try a baking soda paste instead. Mix together some coconut oil and baking soda. In a small bowl, combine an equal amount of the oil and baking soda. Mix them together to form a paste. If you don’t have coconut oil, try mixing the baking soda or vinegar into warm water. Apply the paste and let it rest for 30 minutes. Dip something soft, such as a cloth or old toothbrush, into the paste. Transfer it over to the surface you’re treating and spread it across the residue. Come back within 30 minutes to an hour to finish cleaning. Wash off the paste with warm water. Get a clean cloth and dampen it in warm water. The remaining residue will likely come off as you rub it with the damp cloth. Dry the surface with a cloth. Use a soft cloth or paper towel to dry the water and check for any remaining residue. You may also use a knife or paint scraper to loosen any remaining residue. Removing Stubborn Residue Heat the residue with a hairdryer for a quick removal. Aim the hairdryer at the residue to soften it. After a minute, it should be heated enough to remove. Scrape it off carefully with a knife or other implement. If it doesn’t come off all the way, switch to a different treatment. Spray WD-40 to treat metal surfaces. WD-40 is available at most general and home improvement stores. You can spray it directly onto areas with a lot of residue or dampen a terry cloth to treat smaller patches of residue. Leave it on for a minute, then scrub it off with soap and water. WD-40 is perfect for surfaces such as cars. Read the warnings on the canister to avoid using it on surfaces that it’ll stain. Vaseline or car wax works as an alternative to WD-40. Apply a commercial residue remover for a stronger treatment. These products are also available at general stores. There are brands out there designed to remove the residue from commercial tape. Follow the directions on the label and the product will also work well for you at home. Use water pressure or sandblasting to clean rock and concrete. This can only be done on strong construction materials such as rock, brick, and concrete. Aim a high-pressure water system or sandblaster at the material. Briefly turn it on and off until the residue is gone. Be very careful when doing this. These machines can leave marks on most surfaces.",
  "sentences":[
    " Cleaning with Rubbing Alcohol Scrape the residue off with a dull blade.",
    "A butter knife is ideal, but you may also use a putty knife or a razor with an attached guard.",
    "Hold the blade flat against the surface and slowly slide the knife over it to scrape off the residue.",
    "Be gentle to avoid scratching the surface.",
    "If you’re worried about scratches, skip scraping.",
    "Soak a soft cloth in rubbing alcohol and rub at the area.",
    "Dampen the cloth with isopropyl rubbing alcohol from the medical section at any drug or general store.",
    "Make sure the cloth is clean and soft to avoid damaging the surface you’re treating.",
    "Then, gently rub the cloth back and forth over the area until the adhesive comes off.",
    "The combination of the rubbing alcohol and friction from rubbing will remove most of it.",
    "Acetone or nail polish remover may be used instead, but are more likely to damage painted surfaces.",
    "Scrub the area with a mixture of dish soap and warm water.",
    "Place about a tablespoon of liquid dish detergent in two cups of water and stir until the mixture is bubbly.",
    "Then, dip a soft cloth into the soapy water and use it to gently scrub the residue.",
    "Keep rubbing the area until it no longer feels slippery or sticky to the touch.",
    "Any gentle or medium-strength soap can be used.",
    "Avoid ones that are designed for grease and other tough stains.",
    "Dry the surface with a cloth.",
    "Rub the surface with a clean cloth or paper towel to absorb the water.",
    "The surface should no longer feel rough or sticky from the residue.",
    "Treating Residue with Cooking Oil Soak a paper towel in cooking oil and lay it over the residue.",
    "Dab a paper towel into any type of cooking oil you have on hand.",
    "Lay the paper towel over the residue, then lift it after a few minutes.",
    "You can then rub or scrape the residue to get most of it off.",
    "Other oily products are also effective, such as baby oil, peanut butter, or mayonnaise.",
    "Be careful around absorbent material such as carpeting and clothing.",
    "The oil may cause stains.",
    "If you’re concerned, try a baking soda paste instead.",
    "Mix together some coconut oil and baking soda.",
    "In a small bowl, combine an equal amount of the oil and baking soda.",
    "Mix them together to form a paste.",
    "If you don’t have coconut oil, try mixing the baking soda or vinegar into warm water.",
    "Apply the paste and let it rest for 30 minutes.",
    "Dip something soft, such as a cloth or old toothbrush, into the paste.",
    "Transfer it over to the surface you’re treating and spread it across the residue.",
    "Come back within 30 minutes to an hour to finish cleaning.",
    "Wash off the paste with warm water.",
    "Get a clean cloth and dampen it in warm water.",
    "The remaining residue will likely come off as you rub it with the damp cloth.",
    "Dry the surface with a cloth.",
    "Use a soft cloth or paper towel to dry the water and check for any remaining residue.",
    "You may also use a knife or paint scraper to loosen any remaining residue.",
    "Removing Stubborn Residue Heat the residue with a hairdryer for a quick removal.",
    "Aim the hairdryer at the residue to soften it.",
    "After a minute, it should be heated enough to remove.",
    "Scrape it off carefully with a knife or other implement.",
    "If it doesn’t come off all the way, switch to a different treatment.",
    "Spray WD-40 to treat metal surfaces.",
    "WD-40 is available at most general and home improvement stores.",
    "You can spray it directly onto areas with a lot of residue or dampen a terry cloth to treat smaller patches of residue.",
    "Leave it on for a minute, then scrub it off with soap and water.",
    "WD-40 is perfect for surfaces such as cars.",
    "Read the warnings on the canister to avoid using it on surfaces that it’ll stain.",
    "Vaseline or car wax works as an alternative to WD-40.",
    "Apply a commercial residue remover for a stronger treatment.",
    "These products are also available at general stores.",
    "There are brands out there designed to remove the residue from commercial tape.",
    "Follow the directions on the label and the product will also work well for you at home.",
    "Use water pressure or sandblasting to clean rock and concrete.",
    "This can only be done on strong construction materials such as rock, brick, and concrete.",
    "Aim a high-pressure water system or sandblaster at the material.",
    "Briefly turn it on and off until the residue is gone.",
    "Be very careful when doing this.",
    "These machines can leave marks on most surfaces."
  ],
  "tyn_section":[
    "Butter knife or dull blade",
    "Rubbing alcohol",
    "Soft cloth",
    "Liquid dish soap",
    "Water",
    "Small bowl",
    "Coconut oil or another cooking oil",
    "Paper towel",
    "Baking soda",
    "Soft cloth or toothbrush",
    "Hairdryer",
    "WD-40",
    "Commercial residue remover",
    "Water pressure system or sandblaster if necessary"
  ],
  "tyn_model":[
    "water",
    "paper towel",
    "baking soda",
    "rubbing alcohol",
    "knife",
    "cooking oil",
    "coconut oil",
    "hairdryer",
    "wd-40",
    "concrete",
    "butter knife",
    "putty knife",
    "razor",
    "isopropyl rubbing alcohol",
    "acetone or",
    "nail polish remover",
    "dish soap",
    "liquid dish detergent",
    "baby oil",
    "peanut butter",
    "mayonnaise",
    "vinegar",
    "wd-40 to",
    "terry cloth",
    "soap",
    "wd-40 is",
    "vaseline",
    "car wax",
    "tape",
    "water pressure",
    "sandblasting",
    "water system or sandblaster"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.1875,
    "f1":0.2608695652,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.40625,
    "f1":0.4748858447
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7857142857,
    "p":0.5625,
    "f1":0.6556291391
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.25,
    "f1":0.3333333333
  }
}