{
  "title":"How to Bake Thick Pork Chops",
  "url":"https://www.wikihow.com/Bake-Thick-Pork-Chops",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork",
    "Pork Chops"
  ],
  "methods":[
    {
      "name":"Baking Simple Pork Chops",
      "steps":[
        {
          "headline":"Preheat the oven to 400 °F (204 °C) and season the pork chops.",
          "description":"Set 4 thick-cut pork chops onto a cutting board or work surface. Use your fingers or a pastry brush to rub 1 tablespoon (15 ml) of olive oil over each pork chop. Sprinkle the pork chop with salt and pepper to taste. Turn the pork chops over and sprinkle more salt and pepper on the other sides. Use bone-in or boneless pork chops that are at least 1.75 inches (4.4 cm) to 2 inches (5.1 cm) thick."
        },
        {
          "headline":"Heat a skillet over high heat.",
          "description":"Set a large skillet that's oven-safe on the stove. Turn the heat to high and let it heat for 1 to 2 minutes before you begin cooking the pork chops. The skillet should be at least 12 inches (30 cm) across."
        },
        {
          "headline":"Sauté the pork chops for 2 minutes.",
          "description":"Keep the heat on high and lower the thick pork chops into the skillet. Cook the chops for 2 minutes without moving them. They should brown on the bottom."
        },
        {
          "headline":"Flip and cook the pork chops for 2 more minutes.",
          "description":"Use tongs to flip each pork chop over. Cook them for 2 more minutes so they become browned on the other side and then turn off the heat."
        },
        {
          "headline":"Bake the thick pork chops for 15 minutes.",
          "description":"Put the oven-safe skillet with the pork chops into the preheated oven. Cook the pork chops until the centers reach 145 °F (63 °C) with an instant-read thermometer. Bone-in pork chops may take about 5 more minutes to cook. If you prefer your pork chops well-cooked, bake them for 2 to 5 more minutes."
        },
        {
          "headline":"Cover and rest the pork chops for 5 to 10 minutes.",
          "description":"Remove the skillet from the oven and cover the pork chops loosely with aluminum foil. Let the pork chops rest so the juices redistribute and they finish cooking."
        },
        {
          "headline":"Serve the thick-cut pork chops.",
          "description":"Remove the foil and serve the pork chops immediately. Either slice the chops for your guests or set out steak knives. Serve the chops with mashed potatoes, green beans, or roasted vegetables. If you want to store the pork chops, place them in an airtight container and refrigerate them for 3 to 4 days."
        }
      ]
    },
    {
      "name":"Oven-Frying Crispy Pork Chops",
      "steps":[
        {
          "headline":"Set the pork chops at room temperature for 45 minutes.",
          "description":"Remove 7 thick-cut pork chops from the refrigerator and put them onto a baking sheet. Let them sit out at room temperature so they're no longer chilled from being in the refrigerator. This will help them cook evenly."
        },
        {
          "headline":"Preheat the oven to 350 °F (177 °C) and grease a baking dish.",
          "description":"Get out a 9 inches (23 cm) x 13 inches (33 cm) baking dish and spray it with cooking spray. If you don't have cooking spray, you can spread grease or butter along the inside of the pan. Set the baking dish aside."
        },
        {
          "headline":"Whisk the eggs with the milk.",
          "description":"Crack 2 eggs into a shallow bowl and pour in 1⁄4 cup (60 ml) of milk. Whisk the mixture until the eggs are completely combined with the milk. Set the bowl aside."
        },
        {
          "headline":"Mix breadcrumbs with cheese and herbs.",
          "description":"Pour 1 1⁄2 cups (135 g) of dry breadcrumbs into a shallow bowl along with 1⁄2 cup (50 g) of freshly grated parmesan cheese. Stir in:\n1 1⁄2 teaspoons (3 g) garlic powder\n1⁄2 to 1 teaspoon (2.5 to 5.5 g) salt\n1⁄2 teaspoon (1 g) black pepper\n1 pinch cayenne pepper\n1 tablespoon (1.5 g) dried parsley\n1⁄2 teaspoon (1 g) dried Italian seasoning"
        },
        {
          "headline":"Dip the pork chops into the wet mixture.",
          "description":"Take a thick-cut pork chop and lower it into the egg and milk mixture. Ensure that the pork chop is totally covered with the wet mixture. Dip each pork chop 1 at a time."
        },
        {
          "headline":"Coat both sides of the pork chops in the breadcrumb mixture.",
          "description":"Lift a pork chop up out of the wet mixture so the excess liquid drips back into the dish. Immediately lower the pork chop into the breadcrumb mixture and turn it over so both sides are coated. Coat each of the chops in the breadcrumb mixture. Place the coated pork chops on the baking sheet."
        },
        {
          "headline":"Sear the pork chops for 4 minutes.",
          "description":"Put 2 tablespoons (30 ml) of oil and 1 tablespoon (14 g) of butter into a large skillet. Turn the heat to medium-high. Once the oil mixture is shimmering hot, lay a few of the pork chops into the skillet. Cook them for 4 minutes so they become brown and crisp on the bottom. Cook the chops in batches since they won't all fit into the skillet. Avoid turning or moving the chops while they're searing."
        },
        {
          "headline":"Flip and sear the pork chops for 4 more minutes.",
          "description":"Use tongs to flip each pork chop over and continue to cook the other sides over medium-high heat. Cook the chops until they become browned and crunchy. Sear the remaining pork chops in batches."
        },
        {
          "headline":"Bake the crispy pork chops for 25 minutes.",
          "description":"Transfer the seared pork chops to the prepared baking dish. Put them in the preheated oven and bake the chops until they're cooked to at least 145 °F (63 °C). If you'd like well-done pork chops, cook them for about 5 minutes longer. Check the centers to see if they're as cooked as you like."
        },
        {
          "headline":"Rest the chops for 3 minutes before you and serve them.",
          "description":"Once the chops have reached your desired temperature, remove them from the oven and cover them loosely with aluminum foil. Rest the chops for 3 minutes and serve them immediately. Serve the chops with roasted potatoes, gravy, cornbread, or cooked greens. You can store the leftover chops in an airtight container in the refrigerator, but they'll become soggy as they're stored. Store them for up to 3 or 4 days."
        }
      ]
    },
    {
      "name":"Brining and Baking Thick Pork Chops",
      "steps":[
        {
          "headline":"Preheat the oven to 350 °F (177 °C) and mix the brine solution.",
          "description":"Get out a large bowl and pour 1 gallon (3.78 liters) of cold water into it. Add 1 cup (200 g) of packed brown sugar, 1 cup (269 g) of sea salt, 1 cup (240 ml) of frozen apple juice concentrate that's been thawed, 1 1/2 teaspoons (4 g) of whole black peppercorns, and 2 fresh thyme sprigs. Stir until the sugar and salt are dissolved."
        },
        {
          "headline":"Place the pork chops in a bag with the brine solution.",
          "description":"Place 4 thick pork chops into an extra-large resealable bag. If you don't have an extra large bag, you could divide the pork chops into 2 smaller resealable bags. Pour the brine solution into the bag (or divide it between 2 bags) and seal the bag shut. The pork chops should be submerged in the brine solution. You can use thick pork chops that are sold as double-cut chops. These usually have at least 2 rib bones attached to the chop."
        },
        {
          "headline":"Chill the pork chops in the brine solution for 2 hours.",
          "description":"Put the bags into the refrigerator and let the pork chops tenderize and absorb the flavors of the brine solution. Avoid brining the pork chops for more than 2 hours or the meat will become mushy."
        },
        {
          "headline":"Dry and season the pork chops.",
          "description":"Remove the pork chops from the refrigerator and pour out the brine solution from the bags. Take the pork chops out and blot them dry with paper towels. Sprinkle the pork chops with a few generous pinches of salt and pepper."
        },
        {
          "headline":"Sear the pork chops for 4 minutes over medium-high heat.",
          "description":"Set a heavy skillet on the stove and pour in 2 tablespoons (30 ml) of the extra virgin olive oil. Turn the heat to medium-high so the oil heats and shimmers a little. Lay 2 of the pork chops in the skillet and let them cook for 4 minutes without moving them. Because these pork chops are large, you'll need to cook them in batches so you can fit them in your skillet."
        },
        {
          "headline":"Flip and sear the pork chops for 4 more minutes.",
          "description":"Use tongs to flip the pork chops over and let them cook over medium-high heat for 4 more minutes. They should be a caramel brown color on both sides once they've finished searing. Transfer the seared pork chops to a pan or baking sheet and sear the last 2 pork chops."
        },
        {
          "headline":"Bake the brined pork chops for 30 minutes.",
          "description":"Once you've seared the last 2 pork chops on both sides, place them in the pan or baking sheet. Put the pork chops in the preheated oven and bake them until they're tender and cooked according to your preference."
        },
        {
          "headline":"Check the temperature and serve the pork chops.",
          "description":"Insert an instant-read thermometer into the thickest part of a pork chop. The meat should reach between 140 °F (60 °C) and 145 °F (63 °C) once they've finished cooking. Serve the pork chops with sautéed apples, roasted squash, or crispy potatoes. Put the leftovers in an airtight container. Refrigerate them for 3 to 4 days."
        }
      ]
    }
  ],
  "text":" Baking Simple Pork Chops Preheat the oven to 400 °F (204 °C) and season the pork chops. Set 4 thick-cut pork chops onto a cutting board or work surface. Use your fingers or a pastry brush to rub 1 tablespoon (15 ml) of olive oil over each pork chop. Sprinkle the pork chop with salt and pepper to taste. Turn the pork chops over and sprinkle more salt and pepper on the other sides. Use bone-in or boneless pork chops that are at least 1.75 inches (4.4 cm) to 2 inches (5.1 cm) thick. Heat a skillet over high heat. Set a large skillet that's oven-safe on the stove. Turn the heat to high and let it heat for 1 to 2 minutes before you begin cooking the pork chops. The skillet should be at least 12 inches (30 cm) across. Sauté the pork chops for 2 minutes. Keep the heat on high and lower the thick pork chops into the skillet. Cook the chops for 2 minutes without moving them. They should brown on the bottom. Flip and cook the pork chops for 2 more minutes. Use tongs to flip each pork chop over. Cook them for 2 more minutes so they become browned on the other side and then turn off the heat. Bake the thick pork chops for 15 minutes. Put the oven-safe skillet with the pork chops into the preheated oven. Cook the pork chops until the centers reach 145 °F (63 °C) with an instant-read thermometer. Bone-in pork chops may take about 5 more minutes to cook. If you prefer your pork chops well-cooked, bake them for 2 to 5 more minutes. Cover and rest the pork chops for 5 to 10 minutes. Remove the skillet from the oven and cover the pork chops loosely with aluminum foil. Let the pork chops rest so the juices redistribute and they finish cooking. Serve the thick-cut pork chops. Remove the foil and serve the pork chops immediately. Either slice the chops for your guests or set out steak knives. Serve the chops with mashed potatoes, green beans, or roasted vegetables. If you want to store the pork chops, place them in an airtight container and refrigerate them for 3 to 4 days. Oven-Frying Crispy Pork Chops Set the pork chops at room temperature for 45 minutes. Remove 7 thick-cut pork chops from the refrigerator and put them onto a baking sheet. Let them sit out at room temperature so they're no longer chilled from being in the refrigerator. This will help them cook evenly. Preheat the oven to 350 °F (177 °C) and grease a baking dish. Get out a 9 inches (23 cm) x 13 inches (33 cm) baking dish and spray it with cooking spray. If you don't have cooking spray, you can spread grease or butter along the inside of the pan. Set the baking dish aside. Whisk the eggs with the milk. Crack 2 eggs into a shallow bowl and pour in 1⁄4 cup (60 ml) of milk. Whisk the mixture until the eggs are completely combined with the milk. Set the bowl aside. Mix breadcrumbs with cheese and herbs. Pour 1 1⁄2 cups (135 g) of dry breadcrumbs into a shallow bowl along with 1⁄2 cup (50 g) of freshly grated parmesan cheese. Stir in:\n1 1⁄2 teaspoons (3 g) garlic powder\n1⁄2 to 1 teaspoon (2.5 to 5.5 g) salt\n1⁄2 teaspoon (1 g) black pepper\n1 pinch cayenne pepper\n1 tablespoon (1.5 g) dried parsley\n1⁄2 teaspoon (1 g) dried Italian seasoning Dip the pork chops into the wet mixture. Take a thick-cut pork chop and lower it into the egg and milk mixture. Ensure that the pork chop is totally covered with the wet mixture. Dip each pork chop 1 at a time. Coat both sides of the pork chops in the breadcrumb mixture. Lift a pork chop up out of the wet mixture so the excess liquid drips back into the dish. Immediately lower the pork chop into the breadcrumb mixture and turn it over so both sides are coated. Coat each of the chops in the breadcrumb mixture. Place the coated pork chops on the baking sheet. Sear the pork chops for 4 minutes. Put 2 tablespoons (30 ml) of oil and 1 tablespoon (14 g) of butter into a large skillet. Turn the heat to medium-high. Once the oil mixture is shimmering hot, lay a few of the pork chops into the skillet. Cook them for 4 minutes so they become brown and crisp on the bottom. Cook the chops in batches since they won't all fit into the skillet. Avoid turning or moving the chops while they're searing. Flip and sear the pork chops for 4 more minutes. Use tongs to flip each pork chop over and continue to cook the other sides over medium-high heat. Cook the chops until they become browned and crunchy. Sear the remaining pork chops in batches. Bake the crispy pork chops for 25 minutes. Transfer the seared pork chops to the prepared baking dish. Put them in the preheated oven and bake the chops until they're cooked to at least 145 °F (63 °C). If you'd like well-done pork chops, cook them for about 5 minutes longer. Check the centers to see if they're as cooked as you like. Rest the chops for 3 minutes before you and serve them. Once the chops have reached your desired temperature, remove them from the oven and cover them loosely with aluminum foil. Rest the chops for 3 minutes and serve them immediately. Serve the chops with roasted potatoes, gravy, cornbread, or cooked greens. You can store the leftover chops in an airtight container in the refrigerator, but they'll become soggy as they're stored. Store them for up to 3 or 4 days. Brining and Baking Thick Pork Chops Preheat the oven to 350 °F (177 °C) and mix the brine solution. Get out a large bowl and pour 1 gallon (3.78 liters) of cold water into it. Add 1 cup (200 g) of packed brown sugar, 1 cup (269 g) of sea salt, 1 cup (240 ml) of frozen apple juice concentrate that's been thawed, 1 1/2 teaspoons (4 g) of whole black peppercorns, and 2 fresh thyme sprigs. Stir until the sugar and salt are dissolved. Place the pork chops in a bag with the brine solution. Place 4 thick pork chops into an extra-large resealable bag. If you don't have an extra large bag, you could divide the pork chops into 2 smaller resealable bags. Pour the brine solution into the bag (or divide it between 2 bags) and seal the bag shut. The pork chops should be submerged in the brine solution. You can use thick pork chops that are sold as double-cut chops. These usually have at least 2 rib bones attached to the chop. Chill the pork chops in the brine solution for 2 hours. Put the bags into the refrigerator and let the pork chops tenderize and absorb the flavors of the brine solution. Avoid brining the pork chops for more than 2 hours or the meat will become mushy. Dry and season the pork chops. Remove the pork chops from the refrigerator and pour out the brine solution from the bags. Take the pork chops out and blot them dry with paper towels. Sprinkle the pork chops with a few generous pinches of salt and pepper. Sear the pork chops for 4 minutes over medium-high heat. Set a heavy skillet on the stove and pour in 2 tablespoons (30 ml) of the extra virgin olive oil. Turn the heat to medium-high so the oil heats and shimmers a little. Lay 2 of the pork chops in the skillet and let them cook for 4 minutes without moving them. Because these pork chops are large, you'll need to cook them in batches so you can fit them in your skillet. Flip and sear the pork chops for 4 more minutes. Use tongs to flip the pork chops over and let them cook over medium-high heat for 4 more minutes. They should be a caramel brown color on both sides once they've finished searing. Transfer the seared pork chops to a pan or baking sheet and sear the last 2 pork chops. Bake the brined pork chops for 30 minutes. Once you've seared the last 2 pork chops on both sides, place them in the pan or baking sheet. Put the pork chops in the preheated oven and bake them until they're tender and cooked according to your preference. Check the temperature and serve the pork chops. Insert an instant-read thermometer into the thickest part of a pork chop. The meat should reach between 140 °F (60 °C) and 145 °F (63 °C) once they've finished cooking. Serve the pork chops with sautéed apples, roasted squash, or crispy potatoes. Put the leftovers in an airtight container. Refrigerate them for 3 to 4 days.",
  "sentences":[
    " Baking Simple Pork Chops Preheat the oven to 400 °F (204 °C) and season the pork chops.",
    "Set 4 thick-cut pork chops onto a cutting board or work surface.",
    "Use your fingers or a pastry brush to rub 1 tablespoon (15 ml) of olive oil over each pork chop.",
    "Sprinkle the pork chop with salt and pepper to taste.",
    "Turn the pork chops over and sprinkle more salt and pepper on the other sides.",
    "Use bone-in or boneless pork chops that are at least 1.75 inches (4.4 cm) to 2 inches (5.1 cm) thick.",
    "Heat a skillet over high heat.",
    "Set a large skillet that's oven-safe on the stove.",
    "Turn the heat to high and let it heat for 1 to 2 minutes before you begin cooking the pork chops.",
    "The skillet should be at least 12 inches (30 cm) across.",
    "Sauté the pork chops for 2 minutes.",
    "Keep the heat on high and lower the thick pork chops into the skillet.",
    "Cook the chops for 2 minutes without moving them.",
    "They should brown on the bottom.",
    "Flip and cook the pork chops for 2 more minutes.",
    "Use tongs to flip each pork chop over.",
    "Cook them for 2 more minutes so they become browned on the other side and then turn off the heat.",
    "Bake the thick pork chops for 15 minutes.",
    "Put the oven-safe skillet with the pork chops into the preheated oven.",
    "Cook the pork chops until the centers reach 145 °F (63 °C) with an instant-read thermometer.",
    "Bone-in pork chops may take about 5 more minutes to cook.",
    "If you prefer your pork chops well-cooked, bake them for 2 to 5 more minutes.",
    "Cover and rest the pork chops for 5 to 10 minutes.",
    "Remove the skillet from the oven and cover the pork chops loosely with aluminum foil.",
    "Let the pork chops rest so the juices redistribute and they finish cooking.",
    "Serve the thick-cut pork chops.",
    "Remove the foil and serve the pork chops immediately.",
    "Either slice the chops for your guests or set out steak knives.",
    "Serve the chops with mashed potatoes, green beans, or roasted vegetables.",
    "If you want to store the pork chops, place them in an airtight container and refrigerate them for 3 to 4 days.",
    "Oven-Frying Crispy Pork Chops Set the pork chops at room temperature for 45 minutes.",
    "Remove 7 thick-cut pork chops from the refrigerator and put them onto a baking sheet.",
    "Let them sit out at room temperature so they're no longer chilled from being in the refrigerator.",
    "This will help them cook evenly.",
    "Preheat the oven to 350 °F (177 °C) and grease a baking dish.",
    "Get out a 9 inches (23 cm) x 13 inches (33 cm) baking dish and spray it with cooking spray.",
    "If you don't have cooking spray, you can spread grease or butter along the inside of the pan.",
    "Set the baking dish aside.",
    "Whisk the eggs with the milk.",
    "Crack 2 eggs into a shallow bowl and pour in 1⁄4 cup (60 ml) of milk.",
    "Whisk the mixture until the eggs are completely combined with the milk.",
    "Set the bowl aside.",
    "Mix breadcrumbs with cheese and herbs.",
    "Pour 1 1⁄2 cups (135 g) of dry breadcrumbs into a shallow bowl along with 1⁄2 cup (50 g) of freshly grated parmesan cheese.",
    "Stir in:\n1 1⁄2 teaspoons (3 g) garlic powder\n1⁄2 to 1 teaspoon (2.5 to 5.5 g) salt\n1⁄2 teaspoon (1 g) black pepper\n1 pinch cayenne pepper\n1 tablespoon (1.5 g) dried parsley\n1⁄2 teaspoon (1 g) dried Italian seasoning Dip the pork chops into the wet mixture.",
    "Take a thick-cut pork chop and lower it into the egg and milk mixture.",
    "Ensure that the pork chop is totally covered with the wet mixture.",
    "Dip each pork chop 1 at a time.",
    "Coat both sides of the pork chops in the breadcrumb mixture.",
    "Lift a pork chop up out of the wet mixture so the excess liquid drips back into the dish.",
    "Immediately lower the pork chop into the breadcrumb mixture and turn it over so both sides are coated.",
    "Coat each of the chops in the breadcrumb mixture.",
    "Place the coated pork chops on the baking sheet.",
    "Sear the pork chops for 4 minutes.",
    "Put 2 tablespoons (30 ml) of oil and 1 tablespoon (14 g) of butter into a large skillet.",
    "Turn the heat to medium-high.",
    "Once the oil mixture is shimmering hot, lay a few of the pork chops into the skillet.",
    "Cook them for 4 minutes so they become brown and crisp on the bottom.",
    "Cook the chops in batches since they won't all fit into the skillet.",
    "Avoid turning or moving the chops while they're searing.",
    "Flip and sear the pork chops for 4 more minutes.",
    "Use tongs to flip each pork chop over and continue to cook the other sides over medium-high heat.",
    "Cook the chops until they become browned and crunchy.",
    "Sear the remaining pork chops in batches.",
    "Bake the crispy pork chops for 25 minutes.",
    "Transfer the seared pork chops to the prepared baking dish.",
    "Put them in the preheated oven and bake the chops until they're cooked to at least 145 °F (63 °C).",
    "If you'd like well-done pork chops, cook them for about 5 minutes longer.",
    "Check the centers to see if they're as cooked as you like.",
    "Rest the chops for 3 minutes before you and serve them.",
    "Once the chops have reached your desired temperature, remove them from the oven and cover them loosely with aluminum foil.",
    "Rest the chops for 3 minutes and serve them immediately.",
    "Serve the chops with roasted potatoes, gravy, cornbread, or cooked greens.",
    "You can store the leftover chops in an airtight container in the refrigerator, but they'll become soggy as they're stored.",
    "Store them for up to 3 or 4 days.",
    "Brining and Baking Thick Pork Chops Preheat the oven to 350 °F (177 °C) and mix the brine solution.",
    "Get out a large bowl and pour 1 gallon (3.78 liters) of cold water into it.",
    "Add 1 cup (200 g) of packed brown sugar, 1 cup (269 g) of sea salt, 1 cup (240 ml) of frozen apple juice concentrate that's been thawed, 1 1/2 teaspoons (4 g) of whole black peppercorns, and 2 fresh thyme sprigs.",
    "Stir until the sugar and salt are dissolved.",
    "Place the pork chops in a bag with the brine solution.",
    "Place 4 thick pork chops into an extra-large resealable bag.",
    "If you don't have an extra large bag, you could divide the pork chops into 2 smaller resealable bags.",
    "Pour the brine solution into the bag (or divide it between 2 bags) and seal the bag shut.",
    "The pork chops should be submerged in the brine solution.",
    "You can use thick pork chops that are sold as double-cut chops.",
    "These usually have at least 2 rib bones attached to the chop.",
    "Chill the pork chops in the brine solution for 2 hours.",
    "Put the bags into the refrigerator and let the pork chops tenderize and absorb the flavors of the brine solution.",
    "Avoid brining the pork chops for more than 2 hours or the meat will become mushy.",
    "Dry and season the pork chops.",
    "Remove the pork chops from the refrigerator and pour out the brine solution from the bags.",
    "Take the pork chops out and blot them dry with paper towels.",
    "Sprinkle the pork chops with a few generous pinches of salt and pepper.",
    "Sear the pork chops for 4 minutes over medium-high heat.",
    "Set a heavy skillet on the stove and pour in 2 tablespoons (30 ml) of the extra virgin olive oil.",
    "Turn the heat to medium-high so the oil heats and shimmers a little.",
    "Lay 2 of the pork chops in the skillet and let them cook for 4 minutes without moving them.",
    "Because these pork chops are large, you'll need to cook them in batches so you can fit them in your skillet.",
    "Flip and sear the pork chops for 4 more minutes.",
    "Use tongs to flip the pork chops over and let them cook over medium-high heat for 4 more minutes.",
    "They should be a caramel brown color on both sides once they've finished searing.",
    "Transfer the seared pork chops to a pan or baking sheet and sear the last 2 pork chops.",
    "Bake the brined pork chops for 30 minutes.",
    "Once you've seared the last 2 pork chops on both sides, place them in the pan or baking sheet.",
    "Put the pork chops in the preheated oven and bake them until they're tender and cooked according to your preference.",
    "Check the temperature and serve the pork chops.",
    "Insert an instant-read thermometer into the thickest part of a pork chop.",
    "The meat should reach between 140 °F (60 °C) and 145 °F (63 °C) once they've finished cooking.",
    "Serve the pork chops with sautéed apples, roasted squash, or crispy potatoes.",
    "Put the leftovers in an airtight container.",
    "Refrigerate them for 3 to 4 days."
  ],
  "tyn_section":[
    "Simple Thick Pork Chops",
    "Measuring spoons",
    "Cutting board",
    "Pastry brush",
    "Oven-safe skillet at least 12 inches (30 cm) across",
    "Instant-read thermometer",
    "Tongs",
    "Aluminum foil",
    "Oven-Fried Crispy Pork Chops",
    "Measuring cups and spoons",
    "9 inches (23 cm) x 13 inches (33 cm) baking dish",
    "2 shallow bowls",
    "Large skillet",
    "Whisk",
    "Oven mitts",
    "Instant-read thermometer, optional",
    "Brined and Baked Thick Pork Chops",
    "Large bowl",
    "Spoon",
    "Extra-large resealable bag",
    "Heavy skillet",
    "Paper towels",
    "Baking pan or sheet"
  ],
  "tyn_model":[
    "skillet",
    "oven",
    "brine",
    "refrigerator",
    "baking dish",
    "milk",
    "salt and pepper",
    "airtight container",
    "baking sheet",
    "eggs",
    "breadcrumb",
    "large skillet",
    "stove",
    "instant-read thermometer",
    "aluminum foil",
    "cooking spray",
    "butter",
    "salt",
    "oil",
    "pork chops",
    "pastry brush",
    "olive oil",
    "oven-safe skillet",
    "preheated oven",
    "steak knives",
    "mashed potatoes",
    "green beans",
    "oven-frying crispy pork chops",
    "bowl",
    "cheese",
    "herbs",
    "shallow bowl",
    "parmesan cheese",
    "garlic powder",
    "black pepper",
    "cayenne pepper",
    "parsley",
    "italian seasoning",
    "egg",
    "roasted potatoes",
    "cooked greens",
    "large bowl",
    "cold water",
    "brown sugar",
    "sea salt",
    "apple juice concentrate",
    "black peppercorns",
    "thyme",
    "sugar",
    "resealable bag",
    "resealable bags",
    "paper towels",
    "extra virgin olive oil",
    "pan or baking",
    "pan",
    "pork chop",
    "sautéed apples",
    "roasted squash",
    "potatoes"
  ],
  "simple_metrics":{
    "r":0.2608695652,
    "p":0.1016949153,
    "f1":0.1463414634,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5217391304,
    "p":0.2372881356,
    "f1":0.3262135922
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5652173913,
    "p":0.2881355932,
    "f1":0.3816925734
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.347826087,
    "p":0.1355932203,
    "f1":0.1951219512
  }
}