{
  "title":"How to Pick a Master Padlock",
  "url":"https://www.wikihow.com/Pick-a-Master-Padlock",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Using Bobby Pins or Paperclips",
      "steps":[
        {
          "headline":"Make a lock pick and tension wrench with bobby pins.",
          "description":"To make the tension wrench, bend the closed end of a bobby pin until it's at a 90-degree angle with the rest of the pin. To make the single-pin pick, unbend a bobby pin so it's straight. Then, bend the flat end of the bobby pin slightly upward."
        },
        {
          "headline":"Make a pick and wrench out of paper clips if you don't have bobby pins.",
          "description":"To make the tension wrench, take a paperclip and unbend all the loops except for one at the bottom. Then, bend the flat end of the paper clip until it makes a 90-degree angle with the rest of the paper clip. To make the single-pin pick, unbend half of a second paper clip. Bend the flat end of the paper clip so it goes slightly upward."
        },
        {
          "headline":"Insert the bent end of your tension bar into the lock's keyhole.",
          "description":"The tension bar will hold open the keyhole for you as you work on picking the lock."
        },
        {
          "headline":"Rotate the tension wrench like you're opening the lock with the key.",
          "description":"The tension wrench won't go very far because the lock is locked. Turn the wrench as far as it will go and hold it in place using the same hand you're holding the lock with. You want to maintain pressure on the tension wrench the whole time you're picking lock."
        },
        {
          "headline":"Insert your single-pin pick into the lock and push it all the way back.",
          "description":"Insert the pointed end of the pick into the lock and hold the handle end in your free hand."
        },
        {
          "headline":"Push the pin at the back of the lock up with your pick.",
          "description":"Master padlocks have a series of pins that all need to be raised above the cylinder so the cylinder can rotate and unlock the lock. To find the pin at the back of the lock, gently push up on the top of the inside of the lock with the pin until you feel something push upward. Once you've found the pin, press down on the handle of the pick to lift the end of the pick and push the pin up above the cylinder. When you push up the pin, the cylinder will rotate slightly and catch the pin so it doesn't fall back down."
        },
        {
          "headline":"Push up the rest of the pins in the lock with your pick.",
          "description":"Work your way up the row of pins, pushing them up one at a time. If you encounter a pin that feels stuck, you may need to wiggle the pick up and down a few times to get the pin to go up. The last pin you push up should be the pin closest to the keyhole on the lock. Once all of the pins are up, the cylinder should turn — as long as you're still applying pressure to the tension wrench — and the lock should pop open."
        },
        {
          "headline":"Pull your pin and tension wrench out of the lock.",
          "description":"Remove the master padlock from whatever it was locked onto."
        }
      ]
    },
    {
      "name":"Using a Lock Picking Kit",
      "steps":[
        {
          "headline":"Buy a lock picking kit for the best results.",
          "description":"A lock picking kit will come with a variety of tools you can use, including a tension wrench, rake tool, and single-pin pick. If you're looking for the easiest way to open a master padlock, use a lock picking kit. You can order a lock picking kit online."
        },
        {
          "headline":"Insert the bent end of your tension wrench into the lock opening.",
          "description":"You'll use the tension wrench to hold open the small door over the lock hole, and to apply pressure to the lock cylinder."
        },
        {
          "headline":"Turn the tension wrench in the direction the key would go in.",
          "description":"The tension wrench won't go very far because the lock is locked, but that's OK. You just want to turn it as far as you can and hold it there so you're applying pressure to the cylinder inside the lock. Use the hand you're holding the lock with to hold the tension wrench in place."
        },
        {
          "headline":"Push your rake tool as far into the lock as it will go.",
          "description":"The end of the rake tool with the teeth and ridges on it should be the end going into the lock."
        },
        {
          "headline":"Push your rake tool up so the teeth are resting on the top of the lock.",
          "description":"Push down on the end of the rake tool you're holding outside of the lock to get the end inside the lock to go up. Hold the handle of the rake tool down so the teeth stay at the top of the inside of the lock."
        },
        {
          "headline":"Pull the rake tool out of the lock quickly.",
          "description":"Maintain pressure on the tension wrench as you do this. Continue to push down on the handle of the rake tool as you pull the tool out so the teeth scrape against the top of the inside of the lock. Once the tool is out, check to see if the lock is unlocked."
        },
        {
          "headline":"Continue to bring the rake in and out of the lock if it hasn't unlocked yet.",
          "description":"Use a fast, repetitive motion, like you're scrubbing the inside of the lock. Continue to apply pressure to the tension wrench as you bring the rake tool in and out of the lock. Eventually the lock should pop open."
        },
        {
          "headline":"Remove the rake tool and tension wrench when the lock pops open.",
          "description":"You can now remove the master padlock from whatever it was locked on."
        }
      ]
    }
  ],
  "text":" Using Bobby Pins or Paperclips Make a lock pick and tension wrench with bobby pins. To make the tension wrench, bend the closed end of a bobby pin until it's at a 90-degree angle with the rest of the pin. To make the single-pin pick, unbend a bobby pin so it's straight. Then, bend the flat end of the bobby pin slightly upward. Make a pick and wrench out of paper clips if you don't have bobby pins. To make the tension wrench, take a paperclip and unbend all the loops except for one at the bottom. Then, bend the flat end of the paper clip until it makes a 90-degree angle with the rest of the paper clip. To make the single-pin pick, unbend half of a second paper clip. Bend the flat end of the paper clip so it goes slightly upward. Insert the bent end of your tension bar into the lock's keyhole. The tension bar will hold open the keyhole for you as you work on picking the lock. Rotate the tension wrench like you're opening the lock with the key. The tension wrench won't go very far because the lock is locked. Turn the wrench as far as it will go and hold it in place using the same hand you're holding the lock with. You want to maintain pressure on the tension wrench the whole time you're picking lock. Insert your single-pin pick into the lock and push it all the way back. Insert the pointed end of the pick into the lock and hold the handle end in your free hand. Push the pin at the back of the lock up with your pick. Master padlocks have a series of pins that all need to be raised above the cylinder so the cylinder can rotate and unlock the lock. To find the pin at the back of the lock, gently push up on the top of the inside of the lock with the pin until you feel something push upward. Once you've found the pin, press down on the handle of the pick to lift the end of the pick and push the pin up above the cylinder. When you push up the pin, the cylinder will rotate slightly and catch the pin so it doesn't fall back down. Push up the rest of the pins in the lock with your pick. Work your way up the row of pins, pushing them up one at a time. If you encounter a pin that feels stuck, you may need to wiggle the pick up and down a few times to get the pin to go up. The last pin you push up should be the pin closest to the keyhole on the lock. Once all of the pins are up, the cylinder should turn — as long as you're still applying pressure to the tension wrench — and the lock should pop open. Pull your pin and tension wrench out of the lock. Remove the master padlock from whatever it was locked onto. Using a Lock Picking Kit Buy a lock picking kit for the best results. A lock picking kit will come with a variety of tools you can use, including a tension wrench, rake tool, and single-pin pick. If you're looking for the easiest way to open a master padlock, use a lock picking kit. You can order a lock picking kit online. Insert the bent end of your tension wrench into the lock opening. You'll use the tension wrench to hold open the small door over the lock hole, and to apply pressure to the lock cylinder. Turn the tension wrench in the direction the key would go in. The tension wrench won't go very far because the lock is locked, but that's OK. You just want to turn it as far as you can and hold it there so you're applying pressure to the cylinder inside the lock. Use the hand you're holding the lock with to hold the tension wrench in place. Push your rake tool as far into the lock as it will go. The end of the rake tool with the teeth and ridges on it should be the end going into the lock. Push your rake tool up so the teeth are resting on the top of the lock. Push down on the end of the rake tool you're holding outside of the lock to get the end inside the lock to go up. Hold the handle of the rake tool down so the teeth stay at the top of the inside of the lock. Pull the rake tool out of the lock quickly. Maintain pressure on the tension wrench as you do this. Continue to push down on the handle of the rake tool as you pull the tool out so the teeth scrape against the top of the inside of the lock. Once the tool is out, check to see if the lock is unlocked. Continue to bring the rake in and out of the lock if it hasn't unlocked yet. Use a fast, repetitive motion, like you're scrubbing the inside of the lock. Continue to apply pressure to the tension wrench as you bring the rake tool in and out of the lock. Eventually the lock should pop open. Remove the rake tool and tension wrench when the lock pops open. You can now remove the master padlock from whatever it was locked on.",
  "sentences":[
    " Using Bobby Pins or Paperclips Make a lock pick and tension wrench with bobby pins.",
    "To make the tension wrench, bend the closed end of a bobby pin until it's at a 90-degree angle with the rest of the pin.",
    "To make the single-pin pick, unbend a bobby pin so it's straight.",
    "Then, bend the flat end of the bobby pin slightly upward.",
    "Make a pick and wrench out of paper clips if you don't have bobby pins.",
    "To make the tension wrench, take a paperclip and unbend all the loops except for one at the bottom.",
    "Then, bend the flat end of the paper clip until it makes a 90-degree angle with the rest of the paper clip.",
    "To make the single-pin pick, unbend half of a second paper clip.",
    "Bend the flat end of the paper clip so it goes slightly upward.",
    "Insert the bent end of your tension bar into the lock's keyhole.",
    "The tension bar will hold open the keyhole for you as you work on picking the lock.",
    "Rotate the tension wrench like you're opening the lock with the key.",
    "The tension wrench won't go very far because the lock is locked.",
    "Turn the wrench as far as it will go and hold it in place using the same hand you're holding the lock with.",
    "You want to maintain pressure on the tension wrench the whole time you're picking lock.",
    "Insert your single-pin pick into the lock and push it all the way back.",
    "Insert the pointed end of the pick into the lock and hold the handle end in your free hand.",
    "Push the pin at the back of the lock up with your pick.",
    "Master padlocks have a series of pins that all need to be raised above the cylinder so the cylinder can rotate and unlock the lock.",
    "To find the pin at the back of the lock, gently push up on the top of the inside of the lock with the pin until you feel something push upward.",
    "Once you've found the pin, press down on the handle of the pick to lift the end of the pick and push the pin up above the cylinder.",
    "When you push up the pin, the cylinder will rotate slightly and catch the pin so it doesn't fall back down.",
    "Push up the rest of the pins in the lock with your pick.",
    "Work your way up the row of pins, pushing them up one at a time.",
    "If you encounter a pin that feels stuck, you may need to wiggle the pick up and down a few times to get the pin to go up.",
    "The last pin you push up should be the pin closest to the keyhole on the lock.",
    "Once all of the pins are up, the cylinder should turn — as long as you're still applying pressure to the tension wrench — and the lock should pop open.",
    "Pull your pin and tension wrench out of the lock.",
    "Remove the master padlock from whatever it was locked onto.",
    "Using a Lock Picking Kit Buy a lock picking kit for the best results.",
    "A lock picking kit will come with a variety of tools you can use, including a tension wrench, rake tool, and single-pin pick.",
    "If you're looking for the easiest way to open a master padlock, use a lock picking kit.",
    "You can order a lock picking kit online.",
    "Insert the bent end of your tension wrench into the lock opening.",
    "You'll use the tension wrench to hold open the small door over the lock hole, and to apply pressure to the lock cylinder.",
    "Turn the tension wrench in the direction the key would go in.",
    "The tension wrench won't go very far because the lock is locked, but that's OK. You just want to turn it as far as you can and hold it there so you're applying pressure to the cylinder inside the lock.",
    "Use the hand you're holding the lock with to hold the tension wrench in place.",
    "Push your rake tool as far into the lock as it will go.",
    "The end of the rake tool with the teeth and ridges on it should be the end going into the lock.",
    "Push your rake tool up so the teeth are resting on the top of the lock.",
    "Push down on the end of the rake tool you're holding outside of the lock to get the end inside the lock to go up.",
    "Hold the handle of the rake tool down so the teeth stay at the top of the inside of the lock.",
    "Pull the rake tool out of the lock quickly.",
    "Maintain pressure on the tension wrench as you do this.",
    "Continue to push down on the handle of the rake tool as you pull the tool out so the teeth scrape against the top of the inside of the lock.",
    "Once the tool is out, check to see if the lock is unlocked.",
    "Continue to bring the rake in and out of the lock if it hasn't unlocked yet.",
    "Use a fast, repetitive motion, like you're scrubbing the inside of the lock.",
    "Continue to apply pressure to the tension wrench as you bring the rake tool in and out of the lock.",
    "Eventually the lock should pop open.",
    "Remove the rake tool and tension wrench when the lock pops open.",
    "You can now remove the master padlock from whatever it was locked on."
  ],
  "tyn_section":[
    "Tension wrench",
    "Rake tool",
    "Single-pin pick",
    "Bobby pins (optional)",
    "Paperclips (optional)",
    "Quik Stik(optional)",
    "compressed air computer cleaner(optional)",
    "hammer(optional)",
    "side cuts(optional)",
    "bolt cutters (optional)"
  ],
  "tyn_model":[
    "tension wrench",
    "rake tool",
    "pick",
    "rake",
    "bobby pins",
    "lock picking kit",
    "bobby pin",
    "paper",
    "tension bar",
    "pin",
    "lock picking",
    "lock pick",
    "paper clips",
    "paperclip",
    "wrench",
    "single-pin pick",
    "padlocks",
    "— as",
    "— and"
  ],
  "simple_metrics":{
    "r":0.3,
    "p":0.1578947368,
    "f1":0.2068965517,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.4,
    "p":0.3684210526,
    "f1":0.3835616438
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4,
    "p":0.4736842105,
    "f1":0.4337349398
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.2105263158,
    "f1":0.275862069
  }
}