{
  "title":"How to Level a Toilet",
  "url":"https://www.wikihow.com/Level-a-Toilet",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "parts":[
    {
      "name":"Making Minor Adjustments to the Toilet Level",
      "steps":[
        {
          "headline":"Check the toilet for wobbliness.",
          "description":"Sit on the toilet and rock it back and forth or side to side. If you notice shaking, your toilet may need minor or serious leveling. Start with small adjustments and, if the toilet still feels uneven, move on to more extensive adjustments later. If you are trying to make the toilet completely level, use a carpenter's level to measure how close the floor is to even."
        },
        {
          "headline":"Purchase stainless steel washers or plastic shims from a hardware store.",
          "description":"Plastic shims are made specifically for leveling toilets, but stainless steel washers can work just as well."
        },
        {
          "headline":"Remove the bolt caps and loosen the hex nuts.",
          "description":"There are 2-4 bolt caps on both sides of the toilet bottom to secure it to the floor. Take off the bolt caps to reveal the hex nuts, and loosen them with a wrench. In some cases, the toilet may be wobbly because these nuts are loose. If that’s the case, simply tighten them!"
        },
        {
          "headline":"Add stainless steel washers or shims to the bottom of your toilet.",
          "description":"Wedge a few shims or washers in between the floor and bottom of the toilet to make your toilet even and prevent rocking. Try adding 1 or 2 first, then add more later on if the ones you've added don't do the trick."
        },
        {
          "headline":"Re-tighten the hex nuts.",
          "description":"After you've wedged several shims or washers under your toilet, tighten the hex nuts again with your wrench. Place the bolt caps on top of the hex nuts to keep them secure so they don't loosen later on."
        },
        {
          "headline":"Test the toilet for wobbliness again.",
          "description":"Sit on the toilet again and rock back and forth or use a carpenter's level to precisely measure how even the floor is. If it is level enough to your liking, the toilet is now fixed. Reconnect the water supply line and open the shut-off valve again to turn it back on. If not, you may need to make additional minor or major adjustments."
        },
        {
          "headline":"Caulk the toilet to the floor if the problem is fixed.",
          "description":"If adding washers or shims fixed the problem, the only thing left to do is to caulk the toilet the the floor. Use a caulk gun to squeeze a bead of caulk around the base of the toilet where it meets the floor. Smooth out the bead using your finger, then wipe your finger on a wet rag. Caulking the toilet keeps the shims and washers secure in addition to preventing moisture from getting trapped under the toilet."
        },
        {
          "headline":"Continue adding steel washers or shims until the toilet feels even and level.",
          "description":"If your toilet still seems wobbly even after adding multiple washers or shims, you may need to make larger adjustments. Remove the toilet to work on the closet flange if adding washers or shims has no effect on how level it is."
        }
      ]
    },
    {
      "name":"Turning off the Water and Emptying the Tank",
      "steps":[
        {
          "headline":"Close your toilet's shut-off valve.",
          "description":"Locate your toilet's shut-off valve, usually near the back of the toilet and connected to the wall. Turn the valve handle clockwise to shut off the water so you can work on the toilet without any spills or leaks. Do not use pliers or wrenches to twist the valve handle, as this can permanently damage it."
        },
        {
          "headline":"Flush your toilet and hold down the lever.",
          "description":"Open the top of the toilet tank so you can watch it drain as you hold down the lever. Keep the lever held down until the entire toilet tank has drained."
        },
        {
          "headline":"Use a sponge to absorb any residual water in the tank.",
          "description":"Inspect the tank for any puddles on the bottom, and sop them up with your sponge to prevent spills as you handle your toilet. If you have a significant amount of water left in the toilet tank, use a turkey baster as an alternative. There will also be residual water left in the toilet bowl—sop it up with your sponge or turkey baster before working on the toilet."
        },
        {
          "headline":"Disconnect the water supply line from the tank.",
          "description":"The water supply line is the tube that connects the shut-off valve to the toilet. Use a wrench to unscrew the supply line from the tank so you can move the toilet around as you level it."
        }
      ]
    },
    {
      "name":"Removing the Toilet and Fixing the Closet Flange",
      "steps":[
        {
          "headline":"Remove the closet bolt caps on each side of the toilet if you haven’t already.",
          "description":"Locate the 2-4 bolt caps on the bottom of your toilet. Take the bolt caps off with your hands and expose the hex nuts. Then, unscrew the hex nuts with your wrench to detach the toilet from the floor."
        },
        {
          "headline":"Lift the toilet up and set it aside.",
          "description":"Toilets can be heavy and unwieldy. If you're not confident in your own strength, have another person help you lift the toilet up and move it out of the way as you work. Toilets can leak after they've been removed from the floor. Set it on a towel or some newspapers until you're ready to reattach it."
        },
        {
          "headline":"Expose the closet flange.",
          "description":"The closet flange is a round, flat tube with a cylinder on the bottom. Remove the wax from the flange with a putty knife, then remove the screws that attach the closet flange to the floor with a screwdriver. Use a wrench to loosen the closet flange bolts so you can remove the closet flange from the drain."
        },
        {
          "headline":"Lift the closet flange out of the drain hole carefully.",
          "description":"To inspect the closet flange for damage you will need to remove it from the drain hole. Work slowly to avoid chipping or damaging the flange. Clean it off with a washcloth and soap in your sink or bathtub so you can see it clearly while working. In newer homes, the closet flange may be fixed to the drain with PVC glue. If that’s the case, buy a repair flange to fit over the existing one. Use a level to make sure the repair flange is level, then screw it into the floor."
        },
        {
          "headline":"Check for rotten or damaged flooring.",
          "description":"Inspect the flooring for mold, mildew, or signs of decay. If the subfloor is rotten or severely damaged, it will need to be fixed by a professional unless you have previous experience replacing flooring. Call a home repair business to determine the severity of the damage and whether the flooring will need to be replaced. If the floor is uneven but not damaged, you could cut out a plywood base slightly larger than the toilet. Place it under the toilet so it sits on a flat surface, and cut a hole in the center of the plywood for the closet flange."
        },
        {
          "headline":"Inspect the closet flange for damage.",
          "description":"If your closet flange has any chips or cracks, your toilet may wobble or exhibit other problems. You may need to replace your toilet flange if you notice any damage. If so, purchase a new closet flange in the same size and place it in the same spot as your old closet flange."
        },
        {
          "headline":"Install new closet bolts into the closet flange.",
          "description":"Discard the old closet bolts—in many cases, they are the cause of wobbliness. Screw the closet flange back into the drain hole with new bolts using a wrench. Make sure you tighten the bolts as much as you can, as loose or damaged bolts can cause wobbly toilets."
        },
        {
          "headline":"Install a new wax ring over the closet flange.",
          "description":"Get a wax ring with a rubber flange and place it on top of the closet flange, centering it as evenly as you can. Press it tightly to seal it to the closet flange and prevent it from slipping out of place as you attach the toilet again. Do not reuse the wax from your old wax ring."
        },
        {
          "headline":"Put the toilet back in place and reattach it to the floor.",
          "description":"Lower the toilet back in alignment with the removed hex nuts and bolt caps. If the toilet is too heavy or unwieldy, you may need a second person to put it back. Tighten the hex nuts back in place with a wrench and cover them with the bolt caps."
        },
        {
          "headline":"Test your adjustments.",
          "description":"Sit down on your toilet or use a carpenter's level to check its reading. If you don't notice any wobbling and do not feel like you're sitting at an angle, the toilet may be level. Reconnect the water supply line to the tank and rotate the shutoff valve counterclockwise to turn the toilet back on. If the toilet seems more even but is still slightly wobbly, add shims or washers to the bottom. Continue adjusting the toilet if it is uneven until you reach the desired level."
        }
      ]
    }
  ],
  "text":" Making Minor Adjustments to the Toilet Level Check the toilet for wobbliness. Sit on the toilet and rock it back and forth or side to side. If you notice shaking, your toilet may need minor or serious leveling. Start with small adjustments and, if the toilet still feels uneven, move on to more extensive adjustments later. If you are trying to make the toilet completely level, use a carpenter's level to measure how close the floor is to even. Purchase stainless steel washers or plastic shims from a hardware store. Plastic shims are made specifically for leveling toilets, but stainless steel washers can work just as well. Remove the bolt caps and loosen the hex nuts. There are 2-4 bolt caps on both sides of the toilet bottom to secure it to the floor. Take off the bolt caps to reveal the hex nuts, and loosen them with a wrench. In some cases, the toilet may be wobbly because these nuts are loose. If that’s the case, simply tighten them! Add stainless steel washers or shims to the bottom of your toilet. Wedge a few shims or washers in between the floor and bottom of the toilet to make your toilet even and prevent rocking. Try adding 1 or 2 first, then add more later on if the ones you've added don't do the trick. Re-tighten the hex nuts. After you've wedged several shims or washers under your toilet, tighten the hex nuts again with your wrench. Place the bolt caps on top of the hex nuts to keep them secure so they don't loosen later on. Test the toilet for wobbliness again. Sit on the toilet again and rock back and forth or use a carpenter's level to precisely measure how even the floor is. If it is level enough to your liking, the toilet is now fixed. Reconnect the water supply line and open the shut-off valve again to turn it back on. If not, you may need to make additional minor or major adjustments. Caulk the toilet to the floor if the problem is fixed. If adding washers or shims fixed the problem, the only thing left to do is to caulk the toilet the the floor. Use a caulk gun to squeeze a bead of caulk around the base of the toilet where it meets the floor. Smooth out the bead using your finger, then wipe your finger on a wet rag. Caulking the toilet keeps the shims and washers secure in addition to preventing moisture from getting trapped under the toilet. Continue adding steel washers or shims until the toilet feels even and level. If your toilet still seems wobbly even after adding multiple washers or shims, you may need to make larger adjustments. Remove the toilet to work on the closet flange if adding washers or shims has no effect on how level it is. Turning off the Water and Emptying the Tank Close your toilet's shut-off valve. Locate your toilet's shut-off valve, usually near the back of the toilet and connected to the wall. Turn the valve handle clockwise to shut off the water so you can work on the toilet without any spills or leaks. Do not use pliers or wrenches to twist the valve handle, as this can permanently damage it. Flush your toilet and hold down the lever. Open the top of the toilet tank so you can watch it drain as you hold down the lever. Keep the lever held down until the entire toilet tank has drained. Use a sponge to absorb any residual water in the tank. Inspect the tank for any puddles on the bottom, and sop them up with your sponge to prevent spills as you handle your toilet. If you have a significant amount of water left in the toilet tank, use a turkey baster as an alternative. There will also be residual water left in the toilet bowl—sop it up with your sponge or turkey baster before working on the toilet. Disconnect the water supply line from the tank. The water supply line is the tube that connects the shut-off valve to the toilet. Use a wrench to unscrew the supply line from the tank so you can move the toilet around as you level it. Removing the Toilet and Fixing the Closet Flange Remove the closet bolt caps on each side of the toilet if you haven’t already. Locate the 2-4 bolt caps on the bottom of your toilet. Take the bolt caps off with your hands and expose the hex nuts. Then, unscrew the hex nuts with your wrench to detach the toilet from the floor. Lift the toilet up and set it aside. Toilets can be heavy and unwieldy. If you're not confident in your own strength, have another person help you lift the toilet up and move it out of the way as you work. Toilets can leak after they've been removed from the floor. Set it on a towel or some newspapers until you're ready to reattach it. Expose the closet flange. The closet flange is a round, flat tube with a cylinder on the bottom. Remove the wax from the flange with a putty knife, then remove the screws that attach the closet flange to the floor with a screwdriver. Use a wrench to loosen the closet flange bolts so you can remove the closet flange from the drain. Lift the closet flange out of the drain hole carefully. To inspect the closet flange for damage you will need to remove it from the drain hole. Work slowly to avoid chipping or damaging the flange. Clean it off with a washcloth and soap in your sink or bathtub so you can see it clearly while working. In newer homes, the closet flange may be fixed to the drain with PVC glue. If that’s the case, buy a repair flange to fit over the existing one. Use a level to make sure the repair flange is level, then screw it into the floor. Check for rotten or damaged flooring. Inspect the flooring for mold, mildew, or signs of decay. If the subfloor is rotten or severely damaged, it will need to be fixed by a professional unless you have previous experience replacing flooring. Call a home repair business to determine the severity of the damage and whether the flooring will need to be replaced. If the floor is uneven but not damaged, you could cut out a plywood base slightly larger than the toilet. Place it under the toilet so it sits on a flat surface, and cut a hole in the center of the plywood for the closet flange. Inspect the closet flange for damage. If your closet flange has any chips or cracks, your toilet may wobble or exhibit other problems. You may need to replace your toilet flange if you notice any damage. If so, purchase a new closet flange in the same size and place it in the same spot as your old closet flange. Install new closet bolts into the closet flange. Discard the old closet bolts—in many cases, they are the cause of wobbliness. Screw the closet flange back into the drain hole with new bolts using a wrench. Make sure you tighten the bolts as much as you can, as loose or damaged bolts can cause wobbly toilets. Install a new wax ring over the closet flange. Get a wax ring with a rubber flange and place it on top of the closet flange, centering it as evenly as you can. Press it tightly to seal it to the closet flange and prevent it from slipping out of place as you attach the toilet again. Do not reuse the wax from your old wax ring. Put the toilet back in place and reattach it to the floor. Lower the toilet back in alignment with the removed hex nuts and bolt caps. If the toilet is too heavy or unwieldy, you may need a second person to put it back. Tighten the hex nuts back in place with a wrench and cover them with the bolt caps. Test your adjustments. Sit down on your toilet or use a carpenter's level to check its reading. If you don't notice any wobbling and do not feel like you're sitting at an angle, the toilet may be level. Reconnect the water supply line to the tank and rotate the shutoff valve counterclockwise to turn the toilet back on. If the toilet seems more even but is still slightly wobbly, add shims or washers to the bottom. Continue adjusting the toilet if it is uneven until you reach the desired level.",
  "sentences":[
    " Making Minor Adjustments to the Toilet Level Check the toilet for wobbliness.",
    "Sit on the toilet and rock it back and forth or side to side.",
    "If you notice shaking, your toilet may need minor or serious leveling.",
    "Start with small adjustments and, if the toilet still feels uneven, move on to more extensive adjustments later.",
    "If you are trying to make the toilet completely level, use a carpenter's level to measure how close the floor is to even.",
    "Purchase stainless steel washers or plastic shims from a hardware store.",
    "Plastic shims are made specifically for leveling toilets, but stainless steel washers can work just as well.",
    "Remove the bolt caps and loosen the hex nuts.",
    "There are 2-4 bolt caps on both sides of the toilet bottom to secure it to the floor.",
    "Take off the bolt caps to reveal the hex nuts, and loosen them with a wrench.",
    "In some cases, the toilet may be wobbly because these nuts are loose.",
    "If that’s the case, simply tighten them!",
    "Add stainless steel washers or shims to the bottom of your toilet.",
    "Wedge a few shims or washers in between the floor and bottom of the toilet to make your toilet even and prevent rocking.",
    "Try adding 1 or 2 first, then add more later on if the ones you've added don't do the trick.",
    "Re-tighten the hex nuts.",
    "After you've wedged several shims or washers under your toilet, tighten the hex nuts again with your wrench.",
    "Place the bolt caps on top of the hex nuts to keep them secure so they don't loosen later on.",
    "Test the toilet for wobbliness again.",
    "Sit on the toilet again and rock back and forth or use a carpenter's level to precisely measure how even the floor is.",
    "If it is level enough to your liking, the toilet is now fixed.",
    "Reconnect the water supply line and open the shut-off valve again to turn it back on.",
    "If not, you may need to make additional minor or major adjustments.",
    "Caulk the toilet to the floor if the problem is fixed.",
    "If adding washers or shims fixed the problem, the only thing left to do is to caulk the toilet the the floor.",
    "Use a caulk gun to squeeze a bead of caulk around the base of the toilet where it meets the floor.",
    "Smooth out the bead using your finger, then wipe your finger on a wet rag.",
    "Caulking the toilet keeps the shims and washers secure in addition to preventing moisture from getting trapped under the toilet.",
    "Continue adding steel washers or shims until the toilet feels even and level.",
    "If your toilet still seems wobbly even after adding multiple washers or shims, you may need to make larger adjustments.",
    "Remove the toilet to work on the closet flange if adding washers or shims has no effect on how level it is.",
    "Turning off the Water and Emptying the Tank Close your toilet's shut-off valve.",
    "Locate your toilet's shut-off valve, usually near the back of the toilet and connected to the wall.",
    "Turn the valve handle clockwise to shut off the water so you can work on the toilet without any spills or leaks.",
    "Do not use pliers or wrenches to twist the valve handle, as this can permanently damage it.",
    "Flush your toilet and hold down the lever.",
    "Open the top of the toilet tank so you can watch it drain as you hold down the lever.",
    "Keep the lever held down until the entire toilet tank has drained.",
    "Use a sponge to absorb any residual water in the tank.",
    "Inspect the tank for any puddles on the bottom, and sop them up with your sponge to prevent spills as you handle your toilet.",
    "If you have a significant amount of water left in the toilet tank, use a turkey baster as an alternative.",
    "There will also be residual water left in the toilet bowl—sop it up with your sponge or turkey baster before working on the toilet.",
    "Disconnect the water supply line from the tank.",
    "The water supply line is the tube that connects the shut-off valve to the toilet.",
    "Use a wrench to unscrew the supply line from the tank so you can move the toilet around as you level it.",
    "Removing the Toilet and Fixing the Closet Flange Remove the closet bolt caps on each side of the toilet if you haven’t already.",
    "Locate the 2-4 bolt caps on the bottom of your toilet.",
    "Take the bolt caps off with your hands and expose the hex nuts.",
    "Then, unscrew the hex nuts with your wrench to detach the toilet from the floor.",
    "Lift the toilet up and set it aside.",
    "Toilets can be heavy and unwieldy.",
    "If you're not confident in your own strength, have another person help you lift the toilet up and move it out of the way as you work.",
    "Toilets can leak after they've been removed from the floor.",
    "Set it on a towel or some newspapers until you're ready to reattach it.",
    "Expose the closet flange.",
    "The closet flange is a round, flat tube with a cylinder on the bottom.",
    "Remove the wax from the flange with a putty knife, then remove the screws that attach the closet flange to the floor with a screwdriver.",
    "Use a wrench to loosen the closet flange bolts so you can remove the closet flange from the drain.",
    "Lift the closet flange out of the drain hole carefully.",
    "To inspect the closet flange for damage you will need to remove it from the drain hole.",
    "Work slowly to avoid chipping or damaging the flange.",
    "Clean it off with a washcloth and soap in your sink or bathtub so you can see it clearly while working.",
    "In newer homes, the closet flange may be fixed to the drain with PVC glue.",
    "If that’s the case, buy a repair flange to fit over the existing one.",
    "Use a level to make sure the repair flange is level, then screw it into the floor.",
    "Check for rotten or damaged flooring.",
    "Inspect the flooring for mold, mildew, or signs of decay.",
    "If the subfloor is rotten or severely damaged, it will need to be fixed by a professional unless you have previous experience replacing flooring.",
    "Call a home repair business to determine the severity of the damage and whether the flooring will need to be replaced.",
    "If the floor is uneven but not damaged, you could cut out a plywood base slightly larger than the toilet.",
    "Place it under the toilet so it sits on a flat surface, and cut a hole in the center of the plywood for the closet flange.",
    "Inspect the closet flange for damage.",
    "If your closet flange has any chips or cracks, your toilet may wobble or exhibit other problems.",
    "You may need to replace your toilet flange if you notice any damage.",
    "If so, purchase a new closet flange in the same size and place it in the same spot as your old closet flange.",
    "Install new closet bolts into the closet flange.",
    "Discard the old closet bolts—in many cases, they are the cause of wobbliness.",
    "Screw the closet flange back into the drain hole with new bolts using a wrench.",
    "Make sure you tighten the bolts as much as you can, as loose or damaged bolts can cause wobbly toilets.",
    "Install a new wax ring over the closet flange.",
    "Get a wax ring with a rubber flange and place it on top of the closet flange, centering it as evenly as you can.",
    "Press it tightly to seal it to the closet flange and prevent it from slipping out of place as you attach the toilet again.",
    "Do not reuse the wax from your old wax ring.",
    "Put the toilet back in place and reattach it to the floor.",
    "Lower the toilet back in alignment with the removed hex nuts and bolt caps.",
    "If the toilet is too heavy or unwieldy, you may need a second person to put it back.",
    "Tighten the hex nuts back in place with a wrench and cover them with the bolt caps.",
    "Test your adjustments.",
    "Sit down on your toilet or use a carpenter's level to check its reading.",
    "If you don't notice any wobbling and do not feel like you're sitting at an angle, the toilet may be level.",
    "Reconnect the water supply line to the tank and rotate the shutoff valve counterclockwise to turn the toilet back on.",
    "If the toilet seems more even but is still slightly wobbly, add shims or washers to the bottom.",
    "Continue adjusting the toilet if it is uneven until you reach the desired level."
  ],
  "tyn_section":[
    "Screwdriver",
    "Wrench",
    "Sponge",
    "Towel or old newspapers",
    "Putty knife",
    "Closet bolts",
    "Stainless steel washers or plastic shims",
    "Carpenter's level",
    "Turkey baster (optional)",
    "Closer flange (optional)"
  ],
  "tyn_model":[
    "toilet",
    "water",
    "shims",
    "wrench",
    "level",
    "washers",
    "sponge",
    "stainless steel washers",
    "turkey baster",
    "toilets",
    "plywood",
    "wax ring",
    "caulk gun",
    "pliers",
    "—sop",
    "newspapers",
    "putty knife",
    "screwdriver",
    "washcloth",
    "soap",
    "pvc glue",
    "home repair business",
    "toilet flange",
    "closet flange",
    "—in"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.16,
    "f1":0.2285714286,
    "avg_pos":0.68
  },
  "jacc_metrics_0.5":{
    "r":0.7,
    "p":0.28,
    "f1":0.4
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.32,
    "f1":0.4571428571
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.2,
    "f1":0.2857142857
  }
}