{
  "title":"How to Paint Marble",
  "url":"https://www.wikihow.com/Paint-Marble",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs"
  ],
  "methods":[
    {
      "name":"Creating a Marble Effect",
      "steps":[
        {
          "headline":"Choose a well-ventilated area and protect your workspace.",
          "description":"If the item can be moved, you may want to take it outside or to a garage or patio. If it can’t be moved, open plenty of windows and doors and turn on fans to ventilate the area. You can also wear a respirator. To prevent drips from staining your floor, lay out a drop cloth or old blanket under the item. Use painter’s tape to mask any parts you don’t want to get paint on, such as a drawer pull."
        },
        {
          "headline":"Paint the item a light color, then let it dry for up to 16 hours.",
          "description":"Use a large paintbrush or roller to add a base coat in a light color, like white, cream, or silver. Paint the item using long, even strokes in the same direction. The type of paint you need depends on the object you are painting. If you’re working with a canvas, use acrylic paint. For wooden items, you can use latex or oil-based paint. Refer to the paint can to find out how long it takes to dry. Generally, latex paint needs to dry for about 4 hours, while oil-based paint may need up to 16 hours to dry fully. Acrylic paint dries in 1-2 hours. High humidity and low temperatures can increase the drying time."
        },
        {
          "headline":"Use a damp sea sponge to cover the entire surface in the same color.",
          "description":"Using the same paint as you did for the base coat, apply another layer using a sea sponge. Dip the sponge in water, then dip it in the paint. Dab the sponge over the entire surface of the object you are creating a marble effect on. Coat the sponge in water and paint again as needed. Try to avoid creating thick clumps of paint. The sea sponge will help create a texture similar to that of a true marble surface."
        },
        {
          "headline":"Create large “veins” using a slightly darker color.",
          "description":"The color you choose is up to you, though yellow or gray work well. Study real pieces of marble, either in person or online, so you know what the veins look like. Use a medium-sized paint brush to draw veins on top of the surface. They should look natural and random, rather than symmetrical or man-made. You don’t need to let the paint dry between coats and techniques because you will be blending the colors together. You may want to thin out the paint with water to create a more natural look."
        },
        {
          "headline":"Blend the veins with a sponge, then smooth them with a blending brush.",
          "description":"Get a clean sea sponge damp and dab it over the veins you created. This will help to blend the color and make it look more natural. A dry paintbrush can help even out the color and blend the veins even further. Brush it lightly back and forth over the surface to soften the look of the marble effect. If the brush becomes covered in paint, wipe it off or switch to a clean, dry brush."
        },
        {
          "headline":"Create smaller “veins” using a darker color.",
          "description":"Pick a color that is a few shades darker than you used to create the larger veins. Use a very small paintbrush to draw small veins across the surface of the object. Vary the width, length, and placement of the veins so it looks like natural marble. For instance, if you used white for the base coat and gray for the large veins, use black to create small veins."
        },
        {
          "headline":"Blend and smooth out these veins with a sponge and dry brush.",
          "description":"Use a damp sea sponge to blend out the fine lines. You could put a small amount of the base color on the sponge to help even out the look of the veins, if you want. Then, use a clean, dry blending brush to soften the veins. Repeat until you are happy with the marble effect. If you aren’t happy with the way a vein or section looks, dip a sponge in the base paint and cover it. Then, add new veins using the same method as before, if necessary. Don’t forget to blend them out!"
        },
        {
          "headline":"Allow the paint to dry for up to 16 hours.",
          "description":"Once you’re satisfied with the way the item looks, allow it to dry completely. This can take between 2 and 16 hours, depending on the type of paint you used.ase the drying time."
        },
        {
          "headline":"Seal the paint using polyurethane if you used latex or oil-based paint.",
          "description":"If you’ve created an acrylic painting on a canvas, you’re done and don’t need to seal it. If you painted a wooden surface, though, you’ll need to apply 2 coats of polyurethane. Choose a water-based polyurethane with a satin finish. Use a paintbrush to apply a thin layer over the entire surface. Allow the first coat to dry completely, which may take up to 2 hours. Then, apply a second coat."
        },
        {
          "headline":"Let the item dry for 24 hours.",
          "description":"Before you hang your painting or put items on your new “marble” surface, allow the paint and/or polyurethane time to dry completely. Avoid touching the surface or moving the object during this time."
        }
      ]
    },
    {
      "name":"Painting Marble Surfaces",
      "steps":[
        {
          "headline":"Work in a well-ventilated area and wear a respirator.",
          "description":"It’s important to have proper ventilation when sanding and painting so the dust and fumes don’t create respiratory issues. Open windows and doors or use a fan to circulate the air. You should also wear a respirator."
        },
        {
          "headline":"Lay out a drop cloth and mask areas you don’t want painted.",
          "description":"A drop cloth or old blanket will protect the floor from paint spills. You can use painter’s tape to secure the drop cloth and to mask any areas you don’t want painted, such as an electrical outlet or faucet spout."
        },
        {
          "headline":"Use 36-grit sandpaper to remove the finish from the marble.",
          "description":"Paint won’t stick to marble’s glossy finish, so it’s necessary to give it some texture. Rub 36-grit sandpaper back and forth over the surface you are going to paint to remove all of the finish. Keep sanding until there aren’t any glossy areas left. The marble should look dull and feel a little rough when you are finished."
        },
        {
          "headline":"Clean the surface with a damp tack cloth, then let it dry.",
          "description":"To remove the dust created by sanding, wipe down the area with a damp tack cloth. Rinse or replace the tack cloth as needed to remove all the dust and debris. Then, use a dry tack cloth to remove excess moisture. Wait until the surface is completely dry before moving on."
        },
        {
          "headline":"Prime the marble with an oil-based primer.",
          "description":"Be sure to select an oil-based primer, or the paint won’t stick to the surface of the marble. Use a paint brush or roller to thinly coat the entire surface of the area you want to paint. Use long, even strokes in the same direction to prime the marble."
        },
        {
          "headline":"Let the primer dry for 6-8 hours.",
          "description":"If you don’t let the primer dry fully, you may smear it and have to start the project over. Plan to do this project over several days so that the end result is exactly what you want."
        },
        {
          "headline":"Paint the surface using high-gloss oil-based paint.",
          "description":"Once the primer is dry, you can cover it in paint. Use a clean paint brush or roller to apply a thin, even layer of high-gloss oil-based paint in the color of your choice. Be sure to paint in the same direction, rather than doing some strokes up-and-down and others back-and-forth."
        },
        {
          "headline":"Allow each coat to dry for 16 hours.",
          "description":"After applying the first coat of paint, wait 16 hours or more before applying another coat. If you rush the job, the finish may bubble, smear, or become patchy."
        },
        {
          "headline":"Apply additional coats as needed.",
          "description":"You will definitely want to apply a second coat, and perhaps even a third or fourth, depending on the color you are painting and how it looks after each coat. Use the same method as before to apply additional layers, and remember to let each coat fully dry before moving on."
        },
        {
          "headline":"Let the paint cure for 7 days.",
          "description":"It’s important not to touch or set anything on the marble surface in the meantime. Otherwise, the items may stick to the surface and/or remove the paint."
        }
      ]
    }
  ],
  "text":" Creating a Marble Effect Choose a well-ventilated area and protect your workspace. If the item can be moved, you may want to take it outside or to a garage or patio. If it can’t be moved, open plenty of windows and doors and turn on fans to ventilate the area. You can also wear a respirator. To prevent drips from staining your floor, lay out a drop cloth or old blanket under the item. Use painter’s tape to mask any parts you don’t want to get paint on, such as a drawer pull. Paint the item a light color, then let it dry for up to 16 hours. Use a large paintbrush or roller to add a base coat in a light color, like white, cream, or silver. Paint the item using long, even strokes in the same direction. The type of paint you need depends on the object you are painting. If you’re working with a canvas, use acrylic paint. For wooden items, you can use latex or oil-based paint. Refer to the paint can to find out how long it takes to dry. Generally, latex paint needs to dry for about 4 hours, while oil-based paint may need up to 16 hours to dry fully. Acrylic paint dries in 1-2 hours. High humidity and low temperatures can increase the drying time. Use a damp sea sponge to cover the entire surface in the same color. Using the same paint as you did for the base coat, apply another layer using a sea sponge. Dip the sponge in water, then dip it in the paint. Dab the sponge over the entire surface of the object you are creating a marble effect on. Coat the sponge in water and paint again as needed. Try to avoid creating thick clumps of paint. The sea sponge will help create a texture similar to that of a true marble surface. Create large “veins” using a slightly darker color. The color you choose is up to you, though yellow or gray work well. Study real pieces of marble, either in person or online, so you know what the veins look like. Use a medium-sized paint brush to draw veins on top of the surface. They should look natural and random, rather than symmetrical or man-made. You don’t need to let the paint dry between coats and techniques because you will be blending the colors together. You may want to thin out the paint with water to create a more natural look. Blend the veins with a sponge, then smooth them with a blending brush. Get a clean sea sponge damp and dab it over the veins you created. This will help to blend the color and make it look more natural. A dry paintbrush can help even out the color and blend the veins even further. Brush it lightly back and forth over the surface to soften the look of the marble effect. If the brush becomes covered in paint, wipe it off or switch to a clean, dry brush. Create smaller “veins” using a darker color. Pick a color that is a few shades darker than you used to create the larger veins. Use a very small paintbrush to draw small veins across the surface of the object. Vary the width, length, and placement of the veins so it looks like natural marble. For instance, if you used white for the base coat and gray for the large veins, use black to create small veins. Blend and smooth out these veins with a sponge and dry brush. Use a damp sea sponge to blend out the fine lines. You could put a small amount of the base color on the sponge to help even out the look of the veins, if you want. Then, use a clean, dry blending brush to soften the veins. Repeat until you are happy with the marble effect. If you aren’t happy with the way a vein or section looks, dip a sponge in the base paint and cover it. Then, add new veins using the same method as before, if necessary. Don’t forget to blend them out! Allow the paint to dry for up to 16 hours. Once you’re satisfied with the way the item looks, allow it to dry completely. This can take between 2 and 16 hours, depending on the type of paint you used.ase the drying time. Seal the paint using polyurethane if you used latex or oil-based paint. If you’ve created an acrylic painting on a canvas, you’re done and don’t need to seal it. If you painted a wooden surface, though, you’ll need to apply 2 coats of polyurethane. Choose a water-based polyurethane with a satin finish. Use a paintbrush to apply a thin layer over the entire surface. Allow the first coat to dry completely, which may take up to 2 hours. Then, apply a second coat. Let the item dry for 24 hours. Before you hang your painting or put items on your new “marble” surface, allow the paint and/or polyurethane time to dry completely. Avoid touching the surface or moving the object during this time. Painting Marble Surfaces Work in a well-ventilated area and wear a respirator. It’s important to have proper ventilation when sanding and painting so the dust and fumes don’t create respiratory issues. Open windows and doors or use a fan to circulate the air. You should also wear a respirator. Lay out a drop cloth and mask areas you don’t want painted. A drop cloth or old blanket will protect the floor from paint spills. You can use painter’s tape to secure the drop cloth and to mask any areas you don’t want painted, such as an electrical outlet or faucet spout. Use 36-grit sandpaper to remove the finish from the marble. Paint won’t stick to marble’s glossy finish, so it’s necessary to give it some texture. Rub 36-grit sandpaper back and forth over the surface you are going to paint to remove all of the finish. Keep sanding until there aren’t any glossy areas left. The marble should look dull and feel a little rough when you are finished. Clean the surface with a damp tack cloth, then let it dry. To remove the dust created by sanding, wipe down the area with a damp tack cloth. Rinse or replace the tack cloth as needed to remove all the dust and debris. Then, use a dry tack cloth to remove excess moisture. Wait until the surface is completely dry before moving on. Prime the marble with an oil-based primer. Be sure to select an oil-based primer, or the paint won’t stick to the surface of the marble. Use a paint brush or roller to thinly coat the entire surface of the area you want to paint. Use long, even strokes in the same direction to prime the marble. Let the primer dry for 6-8 hours. If you don’t let the primer dry fully, you may smear it and have to start the project over. Plan to do this project over several days so that the end result is exactly what you want. Paint the surface using high-gloss oil-based paint. Once the primer is dry, you can cover it in paint. Use a clean paint brush or roller to apply a thin, even layer of high-gloss oil-based paint in the color of your choice. Be sure to paint in the same direction, rather than doing some strokes up-and-down and others back-and-forth. Allow each coat to dry for 16 hours. After applying the first coat of paint, wait 16 hours or more before applying another coat. If you rush the job, the finish may bubble, smear, or become patchy. Apply additional coats as needed. You will definitely want to apply a second coat, and perhaps even a third or fourth, depending on the color you are painting and how it looks after each coat. Use the same method as before to apply additional layers, and remember to let each coat fully dry before moving on. Let the paint cure for 7 days. It’s important not to touch or set anything on the marble surface in the meantime. Otherwise, the items may stick to the surface and/or remove the paint.",
  "sentences":[
    " Creating a Marble Effect Choose a well-ventilated area and protect your workspace.",
    "If the item can be moved, you may want to take it outside or to a garage or patio.",
    "If it can’t be moved, open plenty of windows and doors and turn on fans to ventilate the area.",
    "You can also wear a respirator.",
    "To prevent drips from staining your floor, lay out a drop cloth or old blanket under the item.",
    "Use painter’s tape to mask any parts you don’t want to get paint on, such as a drawer pull.",
    "Paint the item a light color, then let it dry for up to 16 hours.",
    "Use a large paintbrush or roller to add a base coat in a light color, like white, cream, or silver.",
    "Paint the item using long, even strokes in the same direction.",
    "The type of paint you need depends on the object you are painting.",
    "If you’re working with a canvas, use acrylic paint.",
    "For wooden items, you can use latex or oil-based paint.",
    "Refer to the paint can to find out how long it takes to dry.",
    "Generally, latex paint needs to dry for about 4 hours, while oil-based paint may need up to 16 hours to dry fully.",
    "Acrylic paint dries in 1-2 hours.",
    "High humidity and low temperatures can increase the drying time.",
    "Use a damp sea sponge to cover the entire surface in the same color.",
    "Using the same paint as you did for the base coat, apply another layer using a sea sponge.",
    "Dip the sponge in water, then dip it in the paint.",
    "Dab the sponge over the entire surface of the object you are creating a marble effect on.",
    "Coat the sponge in water and paint again as needed.",
    "Try to avoid creating thick clumps of paint.",
    "The sea sponge will help create a texture similar to that of a true marble surface.",
    "Create large “veins” using a slightly darker color.",
    "The color you choose is up to you, though yellow or gray work well.",
    "Study real pieces of marble, either in person or online, so you know what the veins look like.",
    "Use a medium-sized paint brush to draw veins on top of the surface.",
    "They should look natural and random, rather than symmetrical or man-made.",
    "You don’t need to let the paint dry between coats and techniques because you will be blending the colors together.",
    "You may want to thin out the paint with water to create a more natural look.",
    "Blend the veins with a sponge, then smooth them with a blending brush.",
    "Get a clean sea sponge damp and dab it over the veins you created.",
    "This will help to blend the color and make it look more natural.",
    "A dry paintbrush can help even out the color and blend the veins even further.",
    "Brush it lightly back and forth over the surface to soften the look of the marble effect.",
    "If the brush becomes covered in paint, wipe it off or switch to a clean, dry brush.",
    "Create smaller “veins” using a darker color.",
    "Pick a color that is a few shades darker than you used to create the larger veins.",
    "Use a very small paintbrush to draw small veins across the surface of the object.",
    "Vary the width, length, and placement of the veins so it looks like natural marble.",
    "For instance, if you used white for the base coat and gray for the large veins, use black to create small veins.",
    "Blend and smooth out these veins with a sponge and dry brush.",
    "Use a damp sea sponge to blend out the fine lines.",
    "You could put a small amount of the base color on the sponge to help even out the look of the veins, if you want.",
    "Then, use a clean, dry blending brush to soften the veins.",
    "Repeat until you are happy with the marble effect.",
    "If you aren’t happy with the way a vein or section looks, dip a sponge in the base paint and cover it.",
    "Then, add new veins using the same method as before, if necessary.",
    "Don’t forget to blend them out!",
    "Allow the paint to dry for up to 16 hours.",
    "Once you’re satisfied with the way the item looks, allow it to dry completely.",
    "This can take between 2 and 16 hours, depending on the type of paint you used.ase the drying time.",
    "Seal the paint using polyurethane if you used latex or oil-based paint.",
    "If you’ve created an acrylic painting on a canvas, you’re done and don’t need to seal it.",
    "If you painted a wooden surface, though, you’ll need to apply 2 coats of polyurethane.",
    "Choose a water-based polyurethane with a satin finish.",
    "Use a paintbrush to apply a thin layer over the entire surface.",
    "Allow the first coat to dry completely, which may take up to 2 hours.",
    "Then, apply a second coat.",
    "Let the item dry for 24 hours.",
    "Before you hang your painting or put items on your new “marble” surface, allow the paint and/or polyurethane time to dry completely.",
    "Avoid touching the surface or moving the object during this time.",
    "Painting Marble Surfaces Work in a well-ventilated area and wear a respirator.",
    "It’s important to have proper ventilation when sanding and painting so the dust and fumes don’t create respiratory issues.",
    "Open windows and doors or use a fan to circulate the air.",
    "You should also wear a respirator.",
    "Lay out a drop cloth and mask areas you don’t want painted.",
    "A drop cloth or old blanket will protect the floor from paint spills.",
    "You can use painter’s tape to secure the drop cloth and to mask any areas you don’t want painted, such as an electrical outlet or faucet spout.",
    "Use 36-grit sandpaper to remove the finish from the marble.",
    "Paint won’t stick to marble’s glossy finish, so it’s necessary to give it some texture.",
    "Rub 36-grit sandpaper back and forth over the surface you are going to paint to remove all of the finish.",
    "Keep sanding until there aren’t any glossy areas left.",
    "The marble should look dull and feel a little rough when you are finished.",
    "Clean the surface with a damp tack cloth, then let it dry.",
    "To remove the dust created by sanding, wipe down the area with a damp tack cloth.",
    "Rinse or replace the tack cloth as needed to remove all the dust and debris.",
    "Then, use a dry tack cloth to remove excess moisture.",
    "Wait until the surface is completely dry before moving on.",
    "Prime the marble with an oil-based primer.",
    "Be sure to select an oil-based primer, or the paint won’t stick to the surface of the marble.",
    "Use a paint brush or roller to thinly coat the entire surface of the area you want to paint.",
    "Use long, even strokes in the same direction to prime the marble.",
    "Let the primer dry for 6-8 hours.",
    "If you don’t let the primer dry fully, you may smear it and have to start the project over.",
    "Plan to do this project over several days so that the end result is exactly what you want.",
    "Paint the surface using high-gloss oil-based paint.",
    "Once the primer is dry, you can cover it in paint.",
    "Use a clean paint brush or roller to apply a thin, even layer of high-gloss oil-based paint in the color of your choice.",
    "Be sure to paint in the same direction, rather than doing some strokes up-and-down and others back-and-forth.",
    "Allow each coat to dry for 16 hours.",
    "After applying the first coat of paint, wait 16 hours or more before applying another coat.",
    "If you rush the job, the finish may bubble, smear, or become patchy.",
    "Apply additional coats as needed.",
    "You will definitely want to apply a second coat, and perhaps even a third or fourth, depending on the color you are painting and how it looks after each coat.",
    "Use the same method as before to apply additional layers, and remember to let each coat fully dry before moving on.",
    "Let the paint cure for 7 days.",
    "It’s important not to touch or set anything on the marble surface in the meantime.",
    "Otherwise, the items may stick to the surface and/or remove the paint."
  ],
  "tyn_section":[
    "Painter’s tape",
    "Drop cloth or old blanket",
    "Respirator",
    "Paint, in at least 3 colors",
    "Roller",
    "Paint brushes",
    "Sea sponges",
    "Dry blending brush",
    "Polyurethane",
    "36-grit sandpaper",
    "Tack cloths",
    "Oil-based primer",
    "Paintbrush or roller",
    "Semi-gloss or high-gloss oil-based paint"
  ],
  "tyn_model":[
    "paint",
    "sponge",
    "sea sponge",
    "polyurethane",
    "respirator",
    "drop cloth",
    "paintbrush",
    "water",
    "paint brush",
    "primer",
    "painter’s tape",
    "acrylic paint",
    "“veins",
    "” using",
    "blending brush",
    "36-grit sandpaper",
    "damp tack cloth",
    "oil-based primer",
    "high-gloss oil-based paint",
    "fans",
    "blanket",
    "paint can",
    "latex paint",
    "oil-based paint",
    "“marble",
    "” surface",
    "dry tack cloth"
  ],
  "simple_metrics":{
    "r":0.3571428571,
    "p":0.1851851852,
    "f1":0.243902439,
    "avg_pos":0.3703703704
  },
  "jacc_metrics_0.5":{
    "r":0.5714285714,
    "p":0.3333333333,
    "f1":0.4210526316
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7857142857,
    "p":0.6296296296,
    "f1":0.6990654206
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.2222222222,
    "f1":0.2926829268
  }
}