{
  "title":"How to Grill Brussel Sprouts",
  "url":"https://www.wikihow.com/Grill-Brussel-Sprouts",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Cruciferous Vegetables"
  ],
  "parts":[
    {
      "name":"Trimming and Seasoning the Brussels Sprouts",
      "steps":[
        {
          "headline":"Pick out sprouts that will hold up to grilling.",
          "description":"Brussels sprouts are delicate, which makes them prone to falling apart when cooked on intense heat. You can avoid this by selecting only the firmest and greenest from the bunch. Larger sprouts will also fare better on the grill, since they can shrink quite a bit. Avoid using sprouts that are yellowing, soft or squishy to the touch, or already coming unfurled. Be sure to prepare enough brussels sprouts for you and your guests. Roughly 4-5 sprouts will fit on each skewer."
        },
        {
          "headline":"Slice the ends off of the sprouts.",
          "description":"Use a sharp kitchen knife to cut off the stems and knobby bottoms, being careful not to damage the sprouts in the process. Only remove a thin slice from each end to make sure there's plenty left to eat. Don't halve or quarter the sprouts—they'll grill best when left whole. Bearing down too hard or using a dull knife may just mash the sprouts."
        },
        {
          "headline":"Microwave the sprouts on high for 3 minutes.",
          "description":"Transfer the trimmed sprouts to a microwave safe bowl and run just enough cool water over the tops to wet them. Then, place the bowl in the microwave. A preliminary heating will soften the tough sprouts just enough to make them easier to skewer. If you don't like using the microwave, you can also blanch the sprouts in a pot of boiling water for 3-5 minutes. The warm brussels sprouts will also soak up more flavorful oil and seasonings."
        },
        {
          "headline":"Let the sprouts cool.",
          "description":"Because they have such a high water content, they'll be quite hot when they first come out of the microwave or blanching pot. Leave them to sit for 2-3 minutes, then give one of the larger sprouts a light squeeze to test its temperature. The sprouts should be allowed to rest until most of the steam has dissipated and they're cool enough to handle comfortably."
        },
        {
          "headline":"Toss the sprouts in oil and your choice of seasonings.",
          "description":"Drizzle 2 tablespoons (29.6 ml) of olive oil over the warm sprouts and toss or mix by hand. Follow up with 1 teaspoon of kosher salt and ¼ teaspoon of coarse ground black pepper, along with any other herbs, spices, or other additives you think will enhance the flavor of the grilled sprouts. Cayenne pepper, minced garlic, onion powder, and red pepper flakes are all popular seasonings for jazzing up brussels sprouts and similar veggies. In addition to some of the more common cooking spices, you might also try incorporating sweet and zesty ingredients like honey, dijon mustard, or lemon zest. A lightweight metal mixing bowl will make tossing easier."
        }
      ]
    },
    {
      "name":"Cooking the Brussels Sprouts on the Grill",
      "steps":[
        {
          "headline":"Preheat the grill to a medium-high heat.",
          "description":"Fire up the grill and let it begin warming up as you finish getting the sprouts ready. A moderate temperature (somewhere around 350–425 °F (177–218 °C)) will sear the outside of the sprouts nicely. Be sure to light both burners or sides of the grill so that the heat stays consistent. Scrub the grill grate thoroughly with a wire brush prior to cooking to remove any leftover bits of charred food that might influence the flavor of the brussels sprouts. If you're cooking on a charcoal grill, go easy on the lighter fluid. The fumes can easily overpower mild ingredients."
        },
        {
          "headline":"Slide the brussels sprouts onto metal skewers.",
          "description":"Stick the point of the skewer through the soft center of the sprouts, making sure the stem-ends are all facing the same direction. Leave at least ⁄2 inch (1.3 cm) of space between each to give them a little room to breathe. Once you've loaded the skewer with 4-5 sprouts, start a new one. Orienting all of the sprouts the same way will help them cook more evenly on the grill. It's important that you only use metal skewers for grilling. Wooden skewers will simply burn up when exposed to an open flame."
        },
        {
          "headline":"Throw the skewers on the grill.",
          "description":"Lay out the sprouts across the grate with the stem-ends facing down. That way, they'll be taking the most direct heat and you won't have to worry about them falling apart. Spread the skewers out over the grill surface so they'll be easier to turn and remove once they're done cooking. If you situate the skewers so that they're running parallel to the grate, there's a chance they could slip down through the openings as they cook down. Grilling the sprouts directly on the grate results in a bolder flavor than wrapping them in foil or cooking them on one of the upper racks."
        },
        {
          "headline":"Cover and grill for about 5-10 minutes on each side.",
          "description":"Turn the skewers over after the first 5 minutes, when the sprouts have turned a deep green color and begun to lightly brown around the edges. Especially large or tough sprouts may require as long as 10 minutes per side to heat through. Exact cooking times may vary, depending on the size, texture, and number of the sprouts. Keep an eye on your brussels sprouts as they grill and use your best judgment to determine when they're done. As the sprouts cook, the coating of oil on the outside will cause them to caramelize, making them nice and crispy."
        }
      ]
    },
    {
      "name":"Serving Grilled Brussels Sprouts",
      "steps":[
        {
          "headline":"Allow the sprouts to cool before eating.",
          "description":"Remove the skewers from the grill with a pair of tongs and pile them on a separate clean plate. There will be a lot of heat trapped in between the layers, so wait a few minutes before you dig in. By the time you finish getting the rest of the meal together, the sprouts should have cooled down enough to eat. You can either leave the sprouts on the skewers to keep things simple, or scrape them off into a larger serving bowl that you can pass around the table."
        },
        {
          "headline":"Toss the sprouts in the remaining oil mixture.",
          "description":"To turn up the taste even more, dump the grilled sprouts back into their original mixing bowl and give them another toss. A second round will help collect more of the loose seasonings at the bottom of the bowl.The smooth oil will also provide a pleasant contrast with the crispy exterior of the sprouts. Finish with some freshly-grated shallots, a spritz of lemon juice or a sprinkle of Parmesan cheese."
        },
        {
          "headline":"Serve with your favorite grilled foods.",
          "description":"Flame-fired brussels sprouts pair perfectly with hearty grill staples like steaks, chicken, chops, or salmon. They'll also be right at home among the usual lineup of summer veggies, including corn on the cob and sliced tomatoes. They're such a versatile ingredient that you can't go wrong! Make your grilled brussels sprouts a featured dish in a vegan or vegetarian meal."
        }
      ]
    }
  ],
  "text":" Trimming and Seasoning the Brussels Sprouts Pick out sprouts that will hold up to grilling. Brussels sprouts are delicate, which makes them prone to falling apart when cooked on intense heat. You can avoid this by selecting only the firmest and greenest from the bunch. Larger sprouts will also fare better on the grill, since they can shrink quite a bit. Avoid using sprouts that are yellowing, soft or squishy to the touch, or already coming unfurled. Be sure to prepare enough brussels sprouts for you and your guests. Roughly 4-5 sprouts will fit on each skewer. Slice the ends off of the sprouts. Use a sharp kitchen knife to cut off the stems and knobby bottoms, being careful not to damage the sprouts in the process. Only remove a thin slice from each end to make sure there's plenty left to eat. Don't halve or quarter the sprouts—they'll grill best when left whole. Bearing down too hard or using a dull knife may just mash the sprouts. Microwave the sprouts on high for 3 minutes. Transfer the trimmed sprouts to a microwave safe bowl and run just enough cool water over the tops to wet them. Then, place the bowl in the microwave. A preliminary heating will soften the tough sprouts just enough to make them easier to skewer. If you don't like using the microwave, you can also blanch the sprouts in a pot of boiling water for 3-5 minutes. The warm brussels sprouts will also soak up more flavorful oil and seasonings. Let the sprouts cool. Because they have such a high water content, they'll be quite hot when they first come out of the microwave or blanching pot. Leave them to sit for 2-3 minutes, then give one of the larger sprouts a light squeeze to test its temperature. The sprouts should be allowed to rest until most of the steam has dissipated and they're cool enough to handle comfortably. Toss the sprouts in oil and your choice of seasonings. Drizzle 2 tablespoons (29.6 ml) of olive oil over the warm sprouts and toss or mix by hand. Follow up with 1 teaspoon of kosher salt and ¼ teaspoon of coarse ground black pepper, along with any other herbs, spices, or other additives you think will enhance the flavor of the grilled sprouts. Cayenne pepper, minced garlic, onion powder, and red pepper flakes are all popular seasonings for jazzing up brussels sprouts and similar veggies. In addition to some of the more common cooking spices, you might also try incorporating sweet and zesty ingredients like honey, dijon mustard, or lemon zest. A lightweight metal mixing bowl will make tossing easier. Cooking the Brussels Sprouts on the Grill Preheat the grill to a medium-high heat. Fire up the grill and let it begin warming up as you finish getting the sprouts ready. A moderate temperature (somewhere around 350–425 °F (177–218 °C)) will sear the outside of the sprouts nicely. Be sure to light both burners or sides of the grill so that the heat stays consistent. Scrub the grill grate thoroughly with a wire brush prior to cooking to remove any leftover bits of charred food that might influence the flavor of the brussels sprouts. If you're cooking on a charcoal grill, go easy on the lighter fluid. The fumes can easily overpower mild ingredients. Slide the brussels sprouts onto metal skewers. Stick the point of the skewer through the soft center of the sprouts, making sure the stem-ends are all facing the same direction. Leave at least ⁄2 inch (1.3 cm) of space between each to give them a little room to breathe. Once you've loaded the skewer with 4-5 sprouts, start a new one. Orienting all of the sprouts the same way will help them cook more evenly on the grill. It's important that you only use metal skewers for grilling. Wooden skewers will simply burn up when exposed to an open flame. Throw the skewers on the grill. Lay out the sprouts across the grate with the stem-ends facing down. That way, they'll be taking the most direct heat and you won't have to worry about them falling apart. Spread the skewers out over the grill surface so they'll be easier to turn and remove once they're done cooking. If you situate the skewers so that they're running parallel to the grate, there's a chance they could slip down through the openings as they cook down. Grilling the sprouts directly on the grate results in a bolder flavor than wrapping them in foil or cooking them on one of the upper racks. Cover and grill for about 5-10 minutes on each side. Turn the skewers over after the first 5 minutes, when the sprouts have turned a deep green color and begun to lightly brown around the edges. Especially large or tough sprouts may require as long as 10 minutes per side to heat through. Exact cooking times may vary, depending on the size, texture, and number of the sprouts. Keep an eye on your brussels sprouts as they grill and use your best judgment to determine when they're done. As the sprouts cook, the coating of oil on the outside will cause them to caramelize, making them nice and crispy. Serving Grilled Brussels Sprouts Allow the sprouts to cool before eating. Remove the skewers from the grill with a pair of tongs and pile them on a separate clean plate. There will be a lot of heat trapped in between the layers, so wait a few minutes before you dig in. By the time you finish getting the rest of the meal together, the sprouts should have cooled down enough to eat. You can either leave the sprouts on the skewers to keep things simple, or scrape them off into a larger serving bowl that you can pass around the table. Toss the sprouts in the remaining oil mixture. To turn up the taste even more, dump the grilled sprouts back into their original mixing bowl and give them another toss. A second round will help collect more of the loose seasonings at the bottom of the bowl.The smooth oil will also provide a pleasant contrast with the crispy exterior of the sprouts. Finish with some freshly-grated shallots, a spritz of lemon juice or a sprinkle of Parmesan cheese. Serve with your favorite grilled foods. Flame-fired brussels sprouts pair perfectly with hearty grill staples like steaks, chicken, chops, or salmon. They'll also be right at home among the usual lineup of summer veggies, including corn on the cob and sliced tomatoes. They're such a versatile ingredient that you can't go wrong! Make your grilled brussels sprouts a featured dish in a vegan or vegetarian meal.",
  "sentences":[
    " Trimming and Seasoning the Brussels Sprouts Pick out sprouts that will hold up to grilling.",
    "Brussels sprouts are delicate, which makes them prone to falling apart when cooked on intense heat.",
    "You can avoid this by selecting only the firmest and greenest from the bunch.",
    "Larger sprouts will also fare better on the grill, since they can shrink quite a bit.",
    "Avoid using sprouts that are yellowing, soft or squishy to the touch, or already coming unfurled.",
    "Be sure to prepare enough brussels sprouts for you and your guests.",
    "Roughly 4-5 sprouts will fit on each skewer.",
    "Slice the ends off of the sprouts.",
    "Use a sharp kitchen knife to cut off the stems and knobby bottoms, being careful not to damage the sprouts in the process.",
    "Only remove a thin slice from each end to make sure there's plenty left to eat.",
    "Don't halve or quarter the sprouts—they'll grill best when left whole.",
    "Bearing down too hard or using a dull knife may just mash the sprouts.",
    "Microwave the sprouts on high for 3 minutes.",
    "Transfer the trimmed sprouts to a microwave safe bowl and run just enough cool water over the tops to wet them.",
    "Then, place the bowl in the microwave.",
    "A preliminary heating will soften the tough sprouts just enough to make them easier to skewer.",
    "If you don't like using the microwave, you can also blanch the sprouts in a pot of boiling water for 3-5 minutes.",
    "The warm brussels sprouts will also soak up more flavorful oil and seasonings.",
    "Let the sprouts cool.",
    "Because they have such a high water content, they'll be quite hot when they first come out of the microwave or blanching pot.",
    "Leave them to sit for 2-3 minutes, then give one of the larger sprouts a light squeeze to test its temperature.",
    "The sprouts should be allowed to rest until most of the steam has dissipated and they're cool enough to handle comfortably.",
    "Toss the sprouts in oil and your choice of seasonings.",
    "Drizzle 2 tablespoons (29.6 ml) of olive oil over the warm sprouts and toss or mix by hand.",
    "Follow up with 1 teaspoon of kosher salt and ¼ teaspoon of coarse ground black pepper, along with any other herbs, spices, or other additives you think will enhance the flavor of the grilled sprouts.",
    "Cayenne pepper, minced garlic, onion powder, and red pepper flakes are all popular seasonings for jazzing up brussels sprouts and similar veggies.",
    "In addition to some of the more common cooking spices, you might also try incorporating sweet and zesty ingredients like honey, dijon mustard, or lemon zest.",
    "A lightweight metal mixing bowl will make tossing easier.",
    "Cooking the Brussels Sprouts on the Grill Preheat the grill to a medium-high heat.",
    "Fire up the grill and let it begin warming up as you finish getting the sprouts ready.",
    "A moderate temperature (somewhere around 350–425 °F (177–218 °C)) will sear the outside of the sprouts nicely.",
    "Be sure to light both burners or sides of the grill so that the heat stays consistent.",
    "Scrub the grill grate thoroughly with a wire brush prior to cooking to remove any leftover bits of charred food that might influence the flavor of the brussels sprouts.",
    "If you're cooking on a charcoal grill, go easy on the lighter fluid.",
    "The fumes can easily overpower mild ingredients.",
    "Slide the brussels sprouts onto metal skewers.",
    "Stick the point of the skewer through the soft center of the sprouts, making sure the stem-ends are all facing the same direction.",
    "Leave at least ⁄2 inch (1.3 cm) of space between each to give them a little room to breathe.",
    "Once you've loaded the skewer with 4-5 sprouts, start a new one.",
    "Orienting all of the sprouts the same way will help them cook more evenly on the grill.",
    "It's important that you only use metal skewers for grilling.",
    "Wooden skewers will simply burn up when exposed to an open flame.",
    "Throw the skewers on the grill.",
    "Lay out the sprouts across the grate with the stem-ends facing down.",
    "That way, they'll be taking the most direct heat and you won't have to worry about them falling apart.",
    "Spread the skewers out over the grill surface so they'll be easier to turn and remove once they're done cooking.",
    "If you situate the skewers so that they're running parallel to the grate, there's a chance they could slip down through the openings as they cook down.",
    "Grilling the sprouts directly on the grate results in a bolder flavor than wrapping them in foil or cooking them on one of the upper racks.",
    "Cover and grill for about 5-10 minutes on each side.",
    "Turn the skewers over after the first 5 minutes, when the sprouts have turned a deep green color and begun to lightly brown around the edges.",
    "Especially large or tough sprouts may require as long as 10 minutes per side to heat through.",
    "Exact cooking times may vary, depending on the size, texture, and number of the sprouts.",
    "Keep an eye on your brussels sprouts as they grill and use your best judgment to determine when they're done.",
    "As the sprouts cook, the coating of oil on the outside will cause them to caramelize, making them nice and crispy.",
    "Serving Grilled Brussels Sprouts Allow the sprouts to cool before eating.",
    "Remove the skewers from the grill with a pair of tongs and pile them on a separate clean plate.",
    "There will be a lot of heat trapped in between the layers, so wait a few minutes before you dig in.",
    "By the time you finish getting the rest of the meal together, the sprouts should have cooled down enough to eat.",
    "You can either leave the sprouts on the skewers to keep things simple, or scrape them off into a larger serving bowl that you can pass around the table.",
    "Toss the sprouts in the remaining oil mixture.",
    "To turn up the taste even more, dump the grilled sprouts back into their original mixing bowl and give them another toss.",
    "A second round will help collect more of the loose seasonings at the bottom of the bowl.The smooth oil will also provide a pleasant contrast with the crispy exterior of the sprouts.",
    "Finish with some freshly-grated shallots, a spritz of lemon juice or a sprinkle of Parmesan cheese.",
    "Serve with your favorite grilled foods.",
    "Flame-fired brussels sprouts pair perfectly with hearty grill staples like steaks, chicken, chops, or salmon.",
    "They'll also be right at home among the usual lineup of summer veggies, including corn on the cob and sliced tomatoes.",
    "They're such a versatile ingredient that you can't go wrong!",
    "Make your grilled brussels sprouts a featured dish in a vegan or vegetarian meal."
  ],
  "tyn_section":[
    "Gas or charcoal grill",
    "Sharp knife",
    "Cutting board",
    "Microwavable bowl or pot for blanching",
    "Metal skewers",
    "Mixing bowl",
    "Metal tongs",
    "Large plate or serving bowl"
  ],
  "tyn_model":[
    "grill",
    "skewers",
    "brussels sprouts",
    "oil",
    "microwave",
    "water",
    "bowl",
    "seasonings",
    "grilled sprouts",
    "mixing bowl",
    "sprouts",
    "kitchen knife",
    "—they'll",
    "knife",
    "microwave safe bowl",
    "olive oil",
    "kosher salt",
    "coarse ground black pepper",
    "cayenne pepper",
    "garlic",
    "onion powder",
    "red pepper",
    "honey",
    "dijon mustard",
    "lemon",
    "wire brush",
    "charcoal grill",
    "lighter fluid",
    "foil",
    "plate",
    "serving bowl",
    "shallots",
    "lemon juice",
    "parmesan cheese",
    "grilled foods",
    "salmon",
    "tomatoes",
    "grilled brussels sprouts"
  ],
  "simple_metrics":{
    "r":0.125,
    "p":0.0263157895,
    "f1":0.0434782609,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1315789474,
    "f1":0.2083333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.1842105263,
    "f1":0.2845528455
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.125,
    "p":0.0263157895,
    "f1":0.0434782609
  }
}