{
  "title":"How to Cook Bison Steak",
  "url":"https://www.wikihow.com/Cook-Bison-Steak",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb",
    "Steak Dishes"
  ],
  "methods":[
    {
      "name":"Grilling Bison Steak",
      "steps":[
        {
          "headline":"Season the steaks with garlic oil.",
          "description":"Mix together 2 cloves of minced garlic and 1 1/2 teaspoons (7.5 ml) of extra-virgin olive oil. Brush the garlic oil over 2 12-ounce (340 g) bison strip or ribeye steaks. Let the steaks sit out at room temperature while you prepare the grill. The steaks should be about 1.25 inches (3.2 cm) thick. If the steaks are thicker, you may need to add 2 to 4 minutes to the grilling time. If the steaks are thinner, reduce the grilling time by 1 to 2 minutes."
        },
        {
          "headline":"Heat a grill to medium-high heat.",
          "description":"Turn on a gas grill to medium-high or heat a chimney full of charcoal briquettes. Dump the hot coals in the center of the grill grate."
        },
        {
          "headline":"Season the steaks and lay them on the grill.",
          "description":"Sprinkle the steaks with salt and pepper according to your taste. Arrange them on the hot grill directly over the coals and cover the grill."
        },
        {
          "headline":"Grill the bison steaks for 4 to 5 minutes.",
          "description":"Cook the steaks for 4 minutes if you want rare steaks or 5 minutes for medium-rare steaks. The bottom of the steaks should be browned once they're ready to flip. Avoid cooking the steaks for more than 4 to 5 minutes or the steaks will become tough and chewy."
        },
        {
          "headline":"Flip and grill the steaks for 4 to 5 more minutes.",
          "description":"Remove the grill lid and use tongs or a spatula to flip the steaks over. Cover the grill and cook the steaks for 4 to 5 minutes for rare to medium-rare steaks."
        },
        {
          "headline":"Remove and rest the steaks for 5 minutes.",
          "description":"Transfer the grilled steaks to a cutting board or serving plates. Cover them loosely with aluminum foil and let them rest for 5 minutes."
        },
        {
          "headline":"Serve the grilled bison steaks.",
          "description":"Serve the hot steaks with your favorite grilled vegetables, rolls, or a green salad. Consider topping the steaks with your favorite steak sauce. Store the leftover grilled steaks in an airtight container in the refrigerator for 3 to 4 days."
        }
      ]
    },
    {
      "name":"Pan-Searing Bison Steak",
      "steps":[
        {
          "headline":"Heat a skillet over medium-high and season the bison steaks.",
          "description":"Place a cast-iron skillet on the stove and turn the burner to medium-high. Get out 2 bison filet mignon steaks that are between 1 inch (2.5 cm) and 2 inches (5.1 cm) thick. Sprinkle both sides with salt and pepper according to your taste."
        },
        {
          "headline":"Sear the steaks for 1 minute.",
          "description":"Lay the seasoned steaks in the hot skillet and cook them for 1 minute without moving them. They should quickly brown on the bottom."
        },
        {
          "headline":"Flip and sear the steaks for 1 more minute.",
          "description":"Use tongs or a spatula to flip the bison steaks over. Cook them on the other side so they brown on the bottom. Avoid moving them while they're searing."
        },
        {
          "headline":"Reduce the heat to medium-low and add the vinegar and wine.",
          "description":"Pour 1/4 cup (60 ml) of balsamic vinegar and 1/4 cup (60 ml) of dry red wine to the skillet with the steaks. Turn the heat down to medium-low. The liquid will quickly bubble up when you pour it in the pan."
        },
        {
          "headline":"Cover and pan-fry the steaks for 4 to 6 minutes.",
          "description":"Put a lid on the skillet and cook the steaks for 4 minutes, if you want rare steaks. For medium-rare steaks, cook them for up to 6 minutes. Since bison cooks up faster and it's leaner than beef, avoid cooking it until it's medium or well-done."
        },
        {
          "headline":"Flip and cook the steaks for 4 to 6 more minutes.",
          "description":"Remove the lid and use tongs or a spatula to flip the steaks over. Put the lid back on and cook them for another 4 to 6 minutes depending on how well done you want the steaks."
        },
        {
          "headline":"Rest the steaks for 5 minutes.",
          "description":"Turn off the burner and transfer the steaks to serving plates or a cutting board. Loosely cover the steaks with aluminum foil and rest them for 5 minutes."
        },
        {
          "headline":"Serve the bison filet mignon steaks.",
          "description":"Slice the steaks, if desired, or serve them whole on plates. Spoon the sauce from the pan over the steaks. Consider serving the steaks with crispy potatoes, steamed vegetables, or rolls. Refrigerate the leftover bison steaks in an airtight container for 3 to 4 days."
        }
      ]
    },
    {
      "name":"Bison Tenderloin with Herb Butter",
      "steps":[
        {
          "headline":"Combine the butter with the herb seasonings.",
          "description":"Place 6 tablespoons (84 g) of softened butter into a bowl and add 1 minced garlic clove along with 1 teaspoon (1 g) of chopped fresh tarragon, 1 teaspoon (1 g) of chopped fresh thyme, 1 teaspoon (1 g) chopped fresh parsley, and salt and pepper to taste. Use a spoon or spatula to mix the butter with the seasonings until they're combined. Cover the bowl with plastic wrap and refrigerate it. Keep the herb butter chilled while you prepare the bison steaks. You can make the butter ahead of time and refrigerate it for up to 1 week."
        },
        {
          "headline":"Preheat the oven to 350 °F (177 °C) and combine the steak seasonings.",
          "description":"Measure 2 teaspoons (10 g) of fine sea salt, 1⁄2 teaspoon (2 g) of citric acid, and ground pepper, according to your taste, into a small bowl. Stir the seasonings. Citric acid will tenderize the steaks without adding liquid. If you don't have citric acid, you could squirt a little lemon juice over the steaks once they've finished cooking. Keep in mind that they may not be as tender."
        },
        {
          "headline":"Sprinkle the seasoning over 4 bison steaks.",
          "description":"Get out 4 8-ounce (226 g) bison tenderloin filets that are 1.5 inches (3.8 cm) thick. Season both sides of each steak with the seasoning and set them aside while you heat a skillet."
        },
        {
          "headline":"Sear the bison steaks for 2 minutes over high heat.",
          "description":"Pour 2 tablespoons (30 ml) of canola oil into a cast-iron skillet and turn the burner to high. Once the oil shimmers and is hot, lay the bison steaks in the skillet. Cook the steaks for 2 minutes without turning them. They should brown on the bottom."
        },
        {
          "headline":"Flip and sear the steaks for 2 more minutes.",
          "description":"Use tongs or a spatula to flip the steaks over. Cook them on the other side so they brown. Turn off the burner. If you'd like medium-rare steaks, cook them for 1 extra minute. Avoid cooking the steaks longer than this or they can become tough or chewy."
        },
        {
          "headline":"Cook the steaks in the oven for 6 to 8 minutes.",
          "description":"Wear an oven mitt to transfer the cast-iron skillet with the steaks to the preheated oven. If you want the steaks to be rare, cook them for 6 minutes. For medium-rare steaks, cook them for 8 minutes. Avoid cooking the bison for more than 8 minutes because it can easily dry out and become tough."
        },
        {
          "headline":"Rest the steak for 5 minutes before serving it.",
          "description":"Remove the skillet from the oven and cover the steaks loosely with aluminum foil. Let the steaks rest for 5 minutes before you transfer them to serving plates. Top each steak with a spoonful of the chilled herb butter and serve them with roasted vegetables, rolls, or mashed potatoes. Store the leftover bison steaks in an airtight container in the refrigerator for 3 to 4 days."
        }
      ]
    }
  ],
  "text":" Grilling Bison Steak Season the steaks with garlic oil. Mix together 2 cloves of minced garlic and 1 1/2 teaspoons (7.5 ml) of extra-virgin olive oil. Brush the garlic oil over 2 12-ounce (340 g) bison strip or ribeye steaks. Let the steaks sit out at room temperature while you prepare the grill. The steaks should be about 1.25 inches (3.2 cm) thick. If the steaks are thicker, you may need to add 2 to 4 minutes to the grilling time. If the steaks are thinner, reduce the grilling time by 1 to 2 minutes. Heat a grill to medium-high heat. Turn on a gas grill to medium-high or heat a chimney full of charcoal briquettes. Dump the hot coals in the center of the grill grate. Season the steaks and lay them on the grill. Sprinkle the steaks with salt and pepper according to your taste. Arrange them on the hot grill directly over the coals and cover the grill. Grill the bison steaks for 4 to 5 minutes. Cook the steaks for 4 minutes if you want rare steaks or 5 minutes for medium-rare steaks. The bottom of the steaks should be browned once they're ready to flip. Avoid cooking the steaks for more than 4 to 5 minutes or the steaks will become tough and chewy. Flip and grill the steaks for 4 to 5 more minutes. Remove the grill lid and use tongs or a spatula to flip the steaks over. Cover the grill and cook the steaks for 4 to 5 minutes for rare to medium-rare steaks. Remove and rest the steaks for 5 minutes. Transfer the grilled steaks to a cutting board or serving plates. Cover them loosely with aluminum foil and let them rest for 5 minutes. Serve the grilled bison steaks. Serve the hot steaks with your favorite grilled vegetables, rolls, or a green salad. Consider topping the steaks with your favorite steak sauce. Store the leftover grilled steaks in an airtight container in the refrigerator for 3 to 4 days. Pan-Searing Bison Steak Heat a skillet over medium-high and season the bison steaks. Place a cast-iron skillet on the stove and turn the burner to medium-high. Get out 2 bison filet mignon steaks that are between 1 inch (2.5 cm) and 2 inches (5.1 cm) thick. Sprinkle both sides with salt and pepper according to your taste. Sear the steaks for 1 minute. Lay the seasoned steaks in the hot skillet and cook them for 1 minute without moving them. They should quickly brown on the bottom. Flip and sear the steaks for 1 more minute. Use tongs or a spatula to flip the bison steaks over. Cook them on the other side so they brown on the bottom. Avoid moving them while they're searing. Reduce the heat to medium-low and add the vinegar and wine. Pour 1/4 cup (60 ml) of balsamic vinegar and 1/4 cup (60 ml) of dry red wine to the skillet with the steaks. Turn the heat down to medium-low. The liquid will quickly bubble up when you pour it in the pan. Cover and pan-fry the steaks for 4 to 6 minutes. Put a lid on the skillet and cook the steaks for 4 minutes, if you want rare steaks. For medium-rare steaks, cook them for up to 6 minutes. Since bison cooks up faster and it's leaner than beef, avoid cooking it until it's medium or well-done. Flip and cook the steaks for 4 to 6 more minutes. Remove the lid and use tongs or a spatula to flip the steaks over. Put the lid back on and cook them for another 4 to 6 minutes depending on how well done you want the steaks. Rest the steaks for 5 minutes. Turn off the burner and transfer the steaks to serving plates or a cutting board. Loosely cover the steaks with aluminum foil and rest them for 5 minutes. Serve the bison filet mignon steaks. Slice the steaks, if desired, or serve them whole on plates. Spoon the sauce from the pan over the steaks. Consider serving the steaks with crispy potatoes, steamed vegetables, or rolls. Refrigerate the leftover bison steaks in an airtight container for 3 to 4 days. Bison Tenderloin with Herb Butter Combine the butter with the herb seasonings. Place 6 tablespoons (84 g) of softened butter into a bowl and add 1 minced garlic clove along with 1 teaspoon (1 g) of chopped fresh tarragon, 1 teaspoon (1 g) of chopped fresh thyme, 1 teaspoon (1 g) chopped fresh parsley, and salt and pepper to taste. Use a spoon or spatula to mix the butter with the seasonings until they're combined. Cover the bowl with plastic wrap and refrigerate it. Keep the herb butter chilled while you prepare the bison steaks. You can make the butter ahead of time and refrigerate it for up to 1 week. Preheat the oven to 350 °F (177 °C) and combine the steak seasonings. Measure 2 teaspoons (10 g) of fine sea salt, 1⁄2 teaspoon (2 g) of citric acid, and ground pepper, according to your taste, into a small bowl. Stir the seasonings. Citric acid will tenderize the steaks without adding liquid. If you don't have citric acid, you could squirt a little lemon juice over the steaks once they've finished cooking. Keep in mind that they may not be as tender. Sprinkle the seasoning over 4 bison steaks. Get out 4 8-ounce (226 g) bison tenderloin filets that are 1.5 inches (3.8 cm) thick. Season both sides of each steak with the seasoning and set them aside while you heat a skillet. Sear the bison steaks for 2 minutes over high heat. Pour 2 tablespoons (30 ml) of canola oil into a cast-iron skillet and turn the burner to high. Once the oil shimmers and is hot, lay the bison steaks in the skillet. Cook the steaks for 2 minutes without turning them. They should brown on the bottom. Flip and sear the steaks for 2 more minutes. Use tongs or a spatula to flip the steaks over. Cook them on the other side so they brown. Turn off the burner. If you'd like medium-rare steaks, cook them for 1 extra minute. Avoid cooking the steaks longer than this or they can become tough or chewy. Cook the steaks in the oven for 6 to 8 minutes. Wear an oven mitt to transfer the cast-iron skillet with the steaks to the preheated oven. If you want the steaks to be rare, cook them for 6 minutes. For medium-rare steaks, cook them for 8 minutes. Avoid cooking the bison for more than 8 minutes because it can easily dry out and become tough. Rest the steak for 5 minutes before serving it. Remove the skillet from the oven and cover the steaks loosely with aluminum foil. Let the steaks rest for 5 minutes before you transfer them to serving plates. Top each steak with a spoonful of the chilled herb butter and serve them with roasted vegetables, rolls, or mashed potatoes. Store the leftover bison steaks in an airtight container in the refrigerator for 3 to 4 days.",
  "sentences":[
    " Grilling Bison Steak Season the steaks with garlic oil.",
    "Mix together 2 cloves of minced garlic and 1 1/2 teaspoons (7.5 ml) of extra-virgin olive oil.",
    "Brush the garlic oil over 2 12-ounce (340 g) bison strip or ribeye steaks.",
    "Let the steaks sit out at room temperature while you prepare the grill.",
    "The steaks should be about 1.25 inches (3.2 cm) thick.",
    "If the steaks are thicker, you may need to add 2 to 4 minutes to the grilling time.",
    "If the steaks are thinner, reduce the grilling time by 1 to 2 minutes.",
    "Heat a grill to medium-high heat.",
    "Turn on a gas grill to medium-high or heat a chimney full of charcoal briquettes.",
    "Dump the hot coals in the center of the grill grate.",
    "Season the steaks and lay them on the grill.",
    "Sprinkle the steaks with salt and pepper according to your taste.",
    "Arrange them on the hot grill directly over the coals and cover the grill.",
    "Grill the bison steaks for 4 to 5 minutes.",
    "Cook the steaks for 4 minutes if you want rare steaks or 5 minutes for medium-rare steaks.",
    "The bottom of the steaks should be browned once they're ready to flip.",
    "Avoid cooking the steaks for more than 4 to 5 minutes or the steaks will become tough and chewy.",
    "Flip and grill the steaks for 4 to 5 more minutes.",
    "Remove the grill lid and use tongs or a spatula to flip the steaks over.",
    "Cover the grill and cook the steaks for 4 to 5 minutes for rare to medium-rare steaks.",
    "Remove and rest the steaks for 5 minutes.",
    "Transfer the grilled steaks to a cutting board or serving plates.",
    "Cover them loosely with aluminum foil and let them rest for 5 minutes.",
    "Serve the grilled bison steaks.",
    "Serve the hot steaks with your favorite grilled vegetables, rolls, or a green salad.",
    "Consider topping the steaks with your favorite steak sauce.",
    "Store the leftover grilled steaks in an airtight container in the refrigerator for 3 to 4 days.",
    "Pan-Searing Bison Steak Heat a skillet over medium-high and season the bison steaks.",
    "Place a cast-iron skillet on the stove and turn the burner to medium-high.",
    "Get out 2 bison filet mignon steaks that are between 1 inch (2.5 cm) and 2 inches (5.1 cm) thick.",
    "Sprinkle both sides with salt and pepper according to your taste.",
    "Sear the steaks for 1 minute.",
    "Lay the seasoned steaks in the hot skillet and cook them for 1 minute without moving them.",
    "They should quickly brown on the bottom.",
    "Flip and sear the steaks for 1 more minute.",
    "Use tongs or a spatula to flip the bison steaks over.",
    "Cook them on the other side so they brown on the bottom.",
    "Avoid moving them while they're searing.",
    "Reduce the heat to medium-low and add the vinegar and wine.",
    "Pour 1/4 cup (60 ml) of balsamic vinegar and 1/4 cup (60 ml) of dry red wine to the skillet with the steaks.",
    "Turn the heat down to medium-low.",
    "The liquid will quickly bubble up when you pour it in the pan.",
    "Cover and pan-fry the steaks for 4 to 6 minutes.",
    "Put a lid on the skillet and cook the steaks for 4 minutes, if you want rare steaks.",
    "For medium-rare steaks, cook them for up to 6 minutes.",
    "Since bison cooks up faster and it's leaner than beef, avoid cooking it until it's medium or well-done.",
    "Flip and cook the steaks for 4 to 6 more minutes.",
    "Remove the lid and use tongs or a spatula to flip the steaks over.",
    "Put the lid back on and cook them for another 4 to 6 minutes depending on how well done you want the steaks.",
    "Rest the steaks for 5 minutes.",
    "Turn off the burner and transfer the steaks to serving plates or a cutting board.",
    "Loosely cover the steaks with aluminum foil and rest them for 5 minutes.",
    "Serve the bison filet mignon steaks.",
    "Slice the steaks, if desired, or serve them whole on plates.",
    "Spoon the sauce from the pan over the steaks.",
    "Consider serving the steaks with crispy potatoes, steamed vegetables, or rolls.",
    "Refrigerate the leftover bison steaks in an airtight container for 3 to 4 days.",
    "Bison Tenderloin with Herb Butter Combine the butter with the herb seasonings.",
    "Place 6 tablespoons (84 g) of softened butter into a bowl and add 1 minced garlic clove along with 1 teaspoon (1 g) of chopped fresh tarragon, 1 teaspoon (1 g) of chopped fresh thyme, 1 teaspoon (1 g) chopped fresh parsley, and salt and pepper to taste.",
    "Use a spoon or spatula to mix the butter with the seasonings until they're combined.",
    "Cover the bowl with plastic wrap and refrigerate it.",
    "Keep the herb butter chilled while you prepare the bison steaks.",
    "You can make the butter ahead of time and refrigerate it for up to 1 week.",
    "Preheat the oven to 350 °F (177 °C) and combine the steak seasonings.",
    "Measure 2 teaspoons (10 g) of fine sea salt, 1⁄2 teaspoon (2 g) of citric acid, and ground pepper, according to your taste, into a small bowl.",
    "Stir the seasonings.",
    "Citric acid will tenderize the steaks without adding liquid.",
    "If you don't have citric acid, you could squirt a little lemon juice over the steaks once they've finished cooking.",
    "Keep in mind that they may not be as tender.",
    "Sprinkle the seasoning over 4 bison steaks.",
    "Get out 4 8-ounce (226 g) bison tenderloin filets that are 1.5 inches (3.8 cm) thick.",
    "Season both sides of each steak with the seasoning and set them aside while you heat a skillet.",
    "Sear the bison steaks for 2 minutes over high heat.",
    "Pour 2 tablespoons (30 ml) of canola oil into a cast-iron skillet and turn the burner to high.",
    "Once the oil shimmers and is hot, lay the bison steaks in the skillet.",
    "Cook the steaks for 2 minutes without turning them.",
    "They should brown on the bottom.",
    "Flip and sear the steaks for 2 more minutes.",
    "Use tongs or a spatula to flip the steaks over.",
    "Cook them on the other side so they brown.",
    "Turn off the burner.",
    "If you'd like medium-rare steaks, cook them for 1 extra minute.",
    "Avoid cooking the steaks longer than this or they can become tough or chewy.",
    "Cook the steaks in the oven for 6 to 8 minutes.",
    "Wear an oven mitt to transfer the cast-iron skillet with the steaks to the preheated oven.",
    "If you want the steaks to be rare, cook them for 6 minutes.",
    "For medium-rare steaks, cook them for 8 minutes.",
    "Avoid cooking the bison for more than 8 minutes because it can easily dry out and become tough.",
    "Rest the steak for 5 minutes before serving it.",
    "Remove the skillet from the oven and cover the steaks loosely with aluminum foil.",
    "Let the steaks rest for 5 minutes before you transfer them to serving plates.",
    "Top each steak with a spoonful of the chilled herb butter and serve them with roasted vegetables, rolls, or mashed potatoes.",
    "Store the leftover bison steaks in an airtight container in the refrigerator for 3 to 4 days."
  ],
  "tyn_section":[
    "Grilled Bison Steak",
    "Measuring cups and spoons",
    "Aluminum foil",
    "Gas or charcoal grill with briquettes",
    "Tongs or spatula",
    "Small bowl",
    "Pastry brush or spoon",
    "Knife and cutting board",
    "Pan-Seared Bison Steaks",
    "Cast-iron skillet with lid",
    "Serving plates",
    "Spoon",
    "Bowl",
    "Spoon or spatula",
    "Plastic wrap",
    "Cast-iron skillet",
    "Oven mitts"
  ],
  "tyn_model":[
    "grill",
    "skillet",
    "spatula",
    "butter",
    "oven",
    "salt and pepper",
    "aluminum foil",
    "airtight container",
    "cast-iron skillet",
    "burner",
    "herb butter",
    "citric acid",
    "garlic oil",
    "garlic",
    "refrigerator",
    "serving plates",
    "bowl",
    "seasonings",
    "extra-virgin olive oil",
    "bison strip or ribeye steaks",
    "gas grill",
    "grill grate",
    "cutting board or",
    "grilled vegetables",
    "green salad",
    "steak sauce",
    "stove",
    "bison filet mignon steaks",
    "vinegar",
    "wine",
    "balsamic vinegar",
    "dry red wine",
    "bison",
    "beef",
    "cutting board",
    "bison filet mignon",
    "plates",
    "bison steaks",
    "herb seasonings",
    "tarragon",
    "thyme",
    "fresh parsley",
    "plastic wrap",
    "steak seasonings",
    "fine sea salt",
    "ground pepper",
    "small bowl",
    "lemon",
    "canola oil",
    "oven mitt",
    "roasted vegetables",
    "mashed potatoes"
  ],
  "simple_metrics":{
    "r":0.3529411765,
    "p":0.1153846154,
    "f1":0.1739130435,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5882352941,
    "p":0.2115384615,
    "f1":0.3111739745
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8235294118,
    "p":0.3461538462,
    "f1":0.4874274662
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4117647059,
    "p":0.1346153846,
    "f1":0.2028985507
  }
}