{
  "title":"How to Draw a Dog Face",
  "url":"https://www.wikihow.com/Draw-a-Dog-Face",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "methods":[
    {
      "name":"Lots of Detail",
      "steps":[
        {
          "headline":"Draw a circular shape and two floppy ears.",
          "description":"Add also a vertical and horizontal line on the circular shape to serve as your guidelines. Make sure to use them as they will really help."
        },
        {
          "headline":"Draw the dog's nose.",
          "description":"Draw an upside down heart and a triangular shape with two cutout holes."
        },
        {
          "headline":"Draw the dog's eyes.",
          "description":"Remember to make the eyes as glossy as possible by drawing squiggly lines within his pupils."
        },
        {
          "headline":"Draw small details such as the little circles on his nose and then lines for his eyelids and ears.",
          "description":""
        },
        {
          "headline":"Draw his paws with a series of four rounded triangular shapes on the left and to the right side of his face.",
          "description":""
        },
        {
          "headline":"Draw the details of his paws and arms.",
          "description":""
        },
        {
          "headline":"Outline your drawing.",
          "description":"Use a black pen or marker to ink over your penciled sketch. After outlining your drawing, clean it up by erasing your penciled sketch and guidelines."
        },
        {
          "headline":"Color him with colors such as gray, dark gray, black or brown.",
          "description":""
        }
      ]
    },
    {
      "name":"Line Drawing",
      "steps":[
        {
          "headline":"Make a small stick figure in the center of your drawing area.",
          "description":"Add small legs but no arms."
        },
        {
          "headline":"Create three dots on each side of the stick figure.",
          "description":""
        },
        {
          "headline":"Draw a circle around the stick figure.",
          "description":"Make sure none of the stick's body parts or dots touch the circle."
        },
        {
          "headline":"Create two half circles attached to the top of the main circle.",
          "description":"These should be almost touching each other but not quite. They will be the eyes."
        },
        {
          "headline":"Draw a semi-circle around the eyes.",
          "description":"This will be the rest of the face."
        },
        {
          "headline":"Add two small dots in the center of the eyes for pupils.",
          "description":""
        },
        {
          "headline":"Draw some ears.",
          "description":"They can be floppy, pointy, however you want them!"
        },
        {
          "headline":"Don't forget the tongue, and the bow!",
          "description":""
        }
      ]
    }
  ],
  "text":" Lots of Detail Draw a circular shape and two floppy ears. Add also a vertical and horizontal line on the circular shape to serve as your guidelines. Make sure to use them as they will really help. Draw the dog's nose. Draw an upside down heart and a triangular shape with two cutout holes. Draw the dog's eyes. Remember to make the eyes as glossy as possible by drawing squiggly lines within his pupils. Draw small details such as the little circles on his nose and then lines for his eyelids and ears.  Draw his paws with a series of four rounded triangular shapes on the left and to the right side of his face.  Draw the details of his paws and arms.  Outline your drawing. Use a black pen or marker to ink over your penciled sketch. After outlining your drawing, clean it up by erasing your penciled sketch and guidelines. Color him with colors such as gray, dark gray, black or brown.  Line Drawing Make a small stick figure in the center of your drawing area. Add small legs but no arms. Create three dots on each side of the stick figure.  Draw a circle around the stick figure. Make sure none of the stick's body parts or dots touch the circle. Create two half circles attached to the top of the main circle. These should be almost touching each other but not quite. They will be the eyes. Draw a semi-circle around the eyes. This will be the rest of the face. Add two small dots in the center of the eyes for pupils.  Draw some ears. They can be floppy, pointy, however you want them! Don't forget the tongue, and the bow! ",
  "sentences":[
    " Lots of Detail Draw a circular shape and two floppy ears.",
    "Add also a vertical and horizontal line on the circular shape to serve as your guidelines.",
    "Make sure to use them as they will really help.",
    "Draw the dog's nose.",
    "Draw an upside down heart and a triangular shape with two cutout holes.",
    "Draw the dog's eyes.",
    "Remember to make the eyes as glossy as possible by drawing squiggly lines within his pupils.",
    "Draw small details such as the little circles on his nose and then lines for his eyelids and ears.",
    "Draw his paws with a series of four rounded triangular shapes on the left and to the right side of his face.",
    "Draw the details of his paws and arms.",
    "Outline your drawing.",
    "Use a black pen or marker to ink over your penciled sketch.",
    "After outlining your drawing, clean it up by erasing your penciled sketch and guidelines.",
    "Color him with colors such as gray, dark gray, black or brown.",
    "Line Drawing Make a small stick figure in the center of your drawing area.",
    "Add small legs but no arms.",
    "Create three dots on each side of the stick figure.",
    "Draw a circle around the stick figure.",
    "Make sure none of the stick's body parts or dots touch the circle.",
    "Create two half circles attached to the top of the main circle.",
    "These should be almost touching each other but not quite.",
    "They will be the eyes.",
    "Draw a semi-circle around the eyes.",
    "This will be the rest of the face.",
    "Add two small dots in the center of the eyes for pupils.",
    "Draw some ears.",
    "They can be floppy, pointy, however you want them!",
    "Don't forget the tongue, and the bow!"
  ],
  "tyn_section":[
    "Paper",
    "Pencil",
    "Eraser",
    "Colored pencils",
    "Ruler",
    "sharpener"
  ],
  "tyn_model":[
    "dog",
    "black pen",
    "marker",
    "ink",
    "tongue"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.0,
    "p":0.0,
    "f1":0
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0,
    "p":0.0,
    "f1":0
  }
}