{
  "title":"How to Prevent Stink Bugs",
  "url":"https://www.wikihow.com/Prevent-Stink-Bugs",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control"
  ],
  "methods":[
    {
      "name":"Keeping Bugs from Getting In",
      "steps":[
        {
          "headline":"Keep outdoor lighting to a minimum so you don't attract stink bugs.",
          "description":"Stink bugs are attracted to light, so you should avoid bright porch lights or other outdoor lighting. If stink bugs approach your home they are likely to eventually make their way inside. Use outdoor lights only when you need them, or consider purchasing a motion-detector light to eliminate the need for constant lighting during the night."
        },
        {
          "headline":"Squish stink bugs outside your home to drive away others.",
          "description":"If you see stink bugs in the area right outside your home, make a point of crushing a few of them. The smell emitted will serve as a warming for other stink bugs to flee. Avoid carrying the smell back into your home by crushing the bugs with a gloved hand and paper towel, or by placing a paper towel over the bug before stepping on it."
        },
        {
          "headline":"Rub your window screens with dryer sheets to repel them.",
          "description":"The smell of fragrant dryer sheets is unappealing to stink bugs. Rub a fragrant dryer sheet over the entire surface of your screen windows. The scent will catch on the mesh and ward off the bugs."
        },
        {
          "headline":"Fix any leaky faucets to reduce stink bug-attracting moisture.",
          "description":"Stink bugs are drawn to moisture, so do your best to prevent excess water in your home that might lure them in. Check all of your faucets to make sure that none of them are leaking. If they are, try fixing them yourself or call a plumber for assistance."
        },
        {
          "headline":"Fill small cracks on the outside of the building with urethane caulking.",
          "description":"Purchase a urethane caulking gun from a hardware store to repair cracks in concrete that are smaller than 0.25 inches (0.64 cm). Apply the caulking by drawing the tip of the gun down each crack, filling it completely. Repair small cracks in the building at least once a year. Wear gloves and old clothing while applying caulking, as it is very difficult to get off your hands and garments."
        },
        {
          "headline":"Repair large cracks with a backer rod and caulk.",
          "description":"If a crack in your concrete is large, use your hands to squeeze a piece of foam backer rod into the crack until it is 0.25 inches (0.64 cm) below the surface of the concrete. Using sharp scissors, cut open a tube of urethane caulk so that the opening is approximately as wide as the crack. Squeeze a line of caulk over the crack, then use the back of a spoon to smooth the caulk flush against the concrete."
        },
        {
          "headline":"Fix or replace damaged window screens to prevent access.",
          "description":"Holes in window screens can provide the perfect opening for stink bugs to crawl through. Use clear nail polish, glue, or screen material patches to repair small holes in a screen. If a screen is too damaged to repair properly, replace the entire screen to ensure that no bug get in."
        },
        {
          "headline":"Spray insecticide on your outside walls in September or October.",
          "description":"Purchase a bifenthrin insecticide spray from a hardware store to treat the outside of your home in the fall. Follow the directions on the label carefully and spray the liquid upwards on each wall. Since you will be spraying above you, wear goggles, a plastic poncho or jacket, and a hat or hood to protect yourself from the falling spray. To make things easier, opt to hire a professional pest control company to treat the outside of your home. Test the spray on a hidden corner of your home to see if it ruins the siding or paint before treating the whole house."
        },
        {
          "headline":"Make an outdoor trap with dish soap and water to kill stink bugs.",
          "description":"Fill a large bowl or tray with 1 tablespoon (15 ml) of dish soap and 10 cups (2.4 L) of water. Shine a bright lamp directly onto the trap to attract the stink bugs. They will crawl in and drown in the soapy water."
        },
        {
          "headline":"Hang a wet towel outside overnight to catch them.",
          "description":"Wet a towel with water and wring it out. Hang it outside overnight to attract the stink bugs in the area. In the morning you can dispose of the bugs that are stuck to the towel by dousing it in a basin of soapy water or by vacuuming them off."
        }
      ]
    },
    {
      "name":"Killing Stink Bugs",
      "steps":[
        {
          "headline":"Avoid squishing stink bugs.",
          "description":"If stinkbugs have made their way into your home, dispose of them without crushing them. Damage to their bodies will release their terrible odor, which will linger in your home. Be mindful of where you step if you see stink bugs in your home, and dispose of them as gently as possible."
        },
        {
          "headline":"Sweep up stink bugs and flush them down the toilet.",
          "description":"The simplest way to get rid of stink bugs is to carefully collect them and eliminate them without crushing them. Use a brush and dustpan to gently sweep up the bugs without harming them. Quickly shake out the bugs into your toilet and flush them immediately to get rid of them."
        },
        {
          "headline":"Use a bagged vacuum cleaner to suck up bugs, then dispose of the bag.",
          "description":"If you have a bagged vacuum cleaner, use it to suck up stink bugs and immediately dispose of the entire bag. If the bugs are harmed by the strong suction of the vacuum they will likely release their strong smell once they are trapped in the bag. Do not use any other type of vacuum, as the smell of the stink bugs may linger."
        },
        {
          "headline":"Spray bugs with a combination of soap, vinegar, and hot water.",
          "description":"Pour 1 cup (240 ml) of hot water into a spray bottle. Add 0.5 cups (120 ml) of white vinegar and 0.25 cups (59 ml) of dish soap, then shake the bottle gently to combine them. Spray the mixture directly onto stink bugs to kill them."
        }
      ]
    }
  ],
  "text":" Keeping Bugs from Getting In Keep outdoor lighting to a minimum so you don't attract stink bugs. Stink bugs are attracted to light, so you should avoid bright porch lights or other outdoor lighting. If stink bugs approach your home they are likely to eventually make their way inside. Use outdoor lights only when you need them, or consider purchasing a motion-detector light to eliminate the need for constant lighting during the night. Squish stink bugs outside your home to drive away others. If you see stink bugs in the area right outside your home, make a point of crushing a few of them. The smell emitted will serve as a warming for other stink bugs to flee. Avoid carrying the smell back into your home by crushing the bugs with a gloved hand and paper towel, or by placing a paper towel over the bug before stepping on it. Rub your window screens with dryer sheets to repel them. The smell of fragrant dryer sheets is unappealing to stink bugs. Rub a fragrant dryer sheet over the entire surface of your screen windows. The scent will catch on the mesh and ward off the bugs. Fix any leaky faucets to reduce stink bug-attracting moisture. Stink bugs are drawn to moisture, so do your best to prevent excess water in your home that might lure them in. Check all of your faucets to make sure that none of them are leaking. If they are, try fixing them yourself or call a plumber for assistance. Fill small cracks on the outside of the building with urethane caulking. Purchase a urethane caulking gun from a hardware store to repair cracks in concrete that are smaller than 0.25 inches (0.64 cm). Apply the caulking by drawing the tip of the gun down each crack, filling it completely. Repair small cracks in the building at least once a year. Wear gloves and old clothing while applying caulking, as it is very difficult to get off your hands and garments. Repair large cracks with a backer rod and caulk. If a crack in your concrete is large, use your hands to squeeze a piece of foam backer rod into the crack until it is 0.25 inches (0.64 cm) below the surface of the concrete. Using sharp scissors, cut open a tube of urethane caulk so that the opening is approximately as wide as the crack. Squeeze a line of caulk over the crack, then use the back of a spoon to smooth the caulk flush against the concrete. Fix or replace damaged window screens to prevent access. Holes in window screens can provide the perfect opening for stink bugs to crawl through. Use clear nail polish, glue, or screen material patches to repair small holes in a screen. If a screen is too damaged to repair properly, replace the entire screen to ensure that no bug get in. Spray insecticide on your outside walls in September or October. Purchase a bifenthrin insecticide spray from a hardware store to treat the outside of your home in the fall. Follow the directions on the label carefully and spray the liquid upwards on each wall. Since you will be spraying above you, wear goggles, a plastic poncho or jacket, and a hat or hood to protect yourself from the falling spray. To make things easier, opt to hire a professional pest control company to treat the outside of your home. Test the spray on a hidden corner of your home to see if it ruins the siding or paint before treating the whole house. Make an outdoor trap with dish soap and water to kill stink bugs. Fill a large bowl or tray with 1 tablespoon (15 ml) of dish soap and 10 cups (2.4 L) of water. Shine a bright lamp directly onto the trap to attract the stink bugs. They will crawl in and drown in the soapy water. Hang a wet towel outside overnight to catch them. Wet a towel with water and wring it out. Hang it outside overnight to attract the stink bugs in the area. In the morning you can dispose of the bugs that are stuck to the towel by dousing it in a basin of soapy water or by vacuuming them off. Killing Stink Bugs Avoid squishing stink bugs. If stinkbugs have made their way into your home, dispose of them without crushing them. Damage to their bodies will release their terrible odor, which will linger in your home. Be mindful of where you step if you see stink bugs in your home, and dispose of them as gently as possible. Sweep up stink bugs and flush them down the toilet. The simplest way to get rid of stink bugs is to carefully collect them and eliminate them without crushing them. Use a brush and dustpan to gently sweep up the bugs without harming them. Quickly shake out the bugs into your toilet and flush them immediately to get rid of them. Use a bagged vacuum cleaner to suck up bugs, then dispose of the bag. If you have a bagged vacuum cleaner, use it to suck up stink bugs and immediately dispose of the entire bag. If the bugs are harmed by the strong suction of the vacuum they will likely release their strong smell once they are trapped in the bag. Do not use any other type of vacuum, as the smell of the stink bugs may linger. Spray bugs with a combination of soap, vinegar, and hot water. Pour 1 cup (240 ml) of hot water into a spray bottle. Add 0.5 cups (120 ml) of white vinegar and 0.25 cups (59 ml) of dish soap, then shake the bottle gently to combine them. Spray the mixture directly onto stink bugs to kill them.",
  "sentences":[
    " Keeping Bugs from Getting In Keep outdoor lighting to a minimum so you don't attract stink bugs.",
    "Stink bugs are attracted to light, so you should avoid bright porch lights or other outdoor lighting.",
    "If stink bugs approach your home they are likely to eventually make their way inside.",
    "Use outdoor lights only when you need them, or consider purchasing a motion-detector light to eliminate the need for constant lighting during the night.",
    "Squish stink bugs outside your home to drive away others.",
    "If you see stink bugs in the area right outside your home, make a point of crushing a few of them.",
    "The smell emitted will serve as a warming for other stink bugs to flee.",
    "Avoid carrying the smell back into your home by crushing the bugs with a gloved hand and paper towel, or by placing a paper towel over the bug before stepping on it.",
    "Rub your window screens with dryer sheets to repel them.",
    "The smell of fragrant dryer sheets is unappealing to stink bugs.",
    "Rub a fragrant dryer sheet over the entire surface of your screen windows.",
    "The scent will catch on the mesh and ward off the bugs.",
    "Fix any leaky faucets to reduce stink bug-attracting moisture.",
    "Stink bugs are drawn to moisture, so do your best to prevent excess water in your home that might lure them in.",
    "Check all of your faucets to make sure that none of them are leaking.",
    "If they are, try fixing them yourself or call a plumber for assistance.",
    "Fill small cracks on the outside of the building with urethane caulking.",
    "Purchase a urethane caulking gun from a hardware store to repair cracks in concrete that are smaller than 0.25 inches (0.64 cm).",
    "Apply the caulking by drawing the tip of the gun down each crack, filling it completely.",
    "Repair small cracks in the building at least once a year.",
    "Wear gloves and old clothing while applying caulking, as it is very difficult to get off your hands and garments.",
    "Repair large cracks with a backer rod and caulk.",
    "If a crack in your concrete is large, use your hands to squeeze a piece of foam backer rod into the crack until it is 0.25 inches (0.64 cm) below the surface of the concrete.",
    "Using sharp scissors, cut open a tube of urethane caulk so that the opening is approximately as wide as the crack.",
    "Squeeze a line of caulk over the crack, then use the back of a spoon to smooth the caulk flush against the concrete.",
    "Fix or replace damaged window screens to prevent access.",
    "Holes in window screens can provide the perfect opening for stink bugs to crawl through.",
    "Use clear nail polish, glue, or screen material patches to repair small holes in a screen.",
    "If a screen is too damaged to repair properly, replace the entire screen to ensure that no bug get in.",
    "Spray insecticide on your outside walls in September or October.",
    "Purchase a bifenthrin insecticide spray from a hardware store to treat the outside of your home in the fall.",
    "Follow the directions on the label carefully and spray the liquid upwards on each wall.",
    "Since you will be spraying above you, wear goggles, a plastic poncho or jacket, and a hat or hood to protect yourself from the falling spray.",
    "To make things easier, opt to hire a professional pest control company to treat the outside of your home.",
    "Test the spray on a hidden corner of your home to see if it ruins the siding or paint before treating the whole house.",
    "Make an outdoor trap with dish soap and water to kill stink bugs.",
    "Fill a large bowl or tray with 1 tablespoon (15 ml) of dish soap and 10 cups (2.4 L) of water.",
    "Shine a bright lamp directly onto the trap to attract the stink bugs.",
    "They will crawl in and drown in the soapy water.",
    "Hang a wet towel outside overnight to catch them.",
    "Wet a towel with water and wring it out.",
    "Hang it outside overnight to attract the stink bugs in the area.",
    "In the morning you can dispose of the bugs that are stuck to the towel by dousing it in a basin of soapy water or by vacuuming them off.",
    "Killing Stink Bugs Avoid squishing stink bugs.",
    "If stinkbugs have made their way into your home, dispose of them without crushing them.",
    "Damage to their bodies will release their terrible odor, which will linger in your home.",
    "Be mindful of where you step if you see stink bugs in your home, and dispose of them as gently as possible.",
    "Sweep up stink bugs and flush them down the toilet.",
    "The simplest way to get rid of stink bugs is to carefully collect them and eliminate them without crushing them.",
    "Use a brush and dustpan to gently sweep up the bugs without harming them.",
    "Quickly shake out the bugs into your toilet and flush them immediately to get rid of them.",
    "Use a bagged vacuum cleaner to suck up bugs, then dispose of the bag.",
    "If you have a bagged vacuum cleaner, use it to suck up stink bugs and immediately dispose of the entire bag.",
    "If the bugs are harmed by the strong suction of the vacuum they will likely release their strong smell once they are trapped in the bag.",
    "Do not use any other type of vacuum, as the smell of the stink bugs may linger.",
    "Spray bugs with a combination of soap, vinegar, and hot water.",
    "Pour 1 cup (240 ml) of hot water into a spray bottle.",
    "Add 0.5 cups (120 ml) of white vinegar and 0.25 cups (59 ml) of dish soap, then shake the bottle gently to combine them.",
    "Spray the mixture directly onto stink bugs to kill them."
  ],
  "tyn_section":[
    "Keeping Bugs Away",
    "A urethane caulking gun",
    "A tube of urethane caulk",
    "Foam backer rod",
    "An old spoon",
    "Gloves",
    "Nail polish or glue",
    "Screen material patches",
    "Dryer sheets",
    "1 tablespoon (15 ml) of dish soap",
    "10 cups (2.4 L) of water",
    "A large towel",
    "Bifenthrin insecticide spray",
    "A plastic poncho or jacket",
    "A large bowl or tray",
    "A brush and dustpan",
    "A bagged vacuum",
    "1 cup (240 ml) of hot water",
    "A spray bottle",
    "0.5 cups (120 ml) of white vinegar",
    "0.25 cups (59 ml) of dish soap"
  ],
  "tyn_model":[
    "water",
    "stink bugs",
    "concrete",
    "dish soap",
    "paper towel",
    "dryer sheets",
    "urethane caulking",
    "caulk",
    "towel",
    "vacuum cleaner",
    "vacuum",
    "hot water",
    "outdoor lights",
    "dryer sheet",
    "caulking",
    "backer rod",
    "foam backer rod",
    "scissors",
    "urethane caulk",
    "spoon",
    "nail polish",
    "glue",
    "insecticide on",
    "bifenthrin insecticide spray",
    "goggles",
    "pest control company",
    "brush",
    "soap",
    "vinegar",
    "spray bottle",
    "white vinegar"
  ],
  "simple_metrics":{
    "r":0.1428571429,
    "p":0.0967741935,
    "f1":0.1153846154,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.2857142857,
    "p":0.2258064516,
    "f1":0.2522522523
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4761904762,
    "p":0.3870967742,
    "f1":0.4270462633
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.1904761905,
    "p":0.1612903226,
    "f1":0.1746724891
  }
}