{
  "title":"How to Eat Fenugreek Seeds",
  "url":"https://www.wikihow.com/Eat-Fenugreek-Seeds",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Eating Techniques"
  ],
  "methods":[
    {
      "name":"Eating Soaked Fenugreek Seeds",
      "steps":[
        {
          "headline":"Pour warm water on 1 cup (240 ml) of fenugreek seeds.",
          "description":"First, place the seeds in a bowl or other container. Then, pour the 1 cup (240 ml) of water over the seeds. The type of water you use does not matter. For example, you can use tap water or di\nFenugreek seeds are often eaten as a weight loss aid, as they are supposed to help digestion."
        },
        {
          "headline":"Allow the seeds to soak overnight.",
          "description":"You can leave the bowl of seeds out on the counter. It is a good idea to cover the bowl if you are worried about bugs or anything getting into the bowl throughout the night."
        },
        {
          "headline":"Filter out excess water from the seeds.",
          "description":"Pour the soaked bowl of seeds, including the water, into a strainer. You can then put the seeds into a storage container or bowl if you soaked more than 1 serving (about 1 cup (240 ml). Place the leftover seeds in the refrigerator. They will last for up to 5 days."
        },
        {
          "headline":"Eat the seeds on an empty stomach to aid weight loss.",
          "description":"If you’re eating the seeds to aid weight loss, it is best to eat on an empty stomach first thing in the morning. Simply eat the seeds raw directly out of the bowl. Eating about 1 cup (240 ml) of seeds is recommended. Repeat soaking and eating the seeds on a daily basis in order to notice weight loss."
        }
      ]
    },
    {
      "name":"Eating Sprouted Seeds",
      "steps":[
        {
          "headline":"Soak the seeds in 1 cup (240 ml) of warm water overnight.",
          "description":"Then, drain the excess water out of the bowl in the morning. You can use a strainer to remove the excess water."
        },
        {
          "headline":"Wrap the seeds in a damp cloth.",
          "description":"You can use any type of cloth, but a muslin cloth is ideal to use. Use warm water to dampen the cloth before folding the cloth around the seeds. Place the cloth in a location where it won’t be bothered."
        },
        {
          "headline":"Wait 3 to 4 days for the seeds to sprout.",
          "description":"Check on the seeds the day after you wrap them in the cloth. Typically, it will take a few days for the seeds to sprout. After 3 days, you can remove the seeds if you see that they’ve sprouted. You can rinse the seeds under water, but otherwise, they are ready to eat. Store the sprouts in the refrigerator for up to 1 week."
        },
        {
          "headline":"Add the sprouts to salad or eat them alone.",
          "description":"If you’re eating the sprouts to aid weight loss, it’s best to eat them first thing into the morning on an empty stomach. It’s also an option to add them to a salad if you don’t want to eat them alone. Simply toss the sprouted seeds into a salad and thoroughly mix them in with the other ingredients."
        }
      ]
    },
    {
      "name":"Adding Fenugreek to Meals",
      "steps":[
        {
          "headline":"Season side dishes with fenugreek powder.",
          "description":"You can use a seed grinder or food processor to grind up the seeds. Once the seeds have been turned into a fine powder, you can use them to flavor the side dish of your choice. Simply sprinkle the powder to add a slightly sweet and bitter taste to your meal. It’s also an option to use the powder to flavor meat. Store fenugreek powder by putting it into an airtight container. It will last up to 1 year."
        },
        {
          "headline":"Make a fenugreek paste to add to curry.",
          "description":"Use a seed grinder or food processor to grind up the seeds into a fine powder. Then, gradually add water to the powder until you create a paste. Mix the paste in with your curry to add a sweet touch to your meal."
        },
        {
          "headline":"Roast seeds for stir-fry dishes.",
          "description":"Put fenugreek seeds into a pan. Cook them on a medium-high heat setting for 1 to 2 minutes. Stir them during the 1 to 2 minutes. Then, allow them to cool and put 1 tablespoon (15 ml) over your favorite stir-fry dish. You can also sprinkle the seeds over curry or salad."
        }
      ]
    }
  ],
  "text":" Eating Soaked Fenugreek Seeds Pour warm water on 1 cup (240 ml) of fenugreek seeds. First, place the seeds in a bowl or other container. Then, pour the 1 cup (240 ml) of water over the seeds. The type of water you use does not matter. For example, you can use tap water or di\nFenugreek seeds are often eaten as a weight loss aid, as they are supposed to help digestion. Allow the seeds to soak overnight. You can leave the bowl of seeds out on the counter. It is a good idea to cover the bowl if you are worried about bugs or anything getting into the bowl throughout the night. Filter out excess water from the seeds. Pour the soaked bowl of seeds, including the water, into a strainer. You can then put the seeds into a storage container or bowl if you soaked more than 1 serving (about 1 cup (240 ml). Place the leftover seeds in the refrigerator. They will last for up to 5 days. Eat the seeds on an empty stomach to aid weight loss. If you’re eating the seeds to aid weight loss, it is best to eat on an empty stomach first thing in the morning. Simply eat the seeds raw directly out of the bowl. Eating about 1 cup (240 ml) of seeds is recommended. Repeat soaking and eating the seeds on a daily basis in order to notice weight loss. Eating Sprouted Seeds Soak the seeds in 1 cup (240 ml) of warm water overnight. Then, drain the excess water out of the bowl in the morning. You can use a strainer to remove the excess water. Wrap the seeds in a damp cloth. You can use any type of cloth, but a muslin cloth is ideal to use. Use warm water to dampen the cloth before folding the cloth around the seeds. Place the cloth in a location where it won’t be bothered. Wait 3 to 4 days for the seeds to sprout. Check on the seeds the day after you wrap them in the cloth. Typically, it will take a few days for the seeds to sprout. After 3 days, you can remove the seeds if you see that they’ve sprouted. You can rinse the seeds under water, but otherwise, they are ready to eat. Store the sprouts in the refrigerator for up to 1 week. Add the sprouts to salad or eat them alone. If you’re eating the sprouts to aid weight loss, it’s best to eat them first thing into the morning on an empty stomach. It’s also an option to add them to a salad if you don’t want to eat them alone. Simply toss the sprouted seeds into a salad and thoroughly mix them in with the other ingredients. Adding Fenugreek to Meals Season side dishes with fenugreek powder. You can use a seed grinder or food processor to grind up the seeds. Once the seeds have been turned into a fine powder, you can use them to flavor the side dish of your choice. Simply sprinkle the powder to add a slightly sweet and bitter taste to your meal. It’s also an option to use the powder to flavor meat. Store fenugreek powder by putting it into an airtight container. It will last up to 1 year. Make a fenugreek paste to add to curry. Use a seed grinder or food processor to grind up the seeds into a fine powder. Then, gradually add water to the powder until you create a paste. Mix the paste in with your curry to add a sweet touch to your meal. Roast seeds for stir-fry dishes. Put fenugreek seeds into a pan. Cook them on a medium-high heat setting for 1 to 2 minutes. Stir them during the 1 to 2 minutes. Then, allow them to cool and put 1 tablespoon (15 ml) over your favorite stir-fry dish. You can also sprinkle the seeds over curry or salad.",
  "sentences":[
    " Eating Soaked Fenugreek Seeds Pour warm water on 1 cup (240 ml) of fenugreek seeds.",
    "First, place the seeds in a bowl or other container.",
    "Then, pour the 1 cup (240 ml) of water over the seeds.",
    "The type of water you use does not matter.",
    "For example, you can use tap water or di\nFenugreek seeds are often eaten as a weight loss aid, as they are supposed to help digestion.",
    "Allow the seeds to soak overnight.",
    "You can leave the bowl of seeds out on the counter.",
    "It is a good idea to cover the bowl if you are worried about bugs or anything getting into the bowl throughout the night.",
    "Filter out excess water from the seeds.",
    "Pour the soaked bowl of seeds, including the water, into a strainer.",
    "You can then put the seeds into a storage container or bowl if you soaked more than 1 serving (about 1 cup (240 ml).",
    "Place the leftover seeds in the refrigerator.",
    "They will last for up to 5 days.",
    "Eat the seeds on an empty stomach to aid weight loss.",
    "If you’re eating the seeds to aid weight loss, it is best to eat on an empty stomach first thing in the morning.",
    "Simply eat the seeds raw directly out of the bowl.",
    "Eating about 1 cup (240 ml) of seeds is recommended.",
    "Repeat soaking and eating the seeds on a daily basis in order to notice weight loss.",
    "Eating Sprouted Seeds Soak the seeds in 1 cup (240 ml) of warm water overnight.",
    "Then, drain the excess water out of the bowl in the morning.",
    "You can use a strainer to remove the excess water.",
    "Wrap the seeds in a damp cloth.",
    "You can use any type of cloth, but a muslin cloth is ideal to use.",
    "Use warm water to dampen the cloth before folding the cloth around the seeds.",
    "Place the cloth in a location where it won’t be bothered.",
    "Wait 3 to 4 days for the seeds to sprout.",
    "Check on the seeds the day after you wrap them in the cloth.",
    "Typically, it will take a few days for the seeds to sprout.",
    "After 3 days, you can remove the seeds if you see that they’ve sprouted.",
    "You can rinse the seeds under water, but otherwise, they are ready to eat.",
    "Store the sprouts in the refrigerator for up to 1 week.",
    "Add the sprouts to salad or eat them alone.",
    "If you’re eating the sprouts to aid weight loss, it’s best to eat them first thing into the morning on an empty stomach.",
    "It’s also an option to add them to a salad if you don’t want to eat them alone.",
    "Simply toss the sprouted seeds into a salad and thoroughly mix them in with the other ingredients.",
    "Adding Fenugreek to Meals Season side dishes with fenugreek powder.",
    "You can use a seed grinder or food processor to grind up the seeds.",
    "Once the seeds have been turned into a fine powder, you can use them to flavor the side dish of your choice.",
    "Simply sprinkle the powder to add a slightly sweet and bitter taste to your meal.",
    "It’s also an option to use the powder to flavor meat.",
    "Store fenugreek powder by putting it into an airtight container.",
    "It will last up to 1 year.",
    "Make a fenugreek paste to add to curry.",
    "Use a seed grinder or food processor to grind up the seeds into a fine powder.",
    "Then, gradually add water to the powder until you create a paste.",
    "Mix the paste in with your curry to add a sweet touch to your meal.",
    "Roast seeds for stir-fry dishes.",
    "Put fenugreek seeds into a pan.",
    "Cook them on a medium-high heat setting for 1 to 2 minutes.",
    "Stir them during the 1 to 2 minutes.",
    "Then, allow them to cool and put 1 tablespoon (15 ml) over your favorite stir-fry dish.",
    "You can also sprinkle the seeds over curry or salad."
  ],
  "tyn_section":[
    "Soaking Fenugreek Seeds",
    "Fenugreek seeds",
    "Bowl",
    "Water",
    "Strainer",
    "Growing Sprouts from the Seeds",
    "Muslin cloth",
    "Jar",
    "Pan",
    "Seed grinder or food processor"
  ],
  "tyn_model":[
    "water",
    "bowl",
    "fenugreek seeds",
    "strainer",
    "refrigerator",
    "salad",
    "fenugreek powder",
    "seed grinder",
    "food processor",
    "curry",
    "muslin cloth",
    "fenugreek",
    "airtight container",
    "fenugreek paste",
    "pan",
    "stir-fry dish"
  ],
  "simple_metrics":{
    "r":0.6,
    "p":0.375,
    "f1":0.4615384615,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7,
    "p":0.4375,
    "f1":0.5384615385
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.6875,
    "f1":0.7394957983
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7,
    "p":0.375,
    "f1":0.488372093
  }
}