{
  "title":"How to Grill Avocado",
  "url":"https://www.wikihow.com/Grill-Avocado",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "parts":[
    {
      "name":"Prepping the Avocado",
      "steps":[
        {
          "headline":"Use a large, just ripe avocado.",
          "description":"Large avocados that are ripe but not too mushy are great for grilling as they will maintain their shape and not become too soft as they heat up. If you end up using a smaller avocado, you may grill more than one at a time so you have enough for a meal or to add to dishes."
        },
        {
          "headline":"Slice the avocado in half and remove the pit to grill it in the shell.",
          "description":"Use a sharp knife to cut the avocado in half, pressing the knife into the side of the avocado until you hit the pit. Open up the avocado at the cut and tap the pit with the sharp end of the knife. Then, twist the knife and remove the pit. Grilling avocado in its shell is a great way to serve it up with salsa or other sauces, especially if you plan to have it as a main dish."
        },
        {
          "headline":"Cut up the avocado to make grilled slices.",
          "description":"If you want avocado slices instead, remove the avocado from the shell with a spoon and use a sharp knife to cut the avocado up into 1 inch (2.5 cm) slices. Make sure the slices are evenly cut and thick enough to withstand the heat of the grill. Grilled slices of avocado are a good option if you are planning to add them to burgers, sandwiches, or salads."
        },
        {
          "headline":"Drizzle it with 1 tablespoon (15 ml) of fresh lime or lemon juice.",
          "description":"Add juice from a freshly cut lime or lemon to give the avocado some acidity and added flavor."
        },
        {
          "headline":"Brush the avocado with 1 tablespoon (15 ml) of olive oil.",
          "description":"Use a cooking brush or clean fingers to rub the olive oil on the avocado. If you are using sliced avocado, make sure you brush both sides of the avocado slices with the olive oil."
        },
        {
          "headline":"Add a pinch of chili powder for extra spice.",
          "description":"If you want the grilled avocado to have a bit of a kick, sprinkle chili powder on the avocado. Use chipotle powder or cayenne pepper for added spice if you do not have chili powder."
        }
      ]
    },
    {
      "name":"Grilling the Avocado",
      "steps":[
        {
          "headline":"Fire up the grill until it reaches 350 to 400 °F (177 to 204 °C).",
          "description":"Use a charcoal burning grill, if possible, as this adds smokiness to the avocado. A propane barbecue will also work well. Turn on the grill and let it heat up for several minutes until it reaches a medium high temperature."
        },
        {
          "headline":"Place the avocado shell side up on the grill and leave on for 3-4 minutes.",
          "description":"Lay the avocado over the hot coals under the grill, green flesh side down. Let it stay on the grill until it develops grill marks and turns slightly brown. Avocados that are smaller may grill more quickly and should be left on for 2-3 minutes."
        },
        {
          "headline":"Put the avocado slices on the grill for 2-3 minutes on each side.",
          "description":"Place the slices directly on the grill 1 to 2 inches (2.5 to 5.1 cm) apart and let them sit for 2-3 minutes. Then, use tongs to gently flip them over and let them grill for 2-3 minutes on the other side."
        },
        {
          "headline":"Remove the avocado from the grill and season with salt and pepper.",
          "description":"Use tongs to carefully move the avocado onto a plate. Then, sprinkle on a pinch of salt and pepper to season the grilled avocado. You can also squeeze a bit of lemon or lime juice onto the grilled avocado for added flavor."
        }
      ]
    },
    {
      "name":"Adding Grilled Avocado to Meals",
      "steps":[
        {
          "headline":"Put cheese and salsa in the grilled avocado shells.",
          "description":"Stuff the shells with shredded cheese and homemade salsa fresca, or store-bought salsa. You can also put Picante sauce or hot sauce in the shells and sprinkle chopped cilantro on top to finish them off. Serve the stuffed grilled avocado shells as a main dish."
        },
        {
          "headline":"Add grilled slices of avocado to a burger or a sandwich.",
          "description":"Put the grilled slices in a burger made on the grill or in a sandwich with bacon and tomato. You can also make the grilled avocado the star and put it in a sandwich with other vegetables."
        },
        {
          "headline":"Serve grilled avocado shells as a side with fish or chicken.",
          "description":"Grilled avocado pairs well with grilled chicken or fish. Add it to a meal as a savory side along with other fresh or grilled vegetables."
        },
        {
          "headline":"Add grilled slices of avocado to a salad.",
          "description":"For a bread-free option, put the grilled avocado over a bed of lettuce, kale, or arugula. Add cheese, nuts, and other fresh vegetables to the salad for a healthy, filling meal."
        }
      ]
    }
  ],
  "text":" Prepping the Avocado Use a large, just ripe avocado. Large avocados that are ripe but not too mushy are great for grilling as they will maintain their shape and not become too soft as they heat up. If you end up using a smaller avocado, you may grill more than one at a time so you have enough for a meal or to add to dishes. Slice the avocado in half and remove the pit to grill it in the shell. Use a sharp knife to cut the avocado in half, pressing the knife into the side of the avocado until you hit the pit. Open up the avocado at the cut and tap the pit with the sharp end of the knife. Then, twist the knife and remove the pit. Grilling avocado in its shell is a great way to serve it up with salsa or other sauces, especially if you plan to have it as a main dish. Cut up the avocado to make grilled slices. If you want avocado slices instead, remove the avocado from the shell with a spoon and use a sharp knife to cut the avocado up into 1 inch (2.5 cm) slices. Make sure the slices are evenly cut and thick enough to withstand the heat of the grill. Grilled slices of avocado are a good option if you are planning to add them to burgers, sandwiches, or salads. Drizzle it with 1 tablespoon (15 ml) of fresh lime or lemon juice. Add juice from a freshly cut lime or lemon to give the avocado some acidity and added flavor. Brush the avocado with 1 tablespoon (15 ml) of olive oil. Use a cooking brush or clean fingers to rub the olive oil on the avocado. If you are using sliced avocado, make sure you brush both sides of the avocado slices with the olive oil. Add a pinch of chili powder for extra spice. If you want the grilled avocado to have a bit of a kick, sprinkle chili powder on the avocado. Use chipotle powder or cayenne pepper for added spice if you do not have chili powder. Grilling the Avocado Fire up the grill until it reaches 350 to 400 °F (177 to 204 °C). Use a charcoal burning grill, if possible, as this adds smokiness to the avocado. A propane barbecue will also work well. Turn on the grill and let it heat up for several minutes until it reaches a medium high temperature. Place the avocado shell side up on the grill and leave on for 3-4 minutes. Lay the avocado over the hot coals under the grill, green flesh side down. Let it stay on the grill until it develops grill marks and turns slightly brown. Avocados that are smaller may grill more quickly and should be left on for 2-3 minutes. Put the avocado slices on the grill for 2-3 minutes on each side. Place the slices directly on the grill 1 to 2 inches (2.5 to 5.1 cm) apart and let them sit for 2-3 minutes. Then, use tongs to gently flip them over and let them grill for 2-3 minutes on the other side. Remove the avocado from the grill and season with salt and pepper. Use tongs to carefully move the avocado onto a plate. Then, sprinkle on a pinch of salt and pepper to season the grilled avocado. You can also squeeze a bit of lemon or lime juice onto the grilled avocado for added flavor. Adding Grilled Avocado to Meals Put cheese and salsa in the grilled avocado shells. Stuff the shells with shredded cheese and homemade salsa fresca, or store-bought salsa. You can also put Picante sauce or hot sauce in the shells and sprinkle chopped cilantro on top to finish them off. Serve the stuffed grilled avocado shells as a main dish. Add grilled slices of avocado to a burger or a sandwich. Put the grilled slices in a burger made on the grill or in a sandwich with bacon and tomato. You can also make the grilled avocado the star and put it in a sandwich with other vegetables. Serve grilled avocado shells as a side with fish or chicken. Grilled avocado pairs well with grilled chicken or fish. Add it to a meal as a savory side along with other fresh or grilled vegetables. Add grilled slices of avocado to a salad. For a bread-free option, put the grilled avocado over a bed of lettuce, kale, or arugula. Add cheese, nuts, and other fresh vegetables to the salad for a healthy, filling meal.",
  "sentences":[
    " Prepping the Avocado Use a large, just ripe avocado.",
    "Large avocados that are ripe but not too mushy are great for grilling as they will maintain their shape and not become too soft as they heat up.",
    "If you end up using a smaller avocado, you may grill more than one at a time so you have enough for a meal or to add to dishes.",
    "Slice the avocado in half and remove the pit to grill it in the shell.",
    "Use a sharp knife to cut the avocado in half, pressing the knife into the side of the avocado until you hit the pit.",
    "Open up the avocado at the cut and tap the pit with the sharp end of the knife.",
    "Then, twist the knife and remove the pit.",
    "Grilling avocado in its shell is a great way to serve it up with salsa or other sauces, especially if you plan to have it as a main dish.",
    "Cut up the avocado to make grilled slices.",
    "If you want avocado slices instead, remove the avocado from the shell with a spoon and use a sharp knife to cut the avocado up into 1 inch (2.5 cm) slices.",
    "Make sure the slices are evenly cut and thick enough to withstand the heat of the grill.",
    "Grilled slices of avocado are a good option if you are planning to add them to burgers, sandwiches, or salads.",
    "Drizzle it with 1 tablespoon (15 ml) of fresh lime or lemon juice.",
    "Add juice from a freshly cut lime or lemon to give the avocado some acidity and added flavor.",
    "Brush the avocado with 1 tablespoon (15 ml) of olive oil.",
    "Use a cooking brush or clean fingers to rub the olive oil on the avocado.",
    "If you are using sliced avocado, make sure you brush both sides of the avocado slices with the olive oil.",
    "Add a pinch of chili powder for extra spice.",
    "If you want the grilled avocado to have a bit of a kick, sprinkle chili powder on the avocado.",
    "Use chipotle powder or cayenne pepper for added spice if you do not have chili powder.",
    "Grilling the Avocado Fire up the grill until it reaches 350 to 400 °F (177 to 204 °C).",
    "Use a charcoal burning grill, if possible, as this adds smokiness to the avocado.",
    "A propane barbecue will also work well.",
    "Turn on the grill and let it heat up for several minutes until it reaches a medium high temperature.",
    "Place the avocado shell side up on the grill and leave on for 3-4 minutes.",
    "Lay the avocado over the hot coals under the grill, green flesh side down.",
    "Let it stay on the grill until it develops grill marks and turns slightly brown.",
    "Avocados that are smaller may grill more quickly and should be left on for 2-3 minutes.",
    "Put the avocado slices on the grill for 2-3 minutes on each side.",
    "Place the slices directly on the grill 1 to 2 inches (2.5 to 5.1 cm) apart and let them sit for 2-3 minutes.",
    "Then, use tongs to gently flip them over and let them grill for 2-3 minutes on the other side.",
    "Remove the avocado from the grill and season with salt and pepper.",
    "Use tongs to carefully move the avocado onto a plate.",
    "Then, sprinkle on a pinch of salt and pepper to season the grilled avocado.",
    "You can also squeeze a bit of lemon or lime juice onto the grilled avocado for added flavor.",
    "Adding Grilled Avocado to Meals Put cheese and salsa in the grilled avocado shells.",
    "Stuff the shells with shredded cheese and homemade salsa fresca, or store-bought salsa.",
    "You can also put Picante sauce or hot sauce in the shells and sprinkle chopped cilantro on top to finish them off.",
    "Serve the stuffed grilled avocado shells as a main dish.",
    "Add grilled slices of avocado to a burger or a sandwich.",
    "Put the grilled slices in a burger made on the grill or in a sandwich with bacon and tomato.",
    "You can also make the grilled avocado the star and put it in a sandwich with other vegetables.",
    "Serve grilled avocado shells as a side with fish or chicken.",
    "Grilled avocado pairs well with grilled chicken or fish.",
    "Add it to a meal as a savory side along with other fresh or grilled vegetables.",
    "Add grilled slices of avocado to a salad.",
    "For a bread-free option, put the grilled avocado over a bed of lettuce, kale, or arugula.",
    "Add cheese, nuts, and other fresh vegetables to the salad for a healthy, filling meal."
  ],
  "tyn_section":[
    "Sharp knife",
    "Grill",
    "Metal tongs"
  ],
  "tyn_model":[
    "avocado",
    "grill",
    "knife",
    "olive oil",
    "chili powder",
    "cheese",
    "salsa",
    "avocados",
    "spoon",
    "sharp knife",
    "fresh lime or lemon juice",
    "lemon",
    "cooking brush",
    "chipotle powder",
    "charcoal burning grill",
    "propane barbecue",
    "salt",
    "pepper",
    "plate",
    "salt and pepper",
    "shredded cheese",
    "salsa fresca",
    "picante sauce",
    "hot sauce",
    "grilled avocado",
    "salad",
    "lettuce",
    "kale",
    "arugula",
    "nuts"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.0666666667,
    "f1":0.1212121212,
    "avg_pos":0.3
  },
  "jacc_metrics_0.5":{
    "r":0.6666666667,
    "p":0.1,
    "f1":0.1739130435
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6666666667,
    "p":0.1333333333,
    "f1":0.2222222222
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.0666666667,
    "f1":0.1212121212
  }
}