{
  "title":"How to Use a Bissell Carpet Cleaner",
  "url":"https://www.wikihow.com/Use-a-Bissell-Carpet-Cleaner",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Cleaning Floors"
  ],
  "parts":[
    {
      "name":"Pretreating the Carpet",
      "steps":[
        {
          "headline":"Clear the area of any furniture.",
          "description":"Move any furniture off the carpet and out of the room, if possible. Give yourself plenty of room to maneuver and reach stains in tight spaces. Work around furniture you can’t move. Move the carpet cleaner around carefully to avoid leaving marks or scratches on the furniture."
        },
        {
          "headline":"Vacuum the carpet thoroughly to remove dirt.",
          "description":"Pretreat the carpet with your regular carpet vacuum. Make a few passes to remove as much dirt as possible. This prevents the dirt from being worked further into the carpeting later."
        },
        {
          "headline":"Treat heavily stained areas with a carpet shampoo (optional).",
          "description":"You can find bottles of carpet shampoo at any general store. Target areas that handle a lot of foot traffic as well as any deep stains you find. The shampoo is either sprayed onto the carpet directly or blotted on with a wet paper towel. You usually need to let the soap soak in for about 3 minutes before operating the carpet cleaner. Using only a carpet cleaner sometimes isn't enough to clean these areas, so a carpet shampoo can help lead to a spotless carpet. Read the instructions on the back of the bottle to find out how to use the shampoo."
        }
      ]
    },
    {
      "name":"Setting up the Cleaner",
      "steps":[
        {
          "headline":"Fill the water tank with hot water.",
          "description":"Detach the tank on the carpet cleaner’s front end. Make sure hot water is flowing from your sink’s faucet, then put the tank’s spout under it. The tank will have a line, about ¾ of the way up, indicating how far to fill it. For help locating and removing the cleaner’s tanks, consult your owner’s manual. Usually, all you have to do is lift up some plastic clips to free the tank."
        },
        {
          "headline":"Add carpet cleaning formula to the water tank.",
          "description":"Pick 1 of the many carpet cleaning formulas available at any general store. This is a special formula designed to work with the carpet cleaner, so it’s different from a carpet shampoo. The tank will have a second fill line above the first one. Pour the formula directly into the hot water until it reaches that line. Some cleaners have separate hot water and formula tanks. For these, fill the hot water tank full with water, then fill the formula tank to the fill lines with hot water and formula."
        },
        {
          "headline":"Set the cleaning dial if your cleaner has one.",
          "description":"Find the dial located on the front side of the cleaner, next to the tank. The dial will have settings for light, normal, and heavy cleanings. Depending on how dirty your carpeting is, select the correct setting and adjust it as you go."
        },
        {
          "headline":"Turn the tools dial to the floor cleaning option.",
          "description":"The tools dial is the large one on top of the water tank. Spin the dial until the marked arrow on it points down, towards the floor cleaning option. Your machine is now loaded and ready to go."
        }
      ]
    },
    {
      "name":"Cleaning the Carpet",
      "steps":[
        {
          "headline":"Flip on the power and heater buttons.",
          "description":"Plug the power cord into a nearby outlet, then locate the buttons on the cleaner's back. Press both buttons down to turn the machine on and activate its heating system."
        },
        {
          "headline":"Pull the handle’s trigger while moving the cleaner forward and back.",
          "description":"Pull the trigger to spray water onto the carpet. While holding the trigger, push the cleaner forward, then pull it back. Focus on cleaning small areas at a time by moving the cleaner forward as far as you can reach without walking."
        },
        {
          "headline":"Let go of the trigger to make a dry pass over the same area.",
          "description":"Go back over the same area, this time without pulling the trigger. Move the cleaner forward again, then pull it back to suction up the dirt and water. Continue doing this until no more water can be pulled up from the carpet. You can see this by watching the tank, since no more water will flow into it."
        },
        {
          "headline":"Continue cleaning until the water tank is full.",
          "description":"You may need to run the cleaner over heavily soiled areas again. Pull the trigger to spread more water and formula, then  try a stronger cleaning setting if it's needed. Move on to other areas, alternating between wet and dry passes to remove dirt."
        },
        {
          "headline":"Empty the water tank when it fills with dirty water.",
          "description":"As you use the cleaner, it sucks dirt and water into the tank next to the water tank you filled earlier. It also has a fill line showing its maximum capacity. Once the soiled water reaches this line, pour it out into the sink. The dirty water tank is attached to the clean water tank as 1 unit. Undo the plastic clips like you did earlier to detach the unit."
        },
        {
          "headline":"Refill the clean water tank to continue cleaning.",
          "description":"Run the hot water again. Using the guidelines, replenish the tank with water and formula. Your cleaner will be ready for action again. Depending on the size of your carpets, you will need to dump out the dirty water and refill the tank several times before you’re finished using the machine."
        },
        {
          "headline":"Attach a tool to the end of the hose to clean hard to reach areas.",
          "description":"Some carpet cleaners come with a hose and extra tools, such as a vacuum attachment. Slide the tool into the free end of the hose to tackle areas such as tight corners or stairs."
        },
        {
          "headline":"Set the tools dial before using the tools.",
          "description":"The tools dial is the large one you set to the floor cleaning option earlier. Spin the dial to point up towards you. This is the tools option, which switches the power settings from the floor cleaner to the hose. Use these tools to finish up the last of your carpet cleaning. The tools are useful for hard to reach areas such as corners and stairs. You don’t have to do this part last, but it’s usually easier to target the larger areas first and come back for the difficult spots."
        }
      ]
    }
  ],
  "text":" Pretreating the Carpet Clear the area of any furniture. Move any furniture off the carpet and out of the room, if possible. Give yourself plenty of room to maneuver and reach stains in tight spaces. Work around furniture you can’t move. Move the carpet cleaner around carefully to avoid leaving marks or scratches on the furniture. Vacuum the carpet thoroughly to remove dirt. Pretreat the carpet with your regular carpet vacuum. Make a few passes to remove as much dirt as possible. This prevents the dirt from being worked further into the carpeting later. Treat heavily stained areas with a carpet shampoo (optional). You can find bottles of carpet shampoo at any general store. Target areas that handle a lot of foot traffic as well as any deep stains you find. The shampoo is either sprayed onto the carpet directly or blotted on with a wet paper towel. You usually need to let the soap soak in for about 3 minutes before operating the carpet cleaner. Using only a carpet cleaner sometimes isn't enough to clean these areas, so a carpet shampoo can help lead to a spotless carpet. Read the instructions on the back of the bottle to find out how to use the shampoo. Setting up the Cleaner Fill the water tank with hot water. Detach the tank on the carpet cleaner’s front end. Make sure hot water is flowing from your sink’s faucet, then put the tank’s spout under it. The tank will have a line, about ¾ of the way up, indicating how far to fill it. For help locating and removing the cleaner’s tanks, consult your owner’s manual. Usually, all you have to do is lift up some plastic clips to free the tank. Add carpet cleaning formula to the water tank. Pick 1 of the many carpet cleaning formulas available at any general store. This is a special formula designed to work with the carpet cleaner, so it’s different from a carpet shampoo. The tank will have a second fill line above the first one. Pour the formula directly into the hot water until it reaches that line. Some cleaners have separate hot water and formula tanks. For these, fill the hot water tank full with water, then fill the formula tank to the fill lines with hot water and formula. Set the cleaning dial if your cleaner has one. Find the dial located on the front side of the cleaner, next to the tank. The dial will have settings for light, normal, and heavy cleanings. Depending on how dirty your carpeting is, select the correct setting and adjust it as you go. Turn the tools dial to the floor cleaning option. The tools dial is the large one on top of the water tank. Spin the dial until the marked arrow on it points down, towards the floor cleaning option. Your machine is now loaded and ready to go. Cleaning the Carpet Flip on the power and heater buttons. Plug the power cord into a nearby outlet, then locate the buttons on the cleaner's back. Press both buttons down to turn the machine on and activate its heating system. Pull the handle’s trigger while moving the cleaner forward and back. Pull the trigger to spray water onto the carpet. While holding the trigger, push the cleaner forward, then pull it back. Focus on cleaning small areas at a time by moving the cleaner forward as far as you can reach without walking. Let go of the trigger to make a dry pass over the same area. Go back over the same area, this time without pulling the trigger. Move the cleaner forward again, then pull it back to suction up the dirt and water. Continue doing this until no more water can be pulled up from the carpet. You can see this by watching the tank, since no more water will flow into it. Continue cleaning until the water tank is full. You may need to run the cleaner over heavily soiled areas again. Pull the trigger to spread more water and formula, then  try a stronger cleaning setting if it's needed. Move on to other areas, alternating between wet and dry passes to remove dirt. Empty the water tank when it fills with dirty water. As you use the cleaner, it sucks dirt and water into the tank next to the water tank you filled earlier. It also has a fill line showing its maximum capacity. Once the soiled water reaches this line, pour it out into the sink. The dirty water tank is attached to the clean water tank as 1 unit. Undo the plastic clips like you did earlier to detach the unit. Refill the clean water tank to continue cleaning. Run the hot water again. Using the guidelines, replenish the tank with water and formula. Your cleaner will be ready for action again. Depending on the size of your carpets, you will need to dump out the dirty water and refill the tank several times before you’re finished using the machine. Attach a tool to the end of the hose to clean hard to reach areas. Some carpet cleaners come with a hose and extra tools, such as a vacuum attachment. Slide the tool into the free end of the hose to tackle areas such as tight corners or stairs. Set the tools dial before using the tools. The tools dial is the large one you set to the floor cleaning option earlier. Spin the dial to point up towards you. This is the tools option, which switches the power settings from the floor cleaner to the hose. Use these tools to finish up the last of your carpet cleaning. The tools are useful for hard to reach areas such as corners and stairs. You don’t have to do this part last, but it’s usually easier to target the larger areas first and come back for the difficult spots.",
  "sentences":[
    " Pretreating the Carpet Clear the area of any furniture.",
    "Move any furniture off the carpet and out of the room, if possible.",
    "Give yourself plenty of room to maneuver and reach stains in tight spaces.",
    "Work around furniture you can’t move.",
    "Move the carpet cleaner around carefully to avoid leaving marks or scratches on the furniture.",
    "Vacuum the carpet thoroughly to remove dirt.",
    "Pretreat the carpet with your regular carpet vacuum.",
    "Make a few passes to remove as much dirt as possible.",
    "This prevents the dirt from being worked further into the carpeting later.",
    "Treat heavily stained areas with a carpet shampoo (optional).",
    "You can find bottles of carpet shampoo at any general store.",
    "Target areas that handle a lot of foot traffic as well as any deep stains you find.",
    "The shampoo is either sprayed onto the carpet directly or blotted on with a wet paper towel.",
    "You usually need to let the soap soak in for about 3 minutes before operating the carpet cleaner.",
    "Using only a carpet cleaner sometimes isn't enough to clean these areas, so a carpet shampoo can help lead to a spotless carpet.",
    "Read the instructions on the back of the bottle to find out how to use the shampoo.",
    "Setting up the Cleaner Fill the water tank with hot water.",
    "Detach the tank on the carpet cleaner’s front end.",
    "Make sure hot water is flowing from your sink’s faucet, then put the tank’s spout under it.",
    "The tank will have a line, about ¾ of the way up, indicating how far to fill it.",
    "For help locating and removing the cleaner’s tanks, consult your owner’s manual.",
    "Usually, all you have to do is lift up some plastic clips to free the tank.",
    "Add carpet cleaning formula to the water tank.",
    "Pick 1 of the many carpet cleaning formulas available at any general store.",
    "This is a special formula designed to work with the carpet cleaner, so it’s different from a carpet shampoo.",
    "The tank will have a second fill line above the first one.",
    "Pour the formula directly into the hot water until it reaches that line.",
    "Some cleaners have separate hot water and formula tanks.",
    "For these, fill the hot water tank full with water, then fill the formula tank to the fill lines with hot water and formula.",
    "Set the cleaning dial if your cleaner has one.",
    "Find the dial located on the front side of the cleaner, next to the tank.",
    "The dial will have settings for light, normal, and heavy cleanings.",
    "Depending on how dirty your carpeting is, select the correct setting and adjust it as you go.",
    "Turn the tools dial to the floor cleaning option.",
    "The tools dial is the large one on top of the water tank.",
    "Spin the dial until the marked arrow on it points down, towards the floor cleaning option.",
    "Your machine is now loaded and ready to go.",
    "Cleaning the Carpet Flip on the power and heater buttons.",
    "Plug the power cord into a nearby outlet, then locate the buttons on the cleaner's back.",
    "Press both buttons down to turn the machine on and activate its heating system.",
    "Pull the handle’s trigger while moving the cleaner forward and back.",
    "Pull the trigger to spray water onto the carpet.",
    "While holding the trigger, push the cleaner forward, then pull it back.",
    "Focus on cleaning small areas at a time by moving the cleaner forward as far as you can reach without walking.",
    "Let go of the trigger to make a dry pass over the same area.",
    "Go back over the same area, this time without pulling the trigger.",
    "Move the cleaner forward again, then pull it back to suction up the dirt and water.",
    "Continue doing this until no more water can be pulled up from the carpet.",
    "You can see this by watching the tank, since no more water will flow into it.",
    "Continue cleaning until the water tank is full.",
    "You may need to run the cleaner over heavily soiled areas again.",
    "Pull the trigger to spread more water and formula, then  try a stronger cleaning setting if it's needed.",
    "Move on to other areas, alternating between wet and dry passes to remove dirt.",
    "Empty the water tank when it fills with dirty water.",
    "As you use the cleaner, it sucks dirt and water into the tank next to the water tank you filled earlier.",
    "It also has a fill line showing its maximum capacity.",
    "Once the soiled water reaches this line, pour it out into the sink.",
    "The dirty water tank is attached to the clean water tank as 1 unit.",
    "Undo the plastic clips like you did earlier to detach the unit.",
    "Refill the clean water tank to continue cleaning.",
    "Run the hot water again.",
    "Using the guidelines, replenish the tank with water and formula.",
    "Your cleaner will be ready for action again.",
    "Depending on the size of your carpets, you will need to dump out the dirty water and refill the tank several times before you’re finished using the machine.",
    "Attach a tool to the end of the hose to clean hard to reach areas.",
    "Some carpet cleaners come with a hose and extra tools, such as a vacuum attachment.",
    "Slide the tool into the free end of the hose to tackle areas such as tight corners or stairs.",
    "Set the tools dial before using the tools.",
    "The tools dial is the large one you set to the floor cleaning option earlier.",
    "Spin the dial to point up towards you.",
    "This is the tools option, which switches the power settings from the floor cleaner to the hose.",
    "Use these tools to finish up the last of your carpet cleaning.",
    "The tools are useful for hard to reach areas such as corners and stairs.",
    "You don’t have to do this part last, but it’s usually easier to target the larger areas first and come back for the difficult spots."
  ],
  "tyn_section":[
    "Carpet cleaner",
    "Hot water",
    "Carpet shampoo",
    "Carpet cleaning formula",
    "Electrical outlet"
  ],
  "tyn_model":[
    "water",
    "cleaner",
    "carpet cleaner",
    "carpet shampoo",
    "hose",
    "tools",
    "shampoo",
    "hot water",
    "formula",
    "carpet vacuum",
    "carpet cleaning formula",
    "carpet cleaning formulas",
    "formula tank",
    "heater",
    "carpet cleaners",
    "vacuum attachment",
    "floor cleaner"
  ],
  "simple_metrics":{
    "r":0.8,
    "p":0.2352941176,
    "f1":0.3636363636,
    "avg_pos":0.1176470588
  },
  "jacc_metrics_0.5":{
    "r":0.8,
    "p":0.4705882353,
    "f1":0.5925925926
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.7058823529,
    "f1":0.75
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.8,
    "p":0.2352941176,
    "f1":0.3636363636
  }
}