{
  "title":"How to Measure Coffee",
  "url":"https://www.wikihow.com/Measure-Coffee",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee"
  ],
  "methods":[
    {
      "name":"Measuring with a Scale",
      "steps":[
        {
          "headline":"Buy a digital scale for more accurate measuring.",
          "description":"Although you can always measure out coffee with spoons, a digital scale leads to quality and consistency. Go online or visit a kitchen supply store near you, then select a scale that measures both grams and ounces. Measuring coffee without a scale is difficult because all coffee varies in weight. For example, a spoonful of dark roast coffee weighs less than a spoonful of light roast coffee."
        },
        {
          "headline":"Measure out the water.",
          "description":"Place a cup on the scale and hit the tare button to reset it. Pour out 6 fluid ounces (6.2 imp fl oz; 180 ml). This will be enough for a standard cup of coffee."
        },
        {
          "headline":"Measure the amount of coffee you will use.",
          "description":"Place another cup on the scale and reset it again. Add the coffee beans or grounds slowly until the scale reads .36 ounces (10 g). Coffee mugs are actually about 8 fluid ounces (8.3 imp fl oz; 240 ml). Add another .06 ounces (1.7 g) of coffee along with the extra 2 fluid ounces (2.1 imp fl oz; 59 ml) of water."
        },
        {
          "headline":"Grind the coffee if you are using beans.",
          "description":"Pick up a grinder at a local kitchen supply store or coffee shop to break down the beans easily. Grinders come in a variety of styles. Blade grinders are cheaper, but burr grinders can grind beans more finely to create stronger coffee. A blender, mortar and pestle, or hammer are a few common tools that can be used in place of a grinder."
        },
        {
          "headline":"Brew your coffee.",
          "description":"Do it the way you normally would. Using a machine works well since all you have to do is add the components. For other methods, such as a French press, you will have to boil the water on your own. For a French press, let the coffee steep in the water for 3 to 5 minutes before serving."
        }
      ]
    },
    {
      "name":"Using a Coffee Spoon",
      "steps":[
        {
          "headline":"Get a coffee spoon to roughly measure coffee.",
          "description":"Many kitchen supply stores sell coffee spoons. These scoops typically equal 2 tablespoons (29.6 ml), which is the average amount of coffee used in a standard cup. The downside is that all coffee has a different density, so you won’t always end up with exactly 2 tablespoons (29.57 ml). For example, a scoop of finely-ground coffee is less dense than a coarsely-ground coffee, which means less coffee in a scoop. Darker roasts are also less dense than lighter roasts."
        },
        {
          "headline":"Pour the water into a measuring cup.",
          "description":"To make this easy, use a kitchen measuring cup. They are available anywhere kitchen supplies are sold. Fill the cup ¾ full, which is about 177 milliliters (6  fl oz)."
        },
        {
          "headline":"Scoop the coffee with the coffee spoon.",
          "description":"Dip the spoon into the coffee grounds to scoop out a full 2 tablespoons (29.6 ml). If you don’t have a coffee spoon, you can use your regular kitchen measuring spoons. Add the grounds to your coffee machine or French press. If you’re using coffee beans, grind them first, then scoop 2 tablespoons of grounds. To make a mug of coffee, add another ⅓ tablespoon of grounds."
        },
        {
          "headline":"Brew the coffee as you normally would.",
          "description":"Add the ingredients to your coffee maker, then adjust them to get the strength of coffee you desire. After brewing, note the coffee’s taste so you can change the ratios next time to make it even better."
        }
      ]
    },
    {
      "name":"Perfecting the Coffee",
      "steps":[
        {
          "headline":"Multiply your measurements for more servings.",
          "description":"Once you know the ratio for a standard cup of coffee, making more servings is easy. Simply double the ingredients to make 2 cups of coffee instead of 1. Continue adding ingredients in proportion to make the amount of coffee you want. Use the coffee’s weight to quickly find out how much water to use. Measure the coffee’s weight in ounces using a scale, then multiply that number by 16. This tells you how many fluid ounces of water you need. For grams, multiply the coffee’s weight by 16.6945. This gives you the amount of cubic centimeters of water to use."
        },
        {
          "headline":"Add more grounds or beans for a stronger cup.",
          "description":"Everyone enjoys coffee in a different way, so the standard cup may taste weak to you. If this is the case, add some extra beans or a small scoop of grounds to your next brew. As long as you keep the amount of water the same, the coffee will come out stronger."
        },
        {
          "headline":"Use more water to make weaker coffee.",
          "description":"For weaker coffee, use the normal amount of grounds or beans. Add more water to dilute the taste. Keep track of how much water you add so that you can recreate the perfect cup of coffee after you figure out what ratio works best for you."
        },
        {
          "headline":"Experiment by using different coffee.",
          "description":"Coffee comes in a variety of flavors, so find the one that best suits your taste. Then change the amount of grounds, beans, or water you use to adjust the coffee’s strength. As long as you use a scale, you will be able to make your perfect cup of coffee every time."
        }
      ]
    }
  ],
  "text":" Measuring with a Scale Buy a digital scale for more accurate measuring. Although you can always measure out coffee with spoons, a digital scale leads to quality and consistency. Go online or visit a kitchen supply store near you, then select a scale that measures both grams and ounces. Measuring coffee without a scale is difficult because all coffee varies in weight. For example, a spoonful of dark roast coffee weighs less than a spoonful of light roast coffee. Measure out the water. Place a cup on the scale and hit the tare button to reset it. Pour out 6 fluid ounces (6.2 imp fl oz; 180 ml). This will be enough for a standard cup of coffee. Measure the amount of coffee you will use. Place another cup on the scale and reset it again. Add the coffee beans or grounds slowly until the scale reads .36 ounces (10 g). Coffee mugs are actually about 8 fluid ounces (8.3 imp fl oz; 240 ml). Add another .06 ounces (1.7 g) of coffee along with the extra 2 fluid ounces (2.1 imp fl oz; 59 ml) of water. Grind the coffee if you are using beans. Pick up a grinder at a local kitchen supply store or coffee shop to break down the beans easily. Grinders come in a variety of styles. Blade grinders are cheaper, but burr grinders can grind beans more finely to create stronger coffee. A blender, mortar and pestle, or hammer are a few common tools that can be used in place of a grinder. Brew your coffee. Do it the way you normally would. Using a machine works well since all you have to do is add the components. For other methods, such as a French press, you will have to boil the water on your own. For a French press, let the coffee steep in the water for 3 to 5 minutes before serving. Using a Coffee Spoon Get a coffee spoon to roughly measure coffee. Many kitchen supply stores sell coffee spoons. These scoops typically equal 2 tablespoons (29.6 ml), which is the average amount of coffee used in a standard cup. The downside is that all coffee has a different density, so you won’t always end up with exactly 2 tablespoons (29.57 ml). For example, a scoop of finely-ground coffee is less dense than a coarsely-ground coffee, which means less coffee in a scoop. Darker roasts are also less dense than lighter roasts. Pour the water into a measuring cup. To make this easy, use a kitchen measuring cup. They are available anywhere kitchen supplies are sold. Fill the cup ¾ full, which is about 177 milliliters (6  fl oz). Scoop the coffee with the coffee spoon. Dip the spoon into the coffee grounds to scoop out a full 2 tablespoons (29.6 ml). If you don’t have a coffee spoon, you can use your regular kitchen measuring spoons. Add the grounds to your coffee machine or French press. If you’re using coffee beans, grind them first, then scoop 2 tablespoons of grounds. To make a mug of coffee, add another ⅓ tablespoon of grounds. Brew the coffee as you normally would. Add the ingredients to your coffee maker, then adjust them to get the strength of coffee you desire. After brewing, note the coffee’s taste so you can change the ratios next time to make it even better. Perfecting the Coffee Multiply your measurements for more servings. Once you know the ratio for a standard cup of coffee, making more servings is easy. Simply double the ingredients to make 2 cups of coffee instead of 1. Continue adding ingredients in proportion to make the amount of coffee you want. Use the coffee’s weight to quickly find out how much water to use. Measure the coffee’s weight in ounces using a scale, then multiply that number by 16. This tells you how many fluid ounces of water you need. For grams, multiply the coffee’s weight by 16.6945. This gives you the amount of cubic centimeters of water to use. Add more grounds or beans for a stronger cup. Everyone enjoys coffee in a different way, so the standard cup may taste weak to you. If this is the case, add some extra beans or a small scoop of grounds to your next brew. As long as you keep the amount of water the same, the coffee will come out stronger. Use more water to make weaker coffee. For weaker coffee, use the normal amount of grounds or beans. Add more water to dilute the taste. Keep track of how much water you add so that you can recreate the perfect cup of coffee after you figure out what ratio works best for you. Experiment by using different coffee. Coffee comes in a variety of flavors, so find the one that best suits your taste. Then change the amount of grounds, beans, or water you use to adjust the coffee’s strength. As long as you use a scale, you will be able to make your perfect cup of coffee every time.",
  "sentences":[
    " Measuring with a Scale Buy a digital scale for more accurate measuring.",
    "Although you can always measure out coffee with spoons, a digital scale leads to quality and consistency.",
    "Go online or visit a kitchen supply store near you, then select a scale that measures both grams and ounces.",
    "Measuring coffee without a scale is difficult because all coffee varies in weight.",
    "For example, a spoonful of dark roast coffee weighs less than a spoonful of light roast coffee.",
    "Measure out the water.",
    "Place a cup on the scale and hit the tare button to reset it.",
    "Pour out 6 fluid ounces (6.2 imp fl oz; 180 ml).",
    "This will be enough for a standard cup of coffee.",
    "Measure the amount of coffee you will use.",
    "Place another cup on the scale and reset it again.",
    "Add the coffee beans or grounds slowly until the scale reads .36 ounces (10 g).",
    "Coffee mugs are actually about 8 fluid ounces (8.3 imp fl oz; 240 ml).",
    "Add another .06 ounces (1.7 g) of coffee along with the extra 2 fluid ounces (2.1 imp fl oz; 59 ml) of water.",
    "Grind the coffee if you are using beans.",
    "Pick up a grinder at a local kitchen supply store or coffee shop to break down the beans easily.",
    "Grinders come in a variety of styles.",
    "Blade grinders are cheaper, but burr grinders can grind beans more finely to create stronger coffee.",
    "A blender, mortar and pestle, or hammer are a few common tools that can be used in place of a grinder.",
    "Brew your coffee.",
    "Do it the way you normally would.",
    "Using a machine works well since all you have to do is add the components.",
    "For other methods, such as a French press, you will have to boil the water on your own.",
    "For a French press, let the coffee steep in the water for 3 to 5 minutes before serving.",
    "Using a Coffee Spoon Get a coffee spoon to roughly measure coffee.",
    "Many kitchen supply stores sell coffee spoons.",
    "These scoops typically equal 2 tablespoons (29.6 ml), which is the average amount of coffee used in a standard cup.",
    "The downside is that all coffee has a different density, so you won’t always end up with exactly 2 tablespoons (29.57 ml).",
    "For example, a scoop of finely-ground coffee is less dense than a coarsely-ground coffee, which means less coffee in a scoop.",
    "Darker roasts are also less dense than lighter roasts.",
    "Pour the water into a measuring cup.",
    "To make this easy, use a kitchen measuring cup.",
    "They are available anywhere kitchen supplies are sold.",
    "Fill the cup ¾ full, which is about 177 milliliters (6  fl oz).",
    "Scoop the coffee with the coffee spoon.",
    "Dip the spoon into the coffee grounds to scoop out a full 2 tablespoons (29.6 ml).",
    "If you don’t have a coffee spoon, you can use your regular kitchen measuring spoons.",
    "Add the grounds to your coffee machine or French press.",
    "If you’re using coffee beans, grind them first, then scoop 2 tablespoons of grounds.",
    "To make a mug of coffee, add another ⅓ tablespoon of grounds.",
    "Brew the coffee as you normally would.",
    "Add the ingredients to your coffee maker, then adjust them to get the strength of coffee you desire.",
    "After brewing, note the coffee’s taste so you can change the ratios next time to make it even better.",
    "Perfecting the Coffee Multiply your measurements for more servings.",
    "Once you know the ratio for a standard cup of coffee, making more servings is easy.",
    "Simply double the ingredients to make 2 cups of coffee instead of 1.",
    "Continue adding ingredients in proportion to make the amount of coffee you want.",
    "Use the coffee’s weight to quickly find out how much water to use.",
    "Measure the coffee’s weight in ounces using a scale, then multiply that number by 16.",
    "This tells you how many fluid ounces of water you need.",
    "For grams, multiply the coffee’s weight by 16.6945.",
    "This gives you the amount of cubic centimeters of water to use.",
    "Add more grounds or beans for a stronger cup.",
    "Everyone enjoys coffee in a different way, so the standard cup may taste weak to you.",
    "If this is the case, add some extra beans or a small scoop of grounds to your next brew.",
    "As long as you keep the amount of water the same, the coffee will come out stronger.",
    "Use more water to make weaker coffee.",
    "For weaker coffee, use the normal amount of grounds or beans.",
    "Add more water to dilute the taste.",
    "Keep track of how much water you add so that you can recreate the perfect cup of coffee after you figure out what ratio works best for you.",
    "Experiment by using different coffee.",
    "Coffee comes in a variety of flavors, so find the one that best suits your taste.",
    "Then change the amount of grounds, beans, or water you use to adjust the coffee’s strength.",
    "As long as you use a scale, you will be able to make your perfect cup of coffee every time."
  ],
  "tyn_section":[
    "Scale",
    "2 clean cups",
    "Coffee machine or French press",
    "Coffee spoon or measuring spoon",
    "Measuring cup"
  ],
  "tyn_model":[
    "water",
    "coffee",
    "scale",
    "coffee spoon",
    "french press",
    "coffee beans",
    "grinder",
    "grounds",
    "coffee mugs",
    "grinders",
    "blender",
    "mortar",
    "hammer",
    "machine",
    "coffee spoons",
    "measuring cup",
    "spoon",
    "coffee grounds",
    "coffee machine",
    "⅓ tablespoon",
    "coffee maker"
  ],
  "simple_metrics":{
    "r":0.4,
    "p":0.0952380952,
    "f1":0.1538461538,
    "avg_pos":0.0952380952
  },
  "jacc_metrics_0.5":{
    "r":0.6,
    "p":0.1428571429,
    "f1":0.2307692308
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8,
    "p":0.2380952381,
    "f1":0.3669724771
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4,
    "p":0.0952380952,
    "f1":0.1538461538
  }
}