{
  "title":"How to Make Corn Fritters",
  "url":"https://www.wikihow.com/Make-Corn-Fritters",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals"
  ],
  "methods":[
    {
      "name":"Pan-Fried Corn Fritters",
      "steps":[
        {
          "headline":"Sift the corn flour, flour, baking powder, salt, ground coriander and cumin into a bowl.",
          "description":"To do this, place the ingredients in a sieve over a bowl and then gently run a spoon along the bottom of the sieve to gently move the ingredients into the bowl. This recipe makes 4 servings or around 24 fritters."
        },
        {
          "headline":"Add the egg.",
          "description":"Break an egg into the mixture and whisk it together to incorporate the egg. You're on your way to making the batter."
        },
        {
          "headline":"Add a few drops of lemon juice and water.",
          "description":"Just squeeze a lemon slice into the mixture and then pour the water in. If the mixture is still too thick, you can add more water to thin it out."
        },
        {
          "headline":"Add the sweetcorn, spring onions and chopped coriander to the batter.",
          "description":"These are the last of the ingredients you'll need for the batter."
        },
        {
          "headline":"Mix well.",
          "description":"Use a whisk to fully mix the ingredients together. The result shouldn't be too thick, but should be a bit on the thin side. If it seems too thick and chunky, then you can add a little bit more water."
        },
        {
          "headline":"Heat the oil.",
          "description":"In a frying pan, heat the oil over medium to high heat. Give it at least one minute to heat up."
        },
        {
          "headline":"Cook the fritters.",
          "description":"When the oil is hot, add 2 tablespoons of the mixture for each fritter and flatten it with the back of a spoon. This will give the fritter a pancake-like shape. Just watch out for spurting oil when you place the fritters into the pan."
        },
        {
          "headline":"Cook each fritter for about 2-3 minutes on one side before turning it over.",
          "description":"Cook until golden brown on both sides."
        },
        {
          "headline":"Drain the fritters.",
          "description":"When the fritters are cooked, use a slotted spoon to remove them from the pan and absorb any excess oil with paper towels."
        },
        {
          "headline":"Serve.",
          "description":"Serve them with chili sauce and garnish with coriander or parsley leaves. You can also always enjoy this delicious recipe on your own. These fritters are perfect for breakfast or as a snack during any time of day. If this recipe is too complicated for you, but you like the technique, you can make pan-fried corn fritters using only these ingredients:\n15.25 ounces of whole kernel corn\n2 eggs\n2 tablespoons of flour\nSalt\nPepper\n2 tbsp. of vegetable oil"
        }
      ]
    },
    {
      "name":"Deep Fried Corn Fritters",
      "steps":[
        {
          "headline":"Mix the flour, sugar, and baking powder together.",
          "description":"Place these ingredients in a large bowl and stir them until they are thoroughly combined. Whisking them all together works best. This recipe makes 6 servings or around 36 fritters."
        },
        {
          "headline":"Add the eggs, milk, salt, and cayenne pepper.",
          "description":"Once you've combined the first set of ingredients, you should stir the next set together until you've thoroughly combined everything again."
        },
        {
          "headline":"Add the corn and chives to the batter.",
          "description":"You can use canned corn or corn fresh off a cooked cob. Now, use a mixing spoon to fold the ingredients into the batter until they're fully incorporated. They don't have to stick together completely; thanks to the milk, the mixture should be a little bit loose. If it's too chunky, add a bit more milk to loosen it up."
        },
        {
          "headline":"Heat 3–4 inches (7.6–10.2 cm) of canola oil in a pot to 365 degrees.",
          "description":"Use a deep fry thermometer to make sure the oil doesn't get hotter than this; if it does, the fritters will burn right away. You can go ahead and start heating the oil while you make the batter to save time since it'll take a little while for it to heat up."
        },
        {
          "headline":"Drop spoonfuls of the batter into the oil.",
          "description":"You can use a cookie scooper or a regular spoon to scoop out each spoonful of dough. It will expand and should be no bigger than a ping-pong ball. Once you've scooped it out, drop it into the oil. You can throw in as many spoonfuls at a time as will comfortably fit into the pot."
        },
        {
          "headline":"Cook each spoonful of batter until it's golden brown on both sides.",
          "description":"Give each spoonful about 2-3 minutes on each side before flipping it over, allowing it to brown evenly. You have to keep a close eye on them during this time to make sure they don't burn."
        },
        {
          "headline":"Drain the fritters on a paper towel.",
          "description":"Use a slotted spoon to remove the fritters from the oil, shaking off the excess oil, and place them on a paper towel over a plate."
        },
        {
          "headline":"Serve.",
          "description":"You can enjoy these tasty corn fritters on their own, or you can sprinkle them with a spoonful of powdered sugar or lightly drizzle them with maple syrup. Enjoy them for breakfast, as a snack, or during any time of day."
        }
      ]
    }
  ],
  "text":" Pan-Fried Corn Fritters Sift the corn flour, flour, baking powder, salt, ground coriander and cumin into a bowl. To do this, place the ingredients in a sieve over a bowl and then gently run a spoon along the bottom of the sieve to gently move the ingredients into the bowl. This recipe makes 4 servings or around 24 fritters. Add the egg. Break an egg into the mixture and whisk it together to incorporate the egg. You're on your way to making the batter. Add a few drops of lemon juice and water. Just squeeze a lemon slice into the mixture and then pour the water in. If the mixture is still too thick, you can add more water to thin it out. Add the sweetcorn, spring onions and chopped coriander to the batter. These are the last of the ingredients you'll need for the batter. Mix well. Use a whisk to fully mix the ingredients together. The result shouldn't be too thick, but should be a bit on the thin side. If it seems too thick and chunky, then you can add a little bit more water. Heat the oil. In a frying pan, heat the oil over medium to high heat. Give it at least one minute to heat up. Cook the fritters. When the oil is hot, add 2 tablespoons of the mixture for each fritter and flatten it with the back of a spoon. This will give the fritter a pancake-like shape. Just watch out for spurting oil when you place the fritters into the pan. Cook each fritter for about 2-3 minutes on one side before turning it over. Cook until golden brown on both sides. Drain the fritters. When the fritters are cooked, use a slotted spoon to remove them from the pan and absorb any excess oil with paper towels. Serve. Serve them with chili sauce and garnish with coriander or parsley leaves. You can also always enjoy this delicious recipe on your own. These fritters are perfect for breakfast or as a snack during any time of day. If this recipe is too complicated for you, but you like the technique, you can make pan-fried corn fritters using only these ingredients:\n15.25 ounces of whole kernel corn\n2 eggs\n2 tablespoons of flour\nSalt\nPepper\n2 tbsp. of vegetable oil Deep Fried Corn Fritters Mix the flour, sugar, and baking powder together. Place these ingredients in a large bowl and stir them until they are thoroughly combined. Whisking them all together works best. This recipe makes 6 servings or around 36 fritters. Add the eggs, milk, salt, and cayenne pepper. Once you've combined the first set of ingredients, you should stir the next set together until you've thoroughly combined everything again. Add the corn and chives to the batter. You can use canned corn or corn fresh off a cooked cob. Now, use a mixing spoon to fold the ingredients into the batter until they're fully incorporated. They don't have to stick together completely; thanks to the milk, the mixture should be a little bit loose. If it's too chunky, add a bit more milk to loosen it up. Heat 3–4 inches (7.6–10.2 cm) of canola oil in a pot to 365 degrees. Use a deep fry thermometer to make sure the oil doesn't get hotter than this; if it does, the fritters will burn right away. You can go ahead and start heating the oil while you make the batter to save time since it'll take a little while for it to heat up. Drop spoonfuls of the batter into the oil. You can use a cookie scooper or a regular spoon to scoop out each spoonful of dough. It will expand and should be no bigger than a ping-pong ball. Once you've scooped it out, drop it into the oil. You can throw in as many spoonfuls at a time as will comfortably fit into the pot. Cook each spoonful of batter until it's golden brown on both sides. Give each spoonful about 2-3 minutes on each side before flipping it over, allowing it to brown evenly. You have to keep a close eye on them during this time to make sure they don't burn. Drain the fritters on a paper towel. Use a slotted spoon to remove the fritters from the oil, shaking off the excess oil, and place them on a paper towel over a plate. Serve. You can enjoy these tasty corn fritters on their own, or you can sprinkle them with a spoonful of powdered sugar or lightly drizzle them with maple syrup. Enjoy them for breakfast, as a snack, or during any time of day.",
  "sentences":[
    " Pan-Fried Corn Fritters Sift the corn flour, flour, baking powder, salt, ground coriander and cumin into a bowl.",
    "To do this, place the ingredients in a sieve over a bowl and then gently run a spoon along the bottom of the sieve to gently move the ingredients into the bowl.",
    "This recipe makes 4 servings or around 24 fritters.",
    "Add the egg.",
    "Break an egg into the mixture and whisk it together to incorporate the egg.",
    "You're on your way to making the batter.",
    "Add a few drops of lemon juice and water.",
    "Just squeeze a lemon slice into the mixture and then pour the water in.",
    "If the mixture is still too thick, you can add more water to thin it out.",
    "Add the sweetcorn, spring onions and chopped coriander to the batter.",
    "These are the last of the ingredients you'll need for the batter.",
    "Mix well.",
    "Use a whisk to fully mix the ingredients together.",
    "The result shouldn't be too thick, but should be a bit on the thin side.",
    "If it seems too thick and chunky, then you can add a little bit more water.",
    "Heat the oil.",
    "In a frying pan, heat the oil over medium to high heat.",
    "Give it at least one minute to heat up.",
    "Cook the fritters.",
    "When the oil is hot, add 2 tablespoons of the mixture for each fritter and flatten it with the back of a spoon.",
    "This will give the fritter a pancake-like shape.",
    "Just watch out for spurting oil when you place the fritters into the pan.",
    "Cook each fritter for about 2-3 minutes on one side before turning it over.",
    "Cook until golden brown on both sides.",
    "Drain the fritters.",
    "When the fritters are cooked, use a slotted spoon to remove them from the pan and absorb any excess oil with paper towels.",
    "Serve.",
    "Serve them with chili sauce and garnish with coriander or parsley leaves.",
    "You can also always enjoy this delicious recipe on your own.",
    "These fritters are perfect for breakfast or as a snack during any time of day.",
    "If this recipe is too complicated for you, but you like the technique, you can make pan-fried corn fritters using only these ingredients:\n15.25 ounces of whole kernel corn\n2 eggs\n2 tablespoons of flour\nSalt\nPepper\n2 tbsp.",
    "of vegetable oil Deep Fried Corn Fritters Mix the flour, sugar, and baking powder together.",
    "Place these ingredients in a large bowl and stir them until they are thoroughly combined.",
    "Whisking them all together works best.",
    "This recipe makes 6 servings or around 36 fritters.",
    "Add the eggs, milk, salt, and cayenne pepper.",
    "Once you've combined the first set of ingredients, you should stir the next set together until you've thoroughly combined everything again.",
    "Add the corn and chives to the batter.",
    "You can use canned corn or corn fresh off a cooked cob.",
    "Now, use a mixing spoon to fold the ingredients into the batter until they're fully incorporated.",
    "They don't have to stick together completely; thanks to the milk, the mixture should be a little bit loose.",
    "If it's too chunky, add a bit more milk to loosen it up.",
    "Heat 3–4 inches (7.6–10.2 cm) of canola oil in a pot to 365 degrees.",
    "Use a deep fry thermometer to make sure the oil doesn't get hotter than this; if it does, the fritters will burn right away.",
    "You can go ahead and start heating the oil while you make the batter to save time since it'll take a little while for it to heat up.",
    "Drop spoonfuls of the batter into the oil.",
    "You can use a cookie scooper or a regular spoon to scoop out each spoonful of dough.",
    "It will expand and should be no bigger than a ping-pong ball.",
    "Once you've scooped it out, drop it into the oil.",
    "You can throw in as many spoonfuls at a time as will comfortably fit into the pot.",
    "Cook each spoonful of batter until it's golden brown on both sides.",
    "Give each spoonful about 2-3 minutes on each side before flipping it over, allowing it to brown evenly.",
    "You have to keep a close eye on them during this time to make sure they don't burn.",
    "Drain the fritters on a paper towel.",
    "Use a slotted spoon to remove the fritters from the oil, shaking off the excess oil, and place them on a paper towel over a plate.",
    "Serve.",
    "You can enjoy these tasty corn fritters on their own, or you can sprinkle them with a spoonful of powdered sugar or lightly drizzle them with maple syrup.",
    "Enjoy them for breakfast, as a snack, or during any time of day."
  ],
  "tyn_section":[
    "Sieve",
    "Medium bowl",
    "Whisk",
    "Medium frying pan/skillet",
    "Spatula or turner",
    "Spoon",
    "Serving plate"
  ],
  "tyn_model":[
    "oil",
    "water",
    "flour",
    "salt",
    "bowl",
    "milk",
    "corn",
    "baking powder",
    "sieve",
    "spoon",
    "lemon",
    "coriander",
    "slotted spoon",
    "eggs",
    "pot",
    "paper towel",
    "corn flour",
    "ground coriander",
    "cumin",
    "egg",
    "sweetcorn",
    "onions",
    "whisk",
    "frying pan",
    "paper towels",
    "chili sauce",
    "parsley",
    "whole kernel corn",
    "pepper",
    "vegetable oil",
    "deep fried corn fritters",
    "sugar",
    "large bowl",
    "cayenne pepper",
    "chives",
    "mixing spoon",
    "canola oil",
    "deep fry thermometer",
    "cookie scooper",
    "ping-pong ball",
    "plate",
    "powdered sugar",
    "maple syrup"
  ],
  "simple_metrics":{
    "r":0.4285714286,
    "p":0.0697674419,
    "f1":0.12,
    "avg_pos":0.1860465116
  },
  "jacc_metrics_0.5":{
    "r":0.7142857143,
    "p":0.1627906977,
    "f1":0.2651515152
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7142857143,
    "p":0.1860465116,
    "f1":0.295202952
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.4285714286,
    "p":0.0697674419,
    "f1":0.12
  }
}