{
  "title":"How to Remove a Drain from a Tub",
  "url":"https://www.wikihow.com/Remove-a-Drain-from-a-Tub",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Removing Different Types of Drain Stoppers",
      "steps":[
        {
          "headline":"Unscrew a foot plug drain’s stopper.",
          "description":"Put on your rubber gloves and grasp the center stopper. Turn it counterclockwise while pulling up slightly. After enough turns, the stopper should unscrew fully from the drain. Foot plug drains will have a stopper in the center of the drain that moves up and down when the tub is stopped."
        },
        {
          "headline":"Pop out a lift-and-turn drain’s stopper.",
          "description":"Grasp the stopper and pull up on it. You should see a setscrew underneath the stopper’s cap. Use your screwdriver to remove this, and the stopper should then come out. Tap or nudge it with the screwdriver if it seems stuck. Lift-and-turn drains will also have a stopper in the center of the drain, but will be activated by grasping and turning them."
        },
        {
          "headline":"Remove the faceplate of a trip lever drain.",
          "description":"Set your tub to the “open” position, if it has a visible stopper. Remove any screws you see on the drain’s faceplate. Once the screws are out, you should be able to lift up on the drain and pull it out. The faceplate will be on the tub wall near the faucet, not on the bottom of the tub with the drain. These type of drains will stop a tub when a trip lever is activated. You may not be able to see the stopper itself when looking at the drain. Set the tip of the screwdriver underneath the lip of the loosened drain if you need some leverage as you pull it out. Make sure to pull away from the tub wall. The plunger (a small piece that stops the tub) should come out along with the drain."
        }
      ]
    },
    {
      "name":"Taking out the Drain Basket",
      "steps":[
        {
          "headline":"Heat the drain basket with a hair dryer.",
          "description":"Turn your hair dryer on “hot” or “warm” and let it blow on the drain basket (where the stopper was) for a few minutes. The basket, also known as a flange, is sealed with plumber’s putty. Warming it up will make it easier to remove."
        },
        {
          "headline":"Fit the drain wrench into the basket.",
          "description":"Try the various heads of the drain wrench until you find one that fits well. It should slip into the basket and onto the crossbars that are at the bottom of the basket. A drain wrench (also called a smart dumbbell) usually has several heads of different shapes/sizes to fit into a variety of drains. In a pinch, you can use a pair of pliers and a strong screwdriver instead of a drain wrench. Place the tips of the pliers between the crossbars and set the screwdriver between the pliers’ handles so you can turn the tool."
        },
        {
          "headline":"Unscrew the drain basket.",
          "description":"Grasp your drain wrench and turn it counterclockwise. This may be tough, but keep going. If you need more torque, try placing a strong screwdriver across the drain wrench’s handle so you have a little more to hold on to. Once the basket loosens up, you should be able to remove it by continuing to turn it counterclockwise."
        },
        {
          "headline":"Clean off the old seal.",
          "description":"There will be old plumber’s putty and grime stuck around the drain hole once you remove the basket. Pick this off and throw it away. If the putty is stuck, use a plastic putty knife to loosen it. Once it’s gone, clean the drain with a cloth and a mild bathroom cleanser or a 50/50 mix of vinegar and baking soda."
        }
      ]
    },
    {
      "name":"Installing the New Drain",
      "steps":[
        {
          "headline":"Apply new plumber's putty.",
          "description":"Grab some from the container so you have a ball about an inch in diameter. Roll it between your hands until you have a log about 5 to 7 inches (13 to 18 cm) long and pencil-thick. Wrap this around the bottom of the replacement drain's lip."
        },
        {
          "headline":"Screw the new drain basket in for a foot plug or lift-and-turn drain.",
          "description":"Set the basket in the drain hole and turn it clockwise by hand as far as you can. Then tighten it further with the drain wrench. Use a different head than before, if necessary."
        },
        {
          "headline":"Insert the plunger and screw in the drain basket for a trip lever drain.",
          "description":"Check the drain's instructions for exact details on your drain model. Generally, you will insert the plunger into the drain hole, then reattach it to the trip lever using a setscrew. Finally, screw the drain basket into the drain hole."
        },
        {
          "headline":"Scrape off the putty that squeezes out.",
          "description":"As the replacement drain is screwed in, some of the putty will be pushed out. Use your finger or a knife to scrape off this excess."
        },
        {
          "headline":"Screw in the new stopper, if the drain has one.",
          "description":"Find the hole in the center of the drain basket. Insert the new stopper into this. Turn it clockwise to tighten it. Not all drains will have stoppers, but those that do will simply screw in the drain basket this way."
        },
        {
          "headline":"Test for leaks.",
          "description":"Activate the tub stopper or trip lever, and fill the tub halfway with water. Come back after an hour or so. If the water has not drained much, then your new drain is installed properly. You can place a piece of tape on the tub wall at the water line to make it easier to tell if any water drains out. If the water is below the piece of tape after an hour has gone by, then some water has drained out. If the tub does leak, check and make sure the new drain is sealed properly."
        }
      ]
    }
  ],
  "text":" Removing Different Types of Drain Stoppers Unscrew a foot plug drain’s stopper. Put on your rubber gloves and grasp the center stopper. Turn it counterclockwise while pulling up slightly. After enough turns, the stopper should unscrew fully from the drain. Foot plug drains will have a stopper in the center of the drain that moves up and down when the tub is stopped. Pop out a lift-and-turn drain’s stopper. Grasp the stopper and pull up on it. You should see a setscrew underneath the stopper’s cap. Use your screwdriver to remove this, and the stopper should then come out. Tap or nudge it with the screwdriver if it seems stuck. Lift-and-turn drains will also have a stopper in the center of the drain, but will be activated by grasping and turning them. Remove the faceplate of a trip lever drain. Set your tub to the “open” position, if it has a visible stopper. Remove any screws you see on the drain’s faceplate. Once the screws are out, you should be able to lift up on the drain and pull it out. The faceplate will be on the tub wall near the faucet, not on the bottom of the tub with the drain. These type of drains will stop a tub when a trip lever is activated. You may not be able to see the stopper itself when looking at the drain. Set the tip of the screwdriver underneath the lip of the loosened drain if you need some leverage as you pull it out. Make sure to pull away from the tub wall. The plunger (a small piece that stops the tub) should come out along with the drain. Taking out the Drain Basket Heat the drain basket with a hair dryer. Turn your hair dryer on “hot” or “warm” and let it blow on the drain basket (where the stopper was) for a few minutes. The basket, also known as a flange, is sealed with plumber’s putty. Warming it up will make it easier to remove. Fit the drain wrench into the basket. Try the various heads of the drain wrench until you find one that fits well. It should slip into the basket and onto the crossbars that are at the bottom of the basket. A drain wrench (also called a smart dumbbell) usually has several heads of different shapes/sizes to fit into a variety of drains. In a pinch, you can use a pair of pliers and a strong screwdriver instead of a drain wrench. Place the tips of the pliers between the crossbars and set the screwdriver between the pliers’ handles so you can turn the tool. Unscrew the drain basket. Grasp your drain wrench and turn it counterclockwise. This may be tough, but keep going. If you need more torque, try placing a strong screwdriver across the drain wrench’s handle so you have a little more to hold on to. Once the basket loosens up, you should be able to remove it by continuing to turn it counterclockwise. Clean off the old seal. There will be old plumber’s putty and grime stuck around the drain hole once you remove the basket. Pick this off and throw it away. If the putty is stuck, use a plastic putty knife to loosen it. Once it’s gone, clean the drain with a cloth and a mild bathroom cleanser or a 50/50 mix of vinegar and baking soda. Installing the New Drain Apply new plumber's putty. Grab some from the container so you have a ball about an inch in diameter. Roll it between your hands until you have a log about 5 to 7 inches (13 to 18 cm) long and pencil-thick. Wrap this around the bottom of the replacement drain's lip. Screw the new drain basket in for a foot plug or lift-and-turn drain. Set the basket in the drain hole and turn it clockwise by hand as far as you can. Then tighten it further with the drain wrench. Use a different head than before, if necessary. Insert the plunger and screw in the drain basket for a trip lever drain. Check the drain's instructions for exact details on your drain model. Generally, you will insert the plunger into the drain hole, then reattach it to the trip lever using a setscrew. Finally, screw the drain basket into the drain hole. Scrape off the putty that squeezes out. As the replacement drain is screwed in, some of the putty will be pushed out. Use your finger or a knife to scrape off this excess. Screw in the new stopper, if the drain has one. Find the hole in the center of the drain basket. Insert the new stopper into this. Turn it clockwise to tighten it. Not all drains will have stoppers, but those that do will simply screw in the drain basket this way. Test for leaks. Activate the tub stopper or trip lever, and fill the tub halfway with water. Come back after an hour or so. If the water has not drained much, then your new drain is installed properly. You can place a piece of tape on the tub wall at the water line to make it easier to tell if any water drains out. If the water is below the piece of tape after an hour has gone by, then some water has drained out. If the tub does leak, check and make sure the new drain is sealed properly.",
  "sentences":[
    " Removing Different Types of Drain Stoppers Unscrew a foot plug drain’s stopper.",
    "Put on your rubber gloves and grasp the center stopper.",
    "Turn it counterclockwise while pulling up slightly.",
    "After enough turns, the stopper should unscrew fully from the drain.",
    "Foot plug drains will have a stopper in the center of the drain that moves up and down when the tub is stopped.",
    "Pop out a lift-and-turn drain’s stopper.",
    "Grasp the stopper and pull up on it.",
    "You should see a setscrew underneath the stopper’s cap.",
    "Use your screwdriver to remove this, and the stopper should then come out.",
    "Tap or nudge it with the screwdriver if it seems stuck.",
    "Lift-and-turn drains will also have a stopper in the center of the drain, but will be activated by grasping and turning them.",
    "Remove the faceplate of a trip lever drain.",
    "Set your tub to the “open” position, if it has a visible stopper.",
    "Remove any screws you see on the drain’s faceplate.",
    "Once the screws are out, you should be able to lift up on the drain and pull it out.",
    "The faceplate will be on the tub wall near the faucet, not on the bottom of the tub with the drain.",
    "These type of drains will stop a tub when a trip lever is activated.",
    "You may not be able to see the stopper itself when looking at the drain.",
    "Set the tip of the screwdriver underneath the lip of the loosened drain if you need some leverage as you pull it out.",
    "Make sure to pull away from the tub wall.",
    "The plunger (a small piece that stops the tub) should come out along with the drain.",
    "Taking out the Drain Basket Heat the drain basket with a hair dryer.",
    "Turn your hair dryer on “hot” or “warm” and let it blow on the drain basket (where the stopper was) for a few minutes.",
    "The basket, also known as a flange, is sealed with plumber’s putty.",
    "Warming it up will make it easier to remove.",
    "Fit the drain wrench into the basket.",
    "Try the various heads of the drain wrench until you find one that fits well.",
    "It should slip into the basket and onto the crossbars that are at the bottom of the basket.",
    "A drain wrench (also called a smart dumbbell) usually has several heads of different shapes/sizes to fit into a variety of drains.",
    "In a pinch, you can use a pair of pliers and a strong screwdriver instead of a drain wrench.",
    "Place the tips of the pliers between the crossbars and set the screwdriver between the pliers’ handles so you can turn the tool.",
    "Unscrew the drain basket.",
    "Grasp your drain wrench and turn it counterclockwise.",
    "This may be tough, but keep going.",
    "If you need more torque, try placing a strong screwdriver across the drain wrench’s handle so you have a little more to hold on to.",
    "Once the basket loosens up, you should be able to remove it by continuing to turn it counterclockwise.",
    "Clean off the old seal.",
    "There will be old plumber’s putty and grime stuck around the drain hole once you remove the basket.",
    "Pick this off and throw it away.",
    "If the putty is stuck, use a plastic putty knife to loosen it.",
    "Once it’s gone, clean the drain with a cloth and a mild bathroom cleanser or a 50/50 mix of vinegar and baking soda.",
    "Installing the New Drain Apply new plumber's putty.",
    "Grab some from the container so you have a ball about an inch in diameter.",
    "Roll it between your hands until you have a log about 5 to 7 inches (13 to 18 cm) long and pencil-thick.",
    "Wrap this around the bottom of the replacement drain's lip.",
    "Screw the new drain basket in for a foot plug or lift-and-turn drain.",
    "Set the basket in the drain hole and turn it clockwise by hand as far as you can.",
    "Then tighten it further with the drain wrench.",
    "Use a different head than before, if necessary.",
    "Insert the plunger and screw in the drain basket for a trip lever drain.",
    "Check the drain's instructions for exact details on your drain model.",
    "Generally, you will insert the plunger into the drain hole, then reattach it to the trip lever using a setscrew.",
    "Finally, screw the drain basket into the drain hole.",
    "Scrape off the putty that squeezes out.",
    "As the replacement drain is screwed in, some of the putty will be pushed out.",
    "Use your finger or a knife to scrape off this excess.",
    "Screw in the new stopper, if the drain has one.",
    "Find the hole in the center of the drain basket.",
    "Insert the new stopper into this.",
    "Turn it clockwise to tighten it.",
    "Not all drains will have stoppers, but those that do will simply screw in the drain basket this way.",
    "Test for leaks.",
    "Activate the tub stopper or trip lever, and fill the tub halfway with water.",
    "Come back after an hour or so.",
    "If the water has not drained much, then your new drain is installed properly.",
    "You can place a piece of tape on the tub wall at the water line to make it easier to tell if any water drains out.",
    "If the water is below the piece of tape after an hour has gone by, then some water has drained out.",
    "If the tub does leak, check and make sure the new drain is sealed properly."
  ],
  "tyn_section":[
    "New drain",
    "Drain wrench",
    "Rubber gloves",
    "Plumber's putty",
    "Heavy-duty screwdriver",
    "Tape or dry erase marker",
    "Vinegar and baking soda or a mild bathroom cleanser",
    "Blow dryer (optional)"
  ],
  "tyn_model":[
    "drain basket",
    "tub",
    "drain wrench",
    "screwdriver",
    "water",
    "stopper",
    "pliers",
    "putty",
    "hair dryer",
    "plumber’s putty",
    "plunger",
    "foot plug drain’s stopper",
    "rubber gloves",
    "foot plug drains",
    "drain’s stopper",
    "trip lever",
    "“open",
    "” position",
    "“hot",
    "” or",
    "“warm",
    "” and",
    "’ handles",
    "plastic putty knife",
    "mild bathroom cleanser",
    "vinegar",
    "baking soda",
    "plumber's putty",
    "basket",
    "knife",
    "tub stopper"
  ],
  "simple_metrics":{
    "r":0.375,
    "p":0.0967741935,
    "f1":0.1538461538,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.1612903226,
    "f1":0.243902439
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.2580645161,
    "f1":0.384
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.375,
    "p":0.0967741935,
    "f1":0.1538461538
  }
}