{
  "title":"How to Hang Clothes to Dry",
  "url":"https://www.wikihow.com/Hang-Clothes-to-Dry",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Clothes",
    "Drying Clothes"
  ],
  "methods":[
    {
      "name":"Using a Clothesline",
      "steps":[
        {
          "headline":"Shake out the clothing after removing it from the wash.",
          "description":"Hold the clothing by the end and give it a quick shake. It helps unfold the clothing after washing, eliminating wrinkles. The more you can prevent the clothing from bunching up, the easier it is to dry."
        },
        {
          "headline":"Turn dark clothing inside out to prevent fading.",
          "description":"If you live in a sunny area, turn dark shirts and jeans inside out. Your clothing will still fade over time, but this slows the process. Also, if you hang dark clothing in direct sunlight, move it out of the light as soon as it finishes drying. White clothing is okay to leave out. The sun brightens it."
        },
        {
          "headline":"Pin folded sheets at the ends.",
          "description":"Starting with the larger items is recommended since these take up the most space and dry slower. These large items should be folded in half first. Bring the folded end up, draping it slightly over the clothesline. Pin the corner, then move across the line to pin the middle and other corner. Keep the top of the sheet flat and straight against the clothesline. Do this with every article you hang to prevent wrinkles."
        },
        {
          "headline":"Keep towels unfolded while hanging.",
          "description":"Unfold the towels, then bring them to the clothesline. Drape 1 end slightly over the clothesline. Pin both corners to hold the towel in place. Hang the towel vertically and unfolded so it dries faster. To save on clothespins, hang the towels next to one another and clip the ends with the same pin."
        },
        {
          "headline":"Hang shirts by the bottom hem.",
          "description":"Bring the bottom hem up to the line. Clip 1 corner, then stretch the hem out over the clothesline and clip the other corner. The hem should be straight and flat against the line so the shirt doesn’t sag at all. Let the shirt’s heavier end dangle to encourage drying. Another way to hang shirts is with hangers. Slide the clothing onto the hangers, then hook the hangers onto the clothesline."
        },
        {
          "headline":"Pin pants by the leg seams to facilitate drying.",
          "description":"Fold the pants in half, pressing the legs together. Hold the bottom hems against the clothesline and pin them in place. If you have 2 clotheslines side by side, separate the legs and pin 1 to each line. It will reduce the drying time even further. The waist end is heavier, so it’s better to let it hang lower. However, you can hang the pants by the waist hem if you wish."
        },
        {
          "headline":"Hang socks in pairs by the toes.",
          "description":"Keep your socks paired together to save on space. Set the socks side by side with the toe end curled over the line. Place a single clothespin between the socks, fastening both in place. Repeat this with any other pairs of socks that need drying."
        },
        {
          "headline":"Fasten small items at the corners.",
          "description":"For items like baby pants, small towels, and underwear, hang them like you would with a towel. Stretch them out on the line so they don’t sag. Clamp the clothespins on both corners. Hopefully, you have enough extra space to stretch these items out on the line. If you’re short on space, try to find spots between the other articles and fit them there."
        }
      ]
    },
    {
      "name":"Drying Indoors",
      "steps":[
        {
          "headline":"Dry your clothes in an open space.",
          "description":"Clothing has to be exposed to air circulation to dry effectively. Heat and sunlight also help. No matter how you dry your clothing, keep it out of closets or other enclosed area. Place it near open doors, windows, and heat vents. The clothing doesn’t have to be placed in direct sunlight. Placing it out in the open helps a lot."
        },
        {
          "headline":"Turn on nearby fans and heating vents.",
          "description":"Hopefully, your room has some natural heat flow and air circulation to speed up drying. Turn on any heat and air sources nearby. This includes fans and your home heating system. Any heat or air blowing towards the clothing helps. If you live in a humid climate, a dehumidifier also speeds up the drying process. Be cautious when using heat. Never place the clothing right next to the heating source, as you could start a fire."
        },
        {
          "headline":"Drape clothing over a wall-mounted rod.",
          "description":"Most likely you already have a bath or curtain rod you can utilize for drying clothing. Sling the items over the rod and position them so they aren’t bunched up against one another. If any of your clothing drips, set towels or buckets underneath it to collect the water. Larger items, including towels and sheets, benefit from having space on the rod. However, it can be used to dry most clothing. Larger items can also be draped over doors or chair backs."
        },
        {
          "headline":"Use hangers to hang non-stretchable clothing from the wall-mounted rod.",
          "description":"Clothing hangers are useful for hanging non-stretchable clothing such as jeans and T-shirts. Place them between any clothing you have draped over the rod. Slip the clothing on the hangers, then spread them apart so air reaches all parts of the fabric. Again, leave space between each article so moisture doesn’t get trapped."
        },
        {
          "headline":"Set up a drying rack for extra hanging space.",
          "description":"You can get a relatively inexpensive drying rack at a general store. Drying racks are basically smaller versions of bath or curtain rods. Set the rack up near a breezy window or heat source, then drape clothing over the rack’s bars. Racks have the advantage of mobility. You can move the rack to wherever you need it. They also tend to have a flat surface on top for laying delicates."
        },
        {
          "headline":"Avoid hanging delicate, stretchable clothing.",
          "description":"Clothing such as knit sweaters stretch out when hung up to dry. You are better off laying these items flat. One way to do this is to purchase a drying net from a nearby general store. The net hooks onto a wall-mounted rod like clothing hangers do. Then, lay the delicate item flat inside the net until it dries. Another way to dry these items is to lay them out on a dry towel. You can also use the top part of a drying rack, if you have one."
        },
        {
          "headline":"Space out the clothing as much as possible.",
          "description":"Before leaving the clothing to dry, check its positioning again. Make sure each item has plenty of space around it. Spread them out as much as you can to facilitate drying. No items should be pressed together."
        },
        {
          "headline":"Flip the clothing halfway through drying.",
          "description":"Wait between 15 and 30 minutes, then flip your clothes. When clothing is wet for too long, it can get musty. Flipping prevents that gross smell by speeding up the drying process. Larger items like blankets benefit from being flipped, but other clothes may need it too depending on how much heat and air flow you have in your environment."
        }
      ]
    }
  ],
  "text":" Using a Clothesline Shake out the clothing after removing it from the wash. Hold the clothing by the end and give it a quick shake. It helps unfold the clothing after washing, eliminating wrinkles. The more you can prevent the clothing from bunching up, the easier it is to dry. Turn dark clothing inside out to prevent fading. If you live in a sunny area, turn dark shirts and jeans inside out. Your clothing will still fade over time, but this slows the process. Also, if you hang dark clothing in direct sunlight, move it out of the light as soon as it finishes drying. White clothing is okay to leave out. The sun brightens it. Pin folded sheets at the ends. Starting with the larger items is recommended since these take up the most space and dry slower. These large items should be folded in half first. Bring the folded end up, draping it slightly over the clothesline. Pin the corner, then move across the line to pin the middle and other corner. Keep the top of the sheet flat and straight against the clothesline. Do this with every article you hang to prevent wrinkles. Keep towels unfolded while hanging. Unfold the towels, then bring them to the clothesline. Drape 1 end slightly over the clothesline. Pin both corners to hold the towel in place. Hang the towel vertically and unfolded so it dries faster. To save on clothespins, hang the towels next to one another and clip the ends with the same pin. Hang shirts by the bottom hem. Bring the bottom hem up to the line. Clip 1 corner, then stretch the hem out over the clothesline and clip the other corner. The hem should be straight and flat against the line so the shirt doesn’t sag at all. Let the shirt’s heavier end dangle to encourage drying. Another way to hang shirts is with hangers. Slide the clothing onto the hangers, then hook the hangers onto the clothesline. Pin pants by the leg seams to facilitate drying. Fold the pants in half, pressing the legs together. Hold the bottom hems against the clothesline and pin them in place. If you have 2 clotheslines side by side, separate the legs and pin 1 to each line. It will reduce the drying time even further. The waist end is heavier, so it’s better to let it hang lower. However, you can hang the pants by the waist hem if you wish. Hang socks in pairs by the toes. Keep your socks paired together to save on space. Set the socks side by side with the toe end curled over the line. Place a single clothespin between the socks, fastening both in place. Repeat this with any other pairs of socks that need drying. Fasten small items at the corners. For items like baby pants, small towels, and underwear, hang them like you would with a towel. Stretch them out on the line so they don’t sag. Clamp the clothespins on both corners. Hopefully, you have enough extra space to stretch these items out on the line. If you’re short on space, try to find spots between the other articles and fit them there. Drying Indoors Dry your clothes in an open space. Clothing has to be exposed to air circulation to dry effectively. Heat and sunlight also help. No matter how you dry your clothing, keep it out of closets or other enclosed area. Place it near open doors, windows, and heat vents. The clothing doesn’t have to be placed in direct sunlight. Placing it out in the open helps a lot. Turn on nearby fans and heating vents. Hopefully, your room has some natural heat flow and air circulation to speed up drying. Turn on any heat and air sources nearby. This includes fans and your home heating system. Any heat or air blowing towards the clothing helps. If you live in a humid climate, a dehumidifier also speeds up the drying process. Be cautious when using heat. Never place the clothing right next to the heating source, as you could start a fire. Drape clothing over a wall-mounted rod. Most likely you already have a bath or curtain rod you can utilize for drying clothing. Sling the items over the rod and position them so they aren’t bunched up against one another. If any of your clothing drips, set towels or buckets underneath it to collect the water. Larger items, including towels and sheets, benefit from having space on the rod. However, it can be used to dry most clothing. Larger items can also be draped over doors or chair backs. Use hangers to hang non-stretchable clothing from the wall-mounted rod. Clothing hangers are useful for hanging non-stretchable clothing such as jeans and T-shirts. Place them between any clothing you have draped over the rod. Slip the clothing on the hangers, then spread them apart so air reaches all parts of the fabric. Again, leave space between each article so moisture doesn’t get trapped. Set up a drying rack for extra hanging space. You can get a relatively inexpensive drying rack at a general store. Drying racks are basically smaller versions of bath or curtain rods. Set the rack up near a breezy window or heat source, then drape clothing over the rack’s bars. Racks have the advantage of mobility. You can move the rack to wherever you need it. They also tend to have a flat surface on top for laying delicates. Avoid hanging delicate, stretchable clothing. Clothing such as knit sweaters stretch out when hung up to dry. You are better off laying these items flat. One way to do this is to purchase a drying net from a nearby general store. The net hooks onto a wall-mounted rod like clothing hangers do. Then, lay the delicate item flat inside the net until it dries. Another way to dry these items is to lay them out on a dry towel. You can also use the top part of a drying rack, if you have one. Space out the clothing as much as possible. Before leaving the clothing to dry, check its positioning again. Make sure each item has plenty of space around it. Spread them out as much as you can to facilitate drying. No items should be pressed together. Flip the clothing halfway through drying. Wait between 15 and 30 minutes, then flip your clothes. When clothing is wet for too long, it can get musty. Flipping prevents that gross smell by speeding up the drying process. Larger items like blankets benefit from being flipped, but other clothes may need it too depending on how much heat and air flow you have in your environment.",
  "sentences":[
    " Using a Clothesline Shake out the clothing after removing it from the wash.",
    "Hold the clothing by the end and give it a quick shake.",
    "It helps unfold the clothing after washing, eliminating wrinkles.",
    "The more you can prevent the clothing from bunching up, the easier it is to dry.",
    "Turn dark clothing inside out to prevent fading.",
    "If you live in a sunny area, turn dark shirts and jeans inside out.",
    "Your clothing will still fade over time, but this slows the process.",
    "Also, if you hang dark clothing in direct sunlight, move it out of the light as soon as it finishes drying.",
    "White clothing is okay to leave out.",
    "The sun brightens it.",
    "Pin folded sheets at the ends.",
    "Starting with the larger items is recommended since these take up the most space and dry slower.",
    "These large items should be folded in half first.",
    "Bring the folded end up, draping it slightly over the clothesline.",
    "Pin the corner, then move across the line to pin the middle and other corner.",
    "Keep the top of the sheet flat and straight against the clothesline.",
    "Do this with every article you hang to prevent wrinkles.",
    "Keep towels unfolded while hanging.",
    "Unfold the towels, then bring them to the clothesline.",
    "Drape 1 end slightly over the clothesline.",
    "Pin both corners to hold the towel in place.",
    "Hang the towel vertically and unfolded so it dries faster.",
    "To save on clothespins, hang the towels next to one another and clip the ends with the same pin.",
    "Hang shirts by the bottom hem.",
    "Bring the bottom hem up to the line.",
    "Clip 1 corner, then stretch the hem out over the clothesline and clip the other corner.",
    "The hem should be straight and flat against the line so the shirt doesn’t sag at all.",
    "Let the shirt’s heavier end dangle to encourage drying.",
    "Another way to hang shirts is with hangers.",
    "Slide the clothing onto the hangers, then hook the hangers onto the clothesline.",
    "Pin pants by the leg seams to facilitate drying.",
    "Fold the pants in half, pressing the legs together.",
    "Hold the bottom hems against the clothesline and pin them in place.",
    "If you have 2 clotheslines side by side, separate the legs and pin 1 to each line.",
    "It will reduce the drying time even further.",
    "The waist end is heavier, so it’s better to let it hang lower.",
    "However, you can hang the pants by the waist hem if you wish.",
    "Hang socks in pairs by the toes.",
    "Keep your socks paired together to save on space.",
    "Set the socks side by side with the toe end curled over the line.",
    "Place a single clothespin between the socks, fastening both in place.",
    "Repeat this with any other pairs of socks that need drying.",
    "Fasten small items at the corners.",
    "For items like baby pants, small towels, and underwear, hang them like you would with a towel.",
    "Stretch them out on the line so they don’t sag.",
    "Clamp the clothespins on both corners.",
    "Hopefully, you have enough extra space to stretch these items out on the line.",
    "If you’re short on space, try to find spots between the other articles and fit them there.",
    "Drying Indoors Dry your clothes in an open space.",
    "Clothing has to be exposed to air circulation to dry effectively.",
    "Heat and sunlight also help.",
    "No matter how you dry your clothing, keep it out of closets or other enclosed area.",
    "Place it near open doors, windows, and heat vents.",
    "The clothing doesn’t have to be placed in direct sunlight.",
    "Placing it out in the open helps a lot.",
    "Turn on nearby fans and heating vents.",
    "Hopefully, your room has some natural heat flow and air circulation to speed up drying.",
    "Turn on any heat and air sources nearby.",
    "This includes fans and your home heating system.",
    "Any heat or air blowing towards the clothing helps.",
    "If you live in a humid climate, a dehumidifier also speeds up the drying process.",
    "Be cautious when using heat.",
    "Never place the clothing right next to the heating source, as you could start a fire.",
    "Drape clothing over a wall-mounted rod.",
    "Most likely you already have a bath or curtain rod you can utilize for drying clothing.",
    "Sling the items over the rod and position them so they aren’t bunched up against one another.",
    "If any of your clothing drips, set towels or buckets underneath it to collect the water.",
    "Larger items, including towels and sheets, benefit from having space on the rod.",
    "However, it can be used to dry most clothing.",
    "Larger items can also be draped over doors or chair backs.",
    "Use hangers to hang non-stretchable clothing from the wall-mounted rod.",
    "Clothing hangers are useful for hanging non-stretchable clothing such as jeans and T-shirts.",
    "Place them between any clothing you have draped over the rod.",
    "Slip the clothing on the hangers, then spread them apart so air reaches all parts of the fabric.",
    "Again, leave space between each article so moisture doesn’t get trapped.",
    "Set up a drying rack for extra hanging space.",
    "You can get a relatively inexpensive drying rack at a general store.",
    "Drying racks are basically smaller versions of bath or curtain rods.",
    "Set the rack up near a breezy window or heat source, then drape clothing over the rack’s bars.",
    "Racks have the advantage of mobility.",
    "You can move the rack to wherever you need it.",
    "They also tend to have a flat surface on top for laying delicates.",
    "Avoid hanging delicate, stretchable clothing.",
    "Clothing such as knit sweaters stretch out when hung up to dry.",
    "You are better off laying these items flat.",
    "One way to do this is to purchase a drying net from a nearby general store.",
    "The net hooks onto a wall-mounted rod like clothing hangers do.",
    "Then, lay the delicate item flat inside the net until it dries.",
    "Another way to dry these items is to lay them out on a dry towel.",
    "You can also use the top part of a drying rack, if you have one.",
    "Space out the clothing as much as possible.",
    "Before leaving the clothing to dry, check its positioning again.",
    "Make sure each item has plenty of space around it.",
    "Spread them out as much as you can to facilitate drying.",
    "No items should be pressed together.",
    "Flip the clothing halfway through drying.",
    "Wait between 15 and 30 minutes, then flip your clothes.",
    "When clothing is wet for too long, it can get musty.",
    "Flipping prevents that gross smell by speeding up the drying process.",
    "Larger items like blankets benefit from being flipped, but other clothes may need it too depending on how much heat and air flow you have in your environment."
  ],
  "tyn_section":[
    "Clothesline",
    "Clothespins",
    "Laundry basket",
    "Curtain or bath rod",
    "Clothes hangers",
    "Drying rack, net, or other flat surface",
    "Heat source and fans as needed",
    "Dehumidifier as needed"
  ],
  "tyn_model":[
    "towels",
    "clothing",
    "hangers",
    "towel",
    "clothespins",
    "shirts",
    "socks",
    "fans",
    "drying rack",
    "sheets",
    "sheet",
    "pants",
    "clothespin",
    "dehumidifier",
    "heat",
    "bath or curtain rod",
    "rod",
    "buckets",
    "water",
    "drying racks",
    "dry towel",
    "clothes",
    "blankets"
  ],
  "simple_metrics":{
    "r":0.125,
    "p":0.0434782609,
    "f1":0.064516129,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.375,
    "p":0.1739130435,
    "f1":0.2376237624
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5,
    "p":0.2173913043,
    "f1":0.303030303
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.25,
    "p":0.0869565217,
    "f1":0.1290322581
  }
}