{
  "title":"How to Keep Pretzels Warm",
  "url":"https://www.wikihow.com/Keep-Pretzels-Warm",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks"
  ],
  "methods":[
    {
      "name":"Keeping Pretzels Warm at an Event or Concession Stand",
      "steps":[
        {
          "headline":"Buy or rent a pretzel warmer.",
          "description":"If you want to use a pretzel warmer for an event, contact a local party supply business to inquire about rentals. If you want to purchase one for your business, comparison shop online to find a good deal. Only buy a machine from a reliable seller to ensure that you buy a safe, effective warmer."
        },
        {
          "headline":"Add water to the container under the bottom of the warmer.",
          "description":"Open the door to the pretzel warmer and locate the water container. Lift the metal panel covering it and remove the basin inside. Fill it with water at room temperature and place it back in the warmer, then cover it with the panel."
        },
        {
          "headline":"Plug in the machine.",
          "description":"Plug the warming machine into an outlet that will provide at least 8 amps of electricity. If possible, choose an outlet that does not have too many other appliances or machines plugged into it. You can also purchase a heavy duty extension cord from a hardware store to accommodate the machine."
        },
        {
          "headline":"Turn on the lighting and heating, and set the temperature.",
          "description":"Once the machine is plugged in, turn on the lights to display your snacks and set your temperature. Since you are keeping pretzels warm but not reheating them, choose a low to moderate temperature. Flip the switch to turn on the heat. If you notice that your pretzels are drying out or getting tough, lower the temperature."
        },
        {
          "headline":"Hang fresh pretzels on the bars inside.",
          "description":"There is a hanging rack inside most pretzel warmer displays. Open the door of the warmer and use a pair of metal serving tongs to loop freshly warmed pretzels onto the bars. Close the door to keep the heat in."
        },
        {
          "headline":"Keep track of different batches of pretzels.",
          "description":"If you heat a new batch of pretzels, place them on a different row or rack than older pretzels. This will ensure that you serve the older pretzels first, keeping them from getting stale. To keep this simple, only serve pretzels from the top row, shifting pretzels up to higher rows as older ones are served."
        }
      ]
    },
    {
      "name":"Reheating Pretzels at Home",
      "steps":[
        {
          "headline":"Moisten day-old pretzels and microwave them.",
          "description":"Add life to your day-old pretzels by sprinkling them with water. With a small spoon, gently sprinkle about 10-15 drops of water onto the surface of your soft pretzel. Place it on a microwave-safe plate and heat it for about 30 seconds."
        },
        {
          "headline":"Baste day-old pretzels with butter and bake them.",
          "description":"Microwave 1 tablespoon (15 ml) of butter per pretzel in a microwave-safe bowl until it is melted. Gently baste the melted butter onto your day-old pretzels. Place the pretzels on a parchment paper-lined baking sheet and bake them for 5 minutes. Add extra salt before baking if desired."
        },
        {
          "headline":"Reheat frozen pretzels.",
          "description":"To warm pretzels that you have stored in the freezer, preheat your oven to 450 degrees Fahrenheit (230 degrees Celsius). Place frozen pretzels on a baking sheet. Bake them for 5 minutes, then remove them from the oven and let them cool."
        },
        {
          "headline":"Serve pretzels with a ceramic bread warmer.",
          "description":"Purchase a ceramic bread warmer at a kitchen supply store or online. Heat the warmer in the microwave for about a minute and place it in a basket using an oven mitt. Cover the bread warmer with a clean dish cloth and place your warm pretzels on top of it to serve. Ceramic bread warmers can stay warm for about 45 minutes."
        }
      ]
    }
  ],
  "text":" Keeping Pretzels Warm at an Event or Concession Stand Buy or rent a pretzel warmer. If you want to use a pretzel warmer for an event, contact a local party supply business to inquire about rentals. If you want to purchase one for your business, comparison shop online to find a good deal. Only buy a machine from a reliable seller to ensure that you buy a safe, effective warmer. Add water to the container under the bottom of the warmer. Open the door to the pretzel warmer and locate the water container. Lift the metal panel covering it and remove the basin inside. Fill it with water at room temperature and place it back in the warmer, then cover it with the panel. Plug in the machine. Plug the warming machine into an outlet that will provide at least 8 amps of electricity. If possible, choose an outlet that does not have too many other appliances or machines plugged into it. You can also purchase a heavy duty extension cord from a hardware store to accommodate the machine. Turn on the lighting and heating, and set the temperature. Once the machine is plugged in, turn on the lights to display your snacks and set your temperature. Since you are keeping pretzels warm but not reheating them, choose a low to moderate temperature. Flip the switch to turn on the heat. If you notice that your pretzels are drying out or getting tough, lower the temperature. Hang fresh pretzels on the bars inside. There is a hanging rack inside most pretzel warmer displays. Open the door of the warmer and use a pair of metal serving tongs to loop freshly warmed pretzels onto the bars. Close the door to keep the heat in. Keep track of different batches of pretzels. If you heat a new batch of pretzels, place them on a different row or rack than older pretzels. This will ensure that you serve the older pretzels first, keeping them from getting stale. To keep this simple, only serve pretzels from the top row, shifting pretzels up to higher rows as older ones are served. Reheating Pretzels at Home Moisten day-old pretzels and microwave them. Add life to your day-old pretzels by sprinkling them with water. With a small spoon, gently sprinkle about 10-15 drops of water onto the surface of your soft pretzel. Place it on a microwave-safe plate and heat it for about 30 seconds. Baste day-old pretzels with butter and bake them. Microwave 1 tablespoon (15 ml) of butter per pretzel in a microwave-safe bowl until it is melted. Gently baste the melted butter onto your day-old pretzels. Place the pretzels on a parchment paper-lined baking sheet and bake them for 5 minutes. Add extra salt before baking if desired. Reheat frozen pretzels. To warm pretzels that you have stored in the freezer, preheat your oven to 450 degrees Fahrenheit (230 degrees Celsius). Place frozen pretzels on a baking sheet. Bake them for 5 minutes, then remove them from the oven and let them cool. Serve pretzels with a ceramic bread warmer. Purchase a ceramic bread warmer at a kitchen supply store or online. Heat the warmer in the microwave for about a minute and place it in a basket using an oven mitt. Cover the bread warmer with a clean dish cloth and place your warm pretzels on top of it to serve. Ceramic bread warmers can stay warm for about 45 minutes.",
  "sentences":[
    " Keeping Pretzels Warm at an Event or Concession Stand Buy or rent a pretzel warmer.",
    "If you want to use a pretzel warmer for an event, contact a local party supply business to inquire about rentals.",
    "If you want to purchase one for your business, comparison shop online to find a good deal.",
    "Only buy a machine from a reliable seller to ensure that you buy a safe, effective warmer.",
    "Add water to the container under the bottom of the warmer.",
    "Open the door to the pretzel warmer and locate the water container.",
    "Lift the metal panel covering it and remove the basin inside.",
    "Fill it with water at room temperature and place it back in the warmer, then cover it with the panel.",
    "Plug in the machine.",
    "Plug the warming machine into an outlet that will provide at least 8 amps of electricity.",
    "If possible, choose an outlet that does not have too many other appliances or machines plugged into it.",
    "You can also purchase a heavy duty extension cord from a hardware store to accommodate the machine.",
    "Turn on the lighting and heating, and set the temperature.",
    "Once the machine is plugged in, turn on the lights to display your snacks and set your temperature.",
    "Since you are keeping pretzels warm but not reheating them, choose a low to moderate temperature.",
    "Flip the switch to turn on the heat.",
    "If you notice that your pretzels are drying out or getting tough, lower the temperature.",
    "Hang fresh pretzels on the bars inside.",
    "There is a hanging rack inside most pretzel warmer displays.",
    "Open the door of the warmer and use a pair of metal serving tongs to loop freshly warmed pretzels onto the bars.",
    "Close the door to keep the heat in.",
    "Keep track of different batches of pretzels.",
    "If you heat a new batch of pretzels, place them on a different row or rack than older pretzels.",
    "This will ensure that you serve the older pretzels first, keeping them from getting stale.",
    "To keep this simple, only serve pretzels from the top row, shifting pretzels up to higher rows as older ones are served.",
    "Reheating Pretzels at Home Moisten day-old pretzels and microwave them.",
    "Add life to your day-old pretzels by sprinkling them with water.",
    "With a small spoon, gently sprinkle about 10-15 drops of water onto the surface of your soft pretzel.",
    "Place it on a microwave-safe plate and heat it for about 30 seconds.",
    "Baste day-old pretzels with butter and bake them.",
    "Microwave 1 tablespoon (15 ml) of butter per pretzel in a microwave-safe bowl until it is melted.",
    "Gently baste the melted butter onto your day-old pretzels.",
    "Place the pretzels on a parchment paper-lined baking sheet and bake them for 5 minutes.",
    "Add extra salt before baking if desired.",
    "Reheat frozen pretzels.",
    "To warm pretzels that you have stored in the freezer, preheat your oven to 450 degrees Fahrenheit (230 degrees Celsius).",
    "Place frozen pretzels on a baking sheet.",
    "Bake them for 5 minutes, then remove them from the oven and let them cool.",
    "Serve pretzels with a ceramic bread warmer.",
    "Purchase a ceramic bread warmer at a kitchen supply store or online.",
    "Heat the warmer in the microwave for about a minute and place it in a basket using an oven mitt.",
    "Cover the bread warmer with a clean dish cloth and place your warm pretzels on top of it to serve.",
    "Ceramic bread warmers can stay warm for about 45 minutes."
  ],
  "tyn_section":[
    "Keeping Pretzels Warm at a Store or Concession Stand",
    "Commercial pretzel warmer",
    "Metal serving tongs",
    "A small spoon",
    "A microwave-safe plate",
    "A microwave-safe bowl",
    "1 tablespoon (15 ml) of butter",
    "Baking sheet",
    "Parchment paper",
    "Oven mitt",
    "Ceramic bread warmer",
    "Clean dish towel"
  ],
  "tyn_model":[
    "pretzels",
    "water",
    "pretzel warmer",
    "butter",
    "warmer",
    "microwave",
    "baking sheet",
    "oven",
    "ceramic bread warmer",
    "basin",
    "extension cord",
    "serving tongs",
    "small spoon",
    "microwave-safe plate",
    "microwave-safe bowl",
    "parchment paper",
    "salt",
    "oven mitt",
    "bread warmer",
    "ceramic bread warmers"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.2,
    "f1":0.25,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.75,
    "p":0.6,
    "f1":0.6666666667
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.75,
    "p":0.65,
    "f1":0.6964285714
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.75,
    "p":0.5,
    "f1":0.6
  }
}