{
  "title":"How to Replace the Battery in a Key Fob",
  "url":"https://www.wikihow.com/Replace-the-Battery-in-a-Key-Fob",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Home Repairs"
  ],
  "parts":[
    {
      "name":"Opening the Fob",
      "steps":[
        {
          "headline":"Move the key out of the way if it is in the fob.",
          "description":"This depends on what kind of fob you have. Car key fobs for example typically hold the key when it is not in use. You have to open the key, although in some fobs the key is removable. Either slide the key out or spring it away from the fob. A fob with a sliding key has a small button on the top. Hold the button down while pulling on the key to remove it. For a fob with a springing key, press the spring button on the fob or pull the key forward to get it out of the way."
        },
        {
          "headline":"Unscrew the back of the key fob.",
          "description":"Flip the key fob over and look for at least 1 screw holding in the plastic. These screws are tiny, so you will need a small Phillips head screwdriver. Rotate the screw counterclockwise to remove it. Work slowly to avoid stripping the screw. Set the screw aside in a safe spot, such as inside a resealable bag or small cup, to avoid losing it."
        },
        {
          "headline":"Twist a coin in the side slot if the fob has one.",
          "description":"Many, but not all, fobs have a small indentation on the side. Use a small coin or a flat head screwdriver. Push the end into the slot, then turn the object to separate the fob’s halves."
        },
        {
          "headline":"Pry the cover off if it doesn’t have a slot.",
          "description":"Your fob will have a seam around the side edges. This is where the fob’s halves meet. Push the tip of a flat head screwdriver into the seam to separate the halves. Then, lift the screwdriver to pry the cover off. Prying a stuck cover is easier if you use the screwdriver on all of the fob’s sides. Work the blade into the seam in a few different spots to separate the halves."
        }
      ]
    },
    {
      "name":"Replacing the Battery",
      "steps":[
        {
          "headline":"Pry the battery out with a screwdriver.",
          "description":"The battery looks like a small, silver coin placed in fob’s center. Try to remove the battery by sliding it out with your fingers. If this doesn’t happen, lift it out with a flat screwdriver or the end of a paperclip. Slide the screwdriver’s head under the battery and gently lift it to remove it. Some fobs have clips over the battery. Lift the clips with the screwdriver to free the battery. Move slowly, lifting the clips as gently as possible to avoid breaking them."
        },
        {
          "headline":"Slide the new battery into place.",
          "description":"Fit the new battery into the slot where the old one was. Check the fob’s plastic for a diagram showing how to install the battery. Normally, the battery fits with the positive side face-up. You won’t need to do anything else to secure it besides fitting it into the battery slot. Fobs generally use small, coin-shaped batteries like CR2025 or CR2032. You can usually find them at general stores, home improvement stores, and some auto part stores. To find the specific type of battery yours uses, consult the owner’s manual of inspect the fob and battery for a label."
        },
        {
          "headline":"Screw the fob back together.",
          "description":"Put the cover back on the fob. Push down on it so it snaps in place over the battery. Then, replace the screw. Turn it clockwise until it tightly binds the cover;s halves together."
        },
        {
          "headline":"Test the key fob.",
          "description":"Point the key fob at your car or other device and attempt to use it. It should work right away. If it doesn’t, the battery may be upside-down. You will need to take the fob apart again to test this. If that doesn’t fix it, the fob may be broken. A dealer or an auto locksmith can replace the fob. You may also be able to buy a new fob and program it yourself."
        }
      ]
    }
  ],
  "text":" Opening the Fob Move the key out of the way if it is in the fob. This depends on what kind of fob you have. Car key fobs for example typically hold the key when it is not in use. You have to open the key, although in some fobs the key is removable. Either slide the key out or spring it away from the fob. A fob with a sliding key has a small button on the top. Hold the button down while pulling on the key to remove it. For a fob with a springing key, press the spring button on the fob or pull the key forward to get it out of the way. Unscrew the back of the key fob. Flip the key fob over and look for at least 1 screw holding in the plastic. These screws are tiny, so you will need a small Phillips head screwdriver. Rotate the screw counterclockwise to remove it. Work slowly to avoid stripping the screw. Set the screw aside in a safe spot, such as inside a resealable bag or small cup, to avoid losing it. Twist a coin in the side slot if the fob has one. Many, but not all, fobs have a small indentation on the side. Use a small coin or a flat head screwdriver. Push the end into the slot, then turn the object to separate the fob’s halves. Pry the cover off if it doesn’t have a slot. Your fob will have a seam around the side edges. This is where the fob’s halves meet. Push the tip of a flat head screwdriver into the seam to separate the halves. Then, lift the screwdriver to pry the cover off. Prying a stuck cover is easier if you use the screwdriver on all of the fob’s sides. Work the blade into the seam in a few different spots to separate the halves. Replacing the Battery Pry the battery out with a screwdriver. The battery looks like a small, silver coin placed in fob’s center. Try to remove the battery by sliding it out with your fingers. If this doesn’t happen, lift it out with a flat screwdriver or the end of a paperclip. Slide the screwdriver’s head under the battery and gently lift it to remove it. Some fobs have clips over the battery. Lift the clips with the screwdriver to free the battery. Move slowly, lifting the clips as gently as possible to avoid breaking them. Slide the new battery into place. Fit the new battery into the slot where the old one was. Check the fob’s plastic for a diagram showing how to install the battery. Normally, the battery fits with the positive side face-up. You won’t need to do anything else to secure it besides fitting it into the battery slot. Fobs generally use small, coin-shaped batteries like CR2025 or CR2032. You can usually find them at general stores, home improvement stores, and some auto part stores. To find the specific type of battery yours uses, consult the owner’s manual of inspect the fob and battery for a label. Screw the fob back together. Put the cover back on the fob. Push down on it so it snaps in place over the battery. Then, replace the screw. Turn it clockwise until it tightly binds the cover;s halves together. Test the key fob. Point the key fob at your car or other device and attempt to use it. It should work right away. If it doesn’t, the battery may be upside-down. You will need to take the fob apart again to test this. If that doesn’t fix it, the fob may be broken. A dealer or an auto locksmith can replace the fob. You may also be able to buy a new fob and program it yourself.",
  "sentences":[
    " Opening the Fob Move the key out of the way if it is in the fob.",
    "This depends on what kind of fob you have.",
    "Car key fobs for example typically hold the key when it is not in use.",
    "You have to open the key, although in some fobs the key is removable.",
    "Either slide the key out or spring it away from the fob.",
    "A fob with a sliding key has a small button on the top.",
    "Hold the button down while pulling on the key to remove it.",
    "For a fob with a springing key, press the spring button on the fob or pull the key forward to get it out of the way.",
    "Unscrew the back of the key fob.",
    "Flip the key fob over and look for at least 1 screw holding in the plastic.",
    "These screws are tiny, so you will need a small Phillips head screwdriver.",
    "Rotate the screw counterclockwise to remove it.",
    "Work slowly to avoid stripping the screw.",
    "Set the screw aside in a safe spot, such as inside a resealable bag or small cup, to avoid losing it.",
    "Twist a coin in the side slot if the fob has one.",
    "Many, but not all, fobs have a small indentation on the side.",
    "Use a small coin or a flat head screwdriver.",
    "Push the end into the slot, then turn the object to separate the fob’s halves.",
    "Pry the cover off if it doesn’t have a slot.",
    "Your fob will have a seam around the side edges.",
    "This is where the fob’s halves meet.",
    "Push the tip of a flat head screwdriver into the seam to separate the halves.",
    "Then, lift the screwdriver to pry the cover off.",
    "Prying a stuck cover is easier if you use the screwdriver on all of the fob’s sides.",
    "Work the blade into the seam in a few different spots to separate the halves.",
    "Replacing the Battery Pry the battery out with a screwdriver.",
    "The battery looks like a small, silver coin placed in fob’s center.",
    "Try to remove the battery by sliding it out with your fingers.",
    "If this doesn’t happen, lift it out with a flat screwdriver or the end of a paperclip.",
    "Slide the screwdriver’s head under the battery and gently lift it to remove it.",
    "Some fobs have clips over the battery.",
    "Lift the clips with the screwdriver to free the battery.",
    "Move slowly, lifting the clips as gently as possible to avoid breaking them.",
    "Slide the new battery into place.",
    "Fit the new battery into the slot where the old one was.",
    "Check the fob’s plastic for a diagram showing how to install the battery.",
    "Normally, the battery fits with the positive side face-up.",
    "You won’t need to do anything else to secure it besides fitting it into the battery slot.",
    "Fobs generally use small, coin-shaped batteries like CR2025 or CR2032.",
    "You can usually find them at general stores, home improvement stores, and some auto part stores.",
    "To find the specific type of battery yours uses, consult the owner’s manual of inspect the fob and battery for a label.",
    "Screw the fob back together.",
    "Put the cover back on the fob.",
    "Push down on it so it snaps in place over the battery.",
    "Then, replace the screw.",
    "Turn it clockwise until it tightly binds the cover;s halves together.",
    "Test the key fob.",
    "Point the key fob at your car or other device and attempt to use it.",
    "It should work right away.",
    "If it doesn’t, the battery may be upside-down.",
    "You will need to take the fob apart again to test this.",
    "If that doesn’t fix it, the fob may be broken.",
    "A dealer or an auto locksmith can replace the fob.",
    "You may also be able to buy a new fob and program it yourself."
  ],
  "tyn_section":[
    "Phillips head screwdriver",
    "Flat head screwdriver",
    "New battery"
  ],
  "tyn_model":[
    "screwdriver",
    "battery",
    "flat head screwdriver",
    "car key fobs",
    "phillips head screwdriver",
    "resealable bag",
    "coin",
    "small coin",
    "flat screwdriver",
    "batteries",
    "auto locksmith",
    "program"
  ],
  "simple_metrics":{
    "r":0.6666666667,
    "p":0.1666666667,
    "f1":0.2666666667,
    "avg_pos":0.3333333333
  },
  "jacc_metrics_0.5":{
    "r":1.0,
    "p":0.3333333333,
    "f1":0.5
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.4166666667,
    "f1":0.5882352941
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.25,
    "f1":0.3636363636
  }
}