{
  "title":"How to Cook Kangaroo Steak",
  "url":"https://www.wikihow.com/Cook-Kangaroo-Steak",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines"
  ],
  "methods":[
    {
      "name":"Searing Kangaroo Steak",
      "steps":[
        {
          "headline":"Thaw out your steak until it is room temperature.",
          "description":"Take the kangaroo steak out of your refrigerator if you marinated it or out of your freezer if you did not. Then, place it on a cabinet or table and let it thaw to room temperature."
        },
        {
          "headline":"Rub herbs and spices into your steak for taste.",
          "description":"To give your steak some additional flavor, try covering each of its sides with some simple herbs and spices. Ingredients like salt and pepper can enhance the steak’s natural flavors while ingredients like thyme, ginger, and brown sugar will give it more unique taste characteristics. If you marinated or pre-seasoned your steak, skip this step to avoid over-seasoning the dish."
        },
        {
          "headline":"Coat a skillet with cooking oil and heat it to a high temperature.",
          "description":"Grab a skillet or similar pan and coat it with cooking oil to keep the steak from sticking to it. Then, place it over a stovetop or burner and set the temperature to around 400 °F (204 °C). If your burner does not have precise temperature measurements, set the heat to the second highest setting available."
        },
        {
          "headline":"Put your steak in the skillet and cook it for about 2 minutes on each side.",
          "description":"Using cooking tongs, set your kangaroo steak in the center of the skillet. Sear the steak for about 2 minutes, then flip it over and cook the other side for the same amount of time. Cooking the meat at such a high temperature will create a nice, rich exterior that seals in the filet’s juices. Your actual cooking times may vary slightly depending on the size of your steak."
        },
        {
          "headline":"Reduce the heat and cook each side for another 2 minutes.",
          "description":"Once you’ve seared each side of the steak on high, turn your burner’s temperature down to low and cook each side again. Doing this ensures that the steak cooks fully but doesn’t burn."
        },
        {
          "headline":"Remove the steak when the outside is dark and the inside is slightly pink.",
          "description":"When properly cooked, your steak will have a fairly dark, firm exterior. However, when you cut it open, the inside should still be slightly pink."
        }
      ]
    },
    {
      "name":"Grilling Kangaroo Steak",
      "steps":[
        {
          "headline":"Let your steak thaw to room temperature.",
          "description":"Remove the kangaroo steak from your freezer or, if you marinated it, your refrigerator. Then, set your steak on a flat surface and let it warm up to room temperature."
        },
        {
          "headline":"Soak your steak in olive oil for about 20 minutes.",
          "description":"Before you start grilling, place your kangaroo steak in a small bowl and cover it with olive oil. Then, let the steak soak for 15 to 30 minutes or, if your meat is particularly dry, up to 2 hours. Do this even if you marinated your steak to make sure the meat is as moist and juicy as possible."
        },
        {
          "headline":"Heat your grill to 400 °F (204 °C) or a similarly high temperature.",
          "description":"If you’re using an electric grill, set the heat to around 400 °F (204 °C) or turn your temperature dial to the second hottest setting available. If you’re using a traditional grill, build your flame in a spot where you can put the steak directly on top of it. Grilling your steak at such a high temperature allows it to cook thoroughly without losing its juiciness."
        },
        {
          "headline":"Season your steak with herbs and spices if necessary.",
          "description":"If you did not pre-season or marinate your meat, consider adding some additional ingredients to it right now. Make sure to cover every side of your steak. To bring out the steak’s natural flavors, sprinkle on some salt and pepper. For something more complex, throw dashes of crushed garlic, paprika, oregano, or similar ingredients into the mix."
        },
        {
          "headline":"Set you steak on the grill and cook it for 2 to 3 minutes.",
          "description":"Grab your steak with a pair of tongs and place it on your grill. Then, let it cook for between 2 and 3 minutes. Kangaroo meat cooks quickly and burns incredibly easily, so keep your eyes on it at all times while it’s on the grill. If you’re using a traditional grill, make sure to set the steak directly over the fire. Your steak may take a bit more or less time to cook depending on how large it is."
        },
        {
          "headline":"Flip the steak and grill it for an additional 2 to 3 minutes.",
          "description":"Once you’ve finished cooking the first side of your steak, flip it over using your tongs and grill the other side. To make sure the meat cooks evenly, try to grill your steak for the same amount of time on each side."
        },
        {
          "headline":"Remove your steak when the center is mostly firm.",
          "description":"To see if your steak is done, press down in the center of the cut using your tongs. If the meat is fairly firm and only gives a little bit when you touch it, take it off the grill immediately."
        },
        {
          "headline":"Let your steak rest for 10 minutes before serving.",
          "description":"After removing your steak from the grill, place it on a flat surface and let it sit for 10 minutes or more. This gives it time to cool down and finish cooking."
        }
      ]
    },
    {
      "name":"Marinating Your Steak",
      "steps":[
        {
          "headline":"Rub herbs and spices into your steak for taste.",
          "description":"Sprinkle a variety of herbs and spices onto your steak, making sure to cover every side. Then, rub the ingredients in using your fingers. Though the kangaroo steak’s unique, gamey taste is usually the main attraction, adding a few of the following herbs and spices can help emphasize that flavor:\nSalt and pepper\nCrushed garlic\nThyme\nGinger\nBrown sugar\nCayenne\nPaprika\nOregano"
        },
        {
          "headline":"Submerge your steak in a flavored liquid.",
          "description":"Once you’ve added any herbs and spices you want to, pour a flavored liquid into your bowl until it completely covers the kangaroo steak. Not only will this make the steak tastier, but it will help the meat preserve some of its juiciness during the cooking process. The following liquids go particularly well with kangaroo steak:\nRed wine\nMango juice\nPineapple juice\nOrange juice\nSoy sauce\nPlum sauce\nMirin"
        },
        {
          "headline":"Place your kangaroo steak in a plastic or glass bowl and cover it with plastic wrap.",
          "description":"Make sure the bowl is small enough that you can store it in your refrigerator. This will help keep germs and bacteria away from the steak. If you’d prefer, you can transfer the steak and flavored liquid to a resealable plastic bag."
        },
        {
          "headline":"Place your steak in the fridge and let it marinate overnight.",
          "description":"If possible, let your steak marinate overnight so it can tenderize thoroughly. If you don’t have that much time, make sure to marinate it for at least 2 hours."
        }
      ]
    }
  ],
  "text":" Searing Kangaroo Steak Thaw out your steak until it is room temperature. Take the kangaroo steak out of your refrigerator if you marinated it or out of your freezer if you did not. Then, place it on a cabinet or table and let it thaw to room temperature. Rub herbs and spices into your steak for taste. To give your steak some additional flavor, try covering each of its sides with some simple herbs and spices. Ingredients like salt and pepper can enhance the steak’s natural flavors while ingredients like thyme, ginger, and brown sugar will give it more unique taste characteristics. If you marinated or pre-seasoned your steak, skip this step to avoid over-seasoning the dish. Coat a skillet with cooking oil and heat it to a high temperature. Grab a skillet or similar pan and coat it with cooking oil to keep the steak from sticking to it. Then, place it over a stovetop or burner and set the temperature to around 400 °F (204 °C). If your burner does not have precise temperature measurements, set the heat to the second highest setting available. Put your steak in the skillet and cook it for about 2 minutes on each side. Using cooking tongs, set your kangaroo steak in the center of the skillet. Sear the steak for about 2 minutes, then flip it over and cook the other side for the same amount of time. Cooking the meat at such a high temperature will create a nice, rich exterior that seals in the filet’s juices. Your actual cooking times may vary slightly depending on the size of your steak. Reduce the heat and cook each side for another 2 minutes. Once you’ve seared each side of the steak on high, turn your burner’s temperature down to low and cook each side again. Doing this ensures that the steak cooks fully but doesn’t burn. Remove the steak when the outside is dark and the inside is slightly pink. When properly cooked, your steak will have a fairly dark, firm exterior. However, when you cut it open, the inside should still be slightly pink. Grilling Kangaroo Steak Let your steak thaw to room temperature. Remove the kangaroo steak from your freezer or, if you marinated it, your refrigerator. Then, set your steak on a flat surface and let it warm up to room temperature. Soak your steak in olive oil for about 20 minutes. Before you start grilling, place your kangaroo steak in a small bowl and cover it with olive oil. Then, let the steak soak for 15 to 30 minutes or, if your meat is particularly dry, up to 2 hours. Do this even if you marinated your steak to make sure the meat is as moist and juicy as possible. Heat your grill to 400 °F (204 °C) or a similarly high temperature. If you’re using an electric grill, set the heat to around 400 °F (204 °C) or turn your temperature dial to the second hottest setting available. If you’re using a traditional grill, build your flame in a spot where you can put the steak directly on top of it. Grilling your steak at such a high temperature allows it to cook thoroughly without losing its juiciness. Season your steak with herbs and spices if necessary. If you did not pre-season or marinate your meat, consider adding some additional ingredients to it right now. Make sure to cover every side of your steak. To bring out the steak’s natural flavors, sprinkle on some salt and pepper. For something more complex, throw dashes of crushed garlic, paprika, oregano, or similar ingredients into the mix. Set you steak on the grill and cook it for 2 to 3 minutes. Grab your steak with a pair of tongs and place it on your grill. Then, let it cook for between 2 and 3 minutes. Kangaroo meat cooks quickly and burns incredibly easily, so keep your eyes on it at all times while it’s on the grill. If you’re using a traditional grill, make sure to set the steak directly over the fire. Your steak may take a bit more or less time to cook depending on how large it is. Flip the steak and grill it for an additional 2 to 3 minutes. Once you’ve finished cooking the first side of your steak, flip it over using your tongs and grill the other side. To make sure the meat cooks evenly, try to grill your steak for the same amount of time on each side. Remove your steak when the center is mostly firm. To see if your steak is done, press down in the center of the cut using your tongs. If the meat is fairly firm and only gives a little bit when you touch it, take it off the grill immediately. Let your steak rest for 10 minutes before serving. After removing your steak from the grill, place it on a flat surface and let it sit for 10 minutes or more. This gives it time to cool down and finish cooking. Marinating Your Steak Rub herbs and spices into your steak for taste. Sprinkle a variety of herbs and spices onto your steak, making sure to cover every side. Then, rub the ingredients in using your fingers. Though the kangaroo steak’s unique, gamey taste is usually the main attraction, adding a few of the following herbs and spices can help emphasize that flavor:\nSalt and pepper\nCrushed garlic\nThyme\nGinger\nBrown sugar\nCayenne\nPaprika\nOregano Submerge your steak in a flavored liquid. Once you’ve added any herbs and spices you want to, pour a flavored liquid into your bowl until it completely covers the kangaroo steak. Not only will this make the steak tastier, but it will help the meat preserve some of its juiciness during the cooking process. The following liquids go particularly well with kangaroo steak:\nRed wine\nMango juice\nPineapple juice\nOrange juice\nSoy sauce\nPlum sauce\nMirin Place your kangaroo steak in a plastic or glass bowl and cover it with plastic wrap. Make sure the bowl is small enough that you can store it in your refrigerator. This will help keep germs and bacteria away from the steak. If you’d prefer, you can transfer the steak and flavored liquid to a resealable plastic bag. Place your steak in the fridge and let it marinate overnight. If possible, let your steak marinate overnight so it can tenderize thoroughly. If you don’t have that much time, make sure to marinate it for at least 2 hours.",
  "sentences":[
    " Searing Kangaroo Steak Thaw out your steak until it is room temperature.",
    "Take the kangaroo steak out of your refrigerator if you marinated it or out of your freezer if you did not.",
    "Then, place it on a cabinet or table and let it thaw to room temperature.",
    "Rub herbs and spices into your steak for taste.",
    "To give your steak some additional flavor, try covering each of its sides with some simple herbs and spices.",
    "Ingredients like salt and pepper can enhance the steak’s natural flavors while ingredients like thyme, ginger, and brown sugar will give it more unique taste characteristics.",
    "If you marinated or pre-seasoned your steak, skip this step to avoid over-seasoning the dish.",
    "Coat a skillet with cooking oil and heat it to a high temperature.",
    "Grab a skillet or similar pan and coat it with cooking oil to keep the steak from sticking to it.",
    "Then, place it over a stovetop or burner and set the temperature to around 400 °F (204 °C).",
    "If your burner does not have precise temperature measurements, set the heat to the second highest setting available.",
    "Put your steak in the skillet and cook it for about 2 minutes on each side.",
    "Using cooking tongs, set your kangaroo steak in the center of the skillet.",
    "Sear the steak for about 2 minutes, then flip it over and cook the other side for the same amount of time.",
    "Cooking the meat at such a high temperature will create a nice, rich exterior that seals in the filet’s juices.",
    "Your actual cooking times may vary slightly depending on the size of your steak.",
    "Reduce the heat and cook each side for another 2 minutes.",
    "Once you’ve seared each side of the steak on high, turn your burner’s temperature down to low and cook each side again.",
    "Doing this ensures that the steak cooks fully but doesn’t burn.",
    "Remove the steak when the outside is dark and the inside is slightly pink.",
    "When properly cooked, your steak will have a fairly dark, firm exterior.",
    "However, when you cut it open, the inside should still be slightly pink.",
    "Grilling Kangaroo Steak Let your steak thaw to room temperature.",
    "Remove the kangaroo steak from your freezer or, if you marinated it, your refrigerator.",
    "Then, set your steak on a flat surface and let it warm up to room temperature.",
    "Soak your steak in olive oil for about 20 minutes.",
    "Before you start grilling, place your kangaroo steak in a small bowl and cover it with olive oil.",
    "Then, let the steak soak for 15 to 30 minutes or, if your meat is particularly dry, up to 2 hours.",
    "Do this even if you marinated your steak to make sure the meat is as moist and juicy as possible.",
    "Heat your grill to 400 °F (204 °C) or a similarly high temperature.",
    "If you’re using an electric grill, set the heat to around 400 °F (204 °C) or turn your temperature dial to the second hottest setting available.",
    "If you’re using a traditional grill, build your flame in a spot where you can put the steak directly on top of it.",
    "Grilling your steak at such a high temperature allows it to cook thoroughly without losing its juiciness.",
    "Season your steak with herbs and spices if necessary.",
    "If you did not pre-season or marinate your meat, consider adding some additional ingredients to it right now.",
    "Make sure to cover every side of your steak.",
    "To bring out the steak’s natural flavors, sprinkle on some salt and pepper.",
    "For something more complex, throw dashes of crushed garlic, paprika, oregano, or similar ingredients into the mix.",
    "Set you steak on the grill and cook it for 2 to 3 minutes.",
    "Grab your steak with a pair of tongs and place it on your grill.",
    "Then, let it cook for between 2 and 3 minutes.",
    "Kangaroo meat cooks quickly and burns incredibly easily, so keep your eyes on it at all times while it’s on the grill.",
    "If you’re using a traditional grill, make sure to set the steak directly over the fire.",
    "Your steak may take a bit more or less time to cook depending on how large it is.",
    "Flip the steak and grill it for an additional 2 to 3 minutes.",
    "Once you’ve finished cooking the first side of your steak, flip it over using your tongs and grill the other side.",
    "To make sure the meat cooks evenly, try to grill your steak for the same amount of time on each side.",
    "Remove your steak when the center is mostly firm.",
    "To see if your steak is done, press down in the center of the cut using your tongs.",
    "If the meat is fairly firm and only gives a little bit when you touch it, take it off the grill immediately.",
    "Let your steak rest for 10 minutes before serving.",
    "After removing your steak from the grill, place it on a flat surface and let it sit for 10 minutes or more.",
    "This gives it time to cool down and finish cooking.",
    "Marinating Your Steak Rub herbs and spices into your steak for taste.",
    "Sprinkle a variety of herbs and spices onto your steak, making sure to cover every side.",
    "Then, rub the ingredients in using your fingers.",
    "Though the kangaroo steak’s unique, gamey taste is usually the main attraction, adding a few of the following herbs and spices can help emphasize that flavor:\nSalt and pepper\nCrushed garlic\nThyme\nGinger\nBrown sugar\nCayenne\nPaprika\nOregano Submerge your steak in a flavored liquid.",
    "Once you’ve added any herbs and spices you want to, pour a flavored liquid into your bowl until it completely covers the kangaroo steak.",
    "Not only will this make the steak tastier, but it will help the meat preserve some of its juiciness during the cooking process.",
    "The following liquids go particularly well with kangaroo steak:\nRed wine\nMango juice\nPineapple juice\nOrange juice\nSoy sauce\nPlum sauce\nMirin Place your kangaroo steak in a plastic or glass bowl and cover it with plastic wrap.",
    "Make sure the bowl is small enough that you can store it in your refrigerator.",
    "This will help keep germs and bacteria away from the steak.",
    "If you’d prefer, you can transfer the steak and flavored liquid to a resealable plastic bag.",
    "Place your steak in the fridge and let it marinate overnight.",
    "If possible, let your steak marinate overnight so it can tenderize thoroughly.",
    "If you don’t have that much time, make sure to marinate it for at least 2 hours."
  ],
  "tyn_section":[
    "Stovetop or burner",
    "Skillet",
    "Cooking tongs",
    "Grill",
    "Plastic or glass bowl",
    "Plastic wrap or resealable plastic bag",
    "Refrigerator"
  ],
  "tyn_model":[
    "grill",
    "herbs",
    "spices",
    "skillet",
    "flavored liquid",
    "thyme",
    "ginger",
    "brown sugar",
    "cooking oil",
    "burner",
    "olive oil",
    "paprika",
    "oregano",
    "bowl",
    "stovetop or burner",
    "cooking tongs",
    "electric grill",
    "salt and pepper",
    "crushed garlic",
    "salt",
    "pepper",
    "garlic",
    "cayenne",
    "red wine",
    "mango juice",
    "pineapple juice",
    "orange juice",
    "plum sauce",
    "plastic or glass",
    "plastic wrap",
    "resealable plastic bag",
    "fridge"
  ],
  "simple_metrics":{
    "r":0.5714285714,
    "p":0.125,
    "f1":0.2051282051,
    "avg_pos":0.4375
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.21875,
    "f1":0.3485477178
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.8571428571,
    "p":0.3125,
    "f1":0.4580152672
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7142857143,
    "p":0.15625,
    "f1":0.2564102564
  }
}