{
  "title":"How to Paint Light Bulbs",
  "url":"https://www.wikihow.com/Paint-Light-Bulbs",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Light Bulbs"
  ],
  "methods":[
    {
      "name":"Making Colored Light Bulbs",
      "steps":[
        {
          "headline":"Select a clear, 40 watt bulb.",
          "description":"Light bulbs below 40 watts will also work. You just want to ensure that your paint withstands the heat made from the bulb once it’s turned on. Clear bulbs will give you the best effect of the light shining through the paint. You can use frosted bulbs, but the colored light coming through won’t be as vibrant."
        },
        {
          "headline":"Purchase special heat-resistant glass paint.",
          "description":"Find paint that is made for glass or safe for painting ceramics at your local craft store. Do not use regular acrylic or oil-based paint on light bulbs. When you turn your light bulb on, regular paint on the hot glass can cause your light bulb to explode. Examples of appropriate paint to use are DecoArt Glass-tiques, Decoart Liquid Rainbow, FolkArt Gallery Glass Liquid Leading, and Vitrea by Pebeo"
        },
        {
          "headline":"Clean your light bulbs with rubbing alcohol.",
          "description":"You’ll want a clean, dust free surface for painting, so that the paint adheres to your bulb well. Soak a cotton ball with rubbing alcohol and rub your light bulb with it. Use soap and water if you don’t have any rubbing alcohol. Dry your bulb with a clean towel or allow it to air-dry for 1-2 minutes."
        },
        {
          "headline":"Prop your light bulb up with tack.",
          "description":"Use a small amount of blue tack or “sticky tack” to prop up your light bulb so that it won’t roll around while you paint. Blue tack is available at craft stores and in some office supply stores. You can also use Play-doh or some air-dry clay if you don’t have any blue tack."
        },
        {
          "headline":"Use small brushes to apply your paint.",
          "description":"Apply your first color in a light, thin layer and see how it looks. You can free-hand your picture, or use stencils by using peel-off stickers or stencils you design yourself with paper. Paint a detailed picture on your light bulb, cover it with stars or flowers, or simply make blocks of color for a stained glass or rainbow effect. For Halloween bulbs, paint pumpkins or ghosts on your light bulbs. For custom holiday lights, paint your bulbs red and green or with snowflakes."
        },
        {
          "headline":"Allow air-dry paint to dry for 1 hour.",
          "description":"If you’re using an air-dry glass paint, allow your bulb to remain standing on the tack for 1 hour to dry. Refrain from touching the bulb before it’s completely dry."
        },
        {
          "headline":"Add more layers if you would like brighter colors.",
          "description":"Some glass paints may need additional layers to get the effect that you want. Allow each layer to dry before adding new layers."
        },
        {
          "headline":"Heat cure your light bulb in the oven if your paint requires it.",
          "description":"Some glass paints, especially paints also used for ceramics, require heat curing. Follow any instructions on the packaging of your paint for heat-curing your light bulb in the oven. Remove any food or cooking items from your oven before using it to heat cure your light bulbs. Place your light bulb on an oven safe pan if your paint instructions require it. Allow your painted bulbs to cool completely in the oven after curing them."
        }
      ]
    },
    {
      "name":"Turning Your Light Bulbs into Ornaments",
      "steps":[
        {
          "headline":"Make glass hot-air balloons for a whimsical décor.",
          "description":"Use glass paint to make a hot-air balloon design of your choice onto your light bulbs. Glue four pieces of string up the sides of the light bulb and tie them all together in a knot at the top. Make a loop out of one string to hang the bulb, and trim the rest. Instead of painting the design on the bulb, you can attach fabric scraps with decoupage to the bulb before gluing on the strings."
        },
        {
          "headline":"Make a light bulb turkey for fall.",
          "description":"Paint your entire light bulb dark brown and allow it to dry completely. Paint 2 small wooden hearts orange and allow them to dry, then glue them side by side as feet on the wide bottom of your bulb. Glue a pair of googly eyes and an orange beak made from felt to the front of the bulb to make its face. Glue 6-8 fall-colored feathers to the back of the turkey in a splaying tail pattern. Add a small straw hat from a craft store to the top of the turkey’s head if you want."
        },
        {
          "headline":"Make a snowman ornament for your holiday tree.",
          "description":"Paint your light bulb with glue and cover it in white glitter. Allow that to dry, then use black puffy paint to make a snowman’s face and buttons, with the narrow socket side being the top. Hot glue small twigs on the sides of the bulb for snowman arms, and wrap the socket top tightly with twine, leaving a loop to hang onto your tree. For best results, use a frosted white light bulb."
        },
        {
          "headline":"Create a Santa ornament for your tree.",
          "description":"Using black permanent marker, draw an oval-shaped fluffy cloud onto your light bulb for the outline of Santa’s face. Fill this cloud in with acrylic paint of skin-tone color of your choice. Paint the rest of the bulb with white acrylic paint and the narrow socket top red. Allow your painted bulb to dry on a piece of Play-Doh for 1 hour. Draw Santa’s face inside the flesh-colored cloud on your dried light bulb with permanent marker. Attach a cotton ball to the top of Santa’s red hat, or the socket top, with craft glue. Wind some string or fishing wire around the hat with a loop for hanging it up."
        },
        {
          "headline":"Make a light bulb penguin for the holidays.",
          "description":"Paint the entire back and sides of a frosted bulb black, leaving an hour glass shape in the front white, and allow it to dry. Cut the end off a finger from a child’s glove to make a hat for your penguin and glue a pom-pom to the top, then glue this to the narrow screw-top on your bulb. Tie a shiny gold ribbon that’s 3–4 inches (7.6–10.2 cm) in length into a bow and glue it around the neckline of your penguin. Use a black permanent maker to draw your penguin’s eyes up near the hat and buttons down the front below his bow tie. Cut ⁄4 inch (0.64 cm) off the pointed end of a toothpick and glue it onto your penguin’s face for its beak."
        },
        {
          "headline":"Create a light bulb reindeer for the holidays.",
          "description":"Use a colored bulb or paint a clear one any color you wish and allow it to dry. Glue a red pom-pom toward the end of the bulb opposite the screw top for the reindeer’s nose and glue a pair of googly eyes up near the screw top. Tie an 8 in (20 cm) piece of sparkly ribbon neatly around the screw top in a bow. Bend a 6 in (15 cm) piece of brown pipe cleaner into a U-shape and then make more small bends in each end for the antlers. Glue the antlers to the screw top behind the bow."
        }
      ]
    },
    {
      "name":"Creating Vases",
      "steps":[
        {
          "headline":"Use needle-nose pliers to remove the brass contact and wires.",
          "description":"Use a pair of needle-nose pliers to grip the little point on the end of the light bulb and give it a good twist. This breaks the brass contact and one of the wires leading to the filament. Pull these parts out with the pliers. Wear gloves and eye protection while hollowing out your light bulb in case it breaks."
        },
        {
          "headline":"Use a screwdriver to break the fill tube inside the bulb.",
          "description":"Once you can see inside the bulb, you’ll see a small tube connected to the parts in there. Dig in there with a screwdriver and break this tube. Once you have that out, you can shake the rest of the small parts from inside the bulb out. Empty the contents of the bulb onto a paper towel or cloth that you can easily throw away."
        },
        {
          "headline":"Clean the inside of the bulb with soapy water.",
          "description":"Take your empty light bulb to the kitchen sink. Fill it with some water and a couple drops of dish detergent, shake the soapy water around, and dump it down the drain."
        },
        {
          "headline":"Dry your light bulb with paper towel.",
          "description":"Stuff a crumpled paper towel into the end of your light bulb to dry it and wipe away any powder or glass bits that are left inside. Allow any remaining water to air dry."
        },
        {
          "headline":"Paint the screw cap or the glass to add some sparkle.",
          "description":"Use nail polish or any acrylic paint to hand paint your own design on your vase. Or you can paint the cap only for a simpler look. Allow your paint to fully dry before filling your vase with water and flowers. Fill your vase with water and flowers. Put water into your light bulb vase and some short cut flowers to place inside it. The weight of the water should allow your vase to stand on its own."
        },
        {
          "headline":"Wrap some twine around the screw cap for a rustic look.",
          "description":"If you’d like to hang your vase, tie some twine or ribbon around the cap. Hang the vases up on your porch or patio, or keep them on hooks inside."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Colored Light Bulbs Select a clear, 40 watt bulb. Light bulbs below 40 watts will also work. You just want to ensure that your paint withstands the heat made from the bulb once it’s turned on. Clear bulbs will give you the best effect of the light shining through the paint. You can use frosted bulbs, but the colored light coming through won’t be as vibrant. Purchase special heat-resistant glass paint. Find paint that is made for glass or safe for painting ceramics at your local craft store. Do not use regular acrylic or oil-based paint on light bulbs. When you turn your light bulb on, regular paint on the hot glass can cause your light bulb to explode. Examples of appropriate paint to use are DecoArt Glass-tiques, Decoart Liquid Rainbow, FolkArt Gallery Glass Liquid Leading, and Vitrea by Pebeo Clean your light bulbs with rubbing alcohol. You’ll want a clean, dust free surface for painting, so that the paint adheres to your bulb well. Soak a cotton ball with rubbing alcohol and rub your light bulb with it. Use soap and water if you don’t have any rubbing alcohol. Dry your bulb with a clean towel or allow it to air-dry for 1-2 minutes. Prop your light bulb up with tack. Use a small amount of blue tack or “sticky tack” to prop up your light bulb so that it won’t roll around while you paint. Blue tack is available at craft stores and in some office supply stores. You can also use Play-doh or some air-dry clay if you don’t have any blue tack. Use small brushes to apply your paint. Apply your first color in a light, thin layer and see how it looks. You can free-hand your picture, or use stencils by using peel-off stickers or stencils you design yourself with paper. Paint a detailed picture on your light bulb, cover it with stars or flowers, or simply make blocks of color for a stained glass or rainbow effect. For Halloween bulbs, paint pumpkins or ghosts on your light bulbs. For custom holiday lights, paint your bulbs red and green or with snowflakes. Allow air-dry paint to dry for 1 hour. If you’re using an air-dry glass paint, allow your bulb to remain standing on the tack for 1 hour to dry. Refrain from touching the bulb before it’s completely dry. Add more layers if you would like brighter colors. Some glass paints may need additional layers to get the effect that you want. Allow each layer to dry before adding new layers. Heat cure your light bulb in the oven if your paint requires it. Some glass paints, especially paints also used for ceramics, require heat curing. Follow any instructions on the packaging of your paint for heat-curing your light bulb in the oven. Remove any food or cooking items from your oven before using it to heat cure your light bulbs. Place your light bulb on an oven safe pan if your paint instructions require it. Allow your painted bulbs to cool completely in the oven after curing them. Turning Your Light Bulbs into Ornaments Make glass hot-air balloons for a whimsical décor. Use glass paint to make a hot-air balloon design of your choice onto your light bulbs. Glue four pieces of string up the sides of the light bulb and tie them all together in a knot at the top. Make a loop out of one string to hang the bulb, and trim the rest. Instead of painting the design on the bulb, you can attach fabric scraps with decoupage to the bulb before gluing on the strings. Make a light bulb turkey for fall. Paint your entire light bulb dark brown and allow it to dry completely. Paint 2 small wooden hearts orange and allow them to dry, then glue them side by side as feet on the wide bottom of your bulb. Glue a pair of googly eyes and an orange beak made from felt to the front of the bulb to make its face. Glue 6-8 fall-colored feathers to the back of the turkey in a splaying tail pattern. Add a small straw hat from a craft store to the top of the turkey’s head if you want. Make a snowman ornament for your holiday tree. Paint your light bulb with glue and cover it in white glitter. Allow that to dry, then use black puffy paint to make a snowman’s face and buttons, with the narrow socket side being the top. Hot glue small twigs on the sides of the bulb for snowman arms, and wrap the socket top tightly with twine, leaving a loop to hang onto your tree. For best results, use a frosted white light bulb. Create a Santa ornament for your tree. Using black permanent marker, draw an oval-shaped fluffy cloud onto your light bulb for the outline of Santa’s face. Fill this cloud in with acrylic paint of skin-tone color of your choice. Paint the rest of the bulb with white acrylic paint and the narrow socket top red. Allow your painted bulb to dry on a piece of Play-Doh for 1 hour. Draw Santa’s face inside the flesh-colored cloud on your dried light bulb with permanent marker. Attach a cotton ball to the top of Santa’s red hat, or the socket top, with craft glue. Wind some string or fishing wire around the hat with a loop for hanging it up. Make a light bulb penguin for the holidays. Paint the entire back and sides of a frosted bulb black, leaving an hour glass shape in the front white, and allow it to dry. Cut the end off a finger from a child’s glove to make a hat for your penguin and glue a pom-pom to the top, then glue this to the narrow screw-top on your bulb. Tie a shiny gold ribbon that’s 3–4 inches (7.6–10.2 cm) in length into a bow and glue it around the neckline of your penguin. Use a black permanent maker to draw your penguin’s eyes up near the hat and buttons down the front below his bow tie. Cut ⁄4 inch (0.64 cm) off the pointed end of a toothpick and glue it onto your penguin’s face for its beak. Create a light bulb reindeer for the holidays. Use a colored bulb or paint a clear one any color you wish and allow it to dry. Glue a red pom-pom toward the end of the bulb opposite the screw top for the reindeer’s nose and glue a pair of googly eyes up near the screw top. Tie an 8 in (20 cm) piece of sparkly ribbon neatly around the screw top in a bow. Bend a 6 in (15 cm) piece of brown pipe cleaner into a U-shape and then make more small bends in each end for the antlers. Glue the antlers to the screw top behind the bow. Creating Vases Use needle-nose pliers to remove the brass contact and wires. Use a pair of needle-nose pliers to grip the little point on the end of the light bulb and give it a good twist. This breaks the brass contact and one of the wires leading to the filament. Pull these parts out with the pliers. Wear gloves and eye protection while hollowing out your light bulb in case it breaks. Use a screwdriver to break the fill tube inside the bulb. Once you can see inside the bulb, you’ll see a small tube connected to the parts in there. Dig in there with a screwdriver and break this tube. Once you have that out, you can shake the rest of the small parts from inside the bulb out. Empty the contents of the bulb onto a paper towel or cloth that you can easily throw away. Clean the inside of the bulb with soapy water. Take your empty light bulb to the kitchen sink. Fill it with some water and a couple drops of dish detergent, shake the soapy water around, and dump it down the drain. Dry your light bulb with paper towel. Stuff a crumpled paper towel into the end of your light bulb to dry it and wipe away any powder or glass bits that are left inside. Allow any remaining water to air dry. Paint the screw cap or the glass to add some sparkle. Use nail polish or any acrylic paint to hand paint your own design on your vase. Or you can paint the cap only for a simpler look. Allow your paint to fully dry before filling your vase with water and flowers. Fill your vase with water and flowers. Put water into your light bulb vase and some short cut flowers to place inside it. The weight of the water should allow your vase to stand on its own. Wrap some twine around the screw cap for a rustic look. If you’d like to hang your vase, tie some twine or ribbon around the cap. Hang the vases up on your porch or patio, or keep them on hooks inside. Finished. ",
  "sentences":[
    " Making Colored Light Bulbs Select a clear, 40 watt bulb.",
    "Light bulbs below 40 watts will also work.",
    "You just want to ensure that your paint withstands the heat made from the bulb once it’s turned on.",
    "Clear bulbs will give you the best effect of the light shining through the paint.",
    "You can use frosted bulbs, but the colored light coming through won’t be as vibrant.",
    "Purchase special heat-resistant glass paint.",
    "Find paint that is made for glass or safe for painting ceramics at your local craft store.",
    "Do not use regular acrylic or oil-based paint on light bulbs.",
    "When you turn your light bulb on, regular paint on the hot glass can cause your light bulb to explode.",
    "Examples of appropriate paint to use are DecoArt Glass-tiques, Decoart Liquid Rainbow, FolkArt Gallery Glass Liquid Leading, and Vitrea by Pebeo Clean your light bulbs with rubbing alcohol.",
    "You’ll want a clean, dust free surface for painting, so that the paint adheres to your bulb well.",
    "Soak a cotton ball with rubbing alcohol and rub your light bulb with it.",
    "Use soap and water if you don’t have any rubbing alcohol.",
    "Dry your bulb with a clean towel or allow it to air-dry for 1-2 minutes.",
    "Prop your light bulb up with tack.",
    "Use a small amount of blue tack or “sticky tack” to prop up your light bulb so that it won’t roll around while you paint.",
    "Blue tack is available at craft stores and in some office supply stores.",
    "You can also use Play-doh or some air-dry clay if you don’t have any blue tack.",
    "Use small brushes to apply your paint.",
    "Apply your first color in a light, thin layer and see how it looks.",
    "You can free-hand your picture, or use stencils by using peel-off stickers or stencils you design yourself with paper.",
    "Paint a detailed picture on your light bulb, cover it with stars or flowers, or simply make blocks of color for a stained glass or rainbow effect.",
    "For Halloween bulbs, paint pumpkins or ghosts on your light bulbs.",
    "For custom holiday lights, paint your bulbs red and green or with snowflakes.",
    "Allow air-dry paint to dry for 1 hour.",
    "If you’re using an air-dry glass paint, allow your bulb to remain standing on the tack for 1 hour to dry.",
    "Refrain from touching the bulb before it’s completely dry.",
    "Add more layers if you would like brighter colors.",
    "Some glass paints may need additional layers to get the effect that you want.",
    "Allow each layer to dry before adding new layers.",
    "Heat cure your light bulb in the oven if your paint requires it.",
    "Some glass paints, especially paints also used for ceramics, require heat curing.",
    "Follow any instructions on the packaging of your paint for heat-curing your light bulb in the oven.",
    "Remove any food or cooking items from your oven before using it to heat cure your light bulbs.",
    "Place your light bulb on an oven safe pan if your paint instructions require it.",
    "Allow your painted bulbs to cool completely in the oven after curing them.",
    "Turning Your Light Bulbs into Ornaments Make glass hot-air balloons for a whimsical décor.",
    "Use glass paint to make a hot-air balloon design of your choice onto your light bulbs.",
    "Glue four pieces of string up the sides of the light bulb and tie them all together in a knot at the top.",
    "Make a loop out of one string to hang the bulb, and trim the rest.",
    "Instead of painting the design on the bulb, you can attach fabric scraps with decoupage to the bulb before gluing on the strings.",
    "Make a light bulb turkey for fall.",
    "Paint your entire light bulb dark brown and allow it to dry completely.",
    "Paint 2 small wooden hearts orange and allow them to dry, then glue them side by side as feet on the wide bottom of your bulb.",
    "Glue a pair of googly eyes and an orange beak made from felt to the front of the bulb to make its face.",
    "Glue 6-8 fall-colored feathers to the back of the turkey in a splaying tail pattern.",
    "Add a small straw hat from a craft store to the top of the turkey’s head if you want.",
    "Make a snowman ornament for your holiday tree.",
    "Paint your light bulb with glue and cover it in white glitter.",
    "Allow that to dry, then use black puffy paint to make a snowman’s face and buttons, with the narrow socket side being the top.",
    "Hot glue small twigs on the sides of the bulb for snowman arms, and wrap the socket top tightly with twine, leaving a loop to hang onto your tree.",
    "For best results, use a frosted white light bulb.",
    "Create a Santa ornament for your tree.",
    "Using black permanent marker, draw an oval-shaped fluffy cloud onto your light bulb for the outline of Santa’s face.",
    "Fill this cloud in with acrylic paint of skin-tone color of your choice.",
    "Paint the rest of the bulb with white acrylic paint and the narrow socket top red.",
    "Allow your painted bulb to dry on a piece of Play-Doh for 1 hour.",
    "Draw Santa’s face inside the flesh-colored cloud on your dried light bulb with permanent marker.",
    "Attach a cotton ball to the top of Santa’s red hat, or the socket top, with craft glue.",
    "Wind some string or fishing wire around the hat with a loop for hanging it up.",
    "Make a light bulb penguin for the holidays.",
    "Paint the entire back and sides of a frosted bulb black, leaving an hour glass shape in the front white, and allow it to dry.",
    "Cut the end off a finger from a child’s glove to make a hat for your penguin and glue a pom-pom to the top, then glue this to the narrow screw-top on your bulb.",
    "Tie a shiny gold ribbon that’s 3–4 inches (7.6–10.2 cm) in length into a bow and glue it around the neckline of your penguin.",
    "Use a black permanent maker to draw your penguin’s eyes up near the hat and buttons down the front below his bow tie.",
    "Cut ⁄4 inch (0.64 cm) off the pointed end of a toothpick and glue it onto your penguin’s face for its beak.",
    "Create a light bulb reindeer for the holidays.",
    "Use a colored bulb or paint a clear one any color you wish and allow it to dry.",
    "Glue a red pom-pom toward the end of the bulb opposite the screw top for the reindeer’s nose and glue a pair of googly eyes up near the screw top.",
    "Tie an 8 in (20 cm) piece of sparkly ribbon neatly around the screw top in a bow.",
    "Bend a 6 in (15 cm) piece of brown pipe cleaner into a U-shape and then make more small bends in each end for the antlers.",
    "Glue the antlers to the screw top behind the bow.",
    "Creating Vases Use needle-nose pliers to remove the brass contact and wires.",
    "Use a pair of needle-nose pliers to grip the little point on the end of the light bulb and give it a good twist.",
    "This breaks the brass contact and one of the wires leading to the filament.",
    "Pull these parts out with the pliers.",
    "Wear gloves and eye protection while hollowing out your light bulb in case it breaks.",
    "Use a screwdriver to break the fill tube inside the bulb.",
    "Once you can see inside the bulb, you’ll see a small tube connected to the parts in there.",
    "Dig in there with a screwdriver and break this tube.",
    "Once you have that out, you can shake the rest of the small parts from inside the bulb out.",
    "Empty the contents of the bulb onto a paper towel or cloth that you can easily throw away.",
    "Clean the inside of the bulb with soapy water.",
    "Take your empty light bulb to the kitchen sink.",
    "Fill it with some water and a couple drops of dish detergent, shake the soapy water around, and dump it down the drain.",
    "Dry your light bulb with paper towel.",
    "Stuff a crumpled paper towel into the end of your light bulb to dry it and wipe away any powder or glass bits that are left inside.",
    "Allow any remaining water to air dry.",
    "Paint the screw cap or the glass to add some sparkle.",
    "Use nail polish or any acrylic paint to hand paint your own design on your vase.",
    "Or you can paint the cap only for a simpler look.",
    "Allow your paint to fully dry before filling your vase with water and flowers.",
    "Fill your vase with water and flowers.",
    "Put water into your light bulb vase and some short cut flowers to place inside it.",
    "The weight of the water should allow your vase to stand on its own.",
    "Wrap some twine around the screw cap for a rustic look.",
    "If you’d like to hang your vase, tie some twine or ribbon around the cap.",
    "Hang the vases up on your porch or patio, or keep them on hooks inside.",
    "Finished."
  ],
  "tyn_section":[
    "Making Colored Bulbs",
    "Clear 40-watt or below light bulbs",
    "Heat-resistant glass paint",
    "Small paint brushes",
    "Rubbing alcohol and cotton balls",
    "Blue tack",
    "Making Ornaments",
    "Paint and paint brushes",
    "White glitter and glue",
    "Twine or string",
    "Pom-poms and googly eyes",
    "Brown pipe cleaner",
    "Sparkly ribbon",
    "Black permanent marker",
    "Gloves and eye protection",
    "Needle-nosed pliers",
    "Screwdriver",
    "Dish soap and water",
    "Paper towels"
  ],
  "tyn_model":[
    "paint",
    "water",
    "light bulb",
    "rubbing alcohol",
    "twine",
    "acrylic paint",
    "paper towel",
    "cotton ball",
    "blue tack",
    "play-doh",
    "glass paints",
    "oven",
    "permanent marker",
    "pom-pom",
    "ribbon",
    "needle-nose pliers",
    "screwdriver",
    "soap",
    "“sticky tack",
    "” to",
    "air-dry clay",
    "air-dry glass paint",
    "paints",
    "oven safe pan",
    "hot-air balloons",
    "glass paint",
    "hot-air balloon",
    "light bulb turkey",
    "feathers",
    "glue",
    "white glitter",
    "puffy paint",
    "craft glue",
    "light bulb penguin",
    "permanent maker",
    "toothpick",
    "sparkly ribbon",
    "brown pipe cleaner",
    "pliers",
    "soapy water",
    "dish detergent",
    "nail polish",
    "light bulb vase",
    "short cut flowers"
  ],
  "simple_metrics":{
    "r":0.2105263158,
    "p":0.0909090909,
    "f1":0.126984127,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.4210526316,
    "p":0.2272727273,
    "f1":0.295202952
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.6842105263,
    "p":0.3636363636,
    "f1":0.4748858447
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3157894737,
    "p":0.1363636364,
    "f1":0.1904761905
  }
}