{
  "title":"How to Hang Voile and Curtains Together",
  "url":"https://www.wikihow.com/Hang-Voile-and-Curtains-Together",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows",
    "Window Treatments",
    "Curtains"
  ],
  "methods":[
    {
      "name":"Using a Double Curtain Rod",
      "steps":[
        {
          "headline":"Purchase a double curtain rod kit from a home improvement store.",
          "description":"These kits come with 2 curtain rods and curtain rod holders with brackets to hang the second curtain. A double curtain rod will allow the curtains and voile to hang at the same length without having to measure multiple holders. Choose decorative rods if you want the rods to add flair to the overall window treatment. If you don’t want the rods showing, choose concealed rods. Measure your windows first to make sure you get a rod that's the the right length."
        },
        {
          "headline":"Measure the length of curtains you want to hang using measuring tape.",
          "description":"Add 6 in (15 cm) to 12 in (30 cm) from the top of your window. Make a mark on either end of the window based on these measurements. Then, measure from this mark to where you want the curtains to end on the floor. For a traditional look, have the curtains stop just above the floor or touch the floor. If you prefer a luxurious look, consider having curtains long enough to puddle on the floor."
        },
        {
          "headline":"Measure the width of the window using measuring tape.",
          "description":"Include the window frame on each side when you measure the width. Add 10 in (25 cm) to either side of the window frame to create a balanced look."
        },
        {
          "headline":"Install the double curtain rod holders by using a screwdriver and screws.",
          "description":"Follow the manufacturer’s instructions to make sure you attach the correct pieces to the wall and the correct brackets to each holder. Use the marks you made to screw the curtain rod holders into the wall with a screwdriver and screws."
        },
        {
          "headline":"Feed the curtains and voile onto the curtain rods.",
          "description":"Put the curtains onto 1 rod and the voile onto the other rod. If the curtains have holes or several loops, you can choose to skip a hole or 2 to make fewer pleats in the curtain."
        },
        {
          "headline":"Hang the rods on the curtain rod holder.",
          "description":"The rod with the voile will go on the brackets closest to the window. The rod with the curtains will go on the bracket towards the front."
        }
      ]
    },
    {
      "name":"Using a Single Curtain Rod",
      "steps":[
        {
          "headline":"Measure where you would like to hang the rod using a measuring tape.",
          "description":"Measure the width of the window and add 10 in (25 cm) to either side. Measure the length of the curtain you want by adding 6 in (15 cm) to 12 in (30 cm) from the top of your window. Make a mark on either end of the window based on these measurements. Then, measure from this mark to where you want the curtains to end."
        },
        {
          "headline":"Purchase a single curtain rod kit from a home improvement store.",
          "description":"Choose a decorative rod if you would like it to be visible. If you want the to be rod out of site, choose a concealed rod. Purchase a curtain rod that fits the measurements you have made. Using an adjustable curtain rod will allow you to make sure the the rod fits your measurements."
        },
        {
          "headline":"Hang the curtain rod and curtains using the instructions on the label.",
          "description":"You will usually be told to use a screwdriver and screws to attach the curtain rod holder to the wall. Then thread the curtains onto the curtain rod."
        },
        {
          "headline":"Hang the voile using a bungee cord for a nice, draped look.",
          "description":"Use a bungee cord that has a hook on either end. Thread the voile through the bungee cord. Hook either end of the bungee cord to the curtain rod holders. Opt for a light-colored (white, gray, beige) bungee cord so it won’t show through the sheer voile once it is hung."
        },
        {
          "headline":"Use a tension rod if you want it to hang straight across the window.",
          "description":"Find a tension rod that is thin enough to fit through the loops in the voile. Thread the voile through the tension rod."
        }
      ]
    },
    {
      "name":"Hanging Without Curtain Rod Holders",
      "steps":[
        {
          "headline":"Purchase adhesive wall hooks, 2 curtain rods, and 4 rod endings.",
          "description":"You can find these items at a home improvement store or bed and bath store. The rod and rod endings will usually be sold together. Use lightweight rods that are adjustable. To add a personal touch, paint the wall hooks and pole endings using spray paint."
        },
        {
          "headline":"Mark the two spots on the wall where the wall hooks will attach to the wall.",
          "description":"Measure how far you want the curtain above the window by adding 6 in (15 cm) to 12 in (30 cm) from the top of your window. Make a mark on either end of the window based on these measurements."
        },
        {
          "headline":"Attach 2 wall hooks to the wall on the 2 marks.",
          "description":"Follow the label's instructions to expose the adhesive and stick it to the wall. These hooks will hold the rod with the curtains."
        },
        {
          "headline":"Attach the other 2 wall hooks to the wall.",
          "description":"Place the a hook below and to the right of where you placed the first left hook. Place the last hook below and to the left of the first right hook. These two hooks will be used to hang the curtain with the voile."
        },
        {
          "headline":"Hang the rods on the hooks you attached to the wall.",
          "description":"Thread the curtains and voile through the curtain rods. Place the rod with the voile on the bottom two hooks and the rod with the curtains on the top two hooks."
        }
      ]
    }
  ],
  "text":" Using a Double Curtain Rod Purchase a double curtain rod kit from a home improvement store. These kits come with 2 curtain rods and curtain rod holders with brackets to hang the second curtain. A double curtain rod will allow the curtains and voile to hang at the same length without having to measure multiple holders. Choose decorative rods if you want the rods to add flair to the overall window treatment. If you don’t want the rods showing, choose concealed rods. Measure your windows first to make sure you get a rod that's the the right length. Measure the length of curtains you want to hang using measuring tape. Add 6 in (15 cm) to 12 in (30 cm) from the top of your window. Make a mark on either end of the window based on these measurements. Then, measure from this mark to where you want the curtains to end on the floor. For a traditional look, have the curtains stop just above the floor or touch the floor. If you prefer a luxurious look, consider having curtains long enough to puddle on the floor. Measure the width of the window using measuring tape. Include the window frame on each side when you measure the width. Add 10 in (25 cm) to either side of the window frame to create a balanced look. Install the double curtain rod holders by using a screwdriver and screws. Follow the manufacturer’s instructions to make sure you attach the correct pieces to the wall and the correct brackets to each holder. Use the marks you made to screw the curtain rod holders into the wall with a screwdriver and screws. Feed the curtains and voile onto the curtain rods. Put the curtains onto 1 rod and the voile onto the other rod. If the curtains have holes or several loops, you can choose to skip a hole or 2 to make fewer pleats in the curtain. Hang the rods on the curtain rod holder. The rod with the voile will go on the brackets closest to the window. The rod with the curtains will go on the bracket towards the front. Using a Single Curtain Rod Measure where you would like to hang the rod using a measuring tape. Measure the width of the window and add 10 in (25 cm) to either side. Measure the length of the curtain you want by adding 6 in (15 cm) to 12 in (30 cm) from the top of your window. Make a mark on either end of the window based on these measurements. Then, measure from this mark to where you want the curtains to end. Purchase a single curtain rod kit from a home improvement store. Choose a decorative rod if you would like it to be visible. If you want the to be rod out of site, choose a concealed rod. Purchase a curtain rod that fits the measurements you have made. Using an adjustable curtain rod will allow you to make sure the the rod fits your measurements. Hang the curtain rod and curtains using the instructions on the label. You will usually be told to use a screwdriver and screws to attach the curtain rod holder to the wall. Then thread the curtains onto the curtain rod. Hang the voile using a bungee cord for a nice, draped look. Use a bungee cord that has a hook on either end. Thread the voile through the bungee cord. Hook either end of the bungee cord to the curtain rod holders. Opt for a light-colored (white, gray, beige) bungee cord so it won’t show through the sheer voile once it is hung. Use a tension rod if you want it to hang straight across the window. Find a tension rod that is thin enough to fit through the loops in the voile. Thread the voile through the tension rod. Hanging Without Curtain Rod Holders Purchase adhesive wall hooks, 2 curtain rods, and 4 rod endings. You can find these items at a home improvement store or bed and bath store. The rod and rod endings will usually be sold together. Use lightweight rods that are adjustable. To add a personal touch, paint the wall hooks and pole endings using spray paint. Mark the two spots on the wall where the wall hooks will attach to the wall. Measure how far you want the curtain above the window by adding 6 in (15 cm) to 12 in (30 cm) from the top of your window. Make a mark on either end of the window based on these measurements. Attach 2 wall hooks to the wall on the 2 marks. Follow the label's instructions to expose the adhesive and stick it to the wall. These hooks will hold the rod with the curtains. Attach the other 2 wall hooks to the wall. Place the a hook below and to the right of where you placed the first left hook. Place the last hook below and to the left of the first right hook. These two hooks will be used to hang the curtain with the voile. Hang the rods on the hooks you attached to the wall. Thread the curtains and voile through the curtain rods. Place the rod with the voile on the bottom two hooks and the rod with the curtains on the top two hooks.",
  "sentences":[
    " Using a Double Curtain Rod Purchase a double curtain rod kit from a home improvement store.",
    "These kits come with 2 curtain rods and curtain rod holders with brackets to hang the second curtain.",
    "A double curtain rod will allow the curtains and voile to hang at the same length without having to measure multiple holders.",
    "Choose decorative rods if you want the rods to add flair to the overall window treatment.",
    "If you don’t want the rods showing, choose concealed rods.",
    "Measure your windows first to make sure you get a rod that's the the right length.",
    "Measure the length of curtains you want to hang using measuring tape.",
    "Add 6 in (15 cm) to 12 in (30 cm) from the top of your window.",
    "Make a mark on either end of the window based on these measurements.",
    "Then, measure from this mark to where you want the curtains to end on the floor.",
    "For a traditional look, have the curtains stop just above the floor or touch the floor.",
    "If you prefer a luxurious look, consider having curtains long enough to puddle on the floor.",
    "Measure the width of the window using measuring tape.",
    "Include the window frame on each side when you measure the width.",
    "Add 10 in (25 cm) to either side of the window frame to create a balanced look.",
    "Install the double curtain rod holders by using a screwdriver and screws.",
    "Follow the manufacturer’s instructions to make sure you attach the correct pieces to the wall and the correct brackets to each holder.",
    "Use the marks you made to screw the curtain rod holders into the wall with a screwdriver and screws.",
    "Feed the curtains and voile onto the curtain rods.",
    "Put the curtains onto 1 rod and the voile onto the other rod.",
    "If the curtains have holes or several loops, you can choose to skip a hole or 2 to make fewer pleats in the curtain.",
    "Hang the rods on the curtain rod holder.",
    "The rod with the voile will go on the brackets closest to the window.",
    "The rod with the curtains will go on the bracket towards the front.",
    "Using a Single Curtain Rod Measure where you would like to hang the rod using a measuring tape.",
    "Measure the width of the window and add 10 in (25 cm) to either side.",
    "Measure the length of the curtain you want by adding 6 in (15 cm) to 12 in (30 cm) from the top of your window.",
    "Make a mark on either end of the window based on these measurements.",
    "Then, measure from this mark to where you want the curtains to end.",
    "Purchase a single curtain rod kit from a home improvement store.",
    "Choose a decorative rod if you would like it to be visible.",
    "If you want the to be rod out of site, choose a concealed rod.",
    "Purchase a curtain rod that fits the measurements you have made.",
    "Using an adjustable curtain rod will allow you to make sure the the rod fits your measurements.",
    "Hang the curtain rod and curtains using the instructions on the label.",
    "You will usually be told to use a screwdriver and screws to attach the curtain rod holder to the wall.",
    "Then thread the curtains onto the curtain rod.",
    "Hang the voile using a bungee cord for a nice, draped look.",
    "Use a bungee cord that has a hook on either end.",
    "Thread the voile through the bungee cord.",
    "Hook either end of the bungee cord to the curtain rod holders.",
    "Opt for a light-colored (white, gray, beige) bungee cord so it won’t show through the sheer voile once it is hung.",
    "Use a tension rod if you want it to hang straight across the window.",
    "Find a tension rod that is thin enough to fit through the loops in the voile.",
    "Thread the voile through the tension rod.",
    "Hanging Without Curtain Rod Holders Purchase adhesive wall hooks, 2 curtain rods, and 4 rod endings.",
    "You can find these items at a home improvement store or bed and bath store.",
    "The rod and rod endings will usually be sold together.",
    "Use lightweight rods that are adjustable.",
    "To add a personal touch, paint the wall hooks and pole endings using spray paint.",
    "Mark the two spots on the wall where the wall hooks will attach to the wall.",
    "Measure how far you want the curtain above the window by adding 6 in (15 cm) to 12 in (30 cm) from the top of your window.",
    "Make a mark on either end of the window based on these measurements.",
    "Attach 2 wall hooks to the wall on the 2 marks.",
    "Follow the label's instructions to expose the adhesive and stick it to the wall.",
    "These hooks will hold the rod with the curtains.",
    "Attach the other 2 wall hooks to the wall.",
    "Place the a hook below and to the right of where you placed the first left hook.",
    "Place the last hook below and to the left of the first right hook.",
    "These two hooks will be used to hang the curtain with the voile.",
    "Hang the rods on the hooks you attached to the wall.",
    "Thread the curtains and voile through the curtain rods.",
    "Place the rod with the voile on the bottom two hooks and the rod with the curtains on the top two hooks."
  ],
  "tyn_section":[
    "Double curtain rod kit",
    "Measuring tape",
    "Screwdriver",
    "Screws",
    "Single curtain rod kit",
    "Bungee cord, optional",
    "Tension rod, optional",
    "Adhesive wall hooks",
    "2 curtain rods"
  ],
  "tyn_model":[
    "curtain rod",
    "curtains",
    "bungee cord",
    "curtain rods",
    "wall hooks",
    "screwdriver",
    "screws",
    "tension rod",
    "voile",
    "double curtain rod",
    "rods",
    "measuring tape",
    "home improvement store",
    "decorative rod",
    "adjustable curtain rod",
    "spray paint",
    "curtain",
    "adhesive"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.1666666667,
    "f1":0.2222222222,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.7777777778,
    "p":0.3888888889,
    "f1":0.5185185185
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.7777777778,
    "p":0.6111111111,
    "f1":0.6844444444
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.6666666667,
    "p":0.3333333333,
    "f1":0.4444444444
  }
}