{
  "title":"How to Crochet Corner to Corner",
  "url":"https://www.wikihow.com/Crochet-Corner-to-Corner",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Crochet"
  ],
  "parts":[
    {
      "name":"Making the Foundation Square",
      "steps":[
        {
          "headline":"Make a slipknot.",
          "description":"Crochet work always begins with a slipknot. To make one, loop the yarn around your finger twice and pull the first loop over the second loop. Then, tug on the free end of the yarn to tighten the knot. Slide the loop onto your crochet hook and tighten the loop some more. The loop should be snug on the crochet hook."
        },
        {
          "headline":"Chain 6.",
          "description":"To start your corner to corner crochet project, make a chain of 6. Loop the yarn over the hook in front of the slipknot. Then, pull this loop through the slipknot. This is your first chain. Repeat this 5 more times to make a total of 6 chains. Practice chaining if you are new to crochet."
        },
        {
          "headline":"Double crochet once into the fourth chain from the hook.",
          "description":"To double crochet, loop the yarn over the hook and insert the hook into the fourth chain from the hook. Then, yarn over again and pull through the first stitch. Yarn over again and pull through 2 loops. Then, yarn over 1 more time and pull through the remaining loops on the hook. This will complete 1 double crochet stitch. Practice double crochet if you are new to crochet."
        },
        {
          "headline":"Double crochet once into the next 2 chains.",
          "description":"To finish the foundation square, double crochet 1 time into each of the next 2 chains. This completes the foundation square."
        }
      ]
    },
    {
      "name":"Increasing in Corner to Corner Crochet",
      "steps":[
        {
          "headline":"Turn and chain 6 again.",
          "description":"Making the next square and increasing the width of your rows is similar to making the first square. Begin the new square by turning your work around and then make a chain of 6. This is how you will begin each new row. If desired, change colors before you begin work a new row. Tie the new yarn to the base of the last stitch in a row and then use the new yarn to work the stitches in the new row."
        },
        {
          "headline":"Double crochet into the fourth chain from the hook 1 time.",
          "description":"Next, double crochet into the fourth chain from the hook."
        },
        {
          "headline":"Double crochet 1 time into the next 2 chains.",
          "description":"Next, double crochet into the fifth and sixth chains from the hook."
        },
        {
          "headline":"Slipstitch into the top chain to join the squares.",
          "description":"You should now have two squares that are connected at the bottom by a chain. To connect them at the top as well, insert the hook into the top chain of the square next to it. Then, yarn over the hook and pull through both loops on the hook. This will bind the squares together."
        },
        {
          "headline":"Chain 3.",
          "description":"To begin the next square, make a chain of 3. You will need to do this each time you start a new square after completing the first square."
        },
        {
          "headline":"Double crochet 3 times into the top chain.",
          "description":"To create the next square, double crochet 3 times into the chain that is along the top of the first square you made. This will complete the second and final square in the second row, and you do not need to do anything else. To create more squares for other wider rows, repeat the chain 3 and double crochet 3 times into the chain until you reach the end."
        },
        {
          "headline":"Repeat the process to add more squares.",
          "description":"Start over at the beginning to add more rows and more squares to your corner to corner crochet project. Keep going until the project is the width you want it to be."
        }
      ]
    },
    {
      "name":"Decreasing in Corner to Corner Crochet",
      "steps":[
        {
          "headline":"Chain 1 and turn.",
          "description":"Start decreasing the width of the rows when you have finished your longest row. Make a chain of 1 and then turn your work around."
        },
        {
          "headline":"Slipstitch into the first 2 stitches and chain 3 space.",
          "description":"Instead of starting your first decrease row with a chain of 3, start by slipstitching 3 times. Slipstitch 1 time into each of the first 2 stitches, and then 1 time into the chain 3 space. This will serve as your decrease for the row."
        },
        {
          "headline":"Chain 3.",
          "description":"Work the rest of the row the same as the previous rows. Start with a chain of 3."
        },
        {
          "headline":"Work 3 double crochet stitches into chain 3 space.",
          "description":"Next, work your 3 double crochet stitches into the chain 3 space. This will build the first square in the first decrease row."
        },
        {
          "headline":"Repeat chain of 3 and 3 double crochet stitches to the second to last square.",
          "description":"Keep repeating the chain of 3 and 3 double crochet stitches until you complete the second to last square in the row."
        },
        {
          "headline":"Slipstitch into last 3 stitches.",
          "description":"To complete the first decrease row and all subsequent decrease rows, slipstitch into the last 3 stitches instead of creating another square. This will complete the decrease row. If desired, you can change yarn colors after each decrease row. Tie the new yarn to the base of the last stitch, and then use the new yarn to work the next row."
        },
        {
          "headline":"Repeat the process to continue decreasing.",
          "description":"To continue your decreases, repeat the same process over again. Keep going until you only have 1 square left."
        },
        {
          "headline":"Tie off the last stitch.",
          "description":"Tie off the end strand of your final stitch by pulling the end of the yarn all the way through the stitch. Pull the tail of the yarn to create a knot with the final stitch. Then, cut the excess above the knot and you are all finished!"
        }
      ]
    }
  ],
  "text":" Making the Foundation Square Make a slipknot. Crochet work always begins with a slipknot. To make one, loop the yarn around your finger twice and pull the first loop over the second loop. Then, tug on the free end of the yarn to tighten the knot. Slide the loop onto your crochet hook and tighten the loop some more. The loop should be snug on the crochet hook. Chain 6. To start your corner to corner crochet project, make a chain of 6. Loop the yarn over the hook in front of the slipknot. Then, pull this loop through the slipknot. This is your first chain. Repeat this 5 more times to make a total of 6 chains. Practice chaining if you are new to crochet. Double crochet once into the fourth chain from the hook. To double crochet, loop the yarn over the hook and insert the hook into the fourth chain from the hook. Then, yarn over again and pull through the first stitch. Yarn over again and pull through 2 loops. Then, yarn over 1 more time and pull through the remaining loops on the hook. This will complete 1 double crochet stitch. Practice double crochet if you are new to crochet. Double crochet once into the next 2 chains. To finish the foundation square, double crochet 1 time into each of the next 2 chains. This completes the foundation square. Increasing in Corner to Corner Crochet Turn and chain 6 again. Making the next square and increasing the width of your rows is similar to making the first square. Begin the new square by turning your work around and then make a chain of 6. This is how you will begin each new row. If desired, change colors before you begin work a new row. Tie the new yarn to the base of the last stitch in a row and then use the new yarn to work the stitches in the new row. Double crochet into the fourth chain from the hook 1 time. Next, double crochet into the fourth chain from the hook. Double crochet 1 time into the next 2 chains. Next, double crochet into the fifth and sixth chains from the hook. Slipstitch into the top chain to join the squares. You should now have two squares that are connected at the bottom by a chain. To connect them at the top as well, insert the hook into the top chain of the square next to it. Then, yarn over the hook and pull through both loops on the hook. This will bind the squares together. Chain 3. To begin the next square, make a chain of 3. You will need to do this each time you start a new square after completing the first square. Double crochet 3 times into the top chain. To create the next square, double crochet 3 times into the chain that is along the top of the first square you made. This will complete the second and final square in the second row, and you do not need to do anything else. To create more squares for other wider rows, repeat the chain 3 and double crochet 3 times into the chain until you reach the end. Repeat the process to add more squares. Start over at the beginning to add more rows and more squares to your corner to corner crochet project. Keep going until the project is the width you want it to be. Decreasing in Corner to Corner Crochet Chain 1 and turn. Start decreasing the width of the rows when you have finished your longest row. Make a chain of 1 and then turn your work around. Slipstitch into the first 2 stitches and chain 3 space. Instead of starting your first decrease row with a chain of 3, start by slipstitching 3 times. Slipstitch 1 time into each of the first 2 stitches, and then 1 time into the chain 3 space. This will serve as your decrease for the row. Chain 3. Work the rest of the row the same as the previous rows. Start with a chain of 3. Work 3 double crochet stitches into chain 3 space. Next, work your 3 double crochet stitches into the chain 3 space. This will build the first square in the first decrease row. Repeat chain of 3 and 3 double crochet stitches to the second to last square. Keep repeating the chain of 3 and 3 double crochet stitches until you complete the second to last square in the row. Slipstitch into last 3 stitches. To complete the first decrease row and all subsequent decrease rows, slipstitch into the last 3 stitches instead of creating another square. This will complete the decrease row. If desired, you can change yarn colors after each decrease row. Tie the new yarn to the base of the last stitch, and then use the new yarn to work the next row. Repeat the process to continue decreasing. To continue your decreases, repeat the same process over again. Keep going until you only have 1 square left. Tie off the last stitch. Tie off the end strand of your final stitch by pulling the end of the yarn all the way through the stitch. Pull the tail of the yarn to create a knot with the final stitch. Then, cut the excess above the knot and you are all finished!",
  "sentences":[
    " Making the Foundation Square Make a slipknot.",
    "Crochet work always begins with a slipknot.",
    "To make one, loop the yarn around your finger twice and pull the first loop over the second loop.",
    "Then, tug on the free end of the yarn to tighten the knot.",
    "Slide the loop onto your crochet hook and tighten the loop some more.",
    "The loop should be snug on the crochet hook.",
    "Chain 6.",
    "To start your corner to corner crochet project, make a chain of 6.",
    "Loop the yarn over the hook in front of the slipknot.",
    "Then, pull this loop through the slipknot.",
    "This is your first chain.",
    "Repeat this 5 more times to make a total of 6 chains.",
    "Practice chaining if you are new to crochet.",
    "Double crochet once into the fourth chain from the hook.",
    "To double crochet, loop the yarn over the hook and insert the hook into the fourth chain from the hook.",
    "Then, yarn over again and pull through the first stitch.",
    "Yarn over again and pull through 2 loops.",
    "Then, yarn over 1 more time and pull through the remaining loops on the hook.",
    "This will complete 1 double crochet stitch.",
    "Practice double crochet if you are new to crochet.",
    "Double crochet once into the next 2 chains.",
    "To finish the foundation square, double crochet 1 time into each of the next 2 chains.",
    "This completes the foundation square.",
    "Increasing in Corner to Corner Crochet Turn and chain 6 again.",
    "Making the next square and increasing the width of your rows is similar to making the first square.",
    "Begin the new square by turning your work around and then make a chain of 6.",
    "This is how you will begin each new row.",
    "If desired, change colors before you begin work a new row.",
    "Tie the new yarn to the base of the last stitch in a row and then use the new yarn to work the stitches in the new row.",
    "Double crochet into the fourth chain from the hook 1 time.",
    "Next, double crochet into the fourth chain from the hook.",
    "Double crochet 1 time into the next 2 chains.",
    "Next, double crochet into the fifth and sixth chains from the hook.",
    "Slipstitch into the top chain to join the squares.",
    "You should now have two squares that are connected at the bottom by a chain.",
    "To connect them at the top as well, insert the hook into the top chain of the square next to it.",
    "Then, yarn over the hook and pull through both loops on the hook.",
    "This will bind the squares together.",
    "Chain 3.",
    "To begin the next square, make a chain of 3.",
    "You will need to do this each time you start a new square after completing the first square.",
    "Double crochet 3 times into the top chain.",
    "To create the next square, double crochet 3 times into the chain that is along the top of the first square you made.",
    "This will complete the second and final square in the second row, and you do not need to do anything else.",
    "To create more squares for other wider rows, repeat the chain 3 and double crochet 3 times into the chain until you reach the end.",
    "Repeat the process to add more squares.",
    "Start over at the beginning to add more rows and more squares to your corner to corner crochet project.",
    "Keep going until the project is the width you want it to be.",
    "Decreasing in Corner to Corner Crochet Chain 1 and turn.",
    "Start decreasing the width of the rows when you have finished your longest row.",
    "Make a chain of 1 and then turn your work around.",
    "Slipstitch into the first 2 stitches and chain 3 space.",
    "Instead of starting your first decrease row with a chain of 3, start by slipstitching 3 times.",
    "Slipstitch 1 time into each of the first 2 stitches, and then 1 time into the chain 3 space.",
    "This will serve as your decrease for the row.",
    "Chain 3.",
    "Work the rest of the row the same as the previous rows.",
    "Start with a chain of 3.",
    "Work 3 double crochet stitches into chain 3 space.",
    "Next, work your 3 double crochet stitches into the chain 3 space.",
    "This will build the first square in the first decrease row.",
    "Repeat chain of 3 and 3 double crochet stitches to the second to last square.",
    "Keep repeating the chain of 3 and 3 double crochet stitches until you complete the second to last square in the row.",
    "Slipstitch into last 3 stitches.",
    "To complete the first decrease row and all subsequent decrease rows, slipstitch into the last 3 stitches instead of creating another square.",
    "This will complete the decrease row.",
    "If desired, you can change yarn colors after each decrease row.",
    "Tie the new yarn to the base of the last stitch, and then use the new yarn to work the next row.",
    "Repeat the process to continue decreasing.",
    "To continue your decreases, repeat the same process over again.",
    "Keep going until you only have 1 square left.",
    "Tie off the last stitch.",
    "Tie off the end strand of your final stitch by pulling the end of the yarn all the way through the stitch.",
    "Pull the tail of the yarn to create a knot with the final stitch.",
    "Then, cut the excess above the knot and you are all finished!"
  ],
  "tyn_section":[
    "Yarn",
    "Crochet hook (check your yarn label to see what size hook is recommended)",
    "Scissors"
  ],
  "tyn_model":[
    "yarn",
    "crochet hook",
    "double crochet"
  ],
  "simple_metrics":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.3333333333,
    "p":0.3333333333,
    "f1":0.3333333333
  }
}