{
  "title":"How to Fill Asphalt Cracks",
  "url":"https://www.wikihow.com/Fill-Asphalt-Cracks",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Paths and Paving"
  ],
  "methods":[
    {
      "name":"Filling Asphalt Cracks with Sealant",
      "steps":[
        {
          "headline":"Make sure the crack and surrounding area are dry.",
          "description":"Wait for a sunny day with no rain. The goal of filling in the crack is to prevent water from getting in, so make sure that your surface is dry before you start working."
        },
        {
          "headline":"Remove vegetation or jagged pieces of asphalt with a chisel or screwdriver.",
          "description":"If vegetation is growing in the crack, or jagged pieces of asphalt are sticking out into the crack, use a chisel or screwdriver to force them out. If a piece of asphalt falls in, be sure to pull it out. You don't want your sealant to stick to something loose, as this will make it less stable."
        },
        {
          "headline":"Brush away debris, then blow compressed air into the crack.",
          "description":"Use a brush to get rid of stray debris hanging around the edge of the crack. Then, using compressed air, blow all the debris you can out of the crack. You want to make sure the crack is completely clean. Otherwise, the sealant will stick to the debris inside the crack, instead of the walls of the crack itself."
        },
        {
          "headline":"Prepare your asphalt sealant by shaking it and cutting the tip.",
          "description":"Mix up your asphalt crack sealant by shaking it up and down. If you're using sealant for a caulk gun, cut the tip with scissors, making sure that the spout is no larger than the crack itself. You may need to break the seal inside the tip, so stick a wire hanger or something similarly sturdy into the tube’s tip before trying to use it. If there is a seal, you’ll feel it break."
        },
        {
          "headline":"Load the asphalt sealant into the caulk gun.",
          "description":"Pull the rod on the gun all the way back and insert the tube of sealant base-first. Squeeze the trigger to test the caulk gun. The sealant should flow easily out of the tip. If not, try checking the seal again."
        },
        {
          "headline":"Fill the crack with sealant, then even it out.",
          "description":"Apply the sealant, starting at the bottom of the crack and working your way down its length. Layer the sealant until it’s flush with the top of the crack. Use the trowel to even out the sealant and tamp it down into the crack. If this pushes the sealant below the top of the crack, apply more sealant until it’s full."
        },
        {
          "headline":"Avoid walking or driving on your driveway for 48 hours.",
          "description":"After applying your sealant, wait a few days to put pressure on the asphalt, as the sealant needs time to solidify."
        }
      ]
    },
    {
      "name":"Filling Hairline Asphalt Cracks with Melt-in Filler",
      "steps":[
        {
          "headline":"Start on a sunny day with no rain.",
          "description":"Cracks develop when water seeps into the concrete, so you don't want extra water while you're filling the crack."
        },
        {
          "headline":"Widen the crack with the angle grinder.",
          "description":"Put the diamond wheel into one end of the crack and start pulling backwards to widen the crack. Widening the crack will help you apply the crack filler rope later."
        },
        {
          "headline":"Use the chisel or screwdriver to dig out vegetation.",
          "description":"Dig out growing vegetation with your chisel or screwdriver. This will help the melt-in filler adhere to the sides of the crack."
        },
        {
          "headline":"Blow compressed air into the crack.",
          "description":"Using the compressed air can, blow as much debris as you can out of the crack. Make sure the crack is completely free of debris. Otherwise, the sealant will stick to the debris, not the walls of the crack."
        },
        {
          "headline":"Push the crack filler rope into the crack.",
          "description":"Using your chisel or screwdriver, jam the rope into the crack all the way down its length. Be sure to push the rope all the way to the bottom of the crack. If the crack is deep enough to necessitate a second length of crack filler rope, layer it on top of the first one, but make sure it's not above the surface."
        },
        {
          "headline":"Hammer the rope into the crack.",
          "description":"Use the hammer to smash the rope down into the crack about .10 inches (2.5 mm) below the surface of the crack."
        },
        {
          "headline":"Melt the crack filler rope with the propane torch.",
          "description":"Sweeping slowly from side to side on a section of 12 inches (30 cm), focus the propane torch's tip on the rope until it begins to melt. Once it starts melting, move onto the next section. Repeat until the filler begins to level out and sink into the crack. The filler may begin to burn. Don't panic! Just blow out the flames and start again, this time a little farther away from the filler."
        },
        {
          "headline":"Allow the filler to cool, then apply the trowel mix to the crack.",
          "description":"Wait at least 20 minutes for the filler to cool. Then, cover the crack with trowel mix and smooth it out with a trowel."
        },
        {
          "headline":"Let the patch dry overnight, then apply a second coat if necessary.",
          "description":"In the morning, check to see if a depression has formed where the crack is. If so, spread another layer of trowel mix. This will help even your driveway out."
        }
      ]
    }
  ],
  "text":" Filling Asphalt Cracks with Sealant Make sure the crack and surrounding area are dry. Wait for a sunny day with no rain. The goal of filling in the crack is to prevent water from getting in, so make sure that your surface is dry before you start working. Remove vegetation or jagged pieces of asphalt with a chisel or screwdriver. If vegetation is growing in the crack, or jagged pieces of asphalt are sticking out into the crack, use a chisel or screwdriver to force them out. If a piece of asphalt falls in, be sure to pull it out. You don't want your sealant to stick to something loose, as this will make it less stable. Brush away debris, then blow compressed air into the crack. Use a brush to get rid of stray debris hanging around the edge of the crack. Then, using compressed air, blow all the debris you can out of the crack. You want to make sure the crack is completely clean. Otherwise, the sealant will stick to the debris inside the crack, instead of the walls of the crack itself. Prepare your asphalt sealant by shaking it and cutting the tip. Mix up your asphalt crack sealant by shaking it up and down. If you're using sealant for a caulk gun, cut the tip with scissors, making sure that the spout is no larger than the crack itself. You may need to break the seal inside the tip, so stick a wire hanger or something similarly sturdy into the tube’s tip before trying to use it. If there is a seal, you’ll feel it break. Load the asphalt sealant into the caulk gun. Pull the rod on the gun all the way back and insert the tube of sealant base-first. Squeeze the trigger to test the caulk gun. The sealant should flow easily out of the tip. If not, try checking the seal again. Fill the crack with sealant, then even it out. Apply the sealant, starting at the bottom of the crack and working your way down its length. Layer the sealant until it’s flush with the top of the crack. Use the trowel to even out the sealant and tamp it down into the crack. If this pushes the sealant below the top of the crack, apply more sealant until it’s full. Avoid walking or driving on your driveway for 48 hours. After applying your sealant, wait a few days to put pressure on the asphalt, as the sealant needs time to solidify. Filling Hairline Asphalt Cracks with Melt-in Filler Start on a sunny day with no rain. Cracks develop when water seeps into the concrete, so you don't want extra water while you're filling the crack. Widen the crack with the angle grinder. Put the diamond wheel into one end of the crack and start pulling backwards to widen the crack. Widening the crack will help you apply the crack filler rope later. Use the chisel or screwdriver to dig out vegetation. Dig out growing vegetation with your chisel or screwdriver. This will help the melt-in filler adhere to the sides of the crack. Blow compressed air into the crack. Using the compressed air can, blow as much debris as you can out of the crack. Make sure the crack is completely free of debris. Otherwise, the sealant will stick to the debris, not the walls of the crack. Push the crack filler rope into the crack. Using your chisel or screwdriver, jam the rope into the crack all the way down its length. Be sure to push the rope all the way to the bottom of the crack. If the crack is deep enough to necessitate a second length of crack filler rope, layer it on top of the first one, but make sure it's not above the surface. Hammer the rope into the crack. Use the hammer to smash the rope down into the crack about .10 inches (2.5 mm) below the surface of the crack. Melt the crack filler rope with the propane torch. Sweeping slowly from side to side on a section of 12 inches (30 cm), focus the propane torch's tip on the rope until it begins to melt. Once it starts melting, move onto the next section. Repeat until the filler begins to level out and sink into the crack. The filler may begin to burn. Don't panic! Just blow out the flames and start again, this time a little farther away from the filler. Allow the filler to cool, then apply the trowel mix to the crack. Wait at least 20 minutes for the filler to cool. Then, cover the crack with trowel mix and smooth it out with a trowel. Let the patch dry overnight, then apply a second coat if necessary. In the morning, check to see if a depression has formed where the crack is. If so, spread another layer of trowel mix. This will help even your driveway out.",
  "sentences":[
    " Filling Asphalt Cracks with Sealant Make sure the crack and surrounding area are dry.",
    "Wait for a sunny day with no rain.",
    "The goal of filling in the crack is to prevent water from getting in, so make sure that your surface is dry before you start working.",
    "Remove vegetation or jagged pieces of asphalt with a chisel or screwdriver.",
    "If vegetation is growing in the crack, or jagged pieces of asphalt are sticking out into the crack, use a chisel or screwdriver to force them out.",
    "If a piece of asphalt falls in, be sure to pull it out.",
    "You don't want your sealant to stick to something loose, as this will make it less stable.",
    "Brush away debris, then blow compressed air into the crack.",
    "Use a brush to get rid of stray debris hanging around the edge of the crack.",
    "Then, using compressed air, blow all the debris you can out of the crack.",
    "You want to make sure the crack is completely clean.",
    "Otherwise, the sealant will stick to the debris inside the crack, instead of the walls of the crack itself.",
    "Prepare your asphalt sealant by shaking it and cutting the tip.",
    "Mix up your asphalt crack sealant by shaking it up and down.",
    "If you're using sealant for a caulk gun, cut the tip with scissors, making sure that the spout is no larger than the crack itself.",
    "You may need to break the seal inside the tip, so stick a wire hanger or something similarly sturdy into the tube’s tip before trying to use it.",
    "If there is a seal, you’ll feel it break.",
    "Load the asphalt sealant into the caulk gun.",
    "Pull the rod on the gun all the way back and insert the tube of sealant base-first.",
    "Squeeze the trigger to test the caulk gun.",
    "The sealant should flow easily out of the tip.",
    "If not, try checking the seal again.",
    "Fill the crack with sealant, then even it out.",
    "Apply the sealant, starting at the bottom of the crack and working your way down its length.",
    "Layer the sealant until it’s flush with the top of the crack.",
    "Use the trowel to even out the sealant and tamp it down into the crack.",
    "If this pushes the sealant below the top of the crack, apply more sealant until it’s full.",
    "Avoid walking or driving on your driveway for 48 hours.",
    "After applying your sealant, wait a few days to put pressure on the asphalt, as the sealant needs time to solidify.",
    "Filling Hairline Asphalt Cracks with Melt-in Filler Start on a sunny day with no rain.",
    "Cracks develop when water seeps into the concrete, so you don't want extra water while you're filling the crack.",
    "Widen the crack with the angle grinder.",
    "Put the diamond wheel into one end of the crack and start pulling backwards to widen the crack.",
    "Widening the crack will help you apply the crack filler rope later.",
    "Use the chisel or screwdriver to dig out vegetation.",
    "Dig out growing vegetation with your chisel or screwdriver.",
    "This will help the melt-in filler adhere to the sides of the crack.",
    "Blow compressed air into the crack.",
    "Using the compressed air can, blow as much debris as you can out of the crack.",
    "Make sure the crack is completely free of debris.",
    "Otherwise, the sealant will stick to the debris, not the walls of the crack.",
    "Push the crack filler rope into the crack.",
    "Using your chisel or screwdriver, jam the rope into the crack all the way down its length.",
    "Be sure to push the rope all the way to the bottom of the crack.",
    "If the crack is deep enough to necessitate a second length of crack filler rope, layer it on top of the first one, but make sure it's not above the surface.",
    "Hammer the rope into the crack.",
    "Use the hammer to smash the rope down into the crack about .10 inches (2.5 mm) below the surface of the crack.",
    "Melt the crack filler rope with the propane torch.",
    "Sweeping slowly from side to side on a section of 12 inches (30 cm), focus the propane torch's tip on the rope until it begins to melt.",
    "Once it starts melting, move onto the next section.",
    "Repeat until the filler begins to level out and sink into the crack.",
    "The filler may begin to burn.",
    "Don't panic!",
    "Just blow out the flames and start again, this time a little farther away from the filler.",
    "Allow the filler to cool, then apply the trowel mix to the crack.",
    "Wait at least 20 minutes for the filler to cool.",
    "Then, cover the crack with trowel mix and smooth it out with a trowel.",
    "Let the patch dry overnight, then apply a second coat if necessary.",
    "In the morning, check to see if a depression has formed where the crack is.",
    "If so, spread another layer of trowel mix.",
    "This will help even your driveway out."
  ],
  "tyn_section":[
    "A chisel or screwdriver",
    "A paintbrush",
    "A can of compressed air (the kind used for cleaning out computers)",
    "A caulk gun (optional)",
    "Asphalt crack sealant (buy either the kind for use in a caulk gun, with a long tip, or buy it in a jug)",
    "A trowel",
    "Filling Asphalt Cracks with Melt-in Filler",
    "Asphalt crack filler rope (enough to fill the crack)",
    "Trowel patch (sold in hardware store in large jugs)",
    "An angle grinder with a diamond wheel",
    "A hammer",
    "A propane torch"
  ],
  "tyn_model":[
    "sealant",
    "chisel",
    "trowel",
    "filler",
    "asphalt",
    "compressed air",
    "screwdriver",
    "caulk gun",
    "crack filler rope",
    "rope",
    "asphalt sealant",
    "propane torch",
    "brush",
    "asphalt crack sealant",
    "scissors",
    "wire hanger",
    "concrete",
    "angle grinder",
    "diamond wheel",
    "crack filler",
    "hammer"
  ],
  "simple_metrics":{
    "r":0.0,
    "p":0.0,
    "f1":0,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1904761905,
    "f1":0.2424242424
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.4166666667,
    "p":0.2380952381,
    "f1":0.303030303
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.0833333333,
    "p":0.0476190476,
    "f1":0.0606060606
  }
}