{
  "title":"How to Install Hygienic Wall Cladding",
  "url":"https://www.wikihow.com/Install-Hygienic-Wall-Cladding",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings"
  ],
  "parts":[
    {
      "name":"Preparing the Wall Surface",
      "steps":[
        {
          "headline":"Make sure that your room and walls can withstand high-humidity.",
          "description":"There are lots of reasons why someone might want to install hygienic wall cladding, and 1 of these is to protect rooms that receive high levels of humidity. Even so, wall cladding can’t do all of the work for you, so make sure that your wall is able to withstand high levels of moisture. If the walls can't withstand high levels of moisture, you'll need to install furring strips with mechanical wall fasteners. This will give the panels something to stick to."
        },
        {
          "headline":"Clean any dirt, grease, or grime from the walls.",
          "description":"There cannot be any dust, dirt, or grease on the wall, as this will prevent the glue from bonding properly. Even if the wall looks clean, wipe it down with a damp, dust-free cloth, then let it dry completely. If there is any loose wallpaper or peeling paint, you should remove it as well. If your walls are made from concrete, they must be fully cured and dry before you begin."
        },
        {
          "headline":"Sand away any bumps and fill in any dips.",
          "description":"The wall surface must be completely flat in order for good adhesion to occur. Use wall putty to fill in any dips, and a sanding block to smooth away any bumps or unevenness. If the wall is made from concrete or brick, fill it in with plaster or concrete instead of wall putty. Be sure to let it cure."
        },
        {
          "headline":"Apply a layer of watered-down PVA solution with a paint roller.",
          "description":"This is an absolute must if the wall surface is not smooth or level. Even if the wall is smooth and level, this would still be a good idea, because it will eliminate any minor imperfections. It will also act as a primer. Let the PVA coating dry for at least 24 hours after you have applied it."
        }
      ]
    },
    {
      "name":"Adding the Bottom Trim",
      "steps":[
        {
          "headline":"Measure the length of your wall to figure out how much trim you need.",
          "description":"If you will be placing the bottom of the panels right against the floor, you will need to measure along the base of the wall, where the floor starts. If you will be installing a floor skirting afterwards, measure 10 centimetres (3.9 in) off of the floor instead. Us you are measuring 10 centimetres (3.9 in) off of the floor, use a laser level as a guide."
        },
        {
          "headline":"Cut your trim to fit the length of the wall.",
          "description":"There are 2 kinds of trim that you can use for this: a J-trim or a 2-part edge section joining trim. If you are setting the panel right against the floor, you should use a J-trim. If you are setting the panels 10 centimetres (3.9 in) off of the floor, use a 2-part edge section joining trim instead. Cut the trim with a jigsaw. Be sure to clear away any sanding dust."
        },
        {
          "headline":"Apply a line of 1-part MS polymer adhesive to the wall.",
          "description":"Place this adhesive either along your guideline or along the base of the wall. This type of adhesive typically comes in a tube or syringe. You can find it online or in hardware stores. Don't use a 2-part adhesive for this. You won’t be able to apply it in a thin line, and you don’t want the adhesive to leave out from behind the trim."
        },
        {
          "headline":"Secure the trim to the wall with drywall screws.",
          "description":"Press the flat side of the trim against the adhesive. Next, drive drywall screws through the top and bottom edges of the trim to further secure it to the wall. Keep the screws spaced about 60 centimetres (24 in) apart. You can also use screws and plugs instead of drywall screws. If you are using a J-trim, make sure that the J is upright."
        }
      ]
    },
    {
      "name":"Cutting and Attaching the Panels",
      "steps":[
        {
          "headline":"Mark on your wall the height and width of your panels.",
          "description":"In most cases, you will need to fit several panels against 1 wall. Decide where you want each sheet to start and end, make marks on the wall accordingly. Be sure to use a pen, ruler, and level for this. The panels need to go from the base of the wall to the top of the ceiling. The width of the panel is up to you. Most of them come in standard widths, but you can make them narrower. Double-check your measurements when you get to the corners. Sometimes, they taper towards the ceiling. If your wall has any sockets, pipes, or switches, use a datum line at eye level to measure them."
        },
        {
          "headline":"Transfer your measurements to the panel, adding a 2 to 3-millimeter gap.",
          "description":"Set your cladding sheet face-up on a workbench, then transfer the measurements and markings from the wall onto the sheet with a pen. This includes the datum markings as well. Add a 2 to 3-millimeter gap around any socket or pipe openings that you drew. Set the panel down so that the plastic film is facing up. Do not remove this film. These 2 to 3-millimeter gaps are important. Wall cladding will expand with changes in temperature. If you don't leave these gaps, the cladding will warp."
        },
        {
          "headline":"Cut your sheets with a jigsaw, starting with the pipe and socket openings.",
          "description":"Choose a pipe or socket opening to start with (if there are any), then drill a pilot hole into it. Insert a jigsaw into the pilot hole, then cut the panel with a jigsaw. You are cutting on the same side that you made the marks on: the side with the plastic film on it. Wear a pair of vinyl or plastic gloves for this, so that the sheets stay clean. At this point, it would be a good idea to have a helper test-fit the panels against the wall to make sure that they fit."
        },
        {
          "headline":"Prepare a 2-part PU glue.",
          "description":"Put on a pair of PPE gloves and goggles first. Pour Part A into Part B, then use a drill fitted with a mixing paddle to stir everything together. Brace your foot against the bucket that Part B came in, and mix for about 2 minutes. The exact mixing time will vary from brand to brand. The texture and color of the adhesive must be consistent."
        },
        {
          "headline":"Apply the adhesive to the panel, leaving a 1.5 cm (0.59 in) bare border.",
          "description":"Flip the panel over so that the back is facing you. Use a trowel with 4-millimeter deep notches to apply the adhesive. Spread the adhesive across the back of the panel as evenly as you can, leaving a 1.5 cm (0.59 in) border around the edges. The border doesn't have to be precise or exact. It's mainly there to give the adhesive room to spread. You should leave a border around any pipe or socket openings too."
        },
        {
          "headline":"Install the sheet with the help of a second person.",
          "description":"Make sure that both of you are wearing PPE gloves, safety goggles, and hardhats. Have 1 person lift the sheet up, and the other person guide the sheet into the trim at the bottom of the wall. Press the sheet against the wall, working your way from bottom to top. If you can't fit the panel into the trim, use a wallpaper scraper to help pry open the trim, then slide the panel into place."
        },
        {
          "headline":"Use a roller or rubber mallet to smooth the sheet onto the wall.",
          "description":"This will help spread adhesive towards the edges. Start at the top-left corner of the panel, and work your way down towards the bottom-left corner. Continue across the panel until you reach the right side. Work quickly, as the adhesive will cure fast."
        }
      ]
    },
    {
      "name":"Adding the Vertical Trims",
      "steps":[
        {
          "headline":"Measure the length of your wall, then cut a 2-part H joining strip.",
          "description":"Use a tape measure to measure the length of your panel, from top to bottom. Cut a 2-part H joining strip according to this measurement. It's the kind that looks like an H when viewed from the narrow edge."
        },
        {
          "headline":"Attach the trim, leaving a 2 to 3-millimeter gap.",
          "description":"Get out the 1-part MS polymer adhesive that you used to attach the horizontal trim earlier. Apply a vertical line directly onto the wall, right next to the panel. Press the trim against the wall, so that the flat edge overlaps the front of the panel. There must be a 2 to 3-millimeter gap between the side edge of the panel and the inside edge of the trim. If you don't leave this gap, the panel will wrap as it expands."
        },
        {
          "headline":"Attach more panels and trims until you finish the wall.",
          "description":"Cut another panel, apply the 2-part adhesive to the back, and press it against the wall. Make sure that you leave a 2 to 3-millimeter gap between the second panel and the first vertical trim. Attach the second vertical trim using the 1-part MS polymer adhesive, and add the third panel. How many trims and panels you add depends on how big your wall is."
        },
        {
          "headline":"Cut your 50 by 50-millimeter corner trims.",
          "description":"There are 2 types of 50 by 50-millimeter corner trims: internal and external. The internal trims go into a corner between 2 walls. The external trims wrap around the corner, where the wall turns. Which type you choose depends on how your room is laid out, but in most cases, you'll use an internal corner trim. Like the vertical H-trims, these should be cut to the height of your panel. These trims look like right angles when viewed from the narrow end. Each side of the angle is 50 millimeters wide. The internal trims have the plastic film on the inside of the angle, and the external trims have the film on the outside of the angle. Alternatively, you can use small internal cove and external F-corners instead. They have a smaller profile."
        },
        {
          "headline":"Apply the corner trims.",
          "description":"If you are using the 50 by 50-millimeter corner trims, apply the adjacent wall's panel first, then stick them onto the panels with a 2-part PU adhesive. If you are using small internal cove or external F-corners, clip them onto the adjacent wall's panel first, then glue the panel onto the wall. If you don't have any corner trims, you can thermoform the cladding into a corner shape instead."
        }
      ]
    },
    {
      "name":"Finishing the Job",
      "steps":[
        {
          "headline":"Finish the last wall's panel with a J-trim.",
          "description":"If the panel is too wide to fit into the remaining space on the wall, cut the panel narrower until it does fit. Next, cut your vertical J-trim to the height of the panel, clip it the edge of the panel, then secure the panel to the wall with your adhesive, just like before."
        },
        {
          "headline":"Trim your H-fronts and clip them onto the H-trims.",
          "description":"Measure the length of the H-trims that you added to the wall between the panels. Trim the H-front down to that length, then clip it into the H-trim. If your H-trim has a plastic film, remove the film first, then add the H-front."
        },
        {
          "headline":"Tap the H-front into place with a rubber mallet, then repeat the process.",
          "description":"Once you have the first H-front fully secured, cut the other H-fronts, and clip them onto the other H-trims. Work 1 piece at a time, tapping each 1 into place with a rubber mallet before moving onto the next. You should do this for the bottom J-trim as well."
        },
        {
          "headline":"Remove the plastic films and wipe off any grime.",
          "description":"Now, you can finally peel off the plastic film covering the panels and H-fronts. Wipe off any dirt or adhesive residue with a dust-free cloth."
        },
        {
          "headline":"Apply the floor skirting, if you left room for it.",
          "description":"If you left the 10 cm (3.9 in) gap between the bottom J trim and the floor, now is the time to cut the skirting and apply it to the base of the wall with your adhesive. If you need to, secure the skirting to the wall with drywall screws, keeping them 60 centimetres (24 in) apart."
        },
        {
          "headline":"Fill any gaps with food-grade silicone.",
          "description":"Check the seams between the walls and the trims and ceiling. If you see any gaps, fill these in with a food-grade silicone; use the kind that comes in a syringe for easiest application. When you are done, spray the silicone with soapy water, then wipe off any residue."
        }
      ]
    }
  ],
  "text":" Preparing the Wall Surface Make sure that your room and walls can withstand high-humidity. There are lots of reasons why someone might want to install hygienic wall cladding, and 1 of these is to protect rooms that receive high levels of humidity. Even so, wall cladding can’t do all of the work for you, so make sure that your wall is able to withstand high levels of moisture. If the walls can't withstand high levels of moisture, you'll need to install furring strips with mechanical wall fasteners. This will give the panels something to stick to. Clean any dirt, grease, or grime from the walls. There cannot be any dust, dirt, or grease on the wall, as this will prevent the glue from bonding properly. Even if the wall looks clean, wipe it down with a damp, dust-free cloth, then let it dry completely. If there is any loose wallpaper or peeling paint, you should remove it as well. If your walls are made from concrete, they must be fully cured and dry before you begin. Sand away any bumps and fill in any dips. The wall surface must be completely flat in order for good adhesion to occur. Use wall putty to fill in any dips, and a sanding block to smooth away any bumps or unevenness. If the wall is made from concrete or brick, fill it in with plaster or concrete instead of wall putty. Be sure to let it cure. Apply a layer of watered-down PVA solution with a paint roller. This is an absolute must if the wall surface is not smooth or level. Even if the wall is smooth and level, this would still be a good idea, because it will eliminate any minor imperfections. It will also act as a primer. Let the PVA coating dry for at least 24 hours after you have applied it. Adding the Bottom Trim Measure the length of your wall to figure out how much trim you need. If you will be placing the bottom of the panels right against the floor, you will need to measure along the base of the wall, where the floor starts. If you will be installing a floor skirting afterwards, measure 10 centimetres (3.9 in) off of the floor instead. Us you are measuring 10 centimetres (3.9 in) off of the floor, use a laser level as a guide. Cut your trim to fit the length of the wall. There are 2 kinds of trim that you can use for this: a J-trim or a 2-part edge section joining trim. If you are setting the panel right against the floor, you should use a J-trim. If you are setting the panels 10 centimetres (3.9 in) off of the floor, use a 2-part edge section joining trim instead. Cut the trim with a jigsaw. Be sure to clear away any sanding dust. Apply a line of 1-part MS polymer adhesive to the wall. Place this adhesive either along your guideline or along the base of the wall. This type of adhesive typically comes in a tube or syringe. You can find it online or in hardware stores. Don't use a 2-part adhesive for this. You won’t be able to apply it in a thin line, and you don’t want the adhesive to leave out from behind the trim. Secure the trim to the wall with drywall screws. Press the flat side of the trim against the adhesive. Next, drive drywall screws through the top and bottom edges of the trim to further secure it to the wall. Keep the screws spaced about 60 centimetres (24 in) apart. You can also use screws and plugs instead of drywall screws. If you are using a J-trim, make sure that the J is upright. Cutting and Attaching the Panels Mark on your wall the height and width of your panels. In most cases, you will need to fit several panels against 1 wall. Decide where you want each sheet to start and end, make marks on the wall accordingly. Be sure to use a pen, ruler, and level for this. The panels need to go from the base of the wall to the top of the ceiling. The width of the panel is up to you. Most of them come in standard widths, but you can make them narrower. Double-check your measurements when you get to the corners. Sometimes, they taper towards the ceiling. If your wall has any sockets, pipes, or switches, use a datum line at eye level to measure them. Transfer your measurements to the panel, adding a 2 to 3-millimeter gap. Set your cladding sheet face-up on a workbench, then transfer the measurements and markings from the wall onto the sheet with a pen. This includes the datum markings as well. Add a 2 to 3-millimeter gap around any socket or pipe openings that you drew. Set the panel down so that the plastic film is facing up. Do not remove this film. These 2 to 3-millimeter gaps are important. Wall cladding will expand with changes in temperature. If you don't leave these gaps, the cladding will warp. Cut your sheets with a jigsaw, starting with the pipe and socket openings. Choose a pipe or socket opening to start with (if there are any), then drill a pilot hole into it. Insert a jigsaw into the pilot hole, then cut the panel with a jigsaw. You are cutting on the same side that you made the marks on: the side with the plastic film on it. Wear a pair of vinyl or plastic gloves for this, so that the sheets stay clean. At this point, it would be a good idea to have a helper test-fit the panels against the wall to make sure that they fit. Prepare a 2-part PU glue. Put on a pair of PPE gloves and goggles first. Pour Part A into Part B, then use a drill fitted with a mixing paddle to stir everything together. Brace your foot against the bucket that Part B came in, and mix for about 2 minutes. The exact mixing time will vary from brand to brand. The texture and color of the adhesive must be consistent. Apply the adhesive to the panel, leaving a 1.5 cm (0.59 in) bare border. Flip the panel over so that the back is facing you. Use a trowel with 4-millimeter deep notches to apply the adhesive. Spread the adhesive across the back of the panel as evenly as you can, leaving a 1.5 cm (0.59 in) border around the edges. The border doesn't have to be precise or exact. It's mainly there to give the adhesive room to spread. You should leave a border around any pipe or socket openings too. Install the sheet with the help of a second person. Make sure that both of you are wearing PPE gloves, safety goggles, and hardhats. Have 1 person lift the sheet up, and the other person guide the sheet into the trim at the bottom of the wall. Press the sheet against the wall, working your way from bottom to top. If you can't fit the panel into the trim, use a wallpaper scraper to help pry open the trim, then slide the panel into place. Use a roller or rubber mallet to smooth the sheet onto the wall. This will help spread adhesive towards the edges. Start at the top-left corner of the panel, and work your way down towards the bottom-left corner. Continue across the panel until you reach the right side. Work quickly, as the adhesive will cure fast. Adding the Vertical Trims Measure the length of your wall, then cut a 2-part H joining strip. Use a tape measure to measure the length of your panel, from top to bottom. Cut a 2-part H joining strip according to this measurement. It's the kind that looks like an H when viewed from the narrow edge. Attach the trim, leaving a 2 to 3-millimeter gap. Get out the 1-part MS polymer adhesive that you used to attach the horizontal trim earlier. Apply a vertical line directly onto the wall, right next to the panel. Press the trim against the wall, so that the flat edge overlaps the front of the panel. There must be a 2 to 3-millimeter gap between the side edge of the panel and the inside edge of the trim. If you don't leave this gap, the panel will wrap as it expands. Attach more panels and trims until you finish the wall. Cut another panel, apply the 2-part adhesive to the back, and press it against the wall. Make sure that you leave a 2 to 3-millimeter gap between the second panel and the first vertical trim. Attach the second vertical trim using the 1-part MS polymer adhesive, and add the third panel. How many trims and panels you add depends on how big your wall is. Cut your 50 by 50-millimeter corner trims. There are 2 types of 50 by 50-millimeter corner trims: internal and external. The internal trims go into a corner between 2 walls. The external trims wrap around the corner, where the wall turns. Which type you choose depends on how your room is laid out, but in most cases, you'll use an internal corner trim. Like the vertical H-trims, these should be cut to the height of your panel. These trims look like right angles when viewed from the narrow end. Each side of the angle is 50 millimeters wide. The internal trims have the plastic film on the inside of the angle, and the external trims have the film on the outside of the angle. Alternatively, you can use small internal cove and external F-corners instead. They have a smaller profile. Apply the corner trims. If you are using the 50 by 50-millimeter corner trims, apply the adjacent wall's panel first, then stick them onto the panels with a 2-part PU adhesive. If you are using small internal cove or external F-corners, clip them onto the adjacent wall's panel first, then glue the panel onto the wall. If you don't have any corner trims, you can thermoform the cladding into a corner shape instead. Finishing the Job Finish the last wall's panel with a J-trim. If the panel is too wide to fit into the remaining space on the wall, cut the panel narrower until it does fit. Next, cut your vertical J-trim to the height of the panel, clip it the edge of the panel, then secure the panel to the wall with your adhesive, just like before. Trim your H-fronts and clip them onto the H-trims. Measure the length of the H-trims that you added to the wall between the panels. Trim the H-front down to that length, then clip it into the H-trim. If your H-trim has a plastic film, remove the film first, then add the H-front. Tap the H-front into place with a rubber mallet, then repeat the process. Once you have the first H-front fully secured, cut the other H-fronts, and clip them onto the other H-trims. Work 1 piece at a time, tapping each 1 into place with a rubber mallet before moving onto the next. You should do this for the bottom J-trim as well. Remove the plastic films and wipe off any grime. Now, you can finally peel off the plastic film covering the panels and H-fronts. Wipe off any dirt or adhesive residue with a dust-free cloth. Apply the floor skirting, if you left room for it. If you left the 10 cm (3.9 in) gap between the bottom J trim and the floor, now is the time to cut the skirting and apply it to the base of the wall with your adhesive. If you need to, secure the skirting to the wall with drywall screws, keeping them 60 centimetres (24 in) apart. Fill any gaps with food-grade silicone. Check the seams between the walls and the trims and ceiling. If you see any gaps, fill these in with a food-grade silicone; use the kind that comes in a syringe for easiest application. When you are done, spray the silicone with soapy water, then wipe off any residue.",
  "sentences":[
    " Preparing the Wall Surface Make sure that your room and walls can withstand high-humidity.",
    "There are lots of reasons why someone might want to install hygienic wall cladding, and 1 of these is to protect rooms that receive high levels of humidity.",
    "Even so, wall cladding can’t do all of the work for you, so make sure that your wall is able to withstand high levels of moisture.",
    "If the walls can't withstand high levels of moisture, you'll need to install furring strips with mechanical wall fasteners.",
    "This will give the panels something to stick to.",
    "Clean any dirt, grease, or grime from the walls.",
    "There cannot be any dust, dirt, or grease on the wall, as this will prevent the glue from bonding properly.",
    "Even if the wall looks clean, wipe it down with a damp, dust-free cloth, then let it dry completely.",
    "If there is any loose wallpaper or peeling paint, you should remove it as well.",
    "If your walls are made from concrete, they must be fully cured and dry before you begin.",
    "Sand away any bumps and fill in any dips.",
    "The wall surface must be completely flat in order for good adhesion to occur.",
    "Use wall putty to fill in any dips, and a sanding block to smooth away any bumps or unevenness.",
    "If the wall is made from concrete or brick, fill it in with plaster or concrete instead of wall putty.",
    "Be sure to let it cure.",
    "Apply a layer of watered-down PVA solution with a paint roller.",
    "This is an absolute must if the wall surface is not smooth or level.",
    "Even if the wall is smooth and level, this would still be a good idea, because it will eliminate any minor imperfections.",
    "It will also act as a primer.",
    "Let the PVA coating dry for at least 24 hours after you have applied it.",
    "Adding the Bottom Trim Measure the length of your wall to figure out how much trim you need.",
    "If you will be placing the bottom of the panels right against the floor, you will need to measure along the base of the wall, where the floor starts.",
    "If you will be installing a floor skirting afterwards, measure 10 centimetres (3.9 in) off of the floor instead.",
    "Us you are measuring 10 centimetres (3.9 in) off of the floor, use a laser level as a guide.",
    "Cut your trim to fit the length of the wall.",
    "There are 2 kinds of trim that you can use for this: a J-trim or a 2-part edge section joining trim.",
    "If you are setting the panel right against the floor, you should use a J-trim.",
    "If you are setting the panels 10 centimetres (3.9 in) off of the floor, use a 2-part edge section joining trim instead.",
    "Cut the trim with a jigsaw.",
    "Be sure to clear away any sanding dust.",
    "Apply a line of 1-part MS polymer adhesive to the wall.",
    "Place this adhesive either along your guideline or along the base of the wall.",
    "This type of adhesive typically comes in a tube or syringe.",
    "You can find it online or in hardware stores.",
    "Don't use a 2-part adhesive for this.",
    "You won’t be able to apply it in a thin line, and you don’t want the adhesive to leave out from behind the trim.",
    "Secure the trim to the wall with drywall screws.",
    "Press the flat side of the trim against the adhesive.",
    "Next, drive drywall screws through the top and bottom edges of the trim to further secure it to the wall.",
    "Keep the screws spaced about 60 centimetres (24 in) apart.",
    "You can also use screws and plugs instead of drywall screws.",
    "If you are using a J-trim, make sure that the J is upright.",
    "Cutting and Attaching the Panels Mark on your wall the height and width of your panels.",
    "In most cases, you will need to fit several panels against 1 wall.",
    "Decide where you want each sheet to start and end, make marks on the wall accordingly.",
    "Be sure to use a pen, ruler, and level for this.",
    "The panels need to go from the base of the wall to the top of the ceiling.",
    "The width of the panel is up to you.",
    "Most of them come in standard widths, but you can make them narrower.",
    "Double-check your measurements when you get to the corners.",
    "Sometimes, they taper towards the ceiling.",
    "If your wall has any sockets, pipes, or switches, use a datum line at eye level to measure them.",
    "Transfer your measurements to the panel, adding a 2 to 3-millimeter gap.",
    "Set your cladding sheet face-up on a workbench, then transfer the measurements and markings from the wall onto the sheet with a pen.",
    "This includes the datum markings as well.",
    "Add a 2 to 3-millimeter gap around any socket or pipe openings that you drew.",
    "Set the panel down so that the plastic film is facing up.",
    "Do not remove this film.",
    "These 2 to 3-millimeter gaps are important.",
    "Wall cladding will expand with changes in temperature.",
    "If you don't leave these gaps, the cladding will warp.",
    "Cut your sheets with a jigsaw, starting with the pipe and socket openings.",
    "Choose a pipe or socket opening to start with (if there are any), then drill a pilot hole into it.",
    "Insert a jigsaw into the pilot hole, then cut the panel with a jigsaw.",
    "You are cutting on the same side that you made the marks on: the side with the plastic film on it.",
    "Wear a pair of vinyl or plastic gloves for this, so that the sheets stay clean.",
    "At this point, it would be a good idea to have a helper test-fit the panels against the wall to make sure that they fit.",
    "Prepare a 2-part PU glue.",
    "Put on a pair of PPE gloves and goggles first.",
    "Pour Part A into Part B, then use a drill fitted with a mixing paddle to stir everything together.",
    "Brace your foot against the bucket that Part B came in, and mix for about 2 minutes.",
    "The exact mixing time will vary from brand to brand.",
    "The texture and color of the adhesive must be consistent.",
    "Apply the adhesive to the panel, leaving a 1.5 cm (0.59 in) bare border.",
    "Flip the panel over so that the back is facing you.",
    "Use a trowel with 4-millimeter deep notches to apply the adhesive.",
    "Spread the adhesive across the back of the panel as evenly as you can, leaving a 1.5 cm (0.59 in) border around the edges.",
    "The border doesn't have to be precise or exact.",
    "It's mainly there to give the adhesive room to spread.",
    "You should leave a border around any pipe or socket openings too.",
    "Install the sheet with the help of a second person.",
    "Make sure that both of you are wearing PPE gloves, safety goggles, and hardhats.",
    "Have 1 person lift the sheet up, and the other person guide the sheet into the trim at the bottom of the wall.",
    "Press the sheet against the wall, working your way from bottom to top.",
    "If you can't fit the panel into the trim, use a wallpaper scraper to help pry open the trim, then slide the panel into place.",
    "Use a roller or rubber mallet to smooth the sheet onto the wall.",
    "This will help spread adhesive towards the edges.",
    "Start at the top-left corner of the panel, and work your way down towards the bottom-left corner.",
    "Continue across the panel until you reach the right side.",
    "Work quickly, as the adhesive will cure fast.",
    "Adding the Vertical Trims Measure the length of your wall, then cut a 2-part H joining strip.",
    "Use a tape measure to measure the length of your panel, from top to bottom.",
    "Cut a 2-part H joining strip according to this measurement.",
    "It's the kind that looks like an H when viewed from the narrow edge.",
    "Attach the trim, leaving a 2 to 3-millimeter gap.",
    "Get out the 1-part MS polymer adhesive that you used to attach the horizontal trim earlier.",
    "Apply a vertical line directly onto the wall, right next to the panel.",
    "Press the trim against the wall, so that the flat edge overlaps the front of the panel.",
    "There must be a 2 to 3-millimeter gap between the side edge of the panel and the inside edge of the trim.",
    "If you don't leave this gap, the panel will wrap as it expands.",
    "Attach more panels and trims until you finish the wall.",
    "Cut another panel, apply the 2-part adhesive to the back, and press it against the wall.",
    "Make sure that you leave a 2 to 3-millimeter gap between the second panel and the first vertical trim.",
    "Attach the second vertical trim using the 1-part MS polymer adhesive, and add the third panel.",
    "How many trims and panels you add depends on how big your wall is.",
    "Cut your 50 by 50-millimeter corner trims.",
    "There are 2 types of 50 by 50-millimeter corner trims: internal and external.",
    "The internal trims go into a corner between 2 walls.",
    "The external trims wrap around the corner, where the wall turns.",
    "Which type you choose depends on how your room is laid out, but in most cases, you'll use an internal corner trim.",
    "Like the vertical H-trims, these should be cut to the height of your panel.",
    "These trims look like right angles when viewed from the narrow end.",
    "Each side of the angle is 50 millimeters wide.",
    "The internal trims have the plastic film on the inside of the angle, and the external trims have the film on the outside of the angle.",
    "Alternatively, you can use small internal cove and external F-corners instead.",
    "They have a smaller profile.",
    "Apply the corner trims.",
    "If you are using the 50 by 50-millimeter corner trims, apply the adjacent wall's panel first, then stick them onto the panels with a 2-part PU adhesive.",
    "If you are using small internal cove or external F-corners, clip them onto the adjacent wall's panel first, then glue the panel onto the wall.",
    "If you don't have any corner trims, you can thermoform the cladding into a corner shape instead.",
    "Finishing the Job Finish the last wall's panel with a J-trim.",
    "If the panel is too wide to fit into the remaining space on the wall, cut the panel narrower until it does fit.",
    "Next, cut your vertical J-trim to the height of the panel, clip it the edge of the panel, then secure the panel to the wall with your adhesive, just like before.",
    "Trim your H-fronts and clip them onto the H-trims.",
    "Measure the length of the H-trims that you added to the wall between the panels.",
    "Trim the H-front down to that length, then clip it into the H-trim.",
    "If your H-trim has a plastic film, remove the film first, then add the H-front.",
    "Tap the H-front into place with a rubber mallet, then repeat the process.",
    "Once you have the first H-front fully secured, cut the other H-fronts, and clip them onto the other H-trims.",
    "Work 1 piece at a time, tapping each 1 into place with a rubber mallet before moving onto the next.",
    "You should do this for the bottom J-trim as well.",
    "Remove the plastic films and wipe off any grime.",
    "Now, you can finally peel off the plastic film covering the panels and H-fronts.",
    "Wipe off any dirt or adhesive residue with a dust-free cloth.",
    "Apply the floor skirting, if you left room for it.",
    "If you left the 10 cm (3.9 in) gap between the bottom J trim and the floor, now is the time to cut the skirting and apply it to the base of the wall with your adhesive.",
    "If you need to, secure the skirting to the wall with drywall screws, keeping them 60 centimetres (24 in) apart.",
    "Fill any gaps with food-grade silicone.",
    "Check the seams between the walls and the trims and ceiling.",
    "If you see any gaps, fill these in with a food-grade silicone; use the kind that comes in a syringe for easiest application.",
    "When you are done, spray the silicone with soapy water, then wipe off any residue."
  ],
  "tyn_section":[
    "Hygienic wall cladding",
    "J-trims",
    "H-trims",
    "Corner trims (if needed)",
    "Floor skirting (optional)",
    "1-part MS polymer adhesive",
    "2-part PU adhesive",
    "Level (preferably laser)",
    "Drill",
    "Mixing paddle (for drill)",
    "Jigsaw",
    "4-millimeter notched trowel",
    "Rubber mallet",
    "Drywall screws",
    "Helper",
    "Safety goggles, gloves, helmet, etc."
  ],
  "tyn_model":[
    "adhesive",
    "jigsaw",
    "drywall screws",
    "ms polymer adhesive",
    "rubber mallet",
    "silicone",
    "concrete",
    "wall putty",
    "floor skirting",
    "trim",
    "screws",
    "pen",
    "plastic film",
    "ppe gloves",
    "wall cladding",
    "mechanical wall fasteners",
    "glue",
    "sanding block",
    "plaster",
    "paint roller",
    "primer",
    "pva coating",
    "laser level",
    "edge section joining",
    "ruler",
    "level",
    "2-part pu glue",
    "goggles",
    "drill",
    "bucket",
    "trowel",
    "wallpaper scraper",
    "roller",
    "tape measure",
    "2-part pu adhesive",
    "soapy water"
  ],
  "simple_metrics":{
    "r":0.3125,
    "p":0.1388888889,
    "f1":0.1923076923,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.5,
    "p":0.2777777778,
    "f1":0.3571428571
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.625,
    "p":0.3611111111,
    "f1":0.4577464789
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.5,
    "p":0.2222222222,
    "f1":0.3076923077
  }
}