{
  "title":"How to Dye Rubber",
  "url":"https://www.wikihow.com/Dye-Rubber",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Using Fabric Dyes on Rubber",
      "steps":[
        {
          "headline":"Clean your rubber object thoroughly before dyeing it.",
          "description":"If your object is dirty, its dyed surface may look uneven or discolored. Wash your object with soap and warm water, scrubbing away any debris as best as you can. This method works for all rubber types except silicone."
        },
        {
          "headline":"Heat enough water for submerging your rubber object.",
          "description":"Fill a pot with water and heat it on a low to medium stove setting. The water should be hot, but not boiling—close to, but less than 212 °F (100 °C) is ideal. Be careful when handling the hot water to prevent burns or spills. For a more precise measurement, use a water thermometer. Otherwise, wait for the water to start forming bubbles at the bottom of the pot but not yet boil."
        },
        {
          "headline":"Add fabric dye to the hot water at the proper ratio.",
          "description":"Pour the fabric dye and hot water in a bowl in a ratio determined by the dye packaging. Mix the fabric dye and water thoroughly until you achieve an even color. You can buy fabric dye online or at most craft stores. Fabric dye can stain bowls and other cooking tools, particularly plastics. To prevent this, use glass or metal cooking tools if possible."
        },
        {
          "headline":"Soak the rubber object for 1-2 hours.",
          "description":"Place the object in the bowl and leave it to soak. Keep it in the pan for up to 2 hours, depending on how strong or bright you want the new color to be. As long as you clean and sanitize the kitchen utensils afterward, you can use them for cooking again later. Check on the object's dyeing progress periodically, but avoid moving it to keep its new color even."
        },
        {
          "headline":"Boil the water as a faster alternative.",
          "description":"Instead of pouring the water into a bowl, fill a pot with the dye mixture and heat it until boiling. Grab the rubber object with tongs and dip it into the water continually until you reach your desired color, changing the tongs' position as you dip to make sure you thoroughly coat the object. If you choose this method, it should take up to 20-25 minutes depending on the brightness of the color. This method, while faster, can result in a more uneven color."
        },
        {
          "headline":"Remove the object from the dye mixture and wash it.",
          "description":"Pick the object out of the water with tongs and run it under warm water to remove the excess dye. Inspect the object's new color and, if it's not as bright as you would prefer, repeat the process with a higher concentration of dye. Repeatedly dyeing the rubber over time may damage it. If you don't achieve the color you want after 1-2 times, try painting it instead."
        }
      ]
    },
    {
      "name":"Trying Hair Dye on Silicone Objects",
      "steps":[
        {
          "headline":"Wash your silicone object thoroughly before dyeing it.",
          "description":"Dyeing silicone objects while they're dirty can result in an unevenly dyed color. Clean your silicone object with soap and water, and scrub away any stubborn debris or chipped paint before preparing the dye."
        },
        {
          "headline":"Mix the hair dye in a cup or bowl.",
          "description":"Open the hair dye package and mix it according to the kit's instructions. Most kits include a bottle of hair dye and a developer, which you mix thoroughly until you reach an even color. Find a well-ventilated area to mix the hair dye, as most chemical dyes have a strong smell. Buy chemical, not natural, hair dyes for a bright and lasting color."
        },
        {
          "headline":"Coat the silicone objects in the hair dye.",
          "description":"Dip the silicone objects into the hair dye until their surface is thoroughly coated. Leave the objects in the container while fully coated in the dye to soak in the new color. This method is ideal for small silicone objects. For larger silicone objects, you may need to make several hair dye batches."
        },
        {
          "headline":"Let the silicone soak overnight.",
          "description":"Silicone is difficult to dye, and it takes a long time for color to permeate its surface. Leave the silicone to soak in the hair dye overnight, and remove it from the solution the next day. The water's temperature should be neither hot or cold but lukewarm. The longer you leave it in the dye, the deeper its color will be."
        },
        {
          "headline":"Wash the silicone under water and check its color.",
          "description":"Run your silicone object under water to remove any excess dye, then inspect its new color. If the color is still too light or faded, try dyeing the object again or painting it instead. You can also try a stronger or brighter hair dye for a deeper color."
        },
        {
          "headline":"Avoid leaving the object outdoors for extended periods of time.",
          "description":"UV light can break down the colors in hair dye and cause it to fade. Keep your silicone object indoors to preserve its color and prevent discoloration. Apply a new dye coat and keep it away from UV light if your dyed color fades over time. If you don't achieve the color you want after 1-2 times, try painting it instead, as too much dyeing can damage the silicone."
        }
      ]
    },
    {
      "name":"Coloring Rubber Temporarily with Acrylic Paints",
      "steps":[
        {
          "headline":"Use acrylics to paint rubber objects.",
          "description":"Rubber is especially prone to chipping or flaking after being painted. If you want to paint rubber, buy acrylic paints online or from a craft store for a lasting color. Painting rubber is the most temporary way to stain objects. Choose this method if you're unsure how permanent you want your dyed color to be."
        },
        {
          "headline":"Apply a layer of Mod Podge over your object before painting.",
          "description":"Mod Podge helps the paint stick to your object and prevent the color from flaking. Use a paint brush to cover the surface in a thin Mod Podge layer, and let it dry for 15-20 minutes. Clean the rubber with soap and water first to remove debris for a more secure paint job. If you have any areas you don't want to paint, affix painter's tape over these areas before applying the Mod Podge. You can buy Mod Podge from most home improvement or craft stores."
        },
        {
          "headline":"Use a foam brush to apply the acrylics.",
          "description":"Dip a foam brush into the acrylic paint and apply it in even layers to the rubber object. When you've covered the entire surface in the paint, let it dry for 30-60 minutes and inspect the color's brightness. For a stronger color, apply 2-3 coats of paint. Wait for each coat to dry before applying another one, which should take between 30 minutes to an hour."
        },
        {
          "headline":"Spray a paint sealer over the rubber to preserve its color.",
          "description":"After the last paint coat dries, hold the paint sealer's nozzle 1–2 inches (2.5–5.1 cm) from the surface and spray an even coating over the rubber. Let the paint sealer dry for 30-60 minutes before touching or using the rubber object. Even with paint sealer, acrylic paint may flake or chip over time. Reapply paint coats as needed to restore the rubber's color, spraying more paint sealer afterward."
        }
      ]
    }
  ],
  "text":" Using Fabric Dyes on Rubber Clean your rubber object thoroughly before dyeing it. If your object is dirty, its dyed surface may look uneven or discolored. Wash your object with soap and warm water, scrubbing away any debris as best as you can. This method works for all rubber types except silicone. Heat enough water for submerging your rubber object. Fill a pot with water and heat it on a low to medium stove setting. The water should be hot, but not boiling—close to, but less than 212 °F (100 °C) is ideal. Be careful when handling the hot water to prevent burns or spills. For a more precise measurement, use a water thermometer. Otherwise, wait for the water to start forming bubbles at the bottom of the pot but not yet boil. Add fabric dye to the hot water at the proper ratio. Pour the fabric dye and hot water in a bowl in a ratio determined by the dye packaging. Mix the fabric dye and water thoroughly until you achieve an even color. You can buy fabric dye online or at most craft stores. Fabric dye can stain bowls and other cooking tools, particularly plastics. To prevent this, use glass or metal cooking tools if possible. Soak the rubber object for 1-2 hours. Place the object in the bowl and leave it to soak. Keep it in the pan for up to 2 hours, depending on how strong or bright you want the new color to be. As long as you clean and sanitize the kitchen utensils afterward, you can use them for cooking again later. Check on the object's dyeing progress periodically, but avoid moving it to keep its new color even. Boil the water as a faster alternative. Instead of pouring the water into a bowl, fill a pot with the dye mixture and heat it until boiling. Grab the rubber object with tongs and dip it into the water continually until you reach your desired color, changing the tongs' position as you dip to make sure you thoroughly coat the object. If you choose this method, it should take up to 20-25 minutes depending on the brightness of the color. This method, while faster, can result in a more uneven color. Remove the object from the dye mixture and wash it. Pick the object out of the water with tongs and run it under warm water to remove the excess dye. Inspect the object's new color and, if it's not as bright as you would prefer, repeat the process with a higher concentration of dye. Repeatedly dyeing the rubber over time may damage it. If you don't achieve the color you want after 1-2 times, try painting it instead. Trying Hair Dye on Silicone Objects Wash your silicone object thoroughly before dyeing it. Dyeing silicone objects while they're dirty can result in an unevenly dyed color. Clean your silicone object with soap and water, and scrub away any stubborn debris or chipped paint before preparing the dye. Mix the hair dye in a cup or bowl. Open the hair dye package and mix it according to the kit's instructions. Most kits include a bottle of hair dye and a developer, which you mix thoroughly until you reach an even color. Find a well-ventilated area to mix the hair dye, as most chemical dyes have a strong smell. Buy chemical, not natural, hair dyes for a bright and lasting color. Coat the silicone objects in the hair dye. Dip the silicone objects into the hair dye until their surface is thoroughly coated. Leave the objects in the container while fully coated in the dye to soak in the new color. This method is ideal for small silicone objects. For larger silicone objects, you may need to make several hair dye batches. Let the silicone soak overnight. Silicone is difficult to dye, and it takes a long time for color to permeate its surface. Leave the silicone to soak in the hair dye overnight, and remove it from the solution the next day. The water's temperature should be neither hot or cold but lukewarm. The longer you leave it in the dye, the deeper its color will be. Wash the silicone under water and check its color. Run your silicone object under water to remove any excess dye, then inspect its new color. If the color is still too light or faded, try dyeing the object again or painting it instead. You can also try a stronger or brighter hair dye for a deeper color. Avoid leaving the object outdoors for extended periods of time. UV light can break down the colors in hair dye and cause it to fade. Keep your silicone object indoors to preserve its color and prevent discoloration. Apply a new dye coat and keep it away from UV light if your dyed color fades over time. If you don't achieve the color you want after 1-2 times, try painting it instead, as too much dyeing can damage the silicone. Coloring Rubber Temporarily with Acrylic Paints Use acrylics to paint rubber objects. Rubber is especially prone to chipping or flaking after being painted. If you want to paint rubber, buy acrylic paints online or from a craft store for a lasting color. Painting rubber is the most temporary way to stain objects. Choose this method if you're unsure how permanent you want your dyed color to be. Apply a layer of Mod Podge over your object before painting. Mod Podge helps the paint stick to your object and prevent the color from flaking. Use a paint brush to cover the surface in a thin Mod Podge layer, and let it dry for 15-20 minutes. Clean the rubber with soap and water first to remove debris for a more secure paint job. If you have any areas you don't want to paint, affix painter's tape over these areas before applying the Mod Podge. You can buy Mod Podge from most home improvement or craft stores. Use a foam brush to apply the acrylics. Dip a foam brush into the acrylic paint and apply it in even layers to the rubber object. When you've covered the entire surface in the paint, let it dry for 30-60 minutes and inspect the color's brightness. For a stronger color, apply 2-3 coats of paint. Wait for each coat to dry before applying another one, which should take between 30 minutes to an hour. Spray a paint sealer over the rubber to preserve its color. After the last paint coat dries, hold the paint sealer's nozzle 1–2 inches (2.5–5.1 cm) from the surface and spray an even coating over the rubber. Let the paint sealer dry for 30-60 minutes before touching or using the rubber object. Even with paint sealer, acrylic paint may flake or chip over time. Reapply paint coats as needed to restore the rubber's color, spraying more paint sealer afterward.",
  "sentences":[
    " Using Fabric Dyes on Rubber Clean your rubber object thoroughly before dyeing it.",
    "If your object is dirty, its dyed surface may look uneven or discolored.",
    "Wash your object with soap and warm water, scrubbing away any debris as best as you can.",
    "This method works for all rubber types except silicone.",
    "Heat enough water for submerging your rubber object.",
    "Fill a pot with water and heat it on a low to medium stove setting.",
    "The water should be hot, but not boiling—close to, but less than 212 °F (100 °C) is ideal.",
    "Be careful when handling the hot water to prevent burns or spills.",
    "For a more precise measurement, use a water thermometer.",
    "Otherwise, wait for the water to start forming bubbles at the bottom of the pot but not yet boil.",
    "Add fabric dye to the hot water at the proper ratio.",
    "Pour the fabric dye and hot water in a bowl in a ratio determined by the dye packaging.",
    "Mix the fabric dye and water thoroughly until you achieve an even color.",
    "You can buy fabric dye online or at most craft stores.",
    "Fabric dye can stain bowls and other cooking tools, particularly plastics.",
    "To prevent this, use glass or metal cooking tools if possible.",
    "Soak the rubber object for 1-2 hours.",
    "Place the object in the bowl and leave it to soak.",
    "Keep it in the pan for up to 2 hours, depending on how strong or bright you want the new color to be.",
    "As long as you clean and sanitize the kitchen utensils afterward, you can use them for cooking again later.",
    "Check on the object's dyeing progress periodically, but avoid moving it to keep its new color even.",
    "Boil the water as a faster alternative.",
    "Instead of pouring the water into a bowl, fill a pot with the dye mixture and heat it until boiling.",
    "Grab the rubber object with tongs and dip it into the water continually until you reach your desired color, changing the tongs' position as you dip to make sure you thoroughly coat the object.",
    "If you choose this method, it should take up to 20-25 minutes depending on the brightness of the color.",
    "This method, while faster, can result in a more uneven color.",
    "Remove the object from the dye mixture and wash it.",
    "Pick the object out of the water with tongs and run it under warm water to remove the excess dye.",
    "Inspect the object's new color and, if it's not as bright as you would prefer, repeat the process with a higher concentration of dye.",
    "Repeatedly dyeing the rubber over time may damage it.",
    "If you don't achieve the color you want after 1-2 times, try painting it instead.",
    "Trying Hair Dye on Silicone Objects Wash your silicone object thoroughly before dyeing it.",
    "Dyeing silicone objects while they're dirty can result in an unevenly dyed color.",
    "Clean your silicone object with soap and water, and scrub away any stubborn debris or chipped paint before preparing the dye.",
    "Mix the hair dye in a cup or bowl.",
    "Open the hair dye package and mix it according to the kit's instructions.",
    "Most kits include a bottle of hair dye and a developer, which you mix thoroughly until you reach an even color.",
    "Find a well-ventilated area to mix the hair dye, as most chemical dyes have a strong smell.",
    "Buy chemical, not natural, hair dyes for a bright and lasting color.",
    "Coat the silicone objects in the hair dye.",
    "Dip the silicone objects into the hair dye until their surface is thoroughly coated.",
    "Leave the objects in the container while fully coated in the dye to soak in the new color.",
    "This method is ideal for small silicone objects.",
    "For larger silicone objects, you may need to make several hair dye batches.",
    "Let the silicone soak overnight.",
    "Silicone is difficult to dye, and it takes a long time for color to permeate its surface.",
    "Leave the silicone to soak in the hair dye overnight, and remove it from the solution the next day.",
    "The water's temperature should be neither hot or cold but lukewarm.",
    "The longer you leave it in the dye, the deeper its color will be.",
    "Wash the silicone under water and check its color.",
    "Run your silicone object under water to remove any excess dye, then inspect its new color.",
    "If the color is still too light or faded, try dyeing the object again or painting it instead.",
    "You can also try a stronger or brighter hair dye for a deeper color.",
    "Avoid leaving the object outdoors for extended periods of time.",
    "UV light can break down the colors in hair dye and cause it to fade.",
    "Keep your silicone object indoors to preserve its color and prevent discoloration.",
    "Apply a new dye coat and keep it away from UV light if your dyed color fades over time.",
    "If you don't achieve the color you want after 1-2 times, try painting it instead, as too much dyeing can damage the silicone.",
    "Coloring Rubber Temporarily with Acrylic Paints Use acrylics to paint rubber objects.",
    "Rubber is especially prone to chipping or flaking after being painted.",
    "If you want to paint rubber, buy acrylic paints online or from a craft store for a lasting color.",
    "Painting rubber is the most temporary way to stain objects.",
    "Choose this method if you're unsure how permanent you want your dyed color to be.",
    "Apply a layer of Mod Podge over your object before painting.",
    "Mod Podge helps the paint stick to your object and prevent the color from flaking.",
    "Use a paint brush to cover the surface in a thin Mod Podge layer, and let it dry for 15-20 minutes.",
    "Clean the rubber with soap and water first to remove debris for a more secure paint job.",
    "If you have any areas you don't want to paint, affix painter's tape over these areas before applying the Mod Podge.",
    "You can buy Mod Podge from most home improvement or craft stores.",
    "Use a foam brush to apply the acrylics.",
    "Dip a foam brush into the acrylic paint and apply it in even layers to the rubber object.",
    "When you've covered the entire surface in the paint, let it dry for 30-60 minutes and inspect the color's brightness.",
    "For a stronger color, apply 2-3 coats of paint.",
    "Wait for each coat to dry before applying another one, which should take between 30 minutes to an hour.",
    "Spray a paint sealer over the rubber to preserve its color.",
    "After the last paint coat dries, hold the paint sealer's nozzle 1–2 inches (2.5–5.1 cm) from the surface and spray an even coating over the rubber.",
    "Let the paint sealer dry for 30-60 minutes before touching or using the rubber object.",
    "Even with paint sealer, acrylic paint may flake or chip over time.",
    "Reapply paint coats as needed to restore the rubber's color, spraying more paint sealer afterward."
  ],
  "tyn_section":[
    "Water",
    "Soap",
    "Fabric dye",
    "Bowl",
    "Pan",
    "Tongs",
    "Pot (optional)",
    "Trying Hair Dye on Silicone",
    "Hair dye",
    "Cup or bowl",
    "Acrylic paints",
    "Mod Podge",
    "Foam brush",
    "Paint sealer"
  ],
  "tyn_model":[
    "water",
    "hair dye",
    "silicone",
    "fabric dye",
    "mod podge",
    "paint",
    "paint sealer",
    "soap",
    "pot",
    "bowl",
    "acrylic paints",
    "foam brush",
    "acrylic paint",
    "—close",
    "water thermometer",
    "hot water",
    "pan",
    "dye",
    "tongs",
    "container",
    "rubber",
    "paint brush",
    "painter's tape"
  ],
  "simple_metrics":{
    "r":0.7857142857,
    "p":0.4782608696,
    "f1":0.5945945946,
    "avg_pos":0.0
  },
  "jacc_metrics_0.5":{
    "r":0.8571428571,
    "p":0.6956521739,
    "f1":0.768
  },
  "jacc_metrics_0.3333333333333333":{
    "r":1.0,
    "p":0.7826086957,
    "f1":0.8780487805
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.7857142857,
    "p":0.4782608696,
    "f1":0.5945945946
  }
}