{
  "title":"How to Farm Freshwater Mussels",
  "url":"https://www.wikihow.com/Farm-Freshwater-Mussels",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Growing Mussels in Tanks",
      "steps":[
        {
          "headline":"Obtain a sample of mussel embryos.",
          "description":"When female mussels reproduce, they release small clumps of fertilized egg larvae known as glochidia. In order to farm freshwater mussels yourself, it will be necessary to get your hands on a fresh glochidia sample. You’ll then be able to raise the larvae to fully-grown mussels in a highly controlled environment. Contact your local fish hatchery or Fish and Wildlife Services office to see if they can help you find fresh mussel glochidia. The aquatic studies department at your area university might also be able to furnish you with a sample. The farming of freshwater mussels is often closely linked to regional conservation efforts. For this reason, you may have to get special permission from your local government before you can raise mussels in captivity."
        },
        {
          "headline":"Surround the glochidia with salt to test their viability.",
          "description":"Place the glochidia samples on a clean, flat surface and sprinkle each one with a few grains of ordinary table salt. Healthy glochidia will close around the salt particles and begin absorbing them slowly. The larvae that aren’t viable will close very slowly, or may not close at all. Dispose of any glochidia that don’t respond when exposed to the salt. Salt is used to simulate the chloride found in the blood of host fish that share rivers and stream with freshwater mussels. Glochidia feed on this chloride until they reach maturity."
        },
        {
          "headline":"Set up a freshwater tank or pen.",
          "description":"Cover the bottom of the tank with sand or silt collected from a nearby river or another body of water and fill it with fresh, unchlorinated water. The tank itself should be big enough to house a small number of fish, which will play host to the developing glochidia. If possible, incorporate other natural features as well, such as rocks, moss, and algae. The more closely your specimen tank resembles a riverbed, the more hospitable it will be to growing mussels."
        },
        {
          "headline":"Introduce freshwater fish to the tank with the mussel glochidia.",
          "description":"Release the viable glochidia into the water along with 2-3 fish specimens sources from a regional body of water. The larvae will attach themselves to the gills of the fish, where they’ll live as parasites until they’re large enough to survive on their own. It’s not necessary to place the glochidia on the gills of the host fish yourself—they’ll find their way there when the fish attempt to eat the larvae and scatter them throughout the water. Each species of mussel requires a different host in order to reproduce successfully. Consult with a local wildlife expert to find out which species of fish the mussels in your area naturally seek out as hosts."
        },
        {
          "headline":"Wait for the mussels to reach maturity.",
          "description":"The glochidia may live on the gills of the host fish for days or weeks. Once they become large enough, they’ll drop off and sink to the bottom of the tank. There, they’ll burrow into the sandy floor and begin feeding on the bacteria and sediment found there. In some instances, freshwater mussels have been known to remain with a host fish for as long as 18 months."
        },
        {
          "headline":"Allow the mussels to continue growing along the bottom of the tank.",
          "description":"Monitor the development of the mussels over the following weeks and months. There’s quite a bit of variety in the size of freshwater mussels, but some of the largest species reach lengths of up to 11 inches (28 cm), and can weigh as much as 5 pounds (2.3 kg)! In their natural habitat, freshwater mussels feed on microscopic bacteria and other organic matter. When raised in tanks or pens, however, it may be necessary to use algae or phytoplankton to supplement their diet."
        }
      ]
    },
    {
      "name":"Using Ropes to Gather Mussels in Deep Waters",
      "steps":[
        {
          "headline":"Equip yourself with a few coils of mussel rope.",
          "description":"Mussel ropes are designed to snag microscopic mussel spawn floating by in a moving current. They come in many different styles, including “Christmas tree,” which features long bristles that provide extra surface area, and “Aquasteel,” a dense braided rope that holds up to many seasons of prolonged submersion. Take the time to shop around for a style of rope that works best for your operation. If you’re interested in farming mussels yourself, all you need is a frayed rope and pole or platform to secure it to."
        },
        {
          "headline":"Line the waters of your designated farming area with a series of buoys.",
          "description":"Arrange the buoys in rows, leaving 6–10 feet (1.8–3.0 m) between each row to provide ample room to maneuver your boat. The buoys will be used to fasten and anchor the mussel ropes, ensuring that they aren’t swept away by the current. Depending on where you live, a special business permit may be required in order to deposit buoys or claim commercial waters for farming space."
        },
        {
          "headline":"Attach the mussel ropes to the buoys.",
          "description":"Run a thick steel cable from one buoy to the next to join them together. You’ll then use small clamp lines connect each length of mussel rope to the main line so that they’re suspended vertically beneath the surface of the water. You can hang your mussel ropes in straight lines or in long, loose loops, which may be easier to manage if you have multiple ropes situated side-by-side. However you choose to configure your mussel ropes, it’s important that they be free of twists, tangles, or kinks when you lower them into the water. The straighter the rope, the more mussels it will hold."
        },
        {
          "headline":"Submerge the ropes and leave them to attract drifting mussel spawn.",
          "description":"Mussels in the wild naturally latch on to whatever objects they come across underwater in order to have a stationary place to grow. Mussel ropes therefore serve as a far easier method of gathering shellfish than fishing nets or harvesting by hand. Once the ropes are in place, you’ll be able to easily pull them and inspect them at any time."
        },
        {
          "headline":"Allow the mussels to grow to roughly 4 inches (100 mm).",
          "description":"At first, the mussel larvae that attach themselves to your ropes will be much too small to see. Over time, you’ll begin to notice the tiny spawn growing larger. They’ll need to reach a length of at least 3–4 inches (7.6–10.2 cm) before they’re ready to be harvested. It takes an average of 2-3 years for mussels to grow to their full size. Check your ropes regularly (daily, if possible) to keep close tabs on the mussels growing on them."
        },
        {
          "headline":"Pull up the ropes.",
          "description":"Once the most of the mature mussels measure 4 inches (10 cm), use a tow cable or hand hook to remove the ropes from the water. You can then harvest the mussels and prepare them to be cleaned, sorted, or taken to market. If necessary, spray the mussels with a hose to rinse off any accumulate dirt, silt, or algae prior to harvesting."
        },
        {
          "headline":"Strip the mussels from the ropes.",
          "description":"Break up clusters of mature mussels by hand, or feed the entire rope through a de-clumping machine to separate them more efficiently. Have a bin or similar large container on standby where you can deposit the loose mussels as you remove them. When harvesting mussels by hand, be sure to wear gloves to avoid cutting yourself on any partially-opened shells."
        }
      ]
    }
  ],
  "text":" Growing Mussels in Tanks Obtain a sample of mussel embryos. When female mussels reproduce, they release small clumps of fertilized egg larvae known as glochidia. In order to farm freshwater mussels yourself, it will be necessary to get your hands on a fresh glochidia sample. You’ll then be able to raise the larvae to fully-grown mussels in a highly controlled environment. Contact your local fish hatchery or Fish and Wildlife Services office to see if they can help you find fresh mussel glochidia. The aquatic studies department at your area university might also be able to furnish you with a sample. The farming of freshwater mussels is often closely linked to regional conservation efforts. For this reason, you may have to get special permission from your local government before you can raise mussels in captivity. Surround the glochidia with salt to test their viability. Place the glochidia samples on a clean, flat surface and sprinkle each one with a few grains of ordinary table salt. Healthy glochidia will close around the salt particles and begin absorbing them slowly. The larvae that aren’t viable will close very slowly, or may not close at all. Dispose of any glochidia that don’t respond when exposed to the salt. Salt is used to simulate the chloride found in the blood of host fish that share rivers and stream with freshwater mussels. Glochidia feed on this chloride until they reach maturity. Set up a freshwater tank or pen. Cover the bottom of the tank with sand or silt collected from a nearby river or another body of water and fill it with fresh, unchlorinated water. The tank itself should be big enough to house a small number of fish, which will play host to the developing glochidia. If possible, incorporate other natural features as well, such as rocks, moss, and algae. The more closely your specimen tank resembles a riverbed, the more hospitable it will be to growing mussels. Introduce freshwater fish to the tank with the mussel glochidia. Release the viable glochidia into the water along with 2-3 fish specimens sources from a regional body of water. The larvae will attach themselves to the gills of the fish, where they’ll live as parasites until they’re large enough to survive on their own. It’s not necessary to place the glochidia on the gills of the host fish yourself—they’ll find their way there when the fish attempt to eat the larvae and scatter them throughout the water. Each species of mussel requires a different host in order to reproduce successfully. Consult with a local wildlife expert to find out which species of fish the mussels in your area naturally seek out as hosts. Wait for the mussels to reach maturity. The glochidia may live on the gills of the host fish for days or weeks. Once they become large enough, they’ll drop off and sink to the bottom of the tank. There, they’ll burrow into the sandy floor and begin feeding on the bacteria and sediment found there. In some instances, freshwater mussels have been known to remain with a host fish for as long as 18 months. Allow the mussels to continue growing along the bottom of the tank. Monitor the development of the mussels over the following weeks and months. There’s quite a bit of variety in the size of freshwater mussels, but some of the largest species reach lengths of up to 11 inches (28 cm), and can weigh as much as 5 pounds (2.3 kg)! In their natural habitat, freshwater mussels feed on microscopic bacteria and other organic matter. When raised in tanks or pens, however, it may be necessary to use algae or phytoplankton to supplement their diet. Using Ropes to Gather Mussels in Deep Waters Equip yourself with a few coils of mussel rope. Mussel ropes are designed to snag microscopic mussel spawn floating by in a moving current. They come in many different styles, including “Christmas tree,” which features long bristles that provide extra surface area, and “Aquasteel,” a dense braided rope that holds up to many seasons of prolonged submersion. Take the time to shop around for a style of rope that works best for your operation. If you’re interested in farming mussels yourself, all you need is a frayed rope and pole or platform to secure it to. Line the waters of your designated farming area with a series of buoys. Arrange the buoys in rows, leaving 6–10 feet (1.8–3.0 m) between each row to provide ample room to maneuver your boat. The buoys will be used to fasten and anchor the mussel ropes, ensuring that they aren’t swept away by the current. Depending on where you live, a special business permit may be required in order to deposit buoys or claim commercial waters for farming space. Attach the mussel ropes to the buoys. Run a thick steel cable from one buoy to the next to join them together. You’ll then use small clamp lines connect each length of mussel rope to the main line so that they’re suspended vertically beneath the surface of the water. You can hang your mussel ropes in straight lines or in long, loose loops, which may be easier to manage if you have multiple ropes situated side-by-side. However you choose to configure your mussel ropes, it’s important that they be free of twists, tangles, or kinks when you lower them into the water. The straighter the rope, the more mussels it will hold. Submerge the ropes and leave them to attract drifting mussel spawn. Mussels in the wild naturally latch on to whatever objects they come across underwater in order to have a stationary place to grow. Mussel ropes therefore serve as a far easier method of gathering shellfish than fishing nets or harvesting by hand. Once the ropes are in place, you’ll be able to easily pull them and inspect them at any time. Allow the mussels to grow to roughly 4 inches (100 mm). At first, the mussel larvae that attach themselves to your ropes will be much too small to see. Over time, you’ll begin to notice the tiny spawn growing larger. They’ll need to reach a length of at least 3–4 inches (7.6–10.2 cm) before they’re ready to be harvested. It takes an average of 2-3 years for mussels to grow to their full size. Check your ropes regularly (daily, if possible) to keep close tabs on the mussels growing on them. Pull up the ropes. Once the most of the mature mussels measure 4 inches (10 cm), use a tow cable or hand hook to remove the ropes from the water. You can then harvest the mussels and prepare them to be cleaned, sorted, or taken to market. If necessary, spray the mussels with a hose to rinse off any accumulate dirt, silt, or algae prior to harvesting. Strip the mussels from the ropes. Break up clusters of mature mussels by hand, or feed the entire rope through a de-clumping machine to separate them more efficiently. Have a bin or similar large container on standby where you can deposit the loose mussels as you remove them. When harvesting mussels by hand, be sure to wear gloves to avoid cutting yourself on any partially-opened shells.",
  "sentences":[
    " Growing Mussels in Tanks Obtain a sample of mussel embryos.",
    "When female mussels reproduce, they release small clumps of fertilized egg larvae known as glochidia.",
    "In order to farm freshwater mussels yourself, it will be necessary to get your hands on a fresh glochidia sample.",
    "You’ll then be able to raise the larvae to fully-grown mussels in a highly controlled environment.",
    "Contact your local fish hatchery or Fish and Wildlife Services office to see if they can help you find fresh mussel glochidia.",
    "The aquatic studies department at your area university might also be able to furnish you with a sample.",
    "The farming of freshwater mussels is often closely linked to regional conservation efforts.",
    "For this reason, you may have to get special permission from your local government before you can raise mussels in captivity.",
    "Surround the glochidia with salt to test their viability.",
    "Place the glochidia samples on a clean, flat surface and sprinkle each one with a few grains of ordinary table salt.",
    "Healthy glochidia will close around the salt particles and begin absorbing them slowly.",
    "The larvae that aren’t viable will close very slowly, or may not close at all.",
    "Dispose of any glochidia that don’t respond when exposed to the salt.",
    "Salt is used to simulate the chloride found in the blood of host fish that share rivers and stream with freshwater mussels.",
    "Glochidia feed on this chloride until they reach maturity.",
    "Set up a freshwater tank or pen.",
    "Cover the bottom of the tank with sand or silt collected from a nearby river or another body of water and fill it with fresh, unchlorinated water.",
    "The tank itself should be big enough to house a small number of fish, which will play host to the developing glochidia.",
    "If possible, incorporate other natural features as well, such as rocks, moss, and algae.",
    "The more closely your specimen tank resembles a riverbed, the more hospitable it will be to growing mussels.",
    "Introduce freshwater fish to the tank with the mussel glochidia.",
    "Release the viable glochidia into the water along with 2-3 fish specimens sources from a regional body of water.",
    "The larvae will attach themselves to the gills of the fish, where they’ll live as parasites until they’re large enough to survive on their own.",
    "It’s not necessary to place the glochidia on the gills of the host fish yourself—they’ll find their way there when the fish attempt to eat the larvae and scatter them throughout the water.",
    "Each species of mussel requires a different host in order to reproduce successfully.",
    "Consult with a local wildlife expert to find out which species of fish the mussels in your area naturally seek out as hosts.",
    "Wait for the mussels to reach maturity.",
    "The glochidia may live on the gills of the host fish for days or weeks.",
    "Once they become large enough, they’ll drop off and sink to the bottom of the tank.",
    "There, they’ll burrow into the sandy floor and begin feeding on the bacteria and sediment found there.",
    "In some instances, freshwater mussels have been known to remain with a host fish for as long as 18 months.",
    "Allow the mussels to continue growing along the bottom of the tank.",
    "Monitor the development of the mussels over the following weeks and months.",
    "There’s quite a bit of variety in the size of freshwater mussels, but some of the largest species reach lengths of up to 11 inches (28 cm), and can weigh as much as 5 pounds (2.3 kg)!",
    "In their natural habitat, freshwater mussels feed on microscopic bacteria and other organic matter.",
    "When raised in tanks or pens, however, it may be necessary to use algae or phytoplankton to supplement their diet.",
    "Using Ropes to Gather Mussels in Deep Waters Equip yourself with a few coils of mussel rope.",
    "Mussel ropes are designed to snag microscopic mussel spawn floating by in a moving current.",
    "They come in many different styles, including “Christmas tree,” which features long bristles that provide extra surface area, and “Aquasteel,” a dense braided rope that holds up to many seasons of prolonged submersion.",
    "Take the time to shop around for a style of rope that works best for your operation.",
    "If you’re interested in farming mussels yourself, all you need is a frayed rope and pole or platform to secure it to.",
    "Line the waters of your designated farming area with a series of buoys.",
    "Arrange the buoys in rows, leaving 6–10 feet (1.8–3.0 m) between each row to provide ample room to maneuver your boat.",
    "The buoys will be used to fasten and anchor the mussel ropes, ensuring that they aren’t swept away by the current.",
    "Depending on where you live, a special business permit may be required in order to deposit buoys or claim commercial waters for farming space.",
    "Attach the mussel ropes to the buoys.",
    "Run a thick steel cable from one buoy to the next to join them together.",
    "You’ll then use small clamp lines connect each length of mussel rope to the main line so that they’re suspended vertically beneath the surface of the water.",
    "You can hang your mussel ropes in straight lines or in long, loose loops, which may be easier to manage if you have multiple ropes situated side-by-side.",
    "However you choose to configure your mussel ropes, it’s important that they be free of twists, tangles, or kinks when you lower them into the water.",
    "The straighter the rope, the more mussels it will hold.",
    "Submerge the ropes and leave them to attract drifting mussel spawn.",
    "Mussels in the wild naturally latch on to whatever objects they come across underwater in order to have a stationary place to grow.",
    "Mussel ropes therefore serve as a far easier method of gathering shellfish than fishing nets or harvesting by hand.",
    "Once the ropes are in place, you’ll be able to easily pull them and inspect them at any time.",
    "Allow the mussels to grow to roughly 4 inches (100 mm).",
    "At first, the mussel larvae that attach themselves to your ropes will be much too small to see.",
    "Over time, you’ll begin to notice the tiny spawn growing larger.",
    "They’ll need to reach a length of at least 3–4 inches (7.6–10.2 cm) before they’re ready to be harvested.",
    "It takes an average of 2-3 years for mussels to grow to their full size.",
    "Check your ropes regularly (daily, if possible) to keep close tabs on the mussels growing on them.",
    "Pull up the ropes.",
    "Once the most of the mature mussels measure 4 inches (10 cm), use a tow cable or hand hook to remove the ropes from the water.",
    "You can then harvest the mussels and prepare them to be cleaned, sorted, or taken to market.",
    "If necessary, spray the mussels with a hose to rinse off any accumulate dirt, silt, or algae prior to harvesting.",
    "Strip the mussels from the ropes.",
    "Break up clusters of mature mussels by hand, or feed the entire rope through a de-clumping machine to separate them more efficiently.",
    "Have a bin or similar large container on standby where you can deposit the loose mussels as you remove them.",
    "When harvesting mussels by hand, be sure to wear gloves to avoid cutting yourself on any partially-opened shells."
  ],
  "tyn_section":[
    "Freshwater tank or pen",
    "Host fish specimens",
    "Phytoplankton or algae (for supplementing diet)",
    "Fishing boat",
    "Mussel rope",
    "Buoys",
    "Steel cable",
    "Tow line or hand hook",
    "De-clumping machine (optional)"
  ],
  "tyn_model":[
    "mussels",
    "water",
    "freshwater mussels",
    "fish",
    "mussel",
    "mussel ropes",
    "salt",
    "rope",
    "chloride",
    "algae",
    "ropes",
    "mussel rope",
    "buoys",
    "aquatic studies department",
    "table salt",
    "freshwater tank",
    "rocks",
    "freshwater fish",
    "—they’ll",
    "bacteria",
    "“christmas",
    "” which",
    "“aquasteel",
    "” a",
    "shellfish",
    "tow cable",
    "hose",
    "bin",
    "gloves"
  ],
  "simple_metrics":{
    "r":0.2222222222,
    "p":0.0689655172,
    "f1":0.1052631579,
    "avg_pos":0
  },
  "jacc_metrics_0.5":{
    "r":0.3333333333,
    "p":0.1724137931,
    "f1":0.2272727273
  },
  "jacc_metrics_0.3333333333333333":{
    "r":0.5555555556,
    "p":0.275862069,
    "f1":0.3686635945
  },
  "jacc_metrics_0.6666666666666666":{
    "r":0.2222222222,
    "p":0.0689655172,
    "f1":0.1052631579
  }
}