{
    "title": "How to Refill a Perfume Travel Bottle",
    "url": "https://www.wikihow.com/Refill-a-Perfume-Travel-Bottle",
    "category_hierarchy": [
        "Travel",
        "Travel Accessories",
        "Travel Toiletries"
    ],
    "methods": [
        {
            "name": "Refilling a Metal Travel Bottle from a Perfume Atomizer",
            "steps": [
                {
                    "headline": "Take off the cap and sprayer of your main perfume bottle.",
                    "description": "The cap is usually a plastic or glass attachment to protect the sprayer. The sprayer is the piece on the top that you press down to release perfume. To remove the cap from your main bottle, simply lift up on the cap and place the cap to the side. Then, gently pull off the sprayer with your fingers. The short, vertical nozzle will remain. This way, you can get the perfume from the main bottle into your travel bottle."
                },
                {
                    "headline": "Pull off the metal casing of your travel perfume bottle.",
                    "description": "Most metal perfume travel bottles come with an outside casing to protect the inside unit. Hold the bottom of the casing between your index finger and thumb, and slide it off. It is easier to fill up your travel bottle if you remove the outer casing. Once you remove the casing, you’ll see a small plastic tank to house the perfume."
                },
                {
                    "headline": "Place the bottom of your travel bottle on top of the spray nozzle.",
                    "description": "At the bottom of the plastic unit is a small red dot. Align the red dot with the nozzle on your main perfume bottle. If you did not take the metal casing off, that’s okay. Simply line up the bottom end of the travel perfume bottle with the nozzle on the main bottle. You can still fill the atomizer with the casing on."
                },
                {
                    "headline": "Lift up and down on the perfume travel bottle to pump it full of perfume.",
                    "description": "Once the red dot or bottom of the bottle is aligned with the nozzle, gently press down on the travel bottle. This releases perfume into the unit so you can pump the atomizer full of perfume. Continue lifting up and down several times until your travel perfume bottle is full. When you do this, you are essentially filling the travel bottle like how you usually press down on the sprayer to apply perfume. Look at the side of the bottle to easily watch the perfume fill up, whether or not you removed the metal casing. When full, the travel perfume bottle holds 50 full sprays or 0.13 ounces (3.9 mL)."
                },
                {
                    "headline": "Replace the casing of the travel bottle and the sprayer and cap of the main bottle.",
                    "description": "Once the travel bottle is full, take the bottle off of the main perfume bottle, and put the metal casing back in place. Then, place the sprayer and cap back onto the main perfume bottle. When you put the sprayer back on, it will spray out a bit of perfume. Point the bottle toward a sink so it doesn’t spray into your eyes."
                }
            ]
        },
        {
            "name": "Filling Plastic Travel Bottles from Metal Perfume Atomizers",
            "steps": [
                {
                    "headline": "Remove the plastic cap and sprayer from your travel perfume bottle.",
                    "description": "If you have a plastic perfume atomizer, simply lift off the plastic cap from the outside. Then, unscrew the plastic sprayer from the top. Sit the lid and the sprayer to the side until you fill up the bottle."
                },
                {
                    "headline": "Hold the sprayer of the main bottle up to the top of the travel bottle.",
                    "description": "Uncap the perfume bottle, and hold the main perfume bottle directly above the travel bottle so it almost touches. This way, the perfume sprays directly into the plastic travel bottle."
                },
                {
                    "headline": "Press down on the sprayer repeatedly to fill up your travel bottle.",
                    "description": "Simply push down on the sprayer of the main perfume bottle multiple times until the travel bottle is filled up. Leave around ⁄4 in (0.64 cm) of space at the top so you can easily replace the sprayer."
                },
                {
                    "headline": "Screw the sprayer into place.",
                    "description": "Once your travel bottle is full, put the plastic sprayer back on top. Twist it clockwise to tighten the sprayer into place. Then, put the cap onto the travel bottle. Additionally, replace the cap on the main perfume bottle."
                }
            ]
        },
        {
            "name": "Refilling Glass or Plastic Travel Bottles from Splash Bottles",
            "steps": [
                {
                    "headline": "Remove the cap from the main bottle and the sprayer of the travel bottle.",
                    "description": "Both the main perfume and your travel bottle include a covering cap. Gently lift off the cap from both. Then, twist off the sprayer from the glass or plastic travel bottle. This way, you can easily refill from a splash bottle of perfume. Splash perfume is applied by pouring a small dab of perfume or cologne onto your neck or wrist, rather than spraying it into the air. If your travel bottle comes with a decorative, metal casing, simply slip it off so you can see how much perfume is in the travel bottle. This method does not work for metal perfume atomizers."
                },
                {
                    "headline": "Place a small funnel at the top of the travel bottle.",
                    "description": "Use a tiny craft funnel to easily pour in your perfume. The funnel easily fits into the top of your glass or plastic travel perfume bottle. The funnel catches every drop of your perfume so none of it is wasted upon transfer."
                },
                {
                    "headline": "Pour the perfume from your main bottle into the funnel.",
                    "description": "When refilling from a splash bottle, simply pour the perfume carefully into the funnel. Start slow so the funnel does not overflow. In addition, hold the base of the funnel at the lip of the bottle to keep it stable. Stop pouring the perfume when the bottle is about 3/4 of the way full. If using a spray perfume bottle, hold the applicator tip over the funnel, and simply push down on the sprayer repeatedly until the travel bottle is full."
                },
                {
                    "headline": "Replace the sprayer, casing, and cap on your travel bottle.",
                    "description": "Once the travel bottle is full, twist the sprayer back into place, and put the cap on top. Then, slide the travel bottle into the casing if it came with 1. In addition, replace the cap on your splash perfume bottle."
                }
            ]
        }
    ],
    "tyn": [
        "Refilling a Metal Travel Bottle",
        "Metal travel bottle",
        "Main perfume",
        "Filling Plastic Travel Bottles",
        "Plastic travel bottle",
        "Refilling from Splash Bottles",
        "Glass or plastic travel bottle",
        "Splash perfume bottle",
        "Funnel"
    ],
    "text": " Refilling a Metal Travel Bottle from a Perfume Atomizer Take off the cap and sprayer of your main perfume bottle. The cap is usually a plastic or glass attachment to protect the sprayer. The sprayer is the piece on the top that you press down to release perfume. To remove the cap from your main bottle, simply lift up on the cap and place the cap to the side. Then, gently pull off the sprayer with your fingers. The short, vertical nozzle will remain. This way, you can get the perfume from the main bottle into your travel bottle. Pull off the metal casing of your travel perfume bottle. Most metal perfume travel bottles come with an outside casing to protect the inside unit. Hold the bottom of the casing between your index finger and thumb, and slide it off. It is easier to fill up your travel bottle if you remove the outer casing. Once you remove the casing, you’ll see a small plastic tank to house the perfume. Place the bottom of your travel bottle on top of the spray nozzle. At the bottom of the plastic unit is a small red dot. Align the red dot with the nozzle on your main perfume bottle. If you did not take the metal casing off, that’s okay. Simply line up the bottom end of the travel perfume bottle with the nozzle on the main bottle. You can still fill the atomizer with the casing on. Lift up and down on the perfume travel bottle to pump it full of perfume. Once the red dot or bottom of the bottle is aligned with the nozzle, gently press down on the travel bottle. This releases perfume into the unit so you can pump the atomizer full of perfume. Continue lifting up and down several times until your travel perfume bottle is full. When you do this, you are essentially filling the travel bottle like how you usually press down on the sprayer to apply perfume. Look at the side of the bottle to easily watch the perfume fill up, whether or not you removed the metal casing. When full, the travel perfume bottle holds 50 full sprays or 0.13 ounces (3.9 mL). Replace the casing of the travel bottle and the sprayer and cap of the main bottle. Once the travel bottle is full, take the bottle off of the main perfume bottle, and put the metal casing back in place. Then, place the sprayer and cap back onto the main perfume bottle. When you put the sprayer back on, it will spray out a bit of perfume. Point the bottle toward a sink so it doesn’t spray into your eyes. Filling Plastic Travel Bottles from Metal Perfume Atomizers Remove the plastic cap and sprayer from your travel perfume bottle. If you have a plastic perfume atomizer, simply lift off the plastic cap from the outside. Then, unscrew the plastic sprayer from the top. Sit the lid and the sprayer to the side until you fill up the bottle. Hold the sprayer of the main bottle up to the top of the travel bottle. Uncap the perfume bottle, and hold the main perfume bottle directly above the travel bottle so it almost touches. This way, the perfume sprays directly into the plastic travel bottle. Press down on the sprayer repeatedly to fill up your travel bottle. Simply push down on the sprayer of the main perfume bottle multiple times until the travel bottle is filled up. Leave around ⁄4 in (0.64 cm) of space at the top so you can easily replace the sprayer. Screw the sprayer into place. Once your travel bottle is full, put the plastic sprayer back on top. Twist it clockwise to tighten the sprayer into place. Then, put the cap onto the travel bottle. Additionally, replace the cap on the main perfume bottle. Refilling Glass or Plastic Travel Bottles from Splash Bottles Remove the cap from the main bottle and the sprayer of the travel bottle. Both the main perfume and your travel bottle include a covering cap. Gently lift off the cap from both. Then, twist off the sprayer from the glass or plastic travel bottle. This way, you can easily refill from a splash bottle of perfume. Splash perfume is applied by pouring a small dab of perfume or cologne onto your neck or wrist, rather than spraying it into the air. If your travel bottle comes with a decorative, metal casing, simply slip it off so you can see how much perfume is in the travel bottle. This method does not work for metal perfume atomizers. Place a small funnel at the top of the travel bottle. Use a tiny craft funnel to easily pour in your perfume. The funnel easily fits into the top of your glass or plastic travel perfume bottle. The funnel catches every drop of your perfume so none of it is wasted upon transfer. Pour the perfume from your main bottle into the funnel. When refilling from a splash bottle, simply pour the perfume carefully into the funnel. Start slow so the funnel does not overflow. In addition, hold the base of the funnel at the lip of the bottle to keep it stable. Stop pouring the perfume when the bottle is about 3/4 of the way full. If using a spray perfume bottle, hold the applicator tip over the funnel, and simply push down on the sprayer repeatedly until the travel bottle is full. Replace the sprayer, casing, and cap on your travel bottle. Once the travel bottle is full, twist the sprayer back into place, and put the cap on top. Then, slide the travel bottle into the casing if it came with 1. In addition, replace the cap on your splash perfume bottle.",
    "sentences": [
        " Refilling a Metal Travel Bottle from a Perfume Atomizer Take off the cap and sprayer of your main perfume bottle.",
        "The cap is usually a plastic or glass attachment to protect the sprayer.",
        "The sprayer is the piece on the top that you press down to release perfume.",
        "To remove the cap from your main bottle, simply lift up on the cap and place the cap to the side.",
        "Then, gently pull off the sprayer with your fingers.",
        "The short, vertical nozzle will remain.",
        "This way, you can get the perfume from the main bottle into your travel bottle.",
        "Pull off the metal casing of your travel perfume bottle.",
        "Most metal perfume travel bottles come with an outside casing to protect the inside unit.",
        "Hold the bottom of the casing between your index finger and thumb, and slide it off.",
        "It is easier to fill up your travel bottle if you remove the outer casing.",
        "Once you remove the casing, you’ll see a small plastic tank to house the perfume.",
        "Place the bottom of your travel bottle on top of the spray nozzle.",
        "At the bottom of the plastic unit is a small red dot.",
        "Align the red dot with the nozzle on your main perfume bottle.",
        "If you did not take the metal casing off, that’s okay.",
        "Simply line up the bottom end of the travel perfume bottle with the nozzle on the main bottle.",
        "You can still fill the atomizer with the casing on.",
        "Lift up and down on the perfume travel bottle to pump it full of perfume.",
        "Once the red dot or bottom of the bottle is aligned with the nozzle, gently press down on the travel bottle.",
        "This releases perfume into the unit so you can pump the atomizer full of perfume.",
        "Continue lifting up and down several times until your travel perfume bottle is full.",
        "When you do this, you are essentially filling the travel bottle like how you usually press down on the sprayer to apply perfume.",
        "Look at the side of the bottle to easily watch the perfume fill up, whether or not you removed the metal casing.",
        "When full, the travel perfume bottle holds 50 full sprays or 0.13 ounces (3.9 mL).",
        "Replace the casing of the travel bottle and the sprayer and cap of the main bottle.",
        "Once the travel bottle is full, take the bottle off of the main perfume bottle, and put the metal casing back in place.",
        "Then, place the sprayer and cap back onto the main perfume bottle.",
        "When you put the sprayer back on, it will spray out a bit of perfume.",
        "Point the bottle toward a sink so it doesn’t spray into your eyes.",
        "Filling Plastic Travel Bottles from Metal Perfume Atomizers Remove the plastic cap and sprayer from your travel perfume bottle.",
        "If you have a plastic perfume atomizer, simply lift off the plastic cap from the outside.",
        "Then, unscrew the plastic sprayer from the top.",
        "Sit the lid and the sprayer to the side until you fill up the bottle.",
        "Hold the sprayer of the main bottle up to the top of the travel bottle.",
        "Uncap the perfume bottle, and hold the main perfume bottle directly above the travel bottle so it almost touches.",
        "This way, the perfume sprays directly into the plastic travel bottle.",
        "Press down on the sprayer repeatedly to fill up your travel bottle.",
        "Simply push down on the sprayer of the main perfume bottle multiple times until the travel bottle is filled up.",
        "Leave around ⁄4 in (0.64 cm) of space at the top so you can easily replace the sprayer.",
        "Screw the sprayer into place.",
        "Once your travel bottle is full, put the plastic sprayer back on top.",
        "Twist it clockwise to tighten the sprayer into place.",
        "Then, put the cap onto the travel bottle.",
        "Additionally, replace the cap on the main perfume bottle.",
        "Refilling Glass or Plastic Travel Bottles from Splash Bottles Remove the cap from the main bottle and the sprayer of the travel bottle.",
        "Both the main perfume and your travel bottle include a covering cap.",
        "Gently lift off the cap from both.",
        "Then, twist off the sprayer from the glass or plastic travel bottle.",
        "This way, you can easily refill from a splash bottle of perfume.",
        "Splash perfume is applied by pouring a small dab of perfume or cologne onto your neck or wrist, rather than spraying it into the air.",
        "If your travel bottle comes with a decorative, metal casing, simply slip it off so you can see how much perfume is in the travel bottle.",
        "This method does not work for metal perfume atomizers.",
        "Place a small funnel at the top of the travel bottle.",
        "Use a tiny craft funnel to easily pour in your perfume.",
        "The funnel easily fits into the top of your glass or plastic travel perfume bottle.",
        "The funnel catches every drop of your perfume so none of it is wasted upon transfer.",
        "Pour the perfume from your main bottle into the funnel.",
        "When refilling from a splash bottle, simply pour the perfume carefully into the funnel.",
        "Start slow so the funnel does not overflow.",
        "In addition, hold the base of the funnel at the lip of the bottle to keep it stable.",
        "Stop pouring the perfume when the bottle is about 3/4 of the way full.",
        "If using a spray perfume bottle, hold the applicator tip over the funnel, and simply push down on the sprayer repeatedly until the travel bottle is full.",
        "Replace the sprayer, casing, and cap on your travel bottle.",
        "Once the travel bottle is full, twist the sprayer back into place, and put the cap on top.",
        "Then, slide the travel bottle into the casing if it came with 1.",
        "In addition, replace the cap on your splash perfume bottle."
    ]
}