{
    "title": "How to Burn in Headphones",
    "url": "https://www.wikihow.com/Burn-in-Headphones",
    "category_hierarchy": [
        "Computers and Electronics",
        "Audio",
        "Audio Speakers"
    ],
    "parts": [
        {
            "name": "Preparing a Burn-in Playlist",
            "steps": [
                {
                    "headline": "Select music with a wide range of frequencies.",
                    "description": "You will need at least 40 hours of music or sound. The more hours you can get without having to loop the playlist, the better. You want lots of different music so it loosens the drivers in your headphones and they become accustomed to producing various sounds at an optimal level. Even if you don’t like a particular genre of music, you should include it in your playlist to give your headphones the best workout. Add a mixture of pop, rock, heavy metal, rap, hip-hop and R&B, country, and classical music to ensure a wide range."
                },
                {
                    "headline": "Incorporate periods of white noise and pink noise on your playlist.",
                    "description": "You can use your audio software to loop pink and/or white noise so that it plays for an extended period of time. An easier method would be to find a video that plays pink or white noise on YouTube and play it through your headphones. For good measure, search “frequency sweeps” on YouTube to include 20-20000 Hz, 10-30000 Hz, and 20-200 Hz frequency sweeps on your playlist."
                },
                {
                    "headline": "Use a program on your computer to make a playlist of the burn-in tracks.",
                    "description": "Alternate the music genres to encourage your headphones to adjust to the various changes in bass, treble, and frequency. Programs like Windows Media Player, iTunes, and Winamp are easy to use for making custom playlists. Add the songs you want, then organize the files by alternating the genres. For instance, play a country song followed by a heavy metal track."
                },
                {
                    "headline": "Get a pre-recorded audio file if you don’t have time to make a playlist.",
                    "description": "Search online for “audio burn-in file.” You will find free options to use online players featuring a pre-recorded audio file, as well as options to download the file to play without using an internet connection. If you go this route, simply follow the instructions provided with the program."
                },
                {
                    "headline": "Download a burn-in app if you want to use your phone.",
                    "description": "Both iTunes and Google Play offer apps specifically designed for burning-in your headphones. The apps are essentially the same as an audio file—with pre-built playlists that alternate music, noise, and rest periods—just made for your phone. Many of these apps are free, but some cost up to $2.99. Read the product descriptions and reviews to find which app might work the best for you."
                }
            ]
        },
        {
            "name": "Setting up the Audio",
            "steps": [
                {
                    "headline": "Connect your headphones to a computer using a wired connection.",
                    "description": "Use the auxiliary cable or USB cord—whichever your headphones are equipped with—to make the connection. Bluetooth tends to not produce very clear sounds, so for the burn-in, make sure to use a wired connection. You may also use an MP3 player for the process."
                },
                {
                    "headline": "Listen to make sure the music is playing through your headphones.",
                    "description": "First, simply ensure that your headphones are producing sound. After that, take a closer listen and note the quality of the sound. You can take notes if you’d like so that you can track the progress and make comparisons."
                },
                {
                    "headline": "Double-check your settings and connection if you don’t hear any sound.",
                    "description": "Make sure the volume is turned up on both the headphones and the computer; check that each end of the cable is fully inserted into the port on your headphones and computer; and ensure that there is no damage to the cord."
                },
                {
                    "headline": "Make sure the volume is set to a medium level before playing the tracks.",
                    "description": "If you have the volume set too low, the headphones won’t produce sufficient sound to loosen the drivers. If the volume is set too high, it can damage your headphones. If you hear distortion, pops, or cracks in the music, it means you have the volume turned up too loud."
                }
            ]
        },
        {
            "name": "Playing the Music Files",
            "steps": [
                {
                    "headline": "Play the music for 4-5 hours a day to slowly warm up the diaphragm.",
                    "description": "Some people opt to run their playlist for 40 hours straight as soon as they take them out of the box. This may work, however, it also has the potential to cause too much strain on the diaphragm. To play it safe, run your playlist for 4-5 hours a day for 5-9 days to ease your headphones in."
                },
                {
                    "headline": "Avoid wearing the headphones during the burn-in process.",
                    "description": "This is particularly important during the periods of pink noise and frequency sweeps. Pink noise isn’t very pleasant to listen to and both high and low frequencies can damage your ears. A good idea may be to run your headphones while you are sleeping or away at work."
                },
                {
                    "headline": "Check-in periodically to note any improvement in the sound quality.",
                    "description": "Take a quick listen to your headphones and if a song is playing, tune-in for a few minutes. Note the difference in the quality of the sound as compared to your first listen. Also note the number of hours you have been doing the burn-in to gauge how much longer the process may be needed."
                },
                {
                    "headline": "Expect the burn-in process to take longer for higher-quality headphones.",
                    "description": "Some headphones may benefit from as little as 1 hour of burn-in, with some audiophiles claiming high-quality headphones need up to 300-500 hours of burn-in to reach their full potential. In general, the higher the quality of your headphones, the longer the burn-in may take. Among those who regularly practice burning-in their headphones, most agree that 40-50 hours is enough time for most headphones."
                }
            ]
        }
    ],
    "tyn": [
        "Headphones",
        "Computer or MP3 player",
        "Music program"
    ],
    "text": " Preparing a Burn-in Playlist Select music with a wide range of frequencies. You will need at least 40 hours of music or sound. The more hours you can get without having to loop the playlist, the better. You want lots of different music so it loosens the drivers in your headphones and they become accustomed to producing various sounds at an optimal level. Even if you don’t like a particular genre of music, you should include it in your playlist to give your headphones the best workout. Add a mixture of pop, rock, heavy metal, rap, hip-hop and R&B, country, and classical music to ensure a wide range. Incorporate periods of white noise and pink noise on your playlist. You can use your audio software to loop pink and/or white noise so that it plays for an extended period of time. An easier method would be to find a video that plays pink or white noise on YouTube and play it through your headphones. For good measure, search “frequency sweeps” on YouTube to include 20-20000 Hz, 10-30000 Hz, and 20-200 Hz frequency sweeps on your playlist. Use a program on your computer to make a playlist of the burn-in tracks. Alternate the music genres to encourage your headphones to adjust to the various changes in bass, treble, and frequency. Programs like Windows Media Player, iTunes, and Winamp are easy to use for making custom playlists. Add the songs you want, then organize the files by alternating the genres. For instance, play a country song followed by a heavy metal track. Get a pre-recorded audio file if you don’t have time to make a playlist. Search online for “audio burn-in file.” You will find free options to use online players featuring a pre-recorded audio file, as well as options to download the file to play without using an internet connection. If you go this route, simply follow the instructions provided with the program. Download a burn-in app if you want to use your phone. Both iTunes and Google Play offer apps specifically designed for burning-in your headphones. The apps are essentially the same as an audio file—with pre-built playlists that alternate music, noise, and rest periods—just made for your phone. Many of these apps are free, but some cost up to $2.99. Read the product descriptions and reviews to find which app might work the best for you. Setting up the Audio Connect your headphones to a computer using a wired connection. Use the auxiliary cable or USB cord—whichever your headphones are equipped with—to make the connection. Bluetooth tends to not produce very clear sounds, so for the burn-in, make sure to use a wired connection. You may also use an MP3 player for the process. Listen to make sure the music is playing through your headphones. First, simply ensure that your headphones are producing sound. After that, take a closer listen and note the quality of the sound. You can take notes if you’d like so that you can track the progress and make comparisons. Double-check your settings and connection if you don’t hear any sound. Make sure the volume is turned up on both the headphones and the computer; check that each end of the cable is fully inserted into the port on your headphones and computer; and ensure that there is no damage to the cord. Make sure the volume is set to a medium level before playing the tracks. If you have the volume set too low, the headphones won’t produce sufficient sound to loosen the drivers. If the volume is set too high, it can damage your headphones. If you hear distortion, pops, or cracks in the music, it means you have the volume turned up too loud. Playing the Music Files Play the music for 4-5 hours a day to slowly warm up the diaphragm. Some people opt to run their playlist for 40 hours straight as soon as they take them out of the box. This may work, however, it also has the potential to cause too much strain on the diaphragm. To play it safe, run your playlist for 4-5 hours a day for 5-9 days to ease your headphones in. Avoid wearing the headphones during the burn-in process. This is particularly important during the periods of pink noise and frequency sweeps. Pink noise isn’t very pleasant to listen to and both high and low frequencies can damage your ears. A good idea may be to run your headphones while you are sleeping or away at work. Check-in periodically to note any improvement in the sound quality. Take a quick listen to your headphones and if a song is playing, tune-in for a few minutes. Note the difference in the quality of the sound as compared to your first listen. Also note the number of hours you have been doing the burn-in to gauge how much longer the process may be needed. Expect the burn-in process to take longer for higher-quality headphones. Some headphones may benefit from as little as 1 hour of burn-in, with some audiophiles claiming high-quality headphones need up to 300-500 hours of burn-in to reach their full potential. In general, the higher the quality of your headphones, the longer the burn-in may take. Among those who regularly practice burning-in their headphones, most agree that 40-50 hours is enough time for most headphones.",
    "sentences": [
        " Preparing a Burn-in Playlist Select music with a wide range of frequencies.",
        "You will need at least 40 hours of music or sound.",
        "The more hours you can get without having to loop the playlist, the better.",
        "You want lots of different music so it loosens the drivers in your headphones and they become accustomed to producing various sounds at an optimal level.",
        "Even if you don’t like a particular genre of music, you should include it in your playlist to give your headphones the best workout.",
        "Add a mixture of pop, rock, heavy metal, rap, hip-hop and R&B, country, and classical music to ensure a wide range.",
        "Incorporate periods of white noise and pink noise on your playlist.",
        "You can use your audio software to loop pink and/or white noise so that it plays for an extended period of time.",
        "An easier method would be to find a video that plays pink or white noise on YouTube and play it through your headphones.",
        "For good measure, search “frequency sweeps” on YouTube to include 20-20000 Hz, 10-30000 Hz, and 20-200 Hz frequency sweeps on your playlist.",
        "Use a program on your computer to make a playlist of the burn-in tracks.",
        "Alternate the music genres to encourage your headphones to adjust to the various changes in bass, treble, and frequency.",
        "Programs like Windows Media Player, iTunes, and Winamp are easy to use for making custom playlists.",
        "Add the songs you want, then organize the files by alternating the genres.",
        "For instance, play a country song followed by a heavy metal track.",
        "Get a pre-recorded audio file if you don’t have time to make a playlist.",
        "Search online for “audio burn-in file.” You will find free options to use online players featuring a pre-recorded audio file, as well as options to download the file to play without using an internet connection.",
        "If you go this route, simply follow the instructions provided with the program.",
        "Download a burn-in app if you want to use your phone.",
        "Both iTunes and Google Play offer apps specifically designed for burning-in your headphones.",
        "The apps are essentially the same as an audio file—with pre-built playlists that alternate music, noise, and rest periods—just made for your phone.",
        "Many of these apps are free, but some cost up to $2.99.",
        "Read the product descriptions and reviews to find which app might work the best for you.",
        "Setting up the Audio Connect your headphones to a computer using a wired connection.",
        "Use the auxiliary cable or USB cord—whichever your headphones are equipped with—to make the connection.",
        "Bluetooth tends to not produce very clear sounds, so for the burn-in, make sure to use a wired connection.",
        "You may also use an MP3 player for the process.",
        "Listen to make sure the music is playing through your headphones.",
        "First, simply ensure that your headphones are producing sound.",
        "After that, take a closer listen and note the quality of the sound.",
        "You can take notes if you’d like so that you can track the progress and make comparisons.",
        "Double-check your settings and connection if you don’t hear any sound.",
        "Make sure the volume is turned up on both the headphones and the computer; check that each end of the cable is fully inserted into the port on your headphones and computer; and ensure that there is no damage to the cord.",
        "Make sure the volume is set to a medium level before playing the tracks.",
        "If you have the volume set too low, the headphones won’t produce sufficient sound to loosen the drivers.",
        "If the volume is set too high, it can damage your headphones.",
        "If you hear distortion, pops, or cracks in the music, it means you have the volume turned up too loud.",
        "Playing the Music Files Play the music for 4-5 hours a day to slowly warm up the diaphragm.",
        "Some people opt to run their playlist for 40 hours straight as soon as they take them out of the box.",
        "This may work, however, it also has the potential to cause too much strain on the diaphragm.",
        "To play it safe, run your playlist for 4-5 hours a day for 5-9 days to ease your headphones in.",
        "Avoid wearing the headphones during the burn-in process.",
        "This is particularly important during the periods of pink noise and frequency sweeps.",
        "Pink noise isn’t very pleasant to listen to and both high and low frequencies can damage your ears.",
        "A good idea may be to run your headphones while you are sleeping or away at work.",
        "Check-in periodically to note any improvement in the sound quality.",
        "Take a quick listen to your headphones and if a song is playing, tune-in for a few minutes.",
        "Note the difference in the quality of the sound as compared to your first listen.",
        "Also note the number of hours you have been doing the burn-in to gauge how much longer the process may be needed.",
        "Expect the burn-in process to take longer for higher-quality headphones.",
        "Some headphones may benefit from as little as 1 hour of burn-in, with some audiophiles claiming high-quality headphones need up to 300-500 hours of burn-in to reach their full potential.",
        "In general, the higher the quality of your headphones, the longer the burn-in may take.",
        "Among those who regularly practice burning-in their headphones, most agree that 40-50 hours is enough time for most headphones."
    ]
}