{
    "title": "How to Make Nonalcoholic Beer",
    "url": "https://www.wikihow.com/Make-Nonalcoholic-Beer",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks",
        "Beer and Cider"
    ],
    "parts": [
        {
            "name": "Brewing the Base Beer",
            "steps": [
                {
                    "headline": "Find a non-bitter-tasting beer recipe, such as wheat beer or red ale.",
                    "description": "When you make non-alcoholic beer, you have to heat it to burn off the alcohol. This will make the beer taste very bitter, and not in a good way. You can reduce the bitterness by choosing a recipe that doesn't taste very bitter to begin with, such as a wheat-based recipe or a red ale recipe. Don't use a recipe for pale ale, which is very bitter to begin with. Non-alcoholic pale ale will end up tasting even more bitter by the end."
                },
                {
                    "headline": "Ensure that the wort used in the recipe has dextrins, not simple sugars.",
                    "description": "Dextrins are unfermentable sugars, which is a good thing as far as non-alcoholic beer goes. They will result in a full-bodied beer with a lower alcohol content. Don't worry, they won't add much sweetness to the final brew. Avoid recipes that call for wort with simple sugars, such as glucose and maltose. If you are using an extract brewer, choose a recipe that doesn't contain corn sugar."
                },
                {
                    "headline": "Cut the amount of hops in the recipe by half.",
                    "description": "Hops are part of what make beer taste bitter. When you heat beer to make it non-alcoholic, you’ll make it taste more bitter. Using fewer hops is one way to cut down on this bitterness. For example, if the recipe calls for 2 ounces (48 g) of hops, use 1 ounce (24 g) instead. If you want to increase the hoppy flavor without overpowering the beer, use hops that have low alpha acids."
                },
                {
                    "headline": "Sanitize all of your tools and equipment.",
                    "description": "This includes bottles, spoons, measuring equipment, and anything else that will come in contact with the beer and ingredients. Clean the equipment using a mild, fragrance-free detergent, then disinfect it with a sanitation solution approved for brewing use. Allow your tools and equipment to air dry. If you use towels, you may reintroduce bacteria. Alternatively, clean the equipment using boiled water."
                },
                {
                    "headline": "Brew the beer according to the recipe.",
                    "description": "How you do this depends on what kind of beer you're brewing and what kind of equipment you're using. Each recipe and brewing kit will be a little different, so be sure to read the everything carefully. Non-alcoholic beer starts out as regular beer, so just follow the recipe. The only changes you should make to the process are changes you made earlier to the recipe, such as the amount and type of hops."
                },
                {
                    "headline": "Let the beer ferment, then wait 1 to 2 days for it to settle.",
                    "description": "Read your recipe to find out how long you should let the beer ferment. Then, let it sit for an extra 1 or 2 days. This allows the solids in the beer to settle to the bottom, making the siphoning process easier. It may take up to 2 weeks for the beer to ferment."
                },
                {
                    "headline": "Siphon off the amount of beer that you want to remove the alcohol from.",
                    "description": "This could be just a quarter of your batch, half of it, or even all of it. It would be a good idea to siphon off more than you think you need. You may lose 4 to 6 ounces (120 to 180 mL) of beer for every 1 gallon (3.8 L) due to the heating process. Consider adding about 4 to 6 ounces (120 to 180 mL) of water to the beer after you siphon it out. This will make up for any liquid that's lost without sacrificing flavor and body. Pour the beer that you want to remove the alcohol from into a sterilized pot. Leave the rest of the beer in the fermenter."
                }
            ]
        },
        {
            "name": "Removing the Alcohol",
            "steps": [
                {
                    "headline": "Pour the beer into a pot and place it into an 180 °F (82 °C) oven.",
                    "description": "Preheat your oven to 180 °F (82 °C) and pour the beer into a stainless steel or enameled pot. A brewing kettle would also work. Once the oven reaches the correct temperature, place the pot inside it. If your oven can't go that low, place the pot on the stove, then turn the heat up to \"low.\" Use an oven thermometer to gauge the temperature. If you're using the stove, use a cooking thermometer instead."
                },
                {
                    "headline": "Allow the beer to heat for 20 to 30 minutes, stirring occasionally.",
                    "description": "The longer you cook the beer, the more alcohol will evaporate. If you want just low-alcohol beer rather than non-alcoholic beer, reduce the heating time. Anything between 15 and 20 minutes should be good. If you're using a stove, be prepared to adjust the heat to keep the temperature constant. If it's getting too low, turn it up. If it's getting too high, turn it down."
                },
                {
                    "headline": "Stir the beer, let it cool a little, then taste it for remaining alcohol.",
                    "description": "Dip a teaspoon into the beer, then sip the beer from the spoon. If you can still taste the alcohol, let the beer cook longer. The beer won't taste great, but it should give you an idea of how much alcohol remains. Don't worry, it'll taste fine once you cool it down more and carbonate it. Do not dip the spoon into the beer after tasting from it, or you'll contaminate it. Alternatively, use a hydrometer or an alcohol content testing kit."
                },
                {
                    "headline": "Cover the pot and set it into an ice bath.",
                    "description": "the beer to cool in an ice bath. Fill a sink with some ice and cold water. Set the pot into the sink and make sure that the ice bath reaches past the beer inside it. Add more ice, if needed, then cover the pot. Make sure that the sink is clean. The beer won't come in direct contact with it, but extra sanitation never hurt anything."
                },
                {
                    "headline": "Leave the beer in the ice bath for 2 hours, or until it's below 80 °F (27 °C).",
                    "description": "The water will warm up as the beer releases heat. When that happens, drain some of the warm water and replace it with more cold water. Add some ice cubes as well. You must keep the pot covered during this time to prevent the beer from getting contaminated by bacteria."
                }
            ]
        },
        {
            "name": "Carbonating and Bottling the Beer",
            "steps": [
                {
                    "headline": "Add 1/2 to 3/4 cups (95 to 142 g) of priming sugar to the beer.",
                    "description": "Boil the sugar in 2 cups (470 mL) of water first, then allow it to cool. Pour it directly into the brew. This will help carbonate the beer, but it won't do all of the work for you. This will add less than 0.25% of alcohol to the beer. The finished brew will have less than 1% alcohol, and probably closer to 0.5%."
                },
                {
                    "headline": "Carbonate the beer in a keg if you have pressurization equipment.",
                    "description": "This is the easiest, quickest way to carbonate beer. Let the beer cool to room temperature, below 80 °F (27 °C), then carbonate it following the instructions that came with your carbon dioxide pressurization equipment. If you don't have a keg or carbon dioxide pressurization equipment, read on to find out how to carbonate beer manually."
                },
                {
                    "headline": "Add the activated yeast to the beer if you are not kegging it.",
                    "description": "Dissolve a packet of brewing yeast in ⁄2 cup (120 mL) of warm water. Cover it with a plate and wait 20 minutes. Add the yeast into the beer. Skip this step if you kegged the beer in order to carbonate it."
                },
                {
                    "headline": "Pour the beer into sterilized beer bottles.",
                    "description": "Sterilize the bottles first using hot water, then allow them to air dry. Pour the beer into the bottles, then cap them. If you need to, use a funnel to help pour the beer into the bottles, but make sure that you sterilize it first. If you carbonated the beer in a keg, the beer is ready to go. Store it in the fridge until you are ready to drink it or sell it. If you used yeast, keep the beer at room temperature."
                },
                {
                    "headline": "Wait 2 weeks for the beer to carbonate, if you used yeast.",
                    "description": "Keep the beer at room temperature during this time. As it sits, the yeast will cause the beer to carbonate and produce bubbles. Once the 2 weeks are up, the beer is ready to go. Stick it in the fridge until you want to drink or sell it."
                }
            ]
        }
    ],
    "tyn": [
        "Brewing equipment",
        "Brewing equipment sanitizer",
        "Stainless steel pot",
        "Thermometer",
        "Siphon",
        "Bottles"
    ],
    "text": " Brewing the Base Beer Find a non-bitter-tasting beer recipe, such as wheat beer or red ale. When you make non-alcoholic beer, you have to heat it to burn off the alcohol. This will make the beer taste very bitter, and not in a good way. You can reduce the bitterness by choosing a recipe that doesn't taste very bitter to begin with, such as a wheat-based recipe or a red ale recipe. Don't use a recipe for pale ale, which is very bitter to begin with. Non-alcoholic pale ale will end up tasting even more bitter by the end. Ensure that the wort used in the recipe has dextrins, not simple sugars. Dextrins are unfermentable sugars, which is a good thing as far as non-alcoholic beer goes. They will result in a full-bodied beer with a lower alcohol content. Don't worry, they won't add much sweetness to the final brew. Avoid recipes that call for wort with simple sugars, such as glucose and maltose. If you are using an extract brewer, choose a recipe that doesn't contain corn sugar. Cut the amount of hops in the recipe by half. Hops are part of what make beer taste bitter. When you heat beer to make it non-alcoholic, you’ll make it taste more bitter. Using fewer hops is one way to cut down on this bitterness. For example, if the recipe calls for 2 ounces (48 g) of hops, use 1 ounce (24 g) instead. If you want to increase the hoppy flavor without overpowering the beer, use hops that have low alpha acids. Sanitize all of your tools and equipment. This includes bottles, spoons, measuring equipment, and anything else that will come in contact with the beer and ingredients. Clean the equipment using a mild, fragrance-free detergent, then disinfect it with a sanitation solution approved for brewing use. Allow your tools and equipment to air dry. If you use towels, you may reintroduce bacteria. Alternatively, clean the equipment using boiled water. Brew the beer according to the recipe. How you do this depends on what kind of beer you're brewing and what kind of equipment you're using. Each recipe and brewing kit will be a little different, so be sure to read the everything carefully. Non-alcoholic beer starts out as regular beer, so just follow the recipe. The only changes you should make to the process are changes you made earlier to the recipe, such as the amount and type of hops. Let the beer ferment, then wait 1 to 2 days for it to settle. Read your recipe to find out how long you should let the beer ferment. Then, let it sit for an extra 1 or 2 days. This allows the solids in the beer to settle to the bottom, making the siphoning process easier. It may take up to 2 weeks for the beer to ferment. Siphon off the amount of beer that you want to remove the alcohol from. This could be just a quarter of your batch, half of it, or even all of it. It would be a good idea to siphon off more than you think you need. You may lose 4 to 6 ounces (120 to 180 mL) of beer for every 1 gallon (3.8 L) due to the heating process. Consider adding about 4 to 6 ounces (120 to 180 mL) of water to the beer after you siphon it out. This will make up for any liquid that's lost without sacrificing flavor and body. Pour the beer that you want to remove the alcohol from into a sterilized pot. Leave the rest of the beer in the fermenter. Removing the Alcohol Pour the beer into a pot and place it into an 180 °F (82 °C) oven. Preheat your oven to 180 °F (82 °C) and pour the beer into a stainless steel or enameled pot. A brewing kettle would also work. Once the oven reaches the correct temperature, place the pot inside it. If your oven can't go that low, place the pot on the stove, then turn the heat up to \"low.\" Use an oven thermometer to gauge the temperature. If you're using the stove, use a cooking thermometer instead. Allow the beer to heat for 20 to 30 minutes, stirring occasionally. The longer you cook the beer, the more alcohol will evaporate. If you want just low-alcohol beer rather than non-alcoholic beer, reduce the heating time. Anything between 15 and 20 minutes should be good. If you're using a stove, be prepared to adjust the heat to keep the temperature constant. If it's getting too low, turn it up. If it's getting too high, turn it down. Stir the beer, let it cool a little, then taste it for remaining alcohol. Dip a teaspoon into the beer, then sip the beer from the spoon. If you can still taste the alcohol, let the beer cook longer. The beer won't taste great, but it should give you an idea of how much alcohol remains. Don't worry, it'll taste fine once you cool it down more and carbonate it. Do not dip the spoon into the beer after tasting from it, or you'll contaminate it. Alternatively, use a hydrometer or an alcohol content testing kit. Cover the pot and set it into an ice bath. the beer to cool in an ice bath. Fill a sink with some ice and cold water. Set the pot into the sink and make sure that the ice bath reaches past the beer inside it. Add more ice, if needed, then cover the pot. Make sure that the sink is clean. The beer won't come in direct contact with it, but extra sanitation never hurt anything. Leave the beer in the ice bath for 2 hours, or until it's below 80 °F (27 °C). The water will warm up as the beer releases heat. When that happens, drain some of the warm water and replace it with more cold water. Add some ice cubes as well. You must keep the pot covered during this time to prevent the beer from getting contaminated by bacteria. Carbonating and Bottling the Beer Add 1/2 to 3/4 cups (95 to 142 g) of priming sugar to the beer. Boil the sugar in 2 cups (470 mL) of water first, then allow it to cool. Pour it directly into the brew. This will help carbonate the beer, but it won't do all of the work for you. This will add less than 0.25% of alcohol to the beer. The finished brew will have less than 1% alcohol, and probably closer to 0.5%. Carbonate the beer in a keg if you have pressurization equipment. This is the easiest, quickest way to carbonate beer. Let the beer cool to room temperature, below 80 °F (27 °C), then carbonate it following the instructions that came with your carbon dioxide pressurization equipment. If you don't have a keg or carbon dioxide pressurization equipment, read on to find out how to carbonate beer manually. Add the activated yeast to the beer if you are not kegging it. Dissolve a packet of brewing yeast in ⁄2 cup (120 mL) of warm water. Cover it with a plate and wait 20 minutes. Add the yeast into the beer. Skip this step if you kegged the beer in order to carbonate it. Pour the beer into sterilized beer bottles. Sterilize the bottles first using hot water, then allow them to air dry. Pour the beer into the bottles, then cap them. If you need to, use a funnel to help pour the beer into the bottles, but make sure that you sterilize it first. If you carbonated the beer in a keg, the beer is ready to go. Store it in the fridge until you are ready to drink it or sell it. If you used yeast, keep the beer at room temperature. Wait 2 weeks for the beer to carbonate, if you used yeast. Keep the beer at room temperature during this time. As it sits, the yeast will cause the beer to carbonate and produce bubbles. Once the 2 weeks are up, the beer is ready to go. Stick it in the fridge until you want to drink or sell it.",
    "sentences": [
        " Brewing the Base Beer Find a non-bitter-tasting beer recipe, such as wheat beer or red ale.",
        "When you make non-alcoholic beer, you have to heat it to burn off the alcohol.",
        "This will make the beer taste very bitter, and not in a good way.",
        "You can reduce the bitterness by choosing a recipe that doesn't taste very bitter to begin with, such as a wheat-based recipe or a red ale recipe.",
        "Don't use a recipe for pale ale, which is very bitter to begin with.",
        "Non-alcoholic pale ale will end up tasting even more bitter by the end.",
        "Ensure that the wort used in the recipe has dextrins, not simple sugars.",
        "Dextrins are unfermentable sugars, which is a good thing as far as non-alcoholic beer goes.",
        "They will result in a full-bodied beer with a lower alcohol content.",
        "Don't worry, they won't add much sweetness to the final brew.",
        "Avoid recipes that call for wort with simple sugars, such as glucose and maltose.",
        "If you are using an extract brewer, choose a recipe that doesn't contain corn sugar.",
        "Cut the amount of hops in the recipe by half.",
        "Hops are part of what make beer taste bitter.",
        "When you heat beer to make it non-alcoholic, you’ll make it taste more bitter.",
        "Using fewer hops is one way to cut down on this bitterness.",
        "For example, if the recipe calls for 2 ounces (48 g) of hops, use 1 ounce (24 g) instead.",
        "If you want to increase the hoppy flavor without overpowering the beer, use hops that have low alpha acids.",
        "Sanitize all of your tools and equipment.",
        "This includes bottles, spoons, measuring equipment, and anything else that will come in contact with the beer and ingredients.",
        "Clean the equipment using a mild, fragrance-free detergent, then disinfect it with a sanitation solution approved for brewing use.",
        "Allow your tools and equipment to air dry.",
        "If you use towels, you may reintroduce bacteria.",
        "Alternatively, clean the equipment using boiled water.",
        "Brew the beer according to the recipe.",
        "How you do this depends on what kind of beer you're brewing and what kind of equipment you're using.",
        "Each recipe and brewing kit will be a little different, so be sure to read the everything carefully.",
        "Non-alcoholic beer starts out as regular beer, so just follow the recipe.",
        "The only changes you should make to the process are changes you made earlier to the recipe, such as the amount and type of hops.",
        "Let the beer ferment, then wait 1 to 2 days for it to settle.",
        "Read your recipe to find out how long you should let the beer ferment.",
        "Then, let it sit for an extra 1 or 2 days.",
        "This allows the solids in the beer to settle to the bottom, making the siphoning process easier.",
        "It may take up to 2 weeks for the beer to ferment.",
        "Siphon off the amount of beer that you want to remove the alcohol from.",
        "This could be just a quarter of your batch, half of it, or even all of it.",
        "It would be a good idea to siphon off more than you think you need.",
        "You may lose 4 to 6 ounces (120 to 180 mL) of beer for every 1 gallon (3.8 L) due to the heating process.",
        "Consider adding about 4 to 6 ounces (120 to 180 mL) of water to the beer after you siphon it out.",
        "This will make up for any liquid that's lost without sacrificing flavor and body.",
        "Pour the beer that you want to remove the alcohol from into a sterilized pot.",
        "Leave the rest of the beer in the fermenter.",
        "Removing the Alcohol Pour the beer into a pot and place it into an 180 °F (82 °C) oven.",
        "Preheat your oven to 180 °F (82 °C) and pour the beer into a stainless steel or enameled pot.",
        "A brewing kettle would also work.",
        "Once the oven reaches the correct temperature, place the pot inside it.",
        "If your oven can't go that low, place the pot on the stove, then turn the heat up to \"low.\"",
        "Use an oven thermometer to gauge the temperature.",
        "If you're using the stove, use a cooking thermometer instead.",
        "Allow the beer to heat for 20 to 30 minutes, stirring occasionally.",
        "The longer you cook the beer, the more alcohol will evaporate.",
        "If you want just low-alcohol beer rather than non-alcoholic beer, reduce the heating time.",
        "Anything between 15 and 20 minutes should be good.",
        "If you're using a stove, be prepared to adjust the heat to keep the temperature constant.",
        "If it's getting too low, turn it up.",
        "If it's getting too high, turn it down.",
        "Stir the beer, let it cool a little, then taste it for remaining alcohol.",
        "Dip a teaspoon into the beer, then sip the beer from the spoon.",
        "If you can still taste the alcohol, let the beer cook longer.",
        "The beer won't taste great, but it should give you an idea of how much alcohol remains.",
        "Don't worry, it'll taste fine once you cool it down more and carbonate it.",
        "Do not dip the spoon into the beer after tasting from it, or you'll contaminate it.",
        "Alternatively, use a hydrometer or an alcohol content testing kit.",
        "Cover the pot and set it into an ice bath.",
        "the beer to cool in an ice bath.",
        "Fill a sink with some ice and cold water.",
        "Set the pot into the sink and make sure that the ice bath reaches past the beer inside it.",
        "Add more ice, if needed, then cover the pot.",
        "Make sure that the sink is clean.",
        "The beer won't come in direct contact with it, but extra sanitation never hurt anything.",
        "Leave the beer in the ice bath for 2 hours, or until it's below 80 °F (27 °C).",
        "The water will warm up as the beer releases heat.",
        "When that happens, drain some of the warm water and replace it with more cold water.",
        "Add some ice cubes as well.",
        "You must keep the pot covered during this time to prevent the beer from getting contaminated by bacteria.",
        "Carbonating and Bottling the Beer Add 1/2 to 3/4 cups (95 to 142 g) of priming sugar to the beer.",
        "Boil the sugar in 2 cups (470 mL) of water first, then allow it to cool.",
        "Pour it directly into the brew.",
        "This will help carbonate the beer, but it won't do all of the work for you.",
        "This will add less than 0.25% of alcohol to the beer.",
        "The finished brew will have less than 1% alcohol, and probably closer to 0.5%.",
        "Carbonate the beer in a keg if you have pressurization equipment.",
        "This is the easiest, quickest way to carbonate beer.",
        "Let the beer cool to room temperature, below 80 °F (27 °C), then carbonate it following the instructions that came with your carbon dioxide pressurization equipment.",
        "If you don't have a keg or carbon dioxide pressurization equipment, read on to find out how to carbonate beer manually.",
        "Add the activated yeast to the beer if you are not kegging it.",
        "Dissolve a packet of brewing yeast in ⁄2 cup (120 mL) of warm water.",
        "Cover it with a plate and wait 20 minutes.",
        "Add the yeast into the beer.",
        "Skip this step if you kegged the beer in order to carbonate it.",
        "Pour the beer into sterilized beer bottles.",
        "Sterilize the bottles first using hot water, then allow them to air dry.",
        "Pour the beer into the bottles, then cap them.",
        "If you need to, use a funnel to help pour the beer into the bottles, but make sure that you sterilize it first.",
        "If you carbonated the beer in a keg, the beer is ready to go.",
        "Store it in the fridge until you are ready to drink it or sell it.",
        "If you used yeast, keep the beer at room temperature.",
        "Wait 2 weeks for the beer to carbonate, if you used yeast.",
        "Keep the beer at room temperature during this time.",
        "As it sits, the yeast will cause the beer to carbonate and produce bubbles.",
        "Once the 2 weeks are up, the beer is ready to go.",
        "Stick it in the fridge until you want to drink or sell it."
    ]
}