{
    "title": "How to Cook Sarciado",
    "url": "https://www.wikihow.com/Cook-Sarciado",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Asian Cuisine",
        "Philippine Dishes"
    ],
    "parts": [
        {
            "name": "Frying the Fish",
            "steps": [
                {
                    "headline": "Season the fish with the sea salt.",
                    "description": "Use your hands to rub the sea salt generously all over the whole fish. You may need more sea salt if the fish is larger than 1.5 lb."
                },
                {
                    "headline": "Heat 2 tbsp (30 ml) of vegetable oil in the pan.",
                    "description": "Use a medium to high heat to quickly warm the oil. This will ensure that the fish fries properly when you place it in. You can use a wok instead of a frying pan if you prefer. A frying pan or wok that is at least 12 in (30 cm) is recommended to fit the whole fish in the pan."
                },
                {
                    "headline": "Cook the fish in the pan for 6 - 8 minutes on each side.",
                    "description": "The fish will fry relatively fast, so flip it over to the other side once the first side is cooked. When the fish is cooked, the skin will look brown and blistered. A fish spatula is best for flipping fish when frying them whole. You will also be able to tell that the fish is cooked when it looks opaque all of the way through. Make sure that you watch out for any hot oil that is popping from the pan as the fish cooks."
                },
                {
                    "headline": "Remove the fish from the pan.",
                    "description": "Once the fish has cooked, remove it from the heat immediately. Place the fish on a plate with paper towels. You can set the fish aside for now while you prepare the rest of the dish. Cover the plate in foil to keep the fish warm. Leave the frying pan or wok on the element, as you will be using it again straight away."
                }
            ]
        },
        {
            "name": "Sautéing the Vegetables",
            "steps": [
                {
                    "headline": "Stir-fry the garlic in the pan for 1 minute.",
                    "description": "Use a medium heat to gently cook the minced garlic. Stir it a few times to make sure that the garlic doesn’t stick to the pan. The garlic will become light brown once it is done."
                },
                {
                    "headline": "Sauté the onions until they are soft.",
                    "description": "Add the diced onion to the pan with the stir-fried garlic, and mix them together. Sauté the onions for a few minutes, or until they are soft and fragrant. A wooden spoon is ideal for mixing stir-fried vegetables."
                },
                {
                    "headline": "Add the tomatoes to the pan.",
                    "description": "Gently combine the diced tomatoes in the pan with the garlic and onion. Stir-fry the combination for 2 minutes."
                },
                {
                    "headline": "Pour the fish sauce and water into the pan.",
                    "description": "Stir the liquids so that they combine. Make sure the vegetables and the liquids are distributed evenly across the pan."
                },
                {
                    "headline": "Bring the pan to a boil and then simmer it uncovered for 20 minutes.",
                    "description": "Raise the temperature to a high heat to boil the contents of the pan. Once it starts boiling, reduce the heat down to medium-low to bring it down to a simmer. Simmering will help to bring all of the flavors in the tomato sauce together."
                }
            ]
        },
        {
            "name": "Adding the Eggs",
            "steps": [
                {
                    "headline": "Pour the beaten eggs into the pan.",
                    "description": "Make sure that the eggs are evenly distributed over the pan. It’s okay for the eggs to be over the vegetables, as everything is supposed to be combined in this dish."
                },
                {
                    "headline": "Cook the egg and vegetable mixture for 3 minutes.",
                    "description": "You can season the dish with salt and black pepper to taste during this time. Stir the eggs as they cook and begin to look like scrambled eggs. When the eggs are cooked, you can remove the pan from the heat. The topping is now ready to add to the fish."
                },
                {
                    "headline": "Serve the vegetable and egg topping on the fish.",
                    "description": "Place the fish on a large serving platter. Pour over the egg and vegetable topping, and serve the dish immediately. To store leftover sarciado, place it in an airtight container and keep it in the refrigerator for up to 3 days."
                }
            ]
        }
    ],
    "tyn": [
        "Frying pan",
        "Fish spatula",
        "Wooden spoon",
        "Serving platter"
    ],
    "text": " Frying the Fish Season the fish with the sea salt. Use your hands to rub the sea salt generously all over the whole fish. You may need more sea salt if the fish is larger than 1.5 lb. Heat 2 tbsp (30 ml) of vegetable oil in the pan. Use a medium to high heat to quickly warm the oil. This will ensure that the fish fries properly when you place it in. You can use a wok instead of a frying pan if you prefer. A frying pan or wok that is at least 12 in (30 cm) is recommended to fit the whole fish in the pan. Cook the fish in the pan for 6 - 8 minutes on each side. The fish will fry relatively fast, so flip it over to the other side once the first side is cooked. When the fish is cooked, the skin will look brown and blistered. A fish spatula is best for flipping fish when frying them whole. You will also be able to tell that the fish is cooked when it looks opaque all of the way through. Make sure that you watch out for any hot oil that is popping from the pan as the fish cooks. Remove the fish from the pan. Once the fish has cooked, remove it from the heat immediately. Place the fish on a plate with paper towels. You can set the fish aside for now while you prepare the rest of the dish. Cover the plate in foil to keep the fish warm. Leave the frying pan or wok on the element, as you will be using it again straight away. Sautéing the Vegetables Stir-fry the garlic in the pan for 1 minute. Use a medium heat to gently cook the minced garlic. Stir it a few times to make sure that the garlic doesn’t stick to the pan. The garlic will become light brown once it is done. Sauté the onions until they are soft. Add the diced onion to the pan with the stir-fried garlic, and mix them together. Sauté the onions for a few minutes, or until they are soft and fragrant. A wooden spoon is ideal for mixing stir-fried vegetables. Add the tomatoes to the pan. Gently combine the diced tomatoes in the pan with the garlic and onion. Stir-fry the combination for 2 minutes. Pour the fish sauce and water into the pan. Stir the liquids so that they combine. Make sure the vegetables and the liquids are distributed evenly across the pan. Bring the pan to a boil and then simmer it uncovered for 20 minutes. Raise the temperature to a high heat to boil the contents of the pan. Once it starts boiling, reduce the heat down to medium-low to bring it down to a simmer. Simmering will help to bring all of the flavors in the tomato sauce together. Adding the Eggs Pour the beaten eggs into the pan. Make sure that the eggs are evenly distributed over the pan. It’s okay for the eggs to be over the vegetables, as everything is supposed to be combined in this dish. Cook the egg and vegetable mixture for 3 minutes. You can season the dish with salt and black pepper to taste during this time. Stir the eggs as they cook and begin to look like scrambled eggs. When the eggs are cooked, you can remove the pan from the heat. The topping is now ready to add to the fish. Serve the vegetable and egg topping on the fish. Place the fish on a large serving platter. Pour over the egg and vegetable topping, and serve the dish immediately. To store leftover sarciado, place it in an airtight container and keep it in the refrigerator for up to 3 days.",
    "sentences": [
        " Frying the Fish Season the fish with the sea salt.",
        "Use your hands to rub the sea salt generously all over the whole fish.",
        "You may need more sea salt if the fish is larger than 1.5 lb.",
        "Heat 2 tbsp (30 ml) of vegetable oil in the pan.",
        "Use a medium to high heat to quickly warm the oil.",
        "This will ensure that the fish fries properly when you place it in.",
        "You can use a wok instead of a frying pan if you prefer.",
        "A frying pan or wok that is at least 12 in (30 cm) is recommended to fit the whole fish in the pan.",
        "Cook the fish in the pan for 6 - 8 minutes on each side.",
        "The fish will fry relatively fast, so flip it over to the other side once the first side is cooked.",
        "When the fish is cooked, the skin will look brown and blistered.",
        "A fish spatula is best for flipping fish when frying them whole.",
        "You will also be able to tell that the fish is cooked when it looks opaque all of the way through.",
        "Make sure that you watch out for any hot oil that is popping from the pan as the fish cooks.",
        "Remove the fish from the pan.",
        "Once the fish has cooked, remove it from the heat immediately.",
        "Place the fish on a plate with paper towels.",
        "You can set the fish aside for now while you prepare the rest of the dish.",
        "Cover the plate in foil to keep the fish warm.",
        "Leave the frying pan or wok on the element, as you will be using it again straight away.",
        "Sautéing the Vegetables Stir-fry the garlic in the pan for 1 minute.",
        "Use a medium heat to gently cook the minced garlic.",
        "Stir it a few times to make sure that the garlic doesn’t stick to the pan.",
        "The garlic will become light brown once it is done.",
        "Sauté the onions until they are soft.",
        "Add the diced onion to the pan with the stir-fried garlic, and mix them together.",
        "Sauté the onions for a few minutes, or until they are soft and fragrant.",
        "A wooden spoon is ideal for mixing stir-fried vegetables.",
        "Add the tomatoes to the pan.",
        "Gently combine the diced tomatoes in the pan with the garlic and onion.",
        "Stir-fry the combination for 2 minutes.",
        "Pour the fish sauce and water into the pan.",
        "Stir the liquids so that they combine.",
        "Make sure the vegetables and the liquids are distributed evenly across the pan.",
        "Bring the pan to a boil and then simmer it uncovered for 20 minutes.",
        "Raise the temperature to a high heat to boil the contents of the pan.",
        "Once it starts boiling, reduce the heat down to medium-low to bring it down to a simmer.",
        "Simmering will help to bring all of the flavors in the tomato sauce together.",
        "Adding the Eggs Pour the beaten eggs into the pan.",
        "Make sure that the eggs are evenly distributed over the pan.",
        "It’s okay for the eggs to be over the vegetables, as everything is supposed to be combined in this dish.",
        "Cook the egg and vegetable mixture for 3 minutes.",
        "You can season the dish with salt and black pepper to taste during this time.",
        "Stir the eggs as they cook and begin to look like scrambled eggs.",
        "When the eggs are cooked, you can remove the pan from the heat.",
        "The topping is now ready to add to the fish.",
        "Serve the vegetable and egg topping on the fish.",
        "Place the fish on a large serving platter.",
        "Pour over the egg and vegetable topping, and serve the dish immediately.",
        "To store leftover sarciado, place it in an airtight container and keep it in the refrigerator for up to 3 days."
    ]
}