{
    "title": "How to Restore Faded Clothes",
    "url": "https://www.wikihow.com/Restore-Faded-Clothes",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Fashion Fixes"
    ],
    "methods": [
        {
            "name": "Restoring Brightness with Salt",
            "steps": [
                {
                    "headline": "Place your faded clothes and regular detergent in the washing machine.",
                    "description": "If you have clothes that seem to have faded after just a few washes, the culprit may be detergent buildup. Adding salt to your regular wash can help break up that buildup, making your clothes look like new again. Powdered laundry detergent is more likely to leave behind residue than liquid detergent."
                },
                {
                    "headline": "Add 1/2 cup (150 g) of salt to the wash cycle.",
                    "description": "Once you've placed your clothes and detergent in the washing machine, pour about 1/2 cup (150 g) of salt into the drum. In addition to restoring colors, it can also help prevent new clothes from fading in the first place. You can add salt to every load of laundry, if you'd like. Regular table salt or ultra-fine pickling salts work well for this, but avoid coarse-ground sea salt, as it may not dissolve fully in the washing machine. Salt is also an effective stain remover, especially on blood, mildew, and sweat stains."
                },
                {
                    "headline": "Dry your clothing as usual.",
                    "description": "After your clothes are finished washing, take them out and check the color. If you're satisfied with it, you can either air dry them or place them in your dryer. If they still look faded, try washing them in vinegar, instead. You may need to redye your clothes if the color has washed out over time."
                }
            ]
        },
        {
            "name": "Using Vinegar to Combat Detergent Buildup",
            "steps": [
                {
                    "headline": "Add ⁄2 cup (120 mL) of white vinegar to your washing machine.",
                    "description": "If you have a top-loading machine, you can pour the vinegar directly into the drum, or you can add it to the fabric softener dispenser if you have a front-loading washer. The vinegar will help break up any detergent or minerals left behind by hard water, so your clothes will look brighter. The vinegar will also prevent this buildup in the first place, so it’s a great way to keep your clothes color-fast while they’re still new.Tip: For a deeper clean, you can also dilute 1 cup (240 mL) of white vinegar in 1 gal (3.8 L) of warm water. Soak the item in the vinegar mixture for about 20-30 minutes before washing it as usual."
                },
                {
                    "headline": "Wash the clothes in cool water on a normal cycle.",
                    "description": "Place your faded clothes into your washing machine, add laundry detergent, and turn on the machine. In many cases, soaking your clothes in vinegar then washing them is all it will take to get them looking brighter. Choose the cycle that’s appropriate for the clothes you’re brightening. For instance, if you’re washing items made from a delicate material like silk or lace, you’d want to use a gentle wash. For more durable fabrics like cotton or denim, a normal wash is fine."
                },
                {
                    "headline": "Air-dry your clothes or place them in the dryer.",
                    "description": "The vinegar will wash out of your clothing during the rinse cycle, so your laundry shouldn’t smell like vinegar when it comes out of the wash. You can either hang the clothes to dry or place them in the dryer, depending on the instructions on the care label or how you normally prefer to dry your clothes. If a little of the smell does linger, either hang the item to dry outside or put a fabric softener sheet in the dryer. The smell should be gone by the time it's dry. If your clothes still look faded, the dye might have washed out, so you may need to dye the clothes instead."
                }
            ]
        },
        {
            "name": "Dyeing Clothes to Refresh the Color",
            "steps": [
                {
                    "headline": "Check the care label to determine if the garment is a dyeable fabric.",
                    "description": "Some fabrics accept dye better than others, so before you try to restore your clothing by dyeing it, take a look at the tag inside the item to see what it's made of. If the item is made from at least 60% natural fibers, like cotton, silk, linen, ramie, or wool, or if it’s made from rayon or nylon, it will probably dye well. Clothing made from a blend of natural and synthetic fibers may not look as dark when they’re dyed as clothing made from an all-natural fabric. If the garment is made from acrylic, spandex, polyester, or metallic fibers, or if the tag says “Dry Clean Only,” it probably will not take dye well, if at all.Tip: Make sure the clothes you’re trying to dye are completely clean. If there are any spots or stains, the dye may not absorb evenly into the fabric."
                },
                {
                    "headline": "Choose a dye as close to the original color as possible.",
                    "description": "If you want your garment to look as good as new, take it with you to a big box store or a craft or fabric store to choose the dye. Try to find the closest match you can, as this will give you the boldest, most natural-looking result. If you want to change the color of your garment, you’ll likely need to use a color stripper first."
                },
                {
                    "headline": "Protect your skin and work area from the dye.",
                    "description": "Cover your workspace with newspaper, tarp, or trash bags, so if any of the dye splashes, it won’t stain your table, counter, or floors. In addition, have some old rags or paper towels nearby just in you need to quickly clean up any spills. Then, put on old clothes and thick gloves so your clothes and skin don’t get stained. It’s important to protect your hands, because coming into contact with dye can irritate your skin."
                },
                {
                    "headline": "Fill a container with hot water that’s about 120–140 °F (49–60 °C).",
                    "description": "Most household water heaters are set to a maximum temperature of 120 °F (49 °C), although some are set to 140 °F (60 °C), so the hottest water from your tap should be sufficient. However, if you want hotter water, you can heat it on the stove to just below boiling, or about 200 °F (93 °C). Pour the water into a large pot, bucket, or tub, or fill a top-loading machine with water on the hottest setting. You’ll need about 3 US gal (11 L) of water for every 1 lb (0.45 kg) of clothing. A bucket or pot is good for smaller items like thin tops, accessories, and children’s clothes. Use a plastic tub or washing machine for larger items like sweaters and jeans. Most articles of clothing weigh about 0.5-1 lb (0.22-0.4 kg)."
                },
                {
                    "headline": "Dissolve the dye and salt in a small cup of water, then add them to the bath.",
                    "description": "Follow the instructions on the dye to determine exactly how much you’ll need. Generally, though, you’ll need about a 1/2 bottle of dye for every 1 lb (0.45 kg) of fabric. To help the dye set better, add 1/2 cup (150 g) of salt for every 1 lb (0.45 kg) of fabric you're dyeing. Stir the dye and salt into a small cup of warm water until they’re completely dissolved. Then, add the dye and salt mixture to your larger container of water and use a metal long-handled spoon or tongs to stir everything together. For easy cleanup, consider using a dowel or a plastic spoon to stir the dye in the smaller container. That way, you can just throw it away when you’re finished."
                },
                {
                    "headline": "Add the clothes and soak them for 30-60 minutes, stirring continuously.",
                    "description": "Place the clothing into the dye bath and use your spoon or tongs to push them down under the water, ensuring they’re completely saturated. To help the dye soak evenly into the fabric, stir the clothing around at least every 5-10 minutes. That helps prevent any folds or bunches in the fabric from blocking the dye. The more you stir, the more even the dye will be. Some people prefer to stir constantly, while others find it’s sufficient to just swish the clothing around every few minutes."
                },
                {
                    "headline": "Take the clothing out of the dye and rinse it thoroughly in cold water.",
                    "description": "Once the recommended time has passed, or when you think the garment looks dark enough, use your tongs or spoon to carefully lift the clothing out of the dye bath. Transfer it to a bathtub or a sink, and rinse the item under cold running water until the water runs mostly clear. Remember, the color will look darker when the garment is wet, so take that into account when you’re checking to see if it’s ready! Clean your sink or tub immediately so the dye doesn’t stain it!"
                },
                {
                    "headline": "Wash the garment by itself in the washing machine on a cold cycle.",
                    "description": "If you’re satisfied with the color of your clothing, turn the garment inside out and put it in the washing machine. Even though you’ve already rinsed out much of the dye by hand, more will come out in the wash, so don’t put anything else in the washing machine, or it will get stained by dye as well. Then, run the washing machine on a small, cold cycle. Turning the garment inside-out when you wash it may help preserve its color."
                },
                {
                    "headline": "Dry the garment to see the final color.",
                    "description": "You can hang dry your item or you can place it in the dryer, depending on the fabric and your personal preference. Either way, when it’s finished, examine the clothing to ensure the dye went on evenly and didn’t leave any streaks or lighter areas, and that you’re happy with the final result. If you need to, you can dye the clothing again."
                }
            ]
        },
        {
            "name": "Trying Other Household Items",
            "steps": [
                {
                    "headline": "Try adding baking soda to your washing machine to brighten white clothing.",
                    "description": "Baking soda is another household staple that can help make your clothes look bright, and it’s especially effective on white fabric. Just add about 1/2 cup (90 g) to the drum of your washer along with your clothes and regular detergent. Baking soda is also a great way to deodorize your clothing!"
                },
                {
                    "headline": "Refresh black clothes by soaking them in coffee or tea.",
                    "description": "If you want an easy, inexpensive way to keep your dark clothes looking rich and new, brew a 2 cups (470 mL) of very strong black tea or coffee. Place the clothes in the washing machine and wash them as normal, but stay close. When the rinse cycle starts, open the lid of the washing machine and pour in the coffee or tea. Let the cycle finish, then hang your clothing to dry. Drying black clothes in the dryer can cause them to fade more quickly."
                },
                {
                    "headline": "Brighten your clothing by adding black pepper to the wash. Place your clothes in the washing machine just as you normally would, then add 2-3 tsp (8-12 g) of ground black pepper in with your clothes.",
                    "description": "This will help dispel some of the buildup, and the flakes of pepper will wash away in the rinse cycle."
                },
                {
                    "headline": "Wash your white clothes in hydrogen peroxide to brighten them.",
                    "description": "If your whites are looking faded and dingy after a few washes, it can be tempting to bleach them, but this can weaken and discolor the fabric over time. Instead, add 1 cup (240 mL) of hydrogen peroxide to your laundry detergent, then wash your clothes as usual."
                }
            ]
        }
    ],
    "tyn": [
        "Restoring Brightness with Salt",
        "Salt",
        "Laundry detergent",
        "Using Vinegar to Combat Detergent Buildup",
        "White vinegar",
        "Detergent",
        "Salt (optional)",
        "Dyeing Clothes to Refresh the Color",
        "Dye",
        "Large container or washing machine",
        "Hot water",
        "Tarp, dropcloth, or garbage bags",
        "Old clothes and thick gloves",
        "Small cup",
        "Dowel or plastic spoon",
        "Long-handled spoon or tongs",
        "Trying Other Household Items",
        "Baking soda (optional)",
        "Coffee or tea (optional)",
        "Black pepper (optional)",
        "Hydrogen peroxide (optional)"
    ],
    "text": " Restoring Brightness with Salt Place your faded clothes and regular detergent in the washing machine. If you have clothes that seem to have faded after just a few washes, the culprit may be detergent buildup. Adding salt to your regular wash can help break up that buildup, making your clothes look like new again. Powdered laundry detergent is more likely to leave behind residue than liquid detergent. Add 1/2 cup (150 g) of salt to the wash cycle. Once you've placed your clothes and detergent in the washing machine, pour about 1/2 cup (150 g) of salt into the drum. In addition to restoring colors, it can also help prevent new clothes from fading in the first place. You can add salt to every load of laundry, if you'd like. Regular table salt or ultra-fine pickling salts work well for this, but avoid coarse-ground sea salt, as it may not dissolve fully in the washing machine. Salt is also an effective stain remover, especially on blood, mildew, and sweat stains. Dry your clothing as usual. After your clothes are finished washing, take them out and check the color. If you're satisfied with it, you can either air dry them or place them in your dryer. If they still look faded, try washing them in vinegar, instead. You may need to redye your clothes if the color has washed out over time. Using Vinegar to Combat Detergent Buildup Add ⁄2 cup (120 mL) of white vinegar to your washing machine. If you have a top-loading machine, you can pour the vinegar directly into the drum, or you can add it to the fabric softener dispenser if you have a front-loading washer. The vinegar will help break up any detergent or minerals left behind by hard water, so your clothes will look brighter. The vinegar will also prevent this buildup in the first place, so it’s a great way to keep your clothes color-fast while they’re still new.Tip: For a deeper clean, you can also dilute 1 cup (240 mL) of white vinegar in 1 gal (3.8 L) of warm water. Soak the item in the vinegar mixture for about 20-30 minutes before washing it as usual. Wash the clothes in cool water on a normal cycle. Place your faded clothes into your washing machine, add laundry detergent, and turn on the machine. In many cases, soaking your clothes in vinegar then washing them is all it will take to get them looking brighter. Choose the cycle that’s appropriate for the clothes you’re brightening. For instance, if you’re washing items made from a delicate material like silk or lace, you’d want to use a gentle wash. For more durable fabrics like cotton or denim, a normal wash is fine. Air-dry your clothes or place them in the dryer. The vinegar will wash out of your clothing during the rinse cycle, so your laundry shouldn’t smell like vinegar when it comes out of the wash. You can either hang the clothes to dry or place them in the dryer, depending on the instructions on the care label or how you normally prefer to dry your clothes. If a little of the smell does linger, either hang the item to dry outside or put a fabric softener sheet in the dryer. The smell should be gone by the time it's dry. If your clothes still look faded, the dye might have washed out, so you may need to dye the clothes instead. Dyeing Clothes to Refresh the Color Check the care label to determine if the garment is a dyeable fabric. Some fabrics accept dye better than others, so before you try to restore your clothing by dyeing it, take a look at the tag inside the item to see what it's made of. If the item is made from at least 60% natural fibers, like cotton, silk, linen, ramie, or wool, or if it’s made from rayon or nylon, it will probably dye well. Clothing made from a blend of natural and synthetic fibers may not look as dark when they’re dyed as clothing made from an all-natural fabric. If the garment is made from acrylic, spandex, polyester, or metallic fibers, or if the tag says “Dry Clean Only,” it probably will not take dye well, if at all.Tip: Make sure the clothes you’re trying to dye are completely clean. If there are any spots or stains, the dye may not absorb evenly into the fabric. Choose a dye as close to the original color as possible. If you want your garment to look as good as new, take it with you to a big box store or a craft or fabric store to choose the dye. Try to find the closest match you can, as this will give you the boldest, most natural-looking result. If you want to change the color of your garment, you’ll likely need to use a color stripper first. Protect your skin and work area from the dye. Cover your workspace with newspaper, tarp, or trash bags, so if any of the dye splashes, it won’t stain your table, counter, or floors. In addition, have some old rags or paper towels nearby just in you need to quickly clean up any spills. Then, put on old clothes and thick gloves so your clothes and skin don’t get stained. It’s important to protect your hands, because coming into contact with dye can irritate your skin. Fill a container with hot water that’s about 120–140 °F (49–60 °C). Most household water heaters are set to a maximum temperature of 120 °F (49 °C), although some are set to 140 °F (60 °C), so the hottest water from your tap should be sufficient. However, if you want hotter water, you can heat it on the stove to just below boiling, or about 200 °F (93 °C). Pour the water into a large pot, bucket, or tub, or fill a top-loading machine with water on the hottest setting. You’ll need about 3 US gal (11 L) of water for every 1 lb (0.45 kg) of clothing. A bucket or pot is good for smaller items like thin tops, accessories, and children’s clothes. Use a plastic tub or washing machine for larger items like sweaters and jeans. Most articles of clothing weigh about 0.5-1 lb (0.22-0.4 kg). Dissolve the dye and salt in a small cup of water, then add them to the bath. Follow the instructions on the dye to determine exactly how much you’ll need. Generally, though, you’ll need about a 1/2 bottle of dye for every 1 lb (0.45 kg) of fabric. To help the dye set better, add 1/2 cup (150 g) of salt for every 1 lb (0.45 kg) of fabric you're dyeing. Stir the dye and salt into a small cup of warm water until they’re completely dissolved. Then, add the dye and salt mixture to your larger container of water and use a metal long-handled spoon or tongs to stir everything together. For easy cleanup, consider using a dowel or a plastic spoon to stir the dye in the smaller container. That way, you can just throw it away when you’re finished. Add the clothes and soak them for 30-60 minutes, stirring continuously. Place the clothing into the dye bath and use your spoon or tongs to push them down under the water, ensuring they’re completely saturated. To help the dye soak evenly into the fabric, stir the clothing around at least every 5-10 minutes. That helps prevent any folds or bunches in the fabric from blocking the dye. The more you stir, the more even the dye will be. Some people prefer to stir constantly, while others find it’s sufficient to just swish the clothing around every few minutes. Take the clothing out of the dye and rinse it thoroughly in cold water. Once the recommended time has passed, or when you think the garment looks dark enough, use your tongs or spoon to carefully lift the clothing out of the dye bath. Transfer it to a bathtub or a sink, and rinse the item under cold running water until the water runs mostly clear. Remember, the color will look darker when the garment is wet, so take that into account when you’re checking to see if it’s ready! Clean your sink or tub immediately so the dye doesn’t stain it! Wash the garment by itself in the washing machine on a cold cycle. If you’re satisfied with the color of your clothing, turn the garment inside out and put it in the washing machine. Even though you’ve already rinsed out much of the dye by hand, more will come out in the wash, so don’t put anything else in the washing machine, or it will get stained by dye as well. Then, run the washing machine on a small, cold cycle. Turning the garment inside-out when you wash it may help preserve its color. Dry the garment to see the final color. You can hang dry your item or you can place it in the dryer, depending on the fabric and your personal preference. Either way, when it’s finished, examine the clothing to ensure the dye went on evenly and didn’t leave any streaks or lighter areas, and that you’re happy with the final result. If you need to, you can dye the clothing again. Trying Other Household Items Try adding baking soda to your washing machine to brighten white clothing. Baking soda is another household staple that can help make your clothes look bright, and it’s especially effective on white fabric. Just add about 1/2 cup (90 g) to the drum of your washer along with your clothes and regular detergent. Baking soda is also a great way to deodorize your clothing! Refresh black clothes by soaking them in coffee or tea. If you want an easy, inexpensive way to keep your dark clothes looking rich and new, brew a 2 cups (470 mL) of very strong black tea or coffee. Place the clothes in the washing machine and wash them as normal, but stay close. When the rinse cycle starts, open the lid of the washing machine and pour in the coffee or tea. Let the cycle finish, then hang your clothing to dry. Drying black clothes in the dryer can cause them to fade more quickly. Brighten your clothing by adding black pepper to the wash. Place your clothes in the washing machine just as you normally would, then add 2-3 tsp (8-12 g) of ground black pepper in with your clothes. This will help dispel some of the buildup, and the flakes of pepper will wash away in the rinse cycle. Wash your white clothes in hydrogen peroxide to brighten them. If your whites are looking faded and dingy after a few washes, it can be tempting to bleach them, but this can weaken and discolor the fabric over time. Instead, add 1 cup (240 mL) of hydrogen peroxide to your laundry detergent, then wash your clothes as usual.",
    "sentences": [
        " Restoring Brightness with Salt Place your faded clothes and regular detergent in the washing machine.",
        "If you have clothes that seem to have faded after just a few washes, the culprit may be detergent buildup.",
        "Adding salt to your regular wash can help break up that buildup, making your clothes look like new again.",
        "Powdered laundry detergent is more likely to leave behind residue than liquid detergent.",
        "Add 1/2 cup (150 g) of salt to the wash cycle.",
        "Once you've placed your clothes and detergent in the washing machine, pour about 1/2 cup (150 g) of salt into the drum.",
        "In addition to restoring colors, it can also help prevent new clothes from fading in the first place.",
        "You can add salt to every load of laundry, if you'd like.",
        "Regular table salt or ultra-fine pickling salts work well for this, but avoid coarse-ground sea salt, as it may not dissolve fully in the washing machine.",
        "Salt is also an effective stain remover, especially on blood, mildew, and sweat stains.",
        "Dry your clothing as usual.",
        "After your clothes are finished washing, take them out and check the color.",
        "If you're satisfied with it, you can either air dry them or place them in your dryer.",
        "If they still look faded, try washing them in vinegar, instead.",
        "You may need to redye your clothes if the color has washed out over time.",
        "Using Vinegar to Combat Detergent Buildup Add ⁄2 cup (120 mL) of white vinegar to your washing machine.",
        "If you have a top-loading machine, you can pour the vinegar directly into the drum, or you can add it to the fabric softener dispenser if you have a front-loading washer.",
        "The vinegar will help break up any detergent or minerals left behind by hard water, so your clothes will look brighter.",
        "The vinegar will also prevent this buildup in the first place, so it’s a great way to keep your clothes color-fast while they’re still new.Tip: For a deeper clean, you can also dilute 1 cup (240 mL) of white vinegar in 1 gal (3.8 L) of warm water.",
        "Soak the item in the vinegar mixture for about 20-30 minutes before washing it as usual.",
        "Wash the clothes in cool water on a normal cycle.",
        "Place your faded clothes into your washing machine, add laundry detergent, and turn on the machine.",
        "In many cases, soaking your clothes in vinegar then washing them is all it will take to get them looking brighter.",
        "Choose the cycle that’s appropriate for the clothes you’re brightening.",
        "For instance, if you’re washing items made from a delicate material like silk or lace, you’d want to use a gentle wash. For more durable fabrics like cotton or denim, a normal wash is fine.",
        "Air-dry your clothes or place them in the dryer.",
        "The vinegar will wash out of your clothing during the rinse cycle, so your laundry shouldn’t smell like vinegar when it comes out of the wash. You can either hang the clothes to dry or place them in the dryer, depending on the instructions on the care label or how you normally prefer to dry your clothes.",
        "If a little of the smell does linger, either hang the item to dry outside or put a fabric softener sheet in the dryer.",
        "The smell should be gone by the time it's dry.",
        "If your clothes still look faded, the dye might have washed out, so you may need to dye the clothes instead.",
        "Dyeing Clothes to Refresh the Color Check the care label to determine if the garment is a dyeable fabric.",
        "Some fabrics accept dye better than others, so before you try to restore your clothing by dyeing it, take a look at the tag inside the item to see what it's made of.",
        "If the item is made from at least 60% natural fibers, like cotton, silk, linen, ramie, or wool, or if it’s made from rayon or nylon, it will probably dye well.",
        "Clothing made from a blend of natural and synthetic fibers may not look as dark when they’re dyed as clothing made from an all-natural fabric.",
        "If the garment is made from acrylic, spandex, polyester, or metallic fibers, or if the tag says “Dry Clean Only,” it probably will not take dye well, if at all.Tip: Make sure the clothes you’re trying to dye are completely clean.",
        "If there are any spots or stains, the dye may not absorb evenly into the fabric.",
        "Choose a dye as close to the original color as possible.",
        "If you want your garment to look as good as new, take it with you to a big box store or a craft or fabric store to choose the dye.",
        "Try to find the closest match you can, as this will give you the boldest, most natural-looking result.",
        "If you want to change the color of your garment, you’ll likely need to use a color stripper first.",
        "Protect your skin and work area from the dye.",
        "Cover your workspace with newspaper, tarp, or trash bags, so if any of the dye splashes, it won’t stain your table, counter, or floors.",
        "In addition, have some old rags or paper towels nearby just in you need to quickly clean up any spills.",
        "Then, put on old clothes and thick gloves so your clothes and skin don’t get stained.",
        "It’s important to protect your hands, because coming into contact with dye can irritate your skin.",
        "Fill a container with hot water that’s about 120–140 °F (49–60 °C).",
        "Most household water heaters are set to a maximum temperature of 120 °F (49 °C), although some are set to 140 °F (60 °C), so the hottest water from your tap should be sufficient.",
        "However, if you want hotter water, you can heat it on the stove to just below boiling, or about 200 °F (93 °C).",
        "Pour the water into a large pot, bucket, or tub, or fill a top-loading machine with water on the hottest setting.",
        "You’ll need about 3 US gal (11 L) of water for every 1 lb (0.45 kg) of clothing.",
        "A bucket or pot is good for smaller items like thin tops, accessories, and children’s clothes.",
        "Use a plastic tub or washing machine for larger items like sweaters and jeans.",
        "Most articles of clothing weigh about 0.5-1 lb (0.22-0.4 kg).",
        "Dissolve the dye and salt in a small cup of water, then add them to the bath.",
        "Follow the instructions on the dye to determine exactly how much you’ll need.",
        "Generally, though, you’ll need about a 1/2 bottle of dye for every 1 lb (0.45 kg) of fabric.",
        "To help the dye set better, add 1/2 cup (150 g) of salt for every 1 lb (0.45 kg) of fabric you're dyeing.",
        "Stir the dye and salt into a small cup of warm water until they’re completely dissolved.",
        "Then, add the dye and salt mixture to your larger container of water and use a metal long-handled spoon or tongs to stir everything together.",
        "For easy cleanup, consider using a dowel or a plastic spoon to stir the dye in the smaller container.",
        "That way, you can just throw it away when you’re finished.",
        "Add the clothes and soak them for 30-60 minutes, stirring continuously.",
        "Place the clothing into the dye bath and use your spoon or tongs to push them down under the water, ensuring they’re completely saturated.",
        "To help the dye soak evenly into the fabric, stir the clothing around at least every 5-10 minutes.",
        "That helps prevent any folds or bunches in the fabric from blocking the dye.",
        "The more you stir, the more even the dye will be.",
        "Some people prefer to stir constantly, while others find it’s sufficient to just swish the clothing around every few minutes.",
        "Take the clothing out of the dye and rinse it thoroughly in cold water.",
        "Once the recommended time has passed, or when you think the garment looks dark enough, use your tongs or spoon to carefully lift the clothing out of the dye bath.",
        "Transfer it to a bathtub or a sink, and rinse the item under cold running water until the water runs mostly clear.",
        "Remember, the color will look darker when the garment is wet, so take that into account when you’re checking to see if it’s ready!",
        "Clean your sink or tub immediately so the dye doesn’t stain it!",
        "Wash the garment by itself in the washing machine on a cold cycle.",
        "If you’re satisfied with the color of your clothing, turn the garment inside out and put it in the washing machine.",
        "Even though you’ve already rinsed out much of the dye by hand, more will come out in the wash, so don’t put anything else in the washing machine, or it will get stained by dye as well.",
        "Then, run the washing machine on a small, cold cycle.",
        "Turning the garment inside-out when you wash it may help preserve its color.",
        "Dry the garment to see the final color.",
        "You can hang dry your item or you can place it in the dryer, depending on the fabric and your personal preference.",
        "Either way, when it’s finished, examine the clothing to ensure the dye went on evenly and didn’t leave any streaks or lighter areas, and that you’re happy with the final result.",
        "If you need to, you can dye the clothing again.",
        "Trying Other Household Items Try adding baking soda to your washing machine to brighten white clothing.",
        "Baking soda is another household staple that can help make your clothes look bright, and it’s especially effective on white fabric.",
        "Just add about 1/2 cup (90 g) to the drum of your washer along with your clothes and regular detergent.",
        "Baking soda is also a great way to deodorize your clothing!",
        "Refresh black clothes by soaking them in coffee or tea.",
        "If you want an easy, inexpensive way to keep your dark clothes looking rich and new, brew a 2 cups (470 mL) of very strong black tea or coffee.",
        "Place the clothes in the washing machine and wash them as normal, but stay close.",
        "When the rinse cycle starts, open the lid of the washing machine and pour in the coffee or tea.",
        "Let the cycle finish, then hang your clothing to dry.",
        "Drying black clothes in the dryer can cause them to fade more quickly.",
        "Brighten your clothing by adding black pepper to the wash. Place your clothes in the washing machine just as you normally would, then add 2-3 tsp (8-12 g) of ground black pepper in with your clothes.",
        "This will help dispel some of the buildup, and the flakes of pepper will wash away in the rinse cycle.",
        "Wash your white clothes in hydrogen peroxide to brighten them.",
        "If your whites are looking faded and dingy after a few washes, it can be tempting to bleach them, but this can weaken and discolor the fabric over time.",
        "Instead, add 1 cup (240 mL) of hydrogen peroxide to your laundry detergent, then wash your clothes as usual."
    ]
}