{
    "title": "How to Make Reese's Peanut Butter Cups at Home",
    "url": "https://www.wikihow.com/Make-Reese%27s-Peanut-Butter-Cups-at-Home",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Chocolate and Candy"
    ],
    "methods": [
        {
            "name": "Reese's Peanut Butter Cups",
            "steps": [
                {
                    "headline": "Put cupcake liners into a muffin tin.",
                    "description": "Put 1 cupcake liner into each space of muffin tin. Since you'll be making 16 to 18 peanut butter cups, you'll need two 12-hole muffin tins or four 6-hole muffin tins. If you prefer to make mini-Reese's peanut butter cups, use a mini-muffin tin, but spray the tin with cooking spray instead of lining them. You'll probably get around 30 mini-cups."
                },
                {
                    "headline": "Mix the graham crackers, sugar, and peanut butter.",
                    "description": "Put 3/4 cup (65 g) of graham cracker crumbs into a mixing bowl. Add 1 cup (125 g) of powdered sugar and 1½ cups (375 g) of creamy peanut butter. Use a spoon or hand mixer to combine the mixture. To make it easier to mix, consider microwaving the peanut butter for 30 to 40 seconds before adding it to the bowl."
                },
                {
                    "headline": "Melt the chocolate chips in the microwave at 30 second increments.",
                    "description": "Put 3 cups (525 g) of milk chocolate chips into a microwave-safe bowl. Place the bowl in the microwave and heat the chips for 30 seconds. Stir them and then microwave them for another 30 seconds. Keep doing this until the chocolate is melted. If you don't want to microwave the chocolate chips, heat them in a double-boiler until they melt."
                },
                {
                    "headline": "Layer the chocolate and peanut butter in each cupcake liner.",
                    "description": "Put 1 teaspoon (4.9 ml) of melted chocolate into each liner. Tilt the liner or use a spoon so some of the chocolate comes up the sides a little. Then put 1 tablespoon (14.8 ml) (16 g) of the peanut butter mixture in the liner. Top the peanut butter with 1 teaspoon (4.9 ml) of the melted chocolate. To make the tops level, use the back of a spoon to spread the chocolate evenly."
                },
                {
                    "headline": "Chill the cups for 1 hour before serving.",
                    "description": "Put the muffin tin into the refrigerator. Let the peanut butter cups chill until the chocolate is completely set and hard. Then remove them and serve. To store leftover peanut butter cups, put them into an airtight container and keep them at room temperature for up to 2 to 3 weeks. If you prefer cold cups, store them in the refrigerator."
                }
            ]
        },
        {
            "name": "Low-Carb and Low-Sugar Reese's Peanut Butter Cups",
            "steps": [
                {
                    "headline": "Fill a muffin tin with liners and spray them with cooking spray.",
                    "description": "Put a cupcake liner into each cavity of a muffin tin. Spray each liner with cooking spray and put the tin aside."
                },
                {
                    "headline": "Mix half of the peanut butter, oil, vanilla, syrup, and all of the cocoa.",
                    "description": "Put 1/3 cup (82 g) of the creamy peanut butter into a bowl along with 2 ⁄2 tablespoons (37 ml) of the melted coconut oil, 1 teaspoon (4.9 ml) of the vanilla, 2 tablespoons (30 ml) of the maple syrup, and 3 tablespoons (22 g) of unsweetened cocoa powder. Stir to combine the chocolate mixture and set it aside. Avoid using peanut butter that has added oils to make it spreadable."
                },
                {
                    "headline": "Combine the remaining ingredients in another bowl.",
                    "description": "Get out another mixing bowl and put in the remaining 1/3 cup (82 g) of the creamy peanut butter, 2 tablespoons (30 ml) of melted coconut oil, 1 teaspoon (4.9 ml) of vanilla extract, and 2 tablespoons (30 ml) of maple syrup. Stir the peanut butter mixture until it's smooth."
                },
                {
                    "headline": "Divide the chocolate into the muffin tin and spread it.",
                    "description": "Spoon about ⁄2 tablespoon (7.4 ml) of the chocolate mixture into each cupcake liner. Once you've put all of the chocolate into the tin, pick up the tin and shake it around a little so the chocolate spreads across the bottom and sides of the liner."
                },
                {
                    "headline": "Divide the peanut butter into the tin and spread it over the chocolate.",
                    "description": "Scoop about ⁄2 tablespoon (7.4 ml) of the peanut butter mixture directly onto each chocolate-filled cup. Spread or shake the peanut butter so it covers most of the chocolate. It's fine if some of the chocolate is still visible around the peanut butter. This will just make the chocolates look hand-crafted."
                },
                {
                    "headline": "Garnish with salt and freeze the cups for 30 minutes.",
                    "description": "Sprinkle a little Himalayan sea salt over the top of each peanut butter cup. Then put the muffin tin in the freezer for 30 minutes so the chocolate and peanut butter set. Remove and serve the cups. Freeze the leftover peanut butter cups in an airtight container for up to 1 month."
                }
            ]
        },
        {
            "name": "Reese's Peanut Butter Balls",
            "steps": [
                {
                    "headline": "Mix the butter and peanut butter in a bowl.",
                    "description": "Put 1 cup (226 g) of softened butter into a bowl along with 2 cups (500 g) of creamy peanut butter. Use a spoon or hand mixer to beat the butters until they're completely combined. You shouldn't see any streaks of butter in the mixture."
                },
                {
                    "headline": "Stir in the ground peanuts and powdered sugar.",
                    "description": "Stir in 1 1/2 cups (190 g) of finely chopped dry roasted peanuts. Then stir in 1 ⁄2 pounds (680 g) of powdered sugar. Continue to stir until it makes a firm dough. If the dough is still sticky, stir in more powdered sugar until it stiffens."
                },
                {
                    "headline": "Scoop the peanut butter mixture into small balls.",
                    "description": "Use a spoon or cookie scoop to form the mixture into truffle-sized balls about 1 tablespoon (15 ml) (20 g) in size. If you prefer, make mini-balls that are about 1 teaspoon (7 g) in size. You should get about 30 peanut butter balls."
                },
                {
                    "headline": "Chill the balls on a waxed baking sheet for 1 to 2 hours.",
                    "description": "Place the balls on a baking sheet lined with wax paper and leave at least 1/4 in (6 mm) of space between each ball. Put the sheet in the refrigerator for 1 to 2 hours. Chilling the filling will help the chocolate harden faster."
                },
                {
                    "headline": "Dip the balls in melted chocolate.",
                    "description": "Put 3 cups (525 g) of melted milk chocolate chips into a bowl and set it on your work surface. Take the chilled balls out of the fridge and dip 1 ball at a time in the melted chocolate. Turn the ball or use another spoon to pour chocolate over the entire ball. Then set it back on the waxed paper. Repeat this with all of the peanut butter balls on the baking sheet."
                },
                {
                    "headline": "Chill the Reese's peanut butter balls for 30 minutes.",
                    "description": "Place the baking sheet back in the refrigerator. Chilling the balls will help the chocolate harden faster. Then you can remove them and serve them. Store the leftover balls in an airtight container for up to 1 month at room temperature or in the refrigerator."
                }
            ]
        }
    ],
    "tyn": [
        "Reese's Peanut Butter Cups",
        "Measuring cups and spoons",
        "Mixing bowls",
        "Spoons",
        "Muffin tins",
        "Cupcake liners",
        "Microwave-safe bowl",
        "Microwave",
        "Hand mixer, optional",
        "Low-Carb and Low-Sugar Reese's Peanut Butter Cups",
        "Spoon",
        "Muffin tin",
        "Cooking spray",
        "Reese's Peanut Butter Balls",
        "Spoons or cookie scoop",
        "Baking sheet",
        "Waxed paper"
    ],
    "text": " Reese's Peanut Butter Cups Put cupcake liners into a muffin tin. Put 1 cupcake liner into each space of muffin tin. Since you'll be making 16 to 18 peanut butter cups, you'll need two 12-hole muffin tins or four 6-hole muffin tins. If you prefer to make mini-Reese's peanut butter cups, use a mini-muffin tin, but spray the tin with cooking spray instead of lining them. You'll probably get around 30 mini-cups. Mix the graham crackers, sugar, and peanut butter. Put 3/4 cup (65 g) of graham cracker crumbs into a mixing bowl. Add 1 cup (125 g) of powdered sugar and 1½ cups (375 g) of creamy peanut butter. Use a spoon or hand mixer to combine the mixture. To make it easier to mix, consider microwaving the peanut butter for 30 to 40 seconds before adding it to the bowl. Melt the chocolate chips in the microwave at 30 second increments. Put 3 cups (525 g) of milk chocolate chips into a microwave-safe bowl. Place the bowl in the microwave and heat the chips for 30 seconds. Stir them and then microwave them for another 30 seconds. Keep doing this until the chocolate is melted. If you don't want to microwave the chocolate chips, heat them in a double-boiler until they melt. Layer the chocolate and peanut butter in each cupcake liner. Put 1 teaspoon (4.9 ml) of melted chocolate into each liner. Tilt the liner or use a spoon so some of the chocolate comes up the sides a little. Then put 1 tablespoon (14.8 ml) (16 g) of the peanut butter mixture in the liner. Top the peanut butter with 1 teaspoon (4.9 ml) of the melted chocolate. To make the tops level, use the back of a spoon to spread the chocolate evenly. Chill the cups for 1 hour before serving. Put the muffin tin into the refrigerator. Let the peanut butter cups chill until the chocolate is completely set and hard. Then remove them and serve. To store leftover peanut butter cups, put them into an airtight container and keep them at room temperature for up to 2 to 3 weeks. If you prefer cold cups, store them in the refrigerator. Low-Carb and Low-Sugar Reese's Peanut Butter Cups Fill a muffin tin with liners and spray them with cooking spray. Put a cupcake liner into each cavity of a muffin tin. Spray each liner with cooking spray and put the tin aside. Mix half of the peanut butter, oil, vanilla, syrup, and all of the cocoa. Put 1/3 cup (82 g) of the creamy peanut butter into a bowl along with 2 ⁄2 tablespoons (37 ml) of the melted coconut oil, 1 teaspoon (4.9 ml) of the vanilla, 2 tablespoons (30 ml) of the maple syrup, and 3 tablespoons (22 g) of unsweetened cocoa powder. Stir to combine the chocolate mixture and set it aside. Avoid using peanut butter that has added oils to make it spreadable. Combine the remaining ingredients in another bowl. Get out another mixing bowl and put in the remaining 1/3 cup (82 g) of the creamy peanut butter, 2 tablespoons (30 ml) of melted coconut oil, 1 teaspoon (4.9 ml) of vanilla extract, and 2 tablespoons (30 ml) of maple syrup. Stir the peanut butter mixture until it's smooth. Divide the chocolate into the muffin tin and spread it. Spoon about ⁄2 tablespoon (7.4 ml) of the chocolate mixture into each cupcake liner. Once you've put all of the chocolate into the tin, pick up the tin and shake it around a little so the chocolate spreads across the bottom and sides of the liner. Divide the peanut butter into the tin and spread it over the chocolate. Scoop about ⁄2 tablespoon (7.4 ml) of the peanut butter mixture directly onto each chocolate-filled cup. Spread or shake the peanut butter so it covers most of the chocolate. It's fine if some of the chocolate is still visible around the peanut butter. This will just make the chocolates look hand-crafted. Garnish with salt and freeze the cups for 30 minutes. Sprinkle a little Himalayan sea salt over the top of each peanut butter cup. Then put the muffin tin in the freezer for 30 minutes so the chocolate and peanut butter set. Remove and serve the cups. Freeze the leftover peanut butter cups in an airtight container for up to 1 month. Reese's Peanut Butter Balls Mix the butter and peanut butter in a bowl. Put 1 cup (226 g) of softened butter into a bowl along with 2 cups (500 g) of creamy peanut butter. Use a spoon or hand mixer to beat the butters until they're completely combined. You shouldn't see any streaks of butter in the mixture. Stir in the ground peanuts and powdered sugar. Stir in 1 1/2 cups (190 g) of finely chopped dry roasted peanuts. Then stir in 1 ⁄2 pounds (680 g) of powdered sugar. Continue to stir until it makes a firm dough. If the dough is still sticky, stir in more powdered sugar until it stiffens. Scoop the peanut butter mixture into small balls. Use a spoon or cookie scoop to form the mixture into truffle-sized balls about 1 tablespoon (15 ml) (20 g) in size. If you prefer, make mini-balls that are about 1 teaspoon (7 g) in size. You should get about 30 peanut butter balls. Chill the balls on a waxed baking sheet for 1 to 2 hours. Place the balls on a baking sheet lined with wax paper and leave at least 1/4 in (6 mm) of space between each ball. Put the sheet in the refrigerator for 1 to 2 hours. Chilling the filling will help the chocolate harden faster. Dip the balls in melted chocolate. Put 3 cups (525 g) of melted milk chocolate chips into a bowl and set it on your work surface. Take the chilled balls out of the fridge and dip 1 ball at a time in the melted chocolate. Turn the ball or use another spoon to pour chocolate over the entire ball. Then set it back on the waxed paper. Repeat this with all of the peanut butter balls on the baking sheet. Chill the Reese's peanut butter balls for 30 minutes. Place the baking sheet back in the refrigerator. Chilling the balls will help the chocolate harden faster. Then you can remove them and serve them. Store the leftover balls in an airtight container for up to 1 month at room temperature or in the refrigerator.",
    "sentences": [
        " Reese's Peanut Butter Cups Put cupcake liners into a muffin tin.",
        "Put 1 cupcake liner into each space of muffin tin.",
        "Since you'll be making 16 to 18 peanut butter cups, you'll need two 12-hole muffin tins or four 6-hole muffin tins.",
        "If you prefer to make mini-Reese's peanut butter cups, use a mini-muffin tin, but spray the tin with cooking spray instead of lining them.",
        "You'll probably get around 30 mini-cups.",
        "Mix the graham crackers, sugar, and peanut butter.",
        "Put 3/4 cup (65 g) of graham cracker crumbs into a mixing bowl.",
        "Add 1 cup (125 g) of powdered sugar and 1½ cups (375 g) of creamy peanut butter.",
        "Use a spoon or hand mixer to combine the mixture.",
        "To make it easier to mix, consider microwaving the peanut butter for 30 to 40 seconds before adding it to the bowl.",
        "Melt the chocolate chips in the microwave at 30 second increments.",
        "Put 3 cups (525 g) of milk chocolate chips into a microwave-safe bowl.",
        "Place the bowl in the microwave and heat the chips for 30 seconds.",
        "Stir them and then microwave them for another 30 seconds.",
        "Keep doing this until the chocolate is melted.",
        "If you don't want to microwave the chocolate chips, heat them in a double-boiler until they melt.",
        "Layer the chocolate and peanut butter in each cupcake liner.",
        "Put 1 teaspoon (4.9 ml) of melted chocolate into each liner.",
        "Tilt the liner or use a spoon so some of the chocolate comes up the sides a little.",
        "Then put 1 tablespoon (14.8 ml) (16 g) of the peanut butter mixture in the liner.",
        "Top the peanut butter with 1 teaspoon (4.9 ml) of the melted chocolate.",
        "To make the tops level, use the back of a spoon to spread the chocolate evenly.",
        "Chill the cups for 1 hour before serving.",
        "Put the muffin tin into the refrigerator.",
        "Let the peanut butter cups chill until the chocolate is completely set and hard.",
        "Then remove them and serve.",
        "To store leftover peanut butter cups, put them into an airtight container and keep them at room temperature for up to 2 to 3 weeks.",
        "If you prefer cold cups, store them in the refrigerator.",
        "Low-Carb and Low-Sugar Reese's Peanut Butter Cups Fill a muffin tin with liners and spray them with cooking spray.",
        "Put a cupcake liner into each cavity of a muffin tin.",
        "Spray each liner with cooking spray and put the tin aside.",
        "Mix half of the peanut butter, oil, vanilla, syrup, and all of the cocoa.",
        "Put 1/3 cup (82 g) of the creamy peanut butter into a bowl along with 2 ⁄2 tablespoons (37 ml) of the melted coconut oil, 1 teaspoon (4.9 ml) of the vanilla, 2 tablespoons (30 ml) of the maple syrup, and 3 tablespoons (22 g) of unsweetened cocoa powder.",
        "Stir to combine the chocolate mixture and set it aside.",
        "Avoid using peanut butter that has added oils to make it spreadable.",
        "Combine the remaining ingredients in another bowl.",
        "Get out another mixing bowl and put in the remaining 1/3 cup (82 g) of the creamy peanut butter, 2 tablespoons (30 ml) of melted coconut oil, 1 teaspoon (4.9 ml) of vanilla extract, and 2 tablespoons (30 ml) of maple syrup.",
        "Stir the peanut butter mixture until it's smooth.",
        "Divide the chocolate into the muffin tin and spread it.",
        "Spoon about ⁄2 tablespoon (7.4 ml) of the chocolate mixture into each cupcake liner.",
        "Once you've put all of the chocolate into the tin, pick up the tin and shake it around a little so the chocolate spreads across the bottom and sides of the liner.",
        "Divide the peanut butter into the tin and spread it over the chocolate.",
        "Scoop about ⁄2 tablespoon (7.4 ml) of the peanut butter mixture directly onto each chocolate-filled cup.",
        "Spread or shake the peanut butter so it covers most of the chocolate.",
        "It's fine if some of the chocolate is still visible around the peanut butter.",
        "This will just make the chocolates look hand-crafted.",
        "Garnish with salt and freeze the cups for 30 minutes.",
        "Sprinkle a little Himalayan sea salt over the top of each peanut butter cup.",
        "Then put the muffin tin in the freezer for 30 minutes so the chocolate and peanut butter set.",
        "Remove and serve the cups.",
        "Freeze the leftover peanut butter cups in an airtight container for up to 1 month.",
        "Reese's Peanut Butter Balls Mix the butter and peanut butter in a bowl.",
        "Put 1 cup (226 g) of softened butter into a bowl along with 2 cups (500 g) of creamy peanut butter.",
        "Use a spoon or hand mixer to beat the butters until they're completely combined.",
        "You shouldn't see any streaks of butter in the mixture.",
        "Stir in the ground peanuts and powdered sugar.",
        "Stir in 1 1/2 cups (190 g) of finely chopped dry roasted peanuts.",
        "Then stir in 1 ⁄2 pounds (680 g) of powdered sugar.",
        "Continue to stir until it makes a firm dough.",
        "If the dough is still sticky, stir in more powdered sugar until it stiffens.",
        "Scoop the peanut butter mixture into small balls.",
        "Use a spoon or cookie scoop to form the mixture into truffle-sized balls about 1 tablespoon (15 ml) (20 g) in size.",
        "If you prefer, make mini-balls that are about 1 teaspoon (7 g) in size.",
        "You should get about 30 peanut butter balls.",
        "Chill the balls on a waxed baking sheet for 1 to 2 hours.",
        "Place the balls on a baking sheet lined with wax paper and leave at least 1/4 in (6 mm) of space between each ball.",
        "Put the sheet in the refrigerator for 1 to 2 hours.",
        "Chilling the filling will help the chocolate harden faster.",
        "Dip the balls in melted chocolate.",
        "Put 3 cups (525 g) of melted milk chocolate chips into a bowl and set it on your work surface.",
        "Take the chilled balls out of the fridge and dip 1 ball at a time in the melted chocolate.",
        "Turn the ball or use another spoon to pour chocolate over the entire ball.",
        "Then set it back on the waxed paper.",
        "Repeat this with all of the peanut butter balls on the baking sheet.",
        "Chill the Reese's peanut butter balls for 30 minutes.",
        "Place the baking sheet back in the refrigerator.",
        "Chilling the balls will help the chocolate harden faster.",
        "Then you can remove them and serve them.",
        "Store the leftover balls in an airtight container for up to 1 month at room temperature or in the refrigerator."
    ]
}