{
    "title": "How to Build a Slackline",
    "url": "https://www.wikihow.com/Build-a-Slackline",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports"
    ],
    "parts": [
        {
            "name": "Choosing Supplies and Anchors",
            "steps": [
                {
                    "headline": "Choose thick tubular webbing for the slackline and slings.",
                    "description": "Slacklines are typically made from nylon cords 1 to 2 in (2.5 to 5.1 cm) wide. You will need a long piece for the slackline and 3 smaller “slings” to anchor the line. For the main line, 50 ft (15 m) is a good length for beginners. Get shorter lines 10 to 15 ft (3.0 to 4.6 m) long. The cords, along with other components, are available online and at outdoor activity supply stores. Get the webbing and other supplies you need in one go by purchasing a slackline kit. Online stores and outdoor activity suppliers sell them. You can make a slackline out of other material, including car tow lines or bungee cords."
                },
                {
                    "headline": "Purchase line lockers and carabiners to connect the webbing.",
                    "description": "Pick up 2 line lockers and 5 carabiners to set up your line. The line lockers are metal rings that prevent the slackline from coming undone. Make sure the carabiners are oval-shaped and climbing-strength to ensure they support your weight on the line. You can also use metal rings from the hardware store or rappel rings from an outdoor activity supply store."
                },
                {
                    "headline": "Select strong anchor points to tie the slackline to.",
                    "description": "Find 2 trees, posts, concrete walls, or other solid objects. Measure the distance between them to make sure your slackline is long enough. Shorter spans are easier to learn on and allow you to keep the line closer to the ground. For a 50 ft (15 m) line, look for anchor points about 20 to 30 ft (6.1 to 9.1 m) apart. The distance between the anchors has to be about 20 ft (6.1 m) shorter than your slackline so you can tie the line around them. Make sure the anchors are capable of sustaining 500 to 1,000 lb (230 to 450 kg) of force. If the anchors feels loose in the ground, don’t use them. Fragile surfaces like wood walls aren’t safe anchor points. If you don’t have anchor points available, you will need to make some. Build your own A-frames or purchase them in a kit."
                }
            ]
        },
        {
            "name": "Building A-Frame Anchors",
            "steps": [
                {
                    "headline": "Cut wood boards to create the A-frame components.",
                    "description": "You will need approximately 4 2 in × 4 in (5.1 cm × 10.2 cm) planks about 8 ft (2.4 m) long. This will be enough to create 2 A-frame. Use a miter saw set at a 22.5 degree angle. Wear safety goggles, ear muffs, and a dust mask if you cut the boards yourself. You can also rent a saw at a home improvement store or have store employees cut the following boards:\n2 planks 18 in (46 cm) long. 2 planks 20 ⁄4 in (53 cm) long. 4 planks 36 in (91 cm) long. 2 planks 37 ⁄8 in (96 cm) long."
                },
                {
                    "headline": "Arrange the boards in an A-shape on a workbench.",
                    "description": "Set the boards out on a flat surface so you can fasten them together. Work on 1 A-frame at a time. To create the frame, place the 2 medium boards on the sides. Fit the remaining boards between these medium boards. Place 1 of the long boards at the bottom, then fit the shorter boards at the top and in the middle. Each A-frame uses 5 boards. When you’re done, the boards will create the shape of an A. Make sure all of the boards fit snugly together."
                },
                {
                    "headline": "Clamp the boards and drill pilot holes through them.",
                    "description": "Countersinking pilot holes prevents the boards from cracking and weakening. Use a drill with a ⁄4 in (1.9 cm) countersink bit to drill a pair of holes in each of the middle boards. Measure about 2 in (5.1 cm) from the ends of each board, then drill the holes diagonally into the side boards. Work from the bottom edges of lower support boards in the middle of the A-frame. For the small board at the top, drill through the side boards to reach it. Use a pair of wood clamps to hold the boards in place as you work."
                },
                {
                    "headline": "Bolt the boards together with 2 ⁄2 in (6.4 cm) decking screws.",
                    "description": "Place a screw in each of the pilot holes. The screws will pass through the support planks and into the frame planks on the side. Make sure the boards fit together well and feel sturdy when you try to move them. That way, they won’t fall apart when you’re walking on your slackline."
                },
                {
                    "headline": "Cut plywood to fit over the A-frame.",
                    "description": "The plywood creates a spot for you to attach the slackline and anchor lines. You will need a 8 in (20 cm) sheet of plywood ⁄2 in (1.3 cm) thick for each A-frame you wish to make. Set the A-frame on top of the plywood, then trace its outline with a pencil. Cut the outline using a reciprocating saw. You can also use a jigsaw or circular saw to cut the plywood. To avoid cutting the plywood too short, leave it a little longer than the outline. You can always cut it down further or sand it, but you can’t fix it once it’s too small for the A-frame."
                },
                {
                    "headline": "Fasten the plywood to the A-frame with 2 in (5.1 cm) decking screws.",
                    "description": "Place the plywood over the A-frame. Place a screw about every 12 in (30 cm) along each of the boards in the frame. Screw through the plywood and into the frame boards to secure everything together. The frame boards are a little difficult to find underneath the plywood. Feel for the solid boards through the plywood. If you’re unsure, lift up the plywood to locate them. Outline them with a pencil to help you place the screws."
                },
                {
                    "headline": "Drill a pair of holes through the plywood to create anchor points.",
                    "description": "Use a 1 ⁄2 in (3.8 cm) drill bit to make the holes. Position them underneath the top board on the A-frame. Make the holes about 2 in (5.1 cm) apart. Use a reciprocating saw or another tool to remove the wood between the holes. Basically, you create a slot in the A-frame to thread the slackline webbing through."
                },
                {
                    "headline": "Tie the A-frames to anchor points using nylon webbing.",
                    "description": "Find an anchor point for each A-frame. One way to do this is by planting metal stakes or struts firmly in the ground. Use extra line lockers and carabiners to run the webbing from the stakes to the slot in the A-frame. Make sure the stakes are well-planted so the frames can’t move when you touch them. Another way to plant the A-frames is by burying concrete cinder blocks in your yard. Tie a chain around each cinder blocks, then run the chains to the A-frames. To preserve the webbing for longer, sand your A-frames smooth before using them."
                }
            ]
        },
        {
            "name": "Setting up Your Slackline",
            "steps": [
                {
                    "headline": "Secure a sling to the first anchor point at waist height.",
                    "description": "Position the loop of webbing about 2 to 3 ft (0.61 to 0.91 m) off the ground for a 15 to 20 ft (4.6 to 6.1 m) slackline. Loop the webbing tightly around the tree, then connect the ends with a carabiner. Before using trees for anchors, cover the bark with padding like a towel or carpeting. If you’re creating a longer slackline, you may need to raise the slings up further to keep the line off the ground. If the line touches the ground when you climb onto it, take it apart and raise the webbing."
                },
                {
                    "headline": "Hook the slackline to the sling with a carabiner Fold the first 12 in (30 cm) of the line over on itself to create a small loop.",
                    "description": "Push the loop through a line locker to keep the slackline secure later. Then, pull about 5 in (13 cm) of the line back around and through the line locker again to create a double loop. Clip a single carabiner to it. Pull on the line to make sure the sling feels secure in the loop. If it feels loose, take it out of the line locker and carabiner, then knot it again."
                },
                {
                    "headline": "Place a line locker and carabiner about 80% of the way from the second anchor.",
                    "description": "Lay the slackline out on the ground between the anchor points. Walk towards the loose end of the line and the second anchor point. Estimate when 80% of the line is behind you, then pull the line through a line locker. Tie the end of the line to a carabiner using a double loop like you did earlier. You can usually get a good estimate of where to place the line locker by looking at the line as you walk. If you need to, measure it out with a ruler or tape measure. For example, if you’re using a 20 ft (6.1 m) line, place the line locker 15 to 16 ft (4.6 to 4.9 m) along the slackline."
                },
                {
                    "headline": "Wrap 2 slings with carabiners around the far anchor point.",
                    "description": "Place the slings on the anchor point closest to the free end of the slackline. Keep the slings close together. Connect the ends of each sling with a single carabiner. Lay the carabiners on top of one another, positioning them so the “gate” parts that open face in opposite directions. Remember to protect trees by placing padding underneath the slings. Test the slings when you’re done to make sure they are knotted tightly in place."
                },
                {
                    "headline": "Loop the slackline around the carabiners to anchor it in place.",
                    "description": "Bring the slackline underneath and through the lower carabiner on your anchor point. Then, pull the line back towards you and through the carabiner with the line locker. Pass the line under and through the upper carabiner on the anchor point. Finally, pull the line underneath and back through the carabiner with the line locker. This is called a “primitive” 4-carabiner pulley system. It can be a little tricky to get at first, but it’s a safe, fun way to create a slackline without any extra tools or knots. If you have a ratchet system, attach the ratchet to an anchor point, then feed the slackline webbing through it."
                }
            ]
        },
        {
            "name": "Tightening and Undoing the Line",
            "steps": [
                {
                    "headline": "Pull the line toward the far anchor to tighten it.",
                    "description": "Grab onto the tail end of the slackline and pull it towards the first anchor with the single carabiner. Get the line moderately taught, enough to keep it from sagging. Tighter lines are better for bouncing and doing tricks. Adjust the line to get the amount of tension you desire. If you’re using a ratchet, pull the ratchet handle down to tighten the line. Don’t tighten it too much. Keep at least a little slack in the line to prevent it from snapping. You may need help pulling a line over 30 ft (9.1 m). Have a friend help you pull the line. Another way to pull a long line is by installing a pulley system. Hook the pulley to the anchor point. Run a cord from the locking anchor in the line to the pulley. Then, tug the webbing through the pulley to tighten it."
                },
                {
                    "headline": "Test the line by sitting or bouncing on it.",
                    "description": "Climb onto the line. Walk across it or bounce on it a little bit to stretch out the anchors and knots. Make sure the line feels secure but doesn’t touch the ground when you walk the middle of it. If the line needs adjustment, tug on the end of the slackline to tighten or loosen it. If you need to raise the line, loosen it first before untying the webbing around the anchors."
                },
                {
                    "headline": "Release the line by pulling it in the opposite direction.",
                    "description": "Pull the tail end of the line away from the anchor point to undo it. This is very safe and easy to do in a primitive pulley system. Once you have lowered the line, removing all tension from it, unhook the carabiners to take down all of the webbing. If you’re using a ratchet, unlock the ratchet to release the tension. Pull the slackline out of the ratchet to take it down."
                }
            ]
        }
    ],
    "tyn": [
        "Choosing Supplies and Anchors",
        "2 anchor points",
        "At least 40 ft (12 m) of 2 in (5.1 cm)-thick tubular webbing",
        "3 pieces of tubular webbing at least 10 ft (3.0 m) long and 1 in (2.5 cm) thick",
        "5 carabiners",
        "2 line lockers",
        "Towel or other padding to protect trees used as anchors",
        "Building A-Frames",
        "2 planks 18 in (46 cm) long.",
        "2 planks ",
        "20 3⁄4",
        "20",
        " ",
        "3",
        "⁄",
        "4",
        " in (53 cm) long.",
        "4 planks 36 in (91 cm) long.",
        "37 7⁄8",
        "37",
        "7",
        "8",
        " in (96 cm) long.",
        "Wood clamps",
        "Power drill",
        "3⁄4",
        " in (1.9 cm) countersink drill pit",
        "2 1⁄2",
        "2",
        "1",
        " in (6.4 cm) decking screws.",
        "2 8 in (20 cm) sheet of plywood ",
        "1⁄2",
        " in (1.3 cm)",
        "Reciprocating saw or alternative",
        "2 in (5.1 cm) decking screws.",
        "A ",
        "1 1⁄2",
        " in (3.8 cm) drill bit to make the holes",
        "Pencil",
        "Safety goggles",
        "Ear muffs",
        "Dust mask"
    ],
    "text": " Choosing Supplies and Anchors Choose thick tubular webbing for the slackline and slings. Slacklines are typically made from nylon cords 1 to 2 in (2.5 to 5.1 cm) wide. You will need a long piece for the slackline and 3 smaller “slings” to anchor the line. For the main line, 50 ft (15 m) is a good length for beginners. Get shorter lines 10 to 15 ft (3.0 to 4.6 m) long. The cords, along with other components, are available online and at outdoor activity supply stores. Get the webbing and other supplies you need in one go by purchasing a slackline kit. Online stores and outdoor activity suppliers sell them. You can make a slackline out of other material, including car tow lines or bungee cords. Purchase line lockers and carabiners to connect the webbing. Pick up 2 line lockers and 5 carabiners to set up your line. The line lockers are metal rings that prevent the slackline from coming undone. Make sure the carabiners are oval-shaped and climbing-strength to ensure they support your weight on the line. You can also use metal rings from the hardware store or rappel rings from an outdoor activity supply store. Select strong anchor points to tie the slackline to. Find 2 trees, posts, concrete walls, or other solid objects. Measure the distance between them to make sure your slackline is long enough. Shorter spans are easier to learn on and allow you to keep the line closer to the ground. For a 50 ft (15 m) line, look for anchor points about 20 to 30 ft (6.1 to 9.1 m) apart. The distance between the anchors has to be about 20 ft (6.1 m) shorter than your slackline so you can tie the line around them. Make sure the anchors are capable of sustaining 500 to 1,000 lb (230 to 450 kg) of force. If the anchors feels loose in the ground, don’t use them. Fragile surfaces like wood walls aren’t safe anchor points. If you don’t have anchor points available, you will need to make some. Build your own A-frames or purchase them in a kit. Building A-Frame Anchors Cut wood boards to create the A-frame components. You will need approximately 4 2 in × 4 in (5.1 cm × 10.2 cm) planks about 8 ft (2.4 m) long. This will be enough to create 2 A-frame. Use a miter saw set at a 22.5 degree angle. Wear safety goggles, ear muffs, and a dust mask if you cut the boards yourself. You can also rent a saw at a home improvement store or have store employees cut the following boards:\n2 planks 18 in (46 cm) long. 2 planks 20 ⁄4 in (53 cm) long. 4 planks 36 in (91 cm) long. 2 planks 37 ⁄8 in (96 cm) long. Arrange the boards in an A-shape on a workbench. Set the boards out on a flat surface so you can fasten them together. Work on 1 A-frame at a time. To create the frame, place the 2 medium boards on the sides. Fit the remaining boards between these medium boards. Place 1 of the long boards at the bottom, then fit the shorter boards at the top and in the middle. Each A-frame uses 5 boards. When you’re done, the boards will create the shape of an A. Make sure all of the boards fit snugly together. Clamp the boards and drill pilot holes through them. Countersinking pilot holes prevents the boards from cracking and weakening. Use a drill with a ⁄4 in (1.9 cm) countersink bit to drill a pair of holes in each of the middle boards. Measure about 2 in (5.1 cm) from the ends of each board, then drill the holes diagonally into the side boards. Work from the bottom edges of lower support boards in the middle of the A-frame. For the small board at the top, drill through the side boards to reach it. Use a pair of wood clamps to hold the boards in place as you work. Bolt the boards together with 2 ⁄2 in (6.4 cm) decking screws. Place a screw in each of the pilot holes. The screws will pass through the support planks and into the frame planks on the side. Make sure the boards fit together well and feel sturdy when you try to move them. That way, they won’t fall apart when you’re walking on your slackline. Cut plywood to fit over the A-frame. The plywood creates a spot for you to attach the slackline and anchor lines. You will need a 8 in (20 cm) sheet of plywood ⁄2 in (1.3 cm) thick for each A-frame you wish to make. Set the A-frame on top of the plywood, then trace its outline with a pencil. Cut the outline using a reciprocating saw. You can also use a jigsaw or circular saw to cut the plywood. To avoid cutting the plywood too short, leave it a little longer than the outline. You can always cut it down further or sand it, but you can’t fix it once it’s too small for the A-frame. Fasten the plywood to the A-frame with 2 in (5.1 cm) decking screws. Place the plywood over the A-frame. Place a screw about every 12 in (30 cm) along each of the boards in the frame. Screw through the plywood and into the frame boards to secure everything together. The frame boards are a little difficult to find underneath the plywood. Feel for the solid boards through the plywood. If you’re unsure, lift up the plywood to locate them. Outline them with a pencil to help you place the screws. Drill a pair of holes through the plywood to create anchor points. Use a 1 ⁄2 in (3.8 cm) drill bit to make the holes. Position them underneath the top board on the A-frame. Make the holes about 2 in (5.1 cm) apart. Use a reciprocating saw or another tool to remove the wood between the holes. Basically, you create a slot in the A-frame to thread the slackline webbing through. Tie the A-frames to anchor points using nylon webbing. Find an anchor point for each A-frame. One way to do this is by planting metal stakes or struts firmly in the ground. Use extra line lockers and carabiners to run the webbing from the stakes to the slot in the A-frame. Make sure the stakes are well-planted so the frames can’t move when you touch them. Another way to plant the A-frames is by burying concrete cinder blocks in your yard. Tie a chain around each cinder blocks, then run the chains to the A-frames. To preserve the webbing for longer, sand your A-frames smooth before using them. Setting up Your Slackline Secure a sling to the first anchor point at waist height. Position the loop of webbing about 2 to 3 ft (0.61 to 0.91 m) off the ground for a 15 to 20 ft (4.6 to 6.1 m) slackline. Loop the webbing tightly around the tree, then connect the ends with a carabiner. Before using trees for anchors, cover the bark with padding like a towel or carpeting. If you’re creating a longer slackline, you may need to raise the slings up further to keep the line off the ground. If the line touches the ground when you climb onto it, take it apart and raise the webbing. Hook the slackline to the sling with a carabiner Fold the first 12 in (30 cm) of the line over on itself to create a small loop. Push the loop through a line locker to keep the slackline secure later. Then, pull about 5 in (13 cm) of the line back around and through the line locker again to create a double loop. Clip a single carabiner to it. Pull on the line to make sure the sling feels secure in the loop. If it feels loose, take it out of the line locker and carabiner, then knot it again. Place a line locker and carabiner about 80% of the way from the second anchor. Lay the slackline out on the ground between the anchor points. Walk towards the loose end of the line and the second anchor point. Estimate when 80% of the line is behind you, then pull the line through a line locker. Tie the end of the line to a carabiner using a double loop like you did earlier. You can usually get a good estimate of where to place the line locker by looking at the line as you walk. If you need to, measure it out with a ruler or tape measure. For example, if you’re using a 20 ft (6.1 m) line, place the line locker 15 to 16 ft (4.6 to 4.9 m) along the slackline. Wrap 2 slings with carabiners around the far anchor point. Place the slings on the anchor point closest to the free end of the slackline. Keep the slings close together. Connect the ends of each sling with a single carabiner. Lay the carabiners on top of one another, positioning them so the “gate” parts that open face in opposite directions. Remember to protect trees by placing padding underneath the slings. Test the slings when you’re done to make sure they are knotted tightly in place. Loop the slackline around the carabiners to anchor it in place. Bring the slackline underneath and through the lower carabiner on your anchor point. Then, pull the line back towards you and through the carabiner with the line locker. Pass the line under and through the upper carabiner on the anchor point. Finally, pull the line underneath and back through the carabiner with the line locker. This is called a “primitive” 4-carabiner pulley system. It can be a little tricky to get at first, but it’s a safe, fun way to create a slackline without any extra tools or knots. If you have a ratchet system, attach the ratchet to an anchor point, then feed the slackline webbing through it. Tightening and Undoing the Line Pull the line toward the far anchor to tighten it. Grab onto the tail end of the slackline and pull it towards the first anchor with the single carabiner. Get the line moderately taught, enough to keep it from sagging. Tighter lines are better for bouncing and doing tricks. Adjust the line to get the amount of tension you desire. If you’re using a ratchet, pull the ratchet handle down to tighten the line. Don’t tighten it too much. Keep at least a little slack in the line to prevent it from snapping. You may need help pulling a line over 30 ft (9.1 m). Have a friend help you pull the line. Another way to pull a long line is by installing a pulley system. Hook the pulley to the anchor point. Run a cord from the locking anchor in the line to the pulley. Then, tug the webbing through the pulley to tighten it. Test the line by sitting or bouncing on it. Climb onto the line. Walk across it or bounce on it a little bit to stretch out the anchors and knots. Make sure the line feels secure but doesn’t touch the ground when you walk the middle of it. If the line needs adjustment, tug on the end of the slackline to tighten or loosen it. If you need to raise the line, loosen it first before untying the webbing around the anchors. Release the line by pulling it in the opposite direction. Pull the tail end of the line away from the anchor point to undo it. This is very safe and easy to do in a primitive pulley system. Once you have lowered the line, removing all tension from it, unhook the carabiners to take down all of the webbing. If you’re using a ratchet, unlock the ratchet to release the tension. Pull the slackline out of the ratchet to take it down.",
    "sentences": [
        " Choosing Supplies and Anchors Choose thick tubular webbing for the slackline and slings.",
        "Slacklines are typically made from nylon cords 1 to 2 in (2.5 to 5.1 cm) wide.",
        "You will need a long piece for the slackline and 3 smaller “slings” to anchor the line.",
        "For the main line, 50 ft (15 m) is a good length for beginners.",
        "Get shorter lines 10 to 15 ft (3.0 to 4.6 m) long.",
        "The cords, along with other components, are available online and at outdoor activity supply stores.",
        "Get the webbing and other supplies you need in one go by purchasing a slackline kit.",
        "Online stores and outdoor activity suppliers sell them.",
        "You can make a slackline out of other material, including car tow lines or bungee cords.",
        "Purchase line lockers and carabiners to connect the webbing.",
        "Pick up 2 line lockers and 5 carabiners to set up your line.",
        "The line lockers are metal rings that prevent the slackline from coming undone.",
        "Make sure the carabiners are oval-shaped and climbing-strength to ensure they support your weight on the line.",
        "You can also use metal rings from the hardware store or rappel rings from an outdoor activity supply store.",
        "Select strong anchor points to tie the slackline to.",
        "Find 2 trees, posts, concrete walls, or other solid objects.",
        "Measure the distance between them to make sure your slackline is long enough.",
        "Shorter spans are easier to learn on and allow you to keep the line closer to the ground.",
        "For a 50 ft (15 m) line, look for anchor points about 20 to 30 ft (6.1 to 9.1 m) apart.",
        "The distance between the anchors has to be about 20 ft (6.1 m) shorter than your slackline so you can tie the line around them.",
        "Make sure the anchors are capable of sustaining 500 to 1,000 lb (230 to 450 kg) of force.",
        "If the anchors feels loose in the ground, don’t use them.",
        "Fragile surfaces like wood walls aren’t safe anchor points.",
        "If you don’t have anchor points available, you will need to make some.",
        "Build your own A-frames or purchase them in a kit.",
        "Building A-Frame Anchors Cut wood boards to create the A-frame components.",
        "You will need approximately 4 2 in × 4 in (5.1 cm × 10.2 cm) planks about 8 ft (2.4 m) long.",
        "This will be enough to create 2 A-frame.",
        "Use a miter saw set at a 22.5 degree angle.",
        "Wear safety goggles, ear muffs, and a dust mask if you cut the boards yourself.",
        "You can also rent a saw at a home improvement store or have store employees cut the following boards:\n2 planks 18 in (46 cm) long.",
        "2 planks 20 ⁄4 in (53 cm) long.",
        "4 planks 36 in (91 cm) long.",
        "2 planks 37 ⁄8 in (96 cm) long.",
        "Arrange the boards in an A-shape on a workbench.",
        "Set the boards out on a flat surface so you can fasten them together.",
        "Work on 1 A-frame at a time.",
        "To create the frame, place the 2 medium boards on the sides.",
        "Fit the remaining boards between these medium boards.",
        "Place 1 of the long boards at the bottom, then fit the shorter boards at the top and in the middle.",
        "Each A-frame uses 5 boards.",
        "When you’re done, the boards will create the shape of an A.",
        "Make sure all of the boards fit snugly together.",
        "Clamp the boards and drill pilot holes through them.",
        "Countersinking pilot holes prevents the boards from cracking and weakening.",
        "Use a drill with a ⁄4 in (1.9 cm) countersink bit to drill a pair of holes in each of the middle boards.",
        "Measure about 2 in (5.1 cm) from the ends of each board, then drill the holes diagonally into the side boards.",
        "Work from the bottom edges of lower support boards in the middle of the A-frame.",
        "For the small board at the top, drill through the side boards to reach it.",
        "Use a pair of wood clamps to hold the boards in place as you work.",
        "Bolt the boards together with 2 ⁄2 in (6.4 cm) decking screws.",
        "Place a screw in each of the pilot holes.",
        "The screws will pass through the support planks and into the frame planks on the side.",
        "Make sure the boards fit together well and feel sturdy when you try to move them.",
        "That way, they won’t fall apart when you’re walking on your slackline.",
        "Cut plywood to fit over the A-frame.",
        "The plywood creates a spot for you to attach the slackline and anchor lines.",
        "You will need a 8 in (20 cm) sheet of plywood ⁄2 in (1.3 cm) thick for each A-frame you wish to make.",
        "Set the A-frame on top of the plywood, then trace its outline with a pencil.",
        "Cut the outline using a reciprocating saw.",
        "You can also use a jigsaw or circular saw to cut the plywood.",
        "To avoid cutting the plywood too short, leave it a little longer than the outline.",
        "You can always cut it down further or sand it, but you can’t fix it once it’s too small for the A-frame.",
        "Fasten the plywood to the A-frame with 2 in (5.1 cm) decking screws.",
        "Place the plywood over the A-frame.",
        "Place a screw about every 12 in (30 cm) along each of the boards in the frame.",
        "Screw through the plywood and into the frame boards to secure everything together.",
        "The frame boards are a little difficult to find underneath the plywood.",
        "Feel for the solid boards through the plywood.",
        "If you’re unsure, lift up the plywood to locate them.",
        "Outline them with a pencil to help you place the screws.",
        "Drill a pair of holes through the plywood to create anchor points.",
        "Use a 1 ⁄2 in (3.8 cm) drill bit to make the holes.",
        "Position them underneath the top board on the A-frame.",
        "Make the holes about 2 in (5.1 cm) apart.",
        "Use a reciprocating saw or another tool to remove the wood between the holes.",
        "Basically, you create a slot in the A-frame to thread the slackline webbing through.",
        "Tie the A-frames to anchor points using nylon webbing.",
        "Find an anchor point for each A-frame.",
        "One way to do this is by planting metal stakes or struts firmly in the ground.",
        "Use extra line lockers and carabiners to run the webbing from the stakes to the slot in the A-frame.",
        "Make sure the stakes are well-planted so the frames can’t move when you touch them.",
        "Another way to plant the A-frames is by burying concrete cinder blocks in your yard.",
        "Tie a chain around each cinder blocks, then run the chains to the A-frames.",
        "To preserve the webbing for longer, sand your A-frames smooth before using them.",
        "Setting up Your Slackline Secure a sling to the first anchor point at waist height.",
        "Position the loop of webbing about 2 to 3 ft (0.61 to 0.91 m) off the ground for a 15 to 20 ft (4.6 to 6.1 m) slackline.",
        "Loop the webbing tightly around the tree, then connect the ends with a carabiner.",
        "Before using trees for anchors, cover the bark with padding like a towel or carpeting.",
        "If you’re creating a longer slackline, you may need to raise the slings up further to keep the line off the ground.",
        "If the line touches the ground when you climb onto it, take it apart and raise the webbing.",
        "Hook the slackline to the sling with a carabiner Fold the first 12 in (30 cm) of the line over on itself to create a small loop.",
        "Push the loop through a line locker to keep the slackline secure later.",
        "Then, pull about 5 in (13 cm) of the line back around and through the line locker again to create a double loop.",
        "Clip a single carabiner to it.",
        "Pull on the line to make sure the sling feels secure in the loop.",
        "If it feels loose, take it out of the line locker and carabiner, then knot it again.",
        "Place a line locker and carabiner about 80% of the way from the second anchor.",
        "Lay the slackline out on the ground between the anchor points.",
        "Walk towards the loose end of the line and the second anchor point.",
        "Estimate when 80% of the line is behind you, then pull the line through a line locker.",
        "Tie the end of the line to a carabiner using a double loop like you did earlier.",
        "You can usually get a good estimate of where to place the line locker by looking at the line as you walk.",
        "If you need to, measure it out with a ruler or tape measure.",
        "For example, if you’re using a 20 ft (6.1 m) line, place the line locker 15 to 16 ft (4.6 to 4.9 m) along the slackline.",
        "Wrap 2 slings with carabiners around the far anchor point.",
        "Place the slings on the anchor point closest to the free end of the slackline.",
        "Keep the slings close together.",
        "Connect the ends of each sling with a single carabiner.",
        "Lay the carabiners on top of one another, positioning them so the “gate” parts that open face in opposite directions.",
        "Remember to protect trees by placing padding underneath the slings.",
        "Test the slings when you’re done to make sure they are knotted tightly in place.",
        "Loop the slackline around the carabiners to anchor it in place.",
        "Bring the slackline underneath and through the lower carabiner on your anchor point.",
        "Then, pull the line back towards you and through the carabiner with the line locker.",
        "Pass the line under and through the upper carabiner on the anchor point.",
        "Finally, pull the line underneath and back through the carabiner with the line locker.",
        "This is called a “primitive” 4-carabiner pulley system.",
        "It can be a little tricky to get at first, but it’s a safe, fun way to create a slackline without any extra tools or knots.",
        "If you have a ratchet system, attach the ratchet to an anchor point, then feed the slackline webbing through it.",
        "Tightening and Undoing the Line Pull the line toward the far anchor to tighten it.",
        "Grab onto the tail end of the slackline and pull it towards the first anchor with the single carabiner.",
        "Get the line moderately taught, enough to keep it from sagging.",
        "Tighter lines are better for bouncing and doing tricks.",
        "Adjust the line to get the amount of tension you desire.",
        "If you’re using a ratchet, pull the ratchet handle down to tighten the line.",
        "Don’t tighten it too much.",
        "Keep at least a little slack in the line to prevent it from snapping.",
        "You may need help pulling a line over 30 ft (9.1 m).",
        "Have a friend help you pull the line.",
        "Another way to pull a long line is by installing a pulley system.",
        "Hook the pulley to the anchor point.",
        "Run a cord from the locking anchor in the line to the pulley.",
        "Then, tug the webbing through the pulley to tighten it.",
        "Test the line by sitting or bouncing on it.",
        "Climb onto the line.",
        "Walk across it or bounce on it a little bit to stretch out the anchors and knots.",
        "Make sure the line feels secure but doesn’t touch the ground when you walk the middle of it.",
        "If the line needs adjustment, tug on the end of the slackline to tighten or loosen it.",
        "If you need to raise the line, loosen it first before untying the webbing around the anchors.",
        "Release the line by pulling it in the opposite direction.",
        "Pull the tail end of the line away from the anchor point to undo it.",
        "This is very safe and easy to do in a primitive pulley system.",
        "Once you have lowered the line, removing all tension from it, unhook the carabiners to take down all of the webbing.",
        "If you’re using a ratchet, unlock the ratchet to release the tension.",
        "Pull the slackline out of the ratchet to take it down."
    ]
}