{
    "title": "How to Drink Campari",
    "url": "https://www.wikihow.com/Drink-Campari",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks"
    ],
    "methods": [
        {
            "name": "Making Campari with Soda or Juice",
            "steps": [
                {
                    "headline": "Put 3-4 large ice cubes into a rocks glass.",
                    "description": "Campari with soda or juice tastes best when chilled. Add the ice cubes to the glass before you pour in the liquids. Adding the ice first will ensure that the glass is chilled and your drink remains cold for a longer time. You can use either round or square ice cubes. If you are using smaller ice cubes, use more cubes."
                },
                {
                    "headline": "Pour 2  fl oz (59 ml) of Campari over the ice.",
                    "description": "Use a jigger or measuring cup to measure out the Campari. The best-tasting drink will be balanced, so it’s important to get the quantities of liquor to mixer correct. A jigger is a small measuring cup that is often used by bartenders and mixologists."
                },
                {
                    "headline": "Add 4  fl oz (120 ml) of soda or juice into the drink.",
                    "description": "Measure out the soda or juice with a jigger or measuring cup. Campari tastes best with bitter citrus juices like orange juice or grapefruit juice. If you're using soda, most people use seltzer water or a lighter soda, like ginger ale."
                },
                {
                    "headline": "Squeeze a slice of lemon or orange into the beverage.",
                    "description": "Cut a lemon or orange into quarters and squeeze one of the slices into your drink. This will add extra citrus notes to your drink. You can also use one of the wedges as a garnish for the drink."
                },
                {
                    "headline": "Mix the drink with a spoon and enjoy.",
                    "description": "Mixing the drink together will incorporate all of the liquids for an even drink. Take a sip of the drink and adjust the ingredients to your liking."
                }
            ]
        },
        {
            "name": "Mixing a Classic Campari Cocktail",
            "steps": [
                {
                    "headline": "Fill a glass with large ice cubes.",
                    "description": "A Negroni tastes best with ice. Put the ice cubes into the glass before you add the other liquors so that the glass is cold when you add the liquids. Use 2-3 ice cubes for this drink."
                },
                {
                    "headline": "Pour 1  fl oz (30 ml) of Campari into the glass.",
                    "description": "Carefully measure out 1  fl oz (30 ml) of Campari using a jigger or measuring cup. Then, pour the Campari over the ice in your glass. A well-balanced cocktail hinges on the even quantity of ingredients in the drink, so make sure to measure."
                },
                {
                    "headline": "Add 1  fl oz (30 ml) of gin into the glass.",
                    "description": "Measure out the gin with a jigger or measuring cup. Use a London dry gin to create a classic tasting Negroni or a floral accented gin, like Hendricks, to give the drink a more flowery flavor. Consider the differences in the tastes of the gin and use whatever variation you like the most. Popular brands of London dry gin include Beefeater and Tanqueray. Taste the gin on its own to get a better idea of how it will affect the taste of the drink."
                },
                {
                    "headline": "Pour 1  fl oz (30 ml) of sweet vermouth into the drink.",
                    "description": "Measure the sweet vermouth using a jigger or measuring cup. Use a sweet flavored vermouth, like Rosso Vermouth, in the Negroni. Do not use dry vermouth or other variations of vermouth because it will ruin the taste of the drink."
                },
                {
                    "headline": "Add rye whiskey or bourbon instead of gin to make a Boulevardier.",
                    "description": "Measure out the rye whiskey and pour it into the glass. The best kinds of whiskey to use are a dry whiskey or bourbon since the vermouth and Campari are already sweet. Popular brands of rye whiskey include Bulleit, Rittenhouse, and Templeton Rye Whiskey. Popular brands of bourbons include Bulleit Bourbon, Old Forester, and Woodford Reserve."
                },
                {
                    "headline": "Keep your ingredients balanced 1-1-1.",
                    "description": "Whether you’re making a Negroni or a Boulevardier, it’s important to get the proportions of the ingredients right. Be sure to use 1 part gin (or whiskey) to 1 part Campari and 1 part sweet vermouth. The right balance will ensure that you can appreciate all the distinct flavors of the cocktail."
                },
                {
                    "headline": "Stir the glass with a spoon and drink it.",
                    "description": "Stir the Campari drink to incorporate all of the liquids together. Once all the ingredients are thoroughly stirred, serve the drink before the ice cubes melt. Serve and enjoy the drink immediately after stirring. Garnish the cocktail with an orange slice."
                }
            ]
        }
    ],
    "tyn": [
        "Rocks glass",
        "Ice",
        "Spoon",
        "Jigger or measuring cup"
    ],
    "text": " Making Campari with Soda or Juice Put 3-4 large ice cubes into a rocks glass. Campari with soda or juice tastes best when chilled. Add the ice cubes to the glass before you pour in the liquids. Adding the ice first will ensure that the glass is chilled and your drink remains cold for a longer time. You can use either round or square ice cubes. If you are using smaller ice cubes, use more cubes. Pour 2  fl oz (59 ml) of Campari over the ice. Use a jigger or measuring cup to measure out the Campari. The best-tasting drink will be balanced, so it’s important to get the quantities of liquor to mixer correct. A jigger is a small measuring cup that is often used by bartenders and mixologists. Add 4  fl oz (120 ml) of soda or juice into the drink. Measure out the soda or juice with a jigger or measuring cup. Campari tastes best with bitter citrus juices like orange juice or grapefruit juice. If you're using soda, most people use seltzer water or a lighter soda, like ginger ale. Squeeze a slice of lemon or orange into the beverage. Cut a lemon or orange into quarters and squeeze one of the slices into your drink. This will add extra citrus notes to your drink. You can also use one of the wedges as a garnish for the drink. Mix the drink with a spoon and enjoy. Mixing the drink together will incorporate all of the liquids for an even drink. Take a sip of the drink and adjust the ingredients to your liking. Mixing a Classic Campari Cocktail Fill a glass with large ice cubes. A Negroni tastes best with ice. Put the ice cubes into the glass before you add the other liquors so that the glass is cold when you add the liquids. Use 2-3 ice cubes for this drink. Pour 1  fl oz (30 ml) of Campari into the glass. Carefully measure out 1  fl oz (30 ml) of Campari using a jigger or measuring cup. Then, pour the Campari over the ice in your glass. A well-balanced cocktail hinges on the even quantity of ingredients in the drink, so make sure to measure. Add 1  fl oz (30 ml) of gin into the glass. Measure out the gin with a jigger or measuring cup. Use a London dry gin to create a classic tasting Negroni or a floral accented gin, like Hendricks, to give the drink a more flowery flavor. Consider the differences in the tastes of the gin and use whatever variation you like the most. Popular brands of London dry gin include Beefeater and Tanqueray. Taste the gin on its own to get a better idea of how it will affect the taste of the drink. Pour 1  fl oz (30 ml) of sweet vermouth into the drink. Measure the sweet vermouth using a jigger or measuring cup. Use a sweet flavored vermouth, like Rosso Vermouth, in the Negroni. Do not use dry vermouth or other variations of vermouth because it will ruin the taste of the drink. Add rye whiskey or bourbon instead of gin to make a Boulevardier. Measure out the rye whiskey and pour it into the glass. The best kinds of whiskey to use are a dry whiskey or bourbon since the vermouth and Campari are already sweet. Popular brands of rye whiskey include Bulleit, Rittenhouse, and Templeton Rye Whiskey. Popular brands of bourbons include Bulleit Bourbon, Old Forester, and Woodford Reserve. Keep your ingredients balanced 1-1-1. Whether you’re making a Negroni or a Boulevardier, it’s important to get the proportions of the ingredients right. Be sure to use 1 part gin (or whiskey) to 1 part Campari and 1 part sweet vermouth. The right balance will ensure that you can appreciate all the distinct flavors of the cocktail. Stir the glass with a spoon and drink it. Stir the Campari drink to incorporate all of the liquids together. Once all the ingredients are thoroughly stirred, serve the drink before the ice cubes melt. Serve and enjoy the drink immediately after stirring. Garnish the cocktail with an orange slice.",
    "sentences": [
        " Making Campari with Soda or Juice Put 3-4 large ice cubes into a rocks glass.",
        "Campari with soda or juice tastes best when chilled.",
        "Add the ice cubes to the glass before you pour in the liquids.",
        "Adding the ice first will ensure that the glass is chilled and your drink remains cold for a longer time.",
        "You can use either round or square ice cubes.",
        "If you are using smaller ice cubes, use more cubes.",
        "Pour 2  fl oz (59 ml) of Campari over the ice.",
        "Use a jigger or measuring cup to measure out the Campari.",
        "The best-tasting drink will be balanced, so it’s important to get the quantities of liquor to mixer correct.",
        "A jigger is a small measuring cup that is often used by bartenders and mixologists.",
        "Add 4  fl oz (120 ml) of soda or juice into the drink.",
        "Measure out the soda or juice with a jigger or measuring cup.",
        "Campari tastes best with bitter citrus juices like orange juice or grapefruit juice.",
        "If you're using soda, most people use seltzer water or a lighter soda, like ginger ale.",
        "Squeeze a slice of lemon or orange into the beverage.",
        "Cut a lemon or orange into quarters and squeeze one of the slices into your drink.",
        "This will add extra citrus notes to your drink.",
        "You can also use one of the wedges as a garnish for the drink.",
        "Mix the drink with a spoon and enjoy.",
        "Mixing the drink together will incorporate all of the liquids for an even drink.",
        "Take a sip of the drink and adjust the ingredients to your liking.",
        "Mixing a Classic Campari Cocktail Fill a glass with large ice cubes.",
        "A Negroni tastes best with ice.",
        "Put the ice cubes into the glass before you add the other liquors so that the glass is cold when you add the liquids.",
        "Use 2-3 ice cubes for this drink.",
        "Pour 1  fl oz (30 ml) of Campari into the glass.",
        "Carefully measure out 1  fl oz (30 ml) of Campari using a jigger or measuring cup.",
        "Then, pour the Campari over the ice in your glass.",
        "A well-balanced cocktail hinges on the even quantity of ingredients in the drink, so make sure to measure.",
        "Add 1  fl oz (30 ml) of gin into the glass.",
        "Measure out the gin with a jigger or measuring cup.",
        "Use a London dry gin to create a classic tasting Negroni or a floral accented gin, like Hendricks, to give the drink a more flowery flavor.",
        "Consider the differences in the tastes of the gin and use whatever variation you like the most.",
        "Popular brands of London dry gin include Beefeater and Tanqueray.",
        "Taste the gin on its own to get a better idea of how it will affect the taste of the drink.",
        "Pour 1  fl oz (30 ml) of sweet vermouth into the drink.",
        "Measure the sweet vermouth using a jigger or measuring cup.",
        "Use a sweet flavored vermouth, like Rosso Vermouth, in the Negroni.",
        "Do not use dry vermouth or other variations of vermouth because it will ruin the taste of the drink.",
        "Add rye whiskey or bourbon instead of gin to make a Boulevardier.",
        "Measure out the rye whiskey and pour it into the glass.",
        "The best kinds of whiskey to use are a dry whiskey or bourbon since the vermouth and Campari are already sweet.",
        "Popular brands of rye whiskey include Bulleit, Rittenhouse, and Templeton Rye Whiskey.",
        "Popular brands of bourbons include Bulleit Bourbon, Old Forester, and Woodford Reserve.",
        "Keep your ingredients balanced 1-1-1.",
        "Whether you’re making a Negroni or a Boulevardier, it’s important to get the proportions of the ingredients right.",
        "Be sure to use 1 part gin (or whiskey) to 1 part Campari and 1 part sweet vermouth.",
        "The right balance will ensure that you can appreciate all the distinct flavors of the cocktail.",
        "Stir the glass with a spoon and drink it.",
        "Stir the Campari drink to incorporate all of the liquids together.",
        "Once all the ingredients are thoroughly stirred, serve the drink before the ice cubes melt.",
        "Serve and enjoy the drink immediately after stirring.",
        "Garnish the cocktail with an orange slice."
    ]
}