{
    "title": "How to Survive Far Cry 2",
    "url": "https://www.wikihow.com/Survive-Far-Cry-2",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Video Games",
        "Multi Platform Games"
    ],
    "steps": [
        {
            "headline": "Ceasefire zones.",
            "description": "Most towns in the game are ceasefire zones, meaning, the soldiers there won't shoot at you; but do not shoot while in a zone (unless you want to create chaos) or all the soldiers will come after you."
        },
        {
            "headline": "Always be ready.",
            "description": "It's a dog-eat-dog game; even if you're cruising down a remote path, always look out for patrolling jeeps. They always attack you."
        },
        {
            "headline": "Check your map.",
            "description": "Your map shows guerrilla camps and safe-houses. If you are not looking for a fight, avoid the camps. Be warned, most intersections have camps."
        },
        {
            "headline": "Check your guns.",
            "description": "The Older your gun is, the more likely it will jam or even blow up. Always visit the gun dealers and get fresh guns and ammo."
        },
        {
            "headline": "Plan your arsenal.",
            "description": "Be smart about gun combos. Most sniper rifles won't do well in a firefight, so a good combo is a handgun, a sniper and a machine gun. See point 6."
        },
        {
            "headline": "Save bullets.",
            "description": "It will happen that you'll just injure an enemy. If this happens, they will be vulnerable for a moment. In that time, kill them using your handgun so that you can save bullets for your main gun. If you don't kill them, they'll get up and start shooting again."
        },
        {
            "headline": "Listen.",
            "description": "This point can really save your skin in later parts of the game. If you're hiding, listen to what they are saying and listen from which way it's coming from. Later in the game, they will begin using mortars. They normally use it when you're in a vehicle. They are very accurate and if you don't pay attention, you'll be blown to bits. Only way you'll know if one's coming is by the whistle it gives off. If you hear it, turn as fast as you can and head in another direction."
        },
        {
            "headline": "Stealth.",
            "description": "Stealth is always on your side. If you ever watched the predator movies, you can get a good feeling of being one by playing Far Cry 2. Stalk your enemies, use tall grass, rocks and buildings to hide. This way, you can pick your enemies off one by one; they sometimes begin to panic."
        },
        {
            "headline": "It's Africa.",
            "description": "Use your environment; set everything on fire and flush them out."
        }
    ],
    "tyn": [
        "Farcry 2",
        "A system to play it on (PC, Xbox etc.)"
    ],
    "text": " Ceasefire zones. Most towns in the game are ceasefire zones, meaning, the soldiers there won't shoot at you; but do not shoot while in a zone (unless you want to create chaos) or all the soldiers will come after you. Always be ready. It's a dog-eat-dog game; even if you're cruising down a remote path, always look out for patrolling jeeps. They always attack you. Check your map. Your map shows guerrilla camps and safe-houses. If you are not looking for a fight, avoid the camps. Be warned, most intersections have camps. Check your guns. The Older your gun is, the more likely it will jam or even blow up. Always visit the gun dealers and get fresh guns and ammo. Plan your arsenal. Be smart about gun combos. Most sniper rifles won't do well in a firefight, so a good combo is a handgun, a sniper and a machine gun. See point 6. Save bullets. It will happen that you'll just injure an enemy. If this happens, they will be vulnerable for a moment. In that time, kill them using your handgun so that you can save bullets for your main gun. If you don't kill them, they'll get up and start shooting again. Listen. This point can really save your skin in later parts of the game. If you're hiding, listen to what they are saying and listen from which way it's coming from. Later in the game, they will begin using mortars. They normally use it when you're in a vehicle. They are very accurate and if you don't pay attention, you'll be blown to bits. Only way you'll know if one's coming is by the whistle it gives off. If you hear it, turn as fast as you can and head in another direction. Stealth. Stealth is always on your side. If you ever watched the predator movies, you can get a good feeling of being one by playing Far Cry 2. Stalk your enemies, use tall grass, rocks and buildings to hide. This way, you can pick your enemies off one by one; they sometimes begin to panic. It's Africa. Use your environment; set everything on fire and flush them out.",
    "sentences": [
        " Ceasefire zones.",
        "Most towns in the game are ceasefire zones, meaning, the soldiers there won't shoot at you; but do not shoot while in a zone (unless you want to create chaos) or all the soldiers will come after you.",
        "Always be ready.",
        "It's a dog-eat-dog game; even if you're cruising down a remote path, always look out for patrolling jeeps.",
        "They always attack you.",
        "Check your map.",
        "Your map shows guerrilla camps and safe-houses.",
        "If you are not looking for a fight, avoid the camps.",
        "Be warned, most intersections have camps.",
        "Check your guns.",
        "The Older your gun is, the more likely it will jam or even blow up.",
        "Always visit the gun dealers and get fresh guns and ammo.",
        "Plan your arsenal.",
        "Be smart about gun combos.",
        "Most sniper rifles won't do well in a firefight, so a good combo is a handgun, a sniper and a machine gun.",
        "See point 6.",
        "Save bullets.",
        "It will happen that you'll just injure an enemy.",
        "If this happens, they will be vulnerable for a moment.",
        "In that time, kill them using your handgun so that you can save bullets for your main gun.",
        "If you don't kill them, they'll get up and start shooting again.",
        "Listen.",
        "This point can really save your skin in later parts of the game.",
        "If you're hiding, listen to what they are saying and listen from which way it's coming from.",
        "Later in the game, they will begin using mortars.",
        "They normally use it when you're in a vehicle.",
        "They are very accurate and if you don't pay attention, you'll be blown to bits.",
        "Only way you'll know if one's coming is by the whistle it gives off.",
        "If you hear it, turn as fast as you can and head in another direction.",
        "Stealth.",
        "Stealth is always on your side.",
        "If you ever watched the predator movies, you can get a good feeling of being one by playing Far Cry 2.",
        "Stalk your enemies, use tall grass, rocks and buildings to hide.",
        "This way, you can pick your enemies off one by one; they sometimes begin to panic.",
        "It's Africa.",
        "Use your environment; set everything on fire and flush them out."
    ]
}