{
    "title": "How to Do a Romanian Deadlift",
    "url": "https://www.wikihow.com/Do-a-Romanian-Deadlift",
    "category_hierarchy": [
        "Health",
        "Musculoskeletal System Health",
        "Back and Spine Health",
        "Back Exercises"
    ],
    "parts": [
        {
            "name": "Setting up the Exercise",
            "steps": [
                {
                    "headline": "Have a spotter help you if you are new to lifting.",
                    "description": "Take precautions as you learn the proper form for the exercise. Lifting heavy weights can be a little intimidating or even risky if you do it wrong. A spotter can check your form and give you feedback to help you avoid injuries as you exercise. Another way to practice is to use a bar without weights. Using the bar gives you an opportunity to refine your form without putting stress on your knees and back."
                },
                {
                    "headline": "Start with a barbell on the floor or on a weight rack.",
                    "description": "Load the barbell with the amount of weight you think you can manage. Make sure the weight plates are firmly in place on the bar. You don’t need to have a weight rack to do deadlifts, but it can make the process a little easier. If you don’t have a rack, you will need to lift the bar up to the starting position. A lot of gyms have tall racks you can rest barbells on. Position the barbell so it is near your thighs. That way, you don’t need to bend down to reach it."
                },
                {
                    "headline": "Get close to the bar so your shoulders hang over it.",
                    "description": "Point your feet towards the bar and step forward. If the barbell is on the floor, it will be at about shin height. If you are too far away from the bar, you will end up leaning forward to reach it. This can throw your back out of alignment, so get as close as possible before you lift the weight."
                },
                {
                    "headline": "Stand with your feet shoulder width apart and your knees slightly bent.",
                    "description": "Stand as close to the bar as you can get. Maintain this general position throughout the deadlift at all times. Keeping your knees slightly bent prevents them from locking up, which is an important part of avoiding strain on your body."
                },
                {
                    "headline": "Hold the bar with a double overhand grip.",
                    "description": "Position your hands right beside your legs. Grasp the barbell with your palms facing downward. The overhand grip is the standard grip used for deadlifts, but you can customize it a little if you feel comfortable doing so. Some lifters prefer an alternate or mixed grip. They place 1 hand underneath the bar while the other hand stays in the overhand grip position."
                },
                {
                    "headline": "Engage and flex your muscles to maintain a neutral position.",
                    "description": "The muscles in your shoulders, upper back, and abs must all be engaged while you lift the barbell. This allows you to keep good form as you lift and lower the weight. Keeping your muscles flexed and engaged helps you maintain control."
                }
            ]
        },
        {
            "name": "Raising the Bar",
            "steps": [
                {
                    "headline": "Start with a conventional deadlift.",
                    "description": "The Romanian deadlift is an exercise that supports the conventional deadlift. It helps you build up to a larger deadlift at the end of the day. To get into the proper position for a Romanian deadlift, you first need to raise the bar to your hips using a conventional deadlift. The conventional deadlift is a compound exercise, which means you're moving both your knees and your hips. The Romanian deadlift is an isolated exercise, which means you are only moving your hips. You may feel tempted to stand up quickly and let your back handle the load. This can strain your back or knees, leading to injuries. Complete the motion slowly and methodically to avoid problems."
                },
                {
                    "headline": "Stand with your feet inside your hip bones.",
                    "description": "The conventional deadlift is different than other deadlifts because your feet are narrow and inside your hips bones. Place your hands on the outside of your legs when you hold the bar. Keep the bar as close to your body as possible. Never let it move away from you or else it will throw your spine out of alignment."
                },
                {
                    "headline": "Stand up tall with your back and neck straight.",
                    "description": "The barbell should rest at the top of your thighs. You are in the start position for a Romanian deadlift."
                }
            ]
        },
        {
            "name": "Lowering the Barbell",
            "steps": [
                {
                    "headline": "Hold the bar near the top of your thighs.",
                    "description": "This is the Romanian deadlift’s starting position. You return the bar to this position at the end of each repetition. Make sure the bar is as close to your thighs as you can get it. Keep your shoulders positioned over the bar. Always start with the bar on the ground, lift it up using a conventional deadlift squat before doing a Romanian deadlift. Squat down over the bar. Bend your knees, keeping your arms and back straight, then stand back up while holding the bar."
                },
                {
                    "headline": "Look straight ahead of you and brace your core.",
                    "description": "Press your arms against your sides as you prepare to lower the barbell. Always stand tall with your neck and back straight. When you’re ready to begin, take a deep breath. Resist the temptation to look down at the bar as you move it. If you wish to check your form while doing the exercise, stand in front of a mirror. You can also have a spotter watch you and give you feedback."
                },
                {
                    "headline": "Bend at the waist while pushing your hips back.",
                    "description": "Go slowly to avoid injuring your back. To lower the bar safely, bend forward over the bar. Keep your arms and legs still. Move your hips and butt as far back as they can go. In a Romanian deadlift, you're only moving one joint, your hips Your knees don't move once you start the movement. Avoid bending your back. Shifting your spinal alignment is dangerous. Let your hips control the motion."
                },
                {
                    "headline": "Lower the bar until you feel the backs of your legs stretch.",
                    "description": "Keep the bar close to your legs as if you’re rolling the bar down them towards your ankles. Drop the bar down until you can’t go any further without bending your knees more. For most people, this will be when the bar is right below their knees. Remember that the Romanian deadlift isn’t a contest to see who can lower the bar to the floor. Lowering the bar too much takes the pressure off your hamstrings and puts it on your knees and back. To get the greatest results, pay attention to your body so you don’t go beyond your range of motion. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaila Ajani\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFitness Trainer\t\t\t\t\t\t\t\tLaila Ajani is a Fitness Trainer and founder of Push Personal Fitness, a personal training organization based in the San Francisco Bay Area. Laila has expertise in competitive athletics (gymnastics, powerlifting, and tennis), personal training, distance running, and Olympic lifting. Laila is certified by the National Strength & Conditioning Association (NSCA), USA Powerlifting (USAPL), and she is a Corrective Exercise Specialist (CES). Laila Ajani\t\t\tFitness Trainer\t\t\t\tKeep your back straight as you bend down. How deep you can go on a Romanian deadlift depends on the flexibility of your hamstrings. If your hamstrings reach their limit, don't keep descending by curving your back—in this exercise, you really don't want you back to curve at all."
                }
            ]
        }
    ],
    "tyn": [
        "Barbell",
        "Weights",
        "Shoes with good traction",
        "A weight rack (optional)"
    ],
    "text": " Setting up the Exercise Have a spotter help you if you are new to lifting. Take precautions as you learn the proper form for the exercise. Lifting heavy weights can be a little intimidating or even risky if you do it wrong. A spotter can check your form and give you feedback to help you avoid injuries as you exercise. Another way to practice is to use a bar without weights. Using the bar gives you an opportunity to refine your form without putting stress on your knees and back. Start with a barbell on the floor or on a weight rack. Load the barbell with the amount of weight you think you can manage. Make sure the weight plates are firmly in place on the bar. You don’t need to have a weight rack to do deadlifts, but it can make the process a little easier. If you don’t have a rack, you will need to lift the bar up to the starting position. A lot of gyms have tall racks you can rest barbells on. Position the barbell so it is near your thighs. That way, you don’t need to bend down to reach it. Get close to the bar so your shoulders hang over it. Point your feet towards the bar and step forward. If the barbell is on the floor, it will be at about shin height. If you are too far away from the bar, you will end up leaning forward to reach it. This can throw your back out of alignment, so get as close as possible before you lift the weight. Stand with your feet shoulder width apart and your knees slightly bent. Stand as close to the bar as you can get. Maintain this general position throughout the deadlift at all times. Keeping your knees slightly bent prevents them from locking up, which is an important part of avoiding strain on your body. Hold the bar with a double overhand grip. Position your hands right beside your legs. Grasp the barbell with your palms facing downward. The overhand grip is the standard grip used for deadlifts, but you can customize it a little if you feel comfortable doing so. Some lifters prefer an alternate or mixed grip. They place 1 hand underneath the bar while the other hand stays in the overhand grip position. Engage and flex your muscles to maintain a neutral position. The muscles in your shoulders, upper back, and abs must all be engaged while you lift the barbell. This allows you to keep good form as you lift and lower the weight. Keeping your muscles flexed and engaged helps you maintain control. Raising the Bar Start with a conventional deadlift. The Romanian deadlift is an exercise that supports the conventional deadlift. It helps you build up to a larger deadlift at the end of the day. To get into the proper position for a Romanian deadlift, you first need to raise the bar to your hips using a conventional deadlift. The conventional deadlift is a compound exercise, which means you're moving both your knees and your hips. The Romanian deadlift is an isolated exercise, which means you are only moving your hips. You may feel tempted to stand up quickly and let your back handle the load. This can strain your back or knees, leading to injuries. Complete the motion slowly and methodically to avoid problems. Stand with your feet inside your hip bones. The conventional deadlift is different than other deadlifts because your feet are narrow and inside your hips bones. Place your hands on the outside of your legs when you hold the bar. Keep the bar as close to your body as possible. Never let it move away from you or else it will throw your spine out of alignment. Stand up tall with your back and neck straight. The barbell should rest at the top of your thighs. You are in the start position for a Romanian deadlift. Lowering the Barbell Hold the bar near the top of your thighs. This is the Romanian deadlift’s starting position. You return the bar to this position at the end of each repetition. Make sure the bar is as close to your thighs as you can get it. Keep your shoulders positioned over the bar. Always start with the bar on the ground, lift it up using a conventional deadlift squat before doing a Romanian deadlift. Squat down over the bar. Bend your knees, keeping your arms and back straight, then stand back up while holding the bar. Look straight ahead of you and brace your core. Press your arms against your sides as you prepare to lower the barbell. Always stand tall with your neck and back straight. When you’re ready to begin, take a deep breath. Resist the temptation to look down at the bar as you move it. If you wish to check your form while doing the exercise, stand in front of a mirror. You can also have a spotter watch you and give you feedback. Bend at the waist while pushing your hips back. Go slowly to avoid injuring your back. To lower the bar safely, bend forward over the bar. Keep your arms and legs still. Move your hips and butt as far back as they can go. In a Romanian deadlift, you're only moving one joint, your hips Your knees don't move once you start the movement. Avoid bending your back. Shifting your spinal alignment is dangerous. Let your hips control the motion. Lower the bar until you feel the backs of your legs stretch. Keep the bar close to your legs as if you’re rolling the bar down them towards your ankles. Drop the bar down until you can’t go any further without bending your knees more. For most people, this will be when the bar is right below their knees. Remember that the Romanian deadlift isn’t a contest to see who can lower the bar to the floor. Lowering the bar too much takes the pressure off your hamstrings and puts it on your knees and back. To get the greatest results, pay attention to your body so you don’t go beyond your range of motion. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaila Ajani\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFitness Trainer\t\t\t\t\t\t\t\tLaila Ajani is a Fitness Trainer and founder of Push Personal Fitness, a personal training organization based in the San Francisco Bay Area. Laila has expertise in competitive athletics (gymnastics, powerlifting, and tennis), personal training, distance running, and Olympic lifting. Laila is certified by the National Strength & Conditioning Association (NSCA), USA Powerlifting (USAPL), and she is a Corrective Exercise Specialist (CES). Laila Ajani\t\t\tFitness Trainer\t\t\t\tKeep your back straight as you bend down. How deep you can go on a Romanian deadlift depends on the flexibility of your hamstrings. If your hamstrings reach their limit, don't keep descending by curving your back—in this exercise, you really don't want you back to curve at all.",
    "sentences": [
        " Setting up the Exercise Have a spotter help you if you are new to lifting.",
        "Take precautions as you learn the proper form for the exercise.",
        "Lifting heavy weights can be a little intimidating or even risky if you do it wrong.",
        "A spotter can check your form and give you feedback to help you avoid injuries as you exercise.",
        "Another way to practice is to use a bar without weights.",
        "Using the bar gives you an opportunity to refine your form without putting stress on your knees and back.",
        "Start with a barbell on the floor or on a weight rack.",
        "Load the barbell with the amount of weight you think you can manage.",
        "Make sure the weight plates are firmly in place on the bar.",
        "You don’t need to have a weight rack to do deadlifts, but it can make the process a little easier.",
        "If you don’t have a rack, you will need to lift the bar up to the starting position.",
        "A lot of gyms have tall racks you can rest barbells on.",
        "Position the barbell so it is near your thighs.",
        "That way, you don’t need to bend down to reach it.",
        "Get close to the bar so your shoulders hang over it.",
        "Point your feet towards the bar and step forward.",
        "If the barbell is on the floor, it will be at about shin height.",
        "If you are too far away from the bar, you will end up leaning forward to reach it.",
        "This can throw your back out of alignment, so get as close as possible before you lift the weight.",
        "Stand with your feet shoulder width apart and your knees slightly bent.",
        "Stand as close to the bar as you can get.",
        "Maintain this general position throughout the deadlift at all times.",
        "Keeping your knees slightly bent prevents them from locking up, which is an important part of avoiding strain on your body.",
        "Hold the bar with a double overhand grip.",
        "Position your hands right beside your legs.",
        "Grasp the barbell with your palms facing downward.",
        "The overhand grip is the standard grip used for deadlifts, but you can customize it a little if you feel comfortable doing so.",
        "Some lifters prefer an alternate or mixed grip.",
        "They place 1 hand underneath the bar while the other hand stays in the overhand grip position.",
        "Engage and flex your muscles to maintain a neutral position.",
        "The muscles in your shoulders, upper back, and abs must all be engaged while you lift the barbell.",
        "This allows you to keep good form as you lift and lower the weight.",
        "Keeping your muscles flexed and engaged helps you maintain control.",
        "Raising the Bar Start with a conventional deadlift.",
        "The Romanian deadlift is an exercise that supports the conventional deadlift.",
        "It helps you build up to a larger deadlift at the end of the day.",
        "To get into the proper position for a Romanian deadlift, you first need to raise the bar to your hips using a conventional deadlift.",
        "The conventional deadlift is a compound exercise, which means you're moving both your knees and your hips.",
        "The Romanian deadlift is an isolated exercise, which means you are only moving your hips.",
        "You may feel tempted to stand up quickly and let your back handle the load.",
        "This can strain your back or knees, leading to injuries.",
        "Complete the motion slowly and methodically to avoid problems.",
        "Stand with your feet inside your hip bones.",
        "The conventional deadlift is different than other deadlifts because your feet are narrow and inside your hips bones.",
        "Place your hands on the outside of your legs when you hold the bar.",
        "Keep the bar as close to your body as possible.",
        "Never let it move away from you or else it will throw your spine out of alignment.",
        "Stand up tall with your back and neck straight.",
        "The barbell should rest at the top of your thighs.",
        "You are in the start position for a Romanian deadlift.",
        "Lowering the Barbell Hold the bar near the top of your thighs.",
        "This is the Romanian deadlift’s starting position.",
        "You return the bar to this position at the end of each repetition.",
        "Make sure the bar is as close to your thighs as you can get it.",
        "Keep your shoulders positioned over the bar.",
        "Always start with the bar on the ground, lift it up using a conventional deadlift squat before doing a Romanian deadlift.",
        "Squat down over the bar.",
        "Bend your knees, keeping your arms and back straight, then stand back up while holding the bar.",
        "Look straight ahead of you and brace your core.",
        "Press your arms against your sides as you prepare to lower the barbell.",
        "Always stand tall with your neck and back straight.",
        "When you’re ready to begin, take a deep breath.",
        "Resist the temptation to look down at the bar as you move it.",
        "If you wish to check your form while doing the exercise, stand in front of a mirror.",
        "You can also have a spotter watch you and give you feedback.",
        "Bend at the waist while pushing your hips back.",
        "Go slowly to avoid injuring your back.",
        "To lower the bar safely, bend forward over the bar.",
        "Keep your arms and legs still.",
        "Move your hips and butt as far back as they can go.",
        "In a Romanian deadlift, you're only moving one joint, your hips Your knees don't move once you start the movement.",
        "Avoid bending your back.",
        "Shifting your spinal alignment is dangerous.",
        "Let your hips control the motion.",
        "Lower the bar until you feel the backs of your legs stretch.",
        "Keep the bar close to your legs as if you’re rolling the bar down them towards your ankles.",
        "Drop the bar down until you can’t go any further without bending your knees more.",
        "For most people, this will be when the bar is right below their knees.",
        "Remember that the Romanian deadlift isn’t a contest to see who can lower the bar to the floor.",
        "Lowering the bar too much takes the pressure off your hamstrings and puts it on your knees and back.",
        "To get the greatest results, pay attention to your body so you don’t go beyond your range of motion.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaila Ajani\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFitness Trainer\t\t\t\t\t\t\t\tLaila Ajani is a Fitness Trainer and founder of Push Personal Fitness, a personal training organization based in the San Francisco Bay Area.",
        "Laila has expertise in competitive athletics (gymnastics, powerlifting, and tennis), personal training, distance running, and Olympic lifting.",
        "Laila is certified by the National Strength & Conditioning Association (NSCA), USA Powerlifting (USAPL), and she is a Corrective Exercise Specialist (CES).",
        "Laila Ajani\t\t\tFitness Trainer\t\t\t\tKeep your back straight as you bend down.",
        "How deep you can go on a Romanian deadlift depends on the flexibility of your hamstrings.",
        "If your hamstrings reach their limit, don't keep descending by curving your back—in this exercise, you really don't want you back to curve at all."
    ]
}