{
    "title": "How to Unclog a Main Sewer Line Without a Snake",
    "url": "https://www.wikihow.com/Unclog-a-Main-Sewer-Line-Without-a-Snake",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "methods": [
        {
            "name": "Preparing to Unclog the Line",
            "steps": [
                {
                    "headline": "Determine the cause or source of the clog if possible.",
                    "description": "Unless you have a professional plumbing service come and thread a video monitor down your pipe, it’s difficult to know for sure what or where your clog is in the line. However, if you dump grease down your drain all the time, or if there are giant trees right near your sewer line, you may be able to form an educated guess. Common Causes Of a Clogged Main Sewer Line\nIf you often pour cooking oil into the sink, you likely have a buildup of grease or fat. If you flush feminine hygiene products or cotton swabs down the toilet, they don't dissolve in water and instead get stuck in the pipes. If you have large trees growing in your front yard, the roots can eat through the pipe and block the sewer line. If your house is over 50 years old, you may need a new sewer line, since the pipes can rust and deteriorate over time."
                },
                {
                    "headline": "Run hot water through your pipes if you have a partial clog.",
                    "description": "If you can still flush your toilet or if water is still draining down the sink, you may just have partially clogged pipes. Turn your water on as hot as it will go and let it run for 5 to 10 minutes to dissolve or break up the clog. You can also replace the water in your toilet tank with hot water, then flush it. Do this once a week as a preventative measure if you want to avoid fully clogged pipes."
                },
                {
                    "headline": "Turn off all the water to your home to prevent further buildup.",
                    "description": "If you keep flushing the toilet or running the water in the sink, the clog will just get worse. Shut off the main water valve so whatever’s left in the pipes can drain out and no more water can come into the house. A house’s main water valve is often located in the basement or on an exterior wall. If you aren’t sure where it is, look for the water meter, which is often in the front yard under a cement or iron lid. Lift the lid to find the meter and look for the main water valve, which should be close by."
                },
                {
                    "headline": "Locate the sewer cleanout and open it up.",
                    "description": "This is the entryway to the main sewer line, and is usually situated just outside the front of your house, in between your home and the city sewer line. Once you find it, unscrew the cap to open it. Sewer cleanouts might also be in a garage or basement. Look for a piece of pipe that’s about 4 inches (10 cm) in diameter and that usually has a cap with a square knob or indentation."
                }
            ]
        },
        {
            "name": "Using a Power Washer",
            "steps": [
                {
                    "headline": "Put on protective glasses and rubber gloves.",
                    "description": "These will protect your eyes and skin from any debris or wastewater that might come out of the line. Water that’s been contaminated by sewage can carry harmful bacteria and diseases so do your best to avoid exposing your skin to it. If any wastewater gets on you, wash and sanitize the area immediately with soap and hot water. If you notice any symptoms like vomiting or diarrhea after you had contact with sewer water, contact your doctor or urgent care."
                },
                {
                    "headline": "Attach the sewer jetter securely to the power washer trigger gun.",
                    "description": "A sewer jetter attachment looks like a long hose with a nozzle at 1 end. Screw the other end tightly onto the trigger gun or spray wand of your power washer. You can rent a sewer jetter attachment from most hardware stores if you don’t want to buy your own. There are longer and shorter hoses available, depending on the length of your line."
                },
                {
                    "headline": "Lower the nozzle at least 1 foot (0.30 m) down the pipe.",
                    "description": "Do this before you turn on the power washer or start spraying. Slowly thread the sewer jetter into the sewer cleanout opening far enough so that the water won’t splash up on you. The further you can insert the nozzle down the drain, the better."
                },
                {
                    "headline": "Spray the water into the drain, continuing to feed the hose down the pipe.",
                    "description": "When you first turn on the power washer and pull the trigger, you’ll feel a slight tug on the hose as it gets pulled downwards. Lower the hose while you spray so that it works its way through the entire sewer line to find the clog. If the hose hits a pipe tee or an elbow, pull the attachment up slightly, then attempt to thread it through again. Wiggle it around until it continues down the pipe. Pulsing your finger on the trigger can also help propel the hose through the line."
                },
                {
                    "headline": "Listen for the the sound of the clog clearing.",
                    "description": "It should sound like a rush of liquid running through the pipes. When you hear that, you’ll know that you’ve successfully unclogged the line. Step away from the cleanout opening when you hear the clog burst. There’s a good chance some wastewater might splash out."
                },
                {
                    "headline": "Turn off the power washer and pull the hose out of the pipe.",
                    "description": "Before removing the sewer jetter from the pipe, make sure the power washer is off and no water is spraying out. Carefully pull up the hose and detach it from the power washer. To clean the sewer jetter attachment, use the gentle setting on your power washer to spray it off. Wipe down the power washer with soap and warm water to sanitize it before putting it away. Return the sewer jetter to the store if you rented it. If you bought it, store the attachment somewhere out of reach of kids and pets. Don’t forget to close up the sewer cleanout opening when you’re finished."
                }
            ]
        },
        {
            "name": "Clearing the Clog with Liquids",
            "steps": [
                {
                    "headline": "Mix baking soda and vinegar if a buildup of grease is clogging your line.",
                    "description": "Since baking soda is slightly caustic, it will eat away at any grease on the pipes. Combine 1 part baking soda and 1 part vinegar, then pour it into the sewer cleanout opening. Wait at least 1 hour before flushing it with hot water. The baking soda and vinegar will start reacting and fizzing immediately. Pour it into the pipe as quickly as possible. You can use any type of vinegar. However, white vinegar is the most commonly used."
                },
                {
                    "headline": "Opt for hydrogen peroxide to prevent future clogs from forming.",
                    "description": "The hydrogen peroxide you keep in your medicine cabinet eats away at clogs and kills off any growth on the inside of pipes, which makes it more difficult for clogs to occur later on. After putting it into the sewer line, wait 2 to 3 hours, then run hot water into the pipes. For an extra strong cleaner, combine 1 part hydrogen peroxide with 1 part baking soda before pouring it into the sewer line. Wear gloves and protective glasses when you’re using hydrogen peroxide. It is very harsh on your skin and should never come in contact with your mouth or eyes."
                },
                {
                    "headline": "Use a chemical drain cleaner with extreme caution if nothing else works.",
                    "description": "Pouring chemicals down your line is very risky as it can damage the pipes. Make sure that you follow the directions on the bottle very closely. After pouring in the cleaner, wait 15 minutes before flushing the system with hot water. Always wear protective eyewear and gloves when handling harsh chemicals. If any of the substance gets on you, it could irritate or burn your skin. Never mix chemical cleaners together or use more than 1 kind on your drain. It could cause a reaction. How to Choose a Chemical Cleaner\nIf your clog is caused by grease, use a caustic cleaner, which contains potash or lye and will burn the clog. If you think that invasive tree roots are the cause of your clog, opt for copper sulfate. This is poisonous to roots and should kill them within 1 week. For all other clogs, opt for an oxidizing cleaner, which has bleach or nitrates. These cleaners dissolve food and other particles to clear clogs."
                }
            ]
        }
    ],
    "tyn": [
        "Using a Power Washer",
        "Power washer",
        "Sewer jetter attachment",
        "Protective eyewear",
        "Rubber gloves"
    ],
    "text": " Preparing to Unclog the Line Determine the cause or source of the clog if possible. Unless you have a professional plumbing service come and thread a video monitor down your pipe, it’s difficult to know for sure what or where your clog is in the line. However, if you dump grease down your drain all the time, or if there are giant trees right near your sewer line, you may be able to form an educated guess. Common Causes Of a Clogged Main Sewer Line\nIf you often pour cooking oil into the sink, you likely have a buildup of grease or fat. If you flush feminine hygiene products or cotton swabs down the toilet, they don't dissolve in water and instead get stuck in the pipes. If you have large trees growing in your front yard, the roots can eat through the pipe and block the sewer line. If your house is over 50 years old, you may need a new sewer line, since the pipes can rust and deteriorate over time. Run hot water through your pipes if you have a partial clog. If you can still flush your toilet or if water is still draining down the sink, you may just have partially clogged pipes. Turn your water on as hot as it will go and let it run for 5 to 10 minutes to dissolve or break up the clog. You can also replace the water in your toilet tank with hot water, then flush it. Do this once a week as a preventative measure if you want to avoid fully clogged pipes. Turn off all the water to your home to prevent further buildup. If you keep flushing the toilet or running the water in the sink, the clog will just get worse. Shut off the main water valve so whatever’s left in the pipes can drain out and no more water can come into the house. A house’s main water valve is often located in the basement or on an exterior wall. If you aren’t sure where it is, look for the water meter, which is often in the front yard under a cement or iron lid. Lift the lid to find the meter and look for the main water valve, which should be close by. Locate the sewer cleanout and open it up. This is the entryway to the main sewer line, and is usually situated just outside the front of your house, in between your home and the city sewer line. Once you find it, unscrew the cap to open it. Sewer cleanouts might also be in a garage or basement. Look for a piece of pipe that’s about 4 inches (10 cm) in diameter and that usually has a cap with a square knob or indentation. Using a Power Washer Put on protective glasses and rubber gloves. These will protect your eyes and skin from any debris or wastewater that might come out of the line. Water that’s been contaminated by sewage can carry harmful bacteria and diseases so do your best to avoid exposing your skin to it. If any wastewater gets on you, wash and sanitize the area immediately with soap and hot water. If you notice any symptoms like vomiting or diarrhea after you had contact with sewer water, contact your doctor or urgent care. Attach the sewer jetter securely to the power washer trigger gun. A sewer jetter attachment looks like a long hose with a nozzle at 1 end. Screw the other end tightly onto the trigger gun or spray wand of your power washer. You can rent a sewer jetter attachment from most hardware stores if you don’t want to buy your own. There are longer and shorter hoses available, depending on the length of your line. Lower the nozzle at least 1 foot (0.30 m) down the pipe. Do this before you turn on the power washer or start spraying. Slowly thread the sewer jetter into the sewer cleanout opening far enough so that the water won’t splash up on you. The further you can insert the nozzle down the drain, the better. Spray the water into the drain, continuing to feed the hose down the pipe. When you first turn on the power washer and pull the trigger, you’ll feel a slight tug on the hose as it gets pulled downwards. Lower the hose while you spray so that it works its way through the entire sewer line to find the clog. If the hose hits a pipe tee or an elbow, pull the attachment up slightly, then attempt to thread it through again. Wiggle it around until it continues down the pipe. Pulsing your finger on the trigger can also help propel the hose through the line. Listen for the the sound of the clog clearing. It should sound like a rush of liquid running through the pipes. When you hear that, you’ll know that you’ve successfully unclogged the line. Step away from the cleanout opening when you hear the clog burst. There’s a good chance some wastewater might splash out. Turn off the power washer and pull the hose out of the pipe. Before removing the sewer jetter from the pipe, make sure the power washer is off and no water is spraying out. Carefully pull up the hose and detach it from the power washer. To clean the sewer jetter attachment, use the gentle setting on your power washer to spray it off. Wipe down the power washer with soap and warm water to sanitize it before putting it away. Return the sewer jetter to the store if you rented it. If you bought it, store the attachment somewhere out of reach of kids and pets. Don’t forget to close up the sewer cleanout opening when you’re finished. Clearing the Clog with Liquids Mix baking soda and vinegar if a buildup of grease is clogging your line. Since baking soda is slightly caustic, it will eat away at any grease on the pipes. Combine 1 part baking soda and 1 part vinegar, then pour it into the sewer cleanout opening. Wait at least 1 hour before flushing it with hot water. The baking soda and vinegar will start reacting and fizzing immediately. Pour it into the pipe as quickly as possible. You can use any type of vinegar. However, white vinegar is the most commonly used. Opt for hydrogen peroxide to prevent future clogs from forming. The hydrogen peroxide you keep in your medicine cabinet eats away at clogs and kills off any growth on the inside of pipes, which makes it more difficult for clogs to occur later on. After putting it into the sewer line, wait 2 to 3 hours, then run hot water into the pipes. For an extra strong cleaner, combine 1 part hydrogen peroxide with 1 part baking soda before pouring it into the sewer line. Wear gloves and protective glasses when you’re using hydrogen peroxide. It is very harsh on your skin and should never come in contact with your mouth or eyes. Use a chemical drain cleaner with extreme caution if nothing else works. Pouring chemicals down your line is very risky as it can damage the pipes. Make sure that you follow the directions on the bottle very closely. After pouring in the cleaner, wait 15 minutes before flushing the system with hot water. Always wear protective eyewear and gloves when handling harsh chemicals. If any of the substance gets on you, it could irritate or burn your skin. Never mix chemical cleaners together or use more than 1 kind on your drain. It could cause a reaction. How to Choose a Chemical Cleaner\nIf your clog is caused by grease, use a caustic cleaner, which contains potash or lye and will burn the clog. If you think that invasive tree roots are the cause of your clog, opt for copper sulfate. This is poisonous to roots and should kill them within 1 week. For all other clogs, opt for an oxidizing cleaner, which has bleach or nitrates. These cleaners dissolve food and other particles to clear clogs.",
    "sentences": [
        " Preparing to Unclog the Line Determine the cause or source of the clog if possible.",
        "Unless you have a professional plumbing service come and thread a video monitor down your pipe, it’s difficult to know for sure what or where your clog is in the line.",
        "However, if you dump grease down your drain all the time, or if there are giant trees right near your sewer line, you may be able to form an educated guess.",
        "Common Causes Of a Clogged Main Sewer Line\nIf you often pour cooking oil into the sink, you likely have a buildup of grease or fat.",
        "If you flush feminine hygiene products or cotton swabs down the toilet, they don't dissolve in water and instead get stuck in the pipes.",
        "If you have large trees growing in your front yard, the roots can eat through the pipe and block the sewer line.",
        "If your house is over 50 years old, you may need a new sewer line, since the pipes can rust and deteriorate over time.",
        "Run hot water through your pipes if you have a partial clog.",
        "If you can still flush your toilet or if water is still draining down the sink, you may just have partially clogged pipes.",
        "Turn your water on as hot as it will go and let it run for 5 to 10 minutes to dissolve or break up the clog.",
        "You can also replace the water in your toilet tank with hot water, then flush it.",
        "Do this once a week as a preventative measure if you want to avoid fully clogged pipes.",
        "Turn off all the water to your home to prevent further buildup.",
        "If you keep flushing the toilet or running the water in the sink, the clog will just get worse.",
        "Shut off the main water valve so whatever’s left in the pipes can drain out and no more water can come into the house.",
        "A house’s main water valve is often located in the basement or on an exterior wall.",
        "If you aren’t sure where it is, look for the water meter, which is often in the front yard under a cement or iron lid.",
        "Lift the lid to find the meter and look for the main water valve, which should be close by.",
        "Locate the sewer cleanout and open it up.",
        "This is the entryway to the main sewer line, and is usually situated just outside the front of your house, in between your home and the city sewer line.",
        "Once you find it, unscrew the cap to open it.",
        "Sewer cleanouts might also be in a garage or basement.",
        "Look for a piece of pipe that’s about 4 inches (10 cm) in diameter and that usually has a cap with a square knob or indentation.",
        "Using a Power Washer Put on protective glasses and rubber gloves.",
        "These will protect your eyes and skin from any debris or wastewater that might come out of the line.",
        "Water that’s been contaminated by sewage can carry harmful bacteria and diseases so do your best to avoid exposing your skin to it.",
        "If any wastewater gets on you, wash and sanitize the area immediately with soap and hot water.",
        "If you notice any symptoms like vomiting or diarrhea after you had contact with sewer water, contact your doctor or urgent care.",
        "Attach the sewer jetter securely to the power washer trigger gun.",
        "A sewer jetter attachment looks like a long hose with a nozzle at 1 end.",
        "Screw the other end tightly onto the trigger gun or spray wand of your power washer.",
        "You can rent a sewer jetter attachment from most hardware stores if you don’t want to buy your own.",
        "There are longer and shorter hoses available, depending on the length of your line.",
        "Lower the nozzle at least 1 foot (0.30 m) down the pipe.",
        "Do this before you turn on the power washer or start spraying.",
        "Slowly thread the sewer jetter into the sewer cleanout opening far enough so that the water won’t splash up on you.",
        "The further you can insert the nozzle down the drain, the better.",
        "Spray the water into the drain, continuing to feed the hose down the pipe.",
        "When you first turn on the power washer and pull the trigger, you’ll feel a slight tug on the hose as it gets pulled downwards.",
        "Lower the hose while you spray so that it works its way through the entire sewer line to find the clog.",
        "If the hose hits a pipe tee or an elbow, pull the attachment up slightly, then attempt to thread it through again.",
        "Wiggle it around until it continues down the pipe.",
        "Pulsing your finger on the trigger can also help propel the hose through the line.",
        "Listen for the the sound of the clog clearing.",
        "It should sound like a rush of liquid running through the pipes.",
        "When you hear that, you’ll know that you’ve successfully unclogged the line.",
        "Step away from the cleanout opening when you hear the clog burst.",
        "There’s a good chance some wastewater might splash out.",
        "Turn off the power washer and pull the hose out of the pipe.",
        "Before removing the sewer jetter from the pipe, make sure the power washer is off and no water is spraying out.",
        "Carefully pull up the hose and detach it from the power washer.",
        "To clean the sewer jetter attachment, use the gentle setting on your power washer to spray it off.",
        "Wipe down the power washer with soap and warm water to sanitize it before putting it away.",
        "Return the sewer jetter to the store if you rented it.",
        "If you bought it, store the attachment somewhere out of reach of kids and pets.",
        "Don’t forget to close up the sewer cleanout opening when you’re finished.",
        "Clearing the Clog with Liquids Mix baking soda and vinegar if a buildup of grease is clogging your line.",
        "Since baking soda is slightly caustic, it will eat away at any grease on the pipes.",
        "Combine 1 part baking soda and 1 part vinegar, then pour it into the sewer cleanout opening.",
        "Wait at least 1 hour before flushing it with hot water.",
        "The baking soda and vinegar will start reacting and fizzing immediately.",
        "Pour it into the pipe as quickly as possible.",
        "You can use any type of vinegar.",
        "However, white vinegar is the most commonly used.",
        "Opt for hydrogen peroxide to prevent future clogs from forming.",
        "The hydrogen peroxide you keep in your medicine cabinet eats away at clogs and kills off any growth on the inside of pipes, which makes it more difficult for clogs to occur later on.",
        "After putting it into the sewer line, wait 2 to 3 hours, then run hot water into the pipes.",
        "For an extra strong cleaner, combine 1 part hydrogen peroxide with 1 part baking soda before pouring it into the sewer line.",
        "Wear gloves and protective glasses when you’re using hydrogen peroxide.",
        "It is very harsh on your skin and should never come in contact with your mouth or eyes.",
        "Use a chemical drain cleaner with extreme caution if nothing else works.",
        "Pouring chemicals down your line is very risky as it can damage the pipes.",
        "Make sure that you follow the directions on the bottle very closely.",
        "After pouring in the cleaner, wait 15 minutes before flushing the system with hot water.",
        "Always wear protective eyewear and gloves when handling harsh chemicals.",
        "If any of the substance gets on you, it could irritate or burn your skin.",
        "Never mix chemical cleaners together or use more than 1 kind on your drain.",
        "It could cause a reaction.",
        "How to Choose a Chemical Cleaner\nIf your clog is caused by grease, use a caustic cleaner, which contains potash or lye and will burn the clog.",
        "If you think that invasive tree roots are the cause of your clog, opt for copper sulfate.",
        "This is poisonous to roots and should kill them within 1 week.",
        "For all other clogs, opt for an oxidizing cleaner, which has bleach or nitrates.",
        "These cleaners dissolve food and other particles to clear clogs."
    ]
}