{
    "title": "How to Remove Jam or Jelly Stains from Carpet",
    "url": "https://www.wikihow.com/Remove-Jam-or-Jelly-Stains-from-Carpet",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Floors and Stairs",
        "Carpets and Rugs"
    ],
    "steps": [
        {
            "headline": "Scrape up excess jelly with a butter knife.",
            "description": "Gently scrape away the excess jelly as soon as possible after the stain sets. Use the dull edge of the knife, and remove as much of the jam as possible."
        },
        {
            "headline": "Decide how to treat the stain.",
            "description": "It's essential to use the right stain-removal techniques for a type of carpet. For example, natural fibers, such as wool or grass, can react badly to liquid stain removers (see the warning below concerning these chemicals), and you should always think twice before cleaning antique carpets or valuable rugs. If in doubt, call a professional carpet cleaner."
        },
        {
            "headline": "Spray some water on the stain.",
            "description": "Put some lukewarm--not hot--water in a spray bottle and lightly dampen the stain. You can also dab some water on the stain with a sponge."
        },
        {
            "headline": "Prepare the cleaning solution.",
            "description": "Add ¼ teaspoon mild, non-bleaching detergent or carpet shampoo to 1 liter (0.3 US gal) of cold water. Stir the solution in a bowl to mix thoroughly."
        },
        {
            "headline": "Test any cleaning solution in an inconspicuous spot.",
            "description": "Before you apply any cleaner--including the one in these directions--to your carpet, test the cleaner on a small patch where no one will see it. Wait a few minutes. If the cleaner discolors or otherwise adversely affects the carpet, remove it immediately with cold water and a sponge. If it ends up causing permanent damage, at least it won't be right in the middle of the room."
        },
        {
            "headline": "Apply the cleaning solution to the stain.",
            "description": "Moisten a clean, white cloth liberally with the cleaning solution, and simply lay the cloth over the stain."
        },
        {
            "headline": "Massage the cloth with a spoon.",
            "description": "Use the bottom of a spoon to gently press down on the cloth. Gradually work your way all over the cloth, starting on the outside and working your way toward the center in a spiral to prevent spreading the stain. This process works the solution into the carpet without rubbing the stain in or damaging the carpet fibers."
        },
        {
            "headline": "Blot the stain and apply more cleaning solution.",
            "description": "Blot the stain gently with a paper towel and apply the solution again as in the previous two steps. Keep reapplying and blotting until no trace of the stain is evident on the towel when you blot."
        },
        {
            "headline": "Make an alkaline solution if the stain persists.",
            "description": "Open windows to ventilate the room, and put on rubber gloves. Add 1 teaspoon household ammonia to a liter of warm water, and do a patch test as above. If no adverse reaction occurs, apply the solution with a cloth and massage it in as above."
        },
        {
            "headline": "Rinse the stain.",
            "description": "Lift the cloth off of the carpet, and spray warm water onto the stain. Alternatively, you may moisten a clean sponge with warm water and gently dab the stain."
        },
        {
            "headline": "Remove excess liquid.",
            "description": "Blot the stain with a clean dishtowel or sturdy paper towels. Blot, don't rub."
        },
        {
            "headline": "Neutralize the alkalinity only if you've used the ammonia solution.",
            "description": "Add a little white vinegar to a bowl of warm water. Perform a patch test. If no adverse reaction occurs on the patch, apply the neutralizing solution in the same way you applied the cleaning solutions. Blot with some paper towels."
        },
        {
            "headline": "Rinse the stain again.",
            "description": "Spray some warm water on the stain, and blot to remove excess moisture."
        },
        {
            "headline": "Dry the carpet.",
            "description": "Place a clean, dry dishtowel or sturdy paper towels over the damp spot. Place a plastic bag over them, and then place a heavy object, such as a large book, over the bag. Wait several hours or overnight before removing the towels. The stain should be gone and, because the drying process lifts even deep stains out, it won't reappear."
        }
    ],
    "tyn": [
        "Butter knife",
        "White cloths",
        "Paper towels",
        "Spray bottle",
        "Teaspoon",
        "Sponge",
        "Water",
        "Rubber gloves",
        "Mild non-bleaching detergent",
        "Bowl",
        "A heavy weight, (i.e. a book)",
        "Clear or white plastic bags",
        "Household ammonia"
    ],
    "text": " Scrape up excess jelly with a butter knife. Gently scrape away the excess jelly as soon as possible after the stain sets. Use the dull edge of the knife, and remove as much of the jam as possible. Decide how to treat the stain. It's essential to use the right stain-removal techniques for a type of carpet. For example, natural fibers, such as wool or grass, can react badly to liquid stain removers (see the warning below concerning these chemicals), and you should always think twice before cleaning antique carpets or valuable rugs. If in doubt, call a professional carpet cleaner. Spray some water on the stain. Put some lukewarm--not hot--water in a spray bottle and lightly dampen the stain. You can also dab some water on the stain with a sponge. Prepare the cleaning solution. Add ¼ teaspoon mild, non-bleaching detergent or carpet shampoo to 1 liter (0.3 US gal) of cold water. Stir the solution in a bowl to mix thoroughly. Test any cleaning solution in an inconspicuous spot. Before you apply any cleaner--including the one in these directions--to your carpet, test the cleaner on a small patch where no one will see it. Wait a few minutes. If the cleaner discolors or otherwise adversely affects the carpet, remove it immediately with cold water and a sponge. If it ends up causing permanent damage, at least it won't be right in the middle of the room. Apply the cleaning solution to the stain. Moisten a clean, white cloth liberally with the cleaning solution, and simply lay the cloth over the stain. Massage the cloth with a spoon. Use the bottom of a spoon to gently press down on the cloth. Gradually work your way all over the cloth, starting on the outside and working your way toward the center in a spiral to prevent spreading the stain. This process works the solution into the carpet without rubbing the stain in or damaging the carpet fibers. Blot the stain and apply more cleaning solution. Blot the stain gently with a paper towel and apply the solution again as in the previous two steps. Keep reapplying and blotting until no trace of the stain is evident on the towel when you blot. Make an alkaline solution if the stain persists. Open windows to ventilate the room, and put on rubber gloves. Add 1 teaspoon household ammonia to a liter of warm water, and do a patch test as above. If no adverse reaction occurs, apply the solution with a cloth and massage it in as above. Rinse the stain. Lift the cloth off of the carpet, and spray warm water onto the stain. Alternatively, you may moisten a clean sponge with warm water and gently dab the stain. Remove excess liquid. Blot the stain with a clean dishtowel or sturdy paper towels. Blot, don't rub. Neutralize the alkalinity only if you've used the ammonia solution. Add a little white vinegar to a bowl of warm water. Perform a patch test. If no adverse reaction occurs on the patch, apply the neutralizing solution in the same way you applied the cleaning solutions. Blot with some paper towels. Rinse the stain again. Spray some warm water on the stain, and blot to remove excess moisture. Dry the carpet. Place a clean, dry dishtowel or sturdy paper towels over the damp spot. Place a plastic bag over them, and then place a heavy object, such as a large book, over the bag. Wait several hours or overnight before removing the towels. The stain should be gone and, because the drying process lifts even deep stains out, it won't reappear.",
    "sentences": [
        " Scrape up excess jelly with a butter knife.",
        "Gently scrape away the excess jelly as soon as possible after the stain sets.",
        "Use the dull edge of the knife, and remove as much of the jam as possible.",
        "Decide how to treat the stain.",
        "It's essential to use the right stain-removal techniques for a type of carpet.",
        "For example, natural fibers, such as wool or grass, can react badly to liquid stain removers (see the warning below concerning these chemicals), and you should always think twice before cleaning antique carpets or valuable rugs.",
        "If in doubt, call a professional carpet cleaner.",
        "Spray some water on the stain.",
        "Put some lukewarm--not hot--water in a spray bottle and lightly dampen the stain.",
        "You can also dab some water on the stain with a sponge.",
        "Prepare the cleaning solution.",
        "Add ¼ teaspoon mild, non-bleaching detergent or carpet shampoo to 1 liter (0.3 US gal) of cold water.",
        "Stir the solution in a bowl to mix thoroughly.",
        "Test any cleaning solution in an inconspicuous spot.",
        "Before you apply any cleaner--including the one in these directions--to your carpet, test the cleaner on a small patch where no one will see it.",
        "Wait a few minutes.",
        "If the cleaner discolors or otherwise adversely affects the carpet, remove it immediately with cold water and a sponge.",
        "If it ends up causing permanent damage, at least it won't be right in the middle of the room.",
        "Apply the cleaning solution to the stain.",
        "Moisten a clean, white cloth liberally with the cleaning solution, and simply lay the cloth over the stain.",
        "Massage the cloth with a spoon.",
        "Use the bottom of a spoon to gently press down on the cloth.",
        "Gradually work your way all over the cloth, starting on the outside and working your way toward the center in a spiral to prevent spreading the stain.",
        "This process works the solution into the carpet without rubbing the stain in or damaging the carpet fibers.",
        "Blot the stain and apply more cleaning solution.",
        "Blot the stain gently with a paper towel and apply the solution again as in the previous two steps.",
        "Keep reapplying and blotting until no trace of the stain is evident on the towel when you blot.",
        "Make an alkaline solution if the stain persists.",
        "Open windows to ventilate the room, and put on rubber gloves.",
        "Add 1 teaspoon household ammonia to a liter of warm water, and do a patch test as above.",
        "If no adverse reaction occurs, apply the solution with a cloth and massage it in as above.",
        "Rinse the stain.",
        "Lift the cloth off of the carpet, and spray warm water onto the stain.",
        "Alternatively, you may moisten a clean sponge with warm water and gently dab the stain.",
        "Remove excess liquid.",
        "Blot the stain with a clean dishtowel or sturdy paper towels.",
        "Blot, don't rub.",
        "Neutralize the alkalinity only if you've used the ammonia solution.",
        "Add a little white vinegar to a bowl of warm water.",
        "Perform a patch test.",
        "If no adverse reaction occurs on the patch, apply the neutralizing solution in the same way you applied the cleaning solutions.",
        "Blot with some paper towels.",
        "Rinse the stain again.",
        "Spray some warm water on the stain, and blot to remove excess moisture.",
        "Dry the carpet.",
        "Place a clean, dry dishtowel or sturdy paper towels over the damp spot.",
        "Place a plastic bag over them, and then place a heavy object, such as a large book, over the bag.",
        "Wait several hours or overnight before removing the towels.",
        "The stain should be gone and, because the drying process lifts even deep stains out, it won't reappear."
    ]
}