{
    "title": "How to Build an End Table",
    "url": "https://www.wikihow.com/Build-an-End-Table",
    "category_hierarchy": [
        "Home and Garden",
        "Furniture"
    ],
    "parts": [
        {
            "name": "Cutting the Lumber and Labeling the Legs",
            "steps": [
                {
                    "headline": "Pick up the lumber you need for the job.",
                    "description": "This end table is made entirely of dimensional lumber that’s easy to find at any home center or lumberyard. Pick up the following:\n1, 8 ft (2.4 m) long 4 in × 4 in (10 cm × 10 cm) fence post\n1, 8 ft (2.4 m) long 1 in × 4 in (2.5 cm × 10.2 cm) board\n2, 8 ft (2.4 m) long 2 in × 4 in (5.1 cm × 10.2 cm) studs"
                },
                {
                    "headline": "Use a circular saw to cut the lumber to length.",
                    "description": "Measure carefully with a tape measure and pencil, and use a speed square to ensure straight cut lines. Wear eye and ear protection and follow all safety recommendations when using the circular saw. Make the following cuts:\n4, 22.5 in (57 cm) legs from the 4 in × 4 in (10 cm × 10 cm) posts\n4, 2.25 in (5.7 cm) spacers from the 1 in × 4 in (2.5 cm × 10.2 cm) board\n2, 16.5 in (42 cm) leg supports from the 1 in × 4 in (2.5 cm × 10.2 cm) board\n4, 12 in (30 cm) aprons from the 1 in × 4 in (2.5 cm × 10.2 cm)  board\n2, 21 in (53 cm) breadboard ends from the 2 in × 4 in (5.1 cm × 10.2 cm) studs\n6, 14 in (36 cm) tabletop pieces from the 2 in × 4 in (5.1 cm × 10.2 cm) studs"
                },
                {
                    "headline": "Place the legs in their upright layout.",
                    "description": "Stand up the 4 legs in the general position they’ll have when the table is finished—square to each other, and about 18 in (46 cm) apart. Look from above and label the top left leg “A,” the top right “B,” the bottom right “C,” and the bottom left “D.”\nYou can take a mental note of the labels, or write them on the top of each leg with a pencil or marker (they’ll be concealed by the tabletop)."
                }
            ]
        },
        {
            "name": "Attaching the Spacers and Leg Supports",
            "steps": [
                {
                    "headline": "Screw in the spacers, flush with the tops of the legs.",
                    "description": "Pre-drill 2 holes in each spacer with a power drill, and attach the spacers to the legs with 2.5 in (6.4 cm) screws. When you attach the spacers, you want the long side (just under 4 in (10 cm)) of each running down from the top of each leg. Attach them in the following positions (looking from above):\nEven with the bottom right corner of “A” and facing “D.”\nEven with the top right corner of “D” and facing “A.”\nEven with the bottom left corner of “B” and facing “C.”\nEven with the top left corner of “C” and facing “B.”"
                },
                {
                    "headline": "Mark the locations for the leg supports.",
                    "description": "Each of the 2 leg supports will connect 2 of the legs and be flush with their tops. Measure and mark the following positions on the tops of the legs, once again looking from above at the upright legs:\n1.25 in (3.2 cm) from the top right corner of “A” toward its bottom right corner. 1.25 in (3.2 cm) from the top left corner of “B” toward its bottom left corner. 1.25 in (3.2 cm) from the bottom left corner of “C” toward its top left corner. 1.25 in (3.2 cm) from the bottom right corner of “D” toward its top right corner."
                },
                {
                    "headline": "Secure the leg supports in place.",
                    "description": "Pre-drill 2 holes into each end of both leg supports. One support will run between “A” and “D” (on the side facing “B” and “C”), and the other will run between “B” and “C” (facing “A” and “D”). Space each pair of legs apart so that the ends of the leg support align with the 1.25 in (3.2 cm) measurements you made along the leg tops. Secure the leg supports with 2.5 in (6.4 cm) screws. Then, drill 2 pilot holes into each of the 4 locations where a leg support overlaps one of the spacers. Drive 2.5 in (6.4 cm) screws through the supports and into the spacers."
                },
                {
                    "headline": "Attach 2 of the aprons to the spacers.",
                    "description": "Pre-drill 2 holes into each end of 2 of the 12 in (30 cm) long aprons. Use 2.5 in (6.4 cm) screws to secure these to the attached spacers, flush with the tops of the legs. Place them in the following positions:\nBetween “A” and “D,” on the side facing away from “B” and “C.”\nBetween “B” and “C,” on the side facing away from “A” and “D.”"
                },
                {
                    "headline": "Screw the other 2 aprons to the installed supports.",
                    "description": "Use your drill to create 2 pilot holes at both ends of both of the remaining 2 aprons. Screw them into the ends of the supports that connect “A” to “D” and “B” to “C,” making sure they’re flush with the tops of the legs and the other framing material. These aprons should be in the following locations:\nBetween “A” and “B.”\nBetween “C” and “D.”\nUse 2.5 in (6.4 cm) screws."
                }
            ]
        },
        {
            "name": "Installing the Tabletop",
            "steps": [
                {
                    "headline": "Lay the breadboard ends on opposing sides of the tabletop.",
                    "description": "Position one of the 21 in (53 cm) breadboard ends on top of legs “A” and “D,” and the other over “B” and “C.” Use a tape measure and reposition the breadboard ends as needed so they have 1 in (2.5 cm) overhangs in the following locations (when looking from above, as always):\nAbove “A,” below “D,” and to the left of both “A” and “D.”\nAbove “B,” below “C,” and to the right of both “B” and “C.”\nMark the undersides of the breadboard ends with a pencil so you can place them back in the correct position after you drill the pilot holes in them."
                },
                {
                    "headline": "Secure the breadboard ends with 4 in (10 cm) screws.",
                    "description": "Drill 2 pilot holes in each end of each breadboard piece, so that the screws will go straight down into the table legs. Put the breadboard ends back into place, using your pencil marks on the underside to get the proper 1 in (2.5 cm) overhangs. Drive 4 in (10 cm) screws through the breadboard ends and into the tops of the legs. 2.5 in (6.4 cm) screws won’t provide enough stability in this case. For even more stability, squeeze wood glue onto the tops of the legs before screwing the breadboard ends into place."
                },
                {
                    "headline": "Dry-fit the tabletop pieces in between the breadboard ends.",
                    "description": "The 6 tabletop pieces should run perpendicular to the breadboard ends and, if you’ve measured and cut accurately, fit right in place. Adjust the spacing between the tabletop pieces as needed so that the long sides of the 2 outermost pieces are flush with the ends of the breadboard pieces. The spacing between the tabletop pieces should most likely be less than 0.25 in (6.4 mm), depending on the original width of the dimensional lumber."
                },
                {
                    "headline": "Secure screws through the tabletop pieces and into the breadboard pieces.",
                    "description": "At each end of each tabletop piece, pre-drill two holes at roughly a 45-degree angle. Your goal is to have each pilot hole emerge through the edge of the tabletop piece, so that the screw can be driven at an angle through the tabletop piece and into the breadboard piece. Use 2.5 in (6.4 cm) screws to secure the tabletop pieces. By driving the screws at an angle into the adjoining breadboard end, you’ll give the tabletop much greater stability than if you try to screw straight down into the legs’ support structure."
                }
            ]
        },
        {
            "name": "Finishing the End Table",
            "steps": [
                {
                    "headline": "Conceal the screw heads with wood filler, if desired.",
                    "description": "If you want your end table to have a rustic look, you can leave the screw heads visible. To conceal them, use a small putty knife to apply wood filler over each screw head. Wipe away any excess wood filler and allow it to harden as per the product instructions. The wood filler will work best if you drive your screw heads in deeper than the surface of the wood. Dimensional lumber is usually soft enough that you can indent the screw heads slightly below the surface with a power drill/driver. As an alternative, you can use a countersink bit when you drill your pilot holes. This type of bit is thicker near the base, so when you drill the bit in fully it creates a depression in the wood for the screw head."
                },
                {
                    "headline": "Sand and wipe down the end table.",
                    "description": "Use 120-grit sandpaper and go over the entire surface of the wood, including the wood filler. Use steady, firm pressure and keep working until the wood surface is smooth. Then, wipe away excess wood dust with a soft, clean rag or—even better—a tack cloth. Tack cloths are slightly sticky and will pick up dust and residue."
                },
                {
                    "headline": "Paint or stain the end table as desired.",
                    "description": "To paint it, start by applying a coat of oil-based primer with a brush. If you can still feel the wood grain after the primer dries (check for drying times on the paint can), add a second coat in the same fashion. Then, follow up by brushing on 2-3 coats of latex paint, allowing the paint to dry completely between coats. To stain the wood, start by brushing on a wood conditioner—this will help the stain soak evenly into the soft dimensional lumber. After it dries according to the package instructions, brush or wipe on as many coats of stain as you desire until you get the color you want. When the stain is dry, brush on a coat of polyurethane if desired to add further shine and protection."
                }
            ]
        }
    ],
    "tyn": [
        "1, 8 ft (2.4 m) long 4 in × 4 in (10 cm × 10 cm) fence post",
        "1, 8 ft (2.4 m) long 1 in × 4 in (2.5 cm × 10.2 cm) board",
        "2, 8 ft (2.4 m) long 2 in × 4 in (5.1 cm × 10.2 cm) studs",
        "tape measure",
        "pencil",
        "speed square",
        "eye and ear protection",
        "circular saw",
        "power drill/driver",
        "2.5 in (6.4 cm) screws",
        "4 in (10 cm) screws",
        "wood glue (optional)",
        "wood filler (optional)",
        "120-grit sandpaper",
        "tack cloth",
        "paintbrushes",
        "primer and paint, or wood conditioner and stain"
    ],
    "text": " Cutting the Lumber and Labeling the Legs Pick up the lumber you need for the job. This end table is made entirely of dimensional lumber that’s easy to find at any home center or lumberyard. Pick up the following:\n1, 8 ft (2.4 m) long 4 in × 4 in (10 cm × 10 cm) fence post\n1, 8 ft (2.4 m) long 1 in × 4 in (2.5 cm × 10.2 cm) board\n2, 8 ft (2.4 m) long 2 in × 4 in (5.1 cm × 10.2 cm) studs Use a circular saw to cut the lumber to length. Measure carefully with a tape measure and pencil, and use a speed square to ensure straight cut lines. Wear eye and ear protection and follow all safety recommendations when using the circular saw. Make the following cuts:\n4, 22.5 in (57 cm) legs from the 4 in × 4 in (10 cm × 10 cm) posts\n4, 2.25 in (5.7 cm) spacers from the 1 in × 4 in (2.5 cm × 10.2 cm) board\n2, 16.5 in (42 cm) leg supports from the 1 in × 4 in (2.5 cm × 10.2 cm) board\n4, 12 in (30 cm) aprons from the 1 in × 4 in (2.5 cm × 10.2 cm)  board\n2, 21 in (53 cm) breadboard ends from the 2 in × 4 in (5.1 cm × 10.2 cm) studs\n6, 14 in (36 cm) tabletop pieces from the 2 in × 4 in (5.1 cm × 10.2 cm) studs Place the legs in their upright layout. Stand up the 4 legs in the general position they’ll have when the table is finished—square to each other, and about 18 in (46 cm) apart. Look from above and label the top left leg “A,” the top right “B,” the bottom right “C,” and the bottom left “D.”\nYou can take a mental note of the labels, or write them on the top of each leg with a pencil or marker (they’ll be concealed by the tabletop). Attaching the Spacers and Leg Supports Screw in the spacers, flush with the tops of the legs. Pre-drill 2 holes in each spacer with a power drill, and attach the spacers to the legs with 2.5 in (6.4 cm) screws. When you attach the spacers, you want the long side (just under 4 in (10 cm)) of each running down from the top of each leg. Attach them in the following positions (looking from above):\nEven with the bottom right corner of “A” and facing “D.”\nEven with the top right corner of “D” and facing “A.”\nEven with the bottom left corner of “B” and facing “C.”\nEven with the top left corner of “C” and facing “B.” Mark the locations for the leg supports. Each of the 2 leg supports will connect 2 of the legs and be flush with their tops. Measure and mark the following positions on the tops of the legs, once again looking from above at the upright legs:\n1.25 in (3.2 cm) from the top right corner of “A” toward its bottom right corner. 1.25 in (3.2 cm) from the top left corner of “B” toward its bottom left corner. 1.25 in (3.2 cm) from the bottom left corner of “C” toward its top left corner. 1.25 in (3.2 cm) from the bottom right corner of “D” toward its top right corner. Secure the leg supports in place. Pre-drill 2 holes into each end of both leg supports. One support will run between “A” and “D” (on the side facing “B” and “C”), and the other will run between “B” and “C” (facing “A” and “D”). Space each pair of legs apart so that the ends of the leg support align with the 1.25 in (3.2 cm) measurements you made along the leg tops. Secure the leg supports with 2.5 in (6.4 cm) screws. Then, drill 2 pilot holes into each of the 4 locations where a leg support overlaps one of the spacers. Drive 2.5 in (6.4 cm) screws through the supports and into the spacers. Attach 2 of the aprons to the spacers. Pre-drill 2 holes into each end of 2 of the 12 in (30 cm) long aprons. Use 2.5 in (6.4 cm) screws to secure these to the attached spacers, flush with the tops of the legs. Place them in the following positions:\nBetween “A” and “D,” on the side facing away from “B” and “C.”\nBetween “B” and “C,” on the side facing away from “A” and “D.” Screw the other 2 aprons to the installed supports. Use your drill to create 2 pilot holes at both ends of both of the remaining 2 aprons. Screw them into the ends of the supports that connect “A” to “D” and “B” to “C,” making sure they’re flush with the tops of the legs and the other framing material. These aprons should be in the following locations:\nBetween “A” and “B.”\nBetween “C” and “D.”\nUse 2.5 in (6.4 cm) screws. Installing the Tabletop Lay the breadboard ends on opposing sides of the tabletop. Position one of the 21 in (53 cm) breadboard ends on top of legs “A” and “D,” and the other over “B” and “C.” Use a tape measure and reposition the breadboard ends as needed so they have 1 in (2.5 cm) overhangs in the following locations (when looking from above, as always):\nAbove “A,” below “D,” and to the left of both “A” and “D.”\nAbove “B,” below “C,” and to the right of both “B” and “C.”\nMark the undersides of the breadboard ends with a pencil so you can place them back in the correct position after you drill the pilot holes in them. Secure the breadboard ends with 4 in (10 cm) screws. Drill 2 pilot holes in each end of each breadboard piece, so that the screws will go straight down into the table legs. Put the breadboard ends back into place, using your pencil marks on the underside to get the proper 1 in (2.5 cm) overhangs. Drive 4 in (10 cm) screws through the breadboard ends and into the tops of the legs. 2.5 in (6.4 cm) screws won’t provide enough stability in this case. For even more stability, squeeze wood glue onto the tops of the legs before screwing the breadboard ends into place. Dry-fit the tabletop pieces in between the breadboard ends. The 6 tabletop pieces should run perpendicular to the breadboard ends and, if you’ve measured and cut accurately, fit right in place. Adjust the spacing between the tabletop pieces as needed so that the long sides of the 2 outermost pieces are flush with the ends of the breadboard pieces. The spacing between the tabletop pieces should most likely be less than 0.25 in (6.4 mm), depending on the original width of the dimensional lumber. Secure screws through the tabletop pieces and into the breadboard pieces. At each end of each tabletop piece, pre-drill two holes at roughly a 45-degree angle. Your goal is to have each pilot hole emerge through the edge of the tabletop piece, so that the screw can be driven at an angle through the tabletop piece and into the breadboard piece. Use 2.5 in (6.4 cm) screws to secure the tabletop pieces. By driving the screws at an angle into the adjoining breadboard end, you’ll give the tabletop much greater stability than if you try to screw straight down into the legs’ support structure. Finishing the End Table Conceal the screw heads with wood filler, if desired. If you want your end table to have a rustic look, you can leave the screw heads visible. To conceal them, use a small putty knife to apply wood filler over each screw head. Wipe away any excess wood filler and allow it to harden as per the product instructions. The wood filler will work best if you drive your screw heads in deeper than the surface of the wood. Dimensional lumber is usually soft enough that you can indent the screw heads slightly below the surface with a power drill/driver. As an alternative, you can use a countersink bit when you drill your pilot holes. This type of bit is thicker near the base, so when you drill the bit in fully it creates a depression in the wood for the screw head. Sand and wipe down the end table. Use 120-grit sandpaper and go over the entire surface of the wood, including the wood filler. Use steady, firm pressure and keep working until the wood surface is smooth. Then, wipe away excess wood dust with a soft, clean rag or—even better—a tack cloth. Tack cloths are slightly sticky and will pick up dust and residue. Paint or stain the end table as desired. To paint it, start by applying a coat of oil-based primer with a brush. If you can still feel the wood grain after the primer dries (check for drying times on the paint can), add a second coat in the same fashion. Then, follow up by brushing on 2-3 coats of latex paint, allowing the paint to dry completely between coats. To stain the wood, start by brushing on a wood conditioner—this will help the stain soak evenly into the soft dimensional lumber. After it dries according to the package instructions, brush or wipe on as many coats of stain as you desire until you get the color you want. When the stain is dry, brush on a coat of polyurethane if desired to add further shine and protection.",
    "sentences": [
        " Cutting the Lumber and Labeling the Legs Pick up the lumber you need for the job.",
        "This end table is made entirely of dimensional lumber that’s easy to find at any home center or lumberyard.",
        "Pick up the following:\n1, 8 ft (2.4 m) long 4 in × 4 in (10 cm × 10 cm) fence post\n1, 8 ft (2.4 m) long 1 in × 4 in (2.5 cm × 10.2 cm) board\n2, 8 ft (2.4 m) long 2 in × 4 in (5.1 cm × 10.2 cm) studs Use a circular saw to cut the lumber to length.",
        "Measure carefully with a tape measure and pencil, and use a speed square to ensure straight cut lines.",
        "Wear eye and ear protection and follow all safety recommendations when using the circular saw.",
        "Make the following cuts:\n4, 22.5 in (57 cm) legs from the 4 in × 4 in (10 cm × 10 cm) posts\n4, 2.25 in (5.7 cm) spacers from the 1 in × 4 in (2.5 cm × 10.2 cm) board\n2, 16.5 in (42 cm) leg supports from the 1 in × 4 in (2.5 cm × 10.2 cm) board\n4, 12 in (30 cm) aprons from the 1 in × 4 in (2.5 cm × 10.2 cm)  board\n2, 21 in (53 cm) breadboard ends from the 2 in × 4 in (5.1 cm × 10.2 cm) studs\n6, 14 in (36 cm) tabletop pieces from the 2 in × 4 in (5.1 cm × 10.2 cm) studs Place the legs in their upright layout.",
        "Stand up the 4 legs in the general position they’ll have when the table is finished—square to each other, and about 18 in (46 cm) apart.",
        "Look from above and label the top left leg “A,” the top right “B,” the bottom right “C,” and the bottom left “D.”\nYou can take a mental note of the labels, or write them on the top of each leg with a pencil or marker (they’ll be concealed by the tabletop).",
        "Attaching the Spacers and Leg Supports Screw in the spacers, flush with the tops of the legs.",
        "Pre-drill 2 holes in each spacer with a power drill, and attach the spacers to the legs with 2.5 in (6.4 cm) screws.",
        "When you attach the spacers, you want the long side (just under 4 in (10 cm)) of each running down from the top of each leg.",
        "Attach them in the following positions (looking from above):\nEven with the bottom right corner of “A” and facing “D.”\nEven with the top right corner of “D” and facing “A.”\nEven with the bottom left corner of “B” and facing “C.”\nEven with the top left corner of “C” and facing “B.” Mark the locations for the leg supports.",
        "Each of the 2 leg supports will connect 2 of the legs and be flush with their tops.",
        "Measure and mark the following positions on the tops of the legs, once again looking from above at the upright legs:\n1.25 in (3.2 cm) from the top right corner of “A” toward its bottom right corner.",
        "1.25 in (3.2 cm) from the top left corner of “B” toward its bottom left corner.",
        "1.25 in (3.2 cm) from the bottom left corner of “C” toward its top left corner.",
        "1.25 in (3.2 cm) from the bottom right corner of “D” toward its top right corner.",
        "Secure the leg supports in place.",
        "Pre-drill 2 holes into each end of both leg supports.",
        "One support will run between “A” and “D” (on the side facing “B” and “C”), and the other will run between “B” and “C” (facing “A” and “D”).",
        "Space each pair of legs apart so that the ends of the leg support align with the 1.25 in (3.2 cm) measurements you made along the leg tops.",
        "Secure the leg supports with 2.5 in (6.4 cm) screws.",
        "Then, drill 2 pilot holes into each of the 4 locations where a leg support overlaps one of the spacers.",
        "Drive 2.5 in (6.4 cm) screws through the supports and into the spacers.",
        "Attach 2 of the aprons to the spacers.",
        "Pre-drill 2 holes into each end of 2 of the 12 in (30 cm) long aprons.",
        "Use 2.5 in (6.4 cm) screws to secure these to the attached spacers, flush with the tops of the legs.",
        "Place them in the following positions:\nBetween “A” and “D,” on the side facing away from “B” and “C.”\nBetween “B” and “C,” on the side facing away from “A” and “D.” Screw the other 2 aprons to the installed supports.",
        "Use your drill to create 2 pilot holes at both ends of both of the remaining 2 aprons.",
        "Screw them into the ends of the supports that connect “A” to “D” and “B” to “C,” making sure they’re flush with the tops of the legs and the other framing material.",
        "These aprons should be in the following locations:\nBetween “A” and “B.”\nBetween “C” and “D.”\nUse 2.5 in (6.4 cm) screws.",
        "Installing the Tabletop Lay the breadboard ends on opposing sides of the tabletop.",
        "Position one of the 21 in (53 cm) breadboard ends on top of legs “A” and “D,” and the other over “B” and “C.” Use a tape measure and reposition the breadboard ends as needed so they have 1 in (2.5 cm) overhangs in the following locations (when looking from above, as always):\nAbove “A,” below “D,” and to the left of both “A” and “D.”\nAbove “B,” below “C,” and to the right of both “B” and “C.”\nMark the undersides of the breadboard ends with a pencil so you can place them back in the correct position after you drill the pilot holes in them.",
        "Secure the breadboard ends with 4 in (10 cm) screws.",
        "Drill 2 pilot holes in each end of each breadboard piece, so that the screws will go straight down into the table legs.",
        "Put the breadboard ends back into place, using your pencil marks on the underside to get the proper 1 in (2.5 cm) overhangs.",
        "Drive 4 in (10 cm) screws through the breadboard ends and into the tops of the legs.",
        "2.5 in (6.4 cm) screws won’t provide enough stability in this case.",
        "For even more stability, squeeze wood glue onto the tops of the legs before screwing the breadboard ends into place.",
        "Dry-fit the tabletop pieces in between the breadboard ends.",
        "The 6 tabletop pieces should run perpendicular to the breadboard ends and, if you’ve measured and cut accurately, fit right in place.",
        "Adjust the spacing between the tabletop pieces as needed so that the long sides of the 2 outermost pieces are flush with the ends of the breadboard pieces.",
        "The spacing between the tabletop pieces should most likely be less than 0.25 in (6.4 mm), depending on the original width of the dimensional lumber.",
        "Secure screws through the tabletop pieces and into the breadboard pieces.",
        "At each end of each tabletop piece, pre-drill two holes at roughly a 45-degree angle.",
        "Your goal is to have each pilot hole emerge through the edge of the tabletop piece, so that the screw can be driven at an angle through the tabletop piece and into the breadboard piece.",
        "Use 2.5 in (6.4 cm) screws to secure the tabletop pieces.",
        "By driving the screws at an angle into the adjoining breadboard end, you’ll give the tabletop much greater stability than if you try to screw straight down into the legs’ support structure.",
        "Finishing the End Table Conceal the screw heads with wood filler, if desired.",
        "If you want your end table to have a rustic look, you can leave the screw heads visible.",
        "To conceal them, use a small putty knife to apply wood filler over each screw head.",
        "Wipe away any excess wood filler and allow it to harden as per the product instructions.",
        "The wood filler will work best if you drive your screw heads in deeper than the surface of the wood.",
        "Dimensional lumber is usually soft enough that you can indent the screw heads slightly below the surface with a power drill/driver.",
        "As an alternative, you can use a countersink bit when you drill your pilot holes.",
        "This type of bit is thicker near the base, so when you drill the bit in fully it creates a depression in the wood for the screw head.",
        "Sand and wipe down the end table.",
        "Use 120-grit sandpaper and go over the entire surface of the wood, including the wood filler.",
        "Use steady, firm pressure and keep working until the wood surface is smooth.",
        "Then, wipe away excess wood dust with a soft, clean rag or—even better—a tack cloth.",
        "Tack cloths are slightly sticky and will pick up dust and residue.",
        "Paint or stain the end table as desired.",
        "To paint it, start by applying a coat of oil-based primer with a brush.",
        "If you can still feel the wood grain after the primer dries (check for drying times on the paint can), add a second coat in the same fashion.",
        "Then, follow up by brushing on 2-3 coats of latex paint, allowing the paint to dry completely between coats.",
        "To stain the wood, start by brushing on a wood conditioner—this will help the stain soak evenly into the soft dimensional lumber.",
        "After it dries according to the package instructions, brush or wipe on as many coats of stain as you desire until you get the color you want.",
        "When the stain is dry, brush on a coat of polyurethane if desired to add further shine and protection."
    ]
}