{
    "title": "How to Chop Basil",
    "url": "https://www.wikihow.com/Chop-Basil",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "parts": [
        {
            "name": "Rinsing Basil Leaves",
            "steps": [
                {
                    "headline": "Remove the basil leaves from their stem.",
                    "description": "Use your fingers to pull the basil leaves off of their central stem, one by one. Pull firmly at the very base of each basil leaf to separate the bottom of the leaf itself from the central stem. If you pull on the leaves from their center, you’ll end up tearing the basil leaves in half. Once the basil leaves are off the stem, throw it away."
                },
                {
                    "headline": "Fill a large kitchen bowl with cold water.",
                    "description": "Find a bowl with at least an 8 in (20 cm) diameter. Hold the bowl beneath your kitchen sink and turn the tap on to cold. Let the water run until the bowl is about half-way full. If you don’t have a large glass, metal, or plastic bowl in your kitchen, purchase one at a nearby supermarket or kitchen-supply store."
                },
                {
                    "headline": "Drop your fresh basil leaves into the water.",
                    "description": "Use your hands to push the leaves under the surface of the water. Once the leaves are submerged, slowly move your hands back and forth under the water to lightly rinse the herbs. Swirl the leaves in the water for about 20 seconds. Rinsing the herbs removes any grit or debris that had been stuck to the leaves."
                },
                {
                    "headline": "Pat the basil dry with a clean dish towel.",
                    "description": "Once the leaves are grit-free, pull them out of the water and place them onto the left-hand side of a clean, flat dish towel. Fold the right-hand side of the towel over, so the leaves are sandwiched between the halves of the towel. Lightly pat the towel to dry the leaves. Resting the weight of your hands on the towel will be enough to dry the basil. If you push down hard on the leaves, you’ll crush the basil."
                }
            ]
        },
        {
            "name": "Cutting the Basil Leaves",
            "steps": [
                {
                    "headline": "Stack the basil leaves in a pile from largest to smallest.",
                    "description": "Sort through the leaves and find the largest leaf. Set that directly on top of a cutting board. Arrange the rest of the leaves on top of the first so that each leaf is slightly smaller than the one below it. Set the smallest leaf on top of the stack. If you find 2 leaves that are the same size, you can stack them in whichever order you prefer."
                },
                {
                    "headline": "Roll the leaves lengthwise into a tight tube.",
                    "description": "Begin rolling at one of the long sides of the stacked basil leaves. Start from the lowest leaf, and roll from the outside in until all of the leaves have been formed up into a thin, cigar-shaped roll. Keep the roll as tight as possible. This will make it easier for you to chop the basil into thin ribbons."
                },
                {
                    "headline": "Slice the rolled basil into thin strips.",
                    "description": "Begin cutting from the tips of the rolled basil, and work your way down to the base of the leaves. To make a cut, lift up the heel of the chef’s knife and slip the basil beneath it. Push the knife’s blade forward and down until it cuts through the basil leaves. Each stroke of the knife should take off about ⁄8 inch (0.32 cm) of basil. Use a sharp knife to chop up the basil. While a chef’s knife will work best, any sharp blade will do. If you chop basil with a dull knife, you’ll crush the delicate leaves."
                },
                {
                    "headline": "Slide your fingers down the rolled basil as you slice.",
                    "description": "Make successive cuts down the rolled-up basil leaves by pivoting the point of the chef’s knife and chopping through the basil with the knife’s heel. Every 2–3 cuts, slide your fingers ⁄2 inch (1.3 cm) down the basil. Otherwise, you’ll end up cutting your finger while you slice. If you do end up nicking your finger with the knife, rinse the cut and apply a band aid."
                },
                {
                    "headline": "Chop the pile of finely-cut basil ribbons if you want diced basil.",
                    "description": "Once you’ve cut across the basil roll, you’ll be left with long slices up to 2 inches (5.1 cm) in length. If you’d like the basil to be cut into very small pieces (not strips), chop across the entire pile of sliced basil. Cut at a perpendicular angle to the initial cuts you made to ensure that the long strips are chopped into small bits. Alternately, if you prefer that the basil be in finely-sliced ribbons, skip this step."
                },
                {
                    "headline": "Add the chopped basil into a freshly-cooked savory meal.",
                    "description": "The basil’s flavors will be most potent right after you’ve finished chopping. Add the chopped basil to savory sauces, pasta dishes, or thick vegetable soups or stews. Freshly chiffonaded basil is very aromatic and also makes a great addition to light summer dishes."
                }
            ]
        }
    ],
    "tyn": [
        "Large bowl",
        "Basil",
        "Dish towel",
        "Chef’s knife",
        "Cutting board"
    ],
    "text": " Rinsing Basil Leaves Remove the basil leaves from their stem. Use your fingers to pull the basil leaves off of their central stem, one by one. Pull firmly at the very base of each basil leaf to separate the bottom of the leaf itself from the central stem. If you pull on the leaves from their center, you’ll end up tearing the basil leaves in half. Once the basil leaves are off the stem, throw it away. Fill a large kitchen bowl with cold water. Find a bowl with at least an 8 in (20 cm) diameter. Hold the bowl beneath your kitchen sink and turn the tap on to cold. Let the water run until the bowl is about half-way full. If you don’t have a large glass, metal, or plastic bowl in your kitchen, purchase one at a nearby supermarket or kitchen-supply store. Drop your fresh basil leaves into the water. Use your hands to push the leaves under the surface of the water. Once the leaves are submerged, slowly move your hands back and forth under the water to lightly rinse the herbs. Swirl the leaves in the water for about 20 seconds. Rinsing the herbs removes any grit or debris that had been stuck to the leaves. Pat the basil dry with a clean dish towel. Once the leaves are grit-free, pull them out of the water and place them onto the left-hand side of a clean, flat dish towel. Fold the right-hand side of the towel over, so the leaves are sandwiched between the halves of the towel. Lightly pat the towel to dry the leaves. Resting the weight of your hands on the towel will be enough to dry the basil. If you push down hard on the leaves, you’ll crush the basil. Cutting the Basil Leaves Stack the basil leaves in a pile from largest to smallest. Sort through the leaves and find the largest leaf. Set that directly on top of a cutting board. Arrange the rest of the leaves on top of the first so that each leaf is slightly smaller than the one below it. Set the smallest leaf on top of the stack. If you find 2 leaves that are the same size, you can stack them in whichever order you prefer. Roll the leaves lengthwise into a tight tube. Begin rolling at one of the long sides of the stacked basil leaves. Start from the lowest leaf, and roll from the outside in until all of the leaves have been formed up into a thin, cigar-shaped roll. Keep the roll as tight as possible. This will make it easier for you to chop the basil into thin ribbons. Slice the rolled basil into thin strips. Begin cutting from the tips of the rolled basil, and work your way down to the base of the leaves. To make a cut, lift up the heel of the chef’s knife and slip the basil beneath it. Push the knife’s blade forward and down until it cuts through the basil leaves. Each stroke of the knife should take off about ⁄8 inch (0.32 cm) of basil. Use a sharp knife to chop up the basil. While a chef’s knife will work best, any sharp blade will do. If you chop basil with a dull knife, you’ll crush the delicate leaves. Slide your fingers down the rolled basil as you slice. Make successive cuts down the rolled-up basil leaves by pivoting the point of the chef’s knife and chopping through the basil with the knife’s heel. Every 2–3 cuts, slide your fingers ⁄2 inch (1.3 cm) down the basil. Otherwise, you’ll end up cutting your finger while you slice. If you do end up nicking your finger with the knife, rinse the cut and apply a band aid. Chop the pile of finely-cut basil ribbons if you want diced basil. Once you’ve cut across the basil roll, you’ll be left with long slices up to 2 inches (5.1 cm) in length. If you’d like the basil to be cut into very small pieces (not strips), chop across the entire pile of sliced basil. Cut at a perpendicular angle to the initial cuts you made to ensure that the long strips are chopped into small bits. Alternately, if you prefer that the basil be in finely-sliced ribbons, skip this step. Add the chopped basil into a freshly-cooked savory meal. The basil’s flavors will be most potent right after you’ve finished chopping. Add the chopped basil to savory sauces, pasta dishes, or thick vegetable soups or stews. Freshly chiffonaded basil is very aromatic and also makes a great addition to light summer dishes.",
    "sentences": [
        " Rinsing Basil Leaves Remove the basil leaves from their stem.",
        "Use your fingers to pull the basil leaves off of their central stem, one by one.",
        "Pull firmly at the very base of each basil leaf to separate the bottom of the leaf itself from the central stem.",
        "If you pull on the leaves from their center, you’ll end up tearing the basil leaves in half.",
        "Once the basil leaves are off the stem, throw it away.",
        "Fill a large kitchen bowl with cold water.",
        "Find a bowl with at least an 8 in (20 cm) diameter.",
        "Hold the bowl beneath your kitchen sink and turn the tap on to cold.",
        "Let the water run until the bowl is about half-way full.",
        "If you don’t have a large glass, metal, or plastic bowl in your kitchen, purchase one at a nearby supermarket or kitchen-supply store.",
        "Drop your fresh basil leaves into the water.",
        "Use your hands to push the leaves under the surface of the water.",
        "Once the leaves are submerged, slowly move your hands back and forth under the water to lightly rinse the herbs.",
        "Swirl the leaves in the water for about 20 seconds.",
        "Rinsing the herbs removes any grit or debris that had been stuck to the leaves.",
        "Pat the basil dry with a clean dish towel.",
        "Once the leaves are grit-free, pull them out of the water and place them onto the left-hand side of a clean, flat dish towel.",
        "Fold the right-hand side of the towel over, so the leaves are sandwiched between the halves of the towel.",
        "Lightly pat the towel to dry the leaves.",
        "Resting the weight of your hands on the towel will be enough to dry the basil.",
        "If you push down hard on the leaves, you’ll crush the basil.",
        "Cutting the Basil Leaves Stack the basil leaves in a pile from largest to smallest.",
        "Sort through the leaves and find the largest leaf.",
        "Set that directly on top of a cutting board.",
        "Arrange the rest of the leaves on top of the first so that each leaf is slightly smaller than the one below it.",
        "Set the smallest leaf on top of the stack.",
        "If you find 2 leaves that are the same size, you can stack them in whichever order you prefer.",
        "Roll the leaves lengthwise into a tight tube.",
        "Begin rolling at one of the long sides of the stacked basil leaves.",
        "Start from the lowest leaf, and roll from the outside in until all of the leaves have been formed up into a thin, cigar-shaped roll.",
        "Keep the roll as tight as possible.",
        "This will make it easier for you to chop the basil into thin ribbons.",
        "Slice the rolled basil into thin strips.",
        "Begin cutting from the tips of the rolled basil, and work your way down to the base of the leaves.",
        "To make a cut, lift up the heel of the chef’s knife and slip the basil beneath it.",
        "Push the knife’s blade forward and down until it cuts through the basil leaves.",
        "Each stroke of the knife should take off about ⁄8 inch (0.32 cm) of basil.",
        "Use a sharp knife to chop up the basil.",
        "While a chef’s knife will work best, any sharp blade will do.",
        "If you chop basil with a dull knife, you’ll crush the delicate leaves.",
        "Slide your fingers down the rolled basil as you slice.",
        "Make successive cuts down the rolled-up basil leaves by pivoting the point of the chef’s knife and chopping through the basil with the knife’s heel.",
        "Every 2–3 cuts, slide your fingers ⁄2 inch (1.3 cm) down the basil.",
        "Otherwise, you’ll end up cutting your finger while you slice.",
        "If you do end up nicking your finger with the knife, rinse the cut and apply a band aid.",
        "Chop the pile of finely-cut basil ribbons if you want diced basil.",
        "Once you’ve cut across the basil roll, you’ll be left with long slices up to 2 inches (5.1 cm) in length.",
        "If you’d like the basil to be cut into very small pieces (not strips), chop across the entire pile of sliced basil.",
        "Cut at a perpendicular angle to the initial cuts you made to ensure that the long strips are chopped into small bits.",
        "Alternately, if you prefer that the basil be in finely-sliced ribbons, skip this step.",
        "Add the chopped basil into a freshly-cooked savory meal.",
        "The basil’s flavors will be most potent right after you’ve finished chopping.",
        "Add the chopped basil to savory sauces, pasta dishes, or thick vegetable soups or stews.",
        "Freshly chiffonaded basil is very aromatic and also makes a great addition to light summer dishes."
    ]
}