{
    "title": "How to Season Sweet Potato Fries",
    "url": "https://www.wikihow.com/Season-Sweet-Potato-Fries",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables",
        "Potato Dishes"
    ],
    "parts": [
        {
            "name": "Cutting and Seasoning Your Fries",
            "steps": [
                {
                    "headline": "Preheat your oven to 425 °F (218 °C).",
                    "description": "Electric ovens take about 10 to 15 minutes to preheat, while gas ovens take between 5 to 10 minutes. Be sure to place the oven rack into the highest position prior to turning your oven on to preheat."
                },
                {
                    "headline": "Slice your potatoes into matchsticks.",
                    "description": "Start by slicing off one rounded edge of the sweet potato with a kitchen knife and place the cut side down. Place the knife on top of the potato with one hand gripping the handle and the other resting on the top of the blade. Firmly press down to cut the potato into planks about 1 inch (2.5 cm) thick. Now, cut the planks horizontally at the halfway point to make your fries. Always use the palm of your non-dominant hand to apply downward pressure to the knife when cutting. Try to cut your fries into even sizes to ensure consistent baking."
                },
                {
                    "headline": "Make a chili powder mix for seasoning with just a bit of spice.",
                    "description": "Sprinkle 2 tablespoons (16.23 grams) of chili powder, 2 tablespoons (12.17 grams) of ground cumin, 2 tablespoons (34.12 grams) of sea salt, and 2 tablespoons (19.68 grams) of garlic powder into an airtight glass jar. Now, shake the jar until all of your ingredients are as evenly blended as possible. Store your seasoning in a cool, dry place for 2 to 3 months or until the spices start losing their flavor."
                },
                {
                    "headline": "Create a paprika seasoning if you like your fries spicy.",
                    "description": "Place 1/2 tablespoon (8.53 grams) of sea salt, 1/2 tablespoon (3.5 grams) of freshly ground black pepper, 1/4 tablespoon (1.72 grams) of hot paprika, and 1/4 tablespoon (2.46 grams) of garlic powder into an airtight container. Close the lid and shake the container until the ingredients are evenly mixed. Swap your hot paprika with sweet or smokey paprika if you don't like spice."
                },
                {
                    "headline": "Mix together some herbs if you like traditional Italian seasoning.",
                    "description": "In an airtight glass jar, mix together 1 1/2 teaspoons (1.52 grams) of dried oregano, 1 teaspoon (0.57 grams) of dried marjoram, 1 teaspoon (0.91 grams) of dried thyme, 1/2 teaspoon (0.25 grams) of dried basil, 1/2 teaspoon (0.29 grams) of dried rosemary, and 1/2 teaspoon (0.34 grams) of dried sage. Store your container in a dry, cool place for up to 1 year or until the herbs begin losing their flavor."
                },
                {
                    "headline": "Season your fries with your choice of seasoning.",
                    "description": "Place your fries into a mixing bowl. Start by coating your fries with 3 tablespoons (44 mL) of vegetable oil. Now, sprinkle on your seasoning of choice to taste. Take care to coat your fries as evenly as possible to avoid any chunky or powdery spots. Sprinkle on some corn starch to help your fries get extra crispy. Don't overdo the seasoning—you can add more after baking your fries."
                }
            ]
        },
        {
            "name": "Cooking and Serving Your Fries",
            "steps": [
                {
                    "headline": "Place your fries onto a baking sheet.",
                    "description": "If your sheet is not non-stick, spray it evenly with non-stick spray. Dump your fries onto the sheet and arrange them in a single layer. Take care to give them space to avoid overcrowding, which will prevent your fries from crisping. Avoid using aluminum foil or parchment paper, as they produce unreliable results."
                },
                {
                    "headline": "Bake your fries for 15 minutes and then flip them.",
                    "description": "Be sure to bake them on the highest oven rack so they can crisp properly. After giving your fries 15 minutes to bake, turn each of them over. If you have a metal spatula or tongs, use them to flip the fries over and avoid getting messy. If you don't have anything, just use your hands. If you have a spatula, scoop up around 10 fries at a time and turn your wrist quickly to flip them."
                },
                {
                    "headline": "Cook your fries for 10 to 15 more minutes or until crispy.",
                    "description": "After you flip your fries, wait until they cook all the way through and turn crispy. By observation, a good sign that your fries are done is when they turn from orange to a flat, less shiny color. Make sure they get enough time in the oven or they won't crisp. Don't worry if the edges of the fries are a little brown—this will give them a caramelized taste."
                },
                {
                    "headline": "Season and serve your fries after cooling them for 5 to 10 minutes.",
                    "description": "Once your potatoes have had time to cool, they're ready to eat! Take a bite and see how they taste. Add some more of your seasoning of choice to taste, or leave them as is. If you want to have your fries with a meal, try adding them to a nacho platter, pair them with a salad, or eat them alongside a nice burger or steak. Store your baked sweet potato fries in the fridge for 3 to 5 days or in the freezer for 10 to 12 months."
                }
            ]
        }
    ],
    "tyn": [
        "Airtight glass jar",
        "Baking sheet",
        "Non-stick cooking spray",
        "Kitchen knife",
        "Large mixing bowl",
        "Spatula or tongs"
    ],
    "text": " Cutting and Seasoning Your Fries Preheat your oven to 425 °F (218 °C). Electric ovens take about 10 to 15 minutes to preheat, while gas ovens take between 5 to 10 minutes. Be sure to place the oven rack into the highest position prior to turning your oven on to preheat. Slice your potatoes into matchsticks. Start by slicing off one rounded edge of the sweet potato with a kitchen knife and place the cut side down. Place the knife on top of the potato with one hand gripping the handle and the other resting on the top of the blade. Firmly press down to cut the potato into planks about 1 inch (2.5 cm) thick. Now, cut the planks horizontally at the halfway point to make your fries. Always use the palm of your non-dominant hand to apply downward pressure to the knife when cutting. Try to cut your fries into even sizes to ensure consistent baking. Make a chili powder mix for seasoning with just a bit of spice. Sprinkle 2 tablespoons (16.23 grams) of chili powder, 2 tablespoons (12.17 grams) of ground cumin, 2 tablespoons (34.12 grams) of sea salt, and 2 tablespoons (19.68 grams) of garlic powder into an airtight glass jar. Now, shake the jar until all of your ingredients are as evenly blended as possible. Store your seasoning in a cool, dry place for 2 to 3 months or until the spices start losing their flavor. Create a paprika seasoning if you like your fries spicy. Place 1/2 tablespoon (8.53 grams) of sea salt, 1/2 tablespoon (3.5 grams) of freshly ground black pepper, 1/4 tablespoon (1.72 grams) of hot paprika, and 1/4 tablespoon (2.46 grams) of garlic powder into an airtight container. Close the lid and shake the container until the ingredients are evenly mixed. Swap your hot paprika with sweet or smokey paprika if you don't like spice. Mix together some herbs if you like traditional Italian seasoning. In an airtight glass jar, mix together 1 1/2 teaspoons (1.52 grams) of dried oregano, 1 teaspoon (0.57 grams) of dried marjoram, 1 teaspoon (0.91 grams) of dried thyme, 1/2 teaspoon (0.25 grams) of dried basil, 1/2 teaspoon (0.29 grams) of dried rosemary, and 1/2 teaspoon (0.34 grams) of dried sage. Store your container in a dry, cool place for up to 1 year or until the herbs begin losing their flavor. Season your fries with your choice of seasoning. Place your fries into a mixing bowl. Start by coating your fries with 3 tablespoons (44 mL) of vegetable oil. Now, sprinkle on your seasoning of choice to taste. Take care to coat your fries as evenly as possible to avoid any chunky or powdery spots. Sprinkle on some corn starch to help your fries get extra crispy. Don't overdo the seasoning—you can add more after baking your fries. Cooking and Serving Your Fries Place your fries onto a baking sheet. If your sheet is not non-stick, spray it evenly with non-stick spray. Dump your fries onto the sheet and arrange them in a single layer. Take care to give them space to avoid overcrowding, which will prevent your fries from crisping. Avoid using aluminum foil or parchment paper, as they produce unreliable results. Bake your fries for 15 minutes and then flip them. Be sure to bake them on the highest oven rack so they can crisp properly. After giving your fries 15 minutes to bake, turn each of them over. If you have a metal spatula or tongs, use them to flip the fries over and avoid getting messy. If you don't have anything, just use your hands. If you have a spatula, scoop up around 10 fries at a time and turn your wrist quickly to flip them. Cook your fries for 10 to 15 more minutes or until crispy. After you flip your fries, wait until they cook all the way through and turn crispy. By observation, a good sign that your fries are done is when they turn from orange to a flat, less shiny color. Make sure they get enough time in the oven or they won't crisp. Don't worry if the edges of the fries are a little brown—this will give them a caramelized taste. Season and serve your fries after cooling them for 5 to 10 minutes. Once your potatoes have had time to cool, they're ready to eat! Take a bite and see how they taste. Add some more of your seasoning of choice to taste, or leave them as is. If you want to have your fries with a meal, try adding them to a nacho platter, pair them with a salad, or eat them alongside a nice burger or steak. Store your baked sweet potato fries in the fridge for 3 to 5 days or in the freezer for 10 to 12 months.",
    "sentences": [
        " Cutting and Seasoning Your Fries Preheat your oven to 425 °F (218 °C).",
        "Electric ovens take about 10 to 15 minutes to preheat, while gas ovens take between 5 to 10 minutes.",
        "Be sure to place the oven rack into the highest position prior to turning your oven on to preheat.",
        "Slice your potatoes into matchsticks.",
        "Start by slicing off one rounded edge of the sweet potato with a kitchen knife and place the cut side down.",
        "Place the knife on top of the potato with one hand gripping the handle and the other resting on the top of the blade.",
        "Firmly press down to cut the potato into planks about 1 inch (2.5 cm) thick.",
        "Now, cut the planks horizontally at the halfway point to make your fries.",
        "Always use the palm of your non-dominant hand to apply downward pressure to the knife when cutting.",
        "Try to cut your fries into even sizes to ensure consistent baking.",
        "Make a chili powder mix for seasoning with just a bit of spice.",
        "Sprinkle 2 tablespoons (16.23 grams) of chili powder, 2 tablespoons (12.17 grams) of ground cumin, 2 tablespoons (34.12 grams) of sea salt, and 2 tablespoons (19.68 grams) of garlic powder into an airtight glass jar.",
        "Now, shake the jar until all of your ingredients are as evenly blended as possible.",
        "Store your seasoning in a cool, dry place for 2 to 3 months or until the spices start losing their flavor.",
        "Create a paprika seasoning if you like your fries spicy.",
        "Place 1/2 tablespoon (8.53 grams) of sea salt, 1/2 tablespoon (3.5 grams) of freshly ground black pepper, 1/4 tablespoon (1.72 grams) of hot paprika, and 1/4 tablespoon (2.46 grams) of garlic powder into an airtight container.",
        "Close the lid and shake the container until the ingredients are evenly mixed.",
        "Swap your hot paprika with sweet or smokey paprika if you don't like spice.",
        "Mix together some herbs if you like traditional Italian seasoning.",
        "In an airtight glass jar, mix together 1 1/2 teaspoons (1.52 grams) of dried oregano, 1 teaspoon (0.57 grams) of dried marjoram, 1 teaspoon (0.91 grams) of dried thyme, 1/2 teaspoon (0.25 grams) of dried basil, 1/2 teaspoon (0.29 grams) of dried rosemary, and 1/2 teaspoon (0.34 grams) of dried sage.",
        "Store your container in a dry, cool place for up to 1 year or until the herbs begin losing their flavor.",
        "Season your fries with your choice of seasoning.",
        "Place your fries into a mixing bowl.",
        "Start by coating your fries with 3 tablespoons (44 mL) of vegetable oil.",
        "Now, sprinkle on your seasoning of choice to taste.",
        "Take care to coat your fries as evenly as possible to avoid any chunky or powdery spots.",
        "Sprinkle on some corn starch to help your fries get extra crispy.",
        "Don't overdo the seasoning—you can add more after baking your fries.",
        "Cooking and Serving Your Fries Place your fries onto a baking sheet.",
        "If your sheet is not non-stick, spray it evenly with non-stick spray.",
        "Dump your fries onto the sheet and arrange them in a single layer.",
        "Take care to give them space to avoid overcrowding, which will prevent your fries from crisping.",
        "Avoid using aluminum foil or parchment paper, as they produce unreliable results.",
        "Bake your fries for 15 minutes and then flip them.",
        "Be sure to bake them on the highest oven rack so they can crisp properly.",
        "After giving your fries 15 minutes to bake, turn each of them over.",
        "If you have a metal spatula or tongs, use them to flip the fries over and avoid getting messy.",
        "If you don't have anything, just use your hands.",
        "If you have a spatula, scoop up around 10 fries at a time and turn your wrist quickly to flip them.",
        "Cook your fries for 10 to 15 more minutes or until crispy.",
        "After you flip your fries, wait until they cook all the way through and turn crispy.",
        "By observation, a good sign that your fries are done is when they turn from orange to a flat, less shiny color.",
        "Make sure they get enough time in the oven or they won't crisp.",
        "Don't worry if the edges of the fries are a little brown—this will give them a caramelized taste.",
        "Season and serve your fries after cooling them for 5 to 10 minutes.",
        "Once your potatoes have had time to cool, they're ready to eat!",
        "Take a bite and see how they taste.",
        "Add some more of your seasoning of choice to taste, or leave them as is.",
        "If you want to have your fries with a meal, try adding them to a nacho platter, pair them with a salad, or eat them alongside a nice burger or steak.",
        "Store your baked sweet potato fries in the fridge for 3 to 5 days or in the freezer for 10 to 12 months."
    ]
}