{
    "title": "How to Season Sausage",
    "url": "https://www.wikihow.com/Season-Sausage",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Sausage"
    ],
    "methods": [
        {
            "name": "Making Your Own Seasoning",
            "steps": [
                {
                    "headline": "Add 1 tbsp (8.4 grams) of garlic and 1 tsp (2.3 grams) of onion into a bowl.",
                    "description": "Measure the onion and garlic into the bowl with the herbs and spices. If you don’t like onion or garlic, simply leave them out. Add this seasoning to 0.9 kilograms (2 pounds) or ground meat. Pork, beef, and turkey work well. Mince the garlic and onion before adding it to the bowl."
                },
                {
                    "headline": "Measure 2 teaspoons (8.4 grams) of your preferred salt into the bowl.",
                    "description": "Salt helps to bring out the flavours in the sausages, preserves the meat, and binds the ingredients together. It is important to use a good quality to salt to ensure that the sausages are well preserved and maintain their taste. Canning salt, kosher flake salt, and purified salt are good options that work well in sausages. Avoid using iodized salt in sausages as it isn’t pure enough."
                },
                {
                    "headline": "Mix in your favourite combination of herbs and spices.",
                    "description": "Ground spices are the best choice when making your own seasoning as they provide an even flavour throughout the sausages. Add a total of 4 teaspoons (7 grams) of your favourite herbs and spices into a bowl and mix all the ingredients together with a spoon. Experiment with different combinations to find your favourite. Paprika, basil, and thyme is a delicious combination. A mixture of sage, marjoram, and chilli works well."
                }
            ]
        },
        {
            "name": "Making a Seasoning for Breakfast Sausages",
            "steps": [
                {
                    "headline": "Measure the herbs and spices into a small bowl.",
                    "description": "Add 2 teaspoons (1.4 grams) of dried sage, 2 teaspoons (8.4 grams) of salt, 1 teaspoon (2 grams) of ground black pepper, 1/4 teaspoon (0.15 grams) of dried marjoram, 1 tablespoon (12.5 grams) of brown sugar, 1/8 teaspoon (0.12 grams)  of crushed red pepper flakes, and 1 pinch of ground cloves into the bowl. If you don’t like spicy sausages, skip the crushed red pepper flakes."
                },
                {
                    "headline": "Stir the herbs and spices with a spoon.",
                    "description": "Mix the ingredients until they are thoroughly combined. This helps the sausages to have an even flavour and texture. If there are any lumps in the mixture, use the back of the spoon to squash them. Alternatively, place the ingredients into a container with a lid and shake the container vigorously for 30 seconds. Make sure that the lid is on tightly before you start shaking!"
                },
                {
                    "headline": "Mix the seasoning and ground pork in a large bowl.",
                    "description": "Place 0.9 kilograms (2 pounds) of ground pork into a bowl and pour the seasoning mixture on top. Use your hands to mix the ingredients together. Keep mixing until the seasoning mixture is evenly distributed through the ground pork. Always wash your hands before and after touching the sausage mixture to avoid contamination. Mixing the meat can be a messy process. Remove any rings before you start mixing to avoid them getting sticky and dirty."
                },
                {
                    "headline": "Store the sausage meat in an airtight container in the fridge for up to 1 week.",
                    "description": "Transfer the seasoned sausage meat to an airtight container or a sealable bag. This will stop the meat from being exposed to the air and going off. Label the container with the date to remind you when it was refrigerated. If you want to use the meat at a later date, place the airtight container into the freezer for up to 3 months. Use this mixture in any recipe requiring sausage meat or seasoning."
                }
            ]
        },
        {
            "name": "Creating an Italian Sausage Seasoning",
            "steps": [
                {
                    "headline": "Place the herbs, spices, garlic, and onion into a bowl.",
                    "description": "Measure 2 teaspoons (3.2 grams) of dried parsley, 2 teaspoons (3.7 grams) of Italian seasoning, 1 1/2 teaspoons (3 grams) of ground black pepper, 1/2 teaspoon (1 gram) of fennel seed, 1/2 teaspoon (1 gram) of paprika, 1 teaspoon (0.96 grams) of red pepper flakes, 2 teaspoons (8.4 grams) of salt, and 1 tablespoon (8.4 grams) of minced garlic into a bowl. Purchase an Italian seasoning from the herb section of the grocery store or from a speciality kitchen shop. If you don’t like spicy food, leave the red pepper flakes out."
                },
                {
                    "headline": "Mix the seasoning until the ingredients are thoroughly combined.",
                    "description": "This helps to disperse the different flavours and will give the sausages a consistent taste. Use a spoon to stir the ingredients and squash any lumps in the mixture. Alternatively, place the ingredients into a container with a lid and shake the container vigorously for 30 seconds. Make sure that the lid is on tightly before you start shaking!"
                },
                {
                    "headline": "Combine the ground beef and the seasoning.",
                    "description": "Place 0.9 kilograms (2 pounds) of ground beef into a large bowl and then sprinkle the seasoning over the top. Use your fingers to disperse the seasoning in the meat. Continue to mix the ingredients until they are combined. Wash your hands before you touch the meat to help avoid any contamination from bacteria. If you don’t want to get your hands dirty, use disposable cooking gloves while you mix the meat and seasoning. Wash your hands before and after touching the meat, even if you use gloves."
                },
                {
                    "headline": "Store the sausage meat in the fridge or freezer if you want to use it later.",
                    "description": "Avoid leaving the sausage meat at room temperature as this risks the meat going off. Place the seasoned sausage meat into an airtight container or a sealable bag and place it in the fridge or freezer. Sausage meat will last 1 week in the fridge, and 3 months in the freezer. Label the container with the date to remind you when it was refrigerated. Use this mixture in any recipe that requires sausage seasoning."
                }
            ]
        }
    ],
    "tyn": [
        "Making Your Own Seasoning",
        "Measuring spoons",
        "Small bowl",
        "Spoon",
        "Making a Seasoning for Breakfast Sausages",
        "Large bowl",
        "Airtight container or sealable bag",
        "Creating an Italian Sausage Seasoning",
        "Disposable cooking gloves (optional)"
    ],
    "text": " Making Your Own Seasoning Add 1 tbsp (8.4 grams) of garlic and 1 tsp (2.3 grams) of onion into a bowl. Measure the onion and garlic into the bowl with the herbs and spices. If you don’t like onion or garlic, simply leave them out. Add this seasoning to 0.9 kilograms (2 pounds) or ground meat. Pork, beef, and turkey work well. Mince the garlic and onion before adding it to the bowl. Measure 2 teaspoons (8.4 grams) of your preferred salt into the bowl. Salt helps to bring out the flavours in the sausages, preserves the meat, and binds the ingredients together. It is important to use a good quality to salt to ensure that the sausages are well preserved and maintain their taste. Canning salt, kosher flake salt, and purified salt are good options that work well in sausages. Avoid using iodized salt in sausages as it isn’t pure enough. Mix in your favourite combination of herbs and spices. Ground spices are the best choice when making your own seasoning as they provide an even flavour throughout the sausages. Add a total of 4 teaspoons (7 grams) of your favourite herbs and spices into a bowl and mix all the ingredients together with a spoon. Experiment with different combinations to find your favourite. Paprika, basil, and thyme is a delicious combination. A mixture of sage, marjoram, and chilli works well. Making a Seasoning for Breakfast Sausages Measure the herbs and spices into a small bowl. Add 2 teaspoons (1.4 grams) of dried sage, 2 teaspoons (8.4 grams) of salt, 1 teaspoon (2 grams) of ground black pepper, 1/4 teaspoon (0.15 grams) of dried marjoram, 1 tablespoon (12.5 grams) of brown sugar, 1/8 teaspoon (0.12 grams)  of crushed red pepper flakes, and 1 pinch of ground cloves into the bowl. If you don’t like spicy sausages, skip the crushed red pepper flakes. Stir the herbs and spices with a spoon. Mix the ingredients until they are thoroughly combined. This helps the sausages to have an even flavour and texture. If there are any lumps in the mixture, use the back of the spoon to squash them. Alternatively, place the ingredients into a container with a lid and shake the container vigorously for 30 seconds. Make sure that the lid is on tightly before you start shaking! Mix the seasoning and ground pork in a large bowl. Place 0.9 kilograms (2 pounds) of ground pork into a bowl and pour the seasoning mixture on top. Use your hands to mix the ingredients together. Keep mixing until the seasoning mixture is evenly distributed through the ground pork. Always wash your hands before and after touching the sausage mixture to avoid contamination. Mixing the meat can be a messy process. Remove any rings before you start mixing to avoid them getting sticky and dirty. Store the sausage meat in an airtight container in the fridge for up to 1 week. Transfer the seasoned sausage meat to an airtight container or a sealable bag. This will stop the meat from being exposed to the air and going off. Label the container with the date to remind you when it was refrigerated. If you want to use the meat at a later date, place the airtight container into the freezer for up to 3 months. Use this mixture in any recipe requiring sausage meat or seasoning. Creating an Italian Sausage Seasoning Place the herbs, spices, garlic, and onion into a bowl. Measure 2 teaspoons (3.2 grams) of dried parsley, 2 teaspoons (3.7 grams) of Italian seasoning, 1 1/2 teaspoons (3 grams) of ground black pepper, 1/2 teaspoon (1 gram) of fennel seed, 1/2 teaspoon (1 gram) of paprika, 1 teaspoon (0.96 grams) of red pepper flakes, 2 teaspoons (8.4 grams) of salt, and 1 tablespoon (8.4 grams) of minced garlic into a bowl. Purchase an Italian seasoning from the herb section of the grocery store or from a speciality kitchen shop. If you don’t like spicy food, leave the red pepper flakes out. Mix the seasoning until the ingredients are thoroughly combined. This helps to disperse the different flavours and will give the sausages a consistent taste. Use a spoon to stir the ingredients and squash any lumps in the mixture. Alternatively, place the ingredients into a container with a lid and shake the container vigorously for 30 seconds. Make sure that the lid is on tightly before you start shaking! Combine the ground beef and the seasoning. Place 0.9 kilograms (2 pounds) of ground beef into a large bowl and then sprinkle the seasoning over the top. Use your fingers to disperse the seasoning in the meat. Continue to mix the ingredients until they are combined. Wash your hands before you touch the meat to help avoid any contamination from bacteria. If you don’t want to get your hands dirty, use disposable cooking gloves while you mix the meat and seasoning. Wash your hands before and after touching the meat, even if you use gloves. Store the sausage meat in the fridge or freezer if you want to use it later. Avoid leaving the sausage meat at room temperature as this risks the meat going off. Place the seasoned sausage meat into an airtight container or a sealable bag and place it in the fridge or freezer. Sausage meat will last 1 week in the fridge, and 3 months in the freezer. Label the container with the date to remind you when it was refrigerated. Use this mixture in any recipe that requires sausage seasoning.",
    "sentences": [
        " Making Your Own Seasoning Add 1 tbsp (8.4 grams) of garlic and 1 tsp (2.3 grams) of onion into a bowl.",
        "Measure the onion and garlic into the bowl with the herbs and spices.",
        "If you don’t like onion or garlic, simply leave them out.",
        "Add this seasoning to 0.9 kilograms (2 pounds) or ground meat.",
        "Pork, beef, and turkey work well.",
        "Mince the garlic and onion before adding it to the bowl.",
        "Measure 2 teaspoons (8.4 grams) of your preferred salt into the bowl.",
        "Salt helps to bring out the flavours in the sausages, preserves the meat, and binds the ingredients together.",
        "It is important to use a good quality to salt to ensure that the sausages are well preserved and maintain their taste.",
        "Canning salt, kosher flake salt, and purified salt are good options that work well in sausages.",
        "Avoid using iodized salt in sausages as it isn’t pure enough.",
        "Mix in your favourite combination of herbs and spices.",
        "Ground spices are the best choice when making your own seasoning as they provide an even flavour throughout the sausages.",
        "Add a total of 4 teaspoons (7 grams) of your favourite herbs and spices into a bowl and mix all the ingredients together with a spoon.",
        "Experiment with different combinations to find your favourite.",
        "Paprika, basil, and thyme is a delicious combination.",
        "A mixture of sage, marjoram, and chilli works well.",
        "Making a Seasoning for Breakfast Sausages Measure the herbs and spices into a small bowl.",
        "Add 2 teaspoons (1.4 grams) of dried sage, 2 teaspoons (8.4 grams) of salt, 1 teaspoon (2 grams) of ground black pepper, 1/4 teaspoon (0.15 grams) of dried marjoram, 1 tablespoon (12.5 grams) of brown sugar, 1/8 teaspoon (0.12 grams)  of crushed red pepper flakes, and 1 pinch of ground cloves into the bowl.",
        "If you don’t like spicy sausages, skip the crushed red pepper flakes.",
        "Stir the herbs and spices with a spoon.",
        "Mix the ingredients until they are thoroughly combined.",
        "This helps the sausages to have an even flavour and texture.",
        "If there are any lumps in the mixture, use the back of the spoon to squash them.",
        "Alternatively, place the ingredients into a container with a lid and shake the container vigorously for 30 seconds.",
        "Make sure that the lid is on tightly before you start shaking!",
        "Mix the seasoning and ground pork in a large bowl.",
        "Place 0.9 kilograms (2 pounds) of ground pork into a bowl and pour the seasoning mixture on top.",
        "Use your hands to mix the ingredients together.",
        "Keep mixing until the seasoning mixture is evenly distributed through the ground pork.",
        "Always wash your hands before and after touching the sausage mixture to avoid contamination.",
        "Mixing the meat can be a messy process.",
        "Remove any rings before you start mixing to avoid them getting sticky and dirty.",
        "Store the sausage meat in an airtight container in the fridge for up to 1 week.",
        "Transfer the seasoned sausage meat to an airtight container or a sealable bag.",
        "This will stop the meat from being exposed to the air and going off.",
        "Label the container with the date to remind you when it was refrigerated.",
        "If you want to use the meat at a later date, place the airtight container into the freezer for up to 3 months.",
        "Use this mixture in any recipe requiring sausage meat or seasoning.",
        "Creating an Italian Sausage Seasoning Place the herbs, spices, garlic, and onion into a bowl.",
        "Measure 2 teaspoons (3.2 grams) of dried parsley, 2 teaspoons (3.7 grams) of Italian seasoning, 1 1/2 teaspoons (3 grams) of ground black pepper, 1/2 teaspoon (1 gram) of fennel seed, 1/2 teaspoon (1 gram) of paprika, 1 teaspoon (0.96 grams) of red pepper flakes, 2 teaspoons (8.4 grams) of salt, and 1 tablespoon (8.4 grams) of minced garlic into a bowl.",
        "Purchase an Italian seasoning from the herb section of the grocery store or from a speciality kitchen shop.",
        "If you don’t like spicy food, leave the red pepper flakes out.",
        "Mix the seasoning until the ingredients are thoroughly combined.",
        "This helps to disperse the different flavours and will give the sausages a consistent taste.",
        "Use a spoon to stir the ingredients and squash any lumps in the mixture.",
        "Alternatively, place the ingredients into a container with a lid and shake the container vigorously for 30 seconds.",
        "Make sure that the lid is on tightly before you start shaking!",
        "Combine the ground beef and the seasoning.",
        "Place 0.9 kilograms (2 pounds) of ground beef into a large bowl and then sprinkle the seasoning over the top.",
        "Use your fingers to disperse the seasoning in the meat.",
        "Continue to mix the ingredients until they are combined.",
        "Wash your hands before you touch the meat to help avoid any contamination from bacteria.",
        "If you don’t want to get your hands dirty, use disposable cooking gloves while you mix the meat and seasoning.",
        "Wash your hands before and after touching the meat, even if you use gloves.",
        "Store the sausage meat in the fridge or freezer if you want to use it later.",
        "Avoid leaving the sausage meat at room temperature as this risks the meat going off.",
        "Place the seasoned sausage meat into an airtight container or a sealable bag and place it in the fridge or freezer.",
        "Sausage meat will last 1 week in the fridge, and 3 months in the freezer.",
        "Label the container with the date to remind you when it was refrigerated.",
        "Use this mixture in any recipe that requires sausage seasoning."
    ]
}