{
    "title": "How to Make a Money Tree",
    "url": "https://www.wikihow.com/Make-a-Money-Tree",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Paper Craft"
    ],
    "methods": [
        {
            "name": "For a Wedding or Milestone Party",
            "steps": [
                {
                    "headline": "Choose a type of tree to coordinate with the festivities.",
                    "description": "Of course, a real tree is standard, but any material will do. Pine or Cedar is a fun option for a winter gathering. Palm is ideal for a beach-themed party. Ficus, grapevines, and miniature arbors all make sturdy pieces. For a more modern feel, opt for wire."
                },
                {
                    "headline": "Form the tree into a suitable shape.",
                    "description": "It should be round from all angles. File all sharp edges. You don't want your philanthropic guests to hurt themselves. Hot glue any extra branches to add fullness."
                },
                {
                    "headline": "Choose and decorate your base.",
                    "description": "A clay pot is traditional, though any base that holds the tree in place is fine. Paint your base to match the theme of your event. Add words, pictures, or a quote, if desired."
                },
                {
                    "headline": "Place the branch upright in the base.",
                    "description": "Fill with sand, marbles, floral foam, or any heavy filler. The branch should be centered and immobile. If using floral foam, insert the foam into the base before inserting the branch."
                },
                {
                    "headline": "Decorate the branch.",
                    "description": "Go wild with your imagination! It should be subtle, yet intriguing. You could:\nSpray paint the branch in a coordinating color\nAdd ribbons to the smaller branches\nWeave strings of beads or lights in and out of the tree\nClip on small pictures\nA money tree should not be a solicitation for donations. It should be a centerpiece, not the center of attention."
                },
                {
                    "headline": "Add clips to the money tree.",
                    "description": "Guests will use these to attach their envelopes. Have extras near the base of the tree for late additions. Keep pens and notes nearby for guests to clip on well wishes, too. Attach a few envelopes at random to clarify the purpose of the tree."
                },
                {
                    "headline": "Place the tree near the other gifts.",
                    "description": "It should not be front and center; guests will simply have this as an alternative to gift-giving. Have friends or family explain that the tree is used as an option for guests -- no cash gift is mandatory and the smallest amount is appreciated."
                },
                {
                    "headline": "Add a poem or verse near the base of the tree.",
                    "description": "Some guests may be unfamiliar with the concept. Make it clear that giving is optional."
                },
                {
                    "headline": "Finished!",
                    "description": "Enjoy your money tree. Do not call attention to the tree. It should be discreet and elegant, not an expectation of giving. Have a family member spread the word. This is more polite and respectful. Announcing the process during a toast would be a breach of etiquette."
                }
            ]
        },
        {
            "name": "As a Gift",
            "steps": [
                {
                    "headline": "Decide whether to use a real tree, potted tree, or artificial tree.",
                    "description": "Consider the guest of honor and what materials you have at your disposal. If using a branch from a living tree, make sure to wash and dry out the branch before potting. Leave the branch in your garage and give bugs time to escape."
                },
                {
                    "headline": "Place the branch in an attractive basket or pot.",
                    "description": "It should be deep enough for the branch to stay upright. Feel free to decorate the base yourself. Spray paint the base before you insert the branch and allow time for it to dry."
                },
                {
                    "headline": "Add decorations to your money tree.",
                    "description": "Coordinate with the occasion and the recipient. Some possibilities:\nRibbons\nLights\nTulle\nPictures\nGlitter"
                },
                {
                    "headline": "Attach bills to the branches using clips.",
                    "description": "Using $1 bills will give the tree a fuller, more eye-catching look. Fold the bills in any shape. One-quarter inch folds are typical, but this is a case where you could let your origami skills shine! As an alternative, roll up the bills and tie them to the branches with ribbon or floral wire."
                },
                {
                    "headline": "Finished!",
                    "description": "Your tree is ready!"
                }
            ]
        }
    ],
    "tyn": [
        "Creating a Tree with Money Flowers",
        "Dollar bills",
        "Thin wire",
        "Wire cutters",
        "Fake or real branch",
        "Plaster",
        "Water",
        "Tin can",
        "Vase",
        "Paper",
        "Hot glue gun",
        "Chocolate coins",
        "Hot glue",
        "Planting a Money Tree in Animal Crossing",
        "Nintendo Switch"
    ],
    "text": " For a Wedding or Milestone Party Choose a type of tree to coordinate with the festivities. Of course, a real tree is standard, but any material will do. Pine or Cedar is a fun option for a winter gathering. Palm is ideal for a beach-themed party. Ficus, grapevines, and miniature arbors all make sturdy pieces. For a more modern feel, opt for wire. Form the tree into a suitable shape. It should be round from all angles. File all sharp edges. You don't want your philanthropic guests to hurt themselves. Hot glue any extra branches to add fullness. Choose and decorate your base. A clay pot is traditional, though any base that holds the tree in place is fine. Paint your base to match the theme of your event. Add words, pictures, or a quote, if desired. Place the branch upright in the base. Fill with sand, marbles, floral foam, or any heavy filler. The branch should be centered and immobile. If using floral foam, insert the foam into the base before inserting the branch. Decorate the branch. Go wild with your imagination! It should be subtle, yet intriguing. You could:\nSpray paint the branch in a coordinating color\nAdd ribbons to the smaller branches\nWeave strings of beads or lights in and out of the tree\nClip on small pictures\nA money tree should not be a solicitation for donations. It should be a centerpiece, not the center of attention. Add clips to the money tree. Guests will use these to attach their envelopes. Have extras near the base of the tree for late additions. Keep pens and notes nearby for guests to clip on well wishes, too. Attach a few envelopes at random to clarify the purpose of the tree. Place the tree near the other gifts. It should not be front and center; guests will simply have this as an alternative to gift-giving. Have friends or family explain that the tree is used as an option for guests -- no cash gift is mandatory and the smallest amount is appreciated. Add a poem or verse near the base of the tree. Some guests may be unfamiliar with the concept. Make it clear that giving is optional. Finished! Enjoy your money tree. Do not call attention to the tree. It should be discreet and elegant, not an expectation of giving. Have a family member spread the word. This is more polite and respectful. Announcing the process during a toast would be a breach of etiquette. As a Gift Decide whether to use a real tree, potted tree, or artificial tree. Consider the guest of honor and what materials you have at your disposal. If using a branch from a living tree, make sure to wash and dry out the branch before potting. Leave the branch in your garage and give bugs time to escape. Place the branch in an attractive basket or pot. It should be deep enough for the branch to stay upright. Feel free to decorate the base yourself. Spray paint the base before you insert the branch and allow time for it to dry. Add decorations to your money tree. Coordinate with the occasion and the recipient. Some possibilities:\nRibbons\nLights\nTulle\nPictures\nGlitter Attach bills to the branches using clips. Using $1 bills will give the tree a fuller, more eye-catching look. Fold the bills in any shape. One-quarter inch folds are typical, but this is a case where you could let your origami skills shine! As an alternative, roll up the bills and tie them to the branches with ribbon or floral wire. Finished! Your tree is ready!",
    "sentences": [
        " For a Wedding or Milestone Party Choose a type of tree to coordinate with the festivities.",
        "Of course, a real tree is standard, but any material will do.",
        "Pine or Cedar is a fun option for a winter gathering.",
        "Palm is ideal for a beach-themed party.",
        "Ficus, grapevines, and miniature arbors all make sturdy pieces.",
        "For a more modern feel, opt for wire.",
        "Form the tree into a suitable shape.",
        "It should be round from all angles.",
        "File all sharp edges.",
        "You don't want your philanthropic guests to hurt themselves.",
        "Hot glue any extra branches to add fullness.",
        "Choose and decorate your base.",
        "A clay pot is traditional, though any base that holds the tree in place is fine.",
        "Paint your base to match the theme of your event.",
        "Add words, pictures, or a quote, if desired.",
        "Place the branch upright in the base.",
        "Fill with sand, marbles, floral foam, or any heavy filler.",
        "The branch should be centered and immobile.",
        "If using floral foam, insert the foam into the base before inserting the branch.",
        "Decorate the branch.",
        "Go wild with your imagination!",
        "It should be subtle, yet intriguing.",
        "You could:\nSpray paint the branch in a coordinating color\nAdd ribbons to the smaller branches\nWeave strings of beads or lights in and out of the tree\nClip on small pictures\nA money tree should not be a solicitation for donations.",
        "It should be a centerpiece, not the center of attention.",
        "Add clips to the money tree.",
        "Guests will use these to attach their envelopes.",
        "Have extras near the base of the tree for late additions.",
        "Keep pens and notes nearby for guests to clip on well wishes, too.",
        "Attach a few envelopes at random to clarify the purpose of the tree.",
        "Place the tree near the other gifts.",
        "It should not be front and center; guests will simply have this as an alternative to gift-giving.",
        "Have friends or family explain that the tree is used as an option for guests -- no cash gift is mandatory and the smallest amount is appreciated.",
        "Add a poem or verse near the base of the tree.",
        "Some guests may be unfamiliar with the concept.",
        "Make it clear that giving is optional.",
        "Finished!",
        "Enjoy your money tree.",
        "Do not call attention to the tree.",
        "It should be discreet and elegant, not an expectation of giving.",
        "Have a family member spread the word.",
        "This is more polite and respectful.",
        "Announcing the process during a toast would be a breach of etiquette.",
        "As a Gift Decide whether to use a real tree, potted tree, or artificial tree.",
        "Consider the guest of honor and what materials you have at your disposal.",
        "If using a branch from a living tree, make sure to wash and dry out the branch before potting.",
        "Leave the branch in your garage and give bugs time to escape.",
        "Place the branch in an attractive basket or pot.",
        "It should be deep enough for the branch to stay upright.",
        "Feel free to decorate the base yourself.",
        "Spray paint the base before you insert the branch and allow time for it to dry.",
        "Add decorations to your money tree.",
        "Coordinate with the occasion and the recipient.",
        "Some possibilities:\nRibbons\nLights\nTulle\nPictures\nGlitter Attach bills to the branches using clips.",
        "Using $1 bills will give the tree a fuller, more eye-catching look.",
        "Fold the bills in any shape.",
        "One-quarter inch folds are typical, but this is a case where you could let your origami skills shine!",
        "As an alternative, roll up the bills and tie them to the branches with ribbon or floral wire.",
        "Finished!",
        "Your tree is ready!"
    ]
}