{
    "title": "How to Give a Shoulder Massage",
    "url": "https://www.wikihow.com/Give-a-Shoulder-Massage",
    "category_hierarchy": [
        "Personal Care and Style",
        "Massage"
    ],
    "methods": [
        {
            "name": "Relieving Tension in the Shoulder Muscles",
            "steps": [
                {
                    "headline": "Have your recipient sit down in front of you with their back to you.",
                    "description": "Stand close enough to them so that you can easily reach both of their shoulders while keeping a little bend in your arms. This is the simplest and most effective position for performing a shoulder massage. If there isn’t a chair around, you can also have your recipient sit cross-legged on the edge of a bed or similar perch. Leave a little space between your recipient’s body and your own. Standing too close will make it difficult to work, and could make the other person uncomfortable."
                },
                {
                    "headline": "Form a loose “C” shape with both hands.",
                    "description": "Extend your thumbs while pulling your fingers together and curling them slightly. Keep the top joint of each of your fingers straight—most of the bend should be in your third knuckles, where your fingers meet your palms. Your hands will remain in this same position throughout the massage. If needed, you can adjust your grip a little once you get started to better mold them to your recipient’s shoulders."
                },
                {
                    "headline": "Drape your hands over your recipient’s shoulders.",
                    "description": "Maintaining the “C” shape, turn your hands over so that your fingers point downwards. Slide your hands all the way down so that the webbing of your thumbs rests over the tops of their shoulders. Feel for the smooth contour of the muscles just above the collarbones with your fingertips. If your recipient has long hair, brush it out of the way or ask them to put it up so it doesn’t get pulled accidentally during the massage. This hand position is sometimes called the “claw” or “duck” grip.Tip: The muscles in the upper part of the shoulders are known as the trapezius muscles. They’ll be your primary focus during a shoulder rub."
                },
                {
                    "headline": "Draw the muscles upwards with gentle, consistent pressure.",
                    "description": "Press the tips of your fingers and thumbs into the trapezius from both sides, starting at the inside of the shoulders closest to the neck. Roll the muscles up towards your recipient's collarbones without releasing your grip. The idea is to squeeze and lift instead of clamping down forcefully with your fingers. Relying on your whole arm rather than just your fingers will help reduce fatigue and prevent you from being too rough in sensitive spots, making the experience more comfortable for both you and your recipient."
                },
                {
                    "headline": "Raise and lower your forearms and elbows with slow, smooth motions.",
                    "description": "As you massage, try to get into a regular rhythm—bring your arms come up and loosen your grip, then lower them and channel the movement into small pulses of your fingers. Finding a comfortable rhythm will allow you to massage with proper technique for much longer. Don't get in a hurry. The slower you go, the better it will feel."
                },
                {
                    "headline": "Go over the entire length of the shoulders.",
                    "description": "After kneading the inner part of the trapezius for a few minutes, gradually spread your hands out towards your recipient’s arms. Then, change direction and work your way back towards the neck. Continue in this fashion until your recipient is relaxed, refreshed, and tension-free. Stop short of the bony protrusions of the shoulder joints themselves. Pressing directly on bones or joints can be painful. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Morales, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Massage Therapist\t\t\t\t\t\t\t\tMarty Morales is a Professional Massage Therapist and the Founder and Owner of the Morales Method, a manual therapy and body conditioning business based in the San Francisco Bay Area and in Los Angeles, California. Marty has over 16 years of massage therapist experience and over 13 years of experience educating others on the best practices for massage therapy. Marty has over 10,000 hours of private practice logged and is a Certified Advanced Rolfer and Rolf Movement Practitioner, CMT. He has an MBA in Finance from Loyola Marymount University, Los Angeles. Marty Morales, MBA\t\t\tProfessional Massage Therapist\t\t\t\tA common mistake when giving a shoulder massage is using too much muscle. If you put too much of your muscle behind giving the massage, you might give a great massage, but then you're sore and exhausted afterward. You should also avoid over-using your thumbs, which can make both you and your client hurt or sore."
                }
            ]
        },
        {
            "name": "Massaging Surrounding Areas",
            "steps": [
                {
                    "headline": "Move down into the space between the recipient’s shoulder blades.",
                    "description": "After massaging the tops of the trapezius muscles, begin lowering your hands steadily, tracing the inner grooves of the shoulder blades (also known as the scapula) with your thumbs. Follow along the spine as you palpate the interior of the blades from top to bottom. While your thumbs are busy, stretch your remaining fingers flat against your recipient’s upper back and use them to brace yourself. Turning your wrists inward with each movement will make it easier to probe down deep into those hard-to-reach spots.Warning: The area between and underneath the shoulder blades can be quite tender. Work slowly and pay attention to your recipient's reactions to avoid causing discomfort."
                },
                {
                    "headline": "Massage the shoulder blades themselves with a light touch.",
                    "description": "Glide the pads of your thumbs over the flat part of the shoulder blades in wide, sweeping circles. Make sure you apply minimal pressure, as the scapula are surrounded by sensitive connective tissue. Go over every part of the blade before moving on. Alternatively, you can try stroking your fingers or thumbs upward over the lattice of muscles from the bottom. The surface of the shoulder blades are criss-crossed with small muscles that assist in retracting the arms. When rubbed just right, this region can be extremely pleasurable."
                },
                {
                    "headline": "Use both hands to target spots that need more attention.",
                    "description": "If your recipient asks you to really dig into a particular area, using both hands will allow you to double the amount of pressure you generate. Place your hands side-by-side and proceed to massage the way your normally would, pinching, pulling, and lifting your hands as a single unit. To pinpoint single spots within the muscle, use the fingertips of your opposite hand to reinforce the pressure created by your thumb. You’ll have quite a bit more leverage with two hands, so try not to overdo it. Get a feel for your recipient’s preferred level of pressure and adjust your technique accordingly. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Morales, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Massage Therapist\t\t\t\t\t\t\t\tMarty Morales is a Professional Massage Therapist and the Founder and Owner of the Morales Method, a manual therapy and body conditioning business based in the San Francisco Bay Area and in Los Angeles, California. Marty has over 16 years of massage therapist experience and over 13 years of experience educating others on the best practices for massage therapy. Marty has over 10,000 hours of private practice logged and is a Certified Advanced Rolfer and Rolf Movement Practitioner, CMT. He has an MBA in Finance from Loyola Marymount University, Los Angeles. Marty Morales, MBA\t\t\tProfessional Massage Therapist\t\t\t\tUse different techniques to relax their muscles. If it's taking too much of your energy to have your client lying down, have them sit while you stand. Or you can try using your elbows instead of your hands. For a unique approach, you can use your feet similar to a technique they use in Thailand."
                },
                {
                    "headline": "Knead the muscles of the neck.",
                    "description": "Make a “C” shape with your hand the way you did when massaging the trapezius muscles. Squeeze the long extensor muscles on the sides of the neck between your thumb and fingers as you slowly pull your hand back and down with a circular motion, then release and repeat. You can do this all the way up to the base of the skull. To get a sense of what your grip on the neck should feel like, imagine that you’re trying to pick up a football with one hand. Avoid pinching or scraping your fingers over the skin on your recipient’s neck. You want your fingers to stay where they are and gently draw the skin back."
                },
                {
                    "headline": "Squeeze the outer shoulders from the sides.",
                    "description": "As you’re finishing up the massage, slide your hands down over your recipient’s upper arms and give them a good squeeze. This will help loosen up the deltoid muscles. Concentrate on the area between the shoulder joints and the biceps. Press the tips of your fingers and thumbs into the contours of the muscles at the front and back of the arm."
                }
            ]
        },
        {
            "name": "Performing Some Easy Self-Massage",
            "steps": [
                {
                    "headline": "Relax your shoulders and lower your head to gently stretch your neck.",
                    "description": "Un-hunch your shoulders and let them fall while dropping the point of your chin towards your chest. Focus on releasing any tension that you’ve been holding onto in your neck and upper back. After few moments, tilt your head to one side and then the other to lengthen the sides of your neck. Take your time and let everything relax gradually. Don’t force the stretch, as this could cause discomfort or even result in a pulled muscle. A quick neck stretch will help relieve tightness in the muscles around the shoulders, getting them ready for more intensive massage techniques."
                },
                {
                    "headline": "Apply pressure to the base of your neck with your fingertips.",
                    "description": "Bring the index, middle, and ring fingers of your dominant hand together and reach them around to settle on the spot where the muscles of the neck and shoulders meet. Press straight down firmly and hold this position for 10-30 seconds. You should be able to feel the muscles begin to soften beneath your touch after a few seconds.Warning: Avoid pressing directly on the spine itself. You want your fingers to stay just above the bony node of the top vertebra."
                },
                {
                    "headline": "Use one hand to knead the muscles in your opposite shoulder.",
                    "description": "Raise your right hand to your left shoulder and pinch your trapezius muscle between your thumb and remaining fingers. Apply steady pressure for 10-30 seconds, or slowly rotate your shoulder forward and back in a circular motion to mimic the rhythmic pulling action of a traditional massage. When you’re done, use your left hand to repeat the same technique on your right shoulder. Be sure to work the entire trapezius muscle, from the side of your neck to the outer edge of your shoulder. To avoid squeezing too hard, try adjusting the amount of pressure you use until you find a sweet spot and stick with it."
                },
                {
                    "headline": "Sweep your fingers along the trapezius to loosen the fascia.",
                    "description": "Lay the same three fingers you used to hold the pressure point in the back of your neck flat across your upper shoulder. Then, press down lightly and drag them smoothly along the surface of the muscle towards your arm a few times. This will promote beneficial blood flow to the fascia, or the connective tissue surrounding the shoulder muscles. This is a finishing technique, so there’s no need to use a lot of force or try to penetrate down deep into the muscle. Just go over the area few times and relish the relief it creates. Wrap up your self-massage by rolling your shoulders back and forth or stretching your neck out once again."
                }
            ]
        }
    ],
    "tyn": [
        "Chair or other seat",
        "Massage oil or lotion (optional)",
        "Soothing music (optional)"
    ],
    "text": " Relieving Tension in the Shoulder Muscles Have your recipient sit down in front of you with their back to you. Stand close enough to them so that you can easily reach both of their shoulders while keeping a little bend in your arms. This is the simplest and most effective position for performing a shoulder massage. If there isn’t a chair around, you can also have your recipient sit cross-legged on the edge of a bed or similar perch. Leave a little space between your recipient’s body and your own. Standing too close will make it difficult to work, and could make the other person uncomfortable. Form a loose “C” shape with both hands. Extend your thumbs while pulling your fingers together and curling them slightly. Keep the top joint of each of your fingers straight—most of the bend should be in your third knuckles, where your fingers meet your palms. Your hands will remain in this same position throughout the massage. If needed, you can adjust your grip a little once you get started to better mold them to your recipient’s shoulders. Drape your hands over your recipient’s shoulders. Maintaining the “C” shape, turn your hands over so that your fingers point downwards. Slide your hands all the way down so that the webbing of your thumbs rests over the tops of their shoulders. Feel for the smooth contour of the muscles just above the collarbones with your fingertips. If your recipient has long hair, brush it out of the way or ask them to put it up so it doesn’t get pulled accidentally during the massage. This hand position is sometimes called the “claw” or “duck” grip.Tip: The muscles in the upper part of the shoulders are known as the trapezius muscles. They’ll be your primary focus during a shoulder rub. Draw the muscles upwards with gentle, consistent pressure. Press the tips of your fingers and thumbs into the trapezius from both sides, starting at the inside of the shoulders closest to the neck. Roll the muscles up towards your recipient's collarbones without releasing your grip. The idea is to squeeze and lift instead of clamping down forcefully with your fingers. Relying on your whole arm rather than just your fingers will help reduce fatigue and prevent you from being too rough in sensitive spots, making the experience more comfortable for both you and your recipient. Raise and lower your forearms and elbows with slow, smooth motions. As you massage, try to get into a regular rhythm—bring your arms come up and loosen your grip, then lower them and channel the movement into small pulses of your fingers. Finding a comfortable rhythm will allow you to massage with proper technique for much longer. Don't get in a hurry. The slower you go, the better it will feel. Go over the entire length of the shoulders. After kneading the inner part of the trapezius for a few minutes, gradually spread your hands out towards your recipient’s arms. Then, change direction and work your way back towards the neck. Continue in this fashion until your recipient is relaxed, refreshed, and tension-free. Stop short of the bony protrusions of the shoulder joints themselves. Pressing directly on bones or joints can be painful. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Morales, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Massage Therapist\t\t\t\t\t\t\t\tMarty Morales is a Professional Massage Therapist and the Founder and Owner of the Morales Method, a manual therapy and body conditioning business based in the San Francisco Bay Area and in Los Angeles, California. Marty has over 16 years of massage therapist experience and over 13 years of experience educating others on the best practices for massage therapy. Marty has over 10,000 hours of private practice logged and is a Certified Advanced Rolfer and Rolf Movement Practitioner, CMT. He has an MBA in Finance from Loyola Marymount University, Los Angeles. Marty Morales, MBA\t\t\tProfessional Massage Therapist\t\t\t\tA common mistake when giving a shoulder massage is using too much muscle. If you put too much of your muscle behind giving the massage, you might give a great massage, but then you're sore and exhausted afterward. You should also avoid over-using your thumbs, which can make both you and your client hurt or sore. Massaging Surrounding Areas Move down into the space between the recipient’s shoulder blades. After massaging the tops of the trapezius muscles, begin lowering your hands steadily, tracing the inner grooves of the shoulder blades (also known as the scapula) with your thumbs. Follow along the spine as you palpate the interior of the blades from top to bottom. While your thumbs are busy, stretch your remaining fingers flat against your recipient’s upper back and use them to brace yourself. Turning your wrists inward with each movement will make it easier to probe down deep into those hard-to-reach spots.Warning: The area between and underneath the shoulder blades can be quite tender. Work slowly and pay attention to your recipient's reactions to avoid causing discomfort. Massage the shoulder blades themselves with a light touch. Glide the pads of your thumbs over the flat part of the shoulder blades in wide, sweeping circles. Make sure you apply minimal pressure, as the scapula are surrounded by sensitive connective tissue. Go over every part of the blade before moving on. Alternatively, you can try stroking your fingers or thumbs upward over the lattice of muscles from the bottom. The surface of the shoulder blades are criss-crossed with small muscles that assist in retracting the arms. When rubbed just right, this region can be extremely pleasurable. Use both hands to target spots that need more attention. If your recipient asks you to really dig into a particular area, using both hands will allow you to double the amount of pressure you generate. Place your hands side-by-side and proceed to massage the way your normally would, pinching, pulling, and lifting your hands as a single unit. To pinpoint single spots within the muscle, use the fingertips of your opposite hand to reinforce the pressure created by your thumb. You’ll have quite a bit more leverage with two hands, so try not to overdo it. Get a feel for your recipient’s preferred level of pressure and adjust your technique accordingly. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Morales, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Massage Therapist\t\t\t\t\t\t\t\tMarty Morales is a Professional Massage Therapist and the Founder and Owner of the Morales Method, a manual therapy and body conditioning business based in the San Francisco Bay Area and in Los Angeles, California. Marty has over 16 years of massage therapist experience and over 13 years of experience educating others on the best practices for massage therapy. Marty has over 10,000 hours of private practice logged and is a Certified Advanced Rolfer and Rolf Movement Practitioner, CMT. He has an MBA in Finance from Loyola Marymount University, Los Angeles. Marty Morales, MBA\t\t\tProfessional Massage Therapist\t\t\t\tUse different techniques to relax their muscles. If it's taking too much of your energy to have your client lying down, have them sit while you stand. Or you can try using your elbows instead of your hands. For a unique approach, you can use your feet similar to a technique they use in Thailand. Knead the muscles of the neck. Make a “C” shape with your hand the way you did when massaging the trapezius muscles. Squeeze the long extensor muscles on the sides of the neck between your thumb and fingers as you slowly pull your hand back and down with a circular motion, then release and repeat. You can do this all the way up to the base of the skull. To get a sense of what your grip on the neck should feel like, imagine that you’re trying to pick up a football with one hand. Avoid pinching or scraping your fingers over the skin on your recipient’s neck. You want your fingers to stay where they are and gently draw the skin back. Squeeze the outer shoulders from the sides. As you’re finishing up the massage, slide your hands down over your recipient’s upper arms and give them a good squeeze. This will help loosen up the deltoid muscles. Concentrate on the area between the shoulder joints and the biceps. Press the tips of your fingers and thumbs into the contours of the muscles at the front and back of the arm. Performing Some Easy Self-Massage Relax your shoulders and lower your head to gently stretch your neck. Un-hunch your shoulders and let them fall while dropping the point of your chin towards your chest. Focus on releasing any tension that you’ve been holding onto in your neck and upper back. After few moments, tilt your head to one side and then the other to lengthen the sides of your neck. Take your time and let everything relax gradually. Don’t force the stretch, as this could cause discomfort or even result in a pulled muscle. A quick neck stretch will help relieve tightness in the muscles around the shoulders, getting them ready for more intensive massage techniques. Apply pressure to the base of your neck with your fingertips. Bring the index, middle, and ring fingers of your dominant hand together and reach them around to settle on the spot where the muscles of the neck and shoulders meet. Press straight down firmly and hold this position for 10-30 seconds. You should be able to feel the muscles begin to soften beneath your touch after a few seconds.Warning: Avoid pressing directly on the spine itself. You want your fingers to stay just above the bony node of the top vertebra. Use one hand to knead the muscles in your opposite shoulder. Raise your right hand to your left shoulder and pinch your trapezius muscle between your thumb and remaining fingers. Apply steady pressure for 10-30 seconds, or slowly rotate your shoulder forward and back in a circular motion to mimic the rhythmic pulling action of a traditional massage. When you’re done, use your left hand to repeat the same technique on your right shoulder. Be sure to work the entire trapezius muscle, from the side of your neck to the outer edge of your shoulder. To avoid squeezing too hard, try adjusting the amount of pressure you use until you find a sweet spot and stick with it. Sweep your fingers along the trapezius to loosen the fascia. Lay the same three fingers you used to hold the pressure point in the back of your neck flat across your upper shoulder. Then, press down lightly and drag them smoothly along the surface of the muscle towards your arm a few times. This will promote beneficial blood flow to the fascia, or the connective tissue surrounding the shoulder muscles. This is a finishing technique, so there’s no need to use a lot of force or try to penetrate down deep into the muscle. Just go over the area few times and relish the relief it creates. Wrap up your self-massage by rolling your shoulders back and forth or stretching your neck out once again.",
    "sentences": [
        " Relieving Tension in the Shoulder Muscles Have your recipient sit down in front of you with their back to you.",
        "Stand close enough to them so that you can easily reach both of their shoulders while keeping a little bend in your arms.",
        "This is the simplest and most effective position for performing a shoulder massage.",
        "If there isn’t a chair around, you can also have your recipient sit cross-legged on the edge of a bed or similar perch.",
        "Leave a little space between your recipient’s body and your own.",
        "Standing too close will make it difficult to work, and could make the other person uncomfortable.",
        "Form a loose “C” shape with both hands.",
        "Extend your thumbs while pulling your fingers together and curling them slightly.",
        "Keep the top joint of each of your fingers straight—most of the bend should be in your third knuckles, where your fingers meet your palms.",
        "Your hands will remain in this same position throughout the massage.",
        "If needed, you can adjust your grip a little once you get started to better mold them to your recipient’s shoulders.",
        "Drape your hands over your recipient’s shoulders.",
        "Maintaining the “C” shape, turn your hands over so that your fingers point downwards.",
        "Slide your hands all the way down so that the webbing of your thumbs rests over the tops of their shoulders.",
        "Feel for the smooth contour of the muscles just above the collarbones with your fingertips.",
        "If your recipient has long hair, brush it out of the way or ask them to put it up so it doesn’t get pulled accidentally during the massage.",
        "This hand position is sometimes called the “claw” or “duck” grip.Tip: The muscles in the upper part of the shoulders are known as the trapezius muscles.",
        "They’ll be your primary focus during a shoulder rub.",
        "Draw the muscles upwards with gentle, consistent pressure.",
        "Press the tips of your fingers and thumbs into the trapezius from both sides, starting at the inside of the shoulders closest to the neck.",
        "Roll the muscles up towards your recipient's collarbones without releasing your grip.",
        "The idea is to squeeze and lift instead of clamping down forcefully with your fingers.",
        "Relying on your whole arm rather than just your fingers will help reduce fatigue and prevent you from being too rough in sensitive spots, making the experience more comfortable for both you and your recipient.",
        "Raise and lower your forearms and elbows with slow, smooth motions.",
        "As you massage, try to get into a regular rhythm—bring your arms come up and loosen your grip, then lower them and channel the movement into small pulses of your fingers.",
        "Finding a comfortable rhythm will allow you to massage with proper technique for much longer.",
        "Don't get in a hurry.",
        "The slower you go, the better it will feel.",
        "Go over the entire length of the shoulders.",
        "After kneading the inner part of the trapezius for a few minutes, gradually spread your hands out towards your recipient’s arms.",
        "Then, change direction and work your way back towards the neck.",
        "Continue in this fashion until your recipient is relaxed, refreshed, and tension-free.",
        "Stop short of the bony protrusions of the shoulder joints themselves.",
        "Pressing directly on bones or joints can be painful.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Morales, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Massage Therapist\t\t\t\t\t\t\t\tMarty Morales is a Professional Massage Therapist and the Founder and Owner of the Morales Method, a manual therapy and body conditioning business based in the San Francisco Bay Area and in Los Angeles, California.",
        "Marty has over 16 years of massage therapist experience and over 13 years of experience educating others on the best practices for massage therapy.",
        "Marty has over 10,000 hours of private practice logged and is a Certified Advanced Rolfer and Rolf Movement Practitioner, CMT.",
        "He has an MBA in Finance from Loyola Marymount University, Los Angeles.",
        "Marty Morales, MBA\t\t\tProfessional Massage Therapist\t\t\t\tA common mistake when giving a shoulder massage is using too much muscle.",
        "If you put too much of your muscle behind giving the massage, you might give a great massage, but then you're sore and exhausted afterward.",
        "You should also avoid over-using your thumbs, which can make both you and your client hurt or sore.",
        "Massaging Surrounding Areas Move down into the space between the recipient’s shoulder blades.",
        "After massaging the tops of the trapezius muscles, begin lowering your hands steadily, tracing the inner grooves of the shoulder blades (also known as the scapula) with your thumbs.",
        "Follow along the spine as you palpate the interior of the blades from top to bottom.",
        "While your thumbs are busy, stretch your remaining fingers flat against your recipient’s upper back and use them to brace yourself.",
        "Turning your wrists inward with each movement will make it easier to probe down deep into those hard-to-reach spots.Warning: The area between and underneath the shoulder blades can be quite tender.",
        "Work slowly and pay attention to your recipient's reactions to avoid causing discomfort.",
        "Massage the shoulder blades themselves with a light touch.",
        "Glide the pads of your thumbs over the flat part of the shoulder blades in wide, sweeping circles.",
        "Make sure you apply minimal pressure, as the scapula are surrounded by sensitive connective tissue.",
        "Go over every part of the blade before moving on.",
        "Alternatively, you can try stroking your fingers or thumbs upward over the lattice of muscles from the bottom.",
        "The surface of the shoulder blades are criss-crossed with small muscles that assist in retracting the arms.",
        "When rubbed just right, this region can be extremely pleasurable.",
        "Use both hands to target spots that need more attention.",
        "If your recipient asks you to really dig into a particular area, using both hands will allow you to double the amount of pressure you generate.",
        "Place your hands side-by-side and proceed to massage the way your normally would, pinching, pulling, and lifting your hands as a single unit.",
        "To pinpoint single spots within the muscle, use the fingertips of your opposite hand to reinforce the pressure created by your thumb.",
        "You’ll have quite a bit more leverage with two hands, so try not to overdo it.",
        "Get a feel for your recipient’s preferred level of pressure and adjust your technique accordingly.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Morales, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Massage Therapist\t\t\t\t\t\t\t\tMarty Morales is a Professional Massage Therapist and the Founder and Owner of the Morales Method, a manual therapy and body conditioning business based in the San Francisco Bay Area and in Los Angeles, California.",
        "Marty has over 16 years of massage therapist experience and over 13 years of experience educating others on the best practices for massage therapy.",
        "Marty has over 10,000 hours of private practice logged and is a Certified Advanced Rolfer and Rolf Movement Practitioner, CMT.",
        "He has an MBA in Finance from Loyola Marymount University, Los Angeles.",
        "Marty Morales, MBA\t\t\tProfessional Massage Therapist\t\t\t\tUse different techniques to relax their muscles.",
        "If it's taking too much of your energy to have your client lying down, have them sit while you stand.",
        "Or you can try using your elbows instead of your hands.",
        "For a unique approach, you can use your feet similar to a technique they use in Thailand.",
        "Knead the muscles of the neck.",
        "Make a “C” shape with your hand the way you did when massaging the trapezius muscles.",
        "Squeeze the long extensor muscles on the sides of the neck between your thumb and fingers as you slowly pull your hand back and down with a circular motion, then release and repeat.",
        "You can do this all the way up to the base of the skull.",
        "To get a sense of what your grip on the neck should feel like, imagine that you’re trying to pick up a football with one hand.",
        "Avoid pinching or scraping your fingers over the skin on your recipient’s neck.",
        "You want your fingers to stay where they are and gently draw the skin back.",
        "Squeeze the outer shoulders from the sides.",
        "As you’re finishing up the massage, slide your hands down over your recipient’s upper arms and give them a good squeeze.",
        "This will help loosen up the deltoid muscles.",
        "Concentrate on the area between the shoulder joints and the biceps.",
        "Press the tips of your fingers and thumbs into the contours of the muscles at the front and back of the arm.",
        "Performing Some Easy Self-Massage Relax your shoulders and lower your head to gently stretch your neck.",
        "Un-hunch your shoulders and let them fall while dropping the point of your chin towards your chest.",
        "Focus on releasing any tension that you’ve been holding onto in your neck and upper back.",
        "After few moments, tilt your head to one side and then the other to lengthen the sides of your neck.",
        "Take your time and let everything relax gradually.",
        "Don’t force the stretch, as this could cause discomfort or even result in a pulled muscle.",
        "A quick neck stretch will help relieve tightness in the muscles around the shoulders, getting them ready for more intensive massage techniques.",
        "Apply pressure to the base of your neck with your fingertips.",
        "Bring the index, middle, and ring fingers of your dominant hand together and reach them around to settle on the spot where the muscles of the neck and shoulders meet.",
        "Press straight down firmly and hold this position for 10-30 seconds.",
        "You should be able to feel the muscles begin to soften beneath your touch after a few seconds.Warning: Avoid pressing directly on the spine itself.",
        "You want your fingers to stay just above the bony node of the top vertebra.",
        "Use one hand to knead the muscles in your opposite shoulder.",
        "Raise your right hand to your left shoulder and pinch your trapezius muscle between your thumb and remaining fingers.",
        "Apply steady pressure for 10-30 seconds, or slowly rotate your shoulder forward and back in a circular motion to mimic the rhythmic pulling action of a traditional massage.",
        "When you’re done, use your left hand to repeat the same technique on your right shoulder.",
        "Be sure to work the entire trapezius muscle, from the side of your neck to the outer edge of your shoulder.",
        "To avoid squeezing too hard, try adjusting the amount of pressure you use until you find a sweet spot and stick with it.",
        "Sweep your fingers along the trapezius to loosen the fascia.",
        "Lay the same three fingers you used to hold the pressure point in the back of your neck flat across your upper shoulder.",
        "Then, press down lightly and drag them smoothly along the surface of the muscle towards your arm a few times.",
        "This will promote beneficial blood flow to the fascia, or the connective tissue surrounding the shoulder muscles.",
        "This is a finishing technique, so there’s no need to use a lot of force or try to penetrate down deep into the muscle.",
        "Just go over the area few times and relish the relief it creates.",
        "Wrap up your self-massage by rolling your shoulders back and forth or stretching your neck out once again."
    ]
}