{
    "title": "How to Check Brake Fluid",
    "url": "https://www.wikihow.com/Check-Brake-Fluid",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair",
        "Vehicle Fuels and Fluids"
    ],
    "methods": [
        {
            "name": "Checking the Brake Fluid Level",
            "steps": [
                {
                    "headline": "Open the car's hood.",
                    "description": "It's best to do this when the car is stopped on a level surface, with the engine cold."
                },
                {
                    "headline": "Look for the master cylinder.",
                    "description": "On most cars, the master cylinder is located at the back of the engine bay, on the driver's side. There's a reservoir above the cylinder itself."
                },
                {
                    "headline": "Check the fluid level in the reservoir.",
                    "description": "On most newer cars, the reservoir is transparent, with lines marked \"Min\" and \"Max\"; the brake fluid level should fall between these lines. Cars older than the 1980s may have metal reservoirs, requiring you to remove the reservoir cap. (Newer caps screw on and off, while some older caps need to be pried off with a screwdriver.)"
                },
                {
                    "headline": "Add brake fluid to the reservoir if required.",
                    "description": "Pour the fluid carefully into the reservoir, wiping up any spills, as brake fluid is toxic and corrosive. Use only the brake fluid with the DOT specification recommended in your owner's manual. There are three main specifications: DOT 3, DOT 4 and DOT 5, each having its own properties. It is possible to use DOT 4 brake fluid in some cars that call for DOT 3 fluid, but never the reverse, and DOT 5 brake fluid can be used only in cars that call for that specification. Note that most cars indicate the required brake fluid DOT at the reservoir cap. This is also a good time to check how well the reservoir cap seals."
                },
                {
                    "headline": "Replace the reservoir cap and close the hood.",
                    "description": "If the brake fluid level is significantly below the \"Min\" or \"Add\" line, you should have your brakes inspected for excessive wear. As brake pads wear down, brake fluid can channel itself out of the brake lines into the calipers. It is also possible to have the brake fluid reservoir full and not have the brake fluid reaching the master cylinder. If your brakes feel spongy even with the reservoir full, take your car to a mechanic."
                }
            ]
        },
        {
            "name": "Checking the Brake Fluid Condition",
            "steps": [
                {
                    "headline": "Check the brake fluid color.",
                    "description": "Normally, brake fluid is brown. If the fluid looks dark or black, it may need to be replaced but further testing is needed."
                },
                {
                    "headline": "Dip a chemical test strip into the fluid.",
                    "description": "As brake fluid ages, its corrosion inhibitors break down. Test strips check the presence of copper in the brake fluid; the higher the level, the more worn out the inhibitors are. One such test strip is Phoenix Systems' \"Brake Strip Brake Fluid Test Strip\""
                },
                {
                    "headline": "Test for moisture content with an optical refractometer.",
                    "description": "Brake fluid is hygroscopic, which means that over time, it absorbs moisture from its surroundings. Moisture dilutes and weakens the effectiveness of brake fluid, which leads to braking systems components to corrode. In 18 months, brake fluid can have up to 3 percent water, which can lower its boiling point from 40 to 50 percent."
                },
                {
                    "headline": "Evaluate the brake fluid's boiling point with an electronic tester.",
                    "description": "New DOT 3 specification brake fluid is to have a dry boiling point of 401 degrees Fahrenheit (205 degrees Celsius) and a wet boiling point of 284 degrees (140 degrees Celsius), while DOT 4 fluid is to boil at 446 degrees (230 degrees Celsius) dry and 311 degrees (155 degrees Celsius) wet. The lower the point at which the brake fluid boils, the less effective it is. Your mechanic should have both an optical refractometer and electronic brake fluid tester to perform these tests for you as part of an automotive checkup."
                }
            ]
        }
    ],
    "tyn": [
        "Bottle of brake fluid",
        "Funnel (optional)",
        "Rag or paper towel"
    ],
    "text": " Checking the Brake Fluid Level Open the car's hood. It's best to do this when the car is stopped on a level surface, with the engine cold. Look for the master cylinder. On most cars, the master cylinder is located at the back of the engine bay, on the driver's side. There's a reservoir above the cylinder itself. Check the fluid level in the reservoir. On most newer cars, the reservoir is transparent, with lines marked \"Min\" and \"Max\"; the brake fluid level should fall between these lines. Cars older than the 1980s may have metal reservoirs, requiring you to remove the reservoir cap. (Newer caps screw on and off, while some older caps need to be pried off with a screwdriver.) Add brake fluid to the reservoir if required. Pour the fluid carefully into the reservoir, wiping up any spills, as brake fluid is toxic and corrosive. Use only the brake fluid with the DOT specification recommended in your owner's manual. There are three main specifications: DOT 3, DOT 4 and DOT 5, each having its own properties. It is possible to use DOT 4 brake fluid in some cars that call for DOT 3 fluid, but never the reverse, and DOT 5 brake fluid can be used only in cars that call for that specification. Note that most cars indicate the required brake fluid DOT at the reservoir cap. This is also a good time to check how well the reservoir cap seals. Replace the reservoir cap and close the hood. If the brake fluid level is significantly below the \"Min\" or \"Add\" line, you should have your brakes inspected for excessive wear. As brake pads wear down, brake fluid can channel itself out of the brake lines into the calipers. It is also possible to have the brake fluid reservoir full and not have the brake fluid reaching the master cylinder. If your brakes feel spongy even with the reservoir full, take your car to a mechanic. Checking the Brake Fluid Condition Check the brake fluid color. Normally, brake fluid is brown. If the fluid looks dark or black, it may need to be replaced but further testing is needed. Dip a chemical test strip into the fluid. As brake fluid ages, its corrosion inhibitors break down. Test strips check the presence of copper in the brake fluid; the higher the level, the more worn out the inhibitors are. One such test strip is Phoenix Systems' \"Brake Strip Brake Fluid Test Strip\" Test for moisture content with an optical refractometer. Brake fluid is hygroscopic, which means that over time, it absorbs moisture from its surroundings. Moisture dilutes and weakens the effectiveness of brake fluid, which leads to braking systems components to corrode. In 18 months, brake fluid can have up to 3 percent water, which can lower its boiling point from 40 to 50 percent. Evaluate the brake fluid's boiling point with an electronic tester. New DOT 3 specification brake fluid is to have a dry boiling point of 401 degrees Fahrenheit (205 degrees Celsius) and a wet boiling point of 284 degrees (140 degrees Celsius), while DOT 4 fluid is to boil at 446 degrees (230 degrees Celsius) dry and 311 degrees (155 degrees Celsius) wet. The lower the point at which the brake fluid boils, the less effective it is. Your mechanic should have both an optical refractometer and electronic brake fluid tester to perform these tests for you as part of an automotive checkup.",
    "sentences": [
        " Checking the Brake Fluid Level Open the car's hood.",
        "It's best to do this when the car is stopped on a level surface, with the engine cold.",
        "Look for the master cylinder.",
        "On most cars, the master cylinder is located at the back of the engine bay, on the driver's side.",
        "There's a reservoir above the cylinder itself.",
        "Check the fluid level in the reservoir.",
        "On most newer cars, the reservoir is transparent, with lines marked \"Min\" and \"Max\"; the brake fluid level should fall between these lines.",
        "Cars older than the 1980s may have metal reservoirs, requiring you to remove the reservoir cap.",
        "(Newer caps screw on and off, while some older caps need to be pried off with a screwdriver.)",
        "Add brake fluid to the reservoir if required.",
        "Pour the fluid carefully into the reservoir, wiping up any spills, as brake fluid is toxic and corrosive.",
        "Use only the brake fluid with the DOT specification recommended in your owner's manual.",
        "There are three main specifications: DOT 3, DOT 4 and DOT 5, each having its own properties.",
        "It is possible to use DOT 4 brake fluid in some cars that call for DOT 3 fluid, but never the reverse, and DOT 5 brake fluid can be used only in cars that call for that specification.",
        "Note that most cars indicate the required brake fluid DOT at the reservoir cap.",
        "This is also a good time to check how well the reservoir cap seals.",
        "Replace the reservoir cap and close the hood.",
        "If the brake fluid level is significantly below the \"Min\" or \"Add\" line, you should have your brakes inspected for excessive wear.",
        "As brake pads wear down, brake fluid can channel itself out of the brake lines into the calipers.",
        "It is also possible to have the brake fluid reservoir full and not have the brake fluid reaching the master cylinder.",
        "If your brakes feel spongy even with the reservoir full, take your car to a mechanic.",
        "Checking the Brake Fluid Condition Check the brake fluid color.",
        "Normally, brake fluid is brown.",
        "If the fluid looks dark or black, it may need to be replaced but further testing is needed.",
        "Dip a chemical test strip into the fluid.",
        "As brake fluid ages, its corrosion inhibitors break down.",
        "Test strips check the presence of copper in the brake fluid; the higher the level, the more worn out the inhibitors are.",
        "One such test strip is Phoenix Systems' \"Brake Strip Brake Fluid Test Strip\" Test for moisture content with an optical refractometer.",
        "Brake fluid is hygroscopic, which means that over time, it absorbs moisture from its surroundings.",
        "Moisture dilutes and weakens the effectiveness of brake fluid, which leads to braking systems components to corrode.",
        "In 18 months, brake fluid can have up to 3 percent water, which can lower its boiling point from 40 to 50 percent.",
        "Evaluate the brake fluid's boiling point with an electronic tester.",
        "New DOT 3 specification brake fluid is to have a dry boiling point of 401 degrees Fahrenheit (205 degrees Celsius) and a wet boiling point of 284 degrees (140 degrees Celsius), while DOT 4 fluid is to boil at 446 degrees (230 degrees Celsius) dry and 311 degrees (155 degrees Celsius) wet.",
        "The lower the point at which the brake fluid boils, the less effective it is.",
        "Your mechanic should have both an optical refractometer and electronic brake fluid tester to perform these tests for you as part of an automotive checkup."
    ]
}