{
    "title": "How to Pack for a One Night Trip",
    "url": "https://www.wikihow.com/Pack-for-a-One-Night-Trip",
    "category_hierarchy": [
        "Travel",
        "Travel Packing",
        "Packing for Short Trips"
    ],
    "methods": [
        {
            "name": "Adults",
            "steps": [
                {
                    "headline": "Think about where you're going.",
                    "description": "If it's cold, pack a coat. If it's warm, don't forget to bring your swimsuit. Sunscreen is also something that tends to be forgotten, yet may be really important!"
                },
                {
                    "headline": "Take a large backpackbackpack or small pull-along suitcase.",
                    "description": "But make sure your bag isn't too big, remember you are only staying one night. The smaller your bag, the less you can pack, which will help you not overpack."
                },
                {
                    "headline": "Some entertainment items you could pack: (pack wisely and only bring one or two.)",
                    "description": "A game console. (But remember unless it is handheld it will take up  a lot of room  in your suitcase.) A book. A DVD, Blu-ray Disc, or video tape + something to play them in. An mp3 player. A board game. Laptop."
                },
                {
                    "headline": "Pack some toiletries such as some toothpaste and a toothbrush.",
                    "description": "If you're planning to have a shower bring shower gel, and shampoo and/or conditioner if you want."
                },
                {
                    "headline": "Next thing you should pack are some nightclothes and clothes for the next day.",
                    "description": "Here's a list of some clothes. nightclothes include:\nPajamas."
                },
                {
                    "headline": "Bring some clothes for the next day as well such as:",
                    "description": "T-shirt A jacket. Trousers\nUnderwear (pack no more than 2 pairs.) Socks. Shoes."
                }
            ]
        },
        {
            "name": "Sleepover (Kids, Tweens and Teens)",
            "steps": [
                {
                    "headline": "Pack pajamas, slippers, and clothes for the next day.",
                    "description": ""
                },
                {
                    "headline": "Pack your toiletries such as toothbrush, toothpaste, hair products etc.",
                    "description": ""
                },
                {
                    "headline": "Pack entertainment for you and fellow guests such as:",
                    "description": "A board game Truth or dare cards Paper, pens, or arts and crafts stuff Mobile phone Games console or electronics"
                },
                {
                    "headline": "Information on clothes and toiletries can be found in the last section.",
                    "description": ""
                },
                {
                    "headline": "If you are the host of the party then make sure to make snacks.",
                    "description": ""
                },
                {
                    "headline": "Bring movies.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Visiting a sick person or a hospital",
            "steps": [
                {
                    "headline": "Pack some clothes.",
                    "description": "Just pack some pants, T-shirts and jackets."
                },
                {
                    "headline": "Pack some toiletries and pajamas and a small alarm clock to wake you up early to help the person.",
                    "description": ""
                },
                {
                    "headline": "Bring a gift basket and medication for the person.",
                    "description": ""
                },
                {
                    "headline": "Bring some entertainment for you and the person such as:",
                    "description": "A board game. Puzzles. Books. Toys (If they're a child or a child at heart.)"
                },
                {
                    "headline": "Information for clothes and toiletries can be found in the first section.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Business Trip",
            "steps": [
                {
                    "headline": "Pack for the trip.",
                    "description": "Some good ideas are, suits, ties, shirts and pants."
                },
                {
                    "headline": "Bring a medium suitcase depending on what you need for your trip.",
                    "description": "Fold your suits very neatly so they don't get crumpled."
                },
                {
                    "headline": "It's likely you'll be staying in a hotel so bring some pajamas and toiletries such as a toothbrush and a hairbrush.",
                    "description": ""
                },
                {
                    "headline": "Bring somethings to entertain you.",
                    "description": "Items could be:\nLaptop. Reading materials\nAudio books or music"
                },
                {
                    "headline": "Remember to bring your work supplies such as your laptop, pens, pencils, phone, and papers.",
                    "description": ""
                },
                {
                    "headline": "More information on clothes and toiletries can be found in the first section.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Children, Pre Tweens and Teens",
            "steps": [
                {
                    "headline": "Think about where you're going.",
                    "description": "If it's warm pack a T-Shirt etc."
                },
                {
                    "headline": "Take a small backpack or pull along suitcase.",
                    "description": ""
                },
                {
                    "headline": "Next, pack some items to to entertain you such as: (You can take more than one)",
                    "description": "Games console. Book\nBoard game. Art Supplies. Toys such as dolls or action figures, etc. DVD or Blu-Ray, and something to play then with. Laptop."
                },
                {
                    "headline": "Pack toiletries such as a toothbrush, toothpaste, etc.",
                    "description": "Bring shampoo, shower gel, etc. If you're going to have a bath or shower. You can also pack makeup if you want to."
                },
                {
                    "headline": "Day clothes include:",
                    "description": "T-Shirt Pants Socks. Shoes\nCoat\nUnderwear (remember not to pack more than 2 pairs)"
                },
                {
                    "headline": "nightclothes include:",
                    "description": "Pajamas"
                }
            ]
        }
    ],
    "tyn": [
        "A small bag",
        "Book or form of entertainment",
        "Clothing",
        "Toiletries",
        "Money",
        "Chargers for electronics",
        "Medicine or First-aid kit"
    ],
    "text": " Adults Think about where you're going. If it's cold, pack a coat. If it's warm, don't forget to bring your swimsuit. Sunscreen is also something that tends to be forgotten, yet may be really important! Take a large backpackbackpack or small pull-along suitcase. But make sure your bag isn't too big, remember you are only staying one night. The smaller your bag, the less you can pack, which will help you not overpack. Some entertainment items you could pack: (pack wisely and only bring one or two.) A game console. (But remember unless it is handheld it will take up  a lot of room  in your suitcase.) A book. A DVD, Blu-ray Disc, or video tape + something to play them in. An mp3 player. A board game. Laptop. Pack some toiletries such as some toothpaste and a toothbrush. If you're planning to have a shower bring shower gel, and shampoo and/or conditioner if you want. Next thing you should pack are some nightclothes and clothes for the next day. Here's a list of some clothes. nightclothes include:\nPajamas. Bring some clothes for the next day as well such as: T-shirt A jacket. Trousers\nUnderwear (pack no more than 2 pairs.) Socks. Shoes. Sleepover (Kids, Tweens and Teens) Pack pajamas, slippers, and clothes for the next day.  Pack your toiletries such as toothbrush, toothpaste, hair products etc.  Pack entertainment for you and fellow guests such as: A board game Truth or dare cards Paper, pens, or arts and crafts stuff Mobile phone Games console or electronics Information on clothes and toiletries can be found in the last section.  If you are the host of the party then make sure to make snacks.  Bring movies.  Visiting a sick person or a hospital Pack some clothes. Just pack some pants, T-shirts and jackets. Pack some toiletries and pajamas and a small alarm clock to wake you up early to help the person.  Bring a gift basket and medication for the person.  Bring some entertainment for you and the person such as: A board game. Puzzles. Books. Toys (If they're a child or a child at heart.) Information for clothes and toiletries can be found in the first section.  Business Trip Pack for the trip. Some good ideas are, suits, ties, shirts and pants. Bring a medium suitcase depending on what you need for your trip. Fold your suits very neatly so they don't get crumpled. It's likely you'll be staying in a hotel so bring some pajamas and toiletries such as a toothbrush and a hairbrush.  Bring somethings to entertain you. Items could be:\nLaptop. Reading materials\nAudio books or music Remember to bring your work supplies such as your laptop, pens, pencils, phone, and papers.  More information on clothes and toiletries can be found in the first section.  Children, Pre Tweens and Teens Think about where you're going. If it's warm pack a T-Shirt etc. Take a small backpack or pull along suitcase.  Next, pack some items to to entertain you such as: (You can take more than one) Games console. Book\nBoard game. Art Supplies. Toys such as dolls or action figures, etc. DVD or Blu-Ray, and something to play then with. Laptop. Pack toiletries such as a toothbrush, toothpaste, etc. Bring shampoo, shower gel, etc. If you're going to have a bath or shower. You can also pack makeup if you want to. Day clothes include: T-Shirt Pants Socks. Shoes\nCoat\nUnderwear (remember not to pack more than 2 pairs) nightclothes include: Pajamas",
    "sentences": [
        " Adults Think about where you're going.",
        "If it's cold, pack a coat.",
        "If it's warm, don't forget to bring your swimsuit.",
        "Sunscreen is also something that tends to be forgotten, yet may be really important!",
        "Take a large backpackbackpack or small pull-along suitcase.",
        "But make sure your bag isn't too big, remember you are only staying one night.",
        "The smaller your bag, the less you can pack, which will help you not overpack.",
        "Some entertainment items you could pack: (pack wisely and only bring one or two.)",
        "A game console.",
        "(But remember unless it is handheld it will take up  a lot of room  in your suitcase.)",
        "A book.",
        "A DVD, Blu-ray Disc, or video tape + something to play them in.",
        "An mp3 player.",
        "A board game.",
        "Laptop.",
        "Pack some toiletries such as some toothpaste and a toothbrush.",
        "If you're planning to have a shower bring shower gel, and shampoo and/or conditioner if you want.",
        "Next thing you should pack are some nightclothes and clothes for the next day.",
        "Here's a list of some clothes.",
        "nightclothes include:\nPajamas.",
        "Bring some clothes for the next day as well such as: T-shirt A jacket.",
        "Trousers\nUnderwear (pack no more than 2 pairs.)",
        "Socks.",
        "Shoes.",
        "Sleepover (Kids, Tweens and Teens) Pack pajamas, slippers, and clothes for the next day.",
        "Pack your toiletries such as toothbrush, toothpaste, hair products etc.",
        "Pack entertainment for you and fellow guests such as: A board game Truth or dare cards Paper, pens, or arts and crafts stuff Mobile phone Games console or electronics Information on clothes and toiletries can be found in the last section.",
        "If you are the host of the party then make sure to make snacks.",
        "Bring movies.",
        "Visiting a sick person or a hospital Pack some clothes.",
        "Just pack some pants, T-shirts and jackets.",
        "Pack some toiletries and pajamas and a small alarm clock to wake you up early to help the person.",
        "Bring a gift basket and medication for the person.",
        "Bring some entertainment for you and the person such as: A board game.",
        "Puzzles.",
        "Books.",
        "Toys (If they're a child or a child at heart.)",
        "Information for clothes and toiletries can be found in the first section.",
        "Business Trip Pack for the trip.",
        "Some good ideas are, suits, ties, shirts and pants.",
        "Bring a medium suitcase depending on what you need for your trip.",
        "Fold your suits very neatly so they don't get crumpled.",
        "It's likely you'll be staying in a hotel so bring some pajamas and toiletries such as a toothbrush and a hairbrush.",
        "Bring somethings to entertain you.",
        "Items could be:\nLaptop.",
        "Reading materials\nAudio books or music Remember to bring your work supplies such as your laptop, pens, pencils, phone, and papers.",
        "More information on clothes and toiletries can be found in the first section.",
        "Children, Pre Tweens and Teens Think about where you're going.",
        "If it's warm pack a T-Shirt etc.",
        "Take a small backpack or pull along suitcase.",
        "Next, pack some items to to entertain you such as: (You can take more than one) Games console.",
        "Book\nBoard game.",
        "Art Supplies.",
        "Toys such as dolls or action figures, etc.",
        "DVD or Blu-Ray, and something to play then with.",
        "Laptop.",
        "Pack toiletries such as a toothbrush, toothpaste, etc.",
        "Bring shampoo, shower gel, etc.",
        "If you're going to have a bath or shower.",
        "You can also pack makeup if you want to.",
        "Day clothes include: T-Shirt Pants Socks.",
        "Shoes\nCoat\nUnderwear (remember not to pack more than 2 pairs) nightclothes include: Pajamas"
    ]
}