{
    "title": "How to Do an Overnight Twist Out for 3C Curly Hair",
    "url": "https://www.wikihow.com/Do-an-Overnight-Twist-Out-for-3C-Curly-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hair Texture",
        "Curly Hair",
        "Curling Hair",
        "Heat Free Curls"
    ],
    "parts": [
        {
            "name": "Preparing Your Hair",
            "steps": [
                {
                    "headline": "Wash your hair.",
                    "description": "Starting at your roots, work the shampoo into a lather. Rinse your hair. Wrap hair in a towel or T-shirt. Be careful to leave the hair damp."
                },
                {
                    "headline": "Detangle the hair.",
                    "description": "Remove your towel or T-shirt and comb your hair. Make sure there are no tangles in it. To ensure minimal damage, comb hair from the roots down. This will minimize breakage."
                },
                {
                    "headline": "Section the hair.",
                    "description": "Make a part down the middle of your head. Part your hair into four sections, one per quadrant of your head. The size of the sections will depend on the thickness and amount of hair you have. Make sure each section has been brushed or combed thoroughly. For each section, work the leave-in conditioner from the roots to your ends. Make sure your hair is properly saturated with product. The ends are the oldest part of your hair and receive the brunt of the damage. They'll need a lot of attention over time, especially if there are split ends."
                },
                {
                    "headline": "Prepare for styling.",
                    "description": "Once all hair is moisturized, recreate the part down the middle of your head. Using a hair tie, tie up all hair on half of your head. Create one-inch thick vertical rows from that part. With an additional hair tie, tie remaining hair on that side of your head."
                }
            ]
        },
        {
            "name": "Flat Twisting",
            "steps": [
                {
                    "headline": "Twist your hair.",
                    "description": "Carefully take each section of hair and split into two pieces. Twist the two sections around each other normally. As you twist down, you will pick up small pieces of hair every time you twist to add to the twist. This is a similar technique to French braiding. If your hair begins to get dry, take a spray bottle to rehydrate each section. Repeat this step for the whole head."
                },
                {
                    "headline": "Set the twists.",
                    "description": "Using your favorite light gel, coat each twist with gel. The gel will help set the twist and ensure a better result."
                },
                {
                    "headline": "Protect your hair overnight.",
                    "description": "After completing all your hair put on a silk bonnet and enjoy your evening. Try securing the bonnet with bobby pins so it won't slip off overnight."
                },
                {
                    "headline": "Untwisting your hair in the morning.",
                    "description": "Apply a light amount of any leave-in conditioner to your fingers. Carefully unravel hair and try not to disturb the curls."
                },
                {
                    "headline": "Add volume to your style.",
                    "description": "As you deem necessary, separate each curl until you are satisfied with the number of curls you have. Once you're done, pick your roots out with a comb. This is optional but will add volume."
                },
                {
                    "headline": "Set the hairstyle.",
                    "description": "Spray your favorite hairspray to keep your curls looking fresh and shiny all day. Don't feel afraid to add accessories to your hair. Throughout the week, remember to hydrate with conditioner to keep your curls looking fresh."
                }
            ]
        }
    ],
    "tyn": [
        "Shampoo",
        "T-shirt or towel",
        "Wide tooth comb",
        "Detangling brush",
        "Hair ties",
        "Bobby pins",
        "Spray bottle filled with water",
        "Hair moisturizer/conditioner",
        "Hairspray (optional)"
    ],
    "text": " Preparing Your Hair Wash your hair. Starting at your roots, work the shampoo into a lather. Rinse your hair. Wrap hair in a towel or T-shirt. Be careful to leave the hair damp. Detangle the hair. Remove your towel or T-shirt and comb your hair. Make sure there are no tangles in it. To ensure minimal damage, comb hair from the roots down. This will minimize breakage. Section the hair. Make a part down the middle of your head. Part your hair into four sections, one per quadrant of your head. The size of the sections will depend on the thickness and amount of hair you have. Make sure each section has been brushed or combed thoroughly. For each section, work the leave-in conditioner from the roots to your ends. Make sure your hair is properly saturated with product. The ends are the oldest part of your hair and receive the brunt of the damage. They'll need a lot of attention over time, especially if there are split ends. Prepare for styling. Once all hair is moisturized, recreate the part down the middle of your head. Using a hair tie, tie up all hair on half of your head. Create one-inch thick vertical rows from that part. With an additional hair tie, tie remaining hair on that side of your head. Flat Twisting Twist your hair. Carefully take each section of hair and split into two pieces. Twist the two sections around each other normally. As you twist down, you will pick up small pieces of hair every time you twist to add to the twist. This is a similar technique to French braiding. If your hair begins to get dry, take a spray bottle to rehydrate each section. Repeat this step for the whole head. Set the twists. Using your favorite light gel, coat each twist with gel. The gel will help set the twist and ensure a better result. Protect your hair overnight. After completing all your hair put on a silk bonnet and enjoy your evening. Try securing the bonnet with bobby pins so it won't slip off overnight. Untwisting your hair in the morning. Apply a light amount of any leave-in conditioner to your fingers. Carefully unravel hair and try not to disturb the curls. Add volume to your style. As you deem necessary, separate each curl until you are satisfied with the number of curls you have. Once you're done, pick your roots out with a comb. This is optional but will add volume. Set the hairstyle. Spray your favorite hairspray to keep your curls looking fresh and shiny all day. Don't feel afraid to add accessories to your hair. Throughout the week, remember to hydrate with conditioner to keep your curls looking fresh.",
    "sentences": [
        " Preparing Your Hair Wash your hair.",
        "Starting at your roots, work the shampoo into a lather.",
        "Rinse your hair.",
        "Wrap hair in a towel or T-shirt.",
        "Be careful to leave the hair damp.",
        "Detangle the hair.",
        "Remove your towel or T-shirt and comb your hair.",
        "Make sure there are no tangles in it.",
        "To ensure minimal damage, comb hair from the roots down.",
        "This will minimize breakage.",
        "Section the hair.",
        "Make a part down the middle of your head.",
        "Part your hair into four sections, one per quadrant of your head.",
        "The size of the sections will depend on the thickness and amount of hair you have.",
        "Make sure each section has been brushed or combed thoroughly.",
        "For each section, work the leave-in conditioner from the roots to your ends.",
        "Make sure your hair is properly saturated with product.",
        "The ends are the oldest part of your hair and receive the brunt of the damage.",
        "They'll need a lot of attention over time, especially if there are split ends.",
        "Prepare for styling.",
        "Once all hair is moisturized, recreate the part down the middle of your head.",
        "Using a hair tie, tie up all hair on half of your head.",
        "Create one-inch thick vertical rows from that part.",
        "With an additional hair tie, tie remaining hair on that side of your head.",
        "Flat Twisting Twist your hair.",
        "Carefully take each section of hair and split into two pieces.",
        "Twist the two sections around each other normally.",
        "As you twist down, you will pick up small pieces of hair every time you twist to add to the twist.",
        "This is a similar technique to French braiding.",
        "If your hair begins to get dry, take a spray bottle to rehydrate each section.",
        "Repeat this step for the whole head.",
        "Set the twists.",
        "Using your favorite light gel, coat each twist with gel.",
        "The gel will help set the twist and ensure a better result.",
        "Protect your hair overnight.",
        "After completing all your hair put on a silk bonnet and enjoy your evening.",
        "Try securing the bonnet with bobby pins so it won't slip off overnight.",
        "Untwisting your hair in the morning.",
        "Apply a light amount of any leave-in conditioner to your fingers.",
        "Carefully unravel hair and try not to disturb the curls.",
        "Add volume to your style.",
        "As you deem necessary, separate each curl until you are satisfied with the number of curls you have.",
        "Once you're done, pick your roots out with a comb.",
        "This is optional but will add volume.",
        "Set the hairstyle.",
        "Spray your favorite hairspray to keep your curls looking fresh and shiny all day.",
        "Don't feel afraid to add accessories to your hair.",
        "Throughout the week, remember to hydrate with conditioner to keep your curls looking fresh."
    ]
}