{
    "title": "How to Mix Formula and Breastmilk",
    "url": "https://www.wikihow.com/Mix-Formula-and-Breastmilk",
    "category_hierarchy": [
        "Family Life",
        "Parenting",
        "Development Stages",
        "Babies and Infants"
    ],
    "parts": [
        {
            "name": "Preparing a Bottle of Formula and Breastmilk",
            "steps": [
                {
                    "headline": "Wash and dry your hands before preparing the bottle.",
                    "description": "To reduce the chances of getting bacteria onto the nipple or in the milk, always wash and dry your hands before you start preparing a bottle for your baby. Use soap and running water to wash your hands. Rub the soap over all surfaces of your hands and fingers for 20 seconds. Then, rinse your hands thoroughly and dry them off with a clean towel. To ensure you are washing your hands for long enough, try humming the “happy birthday” song to yourself 2 times. This should take about 20 seconds."
                },
                {
                    "headline": "Pour 2  fl oz (59 mL) of drinking water into a clean bottle.",
                    "description": "You can use any water that is safe for your baby to drink, such as tap water, bottled water, sterilized water, or boiled and cooled water. Check with your baby’s pediatrician if you are unsure. Consider how much your baby normally drinks in a feeding and make half that amount of formula to mix with an equal amount of breastmilk. If your baby normally drinks 4 fluid ounces (120 mL) in a feeding, then you might make 2  fl oz (59 mL) of formula and combine it with 2  fl oz (59 mL) of breastmilk."
                },
                {
                    "headline": "Add 1 scoop of powdered formula for every 2  fl oz (59 mL) of water.",
                    "description": "Use the scoop that came with your formula. Level the formula and do not pack it down as you scoop it. The scoop should be full of powdered formula up to the top edge. Check the package for specific instructions on how many scoops to add for the amount of water you are using."
                },
                {
                    "headline": "Screw the lid onto the bottle and shake the powder and formula.",
                    "description": "Make sure that the lid is screwed on tightly. Cover the nipple with a cap or with your fingertip to prevent formula from spraying out while you shake it. Then, shake the water and powdered formula vigorously for about 10 to 15 seconds to ensure that they are well-combined. If you notice any clumps of powder after you are done shaking, continue shaking the formula until they are gone."
                },
                {
                    "headline": "Add 2  fl oz (59 mL) of expressed breastmilk to the formula.",
                    "description": "Remove the lid from the bottle and pour in your expressed breastmilk. Measure the breastmilk before you add it or use the lines on the side of the bottle to see how much you are adding. Then, place the lid back onto the bottle and shake to combine the formula and breastmilk. Make sure to add an equal amount of breastmilk to the formula if you are using more than 2  fl oz (59 mL) of formula, such as 4  fl oz (120 mL) of breastmilk for 4  fl oz (120 mL) of formula.Tip: If the formula you are using is already prepared, simply combine an equal amount of the prepared formula and breastmilk in a bottle, and then shake to combine them."
                },
                {
                    "headline": "Place the bottle in a bottle warmer or cup of hot water to heat it.",
                    "description": "Your baby can drink formula and breastmilk at room temperature, chilled, or warm. If your baby prefers warm milk, then place the bottle into a bottle warmer or a cup of hot water for a few minutes to heat it up. Always test the milk on your wrist first before offering it to your baby! The milk should feel slightly warm, but not hot."
                }
            ]
        },
        {
            "name": "Ensuring Safety While Supplementing",
            "steps": [
                {
                    "headline": "Offer your baby breastmilk alone first to avoid wasting any.",
                    "description": "Breastmilk is the ideal food for your growing baby, so it is important not to waste a single drop. If your baby does not finish the bottle, you will need to discard whatever is left and any breastmilk you added to the formula will be wasted. Never refrigerate a bottle that your baby has been drinking from! Bacteria may start to grow in the milk quickly and feeding your baby from the same bottle can make your baby sick. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJulie Matheney, MS, CCC-SLP, CLEC, IBCLC\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInternational Board Certified Lactation Consultant\t\t\t\t\t\t\t\tJulie Matheney is an International Board Certified Lactation Consultant (IBCLC) and the Founder of The LA Lactation Lady, her lactation consulting business based in Los Angeles, California. She has over eight years of lactation consulting experience. She earned her MS in Speech-Language Pathology from Miami University and has earned a Certificate of Clinical Competence for Speech-Language Pathologists (CCC-SLP). She also earned her Certified Lactation Educator Counselor (CLEC) certificate from the University of California, San Diego. Julie Matheney, MS, CCC-SLP, CLEC, IBCLC\t\t\tInternational Board Certified Lactation Consultant\t\t\t\tOur Expert Agrees: If you're giving your baby both breast milk and formula, feed them the breast milk first. Then, mix the formula and give them that separately if they still need to feed them more. That way, you'll know exactly how much breast milk your baby is getting, and you'll be able to limit how much formula you give them."
                },
                {
                    "headline": "Use filtered or distilled water to mix the powdered formula.",
                    "description": "It is safe to combine prepared formula with breastmilk in the same bottle. However, always prepare powdered formula with water, and never use breastmilk in place of the water. Mixing powdered formula with breastmilk will create a high concentration of nutrients and proteins that is dangerous for your baby. Always prepare formula separately first, and then mix the prepared liquid formula with breastmilk. If the formula is pre-made, then you can mix the liquid with breastmilk as is."
                },
                {
                    "headline": "Check the expiration date on any formula you use.",
                    "description": "Before you add prepared formula to breastmilk, look at the expiration date on the package to ensure that it is in date. If the formula is expired, throw it away and replace it. Never give your baby expired formula as this may affect the formula’s quality and safety!Tip: You can keep prepared formula in the refrigerator for up to 24 hours. Label prepared formula bottles with the date and time to ensure that you use them before they go bad."
                }
            ]
        }
    ],
    "tyn": [
        "Soap and running water",
        "Clean, dry towel",
        "Bottle with lid, nipple, and cap",
        "Clean drinking water",
        "Formula",
        "Breastmilk",
        "Bottle warmer or cup of hot water (optional)"
    ],
    "text": " Preparing a Bottle of Formula and Breastmilk Wash and dry your hands before preparing the bottle. To reduce the chances of getting bacteria onto the nipple or in the milk, always wash and dry your hands before you start preparing a bottle for your baby. Use soap and running water to wash your hands. Rub the soap over all surfaces of your hands and fingers for 20 seconds. Then, rinse your hands thoroughly and dry them off with a clean towel. To ensure you are washing your hands for long enough, try humming the “happy birthday” song to yourself 2 times. This should take about 20 seconds. Pour 2  fl oz (59 mL) of drinking water into a clean bottle. You can use any water that is safe for your baby to drink, such as tap water, bottled water, sterilized water, or boiled and cooled water. Check with your baby’s pediatrician if you are unsure. Consider how much your baby normally drinks in a feeding and make half that amount of formula to mix with an equal amount of breastmilk. If your baby normally drinks 4 fluid ounces (120 mL) in a feeding, then you might make 2  fl oz (59 mL) of formula and combine it with 2  fl oz (59 mL) of breastmilk. Add 1 scoop of powdered formula for every 2  fl oz (59 mL) of water. Use the scoop that came with your formula. Level the formula and do not pack it down as you scoop it. The scoop should be full of powdered formula up to the top edge. Check the package for specific instructions on how many scoops to add for the amount of water you are using. Screw the lid onto the bottle and shake the powder and formula. Make sure that the lid is screwed on tightly. Cover the nipple with a cap or with your fingertip to prevent formula from spraying out while you shake it. Then, shake the water and powdered formula vigorously for about 10 to 15 seconds to ensure that they are well-combined. If you notice any clumps of powder after you are done shaking, continue shaking the formula until they are gone. Add 2  fl oz (59 mL) of expressed breastmilk to the formula. Remove the lid from the bottle and pour in your expressed breastmilk. Measure the breastmilk before you add it or use the lines on the side of the bottle to see how much you are adding. Then, place the lid back onto the bottle and shake to combine the formula and breastmilk. Make sure to add an equal amount of breastmilk to the formula if you are using more than 2  fl oz (59 mL) of formula, such as 4  fl oz (120 mL) of breastmilk for 4  fl oz (120 mL) of formula.Tip: If the formula you are using is already prepared, simply combine an equal amount of the prepared formula and breastmilk in a bottle, and then shake to combine them. Place the bottle in a bottle warmer or cup of hot water to heat it. Your baby can drink formula and breastmilk at room temperature, chilled, or warm. If your baby prefers warm milk, then place the bottle into a bottle warmer or a cup of hot water for a few minutes to heat it up. Always test the milk on your wrist first before offering it to your baby! The milk should feel slightly warm, but not hot. Ensuring Safety While Supplementing Offer your baby breastmilk alone first to avoid wasting any. Breastmilk is the ideal food for your growing baby, so it is important not to waste a single drop. If your baby does not finish the bottle, you will need to discard whatever is left and any breastmilk you added to the formula will be wasted. Never refrigerate a bottle that your baby has been drinking from! Bacteria may start to grow in the milk quickly and feeding your baby from the same bottle can make your baby sick. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJulie Matheney, MS, CCC-SLP, CLEC, IBCLC\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInternational Board Certified Lactation Consultant\t\t\t\t\t\t\t\tJulie Matheney is an International Board Certified Lactation Consultant (IBCLC) and the Founder of The LA Lactation Lady, her lactation consulting business based in Los Angeles, California. She has over eight years of lactation consulting experience. She earned her MS in Speech-Language Pathology from Miami University and has earned a Certificate of Clinical Competence for Speech-Language Pathologists (CCC-SLP). She also earned her Certified Lactation Educator Counselor (CLEC) certificate from the University of California, San Diego. Julie Matheney, MS, CCC-SLP, CLEC, IBCLC\t\t\tInternational Board Certified Lactation Consultant\t\t\t\tOur Expert Agrees: If you're giving your baby both breast milk and formula, feed them the breast milk first. Then, mix the formula and give them that separately if they still need to feed them more. That way, you'll know exactly how much breast milk your baby is getting, and you'll be able to limit how much formula you give them. Use filtered or distilled water to mix the powdered formula. It is safe to combine prepared formula with breastmilk in the same bottle. However, always prepare powdered formula with water, and never use breastmilk in place of the water. Mixing powdered formula with breastmilk will create a high concentration of nutrients and proteins that is dangerous for your baby. Always prepare formula separately first, and then mix the prepared liquid formula with breastmilk. If the formula is pre-made, then you can mix the liquid with breastmilk as is. Check the expiration date on any formula you use. Before you add prepared formula to breastmilk, look at the expiration date on the package to ensure that it is in date. If the formula is expired, throw it away and replace it. Never give your baby expired formula as this may affect the formula’s quality and safety!Tip: You can keep prepared formula in the refrigerator for up to 24 hours. Label prepared formula bottles with the date and time to ensure that you use them before they go bad.",
    "sentences": [
        " Preparing a Bottle of Formula and Breastmilk Wash and dry your hands before preparing the bottle.",
        "To reduce the chances of getting bacteria onto the nipple or in the milk, always wash and dry your hands before you start preparing a bottle for your baby.",
        "Use soap and running water to wash your hands.",
        "Rub the soap over all surfaces of your hands and fingers for 20 seconds.",
        "Then, rinse your hands thoroughly and dry them off with a clean towel.",
        "To ensure you are washing your hands for long enough, try humming the “happy birthday” song to yourself 2 times.",
        "This should take about 20 seconds.",
        "Pour 2  fl oz (59 mL) of drinking water into a clean bottle.",
        "You can use any water that is safe for your baby to drink, such as tap water, bottled water, sterilized water, or boiled and cooled water.",
        "Check with your baby’s pediatrician if you are unsure.",
        "Consider how much your baby normally drinks in a feeding and make half that amount of formula to mix with an equal amount of breastmilk.",
        "If your baby normally drinks 4 fluid ounces (120 mL) in a feeding, then you might make 2  fl oz (59 mL) of formula and combine it with 2  fl oz (59 mL) of breastmilk.",
        "Add 1 scoop of powdered formula for every 2  fl oz (59 mL) of water.",
        "Use the scoop that came with your formula.",
        "Level the formula and do not pack it down as you scoop it.",
        "The scoop should be full of powdered formula up to the top edge.",
        "Check the package for specific instructions on how many scoops to add for the amount of water you are using.",
        "Screw the lid onto the bottle and shake the powder and formula.",
        "Make sure that the lid is screwed on tightly.",
        "Cover the nipple with a cap or with your fingertip to prevent formula from spraying out while you shake it.",
        "Then, shake the water and powdered formula vigorously for about 10 to 15 seconds to ensure that they are well-combined.",
        "If you notice any clumps of powder after you are done shaking, continue shaking the formula until they are gone.",
        "Add 2  fl oz (59 mL) of expressed breastmilk to the formula.",
        "Remove the lid from the bottle and pour in your expressed breastmilk.",
        "Measure the breastmilk before you add it or use the lines on the side of the bottle to see how much you are adding.",
        "Then, place the lid back onto the bottle and shake to combine the formula and breastmilk.",
        "Make sure to add an equal amount of breastmilk to the formula if you are using more than 2  fl oz (59 mL) of formula, such as 4  fl oz (120 mL) of breastmilk for 4  fl oz (120 mL) of formula.Tip: If the formula you are using is already prepared, simply combine an equal amount of the prepared formula and breastmilk in a bottle, and then shake to combine them.",
        "Place the bottle in a bottle warmer or cup of hot water to heat it.",
        "Your baby can drink formula and breastmilk at room temperature, chilled, or warm.",
        "If your baby prefers warm milk, then place the bottle into a bottle warmer or a cup of hot water for a few minutes to heat it up.",
        "Always test the milk on your wrist first before offering it to your baby!",
        "The milk should feel slightly warm, but not hot.",
        "Ensuring Safety While Supplementing Offer your baby breastmilk alone first to avoid wasting any.",
        "Breastmilk is the ideal food for your growing baby, so it is important not to waste a single drop.",
        "If your baby does not finish the bottle, you will need to discard whatever is left and any breastmilk you added to the formula will be wasted.",
        "Never refrigerate a bottle that your baby has been drinking from!",
        "Bacteria may start to grow in the milk quickly and feeding your baby from the same bottle can make your baby sick.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJulie Matheney, MS, CCC-SLP, CLEC, IBCLC\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInternational Board Certified Lactation Consultant\t\t\t\t\t\t\t\tJulie Matheney is an International Board Certified Lactation Consultant (IBCLC) and the Founder of The LA Lactation Lady, her lactation consulting business based in Los Angeles, California.",
        "She has over eight years of lactation consulting experience.",
        "She earned her MS in Speech-Language Pathology from Miami University and has earned a Certificate of Clinical Competence for Speech-Language Pathologists (CCC-SLP).",
        "She also earned her Certified Lactation Educator Counselor (CLEC) certificate from the University of California, San Diego.",
        "Julie Matheney, MS, CCC-SLP, CLEC, IBCLC\t\t\tInternational Board Certified Lactation Consultant\t\t\t\tOur Expert Agrees: If you're giving your baby both breast milk and formula, feed them the breast milk first.",
        "Then, mix the formula and give them that separately if they still need to feed them more.",
        "That way, you'll know exactly how much breast milk your baby is getting, and you'll be able to limit how much formula you give them.",
        "Use filtered or distilled water to mix the powdered formula.",
        "It is safe to combine prepared formula with breastmilk in the same bottle.",
        "However, always prepare powdered formula with water, and never use breastmilk in place of the water.",
        "Mixing powdered formula with breastmilk will create a high concentration of nutrients and proteins that is dangerous for your baby.",
        "Always prepare formula separately first, and then mix the prepared liquid formula with breastmilk.",
        "If the formula is pre-made, then you can mix the liquid with breastmilk as is.",
        "Check the expiration date on any formula you use.",
        "Before you add prepared formula to breastmilk, look at the expiration date on the package to ensure that it is in date.",
        "If the formula is expired, throw it away and replace it.",
        "Never give your baby expired formula as this may affect the formula’s quality and safety!Tip: You can keep prepared formula in the refrigerator for up to 24 hours.",
        "Label prepared formula bottles with the date and time to ensure that you use them before they go bad."
    ]
}