{
    "title": "How to Clean a Maple Fretboard",
    "url": "https://www.wikihow.com/Clean-a-Maple-Fretboard",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "parts": [
        {
            "name": "Preparing the Fretboard for Cleaning",
            "steps": [
                {
                    "headline": "Find a place to work and gather your supplies.",
                    "description": "Lay out a blanket or towel, and place your guitar on top of it. Lay out all the tools you need, then organize your cleaning supplies so that everything is within reach. This will make the cleaning process go fast and smooth. Make sure that your workplace and towel is free of debris that could scratch your guitar."
                },
                {
                    "headline": "Loosen the strings.",
                    "description": "Bass strings are loosened by turning the tuning keys counterclockwise, and treble strings are loosened by turning the keys clockwise. Start with the thickest bass string and work your way to the thinnest treble string. Use your non-dominant hand to turn the tuning keys while holding tension on the string with your dominant hand. Loosening the strings allows you to remove the pins and strings."
                },
                {
                    "headline": "Remove the bridge pins with a bridge pin puller.",
                    "description": "Slip the tool over the head of a pin and pull it out. Be patient if the pins are tight. When you have finished pulling the pins out, the strings will be easy to slip out of the holes. Alternately, grip each bridge pin with wire cutters and gently pull each pin out. Resting the cutters on the saddle will steady them as you work. Not all experts advise using wire cutters, as they can damage the pins."
                },
                {
                    "headline": "Remove the strings from the holes.",
                    "description": "Lift out the loosened strings and put them in a safe place if you will be re-using them. Otherwise, throw them away."
                },
                {
                    "headline": "Unscrew the guitar neck.",
                    "description": "Put it in a safe place away from your cleaning area (in case of accidental spills), and put the bolts in a cup or bag so they don’t get lost. Removing the neck will prevent cleaners from getting trapped inside. If the neck is set, cover it with painter’s tape or cloth to protect it. If you are cleaning an acoustic guitar fretboard, cover the soundhole."
                }
            ]
        },
        {
            "name": "Cleaning the Fretboard",
            "steps": [
                {
                    "headline": "Spread a thin layer of vegetable oil soap from the nut to the 22nd fret.",
                    "description": "Use about 1 cap of the vegetable oil soap. Start at the nut and spread it evenly to the 22nd fret. Shredders should spread it to the 24th fret. Spreading it with a cloth or paper towel will help to avoid using too much soap."
                },
                {
                    "headline": "Scrub in small, tight circles with the steel wool.",
                    "description": "Do this immediately after you put the soap on because vegetable oil soap can get sticky fast. Don’t scrub directly with the grain because it can push the dirt further into the fretboard. Scrubbing directly against the grain can erode the fretboard wood."
                },
                {
                    "headline": "Wipe the fretboard with a paper towel.",
                    "description": "Use a clean, dry paper towel to wipe away the soap and remove as much of the residue as possible. Use additional paper towels as needed, rather than using the same towel over and over. Do not use water to remove the soap."
                },
                {
                    "headline": "Use a fretboard guard and steel wool to clean each fret’s surface.",
                    "description": "The guards are easy to use. Just place the fretboard guard over a fret and lay it on top. The fret will slip through the slot. Scrub the surface of each fret with the steel wool to clean it. Remember to clean just the surface of the fret and not the board around the fret."
                },
                {
                    "headline": "Wipe the fretboard with lighter fluid, mineral oil, or a naphtha solvent.",
                    "description": "Choose only one of these solvents, and always apply them with a paper towel or microfiber cloth. They are skin irritants and can cause a rash or burn. The solvent should remove any stubborn dirt or oils. These solvents are flammable. Take care to protect yourself and your skin."
                },
                {
                    "headline": "Polish the entire neck with guitar polish.",
                    "description": "Spray the cleaner directly onto a microfiber cleaning cloth and polish the entire neck. The oil will be distributed over the surface leaving it shiny and clean. Make sure you don’t oversaturate the neck with the cleaning product. It’s easy to add more but will take more effort to remove an excessive amount. If you have an unfinished maple fretboard, apply a thin line of fretboard oil (about the width of a cell phone charger cable) directly to the fretboard and rub it in with a paper towel. Buff it with a clean, dry microfiber cleaning cloth."
                },
                {
                    "headline": "Wipe each fret with a clean paper towel.",
                    "description": "Do a thorough job wiping each fret. Excess oil can transfer to the strings, affecting the resonance, or sound quality, it produces. Paper towels absorb oil better than microfiber cloths do."
                },
                {
                    "headline": "Reattach the guitar neck.",
                    "description": "Screw the guitar neck back onto the body of the guitar. The neck should be secure but not overly tight. If your guitar neck is set or you are cleaning an acoustic guitar, then remove the cloth or painter’s tape you used to protect it or the sound hole."
                },
                {
                    "headline": "Clean lacquered fretboards with guitar spray and polish them clean.",
                    "description": "If you have a lacquered guitar, then all you need to do is spray your favorite guitar cleaner directly on a clean microfiber cloth and wipe down the fretboard and neck. Polish it up with a clean, dry microfiber cloth. Because the fretboard is finished, it isn’t necessary to clean it with vegetable oil soap. If there is stuck-on dirt, you can use a naphtha solvent, mineral oil, or lighter fluid to remove it. Always apply with a paper towel, as these solvents are skin irritants and flammable."
                }
            ]
        },
        {
            "name": "Restringing the Guitar",
            "steps": [
                {
                    "headline": "Bend the ball-end of the string.",
                    "description": "Start with the thickest bass string. This small bend will help keep the string in place once it has been placed in the bridge hole."
                },
                {
                    "headline": "Push the ball through the 6E bridge hole and slide in the pin.",
                    "description": "You can use any bridge pin with any string. Make sure the string pin’s notch is facing the guitar’s neck, then push it securely in place. Do not exert unnecessary pressure on the pin."
                },
                {
                    "headline": "Insert the remaining strings at the bridge.",
                    "description": "Start with the thick bass strings and work your way to the thinner treble strings. Giving each string a gentle tug ensures that it is securely in place. It also tells you whether each ball is in the correct place at the bottom of the bridge pin."
                },
                {
                    "headline": "Pull the thickest string to its tuning peg and thread it.",
                    "description": "Pull it over the saddle and across the nut to its tuning peg. Thread the string through center of the tuning peg and pull it tight. Thread it from the inside to the outside."
                },
                {
                    "headline": "Wrap the string behind the tuning peg and secure.",
                    "description": "After you wrap it behind the peg, bring it under itself then over. It should sit securely around the peg now."
                },
                {
                    "headline": "Turn the string’s tuning key counterclockwise.",
                    "description": "Only tighten it a little. Finish stringing the guitar before tightening the strings all the way. You'll tune your guitar once it’s restrung."
                },
                {
                    "headline": "Trim the excess string close to the tuning peg.",
                    "description": "You can use wire cutters, or a specialty tool made for re-stringing guitars. Cutting the extra string close to the peg keeps sharp ends from snagging fabric and bags."
                },
                {
                    "headline": "String the rest of the guitar.",
                    "description": "As stated, work from the thickest string to the thinnest, making sure each string is securely in place before you trim it. If you need to start over, it will be easier to work with a string that hasn't been cut yet."
                }
            ]
        }
    ],
    "tyn": [
        "Vegetable oil soap",
        "Naphtha solvent, lighter fluid, or mineral spirits",
        "Guitar polish or cleaner",
        "Fretboard oil for lacquered guitars",
        "#00000 extra fine steel wool",
        "A few fretboard guards",
        "Paper towels and 1-2 microfiber cleaning cloths",
        "Bridge pin puller",
        "Wire cutters",
        "Screwdriver for removing the neck",
        "New strings"
    ],
    "text": " Preparing the Fretboard for Cleaning Find a place to work and gather your supplies. Lay out a blanket or towel, and place your guitar on top of it. Lay out all the tools you need, then organize your cleaning supplies so that everything is within reach. This will make the cleaning process go fast and smooth. Make sure that your workplace and towel is free of debris that could scratch your guitar. Loosen the strings. Bass strings are loosened by turning the tuning keys counterclockwise, and treble strings are loosened by turning the keys clockwise. Start with the thickest bass string and work your way to the thinnest treble string. Use your non-dominant hand to turn the tuning keys while holding tension on the string with your dominant hand. Loosening the strings allows you to remove the pins and strings. Remove the bridge pins with a bridge pin puller. Slip the tool over the head of a pin and pull it out. Be patient if the pins are tight. When you have finished pulling the pins out, the strings will be easy to slip out of the holes. Alternately, grip each bridge pin with wire cutters and gently pull each pin out. Resting the cutters on the saddle will steady them as you work. Not all experts advise using wire cutters, as they can damage the pins. Remove the strings from the holes. Lift out the loosened strings and put them in a safe place if you will be re-using them. Otherwise, throw them away. Unscrew the guitar neck. Put it in a safe place away from your cleaning area (in case of accidental spills), and put the bolts in a cup or bag so they don’t get lost. Removing the neck will prevent cleaners from getting trapped inside. If the neck is set, cover it with painter’s tape or cloth to protect it. If you are cleaning an acoustic guitar fretboard, cover the soundhole. Cleaning the Fretboard Spread a thin layer of vegetable oil soap from the nut to the 22nd fret. Use about 1 cap of the vegetable oil soap. Start at the nut and spread it evenly to the 22nd fret. Shredders should spread it to the 24th fret. Spreading it with a cloth or paper towel will help to avoid using too much soap. Scrub in small, tight circles with the steel wool. Do this immediately after you put the soap on because vegetable oil soap can get sticky fast. Don’t scrub directly with the grain because it can push the dirt further into the fretboard. Scrubbing directly against the grain can erode the fretboard wood. Wipe the fretboard with a paper towel. Use a clean, dry paper towel to wipe away the soap and remove as much of the residue as possible. Use additional paper towels as needed, rather than using the same towel over and over. Do not use water to remove the soap. Use a fretboard guard and steel wool to clean each fret’s surface. The guards are easy to use. Just place the fretboard guard over a fret and lay it on top. The fret will slip through the slot. Scrub the surface of each fret with the steel wool to clean it. Remember to clean just the surface of the fret and not the board around the fret. Wipe the fretboard with lighter fluid, mineral oil, or a naphtha solvent. Choose only one of these solvents, and always apply them with a paper towel or microfiber cloth. They are skin irritants and can cause a rash or burn. The solvent should remove any stubborn dirt or oils. These solvents are flammable. Take care to protect yourself and your skin. Polish the entire neck with guitar polish. Spray the cleaner directly onto a microfiber cleaning cloth and polish the entire neck. The oil will be distributed over the surface leaving it shiny and clean. Make sure you don’t oversaturate the neck with the cleaning product. It’s easy to add more but will take more effort to remove an excessive amount. If you have an unfinished maple fretboard, apply a thin line of fretboard oil (about the width of a cell phone charger cable) directly to the fretboard and rub it in with a paper towel. Buff it with a clean, dry microfiber cleaning cloth. Wipe each fret with a clean paper towel. Do a thorough job wiping each fret. Excess oil can transfer to the strings, affecting the resonance, or sound quality, it produces. Paper towels absorb oil better than microfiber cloths do. Reattach the guitar neck. Screw the guitar neck back onto the body of the guitar. The neck should be secure but not overly tight. If your guitar neck is set or you are cleaning an acoustic guitar, then remove the cloth or painter’s tape you used to protect it or the sound hole. Clean lacquered fretboards with guitar spray and polish them clean. If you have a lacquered guitar, then all you need to do is spray your favorite guitar cleaner directly on a clean microfiber cloth and wipe down the fretboard and neck. Polish it up with a clean, dry microfiber cloth. Because the fretboard is finished, it isn’t necessary to clean it with vegetable oil soap. If there is stuck-on dirt, you can use a naphtha solvent, mineral oil, or lighter fluid to remove it. Always apply with a paper towel, as these solvents are skin irritants and flammable. Restringing the Guitar Bend the ball-end of the string. Start with the thickest bass string. This small bend will help keep the string in place once it has been placed in the bridge hole. Push the ball through the 6E bridge hole and slide in the pin. You can use any bridge pin with any string. Make sure the string pin’s notch is facing the guitar’s neck, then push it securely in place. Do not exert unnecessary pressure on the pin. Insert the remaining strings at the bridge. Start with the thick bass strings and work your way to the thinner treble strings. Giving each string a gentle tug ensures that it is securely in place. It also tells you whether each ball is in the correct place at the bottom of the bridge pin. Pull the thickest string to its tuning peg and thread it. Pull it over the saddle and across the nut to its tuning peg. Thread the string through center of the tuning peg and pull it tight. Thread it from the inside to the outside. Wrap the string behind the tuning peg and secure. After you wrap it behind the peg, bring it under itself then over. It should sit securely around the peg now. Turn the string’s tuning key counterclockwise. Only tighten it a little. Finish stringing the guitar before tightening the strings all the way. You'll tune your guitar once it’s restrung. Trim the excess string close to the tuning peg. You can use wire cutters, or a specialty tool made for re-stringing guitars. Cutting the extra string close to the peg keeps sharp ends from snagging fabric and bags. String the rest of the guitar. As stated, work from the thickest string to the thinnest, making sure each string is securely in place before you trim it. If you need to start over, it will be easier to work with a string that hasn't been cut yet.",
    "sentences": [
        " Preparing the Fretboard for Cleaning Find a place to work and gather your supplies.",
        "Lay out a blanket or towel, and place your guitar on top of it.",
        "Lay out all the tools you need, then organize your cleaning supplies so that everything is within reach.",
        "This will make the cleaning process go fast and smooth.",
        "Make sure that your workplace and towel is free of debris that could scratch your guitar.",
        "Loosen the strings.",
        "Bass strings are loosened by turning the tuning keys counterclockwise, and treble strings are loosened by turning the keys clockwise.",
        "Start with the thickest bass string and work your way to the thinnest treble string.",
        "Use your non-dominant hand to turn the tuning keys while holding tension on the string with your dominant hand.",
        "Loosening the strings allows you to remove the pins and strings.",
        "Remove the bridge pins with a bridge pin puller.",
        "Slip the tool over the head of a pin and pull it out.",
        "Be patient if the pins are tight.",
        "When you have finished pulling the pins out, the strings will be easy to slip out of the holes.",
        "Alternately, grip each bridge pin with wire cutters and gently pull each pin out.",
        "Resting the cutters on the saddle will steady them as you work.",
        "Not all experts advise using wire cutters, as they can damage the pins.",
        "Remove the strings from the holes.",
        "Lift out the loosened strings and put them in a safe place if you will be re-using them.",
        "Otherwise, throw them away.",
        "Unscrew the guitar neck.",
        "Put it in a safe place away from your cleaning area (in case of accidental spills), and put the bolts in a cup or bag so they don’t get lost.",
        "Removing the neck will prevent cleaners from getting trapped inside.",
        "If the neck is set, cover it with painter’s tape or cloth to protect it.",
        "If you are cleaning an acoustic guitar fretboard, cover the soundhole.",
        "Cleaning the Fretboard Spread a thin layer of vegetable oil soap from the nut to the 22nd fret.",
        "Use about 1 cap of the vegetable oil soap.",
        "Start at the nut and spread it evenly to the 22nd fret.",
        "Shredders should spread it to the 24th fret.",
        "Spreading it with a cloth or paper towel will help to avoid using too much soap.",
        "Scrub in small, tight circles with the steel wool.",
        "Do this immediately after you put the soap on because vegetable oil soap can get sticky fast.",
        "Don’t scrub directly with the grain because it can push the dirt further into the fretboard.",
        "Scrubbing directly against the grain can erode the fretboard wood.",
        "Wipe the fretboard with a paper towel.",
        "Use a clean, dry paper towel to wipe away the soap and remove as much of the residue as possible.",
        "Use additional paper towels as needed, rather than using the same towel over and over.",
        "Do not use water to remove the soap.",
        "Use a fretboard guard and steel wool to clean each fret’s surface.",
        "The guards are easy to use.",
        "Just place the fretboard guard over a fret and lay it on top.",
        "The fret will slip through the slot.",
        "Scrub the surface of each fret with the steel wool to clean it.",
        "Remember to clean just the surface of the fret and not the board around the fret.",
        "Wipe the fretboard with lighter fluid, mineral oil, or a naphtha solvent.",
        "Choose only one of these solvents, and always apply them with a paper towel or microfiber cloth.",
        "They are skin irritants and can cause a rash or burn.",
        "The solvent should remove any stubborn dirt or oils.",
        "These solvents are flammable.",
        "Take care to protect yourself and your skin.",
        "Polish the entire neck with guitar polish.",
        "Spray the cleaner directly onto a microfiber cleaning cloth and polish the entire neck.",
        "The oil will be distributed over the surface leaving it shiny and clean.",
        "Make sure you don’t oversaturate the neck with the cleaning product.",
        "It’s easy to add more but will take more effort to remove an excessive amount.",
        "If you have an unfinished maple fretboard, apply a thin line of fretboard oil (about the width of a cell phone charger cable) directly to the fretboard and rub it in with a paper towel.",
        "Buff it with a clean, dry microfiber cleaning cloth.",
        "Wipe each fret with a clean paper towel.",
        "Do a thorough job wiping each fret.",
        "Excess oil can transfer to the strings, affecting the resonance, or sound quality, it produces.",
        "Paper towels absorb oil better than microfiber cloths do.",
        "Reattach the guitar neck.",
        "Screw the guitar neck back onto the body of the guitar.",
        "The neck should be secure but not overly tight.",
        "If your guitar neck is set or you are cleaning an acoustic guitar, then remove the cloth or painter’s tape you used to protect it or the sound hole.",
        "Clean lacquered fretboards with guitar spray and polish them clean.",
        "If you have a lacquered guitar, then all you need to do is spray your favorite guitar cleaner directly on a clean microfiber cloth and wipe down the fretboard and neck.",
        "Polish it up with a clean, dry microfiber cloth.",
        "Because the fretboard is finished, it isn’t necessary to clean it with vegetable oil soap.",
        "If there is stuck-on dirt, you can use a naphtha solvent, mineral oil, or lighter fluid to remove it.",
        "Always apply with a paper towel, as these solvents are skin irritants and flammable.",
        "Restringing the Guitar Bend the ball-end of the string.",
        "Start with the thickest bass string.",
        "This small bend will help keep the string in place once it has been placed in the bridge hole.",
        "Push the ball through the 6E bridge hole and slide in the pin.",
        "You can use any bridge pin with any string.",
        "Make sure the string pin’s notch is facing the guitar’s neck, then push it securely in place.",
        "Do not exert unnecessary pressure on the pin.",
        "Insert the remaining strings at the bridge.",
        "Start with the thick bass strings and work your way to the thinner treble strings.",
        "Giving each string a gentle tug ensures that it is securely in place.",
        "It also tells you whether each ball is in the correct place at the bottom of the bridge pin.",
        "Pull the thickest string to its tuning peg and thread it.",
        "Pull it over the saddle and across the nut to its tuning peg.",
        "Thread the string through center of the tuning peg and pull it tight.",
        "Thread it from the inside to the outside.",
        "Wrap the string behind the tuning peg and secure.",
        "After you wrap it behind the peg, bring it under itself then over.",
        "It should sit securely around the peg now.",
        "Turn the string’s tuning key counterclockwise.",
        "Only tighten it a little.",
        "Finish stringing the guitar before tightening the strings all the way.",
        "You'll tune your guitar once it’s restrung.",
        "Trim the excess string close to the tuning peg.",
        "You can use wire cutters, or a specialty tool made for re-stringing guitars.",
        "Cutting the extra string close to the peg keeps sharp ends from snagging fabric and bags.",
        "String the rest of the guitar.",
        "As stated, work from the thickest string to the thinnest, making sure each string is securely in place before you trim it.",
        "If you need to start over, it will be easier to work with a string that hasn't been cut yet."
    ]
}