{
    "title": "How to Repair Laminate Flooring with Water Damage",
    "url": "https://www.wikihow.com/Repair-Laminate-Flooring-with-Water-Damage",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Floors and Stairs",
        "Floor Types",
        "Laminate Flooring"
    ],
    "parts": [
        {
            "name": "Inspecting the Water Damage",
            "steps": [
                {
                    "headline": "Find the source of flooding or leaking and plug it up.",
                    "description": "You shouldn’t start the process of repairing laminate floors until you know where the water is coming from and how to stop it. Turn off your water supply to prevent leaking from continuing. If the leak comes from an appliance, like your refrigerator, you will have to get it fixed before you can start repairing your flooring. The leak could be the result of a broken pipe or something else inside your home’s walls. If this is the case, call a professional to come inspect the issue before you begin working on the flooring. Whenever there is a small spill of any kind on your laminate flooring, wipe it up immediately to prevent water damage from occurring over time."
                },
                {
                    "headline": "Look for warped areas that are bending or cracking.",
                    "description": "When laminate gets saturated by water, it absorbs the moisture which in turn breaks down the structure of the flooring. There are a number of signs that point to your floor being water damaged, including bending or cracking. Tiles can also be pushed apart by water damage. Go over every tile individually when you check. As you walk around, push on your floorboards to see if they are popping up out of the base of the floor. Be critical when you do this, as even a small distortion to the tiles can be the result of water damage. If any part of a tile is damaged, the whole tile will need to be replaced."
                },
                {
                    "headline": "Check for discoloration and signs of mold.",
                    "description": "Mold can grow when the water in your flooring is left untreated for an extended period of time. Your tiles can change color if this happens, giving the floor an unappealing look. You should consistently monitor your floor to see if any part of it is warped."
                },
                {
                    "headline": "Mark each damaged tile with a sticky note.",
                    "description": "This way, you’ll know how far-reaching the issue has become. If you decide to bring a professional in to take a look at the problem, these sticky notes will be a helpful starting point for that person. Snap a picture of the entire floor with the sticky notes in case you need to show it to a flooring dealer."
                }
            ]
        },
        {
            "name": "Removing the Damaged Laminate Pieces",
            "steps": [
                {
                    "headline": "Pry up the damaged planks one at a time with a putty knife.",
                    "description": "If you don’t have a putty knife, use a butter knife. Wear protective eye gear during this step to prevent dust, dirt, or anything else from getting into your eyes. Dispose of the damaged planks as you go to avoid clutter building up."
                },
                {
                    "headline": "Remove the baseboards under the tiles.",
                    "description": "This exposes the bare floor underneath and lets you fully inspect your floor to check for buildup of dust or mold. Like with the planks themselves, remove the baseboards one at a time to avoid damaging the flooring even further. If you pry up a plank but don’t notice any damage to it, simply reinstall it back into the floor!"
                },
                {
                    "headline": "Clean the floor underneath the planks before replacing them.",
                    "description": "Things like water and dirt can build up under your floorboards, so use a broom and dustpan to sweep everything up. Then, take a cloth and wipe every inch of the exposed floor. If there’s anything on the exposed floor, it can prevent the planks from sliding in place next to one another. Go over the area to ensure nothing could get in the way of the planks."
                }
            ]
        },
        {
            "name": "Installing the New Laminate",
            "steps": [
                {
                    "headline": "Buy new laminate planks to install.",
                    "description": "Unless you bought extra tiles when your floor was installed, true replacements can be tough to find. However, if you bring a damaged tile into to a flooring dealer, they can help you find suitable new tiles. Start by going to the same dealer that originally installed your floor, as this will give you a better chance at finding the right replacement planks. If you can’t find any planks that look like the ones you have at home, you might be better off replacing the whole floor. Ask the flooring dealer for their advice if this is the case. Similarly, if the majority of your tiles are damaged, it may be better to replace the entire floor."
                },
                {
                    "headline": "Position the replacement planks next to the original planks.",
                    "description": "Slide the replacement planks next to the undamaged tiles that haven’t been removed. Leave enough space for the nozzle of the flooring adhesive bottle to squeeze in between the planks. This is where having replacement planks that are similar to the original planks is so important. The more alike the planks are, the easier they’ll fit together."
                },
                {
                    "headline": "Attach the replacement planks with flooring adhesive.",
                    "description": "Apply the adhesive by squeezing some in between the long sides of the tiles. Flooring adhesive is very powerful, so you only need to add enough to make the planks stick. You can pick up flooring adhesive at stores like the Home Depot or order some online."
                },
                {
                    "headline": "Place a heavy object on top of the planks to help them set.",
                    "description": "Be it a bookcase or couch, this object will keep the planks in one place and allow the adhesive to keep them connected for a long time. It’s okay to put the heavy object on the planks right after applying the adhesive. Let the object sit on the planks for a few hours to ensure the tiles stick together."
                },
                {
                    "headline": "Contact a professional for more help.",
                    "description": "This can be a tricky job, especially if the water damage covers most of your floor. Fortunately, most flooring professionals will come to your home and assess the situation for free. If you do not feel comfortable fixing the floor yourself, call the professionals before doing anything else. Start by going to the people who installed your floor in the first place, as they’ll have the best idea of what’s happened and how to fix it."
                }
            ]
        }
    ],
    "tyn": [
        "Safety glasses",
        "Flooring adhesive",
        "Putty knife or butter knife",
        "Cloth",
        "Replacement planks"
    ],
    "text": " Inspecting the Water Damage Find the source of flooding or leaking and plug it up. You shouldn’t start the process of repairing laminate floors until you know where the water is coming from and how to stop it. Turn off your water supply to prevent leaking from continuing. If the leak comes from an appliance, like your refrigerator, you will have to get it fixed before you can start repairing your flooring. The leak could be the result of a broken pipe or something else inside your home’s walls. If this is the case, call a professional to come inspect the issue before you begin working on the flooring. Whenever there is a small spill of any kind on your laminate flooring, wipe it up immediately to prevent water damage from occurring over time. Look for warped areas that are bending or cracking. When laminate gets saturated by water, it absorbs the moisture which in turn breaks down the structure of the flooring. There are a number of signs that point to your floor being water damaged, including bending or cracking. Tiles can also be pushed apart by water damage. Go over every tile individually when you check. As you walk around, push on your floorboards to see if they are popping up out of the base of the floor. Be critical when you do this, as even a small distortion to the tiles can be the result of water damage. If any part of a tile is damaged, the whole tile will need to be replaced. Check for discoloration and signs of mold. Mold can grow when the water in your flooring is left untreated for an extended period of time. Your tiles can change color if this happens, giving the floor an unappealing look. You should consistently monitor your floor to see if any part of it is warped. Mark each damaged tile with a sticky note. This way, you’ll know how far-reaching the issue has become. If you decide to bring a professional in to take a look at the problem, these sticky notes will be a helpful starting point for that person. Snap a picture of the entire floor with the sticky notes in case you need to show it to a flooring dealer. Removing the Damaged Laminate Pieces Pry up the damaged planks one at a time with a putty knife. If you don’t have a putty knife, use a butter knife. Wear protective eye gear during this step to prevent dust, dirt, or anything else from getting into your eyes. Dispose of the damaged planks as you go to avoid clutter building up. Remove the baseboards under the tiles. This exposes the bare floor underneath and lets you fully inspect your floor to check for buildup of dust or mold. Like with the planks themselves, remove the baseboards one at a time to avoid damaging the flooring even further. If you pry up a plank but don’t notice any damage to it, simply reinstall it back into the floor! Clean the floor underneath the planks before replacing them. Things like water and dirt can build up under your floorboards, so use a broom and dustpan to sweep everything up. Then, take a cloth and wipe every inch of the exposed floor. If there’s anything on the exposed floor, it can prevent the planks from sliding in place next to one another. Go over the area to ensure nothing could get in the way of the planks. Installing the New Laminate Buy new laminate planks to install. Unless you bought extra tiles when your floor was installed, true replacements can be tough to find. However, if you bring a damaged tile into to a flooring dealer, they can help you find suitable new tiles. Start by going to the same dealer that originally installed your floor, as this will give you a better chance at finding the right replacement planks. If you can’t find any planks that look like the ones you have at home, you might be better off replacing the whole floor. Ask the flooring dealer for their advice if this is the case. Similarly, if the majority of your tiles are damaged, it may be better to replace the entire floor. Position the replacement planks next to the original planks. Slide the replacement planks next to the undamaged tiles that haven’t been removed. Leave enough space for the nozzle of the flooring adhesive bottle to squeeze in between the planks. This is where having replacement planks that are similar to the original planks is so important. The more alike the planks are, the easier they’ll fit together. Attach the replacement planks with flooring adhesive. Apply the adhesive by squeezing some in between the long sides of the tiles. Flooring adhesive is very powerful, so you only need to add enough to make the planks stick. You can pick up flooring adhesive at stores like the Home Depot or order some online. Place a heavy object on top of the planks to help them set. Be it a bookcase or couch, this object will keep the planks in one place and allow the adhesive to keep them connected for a long time. It’s okay to put the heavy object on the planks right after applying the adhesive. Let the object sit on the planks for a few hours to ensure the tiles stick together. Contact a professional for more help. This can be a tricky job, especially if the water damage covers most of your floor. Fortunately, most flooring professionals will come to your home and assess the situation for free. If you do not feel comfortable fixing the floor yourself, call the professionals before doing anything else. Start by going to the people who installed your floor in the first place, as they’ll have the best idea of what’s happened and how to fix it.",
    "sentences": [
        " Inspecting the Water Damage Find the source of flooding or leaking and plug it up.",
        "You shouldn’t start the process of repairing laminate floors until you know where the water is coming from and how to stop it.",
        "Turn off your water supply to prevent leaking from continuing.",
        "If the leak comes from an appliance, like your refrigerator, you will have to get it fixed before you can start repairing your flooring.",
        "The leak could be the result of a broken pipe or something else inside your home’s walls.",
        "If this is the case, call a professional to come inspect the issue before you begin working on the flooring.",
        "Whenever there is a small spill of any kind on your laminate flooring, wipe it up immediately to prevent water damage from occurring over time.",
        "Look for warped areas that are bending or cracking.",
        "When laminate gets saturated by water, it absorbs the moisture which in turn breaks down the structure of the flooring.",
        "There are a number of signs that point to your floor being water damaged, including bending or cracking.",
        "Tiles can also be pushed apart by water damage.",
        "Go over every tile individually when you check.",
        "As you walk around, push on your floorboards to see if they are popping up out of the base of the floor.",
        "Be critical when you do this, as even a small distortion to the tiles can be the result of water damage.",
        "If any part of a tile is damaged, the whole tile will need to be replaced.",
        "Check for discoloration and signs of mold.",
        "Mold can grow when the water in your flooring is left untreated for an extended period of time.",
        "Your tiles can change color if this happens, giving the floor an unappealing look.",
        "You should consistently monitor your floor to see if any part of it is warped.",
        "Mark each damaged tile with a sticky note.",
        "This way, you’ll know how far-reaching the issue has become.",
        "If you decide to bring a professional in to take a look at the problem, these sticky notes will be a helpful starting point for that person.",
        "Snap a picture of the entire floor with the sticky notes in case you need to show it to a flooring dealer.",
        "Removing the Damaged Laminate Pieces Pry up the damaged planks one at a time with a putty knife.",
        "If you don’t have a putty knife, use a butter knife.",
        "Wear protective eye gear during this step to prevent dust, dirt, or anything else from getting into your eyes.",
        "Dispose of the damaged planks as you go to avoid clutter building up.",
        "Remove the baseboards under the tiles.",
        "This exposes the bare floor underneath and lets you fully inspect your floor to check for buildup of dust or mold.",
        "Like with the planks themselves, remove the baseboards one at a time to avoid damaging the flooring even further.",
        "If you pry up a plank but don’t notice any damage to it, simply reinstall it back into the floor!",
        "Clean the floor underneath the planks before replacing them.",
        "Things like water and dirt can build up under your floorboards, so use a broom and dustpan to sweep everything up.",
        "Then, take a cloth and wipe every inch of the exposed floor.",
        "If there’s anything on the exposed floor, it can prevent the planks from sliding in place next to one another.",
        "Go over the area to ensure nothing could get in the way of the planks.",
        "Installing the New Laminate Buy new laminate planks to install.",
        "Unless you bought extra tiles when your floor was installed, true replacements can be tough to find.",
        "However, if you bring a damaged tile into to a flooring dealer, they can help you find suitable new tiles.",
        "Start by going to the same dealer that originally installed your floor, as this will give you a better chance at finding the right replacement planks.",
        "If you can’t find any planks that look like the ones you have at home, you might be better off replacing the whole floor.",
        "Ask the flooring dealer for their advice if this is the case.",
        "Similarly, if the majority of your tiles are damaged, it may be better to replace the entire floor.",
        "Position the replacement planks next to the original planks.",
        "Slide the replacement planks next to the undamaged tiles that haven’t been removed.",
        "Leave enough space for the nozzle of the flooring adhesive bottle to squeeze in between the planks.",
        "This is where having replacement planks that are similar to the original planks is so important.",
        "The more alike the planks are, the easier they’ll fit together.",
        "Attach the replacement planks with flooring adhesive.",
        "Apply the adhesive by squeezing some in between the long sides of the tiles.",
        "Flooring adhesive is very powerful, so you only need to add enough to make the planks stick.",
        "You can pick up flooring adhesive at stores like the Home Depot or order some online.",
        "Place a heavy object on top of the planks to help them set.",
        "Be it a bookcase or couch, this object will keep the planks in one place and allow the adhesive to keep them connected for a long time.",
        "It’s okay to put the heavy object on the planks right after applying the adhesive.",
        "Let the object sit on the planks for a few hours to ensure the tiles stick together.",
        "Contact a professional for more help.",
        "This can be a tricky job, especially if the water damage covers most of your floor.",
        "Fortunately, most flooring professionals will come to your home and assess the situation for free.",
        "If you do not feel comfortable fixing the floor yourself, call the professionals before doing anything else.",
        "Start by going to the people who installed your floor in the first place, as they’ll have the best idea of what’s happened and how to fix it."
    ]
}