{
    "title": "How to Make Cinnamon Stick Trees",
    "url": "https://www.wikihow.com/Make-Cinnamon-Stick-Trees",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Nature Crafts"
    ],
    "steps": [
        {
            "headline": "Take a look through your cloth stash.",
            "description": "If you already have cotton prints in green shades, you can just use them. If not, then head out to your local fabric purveyor and pick up a few fat quarters of green cotton print for this project."
        },
        {
            "headline": "Cut the fabric into 3/4 inch (around 1.5 cm) strips.",
            "description": "You will need around 10 to 14 strips per tree, in graduated lengths. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/83\\/A-Cinnamontree3a.jpg\\/460px-A-Cinnamontree3a.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/83\\/A-Cinnamontree3a.jpg\\/759px-A-Cinnamontree3a.jpg\",\"smallWidth\":460,\"smallHeight\":385,\"bigWidth\":760,\"bigHeight\":635.6363636363636,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}Cut the strips into graduated lengths ranging from around 8 inches (20cm) long up to around 12 inches (30.5cm) long."
        },
        {
            "headline": "Lay a cinnamon stick on the work space in front of you.",
            "description": ""
        },
        {
            "headline": "Tie the shortest strip of cloth onto the stick near the top end.",
            "description": "Use a simple over-hand knot. You may also add a dab of glue if you wish, but this is not generally necessary. Tie the next longest strip below the first."
        },
        {
            "headline": "Move on down the length of the cinnamon stick, tying successively longer cloth strips to the stick.",
            "description": "After each tie, gently slide the fabric strips together."
        },
        {
            "headline": "If your cloth strips are noticeably uneven, straighten them up at this point.",
            "description": "You can trim them shorter if you like. Leave around an inch of stick at the bottom to serve as the \"base\" of your tree trunk."
        },
        {
            "headline": "Leave around an inch of stick at each end.",
            "description": "The end with the shorter cloth strips will be the top of the tree. You can either hot glue a ribbon loop for hanging, or drill a small hole for hanging at that end. Add a decorative element at the top if wished. A star, an angel, etc., are all good choices."
        },
        {
            "headline": "Tidy up any loose ends and place the finished cinnamon tree on display.",
            "description": ""
        }
    ],
    "tyn": [
        "Cinnamon sticks",
        "Scrap fabrics in shades of green",
        "Scissors or rotary cutter",
        "Embellishments such as tiny seed pods, stars, etc.",
        "Small drill for holes to put Christmas tree hangers into"
    ],
    "text": " Take a look through your cloth stash. If you already have cotton prints in green shades, you can just use them. If not, then head out to your local fabric purveyor and pick up a few fat quarters of green cotton print for this project. Cut the fabric into 3/4 inch (around 1.5 cm) strips. You will need around 10 to 14 strips per tree, in graduated lengths. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/83\\/A-Cinnamontree3a.jpg\\/460px-A-Cinnamontree3a.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/83\\/A-Cinnamontree3a.jpg\\/759px-A-Cinnamontree3a.jpg\",\"smallWidth\":460,\"smallHeight\":385,\"bigWidth\":760,\"bigHeight\":635.6363636363636,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}Cut the strips into graduated lengths ranging from around 8 inches (20cm) long up to around 12 inches (30.5cm) long. Lay a cinnamon stick on the work space in front of you.  Tie the shortest strip of cloth onto the stick near the top end. Use a simple over-hand knot. You may also add a dab of glue if you wish, but this is not generally necessary. Tie the next longest strip below the first. Move on down the length of the cinnamon stick, tying successively longer cloth strips to the stick. After each tie, gently slide the fabric strips together. If your cloth strips are noticeably uneven, straighten them up at this point. You can trim them shorter if you like. Leave around an inch of stick at the bottom to serve as the \"base\" of your tree trunk. Leave around an inch of stick at each end. The end with the shorter cloth strips will be the top of the tree. You can either hot glue a ribbon loop for hanging, or drill a small hole for hanging at that end. Add a decorative element at the top if wished. A star, an angel, etc., are all good choices. Tidy up any loose ends and place the finished cinnamon tree on display. ",
    "sentences": [
        " Take a look through your cloth stash.",
        "If you already have cotton prints in green shades, you can just use them.",
        "If not, then head out to your local fabric purveyor and pick up a few fat quarters of green cotton print for this project.",
        "Cut the fabric into 3/4 inch (around 1.5 cm) strips.",
        "You will need around 10 to 14 strips per tree, in graduated lengths.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/83\\/A-Cinnamontree3a.jpg\\/460px-A-Cinnamontree3a.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/83\\/A-Cinnamontree3a.jpg\\/759px-A-Cinnamontree3a.jpg\",\"smallWidth\":460,\"smallHeight\":385,\"bigWidth\":760,\"bigHeight\":635.6363636363636,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}Cut the strips into graduated lengths ranging from around 8 inches (20cm) long up to around 12 inches (30.5cm) long.",
        "Lay a cinnamon stick on the work space in front of you.",
        "Tie the shortest strip of cloth onto the stick near the top end.",
        "Use a simple over-hand knot.",
        "You may also add a dab of glue if you wish, but this is not generally necessary.",
        "Tie the next longest strip below the first.",
        "Move on down the length of the cinnamon stick, tying successively longer cloth strips to the stick.",
        "After each tie, gently slide the fabric strips together.",
        "If your cloth strips are noticeably uneven, straighten them up at this point.",
        "You can trim them shorter if you like.",
        "Leave around an inch of stick at the bottom to serve as the \"base\" of your tree trunk.",
        "Leave around an inch of stick at each end.",
        "The end with the shorter cloth strips will be the top of the tree.",
        "You can either hot glue a ribbon loop for hanging, or drill a small hole for hanging at that end.",
        "Add a decorative element at the top if wished.",
        "A star, an angel, etc., are all good choices.",
        "Tidy up any loose ends and place the finished cinnamon tree on display."
    ]
}