{
    "title": "How to Burn Candles Evenly",
    "url": "https://www.wikihow.com/Burn-Candles-Evenly",
    "category_hierarchy": [
        "Home and Garden",
        "Lighting",
        "Candles"
    ],
    "methods": [
        {
            "name": "Lighting Candles Properly",
            "steps": [
                {
                    "headline": "Position a candle vertically on a flat, stable surface.",
                    "description": "If you place a candle on an uneven surface, the wax will melt in irregular patterns and the flickering flames might give off dark smoke stains. Tapers and pillar candles will drip excessively if they're not totally upright. Most importantly, it's highly unsafe to place a candle on an unstable or angled surface, such as a chair seat or a wobbly table. The surface should also be fire resistant."
                },
                {
                    "headline": "Light candles with a long lighter or long matches.",
                    "description": "If you keep the candle level and use a long match or lighter, you'll more easily be able to reach the wick and won't start an uneven burn. Strike a match or engage the lighter, and touch the flame to the wick. As soon as it ignites, remove the lighter or match and extinguish the flame. If you blow out the match, do this away from the candle flame. With short lighters and matches, it's sometimes necessary to turn the candle sideways to reach the wick. This will cause some flickering and might unevenly melt the wax, leading to an uneven burn."
                },
                {
                    "headline": "Keep burning candles away from drafts.",
                    "description": "Flickering flames might look pretty, but they don't burn candles evenly. Place your candle in a breeze-free location, away from fans, air conditioning units, open windows, passers-by, and any other source of moving air. Flickering flames also leave unattractive smoke stains. These are especially noticeable on glass candle jars. This is also a safety precaution. Even a gentle breeze might blow a piece of paper or a curtain corner directly into the flame."
                },
                {
                    "headline": "Trim candle wicks to be ⁄8 to ⁄4 in (0.32 to 0.64 cm) tall before each use.",
                    "description": "Long, uncut wicks often take on a mushroom-like shape. This creates a wide, unstable flame that flickers, gives off smoke, and prevents the candle from burning evenly. Combat this by using a wick trimmer or a pair of scissors to chop the top of the wick off, once the wax has completely cool. Discard all the wick trimmings and make sure there's no ashy residue left sitting on the wax. Even if there's not much height to trim off, you should trim the wick before every single use to get the most stable flame and the most even burn."
                },
                {
                    "headline": "Melt the entire top layer of wax during the first burn.",
                    "description": "Allow poured and pillar candles to burn until the top surface of wax has completely melted. Monitor the progress and don't extinguish the flame until there's about a ⁄4 in (0.64 cm) ring of melted wax spanning the full diameter of the jar. For a pillar candle, snuff out the flame once you notice the wax pool stops widening and start to sink, snuff out the flame. This might take several hours, depending on the type and size of the candle. A rule of thumb is that it takes about 1 hour per 1 in (2.5 cm) of the candle's diameter. For example, if your candle's diameter is 4 in (10 cm) you can expect to burn it for 4 hours the first time."
                },
                {
                    "headline": "Avoid memory rings by allowing the top layer of wax to melt during each burn.",
                    "description": "A candle can “remember” how much wax melted during previous burns. The pool of melted wax will continue to get narrower and narrower if you aren't careful, and you'll end up with tunneling. To prevent this, follow the same process as you did during the initial burn. Monitor the candle during every burn session and allow the entire top layer of wax to melt."
                },
                {
                    "headline": "Burn candles for a maximum of 4 hours.",
                    "description": "Monitor the candle's progress continually, and snuff out the flame as soon as you notice the wax has pooled all the way across the top level. Anything beyond 4 hours can cause the wax and fragrance oils to ignite. Follow the candle manufacturer's instructions for maximum burn times. Some candles can only withstand shorter burns."
                },
                {
                    "headline": "Consider purchasing a multi-wick candle.",
                    "description": "It might seem like more wicks would lead to a quicker burn, but in fact, multiple wicks contribute to slower, more even burns. The wicks are spread out evenly and, in poured candles, they're positioned closer to the edges of the jar. This means that that the wax will burn in a nice even layer and tunneling won't likely occur. For instance, a 3 in (7.6 cm) diameter candle with 3 wicks will burn longer and more evenly than the same sized candle with only 1 wick. If you discover that the wick is off-center in your 1-wick candle, your chances of an uneven burn are higher. More wicks improve your chances of success."
                }
            ]
        },
        {
            "name": "Extinguishing and Storing Candles",
            "steps": [
                {
                    "headline": "Stop burning candles when there's still a little wax left.",
                    "description": "Cease burning stand-alone tapers and pillar candles once the wax has burned down to 2 in (5.1 cm). As for poured candles, stop burning these when only ⁄2 in (1.3 cm) of wax remains in the jar. Follow this precaution even if there's lots of wax left above the wick due to tunneling. With less wax left to fuel the flame, a candle can quickly become unstable and hazardous. After properly burning a poured candle, you can often reuse the jar. Place it in the freezer for a couple of hours. Pop out the remaining wax using a butter knife and you'll be left with a nice new storage container."
                },
                {
                    "headline": "Sprinkle salt onto an extinguished candle's melted wax.",
                    "description": "Salt slows down wax's melting rate, leading to a slower and more even burn. After you've extinguished a pillar candle, poured candle, or votive, sprinkle a dash of iodized table salt onto the pool of melted wax. Mix it thoroughly into the liquid wax using a toothpick. Let the wax cool completely. You can keep adding salt after subsequent burn sessions to lengthen the life of the candle."
                },
                {
                    "headline": "Snuff out a candle's flame instead of blowing it out.",
                    "description": "Blowing out a candle actually spreads ashy debris into the melted wax and potentially onto the candle holder. When you're ready to extinguish the flame, hold a candle snuffer directly over the flame and lower it until it's just above the melted pool of wax. Hold it there for 2 or 3 seconds. Once the flame has used up the remaining oxygen under the snuffer, it will go out. If you don't have a candle snuffer, a large metal spoon will do the trick. If your candle came with a fireproof lid, such as a glass cover, place this over the lit candle and the flame will extinguish itself. Be aware that the lid might end up with some ashy residue though."
                },
                {
                    "headline": "Don't extinguish candle flames with water.",
                    "description": "Although fire and water might seem like a logical choice, water is an unsafe candle extinguishing option. The force of even a glass of water will splash hot wax all over the place -- the candle jar or holder, the table, and possibly even the walls and floor. Even worse, the wax is likely to splash out and burn your skin. This is especially important to avoid with glass candle jars. The hot glass will shatter upon contact with cold water."
                },
                {
                    "headline": "Allow the wax to completely cool before moving or reusing a candle.",
                    "description": "Leave the candle in place until all the melted wax has cooled and hardened. It is unsafe to pick up a liquefied candle. Plus, you're likely to slosh around the hot wax which will drip down the sides or stick to the edges of the jar. To extend the life of a candle, don't burn it for more than 1 session every 24 hours."
                },
                {
                    "headline": "Store candles in the freezer.",
                    "description": "The colder the wax is, the slower it will melt. Place your candle in the freezer a few hours before you plan to burn it and you'll notice a slower, more even burn. Better yet, store your candles in the freezer when they're not in use. Narrow tapers will freeze after just 1 hour. You can place these in the freezer right before you start preparing a dinner party. Large pillars might take up to 8 hours to completely freeze. Pop these in the freezer the night before, or first thing in the morning in preparation for a candlelit evening."
                },
                {
                    "headline": "Protect candles from dust.",
                    "description": "Dust will burn up in the flames, causing smoke, crackling, and an uneven burn. Use nylon pantyhose to wipe the dust off of candles. If your poured candle came with a cover, store it with the lid on securely. Otherwise, keep candles in a dust-free drawer or cupboard (or in the freezer). You can easily wrap tapers and pillar candles in tissue paper. Store votives in boxes or plastic baggies. You should only wipe down, wrap up, or store candles once the wax is completely hardened and cool."
                }
            ]
        },
        {
            "name": "Preventing Tunneling in Poured and Pillar Candles",
            "steps": [
                {
                    "headline": "Melt the top layer of wax completely during the initial burn of a poured candle.",
                    "description": "After you light your brand new poured candle, allow it to burn until the top surface of wax has completely melted. Monitor the progress and don't extinguish the flame until there's about a ⁄4 in (0.64 cm) ring of melted wax spanning the full diameter of the jar."
                },
                {
                    "headline": "Burn a pillar candle until a wide pool of melted wax forms during the first burn.",
                    "description": "Unlike a poured candle, a pillar doesn't have a container in which the melted wax can pool. But you can follow the same technique to avoid tunneling. Make sure a wide pool of wax forms during the first burn. Once you notice the wax pool stops getting wider and begins to sink lower, snuff out the flame."
                },
                {
                    "headline": "Melt the top layer of wax for every subsequent burn.",
                    "description": "The initial burn of a pillar and poured candles is crucial to get right, but the work doesn't end there. Follow the same technique each time you burn the candle. The wax should always melt in an even layer, right out to the edges of the jar. It will solidify in a flat, even layer and no tunneling will occur. Poured and pillar candles, especially large ones, need to burn for several hours to achieve an even layer of melted wax. Don't light one if you aren't planning to keep it lit and monitored for a short duration."
                },
                {
                    "headline": "Fold in the top edges of a pillar candle while the wax is still soft.",
                    "description": "Once the flame is extinguished, use your hands to smooth over the top edges of the pillar. Fold them in towards the center so that the hard edges become soft curves leaning inward. During the next burn, these edges will melt away and there won't be any excess wax to create a tunneling effect."
                },
                {
                    "headline": "Warm a candle in the oven to soften the tunneling.",
                    "description": "Preheat your oven to 175 °F (79 °C) and place your candle jar onto a baking sheet. Put the candle in the oven for about 5 minutes to soften the wax and loosen it up from the edges of the jar. Once it's warm, flatten it into an even layer using a butter knife or metal teaspoon. If the wick gets covered by the wax, remove the excess. You'll need at least ⁄8 in (0.32 cm) of the wick exposed to get a satisfactory burn. Make sure the candle's jar is oven-safe before following this process. You can also warm up the wax using a hairdryer on a high heat setting. After about 10 minutes the wax will start to soften up."
                },
                {
                    "headline": "Wrap aluminum foil around the top of a candle jar to melt away the tunneling.",
                    "description": "Light the candle first. Then carefully wrap a cylinder of double-layered aluminum foil about 6 in (15 cm) tall by 12 in (30 cm) wide around the top portion of the candle jar. Leave about 3 in (7.6 cm) extending above the jar and cup in the top edges of foil to form a rounded cover with an opening in the center. Remove the foil wrap after 2 hours and the wax tunneling should be melted. Make sure you monitor your candle while it burns. Just because you can't see the flame doesn't mean it's a potential hazard."
                },
                {
                    "headline": "Burn a pillar candle in a hurricane vase.",
                    "description": "Select an open-topped glass hurricane vase that your pillar candle can fit inside. The vase should be a few inches taller than the candle. Burn the candle in the hurricane to trap in more heat and more quickly soften and melt the wax for a more even burn."
                },
                {
                    "headline": "Cut away excess tunneling with a butter knife.",
                    "description": "When the wax is warm and soft, use a metal butter knife to cut out the hard pieces of wax. Carve out small sections and dislodge them from the sides of the jar. Remove all the excess until you have a relatively smooth, flat top layer of wax, sitting ⁄8 in (0.32 cm) below the top of the wick. You can do this after warming the candle in the oven, or after a burn session before the wax has completely cooled. Try saving the pieces of wax to warm over a tealight warmer. This way, you'll still get to enjoy the fragrance and won't waste any part of the candle."
                }
            ]
        },
        {
            "name": "Burning Tapers Evenly",
            "steps": [
                {
                    "headline": "Keep lit tapers totally upright and away from drafts.",
                    "description": "This is necessary for all types of candles, but it is especially important for evenly burning tapers. Only place a taper in a taper holder or candlestick that fits it securely. There should be no wobbling or leaning. You can melt a few drops of wax into the base of the taper holder to help the candle stay in place. But if there's a fit issue to begin with, you probably won't get the most even burn from the taper."
                },
                {
                    "headline": "Direct all air flow away from lit tapers.",
                    "description": "Again, this is important for any type of candle. But even the slightest air movement can have a noticeable impact on burning tapers. Direct any fans and vents away from the tapers, and keep nearby windows closed. Air movement will disturb the flame and will lead to lopsided tapers dripping with wax."
                },
                {
                    "headline": "Opt for “dripless” tapers.",
                    "description": "Although the name is a bit of an exaggeration, the wax of a “dripless” candle is designed to cool and harden very quickly. So, even if your candle drips a little, the drips will harden into place. You'll be able to peel them off, or shave them off with a butter knife, once the candle is extinguished. As a bonus, you can choose paraffin or beeswax candles which tend to have a slower burn time. The slower the burn, the less opportunity for drippage."
                }
            ]
        }
    ],
    "tyn": [
        "Lighting Candles Properly",
        "Candle (multi-wick optional)",
        "Long lighter or long matches",
        "Flat, stable, fire resistant surface",
        "Wick trimmer or scissors",
        "Extinguishing and Storing Candles",
        "Snuffer",
        "Iodized table salt",
        "Nylon pantyhose",
        "Jar lid, tissue paper, or baggie",
        "Freezer",
        "Preventing Tunneling in Poured and Pillar Candles",
        "Pillar or poured candle",
        "Aluminum foil",
        "Hurricane vase",
        "Oven",
        "Butter knife",
        "Burning Tapers Evenly",
        "Dripless tapers",
        "Taper holders or candlesticks"
    ],
    "text": " Lighting Candles Properly Position a candle vertically on a flat, stable surface. If you place a candle on an uneven surface, the wax will melt in irregular patterns and the flickering flames might give off dark smoke stains. Tapers and pillar candles will drip excessively if they're not totally upright. Most importantly, it's highly unsafe to place a candle on an unstable or angled surface, such as a chair seat or a wobbly table. The surface should also be fire resistant. Light candles with a long lighter or long matches. If you keep the candle level and use a long match or lighter, you'll more easily be able to reach the wick and won't start an uneven burn. Strike a match or engage the lighter, and touch the flame to the wick. As soon as it ignites, remove the lighter or match and extinguish the flame. If you blow out the match, do this away from the candle flame. With short lighters and matches, it's sometimes necessary to turn the candle sideways to reach the wick. This will cause some flickering and might unevenly melt the wax, leading to an uneven burn. Keep burning candles away from drafts. Flickering flames might look pretty, but they don't burn candles evenly. Place your candle in a breeze-free location, away from fans, air conditioning units, open windows, passers-by, and any other source of moving air. Flickering flames also leave unattractive smoke stains. These are especially noticeable on glass candle jars. This is also a safety precaution. Even a gentle breeze might blow a piece of paper or a curtain corner directly into the flame. Trim candle wicks to be ⁄8 to ⁄4 in (0.32 to 0.64 cm) tall before each use. Long, uncut wicks often take on a mushroom-like shape. This creates a wide, unstable flame that flickers, gives off smoke, and prevents the candle from burning evenly. Combat this by using a wick trimmer or a pair of scissors to chop the top of the wick off, once the wax has completely cool. Discard all the wick trimmings and make sure there's no ashy residue left sitting on the wax. Even if there's not much height to trim off, you should trim the wick before every single use to get the most stable flame and the most even burn. Melt the entire top layer of wax during the first burn. Allow poured and pillar candles to burn until the top surface of wax has completely melted. Monitor the progress and don't extinguish the flame until there's about a ⁄4 in (0.64 cm) ring of melted wax spanning the full diameter of the jar. For a pillar candle, snuff out the flame once you notice the wax pool stops widening and start to sink, snuff out the flame. This might take several hours, depending on the type and size of the candle. A rule of thumb is that it takes about 1 hour per 1 in (2.5 cm) of the candle's diameter. For example, if your candle's diameter is 4 in (10 cm) you can expect to burn it for 4 hours the first time. Avoid memory rings by allowing the top layer of wax to melt during each burn. A candle can “remember” how much wax melted during previous burns. The pool of melted wax will continue to get narrower and narrower if you aren't careful, and you'll end up with tunneling. To prevent this, follow the same process as you did during the initial burn. Monitor the candle during every burn session and allow the entire top layer of wax to melt. Burn candles for a maximum of 4 hours. Monitor the candle's progress continually, and snuff out the flame as soon as you notice the wax has pooled all the way across the top level. Anything beyond 4 hours can cause the wax and fragrance oils to ignite. Follow the candle manufacturer's instructions for maximum burn times. Some candles can only withstand shorter burns. Consider purchasing a multi-wick candle. It might seem like more wicks would lead to a quicker burn, but in fact, multiple wicks contribute to slower, more even burns. The wicks are spread out evenly and, in poured candles, they're positioned closer to the edges of the jar. This means that that the wax will burn in a nice even layer and tunneling won't likely occur. For instance, a 3 in (7.6 cm) diameter candle with 3 wicks will burn longer and more evenly than the same sized candle with only 1 wick. If you discover that the wick is off-center in your 1-wick candle, your chances of an uneven burn are higher. More wicks improve your chances of success. Extinguishing and Storing Candles Stop burning candles when there's still a little wax left. Cease burning stand-alone tapers and pillar candles once the wax has burned down to 2 in (5.1 cm). As for poured candles, stop burning these when only ⁄2 in (1.3 cm) of wax remains in the jar. Follow this precaution even if there's lots of wax left above the wick due to tunneling. With less wax left to fuel the flame, a candle can quickly become unstable and hazardous. After properly burning a poured candle, you can often reuse the jar. Place it in the freezer for a couple of hours. Pop out the remaining wax using a butter knife and you'll be left with a nice new storage container. Sprinkle salt onto an extinguished candle's melted wax. Salt slows down wax's melting rate, leading to a slower and more even burn. After you've extinguished a pillar candle, poured candle, or votive, sprinkle a dash of iodized table salt onto the pool of melted wax. Mix it thoroughly into the liquid wax using a toothpick. Let the wax cool completely. You can keep adding salt after subsequent burn sessions to lengthen the life of the candle. Snuff out a candle's flame instead of blowing it out. Blowing out a candle actually spreads ashy debris into the melted wax and potentially onto the candle holder. When you're ready to extinguish the flame, hold a candle snuffer directly over the flame and lower it until it's just above the melted pool of wax. Hold it there for 2 or 3 seconds. Once the flame has used up the remaining oxygen under the snuffer, it will go out. If you don't have a candle snuffer, a large metal spoon will do the trick. If your candle came with a fireproof lid, such as a glass cover, place this over the lit candle and the flame will extinguish itself. Be aware that the lid might end up with some ashy residue though. Don't extinguish candle flames with water. Although fire and water might seem like a logical choice, water is an unsafe candle extinguishing option. The force of even a glass of water will splash hot wax all over the place -- the candle jar or holder, the table, and possibly even the walls and floor. Even worse, the wax is likely to splash out and burn your skin. This is especially important to avoid with glass candle jars. The hot glass will shatter upon contact with cold water. Allow the wax to completely cool before moving or reusing a candle. Leave the candle in place until all the melted wax has cooled and hardened. It is unsafe to pick up a liquefied candle. Plus, you're likely to slosh around the hot wax which will drip down the sides or stick to the edges of the jar. To extend the life of a candle, don't burn it for more than 1 session every 24 hours. Store candles in the freezer. The colder the wax is, the slower it will melt. Place your candle in the freezer a few hours before you plan to burn it and you'll notice a slower, more even burn. Better yet, store your candles in the freezer when they're not in use. Narrow tapers will freeze after just 1 hour. You can place these in the freezer right before you start preparing a dinner party. Large pillars might take up to 8 hours to completely freeze. Pop these in the freezer the night before, or first thing in the morning in preparation for a candlelit evening. Protect candles from dust. Dust will burn up in the flames, causing smoke, crackling, and an uneven burn. Use nylon pantyhose to wipe the dust off of candles. If your poured candle came with a cover, store it with the lid on securely. Otherwise, keep candles in a dust-free drawer or cupboard (or in the freezer). You can easily wrap tapers and pillar candles in tissue paper. Store votives in boxes or plastic baggies. You should only wipe down, wrap up, or store candles once the wax is completely hardened and cool. Preventing Tunneling in Poured and Pillar Candles Melt the top layer of wax completely during the initial burn of a poured candle. After you light your brand new poured candle, allow it to burn until the top surface of wax has completely melted. Monitor the progress and don't extinguish the flame until there's about a ⁄4 in (0.64 cm) ring of melted wax spanning the full diameter of the jar. Burn a pillar candle until a wide pool of melted wax forms during the first burn. Unlike a poured candle, a pillar doesn't have a container in which the melted wax can pool. But you can follow the same technique to avoid tunneling. Make sure a wide pool of wax forms during the first burn. Once you notice the wax pool stops getting wider and begins to sink lower, snuff out the flame. Melt the top layer of wax for every subsequent burn. The initial burn of a pillar and poured candles is crucial to get right, but the work doesn't end there. Follow the same technique each time you burn the candle. The wax should always melt in an even layer, right out to the edges of the jar. It will solidify in a flat, even layer and no tunneling will occur. Poured and pillar candles, especially large ones, need to burn for several hours to achieve an even layer of melted wax. Don't light one if you aren't planning to keep it lit and monitored for a short duration. Fold in the top edges of a pillar candle while the wax is still soft. Once the flame is extinguished, use your hands to smooth over the top edges of the pillar. Fold them in towards the center so that the hard edges become soft curves leaning inward. During the next burn, these edges will melt away and there won't be any excess wax to create a tunneling effect. Warm a candle in the oven to soften the tunneling. Preheat your oven to 175 °F (79 °C) and place your candle jar onto a baking sheet. Put the candle in the oven for about 5 minutes to soften the wax and loosen it up from the edges of the jar. Once it's warm, flatten it into an even layer using a butter knife or metal teaspoon. If the wick gets covered by the wax, remove the excess. You'll need at least ⁄8 in (0.32 cm) of the wick exposed to get a satisfactory burn. Make sure the candle's jar is oven-safe before following this process. You can also warm up the wax using a hairdryer on a high heat setting. After about 10 minutes the wax will start to soften up. Wrap aluminum foil around the top of a candle jar to melt away the tunneling. Light the candle first. Then carefully wrap a cylinder of double-layered aluminum foil about 6 in (15 cm) tall by 12 in (30 cm) wide around the top portion of the candle jar. Leave about 3 in (7.6 cm) extending above the jar and cup in the top edges of foil to form a rounded cover with an opening in the center. Remove the foil wrap after 2 hours and the wax tunneling should be melted. Make sure you monitor your candle while it burns. Just because you can't see the flame doesn't mean it's a potential hazard. Burn a pillar candle in a hurricane vase. Select an open-topped glass hurricane vase that your pillar candle can fit inside. The vase should be a few inches taller than the candle. Burn the candle in the hurricane to trap in more heat and more quickly soften and melt the wax for a more even burn. Cut away excess tunneling with a butter knife. When the wax is warm and soft, use a metal butter knife to cut out the hard pieces of wax. Carve out small sections and dislodge them from the sides of the jar. Remove all the excess until you have a relatively smooth, flat top layer of wax, sitting ⁄8 in (0.32 cm) below the top of the wick. You can do this after warming the candle in the oven, or after a burn session before the wax has completely cooled. Try saving the pieces of wax to warm over a tealight warmer. This way, you'll still get to enjoy the fragrance and won't waste any part of the candle. Burning Tapers Evenly Keep lit tapers totally upright and away from drafts. This is necessary for all types of candles, but it is especially important for evenly burning tapers. Only place a taper in a taper holder or candlestick that fits it securely. There should be no wobbling or leaning. You can melt a few drops of wax into the base of the taper holder to help the candle stay in place. But if there's a fit issue to begin with, you probably won't get the most even burn from the taper. Direct all air flow away from lit tapers. Again, this is important for any type of candle. But even the slightest air movement can have a noticeable impact on burning tapers. Direct any fans and vents away from the tapers, and keep nearby windows closed. Air movement will disturb the flame and will lead to lopsided tapers dripping with wax. Opt for “dripless” tapers. Although the name is a bit of an exaggeration, the wax of a “dripless” candle is designed to cool and harden very quickly. So, even if your candle drips a little, the drips will harden into place. You'll be able to peel them off, or shave them off with a butter knife, once the candle is extinguished. As a bonus, you can choose paraffin or beeswax candles which tend to have a slower burn time. The slower the burn, the less opportunity for drippage.",
    "sentences": [
        " Lighting Candles Properly Position a candle vertically on a flat, stable surface.",
        "If you place a candle on an uneven surface, the wax will melt in irregular patterns and the flickering flames might give off dark smoke stains.",
        "Tapers and pillar candles will drip excessively if they're not totally upright.",
        "Most importantly, it's highly unsafe to place a candle on an unstable or angled surface, such as a chair seat or a wobbly table.",
        "The surface should also be fire resistant.",
        "Light candles with a long lighter or long matches.",
        "If you keep the candle level and use a long match or lighter, you'll more easily be able to reach the wick and won't start an uneven burn.",
        "Strike a match or engage the lighter, and touch the flame to the wick.",
        "As soon as it ignites, remove the lighter or match and extinguish the flame.",
        "If you blow out the match, do this away from the candle flame.",
        "With short lighters and matches, it's sometimes necessary to turn the candle sideways to reach the wick.",
        "This will cause some flickering and might unevenly melt the wax, leading to an uneven burn.",
        "Keep burning candles away from drafts.",
        "Flickering flames might look pretty, but they don't burn candles evenly.",
        "Place your candle in a breeze-free location, away from fans, air conditioning units, open windows, passers-by, and any other source of moving air.",
        "Flickering flames also leave unattractive smoke stains.",
        "These are especially noticeable on glass candle jars.",
        "This is also a safety precaution.",
        "Even a gentle breeze might blow a piece of paper or a curtain corner directly into the flame.",
        "Trim candle wicks to be ⁄8 to ⁄4 in (0.32 to 0.64 cm) tall before each use.",
        "Long, uncut wicks often take on a mushroom-like shape.",
        "This creates a wide, unstable flame that flickers, gives off smoke, and prevents the candle from burning evenly.",
        "Combat this by using a wick trimmer or a pair of scissors to chop the top of the wick off, once the wax has completely cool.",
        "Discard all the wick trimmings and make sure there's no ashy residue left sitting on the wax.",
        "Even if there's not much height to trim off, you should trim the wick before every single use to get the most stable flame and the most even burn.",
        "Melt the entire top layer of wax during the first burn.",
        "Allow poured and pillar candles to burn until the top surface of wax has completely melted.",
        "Monitor the progress and don't extinguish the flame until there's about a ⁄4 in (0.64 cm) ring of melted wax spanning the full diameter of the jar.",
        "For a pillar candle, snuff out the flame once you notice the wax pool stops widening and start to sink, snuff out the flame.",
        "This might take several hours, depending on the type and size of the candle.",
        "A rule of thumb is that it takes about 1 hour per 1 in (2.5 cm) of the candle's diameter.",
        "For example, if your candle's diameter is 4 in (10 cm) you can expect to burn it for 4 hours the first time.",
        "Avoid memory rings by allowing the top layer of wax to melt during each burn.",
        "A candle can “remember” how much wax melted during previous burns.",
        "The pool of melted wax will continue to get narrower and narrower if you aren't careful, and you'll end up with tunneling.",
        "To prevent this, follow the same process as you did during the initial burn.",
        "Monitor the candle during every burn session and allow the entire top layer of wax to melt.",
        "Burn candles for a maximum of 4 hours.",
        "Monitor the candle's progress continually, and snuff out the flame as soon as you notice the wax has pooled all the way across the top level.",
        "Anything beyond 4 hours can cause the wax and fragrance oils to ignite.",
        "Follow the candle manufacturer's instructions for maximum burn times.",
        "Some candles can only withstand shorter burns.",
        "Consider purchasing a multi-wick candle.",
        "It might seem like more wicks would lead to a quicker burn, but in fact, multiple wicks contribute to slower, more even burns.",
        "The wicks are spread out evenly and, in poured candles, they're positioned closer to the edges of the jar.",
        "This means that that the wax will burn in a nice even layer and tunneling won't likely occur.",
        "For instance, a 3 in (7.6 cm) diameter candle with 3 wicks will burn longer and more evenly than the same sized candle with only 1 wick.",
        "If you discover that the wick is off-center in your 1-wick candle, your chances of an uneven burn are higher.",
        "More wicks improve your chances of success.",
        "Extinguishing and Storing Candles Stop burning candles when there's still a little wax left.",
        "Cease burning stand-alone tapers and pillar candles once the wax has burned down to 2 in (5.1 cm).",
        "As for poured candles, stop burning these when only ⁄2 in (1.3 cm) of wax remains in the jar.",
        "Follow this precaution even if there's lots of wax left above the wick due to tunneling.",
        "With less wax left to fuel the flame, a candle can quickly become unstable and hazardous.",
        "After properly burning a poured candle, you can often reuse the jar.",
        "Place it in the freezer for a couple of hours.",
        "Pop out the remaining wax using a butter knife and you'll be left with a nice new storage container.",
        "Sprinkle salt onto an extinguished candle's melted wax.",
        "Salt slows down wax's melting rate, leading to a slower and more even burn.",
        "After you've extinguished a pillar candle, poured candle, or votive, sprinkle a dash of iodized table salt onto the pool of melted wax.",
        "Mix it thoroughly into the liquid wax using a toothpick.",
        "Let the wax cool completely.",
        "You can keep adding salt after subsequent burn sessions to lengthen the life of the candle.",
        "Snuff out a candle's flame instead of blowing it out.",
        "Blowing out a candle actually spreads ashy debris into the melted wax and potentially onto the candle holder.",
        "When you're ready to extinguish the flame, hold a candle snuffer directly over the flame and lower it until it's just above the melted pool of wax.",
        "Hold it there for 2 or 3 seconds.",
        "Once the flame has used up the remaining oxygen under the snuffer, it will go out.",
        "If you don't have a candle snuffer, a large metal spoon will do the trick.",
        "If your candle came with a fireproof lid, such as a glass cover, place this over the lit candle and the flame will extinguish itself.",
        "Be aware that the lid might end up with some ashy residue though.",
        "Don't extinguish candle flames with water.",
        "Although fire and water might seem like a logical choice, water is an unsafe candle extinguishing option.",
        "The force of even a glass of water will splash hot wax all over the place -- the candle jar or holder, the table, and possibly even the walls and floor.",
        "Even worse, the wax is likely to splash out and burn your skin.",
        "This is especially important to avoid with glass candle jars.",
        "The hot glass will shatter upon contact with cold water.",
        "Allow the wax to completely cool before moving or reusing a candle.",
        "Leave the candle in place until all the melted wax has cooled and hardened.",
        "It is unsafe to pick up a liquefied candle.",
        "Plus, you're likely to slosh around the hot wax which will drip down the sides or stick to the edges of the jar.",
        "To extend the life of a candle, don't burn it for more than 1 session every 24 hours.",
        "Store candles in the freezer.",
        "The colder the wax is, the slower it will melt.",
        "Place your candle in the freezer a few hours before you plan to burn it and you'll notice a slower, more even burn.",
        "Better yet, store your candles in the freezer when they're not in use.",
        "Narrow tapers will freeze after just 1 hour.",
        "You can place these in the freezer right before you start preparing a dinner party.",
        "Large pillars might take up to 8 hours to completely freeze.",
        "Pop these in the freezer the night before, or first thing in the morning in preparation for a candlelit evening.",
        "Protect candles from dust.",
        "Dust will burn up in the flames, causing smoke, crackling, and an uneven burn.",
        "Use nylon pantyhose to wipe the dust off of candles.",
        "If your poured candle came with a cover, store it with the lid on securely.",
        "Otherwise, keep candles in a dust-free drawer or cupboard (or in the freezer).",
        "You can easily wrap tapers and pillar candles in tissue paper.",
        "Store votives in boxes or plastic baggies.",
        "You should only wipe down, wrap up, or store candles once the wax is completely hardened and cool.",
        "Preventing Tunneling in Poured and Pillar Candles Melt the top layer of wax completely during the initial burn of a poured candle.",
        "After you light your brand new poured candle, allow it to burn until the top surface of wax has completely melted.",
        "Monitor the progress and don't extinguish the flame until there's about a ⁄4 in (0.64 cm) ring of melted wax spanning the full diameter of the jar.",
        "Burn a pillar candle until a wide pool of melted wax forms during the first burn.",
        "Unlike a poured candle, a pillar doesn't have a container in which the melted wax can pool.",
        "But you can follow the same technique to avoid tunneling.",
        "Make sure a wide pool of wax forms during the first burn.",
        "Once you notice the wax pool stops getting wider and begins to sink lower, snuff out the flame.",
        "Melt the top layer of wax for every subsequent burn.",
        "The initial burn of a pillar and poured candles is crucial to get right, but the work doesn't end there.",
        "Follow the same technique each time you burn the candle.",
        "The wax should always melt in an even layer, right out to the edges of the jar.",
        "It will solidify in a flat, even layer and no tunneling will occur.",
        "Poured and pillar candles, especially large ones, need to burn for several hours to achieve an even layer of melted wax.",
        "Don't light one if you aren't planning to keep it lit and monitored for a short duration.",
        "Fold in the top edges of a pillar candle while the wax is still soft.",
        "Once the flame is extinguished, use your hands to smooth over the top edges of the pillar.",
        "Fold them in towards the center so that the hard edges become soft curves leaning inward.",
        "During the next burn, these edges will melt away and there won't be any excess wax to create a tunneling effect.",
        "Warm a candle in the oven to soften the tunneling.",
        "Preheat your oven to 175 °F (79 °C) and place your candle jar onto a baking sheet.",
        "Put the candle in the oven for about 5 minutes to soften the wax and loosen it up from the edges of the jar.",
        "Once it's warm, flatten it into an even layer using a butter knife or metal teaspoon.",
        "If the wick gets covered by the wax, remove the excess.",
        "You'll need at least ⁄8 in (0.32 cm) of the wick exposed to get a satisfactory burn.",
        "Make sure the candle's jar is oven-safe before following this process.",
        "You can also warm up the wax using a hairdryer on a high heat setting.",
        "After about 10 minutes the wax will start to soften up.",
        "Wrap aluminum foil around the top of a candle jar to melt away the tunneling.",
        "Light the candle first.",
        "Then carefully wrap a cylinder of double-layered aluminum foil about 6 in (15 cm) tall by 12 in (30 cm) wide around the top portion of the candle jar.",
        "Leave about 3 in (7.6 cm) extending above the jar and cup in the top edges of foil to form a rounded cover with an opening in the center.",
        "Remove the foil wrap after 2 hours and the wax tunneling should be melted.",
        "Make sure you monitor your candle while it burns.",
        "Just because you can't see the flame doesn't mean it's a potential hazard.",
        "Burn a pillar candle in a hurricane vase.",
        "Select an open-topped glass hurricane vase that your pillar candle can fit inside.",
        "The vase should be a few inches taller than the candle.",
        "Burn the candle in the hurricane to trap in more heat and more quickly soften and melt the wax for a more even burn.",
        "Cut away excess tunneling with a butter knife.",
        "When the wax is warm and soft, use a metal butter knife to cut out the hard pieces of wax.",
        "Carve out small sections and dislodge them from the sides of the jar.",
        "Remove all the excess until you have a relatively smooth, flat top layer of wax, sitting ⁄8 in (0.32 cm) below the top of the wick.",
        "You can do this after warming the candle in the oven, or after a burn session before the wax has completely cooled.",
        "Try saving the pieces of wax to warm over a tealight warmer.",
        "This way, you'll still get to enjoy the fragrance and won't waste any part of the candle.",
        "Burning Tapers Evenly Keep lit tapers totally upright and away from drafts.",
        "This is necessary for all types of candles, but it is especially important for evenly burning tapers.",
        "Only place a taper in a taper holder or candlestick that fits it securely.",
        "There should be no wobbling or leaning.",
        "You can melt a few drops of wax into the base of the taper holder to help the candle stay in place.",
        "But if there's a fit issue to begin with, you probably won't get the most even burn from the taper.",
        "Direct all air flow away from lit tapers.",
        "Again, this is important for any type of candle.",
        "But even the slightest air movement can have a noticeable impact on burning tapers.",
        "Direct any fans and vents away from the tapers, and keep nearby windows closed.",
        "Air movement will disturb the flame and will lead to lopsided tapers dripping with wax.",
        "Opt for “dripless” tapers.",
        "Although the name is a bit of an exaggeration, the wax of a “dripless” candle is designed to cool and harden very quickly.",
        "So, even if your candle drips a little, the drips will harden into place.",
        "You'll be able to peel them off, or shave them off with a butter knife, once the candle is extinguished.",
        "As a bonus, you can choose paraffin or beeswax candles which tend to have a slower burn time.",
        "The slower the burn, the less opportunity for drippage."
    ]
}