{
    "title": "How to Trim a Neckline",
    "url": "https://www.wikihow.com/Trim-a-Neckline",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Body Hair",
        "Facial Hair",
        "Beards"
    ],
    "parts": [
        {
            "name": "Determining Where to Trim",
            "steps": [
                {
                    "headline": "Wash, condition, and dry your beard to prepare it for trimming.",
                    "description": "Starting with a clean slate is important for several reasons: your hair will be softer and easier to trim, and you’ll be less likely to cause any infections because all your sweat and grime will be washed away. You don’t need to take a full shower—simply washing your beard and neck at the sink will be sufficient. Make sure to fully dry your beard with a towel or a hairdryer before you start to trim it\nNever trim your neckline when your hair is wet. If you do, it’ll inevitably be shorter than you want once it dries.Tip: Use a special conditioner made just for beards called beard oil. It’s formulated to moisturize coarse hair, making it much better for your beard than your typical conditioner."
                },
                {
                    "headline": "Visualize your neckline by imagining a curved line going from ear to ear.",
                    "description": "Imagine that there is a point below each ear that is connected in the middle by an additional point right above your Adam’s apple. Tilt your head side-to-side to observe where your skin naturally creases between your chin and your neck. This line is generally where you’ll want to create your neckline. Many people think their neckline should be in line with their jawline, but that’s not the case. Trimming to the jawline will make your beard look too small for your face."
                },
                {
                    "headline": "Hold your head upright and look straight into the mirror.",
                    "description": "Take note of any hair you can see below your chin, especially if there is hair creeping down your neck. Look at your face from an angle to see what needs to be trimmed on the sides. A 3-way mirror is really helpful for the entire trimming process, and it’ll help you find your neckline much more easily. If you don’t have a 3-way mirror, use a handheld mirror instead."
                },
                {
                    "headline": "Place 2 fingers on your Adam’s apple to find how high you should trim.",
                    "description": "Place 1 finger directly on your Adam’s apple, and place the other finger just above it. This is generally the highest point to which you should trim your neckline, as it creates a natural delineation between your chin and your neck. For a tighter trim, you might go slightly higher than this point. But when you’re first starting out, it’s better to err on the side of caution and trim lower at first and then take it higher. You can always trim more hair, but it takes a while for hair to grow back."
                }
            ]
        },
        {
            "name": "Trimming Along the Neckline",
            "steps": [
                {
                    "headline": "Remove the guard from your clippers to get the closest shave possible.",
                    "description": "Most hair clippers and beard trimmers come with an adjustable guard so that you can change how short your trim will be. To create a crisp, clean neckline, remove the guard. Hair clippers may have the low settings you need, but if not, you’ll want to invest in a beard trimmer if you don’t already have one."
                },
                {
                    "headline": "Start trimming at your Adam’s apple and work your way out to the sides.",
                    "description": "Relocate the spot above your Adam’s apple, which is the highest point to which you want to trim. Turn on the clippers, and shave up your neck until you get to that point, then stop. Continue shaving your neckline around the edge of your face until you’ve gone out to each ear. Keep in mind that you never want to trim on your actual jawline."
                },
                {
                    "headline": "Create a square look if you like a more angular, masculine style.",
                    "description": "From your earlobes, trim a vertical line in your beard until it intersects with the trimmed horizontal line above your Adam’s apple. Keep the lines as straight as possible so that there is a clear angle where the 2 lines meet. This look is very stylized and is currently very popular. It’s a great option if you like to regularly trim your beard, groom your hair, and look very put together."
                },
                {
                    "headline": "Trim your neckline into a round shape for a softer, less nuanced look.",
                    "description": "Instead of creating straight lines in your neckline, create a rounded border where your horizontal neckline merges with the hair on your actual face. Make sure to check that both sides of your face are trimmed to the same points so they look even. This is a wonderful look if you want to present a more laid-back, yet still well-groomed, appearance."
                },
                {
                    "headline": "Remember to trim any other stray hair on your neck for a clean finish.",
                    "description": "After you’ve trimmed your neckline, take a moment to spot-check the rest of your neck. Look for stray hairs that are growing anywhere on the sides or front of your neck and buzz them off. Don’t forget to wipe all the stray hairs off of your face, neck, and chest once you’re finished trimming your neckline.Tip: For an even cleaner look, use shaving cream and a razor to clean up your neckline after using the clippers. This will also delay any five o’clock shadows a little longer."
                }
            ]
        }
    ],
    "tyn": [
        "Shampoo and conditioner",
        "Towel or hairdryer",
        "Electric trimmer",
        "Towel"
    ],
    "text": " Determining Where to Trim Wash, condition, and dry your beard to prepare it for trimming. Starting with a clean slate is important for several reasons: your hair will be softer and easier to trim, and you’ll be less likely to cause any infections because all your sweat and grime will be washed away. You don’t need to take a full shower—simply washing your beard and neck at the sink will be sufficient. Make sure to fully dry your beard with a towel or a hairdryer before you start to trim it\nNever trim your neckline when your hair is wet. If you do, it’ll inevitably be shorter than you want once it dries.Tip: Use a special conditioner made just for beards called beard oil. It’s formulated to moisturize coarse hair, making it much better for your beard than your typical conditioner. Visualize your neckline by imagining a curved line going from ear to ear. Imagine that there is a point below each ear that is connected in the middle by an additional point right above your Adam’s apple. Tilt your head side-to-side to observe where your skin naturally creases between your chin and your neck. This line is generally where you’ll want to create your neckline. Many people think their neckline should be in line with their jawline, but that’s not the case. Trimming to the jawline will make your beard look too small for your face. Hold your head upright and look straight into the mirror. Take note of any hair you can see below your chin, especially if there is hair creeping down your neck. Look at your face from an angle to see what needs to be trimmed on the sides. A 3-way mirror is really helpful for the entire trimming process, and it’ll help you find your neckline much more easily. If you don’t have a 3-way mirror, use a handheld mirror instead. Place 2 fingers on your Adam’s apple to find how high you should trim. Place 1 finger directly on your Adam’s apple, and place the other finger just above it. This is generally the highest point to which you should trim your neckline, as it creates a natural delineation between your chin and your neck. For a tighter trim, you might go slightly higher than this point. But when you’re first starting out, it’s better to err on the side of caution and trim lower at first and then take it higher. You can always trim more hair, but it takes a while for hair to grow back. Trimming Along the Neckline Remove the guard from your clippers to get the closest shave possible. Most hair clippers and beard trimmers come with an adjustable guard so that you can change how short your trim will be. To create a crisp, clean neckline, remove the guard. Hair clippers may have the low settings you need, but if not, you’ll want to invest in a beard trimmer if you don’t already have one. Start trimming at your Adam’s apple and work your way out to the sides. Relocate the spot above your Adam’s apple, which is the highest point to which you want to trim. Turn on the clippers, and shave up your neck until you get to that point, then stop. Continue shaving your neckline around the edge of your face until you’ve gone out to each ear. Keep in mind that you never want to trim on your actual jawline. Create a square look if you like a more angular, masculine style. From your earlobes, trim a vertical line in your beard until it intersects with the trimmed horizontal line above your Adam’s apple. Keep the lines as straight as possible so that there is a clear angle where the 2 lines meet. This look is very stylized and is currently very popular. It’s a great option if you like to regularly trim your beard, groom your hair, and look very put together. Trim your neckline into a round shape for a softer, less nuanced look. Instead of creating straight lines in your neckline, create a rounded border where your horizontal neckline merges with the hair on your actual face. Make sure to check that both sides of your face are trimmed to the same points so they look even. This is a wonderful look if you want to present a more laid-back, yet still well-groomed, appearance. Remember to trim any other stray hair on your neck for a clean finish. After you’ve trimmed your neckline, take a moment to spot-check the rest of your neck. Look for stray hairs that are growing anywhere on the sides or front of your neck and buzz them off. Don’t forget to wipe all the stray hairs off of your face, neck, and chest once you’re finished trimming your neckline.Tip: For an even cleaner look, use shaving cream and a razor to clean up your neckline after using the clippers. This will also delay any five o’clock shadows a little longer.",
    "sentences": [
        " Determining Where to Trim Wash, condition, and dry your beard to prepare it for trimming.",
        "Starting with a clean slate is important for several reasons: your hair will be softer and easier to trim, and you’ll be less likely to cause any infections because all your sweat and grime will be washed away.",
        "You don’t need to take a full shower—simply washing your beard and neck at the sink will be sufficient.",
        "Make sure to fully dry your beard with a towel or a hairdryer before you start to trim it\nNever trim your neckline when your hair is wet.",
        "If you do, it’ll inevitably be shorter than you want once it dries.Tip: Use a special conditioner made just for beards called beard oil.",
        "It’s formulated to moisturize coarse hair, making it much better for your beard than your typical conditioner.",
        "Visualize your neckline by imagining a curved line going from ear to ear.",
        "Imagine that there is a point below each ear that is connected in the middle by an additional point right above your Adam’s apple.",
        "Tilt your head side-to-side to observe where your skin naturally creases between your chin and your neck.",
        "This line is generally where you’ll want to create your neckline.",
        "Many people think their neckline should be in line with their jawline, but that’s not the case.",
        "Trimming to the jawline will make your beard look too small for your face.",
        "Hold your head upright and look straight into the mirror.",
        "Take note of any hair you can see below your chin, especially if there is hair creeping down your neck.",
        "Look at your face from an angle to see what needs to be trimmed on the sides.",
        "A 3-way mirror is really helpful for the entire trimming process, and it’ll help you find your neckline much more easily.",
        "If you don’t have a 3-way mirror, use a handheld mirror instead.",
        "Place 2 fingers on your Adam’s apple to find how high you should trim.",
        "Place 1 finger directly on your Adam’s apple, and place the other finger just above it.",
        "This is generally the highest point to which you should trim your neckline, as it creates a natural delineation between your chin and your neck.",
        "For a tighter trim, you might go slightly higher than this point.",
        "But when you’re first starting out, it’s better to err on the side of caution and trim lower at first and then take it higher.",
        "You can always trim more hair, but it takes a while for hair to grow back.",
        "Trimming Along the Neckline Remove the guard from your clippers to get the closest shave possible.",
        "Most hair clippers and beard trimmers come with an adjustable guard so that you can change how short your trim will be.",
        "To create a crisp, clean neckline, remove the guard.",
        "Hair clippers may have the low settings you need, but if not, you’ll want to invest in a beard trimmer if you don’t already have one.",
        "Start trimming at your Adam’s apple and work your way out to the sides.",
        "Relocate the spot above your Adam’s apple, which is the highest point to which you want to trim.",
        "Turn on the clippers, and shave up your neck until you get to that point, then stop.",
        "Continue shaving your neckline around the edge of your face until you’ve gone out to each ear.",
        "Keep in mind that you never want to trim on your actual jawline.",
        "Create a square look if you like a more angular, masculine style.",
        "From your earlobes, trim a vertical line in your beard until it intersects with the trimmed horizontal line above your Adam’s apple.",
        "Keep the lines as straight as possible so that there is a clear angle where the 2 lines meet.",
        "This look is very stylized and is currently very popular.",
        "It’s a great option if you like to regularly trim your beard, groom your hair, and look very put together.",
        "Trim your neckline into a round shape for a softer, less nuanced look.",
        "Instead of creating straight lines in your neckline, create a rounded border where your horizontal neckline merges with the hair on your actual face.",
        "Make sure to check that both sides of your face are trimmed to the same points so they look even.",
        "This is a wonderful look if you want to present a more laid-back, yet still well-groomed, appearance.",
        "Remember to trim any other stray hair on your neck for a clean finish.",
        "After you’ve trimmed your neckline, take a moment to spot-check the rest of your neck.",
        "Look for stray hairs that are growing anywhere on the sides or front of your neck and buzz them off.",
        "Don’t forget to wipe all the stray hairs off of your face, neck, and chest once you’re finished trimming your neckline.Tip: For an even cleaner look, use shaving cream and a razor to clean up your neckline after using the clippers.",
        "This will also delay any five o’clock shadows a little longer."
    ]
}