{
    "title": "How to Stretch the Calf Area of Boots",
    "url": "https://www.wikihow.com/Stretch-the-Calf-Area-of-Boots",
    "category_hierarchy": [
        "Personal Care and Style",
        "Footwear",
        "Boots",
        "Tall Boots"
    ],
    "methods": [
        {
            "name": "Using an Alcohol Solution to Stretch Your Boots",
            "steps": [
                {
                    "headline": "Mix equal quantities of rubbing alcohol and water in a spray bottle.",
                    "description": "Measure the rubbing alcohol and water into the spray bottle. For example, add 1 cup (240 ml) of water and 1 cup (240 ml) of rubbing alcohol. Then, ensure the lid is tightly screwed on and shake the bottle vigorously for 10 seconds to combine the liquids. Purchase rubbing alcohol from a hardware store, grocery, or drug store. Always store rubbing alcohol out of reach from children and pets."
                },
                {
                    "headline": "Spray the inside of your boots liberally with the stretching spray.",
                    "description": "This helps to loosen the fabric and encourages it to stretch. Spray the entire inside surface of the boots until the fabric is saturated. If your boots have a zipper, undo it to make it easier to spray inside the boots."
                },
                {
                    "headline": "Wear your boots until they dry.",
                    "description": "The boots are easier to put on when they are wet, as the fibres in the fabric or leather loosen. Put the boots on and wear them for a few hours or until they are completely dry. This helps to stretch the boots and encourages the fabric to set in a new position. To increase the amount that the boots stretch, wear a thick pair of socks."
                },
                {
                    "headline": "Repeat the stretching process, if necessary.",
                    "description": "If the boots are still too narrow, simply repeat this process until they are the correct size. Once again, wet the inside of your boots with the stretching solution and then wear the boots until they are dry. Boots tend to reach their stretching capacity after about 5 stretches."
                }
            ]
        },
        {
            "name": "Stretching Boots with Boot Bands",
            "steps": [
                {
                    "headline": "Purchase 2 boot bands.",
                    "description": "A boot band is a piece of fabric with zippers up the side. These can be used to extend the width around the calves of your boots. Choose boot bands that are the same colour as your boots and have zips that are the same size as the zips on your boots. Buy boot bands online or from a shoe store. Boot bands come in different widths. Choose one that corresponds with how much you need to stretch your boots."
                },
                {
                    "headline": "Clip the pullers onto each side of your zip.",
                    "description": "In the boot band packet, there will be 2 zip pullers for each boot. These have an open mouth that can clip shut. To attach the first puller, simply place the mouth over 1 side of the open zip on your boot and press it closed over the teeth of the zip. Repeat this same process on the other side of the open zip. Repeat this process on your other boot."
                },
                {
                    "headline": "Place the boot band zip next to the zip on your boot.",
                    "description": "Position the top of the boot band in line with the top of the boot and next to the open zip. This shows you how the boot will look when the boot band is attached."
                },
                {
                    "headline": "Pull the zipper up to connect the boot band to your boot.",
                    "description": "Hold the boot band right next to the zipper. Then, slide up the zip puller to the top of your boot in order to connect the boot band to your shoe. If the zipper gets stuck, simply unzip the boot band and try again. Repeat this process on both boots."
                },
                {
                    "headline": "Line up the other side of the boot band zip next to the boot zip and pull it up.",
                    "description": "Repeat this same aligning and zipping process on the other side of the boot band. This connects both sides of the boot band in place and creates more room inside the boots for your calves. Make sure that the regular zip on your boots is pulled up so that there are no gaps in your boots."
                }
            ]
        }
    ],
    "tyn": [
        "Using an Alcohol Solution to Stretch Your Boots",
        "Spray bottle",
        "Rubbing alcohol",
        "Water",
        "Stretching Boots with Boot Bands",
        "Boot bands"
    ],
    "text": " Using an Alcohol Solution to Stretch Your Boots Mix equal quantities of rubbing alcohol and water in a spray bottle. Measure the rubbing alcohol and water into the spray bottle. For example, add 1 cup (240 ml) of water and 1 cup (240 ml) of rubbing alcohol. Then, ensure the lid is tightly screwed on and shake the bottle vigorously for 10 seconds to combine the liquids. Purchase rubbing alcohol from a hardware store, grocery, or drug store. Always store rubbing alcohol out of reach from children and pets. Spray the inside of your boots liberally with the stretching spray. This helps to loosen the fabric and encourages it to stretch. Spray the entire inside surface of the boots until the fabric is saturated. If your boots have a zipper, undo it to make it easier to spray inside the boots. Wear your boots until they dry. The boots are easier to put on when they are wet, as the fibres in the fabric or leather loosen. Put the boots on and wear them for a few hours or until they are completely dry. This helps to stretch the boots and encourages the fabric to set in a new position. To increase the amount that the boots stretch, wear a thick pair of socks. Repeat the stretching process, if necessary. If the boots are still too narrow, simply repeat this process until they are the correct size. Once again, wet the inside of your boots with the stretching solution and then wear the boots until they are dry. Boots tend to reach their stretching capacity after about 5 stretches. Stretching Boots with Boot Bands Purchase 2 boot bands. A boot band is a piece of fabric with zippers up the side. These can be used to extend the width around the calves of your boots. Choose boot bands that are the same colour as your boots and have zips that are the same size as the zips on your boots. Buy boot bands online or from a shoe store. Boot bands come in different widths. Choose one that corresponds with how much you need to stretch your boots. Clip the pullers onto each side of your zip. In the boot band packet, there will be 2 zip pullers for each boot. These have an open mouth that can clip shut. To attach the first puller, simply place the mouth over 1 side of the open zip on your boot and press it closed over the teeth of the zip. Repeat this same process on the other side of the open zip. Repeat this process on your other boot. Place the boot band zip next to the zip on your boot. Position the top of the boot band in line with the top of the boot and next to the open zip. This shows you how the boot will look when the boot band is attached. Pull the zipper up to connect the boot band to your boot. Hold the boot band right next to the zipper. Then, slide up the zip puller to the top of your boot in order to connect the boot band to your shoe. If the zipper gets stuck, simply unzip the boot band and try again. Repeat this process on both boots. Line up the other side of the boot band zip next to the boot zip and pull it up. Repeat this same aligning and zipping process on the other side of the boot band. This connects both sides of the boot band in place and creates more room inside the boots for your calves. Make sure that the regular zip on your boots is pulled up so that there are no gaps in your boots.",
    "sentences": [
        " Using an Alcohol Solution to Stretch Your Boots Mix equal quantities of rubbing alcohol and water in a spray bottle.",
        "Measure the rubbing alcohol and water into the spray bottle.",
        "For example, add 1 cup (240 ml) of water and 1 cup (240 ml) of rubbing alcohol.",
        "Then, ensure the lid is tightly screwed on and shake the bottle vigorously for 10 seconds to combine the liquids.",
        "Purchase rubbing alcohol from a hardware store, grocery, or drug store.",
        "Always store rubbing alcohol out of reach from children and pets.",
        "Spray the inside of your boots liberally with the stretching spray.",
        "This helps to loosen the fabric and encourages it to stretch.",
        "Spray the entire inside surface of the boots until the fabric is saturated.",
        "If your boots have a zipper, undo it to make it easier to spray inside the boots.",
        "Wear your boots until they dry.",
        "The boots are easier to put on when they are wet, as the fibres in the fabric or leather loosen.",
        "Put the boots on and wear them for a few hours or until they are completely dry.",
        "This helps to stretch the boots and encourages the fabric to set in a new position.",
        "To increase the amount that the boots stretch, wear a thick pair of socks.",
        "Repeat the stretching process, if necessary.",
        "If the boots are still too narrow, simply repeat this process until they are the correct size.",
        "Once again, wet the inside of your boots with the stretching solution and then wear the boots until they are dry.",
        "Boots tend to reach their stretching capacity after about 5 stretches.",
        "Stretching Boots with Boot Bands Purchase 2 boot bands.",
        "A boot band is a piece of fabric with zippers up the side.",
        "These can be used to extend the width around the calves of your boots.",
        "Choose boot bands that are the same colour as your boots and have zips that are the same size as the zips on your boots.",
        "Buy boot bands online or from a shoe store.",
        "Boot bands come in different widths.",
        "Choose one that corresponds with how much you need to stretch your boots.",
        "Clip the pullers onto each side of your zip.",
        "In the boot band packet, there will be 2 zip pullers for each boot.",
        "These have an open mouth that can clip shut.",
        "To attach the first puller, simply place the mouth over 1 side of the open zip on your boot and press it closed over the teeth of the zip.",
        "Repeat this same process on the other side of the open zip.",
        "Repeat this process on your other boot.",
        "Place the boot band zip next to the zip on your boot.",
        "Position the top of the boot band in line with the top of the boot and next to the open zip.",
        "This shows you how the boot will look when the boot band is attached.",
        "Pull the zipper up to connect the boot band to your boot.",
        "Hold the boot band right next to the zipper.",
        "Then, slide up the zip puller to the top of your boot in order to connect the boot band to your shoe.",
        "If the zipper gets stuck, simply unzip the boot band and try again.",
        "Repeat this process on both boots.",
        "Line up the other side of the boot band zip next to the boot zip and pull it up.",
        "Repeat this same aligning and zipping process on the other side of the boot band.",
        "This connects both sides of the boot band in place and creates more room inside the boots for your calves.",
        "Make sure that the regular zip on your boots is pulled up so that there are no gaps in your boots."
    ]
}