{
    "title": "How to Polish a Wheel",
    "url": "https://www.wikihow.com/Polish-a-Wheel",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Maintenance and Repair"
    ],
    "methods": [
        {
            "name": "Washing a Wheel",
            "steps": [
                {
                    "headline": "Rinse the wheel with cool water from the hose.",
                    "description": "Wheels accumulate plenty of debris when you use them, so rinse off as much as you can with a strong stream of water. Remember to get both the front and back side of the wheel. Also, spray around the lug nuts and inside the spokes to force out hidden debris. Always clean wheels before polishing, or else debris like dirt and brake dust can ruin the finish!"
                },
                {
                    "headline": "Identify the type of wheel you have using a magnet and polish.",
                    "description": "If you don’t already know what your wheel is made of, find out so you can choose the correct cleaners. A strong magnet will stick to steel but not aluminum. After using the magnet, rub some metal polish in an inconspicuous spot with a white rag. If the wheel leaves black oxide on the rag, you have an uncoated wheel. Chrome is easy to spot since it is very shiny and reflects like a mirror."
                },
                {
                    "headline": "Apply a cleaner matching the type of wheel you have.",
                    "description": "If you’re unsure what kind of wheel you have, stick to an all-purpose wheel cleaner or degreaser to avoid damaging it. If you have chrome or bare metal wheels, look for specific cleaners meant for that kind of material. Many of these wheel cleaners come in spray bottles that make them easy to use. There are also liquid soaps you can get and apply with a microfiber cloth. Most vehicles have aluminum alloy wheels with a clear coat finish for protection. Choose a cleaner marked as safe for use on a clear coat to avoid damaging the finish on this type of wheel. These cleaners are typically safe for other types of wheels as well. Another alternative is to mix a mild dish detergent in a bucket of water. It forms a good general cleaner to use on wheels but not the rest of your car. For liquid wheel cleaners and dish soaps, mix about 3 teaspoons (15 mL) of the cleaner in with 3.75 US gal (14.2 L) of water."
                },
                {
                    "headline": "Scrub the wheel with a wheel brush or a microfiber cloth.",
                    "description": "Get something soft and lint-free you plan on using only to clean the wheel. Use it to work all the way around the wheel, scrubbing it in sections. Don’t forget to scrub around the rim, between the spokes, and near the lug nuts. Keep the wheel wet while you scrub it to avoid scratches and water spots. Use only soft-bristled wheel brushes and microfiber towels. Rougher scrubbers, such as steel wool, scratch the wheel. To clean the lug nuts more thoroughly, try using a lug nut brush. You can find it online or at most auto parts stores along with wheel brushes and towels."
                },
                {
                    "headline": "Wash and dry the wheel again to remove soap and debris.",
                    "description": "Blast the wheel with a strong spray of cold water from the hose, then dry it when you’re finished. Go over the front, back, and edges of the wheel. Also, wash off the lugnuts and spokes before scrubbing them with a clean microfiber towel. Keep this towel separate from any other towels you use to avoid spreading damaging brake dust across the rest of your vehicle. Wash the wheel wells as well if you have time. While the underside of the fender is not technically part of the wheel, it accumulates lots of mud and debris. Use an all-purpose cleaner and a stiff wheel well brush to scrub it before rinsing it out. Any water left on the wheel can lead to water spots, so don’t let the wheel dry out on its own. Remove as much of the moisture as possible to preserve the wheel’s finish."
                },
                {
                    "headline": "Wash a bare metal wheel with a pre-cleaning product if it has oxidized.",
                    "description": "Those unpleasant rust-like spots on your wheel have to go before you apply polish. To treat oxidation, get a spray-on metal oxidation cleaner and apply it directly to the damaged spots. Let it soak in for about 7 minutes, scrubbing it in as needed with a toothbrush or another soft-bristled brush. Rinse and dry the wheel one last time to clear it for polishing. If you’re treating an aluminum wheel, get an oxidation cleaner labeled specifically for use on aluminum. To treat rust on steel, use a chemical rust remover. Check online, at auto part stores, and at hardware stores for products. Another option is to use steel wool and 400-grit very fine sandpaper to scrub the damaged spots. Doing this is a little more labor-intensive and risky, so be careful to avoid adding scratches to the wheel. If your wheel has curb rash, or abrasions from rubbing up against curbs, you could smooth out the damage with a metal file. Sandpaper also works well. Start with an 80-grit sandpaper, followed by 220 and 400-grit pieces."
                }
            ]
        },
        {
            "name": "Polishing a Chrome or Clear Coat Wheel",
            "steps": [
                {
                    "headline": "Choose a chrome metal polish if your wheel is chrome.",
                    "description": "Chrome is relatively soft compared to metal wheels like bare steel and aluminum. Harsher polishes scratch it, so select a metal polish labeled as safe to use on chrome. Look for a label on the polish indicating it is safe for chrome. Most all-purpose wheel polishes are perfectly safe for chrome wheels, although chrome-specific polishes will give your wheel more of a shine. Plastic chrome is not the same as authentic metal chrome. Chrome polishes are too strong for plastic, so use a general polish like you would with a clear coat."
                },
                {
                    "headline": "Pick a water-based polish if you’re dealing with a clear coat.",
                    "description": "Treat clear coats like you would paint on your car. Aluminum and alloy wheels with the coating are more delicate than regular metal wheels. Look for a general, all-purpose polish to avoid ruining the finish. Leave the acid-based polishes for uncoated metal wheels. Since clear coats are a lot like paint, you could use a paint polish or car wax to safely polish the wheel! Check for products online or at nearby auto stores."
                },
                {
                    "headline": "Add polish to parts of the wheel using a microfiber towel.",
                    "description": "Tackle the wheel in sections instead of working around it in a circle. You could start in the center and work up the spokes or go from the rim to the center. Start spreading the polish on the spokes one at a time, working on each one individually before moving on to the next one. If you’re working on a chrome wheel, make the process faster by getting a polishing tool. A polishing tool is a fabric ball or cone that fits on an electric drill. It enables you to easily reach between the spokes. Since clear coats are soft, avoid risks by hand-polishing the wheel with a microfiber towel. Fabric polishing tools may be a little too abrasive in most cases."
                },
                {
                    "headline": "Scrub along the metal’s grain to coat the wheel evenly in polish.",
                    "description": "Look closely at the wheel to see small finishing lines left over from the manufacturing process. Follow these lines to avoid the possibility of scratching the metal. While working on one section of the wheel at a time, keep moving the towel back and forth along the grain to spread the polish into a single, consistent layer. Then, repeat the process with the next spoke or section. After taking care of the spokes on the front of the wheel, work around the rim. Get behind the wheel, if possible, to make it shiny."
                },
                {
                    "headline": "Wipe off the polish after 15 minutes using a clean microfiber cloth.",
                    "description": "The polish soaks into the metal within 15 minutes. After that time, get a fresh cloth and go back over the entire wheel. Remember to work in small sections, going along the metal’s grain. Use it to remove any undried wax still on the wheel. The cloth you use to polish has to be different from the one you used initially or else you could rub brake dust into the wheel. Always use a clean cloth for each part of the process and never use the same cloth on multiple wheels. After you finish with one wheel, move on to any others you wish to polish. Wash, polish, and wax 1 wheel at a time for the best results."
                }
            ]
        },
        {
            "name": "Working on a Bare Aluminum or Steel Wheel",
            "steps": [
                {
                    "headline": "Apply a metal buffing compound to the wheel.",
                    "description": "The compound is much stronger than a regular metal polish, so you add it first. It removes scratches and forms a clean base for the polish. The compound comes in a stick form, so simply rub some of it on the wheel or the rotary tool application pad you plan on using. Adding it to the application pad makes you less likely to use an excessive amount  that takes longer to dry. Pick a compound depending on the type of wheel you have. Use an aluminum compound for aluminum wheels or a steel compound for steel wheels."
                },
                {
                    "headline": "Scrub the compound into the wheel using a rotary tool.",
                    "description": "Pick up a rotary polisher and a set of wool pads to use on the wheel. After placing the pad on the tool, turn it on to the lowest speed setting possible. Begin moving the pad around the wheel, letting it speed up to 3,000 RPM as you go. Keep going over the wheel until the polish dries. You could try to work the polish in by hand with a microfiber towel or applicator, but it takes much longer."
                },
                {
                    "headline": "Apply a fine metal polish to the wheel using a cloth or pad.",
                    "description": "Pick an aluminum polish for an aluminum wheel or a stainless steel polish for a steel wheel. Dip a clean microfiber towel into the polish to spread it on the wheel. Focus on one section of the wheel at a time, such as by starting with a single spoke. Work on that area, giving it a good polish before you move on to the next one. You can also spread the polish with a rotary tool, but use a fresh, soft pad to avoid scratching the metal."
                },
                {
                    "headline": "Work along the metal’s grain to shine the metal without scratching it.",
                    "description": "Note which way the finishing lines run along the surface of the wheel. Use the microfiber towel to wipe back and forth along these lines. Spread the polish out along the metal to create a uniform, shiny coating. Then, move onto the next part of the wheel, getting more of the polish to shine it. Remember to get each individual spoke and the wheel’s rim. Work behind the wheel if you can reach back there."
                },
                {
                    "headline": "Wipe the wheel clean with a microfiber towel after 15 minutes.",
                    "description": "Give the polish about 15 minutes to dry, then go back over the wheel using a fresh towel. Wipe the metal along its grain to keep the polish clean. Doing this removes excess polish and any debris left on the wheel. Always switch to a clean towel instead of reusing one with polish on it. Also, keep the towel separate from any other ones you use on the car, since it could have brake dust on it. Work on 1 wheel at a time, washing, cleaning, and waxing it until it is well-polished."
                }
            ]
        },
        {
            "name": "Waxing a Wheel",
            "steps": [
                {
                    "headline": "Select a wax or sealant to protect the wheel finish from damage.",
                    "description": "After you apply polish to a wheel, seal it with a protective layer. If you’re working on an uncoated metal wheel, use a metal sealant. For chrome and clear coat wheels, try a basic carnauba wheel wax or wheel glaze. The general wheel waxes and glazes work on any type of wheel, including steel and aluminum ones. Metal sealants are more specifically designed to prevent oxidation, so they are a good choice if you know you have a bare wheel."
                },
                {
                    "headline": "Apply the wax with a microfiber towel or applicator pad.",
                    "description": "Dip a clean towel into the wax to begin spreading it over the wheel. Spread the wax along the metal’s grain, working part by part. Add more wax to your towel as needed to coat the wheel in a uniform layer of it. You apply the wax the same way you apply any polish. It’s very easy to apply and protects your wheel from nasty stains like oxidation."
                },
                {
                    "headline": "Use a clean microfiber towel to wipe the wheel after 15 minutes.",
                    "description": "Let the wax dry, then buff the wheel with a clean cloth. Work along the grain one section at a time until the wheel looks shiny. Then, repeat the process with any other wheels after you wash and polish them. To avoid having to polish your wheels as often as you normally would, reapply the wax at least once every 3 months. Rinse the wheel with clean water, dry it off, then add a fresh layer of wax. If you wax your wheels weekly, you won’t need to polish them as often since the wax resists grime. Expect to polish them about twice a year. If you don’t wax regularly, you may need to polish them 4 times a year or more."
                }
            ]
        }
    ],
    "tyn": [
        "Washing a Wheel",
        "Hose",
        "Wheel cleaner or car wash soap",
        "Wheel brush",
        "Lug nut brush",
        "Microfiber towels",
        "Metal oxidation cleaner",
        "Polishing a Chrome or Clear Coat Wheel",
        "Chrome or general polish",
        "Working on a Bare Aluminum or Steel Wheel",
        "Rotary wheel tool",
        "Rotary tool pad",
        "Metal buffing compound",
        "Metal aluminum or steel polish",
        "Waxing a Wheel",
        "Wheel wax, glaze, or metal sealant",
        "Microfiber towel"
    ],
    "text": " Washing a Wheel Rinse the wheel with cool water from the hose. Wheels accumulate plenty of debris when you use them, so rinse off as much as you can with a strong stream of water. Remember to get both the front and back side of the wheel. Also, spray around the lug nuts and inside the spokes to force out hidden debris. Always clean wheels before polishing, or else debris like dirt and brake dust can ruin the finish! Identify the type of wheel you have using a magnet and polish. If you don’t already know what your wheel is made of, find out so you can choose the correct cleaners. A strong magnet will stick to steel but not aluminum. After using the magnet, rub some metal polish in an inconspicuous spot with a white rag. If the wheel leaves black oxide on the rag, you have an uncoated wheel. Chrome is easy to spot since it is very shiny and reflects like a mirror. Apply a cleaner matching the type of wheel you have. If you’re unsure what kind of wheel you have, stick to an all-purpose wheel cleaner or degreaser to avoid damaging it. If you have chrome or bare metal wheels, look for specific cleaners meant for that kind of material. Many of these wheel cleaners come in spray bottles that make them easy to use. There are also liquid soaps you can get and apply with a microfiber cloth. Most vehicles have aluminum alloy wheels with a clear coat finish for protection. Choose a cleaner marked as safe for use on a clear coat to avoid damaging the finish on this type of wheel. These cleaners are typically safe for other types of wheels as well. Another alternative is to mix a mild dish detergent in a bucket of water. It forms a good general cleaner to use on wheels but not the rest of your car. For liquid wheel cleaners and dish soaps, mix about 3 teaspoons (15 mL) of the cleaner in with 3.75 US gal (14.2 L) of water. Scrub the wheel with a wheel brush or a microfiber cloth. Get something soft and lint-free you plan on using only to clean the wheel. Use it to work all the way around the wheel, scrubbing it in sections. Don’t forget to scrub around the rim, between the spokes, and near the lug nuts. Keep the wheel wet while you scrub it to avoid scratches and water spots. Use only soft-bristled wheel brushes and microfiber towels. Rougher scrubbers, such as steel wool, scratch the wheel. To clean the lug nuts more thoroughly, try using a lug nut brush. You can find it online or at most auto parts stores along with wheel brushes and towels. Wash and dry the wheel again to remove soap and debris. Blast the wheel with a strong spray of cold water from the hose, then dry it when you’re finished. Go over the front, back, and edges of the wheel. Also, wash off the lugnuts and spokes before scrubbing them with a clean microfiber towel. Keep this towel separate from any other towels you use to avoid spreading damaging brake dust across the rest of your vehicle. Wash the wheel wells as well if you have time. While the underside of the fender is not technically part of the wheel, it accumulates lots of mud and debris. Use an all-purpose cleaner and a stiff wheel well brush to scrub it before rinsing it out. Any water left on the wheel can lead to water spots, so don’t let the wheel dry out on its own. Remove as much of the moisture as possible to preserve the wheel’s finish. Wash a bare metal wheel with a pre-cleaning product if it has oxidized. Those unpleasant rust-like spots on your wheel have to go before you apply polish. To treat oxidation, get a spray-on metal oxidation cleaner and apply it directly to the damaged spots. Let it soak in for about 7 minutes, scrubbing it in as needed with a toothbrush or another soft-bristled brush. Rinse and dry the wheel one last time to clear it for polishing. If you’re treating an aluminum wheel, get an oxidation cleaner labeled specifically for use on aluminum. To treat rust on steel, use a chemical rust remover. Check online, at auto part stores, and at hardware stores for products. Another option is to use steel wool and 400-grit very fine sandpaper to scrub the damaged spots. Doing this is a little more labor-intensive and risky, so be careful to avoid adding scratches to the wheel. If your wheel has curb rash, or abrasions from rubbing up against curbs, you could smooth out the damage with a metal file. Sandpaper also works well. Start with an 80-grit sandpaper, followed by 220 and 400-grit pieces. Polishing a Chrome or Clear Coat Wheel Choose a chrome metal polish if your wheel is chrome. Chrome is relatively soft compared to metal wheels like bare steel and aluminum. Harsher polishes scratch it, so select a metal polish labeled as safe to use on chrome. Look for a label on the polish indicating it is safe for chrome. Most all-purpose wheel polishes are perfectly safe for chrome wheels, although chrome-specific polishes will give your wheel more of a shine. Plastic chrome is not the same as authentic metal chrome. Chrome polishes are too strong for plastic, so use a general polish like you would with a clear coat. Pick a water-based polish if you’re dealing with a clear coat. Treat clear coats like you would paint on your car. Aluminum and alloy wheels with the coating are more delicate than regular metal wheels. Look for a general, all-purpose polish to avoid ruining the finish. Leave the acid-based polishes for uncoated metal wheels. Since clear coats are a lot like paint, you could use a paint polish or car wax to safely polish the wheel! Check for products online or at nearby auto stores. Add polish to parts of the wheel using a microfiber towel. Tackle the wheel in sections instead of working around it in a circle. You could start in the center and work up the spokes or go from the rim to the center. Start spreading the polish on the spokes one at a time, working on each one individually before moving on to the next one. If you’re working on a chrome wheel, make the process faster by getting a polishing tool. A polishing tool is a fabric ball or cone that fits on an electric drill. It enables you to easily reach between the spokes. Since clear coats are soft, avoid risks by hand-polishing the wheel with a microfiber towel. Fabric polishing tools may be a little too abrasive in most cases. Scrub along the metal’s grain to coat the wheel evenly in polish. Look closely at the wheel to see small finishing lines left over from the manufacturing process. Follow these lines to avoid the possibility of scratching the metal. While working on one section of the wheel at a time, keep moving the towel back and forth along the grain to spread the polish into a single, consistent layer. Then, repeat the process with the next spoke or section. After taking care of the spokes on the front of the wheel, work around the rim. Get behind the wheel, if possible, to make it shiny. Wipe off the polish after 15 minutes using a clean microfiber cloth. The polish soaks into the metal within 15 minutes. After that time, get a fresh cloth and go back over the entire wheel. Remember to work in small sections, going along the metal’s grain. Use it to remove any undried wax still on the wheel. The cloth you use to polish has to be different from the one you used initially or else you could rub brake dust into the wheel. Always use a clean cloth for each part of the process and never use the same cloth on multiple wheels. After you finish with one wheel, move on to any others you wish to polish. Wash, polish, and wax 1 wheel at a time for the best results. Working on a Bare Aluminum or Steel Wheel Apply a metal buffing compound to the wheel. The compound is much stronger than a regular metal polish, so you add it first. It removes scratches and forms a clean base for the polish. The compound comes in a stick form, so simply rub some of it on the wheel or the rotary tool application pad you plan on using. Adding it to the application pad makes you less likely to use an excessive amount  that takes longer to dry. Pick a compound depending on the type of wheel you have. Use an aluminum compound for aluminum wheels or a steel compound for steel wheels. Scrub the compound into the wheel using a rotary tool. Pick up a rotary polisher and a set of wool pads to use on the wheel. After placing the pad on the tool, turn it on to the lowest speed setting possible. Begin moving the pad around the wheel, letting it speed up to 3,000 RPM as you go. Keep going over the wheel until the polish dries. You could try to work the polish in by hand with a microfiber towel or applicator, but it takes much longer. Apply a fine metal polish to the wheel using a cloth or pad. Pick an aluminum polish for an aluminum wheel or a stainless steel polish for a steel wheel. Dip a clean microfiber towel into the polish to spread it on the wheel. Focus on one section of the wheel at a time, such as by starting with a single spoke. Work on that area, giving it a good polish before you move on to the next one. You can also spread the polish with a rotary tool, but use a fresh, soft pad to avoid scratching the metal. Work along the metal’s grain to shine the metal without scratching it. Note which way the finishing lines run along the surface of the wheel. Use the microfiber towel to wipe back and forth along these lines. Spread the polish out along the metal to create a uniform, shiny coating. Then, move onto the next part of the wheel, getting more of the polish to shine it. Remember to get each individual spoke and the wheel’s rim. Work behind the wheel if you can reach back there. Wipe the wheel clean with a microfiber towel after 15 minutes. Give the polish about 15 minutes to dry, then go back over the wheel using a fresh towel. Wipe the metal along its grain to keep the polish clean. Doing this removes excess polish and any debris left on the wheel. Always switch to a clean towel instead of reusing one with polish on it. Also, keep the towel separate from any other ones you use on the car, since it could have brake dust on it. Work on 1 wheel at a time, washing, cleaning, and waxing it until it is well-polished. Waxing a Wheel Select a wax or sealant to protect the wheel finish from damage. After you apply polish to a wheel, seal it with a protective layer. If you’re working on an uncoated metal wheel, use a metal sealant. For chrome and clear coat wheels, try a basic carnauba wheel wax or wheel glaze. The general wheel waxes and glazes work on any type of wheel, including steel and aluminum ones. Metal sealants are more specifically designed to prevent oxidation, so they are a good choice if you know you have a bare wheel. Apply the wax with a microfiber towel or applicator pad. Dip a clean towel into the wax to begin spreading it over the wheel. Spread the wax along the metal’s grain, working part by part. Add more wax to your towel as needed to coat the wheel in a uniform layer of it. You apply the wax the same way you apply any polish. It’s very easy to apply and protects your wheel from nasty stains like oxidation. Use a clean microfiber towel to wipe the wheel after 15 minutes. Let the wax dry, then buff the wheel with a clean cloth. Work along the grain one section at a time until the wheel looks shiny. Then, repeat the process with any other wheels after you wash and polish them. To avoid having to polish your wheels as often as you normally would, reapply the wax at least once every 3 months. Rinse the wheel with clean water, dry it off, then add a fresh layer of wax. If you wax your wheels weekly, you won’t need to polish them as often since the wax resists grime. Expect to polish them about twice a year. If you don’t wax regularly, you may need to polish them 4 times a year or more.",
    "sentences": [
        " Washing a Wheel Rinse the wheel with cool water from the hose.",
        "Wheels accumulate plenty of debris when you use them, so rinse off as much as you can with a strong stream of water.",
        "Remember to get both the front and back side of the wheel.",
        "Also, spray around the lug nuts and inside the spokes to force out hidden debris.",
        "Always clean wheels before polishing, or else debris like dirt and brake dust can ruin the finish!",
        "Identify the type of wheel you have using a magnet and polish.",
        "If you don’t already know what your wheel is made of, find out so you can choose the correct cleaners.",
        "A strong magnet will stick to steel but not aluminum.",
        "After using the magnet, rub some metal polish in an inconspicuous spot with a white rag.",
        "If the wheel leaves black oxide on the rag, you have an uncoated wheel.",
        "Chrome is easy to spot since it is very shiny and reflects like a mirror.",
        "Apply a cleaner matching the type of wheel you have.",
        "If you’re unsure what kind of wheel you have, stick to an all-purpose wheel cleaner or degreaser to avoid damaging it.",
        "If you have chrome or bare metal wheels, look for specific cleaners meant for that kind of material.",
        "Many of these wheel cleaners come in spray bottles that make them easy to use.",
        "There are also liquid soaps you can get and apply with a microfiber cloth.",
        "Most vehicles have aluminum alloy wheels with a clear coat finish for protection.",
        "Choose a cleaner marked as safe for use on a clear coat to avoid damaging the finish on this type of wheel.",
        "These cleaners are typically safe for other types of wheels as well.",
        "Another alternative is to mix a mild dish detergent in a bucket of water.",
        "It forms a good general cleaner to use on wheels but not the rest of your car.",
        "For liquid wheel cleaners and dish soaps, mix about 3 teaspoons (15 mL) of the cleaner in with 3.75 US gal (14.2 L) of water.",
        "Scrub the wheel with a wheel brush or a microfiber cloth.",
        "Get something soft and lint-free you plan on using only to clean the wheel.",
        "Use it to work all the way around the wheel, scrubbing it in sections.",
        "Don’t forget to scrub around the rim, between the spokes, and near the lug nuts.",
        "Keep the wheel wet while you scrub it to avoid scratches and water spots.",
        "Use only soft-bristled wheel brushes and microfiber towels.",
        "Rougher scrubbers, such as steel wool, scratch the wheel.",
        "To clean the lug nuts more thoroughly, try using a lug nut brush.",
        "You can find it online or at most auto parts stores along with wheel brushes and towels.",
        "Wash and dry the wheel again to remove soap and debris.",
        "Blast the wheel with a strong spray of cold water from the hose, then dry it when you’re finished.",
        "Go over the front, back, and edges of the wheel.",
        "Also, wash off the lugnuts and spokes before scrubbing them with a clean microfiber towel.",
        "Keep this towel separate from any other towels you use to avoid spreading damaging brake dust across the rest of your vehicle.",
        "Wash the wheel wells as well if you have time.",
        "While the underside of the fender is not technically part of the wheel, it accumulates lots of mud and debris.",
        "Use an all-purpose cleaner and a stiff wheel well brush to scrub it before rinsing it out.",
        "Any water left on the wheel can lead to water spots, so don’t let the wheel dry out on its own.",
        "Remove as much of the moisture as possible to preserve the wheel’s finish.",
        "Wash a bare metal wheel with a pre-cleaning product if it has oxidized.",
        "Those unpleasant rust-like spots on your wheel have to go before you apply polish.",
        "To treat oxidation, get a spray-on metal oxidation cleaner and apply it directly to the damaged spots.",
        "Let it soak in for about 7 minutes, scrubbing it in as needed with a toothbrush or another soft-bristled brush.",
        "Rinse and dry the wheel one last time to clear it for polishing.",
        "If you’re treating an aluminum wheel, get an oxidation cleaner labeled specifically for use on aluminum.",
        "To treat rust on steel, use a chemical rust remover.",
        "Check online, at auto part stores, and at hardware stores for products.",
        "Another option is to use steel wool and 400-grit very fine sandpaper to scrub the damaged spots.",
        "Doing this is a little more labor-intensive and risky, so be careful to avoid adding scratches to the wheel.",
        "If your wheel has curb rash, or abrasions from rubbing up against curbs, you could smooth out the damage with a metal file.",
        "Sandpaper also works well.",
        "Start with an 80-grit sandpaper, followed by 220 and 400-grit pieces.",
        "Polishing a Chrome or Clear Coat Wheel Choose a chrome metal polish if your wheel is chrome.",
        "Chrome is relatively soft compared to metal wheels like bare steel and aluminum.",
        "Harsher polishes scratch it, so select a metal polish labeled as safe to use on chrome.",
        "Look for a label on the polish indicating it is safe for chrome.",
        "Most all-purpose wheel polishes are perfectly safe for chrome wheels, although chrome-specific polishes will give your wheel more of a shine.",
        "Plastic chrome is not the same as authentic metal chrome.",
        "Chrome polishes are too strong for plastic, so use a general polish like you would with a clear coat.",
        "Pick a water-based polish if you’re dealing with a clear coat.",
        "Treat clear coats like you would paint on your car.",
        "Aluminum and alloy wheels with the coating are more delicate than regular metal wheels.",
        "Look for a general, all-purpose polish to avoid ruining the finish.",
        "Leave the acid-based polishes for uncoated metal wheels.",
        "Since clear coats are a lot like paint, you could use a paint polish or car wax to safely polish the wheel!",
        "Check for products online or at nearby auto stores.",
        "Add polish to parts of the wheel using a microfiber towel.",
        "Tackle the wheel in sections instead of working around it in a circle.",
        "You could start in the center and work up the spokes or go from the rim to the center.",
        "Start spreading the polish on the spokes one at a time, working on each one individually before moving on to the next one.",
        "If you’re working on a chrome wheel, make the process faster by getting a polishing tool.",
        "A polishing tool is a fabric ball or cone that fits on an electric drill.",
        "It enables you to easily reach between the spokes.",
        "Since clear coats are soft, avoid risks by hand-polishing the wheel with a microfiber towel.",
        "Fabric polishing tools may be a little too abrasive in most cases.",
        "Scrub along the metal’s grain to coat the wheel evenly in polish.",
        "Look closely at the wheel to see small finishing lines left over from the manufacturing process.",
        "Follow these lines to avoid the possibility of scratching the metal.",
        "While working on one section of the wheel at a time, keep moving the towel back and forth along the grain to spread the polish into a single, consistent layer.",
        "Then, repeat the process with the next spoke or section.",
        "After taking care of the spokes on the front of the wheel, work around the rim.",
        "Get behind the wheel, if possible, to make it shiny.",
        "Wipe off the polish after 15 minutes using a clean microfiber cloth.",
        "The polish soaks into the metal within 15 minutes.",
        "After that time, get a fresh cloth and go back over the entire wheel.",
        "Remember to work in small sections, going along the metal’s grain.",
        "Use it to remove any undried wax still on the wheel.",
        "The cloth you use to polish has to be different from the one you used initially or else you could rub brake dust into the wheel.",
        "Always use a clean cloth for each part of the process and never use the same cloth on multiple wheels.",
        "After you finish with one wheel, move on to any others you wish to polish.",
        "Wash, polish, and wax 1 wheel at a time for the best results.",
        "Working on a Bare Aluminum or Steel Wheel Apply a metal buffing compound to the wheel.",
        "The compound is much stronger than a regular metal polish, so you add it first.",
        "It removes scratches and forms a clean base for the polish.",
        "The compound comes in a stick form, so simply rub some of it on the wheel or the rotary tool application pad you plan on using.",
        "Adding it to the application pad makes you less likely to use an excessive amount  that takes longer to dry.",
        "Pick a compound depending on the type of wheel you have.",
        "Use an aluminum compound for aluminum wheels or a steel compound for steel wheels.",
        "Scrub the compound into the wheel using a rotary tool.",
        "Pick up a rotary polisher and a set of wool pads to use on the wheel.",
        "After placing the pad on the tool, turn it on to the lowest speed setting possible.",
        "Begin moving the pad around the wheel, letting it speed up to 3,000 RPM as you go.",
        "Keep going over the wheel until the polish dries.",
        "You could try to work the polish in by hand with a microfiber towel or applicator, but it takes much longer.",
        "Apply a fine metal polish to the wheel using a cloth or pad.",
        "Pick an aluminum polish for an aluminum wheel or a stainless steel polish for a steel wheel.",
        "Dip a clean microfiber towel into the polish to spread it on the wheel.",
        "Focus on one section of the wheel at a time, such as by starting with a single spoke.",
        "Work on that area, giving it a good polish before you move on to the next one.",
        "You can also spread the polish with a rotary tool, but use a fresh, soft pad to avoid scratching the metal.",
        "Work along the metal’s grain to shine the metal without scratching it.",
        "Note which way the finishing lines run along the surface of the wheel.",
        "Use the microfiber towel to wipe back and forth along these lines.",
        "Spread the polish out along the metal to create a uniform, shiny coating.",
        "Then, move onto the next part of the wheel, getting more of the polish to shine it.",
        "Remember to get each individual spoke and the wheel’s rim.",
        "Work behind the wheel if you can reach back there.",
        "Wipe the wheel clean with a microfiber towel after 15 minutes.",
        "Give the polish about 15 minutes to dry, then go back over the wheel using a fresh towel.",
        "Wipe the metal along its grain to keep the polish clean.",
        "Doing this removes excess polish and any debris left on the wheel.",
        "Always switch to a clean towel instead of reusing one with polish on it.",
        "Also, keep the towel separate from any other ones you use on the car, since it could have brake dust on it.",
        "Work on 1 wheel at a time, washing, cleaning, and waxing it until it is well-polished.",
        "Waxing a Wheel Select a wax or sealant to protect the wheel finish from damage.",
        "After you apply polish to a wheel, seal it with a protective layer.",
        "If you’re working on an uncoated metal wheel, use a metal sealant.",
        "For chrome and clear coat wheels, try a basic carnauba wheel wax or wheel glaze.",
        "The general wheel waxes and glazes work on any type of wheel, including steel and aluminum ones.",
        "Metal sealants are more specifically designed to prevent oxidation, so they are a good choice if you know you have a bare wheel.",
        "Apply the wax with a microfiber towel or applicator pad.",
        "Dip a clean towel into the wax to begin spreading it over the wheel.",
        "Spread the wax along the metal’s grain, working part by part.",
        "Add more wax to your towel as needed to coat the wheel in a uniform layer of it.",
        "You apply the wax the same way you apply any polish.",
        "It’s very easy to apply and protects your wheel from nasty stains like oxidation.",
        "Use a clean microfiber towel to wipe the wheel after 15 minutes.",
        "Let the wax dry, then buff the wheel with a clean cloth.",
        "Work along the grain one section at a time until the wheel looks shiny.",
        "Then, repeat the process with any other wheels after you wash and polish them.",
        "To avoid having to polish your wheels as often as you normally would, reapply the wax at least once every 3 months.",
        "Rinse the wheel with clean water, dry it off, then add a fresh layer of wax.",
        "If you wax your wheels weekly, you won’t need to polish them as often since the wax resists grime.",
        "Expect to polish them about twice a year.",
        "If you don’t wax regularly, you may need to polish them 4 times a year or more."
    ]
}