{
    "title": "How to Clean Gutters Without a Ladder",
    "url": "https://www.wikihow.com/Clean-Gutters-Without-a-Ladder",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Roofs",
        "Rain Gutters and Downspouts"
    ],
    "methods": [
        {
            "name": "Vacuuming Your Gutters",
            "steps": [
                {
                    "headline": "Buy a gutter attachment for your wet/dry vacuum.",
                    "description": "Nowadays, many manufacturers sell gutter-cleaning attachments designed to fit over most standard shop vacuums and leaf blowers with “reverse” functions. These typically have a C-shaped construction, allowing you to hook them into your gutters from ground level. Just slip the attachment onto the nozzle of your vacuum and get cleaning. You can purchase a basic gutter-cleaning attachment for around $30. You may also be able to find these accessories at your local hardware store or home improvement center. If you don't already own a wet/dry vacuum, you can get one of these from your local home improvement center, as well. They typically cost about $100 brand new, and around $20 per day to rent. Depending on the height of your gutters, it may be necessary to connect your vacuum extension to one or more extension wands to make sure it will reach."
                },
                {
                    "headline": "Rig up your own gutter attachment using duct elbows and tape.",
                    "description": "If a new gutter-cleaning accessory just isn’t in your budget, don’t worry—you can easily make your own using a few inexpensive, readily-available materials. First, fit your wet/dry vacuum or leaf blower with 1 or 2 extension wands to lengthen your reach. Then, tape 2 duct elbows together end-to-end before taping the contraption to the nozzle of the vacuum. It’s as easy as that! To ensure that your makeshift gutter attachment holds together, use a strong type of tape, like duct or Gorilla tape. Aluminum duct elbows cost about $5 apiece at most hardware stores, which means you can save roughly $20 by cobbling together your own attachment if you already have a suitable roll of tape.Tip: Be sure to shop around for duct elbows that will fit over the nozzle of your vacuum without too much extra space around the edges. A pair of elbows with a diameter of 3 in (7.6 cm) should fit comfortably over a standard 2.5 in (6.4 cm) vacuum nozzle."
                },
                {
                    "headline": "Stand beneath your gutters and raise your vacuum attachment to gutter level.",
                    "description": "Get into position below and slightly in front of the section of gutter you want to clean. Lift your vacuum attachment up and over the edge of the gutter so that the open end is resting in the bottom of the gutter. When you’re ready to start cleaning, switch on the vacuum. Stand as far back from the gutter as you can while staying within a comfortable cleaning distance to avoid being covered by falling debris."
                },
                {
                    "headline": "Run the vacuum along the length of your gutters to suction out debris.",
                    "description": "Walk slowly from one end of the gutter to the other, being careful not to let the attachment slip out of the groove. When you finish cleaning out one straight section, move onto the next. The suction from the vacuum or leaf blower should be strong enough to remove most loose, dry debris. You’ll also want to avoid accidentally pulling on your gutters with the hook-like attachment. If you tug too hard, you could actually damage the gutter. Vacuuming will work best for dry and partially-damp debris, such as leaves, twigs, and pine needles. If your gutters are filled with soggy, mulch-like clumps, you may get better results using a gutter flusher or gutter cleaning tool."
                }
            ]
        },
        {
            "name": "Clearing Out Your Gutters with a Gutter Flusher",
            "steps": [
                {
                    "headline": "Pick up a gutter flusher attachment online or at your local hardware store.",
                    "description": "A gutter flusher is a type of small, hook-shaped sprayer on a long pole that serves as a high-powered extension for a normal garden hose. A good gutter flusher could cost anywhere $25 to $50, making it a fairly affordable ground level gutter-cleaning solution. Your gutter flusher may or may not come with its own extended handle. If it doesn’t, or if it’s still not long enough to reach your gutters, you’ll need to buy a separate flow-through extension pole to attach it to. You can often find one of these for as little as $20-30. There are also gutter flushers intended to quick-couple to the nozzles of any sprayer or pressure washer with a wand. One of these attachments can come in handy if you'd rather not have to wrangle your hose every time you clean your gutters."
                },
                {
                    "headline": "Insert or screw the gutter flusher into the end of your hose.",
                    "description": "Some gutter flushers slip right into a standard hose nozzle; others must be screwed into place. Depending on the exact model you’re working with, you may also need to engage a separate latch or locking mechanism to guarantee a secure connection during use. Be sure to read through the instructions that came with your gutter flusher to familiarize yourself with its basic design and function before taking it out for its maiden cleaning."
                },
                {
                    "headline": "Turn on the water to your hose.",
                    "description": "Twist the hand wheel on your hose’s spigot all the way to the left (counterclockwise). Once the water is flowing, it will move through the hose into the gutter flusher, escaping from the nozzle in a high-pressure jet forceful enough to blast out even the most stubborn gutter gunk. Despite featuring only a single nozzle, most gutter flushers produce a wide, fanning stream that help make sure the tool does its job even if it’s not being held at a perfect downward angle. If you’re running your gutter flusher through a pressure washer or sprayer wand, you’ll need to hold down the device’s trigger in order to release the stream. Gutter flushers emit fairly large quantities of water, which means you may see a slight increase in your utility bill if you use yours regularly."
                },
                {
                    "headline": "Sweep the gutter flusher slowly from one end of the gutter to the other.",
                    "description": "As you move the tool along, the powerful stream of water it emits will break up and wash away clumps of compacted organic matter that have become cemented in place due to time and moisture. Flush one section of gutter at a time until the draining water runs clear, then proceed to the next section. Gutter flushers tend to do a faster and more thorough job of cleaning out stopped-up gutters than vacuum attachments or manual removal tools.Warning: Change into some old clothes that you don't mind dirtying up before you get to work. Things are bound to get messy with all that water and loose debris flying around."
                }
            ]
        },
        {
            "name": "Removing Debris Manually",
            "steps": [
                {
                    "headline": "Pick up a gutter rake or tong attachment.",
                    "description": "If you prefer to clean out your gutters the old fashioned way but don’t want to have to break out a ladder to do it, one of these tools will be your best bet. You can find them at your neighborhood hardware store or home improvement center, or at any retailer that carries outdoor cleaning equipment. You can buy a no-frills gutter rake attachment for around $15-20, while a set of tongs may run you $30 or more. Both of these tools are designed to attach to the end of an ordinary extension pole, which should add no more than $10-20 to your total cost.Tip: If the weather in your area is unpredictable, it may be wise to invest in one of each tool. Use your rake to dislodge dry debris, and reserve your tongs for picking up wet materials that you can’t quite dig out with a rake."
                },
                {
                    "headline": "Scrape dry debris out your gutters a little at a time with a gutter rake.",
                    "description": "Hold the rake so that the angled head is facing away from you and raise it up to your gutter. Once it’s inside, pull the pole towards you to drag clusters of leaves, sticks, and other debris over the edges. Continue in this fashion until you’ve freed as much debris as possible. Strap on a facemask and wear sunglasses or similar eye protection to prevent small pieces of loose debris from falling into your eyes, nose, and mouth as you work. While it’s possibly the cheapest solution overall, raking out your gutters can be difficult, time-consuming work. Be prepared to take short breaks as often as needed when your arms start to tire."
                },
                {
                    "headline": "Use gutter tongs to scoop out wet, decomposing debris.",
                    "description": "Elevate the tongs so that they’re positioned just above the gutter with the arms open. Pull the string at the base of the attachment to clamp the tongs shut around a mound of debris, then lift it out of the gutter and slacken the string to release it. Proceed in short sections until you've cleared out the entire length of the gutter, breaking whenever necessary. It's also a good idea to wear a facemask and eye protection when working with gutter tongs, as you're likely to be sprinkled with drifting debris. If you plan on picking up the debris you clear out of your gutters, try to concentrate as much as you can in the same general area. This will make it much easier to deal with later."
                },
                {
                    "headline": "Place the gunk you remove in a garbage bag or wheelbarrow for easy disposal.",
                    "description": "When you’re done cleaning, rake or shovel the fallen debris into the bag, then seal it up tight and chuck it in the trash. Alternatively, you could transfer the materials to a wheelbarrow and dump them in the woods or an out-of-the-way part of your yard or garden to let them break down naturally. The decomposing leaves, sticks, and other organic matter in your gutters can make excellent compost."
                }
            ]
        }
    ],
    "tyn": [
        "Vacuuming Your Gutters",
        "Shop vacuum or leaf blower with reverse function",
        "Gutter-cleaning vacuum attachment",
        "Vacuum extension wands (optional)",
        "Aluminum duct elbows (optional)",
        "Strong tape (optional)",
        "Flushing Your Gutters with Water",
        "Garden hose, pressure washer, or sprayer wand",
        "Gutter flusher tool",
        "Flow-through extension pole (optional)",
        "Removing Debris Manually",
        "Gutter rake or tong attachment",
        "Metal extension pole",
        "Garbage bag or wheelbarrow",
        "Compost bin (optional)"
    ],
    "text": " Vacuuming Your Gutters Buy a gutter attachment for your wet/dry vacuum. Nowadays, many manufacturers sell gutter-cleaning attachments designed to fit over most standard shop vacuums and leaf blowers with “reverse” functions. These typically have a C-shaped construction, allowing you to hook them into your gutters from ground level. Just slip the attachment onto the nozzle of your vacuum and get cleaning. You can purchase a basic gutter-cleaning attachment for around $30. You may also be able to find these accessories at your local hardware store or home improvement center. If you don't already own a wet/dry vacuum, you can get one of these from your local home improvement center, as well. They typically cost about $100 brand new, and around $20 per day to rent. Depending on the height of your gutters, it may be necessary to connect your vacuum extension to one or more extension wands to make sure it will reach. Rig up your own gutter attachment using duct elbows and tape. If a new gutter-cleaning accessory just isn’t in your budget, don’t worry—you can easily make your own using a few inexpensive, readily-available materials. First, fit your wet/dry vacuum or leaf blower with 1 or 2 extension wands to lengthen your reach. Then, tape 2 duct elbows together end-to-end before taping the contraption to the nozzle of the vacuum. It’s as easy as that! To ensure that your makeshift gutter attachment holds together, use a strong type of tape, like duct or Gorilla tape. Aluminum duct elbows cost about $5 apiece at most hardware stores, which means you can save roughly $20 by cobbling together your own attachment if you already have a suitable roll of tape.Tip: Be sure to shop around for duct elbows that will fit over the nozzle of your vacuum without too much extra space around the edges. A pair of elbows with a diameter of 3 in (7.6 cm) should fit comfortably over a standard 2.5 in (6.4 cm) vacuum nozzle. Stand beneath your gutters and raise your vacuum attachment to gutter level. Get into position below and slightly in front of the section of gutter you want to clean. Lift your vacuum attachment up and over the edge of the gutter so that the open end is resting in the bottom of the gutter. When you’re ready to start cleaning, switch on the vacuum. Stand as far back from the gutter as you can while staying within a comfortable cleaning distance to avoid being covered by falling debris. Run the vacuum along the length of your gutters to suction out debris. Walk slowly from one end of the gutter to the other, being careful not to let the attachment slip out of the groove. When you finish cleaning out one straight section, move onto the next. The suction from the vacuum or leaf blower should be strong enough to remove most loose, dry debris. You’ll also want to avoid accidentally pulling on your gutters with the hook-like attachment. If you tug too hard, you could actually damage the gutter. Vacuuming will work best for dry and partially-damp debris, such as leaves, twigs, and pine needles. If your gutters are filled with soggy, mulch-like clumps, you may get better results using a gutter flusher or gutter cleaning tool. Clearing Out Your Gutters with a Gutter Flusher Pick up a gutter flusher attachment online or at your local hardware store. A gutter flusher is a type of small, hook-shaped sprayer on a long pole that serves as a high-powered extension for a normal garden hose. A good gutter flusher could cost anywhere $25 to $50, making it a fairly affordable ground level gutter-cleaning solution. Your gutter flusher may or may not come with its own extended handle. If it doesn’t, or if it’s still not long enough to reach your gutters, you’ll need to buy a separate flow-through extension pole to attach it to. You can often find one of these for as little as $20-30. There are also gutter flushers intended to quick-couple to the nozzles of any sprayer or pressure washer with a wand. One of these attachments can come in handy if you'd rather not have to wrangle your hose every time you clean your gutters. Insert or screw the gutter flusher into the end of your hose. Some gutter flushers slip right into a standard hose nozzle; others must be screwed into place. Depending on the exact model you’re working with, you may also need to engage a separate latch or locking mechanism to guarantee a secure connection during use. Be sure to read through the instructions that came with your gutter flusher to familiarize yourself with its basic design and function before taking it out for its maiden cleaning. Turn on the water to your hose. Twist the hand wheel on your hose’s spigot all the way to the left (counterclockwise). Once the water is flowing, it will move through the hose into the gutter flusher, escaping from the nozzle in a high-pressure jet forceful enough to blast out even the most stubborn gutter gunk. Despite featuring only a single nozzle, most gutter flushers produce a wide, fanning stream that help make sure the tool does its job even if it’s not being held at a perfect downward angle. If you’re running your gutter flusher through a pressure washer or sprayer wand, you’ll need to hold down the device’s trigger in order to release the stream. Gutter flushers emit fairly large quantities of water, which means you may see a slight increase in your utility bill if you use yours regularly. Sweep the gutter flusher slowly from one end of the gutter to the other. As you move the tool along, the powerful stream of water it emits will break up and wash away clumps of compacted organic matter that have become cemented in place due to time and moisture. Flush one section of gutter at a time until the draining water runs clear, then proceed to the next section. Gutter flushers tend to do a faster and more thorough job of cleaning out stopped-up gutters than vacuum attachments or manual removal tools.Warning: Change into some old clothes that you don't mind dirtying up before you get to work. Things are bound to get messy with all that water and loose debris flying around. Removing Debris Manually Pick up a gutter rake or tong attachment. If you prefer to clean out your gutters the old fashioned way but don’t want to have to break out a ladder to do it, one of these tools will be your best bet. You can find them at your neighborhood hardware store or home improvement center, or at any retailer that carries outdoor cleaning equipment. You can buy a no-frills gutter rake attachment for around $15-20, while a set of tongs may run you $30 or more. Both of these tools are designed to attach to the end of an ordinary extension pole, which should add no more than $10-20 to your total cost.Tip: If the weather in your area is unpredictable, it may be wise to invest in one of each tool. Use your rake to dislodge dry debris, and reserve your tongs for picking up wet materials that you can’t quite dig out with a rake. Scrape dry debris out your gutters a little at a time with a gutter rake. Hold the rake so that the angled head is facing away from you and raise it up to your gutter. Once it’s inside, pull the pole towards you to drag clusters of leaves, sticks, and other debris over the edges. Continue in this fashion until you’ve freed as much debris as possible. Strap on a facemask and wear sunglasses or similar eye protection to prevent small pieces of loose debris from falling into your eyes, nose, and mouth as you work. While it’s possibly the cheapest solution overall, raking out your gutters can be difficult, time-consuming work. Be prepared to take short breaks as often as needed when your arms start to tire. Use gutter tongs to scoop out wet, decomposing debris. Elevate the tongs so that they’re positioned just above the gutter with the arms open. Pull the string at the base of the attachment to clamp the tongs shut around a mound of debris, then lift it out of the gutter and slacken the string to release it. Proceed in short sections until you've cleared out the entire length of the gutter, breaking whenever necessary. It's also a good idea to wear a facemask and eye protection when working with gutter tongs, as you're likely to be sprinkled with drifting debris. If you plan on picking up the debris you clear out of your gutters, try to concentrate as much as you can in the same general area. This will make it much easier to deal with later. Place the gunk you remove in a garbage bag or wheelbarrow for easy disposal. When you’re done cleaning, rake or shovel the fallen debris into the bag, then seal it up tight and chuck it in the trash. Alternatively, you could transfer the materials to a wheelbarrow and dump them in the woods or an out-of-the-way part of your yard or garden to let them break down naturally. The decomposing leaves, sticks, and other organic matter in your gutters can make excellent compost.",
    "sentences": [
        " Vacuuming Your Gutters Buy a gutter attachment for your wet/dry vacuum.",
        "Nowadays, many manufacturers sell gutter-cleaning attachments designed to fit over most standard shop vacuums and leaf blowers with “reverse” functions.",
        "These typically have a C-shaped construction, allowing you to hook them into your gutters from ground level.",
        "Just slip the attachment onto the nozzle of your vacuum and get cleaning.",
        "You can purchase a basic gutter-cleaning attachment for around $30.",
        "You may also be able to find these accessories at your local hardware store or home improvement center.",
        "If you don't already own a wet/dry vacuum, you can get one of these from your local home improvement center, as well.",
        "They typically cost about $100 brand new, and around $20 per day to rent.",
        "Depending on the height of your gutters, it may be necessary to connect your vacuum extension to one or more extension wands to make sure it will reach.",
        "Rig up your own gutter attachment using duct elbows and tape.",
        "If a new gutter-cleaning accessory just isn’t in your budget, don’t worry—you can easily make your own using a few inexpensive, readily-available materials.",
        "First, fit your wet/dry vacuum or leaf blower with 1 or 2 extension wands to lengthen your reach.",
        "Then, tape 2 duct elbows together end-to-end before taping the contraption to the nozzle of the vacuum.",
        "It’s as easy as that!",
        "To ensure that your makeshift gutter attachment holds together, use a strong type of tape, like duct or Gorilla tape.",
        "Aluminum duct elbows cost about $5 apiece at most hardware stores, which means you can save roughly $20 by cobbling together your own attachment if you already have a suitable roll of tape.Tip: Be sure to shop around for duct elbows that will fit over the nozzle of your vacuum without too much extra space around the edges.",
        "A pair of elbows with a diameter of 3 in (7.6 cm) should fit comfortably over a standard 2.5 in (6.4 cm) vacuum nozzle.",
        "Stand beneath your gutters and raise your vacuum attachment to gutter level.",
        "Get into position below and slightly in front of the section of gutter you want to clean.",
        "Lift your vacuum attachment up and over the edge of the gutter so that the open end is resting in the bottom of the gutter.",
        "When you’re ready to start cleaning, switch on the vacuum.",
        "Stand as far back from the gutter as you can while staying within a comfortable cleaning distance to avoid being covered by falling debris.",
        "Run the vacuum along the length of your gutters to suction out debris.",
        "Walk slowly from one end of the gutter to the other, being careful not to let the attachment slip out of the groove.",
        "When you finish cleaning out one straight section, move onto the next.",
        "The suction from the vacuum or leaf blower should be strong enough to remove most loose, dry debris.",
        "You’ll also want to avoid accidentally pulling on your gutters with the hook-like attachment.",
        "If you tug too hard, you could actually damage the gutter.",
        "Vacuuming will work best for dry and partially-damp debris, such as leaves, twigs, and pine needles.",
        "If your gutters are filled with soggy, mulch-like clumps, you may get better results using a gutter flusher or gutter cleaning tool.",
        "Clearing Out Your Gutters with a Gutter Flusher Pick up a gutter flusher attachment online or at your local hardware store.",
        "A gutter flusher is a type of small, hook-shaped sprayer on a long pole that serves as a high-powered extension for a normal garden hose.",
        "A good gutter flusher could cost anywhere $25 to $50, making it a fairly affordable ground level gutter-cleaning solution.",
        "Your gutter flusher may or may not come with its own extended handle.",
        "If it doesn’t, or if it’s still not long enough to reach your gutters, you’ll need to buy a separate flow-through extension pole to attach it to.",
        "You can often find one of these for as little as $20-30.",
        "There are also gutter flushers intended to quick-couple to the nozzles of any sprayer or pressure washer with a wand.",
        "One of these attachments can come in handy if you'd rather not have to wrangle your hose every time you clean your gutters.",
        "Insert or screw the gutter flusher into the end of your hose.",
        "Some gutter flushers slip right into a standard hose nozzle; others must be screwed into place.",
        "Depending on the exact model you’re working with, you may also need to engage a separate latch or locking mechanism to guarantee a secure connection during use.",
        "Be sure to read through the instructions that came with your gutter flusher to familiarize yourself with its basic design and function before taking it out for its maiden cleaning.",
        "Turn on the water to your hose.",
        "Twist the hand wheel on your hose’s spigot all the way to the left (counterclockwise).",
        "Once the water is flowing, it will move through the hose into the gutter flusher, escaping from the nozzle in a high-pressure jet forceful enough to blast out even the most stubborn gutter gunk.",
        "Despite featuring only a single nozzle, most gutter flushers produce a wide, fanning stream that help make sure the tool does its job even if it’s not being held at a perfect downward angle.",
        "If you’re running your gutter flusher through a pressure washer or sprayer wand, you’ll need to hold down the device’s trigger in order to release the stream.",
        "Gutter flushers emit fairly large quantities of water, which means you may see a slight increase in your utility bill if you use yours regularly.",
        "Sweep the gutter flusher slowly from one end of the gutter to the other.",
        "As you move the tool along, the powerful stream of water it emits will break up and wash away clumps of compacted organic matter that have become cemented in place due to time and moisture.",
        "Flush one section of gutter at a time until the draining water runs clear, then proceed to the next section.",
        "Gutter flushers tend to do a faster and more thorough job of cleaning out stopped-up gutters than vacuum attachments or manual removal tools.Warning: Change into some old clothes that you don't mind dirtying up before you get to work.",
        "Things are bound to get messy with all that water and loose debris flying around.",
        "Removing Debris Manually Pick up a gutter rake or tong attachment.",
        "If you prefer to clean out your gutters the old fashioned way but don’t want to have to break out a ladder to do it, one of these tools will be your best bet.",
        "You can find them at your neighborhood hardware store or home improvement center, or at any retailer that carries outdoor cleaning equipment.",
        "You can buy a no-frills gutter rake attachment for around $15-20, while a set of tongs may run you $30 or more.",
        "Both of these tools are designed to attach to the end of an ordinary extension pole, which should add no more than $10-20 to your total cost.Tip: If the weather in your area is unpredictable, it may be wise to invest in one of each tool.",
        "Use your rake to dislodge dry debris, and reserve your tongs for picking up wet materials that you can’t quite dig out with a rake.",
        "Scrape dry debris out your gutters a little at a time with a gutter rake.",
        "Hold the rake so that the angled head is facing away from you and raise it up to your gutter.",
        "Once it’s inside, pull the pole towards you to drag clusters of leaves, sticks, and other debris over the edges.",
        "Continue in this fashion until you’ve freed as much debris as possible.",
        "Strap on a facemask and wear sunglasses or similar eye protection to prevent small pieces of loose debris from falling into your eyes, nose, and mouth as you work.",
        "While it’s possibly the cheapest solution overall, raking out your gutters can be difficult, time-consuming work.",
        "Be prepared to take short breaks as often as needed when your arms start to tire.",
        "Use gutter tongs to scoop out wet, decomposing debris.",
        "Elevate the tongs so that they’re positioned just above the gutter with the arms open.",
        "Pull the string at the base of the attachment to clamp the tongs shut around a mound of debris, then lift it out of the gutter and slacken the string to release it.",
        "Proceed in short sections until you've cleared out the entire length of the gutter, breaking whenever necessary.",
        "It's also a good idea to wear a facemask and eye protection when working with gutter tongs, as you're likely to be sprinkled with drifting debris.",
        "If you plan on picking up the debris you clear out of your gutters, try to concentrate as much as you can in the same general area.",
        "This will make it much easier to deal with later.",
        "Place the gunk you remove in a garbage bag or wheelbarrow for easy disposal.",
        "When you’re done cleaning, rake or shovel the fallen debris into the bag, then seal it up tight and chuck it in the trash.",
        "Alternatively, you could transfer the materials to a wheelbarrow and dump them in the woods or an out-of-the-way part of your yard or garden to let them break down naturally.",
        "The decomposing leaves, sticks, and other organic matter in your gutters can make excellent compost."
    ]
}