{
    "title": "How to Care for a Madagascar Hissing Cockroach",
    "url": "https://www.wikihow.com/Care-for-a-Madagascar-Hissing-Cockroach",
    "category_hierarchy": [
        "Pets and Animals",
        "Bugs"
    ],
    "methods": [
        {
            "name": "Setting Up the Habitat",
            "steps": [
                {
                    "headline": "Use a 5 US gal (19 L) tank to house your cockroach.",
                    "description": "For best results, opt for a simple glass fish tank that you can repurpose as a cockroach habitat. Get a tank with a snap-on lid with ventilation holes to keep your hisser from pushing the lid off. Finally, put petroleum jelly around the top rim of the tank to make it even harder for your roach to escape. This is an appropriately sized tank for a single cockroach, but you can also comfortably store up to 15 cockroaches in a 5 US gal (19 L) tank. If you want to house more than 15, add about 1 gallon (3.8 L) of volume to the tank for every additional 5 cockroaches. This may seem like overkill, but Madagascar hissing cockroaches are very good at climbing, even on flat surfaces. You definitely need to make it as hard as possible for your roach to climb out of its habitat and escape. Make sure the ventilation holes on your snap-on lid are small enough to keep your roach from crawling through them. The holes should be no larger than ⁄2 inch (1.3 cm) in diameter."
                },
                {
                    "headline": "Pour 1 to 2 inches (2.5 to 5.1 cm) of substrate on the bottom of your tank.",
                    "description": "Wood chips, peat moss, or sphagnum moss are all good substrates to use for your cockroach. To make the habitat even better, add an egg carton or a cardboard tube to the tank as a hiding spot for your roach. Your roach will particularly enjoy having a stack of egg cartons in the tank that it can hide in. You can buy suitable substrate for your cockroach at any pet store that sells supplies for insects."
                },
                {
                    "headline": "Maintain a high level of humidity in the tank by misting it daily.",
                    "description": "Fill a spray bottle with water and spray enough water into the tank every day to cover the substrate. The substrate doesn’t have to be completely soaked; just make it lightly damp across the entire surface. Keep the humidity level in the tank between 60% and 70%. Place a hygrometer on the side of the tank to keep an eye on the humidity levels. You can buy a hygrometer at any large pet supplies store. You won’t do any harm to your roaches if the humidity in the tank goes above 70%. If this happens, just spray a little bit less water in the tank the next day to return the humidity level to normal."
                },
                {
                    "headline": "Keep the temperature of the tank between 77 and 82 °F (25 and 28 °C).",
                    "description": "The temperature in the tank at night can safely dip to about 70 °F (21 °C). However, never let the tank temperature go below 65 °F (18 °C). Use a thermometer attached to the side of the tank to monitor its internal temperature. The best way to maintain control over the temperature of the tank is to keep it in a climate-controlled part of your house (e.g., a room where the temperature is constantly kept at around 80 °F (27 °C)). Ultimately, it will be very hard for you to make the temperature in the tank too high. Madagascar hissing cockroaches can tolerate temperatures as high as 100 °F (38 °C)."
                },
                {
                    "headline": "Put an infrared light in the tank if you want to view your roach at night.",
                    "description": "Roaches are nocturnal, so they have no special lighting needs during the day. Avoid using an ordinary incandescent bulb to illuminate their tank at night, as this might cause your roach to hide. You can buy this type of infrared light at most stores that sell supplies for pet insects."
                }
            ]
        },
        {
            "name": "Feeding and Handling Your Cockroach",
            "steps": [
                {
                    "headline": "Place a shallow bowl with water and a cotton ball inside it in the tank.",
                    "description": "The roach will drink the water out of the saturated cotton ball. You can also use a small piece of sponge if you don’t have any cotton balls. Be sure to change the water and cotton ball in the bowl daily. Pour enough water into the bowl to completely saturate the cotton ball while also leaving a small amount of water (about ⁄4 inch (0.64 cm)) in the bottom of the bowl. To prevent the roach from drowning, put some small rocks in the bottom of the water bowl, as well. For maximum safety, use chlorine-free water, if possible."
                },
                {
                    "headline": "Feed your roach fruits, vegetables, and leafy greens twice a week.",
                    "description": "Some foods that your roach will definitely enjoy include carrots, apples, romaine lettuce, spinach, bananas, strawberries, and oranges. Feed it some pelleted dog food or cat food as well to make sure your roach gets enough protein in its diet. Start off by feeding your roach about 1/4 cup (50 grams) of mixed fruits, vegetables, and pelleted food. If your roach doesn’t finish all of this food, shift to smaller portions the next time you feed it. Remove any food that hasn’t been eaten after 24 hours. Be sure to wash any fruits and vegetables you feed your cockroach to remove any pesticides that may be on the skins. To give your roach a source of calcium, you can also put a cuttlefish bone, natural chalk, or crushed egg shells in the tank."
                },
                {
                    "headline": "Handle your cockroach gently to avoid causing harm to either of you.",
                    "description": "Pick up your cockroach around the thorax (the hard section with the bumps behind the head) and lift it very slowly. Don’t jerk the roach upwards, since it may cling to whatever surface it’s standing on out of fear. Don’t try to hold the roach down either; it has sharp spines on its leg that it may use to scratch you as a defense mechanism. The best way to handle your roach after picking it up is simply to let it wander around the surface of your hands. Don’t worry, your roach won’t bite!"
                },
                {
                    "headline": "Wash your hands thoroughly after handling your roach.",
                    "description": "The bodies of Madagascar hissing cockroaches are unfortunately home to a number of mold species that could trigger allergies in people who touch them. Use soap and warm water to wash your hands for at least 20 seconds to make sure they’re fully clean. Some of the species of mold identified on hissing cockroaches can also cause infections if they enter the lungs or an open wound. This mold is also found in the roach’s fecal matter, so make sure to wash your hands after cleaning the habitat as well."
                }
            ]
        },
        {
            "name": "Keeping Your Roach Habitat Clean",
            "steps": [
                {
                    "headline": "Transfer your roach to a separate container before cleaning the habitat.",
                    "description": "Make sure this secondary container is ventilated but also secure. Remove the water bowl and any tubing you placed in the tank as well. To keep your roach comfortable, make the conditions in the secondary container as similar as possible to the conditions in its normal habitat. Aim for a container that is about the same size as your roach’s normal habitat."
                },
                {
                    "headline": "Replace the substrate in the tank at least once a week.",
                    "description": "The substrate absorbs a lot of the moisture that is constantly in the tank, so it needs to be replaced regularly to keep it from becoming too saturated. However, replace the substrate even earlier if you spy any mold in it. If the egg cartons and tubing in the tank look saturated or moldy, replace these as well when you go to swap out the substrate."
                },
                {
                    "headline": "Wash the entire tank with a diluted bleach solution once a month.",
                    "description": "Take the bowl, tubing, and all of the substrate out of the tank before you clean it. Rinse the entire tank with warm water, then use a sponge to scrub the inside of the habitat with a 3% bleach solution. You can make this type of cleaning solution at home by mixing bleach and water using a 1:32 ratio."
                },
                {
                    "headline": "Remove shed exoskeletons and dead roaches as they build up.",
                    "description": "Young hissing cockroaches will shed their exoskeletons a few times before they reach maturity, so you’ll need to be on the lookout for these shells if your cockroaches are relatively young. If you have multiple roaches in the same habitat, check for carcasses and old shells once a day and remove them as necessary."
                }
            ]
        }
    ],
    "tyn": [
        "5 US gal (19 L) tank",
        "Wood chips, peat moss, or sphagnum moss",
        "Spray bottle",
        "Infrared light",
        "Shallow bowl",
        "Cotton balls",
        "Fruits and vegetables"
    ],
    "text": " Setting Up the Habitat Use a 5 US gal (19 L) tank to house your cockroach. For best results, opt for a simple glass fish tank that you can repurpose as a cockroach habitat. Get a tank with a snap-on lid with ventilation holes to keep your hisser from pushing the lid off. Finally, put petroleum jelly around the top rim of the tank to make it even harder for your roach to escape. This is an appropriately sized tank for a single cockroach, but you can also comfortably store up to 15 cockroaches in a 5 US gal (19 L) tank. If you want to house more than 15, add about 1 gallon (3.8 L) of volume to the tank for every additional 5 cockroaches. This may seem like overkill, but Madagascar hissing cockroaches are very good at climbing, even on flat surfaces. You definitely need to make it as hard as possible for your roach to climb out of its habitat and escape. Make sure the ventilation holes on your snap-on lid are small enough to keep your roach from crawling through them. The holes should be no larger than ⁄2 inch (1.3 cm) in diameter. Pour 1 to 2 inches (2.5 to 5.1 cm) of substrate on the bottom of your tank. Wood chips, peat moss, or sphagnum moss are all good substrates to use for your cockroach. To make the habitat even better, add an egg carton or a cardboard tube to the tank as a hiding spot for your roach. Your roach will particularly enjoy having a stack of egg cartons in the tank that it can hide in. You can buy suitable substrate for your cockroach at any pet store that sells supplies for insects. Maintain a high level of humidity in the tank by misting it daily. Fill a spray bottle with water and spray enough water into the tank every day to cover the substrate. The substrate doesn’t have to be completely soaked; just make it lightly damp across the entire surface. Keep the humidity level in the tank between 60% and 70%. Place a hygrometer on the side of the tank to keep an eye on the humidity levels. You can buy a hygrometer at any large pet supplies store. You won’t do any harm to your roaches if the humidity in the tank goes above 70%. If this happens, just spray a little bit less water in the tank the next day to return the humidity level to normal. Keep the temperature of the tank between 77 and 82 °F (25 and 28 °C). The temperature in the tank at night can safely dip to about 70 °F (21 °C). However, never let the tank temperature go below 65 °F (18 °C). Use a thermometer attached to the side of the tank to monitor its internal temperature. The best way to maintain control over the temperature of the tank is to keep it in a climate-controlled part of your house (e.g., a room where the temperature is constantly kept at around 80 °F (27 °C)). Ultimately, it will be very hard for you to make the temperature in the tank too high. Madagascar hissing cockroaches can tolerate temperatures as high as 100 °F (38 °C). Put an infrared light in the tank if you want to view your roach at night. Roaches are nocturnal, so they have no special lighting needs during the day. Avoid using an ordinary incandescent bulb to illuminate their tank at night, as this might cause your roach to hide. You can buy this type of infrared light at most stores that sell supplies for pet insects. Feeding and Handling Your Cockroach Place a shallow bowl with water and a cotton ball inside it in the tank. The roach will drink the water out of the saturated cotton ball. You can also use a small piece of sponge if you don’t have any cotton balls. Be sure to change the water and cotton ball in the bowl daily. Pour enough water into the bowl to completely saturate the cotton ball while also leaving a small amount of water (about ⁄4 inch (0.64 cm)) in the bottom of the bowl. To prevent the roach from drowning, put some small rocks in the bottom of the water bowl, as well. For maximum safety, use chlorine-free water, if possible. Feed your roach fruits, vegetables, and leafy greens twice a week. Some foods that your roach will definitely enjoy include carrots, apples, romaine lettuce, spinach, bananas, strawberries, and oranges. Feed it some pelleted dog food or cat food as well to make sure your roach gets enough protein in its diet. Start off by feeding your roach about 1/4 cup (50 grams) of mixed fruits, vegetables, and pelleted food. If your roach doesn’t finish all of this food, shift to smaller portions the next time you feed it. Remove any food that hasn’t been eaten after 24 hours. Be sure to wash any fruits and vegetables you feed your cockroach to remove any pesticides that may be on the skins. To give your roach a source of calcium, you can also put a cuttlefish bone, natural chalk, or crushed egg shells in the tank. Handle your cockroach gently to avoid causing harm to either of you. Pick up your cockroach around the thorax (the hard section with the bumps behind the head) and lift it very slowly. Don’t jerk the roach upwards, since it may cling to whatever surface it’s standing on out of fear. Don’t try to hold the roach down either; it has sharp spines on its leg that it may use to scratch you as a defense mechanism. The best way to handle your roach after picking it up is simply to let it wander around the surface of your hands. Don’t worry, your roach won’t bite! Wash your hands thoroughly after handling your roach. The bodies of Madagascar hissing cockroaches are unfortunately home to a number of mold species that could trigger allergies in people who touch them. Use soap and warm water to wash your hands for at least 20 seconds to make sure they’re fully clean. Some of the species of mold identified on hissing cockroaches can also cause infections if they enter the lungs or an open wound. This mold is also found in the roach’s fecal matter, so make sure to wash your hands after cleaning the habitat as well. Keeping Your Roach Habitat Clean Transfer your roach to a separate container before cleaning the habitat. Make sure this secondary container is ventilated but also secure. Remove the water bowl and any tubing you placed in the tank as well. To keep your roach comfortable, make the conditions in the secondary container as similar as possible to the conditions in its normal habitat. Aim for a container that is about the same size as your roach’s normal habitat. Replace the substrate in the tank at least once a week. The substrate absorbs a lot of the moisture that is constantly in the tank, so it needs to be replaced regularly to keep it from becoming too saturated. However, replace the substrate even earlier if you spy any mold in it. If the egg cartons and tubing in the tank look saturated or moldy, replace these as well when you go to swap out the substrate. Wash the entire tank with a diluted bleach solution once a month. Take the bowl, tubing, and all of the substrate out of the tank before you clean it. Rinse the entire tank with warm water, then use a sponge to scrub the inside of the habitat with a 3% bleach solution. You can make this type of cleaning solution at home by mixing bleach and water using a 1:32 ratio. Remove shed exoskeletons and dead roaches as they build up. Young hissing cockroaches will shed their exoskeletons a few times before they reach maturity, so you’ll need to be on the lookout for these shells if your cockroaches are relatively young. If you have multiple roaches in the same habitat, check for carcasses and old shells once a day and remove them as necessary.",
    "sentences": [
        " Setting Up the Habitat Use a 5 US gal (19 L) tank to house your cockroach.",
        "For best results, opt for a simple glass fish tank that you can repurpose as a cockroach habitat.",
        "Get a tank with a snap-on lid with ventilation holes to keep your hisser from pushing the lid off.",
        "Finally, put petroleum jelly around the top rim of the tank to make it even harder for your roach to escape.",
        "This is an appropriately sized tank for a single cockroach, but you can also comfortably store up to 15 cockroaches in a 5 US gal (19 L) tank.",
        "If you want to house more than 15, add about 1 gallon (3.8 L) of volume to the tank for every additional 5 cockroaches.",
        "This may seem like overkill, but Madagascar hissing cockroaches are very good at climbing, even on flat surfaces.",
        "You definitely need to make it as hard as possible for your roach to climb out of its habitat and escape.",
        "Make sure the ventilation holes on your snap-on lid are small enough to keep your roach from crawling through them.",
        "The holes should be no larger than ⁄2 inch (1.3 cm) in diameter.",
        "Pour 1 to 2 inches (2.5 to 5.1 cm) of substrate on the bottom of your tank.",
        "Wood chips, peat moss, or sphagnum moss are all good substrates to use for your cockroach.",
        "To make the habitat even better, add an egg carton or a cardboard tube to the tank as a hiding spot for your roach.",
        "Your roach will particularly enjoy having a stack of egg cartons in the tank that it can hide in.",
        "You can buy suitable substrate for your cockroach at any pet store that sells supplies for insects.",
        "Maintain a high level of humidity in the tank by misting it daily.",
        "Fill a spray bottle with water and spray enough water into the tank every day to cover the substrate.",
        "The substrate doesn’t have to be completely soaked; just make it lightly damp across the entire surface.",
        "Keep the humidity level in the tank between 60% and 70%.",
        "Place a hygrometer on the side of the tank to keep an eye on the humidity levels.",
        "You can buy a hygrometer at any large pet supplies store.",
        "You won’t do any harm to your roaches if the humidity in the tank goes above 70%.",
        "If this happens, just spray a little bit less water in the tank the next day to return the humidity level to normal.",
        "Keep the temperature of the tank between 77 and 82 °F (25 and 28 °C).",
        "The temperature in the tank at night can safely dip to about 70 °F (21 °C).",
        "However, never let the tank temperature go below 65 °F (18 °C).",
        "Use a thermometer attached to the side of the tank to monitor its internal temperature.",
        "The best way to maintain control over the temperature of the tank is to keep it in a climate-controlled part of your house (e.g., a room where the temperature is constantly kept at around 80 °F (27 °C)).",
        "Ultimately, it will be very hard for you to make the temperature in the tank too high.",
        "Madagascar hissing cockroaches can tolerate temperatures as high as 100 °F (38 °C).",
        "Put an infrared light in the tank if you want to view your roach at night.",
        "Roaches are nocturnal, so they have no special lighting needs during the day.",
        "Avoid using an ordinary incandescent bulb to illuminate their tank at night, as this might cause your roach to hide.",
        "You can buy this type of infrared light at most stores that sell supplies for pet insects.",
        "Feeding and Handling Your Cockroach Place a shallow bowl with water and a cotton ball inside it in the tank.",
        "The roach will drink the water out of the saturated cotton ball.",
        "You can also use a small piece of sponge if you don’t have any cotton balls.",
        "Be sure to change the water and cotton ball in the bowl daily.",
        "Pour enough water into the bowl to completely saturate the cotton ball while also leaving a small amount of water (about ⁄4 inch (0.64 cm)) in the bottom of the bowl.",
        "To prevent the roach from drowning, put some small rocks in the bottom of the water bowl, as well.",
        "For maximum safety, use chlorine-free water, if possible.",
        "Feed your roach fruits, vegetables, and leafy greens twice a week.",
        "Some foods that your roach will definitely enjoy include carrots, apples, romaine lettuce, spinach, bananas, strawberries, and oranges.",
        "Feed it some pelleted dog food or cat food as well to make sure your roach gets enough protein in its diet.",
        "Start off by feeding your roach about 1/4 cup (50 grams) of mixed fruits, vegetables, and pelleted food.",
        "If your roach doesn’t finish all of this food, shift to smaller portions the next time you feed it.",
        "Remove any food that hasn’t been eaten after 24 hours.",
        "Be sure to wash any fruits and vegetables you feed your cockroach to remove any pesticides that may be on the skins.",
        "To give your roach a source of calcium, you can also put a cuttlefish bone, natural chalk, or crushed egg shells in the tank.",
        "Handle your cockroach gently to avoid causing harm to either of you.",
        "Pick up your cockroach around the thorax (the hard section with the bumps behind the head) and lift it very slowly.",
        "Don’t jerk the roach upwards, since it may cling to whatever surface it’s standing on out of fear.",
        "Don’t try to hold the roach down either; it has sharp spines on its leg that it may use to scratch you as a defense mechanism.",
        "The best way to handle your roach after picking it up is simply to let it wander around the surface of your hands.",
        "Don’t worry, your roach won’t bite!",
        "Wash your hands thoroughly after handling your roach.",
        "The bodies of Madagascar hissing cockroaches are unfortunately home to a number of mold species that could trigger allergies in people who touch them.",
        "Use soap and warm water to wash your hands for at least 20 seconds to make sure they’re fully clean.",
        "Some of the species of mold identified on hissing cockroaches can also cause infections if they enter the lungs or an open wound.",
        "This mold is also found in the roach’s fecal matter, so make sure to wash your hands after cleaning the habitat as well.",
        "Keeping Your Roach Habitat Clean Transfer your roach to a separate container before cleaning the habitat.",
        "Make sure this secondary container is ventilated but also secure.",
        "Remove the water bowl and any tubing you placed in the tank as well.",
        "To keep your roach comfortable, make the conditions in the secondary container as similar as possible to the conditions in its normal habitat.",
        "Aim for a container that is about the same size as your roach’s normal habitat.",
        "Replace the substrate in the tank at least once a week.",
        "The substrate absorbs a lot of the moisture that is constantly in the tank, so it needs to be replaced regularly to keep it from becoming too saturated.",
        "However, replace the substrate even earlier if you spy any mold in it.",
        "If the egg cartons and tubing in the tank look saturated or moldy, replace these as well when you go to swap out the substrate.",
        "Wash the entire tank with a diluted bleach solution once a month.",
        "Take the bowl, tubing, and all of the substrate out of the tank before you clean it.",
        "Rinse the entire tank with warm water, then use a sponge to scrub the inside of the habitat with a 3% bleach solution.",
        "You can make this type of cleaning solution at home by mixing bleach and water using a 1:32 ratio.",
        "Remove shed exoskeletons and dead roaches as they build up.",
        "Young hissing cockroaches will shed their exoskeletons a few times before they reach maturity, so you’ll need to be on the lookout for these shells if your cockroaches are relatively young.",
        "If you have multiple roaches in the same habitat, check for carcasses and old shells once a day and remove them as necessary."
    ]
}