{
    "title": "How to Dress a Turkey",
    "url": "https://www.wikihow.com/Dress-a-Turkey",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Poultry Recipes"
    ],
    "methods": [
        {
            "name": "Opening up the Turkey",
            "steps": [
                {
                    "headline": "Slip on a pair of disposable rubber gloves.",
                    "description": "No matter what kind of wild game you’re dressing in the field, it’s important to put on protective gloves before you cut it open. This will protect you from diseases and bacteria associated with raw meat. Additionally, have pre-moistened wipes on hand to clean the knife in between cuts and be sure to clean all of your tools thoroughly after dressing the turkey."
                },
                {
                    "headline": "Locate the turkey’s breastbone.",
                    "description": "Lay the bird on its back on the ground and feel along the center of its breast until you locate the breastbone. The breastbone will protrude significantly, so it’s easy to find! It will feel like a bony knob, sort of like a human elbow. You don’t need to pluck the feathers or do anything else first—this is a common misconception. The skin slips away from the meat easily while the feathers are still intact, so plucking the bird first is unnecessary to access the meat."
                },
                {
                    "headline": "Make a small incision over the breastbone to open the skin.",
                    "description": "Use a sharp knife to make a shallow incision right over the bone. You only want to cut into the skin, not the meat. It can help to let the turkey’s body get cold before you start dressing it. Warm bodies can be a bit tough."
                },
                {
                    "headline": "Continue the incision down to the base of the tail feathers.",
                    "description": "Move the knife from the breastbone down in between the legs, near the turkey’s tail. Keep the incision shallow and be careful not to nick any of the entrails as you go. Stay away from the stomach area by cutting along the breastbone as closely as possible. If it helps, imagine that the cut you’re making is like a zipper and “unzip” the skin from the breast to the tail."
                },
                {
                    "headline": "Make the incision bigger by cutting from the breastbone up to the beard.",
                    "description": "The beard is the fibrous skin right under the turkey’s neck. Keep opening the bird up to the neck, being very careful not to cut into the meat or organs as you work."
                },
                {
                    "headline": "Cut the skin away from the breast on both sides to open the bird up.",
                    "description": "Once the incision is made, cut along the outer crease of the skin on each side. Use your non-dominant hand to pull the skin away as you open the bird. That way, your view won’t be obstructed."
                }
            ]
        },
        {
            "name": "Filleting the Breast",
            "steps": [
                {
                    "headline": "Insert the knife on one side of the breast.",
                    "description": "Choose one side of the breast to start with and insert the knife as close to the breastbone as possible. Angle the knife toward the bone as you make the incision, which can help you avoid cutting into the meat."
                },
                {
                    "headline": "Cut along the breastbone to loosen that side of the breast.",
                    "description": "Let the knife run smoothly along the bone to loosen the breast meat from the bone, working from the rear of the breast forward. Stay as close to the bone as you can."
                },
                {
                    "headline": "Pull off the loosened side of the turkey's breast.",
                    "description": "Once you cut along the bone to loosen that side of the breast, pull the breast filet away from the body. You can use the knife to cut away any meat that continues to cling to the bone. After you pull the breast filet off, place it in a clean plastic freezer baggie."
                },
                {
                    "headline": "Insert the knife on the other side of the breast and remove the filet.",
                    "description": "Cut up along the bone on the other side the same way you did for the first breast, loosening the meat and pulling it away as you go. Once you have the meat separated from the bone, pull it away from the carcass. Place the second breast into a clean plastic freezer baggie."
                }
            ]
        },
        {
            "name": "Removing the Legs and Thighs",
            "steps": [
                {
                    "headline": "Flip the turkey over and cut through the thigh muscle to detach it.",
                    "description": "Flip the body over so that the back is facing you. Locate the thigh muscle by following the leg up to where it attaches on the body. After you cut the thigh muscle, pull the skin away to fully expose the leg and thigh meat."
                },
                {
                    "headline": "Grab the leg and pull up until you hear the socket pop.",
                    "description": "Once the skin is pulled away from the leg, grasp the leg firmly in your dominant hand. Pull up on the leg until the joint pops loose. The joint will make an audible popping sound and you’ll feel it loosen after it pops."
                },
                {
                    "headline": "Run the knife along the joint to loosen the meat from the bone.",
                    "description": "Following along the joint as closely as possible, use the knife to make incisions to loosen the meat. Keep going until the leg is dangling from the body."
                },
                {
                    "headline": "Pull the leg completely off the turkey’s body.",
                    "description": "Once the meat is loosened from the joint, you can just grab the leg and pull. The leg and thigh will detach from the body and come right off. Put the leg into a plastic freezer baggie. If any skin is clinging to the meat, just use your hands to pull it off."
                },
                {
                    "headline": "Repeat the process for the other leg and thigh.",
                    "description": "Cut the thigh muscle and pull until you hear the joint pop. Continue loosening the meat away from the bone and pull the second leg off the turkey carcass. Put the meat into another freezer baggie."
                },
                {
                    "headline": "Put the baggies on ice and transport the meat home.",
                    "description": "You should have a cooler filled with ice already with you in anticipation of this moment. Place the bagged meat into the cooler and close it. Keep it on ice as you transfer it home, then move the baggies into your freezer or prepare the meat to cook immediately. Leaving the carcass behind in the field is an option, as long as it's not illegal in your state. If you aren't sure, it's best to fill the cavity with ice and transport it home with the rest of the meat. You can dispose of it there."
                }
            ]
        }
    ],
    "tyn": [
        "Disposable gloves",
        "Pre-moistened wipes",
        "Sharp fillet knife",
        "Multiple plastic freezer baggies",
        "Ice",
        "Cooler"
    ],
    "text": " Opening up the Turkey Slip on a pair of disposable rubber gloves. No matter what kind of wild game you’re dressing in the field, it’s important to put on protective gloves before you cut it open. This will protect you from diseases and bacteria associated with raw meat. Additionally, have pre-moistened wipes on hand to clean the knife in between cuts and be sure to clean all of your tools thoroughly after dressing the turkey. Locate the turkey’s breastbone. Lay the bird on its back on the ground and feel along the center of its breast until you locate the breastbone. The breastbone will protrude significantly, so it’s easy to find! It will feel like a bony knob, sort of like a human elbow. You don’t need to pluck the feathers or do anything else first—this is a common misconception. The skin slips away from the meat easily while the feathers are still intact, so plucking the bird first is unnecessary to access the meat. Make a small incision over the breastbone to open the skin. Use a sharp knife to make a shallow incision right over the bone. You only want to cut into the skin, not the meat. It can help to let the turkey’s body get cold before you start dressing it. Warm bodies can be a bit tough. Continue the incision down to the base of the tail feathers. Move the knife from the breastbone down in between the legs, near the turkey’s tail. Keep the incision shallow and be careful not to nick any of the entrails as you go. Stay away from the stomach area by cutting along the breastbone as closely as possible. If it helps, imagine that the cut you’re making is like a zipper and “unzip” the skin from the breast to the tail. Make the incision bigger by cutting from the breastbone up to the beard. The beard is the fibrous skin right under the turkey’s neck. Keep opening the bird up to the neck, being very careful not to cut into the meat or organs as you work. Cut the skin away from the breast on both sides to open the bird up. Once the incision is made, cut along the outer crease of the skin on each side. Use your non-dominant hand to pull the skin away as you open the bird. That way, your view won’t be obstructed. Filleting the Breast Insert the knife on one side of the breast. Choose one side of the breast to start with and insert the knife as close to the breastbone as possible. Angle the knife toward the bone as you make the incision, which can help you avoid cutting into the meat. Cut along the breastbone to loosen that side of the breast. Let the knife run smoothly along the bone to loosen the breast meat from the bone, working from the rear of the breast forward. Stay as close to the bone as you can. Pull off the loosened side of the turkey's breast. Once you cut along the bone to loosen that side of the breast, pull the breast filet away from the body. You can use the knife to cut away any meat that continues to cling to the bone. After you pull the breast filet off, place it in a clean plastic freezer baggie. Insert the knife on the other side of the breast and remove the filet. Cut up along the bone on the other side the same way you did for the first breast, loosening the meat and pulling it away as you go. Once you have the meat separated from the bone, pull it away from the carcass. Place the second breast into a clean plastic freezer baggie. Removing the Legs and Thighs Flip the turkey over and cut through the thigh muscle to detach it. Flip the body over so that the back is facing you. Locate the thigh muscle by following the leg up to where it attaches on the body. After you cut the thigh muscle, pull the skin away to fully expose the leg and thigh meat. Grab the leg and pull up until you hear the socket pop. Once the skin is pulled away from the leg, grasp the leg firmly in your dominant hand. Pull up on the leg until the joint pops loose. The joint will make an audible popping sound and you’ll feel it loosen after it pops. Run the knife along the joint to loosen the meat from the bone. Following along the joint as closely as possible, use the knife to make incisions to loosen the meat. Keep going until the leg is dangling from the body. Pull the leg completely off the turkey’s body. Once the meat is loosened from the joint, you can just grab the leg and pull. The leg and thigh will detach from the body and come right off. Put the leg into a plastic freezer baggie. If any skin is clinging to the meat, just use your hands to pull it off. Repeat the process for the other leg and thigh. Cut the thigh muscle and pull until you hear the joint pop. Continue loosening the meat away from the bone and pull the second leg off the turkey carcass. Put the meat into another freezer baggie. Put the baggies on ice and transport the meat home. You should have a cooler filled with ice already with you in anticipation of this moment. Place the bagged meat into the cooler and close it. Keep it on ice as you transfer it home, then move the baggies into your freezer or prepare the meat to cook immediately. Leaving the carcass behind in the field is an option, as long as it's not illegal in your state. If you aren't sure, it's best to fill the cavity with ice and transport it home with the rest of the meat. You can dispose of it there.",
    "sentences": [
        " Opening up the Turkey Slip on a pair of disposable rubber gloves.",
        "No matter what kind of wild game you’re dressing in the field, it’s important to put on protective gloves before you cut it open.",
        "This will protect you from diseases and bacteria associated with raw meat.",
        "Additionally, have pre-moistened wipes on hand to clean the knife in between cuts and be sure to clean all of your tools thoroughly after dressing the turkey.",
        "Locate the turkey’s breastbone.",
        "Lay the bird on its back on the ground and feel along the center of its breast until you locate the breastbone.",
        "The breastbone will protrude significantly, so it’s easy to find!",
        "It will feel like a bony knob, sort of like a human elbow.",
        "You don’t need to pluck the feathers or do anything else first—this is a common misconception.",
        "The skin slips away from the meat easily while the feathers are still intact, so plucking the bird first is unnecessary to access the meat.",
        "Make a small incision over the breastbone to open the skin.",
        "Use a sharp knife to make a shallow incision right over the bone.",
        "You only want to cut into the skin, not the meat.",
        "It can help to let the turkey’s body get cold before you start dressing it.",
        "Warm bodies can be a bit tough.",
        "Continue the incision down to the base of the tail feathers.",
        "Move the knife from the breastbone down in between the legs, near the turkey’s tail.",
        "Keep the incision shallow and be careful not to nick any of the entrails as you go.",
        "Stay away from the stomach area by cutting along the breastbone as closely as possible.",
        "If it helps, imagine that the cut you’re making is like a zipper and “unzip” the skin from the breast to the tail.",
        "Make the incision bigger by cutting from the breastbone up to the beard.",
        "The beard is the fibrous skin right under the turkey’s neck.",
        "Keep opening the bird up to the neck, being very careful not to cut into the meat or organs as you work.",
        "Cut the skin away from the breast on both sides to open the bird up.",
        "Once the incision is made, cut along the outer crease of the skin on each side.",
        "Use your non-dominant hand to pull the skin away as you open the bird.",
        "That way, your view won’t be obstructed.",
        "Filleting the Breast Insert the knife on one side of the breast.",
        "Choose one side of the breast to start with and insert the knife as close to the breastbone as possible.",
        "Angle the knife toward the bone as you make the incision, which can help you avoid cutting into the meat.",
        "Cut along the breastbone to loosen that side of the breast.",
        "Let the knife run smoothly along the bone to loosen the breast meat from the bone, working from the rear of the breast forward.",
        "Stay as close to the bone as you can.",
        "Pull off the loosened side of the turkey's breast.",
        "Once you cut along the bone to loosen that side of the breast, pull the breast filet away from the body.",
        "You can use the knife to cut away any meat that continues to cling to the bone.",
        "After you pull the breast filet off, place it in a clean plastic freezer baggie.",
        "Insert the knife on the other side of the breast and remove the filet.",
        "Cut up along the bone on the other side the same way you did for the first breast, loosening the meat and pulling it away as you go.",
        "Once you have the meat separated from the bone, pull it away from the carcass.",
        "Place the second breast into a clean plastic freezer baggie.",
        "Removing the Legs and Thighs Flip the turkey over and cut through the thigh muscle to detach it.",
        "Flip the body over so that the back is facing you.",
        "Locate the thigh muscle by following the leg up to where it attaches on the body.",
        "After you cut the thigh muscle, pull the skin away to fully expose the leg and thigh meat.",
        "Grab the leg and pull up until you hear the socket pop.",
        "Once the skin is pulled away from the leg, grasp the leg firmly in your dominant hand.",
        "Pull up on the leg until the joint pops loose.",
        "The joint will make an audible popping sound and you’ll feel it loosen after it pops.",
        "Run the knife along the joint to loosen the meat from the bone.",
        "Following along the joint as closely as possible, use the knife to make incisions to loosen the meat.",
        "Keep going until the leg is dangling from the body.",
        "Pull the leg completely off the turkey’s body.",
        "Once the meat is loosened from the joint, you can just grab the leg and pull.",
        "The leg and thigh will detach from the body and come right off.",
        "Put the leg into a plastic freezer baggie.",
        "If any skin is clinging to the meat, just use your hands to pull it off.",
        "Repeat the process for the other leg and thigh.",
        "Cut the thigh muscle and pull until you hear the joint pop.",
        "Continue loosening the meat away from the bone and pull the second leg off the turkey carcass.",
        "Put the meat into another freezer baggie.",
        "Put the baggies on ice and transport the meat home.",
        "You should have a cooler filled with ice already with you in anticipation of this moment.",
        "Place the bagged meat into the cooler and close it.",
        "Keep it on ice as you transfer it home, then move the baggies into your freezer or prepare the meat to cook immediately.",
        "Leaving the carcass behind in the field is an option, as long as it's not illegal in your state.",
        "If you aren't sure, it's best to fill the cavity with ice and transport it home with the rest of the meat.",
        "You can dispose of it there."
    ]
}