{
    "title": "How to Drive in the Snow",
    "url": "https://www.wikihow.com/Drive-in-the-Snow",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Driving Vehicles",
        "Defensive Driving Skills",
        "Driving in Winter"
    ],
    "methods": [
        {
            "name": "Driving and Operating Your Vehicle in Snow",
            "steps": [
                {
                    "headline": "Prepare your vehicle for driving.",
                    "description": "Clear the windshield, side windows, headlights, and rear brake lights of all snow and ice with an ice scraper and brush before you drive off. Stop the car and clear the windows and lights as needed while driving during snowfall. Don't forget to clear snow off of your number plate, as it is a legal requirement for your number plate to be visible in many places."
                },
                {
                    "headline": "Turn on the front and rear defroster to keep windows clear while you drive.",
                    "description": "Turn the air conditioning on and set it to the fresh air option to keep the inside window clear of condensation."
                },
                {
                    "headline": "Turn on your headlights at all times as you drive.",
                    "description": "This means you have to have your headlights on when driving during daylight hours too. This makes your vehicle more visible to other motorists whilst it's still snowing."
                },
                {
                    "headline": "Drive slowly while the roads are covered in snow or ice.",
                    "description": "Drive using the lower gears in a car with a manual gearbox to increase your traction on the road. Do not use the cruise control option and do not attempt to overtake other vehicles. Vehicles need traction in order for the brakes to work properly, which is why slower speeds, gentler turns, and stops are necessary to make traction remain possible. Reduce the vehicle’s speed so that you are going below the speed limit, remember it is NOT a target to aim for. Be extremely cautious of how much traction your tires can achieve against the road as you drive."
                },
                {
                    "headline": "Keep the appropriate intervals in between your car and the car ahead of you.",
                    "description": "Leave at least 2 to 3 car lengths between your car and the one ahead of you. This is the most effective way to deter common rear-end accidents. This will give you enough room to stop and lower the risk of sliding into the car in front of you when driving at a slow speed. Driving at a speed over 25 mph (40 km/h) may require leaving more space between the vehicles."
                },
                {
                    "headline": "Avoid making sudden movements while you drive.",
                    "description": "When you stop, don’t jerk the steering wheel. Instead, touch your brakes gently. Don’t lock brakes on ice either because it might result in losing control and steering of your vehicle. Accelerate more gradually than you’re accustomed to. Don’t rev up to the speed limit like you’re used to when the roads are clear, get up to that speed slowly but gradually. Decelerate more gradually than you’re accustomed to. Anticipate your stops before you actually make them. Slow down to stop at a much slower rate than usual."
                }
            ]
        },
        {
            "name": "Avoiding Potential Accidents",
            "steps": [
                {
                    "headline": "Watch out for potential road dangers.",
                    "description": "Be on the lookout for slippery spots that might be on the road. Ice is common on bridges, even when the rest of the road may be clear, so approach bridges and shaded areas with the proper caution."
                },
                {
                    "headline": "Do not push the accelerator and spin the car tires when stuck in a snow-filled area.",
                    "description": "Dig loose snow out from under the tires and pour sand or cat litter under the tires to create traction. Gently rock the car to help the tires make contact with the ground, if possible."
                },
                {
                    "headline": "Recover from the rear end of your car beginning to skid.",
                    "description": "If you notice despite the distance and precautions of safe winter driving that the rear end of your car is starting to skid, you have to avoid the hazard as gently as possible. Remove your foot from the accelerator if the rear end of the car begins to skid while driving on snow or ice. Steer into the skid to stop skidding. So if you're skidding right, steer to the right."
                },
                {
                    "headline": "Recover from the front end of your car starting to skid.",
                    "description": "Remove your foot from the accelerator if the front end of the car begins to skid. Do not brake whilst skidding. Turn the steering wheel in the direction you want the car to turn. Shift the car into neutral if driving a manual transmission."
                },
                {
                    "headline": "Push the brake pedal gently when you need to stop.",
                    "description": "If you can avoid stopping altogether, that’d be even better. Gradually slow down your car almost to a complete stop when you are approaching a red light. It might turn green without you even having to stop at all if you time it right. If you see multiple cars stopped in front of you, start braking several stopping distances away to avoid colliding into another vehicle accidentally. If you notice that your tires have locked up, take your foot off of the brakes completely."
                }
            ]
        },
        {
            "name": "Preparing Your Vehicle Before the Snow Starts",
            "steps": [
                {
                    "headline": "Check your tire pressure.",
                    "description": "When temperatures drop, your tire pressure drops in response. Check to see if the air pressure in your tires need to be topped up, especially in cold climates of 30 degrees and below."
                },
                {
                    "headline": "Check your actual tires.",
                    "description": "Traction is always important when operating a vehicle, but becomes even more important to cars in snowy weather. Inspect your tire threads thoroughly to gauge their efficiency. Use a penny to help you determine the depth of your tires’ treads. Insert a penny with its head toward the tire tread into the groove. If the back of the penny is covered, your tire tread is in the clear. If you can see the entire back of the coin, it’s time to replace tires. Additional signs that you should consider buying new tires include nicks and holes, uneven wear, and bulging sidewalls on the tires."
                },
                {
                    "headline": "Swap your regular tires for snow tires if you have any.",
                    "description": "Snow tires are better than regular tires because they are made with special materials that stay soft to provide tires with maximum traction in below-freezing temperatures. They also have tread patterns that grip roads covered in snow and ice. Install winter tires in sets of fours to maintain the traction, safety, and control of your vehicle. If, or when the weather gets warmer; it is important to swap the tires for your regular tires. Carry a set of snow chains for your vehicle while you travel. Although it might not be necessary to install them on a car that has snow tires installed on it, having snow chains are a requirement when passing certain roads throughout the winter season."
                },
                {
                    "headline": "Replace windshield wiper blades.",
                    "description": "Inspect the blades of your wipers ahead of wintertime to ensure that your wipers will have a quick response to whatever may potentially obstruct your vision while you drive. If your blades don’t sweep across the windshield cleanly or are cracked, replace them immediately. Also make sure that your windshield defroster is up to scratch. Replacing your blades will be an insufficient move if your defroster isn’t in working order."
                },
                {
                    "headline": "Inspect your coolant system.",
                    "description": "Make sure the fluid levels in your radiator are adequate. Confirm that you have the proper coolant in the car’s system. Check to see that all of the hoses are in good working condition and do not have any obvious indications of wear."
                },
                {
                    "headline": "Assess the condition of your battery.",
                    "description": "Cold weather can deplete an older battery at a much faster rate. Look at the top of the battery for the installation date. If the date on the battery is older than two or three years, think about purchasing a new one before winter begins. Remove any signs of whitish powder that might have gathered on the terminal connections. Clean away the buildup with equal parts baking soda and warm water solution."
                },
                {
                    "headline": "Arrange a servicing for your vehicle.",
                    "description": "Ensure that your engine is performing at optimal performance level by having a mechanic or auto service. If you’re good with cars, feel free to conduct your own inspection at home. However, do seek professional help if you don't know what you're doing."
                },
                {
                    "headline": "Fit your car with snow chains.",
                    "description": "Place the snow chain over the tire, holding it at the top and letting it fall evenly over the front of the tire and wheel. Once the chain is evenly and securely placed on the three-quarters of the wheel not touching the road, place the snow chains onto the rest of the tires. When the snow chains are on three-quarters of all of the tires, get into your car and drive forward for less than a metre. This will expose the part of the tire that was touching the ground previously. Put on the handbrake, get out of the car, and finish securing the remaining chains to the rest of the wheel. Use a closer link to tighten the chains where they close. Adding snow chains to your vehicle might be necessary for drivers in some areas, but often times if you have snow tires installed; you can save yourself a little trouble and not have to bother using snow chains at all."
                }
            ]
        }
    ],
    "tyn": [
        "Ice scraper with brush",
        "Can of de-icer",
        "Bag of sand or cat litter",
        "Woolly blanket",
        "Hat",
        "Gloves",
        "Boots",
        "Spade",
        "Snow tires and/or snow chains",
        "Torch",
        "Non-perishable food",
        "Luminous jacket",
        "Red warning triangles",
        "Bottle of drinking water"
    ],
    "text": " Driving and Operating Your Vehicle in Snow Prepare your vehicle for driving. Clear the windshield, side windows, headlights, and rear brake lights of all snow and ice with an ice scraper and brush before you drive off. Stop the car and clear the windows and lights as needed while driving during snowfall. Don't forget to clear snow off of your number plate, as it is a legal requirement for your number plate to be visible in many places. Turn on the front and rear defroster to keep windows clear while you drive. Turn the air conditioning on and set it to the fresh air option to keep the inside window clear of condensation. Turn on your headlights at all times as you drive. This means you have to have your headlights on when driving during daylight hours too. This makes your vehicle more visible to other motorists whilst it's still snowing. Drive slowly while the roads are covered in snow or ice. Drive using the lower gears in a car with a manual gearbox to increase your traction on the road. Do not use the cruise control option and do not attempt to overtake other vehicles. Vehicles need traction in order for the brakes to work properly, which is why slower speeds, gentler turns, and stops are necessary to make traction remain possible. Reduce the vehicle’s speed so that you are going below the speed limit, remember it is NOT a target to aim for. Be extremely cautious of how much traction your tires can achieve against the road as you drive. Keep the appropriate intervals in between your car and the car ahead of you. Leave at least 2 to 3 car lengths between your car and the one ahead of you. This is the most effective way to deter common rear-end accidents. This will give you enough room to stop and lower the risk of sliding into the car in front of you when driving at a slow speed. Driving at a speed over 25 mph (40 km/h) may require leaving more space between the vehicles. Avoid making sudden movements while you drive. When you stop, don’t jerk the steering wheel. Instead, touch your brakes gently. Don’t lock brakes on ice either because it might result in losing control and steering of your vehicle. Accelerate more gradually than you’re accustomed to. Don’t rev up to the speed limit like you’re used to when the roads are clear, get up to that speed slowly but gradually. Decelerate more gradually than you’re accustomed to. Anticipate your stops before you actually make them. Slow down to stop at a much slower rate than usual. Avoiding Potential Accidents Watch out for potential road dangers. Be on the lookout for slippery spots that might be on the road. Ice is common on bridges, even when the rest of the road may be clear, so approach bridges and shaded areas with the proper caution. Do not push the accelerator and spin the car tires when stuck in a snow-filled area. Dig loose snow out from under the tires and pour sand or cat litter under the tires to create traction. Gently rock the car to help the tires make contact with the ground, if possible. Recover from the rear end of your car beginning to skid. If you notice despite the distance and precautions of safe winter driving that the rear end of your car is starting to skid, you have to avoid the hazard as gently as possible. Remove your foot from the accelerator if the rear end of the car begins to skid while driving on snow or ice. Steer into the skid to stop skidding. So if you're skidding right, steer to the right. Recover from the front end of your car starting to skid. Remove your foot from the accelerator if the front end of the car begins to skid. Do not brake whilst skidding. Turn the steering wheel in the direction you want the car to turn. Shift the car into neutral if driving a manual transmission. Push the brake pedal gently when you need to stop. If you can avoid stopping altogether, that’d be even better. Gradually slow down your car almost to a complete stop when you are approaching a red light. It might turn green without you even having to stop at all if you time it right. If you see multiple cars stopped in front of you, start braking several stopping distances away to avoid colliding into another vehicle accidentally. If you notice that your tires have locked up, take your foot off of the brakes completely. Preparing Your Vehicle Before the Snow Starts Check your tire pressure. When temperatures drop, your tire pressure drops in response. Check to see if the air pressure in your tires need to be topped up, especially in cold climates of 30 degrees and below. Check your actual tires. Traction is always important when operating a vehicle, but becomes even more important to cars in snowy weather. Inspect your tire threads thoroughly to gauge their efficiency. Use a penny to help you determine the depth of your tires’ treads. Insert a penny with its head toward the tire tread into the groove. If the back of the penny is covered, your tire tread is in the clear. If you can see the entire back of the coin, it’s time to replace tires. Additional signs that you should consider buying new tires include nicks and holes, uneven wear, and bulging sidewalls on the tires. Swap your regular tires for snow tires if you have any. Snow tires are better than regular tires because they are made with special materials that stay soft to provide tires with maximum traction in below-freezing temperatures. They also have tread patterns that grip roads covered in snow and ice. Install winter tires in sets of fours to maintain the traction, safety, and control of your vehicle. If, or when the weather gets warmer; it is important to swap the tires for your regular tires. Carry a set of snow chains for your vehicle while you travel. Although it might not be necessary to install them on a car that has snow tires installed on it, having snow chains are a requirement when passing certain roads throughout the winter season. Replace windshield wiper blades. Inspect the blades of your wipers ahead of wintertime to ensure that your wipers will have a quick response to whatever may potentially obstruct your vision while you drive. If your blades don’t sweep across the windshield cleanly or are cracked, replace them immediately. Also make sure that your windshield defroster is up to scratch. Replacing your blades will be an insufficient move if your defroster isn’t in working order. Inspect your coolant system. Make sure the fluid levels in your radiator are adequate. Confirm that you have the proper coolant in the car’s system. Check to see that all of the hoses are in good working condition and do not have any obvious indications of wear. Assess the condition of your battery. Cold weather can deplete an older battery at a much faster rate. Look at the top of the battery for the installation date. If the date on the battery is older than two or three years, think about purchasing a new one before winter begins. Remove any signs of whitish powder that might have gathered on the terminal connections. Clean away the buildup with equal parts baking soda and warm water solution. Arrange a servicing for your vehicle. Ensure that your engine is performing at optimal performance level by having a mechanic or auto service. If you’re good with cars, feel free to conduct your own inspection at home. However, do seek professional help if you don't know what you're doing. Fit your car with snow chains. Place the snow chain over the tire, holding it at the top and letting it fall evenly over the front of the tire and wheel. Once the chain is evenly and securely placed on the three-quarters of the wheel not touching the road, place the snow chains onto the rest of the tires. When the snow chains are on three-quarters of all of the tires, get into your car and drive forward for less than a metre. This will expose the part of the tire that was touching the ground previously. Put on the handbrake, get out of the car, and finish securing the remaining chains to the rest of the wheel. Use a closer link to tighten the chains where they close. Adding snow chains to your vehicle might be necessary for drivers in some areas, but often times if you have snow tires installed; you can save yourself a little trouble and not have to bother using snow chains at all.",
    "sentences": [
        " Driving and Operating Your Vehicle in Snow Prepare your vehicle for driving.",
        "Clear the windshield, side windows, headlights, and rear brake lights of all snow and ice with an ice scraper and brush before you drive off.",
        "Stop the car and clear the windows and lights as needed while driving during snowfall.",
        "Don't forget to clear snow off of your number plate, as it is a legal requirement for your number plate to be visible in many places.",
        "Turn on the front and rear defroster to keep windows clear while you drive.",
        "Turn the air conditioning on and set it to the fresh air option to keep the inside window clear of condensation.",
        "Turn on your headlights at all times as you drive.",
        "This means you have to have your headlights on when driving during daylight hours too.",
        "This makes your vehicle more visible to other motorists whilst it's still snowing.",
        "Drive slowly while the roads are covered in snow or ice.",
        "Drive using the lower gears in a car with a manual gearbox to increase your traction on the road.",
        "Do not use the cruise control option and do not attempt to overtake other vehicles.",
        "Vehicles need traction in order for the brakes to work properly, which is why slower speeds, gentler turns, and stops are necessary to make traction remain possible.",
        "Reduce the vehicle’s speed so that you are going below the speed limit, remember it is NOT a target to aim for.",
        "Be extremely cautious of how much traction your tires can achieve against the road as you drive.",
        "Keep the appropriate intervals in between your car and the car ahead of you.",
        "Leave at least 2 to 3 car lengths between your car and the one ahead of you.",
        "This is the most effective way to deter common rear-end accidents.",
        "This will give you enough room to stop and lower the risk of sliding into the car in front of you when driving at a slow speed.",
        "Driving at a speed over 25 mph (40 km/h) may require leaving more space between the vehicles.",
        "Avoid making sudden movements while you drive.",
        "When you stop, don’t jerk the steering wheel.",
        "Instead, touch your brakes gently.",
        "Don’t lock brakes on ice either because it might result in losing control and steering of your vehicle.",
        "Accelerate more gradually than you’re accustomed to.",
        "Don’t rev up to the speed limit like you’re used to when the roads are clear, get up to that speed slowly but gradually.",
        "Decelerate more gradually than you’re accustomed to.",
        "Anticipate your stops before you actually make them.",
        "Slow down to stop at a much slower rate than usual.",
        "Avoiding Potential Accidents Watch out for potential road dangers.",
        "Be on the lookout for slippery spots that might be on the road.",
        "Ice is common on bridges, even when the rest of the road may be clear, so approach bridges and shaded areas with the proper caution.",
        "Do not push the accelerator and spin the car tires when stuck in a snow-filled area.",
        "Dig loose snow out from under the tires and pour sand or cat litter under the tires to create traction.",
        "Gently rock the car to help the tires make contact with the ground, if possible.",
        "Recover from the rear end of your car beginning to skid.",
        "If you notice despite the distance and precautions of safe winter driving that the rear end of your car is starting to skid, you have to avoid the hazard as gently as possible.",
        "Remove your foot from the accelerator if the rear end of the car begins to skid while driving on snow or ice.",
        "Steer into the skid to stop skidding.",
        "So if you're skidding right, steer to the right.",
        "Recover from the front end of your car starting to skid.",
        "Remove your foot from the accelerator if the front end of the car begins to skid.",
        "Do not brake whilst skidding.",
        "Turn the steering wheel in the direction you want the car to turn.",
        "Shift the car into neutral if driving a manual transmission.",
        "Push the brake pedal gently when you need to stop.",
        "If you can avoid stopping altogether, that’d be even better.",
        "Gradually slow down your car almost to a complete stop when you are approaching a red light.",
        "It might turn green without you even having to stop at all if you time it right.",
        "If you see multiple cars stopped in front of you, start braking several stopping distances away to avoid colliding into another vehicle accidentally.",
        "If you notice that your tires have locked up, take your foot off of the brakes completely.",
        "Preparing Your Vehicle Before the Snow Starts Check your tire pressure.",
        "When temperatures drop, your tire pressure drops in response.",
        "Check to see if the air pressure in your tires need to be topped up, especially in cold climates of 30 degrees and below.",
        "Check your actual tires.",
        "Traction is always important when operating a vehicle, but becomes even more important to cars in snowy weather.",
        "Inspect your tire threads thoroughly to gauge their efficiency.",
        "Use a penny to help you determine the depth of your tires’ treads.",
        "Insert a penny with its head toward the tire tread into the groove.",
        "If the back of the penny is covered, your tire tread is in the clear.",
        "If you can see the entire back of the coin, it’s time to replace tires.",
        "Additional signs that you should consider buying new tires include nicks and holes, uneven wear, and bulging sidewalls on the tires.",
        "Swap your regular tires for snow tires if you have any.",
        "Snow tires are better than regular tires because they are made with special materials that stay soft to provide tires with maximum traction in below-freezing temperatures.",
        "They also have tread patterns that grip roads covered in snow and ice.",
        "Install winter tires in sets of fours to maintain the traction, safety, and control of your vehicle.",
        "If, or when the weather gets warmer; it is important to swap the tires for your regular tires.",
        "Carry a set of snow chains for your vehicle while you travel.",
        "Although it might not be necessary to install them on a car that has snow tires installed on it, having snow chains are a requirement when passing certain roads throughout the winter season.",
        "Replace windshield wiper blades.",
        "Inspect the blades of your wipers ahead of wintertime to ensure that your wipers will have a quick response to whatever may potentially obstruct your vision while you drive.",
        "If your blades don’t sweep across the windshield cleanly or are cracked, replace them immediately.",
        "Also make sure that your windshield defroster is up to scratch.",
        "Replacing your blades will be an insufficient move if your defroster isn’t in working order.",
        "Inspect your coolant system.",
        "Make sure the fluid levels in your radiator are adequate.",
        "Confirm that you have the proper coolant in the car’s system.",
        "Check to see that all of the hoses are in good working condition and do not have any obvious indications of wear.",
        "Assess the condition of your battery.",
        "Cold weather can deplete an older battery at a much faster rate.",
        "Look at the top of the battery for the installation date.",
        "If the date on the battery is older than two or three years, think about purchasing a new one before winter begins.",
        "Remove any signs of whitish powder that might have gathered on the terminal connections.",
        "Clean away the buildup with equal parts baking soda and warm water solution.",
        "Arrange a servicing for your vehicle.",
        "Ensure that your engine is performing at optimal performance level by having a mechanic or auto service.",
        "If you’re good with cars, feel free to conduct your own inspection at home.",
        "However, do seek professional help if you don't know what you're doing.",
        "Fit your car with snow chains.",
        "Place the snow chain over the tire, holding it at the top and letting it fall evenly over the front of the tire and wheel.",
        "Once the chain is evenly and securely placed on the three-quarters of the wheel not touching the road, place the snow chains onto the rest of the tires.",
        "When the snow chains are on three-quarters of all of the tires, get into your car and drive forward for less than a metre.",
        "This will expose the part of the tire that was touching the ground previously.",
        "Put on the handbrake, get out of the car, and finish securing the remaining chains to the rest of the wheel.",
        "Use a closer link to tighten the chains where they close.",
        "Adding snow chains to your vehicle might be necessary for drivers in some areas, but often times if you have snow tires installed; you can save yourself a little trouble and not have to bother using snow chains at all."
    ]
}