{
    "title": "How to Plant Garlic in the Fall",
    "url": "https://www.wikihow.com/Plant-Garlic-in-the-Fall",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Planting and Growing",
        "Growing Herbs and Spices"
    ],
    "parts": [
        {
            "name": "Preparing the Soil",
            "steps": [
                {
                    "headline": "Find a well-lit bed of soil where you can plant your garlic.",
                    "description": "While you don't have to live on a farm to plant your own garlic, you will need a designated space for the cloves to grow. Find an area of loose soil to use when planting your garlic cloves. If you do not have space to grow garlic outside, you should be able to find soil, planting containers, and other garden supplies at any store that sells gardening tools (i.e, Walmart, Lowes)."
                },
                {
                    "headline": "Pull out all weeds from the soil.",
                    "description": "Weeds will steal valuable nutrients from the growing garlic, which may have a negative effect on the crop's quality. Adding mulch later on will help to keep any weeds from growing around the garlic plants."
                },
                {
                    "headline": "Apply a layer of compost to the soil.",
                    "description": "Composting involves taking natural materials and reusing them as a source of nutrients for soil. Save any organic trash to use for your compost layer (i.e, coffee grounds, eggshells, teabags). Use a scoop to evenly spread the compost into the soil. It does not matter how much compost you use, as long as it is evenly spread throughout the soil. There are free tools online that can help you figure out how much compost you should use given the size of your garden. You can use a large bucket to compile your compost. Any fluid that comes from the composting process is referred to as tea."
                },
                {
                    "headline": "Add slow-growing fertilizer to the soil bed.",
                    "description": "You want to add 2 tablespoons of fertilizer to each spot where you plan to plant a garlic clove, as this will provide your garlic with nourishment. Since the garlic is planted before winter, you don't want your plants to be sprouting in the middle of December. Don't worry about not using enough fertilizer. In the warmer spring months, you will have plenty of time to give your garlic plants more."
                }
            ]
        },
        {
            "name": "Planting the Clove",
            "steps": [
                {
                    "headline": "Assemble individual garlic cloves for planting.",
                    "description": "Unlike other common fruits and vegetables, garlic does not have a traditional seed. Instead, you will plant a garlic clove. Remove the outer layer of skin from a normal garlic plant to reveal the cloves inside. Don't remove the skin from any of the small cloves. Determine if you are planting softneck or hardneck garlic cloves. While similar, these two types of garlic have distinct differences between clove quantity and overall storage time. Planting larger cloves is likely to yield a larger garlic plant. Buy your garlic cloves from a plant nursery or seed company to ensure that the cloves are compatible with the soil in your area."
                },
                {
                    "headline": "Wait for the first autumn frost to occur.",
                    "description": "Unlike other plants, garlic requires a cold temperature in order to grow properly. Planting your garlic in the fall will allow your plants to get cold naturally. If you live in a colder region, you should wait up to 3 weeks after the first fall frost before planting your garlic."
                },
                {
                    "headline": "Plant the cloves at least 4 inches (10 cm) apart in the soil bed.",
                    "description": "You will want to ensure that your garlic has plenty of room to grow by placing each clove at least 4 inches (10 cm)  apart. The rows of garlic should be at least 8 inches (20 cm) apart. If you are planting hardneck cloves, make sure that they are planted in an upright position. Softneck cloves can be planted with more flexibility."
                },
                {
                    "headline": "Cover the cloves with 2 inches (5.1 cm) of soil.",
                    "description": "Garlic does not need to be planted deeply, so you only need to push about 2 inches (5.1 cm) into the soil to plant the clove. Depending on how wet your soil is, you can place your cloves closer to the surface and put 2 inches (5.1 cm) of soil on top of them."
                },
                {
                    "headline": "Monitor the soil's moisture levels and water it when necessary.",
                    "description": "Every few days, touch the soil with your figures to make that it's not dry. Garlic plants do not need to be watered unless the weather is abnormally dry. Only add water to the plants as needed. It's normal to see small sprouts appearing from the garlic before the winter season. This won't affect their quality when it comes time to harvest."
                }
            ]
        },
        {
            "name": "Adding the Mulch",
            "steps": [
                {
                    "headline": "Create mulch from leftover leaves and grass in your yard.",
                    "description": "Since the garlic plants will be in the ground for the entirety of the winter, you will want to insulate them with a layer of mulch. You can use dead leaves and cut grass to create your own mulch, or you can purchase it from any store that sells gardening supplies. You can also use a wood chipper to create your own mulch."
                },
                {
                    "headline": "Place a layer of mulch over the fertilized soil.",
                    "description": "Once you have enough mulch, begin layering it on top of the soil. Ideally, the mulch layer should be at least 4 inches (10 cm) deep, especially if you live in a colder area."
                },
                {
                    "headline": "Put a layer of straw on top to insulate the mulch.",
                    "description": "Adding a layer of straw on top of the mulch will provide your garlic plants with extra protection from the cold winter weather. You can use less straw if you live in a warmer area. Remove any excess shoots that begin to appear in the spring, as they decrease the size of your harvested garlic."
                },
                {
                    "headline": "Wait to harvest the garlic.",
                    "description": "While the planting process stretches over fall and winter, you will not be harvesting your garlic plants until at least June. Dig up a single plant and to physically examine it before harvesting the rest of the crop. Ripe garlic will have prominent cloves sticking out and will be covered in a layer of skin. Don't use too much force when you go to harvest the garlic."
                }
            ]
        }
    ],
    "tyn": [
        "Soil",
        "Compost",
        "Slow-growth fertilizer",
        "Garlic cloves",
        "Mulch",
        "Straw"
    ],
    "text": " Preparing the Soil Find a well-lit bed of soil where you can plant your garlic. While you don't have to live on a farm to plant your own garlic, you will need a designated space for the cloves to grow. Find an area of loose soil to use when planting your garlic cloves. If you do not have space to grow garlic outside, you should be able to find soil, planting containers, and other garden supplies at any store that sells gardening tools (i.e, Walmart, Lowes). Pull out all weeds from the soil. Weeds will steal valuable nutrients from the growing garlic, which may have a negative effect on the crop's quality. Adding mulch later on will help to keep any weeds from growing around the garlic plants. Apply a layer of compost to the soil. Composting involves taking natural materials and reusing them as a source of nutrients for soil. Save any organic trash to use for your compost layer (i.e, coffee grounds, eggshells, teabags). Use a scoop to evenly spread the compost into the soil. It does not matter how much compost you use, as long as it is evenly spread throughout the soil. There are free tools online that can help you figure out how much compost you should use given the size of your garden. You can use a large bucket to compile your compost. Any fluid that comes from the composting process is referred to as tea. Add slow-growing fertilizer to the soil bed. You want to add 2 tablespoons of fertilizer to each spot where you plan to plant a garlic clove, as this will provide your garlic with nourishment. Since the garlic is planted before winter, you don't want your plants to be sprouting in the middle of December. Don't worry about not using enough fertilizer. In the warmer spring months, you will have plenty of time to give your garlic plants more. Planting the Clove Assemble individual garlic cloves for planting. Unlike other common fruits and vegetables, garlic does not have a traditional seed. Instead, you will plant a garlic clove. Remove the outer layer of skin from a normal garlic plant to reveal the cloves inside. Don't remove the skin from any of the small cloves. Determine if you are planting softneck or hardneck garlic cloves. While similar, these two types of garlic have distinct differences between clove quantity and overall storage time. Planting larger cloves is likely to yield a larger garlic plant. Buy your garlic cloves from a plant nursery or seed company to ensure that the cloves are compatible with the soil in your area. Wait for the first autumn frost to occur. Unlike other plants, garlic requires a cold temperature in order to grow properly. Planting your garlic in the fall will allow your plants to get cold naturally. If you live in a colder region, you should wait up to 3 weeks after the first fall frost before planting your garlic. Plant the cloves at least 4 inches (10 cm) apart in the soil bed. You will want to ensure that your garlic has plenty of room to grow by placing each clove at least 4 inches (10 cm)  apart. The rows of garlic should be at least 8 inches (20 cm) apart. If you are planting hardneck cloves, make sure that they are planted in an upright position. Softneck cloves can be planted with more flexibility. Cover the cloves with 2 inches (5.1 cm) of soil. Garlic does not need to be planted deeply, so you only need to push about 2 inches (5.1 cm) into the soil to plant the clove. Depending on how wet your soil is, you can place your cloves closer to the surface and put 2 inches (5.1 cm) of soil on top of them. Monitor the soil's moisture levels and water it when necessary. Every few days, touch the soil with your figures to make that it's not dry. Garlic plants do not need to be watered unless the weather is abnormally dry. Only add water to the plants as needed. It's normal to see small sprouts appearing from the garlic before the winter season. This won't affect their quality when it comes time to harvest. Adding the Mulch Create mulch from leftover leaves and grass in your yard. Since the garlic plants will be in the ground for the entirety of the winter, you will want to insulate them with a layer of mulch. You can use dead leaves and cut grass to create your own mulch, or you can purchase it from any store that sells gardening supplies. You can also use a wood chipper to create your own mulch. Place a layer of mulch over the fertilized soil. Once you have enough mulch, begin layering it on top of the soil. Ideally, the mulch layer should be at least 4 inches (10 cm) deep, especially if you live in a colder area. Put a layer of straw on top to insulate the mulch. Adding a layer of straw on top of the mulch will provide your garlic plants with extra protection from the cold winter weather. You can use less straw if you live in a warmer area. Remove any excess shoots that begin to appear in the spring, as they decrease the size of your harvested garlic. Wait to harvest the garlic. While the planting process stretches over fall and winter, you will not be harvesting your garlic plants until at least June. Dig up a single plant and to physically examine it before harvesting the rest of the crop. Ripe garlic will have prominent cloves sticking out and will be covered in a layer of skin. Don't use too much force when you go to harvest the garlic.",
    "sentences": [
        " Preparing the Soil Find a well-lit bed of soil where you can plant your garlic.",
        "While you don't have to live on a farm to plant your own garlic, you will need a designated space for the cloves to grow.",
        "Find an area of loose soil to use when planting your garlic cloves.",
        "If you do not have space to grow garlic outside, you should be able to find soil, planting containers, and other garden supplies at any store that sells gardening tools (i.e, Walmart, Lowes).",
        "Pull out all weeds from the soil.",
        "Weeds will steal valuable nutrients from the growing garlic, which may have a negative effect on the crop's quality.",
        "Adding mulch later on will help to keep any weeds from growing around the garlic plants.",
        "Apply a layer of compost to the soil.",
        "Composting involves taking natural materials and reusing them as a source of nutrients for soil.",
        "Save any organic trash to use for your compost layer (i.e, coffee grounds, eggshells, teabags).",
        "Use a scoop to evenly spread the compost into the soil.",
        "It does not matter how much compost you use, as long as it is evenly spread throughout the soil.",
        "There are free tools online that can help you figure out how much compost you should use given the size of your garden.",
        "You can use a large bucket to compile your compost.",
        "Any fluid that comes from the composting process is referred to as tea.",
        "Add slow-growing fertilizer to the soil bed.",
        "You want to add 2 tablespoons of fertilizer to each spot where you plan to plant a garlic clove, as this will provide your garlic with nourishment.",
        "Since the garlic is planted before winter, you don't want your plants to be sprouting in the middle of December.",
        "Don't worry about not using enough fertilizer.",
        "In the warmer spring months, you will have plenty of time to give your garlic plants more.",
        "Planting the Clove Assemble individual garlic cloves for planting.",
        "Unlike other common fruits and vegetables, garlic does not have a traditional seed.",
        "Instead, you will plant a garlic clove.",
        "Remove the outer layer of skin from a normal garlic plant to reveal the cloves inside.",
        "Don't remove the skin from any of the small cloves.",
        "Determine if you are planting softneck or hardneck garlic cloves.",
        "While similar, these two types of garlic have distinct differences between clove quantity and overall storage time.",
        "Planting larger cloves is likely to yield a larger garlic plant.",
        "Buy your garlic cloves from a plant nursery or seed company to ensure that the cloves are compatible with the soil in your area.",
        "Wait for the first autumn frost to occur.",
        "Unlike other plants, garlic requires a cold temperature in order to grow properly.",
        "Planting your garlic in the fall will allow your plants to get cold naturally.",
        "If you live in a colder region, you should wait up to 3 weeks after the first fall frost before planting your garlic.",
        "Plant the cloves at least 4 inches (10 cm) apart in the soil bed.",
        "You will want to ensure that your garlic has plenty of room to grow by placing each clove at least 4 inches (10 cm)  apart.",
        "The rows of garlic should be at least 8 inches (20 cm) apart.",
        "If you are planting hardneck cloves, make sure that they are planted in an upright position.",
        "Softneck cloves can be planted with more flexibility.",
        "Cover the cloves with 2 inches (5.1 cm) of soil.",
        "Garlic does not need to be planted deeply, so you only need to push about 2 inches (5.1 cm) into the soil to plant the clove.",
        "Depending on how wet your soil is, you can place your cloves closer to the surface and put 2 inches (5.1 cm) of soil on top of them.",
        "Monitor the soil's moisture levels and water it when necessary.",
        "Every few days, touch the soil with your figures to make that it's not dry.",
        "Garlic plants do not need to be watered unless the weather is abnormally dry.",
        "Only add water to the plants as needed.",
        "It's normal to see small sprouts appearing from the garlic before the winter season.",
        "This won't affect their quality when it comes time to harvest.",
        "Adding the Mulch Create mulch from leftover leaves and grass in your yard.",
        "Since the garlic plants will be in the ground for the entirety of the winter, you will want to insulate them with a layer of mulch.",
        "You can use dead leaves and cut grass to create your own mulch, or you can purchase it from any store that sells gardening supplies.",
        "You can also use a wood chipper to create your own mulch.",
        "Place a layer of mulch over the fertilized soil.",
        "Once you have enough mulch, begin layering it on top of the soil.",
        "Ideally, the mulch layer should be at least 4 inches (10 cm) deep, especially if you live in a colder area.",
        "Put a layer of straw on top to insulate the mulch.",
        "Adding a layer of straw on top of the mulch will provide your garlic plants with extra protection from the cold winter weather.",
        "You can use less straw if you live in a warmer area.",
        "Remove any excess shoots that begin to appear in the spring, as they decrease the size of your harvested garlic.",
        "Wait to harvest the garlic.",
        "While the planting process stretches over fall and winter, you will not be harvesting your garlic plants until at least June.",
        "Dig up a single plant and to physically examine it before harvesting the rest of the crop.",
        "Ripe garlic will have prominent cloves sticking out and will be covered in a layer of skin.",
        "Don't use too much force when you go to harvest the garlic."
    ]
}