{
    "title": "How to Paint a Pool",
    "url": "https://www.wikihow.com/Paint-a-Pool",
    "category_hierarchy": [
        "Home and Garden",
        "Swimming Pools"
    ],
    "parts": [
        {
            "name": "Draining and Patching the Pool",
            "steps": [
                {
                    "headline": "Drain the pool when the weather forecast is promising.",
                    "description": "Wait for a stretch of 5-7 days with no rain and temperatures between 40 and 90 °F (4 and 32 °C) in the forecast, as these are critical to a good paint job. Then, use your pool’s central pump or a submersible pump to drain out all the water. Make sure the drained water is directed well away from the pool. An average size backyard pool can take around 14 hours to drain, but this can vary significantly based on the pump you use and the specific size of your pool. There may be regulations on disposing of drained pool water where you live. Check with your local government. If you’re painting a brand-new, never-filled pool, skip ahead to the section of this article on priming and painting. You’ll still want to have an ideal weather forecast for at least 4-5 days, though."
                },
                {
                    "headline": "Open any hydrostatic relief caps in the bottom of your pool.",
                    "description": "If your pool has one or more white plastic drain caps in the bottom, twist these open once there’s less than 1 ft (30 cm) of water left in the pool. These hydrostatic relief caps help prevent water pressure in the surrounding soil from lifting (or “floating”) your empty pool from the ground. The relief caps may be plastered shut. Use a small chisel or screwdriver to break away the plaster. No, hydrostatic pressure won’t cause your pool to pop right up out of the ground. However, it can cause major cracks or push the rim of the pool above the surrounding ground level."
                },
                {
                    "headline": "Sweep up or suck up any debris in the bottom of the pool.",
                    "description": "Once you’re finished draining the pool, there will be a small amount of water and a lot of leaves and other debris at the bottom of the deep end. Use a broom, dustpan, and trash can to clean this up, or suck it up with a wet-dry vacuum. Use some old towels to sop up any remaining water at the bottom of the pool, if necessary."
                },
                {
                    "headline": "Scrape off any loose paint, plaster, or concrete.",
                    "description": "Go over the pool with a paint scraper and a wire brush to remove any material that is ready to flake off. While it produces a superior finished paint job, sandblasting isn’t DIY-friendly and can cost thousands of dollars to have done professionally. This assumes that you plan to paint the pool with an acrylic paint, which can be used over any type of prior paint (and is much more DIY-friendly in general). If you’re using an epoxy or rubber paint, you must be sure either to use the same type of paint (new epoxy over old epoxy, new rubber over old rubber) or to sandblast away all the old paint."
                },
                {
                    "headline": "Patch any holes or cracks with an appropriate patching material.",
                    "description": "Buy a patching material that’s intended for use with pools, and mix it (if necessary) according to the product instructions. Apply it over cracks and small holes with a trowel, smooth it out, and use medium-grit (220-grit) sandpaper to sand away any excess once the material partially sets. Pool patching material is often marketed as hydraulic cement or waterproof cement. You can find it at any pool supply store or home center. Make sure it is specifically formulated for swimming pools. The patching material may harden in as fast as 5 minutes after application. Refer to the product instructions regarding curing times."
                }
            ]
        },
        {
            "name": "Cleaning the Drained Pool",
            "steps": [
                {
                    "headline": "Spray the entire pool with a high-pressure power washer.",
                    "description": "For the best results, use a power washer rated at 3000 psi (207 bar) or greater. Power washing will remove surface dirt and grime, as well as some more of the old paint. Follow all safety recommendations, including wearing eye protection, when using a power washer. At this high pressure, the water spray can peel away exposed skin. Suck up the water and debris with a wet-dry vacuum. You can, if desired, power wash the pool before patching any cracks or holes. Doing so may loosen more material around existing cracks."
                },
                {
                    "headline": "Scrub down the pool with trisodium phosphate (TSP).",
                    "description": "Put on sturdy cleaning gloves and protective eyewear. Add 1 US gal (3.8 L) of hot water to a large bucket, then stir in 0.5 c (120 g) of TSP with a long stirring stick. Dip a long-handled, stiff-bristled brush into the mixture, then scrub down the entire pool surface. When you’re done scrubbing, rinse away the TSP with a garden hose, then suck up the dirty puddle in the bottom of the pool with a wet-dry vacuum. TSP comes in the form of white granules that dissolve in water to create an alkaline cleaning solution."
                },
                {
                    "headline": "Do a muriatic acid rinse only if you have the skills and safety gear.",
                    "description": "Spraying the pool surfaces with muriatic acid helps to complete the cleaning process, as well as etch the surfaces so that they accept paint better. However, this is a very corrosive acid that produces dangerous fumes, so detailed safety measures must be followed closely. Skip this step if you’re not fully confident in your ability to use muriatic acid safely. Muriatic acid is available at home centers. You must wear acid-resistant gloves, safety goggles, and a full respirator (not a dust mask), among other safety measures, when using muriatic acid. Observe an experienced person using muriatic acid safely before attempting to use it yourself. Once again, skip this step if you’re unsure of your ability. The paint will still adhere, but it may flake off and require repainting more quickly—perhaps in 1-2 years instead of 2-3. If you do a muriatic acid rinse, you’ll need to follow up with a clean water rinse and another cleaning with TSP. Additionally, you must buy an acid neutralizer along with the muriatic acid so you can safely dispose of the material that will collect in the bottom of your pool."
                },
                {
                    "headline": "Give the pool a final rinse, drain, and dry.",
                    "description": "No matter how many different times and ways you’ve cleaned the pool surfaces, go over them one last time with clean water from a hose. Use a wet-dry vacuum to suck up puddled water, then sop up any remainder with towels. Then, leave the empty pool to air dry. If you’ll be using acrylic paint, you only need to make sure there are no puddles of water remaining. However, if you’re using epoxy or rubber paint, the pool surfaces must be absolutely dry. If you tape a sheet of plastic wrap to the surface and any water droplets form on the underside of the plastic within 60 minutes, the surface is still too wet to paint."
                }
            ]
        },
        {
            "name": "Applying Acrylic Pool Paint",
            "steps": [
                {
                    "headline": "Choose an acrylic pool paint as the easiest DIY choice.",
                    "description": "Acrylic pool paint is not the longest lasting choice—you can expect to get 2-3 years out of it, whereas rubber paint often gets 2-4 years and epoxy paint regularly gets 5-7 years. That said, it is by far the easiest choice for the average DIYer, especially if you’re repainting a pool. Acrylic pool paint can be painted over any previous type of pool paint, so long as any loose or chipped paint is removed. Rubber must be painted over rubber and epoxy over epoxy, or the surface must be sandblasted bare. Acrylic pool paint, unlike rubber or epoxy, can be used on damp surfaces, so long as there isn’t any standing water. Acrylic pool paint can be purchased at pool supply stores as well as home improvement stores."
                },
                {
                    "headline": "Apply an acrylic pool primer to any patched or bare areas.",
                    "description": "Brush on a coat of primer over any areas that aren’t covered by prior coats of paint. Treat it like any typical primer or paint—open the can, stir the contents thoroughly, and use smooth brush strokes to apply an even coat of primer where it’s needed. If you have larger areas to cover with primer, pour it into a pan and use a roller with a telescoping handle and a low-nap roller pad—that is, 0.375 in (9.5 mm) nap length or less. Let the primer dry for at least 2-3 hours before proceeding. If you don't prime bare areas, your paint may not adhere properly. You can buy acrylic pool primer wherever you buy acrylic pool paint. Rubber and epoxy pool primers can be applied in the same fashion, but tend to be thicker than acrylic primer."
                },
                {
                    "headline": "Roll on a coat of paint, starting from the pool’s deep end.",
                    "description": "Pour 4 cans of paint, each 1 US gal (3.8 L) in volume, into a 5 US gal (19 L) bucket and stir it thoroughly with a long stirring stick. As with the primer, use a paint pan and a roller with a telescoping handle and a low-nap roller pad. Acrylic pool paint rolls on like typical house paint. Use the roller pan to work a small amount of paint into the roller pad, then apply the paint with smooth, even strokes. Use a paintbrush for corners and tight spaces. Start at the deep end of the pool and work your way to the shallowest part—otherwise, you’ll paint yourself into the deep end! You’ll likely need around 7–8 US gal (26–30 L) of acrylic pool paint to apply 2 coats to a 16 ft × 32 ft (4.9 m × 9.8 m) pool. Rubber and epoxy pool paints are usually thicker, but can still be applied with rollers and brushes. The amount you need may vary versus acrylic, so check the product instructions."
                },
                {
                    "headline": "Apply a second coat after waiting 2-3 hours.",
                    "description": "Acrylic pool paints usually dry to the touch within 3 hours, but check the product instructions for the proper waiting time. The first coat should no longer be tacky when you begin to apply the second coat. Add the second coat in the same manner as the first. 2 coats of acrylic paint is usually sufficient. However, you may need to add 1 or more additional coats if you’re covering a darker color with a lighter color. Drying times are similar among acrylic, rubber, and epoxy pool paints. If you’re using rubber or epoxy, follow the manufacturer’s recommendations regarding the number of coats to apply."
                },
                {
                    "headline": "Let the paint cure for 3-7 days before filling the pool.",
                    "description": "Acrylic pool paint is more forgiving if it happens to rain after application, but ideally it should get at least 3 days to cure before being exposed to moisture. Sop up any rainwater that does collect in the pool during this time. Acrylic, rubber, and especially epoxy pool paints work best if allowed to cure for 7 days. For rubber and epoxy, though, add 1 curing day for any day during the period when it rains. After the curing time is complete, your pool is ready to refill, treat, maintain, and enjoy!"
                }
            ]
        }
    ],
    "tyn": [
        "Muriatic acid",
        "Epoxy/acrylic/chlorinated rubber paint",
        "Paint roller pans",
        "Paint rollers with extension pole",
        "Paintbrushes",
        "Rubber gloves",
        "Power washer",
        "Safety goggles",
        "Scraper",
        "Scrub brush",
        "Tri-sodium phosphate"
    ],
    "text": " Draining and Patching the Pool Drain the pool when the weather forecast is promising. Wait for a stretch of 5-7 days with no rain and temperatures between 40 and 90 °F (4 and 32 °C) in the forecast, as these are critical to a good paint job. Then, use your pool’s central pump or a submersible pump to drain out all the water. Make sure the drained water is directed well away from the pool. An average size backyard pool can take around 14 hours to drain, but this can vary significantly based on the pump you use and the specific size of your pool. There may be regulations on disposing of drained pool water where you live. Check with your local government. If you’re painting a brand-new, never-filled pool, skip ahead to the section of this article on priming and painting. You’ll still want to have an ideal weather forecast for at least 4-5 days, though. Open any hydrostatic relief caps in the bottom of your pool. If your pool has one or more white plastic drain caps in the bottom, twist these open once there’s less than 1 ft (30 cm) of water left in the pool. These hydrostatic relief caps help prevent water pressure in the surrounding soil from lifting (or “floating”) your empty pool from the ground. The relief caps may be plastered shut. Use a small chisel or screwdriver to break away the plaster. No, hydrostatic pressure won’t cause your pool to pop right up out of the ground. However, it can cause major cracks or push the rim of the pool above the surrounding ground level. Sweep up or suck up any debris in the bottom of the pool. Once you’re finished draining the pool, there will be a small amount of water and a lot of leaves and other debris at the bottom of the deep end. Use a broom, dustpan, and trash can to clean this up, or suck it up with a wet-dry vacuum. Use some old towels to sop up any remaining water at the bottom of the pool, if necessary. Scrape off any loose paint, plaster, or concrete. Go over the pool with a paint scraper and a wire brush to remove any material that is ready to flake off. While it produces a superior finished paint job, sandblasting isn’t DIY-friendly and can cost thousands of dollars to have done professionally. This assumes that you plan to paint the pool with an acrylic paint, which can be used over any type of prior paint (and is much more DIY-friendly in general). If you’re using an epoxy or rubber paint, you must be sure either to use the same type of paint (new epoxy over old epoxy, new rubber over old rubber) or to sandblast away all the old paint. Patch any holes or cracks with an appropriate patching material. Buy a patching material that’s intended for use with pools, and mix it (if necessary) according to the product instructions. Apply it over cracks and small holes with a trowel, smooth it out, and use medium-grit (220-grit) sandpaper to sand away any excess once the material partially sets. Pool patching material is often marketed as hydraulic cement or waterproof cement. You can find it at any pool supply store or home center. Make sure it is specifically formulated for swimming pools. The patching material may harden in as fast as 5 minutes after application. Refer to the product instructions regarding curing times. Cleaning the Drained Pool Spray the entire pool with a high-pressure power washer. For the best results, use a power washer rated at 3000 psi (207 bar) or greater. Power washing will remove surface dirt and grime, as well as some more of the old paint. Follow all safety recommendations, including wearing eye protection, when using a power washer. At this high pressure, the water spray can peel away exposed skin. Suck up the water and debris with a wet-dry vacuum. You can, if desired, power wash the pool before patching any cracks or holes. Doing so may loosen more material around existing cracks. Scrub down the pool with trisodium phosphate (TSP). Put on sturdy cleaning gloves and protective eyewear. Add 1 US gal (3.8 L) of hot water to a large bucket, then stir in 0.5 c (120 g) of TSP with a long stirring stick. Dip a long-handled, stiff-bristled brush into the mixture, then scrub down the entire pool surface. When you’re done scrubbing, rinse away the TSP with a garden hose, then suck up the dirty puddle in the bottom of the pool with a wet-dry vacuum. TSP comes in the form of white granules that dissolve in water to create an alkaline cleaning solution. Do a muriatic acid rinse only if you have the skills and safety gear. Spraying the pool surfaces with muriatic acid helps to complete the cleaning process, as well as etch the surfaces so that they accept paint better. However, this is a very corrosive acid that produces dangerous fumes, so detailed safety measures must be followed closely. Skip this step if you’re not fully confident in your ability to use muriatic acid safely. Muriatic acid is available at home centers. You must wear acid-resistant gloves, safety goggles, and a full respirator (not a dust mask), among other safety measures, when using muriatic acid. Observe an experienced person using muriatic acid safely before attempting to use it yourself. Once again, skip this step if you’re unsure of your ability. The paint will still adhere, but it may flake off and require repainting more quickly—perhaps in 1-2 years instead of 2-3. If you do a muriatic acid rinse, you’ll need to follow up with a clean water rinse and another cleaning with TSP. Additionally, you must buy an acid neutralizer along with the muriatic acid so you can safely dispose of the material that will collect in the bottom of your pool. Give the pool a final rinse, drain, and dry. No matter how many different times and ways you’ve cleaned the pool surfaces, go over them one last time with clean water from a hose. Use a wet-dry vacuum to suck up puddled water, then sop up any remainder with towels. Then, leave the empty pool to air dry. If you’ll be using acrylic paint, you only need to make sure there are no puddles of water remaining. However, if you’re using epoxy or rubber paint, the pool surfaces must be absolutely dry. If you tape a sheet of plastic wrap to the surface and any water droplets form on the underside of the plastic within 60 minutes, the surface is still too wet to paint. Applying Acrylic Pool Paint Choose an acrylic pool paint as the easiest DIY choice. Acrylic pool paint is not the longest lasting choice—you can expect to get 2-3 years out of it, whereas rubber paint often gets 2-4 years and epoxy paint regularly gets 5-7 years. That said, it is by far the easiest choice for the average DIYer, especially if you’re repainting a pool. Acrylic pool paint can be painted over any previous type of pool paint, so long as any loose or chipped paint is removed. Rubber must be painted over rubber and epoxy over epoxy, or the surface must be sandblasted bare. Acrylic pool paint, unlike rubber or epoxy, can be used on damp surfaces, so long as there isn’t any standing water. Acrylic pool paint can be purchased at pool supply stores as well as home improvement stores. Apply an acrylic pool primer to any patched or bare areas. Brush on a coat of primer over any areas that aren’t covered by prior coats of paint. Treat it like any typical primer or paint—open the can, stir the contents thoroughly, and use smooth brush strokes to apply an even coat of primer where it’s needed. If you have larger areas to cover with primer, pour it into a pan and use a roller with a telescoping handle and a low-nap roller pad—that is, 0.375 in (9.5 mm) nap length or less. Let the primer dry for at least 2-3 hours before proceeding. If you don't prime bare areas, your paint may not adhere properly. You can buy acrylic pool primer wherever you buy acrylic pool paint. Rubber and epoxy pool primers can be applied in the same fashion, but tend to be thicker than acrylic primer. Roll on a coat of paint, starting from the pool’s deep end. Pour 4 cans of paint, each 1 US gal (3.8 L) in volume, into a 5 US gal (19 L) bucket and stir it thoroughly with a long stirring stick. As with the primer, use a paint pan and a roller with a telescoping handle and a low-nap roller pad. Acrylic pool paint rolls on like typical house paint. Use the roller pan to work a small amount of paint into the roller pad, then apply the paint with smooth, even strokes. Use a paintbrush for corners and tight spaces. Start at the deep end of the pool and work your way to the shallowest part—otherwise, you’ll paint yourself into the deep end! You’ll likely need around 7–8 US gal (26–30 L) of acrylic pool paint to apply 2 coats to a 16 ft × 32 ft (4.9 m × 9.8 m) pool. Rubber and epoxy pool paints are usually thicker, but can still be applied with rollers and brushes. The amount you need may vary versus acrylic, so check the product instructions. Apply a second coat after waiting 2-3 hours. Acrylic pool paints usually dry to the touch within 3 hours, but check the product instructions for the proper waiting time. The first coat should no longer be tacky when you begin to apply the second coat. Add the second coat in the same manner as the first. 2 coats of acrylic paint is usually sufficient. However, you may need to add 1 or more additional coats if you’re covering a darker color with a lighter color. Drying times are similar among acrylic, rubber, and epoxy pool paints. If you’re using rubber or epoxy, follow the manufacturer’s recommendations regarding the number of coats to apply. Let the paint cure for 3-7 days before filling the pool. Acrylic pool paint is more forgiving if it happens to rain after application, but ideally it should get at least 3 days to cure before being exposed to moisture. Sop up any rainwater that does collect in the pool during this time. Acrylic, rubber, and especially epoxy pool paints work best if allowed to cure for 7 days. For rubber and epoxy, though, add 1 curing day for any day during the period when it rains. After the curing time is complete, your pool is ready to refill, treat, maintain, and enjoy!",
    "sentences": [
        " Draining and Patching the Pool Drain the pool when the weather forecast is promising.",
        "Wait for a stretch of 5-7 days with no rain and temperatures between 40 and 90 °F (4 and 32 °C) in the forecast, as these are critical to a good paint job.",
        "Then, use your pool’s central pump or a submersible pump to drain out all the water.",
        "Make sure the drained water is directed well away from the pool.",
        "An average size backyard pool can take around 14 hours to drain, but this can vary significantly based on the pump you use and the specific size of your pool.",
        "There may be regulations on disposing of drained pool water where you live.",
        "Check with your local government.",
        "If you’re painting a brand-new, never-filled pool, skip ahead to the section of this article on priming and painting.",
        "You’ll still want to have an ideal weather forecast for at least 4-5 days, though.",
        "Open any hydrostatic relief caps in the bottom of your pool.",
        "If your pool has one or more white plastic drain caps in the bottom, twist these open once there’s less than 1 ft (30 cm) of water left in the pool.",
        "These hydrostatic relief caps help prevent water pressure in the surrounding soil from lifting (or “floating”) your empty pool from the ground.",
        "The relief caps may be plastered shut.",
        "Use a small chisel or screwdriver to break away the plaster.",
        "No, hydrostatic pressure won’t cause your pool to pop right up out of the ground.",
        "However, it can cause major cracks or push the rim of the pool above the surrounding ground level.",
        "Sweep up or suck up any debris in the bottom of the pool.",
        "Once you’re finished draining the pool, there will be a small amount of water and a lot of leaves and other debris at the bottom of the deep end.",
        "Use a broom, dustpan, and trash can to clean this up, or suck it up with a wet-dry vacuum.",
        "Use some old towels to sop up any remaining water at the bottom of the pool, if necessary.",
        "Scrape off any loose paint, plaster, or concrete.",
        "Go over the pool with a paint scraper and a wire brush to remove any material that is ready to flake off.",
        "While it produces a superior finished paint job, sandblasting isn’t DIY-friendly and can cost thousands of dollars to have done professionally.",
        "This assumes that you plan to paint the pool with an acrylic paint, which can be used over any type of prior paint (and is much more DIY-friendly in general).",
        "If you’re using an epoxy or rubber paint, you must be sure either to use the same type of paint (new epoxy over old epoxy, new rubber over old rubber) or to sandblast away all the old paint.",
        "Patch any holes or cracks with an appropriate patching material.",
        "Buy a patching material that’s intended for use with pools, and mix it (if necessary) according to the product instructions.",
        "Apply it over cracks and small holes with a trowel, smooth it out, and use medium-grit (220-grit) sandpaper to sand away any excess once the material partially sets.",
        "Pool patching material is often marketed as hydraulic cement or waterproof cement.",
        "You can find it at any pool supply store or home center.",
        "Make sure it is specifically formulated for swimming pools.",
        "The patching material may harden in as fast as 5 minutes after application.",
        "Refer to the product instructions regarding curing times.",
        "Cleaning the Drained Pool Spray the entire pool with a high-pressure power washer.",
        "For the best results, use a power washer rated at 3000 psi (207 bar) or greater.",
        "Power washing will remove surface dirt and grime, as well as some more of the old paint.",
        "Follow all safety recommendations, including wearing eye protection, when using a power washer.",
        "At this high pressure, the water spray can peel away exposed skin.",
        "Suck up the water and debris with a wet-dry vacuum.",
        "You can, if desired, power wash the pool before patching any cracks or holes.",
        "Doing so may loosen more material around existing cracks.",
        "Scrub down the pool with trisodium phosphate (TSP).",
        "Put on sturdy cleaning gloves and protective eyewear.",
        "Add 1 US gal (3.8 L) of hot water to a large bucket, then stir in 0.5 c (120 g) of TSP with a long stirring stick.",
        "Dip a long-handled, stiff-bristled brush into the mixture, then scrub down the entire pool surface.",
        "When you’re done scrubbing, rinse away the TSP with a garden hose, then suck up the dirty puddle in the bottom of the pool with a wet-dry vacuum.",
        "TSP comes in the form of white granules that dissolve in water to create an alkaline cleaning solution.",
        "Do a muriatic acid rinse only if you have the skills and safety gear.",
        "Spraying the pool surfaces with muriatic acid helps to complete the cleaning process, as well as etch the surfaces so that they accept paint better.",
        "However, this is a very corrosive acid that produces dangerous fumes, so detailed safety measures must be followed closely.",
        "Skip this step if you’re not fully confident in your ability to use muriatic acid safely.",
        "Muriatic acid is available at home centers.",
        "You must wear acid-resistant gloves, safety goggles, and a full respirator (not a dust mask), among other safety measures, when using muriatic acid.",
        "Observe an experienced person using muriatic acid safely before attempting to use it yourself.",
        "Once again, skip this step if you’re unsure of your ability.",
        "The paint will still adhere, but it may flake off and require repainting more quickly—perhaps in 1-2 years instead of 2-3.",
        "If you do a muriatic acid rinse, you’ll need to follow up with a clean water rinse and another cleaning with TSP.",
        "Additionally, you must buy an acid neutralizer along with the muriatic acid so you can safely dispose of the material that will collect in the bottom of your pool.",
        "Give the pool a final rinse, drain, and dry.",
        "No matter how many different times and ways you’ve cleaned the pool surfaces, go over them one last time with clean water from a hose.",
        "Use a wet-dry vacuum to suck up puddled water, then sop up any remainder with towels.",
        "Then, leave the empty pool to air dry.",
        "If you’ll be using acrylic paint, you only need to make sure there are no puddles of water remaining.",
        "However, if you’re using epoxy or rubber paint, the pool surfaces must be absolutely dry.",
        "If you tape a sheet of plastic wrap to the surface and any water droplets form on the underside of the plastic within 60 minutes, the surface is still too wet to paint.",
        "Applying Acrylic Pool Paint Choose an acrylic pool paint as the easiest DIY choice.",
        "Acrylic pool paint is not the longest lasting choice—you can expect to get 2-3 years out of it, whereas rubber paint often gets 2-4 years and epoxy paint regularly gets 5-7 years.",
        "That said, it is by far the easiest choice for the average DIYer, especially if you’re repainting a pool.",
        "Acrylic pool paint can be painted over any previous type of pool paint, so long as any loose or chipped paint is removed.",
        "Rubber must be painted over rubber and epoxy over epoxy, or the surface must be sandblasted bare.",
        "Acrylic pool paint, unlike rubber or epoxy, can be used on damp surfaces, so long as there isn’t any standing water.",
        "Acrylic pool paint can be purchased at pool supply stores as well as home improvement stores.",
        "Apply an acrylic pool primer to any patched or bare areas.",
        "Brush on a coat of primer over any areas that aren’t covered by prior coats of paint.",
        "Treat it like any typical primer or paint—open the can, stir the contents thoroughly, and use smooth brush strokes to apply an even coat of primer where it’s needed.",
        "If you have larger areas to cover with primer, pour it into a pan and use a roller with a telescoping handle and a low-nap roller pad—that is, 0.375 in (9.5 mm) nap length or less.",
        "Let the primer dry for at least 2-3 hours before proceeding.",
        "If you don't prime bare areas, your paint may not adhere properly.",
        "You can buy acrylic pool primer wherever you buy acrylic pool paint.",
        "Rubber and epoxy pool primers can be applied in the same fashion, but tend to be thicker than acrylic primer.",
        "Roll on a coat of paint, starting from the pool’s deep end.",
        "Pour 4 cans of paint, each 1 US gal (3.8 L) in volume, into a 5 US gal (19 L) bucket and stir it thoroughly with a long stirring stick.",
        "As with the primer, use a paint pan and a roller with a telescoping handle and a low-nap roller pad.",
        "Acrylic pool paint rolls on like typical house paint.",
        "Use the roller pan to work a small amount of paint into the roller pad, then apply the paint with smooth, even strokes.",
        "Use a paintbrush for corners and tight spaces.",
        "Start at the deep end of the pool and work your way to the shallowest part—otherwise, you’ll paint yourself into the deep end!",
        "You’ll likely need around 7–8 US gal (26–30 L) of acrylic pool paint to apply 2 coats to a 16 ft × 32 ft (4.9 m × 9.8 m) pool.",
        "Rubber and epoxy pool paints are usually thicker, but can still be applied with rollers and brushes.",
        "The amount you need may vary versus acrylic, so check the product instructions.",
        "Apply a second coat after waiting 2-3 hours.",
        "Acrylic pool paints usually dry to the touch within 3 hours, but check the product instructions for the proper waiting time.",
        "The first coat should no longer be tacky when you begin to apply the second coat.",
        "Add the second coat in the same manner as the first.",
        "2 coats of acrylic paint is usually sufficient.",
        "However, you may need to add 1 or more additional coats if you’re covering a darker color with a lighter color.",
        "Drying times are similar among acrylic, rubber, and epoxy pool paints.",
        "If you’re using rubber or epoxy, follow the manufacturer’s recommendations regarding the number of coats to apply.",
        "Let the paint cure for 3-7 days before filling the pool.",
        "Acrylic pool paint is more forgiving if it happens to rain after application, but ideally it should get at least 3 days to cure before being exposed to moisture.",
        "Sop up any rainwater that does collect in the pool during this time.",
        "Acrylic, rubber, and especially epoxy pool paints work best if allowed to cure for 7 days.",
        "For rubber and epoxy, though, add 1 curing day for any day during the period when it rains.",
        "After the curing time is complete, your pool is ready to refill, treat, maintain, and enjoy!"
    ]
}