{
    "title": "How to Freeze Pears",
    "url": "https://www.wikihow.com/Freeze-Pears",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Preservation Techniques",
        "Freezing Food"
    ],
    "methods": [
        {
            "name": "Choosing and Processing Pears",
            "steps": [
                {
                    "headline": "Pick or purchase ripe pears.",
                    "description": "To determine if a pear is ready to pick or buy, gently squeeze near its neck. The flesh near the stem should be a little soft. If it's too hard, look for a different pear.Did You Know? Most pear varieties, such as Anjou, Bosc, Comice, and Seckel, don't change color as they ripen. If you get Bartlett pears, they should turn from green to yellow when they become ripe. Avoid pears that are soft around the middle because these are probably already mushy."
                },
                {
                    "headline": "Rinse the pears and peel them.",
                    "description": "Hold the pears under cool tap water to rinse away dirt. Then, place them on the counter and use a swivel or Y-peeler to remove the peels. You can discard the peels or use them to flavor liqueur. If the pear is too soft to peel, it's probably too ripe to freeze."
                },
                {
                    "headline": "Cut each pear in half and scoop out the core.",
                    "description": "Use a knife to carefully cut a pear in half lengthwise. Then, use a spoon or melon baller to remove the core with the seeds. You can also pull away the stem. Repeat this for each pear you want to freeze.Tip: At this point, you can slice the pears or chop them into pieces according to your preference. Try not to remove too much fruit from the center of the pear as you remove the core."
                },
                {
                    "headline": "Soak the pears in a vitamin C solution to prevent them from discoloring.",
                    "description": "Get out a large container and put 1 teaspoon (2 g) of crystalline ascorbic acid (vitamin C) into it. Pour in 1 gallon (3.8 L) of cold water and stir until the vitamin C dissolves. Then, add your peeled pears to the solution. Let the pears soak while you prepare the syrup. If you aren't making syrup and would rather dry pack the pears, soak the pears for at least 10 minutes. If you can't find crystalline ascorbic acid, crush 6 500-mg vitamin C tablets."
                }
            ]
        },
        {
            "name": "Freezing Pears in Syrup",
            "steps": [
                {
                    "headline": "Put the pears into a pot with sugar and water.",
                    "description": "You can customize how sweet or heavy you want the syrup to be. Place all of the pears you want to freeze into a large pot and add the syrup ingredients. To make:\nLight syrup: use 1 2/3 cups (333 g) of granulated sugar and 4 cups (950 ml) of water\nMedium syrup: use 2 2/3 cups (533 g) of granulated sugar and 4 cups (950 ml) of water\nHeavy syrup: use 4 cups (800 g) of granulated sugar and 4 cups (950 ml) of water"
                },
                {
                    "headline": "Boil the pears in the syrup for 1 to 2 minutes.",
                    "description": "Turn the burner to medium-high and stir the mixture gently. The sugar should dissolve as it begins to boil. Let the pears cook in the syrup for 1 to 2 minutes. You can skim off foam if it floats to the surface."
                },
                {
                    "headline": "Chill the pears in the syrup until they're cool.",
                    "description": "Turn off the burner and place the pot with the pears into the refrigerator. You could also transfer them to a different container if you'd like them to cool faster. Refrigerate the pears until the fruit and syrup are cool."
                },
                {
                    "headline": "Fill your containers and leave ⁄2 to 1 inch (1.3 to 2.5 cm) of headspace.",
                    "description": "Spoon cooled pears into clean freezer-safe containers and pour in enough syrup to cover the fruit. If you're using wide-mouthed containers, leave ⁄2 to 1 inch (1.3 to 2.5 cm) of headspace. If you're using narrow-top containers, leave ⁄4 to 1 ⁄2 inches (1.9 to 3.8 cm) of headspace.Tip: Figure on using ⁄2 to ⁄3 cup (120 to 160 ml) of syrup for every 2 cups (450 g) of pears. Remember to wipe the rims of the containers before you seal them shut."
                },
                {
                    "headline": "Label the containers and store the pears for up to 10 to 12 months.",
                    "description": "Use a permanent marker to write on each container so you know that they have pears inside. Then, write the date you initially froze them. When you're ready to defrost the pears, transfer a container from the freezer to the refrigerator and let it thaw overnight."
                }
            ]
        },
        {
            "name": "Dry-Packing Pears",
            "steps": [
                {
                    "headline": "Line a sheet with parchment paper.",
                    "description": "Get out a baking sheet that will easily fit inside your freezer. Tear off a sheet of parchment paper and lay it on the sheet. The silicone in the parchment paper will prevent the pears from freezing to the sheet. If you don't have parchment paper, you can use a silicone baking mat."
                },
                {
                    "headline": "Drain the pears and lay them on the sheet.",
                    "description": "If you're freezing just a few pears, use a slotted spoon to lift the pears out of the vitamin C solution. To drain a large number of pears, place a strainer in the sink and slowly pour the pears into it. Then, arrange the pears on your parchment-paper lined sheet so there's at least ⁄4 inch (0.64 cm) of space between each.Variation: If you'd like to lightly sweeten the pears, mix 1/2 cup (100 g) of sugar into every 1 US quart (0.95 L) of pears after you've drained them. If the pears are touching while they freeze, they'll freeze in a clump that's difficult to separate."
                },
                {
                    "headline": "Freeze the pears on the sheet until they're hard.",
                    "description": "Place the sheet into the freezer and leave them until they're frozen solid. Depending on the size of the pear pieces, this could take 1 to 2 hours. It's fine to leave the pears on the sheet in the freezer overnight."
                },
                {
                    "headline": "Pack the frozen pears into sealable freezer bags.",
                    "description": "You can use any size freezer bags as long as they seal well. Fill your bag completely full of the frozen pears and squeeze out as much air as possible before you seal it shut. If you'll be using the pears for different purposes, consider dividing them into different size bags. For example, fill a few sandwich bags with frozen pears so you can quickly measure out fruit for a smoothie."
                },
                {
                    "headline": "Label the bags and store the pears in the freezer for up to 10 to 12 months.",
                    "description": "Use a permanent marker to label the bags with what's inside and the date you processed the pears. Then, place the bags of pears in the freezer and use them within 10 to 12 months. You can use the pears while they're still frozen or thaw them overnight in the refrigerator."
                }
            ]
        }
    ],
    "tyn": [
        "Choosing and Processing Pears",
        "Peeler",
        "Paring knife",
        "Cutting board",
        "Crystalline ascorbic acid",
        "Large container",
        "Melon baller, optional",
        "Freezing Pears in Syrup",
        "Measuring cups",
        "Pot",
        "Spoon",
        "Freezer-safe containers with lids",
        "Permanent marker",
        "Slotted spoon or strainer",
        "Dry-Packing Pears",
        "Baking sheet",
        "Parchment paper or silicone baking mat",
        "Freezer bags"
    ],
    "text": " Choosing and Processing Pears Pick or purchase ripe pears. To determine if a pear is ready to pick or buy, gently squeeze near its neck. The flesh near the stem should be a little soft. If it's too hard, look for a different pear.Did You Know? Most pear varieties, such as Anjou, Bosc, Comice, and Seckel, don't change color as they ripen. If you get Bartlett pears, they should turn from green to yellow when they become ripe. Avoid pears that are soft around the middle because these are probably already mushy. Rinse the pears and peel them. Hold the pears under cool tap water to rinse away dirt. Then, place them on the counter and use a swivel or Y-peeler to remove the peels. You can discard the peels or use them to flavor liqueur. If the pear is too soft to peel, it's probably too ripe to freeze. Cut each pear in half and scoop out the core. Use a knife to carefully cut a pear in half lengthwise. Then, use a spoon or melon baller to remove the core with the seeds. You can also pull away the stem. Repeat this for each pear you want to freeze.Tip: At this point, you can slice the pears or chop them into pieces according to your preference. Try not to remove too much fruit from the center of the pear as you remove the core. Soak the pears in a vitamin C solution to prevent them from discoloring. Get out a large container and put 1 teaspoon (2 g) of crystalline ascorbic acid (vitamin C) into it. Pour in 1 gallon (3.8 L) of cold water and stir until the vitamin C dissolves. Then, add your peeled pears to the solution. Let the pears soak while you prepare the syrup. If you aren't making syrup and would rather dry pack the pears, soak the pears for at least 10 minutes. If you can't find crystalline ascorbic acid, crush 6 500-mg vitamin C tablets. Freezing Pears in Syrup Put the pears into a pot with sugar and water. You can customize how sweet or heavy you want the syrup to be. Place all of the pears you want to freeze into a large pot and add the syrup ingredients. To make:\nLight syrup: use 1 2/3 cups (333 g) of granulated sugar and 4 cups (950 ml) of water\nMedium syrup: use 2 2/3 cups (533 g) of granulated sugar and 4 cups (950 ml) of water\nHeavy syrup: use 4 cups (800 g) of granulated sugar and 4 cups (950 ml) of water Boil the pears in the syrup for 1 to 2 minutes. Turn the burner to medium-high and stir the mixture gently. The sugar should dissolve as it begins to boil. Let the pears cook in the syrup for 1 to 2 minutes. You can skim off foam if it floats to the surface. Chill the pears in the syrup until they're cool. Turn off the burner and place the pot with the pears into the refrigerator. You could also transfer them to a different container if you'd like them to cool faster. Refrigerate the pears until the fruit and syrup are cool. Fill your containers and leave ⁄2 to 1 inch (1.3 to 2.5 cm) of headspace. Spoon cooled pears into clean freezer-safe containers and pour in enough syrup to cover the fruit. If you're using wide-mouthed containers, leave ⁄2 to 1 inch (1.3 to 2.5 cm) of headspace. If you're using narrow-top containers, leave ⁄4 to 1 ⁄2 inches (1.9 to 3.8 cm) of headspace.Tip: Figure on using ⁄2 to ⁄3 cup (120 to 160 ml) of syrup for every 2 cups (450 g) of pears. Remember to wipe the rims of the containers before you seal them shut. Label the containers and store the pears for up to 10 to 12 months. Use a permanent marker to write on each container so you know that they have pears inside. Then, write the date you initially froze them. When you're ready to defrost the pears, transfer a container from the freezer to the refrigerator and let it thaw overnight. Dry-Packing Pears Line a sheet with parchment paper. Get out a baking sheet that will easily fit inside your freezer. Tear off a sheet of parchment paper and lay it on the sheet. The silicone in the parchment paper will prevent the pears from freezing to the sheet. If you don't have parchment paper, you can use a silicone baking mat. Drain the pears and lay them on the sheet. If you're freezing just a few pears, use a slotted spoon to lift the pears out of the vitamin C solution. To drain a large number of pears, place a strainer in the sink and slowly pour the pears into it. Then, arrange the pears on your parchment-paper lined sheet so there's at least ⁄4 inch (0.64 cm) of space between each.Variation: If you'd like to lightly sweeten the pears, mix 1/2 cup (100 g) of sugar into every 1 US quart (0.95 L) of pears after you've drained them. If the pears are touching while they freeze, they'll freeze in a clump that's difficult to separate. Freeze the pears on the sheet until they're hard. Place the sheet into the freezer and leave them until they're frozen solid. Depending on the size of the pear pieces, this could take 1 to 2 hours. It's fine to leave the pears on the sheet in the freezer overnight. Pack the frozen pears into sealable freezer bags. You can use any size freezer bags as long as they seal well. Fill your bag completely full of the frozen pears and squeeze out as much air as possible before you seal it shut. If you'll be using the pears for different purposes, consider dividing them into different size bags. For example, fill a few sandwich bags with frozen pears so you can quickly measure out fruit for a smoothie. Label the bags and store the pears in the freezer for up to 10 to 12 months. Use a permanent marker to label the bags with what's inside and the date you processed the pears. Then, place the bags of pears in the freezer and use them within 10 to 12 months. You can use the pears while they're still frozen or thaw them overnight in the refrigerator.",
    "sentences": [
        " Choosing and Processing Pears Pick or purchase ripe pears.",
        "To determine if a pear is ready to pick or buy, gently squeeze near its neck.",
        "The flesh near the stem should be a little soft.",
        "If it's too hard, look for a different pear.Did You Know?",
        "Most pear varieties, such as Anjou, Bosc, Comice, and Seckel, don't change color as they ripen.",
        "If you get Bartlett pears, they should turn from green to yellow when they become ripe.",
        "Avoid pears that are soft around the middle because these are probably already mushy.",
        "Rinse the pears and peel them.",
        "Hold the pears under cool tap water to rinse away dirt.",
        "Then, place them on the counter and use a swivel or Y-peeler to remove the peels.",
        "You can discard the peels or use them to flavor liqueur.",
        "If the pear is too soft to peel, it's probably too ripe to freeze.",
        "Cut each pear in half and scoop out the core.",
        "Use a knife to carefully cut a pear in half lengthwise.",
        "Then, use a spoon or melon baller to remove the core with the seeds.",
        "You can also pull away the stem.",
        "Repeat this for each pear you want to freeze.Tip: At this point, you can slice the pears or chop them into pieces according to your preference.",
        "Try not to remove too much fruit from the center of the pear as you remove the core.",
        "Soak the pears in a vitamin C solution to prevent them from discoloring.",
        "Get out a large container and put 1 teaspoon (2 g) of crystalline ascorbic acid (vitamin C) into it.",
        "Pour in 1 gallon (3.8 L) of cold water and stir until the vitamin C dissolves.",
        "Then, add your peeled pears to the solution.",
        "Let the pears soak while you prepare the syrup.",
        "If you aren't making syrup and would rather dry pack the pears, soak the pears for at least 10 minutes.",
        "If you can't find crystalline ascorbic acid, crush 6 500-mg vitamin C tablets.",
        "Freezing Pears in Syrup Put the pears into a pot with sugar and water.",
        "You can customize how sweet or heavy you want the syrup to be.",
        "Place all of the pears you want to freeze into a large pot and add the syrup ingredients.",
        "To make:\nLight syrup: use 1 2/3 cups (333 g) of granulated sugar and 4 cups (950 ml) of water\nMedium syrup: use 2 2/3 cups (533 g) of granulated sugar and 4 cups (950 ml) of water\nHeavy syrup: use 4 cups (800 g) of granulated sugar and 4 cups (950 ml) of water Boil the pears in the syrup for 1 to 2 minutes.",
        "Turn the burner to medium-high and stir the mixture gently.",
        "The sugar should dissolve as it begins to boil.",
        "Let the pears cook in the syrup for 1 to 2 minutes.",
        "You can skim off foam if it floats to the surface.",
        "Chill the pears in the syrup until they're cool.",
        "Turn off the burner and place the pot with the pears into the refrigerator.",
        "You could also transfer them to a different container if you'd like them to cool faster.",
        "Refrigerate the pears until the fruit and syrup are cool.",
        "Fill your containers and leave ⁄2 to 1 inch (1.3 to 2.5 cm) of headspace.",
        "Spoon cooled pears into clean freezer-safe containers and pour in enough syrup to cover the fruit.",
        "If you're using wide-mouthed containers, leave ⁄2 to 1 inch (1.3 to 2.5 cm) of headspace.",
        "If you're using narrow-top containers, leave ⁄4 to 1 ⁄2 inches (1.9 to 3.8 cm) of headspace.Tip: Figure on using ⁄2 to ⁄3 cup (120 to 160 ml) of syrup for every 2 cups (450 g) of pears.",
        "Remember to wipe the rims of the containers before you seal them shut.",
        "Label the containers and store the pears for up to 10 to 12 months.",
        "Use a permanent marker to write on each container so you know that they have pears inside.",
        "Then, write the date you initially froze them.",
        "When you're ready to defrost the pears, transfer a container from the freezer to the refrigerator and let it thaw overnight.",
        "Dry-Packing Pears Line a sheet with parchment paper.",
        "Get out a baking sheet that will easily fit inside your freezer.",
        "Tear off a sheet of parchment paper and lay it on the sheet.",
        "The silicone in the parchment paper will prevent the pears from freezing to the sheet.",
        "If you don't have parchment paper, you can use a silicone baking mat.",
        "Drain the pears and lay them on the sheet.",
        "If you're freezing just a few pears, use a slotted spoon to lift the pears out of the vitamin C solution.",
        "To drain a large number of pears, place a strainer in the sink and slowly pour the pears into it.",
        "Then, arrange the pears on your parchment-paper lined sheet so there's at least ⁄4 inch (0.64 cm) of space between each.Variation: If you'd like to lightly sweeten the pears, mix 1/2 cup (100 g) of sugar into every 1 US quart (0.95 L) of pears after you've drained them.",
        "If the pears are touching while they freeze, they'll freeze in a clump that's difficult to separate.",
        "Freeze the pears on the sheet until they're hard.",
        "Place the sheet into the freezer and leave them until they're frozen solid.",
        "Depending on the size of the pear pieces, this could take 1 to 2 hours.",
        "It's fine to leave the pears on the sheet in the freezer overnight.",
        "Pack the frozen pears into sealable freezer bags.",
        "You can use any size freezer bags as long as they seal well.",
        "Fill your bag completely full of the frozen pears and squeeze out as much air as possible before you seal it shut.",
        "If you'll be using the pears for different purposes, consider dividing them into different size bags.",
        "For example, fill a few sandwich bags with frozen pears so you can quickly measure out fruit for a smoothie.",
        "Label the bags and store the pears in the freezer for up to 10 to 12 months.",
        "Use a permanent marker to label the bags with what's inside and the date you processed the pears.",
        "Then, place the bags of pears in the freezer and use them within 10 to 12 months.",
        "You can use the pears while they're still frozen or thaw them overnight in the refrigerator."
    ]
}