{
    "title": "How to Measure Torso Length",
    "url": "https://www.wikihow.com/Measure-Torso-Length",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Body Type and Fashion"
    ],
    "methods": [
        {
            "name": "Taking a Measurement for a Backpack",
            "steps": [
                {
                    "headline": "Find a flexible tape measure.",
                    "description": "These tape measures come in plastic or cloth. You can even find paper ones, but you need one that will bend to the contours of your body. A standard tape measure won't bend. You can buy flexible tape measures in the sewing section of craft stores. They're usually with the needles, scissors, and other sewing accessories. Use a piece of string and a ruler if you don't have a tape measure. Cut a piece of yarn or other string that's longer than your torso. Then, you can use it to measure the length by starting with one end and placing your finger where the measurement ends. Hold it against the ruler to figure out the length."
                },
                {
                    "headline": "Have a friend help you.",
                    "description": "This measurement is a bit difficult to do on your own, as you should take it down the curve of your back. They'll be able to feel for the right spots easier than you can. If you can't find a friend, you can use a bit of tape to hold it in place at the top. Then, use your other hand to guide the tape measure down your back."
                },
                {
                    "headline": "Tilt your head forward to find the bone at the base of your neck.",
                    "description": "This spot is called the C7 vertebra, and you should be able to feel for it. It's the one that sticks out the farthest, so use your fingers to find it by running them along your neck at the base. Tilting your head forward will help those bones protrude a bit."
                },
                {
                    "headline": "Set the end of the tape measure at the bone you found.",
                    "description": "Have someone hold the end up at this point on your neck. This spot is where you will start the measurement of your torso. Be careful to hold this in the proper place, as it's important for figuring out the right frame size. If you're doing this yourself, keep the tape measure there with a bit of medical or masking tape if you're having trouble holding it there."
                },
                {
                    "headline": "Run the tape measure down your spine.",
                    "description": "In this case, you need to follow the curves of your body. Don't yank the tape measure so it falls straight down from your shoulders. That way, the backpack frame you buy will fall on the proper part of your back."
                },
                {
                    "headline": "Stop the measurement at your natural waist.",
                    "description": "The torso runs to the iliac crest, which is the space just above your hip bones. If you're not sure where it is, place your hands on your natural waist and press inward and downward a bit. Your hands should rest just on top of your hip bones. Find the part of the spine that's even with this point, and take the measurement there. Mark it down in inches and centimeters."
                },
                {
                    "headline": "Match the backpack frame size with your measurement.",
                    "description": "Usually, frame sizes are given in inches or centimeters, depending on where you live. In the U.S., an extra small is 15 to 17 inches (38 to 43 cm); small is 16 to 19 inches (41 to 48 cm); medium is 18 to 21 inches (46 to 53 cm); and large is 20 to 23 inches (51 to 58 cm). If you're in between sizes, pick the smaller frame."
                }
            ]
        },
        {
            "name": "Measuring for a One-Piece Swimsuit",
            "steps": [
                {
                    "headline": "Grab your flexible tape measure.",
                    "description": "Get one in plastic or cloth for this measurement, as a paper one will likely break as you pass it through your legs while measuring. However, it needs to bend with your body, so don't use a standard tape measure. Look for flexible tape measures in sewing and craft stores. If you don't have a flexible tape measure, cut a long piece of string to do the measurement, then place it on a ruler to find out the length."
                },
                {
                    "headline": "Place the tape measure on one shoulder in the front.",
                    "description": "Pick a shoulder, and put the end of the tape measure at the very top of that shoulder. Place it where the strap of a swimsuit would hit. Angle the end down toward the middle of your body. This measurement is also called the torso loop."
                },
                {
                    "headline": "Put the tape measure through your legs to go up your back.",
                    "description": "Run the long end of the tape measure down the center of your body, pulling it slightly taut. It will fall at an angle from your shoulder. Pass it between your legs from front to back, and then use your other hand to grab it in the back. If you're doing this yourself, it may be easiest to lay the tape measure on the floor between your legs, then grab an end in each hand."
                },
                {
                    "headline": "Return to the starting point to take the measurement.",
                    "description": "Pull the end somewhat taut, and then hold the tape measure up to the other end that's resting on your shoulder. Note where the two meet, and write down that measurement. Take the measurement in both inches and centimeters and use it to find the best fitting swimsuit online."
                }
            ]
        },
        {
            "name": "Getting a Measurement for a Shirt",
            "steps": [
                {
                    "headline": "Grab a friend to assist you.",
                    "description": "It's hard to do this measurement yourself, as it runs down your back. It will be easier to have someone else take the measurement because they'll be better able to spot the starting and ending locations. You can tape it at the top if you don't have anyone around to help you. A flexible tape measure will work best for this measurement. However, if you don't have one, you can likely use a regular tape measure because you take the measurement straight down from your shoulders."
                },
                {
                    "headline": "Put the end of the tape measure at the base of the neck on your back.",
                    "description": "This is the point where the top of a regular t-shirt would be. If you're wearing a collared shirt, start at the bottom of the collar instead. Hold the very end of the tape measure here."
                },
                {
                    "headline": "Run the tape measure to the top of your crotch for a tucked-in shirt.",
                    "description": "You need the shirt to be a little longer if you plan to tuck it in all the time. Hold the tape measure straight down from your shoulders; don't follow your spine. Mark the measurement that's just below your butt. Take the measurement down in inches and centimeters, just in case."
                },
                {
                    "headline": "Take a slightly shorter measurement for an untucked shirt.",
                    "description": "Typically, if you plan to wear your shirt untucked, it doesn't need to be quite as long. Run the tape measure down from your shoulders without bending in for your spine. Find the spot where you want your shirt to fall, and write down that measurement. Aim for about 2 inches (5.1 cm) above your crotch."
                }
            ]
        }
    ],
    "tyn": [
        "Tape measure",
        "String and ruler, optional",
        "Something to take notes on",
        "A friend, if possible"
    ],
    "text": " Taking a Measurement for a Backpack Find a flexible tape measure. These tape measures come in plastic or cloth. You can even find paper ones, but you need one that will bend to the contours of your body. A standard tape measure won't bend. You can buy flexible tape measures in the sewing section of craft stores. They're usually with the needles, scissors, and other sewing accessories. Use a piece of string and a ruler if you don't have a tape measure. Cut a piece of yarn or other string that's longer than your torso. Then, you can use it to measure the length by starting with one end and placing your finger where the measurement ends. Hold it against the ruler to figure out the length. Have a friend help you. This measurement is a bit difficult to do on your own, as you should take it down the curve of your back. They'll be able to feel for the right spots easier than you can. If you can't find a friend, you can use a bit of tape to hold it in place at the top. Then, use your other hand to guide the tape measure down your back. Tilt your head forward to find the bone at the base of your neck. This spot is called the C7 vertebra, and you should be able to feel for it. It's the one that sticks out the farthest, so use your fingers to find it by running them along your neck at the base. Tilting your head forward will help those bones protrude a bit. Set the end of the tape measure at the bone you found. Have someone hold the end up at this point on your neck. This spot is where you will start the measurement of your torso. Be careful to hold this in the proper place, as it's important for figuring out the right frame size. If you're doing this yourself, keep the tape measure there with a bit of medical or masking tape if you're having trouble holding it there. Run the tape measure down your spine. In this case, you need to follow the curves of your body. Don't yank the tape measure so it falls straight down from your shoulders. That way, the backpack frame you buy will fall on the proper part of your back. Stop the measurement at your natural waist. The torso runs to the iliac crest, which is the space just above your hip bones. If you're not sure where it is, place your hands on your natural waist and press inward and downward a bit. Your hands should rest just on top of your hip bones. Find the part of the spine that's even with this point, and take the measurement there. Mark it down in inches and centimeters. Match the backpack frame size with your measurement. Usually, frame sizes are given in inches or centimeters, depending on where you live. In the U.S., an extra small is 15 to 17 inches (38 to 43 cm); small is 16 to 19 inches (41 to 48 cm); medium is 18 to 21 inches (46 to 53 cm); and large is 20 to 23 inches (51 to 58 cm). If you're in between sizes, pick the smaller frame. Measuring for a One-Piece Swimsuit Grab your flexible tape measure. Get one in plastic or cloth for this measurement, as a paper one will likely break as you pass it through your legs while measuring. However, it needs to bend with your body, so don't use a standard tape measure. Look for flexible tape measures in sewing and craft stores. If you don't have a flexible tape measure, cut a long piece of string to do the measurement, then place it on a ruler to find out the length. Place the tape measure on one shoulder in the front. Pick a shoulder, and put the end of the tape measure at the very top of that shoulder. Place it where the strap of a swimsuit would hit. Angle the end down toward the middle of your body. This measurement is also called the torso loop. Put the tape measure through your legs to go up your back. Run the long end of the tape measure down the center of your body, pulling it slightly taut. It will fall at an angle from your shoulder. Pass it between your legs from front to back, and then use your other hand to grab it in the back. If you're doing this yourself, it may be easiest to lay the tape measure on the floor between your legs, then grab an end in each hand. Return to the starting point to take the measurement. Pull the end somewhat taut, and then hold the tape measure up to the other end that's resting on your shoulder. Note where the two meet, and write down that measurement. Take the measurement in both inches and centimeters and use it to find the best fitting swimsuit online. Getting a Measurement for a Shirt Grab a friend to assist you. It's hard to do this measurement yourself, as it runs down your back. It will be easier to have someone else take the measurement because they'll be better able to spot the starting and ending locations. You can tape it at the top if you don't have anyone around to help you. A flexible tape measure will work best for this measurement. However, if you don't have one, you can likely use a regular tape measure because you take the measurement straight down from your shoulders. Put the end of the tape measure at the base of the neck on your back. This is the point where the top of a regular t-shirt would be. If you're wearing a collared shirt, start at the bottom of the collar instead. Hold the very end of the tape measure here. Run the tape measure to the top of your crotch for a tucked-in shirt. You need the shirt to be a little longer if you plan to tuck it in all the time. Hold the tape measure straight down from your shoulders; don't follow your spine. Mark the measurement that's just below your butt. Take the measurement down in inches and centimeters, just in case. Take a slightly shorter measurement for an untucked shirt. Typically, if you plan to wear your shirt untucked, it doesn't need to be quite as long. Run the tape measure down from your shoulders without bending in for your spine. Find the spot where you want your shirt to fall, and write down that measurement. Aim for about 2 inches (5.1 cm) above your crotch.",
    "sentences": [
        " Taking a Measurement for a Backpack Find a flexible tape measure.",
        "These tape measures come in plastic or cloth.",
        "You can even find paper ones, but you need one that will bend to the contours of your body.",
        "A standard tape measure won't bend.",
        "You can buy flexible tape measures in the sewing section of craft stores.",
        "They're usually with the needles, scissors, and other sewing accessories.",
        "Use a piece of string and a ruler if you don't have a tape measure.",
        "Cut a piece of yarn or other string that's longer than your torso.",
        "Then, you can use it to measure the length by starting with one end and placing your finger where the measurement ends.",
        "Hold it against the ruler to figure out the length.",
        "Have a friend help you.",
        "This measurement is a bit difficult to do on your own, as you should take it down the curve of your back.",
        "They'll be able to feel for the right spots easier than you can.",
        "If you can't find a friend, you can use a bit of tape to hold it in place at the top.",
        "Then, use your other hand to guide the tape measure down your back.",
        "Tilt your head forward to find the bone at the base of your neck.",
        "This spot is called the C7 vertebra, and you should be able to feel for it.",
        "It's the one that sticks out the farthest, so use your fingers to find it by running them along your neck at the base.",
        "Tilting your head forward will help those bones protrude a bit.",
        "Set the end of the tape measure at the bone you found.",
        "Have someone hold the end up at this point on your neck.",
        "This spot is where you will start the measurement of your torso.",
        "Be careful to hold this in the proper place, as it's important for figuring out the right frame size.",
        "If you're doing this yourself, keep the tape measure there with a bit of medical or masking tape if you're having trouble holding it there.",
        "Run the tape measure down your spine.",
        "In this case, you need to follow the curves of your body.",
        "Don't yank the tape measure so it falls straight down from your shoulders.",
        "That way, the backpack frame you buy will fall on the proper part of your back.",
        "Stop the measurement at your natural waist.",
        "The torso runs to the iliac crest, which is the space just above your hip bones.",
        "If you're not sure where it is, place your hands on your natural waist and press inward and downward a bit.",
        "Your hands should rest just on top of your hip bones.",
        "Find the part of the spine that's even with this point, and take the measurement there.",
        "Mark it down in inches and centimeters.",
        "Match the backpack frame size with your measurement.",
        "Usually, frame sizes are given in inches or centimeters, depending on where you live.",
        "In the U.S., an extra small is 15 to 17 inches (38 to 43 cm); small is 16 to 19 inches (41 to 48 cm); medium is 18 to 21 inches (46 to 53 cm); and large is 20 to 23 inches (51 to 58 cm).",
        "If you're in between sizes, pick the smaller frame.",
        "Measuring for a One-Piece Swimsuit Grab your flexible tape measure.",
        "Get one in plastic or cloth for this measurement, as a paper one will likely break as you pass it through your legs while measuring.",
        "However, it needs to bend with your body, so don't use a standard tape measure.",
        "Look for flexible tape measures in sewing and craft stores.",
        "If you don't have a flexible tape measure, cut a long piece of string to do the measurement, then place it on a ruler to find out the length.",
        "Place the tape measure on one shoulder in the front.",
        "Pick a shoulder, and put the end of the tape measure at the very top of that shoulder.",
        "Place it where the strap of a swimsuit would hit.",
        "Angle the end down toward the middle of your body.",
        "This measurement is also called the torso loop.",
        "Put the tape measure through your legs to go up your back.",
        "Run the long end of the tape measure down the center of your body, pulling it slightly taut.",
        "It will fall at an angle from your shoulder.",
        "Pass it between your legs from front to back, and then use your other hand to grab it in the back.",
        "If you're doing this yourself, it may be easiest to lay the tape measure on the floor between your legs, then grab an end in each hand.",
        "Return to the starting point to take the measurement.",
        "Pull the end somewhat taut, and then hold the tape measure up to the other end that's resting on your shoulder.",
        "Note where the two meet, and write down that measurement.",
        "Take the measurement in both inches and centimeters and use it to find the best fitting swimsuit online.",
        "Getting a Measurement for a Shirt Grab a friend to assist you.",
        "It's hard to do this measurement yourself, as it runs down your back.",
        "It will be easier to have someone else take the measurement because they'll be better able to spot the starting and ending locations.",
        "You can tape it at the top if you don't have anyone around to help you.",
        "A flexible tape measure will work best for this measurement.",
        "However, if you don't have one, you can likely use a regular tape measure because you take the measurement straight down from your shoulders.",
        "Put the end of the tape measure at the base of the neck on your back.",
        "This is the point where the top of a regular t-shirt would be.",
        "If you're wearing a collared shirt, start at the bottom of the collar instead.",
        "Hold the very end of the tape measure here.",
        "Run the tape measure to the top of your crotch for a tucked-in shirt.",
        "You need the shirt to be a little longer if you plan to tuck it in all the time.",
        "Hold the tape measure straight down from your shoulders; don't follow your spine.",
        "Mark the measurement that's just below your butt.",
        "Take the measurement down in inches and centimeters, just in case.",
        "Take a slightly shorter measurement for an untucked shirt.",
        "Typically, if you plan to wear your shirt untucked, it doesn't need to be quite as long.",
        "Run the tape measure down from your shoulders without bending in for your spine.",
        "Find the spot where you want your shirt to fall, and write down that measurement.",
        "Aim for about 2 inches (5.1 cm) above your crotch."
    ]
}