{
    "title": "How to Fold a Razor Scooter",
    "url": "https://www.wikihow.com/Fold-a-Razor-Scooter",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Scooters",
        "Motorized Scooters"
    ],
    "methods": [
        {
            "name": "Releasing the Locking Levers",
            "steps": [
                {
                    "headline": "Place the scooter on the ground and step on it with one foot.",
                    "description": "Put it down to keep it stable as you release the locking mechanisms. Then, plant your foot between the wheels on the footstand. Press your foot down firmly and hold onto the handlebars to keep the scooter from moving. Although Razor scooters are easy to fold, they have to be folded in a certain way. If you don’t steady the scooter and unlock the release levers at the right time, the scooter could come unfolded. Be mindful of your fingers as you fold the scooter. There isn’t much risk of getting caught by the moving components, but you should still keep your fingers clear for safety."
                },
                {
                    "headline": "Push the release buttons on the handles to slide out the grips.",
                    "description": "The scooter has a small button on the backside of each handlebar. When you’re standing behind the handlebars, the buttons will be right ahead of you. Push one of the buttons, then pull the closest grip away from the rest of the scooter. Repeat this with the opposite grip. Most Razor scooters can be folded without removing the grips. Simply unlatch the other levers. If you experience any problems, try pulling out the grips first. The Razor Jr. type of scooter is much simpler since it’s meant for younger children. It doesn’t have the handlebar buttons or the steering column clasp, so you only have to take care of the last release lever."
                },
                {
                    "headline": "Pull open the clasp on the side of the steering column.",
                    "description": "The front piece of the scooter, which contains the handlebars and connects to the footpad, is adjustable. Look for a circular piece of metal about halfway down from the handlebars. One side of the lever is a clasp you can pull away from the scooter. If you assembled the scooter yourself, this quick-release lever is what you may have used to raise the steering column so the handlebars are at a comfortable height."
                },
                {
                    "headline": "Push the steering column down as far as it will go.",
                    "description": "Releasing the clasp allows you to adjust the steering column. To begin folding the scooter, lower the handlebars. Push the handlebars down with one hand as you hold onto the steering column with your other hand. The steering column will lower and disappear into the main part of the scooter. Flip the clasp closed again to hold the steering column in place. The tube is the component that controls the height of the handlebars. When you’re ready to ride the scooter, release the clasp again and raise the handlebars back up."
                },
                {
                    "headline": "Turn the scooter upside down while holding the steering column.",
                    "description": "Step off the scooter, then flip it over. The steering column is loose, so keep a firm grip on the handlebars so it doesn’t slide back out. You could hold the handlebars against the ground or your body to ensure the steering column doesn’t pop back out from the scooter again. If the steering column comes back out, the scooter won’t fold up properly. Turn the scooter back over and push the handlebars down again."
                },
                {
                    "headline": "Push the joint-release lever on the bottom of the scooter.",
                    "description": "While holding the steering column still, reach for the joint-release lever with your free hand. It’s near the front wheel, close to where the steering column connects to the footpad. Flip the lever to the side to release the locking mechanism. Once you flip it, the scooter will almost automatically fold up into a shape that is easy to carry around. As long as you have the scooter upside-down, gravity takes care of most of the folding. If you need to, push the steering column component down to the footpad to compact the scooter. If you’re trying to fold a Razor Jr., this is the only lever you need to deal with. It’s on the back side of the steering column, directly in front of the footpad."
                },
                {
                    "headline": "Unfold the scooter by pressing the release lever.",
                    "description": "Hold the scooter in your hands, then push the quick-release lever toward the footpad. After pushing it, pull the handlebar in the opposite direction to pop open the scooter. Afterward, you can open the clasp and pull the steering column up to set it at the height you desire. Close the clasp to lock it in place. Unfolding the scooter is meant to be as easy as folding it is. If you’re having trouble with it, check the release lever first for debris and other signs of damage."
                }
            ]
        },
        {
            "name": "Troubleshooting a Stuck Scooter",
            "steps": [
                {
                    "headline": "Pull the joint-release lever all the way open to free the steering column.",
                    "description": "Make sure the latch didn’t get stuck. When it is closed, it points down toward the front wheel. Pull it up so it points toward the handlebars. If it doesn’t open all the way, then it will prevent you from folding up the scooter. The lever allows you to fold the scooter in half. It can also prevent you from opening the scooter back up if it's in the locked position."
                },
                {
                    "headline": "Move the handlebars if they prevent the scooter from folding.",
                    "description": "Check that you pulled the handlebars off the steering column as far as you can. If you have a scooter that requires you to move them, they can get in the way of the footpad. Press down hard on the release buttons on the handlebars, then move them away from the steering column as far as possible. Keep in mind that the handlebars need lay flat against the footpad. If they’re facing the footpad when you start folding the scooter, open up the steering column’s clasp to turn them around."
                },
                {
                    "headline": "Wipe stuck levers with a damp rag to remove debris.",
                    "description": "If you aren’t able to fully open the quick-release lever and steering column clasp, you won’t be able to fold up the scooter effectively. Dampen a cloth or paper towel in a little bit of lukewarm water, then remove as much debris as you can. Try the levers afterward to see if they work. Cleaning products aren’t recommended by the manufacturer, so you don’t need to use anything special to make your scooter look brand new. Alcohol and ammonia-based products could actually damage plastic and decals."
                },
                {
                    "headline": "Take apart the scooter to clean it if you still can’t fold it.",
                    "description": "It may have accumulated a significant amount of debris preventing the parts from moving. You will need a 5 mm (0.20 in) allen wrench to remove the steering column. Turn the screw in the clasp counterclockwise to release it. Then, use a 3 mm (0.12 in) allen wrench to remove the screw in the quick-release lever between the footpad and steering column. Keep in mind that you will need to put the parts back together when you’re done. If it seems too complicated to do on your own, contact Razor or take the scooter to a repair shop."
                },
                {
                    "headline": "Clean the metal components off with an oil-based lubricant.",
                    "description": "Spray some WD-40 or another cleaner on the levers to get them working again. Use an old rag to wipe away any grime you notice on the metal. When they look clean, reassemble the scooter and test it out again. If the levers still don’t work, contact Razor’s support line. Use oil only on metal parts. It could damage plastic or decals, so it’s not worth risking on the rest of the scooter. Clear off those components with clean water. You may be able to lubricate the levers before removing them. Try spraying some of the oil behind the stuck lever. Let it soak in for 2 or 3 minutes, and then try operating the lever again."
                }
            ]
        }
    ],
    "tyn": [
        "Troubleshooting a Stuck Scooter",
        "Cloth or paper towel",
        "Water",
        "Oil-based lubricant",
        "5 mm (0.20 in) allen wrench",
        "3 mm (0.12 in) allen wrench"
    ],
    "text": " Releasing the Locking Levers Place the scooter on the ground and step on it with one foot. Put it down to keep it stable as you release the locking mechanisms. Then, plant your foot between the wheels on the footstand. Press your foot down firmly and hold onto the handlebars to keep the scooter from moving. Although Razor scooters are easy to fold, they have to be folded in a certain way. If you don’t steady the scooter and unlock the release levers at the right time, the scooter could come unfolded. Be mindful of your fingers as you fold the scooter. There isn’t much risk of getting caught by the moving components, but you should still keep your fingers clear for safety. Push the release buttons on the handles to slide out the grips. The scooter has a small button on the backside of each handlebar. When you’re standing behind the handlebars, the buttons will be right ahead of you. Push one of the buttons, then pull the closest grip away from the rest of the scooter. Repeat this with the opposite grip. Most Razor scooters can be folded without removing the grips. Simply unlatch the other levers. If you experience any problems, try pulling out the grips first. The Razor Jr. type of scooter is much simpler since it’s meant for younger children. It doesn’t have the handlebar buttons or the steering column clasp, so you only have to take care of the last release lever. Pull open the clasp on the side of the steering column. The front piece of the scooter, which contains the handlebars and connects to the footpad, is adjustable. Look for a circular piece of metal about halfway down from the handlebars. One side of the lever is a clasp you can pull away from the scooter. If you assembled the scooter yourself, this quick-release lever is what you may have used to raise the steering column so the handlebars are at a comfortable height. Push the steering column down as far as it will go. Releasing the clasp allows you to adjust the steering column. To begin folding the scooter, lower the handlebars. Push the handlebars down with one hand as you hold onto the steering column with your other hand. The steering column will lower and disappear into the main part of the scooter. Flip the clasp closed again to hold the steering column in place. The tube is the component that controls the height of the handlebars. When you’re ready to ride the scooter, release the clasp again and raise the handlebars back up. Turn the scooter upside down while holding the steering column. Step off the scooter, then flip it over. The steering column is loose, so keep a firm grip on the handlebars so it doesn’t slide back out. You could hold the handlebars against the ground or your body to ensure the steering column doesn’t pop back out from the scooter again. If the steering column comes back out, the scooter won’t fold up properly. Turn the scooter back over and push the handlebars down again. Push the joint-release lever on the bottom of the scooter. While holding the steering column still, reach for the joint-release lever with your free hand. It’s near the front wheel, close to where the steering column connects to the footpad. Flip the lever to the side to release the locking mechanism. Once you flip it, the scooter will almost automatically fold up into a shape that is easy to carry around. As long as you have the scooter upside-down, gravity takes care of most of the folding. If you need to, push the steering column component down to the footpad to compact the scooter. If you’re trying to fold a Razor Jr., this is the only lever you need to deal with. It’s on the back side of the steering column, directly in front of the footpad. Unfold the scooter by pressing the release lever. Hold the scooter in your hands, then push the quick-release lever toward the footpad. After pushing it, pull the handlebar in the opposite direction to pop open the scooter. Afterward, you can open the clasp and pull the steering column up to set it at the height you desire. Close the clasp to lock it in place. Unfolding the scooter is meant to be as easy as folding it is. If you’re having trouble with it, check the release lever first for debris and other signs of damage. Troubleshooting a Stuck Scooter Pull the joint-release lever all the way open to free the steering column. Make sure the latch didn’t get stuck. When it is closed, it points down toward the front wheel. Pull it up so it points toward the handlebars. If it doesn’t open all the way, then it will prevent you from folding up the scooter. The lever allows you to fold the scooter in half. It can also prevent you from opening the scooter back up if it's in the locked position. Move the handlebars if they prevent the scooter from folding. Check that you pulled the handlebars off the steering column as far as you can. If you have a scooter that requires you to move them, they can get in the way of the footpad. Press down hard on the release buttons on the handlebars, then move them away from the steering column as far as possible. Keep in mind that the handlebars need lay flat against the footpad. If they’re facing the footpad when you start folding the scooter, open up the steering column’s clasp to turn them around. Wipe stuck levers with a damp rag to remove debris. If you aren’t able to fully open the quick-release lever and steering column clasp, you won’t be able to fold up the scooter effectively. Dampen a cloth or paper towel in a little bit of lukewarm water, then remove as much debris as you can. Try the levers afterward to see if they work. Cleaning products aren’t recommended by the manufacturer, so you don’t need to use anything special to make your scooter look brand new. Alcohol and ammonia-based products could actually damage plastic and decals. Take apart the scooter to clean it if you still can’t fold it. It may have accumulated a significant amount of debris preventing the parts from moving. You will need a 5 mm (0.20 in) allen wrench to remove the steering column. Turn the screw in the clasp counterclockwise to release it. Then, use a 3 mm (0.12 in) allen wrench to remove the screw in the quick-release lever between the footpad and steering column. Keep in mind that you will need to put the parts back together when you’re done. If it seems too complicated to do on your own, contact Razor or take the scooter to a repair shop. Clean the metal components off with an oil-based lubricant. Spray some WD-40 or another cleaner on the levers to get them working again. Use an old rag to wipe away any grime you notice on the metal. When they look clean, reassemble the scooter and test it out again. If the levers still don’t work, contact Razor’s support line. Use oil only on metal parts. It could damage plastic or decals, so it’s not worth risking on the rest of the scooter. Clear off those components with clean water. You may be able to lubricate the levers before removing them. Try spraying some of the oil behind the stuck lever. Let it soak in for 2 or 3 minutes, and then try operating the lever again.",
    "sentences": [
        " Releasing the Locking Levers Place the scooter on the ground and step on it with one foot.",
        "Put it down to keep it stable as you release the locking mechanisms.",
        "Then, plant your foot between the wheels on the footstand.",
        "Press your foot down firmly and hold onto the handlebars to keep the scooter from moving.",
        "Although Razor scooters are easy to fold, they have to be folded in a certain way.",
        "If you don’t steady the scooter and unlock the release levers at the right time, the scooter could come unfolded.",
        "Be mindful of your fingers as you fold the scooter.",
        "There isn’t much risk of getting caught by the moving components, but you should still keep your fingers clear for safety.",
        "Push the release buttons on the handles to slide out the grips.",
        "The scooter has a small button on the backside of each handlebar.",
        "When you’re standing behind the handlebars, the buttons will be right ahead of you.",
        "Push one of the buttons, then pull the closest grip away from the rest of the scooter.",
        "Repeat this with the opposite grip.",
        "Most Razor scooters can be folded without removing the grips.",
        "Simply unlatch the other levers.",
        "If you experience any problems, try pulling out the grips first.",
        "The Razor Jr. type of scooter is much simpler since it’s meant for younger children.",
        "It doesn’t have the handlebar buttons or the steering column clasp, so you only have to take care of the last release lever.",
        "Pull open the clasp on the side of the steering column.",
        "The front piece of the scooter, which contains the handlebars and connects to the footpad, is adjustable.",
        "Look for a circular piece of metal about halfway down from the handlebars.",
        "One side of the lever is a clasp you can pull away from the scooter.",
        "If you assembled the scooter yourself, this quick-release lever is what you may have used to raise the steering column so the handlebars are at a comfortable height.",
        "Push the steering column down as far as it will go.",
        "Releasing the clasp allows you to adjust the steering column.",
        "To begin folding the scooter, lower the handlebars.",
        "Push the handlebars down with one hand as you hold onto the steering column with your other hand.",
        "The steering column will lower and disappear into the main part of the scooter.",
        "Flip the clasp closed again to hold the steering column in place.",
        "The tube is the component that controls the height of the handlebars.",
        "When you’re ready to ride the scooter, release the clasp again and raise the handlebars back up.",
        "Turn the scooter upside down while holding the steering column.",
        "Step off the scooter, then flip it over.",
        "The steering column is loose, so keep a firm grip on the handlebars so it doesn’t slide back out.",
        "You could hold the handlebars against the ground or your body to ensure the steering column doesn’t pop back out from the scooter again.",
        "If the steering column comes back out, the scooter won’t fold up properly.",
        "Turn the scooter back over and push the handlebars down again.",
        "Push the joint-release lever on the bottom of the scooter.",
        "While holding the steering column still, reach for the joint-release lever with your free hand.",
        "It’s near the front wheel, close to where the steering column connects to the footpad.",
        "Flip the lever to the side to release the locking mechanism.",
        "Once you flip it, the scooter will almost automatically fold up into a shape that is easy to carry around.",
        "As long as you have the scooter upside-down, gravity takes care of most of the folding.",
        "If you need to, push the steering column component down to the footpad to compact the scooter.",
        "If you’re trying to fold a Razor Jr., this is the only lever you need to deal with.",
        "It’s on the back side of the steering column, directly in front of the footpad.",
        "Unfold the scooter by pressing the release lever.",
        "Hold the scooter in your hands, then push the quick-release lever toward the footpad.",
        "After pushing it, pull the handlebar in the opposite direction to pop open the scooter.",
        "Afterward, you can open the clasp and pull the steering column up to set it at the height you desire.",
        "Close the clasp to lock it in place.",
        "Unfolding the scooter is meant to be as easy as folding it is.",
        "If you’re having trouble with it, check the release lever first for debris and other signs of damage.",
        "Troubleshooting a Stuck Scooter Pull the joint-release lever all the way open to free the steering column.",
        "Make sure the latch didn’t get stuck.",
        "When it is closed, it points down toward the front wheel.",
        "Pull it up so it points toward the handlebars.",
        "If it doesn’t open all the way, then it will prevent you from folding up the scooter.",
        "The lever allows you to fold the scooter in half.",
        "It can also prevent you from opening the scooter back up if it's in the locked position.",
        "Move the handlebars if they prevent the scooter from folding.",
        "Check that you pulled the handlebars off the steering column as far as you can.",
        "If you have a scooter that requires you to move them, they can get in the way of the footpad.",
        "Press down hard on the release buttons on the handlebars, then move them away from the steering column as far as possible.",
        "Keep in mind that the handlebars need lay flat against the footpad.",
        "If they’re facing the footpad when you start folding the scooter, open up the steering column’s clasp to turn them around.",
        "Wipe stuck levers with a damp rag to remove debris.",
        "If you aren’t able to fully open the quick-release lever and steering column clasp, you won’t be able to fold up the scooter effectively.",
        "Dampen a cloth or paper towel in a little bit of lukewarm water, then remove as much debris as you can.",
        "Try the levers afterward to see if they work.",
        "Cleaning products aren’t recommended by the manufacturer, so you don’t need to use anything special to make your scooter look brand new.",
        "Alcohol and ammonia-based products could actually damage plastic and decals.",
        "Take apart the scooter to clean it if you still can’t fold it.",
        "It may have accumulated a significant amount of debris preventing the parts from moving.",
        "You will need a 5 mm (0.20 in) allen wrench to remove the steering column.",
        "Turn the screw in the clasp counterclockwise to release it.",
        "Then, use a 3 mm (0.12 in) allen wrench to remove the screw in the quick-release lever between the footpad and steering column.",
        "Keep in mind that you will need to put the parts back together when you’re done.",
        "If it seems too complicated to do on your own, contact Razor or take the scooter to a repair shop.",
        "Clean the metal components off with an oil-based lubricant.",
        "Spray some WD-40 or another cleaner on the levers to get them working again.",
        "Use an old rag to wipe away any grime you notice on the metal.",
        "When they look clean, reassemble the scooter and test it out again.",
        "If the levers still don’t work, contact Razor’s support line.",
        "Use oil only on metal parts.",
        "It could damage plastic or decals, so it’s not worth risking on the rest of the scooter.",
        "Clear off those components with clean water.",
        "You may be able to lubricate the levers before removing them.",
        "Try spraying some of the oil behind the stuck lever.",
        "Let it soak in for 2 or 3 minutes, and then try operating the lever again."
    ]
}