{
    "title": "How to Paint Stained Cabinets",
    "url": "https://www.wikihow.com/Paint-Stained-Cabinets",
    "category_hierarchy": [
        "Home and Garden",
        "Furniture",
        "Cabinets and Cupboards"
    ],
    "parts": [
        {
            "name": "Cleaning and Prepping Your Cabinets",
            "steps": [
                {
                    "headline": "Remove all appliances and containers from your countertop.",
                    "description": "Before you do anything, remove everything from your countertops to make cleaning, stripping, and painting easier. If there is a table or any other furniture in the area, move it to a different part of your house to avoid bumping into things while you’re working around the room. If you haven't already, you may want to empty the cabinets, as well."
                },
                {
                    "headline": "Clean your cabinets by wiping them down with a damp cloth.",
                    "description": "Put a little bit of warm water on a clean cloth and wring out the excess water. Rub every exterior section of your cabinets to remove any dust, dirt, or grime. Add 1-2 drops of mild dish soap to the cloth if you have trouble cleaning any particularly dirty areas. For cabinets that are above a stove or microwave, you may need to use a degreaser to remove oil or grease. Spray greasy areas with your degreaser or cleaning agent and scrub aggressively with a thick sponge. Don’t forget to clean the areas where the doors overlap on top of the frame."
                },
                {
                    "headline": "Wipe your cabinets dry and let them air out.",
                    "description": "Use a clean cloth to rub your cabinets dry. Rub in the direction of the grain to avoid missing indentations in the wood. Once every cabinet surface is dry, open a window and let the cabinets air out for 3-4 hours.Tip: Even if you think your cabinets are dry after you’ve wiped them down, you should still let your cabinets air dry. You don’t want to trap any moisture in your wood."
                },
                {
                    "headline": "Remove and label every door and drawer.",
                    "description": "Use a flathead or Philips-head screwdriver to remove every bracket and screw attaching your doors to the frame. Lift every drawer out of its slot and set all of your pieces aside. Label each drawer and door after you remove it by putting a piece of tape on it and writing its location on the back. This way, when it comes to reinstalling the drawers and doors, you won’t need to worry about trying to find the right space for each door or drawer. On the label, you can describe each piece’s location or use an organizational label. For example, you could write, “third door, top” or assign each row and column a letter and number, making the top left cabinet “A1” and the cabinet below it “B1.”\nYou can draw a diagram and use numbers to label your cabinets if you prefer. You can choose to do this before you clean your cabinets, but it could make cleaning more difficult since you’ll have to brace each door and drawer against something to wipe it."
                },
                {
                    "headline": "Lay drop cloths down on your countertop and floor.",
                    "description": "Set out one drop cloth on top of your counters and one drop cloth on the floor along your toe kick or baseboard. This will prevent primer, wood dust, or paint from getting on your counters or kitchen floor. A toe kick refers to the wood or plastic barrier at the bottom of your cabinets. It is designed to prevent structural damage to the wood from accidental kicks or spills."
                }
            ]
        },
        {
            "name": "Stripping and Sanding the Cabinets",
            "steps": [
                {
                    "headline": "Put on a dust mask or respirator and a thick pair of gloves.",
                    "description": "The fumes in most stripping agents, lacquer thinners, and primers are lung irritants. Prevent damage to your lungs by wearing a thick dust mask or respirator. Wear a pair of thick gloves to avoid getting stripping agent on your skin. Open a window if you haven’t already. The ventilation will prevent fumes from building up in your kitchen."
                },
                {
                    "headline": "Apply a gel or liquid stripping agent to your cabinets with a natural brush.",
                    "description": "Wood stripper can be purchased at a local hardware store or online. Select a stripper designed for cabinets by reading the label carefully. Fill a paint tray with your stripping agent and apply it to every stained section with a natural brush. Wait 15-30 minutes to give your stripping agent time to eat into the varnish or stain.Warning: You can use a heat gun to melt the varnish or stain, but this can be dangerous and may burn the cabinets. Unless you have experience using a heat gun, it’s best to stick to traditional stripping methods. There are different stripping agents for fence posts, exterior walls, and delicate furniture. Select a stripper that is designed for cabinets or wood furniture. For each cabinet door or drawer, do each step with your removable pieces set on top of a set of sawhorses or a stable work surface."
                },
                {
                    "headline": "Set a bucket or pan underneath the area that you’re going to scrape.",
                    "description": "When you scrape the stripper away, the agent that you applied will pool up in the direction that you scrape. To catch it as it drips off, keep a bucket or pan underneath each section that you’re scraping. Move the bucket or pan with you as you work from area to area."
                },
                {
                    "headline": "Scrape the varnish or stain away with a scraper or putty knife.",
                    "description": "Hold your putty knife or scraper at a 20-45 degree angle and use the sharp edge of a scraper or putty knife to scrape off the stripping agent. Press the blade of the scraper or putty knife down into the wood by putting your index finger on top of the blade and pressing down. Scrape in the direction of the wood grain. Don’t worry if you wear away a layer of wood as you’re doing this, you need to sand the cabinets anyway and this will make the process easier."
                },
                {
                    "headline": "Use lacquer thinner and steel wool to scrub the cabinets.",
                    "description": "Lacquer thinner is a solvent that dissolves paint, varnish, and other chemicals. Use a lacquer thinner designed for cleaning or stripping and dip some steel wool in it. Scrub your cabinets in the direction of the wood grain to remove the stripping agent. Scrub each section until you see no stripping agent remaining on the wood. Use your bucket or pan to catch the stripping agent drips as you apply it. You can use a sponge if you’re worried about damaging your cabinets. Don’t use a lacquer thinner designed for thinning paint. The residue will make it hard to achieve a clean paint job. Avoid lacquers that are oil-based as well, as they can be hard to sand away. You can buy lacquer thinner online or at your local hardware store."
                },
                {
                    "headline": "Wipe your cabinets dry with paper towels or a clean cloth.",
                    "description": "Remove the lacquer by rubbing your cabinets dry. You can use paper towels or a clean cloth to rub every section down. After you’ve removed the majority of the lacquer, let your cabinets air dry for 6-12 hours."
                },
                {
                    "headline": "Sand your cabinets using a 220-grit sandpaper or extra-fine sponge.",
                    "description": "Use 220-grit sandpaper sheets or an extra-fine sanding sponge to remove the top layer of wood. This will allow the primer to soak into the grain of your wood. Sand each section of your cabinets lightly by using back-and-forth strokes in the direction of the grain. You can sand with a coarser sandpaper if you don’t see any wood dust coming off of your sanding sponge or sheet."
                },
                {
                    "headline": "Vacuum the debris and wipe your cabinets with a dry cloth.",
                    "description": "Use a vacuum with a hose attachment to remove wood dust from each section of your cabinets by running the hose 0.5–2 inches (1.3–5.1 cm) away from the wood. After vacuuming, wipe your cabinets down with a dry cloth to remove any remaining splinters, dust, or debris."
                }
            ]
        },
        {
            "name": "Priming Your Cabinets",
            "steps": [
                {
                    "headline": "Tape any edges that you want to keep dry using painter’s tape.",
                    "description": "Use painter’s tape to cover any areas that you want to keep dry, such as the walls next to your cabinet or the backsplash above your counters. Pull out a length of painter’s tape and press the edge flush against a surface. Pull out the rest of the length of tape and press it into the surface to smooth it out. Painter’s tape isn’t perfect. If you get a lot of paint on it, it can bleed through. Use it as a guide, not a perfect safety measure."
                },
                {
                    "headline": "Pour ⁄4 gallon (2.8 L) of oil-based primer or putty into a paint tray.",
                    "description": "Mix your primer or putty with a mixing stick before pouring it. Use an oil-based primer for woods with a tighter grain, like cherry or maple. Use an oil-based brushing putty for thicker-grain woods, like oak, ash, or mahogany. Pour your priming material into the paint try slowly, and wipe off any drips with your brush or a spare rag.Tip: Use a paint tray with hooks for hanging it off of a ledge if you’re going to be using a ladder to paint the upper cabinets. This way you won’t need to go up and down the ladder every time that you want to reload your brush or roller. Wear a dust mask or respirator if you’re using oil-based primer. The fumes can be a lung irritant."
                },
                {
                    "headline": "Apply your primer to each cabinet and door with a roller and brush.",
                    "description": "Use a nylon-polyester brush to paint edges and trim around each door. Work in the direction of the wood grain, and use back-and-forth strokes to cover each section. For flatter panels or surfaces, use a 6 in (15 cm) foam roller to apply your primer. You can choose whether or not you’re going to paint the inside of your cabinet doors. If you do, wait for each side to dry before flipping them over to paint the other side."
                },
                {
                    "headline": "Prime your cabinet frames and wait for them to dry.",
                    "description": "Use the same roller and brush to cover your cabinet frames. Start with the trim and paint around the top and bottom of your cabinets. Use a foam roller to cover the flat sections of your cabinets. Wait 12-24 hours after applying your primer to ensure that it dries properly. You don’t need to use the brush to paint the thin panels in between doors. You can roll the face of each panel to make things easy."
                }
            ]
        },
        {
            "name": "Painting the Cabinets",
            "steps": [
                {
                    "headline": "Sand your cabinets again with 220 grit sandpaper.",
                    "description": "Use a fine-grain sponge or sandpaper to sand your primed surfaces. This will ensure that any thick layers of primer will be removed while making it easier for the paint to soak into your wood grain. Wipe your cabinets clean and vacuum them again to prepare your cabinets for painting. If you used a putty to prime your cabinets, you may need to use a sandpaper with a grit between 100-150."
                },
                {
                    "headline": "Choose a latex or oil-based gloss paint for your topcoat.",
                    "description": "Select a color that you want and choose a latex paint if you want a uniform finish. If you like the look of brushstrokes and want some texture, use an oil-based paint. Opt for a gloss or semi-gloss paint to prevent oil or grease from sticking to your cabinets.Warning: If you’re painting the insides of your cabinets, choose an eggshell finish in the same color as your exterior paint. Gloss and semi-gloss paint will stick to your dishware. If you don’t paint the insides, line them with drawer liners to keep the wood safe."
                },
                {
                    "headline": "Pour ⁄4 gallon (2.8 L) of your paint into a clean paint tray.",
                    "description": "Use a flathead screwdriver to pry the top off of your can of paint. Mix the paint with a mixing stick until the color is even and uniform. Slowly pour it into a fresh paint tray by holding the handle and tilting the can. Use your brush or a clean rag to wipe any drips off of your paint can. If you’re using a latex paint, you don’t have to wear a dust mask. The fumes can be kind of strong if you’re working in a poorly-ventilated area though."
                },
                {
                    "headline": "Apply paint to the drawers and doors using a brush and roller.",
                    "description": "Use an angled sash brush to paint the edges and trim of each drawer and door. Use a clean, 6 in (15 cm) foam roller to cover larger, flatter surfaces. Paint in the direction of the wood grain. Wait 6-12 hours before painting the other side of each piece if you want to paint both sides. Get a high-quality brush and roller. You don’t want to leave streaks or gaps in the grain because you opted for a cheaper brush."
                },
                {
                    "headline": "Paint the cabinet frames with the same brush and roller.",
                    "description": "Use the same brush and roller to ensure that your paint’s texture is the same on your drawers, doors, and frame. Apply paint to the trim around the walls and edges first, and use your foam roller to apply paint to the flat panels in your cabinet frame. Keep your brush strokes consistent and work in the direction of the grain to keep your topcoat uniform."
                },
                {
                    "headline": "Wait 24-36 hours to let the paint dry and remove your tape.",
                    "description": "Let your paint air dry for at least 24 hours before handling anything. If your paint isn’t consistent or you want a deeper color, apply a second layer of paint and wait an additional 24 hours. After your paint has dried, remove your painter’s tape by carefully and slowly peeling it off. You’re going to be handling your cabinets pretty heavily when you install your doors and drawers. It is best if you can manage to wait longer before reinstalling the doors and drawers."
                },
                {
                    "headline": "Reinstall your doors and drawers and clean up.",
                    "description": "Use a flathead or Phillips-head screwdriver to reinstall each cabinet with the proper bracket. Use your labels or corresponding diagrams to match each drawer and door in the proper location. Once everything is back where it belongs, lift up your drop cloths and shake them outside or over a trash bin to remove the debris. Sweep your floors with a broom and put everything back to enjoy your new cabinets!"
                }
            ]
        }
    ],
    "tyn": [
        "Drop cloth",
        "Water",
        "Cloths",
        "Dust mask or respirator",
        "Thick gloves",
        "Stripping agent",
        "Putty knife or scraper",
        "Lacquer thinner",
        "Steel wool",
        "Bucket or pan",
        "Ladder (optional)",
        "Painter’s tape",
        "Paint tray",
        "Brush",
        "Sandpaper",
        "Vacuum",
        "Oil-based primer or putty",
        "Foam roller",
        "Nylon-polyester brush",
        "Sash brush",
        "Paint",
        "Broom"
    ],
    "text": " Cleaning and Prepping Your Cabinets Remove all appliances and containers from your countertop. Before you do anything, remove everything from your countertops to make cleaning, stripping, and painting easier. If there is a table or any other furniture in the area, move it to a different part of your house to avoid bumping into things while you’re working around the room. If you haven't already, you may want to empty the cabinets, as well. Clean your cabinets by wiping them down with a damp cloth. Put a little bit of warm water on a clean cloth and wring out the excess water. Rub every exterior section of your cabinets to remove any dust, dirt, or grime. Add 1-2 drops of mild dish soap to the cloth if you have trouble cleaning any particularly dirty areas. For cabinets that are above a stove or microwave, you may need to use a degreaser to remove oil or grease. Spray greasy areas with your degreaser or cleaning agent and scrub aggressively with a thick sponge. Don’t forget to clean the areas where the doors overlap on top of the frame. Wipe your cabinets dry and let them air out. Use a clean cloth to rub your cabinets dry. Rub in the direction of the grain to avoid missing indentations in the wood. Once every cabinet surface is dry, open a window and let the cabinets air out for 3-4 hours.Tip: Even if you think your cabinets are dry after you’ve wiped them down, you should still let your cabinets air dry. You don’t want to trap any moisture in your wood. Remove and label every door and drawer. Use a flathead or Philips-head screwdriver to remove every bracket and screw attaching your doors to the frame. Lift every drawer out of its slot and set all of your pieces aside. Label each drawer and door after you remove it by putting a piece of tape on it and writing its location on the back. This way, when it comes to reinstalling the drawers and doors, you won’t need to worry about trying to find the right space for each door or drawer. On the label, you can describe each piece’s location or use an organizational label. For example, you could write, “third door, top” or assign each row and column a letter and number, making the top left cabinet “A1” and the cabinet below it “B1.”\nYou can draw a diagram and use numbers to label your cabinets if you prefer. You can choose to do this before you clean your cabinets, but it could make cleaning more difficult since you’ll have to brace each door and drawer against something to wipe it. Lay drop cloths down on your countertop and floor. Set out one drop cloth on top of your counters and one drop cloth on the floor along your toe kick or baseboard. This will prevent primer, wood dust, or paint from getting on your counters or kitchen floor. A toe kick refers to the wood or plastic barrier at the bottom of your cabinets. It is designed to prevent structural damage to the wood from accidental kicks or spills. Stripping and Sanding the Cabinets Put on a dust mask or respirator and a thick pair of gloves. The fumes in most stripping agents, lacquer thinners, and primers are lung irritants. Prevent damage to your lungs by wearing a thick dust mask or respirator. Wear a pair of thick gloves to avoid getting stripping agent on your skin. Open a window if you haven’t already. The ventilation will prevent fumes from building up in your kitchen. Apply a gel or liquid stripping agent to your cabinets with a natural brush. Wood stripper can be purchased at a local hardware store or online. Select a stripper designed for cabinets by reading the label carefully. Fill a paint tray with your stripping agent and apply it to every stained section with a natural brush. Wait 15-30 minutes to give your stripping agent time to eat into the varnish or stain.Warning: You can use a heat gun to melt the varnish or stain, but this can be dangerous and may burn the cabinets. Unless you have experience using a heat gun, it’s best to stick to traditional stripping methods. There are different stripping agents for fence posts, exterior walls, and delicate furniture. Select a stripper that is designed for cabinets or wood furniture. For each cabinet door or drawer, do each step with your removable pieces set on top of a set of sawhorses or a stable work surface. Set a bucket or pan underneath the area that you’re going to scrape. When you scrape the stripper away, the agent that you applied will pool up in the direction that you scrape. To catch it as it drips off, keep a bucket or pan underneath each section that you’re scraping. Move the bucket or pan with you as you work from area to area. Scrape the varnish or stain away with a scraper or putty knife. Hold your putty knife or scraper at a 20-45 degree angle and use the sharp edge of a scraper or putty knife to scrape off the stripping agent. Press the blade of the scraper or putty knife down into the wood by putting your index finger on top of the blade and pressing down. Scrape in the direction of the wood grain. Don’t worry if you wear away a layer of wood as you’re doing this, you need to sand the cabinets anyway and this will make the process easier. Use lacquer thinner and steel wool to scrub the cabinets. Lacquer thinner is a solvent that dissolves paint, varnish, and other chemicals. Use a lacquer thinner designed for cleaning or stripping and dip some steel wool in it. Scrub your cabinets in the direction of the wood grain to remove the stripping agent. Scrub each section until you see no stripping agent remaining on the wood. Use your bucket or pan to catch the stripping agent drips as you apply it. You can use a sponge if you’re worried about damaging your cabinets. Don’t use a lacquer thinner designed for thinning paint. The residue will make it hard to achieve a clean paint job. Avoid lacquers that are oil-based as well, as they can be hard to sand away. You can buy lacquer thinner online or at your local hardware store. Wipe your cabinets dry with paper towels or a clean cloth. Remove the lacquer by rubbing your cabinets dry. You can use paper towels or a clean cloth to rub every section down. After you’ve removed the majority of the lacquer, let your cabinets air dry for 6-12 hours. Sand your cabinets using a 220-grit sandpaper or extra-fine sponge. Use 220-grit sandpaper sheets or an extra-fine sanding sponge to remove the top layer of wood. This will allow the primer to soak into the grain of your wood. Sand each section of your cabinets lightly by using back-and-forth strokes in the direction of the grain. You can sand with a coarser sandpaper if you don’t see any wood dust coming off of your sanding sponge or sheet. Vacuum the debris and wipe your cabinets with a dry cloth. Use a vacuum with a hose attachment to remove wood dust from each section of your cabinets by running the hose 0.5–2 inches (1.3–5.1 cm) away from the wood. After vacuuming, wipe your cabinets down with a dry cloth to remove any remaining splinters, dust, or debris. Priming Your Cabinets Tape any edges that you want to keep dry using painter’s tape. Use painter’s tape to cover any areas that you want to keep dry, such as the walls next to your cabinet or the backsplash above your counters. Pull out a length of painter’s tape and press the edge flush against a surface. Pull out the rest of the length of tape and press it into the surface to smooth it out. Painter’s tape isn’t perfect. If you get a lot of paint on it, it can bleed through. Use it as a guide, not a perfect safety measure. Pour ⁄4 gallon (2.8 L) of oil-based primer or putty into a paint tray. Mix your primer or putty with a mixing stick before pouring it. Use an oil-based primer for woods with a tighter grain, like cherry or maple. Use an oil-based brushing putty for thicker-grain woods, like oak, ash, or mahogany. Pour your priming material into the paint try slowly, and wipe off any drips with your brush or a spare rag.Tip: Use a paint tray with hooks for hanging it off of a ledge if you’re going to be using a ladder to paint the upper cabinets. This way you won’t need to go up and down the ladder every time that you want to reload your brush or roller. Wear a dust mask or respirator if you’re using oil-based primer. The fumes can be a lung irritant. Apply your primer to each cabinet and door with a roller and brush. Use a nylon-polyester brush to paint edges and trim around each door. Work in the direction of the wood grain, and use back-and-forth strokes to cover each section. For flatter panels or surfaces, use a 6 in (15 cm) foam roller to apply your primer. You can choose whether or not you’re going to paint the inside of your cabinet doors. If you do, wait for each side to dry before flipping them over to paint the other side. Prime your cabinet frames and wait for them to dry. Use the same roller and brush to cover your cabinet frames. Start with the trim and paint around the top and bottom of your cabinets. Use a foam roller to cover the flat sections of your cabinets. Wait 12-24 hours after applying your primer to ensure that it dries properly. You don’t need to use the brush to paint the thin panels in between doors. You can roll the face of each panel to make things easy. Painting the Cabinets Sand your cabinets again with 220 grit sandpaper. Use a fine-grain sponge or sandpaper to sand your primed surfaces. This will ensure that any thick layers of primer will be removed while making it easier for the paint to soak into your wood grain. Wipe your cabinets clean and vacuum them again to prepare your cabinets for painting. If you used a putty to prime your cabinets, you may need to use a sandpaper with a grit between 100-150. Choose a latex or oil-based gloss paint for your topcoat. Select a color that you want and choose a latex paint if you want a uniform finish. If you like the look of brushstrokes and want some texture, use an oil-based paint. Opt for a gloss or semi-gloss paint to prevent oil or grease from sticking to your cabinets.Warning: If you’re painting the insides of your cabinets, choose an eggshell finish in the same color as your exterior paint. Gloss and semi-gloss paint will stick to your dishware. If you don’t paint the insides, line them with drawer liners to keep the wood safe. Pour ⁄4 gallon (2.8 L) of your paint into a clean paint tray. Use a flathead screwdriver to pry the top off of your can of paint. Mix the paint with a mixing stick until the color is even and uniform. Slowly pour it into a fresh paint tray by holding the handle and tilting the can. Use your brush or a clean rag to wipe any drips off of your paint can. If you’re using a latex paint, you don’t have to wear a dust mask. The fumes can be kind of strong if you’re working in a poorly-ventilated area though. Apply paint to the drawers and doors using a brush and roller. Use an angled sash brush to paint the edges and trim of each drawer and door. Use a clean, 6 in (15 cm) foam roller to cover larger, flatter surfaces. Paint in the direction of the wood grain. Wait 6-12 hours before painting the other side of each piece if you want to paint both sides. Get a high-quality brush and roller. You don’t want to leave streaks or gaps in the grain because you opted for a cheaper brush. Paint the cabinet frames with the same brush and roller. Use the same brush and roller to ensure that your paint’s texture is the same on your drawers, doors, and frame. Apply paint to the trim around the walls and edges first, and use your foam roller to apply paint to the flat panels in your cabinet frame. Keep your brush strokes consistent and work in the direction of the grain to keep your topcoat uniform. Wait 24-36 hours to let the paint dry and remove your tape. Let your paint air dry for at least 24 hours before handling anything. If your paint isn’t consistent or you want a deeper color, apply a second layer of paint and wait an additional 24 hours. After your paint has dried, remove your painter’s tape by carefully and slowly peeling it off. You’re going to be handling your cabinets pretty heavily when you install your doors and drawers. It is best if you can manage to wait longer before reinstalling the doors and drawers. Reinstall your doors and drawers and clean up. Use a flathead or Phillips-head screwdriver to reinstall each cabinet with the proper bracket. Use your labels or corresponding diagrams to match each drawer and door in the proper location. Once everything is back where it belongs, lift up your drop cloths and shake them outside or over a trash bin to remove the debris. Sweep your floors with a broom and put everything back to enjoy your new cabinets!",
    "sentences": [
        " Cleaning and Prepping Your Cabinets Remove all appliances and containers from your countertop.",
        "Before you do anything, remove everything from your countertops to make cleaning, stripping, and painting easier.",
        "If there is a table or any other furniture in the area, move it to a different part of your house to avoid bumping into things while you’re working around the room.",
        "If you haven't already, you may want to empty the cabinets, as well.",
        "Clean your cabinets by wiping them down with a damp cloth.",
        "Put a little bit of warm water on a clean cloth and wring out the excess water.",
        "Rub every exterior section of your cabinets to remove any dust, dirt, or grime.",
        "Add 1-2 drops of mild dish soap to the cloth if you have trouble cleaning any particularly dirty areas.",
        "For cabinets that are above a stove or microwave, you may need to use a degreaser to remove oil or grease.",
        "Spray greasy areas with your degreaser or cleaning agent and scrub aggressively with a thick sponge.",
        "Don’t forget to clean the areas where the doors overlap on top of the frame.",
        "Wipe your cabinets dry and let them air out.",
        "Use a clean cloth to rub your cabinets dry.",
        "Rub in the direction of the grain to avoid missing indentations in the wood.",
        "Once every cabinet surface is dry, open a window and let the cabinets air out for 3-4 hours.Tip: Even if you think your cabinets are dry after you’ve wiped them down, you should still let your cabinets air dry.",
        "You don’t want to trap any moisture in your wood.",
        "Remove and label every door and drawer.",
        "Use a flathead or Philips-head screwdriver to remove every bracket and screw attaching your doors to the frame.",
        "Lift every drawer out of its slot and set all of your pieces aside.",
        "Label each drawer and door after you remove it by putting a piece of tape on it and writing its location on the back.",
        "This way, when it comes to reinstalling the drawers and doors, you won’t need to worry about trying to find the right space for each door or drawer.",
        "On the label, you can describe each piece’s location or use an organizational label.",
        "For example, you could write, “third door, top” or assign each row and column a letter and number, making the top left cabinet “A1” and the cabinet below it “B1.”\nYou can draw a diagram and use numbers to label your cabinets if you prefer.",
        "You can choose to do this before you clean your cabinets, but it could make cleaning more difficult since you’ll have to brace each door and drawer against something to wipe it.",
        "Lay drop cloths down on your countertop and floor.",
        "Set out one drop cloth on top of your counters and one drop cloth on the floor along your toe kick or baseboard.",
        "This will prevent primer, wood dust, or paint from getting on your counters or kitchen floor.",
        "A toe kick refers to the wood or plastic barrier at the bottom of your cabinets.",
        "It is designed to prevent structural damage to the wood from accidental kicks or spills.",
        "Stripping and Sanding the Cabinets Put on a dust mask or respirator and a thick pair of gloves.",
        "The fumes in most stripping agents, lacquer thinners, and primers are lung irritants.",
        "Prevent damage to your lungs by wearing a thick dust mask or respirator.",
        "Wear a pair of thick gloves to avoid getting stripping agent on your skin.",
        "Open a window if you haven’t already.",
        "The ventilation will prevent fumes from building up in your kitchen.",
        "Apply a gel or liquid stripping agent to your cabinets with a natural brush.",
        "Wood stripper can be purchased at a local hardware store or online.",
        "Select a stripper designed for cabinets by reading the label carefully.",
        "Fill a paint tray with your stripping agent and apply it to every stained section with a natural brush.",
        "Wait 15-30 minutes to give your stripping agent time to eat into the varnish or stain.Warning: You can use a heat gun to melt the varnish or stain, but this can be dangerous and may burn the cabinets.",
        "Unless you have experience using a heat gun, it’s best to stick to traditional stripping methods.",
        "There are different stripping agents for fence posts, exterior walls, and delicate furniture.",
        "Select a stripper that is designed for cabinets or wood furniture.",
        "For each cabinet door or drawer, do each step with your removable pieces set on top of a set of sawhorses or a stable work surface.",
        "Set a bucket or pan underneath the area that you’re going to scrape.",
        "When you scrape the stripper away, the agent that you applied will pool up in the direction that you scrape.",
        "To catch it as it drips off, keep a bucket or pan underneath each section that you’re scraping.",
        "Move the bucket or pan with you as you work from area to area.",
        "Scrape the varnish or stain away with a scraper or putty knife.",
        "Hold your putty knife or scraper at a 20-45 degree angle and use the sharp edge of a scraper or putty knife to scrape off the stripping agent.",
        "Press the blade of the scraper or putty knife down into the wood by putting your index finger on top of the blade and pressing down.",
        "Scrape in the direction of the wood grain.",
        "Don’t worry if you wear away a layer of wood as you’re doing this, you need to sand the cabinets anyway and this will make the process easier.",
        "Use lacquer thinner and steel wool to scrub the cabinets.",
        "Lacquer thinner is a solvent that dissolves paint, varnish, and other chemicals.",
        "Use a lacquer thinner designed for cleaning or stripping and dip some steel wool in it.",
        "Scrub your cabinets in the direction of the wood grain to remove the stripping agent.",
        "Scrub each section until you see no stripping agent remaining on the wood.",
        "Use your bucket or pan to catch the stripping agent drips as you apply it.",
        "You can use a sponge if you’re worried about damaging your cabinets.",
        "Don’t use a lacquer thinner designed for thinning paint.",
        "The residue will make it hard to achieve a clean paint job.",
        "Avoid lacquers that are oil-based as well, as they can be hard to sand away.",
        "You can buy lacquer thinner online or at your local hardware store.",
        "Wipe your cabinets dry with paper towels or a clean cloth.",
        "Remove the lacquer by rubbing your cabinets dry.",
        "You can use paper towels or a clean cloth to rub every section down.",
        "After you’ve removed the majority of the lacquer, let your cabinets air dry for 6-12 hours.",
        "Sand your cabinets using a 220-grit sandpaper or extra-fine sponge.",
        "Use 220-grit sandpaper sheets or an extra-fine sanding sponge to remove the top layer of wood.",
        "This will allow the primer to soak into the grain of your wood.",
        "Sand each section of your cabinets lightly by using back-and-forth strokes in the direction of the grain.",
        "You can sand with a coarser sandpaper if you don’t see any wood dust coming off of your sanding sponge or sheet.",
        "Vacuum the debris and wipe your cabinets with a dry cloth.",
        "Use a vacuum with a hose attachment to remove wood dust from each section of your cabinets by running the hose 0.5–2 inches (1.3–5.1 cm) away from the wood.",
        "After vacuuming, wipe your cabinets down with a dry cloth to remove any remaining splinters, dust, or debris.",
        "Priming Your Cabinets Tape any edges that you want to keep dry using painter’s tape.",
        "Use painter’s tape to cover any areas that you want to keep dry, such as the walls next to your cabinet or the backsplash above your counters.",
        "Pull out a length of painter’s tape and press the edge flush against a surface.",
        "Pull out the rest of the length of tape and press it into the surface to smooth it out.",
        "Painter’s tape isn’t perfect.",
        "If you get a lot of paint on it, it can bleed through.",
        "Use it as a guide, not a perfect safety measure.",
        "Pour ⁄4 gallon (2.8 L) of oil-based primer or putty into a paint tray.",
        "Mix your primer or putty with a mixing stick before pouring it.",
        "Use an oil-based primer for woods with a tighter grain, like cherry or maple.",
        "Use an oil-based brushing putty for thicker-grain woods, like oak, ash, or mahogany.",
        "Pour your priming material into the paint try slowly, and wipe off any drips with your brush or a spare rag.Tip: Use a paint tray with hooks for hanging it off of a ledge if you’re going to be using a ladder to paint the upper cabinets.",
        "This way you won’t need to go up and down the ladder every time that you want to reload your brush or roller.",
        "Wear a dust mask or respirator if you’re using oil-based primer.",
        "The fumes can be a lung irritant.",
        "Apply your primer to each cabinet and door with a roller and brush.",
        "Use a nylon-polyester brush to paint edges and trim around each door.",
        "Work in the direction of the wood grain, and use back-and-forth strokes to cover each section.",
        "For flatter panels or surfaces, use a 6 in (15 cm) foam roller to apply your primer.",
        "You can choose whether or not you’re going to paint the inside of your cabinet doors.",
        "If you do, wait for each side to dry before flipping them over to paint the other side.",
        "Prime your cabinet frames and wait for them to dry.",
        "Use the same roller and brush to cover your cabinet frames.",
        "Start with the trim and paint around the top and bottom of your cabinets.",
        "Use a foam roller to cover the flat sections of your cabinets.",
        "Wait 12-24 hours after applying your primer to ensure that it dries properly.",
        "You don’t need to use the brush to paint the thin panels in between doors.",
        "You can roll the face of each panel to make things easy.",
        "Painting the Cabinets Sand your cabinets again with 220 grit sandpaper.",
        "Use a fine-grain sponge or sandpaper to sand your primed surfaces.",
        "This will ensure that any thick layers of primer will be removed while making it easier for the paint to soak into your wood grain.",
        "Wipe your cabinets clean and vacuum them again to prepare your cabinets for painting.",
        "If you used a putty to prime your cabinets, you may need to use a sandpaper with a grit between 100-150.",
        "Choose a latex or oil-based gloss paint for your topcoat.",
        "Select a color that you want and choose a latex paint if you want a uniform finish.",
        "If you like the look of brushstrokes and want some texture, use an oil-based paint.",
        "Opt for a gloss or semi-gloss paint to prevent oil or grease from sticking to your cabinets.Warning: If you’re painting the insides of your cabinets, choose an eggshell finish in the same color as your exterior paint.",
        "Gloss and semi-gloss paint will stick to your dishware.",
        "If you don’t paint the insides, line them with drawer liners to keep the wood safe.",
        "Pour ⁄4 gallon (2.8 L) of your paint into a clean paint tray.",
        "Use a flathead screwdriver to pry the top off of your can of paint.",
        "Mix the paint with a mixing stick until the color is even and uniform.",
        "Slowly pour it into a fresh paint tray by holding the handle and tilting the can.",
        "Use your brush or a clean rag to wipe any drips off of your paint can.",
        "If you’re using a latex paint, you don’t have to wear a dust mask.",
        "The fumes can be kind of strong if you’re working in a poorly-ventilated area though.",
        "Apply paint to the drawers and doors using a brush and roller.",
        "Use an angled sash brush to paint the edges and trim of each drawer and door.",
        "Use a clean, 6 in (15 cm) foam roller to cover larger, flatter surfaces.",
        "Paint in the direction of the wood grain.",
        "Wait 6-12 hours before painting the other side of each piece if you want to paint both sides.",
        "Get a high-quality brush and roller.",
        "You don’t want to leave streaks or gaps in the grain because you opted for a cheaper brush.",
        "Paint the cabinet frames with the same brush and roller.",
        "Use the same brush and roller to ensure that your paint’s texture is the same on your drawers, doors, and frame.",
        "Apply paint to the trim around the walls and edges first, and use your foam roller to apply paint to the flat panels in your cabinet frame.",
        "Keep your brush strokes consistent and work in the direction of the grain to keep your topcoat uniform.",
        "Wait 24-36 hours to let the paint dry and remove your tape.",
        "Let your paint air dry for at least 24 hours before handling anything.",
        "If your paint isn’t consistent or you want a deeper color, apply a second layer of paint and wait an additional 24 hours.",
        "After your paint has dried, remove your painter’s tape by carefully and slowly peeling it off.",
        "You’re going to be handling your cabinets pretty heavily when you install your doors and drawers.",
        "It is best if you can manage to wait longer before reinstalling the doors and drawers.",
        "Reinstall your doors and drawers and clean up.",
        "Use a flathead or Phillips-head screwdriver to reinstall each cabinet with the proper bracket.",
        "Use your labels or corresponding diagrams to match each drawer and door in the proper location.",
        "Once everything is back where it belongs, lift up your drop cloths and shake them outside or over a trash bin to remove the debris.",
        "Sweep your floors with a broom and put everything back to enjoy your new cabinets!"
    ]
}