{
    "title": "How to Paint Pine Cones",
    "url": "https://www.wikihow.com/Paint-Pine-Cones",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Dipping Pine Cones in Paint",
            "steps": [
                {
                    "headline": "Choose either latex or acrylic paint for your project.",
                    "description": "Both options work well. Latex paints are water-based and acrylics are chemical-based. Acrylic generally lasts longer and comes in a wide range of colors, but is more expensive and only available at craft stores. Household latex paint is cheaper and you can buy it at a hardware or home repair store. Make sure you’ve got a color of paint that you’re excited about. You can paint your pine cones white for a simple, pretty look, or jazz them up with any other color you like."
                },
                {
                    "headline": "Stir your paint with a stir stick in a bucket or a bowl.",
                    "description": "Latex paint generally comes in a bucket, so you can stir it right in the bucket. Acrylic paint generally comes in tubes, so squeeze the paint into a bowl to stir it. Stirring the paint makes sure that it’s all an even color and consistency, and doesn’t have any globs."
                },
                {
                    "headline": "Twist the end of a bamboo skewer into the top of the pine cone.",
                    "description": "Make sure that the skewer is securely attached to the pine cone. The skewer will be your handle for dipping the pine cone in the paint."
                },
                {
                    "headline": "Hold the skewer and dunk the pine cone in paint.",
                    "description": "Shake the pine cone to get rid of excess paint, as you draw it out of the paint. Do the shaking over your paint bucket or over some old newspaper, so you don’t get paint spatters all over the floor."
                },
                {
                    "headline": "Set the pine cone on wax paper to dry and remove the skewer.",
                    "description": "You can then put the skewer into the next pine cone and use it to dip the pine cone in the paint. Keep it up until you have dipped all your pine cones in paint."
                },
                {
                    "headline": "Let the pine cones dry on wax paper overnight.",
                    "description": "The waxy surface of the paper will not absorb as much paint as other surfaces would, so more of the paint will stay stuck to the pine cones. Your pine cones may close up overnight, because the scales tend to pull in on themselves when they’re wet, but that’s okay. If the pine cones close up, you can open them again in the oven."
                },
                {
                    "headline": "Place your pine cones on a baking sheet for the oven.",
                    "description": "Heating the pine cones opens them up. Cover the baking sheet in aluminum foil to protect it from resin drips. Don’t worry about spacing them out perfectly, but make sure there’s enough room for them to expand a bit as they open."
                },
                {
                    "headline": "Set the oven to its lowest temperature and heat them for 30-60 minutes.",
                    "description": "Place the baking sheet on the center shelf of the oven. Check the pine cones every 30 minutes to see if they’ve opened. This may take an hour. Once they’re open, remove them from the oven. Place the tray on a heat safe surface and let the pine cones cool before you handle them or decorate them more."
                },
                {
                    "headline": "Brush your pine cones with school glue and sprinkle with glitter if you want.",
                    "description": "Glitter is a great tool if you want to add some extra sparkle and pizzazz to your painted pine cones. Use a small paint brush to brush liquid school glue along the rims of the pine cone scales, or wherever you would like to apply glitter. Then sprinkle on the glitter. Shake your pine cone and the extra, unglued glitter will fall off. Silver glitter on white-painted pine cones can give an especially nice icy twinkle to pine cones meant for winter decorations."
                }
            ]
        },
        {
            "name": "Spray-Painting Pine Cones",
            "steps": [
                {
                    "headline": "Choose an outdoor location for spray-painting.",
                    "description": "Spray-painting creates paint fumes that aren’t good for you to breathe in. If it’s not possible to spray-paint outdoors, then make sure the room you’re working in is very well-ventilated. A garage with the door open is a great well-ventilated alternative to working outside."
                },
                {
                    "headline": "Lay down newspaper to protect the floor or ground from spray paint.",
                    "description": "Spray-painting, especially if you’re a beginner, can spatter a lot of paint around, so having something on the ground will protect your garage floor, lawn, or wherever you are painting. If you don’t have newspaper, cardboard or a plastic drop cloth will work great too."
                },
                {
                    "headline": "Hold the spray paint canister upside down and shake it for 1 minute.",
                    "description": "That might seem like a long time to shake it, but it will make sure that all the paint is aerosolized and ready to come out in a steady, consistent spray. Some spray paint cans might have instructions on how long to shake them for before spraying. If so, follow those instructions."
                },
                {
                    "headline": "Test your spray paint on some scrap material to see how far away to hold it.",
                    "description": "Practice a few sprays until you can spray a smooth, consistent oval of paint on your scrap material. You can determine how far away from the pine cone you want to hold your spray can, based on how thickly covered with paint you want your pine cone to be. Hold it farther for a dusty, frosted look, and closer for a smoother, fully-coated look. This is especially important if you’ve never used spray paint before! A scrap of plywood makes a good surface to practice spraying."
                },
                {
                    "headline": "Apply thin coats of spray paint to the pine cones.",
                    "description": "If you just want a very lightly frosted look, then one coat of spray paint may be enough. If you want the pine cone to look more thoroughly covered, then give it a few coats."
                },
                {
                    "headline": "Dry the pine cones until you can’t smell the paint anymore.",
                    "description": "Let the pine cones dry, standing upright on the newspaper. Don’t test the dryness with your fingers, because that could smudge the paint. Instead, sniff them. When you can no longer smell the paint, they’re all dry!"
                },
                {
                    "headline": "Decorate your pine cones more if you’d like.",
                    "description": "After your pine cones are dry, you can decorate them however you want! Brush them with glue and sprinkle glitter, paint on extra designs with a paintbrush, or simply leave the pine cones as they are for a simple look."
                }
            ]
        }
    ],
    "tyn": [
        "Dipping Pine Cones",
        "Latex paint",
        "Stir stick",
        "Bamboo skewers",
        "School glue (optional)",
        "Glitter (optional)",
        "Spray-Painting Pine Cones",
        "Spray paint",
        "Newspaper",
        "Plywood"
    ],
    "text": " Dipping Pine Cones in Paint Choose either latex or acrylic paint for your project. Both options work well. Latex paints are water-based and acrylics are chemical-based. Acrylic generally lasts longer and comes in a wide range of colors, but is more expensive and only available at craft stores. Household latex paint is cheaper and you can buy it at a hardware or home repair store. Make sure you’ve got a color of paint that you’re excited about. You can paint your pine cones white for a simple, pretty look, or jazz them up with any other color you like. Stir your paint with a stir stick in a bucket or a bowl. Latex paint generally comes in a bucket, so you can stir it right in the bucket. Acrylic paint generally comes in tubes, so squeeze the paint into a bowl to stir it. Stirring the paint makes sure that it’s all an even color and consistency, and doesn’t have any globs. Twist the end of a bamboo skewer into the top of the pine cone. Make sure that the skewer is securely attached to the pine cone. The skewer will be your handle for dipping the pine cone in the paint. Hold the skewer and dunk the pine cone in paint. Shake the pine cone to get rid of excess paint, as you draw it out of the paint. Do the shaking over your paint bucket or over some old newspaper, so you don’t get paint spatters all over the floor. Set the pine cone on wax paper to dry and remove the skewer. You can then put the skewer into the next pine cone and use it to dip the pine cone in the paint. Keep it up until you have dipped all your pine cones in paint. Let the pine cones dry on wax paper overnight. The waxy surface of the paper will not absorb as much paint as other surfaces would, so more of the paint will stay stuck to the pine cones. Your pine cones may close up overnight, because the scales tend to pull in on themselves when they’re wet, but that’s okay. If the pine cones close up, you can open them again in the oven. Place your pine cones on a baking sheet for the oven. Heating the pine cones opens them up. Cover the baking sheet in aluminum foil to protect it from resin drips. Don’t worry about spacing them out perfectly, but make sure there’s enough room for them to expand a bit as they open. Set the oven to its lowest temperature and heat them for 30-60 minutes. Place the baking sheet on the center shelf of the oven. Check the pine cones every 30 minutes to see if they’ve opened. This may take an hour. Once they’re open, remove them from the oven. Place the tray on a heat safe surface and let the pine cones cool before you handle them or decorate them more. Brush your pine cones with school glue and sprinkle with glitter if you want. Glitter is a great tool if you want to add some extra sparkle and pizzazz to your painted pine cones. Use a small paint brush to brush liquid school glue along the rims of the pine cone scales, or wherever you would like to apply glitter. Then sprinkle on the glitter. Shake your pine cone and the extra, unglued glitter will fall off. Silver glitter on white-painted pine cones can give an especially nice icy twinkle to pine cones meant for winter decorations. Spray-Painting Pine Cones Choose an outdoor location for spray-painting. Spray-painting creates paint fumes that aren’t good for you to breathe in. If it’s not possible to spray-paint outdoors, then make sure the room you’re working in is very well-ventilated. A garage with the door open is a great well-ventilated alternative to working outside. Lay down newspaper to protect the floor or ground from spray paint. Spray-painting, especially if you’re a beginner, can spatter a lot of paint around, so having something on the ground will protect your garage floor, lawn, or wherever you are painting. If you don’t have newspaper, cardboard or a plastic drop cloth will work great too. Hold the spray paint canister upside down and shake it for 1 minute. That might seem like a long time to shake it, but it will make sure that all the paint is aerosolized and ready to come out in a steady, consistent spray. Some spray paint cans might have instructions on how long to shake them for before spraying. If so, follow those instructions. Test your spray paint on some scrap material to see how far away to hold it. Practice a few sprays until you can spray a smooth, consistent oval of paint on your scrap material. You can determine how far away from the pine cone you want to hold your spray can, based on how thickly covered with paint you want your pine cone to be. Hold it farther for a dusty, frosted look, and closer for a smoother, fully-coated look. This is especially important if you’ve never used spray paint before! A scrap of plywood makes a good surface to practice spraying. Apply thin coats of spray paint to the pine cones. If you just want a very lightly frosted look, then one coat of spray paint may be enough. If you want the pine cone to look more thoroughly covered, then give it a few coats. Dry the pine cones until you can’t smell the paint anymore. Let the pine cones dry, standing upright on the newspaper. Don’t test the dryness with your fingers, because that could smudge the paint. Instead, sniff them. When you can no longer smell the paint, they’re all dry! Decorate your pine cones more if you’d like. After your pine cones are dry, you can decorate them however you want! Brush them with glue and sprinkle glitter, paint on extra designs with a paintbrush, or simply leave the pine cones as they are for a simple look.",
    "sentences": [
        " Dipping Pine Cones in Paint Choose either latex or acrylic paint for your project.",
        "Both options work well.",
        "Latex paints are water-based and acrylics are chemical-based.",
        "Acrylic generally lasts longer and comes in a wide range of colors, but is more expensive and only available at craft stores.",
        "Household latex paint is cheaper and you can buy it at a hardware or home repair store.",
        "Make sure you’ve got a color of paint that you’re excited about.",
        "You can paint your pine cones white for a simple, pretty look, or jazz them up with any other color you like.",
        "Stir your paint with a stir stick in a bucket or a bowl.",
        "Latex paint generally comes in a bucket, so you can stir it right in the bucket.",
        "Acrylic paint generally comes in tubes, so squeeze the paint into a bowl to stir it.",
        "Stirring the paint makes sure that it’s all an even color and consistency, and doesn’t have any globs.",
        "Twist the end of a bamboo skewer into the top of the pine cone.",
        "Make sure that the skewer is securely attached to the pine cone.",
        "The skewer will be your handle for dipping the pine cone in the paint.",
        "Hold the skewer and dunk the pine cone in paint.",
        "Shake the pine cone to get rid of excess paint, as you draw it out of the paint.",
        "Do the shaking over your paint bucket or over some old newspaper, so you don’t get paint spatters all over the floor.",
        "Set the pine cone on wax paper to dry and remove the skewer.",
        "You can then put the skewer into the next pine cone and use it to dip the pine cone in the paint.",
        "Keep it up until you have dipped all your pine cones in paint.",
        "Let the pine cones dry on wax paper overnight.",
        "The waxy surface of the paper will not absorb as much paint as other surfaces would, so more of the paint will stay stuck to the pine cones.",
        "Your pine cones may close up overnight, because the scales tend to pull in on themselves when they’re wet, but that’s okay.",
        "If the pine cones close up, you can open them again in the oven.",
        "Place your pine cones on a baking sheet for the oven.",
        "Heating the pine cones opens them up.",
        "Cover the baking sheet in aluminum foil to protect it from resin drips.",
        "Don’t worry about spacing them out perfectly, but make sure there’s enough room for them to expand a bit as they open.",
        "Set the oven to its lowest temperature and heat them for 30-60 minutes.",
        "Place the baking sheet on the center shelf of the oven.",
        "Check the pine cones every 30 minutes to see if they’ve opened.",
        "This may take an hour.",
        "Once they’re open, remove them from the oven.",
        "Place the tray on a heat safe surface and let the pine cones cool before you handle them or decorate them more.",
        "Brush your pine cones with school glue and sprinkle with glitter if you want.",
        "Glitter is a great tool if you want to add some extra sparkle and pizzazz to your painted pine cones.",
        "Use a small paint brush to brush liquid school glue along the rims of the pine cone scales, or wherever you would like to apply glitter.",
        "Then sprinkle on the glitter.",
        "Shake your pine cone and the extra, unglued glitter will fall off.",
        "Silver glitter on white-painted pine cones can give an especially nice icy twinkle to pine cones meant for winter decorations.",
        "Spray-Painting Pine Cones Choose an outdoor location for spray-painting.",
        "Spray-painting creates paint fumes that aren’t good for you to breathe in.",
        "If it’s not possible to spray-paint outdoors, then make sure the room you’re working in is very well-ventilated.",
        "A garage with the door open is a great well-ventilated alternative to working outside.",
        "Lay down newspaper to protect the floor or ground from spray paint.",
        "Spray-painting, especially if you’re a beginner, can spatter a lot of paint around, so having something on the ground will protect your garage floor, lawn, or wherever you are painting.",
        "If you don’t have newspaper, cardboard or a plastic drop cloth will work great too.",
        "Hold the spray paint canister upside down and shake it for 1 minute.",
        "That might seem like a long time to shake it, but it will make sure that all the paint is aerosolized and ready to come out in a steady, consistent spray.",
        "Some spray paint cans might have instructions on how long to shake them for before spraying.",
        "If so, follow those instructions.",
        "Test your spray paint on some scrap material to see how far away to hold it.",
        "Practice a few sprays until you can spray a smooth, consistent oval of paint on your scrap material.",
        "You can determine how far away from the pine cone you want to hold your spray can, based on how thickly covered with paint you want your pine cone to be.",
        "Hold it farther for a dusty, frosted look, and closer for a smoother, fully-coated look.",
        "This is especially important if you’ve never used spray paint before!",
        "A scrap of plywood makes a good surface to practice spraying.",
        "Apply thin coats of spray paint to the pine cones.",
        "If you just want a very lightly frosted look, then one coat of spray paint may be enough.",
        "If you want the pine cone to look more thoroughly covered, then give it a few coats.",
        "Dry the pine cones until you can’t smell the paint anymore.",
        "Let the pine cones dry, standing upright on the newspaper.",
        "Don’t test the dryness with your fingers, because that could smudge the paint.",
        "Instead, sniff them.",
        "When you can no longer smell the paint, they’re all dry!",
        "Decorate your pine cones more if you’d like.",
        "After your pine cones are dry, you can decorate them however you want!",
        "Brush them with glue and sprinkle glitter, paint on extra designs with a paintbrush, or simply leave the pine cones as they are for a simple look."
    ]
}