{
    "title": "How to Freeze Spaghetti Squash",
    "url": "https://www.wikihow.com/Freeze-Spaghetti-Squash",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Pasta and Noodles",
        "Spaghetti"
    ],
    "methods": [
        {
            "name": "Freezing Cooked Spaghetti Squash",
            "steps": [
                {
                    "headline": "Cut the spaghetti squash in half and scoop out the seeds.",
                    "description": "Rinse a firm spaghetti squash and place it on a cutting board. Then, carefully use a knife to slice the squash in half lengthwise. Take a metal spoon and scrape out the seeds. You can discard the seeds or roast them until they're toasted."
                },
                {
                    "headline": "Put the squash on a sheet and bake it at 375 °F (191 °C) for 30 to 40 minutes.",
                    "description": "Lay the spaghetti squash halves flat sides down on a baking sheet. Place them into a preheated oven and cook them until the flesh is tender. To tell if the squash has cooked enough, insert a fork or knife into the center of the flesh. You should be able to pull it out easily if it's finished."
                },
                {
                    "headline": "Let the squash cool and scrape the flesh with a fork.",
                    "description": "Wear oven mitts to remove the baking sheet with spaghetti squash from the oven. Set the squash aside until it's cool enough to easily handle. Then, drag the tines of a fork lengthwise across the flesh. You should see the flesh pull away into strands that look like noodles.Tip: You might want to hold the rounded side of the squash in a kitchen towel. This will make it easier to hold and will prevent the squash from sliding around."
                },
                {
                    "headline": "Drain the strands in a colander overnight.",
                    "description": "Place a colander over a large bowl and scoop the strands of spaghetti squash into the colander. Put the colander with the bowl into the refrigerator overnight so the moisture completely drains from the squash. Removing the moisture before you freeze it will prevent the squash from becoming soggy when you reheat it later."
                },
                {
                    "headline": "Transfer the cooked squash strands to freezer-safe bags.",
                    "description": "Remove the colander from the refrigerator and scoop the spaghetti squash into freezer-safe bags. To make it easier to use, consider dividing the squash into small freezer bags. They'll defrost faster and you can use smaller amounts. Remember to press out all of the air from the bags before you seal them shut."
                },
                {
                    "headline": "Store the frozen spaghetti squash for up to 8 months.",
                    "description": "Label the bags with what's inside and the date you're putting them into the freezer. Then, plan on using the squash within 8 months. Try stirring the spaghetti squash strands into your favorite meat sauce or toss thawed strands with spiralized vegetables."
                }
            ]
        },
        {
            "name": "Storing Spaghetti Squash Casseroles in the Freezer",
            "steps": [
                {
                    "headline": "Make spaghetti squash casserole.",
                    "description": "Microwave or roast your spaghetti squash and drag a fork over the flesh to make strands. Then, combine the strands with your favorite sauce and vegetables. For example, combine the squash with ricotta and spinach or cooked meat sauce. There's no need to cook the casserole at this point; just assemble it. It's important to cook any meat that you're adding to the casserole so you can reheat it safely."
                },
                {
                    "headline": "Spread the casserole in a freezer-safe baking pan.",
                    "description": "You can use disposable freezer-safe pans or a glass or metal baking dish. Try to use something that's shallow so your casserole reheats evenly. Keep in mind that if you're freezing glass pans, they will take up a lot of space in your freezer. If you're using a glass dish, you'll probably have to thaw it in the refrigerator instead of putting the casserole directly from freezer to oven. This is because drastic temperature swings can cause the glass to shatter."
                },
                {
                    "headline": "Let the casserole cool.",
                    "description": "You shouldn't freeze the hot casserole because it will cause freezer burn. Instead, put the casserole in the refrigerator until it cools or let it sit at room temperature for no more than 2 hours. If you put hot food into the freezer, it will raise the temperature of your freezer. This can thaw other foods that are in the freezer."
                },
                {
                    "headline": "Wrap the casserole dish and freeze it for up to 6 months.",
                    "description": "Once the spaghetti squash casserole has cooled, place the paper lid onto the container. If you're not using a disposable casserole dish, wrap the top of the casserole with plastic wrap and then a sheet of aluminum foil. Put the casserole into the freezer and store it for up to 6 months. Remember to label the top of the casserole with what's in the dish and the date you put it in the freezer."
                },
                {
                    "headline": "Reheat the casserole at 375 °F (191 °C) for 30 to 40 minutes.",
                    "description": "Preheat your oven and remove the spaghetti squash casserole from the freezer. Leave the foil cover on the casserole pan and place the casserole into the hot oven. Reheat the casserole until it's completely hot throughout.Tip: If you'd like a cheesy topping, take the foil cover off and scatter your favorite cheese over the casserole during the last 10 minutes. The cheese should become golden and bubbly. If you covered the pan with plastic wrap or a paper lid, remove it before putting the casserole in the oven."
                }
            ]
        }
    ],
    "tyn": [
        "Freezing Cooked Spaghetti Squash",
        "Knife and cutting board",
        "Baking sheet",
        "Oven mitts",
        "Colander",
        "Bowl",
        "Kitchen towel",
        "Freezer-safe bags",
        "Storing Spaghetti Squash Casseroles in the Freezer",
        "Freezer-safe casserole dish",
        "Foil",
        "Plastic wrap"
    ],
    "text": " Freezing Cooked Spaghetti Squash Cut the spaghetti squash in half and scoop out the seeds. Rinse a firm spaghetti squash and place it on a cutting board. Then, carefully use a knife to slice the squash in half lengthwise. Take a metal spoon and scrape out the seeds. You can discard the seeds or roast them until they're toasted. Put the squash on a sheet and bake it at 375 °F (191 °C) for 30 to 40 minutes. Lay the spaghetti squash halves flat sides down on a baking sheet. Place them into a preheated oven and cook them until the flesh is tender. To tell if the squash has cooked enough, insert a fork or knife into the center of the flesh. You should be able to pull it out easily if it's finished. Let the squash cool and scrape the flesh with a fork. Wear oven mitts to remove the baking sheet with spaghetti squash from the oven. Set the squash aside until it's cool enough to easily handle. Then, drag the tines of a fork lengthwise across the flesh. You should see the flesh pull away into strands that look like noodles.Tip: You might want to hold the rounded side of the squash in a kitchen towel. This will make it easier to hold and will prevent the squash from sliding around. Drain the strands in a colander overnight. Place a colander over a large bowl and scoop the strands of spaghetti squash into the colander. Put the colander with the bowl into the refrigerator overnight so the moisture completely drains from the squash. Removing the moisture before you freeze it will prevent the squash from becoming soggy when you reheat it later. Transfer the cooked squash strands to freezer-safe bags. Remove the colander from the refrigerator and scoop the spaghetti squash into freezer-safe bags. To make it easier to use, consider dividing the squash into small freezer bags. They'll defrost faster and you can use smaller amounts. Remember to press out all of the air from the bags before you seal them shut. Store the frozen spaghetti squash for up to 8 months. Label the bags with what's inside and the date you're putting them into the freezer. Then, plan on using the squash within 8 months. Try stirring the spaghetti squash strands into your favorite meat sauce or toss thawed strands with spiralized vegetables. Storing Spaghetti Squash Casseroles in the Freezer Make spaghetti squash casserole. Microwave or roast your spaghetti squash and drag a fork over the flesh to make strands. Then, combine the strands with your favorite sauce and vegetables. For example, combine the squash with ricotta and spinach or cooked meat sauce. There's no need to cook the casserole at this point; just assemble it. It's important to cook any meat that you're adding to the casserole so you can reheat it safely. Spread the casserole in a freezer-safe baking pan. You can use disposable freezer-safe pans or a glass or metal baking dish. Try to use something that's shallow so your casserole reheats evenly. Keep in mind that if you're freezing glass pans, they will take up a lot of space in your freezer. If you're using a glass dish, you'll probably have to thaw it in the refrigerator instead of putting the casserole directly from freezer to oven. This is because drastic temperature swings can cause the glass to shatter. Let the casserole cool. You shouldn't freeze the hot casserole because it will cause freezer burn. Instead, put the casserole in the refrigerator until it cools or let it sit at room temperature for no more than 2 hours. If you put hot food into the freezer, it will raise the temperature of your freezer. This can thaw other foods that are in the freezer. Wrap the casserole dish and freeze it for up to 6 months. Once the spaghetti squash casserole has cooled, place the paper lid onto the container. If you're not using a disposable casserole dish, wrap the top of the casserole with plastic wrap and then a sheet of aluminum foil. Put the casserole into the freezer and store it for up to 6 months. Remember to label the top of the casserole with what's in the dish and the date you put it in the freezer. Reheat the casserole at 375 °F (191 °C) for 30 to 40 minutes. Preheat your oven and remove the spaghetti squash casserole from the freezer. Leave the foil cover on the casserole pan and place the casserole into the hot oven. Reheat the casserole until it's completely hot throughout.Tip: If you'd like a cheesy topping, take the foil cover off and scatter your favorite cheese over the casserole during the last 10 minutes. The cheese should become golden and bubbly. If you covered the pan with plastic wrap or a paper lid, remove it before putting the casserole in the oven.",
    "sentences": [
        " Freezing Cooked Spaghetti Squash Cut the spaghetti squash in half and scoop out the seeds.",
        "Rinse a firm spaghetti squash and place it on a cutting board.",
        "Then, carefully use a knife to slice the squash in half lengthwise.",
        "Take a metal spoon and scrape out the seeds.",
        "You can discard the seeds or roast them until they're toasted.",
        "Put the squash on a sheet and bake it at 375 °F (191 °C) for 30 to 40 minutes.",
        "Lay the spaghetti squash halves flat sides down on a baking sheet.",
        "Place them into a preheated oven and cook them until the flesh is tender.",
        "To tell if the squash has cooked enough, insert a fork or knife into the center of the flesh.",
        "You should be able to pull it out easily if it's finished.",
        "Let the squash cool and scrape the flesh with a fork.",
        "Wear oven mitts to remove the baking sheet with spaghetti squash from the oven.",
        "Set the squash aside until it's cool enough to easily handle.",
        "Then, drag the tines of a fork lengthwise across the flesh.",
        "You should see the flesh pull away into strands that look like noodles.Tip: You might want to hold the rounded side of the squash in a kitchen towel.",
        "This will make it easier to hold and will prevent the squash from sliding around.",
        "Drain the strands in a colander overnight.",
        "Place a colander over a large bowl and scoop the strands of spaghetti squash into the colander.",
        "Put the colander with the bowl into the refrigerator overnight so the moisture completely drains from the squash.",
        "Removing the moisture before you freeze it will prevent the squash from becoming soggy when you reheat it later.",
        "Transfer the cooked squash strands to freezer-safe bags.",
        "Remove the colander from the refrigerator and scoop the spaghetti squash into freezer-safe bags.",
        "To make it easier to use, consider dividing the squash into small freezer bags.",
        "They'll defrost faster and you can use smaller amounts.",
        "Remember to press out all of the air from the bags before you seal them shut.",
        "Store the frozen spaghetti squash for up to 8 months.",
        "Label the bags with what's inside and the date you're putting them into the freezer.",
        "Then, plan on using the squash within 8 months.",
        "Try stirring the spaghetti squash strands into your favorite meat sauce or toss thawed strands with spiralized vegetables.",
        "Storing Spaghetti Squash Casseroles in the Freezer Make spaghetti squash casserole.",
        "Microwave or roast your spaghetti squash and drag a fork over the flesh to make strands.",
        "Then, combine the strands with your favorite sauce and vegetables.",
        "For example, combine the squash with ricotta and spinach or cooked meat sauce.",
        "There's no need to cook the casserole at this point; just assemble it.",
        "It's important to cook any meat that you're adding to the casserole so you can reheat it safely.",
        "Spread the casserole in a freezer-safe baking pan.",
        "You can use disposable freezer-safe pans or a glass or metal baking dish.",
        "Try to use something that's shallow so your casserole reheats evenly.",
        "Keep in mind that if you're freezing glass pans, they will take up a lot of space in your freezer.",
        "If you're using a glass dish, you'll probably have to thaw it in the refrigerator instead of putting the casserole directly from freezer to oven.",
        "This is because drastic temperature swings can cause the glass to shatter.",
        "Let the casserole cool.",
        "You shouldn't freeze the hot casserole because it will cause freezer burn.",
        "Instead, put the casserole in the refrigerator until it cools or let it sit at room temperature for no more than 2 hours.",
        "If you put hot food into the freezer, it will raise the temperature of your freezer.",
        "This can thaw other foods that are in the freezer.",
        "Wrap the casserole dish and freeze it for up to 6 months.",
        "Once the spaghetti squash casserole has cooled, place the paper lid onto the container.",
        "If you're not using a disposable casserole dish, wrap the top of the casserole with plastic wrap and then a sheet of aluminum foil.",
        "Put the casserole into the freezer and store it for up to 6 months.",
        "Remember to label the top of the casserole with what's in the dish and the date you put it in the freezer.",
        "Reheat the casserole at 375 °F (191 °C) for 30 to 40 minutes.",
        "Preheat your oven and remove the spaghetti squash casserole from the freezer.",
        "Leave the foil cover on the casserole pan and place the casserole into the hot oven.",
        "Reheat the casserole until it's completely hot throughout.Tip: If you'd like a cheesy topping, take the foil cover off and scatter your favorite cheese over the casserole during the last 10 minutes.",
        "The cheese should become golden and bubbly.",
        "If you covered the pan with plastic wrap or a paper lid, remove it before putting the casserole in the oven."
    ]
}