{
    "title": "How to Do Abstract Art",
    "url": "https://www.wikihow.com/Do-Abstract-Art",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Painting an Abstract Artwork",
            "steps": [
                {
                    "headline": "Channel Jackson Pollock with a drip painting.",
                    "description": "Lay your canvas or paper on the floor. Dip a stick or dried-up paint brush into watery paint, and flick the paint over the canvas. It will fall in interesting splatters and patterns. Load a lot of paint on your brush for a big splatter, or flick your brush lightly to make little drops. Use different colors of paint, and layer drizzles and drips. Protect your floor with a drop-cloth before you put the canvas down. That way you won’t drip paint on your floor! Pollock used very fluid alkyd enamel paint to make his famous drip artworks, but any kind of watered-down paint will work."
                },
                {
                    "headline": "Create a geometric design with painter’s tape.",
                    "description": "Lay strips of painter’s tape over your canvas. Paint in the spaces between the lines of tape. You can fill each space with a different single color, paint one color over the whole canvas, or paint different colors everywhere! Wait for the paint to dry, and peel off the tape. You’ll be left with blank stripes on your canvas. You can either paint them a color, or leave them blank."
                },
                {
                    "headline": "Paint freehand, layering different colors and textures.",
                    "description": "You don’t have to use a drip-method or painter’s tape to create an abstract painting. You can use an ordinary paintbrush. Start by covering the canvas with one color of paint. That way you won’t be intimidated by a blank canvas. Make vertical and horizontal marks and curved lines in other colors to add depth to the piece. Vary the thickness with which you apply paint for visual interest. Try to have a focal point in the painting, or a place where the eye rests on, as it’s wandering around the painting. This will make your painting feel complete."
                },
                {
                    "headline": "Experiment with different structures in your composition.",
                    "description": "An abstract painting can be organized, even if it doesn’t represent anything in particular. A structure can help lead the eye through the painting. You can have the eye follow a triangular path, by having three big points. You can have a radial structure by having a bunch of lines coming from a single point. Try using letters of the alphabet, like L, H, S, and Z, as interesting structures for your painting."
                },
                {
                    "headline": "Get into the flow and have fun.",
                    "description": "An abstract painting doesn’t have to represent anything in particular, but it can be inspired by anything too: your mood, a landscape, the weather, a song. Some abstract artists describe their painting process as a blissful kind of flow, where they are entirely concentrated on the balance of colors and lines in their composition. Others experience it more as a spontaneous dance. Limit distractions in your painting space to get into a quiet, careful flow. If you want your painting to be more energetic and spontaneous, try putting on some music and painting to the beat!"
                }
            ]
        },
        {
            "name": "Making Abstract Sculptures",
            "steps": [
                {
                    "headline": "Use aluminum foil to create an abstract sculpture cheaply.",
                    "description": "You don’t have to have access to fancy art supplies to get started making an abstract sculpture. Crumpled aluminum foil has an eye-catching texture and a shiny glint. You can twist it into long snakes, roll it into smooth compact, spheres, or leave it half-crumpled for an interesting look. You can spray paint your aluminum foil sculpture whatever color you like once you’ve sculpted it. Just remember to always spray-paint in a well-ventilated place."
                },
                {
                    "headline": "Mold clay into an abstract 3-dimensional shape.",
                    "description": "You can use quick-bake or air-dry polymer clay, like Sculpey. Or, if you have access to a firing kiln, you can use ceramic clay. Mold it into any shape you please. You can try starting with a foundational shape, like a cube, or a sphere, and cutting pieces out. If you’re using polymer-clay, bake it on a baking sheet in the oven at the temperature and time recommended on the package. If you’re using air-dry clay, just let it sit overnight in a well-ventilated room. If you sculpted with ceramic clay, you’ll have to bisque fire it in a kiln, paint it with glaze, and then do a final firing."
                },
                {
                    "headline": "Try your hand at a wire sculpture for a more challenging project.",
                    "description": "Twist the outline of a shape with wire with your fingers. To connect the shape, wrap the wire tightly around the other end. Make a foundational shape, like a circle of wire, and then wrap thinner wires around it to make it 3 dimensional and add detail. Use wire pliers to trim the wire and tighten connections. You can use copper, brass, or steel wire to make your wire sculpture. Steel wire is the sturdiest, and hardest to bend, then copper, and then brass. Wire comes in different thicknesses, called gauges. Choose the thickness that’s right for your project. You can spray paint your sculpture once you’ve made it. So when you’re picking your kind of wire, worry less about the color of the wire than about its flexibility."
                }
            ]
        },
        {
            "name": "Making an Abstract Mobile",
            "steps": [
                {
                    "headline": "Cut 5 circles out of tooling foil with utility scissors.",
                    "description": "This is the first step to making an abstract mobile like Alexander Calder. Calder is famous for making beautiful abstract mobiles that shift in the air. You can make your own by suspending circles of tooling foil on copper wire. The circles should be have diameters of 2 inches (5.1 cm), 2.5 inches (6.4 cm), 3 inches (7.6 cm), 3.5 inches (8.9 cm), and 4 inches (10 cm). You can use a clay stylus to emboss designs on the circles."
                },
                {
                    "headline": "Cut 4 lengths of 16 gauge copper wire.",
                    "description": "The wires should have the lengths: 6 inches (15 cm), 9 inches (23 cm), 12 inches (30 cm), and 15 inches (38 cm). You will use the wire to suspend your foil circles."
                },
                {
                    "headline": "Use an awl to punch a hole in the smallest foil circle.",
                    "description": "Place the foil circle on a piece of foam, and then punch through, so that you don't punch an indent in your table. Punch the hole about .25 inches (0.64 cm) in from the circle's edge. The hole should be small, just big enough to fit the wire through."
                },
                {
                    "headline": "Push a copper wire through the hole.",
                    "description": "Once it's through, bend the wire twice, 90 degrees, like a staple, and punch a second hold to put it through. Push the wire through and bend it flat with wire pliers. Now the wire is firmly attached to the circle. Do the same with the next biggest circle, on the far end of the copper wire, so that the wire holds a foil circle at each end."
                },
                {
                    "headline": "Place one foil circle on each of the longer wires.",
                    "description": "Repeat the steps of punching a hole with an awl, and threading the wire through. Bending the wire back, and punch a second hole to fit the wire through. Now you will have three wires with 1 disk on each, and one wire with 2 disks."
                },
                {
                    "headline": "Find the balance point of the smallest wire and make a loop there.",
                    "description": "Lightly grasp the wire with pliers, and find the point where it does not tip right or left. That’s the balancing point. Make a loop at the balancing point by wrapping the wire around your round pliers."
                },
                {
                    "headline": "Thread the next longest wire through the loop, and repeat.",
                    "description": "Once you’ve attached the next longest wire, find its balancing point, and make a loop there to hang the next. Continue until you’ve assembled the whole mobile. Each wire will suspend the one below, with the foil disks appearing to float."
                }
            ]
        },
        {
            "name": "Exploring Other Abstract Art Forms",
            "steps": [
                {
                    "headline": "Use a digital art program to make abstract art.",
                    "description": "You can use Inkscape, Photoshop, or a different digital art software program, to make abstract digital art. Start with a background color, and then layer marks or shapes of different colors and thicknesses. In digital art programs, you can make perfect shapes with very straight lines, much more easily than you could freehand, and you can fill them in all at once with a paint bucket tool."
                },
                {
                    "headline": "Take abstracted photographs.",
                    "description": "Although photographs capture real things in the world, you can take photographs that viewers will think are abstract, if they can’t recognize the subject of the photo. For example, if you take a really zoomed-in photograph of a piece of fabric, or a pond, the ripples and shadows will look like abstract art. This is called “removing the reference,” because the viewer has no reference to judge what it is they’re looking at. Move your camera while you take the photo to create a blurry, unrecognizable image, or take a zoomed-in photo of a moving object, like a train going by. You digitally edit the photo after you’ve taken it, to make it more abstract. Turn up the saturation or the contrast. The more you fiddle with your photo, the less recognizable it will be."
                },
                {
                    "headline": "Write abstract poetry by focusing on sounds, not meanings, of words.",
                    "description": "Abstract poems sound great aloud, but they don’t necessarily tell a story. They might use a lot of rhyme and alliteration. The poem can make you picture a string of vivid images, which are beautiful, but don’t really make sense. Try picking a random word and then thinking of as many words as possible that rhyme with it. The best way to start writing abstract poetry is to read it! Get a book of poetry from the library or read some poems online. Write a list of specific visual things you’ve noticed in the past few weeks, like “lamplight on the puddle” and “red button on my sister’s sweater.” Rearrange them to form a poem. Play a game where you write a normal sentence, and then switch every major word to be its opposite. For example, if you just wrote, “I wake up to the sound of blue birds and smile,” you can switch it to: “You sleep down to the color of red dogs and weep.” Soon you have something that doesn’t make much sense, but still creates a confused sort of picture in your reader’s mind."
                }
            ]
        }
    ],
    "tyn": [
        "Painting an Abstract Artwork",
        "Acrylic enamel paint",
        "Canvas",
        "Paintbrush",
        "Painter’s tape",
        "Making Abstract Sculptures",
        "Clay",
        "Glaze",
        "Aluminum foil",
        "Wire (copper, brass, or steel)",
        "Making an Abstract Mobile",
        "Tooling foil",
        "Utility scissors",
        "Awl",
        "Wire pliers",
        "Clay stylus",
        "Exploring Other Art Forms",
        "Digital art software",
        "Camera"
    ],
    "text": " Painting an Abstract Artwork Channel Jackson Pollock with a drip painting. Lay your canvas or paper on the floor. Dip a stick or dried-up paint brush into watery paint, and flick the paint over the canvas. It will fall in interesting splatters and patterns. Load a lot of paint on your brush for a big splatter, or flick your brush lightly to make little drops. Use different colors of paint, and layer drizzles and drips. Protect your floor with a drop-cloth before you put the canvas down. That way you won’t drip paint on your floor! Pollock used very fluid alkyd enamel paint to make his famous drip artworks, but any kind of watered-down paint will work. Create a geometric design with painter’s tape. Lay strips of painter’s tape over your canvas. Paint in the spaces between the lines of tape. You can fill each space with a different single color, paint one color over the whole canvas, or paint different colors everywhere! Wait for the paint to dry, and peel off the tape. You’ll be left with blank stripes on your canvas. You can either paint them a color, or leave them blank. Paint freehand, layering different colors and textures. You don’t have to use a drip-method or painter’s tape to create an abstract painting. You can use an ordinary paintbrush. Start by covering the canvas with one color of paint. That way you won’t be intimidated by a blank canvas. Make vertical and horizontal marks and curved lines in other colors to add depth to the piece. Vary the thickness with which you apply paint for visual interest. Try to have a focal point in the painting, or a place where the eye rests on, as it’s wandering around the painting. This will make your painting feel complete. Experiment with different structures in your composition. An abstract painting can be organized, even if it doesn’t represent anything in particular. A structure can help lead the eye through the painting. You can have the eye follow a triangular path, by having three big points. You can have a radial structure by having a bunch of lines coming from a single point. Try using letters of the alphabet, like L, H, S, and Z, as interesting structures for your painting. Get into the flow and have fun. An abstract painting doesn’t have to represent anything in particular, but it can be inspired by anything too: your mood, a landscape, the weather, a song. Some abstract artists describe their painting process as a blissful kind of flow, where they are entirely concentrated on the balance of colors and lines in their composition. Others experience it more as a spontaneous dance. Limit distractions in your painting space to get into a quiet, careful flow. If you want your painting to be more energetic and spontaneous, try putting on some music and painting to the beat! Making Abstract Sculptures Use aluminum foil to create an abstract sculpture cheaply. You don’t have to have access to fancy art supplies to get started making an abstract sculpture. Crumpled aluminum foil has an eye-catching texture and a shiny glint. You can twist it into long snakes, roll it into smooth compact, spheres, or leave it half-crumpled for an interesting look. You can spray paint your aluminum foil sculpture whatever color you like once you’ve sculpted it. Just remember to always spray-paint in a well-ventilated place. Mold clay into an abstract 3-dimensional shape. You can use quick-bake or air-dry polymer clay, like Sculpey. Or, if you have access to a firing kiln, you can use ceramic clay. Mold it into any shape you please. You can try starting with a foundational shape, like a cube, or a sphere, and cutting pieces out. If you’re using polymer-clay, bake it on a baking sheet in the oven at the temperature and time recommended on the package. If you’re using air-dry clay, just let it sit overnight in a well-ventilated room. If you sculpted with ceramic clay, you’ll have to bisque fire it in a kiln, paint it with glaze, and then do a final firing. Try your hand at a wire sculpture for a more challenging project. Twist the outline of a shape with wire with your fingers. To connect the shape, wrap the wire tightly around the other end. Make a foundational shape, like a circle of wire, and then wrap thinner wires around it to make it 3 dimensional and add detail. Use wire pliers to trim the wire and tighten connections. You can use copper, brass, or steel wire to make your wire sculpture. Steel wire is the sturdiest, and hardest to bend, then copper, and then brass. Wire comes in different thicknesses, called gauges. Choose the thickness that’s right for your project. You can spray paint your sculpture once you’ve made it. So when you’re picking your kind of wire, worry less about the color of the wire than about its flexibility. Making an Abstract Mobile Cut 5 circles out of tooling foil with utility scissors. This is the first step to making an abstract mobile like Alexander Calder. Calder is famous for making beautiful abstract mobiles that shift in the air. You can make your own by suspending circles of tooling foil on copper wire. The circles should be have diameters of 2 inches (5.1 cm), 2.5 inches (6.4 cm), 3 inches (7.6 cm), 3.5 inches (8.9 cm), and 4 inches (10 cm). You can use a clay stylus to emboss designs on the circles. Cut 4 lengths of 16 gauge copper wire. The wires should have the lengths: 6 inches (15 cm), 9 inches (23 cm), 12 inches (30 cm), and 15 inches (38 cm). You will use the wire to suspend your foil circles. Use an awl to punch a hole in the smallest foil circle. Place the foil circle on a piece of foam, and then punch through, so that you don't punch an indent in your table. Punch the hole about .25 inches (0.64 cm) in from the circle's edge. The hole should be small, just big enough to fit the wire through. Push a copper wire through the hole. Once it's through, bend the wire twice, 90 degrees, like a staple, and punch a second hold to put it through. Push the wire through and bend it flat with wire pliers. Now the wire is firmly attached to the circle. Do the same with the next biggest circle, on the far end of the copper wire, so that the wire holds a foil circle at each end. Place one foil circle on each of the longer wires. Repeat the steps of punching a hole with an awl, and threading the wire through. Bending the wire back, and punch a second hole to fit the wire through. Now you will have three wires with 1 disk on each, and one wire with 2 disks. Find the balance point of the smallest wire and make a loop there. Lightly grasp the wire with pliers, and find the point where it does not tip right or left. That’s the balancing point. Make a loop at the balancing point by wrapping the wire around your round pliers. Thread the next longest wire through the loop, and repeat. Once you’ve attached the next longest wire, find its balancing point, and make a loop there to hang the next. Continue until you’ve assembled the whole mobile. Each wire will suspend the one below, with the foil disks appearing to float. Exploring Other Abstract Art Forms Use a digital art program to make abstract art. You can use Inkscape, Photoshop, or a different digital art software program, to make abstract digital art. Start with a background color, and then layer marks or shapes of different colors and thicknesses. In digital art programs, you can make perfect shapes with very straight lines, much more easily than you could freehand, and you can fill them in all at once with a paint bucket tool. Take abstracted photographs. Although photographs capture real things in the world, you can take photographs that viewers will think are abstract, if they can’t recognize the subject of the photo. For example, if you take a really zoomed-in photograph of a piece of fabric, or a pond, the ripples and shadows will look like abstract art. This is called “removing the reference,” because the viewer has no reference to judge what it is they’re looking at. Move your camera while you take the photo to create a blurry, unrecognizable image, or take a zoomed-in photo of a moving object, like a train going by. You digitally edit the photo after you’ve taken it, to make it more abstract. Turn up the saturation or the contrast. The more you fiddle with your photo, the less recognizable it will be. Write abstract poetry by focusing on sounds, not meanings, of words. Abstract poems sound great aloud, but they don’t necessarily tell a story. They might use a lot of rhyme and alliteration. The poem can make you picture a string of vivid images, which are beautiful, but don’t really make sense. Try picking a random word and then thinking of as many words as possible that rhyme with it. The best way to start writing abstract poetry is to read it! Get a book of poetry from the library or read some poems online. Write a list of specific visual things you’ve noticed in the past few weeks, like “lamplight on the puddle” and “red button on my sister’s sweater.” Rearrange them to form a poem. Play a game where you write a normal sentence, and then switch every major word to be its opposite. For example, if you just wrote, “I wake up to the sound of blue birds and smile,” you can switch it to: “You sleep down to the color of red dogs and weep.” Soon you have something that doesn’t make much sense, but still creates a confused sort of picture in your reader’s mind.",
    "sentences": [
        " Painting an Abstract Artwork Channel Jackson Pollock with a drip painting.",
        "Lay your canvas or paper on the floor.",
        "Dip a stick or dried-up paint brush into watery paint, and flick the paint over the canvas.",
        "It will fall in interesting splatters and patterns.",
        "Load a lot of paint on your brush for a big splatter, or flick your brush lightly to make little drops.",
        "Use different colors of paint, and layer drizzles and drips.",
        "Protect your floor with a drop-cloth before you put the canvas down.",
        "That way you won’t drip paint on your floor!",
        "Pollock used very fluid alkyd enamel paint to make his famous drip artworks, but any kind of watered-down paint will work.",
        "Create a geometric design with painter’s tape.",
        "Lay strips of painter’s tape over your canvas.",
        "Paint in the spaces between the lines of tape.",
        "You can fill each space with a different single color, paint one color over the whole canvas, or paint different colors everywhere!",
        "Wait for the paint to dry, and peel off the tape.",
        "You’ll be left with blank stripes on your canvas.",
        "You can either paint them a color, or leave them blank.",
        "Paint freehand, layering different colors and textures.",
        "You don’t have to use a drip-method or painter’s tape to create an abstract painting.",
        "You can use an ordinary paintbrush.",
        "Start by covering the canvas with one color of paint.",
        "That way you won’t be intimidated by a blank canvas.",
        "Make vertical and horizontal marks and curved lines in other colors to add depth to the piece.",
        "Vary the thickness with which you apply paint for visual interest.",
        "Try to have a focal point in the painting, or a place where the eye rests on, as it’s wandering around the painting.",
        "This will make your painting feel complete.",
        "Experiment with different structures in your composition.",
        "An abstract painting can be organized, even if it doesn’t represent anything in particular.",
        "A structure can help lead the eye through the painting.",
        "You can have the eye follow a triangular path, by having three big points.",
        "You can have a radial structure by having a bunch of lines coming from a single point.",
        "Try using letters of the alphabet, like L, H, S, and Z, as interesting structures for your painting.",
        "Get into the flow and have fun.",
        "An abstract painting doesn’t have to represent anything in particular, but it can be inspired by anything too: your mood, a landscape, the weather, a song.",
        "Some abstract artists describe their painting process as a blissful kind of flow, where they are entirely concentrated on the balance of colors and lines in their composition.",
        "Others experience it more as a spontaneous dance.",
        "Limit distractions in your painting space to get into a quiet, careful flow.",
        "If you want your painting to be more energetic and spontaneous, try putting on some music and painting to the beat!",
        "Making Abstract Sculptures Use aluminum foil to create an abstract sculpture cheaply.",
        "You don’t have to have access to fancy art supplies to get started making an abstract sculpture.",
        "Crumpled aluminum foil has an eye-catching texture and a shiny glint.",
        "You can twist it into long snakes, roll it into smooth compact, spheres, or leave it half-crumpled for an interesting look.",
        "You can spray paint your aluminum foil sculpture whatever color you like once you’ve sculpted it.",
        "Just remember to always spray-paint in a well-ventilated place.",
        "Mold clay into an abstract 3-dimensional shape.",
        "You can use quick-bake or air-dry polymer clay, like Sculpey.",
        "Or, if you have access to a firing kiln, you can use ceramic clay.",
        "Mold it into any shape you please.",
        "You can try starting with a foundational shape, like a cube, or a sphere, and cutting pieces out.",
        "If you’re using polymer-clay, bake it on a baking sheet in the oven at the temperature and time recommended on the package.",
        "If you’re using air-dry clay, just let it sit overnight in a well-ventilated room.",
        "If you sculpted with ceramic clay, you’ll have to bisque fire it in a kiln, paint it with glaze, and then do a final firing.",
        "Try your hand at a wire sculpture for a more challenging project.",
        "Twist the outline of a shape with wire with your fingers.",
        "To connect the shape, wrap the wire tightly around the other end.",
        "Make a foundational shape, like a circle of wire, and then wrap thinner wires around it to make it 3 dimensional and add detail.",
        "Use wire pliers to trim the wire and tighten connections.",
        "You can use copper, brass, or steel wire to make your wire sculpture.",
        "Steel wire is the sturdiest, and hardest to bend, then copper, and then brass.",
        "Wire comes in different thicknesses, called gauges.",
        "Choose the thickness that’s right for your project.",
        "You can spray paint your sculpture once you’ve made it.",
        "So when you’re picking your kind of wire, worry less about the color of the wire than about its flexibility.",
        "Making an Abstract Mobile Cut 5 circles out of tooling foil with utility scissors.",
        "This is the first step to making an abstract mobile like Alexander Calder.",
        "Calder is famous for making beautiful abstract mobiles that shift in the air.",
        "You can make your own by suspending circles of tooling foil on copper wire.",
        "The circles should be have diameters of 2 inches (5.1 cm), 2.5 inches (6.4 cm), 3 inches (7.6 cm), 3.5 inches (8.9 cm), and 4 inches (10 cm).",
        "You can use a clay stylus to emboss designs on the circles.",
        "Cut 4 lengths of 16 gauge copper wire.",
        "The wires should have the lengths: 6 inches (15 cm), 9 inches (23 cm), 12 inches (30 cm), and 15 inches (38 cm).",
        "You will use the wire to suspend your foil circles.",
        "Use an awl to punch a hole in the smallest foil circle.",
        "Place the foil circle on a piece of foam, and then punch through, so that you don't punch an indent in your table.",
        "Punch the hole about .25 inches (0.64 cm) in from the circle's edge.",
        "The hole should be small, just big enough to fit the wire through.",
        "Push a copper wire through the hole.",
        "Once it's through, bend the wire twice, 90 degrees, like a staple, and punch a second hold to put it through.",
        "Push the wire through and bend it flat with wire pliers.",
        "Now the wire is firmly attached to the circle.",
        "Do the same with the next biggest circle, on the far end of the copper wire, so that the wire holds a foil circle at each end.",
        "Place one foil circle on each of the longer wires.",
        "Repeat the steps of punching a hole with an awl, and threading the wire through.",
        "Bending the wire back, and punch a second hole to fit the wire through.",
        "Now you will have three wires with 1 disk on each, and one wire with 2 disks.",
        "Find the balance point of the smallest wire and make a loop there.",
        "Lightly grasp the wire with pliers, and find the point where it does not tip right or left.",
        "That’s the balancing point.",
        "Make a loop at the balancing point by wrapping the wire around your round pliers.",
        "Thread the next longest wire through the loop, and repeat.",
        "Once you’ve attached the next longest wire, find its balancing point, and make a loop there to hang the next.",
        "Continue until you’ve assembled the whole mobile.",
        "Each wire will suspend the one below, with the foil disks appearing to float.",
        "Exploring Other Abstract Art Forms Use a digital art program to make abstract art.",
        "You can use Inkscape, Photoshop, or a different digital art software program, to make abstract digital art.",
        "Start with a background color, and then layer marks or shapes of different colors and thicknesses.",
        "In digital art programs, you can make perfect shapes with very straight lines, much more easily than you could freehand, and you can fill them in all at once with a paint bucket tool.",
        "Take abstracted photographs.",
        "Although photographs capture real things in the world, you can take photographs that viewers will think are abstract, if they can’t recognize the subject of the photo.",
        "For example, if you take a really zoomed-in photograph of a piece of fabric, or a pond, the ripples and shadows will look like abstract art.",
        "This is called “removing the reference,” because the viewer has no reference to judge what it is they’re looking at.",
        "Move your camera while you take the photo to create a blurry, unrecognizable image, or take a zoomed-in photo of a moving object, like a train going by.",
        "You digitally edit the photo after you’ve taken it, to make it more abstract.",
        "Turn up the saturation or the contrast.",
        "The more you fiddle with your photo, the less recognizable it will be.",
        "Write abstract poetry by focusing on sounds, not meanings, of words.",
        "Abstract poems sound great aloud, but they don’t necessarily tell a story.",
        "They might use a lot of rhyme and alliteration.",
        "The poem can make you picture a string of vivid images, which are beautiful, but don’t really make sense.",
        "Try picking a random word and then thinking of as many words as possible that rhyme with it.",
        "The best way to start writing abstract poetry is to read it!",
        "Get a book of poetry from the library or read some poems online.",
        "Write a list of specific visual things you’ve noticed in the past few weeks, like “lamplight on the puddle” and “red button on my sister’s sweater.” Rearrange them to form a poem.",
        "Play a game where you write a normal sentence, and then switch every major word to be its opposite.",
        "For example, if you just wrote, “I wake up to the sound of blue birds and smile,” you can switch it to: “You sleep down to the color of red dogs and weep.” Soon you have something that doesn’t make much sense, but still creates a confused sort of picture in your reader’s mind."
    ]
}