{
    "title": "How to Shrink Pants",
    "url": "https://www.wikihow.com/Shrink-Pants",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing",
        "Clothes by Type",
        "Pants and Shorts"
    ],
    "methods": [
        {
            "name": "Boiling Your Pants",
            "steps": [
                {
                    "headline": "Clean out your sink to use as a basin.",
                    "description": "Scrub it down to make sure it's clean before you put in your clothes. If you use a product that has bleach in it, rinse it thoroughly several times so you don't get bleach on your clothes. Plug up the sink so it will hold water. Alternatively, just use a large pot. You can use any container that will hold boiling water."
                },
                {
                    "headline": "Tuck your pants into the sink or pot.",
                    "description": "Place them down in the bottom of the container. You can do more than one pair of pants at once but make sure you pick ones that are a similar color. Hot water can make the fabric bleed, so if the pants are different colors, you could end up with a brown mess."
                },
                {
                    "headline": "Boil enough water to completely cover the pants.",
                    "description": "Heat up water on the stove or in an electric kettle until it's boiling. Make sure you heat enough water that you can submerge the clothing. How much water you need depends on the size of your container. However, 1 gallon (3.8 L) should be enough if you have a pot that big."
                },
                {
                    "headline": "Pour the boiling water over the pants.",
                    "description": "When the water is boiling, carefully take it over to the container with the pants. Pour the water over them, making sure you stay away from the steam coming out the top as well as the hot water. Use tongs to lightly agitate the pants in the hot water to make sure they're completely soaked. You can also take the opposite approach: heat up water in a large pot and then use tongs to press the pants down into the hot water. In fact, some people have luck simply simmering the pants in a pot of water on the stove for 20-30 minutes."
                },
                {
                    "headline": "Leave the pants in the water until it cools down.",
                    "description": "The water will probably take 20-30 minutes to cool down. Just set a timer and walk away. You don't need to babysit your jeans during this time. If you leave them in for longer than that, it's fine."
                },
                {
                    "headline": "Throw the pants in the dryer on the highest setting.",
                    "description": "Turn the heat up on high and pick the roughest setting, such as towels and linens. Let the dryer run for at least one cycle. If the pants haven't shrunk enough, you can try running them for a second cycle."
                }
            ]
        },
        {
            "name": "Using Your Washer\\/Dryer",
            "steps": [
                {
                    "headline": "Turn the washer on the hottest setting.",
                    "description": "Turn the temperature dial to the hottest setting your washer has. Also, turn it to the longest setting, such as \"heavy\" and \"extra rinse.\" The more tumbling action the cycle has, the better, as agitation will help shrink natural fibers like cotton."
                },
                {
                    "headline": "Put your pants in the washer and press the start button.",
                    "description": "You can wash more than one pair at a time, but make sure they are similar colors. The fabrics may bleed in the hot water. Putting in extra towels may help agitate the fabric. Add 1-2 capfuls of ammonia to the wash if you're worried about color loss! You can use detergent if you want, but it's not absolutely necessary."
                },
                {
                    "headline": "Place the pants in the dryer on the hottest setting.",
                    "description": "Throw the pants in and turn the dryer on. It can help to add tennis balls or even dryer balls to the barrel. They'll help with the agitation process. If your pants are partially synthetic, such as polyester or nylon blend, set the dryer to medium. The hot setting will cause too much damage to these types of pants. Agitation helps shrink pants because it makes the fibers curl up tighter as they dry!"
                }
            ]
        },
        {
            "name": "Wearing Jeans into the Bath",
            "steps": [
                {
                    "headline": "Put your jeans on.",
                    "description": "This method is a bit odd, as you shrink your jeans while they're on you! Zip them up and button the top. You can go with or without underwear, though they might shrink a bit more if you're not wearing any. Check your pockets for any items before getting in! Also, make sure the pockets are tucked in properly. This may work with other natural fiber pants, as well."
                },
                {
                    "headline": "Fill up the bathtub with water as hot as you can stand it.",
                    "description": "Turn the bath nozzle on, making sure it's very hot but that you can still put your hand underneath. Fill up the bathtub enough that it will completely cover your jeans once you're sitting in it, including the waist. Don't go over 104 °F (40 °C). Make sure you don't make it so hot that you burn yourself!"
                },
                {
                    "headline": "Get in the water and stay in the bath for about 20 minutes.",
                    "description": "You want to stay in the bath until the water is cool. Don't keep adding hot water to the bath! Once it's cool, you can get out. Be careful getting in. If it's too hot, get out for a minute."
                },
                {
                    "headline": "Let the pants dry on you in the sun.",
                    "description": "The pants will form to your body better if you let them dry on you. However, you don't want to sit in cold pants for hours, so head outside to a sunny spot to help them dry faster. On a hot day, they'll likely dry within an hour. If it's not sunny, try sitting in front of a space heater or fireplace. They should dry within an hour. Once one side is dry, turn around to get the other side."
                }
            ]
        }
    ],
    "tyn": [
        "Boiling Your Pants",
        "Clean sink or other container",
        "Boiling hot water",
        "Tongs",
        "Using Your Washer/Dryer",
        "Washer",
        "Dryer",
        "Ammonia, optional",
        "Wearing Jeans into the Bath",
        "Bathtub",
        "Hot water"
    ],
    "text": " Boiling Your Pants Clean out your sink to use as a basin. Scrub it down to make sure it's clean before you put in your clothes. If you use a product that has bleach in it, rinse it thoroughly several times so you don't get bleach on your clothes. Plug up the sink so it will hold water. Alternatively, just use a large pot. You can use any container that will hold boiling water. Tuck your pants into the sink or pot. Place them down in the bottom of the container. You can do more than one pair of pants at once but make sure you pick ones that are a similar color. Hot water can make the fabric bleed, so if the pants are different colors, you could end up with a brown mess. Boil enough water to completely cover the pants. Heat up water on the stove or in an electric kettle until it's boiling. Make sure you heat enough water that you can submerge the clothing. How much water you need depends on the size of your container. However, 1 gallon (3.8 L) should be enough if you have a pot that big. Pour the boiling water over the pants. When the water is boiling, carefully take it over to the container with the pants. Pour the water over them, making sure you stay away from the steam coming out the top as well as the hot water. Use tongs to lightly agitate the pants in the hot water to make sure they're completely soaked. You can also take the opposite approach: heat up water in a large pot and then use tongs to press the pants down into the hot water. In fact, some people have luck simply simmering the pants in a pot of water on the stove for 20-30 minutes. Leave the pants in the water until it cools down. The water will probably take 20-30 minutes to cool down. Just set a timer and walk away. You don't need to babysit your jeans during this time. If you leave them in for longer than that, it's fine. Throw the pants in the dryer on the highest setting. Turn the heat up on high and pick the roughest setting, such as towels and linens. Let the dryer run for at least one cycle. If the pants haven't shrunk enough, you can try running them for a second cycle. Using Your Washer\\/Dryer Turn the washer on the hottest setting. Turn the temperature dial to the hottest setting your washer has. Also, turn it to the longest setting, such as \"heavy\" and \"extra rinse.\" The more tumbling action the cycle has, the better, as agitation will help shrink natural fibers like cotton. Put your pants in the washer and press the start button. You can wash more than one pair at a time, but make sure they are similar colors. The fabrics may bleed in the hot water. Putting in extra towels may help agitate the fabric. Add 1-2 capfuls of ammonia to the wash if you're worried about color loss! You can use detergent if you want, but it's not absolutely necessary. Place the pants in the dryer on the hottest setting. Throw the pants in and turn the dryer on. It can help to add tennis balls or even dryer balls to the barrel. They'll help with the agitation process. If your pants are partially synthetic, such as polyester or nylon blend, set the dryer to medium. The hot setting will cause too much damage to these types of pants. Agitation helps shrink pants because it makes the fibers curl up tighter as they dry! Wearing Jeans into the Bath Put your jeans on. This method is a bit odd, as you shrink your jeans while they're on you! Zip them up and button the top. You can go with or without underwear, though they might shrink a bit more if you're not wearing any. Check your pockets for any items before getting in! Also, make sure the pockets are tucked in properly. This may work with other natural fiber pants, as well. Fill up the bathtub with water as hot as you can stand it. Turn the bath nozzle on, making sure it's very hot but that you can still put your hand underneath. Fill up the bathtub enough that it will completely cover your jeans once you're sitting in it, including the waist. Don't go over 104 °F (40 °C). Make sure you don't make it so hot that you burn yourself! Get in the water and stay in the bath for about 20 minutes. You want to stay in the bath until the water is cool. Don't keep adding hot water to the bath! Once it's cool, you can get out. Be careful getting in. If it's too hot, get out for a minute. Let the pants dry on you in the sun. The pants will form to your body better if you let them dry on you. However, you don't want to sit in cold pants for hours, so head outside to a sunny spot to help them dry faster. On a hot day, they'll likely dry within an hour. If it's not sunny, try sitting in front of a space heater or fireplace. They should dry within an hour. Once one side is dry, turn around to get the other side.",
    "sentences": [
        " Boiling Your Pants Clean out your sink to use as a basin.",
        "Scrub it down to make sure it's clean before you put in your clothes.",
        "If you use a product that has bleach in it, rinse it thoroughly several times so you don't get bleach on your clothes.",
        "Plug up the sink so it will hold water.",
        "Alternatively, just use a large pot.",
        "You can use any container that will hold boiling water.",
        "Tuck your pants into the sink or pot.",
        "Place them down in the bottom of the container.",
        "You can do more than one pair of pants at once but make sure you pick ones that are a similar color.",
        "Hot water can make the fabric bleed, so if the pants are different colors, you could end up with a brown mess.",
        "Boil enough water to completely cover the pants.",
        "Heat up water on the stove or in an electric kettle until it's boiling.",
        "Make sure you heat enough water that you can submerge the clothing.",
        "How much water you need depends on the size of your container.",
        "However, 1 gallon (3.8 L) should be enough if you have a pot that big.",
        "Pour the boiling water over the pants.",
        "When the water is boiling, carefully take it over to the container with the pants.",
        "Pour the water over them, making sure you stay away from the steam coming out the top as well as the hot water.",
        "Use tongs to lightly agitate the pants in the hot water to make sure they're completely soaked.",
        "You can also take the opposite approach: heat up water in a large pot and then use tongs to press the pants down into the hot water.",
        "In fact, some people have luck simply simmering the pants in a pot of water on the stove for 20-30 minutes.",
        "Leave the pants in the water until it cools down.",
        "The water will probably take 20-30 minutes to cool down.",
        "Just set a timer and walk away.",
        "You don't need to babysit your jeans during this time.",
        "If you leave them in for longer than that, it's fine.",
        "Throw the pants in the dryer on the highest setting.",
        "Turn the heat up on high and pick the roughest setting, such as towels and linens.",
        "Let the dryer run for at least one cycle.",
        "If the pants haven't shrunk enough, you can try running them for a second cycle.",
        "Using Your Washer\\/Dryer Turn the washer on the hottest setting.",
        "Turn the temperature dial to the hottest setting your washer has.",
        "Also, turn it to the longest setting, such as \"heavy\" and \"extra rinse.\"",
        "The more tumbling action the cycle has, the better, as agitation will help shrink natural fibers like cotton.",
        "Put your pants in the washer and press the start button.",
        "You can wash more than one pair at a time, but make sure they are similar colors.",
        "The fabrics may bleed in the hot water.",
        "Putting in extra towels may help agitate the fabric.",
        "Add 1-2 capfuls of ammonia to the wash if you're worried about color loss!",
        "You can use detergent if you want, but it's not absolutely necessary.",
        "Place the pants in the dryer on the hottest setting.",
        "Throw the pants in and turn the dryer on.",
        "It can help to add tennis balls or even dryer balls to the barrel.",
        "They'll help with the agitation process.",
        "If your pants are partially synthetic, such as polyester or nylon blend, set the dryer to medium.",
        "The hot setting will cause too much damage to these types of pants.",
        "Agitation helps shrink pants because it makes the fibers curl up tighter as they dry!",
        "Wearing Jeans into the Bath Put your jeans on.",
        "This method is a bit odd, as you shrink your jeans while they're on you!",
        "Zip them up and button the top.",
        "You can go with or without underwear, though they might shrink a bit more if you're not wearing any.",
        "Check your pockets for any items before getting in!",
        "Also, make sure the pockets are tucked in properly.",
        "This may work with other natural fiber pants, as well.",
        "Fill up the bathtub with water as hot as you can stand it.",
        "Turn the bath nozzle on, making sure it's very hot but that you can still put your hand underneath.",
        "Fill up the bathtub enough that it will completely cover your jeans once you're sitting in it, including the waist.",
        "Don't go over 104 °F (40 °C).",
        "Make sure you don't make it so hot that you burn yourself!",
        "Get in the water and stay in the bath for about 20 minutes.",
        "You want to stay in the bath until the water is cool.",
        "Don't keep adding hot water to the bath!",
        "Once it's cool, you can get out.",
        "Be careful getting in.",
        "If it's too hot, get out for a minute.",
        "Let the pants dry on you in the sun.",
        "The pants will form to your body better if you let them dry on you.",
        "However, you don't want to sit in cold pants for hours, so head outside to a sunny spot to help them dry faster.",
        "On a hot day, they'll likely dry within an hour.",
        "If it's not sunny, try sitting in front of a space heater or fireplace.",
        "They should dry within an hour.",
        "Once one side is dry, turn around to get the other side."
    ]
}