{
    "title": "How to Make Elf Shoes",
    "url": "https://www.wikihow.com/Make-Elf-Shoes",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Christmas"
    ],
    "methods": [
        {
            "name": "Sewing with a Regular Stitch",
            "steps": [
                {
                    "headline": "Create 2 shoe templates out of cardstock.",
                    "description": "Make 1 sole template by tracing the bottom of your foot along a piece of cardstock. To create the side shoe template, measure the length of your foot and the height of your leg up to the ankle. Once you do this, you can transfer these measurements to create patterns for the sides of your curved elf shoes."
                },
                {
                    "headline": "Make a fringe pattern for the edge of your shoes.",
                    "description": "Measure the circumference of your ankle to figure out the length of your fringe. Next, draw a series of connected triangles along this length. Make the length of each triangle at least 2 inches (5.1 cm). The width of the fringe strip depends on your design preference—if you want a larger fringe, make it 2 inches (5.1 cm). If you want a shorter fringe, make it smaller. The fringe pattern will look like a miniature mountain range."
                },
                {
                    "headline": "Trace and cut out the fabric pieces from the shoe templates.",
                    "description": "Sketch around your sole, fringe, and side shoe templates on different colored pieces of fabric with a permanent marker before cutting them out with a pair of fabric scissors. To create a fun color scheme, consider cutting  2 sole pieces out of white material, 2 side shoe pieces out of green, and 1 fringe piece out of red. In total, you’ll need 2 sole pieces, 4 side shoe pieces, and 1 longer fringe. Cut out 2 soles at once by pinning 2 pieces of fabric together to save time later on. To cut out the fringe more efficiently, trace the pattern onto a folded, paper-sized piece of red fabric before cutting it out. Set this piece of fabric aside, as you’ll be needing it momentarily."
                },
                {
                    "headline": "Sew the heel ends of the felt pieces together.",
                    "description": "Thread your sewing needle and stitch the heels of the side shoe fabric portions together. When placed on a flat surface, the sewn pieces will look like mirror images of one another. Make sure that there’s 0.25 inches (0.64 cm) of seam allowance between your stitches and the edge of the fabric."
                },
                {
                    "headline": "Sew the fringe onto the top portion of the shoe.",
                    "description": "Align and stitch the red fringe along the ankles of the side shoe pieces. Keep in mind that the shoe is currently facing inside out, so make sure that the fringe stitches are also facing outward. Don’t worry—you’ll be turning your shoes right side out once everything is stitched together."
                },
                {
                    "headline": "Pin and sew the sole to the bottom of the side shoe pieces.",
                    "description": "Stitch the sole piece to the bottom of the side shoe pieces. Double-check to ensure that the shoe is turned inside out when you’re attaching the sole. If you have a lot of excess fabric in your seams, consider trimming it away with scissors before turning the shoe right side out."
                },
                {
                    "headline": "Connect the side shoe pieces with pins and sew them together.",
                    "description": "Pin the top, unsewn edges going vertically down the front of the shoe. This is the last part of the shoe that needs to be sewn, but make sure that you don’t stitch these edges all the way up to the ankle. The shoe should be wide enough for an entire foot to fit into!"
                },
                {
                    "headline": "Flip the shoes right side out and glue on any decorations.",
                    "description": "Tuck and position the sewn shoes so that the fabric is right side out and the seams are no longer visible. Use a hot glue gun to attach 1 inch (2.5 cm) pieces of Velcro to the flaps of the shoe, and also to stick small jingle bells on top of the pointed toe. Be certain that the glue is dry before you try on the shoes."
                }
            ]
        },
        {
            "name": "Using a Blanket Stitch",
            "steps": [
                {
                    "headline": "Draw or print out patterns of the shoe’s sole and side pieces.",
                    "description": "Go online and print out several patterns for the elf shoes. If the patterns are too small for your own shoe size, use the images as a reference when making your own templates. Double check your foot length and ankle height with a tape measure before cutting out any pattern pieces. Use this template to get started: https://www.activityvillage.co.uk/elf-shoes. If you want a firmer shoe template, use cardstock instead of regular paper."
                },
                {
                    "headline": "Sketch the shoe patterns onto thick fabric and cut them out.",
                    "description": "Use a permanent marker to trace around your cardstock or paper templates onto the fabric. Once you have a clear sketch, cut out the shapes with a pair of fabric scissors. Durable, sturdy fabrics like felt work best for this design, and can be found inexpensively at most craft stores."
                },
                {
                    "headline": "Sew the side and sole pieces together using a blanket stitch.",
                    "description": "Take a thick thread and knot it through the eye of the needle. Sew a stitch that’s around 1 centimetre (0.39 in) in length—it can be longer or shorter, depending on how wide you want the stitching to be. Keep looping each new stitch through the previous one until the 2 side shoe pieces and sole piece are connected. Knot off the thread and tuck it into a random stitch to finish sewing. For more consistent stitching, consider pinning the pieces together before you start."
                },
                {
                    "headline": "Sew on the top shoe piece using a series of blanket stitches.",
                    "description": "Complete the shoe by attaching the top piece of fabric to the rest of the stitched shoe. Knot the end of the thread once you’re done sewing this piece into place, and use the needle to tuck any spare thread into a previous stitch. If needed, you can also use pins to keep your project secure."
                },
                {
                    "headline": "Add any extra decorations to the shoe with hot glue.",
                    "description": "Apply small dots or short lines of hot glue to any Pom-poms or jingle bells you feel like attaching to the shoe. You can add as many or as few decorations as you want."
                }
            ]
        },
        {
            "name": "Forming Elf Shoes from Tape",
            "steps": [
                {
                    "headline": "Have someone put on a pair of long socks before starting.",
                    "description": "Instruct a friend or family member to put on a pair of long socks that reach around mid-calf level. Make sure that they’re a pair of socks you don’t want to wear again, since they’ll be serving as the base of your taped elf shoes. If you want to make these shoes for yourself, have a friend or family member with your shoe size put on the socks."
                },
                {
                    "headline": "Loop the plain tape around the socks until they are completely covered.",
                    "description": "Take a roll of gray duct tape and wrap it around the entirety of the sock. Roll the tape tightly to make sure that it’s completely covering the sock. The plain duct tape will serve as the base layer, with black duct tape being added later. While you want the tape to be snug around the sock, you don’t want to constrict the other person’s legs and feet."
                },
                {
                    "headline": "Cut vertically from knee to ankle to remove the taped sock.",
                    "description": "Take a pair of fabric scissors and cut in a vertical line down the taped sock. Keep cutting downward until you reach ankle level. Measure 1 inch (2.5 cm) to 2 inches (5.1 cm) above your ankle, and trim horizontally around that point to remove any of the excess taped sock. Feel free to have the person remove the socks after this. The portion of taped sock above the ankle serves as a shoe cuff. Once you’re finished cutting off the excess sock, there should be a V-shaped gap along the front of the shoe."
                },
                {
                    "headline": "Crumple some aluminum foil and mold it into a crescent shape along the toe area.",
                    "description": "Crush a small square of aluminum foil and mold it into a cone shape. It doesn’t matter how large the foil piece is, as long as it’s big enough to serve as the curved toe point of the shoe. Once you’ve formed two curved toe pieces out of foil, position them on the ends of the elf shoes. As you work with the foil, keep pressing your fingers along the inner walls of the taped sock to keep it from shrinking. Don’t roll any plain duct tape around the foil pieces, because you’ll be covering them with black duct tape later."
                },
                {
                    "headline": "Slip zip ties through 2 jingle bells and tape them onto the toe area.",
                    "description": "Take a zip tie and pull it through the back of a small jingle bell. Secure the zip tie in a tight circle before locking it into position. Use a small square of plain duct tape to secure the zip-tied bells to the foil toe tips. Don’t worry if the foil shifts a bit—you’ll be able to realign it once you start wrapping the black duct tape around it."
                },
                {
                    "headline": "Wrap the entire shoe in black duct tape, and secure the toe points into place.",
                    "description": "Secure the taped sock with one hand while you use your opposite hand to wrap a roll of black duct tape around the taped sock. The black tape should cover the base tape layer, and should cover the small tape piece used to secure the jingle bells. Make any necessary adjustments at this time, such as taping over the gap in the center of the shoe."
                }
            ]
        }
    ],
    "tyn": [
        "Sewing with a Regular Stitch",
        "Cardstock",
        "Printer paper (optional)",
        "Permanent marker",
        "Felt (green, red, white)",
        "White thread",
        "Sewing needle",
        "Pins",
        "Fabric scissors",
        "Velcro",
        "Jingle bells",
        "Hot glue gun",
        "Glue sticks",
        "Using a Blanket Stitch",
        "Blanket yarn",
        "Large knitting needle",
        "Extra decorations (optional)",
        "Forming Elf Shoes from Tape",
        "Regular duct tape",
        "Long pair of socks",
        "Scissors",
        "Aluminum foil",
        "Zip ties",
        "Black duct tape"
    ],
    "text": " Sewing with a Regular Stitch Create 2 shoe templates out of cardstock. Make 1 sole template by tracing the bottom of your foot along a piece of cardstock. To create the side shoe template, measure the length of your foot and the height of your leg up to the ankle. Once you do this, you can transfer these measurements to create patterns for the sides of your curved elf shoes. Make a fringe pattern for the edge of your shoes. Measure the circumference of your ankle to figure out the length of your fringe. Next, draw a series of connected triangles along this length. Make the length of each triangle at least 2 inches (5.1 cm). The width of the fringe strip depends on your design preference—if you want a larger fringe, make it 2 inches (5.1 cm). If you want a shorter fringe, make it smaller. The fringe pattern will look like a miniature mountain range. Trace and cut out the fabric pieces from the shoe templates. Sketch around your sole, fringe, and side shoe templates on different colored pieces of fabric with a permanent marker before cutting them out with a pair of fabric scissors. To create a fun color scheme, consider cutting  2 sole pieces out of white material, 2 side shoe pieces out of green, and 1 fringe piece out of red. In total, you’ll need 2 sole pieces, 4 side shoe pieces, and 1 longer fringe. Cut out 2 soles at once by pinning 2 pieces of fabric together to save time later on. To cut out the fringe more efficiently, trace the pattern onto a folded, paper-sized piece of red fabric before cutting it out. Set this piece of fabric aside, as you’ll be needing it momentarily. Sew the heel ends of the felt pieces together. Thread your sewing needle and stitch the heels of the side shoe fabric portions together. When placed on a flat surface, the sewn pieces will look like mirror images of one another. Make sure that there’s 0.25 inches (0.64 cm) of seam allowance between your stitches and the edge of the fabric. Sew the fringe onto the top portion of the shoe. Align and stitch the red fringe along the ankles of the side shoe pieces. Keep in mind that the shoe is currently facing inside out, so make sure that the fringe stitches are also facing outward. Don’t worry—you’ll be turning your shoes right side out once everything is stitched together. Pin and sew the sole to the bottom of the side shoe pieces. Stitch the sole piece to the bottom of the side shoe pieces. Double-check to ensure that the shoe is turned inside out when you’re attaching the sole. If you have a lot of excess fabric in your seams, consider trimming it away with scissors before turning the shoe right side out. Connect the side shoe pieces with pins and sew them together. Pin the top, unsewn edges going vertically down the front of the shoe. This is the last part of the shoe that needs to be sewn, but make sure that you don’t stitch these edges all the way up to the ankle. The shoe should be wide enough for an entire foot to fit into! Flip the shoes right side out and glue on any decorations. Tuck and position the sewn shoes so that the fabric is right side out and the seams are no longer visible. Use a hot glue gun to attach 1 inch (2.5 cm) pieces of Velcro to the flaps of the shoe, and also to stick small jingle bells on top of the pointed toe. Be certain that the glue is dry before you try on the shoes. Using a Blanket Stitch Draw or print out patterns of the shoe’s sole and side pieces. Go online and print out several patterns for the elf shoes. If the patterns are too small for your own shoe size, use the images as a reference when making your own templates. Double check your foot length and ankle height with a tape measure before cutting out any pattern pieces. Use this template to get started: https://www.activityvillage.co.uk/elf-shoes. If you want a firmer shoe template, use cardstock instead of regular paper. Sketch the shoe patterns onto thick fabric and cut them out. Use a permanent marker to trace around your cardstock or paper templates onto the fabric. Once you have a clear sketch, cut out the shapes with a pair of fabric scissors. Durable, sturdy fabrics like felt work best for this design, and can be found inexpensively at most craft stores. Sew the side and sole pieces together using a blanket stitch. Take a thick thread and knot it through the eye of the needle. Sew a stitch that’s around 1 centimetre (0.39 in) in length—it can be longer or shorter, depending on how wide you want the stitching to be. Keep looping each new stitch through the previous one until the 2 side shoe pieces and sole piece are connected. Knot off the thread and tuck it into a random stitch to finish sewing. For more consistent stitching, consider pinning the pieces together before you start. Sew on the top shoe piece using a series of blanket stitches. Complete the shoe by attaching the top piece of fabric to the rest of the stitched shoe. Knot the end of the thread once you’re done sewing this piece into place, and use the needle to tuck any spare thread into a previous stitch. If needed, you can also use pins to keep your project secure. Add any extra decorations to the shoe with hot glue. Apply small dots or short lines of hot glue to any Pom-poms or jingle bells you feel like attaching to the shoe. You can add as many or as few decorations as you want. Forming Elf Shoes from Tape Have someone put on a pair of long socks before starting. Instruct a friend or family member to put on a pair of long socks that reach around mid-calf level. Make sure that they’re a pair of socks you don’t want to wear again, since they’ll be serving as the base of your taped elf shoes. If you want to make these shoes for yourself, have a friend or family member with your shoe size put on the socks. Loop the plain tape around the socks until they are completely covered. Take a roll of gray duct tape and wrap it around the entirety of the sock. Roll the tape tightly to make sure that it’s completely covering the sock. The plain duct tape will serve as the base layer, with black duct tape being added later. While you want the tape to be snug around the sock, you don’t want to constrict the other person’s legs and feet. Cut vertically from knee to ankle to remove the taped sock. Take a pair of fabric scissors and cut in a vertical line down the taped sock. Keep cutting downward until you reach ankle level. Measure 1 inch (2.5 cm) to 2 inches (5.1 cm) above your ankle, and trim horizontally around that point to remove any of the excess taped sock. Feel free to have the person remove the socks after this. The portion of taped sock above the ankle serves as a shoe cuff. Once you’re finished cutting off the excess sock, there should be a V-shaped gap along the front of the shoe. Crumple some aluminum foil and mold it into a crescent shape along the toe area. Crush a small square of aluminum foil and mold it into a cone shape. It doesn’t matter how large the foil piece is, as long as it’s big enough to serve as the curved toe point of the shoe. Once you’ve formed two curved toe pieces out of foil, position them on the ends of the elf shoes. As you work with the foil, keep pressing your fingers along the inner walls of the taped sock to keep it from shrinking. Don’t roll any plain duct tape around the foil pieces, because you’ll be covering them with black duct tape later. Slip zip ties through 2 jingle bells and tape them onto the toe area. Take a zip tie and pull it through the back of a small jingle bell. Secure the zip tie in a tight circle before locking it into position. Use a small square of plain duct tape to secure the zip-tied bells to the foil toe tips. Don’t worry if the foil shifts a bit—you’ll be able to realign it once you start wrapping the black duct tape around it. Wrap the entire shoe in black duct tape, and secure the toe points into place. Secure the taped sock with one hand while you use your opposite hand to wrap a roll of black duct tape around the taped sock. The black tape should cover the base tape layer, and should cover the small tape piece used to secure the jingle bells. Make any necessary adjustments at this time, such as taping over the gap in the center of the shoe.",
    "sentences": [
        " Sewing with a Regular Stitch Create 2 shoe templates out of cardstock.",
        "Make 1 sole template by tracing the bottom of your foot along a piece of cardstock.",
        "To create the side shoe template, measure the length of your foot and the height of your leg up to the ankle.",
        "Once you do this, you can transfer these measurements to create patterns for the sides of your curved elf shoes.",
        "Make a fringe pattern for the edge of your shoes.",
        "Measure the circumference of your ankle to figure out the length of your fringe.",
        "Next, draw a series of connected triangles along this length.",
        "Make the length of each triangle at least 2 inches (5.1 cm).",
        "The width of the fringe strip depends on your design preference—if you want a larger fringe, make it 2 inches (5.1 cm).",
        "If you want a shorter fringe, make it smaller.",
        "The fringe pattern will look like a miniature mountain range.",
        "Trace and cut out the fabric pieces from the shoe templates.",
        "Sketch around your sole, fringe, and side shoe templates on different colored pieces of fabric with a permanent marker before cutting them out with a pair of fabric scissors.",
        "To create a fun color scheme, consider cutting  2 sole pieces out of white material, 2 side shoe pieces out of green, and 1 fringe piece out of red.",
        "In total, you’ll need 2 sole pieces, 4 side shoe pieces, and 1 longer fringe.",
        "Cut out 2 soles at once by pinning 2 pieces of fabric together to save time later on.",
        "To cut out the fringe more efficiently, trace the pattern onto a folded, paper-sized piece of red fabric before cutting it out.",
        "Set this piece of fabric aside, as you’ll be needing it momentarily.",
        "Sew the heel ends of the felt pieces together.",
        "Thread your sewing needle and stitch the heels of the side shoe fabric portions together.",
        "When placed on a flat surface, the sewn pieces will look like mirror images of one another.",
        "Make sure that there’s 0.25 inches (0.64 cm) of seam allowance between your stitches and the edge of the fabric.",
        "Sew the fringe onto the top portion of the shoe.",
        "Align and stitch the red fringe along the ankles of the side shoe pieces.",
        "Keep in mind that the shoe is currently facing inside out, so make sure that the fringe stitches are also facing outward.",
        "Don’t worry—you’ll be turning your shoes right side out once everything is stitched together.",
        "Pin and sew the sole to the bottom of the side shoe pieces.",
        "Stitch the sole piece to the bottom of the side shoe pieces.",
        "Double-check to ensure that the shoe is turned inside out when you’re attaching the sole.",
        "If you have a lot of excess fabric in your seams, consider trimming it away with scissors before turning the shoe right side out.",
        "Connect the side shoe pieces with pins and sew them together.",
        "Pin the top, unsewn edges going vertically down the front of the shoe.",
        "This is the last part of the shoe that needs to be sewn, but make sure that you don’t stitch these edges all the way up to the ankle.",
        "The shoe should be wide enough for an entire foot to fit into!",
        "Flip the shoes right side out and glue on any decorations.",
        "Tuck and position the sewn shoes so that the fabric is right side out and the seams are no longer visible.",
        "Use a hot glue gun to attach 1 inch (2.5 cm) pieces of Velcro to the flaps of the shoe, and also to stick small jingle bells on top of the pointed toe.",
        "Be certain that the glue is dry before you try on the shoes.",
        "Using a Blanket Stitch Draw or print out patterns of the shoe’s sole and side pieces.",
        "Go online and print out several patterns for the elf shoes.",
        "If the patterns are too small for your own shoe size, use the images as a reference when making your own templates.",
        "Double check your foot length and ankle height with a tape measure before cutting out any pattern pieces.",
        "Use this template to get started: https://www.activityvillage.co.uk/elf-shoes.",
        "If you want a firmer shoe template, use cardstock instead of regular paper.",
        "Sketch the shoe patterns onto thick fabric and cut them out.",
        "Use a permanent marker to trace around your cardstock or paper templates onto the fabric.",
        "Once you have a clear sketch, cut out the shapes with a pair of fabric scissors.",
        "Durable, sturdy fabrics like felt work best for this design, and can be found inexpensively at most craft stores.",
        "Sew the side and sole pieces together using a blanket stitch.",
        "Take a thick thread and knot it through the eye of the needle.",
        "Sew a stitch that’s around 1 centimetre (0.39 in) in length—it can be longer or shorter, depending on how wide you want the stitching to be.",
        "Keep looping each new stitch through the previous one until the 2 side shoe pieces and sole piece are connected.",
        "Knot off the thread and tuck it into a random stitch to finish sewing.",
        "For more consistent stitching, consider pinning the pieces together before you start.",
        "Sew on the top shoe piece using a series of blanket stitches.",
        "Complete the shoe by attaching the top piece of fabric to the rest of the stitched shoe.",
        "Knot the end of the thread once you’re done sewing this piece into place, and use the needle to tuck any spare thread into a previous stitch.",
        "If needed, you can also use pins to keep your project secure.",
        "Add any extra decorations to the shoe with hot glue.",
        "Apply small dots or short lines of hot glue to any Pom-poms or jingle bells you feel like attaching to the shoe.",
        "You can add as many or as few decorations as you want.",
        "Forming Elf Shoes from Tape Have someone put on a pair of long socks before starting.",
        "Instruct a friend or family member to put on a pair of long socks that reach around mid-calf level.",
        "Make sure that they’re a pair of socks you don’t want to wear again, since they’ll be serving as the base of your taped elf shoes.",
        "If you want to make these shoes for yourself, have a friend or family member with your shoe size put on the socks.",
        "Loop the plain tape around the socks until they are completely covered.",
        "Take a roll of gray duct tape and wrap it around the entirety of the sock.",
        "Roll the tape tightly to make sure that it’s completely covering the sock.",
        "The plain duct tape will serve as the base layer, with black duct tape being added later.",
        "While you want the tape to be snug around the sock, you don’t want to constrict the other person’s legs and feet.",
        "Cut vertically from knee to ankle to remove the taped sock.",
        "Take a pair of fabric scissors and cut in a vertical line down the taped sock.",
        "Keep cutting downward until you reach ankle level.",
        "Measure 1 inch (2.5 cm) to 2 inches (5.1 cm) above your ankle, and trim horizontally around that point to remove any of the excess taped sock.",
        "Feel free to have the person remove the socks after this.",
        "The portion of taped sock above the ankle serves as a shoe cuff.",
        "Once you’re finished cutting off the excess sock, there should be a V-shaped gap along the front of the shoe.",
        "Crumple some aluminum foil and mold it into a crescent shape along the toe area.",
        "Crush a small square of aluminum foil and mold it into a cone shape.",
        "It doesn’t matter how large the foil piece is, as long as it’s big enough to serve as the curved toe point of the shoe.",
        "Once you’ve formed two curved toe pieces out of foil, position them on the ends of the elf shoes.",
        "As you work with the foil, keep pressing your fingers along the inner walls of the taped sock to keep it from shrinking.",
        "Don’t roll any plain duct tape around the foil pieces, because you’ll be covering them with black duct tape later.",
        "Slip zip ties through 2 jingle bells and tape them onto the toe area.",
        "Take a zip tie and pull it through the back of a small jingle bell.",
        "Secure the zip tie in a tight circle before locking it into position.",
        "Use a small square of plain duct tape to secure the zip-tied bells to the foil toe tips.",
        "Don’t worry if the foil shifts a bit—you’ll be able to realign it once you start wrapping the black duct tape around it.",
        "Wrap the entire shoe in black duct tape, and secure the toe points into place.",
        "Secure the taped sock with one hand while you use your opposite hand to wrap a roll of black duct tape around the taped sock.",
        "The black tape should cover the base tape layer, and should cover the small tape piece used to secure the jingle bells.",
        "Make any necessary adjustments at this time, such as taping over the gap in the center of the shoe."
    ]
}