{
    "title": "How to Make a Paper Dagger",
    "url": "https://www.wikihow.com/Make-a-Paper-Dagger",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Paper Craft"
    ],
    "methods": [
        {
            "name": "Making a Folded Paper Dagger",
            "steps": [
                {
                    "headline": "Use a square sheet of paper.",
                    "description": "It shouldn't be too stiff because it needs to fold easily. Also, if you are new to folding origami, you should start with a larger piece of paper."
                },
                {
                    "headline": "Begin with backside of the paper facing up.",
                    "description": "The pretty side of the paper should be facing the table. It doesn't matter if you're using a plain sheet of paper, though a two-sided sheet can make the folds easier to see. Also, begin with the paper making a square in front of you, not turned like a diamond."
                },
                {
                    "headline": "Fold the top half of the paper down.",
                    "description": "Match the top corners with the bottom corners, and then make a crease in the middle. Unfold the paper again."
                },
                {
                    "headline": "Fold the left half of the paper to the right half.",
                    "description": "Match up the left side corners with the right side corners. Make a crease down the center. Unfold again. At this point, the paper should be the same size you started with but with creases down the middle going horizontally and vertically."
                },
                {
                    "headline": "Turn the paper over.",
                    "description": "The pretty side should now be facing up."
                },
                {
                    "headline": "Fold the paper diagonally in half.",
                    "description": "Fold it down from the top left corner to the bottom right corner, matching up the sides. Create a diagonal crease. Unfold it."
                },
                {
                    "headline": "Fold the paper diagonally the opposite way.",
                    "description": "Fold the paper from the bottom left corner up to the upper right corner, creasing along the diagonal again. Unfold it. At this point, you should still have the original square but with vertical and horizontal folds on one side and diagonal folds on the other."
                },
                {
                    "headline": "Turn the paper.",
                    "description": "Turn the paper 45 degrees so that one of the points is facing up. You should have a diamond facing you now."
                },
                {
                    "headline": "Fold in the two side corners.",
                    "description": "Fold in each side of the diamond until the outside corner is touching the center of the diamond. Crease them, and keep them folded. You now have a small square in the center with a triangle on the top and bottom."
                },
                {
                    "headline": "Flip the paper over.",
                    "description": "The backside should be facing up now."
                },
                {
                    "headline": "Fold in each side to the center.",
                    "description": "Make a vertical crease that pulls each side into to the center line. You're making the whole shape skinnier. The points of the side triangles should flip around as you fold in the sides."
                },
                {
                    "headline": "Fold in the points to the center.",
                    "description": "The points that flipped around with the fold should be sticking out. Fold them into the center point, creasing along the side. You should now have four diamonds surrounded by triangles pointing inward."
                },
                {
                    "headline": "Fold the second to last diamond in half horizontally.",
                    "description": "Tuck the bottom under the top rather than the other way around, called a mountain fold."
                },
                {
                    "headline": "Create a valley fold going the other way.",
                    "description": "Pull out the bottom half, and halfway between the crease you made in the last step and the bottom of the same diamond, fold the paper the other way. You are creating what's called a valley fold. You are essentially making a small tuck in the paper."
                },
                {
                    "headline": "Create the handle.",
                    "description": "For the handle, you make a squash fold. You'll make valley folds from where you tucked the paper down to the bottom of the paper. Next, make small mountain folds that run diagonal from the side tips of the small diamonds at the tuck to the outer edges; these should only be as long as the bottom tip of the small diamond created by the tuck. You'll also be unfolding part of the tuck. Pull in the sides of the handle along the valley folds, using the mountain folds as a guide to flatten out part of the tuck. Flatten the creases. You should have a passable handle now.,"
                },
                {
                    "headline": "Create a squared-off bottom edge.",
                    "description": "Fold up the small triangle at the bottom of the handle to create a straight edge."
                },
                {
                    "headline": "Make another tuck.",
                    "description": "Above the handle, you should see a small diamond. Create a mountain fold at the top of the diamond horizontally and a valley fold horizontally at the middle. You are making another layer above the handle through folding, so the bottom of the fold should line up with the top of the handle. Crease the fold."
                },
                {
                    "headline": "Use another squash fold to create the blade.",
                    "description": "Fold vertical valley folds along the blade that line up with the handle. Create small diagonal mountain folds at the bottom corners of the blade that fold down the corners. Folding in the valley folds to meet in the middle, flatten out the triangles at the bottom as part of the crossguard of the dagger."
                },
                {
                    "headline": "Turn it over.",
                    "description": "The dagger is done."
                }
            ]
        },
        {
            "name": "Making a Glued Paper Dagger",
            "steps": [
                {
                    "headline": "Draw a dagger on a piece of thick paper or cardstock.",
                    "description": "Use a ruler and pictures of daggers to help you. Make it one continuous piece, and don't make it too thin, as the cut-out pieces will be difficult to line up."
                },
                {
                    "headline": "Cut out the dagger.",
                    "description": "Use scissors or a craft knife to cut out the dagger you created."
                },
                {
                    "headline": "Trace the design.",
                    "description": "Use the dagger as a template, tracing it onto other sheets of paper. You'll need at least ten sheets, though you may want more for a sturdier design. To make this process simpler, you can simply print out the same design of a dagger over and over. You can use whatever kind of paper you want for this project, though medium weight is probably best. You can even make a dagger out of book pages."
                },
                {
                    "headline": "Cut out the dagger.",
                    "description": "Cut out each dagger with scissors or a craft knife."
                },
                {
                    "headline": "Glue the daggers together.",
                    "description": "Align each dagger, and use paper glue to glue them together. Make sure to smooth out each layer so you don't get wrinkles. Add as many layers as you want until you get your desired thickness and sturdiness."
                },
                {
                    "headline": "Trim the dagger.",
                    "description": "Trim up any edges that are sticking out from the dagger."
                },
                {
                    "headline": "Press the dagger.",
                    "description": "Place the dagger between two parchment paper sheets, and put it under something heavy. Leave it to dry overnight."
                },
                {
                    "headline": "Add details.",
                    "description": "For instance, you could add layers to the crossguard to make it more pronounced or shapes to the handle to make jewels."
                },
                {
                    "headline": "Paint the dagger.",
                    "description": "Paint the dagger so it looks real. You can add scroll work to the handles and paint the jewels in various colors."
                }
            ]
        },
        {
            "name": "Making a Papier-Mâché Pulp Dagger",
            "steps": [
                {
                    "headline": "Tear paper into pieces.",
                    "description": "You can use construction paper or scrap paper, such as newspaper, for this process."
                },
                {
                    "headline": "Fill a bowl or bucket up partway with the paper scraps.",
                    "description": "Add water to the top. Leave them overnight to absorb water. For a quicker method, pour boiling water over the paper scraps. Leave it alone until the water cools down."
                },
                {
                    "headline": "Use a blender or electric mixer on the paper.",
                    "description": "Blend the paper until it is liquid."
                },
                {
                    "headline": "Remove excess water.",
                    "description": "Use your hands to squeeze out the water from the pulp. You can also use a stocking and a colander to drain out water. Just leave it over the sink for 30 minutes or so to drain the water."
                },
                {
                    "headline": "Add paste.",
                    "description": "Use PVA glue or wallpaper paste for the mixture. Add enough to make it feel like clay. If you want to save the papier-mâché pulp for later projects, don't add glue. Roll it into balls, and let them dry. Reconstitute them with water, and add the glue in at that time. Some recipes don't call for glue, but it will be more durable with glue."
                },
                {
                    "headline": "Shape the pulp.",
                    "description": "Shape the pulp into a dagger on parchment paper. You can use a mold for this part if you have one."
                },
                {
                    "headline": "Leave the dagger to dry.",
                    "description": "It can take a couple of days if it is thick."
                },
                {
                    "headline": "Paint the dagger.",
                    "description": "If desired, add details to the finished dagger with paint."
                }
            ]
        }
    ],
    "tyn": [
        "Paper glue",
        "Paper",
        "Scissors or craft knife",
        "Water",
        "Bucket or bowl",
        "Blender or mixer",
        "PVA glue or wallpaper paste",
        "Paint",
        "Paintbrushes"
    ],
    "text": " Making a Folded Paper Dagger Use a square sheet of paper. It shouldn't be too stiff because it needs to fold easily. Also, if you are new to folding origami, you should start with a larger piece of paper. Begin with backside of the paper facing up. The pretty side of the paper should be facing the table. It doesn't matter if you're using a plain sheet of paper, though a two-sided sheet can make the folds easier to see. Also, begin with the paper making a square in front of you, not turned like a diamond. Fold the top half of the paper down. Match the top corners with the bottom corners, and then make a crease in the middle. Unfold the paper again. Fold the left half of the paper to the right half. Match up the left side corners with the right side corners. Make a crease down the center. Unfold again. At this point, the paper should be the same size you started with but with creases down the middle going horizontally and vertically. Turn the paper over. The pretty side should now be facing up. Fold the paper diagonally in half. Fold it down from the top left corner to the bottom right corner, matching up the sides. Create a diagonal crease. Unfold it. Fold the paper diagonally the opposite way. Fold the paper from the bottom left corner up to the upper right corner, creasing along the diagonal again. Unfold it. At this point, you should still have the original square but with vertical and horizontal folds on one side and diagonal folds on the other. Turn the paper. Turn the paper 45 degrees so that one of the points is facing up. You should have a diamond facing you now. Fold in the two side corners. Fold in each side of the diamond until the outside corner is touching the center of the diamond. Crease them, and keep them folded. You now have a small square in the center with a triangle on the top and bottom. Flip the paper over. The backside should be facing up now. Fold in each side to the center. Make a vertical crease that pulls each side into to the center line. You're making the whole shape skinnier. The points of the side triangles should flip around as you fold in the sides. Fold in the points to the center. The points that flipped around with the fold should be sticking out. Fold them into the center point, creasing along the side. You should now have four diamonds surrounded by triangles pointing inward. Fold the second to last diamond in half horizontally. Tuck the bottom under the top rather than the other way around, called a mountain fold. Create a valley fold going the other way. Pull out the bottom half, and halfway between the crease you made in the last step and the bottom of the same diamond, fold the paper the other way. You are creating what's called a valley fold. You are essentially making a small tuck in the paper. Create the handle. For the handle, you make a squash fold. You'll make valley folds from where you tucked the paper down to the bottom of the paper. Next, make small mountain folds that run diagonal from the side tips of the small diamonds at the tuck to the outer edges; these should only be as long as the bottom tip of the small diamond created by the tuck. You'll also be unfolding part of the tuck. Pull in the sides of the handle along the valley folds, using the mountain folds as a guide to flatten out part of the tuck. Flatten the creases. You should have a passable handle now., Create a squared-off bottom edge. Fold up the small triangle at the bottom of the handle to create a straight edge. Make another tuck. Above the handle, you should see a small diamond. Create a mountain fold at the top of the diamond horizontally and a valley fold horizontally at the middle. You are making another layer above the handle through folding, so the bottom of the fold should line up with the top of the handle. Crease the fold. Use another squash fold to create the blade. Fold vertical valley folds along the blade that line up with the handle. Create small diagonal mountain folds at the bottom corners of the blade that fold down the corners. Folding in the valley folds to meet in the middle, flatten out the triangles at the bottom as part of the crossguard of the dagger. Turn it over. The dagger is done. Making a Glued Paper Dagger Draw a dagger on a piece of thick paper or cardstock. Use a ruler and pictures of daggers to help you. Make it one continuous piece, and don't make it too thin, as the cut-out pieces will be difficult to line up. Cut out the dagger. Use scissors or a craft knife to cut out the dagger you created. Trace the design. Use the dagger as a template, tracing it onto other sheets of paper. You'll need at least ten sheets, though you may want more for a sturdier design. To make this process simpler, you can simply print out the same design of a dagger over and over. You can use whatever kind of paper you want for this project, though medium weight is probably best. You can even make a dagger out of book pages. Cut out the dagger. Cut out each dagger with scissors or a craft knife. Glue the daggers together. Align each dagger, and use paper glue to glue them together. Make sure to smooth out each layer so you don't get wrinkles. Add as many layers as you want until you get your desired thickness and sturdiness. Trim the dagger. Trim up any edges that are sticking out from the dagger. Press the dagger. Place the dagger between two parchment paper sheets, and put it under something heavy. Leave it to dry overnight. Add details. For instance, you could add layers to the crossguard to make it more pronounced or shapes to the handle to make jewels. Paint the dagger. Paint the dagger so it looks real. You can add scroll work to the handles and paint the jewels in various colors. Making a Papier-Mâché Pulp Dagger Tear paper into pieces. You can use construction paper or scrap paper, such as newspaper, for this process. Fill a bowl or bucket up partway with the paper scraps. Add water to the top. Leave them overnight to absorb water. For a quicker method, pour boiling water over the paper scraps. Leave it alone until the water cools down. Use a blender or electric mixer on the paper. Blend the paper until it is liquid. Remove excess water. Use your hands to squeeze out the water from the pulp. You can also use a stocking and a colander to drain out water. Just leave it over the sink for 30 minutes or so to drain the water. Add paste. Use PVA glue or wallpaper paste for the mixture. Add enough to make it feel like clay. If you want to save the papier-mâché pulp for later projects, don't add glue. Roll it into balls, and let them dry. Reconstitute them with water, and add the glue in at that time. Some recipes don't call for glue, but it will be more durable with glue. Shape the pulp. Shape the pulp into a dagger on parchment paper. You can use a mold for this part if you have one. Leave the dagger to dry. It can take a couple of days if it is thick. Paint the dagger. If desired, add details to the finished dagger with paint.",
    "sentences": [
        " Making a Folded Paper Dagger Use a square sheet of paper.",
        "It shouldn't be too stiff because it needs to fold easily.",
        "Also, if you are new to folding origami, you should start with a larger piece of paper.",
        "Begin with backside of the paper facing up.",
        "The pretty side of the paper should be facing the table.",
        "It doesn't matter if you're using a plain sheet of paper, though a two-sided sheet can make the folds easier to see.",
        "Also, begin with the paper making a square in front of you, not turned like a diamond.",
        "Fold the top half of the paper down.",
        "Match the top corners with the bottom corners, and then make a crease in the middle.",
        "Unfold the paper again.",
        "Fold the left half of the paper to the right half.",
        "Match up the left side corners with the right side corners.",
        "Make a crease down the center.",
        "Unfold again.",
        "At this point, the paper should be the same size you started with but with creases down the middle going horizontally and vertically.",
        "Turn the paper over.",
        "The pretty side should now be facing up.",
        "Fold the paper diagonally in half.",
        "Fold it down from the top left corner to the bottom right corner, matching up the sides.",
        "Create a diagonal crease.",
        "Unfold it.",
        "Fold the paper diagonally the opposite way.",
        "Fold the paper from the bottom left corner up to the upper right corner, creasing along the diagonal again.",
        "Unfold it.",
        "At this point, you should still have the original square but with vertical and horizontal folds on one side and diagonal folds on the other.",
        "Turn the paper.",
        "Turn the paper 45 degrees so that one of the points is facing up.",
        "You should have a diamond facing you now.",
        "Fold in the two side corners.",
        "Fold in each side of the diamond until the outside corner is touching the center of the diamond.",
        "Crease them, and keep them folded.",
        "You now have a small square in the center with a triangle on the top and bottom.",
        "Flip the paper over.",
        "The backside should be facing up now.",
        "Fold in each side to the center.",
        "Make a vertical crease that pulls each side into to the center line.",
        "You're making the whole shape skinnier.",
        "The points of the side triangles should flip around as you fold in the sides.",
        "Fold in the points to the center.",
        "The points that flipped around with the fold should be sticking out.",
        "Fold them into the center point, creasing along the side.",
        "You should now have four diamonds surrounded by triangles pointing inward.",
        "Fold the second to last diamond in half horizontally.",
        "Tuck the bottom under the top rather than the other way around, called a mountain fold.",
        "Create a valley fold going the other way.",
        "Pull out the bottom half, and halfway between the crease you made in the last step and the bottom of the same diamond, fold the paper the other way.",
        "You are creating what's called a valley fold.",
        "You are essentially making a small tuck in the paper.",
        "Create the handle.",
        "For the handle, you make a squash fold.",
        "You'll make valley folds from where you tucked the paper down to the bottom of the paper.",
        "Next, make small mountain folds that run diagonal from the side tips of the small diamonds at the tuck to the outer edges; these should only be as long as the bottom tip of the small diamond created by the tuck.",
        "You'll also be unfolding part of the tuck.",
        "Pull in the sides of the handle along the valley folds, using the mountain folds as a guide to flatten out part of the tuck.",
        "Flatten the creases.",
        "You should have a passable handle now., Create a squared-off bottom edge.",
        "Fold up the small triangle at the bottom of the handle to create a straight edge.",
        "Make another tuck.",
        "Above the handle, you should see a small diamond.",
        "Create a mountain fold at the top of the diamond horizontally and a valley fold horizontally at the middle.",
        "You are making another layer above the handle through folding, so the bottom of the fold should line up with the top of the handle.",
        "Crease the fold.",
        "Use another squash fold to create the blade.",
        "Fold vertical valley folds along the blade that line up with the handle.",
        "Create small diagonal mountain folds at the bottom corners of the blade that fold down the corners.",
        "Folding in the valley folds to meet in the middle, flatten out the triangles at the bottom as part of the crossguard of the dagger.",
        "Turn it over.",
        "The dagger is done.",
        "Making a Glued Paper Dagger Draw a dagger on a piece of thick paper or cardstock.",
        "Use a ruler and pictures of daggers to help you.",
        "Make it one continuous piece, and don't make it too thin, as the cut-out pieces will be difficult to line up.",
        "Cut out the dagger.",
        "Use scissors or a craft knife to cut out the dagger you created.",
        "Trace the design.",
        "Use the dagger as a template, tracing it onto other sheets of paper.",
        "You'll need at least ten sheets, though you may want more for a sturdier design.",
        "To make this process simpler, you can simply print out the same design of a dagger over and over.",
        "You can use whatever kind of paper you want for this project, though medium weight is probably best.",
        "You can even make a dagger out of book pages.",
        "Cut out the dagger.",
        "Cut out each dagger with scissors or a craft knife.",
        "Glue the daggers together.",
        "Align each dagger, and use paper glue to glue them together.",
        "Make sure to smooth out each layer so you don't get wrinkles.",
        "Add as many layers as you want until you get your desired thickness and sturdiness.",
        "Trim the dagger.",
        "Trim up any edges that are sticking out from the dagger.",
        "Press the dagger.",
        "Place the dagger between two parchment paper sheets, and put it under something heavy.",
        "Leave it to dry overnight.",
        "Add details.",
        "For instance, you could add layers to the crossguard to make it more pronounced or shapes to the handle to make jewels.",
        "Paint the dagger.",
        "Paint the dagger so it looks real.",
        "You can add scroll work to the handles and paint the jewels in various colors.",
        "Making a Papier-Mâché Pulp Dagger Tear paper into pieces.",
        "You can use construction paper or scrap paper, such as newspaper, for this process.",
        "Fill a bowl or bucket up partway with the paper scraps.",
        "Add water to the top.",
        "Leave them overnight to absorb water.",
        "For a quicker method, pour boiling water over the paper scraps.",
        "Leave it alone until the water cools down.",
        "Use a blender or electric mixer on the paper.",
        "Blend the paper until it is liquid.",
        "Remove excess water.",
        "Use your hands to squeeze out the water from the pulp.",
        "You can also use a stocking and a colander to drain out water.",
        "Just leave it over the sink for 30 minutes or so to drain the water.",
        "Add paste.",
        "Use PVA glue or wallpaper paste for the mixture.",
        "Add enough to make it feel like clay.",
        "If you want to save the papier-mâché pulp for later projects, don't add glue.",
        "Roll it into balls, and let them dry.",
        "Reconstitute them with water, and add the glue in at that time.",
        "Some recipes don't call for glue, but it will be more durable with glue.",
        "Shape the pulp.",
        "Shape the pulp into a dagger on parchment paper.",
        "You can use a mold for this part if you have one.",
        "Leave the dagger to dry.",
        "It can take a couple of days if it is thick.",
        "Paint the dagger.",
        "If desired, add details to the finished dagger with paint."
    ]
}