{
    "title": "How to Preserve Cake",
    "url": "https://www.wikihow.com/Preserve-Cake",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Selection and Storage"
    ],
    "methods": [
        {
            "name": "Freezing a Frosted Cake",
            "steps": [
                {
                    "headline": "Put a frosted cake in the freezer for 15 minutes to harden the frosting.",
                    "description": "Check first to make sure that’s nothing on the freezer shelf that could damage your cake’s structure. So you don’t forget about the uncovered cake, set a reminder on your phone or microwave to take it out of the freezer. As a general rule of thumb, this process works best with whole, uncut cakes. Don’t keep uncovered cakes in the freezer for an extended period of time."
                },
                {
                    "headline": "See if the cake’s icing is stiff or not.",
                    "description": "Touch the frosting with your fingertip to check its texture. If the icing doesn’t smear or spread on your finger, then it’s safe to cover the cake with plastic wrap. In the event that the icing feels soft, let it stay in the freezer for a few extra minutes. Ideally, the icing should be hardened on the outside."
                },
                {
                    "headline": "Cover the cake securely with plastic wrap.",
                    "description": "Take several long sheets of cling wrap and surround the cake completely. Before putting the cake back in the freezer, check that the plastic wrap is as tight as possible. The goal of the wrap is to keep any moisture from getting into the cake. If there’s any gaps or air holes within the plastic wrap, it could negatively affect your cake’s freshness. If the cake isn’t wrapped tightly, then other foul odors can potentially absorb into the cake."
                },
                {
                    "headline": "Place the cake in the freezer for at least 4 months.",
                    "description": "Find a space in your freezer that comfortably fits your cake. As you did before, check that there are no items nearby that could squash or indent your cake while it’s in storage. While your cake is frozen, try to limit how many times you open the freezer door, as this risks exposing the cake to more moisture. The cake can stay there for 4-6 months."
                },
                {
                    "headline": "Defrost the cake when you’re ready to eat it.",
                    "description": "Place it on a flat surface at room temperature for 3-4 hours before serving it. You can also put your frozen cake in the refrigerator a day or 2 before you plan on eating it. Regardless, don’t unwrap the cake until it has defrosted completely."
                }
            ]
        },
        {
            "name": "Protecting Unfrosted Cakes in the Fridge or Freezer",
            "steps": [
                {
                    "headline": "Let the cake cool once it comes out of the oven.",
                    "description": "While the cake is still in the pan, place it on a metal rack for at least 10 minutes. Before removing the cake from the pan, spritz some cooking spray along the surface of the rack. Use a long knife to separate the cake from the edges of the pan before flipping it onto the rack. Touch the cake to make sure that it’s completely cool before you wrap it up."
                },
                {
                    "headline": "Cover all sides of the cake in plastic wrap to lock in the flavor.",
                    "description": "Set your undecorated and unfrosted cake (or cakes) on a flat surface, such as a countertop. Take several long pieces of cling wrap and completely cover each item. Thoroughly check the plastic wrap to make sure there are no gaps or areas where air and moisture could get in. If you plan on keeping them at room temperature, place the cake layers in a sealable plastic bag to provide an extra layer of protection."
                },
                {
                    "headline": "Place the cake in the refrigerator to preserve it for a few more days.",
                    "description": "Take your wrapped or bagged cakes and place them in an empty part of the refrigerator. If you’re preparing for a special occasion like a birthday or anniversary, the fridge allows you to preserve the freshness of your cake before decorating it. Most cakes can stay in the refrigerator for up to a week."
                },
                {
                    "headline": "Wrap the cake in foil to provide extra protection.",
                    "description": "Tightly cover the cake with several sheets of aluminum foil, ensuring that there are no gaps in the foil as you go. If you want your cake to be extra protected, wrap it in both plastic wrap and aluminum foil."
                },
                {
                    "headline": "Freeze the cake if you want to save it for a few months.",
                    "description": "Use making task and a permanent marker to mark when the cake was made. If you’d prefer to have the cake baked months in advance, place the foil-wrapped, unfrosted cake (or cakes) onto a freezer shelf. Before you place it in, double check that nothing is leaning on or crushing your cake. Keep it in the freezer for up to 6 months."
                }
            ]
        },
        {
            "name": "Saving a Wedding Cake",
            "steps": [
                {
                    "headline": "Remove the top tier of the wedding cake after the cake-cutting ceremony.",
                    "description": "Store it in a cool environment throughout the wedding event, like a dining room that’s 68 °F (20 °C). Most importantly, don’t leave the cake in an especially hot area, like in direct sunlight or in a hot car. While these desserts are difficult to preserve due to their size, many couples opt to save some of the cake for a later event, like their first anniversary."
                },
                {
                    "headline": "Place the cake in the freezer for about 15 minutes to stiffen the icing.",
                    "description": "Prevent damaging the frosting work on your cake by placing in the freezer first. Before taking it out again, set a timer for 15 minutes after laying your cake uncovered in the freezer. At this point, gently tap on the frosting to make sure that it’s stiff. Whenever you put the cake in the freezer, make sure that there are no nearby items that could fall on and otherwise damage the dessert."
                },
                {
                    "headline": "Remove any sugar flowers before wrapping the cake.",
                    "description": "Use a flat knife to scrape off any sugar flowers or other cake decorations. Put these aside in a bag or on a plate. If these decorations are made out of bakery frosting or sugar paste, they won’t go bad if left in refrigerated. If the frosting is made with perishable ingredients, like mascarpone or whipped cream, then it needs to be refrigerated."
                },
                {
                    "headline": "Cover the wedding cake completely with plastic wrap and freeze it.",
                    "description": "Cut off several pieces of plastic wrap and securely wrap them around the top tier of the wedding cake. Use at least 3-4 layers of cling wrap, especially if you plan on saving the cake for your first anniversary. Once the cake is airtight, place it in the freezer for up to a year. Avoid wrapping the cake in only foil, as this can lead to freezer burn."
                },
                {
                    "headline": "Slide the wrapped cake into a plastic bag for extra security.",
                    "description": "Keep your wedding cake in a resealable, freezer-safe bag for long-term, year-long storage. For more convenient storage, place the wrapped cake tier in its original cake box. Before freezing this box, cover it with at least 2 layers of plastic wrap. Move the cake to the refrigerator 1-2 days before you plan on eating it."
                }
            ]
        }
    ],
    "tyn": [
        "Plastic wrap",
        "Aluminum foil",
        "Freezer-safe plastic bag",
        "Cake box (optional)"
    ],
    "text": " Freezing a Frosted Cake Put a frosted cake in the freezer for 15 minutes to harden the frosting. Check first to make sure that’s nothing on the freezer shelf that could damage your cake’s structure. So you don’t forget about the uncovered cake, set a reminder on your phone or microwave to take it out of the freezer. As a general rule of thumb, this process works best with whole, uncut cakes. Don’t keep uncovered cakes in the freezer for an extended period of time. See if the cake’s icing is stiff or not. Touch the frosting with your fingertip to check its texture. If the icing doesn’t smear or spread on your finger, then it’s safe to cover the cake with plastic wrap. In the event that the icing feels soft, let it stay in the freezer for a few extra minutes. Ideally, the icing should be hardened on the outside. Cover the cake securely with plastic wrap. Take several long sheets of cling wrap and surround the cake completely. Before putting the cake back in the freezer, check that the plastic wrap is as tight as possible. The goal of the wrap is to keep any moisture from getting into the cake. If there’s any gaps or air holes within the plastic wrap, it could negatively affect your cake’s freshness. If the cake isn’t wrapped tightly, then other foul odors can potentially absorb into the cake. Place the cake in the freezer for at least 4 months. Find a space in your freezer that comfortably fits your cake. As you did before, check that there are no items nearby that could squash or indent your cake while it’s in storage. While your cake is frozen, try to limit how many times you open the freezer door, as this risks exposing the cake to more moisture. The cake can stay there for 4-6 months. Defrost the cake when you’re ready to eat it. Place it on a flat surface at room temperature for 3-4 hours before serving it. You can also put your frozen cake in the refrigerator a day or 2 before you plan on eating it. Regardless, don’t unwrap the cake until it has defrosted completely. Protecting Unfrosted Cakes in the Fridge or Freezer Let the cake cool once it comes out of the oven. While the cake is still in the pan, place it on a metal rack for at least 10 minutes. Before removing the cake from the pan, spritz some cooking spray along the surface of the rack. Use a long knife to separate the cake from the edges of the pan before flipping it onto the rack. Touch the cake to make sure that it’s completely cool before you wrap it up. Cover all sides of the cake in plastic wrap to lock in the flavor. Set your undecorated and unfrosted cake (or cakes) on a flat surface, such as a countertop. Take several long pieces of cling wrap and completely cover each item. Thoroughly check the plastic wrap to make sure there are no gaps or areas where air and moisture could get in. If you plan on keeping them at room temperature, place the cake layers in a sealable plastic bag to provide an extra layer of protection. Place the cake in the refrigerator to preserve it for a few more days. Take your wrapped or bagged cakes and place them in an empty part of the refrigerator. If you’re preparing for a special occasion like a birthday or anniversary, the fridge allows you to preserve the freshness of your cake before decorating it. Most cakes can stay in the refrigerator for up to a week. Wrap the cake in foil to provide extra protection. Tightly cover the cake with several sheets of aluminum foil, ensuring that there are no gaps in the foil as you go. If you want your cake to be extra protected, wrap it in both plastic wrap and aluminum foil. Freeze the cake if you want to save it for a few months. Use making task and a permanent marker to mark when the cake was made. If you’d prefer to have the cake baked months in advance, place the foil-wrapped, unfrosted cake (or cakes) onto a freezer shelf. Before you place it in, double check that nothing is leaning on or crushing your cake. Keep it in the freezer for up to 6 months. Saving a Wedding Cake Remove the top tier of the wedding cake after the cake-cutting ceremony. Store it in a cool environment throughout the wedding event, like a dining room that’s 68 °F (20 °C). Most importantly, don’t leave the cake in an especially hot area, like in direct sunlight or in a hot car. While these desserts are difficult to preserve due to their size, many couples opt to save some of the cake for a later event, like their first anniversary. Place the cake in the freezer for about 15 minutes to stiffen the icing. Prevent damaging the frosting work on your cake by placing in the freezer first. Before taking it out again, set a timer for 15 minutes after laying your cake uncovered in the freezer. At this point, gently tap on the frosting to make sure that it’s stiff. Whenever you put the cake in the freezer, make sure that there are no nearby items that could fall on and otherwise damage the dessert. Remove any sugar flowers before wrapping the cake. Use a flat knife to scrape off any sugar flowers or other cake decorations. Put these aside in a bag or on a plate. If these decorations are made out of bakery frosting or sugar paste, they won’t go bad if left in refrigerated. If the frosting is made with perishable ingredients, like mascarpone or whipped cream, then it needs to be refrigerated. Cover the wedding cake completely with plastic wrap and freeze it. Cut off several pieces of plastic wrap and securely wrap them around the top tier of the wedding cake. Use at least 3-4 layers of cling wrap, especially if you plan on saving the cake for your first anniversary. Once the cake is airtight, place it in the freezer for up to a year. Avoid wrapping the cake in only foil, as this can lead to freezer burn. Slide the wrapped cake into a plastic bag for extra security. Keep your wedding cake in a resealable, freezer-safe bag for long-term, year-long storage. For more convenient storage, place the wrapped cake tier in its original cake box. Before freezing this box, cover it with at least 2 layers of plastic wrap. Move the cake to the refrigerator 1-2 days before you plan on eating it.",
    "sentences": [
        " Freezing a Frosted Cake Put a frosted cake in the freezer for 15 minutes to harden the frosting.",
        "Check first to make sure that’s nothing on the freezer shelf that could damage your cake’s structure.",
        "So you don’t forget about the uncovered cake, set a reminder on your phone or microwave to take it out of the freezer.",
        "As a general rule of thumb, this process works best with whole, uncut cakes.",
        "Don’t keep uncovered cakes in the freezer for an extended period of time.",
        "See if the cake’s icing is stiff or not.",
        "Touch the frosting with your fingertip to check its texture.",
        "If the icing doesn’t smear or spread on your finger, then it’s safe to cover the cake with plastic wrap.",
        "In the event that the icing feels soft, let it stay in the freezer for a few extra minutes.",
        "Ideally, the icing should be hardened on the outside.",
        "Cover the cake securely with plastic wrap.",
        "Take several long sheets of cling wrap and surround the cake completely.",
        "Before putting the cake back in the freezer, check that the plastic wrap is as tight as possible.",
        "The goal of the wrap is to keep any moisture from getting into the cake.",
        "If there’s any gaps or air holes within the plastic wrap, it could negatively affect your cake’s freshness.",
        "If the cake isn’t wrapped tightly, then other foul odors can potentially absorb into the cake.",
        "Place the cake in the freezer for at least 4 months.",
        "Find a space in your freezer that comfortably fits your cake.",
        "As you did before, check that there are no items nearby that could squash or indent your cake while it’s in storage.",
        "While your cake is frozen, try to limit how many times you open the freezer door, as this risks exposing the cake to more moisture.",
        "The cake can stay there for 4-6 months.",
        "Defrost the cake when you’re ready to eat it.",
        "Place it on a flat surface at room temperature for 3-4 hours before serving it.",
        "You can also put your frozen cake in the refrigerator a day or 2 before you plan on eating it.",
        "Regardless, don’t unwrap the cake until it has defrosted completely.",
        "Protecting Unfrosted Cakes in the Fridge or Freezer Let the cake cool once it comes out of the oven.",
        "While the cake is still in the pan, place it on a metal rack for at least 10 minutes.",
        "Before removing the cake from the pan, spritz some cooking spray along the surface of the rack.",
        "Use a long knife to separate the cake from the edges of the pan before flipping it onto the rack.",
        "Touch the cake to make sure that it’s completely cool before you wrap it up.",
        "Cover all sides of the cake in plastic wrap to lock in the flavor.",
        "Set your undecorated and unfrosted cake (or cakes) on a flat surface, such as a countertop.",
        "Take several long pieces of cling wrap and completely cover each item.",
        "Thoroughly check the plastic wrap to make sure there are no gaps or areas where air and moisture could get in.",
        "If you plan on keeping them at room temperature, place the cake layers in a sealable plastic bag to provide an extra layer of protection.",
        "Place the cake in the refrigerator to preserve it for a few more days.",
        "Take your wrapped or bagged cakes and place them in an empty part of the refrigerator.",
        "If you’re preparing for a special occasion like a birthday or anniversary, the fridge allows you to preserve the freshness of your cake before decorating it.",
        "Most cakes can stay in the refrigerator for up to a week.",
        "Wrap the cake in foil to provide extra protection.",
        "Tightly cover the cake with several sheets of aluminum foil, ensuring that there are no gaps in the foil as you go.",
        "If you want your cake to be extra protected, wrap it in both plastic wrap and aluminum foil.",
        "Freeze the cake if you want to save it for a few months.",
        "Use making task and a permanent marker to mark when the cake was made.",
        "If you’d prefer to have the cake baked months in advance, place the foil-wrapped, unfrosted cake (or cakes) onto a freezer shelf.",
        "Before you place it in, double check that nothing is leaning on or crushing your cake.",
        "Keep it in the freezer for up to 6 months.",
        "Saving a Wedding Cake Remove the top tier of the wedding cake after the cake-cutting ceremony.",
        "Store it in a cool environment throughout the wedding event, like a dining room that’s 68 °F (20 °C).",
        "Most importantly, don’t leave the cake in an especially hot area, like in direct sunlight or in a hot car.",
        "While these desserts are difficult to preserve due to their size, many couples opt to save some of the cake for a later event, like their first anniversary.",
        "Place the cake in the freezer for about 15 minutes to stiffen the icing.",
        "Prevent damaging the frosting work on your cake by placing in the freezer first.",
        "Before taking it out again, set a timer for 15 minutes after laying your cake uncovered in the freezer.",
        "At this point, gently tap on the frosting to make sure that it’s stiff.",
        "Whenever you put the cake in the freezer, make sure that there are no nearby items that could fall on and otherwise damage the dessert.",
        "Remove any sugar flowers before wrapping the cake.",
        "Use a flat knife to scrape off any sugar flowers or other cake decorations.",
        "Put these aside in a bag or on a plate.",
        "If these decorations are made out of bakery frosting or sugar paste, they won’t go bad if left in refrigerated.",
        "If the frosting is made with perishable ingredients, like mascarpone or whipped cream, then it needs to be refrigerated.",
        "Cover the wedding cake completely with plastic wrap and freeze it.",
        "Cut off several pieces of plastic wrap and securely wrap them around the top tier of the wedding cake.",
        "Use at least 3-4 layers of cling wrap, especially if you plan on saving the cake for your first anniversary.",
        "Once the cake is airtight, place it in the freezer for up to a year.",
        "Avoid wrapping the cake in only foil, as this can lead to freezer burn.",
        "Slide the wrapped cake into a plastic bag for extra security.",
        "Keep your wedding cake in a resealable, freezer-safe bag for long-term, year-long storage.",
        "For more convenient storage, place the wrapped cake tier in its original cake box.",
        "Before freezing this box, cover it with at least 2 layers of plastic wrap.",
        "Move the cake to the refrigerator 1-2 days before you plan on eating it."
    ]
}