{
    "title": "How to Use Floral Foam",
    "url": "https://www.wikihow.com/Use-Floral-Foam",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Selecting and Cutting the Foam",
            "steps": [
                {
                    "headline": "Choose wet floral foam if you’re creating an arrangement with live flowers.",
                    "description": "Wet foam soaks up as much as 10 times its weight in water. This makes it great for arranging live flowers, as the flowers will have access to water while being held in place. Choose wet foam in a medium density to care for most flowers. Know that wet foam stretches out easily, so you’ll need to be precise when inserting each flower. Choose foam in a lighter density for flowers like tulips and spring bulb flowers, while plants with sturdy stems like tropicals need foam of a higher density. By watering the foam daily, your flowers should last just as long as they would in a normal vase full of water (the specific amount of time will differ depending on the type of plant)."
                },
                {
                    "headline": "Use dry floral foam for artificial flowers or other crafts.",
                    "description": "Dry foam is perfect for arranging fake flowers with artificial stems, including thin metal or plastic ones. Dry foam isn’t soaked in water, and it’s grittier and heavier than wet foam. While dry floral foam is primarily used to make flower arrangements or wreaths, it can also be used for other craft projects."
                },
                {
                    "headline": "Choose and measure a container for your flowers.",
                    "description": "Solid-colored containers will hide foam easily, but the foam will be visible and can be covered up if you choose a clear container such as glass. Measure the container to see how big your piece of foam will be, either using a ruler or by simply placing the piece of foam near the container and approximating the measurements. Your piece of foam doesn't need to fill up the entire container perfectly."
                },
                {
                    "headline": "Cut the foam block to fit in the container.",
                    "description": "Set the piece of foam on a cutting board or durable kitchen counter. Use a sharp kitchen knife to slice through the foam, cutting it easily just like butter, so it's the right size. Foam usually comes in the shape of a block, making it easy to trim it down to fit in a vase or bowl. Dry foam can also be purchased in different shapes already pre-cut."
                }
            ]
        },
        {
            "name": "Soaking Wet Foam for Fresh Flowers",
            "steps": [
                {
                    "headline": "Fill a bowl or bucket with water.",
                    "description": "Choose a bowl or bucket that’s slightly wider and deeper than the piece of foam you’re planning to soak. Place it on a sturdy surface and fill it almost to the top with clean water. You can add plant food to the water if desired to help your plants grow. Rinse out whatever you're using to hold the water so it's clean before putting the water and foam in it. You can also use your sink basin."
                },
                {
                    "headline": "Set the foam in the water without pushing it down.",
                    "description": "Place the foam right on top of the water. Instead of pushing the foam into the water, let it soak up the water naturally in its own time. It’s important to avoid submerging the foam with your hands so that it will absorb the maximum amount of water and not get any air bubbles in the middle."
                },
                {
                    "headline": "Wait for the foam to sink fully into the water.",
                    "description": "You’ll know the foam is completely done soaking up water when it’s submerged and air bubbles have stopped popping up onto the surface. This will take several minutes, so be patient. The foam will be a slightly darker shade of green once it’s completely soaked with water."
                },
                {
                    "headline": "Lift the foam out of the water and set it on a towel.",
                    "description": "The piece of foam will be heavier since it soaked up so much water, and it will likely be dripping. If you're starting the arrangement right away, you can place the wet piece of foam directly into the vase or bowl once you pick it up out of the water. Avoid squeezing any water out of the foam as you lift it out of the bucket or basin."
                }
            ]
        },
        {
            "name": "Arranging the Flowers or Other Objects",
            "steps": [
                {
                    "headline": "Place the foam in a vase or bowl.",
                    "description": "If you’re putting the foam in a clear container, dry foam can be placed directly into the container while wet foam needs to be put into a plastic bag or some sort of plastic liner first so the water is contained. Once the foam is placed in the middle of the clear container, fill in the visible sides using things like stones, coffee beans, or other small objects. Putting small objects around the sides of the clear container helps hide the foam from view. It’s okay if the foam is slightly taller than the container because the flowers will cover it up. Wet foam doesn't need to be placed in a plastic liner if the vase or bowl obscures the foam from view."
                },
                {
                    "headline": "Cut the flowers’ stems at an angle before inserting them.",
                    "description": "This is especially important if you’re using live flowers in wet foam. Your flowers can be any length that you choose, but it's best to keep at least 6 in (15 cm) of stem. Use sharp, clean scissors to cut the stem, making it easier to insert them into the foam smoothly. Using clean scissors on live flowers will help prevent the spread of disease when cutting them. You may need to use wire cutters to trim artificial flowers."
                },
                {
                    "headline": "Remove any lower leaves from the flowers.",
                    "description": "This helps ensure the leaves aren’t in the way when you stick the stem into the foam. Pick leaves off of the bottom of the stem using your fingers if the plant is alive, or use scissors to cut the bottom leaves off of fake flowers. Visualize how deep into the foam you plan on inserting each stem so you know whether or not to remove the leaves."
                },
                {
                    "headline": "Figure out what you want your design to look like.",
                    "description": "Decide which flowers will be the focal points and which ones will be used to fill in the arrangement. Have a rough idea of where you'll place each one before you start inserting them into the foam for the best final product. For example, your main focal point flowers might be carnations while you use lilacs and other greens to fill in the rest of the arrangement. Dry foam is more forgiving than wet foam, but it’s still a good idea to plan ahead either way. Because the holes made from inserting the stems can’t be fixed, wet foam can only be used once for an arrangement."
                },
                {
                    "headline": "Insert each stem strategically starting with the focal point blooms.",
                    "description": "Once you push a stem into wet foam, the hole won’t go away. Be precise about where you place each flower, inserting the focal point blooms first. Space them out evenly so the focal point flowers can be seen from every angle. The flowers are most stable when their stems are placed roughly 3 in (7.6 cm) into the foam. If the stem is soft, guide it in carefully using your fingers to make sure it doesn’t bend. If you need to pull the stem out to make an adjustment, you’ll need to reinsert the stem in a different spot. Avoid pulling stems up to make live flowers taller once they’re inserted. This creates air pockets, which can cause the flower to die."
                },
                {
                    "headline": "Rotate the arrangement as you work to ensure balance.",
                    "description": "This helps you see the arrangement from every angle as you place the flowers. Move the vase or other container in a circle as you place each type of flower or foliage, making sure each variety can be seen from every side."
                },
                {
                    "headline": "Fill in bare spots with smaller flowers and foliage.",
                    "description": "The goal is to hide the foam from sight using the flowers and other greenery in the arrangement. Once you believe you're finished, take a closer look and see if you can spot the foam. If you can, this is a bare spot that can be filled in with a spare flower or piece of greenery. It's important to stick the flowers far enough into the foam so that they aren't sticking up too tall, making the foam visible."
                }
            ]
        }
    ],
    "tyn": [
        "Floral foam",
        "Flowers and other greenery",
        "Kitchen knife",
        "Cutting board",
        "Vase or container",
        "Bucket or basin",
        "Towel",
        "Scissors",
        "Ruler (optional)"
    ],
    "text": " Selecting and Cutting the Foam Choose wet floral foam if you’re creating an arrangement with live flowers. Wet foam soaks up as much as 10 times its weight in water. This makes it great for arranging live flowers, as the flowers will have access to water while being held in place. Choose wet foam in a medium density to care for most flowers. Know that wet foam stretches out easily, so you’ll need to be precise when inserting each flower. Choose foam in a lighter density for flowers like tulips and spring bulb flowers, while plants with sturdy stems like tropicals need foam of a higher density. By watering the foam daily, your flowers should last just as long as they would in a normal vase full of water (the specific amount of time will differ depending on the type of plant). Use dry floral foam for artificial flowers or other crafts. Dry foam is perfect for arranging fake flowers with artificial stems, including thin metal or plastic ones. Dry foam isn’t soaked in water, and it’s grittier and heavier than wet foam. While dry floral foam is primarily used to make flower arrangements or wreaths, it can also be used for other craft projects. Choose and measure a container for your flowers. Solid-colored containers will hide foam easily, but the foam will be visible and can be covered up if you choose a clear container such as glass. Measure the container to see how big your piece of foam will be, either using a ruler or by simply placing the piece of foam near the container and approximating the measurements. Your piece of foam doesn't need to fill up the entire container perfectly. Cut the foam block to fit in the container. Set the piece of foam on a cutting board or durable kitchen counter. Use a sharp kitchen knife to slice through the foam, cutting it easily just like butter, so it's the right size. Foam usually comes in the shape of a block, making it easy to trim it down to fit in a vase or bowl. Dry foam can also be purchased in different shapes already pre-cut. Soaking Wet Foam for Fresh Flowers Fill a bowl or bucket with water. Choose a bowl or bucket that’s slightly wider and deeper than the piece of foam you’re planning to soak. Place it on a sturdy surface and fill it almost to the top with clean water. You can add plant food to the water if desired to help your plants grow. Rinse out whatever you're using to hold the water so it's clean before putting the water and foam in it. You can also use your sink basin. Set the foam in the water without pushing it down. Place the foam right on top of the water. Instead of pushing the foam into the water, let it soak up the water naturally in its own time. It’s important to avoid submerging the foam with your hands so that it will absorb the maximum amount of water and not get any air bubbles in the middle. Wait for the foam to sink fully into the water. You’ll know the foam is completely done soaking up water when it’s submerged and air bubbles have stopped popping up onto the surface. This will take several minutes, so be patient. The foam will be a slightly darker shade of green once it’s completely soaked with water. Lift the foam out of the water and set it on a towel. The piece of foam will be heavier since it soaked up so much water, and it will likely be dripping. If you're starting the arrangement right away, you can place the wet piece of foam directly into the vase or bowl once you pick it up out of the water. Avoid squeezing any water out of the foam as you lift it out of the bucket or basin. Arranging the Flowers or Other Objects Place the foam in a vase or bowl. If you’re putting the foam in a clear container, dry foam can be placed directly into the container while wet foam needs to be put into a plastic bag or some sort of plastic liner first so the water is contained. Once the foam is placed in the middle of the clear container, fill in the visible sides using things like stones, coffee beans, or other small objects. Putting small objects around the sides of the clear container helps hide the foam from view. It’s okay if the foam is slightly taller than the container because the flowers will cover it up. Wet foam doesn't need to be placed in a plastic liner if the vase or bowl obscures the foam from view. Cut the flowers’ stems at an angle before inserting them. This is especially important if you’re using live flowers in wet foam. Your flowers can be any length that you choose, but it's best to keep at least 6 in (15 cm) of stem. Use sharp, clean scissors to cut the stem, making it easier to insert them into the foam smoothly. Using clean scissors on live flowers will help prevent the spread of disease when cutting them. You may need to use wire cutters to trim artificial flowers. Remove any lower leaves from the flowers. This helps ensure the leaves aren’t in the way when you stick the stem into the foam. Pick leaves off of the bottom of the stem using your fingers if the plant is alive, or use scissors to cut the bottom leaves off of fake flowers. Visualize how deep into the foam you plan on inserting each stem so you know whether or not to remove the leaves. Figure out what you want your design to look like. Decide which flowers will be the focal points and which ones will be used to fill in the arrangement. Have a rough idea of where you'll place each one before you start inserting them into the foam for the best final product. For example, your main focal point flowers might be carnations while you use lilacs and other greens to fill in the rest of the arrangement. Dry foam is more forgiving than wet foam, but it’s still a good idea to plan ahead either way. Because the holes made from inserting the stems can’t be fixed, wet foam can only be used once for an arrangement. Insert each stem strategically starting with the focal point blooms. Once you push a stem into wet foam, the hole won’t go away. Be precise about where you place each flower, inserting the focal point blooms first. Space them out evenly so the focal point flowers can be seen from every angle. The flowers are most stable when their stems are placed roughly 3 in (7.6 cm) into the foam. If the stem is soft, guide it in carefully using your fingers to make sure it doesn’t bend. If you need to pull the stem out to make an adjustment, you’ll need to reinsert the stem in a different spot. Avoid pulling stems up to make live flowers taller once they’re inserted. This creates air pockets, which can cause the flower to die. Rotate the arrangement as you work to ensure balance. This helps you see the arrangement from every angle as you place the flowers. Move the vase or other container in a circle as you place each type of flower or foliage, making sure each variety can be seen from every side. Fill in bare spots with smaller flowers and foliage. The goal is to hide the foam from sight using the flowers and other greenery in the arrangement. Once you believe you're finished, take a closer look and see if you can spot the foam. If you can, this is a bare spot that can be filled in with a spare flower or piece of greenery. It's important to stick the flowers far enough into the foam so that they aren't sticking up too tall, making the foam visible.",
    "sentences": [
        " Selecting and Cutting the Foam Choose wet floral foam if you’re creating an arrangement with live flowers.",
        "Wet foam soaks up as much as 10 times its weight in water.",
        "This makes it great for arranging live flowers, as the flowers will have access to water while being held in place.",
        "Choose wet foam in a medium density to care for most flowers.",
        "Know that wet foam stretches out easily, so you’ll need to be precise when inserting each flower.",
        "Choose foam in a lighter density for flowers like tulips and spring bulb flowers, while plants with sturdy stems like tropicals need foam of a higher density.",
        "By watering the foam daily, your flowers should last just as long as they would in a normal vase full of water (the specific amount of time will differ depending on the type of plant).",
        "Use dry floral foam for artificial flowers or other crafts.",
        "Dry foam is perfect for arranging fake flowers with artificial stems, including thin metal or plastic ones.",
        "Dry foam isn’t soaked in water, and it’s grittier and heavier than wet foam.",
        "While dry floral foam is primarily used to make flower arrangements or wreaths, it can also be used for other craft projects.",
        "Choose and measure a container for your flowers.",
        "Solid-colored containers will hide foam easily, but the foam will be visible and can be covered up if you choose a clear container such as glass.",
        "Measure the container to see how big your piece of foam will be, either using a ruler or by simply placing the piece of foam near the container and approximating the measurements.",
        "Your piece of foam doesn't need to fill up the entire container perfectly.",
        "Cut the foam block to fit in the container.",
        "Set the piece of foam on a cutting board or durable kitchen counter.",
        "Use a sharp kitchen knife to slice through the foam, cutting it easily just like butter, so it's the right size.",
        "Foam usually comes in the shape of a block, making it easy to trim it down to fit in a vase or bowl.",
        "Dry foam can also be purchased in different shapes already pre-cut.",
        "Soaking Wet Foam for Fresh Flowers Fill a bowl or bucket with water.",
        "Choose a bowl or bucket that’s slightly wider and deeper than the piece of foam you’re planning to soak.",
        "Place it on a sturdy surface and fill it almost to the top with clean water.",
        "You can add plant food to the water if desired to help your plants grow.",
        "Rinse out whatever you're using to hold the water so it's clean before putting the water and foam in it.",
        "You can also use your sink basin.",
        "Set the foam in the water without pushing it down.",
        "Place the foam right on top of the water.",
        "Instead of pushing the foam into the water, let it soak up the water naturally in its own time.",
        "It’s important to avoid submerging the foam with your hands so that it will absorb the maximum amount of water and not get any air bubbles in the middle.",
        "Wait for the foam to sink fully into the water.",
        "You’ll know the foam is completely done soaking up water when it’s submerged and air bubbles have stopped popping up onto the surface.",
        "This will take several minutes, so be patient.",
        "The foam will be a slightly darker shade of green once it’s completely soaked with water.",
        "Lift the foam out of the water and set it on a towel.",
        "The piece of foam will be heavier since it soaked up so much water, and it will likely be dripping.",
        "If you're starting the arrangement right away, you can place the wet piece of foam directly into the vase or bowl once you pick it up out of the water.",
        "Avoid squeezing any water out of the foam as you lift it out of the bucket or basin.",
        "Arranging the Flowers or Other Objects Place the foam in a vase or bowl.",
        "If you’re putting the foam in a clear container, dry foam can be placed directly into the container while wet foam needs to be put into a plastic bag or some sort of plastic liner first so the water is contained.",
        "Once the foam is placed in the middle of the clear container, fill in the visible sides using things like stones, coffee beans, or other small objects.",
        "Putting small objects around the sides of the clear container helps hide the foam from view.",
        "It’s okay if the foam is slightly taller than the container because the flowers will cover it up.",
        "Wet foam doesn't need to be placed in a plastic liner if the vase or bowl obscures the foam from view.",
        "Cut the flowers’ stems at an angle before inserting them.",
        "This is especially important if you’re using live flowers in wet foam.",
        "Your flowers can be any length that you choose, but it's best to keep at least 6 in (15 cm) of stem.",
        "Use sharp, clean scissors to cut the stem, making it easier to insert them into the foam smoothly.",
        "Using clean scissors on live flowers will help prevent the spread of disease when cutting them.",
        "You may need to use wire cutters to trim artificial flowers.",
        "Remove any lower leaves from the flowers.",
        "This helps ensure the leaves aren’t in the way when you stick the stem into the foam.",
        "Pick leaves off of the bottom of the stem using your fingers if the plant is alive, or use scissors to cut the bottom leaves off of fake flowers.",
        "Visualize how deep into the foam you plan on inserting each stem so you know whether or not to remove the leaves.",
        "Figure out what you want your design to look like.",
        "Decide which flowers will be the focal points and which ones will be used to fill in the arrangement.",
        "Have a rough idea of where you'll place each one before you start inserting them into the foam for the best final product.",
        "For example, your main focal point flowers might be carnations while you use lilacs and other greens to fill in the rest of the arrangement.",
        "Dry foam is more forgiving than wet foam, but it’s still a good idea to plan ahead either way.",
        "Because the holes made from inserting the stems can’t be fixed, wet foam can only be used once for an arrangement.",
        "Insert each stem strategically starting with the focal point blooms.",
        "Once you push a stem into wet foam, the hole won’t go away.",
        "Be precise about where you place each flower, inserting the focal point blooms first.",
        "Space them out evenly so the focal point flowers can be seen from every angle.",
        "The flowers are most stable when their stems are placed roughly 3 in (7.6 cm) into the foam.",
        "If the stem is soft, guide it in carefully using your fingers to make sure it doesn’t bend.",
        "If you need to pull the stem out to make an adjustment, you’ll need to reinsert the stem in a different spot.",
        "Avoid pulling stems up to make live flowers taller once they’re inserted.",
        "This creates air pockets, which can cause the flower to die.",
        "Rotate the arrangement as you work to ensure balance.",
        "This helps you see the arrangement from every angle as you place the flowers.",
        "Move the vase or other container in a circle as you place each type of flower or foliage, making sure each variety can be seen from every side.",
        "Fill in bare spots with smaller flowers and foliage.",
        "The goal is to hide the foam from sight using the flowers and other greenery in the arrangement.",
        "Once you believe you're finished, take a closer look and see if you can spot the foam.",
        "If you can, this is a bare spot that can be filled in with a spare flower or piece of greenery.",
        "It's important to stick the flowers far enough into the foam so that they aren't sticking up too tall, making the foam visible."
    ]
}