{
    "title": "How to Prepare Oatmeal Cereal for a Baby",
    "url": "https://www.wikihow.com/Prepare-Oatmeal-Cereal-for-a-Baby",
    "category_hierarchy": [
        "Family Life",
        "Parenting",
        "Development Stages",
        "Babies and Infants"
    ],
    "methods": [
        {
            "name": "Making Homemade Oatmeal Cereal",
            "steps": [
                {
                    "headline": "Bring 1 cup (240 ml) of water to boil.",
                    "description": "Pour the water into a small saucepan and turn the burner to high. Heat the water until it begins to boil vigorously. Although you can use formula or breastmilk to thin the cereal later, avoid using it to cook the cereal."
                },
                {
                    "headline": "Put 1/4 cup (22 g) of oats in a food processor and grind them to a powder.",
                    "description": "While you wait for the water to boil, grind the oats. Put the lid on the food processor and use the pulse button to grind the oats until they're fine and powdery. If you don't have a food processor, grind the oats in a blender."
                },
                {
                    "headline": "Stir the ground oats into the boiling water.",
                    "description": "Keep stirring until the oats dissolve. Use your spoon to break up any lumps of ground oats that you see floating in the water. Take care not to splash any boiling water out of the pan as you stir."
                },
                {
                    "headline": "Turn the burner to medium and simmer the cereal for 10 minutes.",
                    "description": "Adjust the burner so the water bubbles gently and stir the cereal every few minutes as it cooks. This will prevent lumps from forming. If you prefer, use whisk instead of a spoon."
                },
                {
                    "headline": "Cool the oatmeal cereal to room temperature.",
                    "description": "Once the oats have absorbed most of the water, turn off the burner and let the cereal cool for 15 to 20 minutes or until it's at room temperature. Then, serve the cereal or store it to use later.Tip: Since the cereal thickens as it's stored, dilute it with breastmilk or formula before you serve it to your baby. If you don't serve the cereal right away, cover it and put it in the refrigerator for up to 1 week."
                },
                {
                    "headline": "Mix in 1 teaspoon (5 g) of pureed fruit or vegetable if you want to flavor the cereal.",
                    "description": "If your baby has already tried a pureed fruit or vegetable, stir a little of it into the cereal. This will add nutrition and flavor. The puree also thins the cereal a little. Try mixing in 1 of the following:Warning: Avoid sweetening the oatmeal cereal with honey if your baby is under 1 year old because of the risk of botulism. Applesauce\nMashed bananas\nPureed carrots\nPear sauce\nPureed sweet potatoes"
                },
                {
                    "headline": "Stir in 3 to 5 US tbsp (44 to 74 ml) of liquid if you want to thin the cereal.",
                    "description": "Most babies prefer runny foods when they're learning to eat, so scoop a little of the oatmeal cereal into a baby bowl and mix in 3 to 5 tablespoons (44 to 74 ml) of breastmilk or formula. Stir until the cereal is as thin as you like and offer your baby a spoonful. Avoid diluting the cereal with cow's milk until your baby is 1 year old."
                }
            ]
        },
        {
            "name": "Mixing Storebought Oatmeal Cereal",
            "steps": [
                {
                    "headline": "Put 1 tablespoon (2.5 g) of oatmeal cereal into a bowl.",
                    "description": "If this is your baby's first cereal feeding, measure the cereal into a small microwave-safe bowl. If you're feeding an older baby who's already eating food, double or triple the amount. Keep in mind that you'll have to discard the uneaten cereal since dipping your baby's spoon into it introduces bacteria."
                },
                {
                    "headline": "Pour in 4 tablespoons (59 ml) of breastmilk or formula.",
                    "description": "Use whichever liquid your baby is already used to so they'll enjoy the taste of the oatmeal cereal. If you don't have breastmilk or formula, substitute fresh, clean water. Avoid adding cow's milk to the cereal until your baby is at least 1 year old."
                },
                {
                    "headline": "Stir the oatmeal cereal until it's smooth and thin.",
                    "description": "Keep stirring until the oatmeal cereal dissolves in the liquid. If there are still lumps or pockets of dry cereal, stir in another 1 tablespoon (15 ml) of liquid. Younger babies enjoy thin, runny cereal while babies closer to 1 year old can eat thick oatmeal cereal."
                },
                {
                    "headline": "Feed the oatmeal cereal to your baby.",
                    "description": "Scoop a little of the cereal on a baby spoon and offer it to your baby. If your baby gags, thin the cereal with more liquid. If you think your baby isn't eating the cereal because it's cold, put it into a microwave-safe bowl and microwave it at 50% power for 15 seconds. Then, stir the cereal again and ensure that it's not too hot for your baby.Tip: If you made the cereal using breastmilk, avoid heating it in the microwave because the microwave destroys nutrients in the breastmilk. Instead, warm a bag of breastmilk in warm water before you stir it into the cereal. Always check the temperature of your baby's food before you feed them."
                },
                {
                    "headline": "Discard the uneaten cereal.",
                    "description": "Unfortunately, you can't save leftover baby cereal because harmful bacteria can grow in it. Throw away the cereal your baby didn't eat and mix together a fresh bowl of cereal when your baby is ready for their next solid meal. Babies between 4 and 6 months old usually eat between 1 to 2 tablespoons (2.5 to 5 g) of prepared oatmeal cereal a day. Infants between 6 and 12 months old generally eat between 2 and 4 tablespoons (5 to 10 g) of prepared oatmeal cereal a day."
                }
            ]
        }
    ],
    "tyn": [
        "Making Homemade Oatmeal Cereal",
        "Food processor or blender",
        "Measuring cups",
        "Small saucepan",
        "Spoon or whisk",
        "Mixing Storebought Oatmeal Cereal",
        "Microwave-safe bowl",
        "Measuring spoon",
        "Baby spoon"
    ],
    "text": " Making Homemade Oatmeal Cereal Bring 1 cup (240 ml) of water to boil. Pour the water into a small saucepan and turn the burner to high. Heat the water until it begins to boil vigorously. Although you can use formula or breastmilk to thin the cereal later, avoid using it to cook the cereal. Put 1/4 cup (22 g) of oats in a food processor and grind them to a powder. While you wait for the water to boil, grind the oats. Put the lid on the food processor and use the pulse button to grind the oats until they're fine and powdery. If you don't have a food processor, grind the oats in a blender. Stir the ground oats into the boiling water. Keep stirring until the oats dissolve. Use your spoon to break up any lumps of ground oats that you see floating in the water. Take care not to splash any boiling water out of the pan as you stir. Turn the burner to medium and simmer the cereal for 10 minutes. Adjust the burner so the water bubbles gently and stir the cereal every few minutes as it cooks. This will prevent lumps from forming. If you prefer, use whisk instead of a spoon. Cool the oatmeal cereal to room temperature. Once the oats have absorbed most of the water, turn off the burner and let the cereal cool for 15 to 20 minutes or until it's at room temperature. Then, serve the cereal or store it to use later.Tip: Since the cereal thickens as it's stored, dilute it with breastmilk or formula before you serve it to your baby. If you don't serve the cereal right away, cover it and put it in the refrigerator for up to 1 week. Mix in 1 teaspoon (5 g) of pureed fruit or vegetable if you want to flavor the cereal. If your baby has already tried a pureed fruit or vegetable, stir a little of it into the cereal. This will add nutrition and flavor. The puree also thins the cereal a little. Try mixing in 1 of the following:Warning: Avoid sweetening the oatmeal cereal with honey if your baby is under 1 year old because of the risk of botulism. Applesauce\nMashed bananas\nPureed carrots\nPear sauce\nPureed sweet potatoes Stir in 3 to 5 US tbsp (44 to 74 ml) of liquid if you want to thin the cereal. Most babies prefer runny foods when they're learning to eat, so scoop a little of the oatmeal cereal into a baby bowl and mix in 3 to 5 tablespoons (44 to 74 ml) of breastmilk or formula. Stir until the cereal is as thin as you like and offer your baby a spoonful. Avoid diluting the cereal with cow's milk until your baby is 1 year old. Mixing Storebought Oatmeal Cereal Put 1 tablespoon (2.5 g) of oatmeal cereal into a bowl. If this is your baby's first cereal feeding, measure the cereal into a small microwave-safe bowl. If you're feeding an older baby who's already eating food, double or triple the amount. Keep in mind that you'll have to discard the uneaten cereal since dipping your baby's spoon into it introduces bacteria. Pour in 4 tablespoons (59 ml) of breastmilk or formula. Use whichever liquid your baby is already used to so they'll enjoy the taste of the oatmeal cereal. If you don't have breastmilk or formula, substitute fresh, clean water. Avoid adding cow's milk to the cereal until your baby is at least 1 year old. Stir the oatmeal cereal until it's smooth and thin. Keep stirring until the oatmeal cereal dissolves in the liquid. If there are still lumps or pockets of dry cereal, stir in another 1 tablespoon (15 ml) of liquid. Younger babies enjoy thin, runny cereal while babies closer to 1 year old can eat thick oatmeal cereal. Feed the oatmeal cereal to your baby. Scoop a little of the cereal on a baby spoon and offer it to your baby. If your baby gags, thin the cereal with more liquid. If you think your baby isn't eating the cereal because it's cold, put it into a microwave-safe bowl and microwave it at 50% power for 15 seconds. Then, stir the cereal again and ensure that it's not too hot for your baby.Tip: If you made the cereal using breastmilk, avoid heating it in the microwave because the microwave destroys nutrients in the breastmilk. Instead, warm a bag of breastmilk in warm water before you stir it into the cereal. Always check the temperature of your baby's food before you feed them. Discard the uneaten cereal. Unfortunately, you can't save leftover baby cereal because harmful bacteria can grow in it. Throw away the cereal your baby didn't eat and mix together a fresh bowl of cereal when your baby is ready for their next solid meal. Babies between 4 and 6 months old usually eat between 1 to 2 tablespoons (2.5 to 5 g) of prepared oatmeal cereal a day. Infants between 6 and 12 months old generally eat between 2 and 4 tablespoons (5 to 10 g) of prepared oatmeal cereal a day.",
    "sentences": [
        " Making Homemade Oatmeal Cereal Bring 1 cup (240 ml) of water to boil.",
        "Pour the water into a small saucepan and turn the burner to high.",
        "Heat the water until it begins to boil vigorously.",
        "Although you can use formula or breastmilk to thin the cereal later, avoid using it to cook the cereal.",
        "Put 1/4 cup (22 g) of oats in a food processor and grind them to a powder.",
        "While you wait for the water to boil, grind the oats.",
        "Put the lid on the food processor and use the pulse button to grind the oats until they're fine and powdery.",
        "If you don't have a food processor, grind the oats in a blender.",
        "Stir the ground oats into the boiling water.",
        "Keep stirring until the oats dissolve.",
        "Use your spoon to break up any lumps of ground oats that you see floating in the water.",
        "Take care not to splash any boiling water out of the pan as you stir.",
        "Turn the burner to medium and simmer the cereal for 10 minutes.",
        "Adjust the burner so the water bubbles gently and stir the cereal every few minutes as it cooks.",
        "This will prevent lumps from forming.",
        "If you prefer, use whisk instead of a spoon.",
        "Cool the oatmeal cereal to room temperature.",
        "Once the oats have absorbed most of the water, turn off the burner and let the cereal cool for 15 to 20 minutes or until it's at room temperature.",
        "Then, serve the cereal or store it to use later.Tip: Since the cereal thickens as it's stored, dilute it with breastmilk or formula before you serve it to your baby.",
        "If you don't serve the cereal right away, cover it and put it in the refrigerator for up to 1 week.",
        "Mix in 1 teaspoon (5 g) of pureed fruit or vegetable if you want to flavor the cereal.",
        "If your baby has already tried a pureed fruit or vegetable, stir a little of it into the cereal.",
        "This will add nutrition and flavor.",
        "The puree also thins the cereal a little.",
        "Try mixing in 1 of the following:Warning: Avoid sweetening the oatmeal cereal with honey if your baby is under 1 year old because of the risk of botulism.",
        "Applesauce\nMashed bananas\nPureed carrots\nPear sauce\nPureed sweet potatoes Stir in 3 to 5 US tbsp (44 to 74 ml) of liquid if you want to thin the cereal.",
        "Most babies prefer runny foods when they're learning to eat, so scoop a little of the oatmeal cereal into a baby bowl and mix in 3 to 5 tablespoons (44 to 74 ml) of breastmilk or formula.",
        "Stir until the cereal is as thin as you like and offer your baby a spoonful.",
        "Avoid diluting the cereal with cow's milk until your baby is 1 year old.",
        "Mixing Storebought Oatmeal Cereal Put 1 tablespoon (2.5 g) of oatmeal cereal into a bowl.",
        "If this is your baby's first cereal feeding, measure the cereal into a small microwave-safe bowl.",
        "If you're feeding an older baby who's already eating food, double or triple the amount.",
        "Keep in mind that you'll have to discard the uneaten cereal since dipping your baby's spoon into it introduces bacteria.",
        "Pour in 4 tablespoons (59 ml) of breastmilk or formula.",
        "Use whichever liquid your baby is already used to so they'll enjoy the taste of the oatmeal cereal.",
        "If you don't have breastmilk or formula, substitute fresh, clean water.",
        "Avoid adding cow's milk to the cereal until your baby is at least 1 year old.",
        "Stir the oatmeal cereal until it's smooth and thin.",
        "Keep stirring until the oatmeal cereal dissolves in the liquid.",
        "If there are still lumps or pockets of dry cereal, stir in another 1 tablespoon (15 ml) of liquid.",
        "Younger babies enjoy thin, runny cereal while babies closer to 1 year old can eat thick oatmeal cereal.",
        "Feed the oatmeal cereal to your baby.",
        "Scoop a little of the cereal on a baby spoon and offer it to your baby.",
        "If your baby gags, thin the cereal with more liquid.",
        "If you think your baby isn't eating the cereal because it's cold, put it into a microwave-safe bowl and microwave it at 50% power for 15 seconds.",
        "Then, stir the cereal again and ensure that it's not too hot for your baby.Tip: If you made the cereal using breastmilk, avoid heating it in the microwave because the microwave destroys nutrients in the breastmilk.",
        "Instead, warm a bag of breastmilk in warm water before you stir it into the cereal.",
        "Always check the temperature of your baby's food before you feed them.",
        "Discard the uneaten cereal.",
        "Unfortunately, you can't save leftover baby cereal because harmful bacteria can grow in it.",
        "Throw away the cereal your baby didn't eat and mix together a fresh bowl of cereal when your baby is ready for their next solid meal.",
        "Babies between 4 and 6 months old usually eat between 1 to 2 tablespoons (2.5 to 5 g) of prepared oatmeal cereal a day.",
        "Infants between 6 and 12 months old generally eat between 2 and 4 tablespoons (5 to 10 g) of prepared oatmeal cereal a day."
    ]
}