{
    "title": "How to Count Tree Rings",
    "url": "https://www.wikihow.com/Count-Tree-Rings",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Biology",
        "Botany"
    ],
    "methods": [
        {
            "name": "Determining a Tree’s Age",
            "steps": [
                {
                    "headline": "Locate the center of a tree stump or cross-section of a tree that has been cut.",
                    "description": "Find a stump of a tree that was cut down or get a circular piece of a tree from near the bottom. Make sure the tree was cut horizontally so the stump or cross-section is relatively flat.Tip: Keep in mind that this method of determining a tree’s age by counting the rings does not work for 100% of the trees on the planet. Some types of tropical trees, for example, do not form visible rings inside their trunks. Don’t use a stump or cross-section of wood that is rotten or falling apart or you won’t be able to accurately count the rings."
                },
                {
                    "headline": "Look for alternating dark-colored rings and light-colored rings in the trunk.",
                    "description": "The light rings form during the first part of the growing season and the dark rings form at the end. Each pair of light and dark rings adds up to 1 year of growth for the tree. The light rings typically form in spring and early summer, while the dark rings form in late summer and fall."
                },
                {
                    "headline": "Count the dark rings to calculate the age of the tree.",
                    "description": "Start in the middle of the stump or cross-section of wood and count the first dark ring you see. Continue counting outwards from the middle ring until you reach the last dark ring. The total number of dark rings represents the age of the tree in years. Don’t count the bark of the tree as a dark ring. It doesn’t represent a year of growth because the bark just continues to get pushed out as the tree grows from the inside. You can use a magnifying glass to help you count the rings if they are small and close together."
                }
            ]
        },
        {
            "name": "Gathering Other Information from Tree Rings",
            "steps": [
                {
                    "headline": "Look for wide, evenly-spaced rings that represent years of good weather.",
                    "description": "The broadest rings on a tree indicate years during which the tree received lots of sunlight and rain. The tree was able to grow a lot during these years, leading to big rings. If a tree’s rings are wide on 1 side but narrower on the other, it might mean that something was pushing against the tree on 1 side during those years of growth. It could even signify that 1 side of the tree faced very heavy winds, so it didn’t grow as much on that side."
                },
                {
                    "headline": "Spot narrowly-spaced rings to determine when there were dry years.",
                    "description": "A narrow ring on a trees trunk represents a year when there was not a lot of rain. Clusters of narrow rings indicate several years of drought.Fact: Scientists can use tree rings to understand the past climate of our planet and even make predictions about future climate patterns. In some cases, narrow rings can represent an insect infestation. Certain types of larvae eat a tree’s leaves and leaf buds and slow its growth down."
                },
                {
                    "headline": "Look for burn scars in the rings.",
                    "description": "Look for black scars within the tree’s rings surrounded by normal wood. These represent years during which a forest fire or perhaps lighting scorched the outside of the tree. Over the years the tree grows new wood around such scars, but the scars stay forever within its trunk."
                }
            ]
        }
    ],
    "tyn": [
        "Tree stump or horizontal cross-section of a tree",
        "Magnifying glass (optional)"
    ],
    "text": " Determining a Tree’s Age Locate the center of a tree stump or cross-section of a tree that has been cut. Find a stump of a tree that was cut down or get a circular piece of a tree from near the bottom. Make sure the tree was cut horizontally so the stump or cross-section is relatively flat.Tip: Keep in mind that this method of determining a tree’s age by counting the rings does not work for 100% of the trees on the planet. Some types of tropical trees, for example, do not form visible rings inside their trunks. Don’t use a stump or cross-section of wood that is rotten or falling apart or you won’t be able to accurately count the rings. Look for alternating dark-colored rings and light-colored rings in the trunk. The light rings form during the first part of the growing season and the dark rings form at the end. Each pair of light and dark rings adds up to 1 year of growth for the tree. The light rings typically form in spring and early summer, while the dark rings form in late summer and fall. Count the dark rings to calculate the age of the tree. Start in the middle of the stump or cross-section of wood and count the first dark ring you see. Continue counting outwards from the middle ring until you reach the last dark ring. The total number of dark rings represents the age of the tree in years. Don’t count the bark of the tree as a dark ring. It doesn’t represent a year of growth because the bark just continues to get pushed out as the tree grows from the inside. You can use a magnifying glass to help you count the rings if they are small and close together. Gathering Other Information from Tree Rings Look for wide, evenly-spaced rings that represent years of good weather. The broadest rings on a tree indicate years during which the tree received lots of sunlight and rain. The tree was able to grow a lot during these years, leading to big rings. If a tree’s rings are wide on 1 side but narrower on the other, it might mean that something was pushing against the tree on 1 side during those years of growth. It could even signify that 1 side of the tree faced very heavy winds, so it didn’t grow as much on that side. Spot narrowly-spaced rings to determine when there were dry years. A narrow ring on a trees trunk represents a year when there was not a lot of rain. Clusters of narrow rings indicate several years of drought.Fact: Scientists can use tree rings to understand the past climate of our planet and even make predictions about future climate patterns. In some cases, narrow rings can represent an insect infestation. Certain types of larvae eat a tree’s leaves and leaf buds and slow its growth down. Look for burn scars in the rings. Look for black scars within the tree’s rings surrounded by normal wood. These represent years during which a forest fire or perhaps lighting scorched the outside of the tree. Over the years the tree grows new wood around such scars, but the scars stay forever within its trunk.",
    "sentences": [
        " Determining a Tree’s Age Locate the center of a tree stump or cross-section of a tree that has been cut.",
        "Find a stump of a tree that was cut down or get a circular piece of a tree from near the bottom.",
        "Make sure the tree was cut horizontally so the stump or cross-section is relatively flat.Tip: Keep in mind that this method of determining a tree’s age by counting the rings does not work for 100% of the trees on the planet.",
        "Some types of tropical trees, for example, do not form visible rings inside their trunks.",
        "Don’t use a stump or cross-section of wood that is rotten or falling apart or you won’t be able to accurately count the rings.",
        "Look for alternating dark-colored rings and light-colored rings in the trunk.",
        "The light rings form during the first part of the growing season and the dark rings form at the end.",
        "Each pair of light and dark rings adds up to 1 year of growth for the tree.",
        "The light rings typically form in spring and early summer, while the dark rings form in late summer and fall.",
        "Count the dark rings to calculate the age of the tree.",
        "Start in the middle of the stump or cross-section of wood and count the first dark ring you see.",
        "Continue counting outwards from the middle ring until you reach the last dark ring.",
        "The total number of dark rings represents the age of the tree in years.",
        "Don’t count the bark of the tree as a dark ring.",
        "It doesn’t represent a year of growth because the bark just continues to get pushed out as the tree grows from the inside.",
        "You can use a magnifying glass to help you count the rings if they are small and close together.",
        "Gathering Other Information from Tree Rings Look for wide, evenly-spaced rings that represent years of good weather.",
        "The broadest rings on a tree indicate years during which the tree received lots of sunlight and rain.",
        "The tree was able to grow a lot during these years, leading to big rings.",
        "If a tree’s rings are wide on 1 side but narrower on the other, it might mean that something was pushing against the tree on 1 side during those years of growth.",
        "It could even signify that 1 side of the tree faced very heavy winds, so it didn’t grow as much on that side.",
        "Spot narrowly-spaced rings to determine when there were dry years.",
        "A narrow ring on a trees trunk represents a year when there was not a lot of rain.",
        "Clusters of narrow rings indicate several years of drought.Fact: Scientists can use tree rings to understand the past climate of our planet and even make predictions about future climate patterns.",
        "In some cases, narrow rings can represent an insect infestation.",
        "Certain types of larvae eat a tree’s leaves and leaf buds and slow its growth down.",
        "Look for burn scars in the rings.",
        "Look for black scars within the tree’s rings surrounded by normal wood.",
        "These represent years during which a forest fire or perhaps lighting scorched the outside of the tree.",
        "Over the years the tree grows new wood around such scars, but the scars stay forever within its trunk."
    ]
}