{
    "title": "How to Clean Shoes with a Toothbrush",
    "url": "https://www.wikihow.com/Clean-Shoes-with-a-Toothbrush",
    "category_hierarchy": [
        "Personal Care and Style",
        "Footwear",
        "Shoes",
        "Care of Shoes",
        "Cleaning Shoes"
    ],
    "methods": [
        {
            "name": "Scrubbing the Soles of Your Shoes",
            "steps": [
                {
                    "headline": "Wipe off your shoes with a damp cloth.",
                    "description": "Your shoes might have large clumps of dirt or dust that can be washed away with water. Wipe off any large clumps of dirt or debris with a wet cloth or paper towel."
                },
                {
                    "headline": "Mix 1 teaspoon (4.9 mL) of laundry detergent with 1 cup (240 mL) of water.",
                    "description": "Create your mixture in a container that you don’t mind getting soapy, like a plastic bowl or Tupperware container. Use a mild laundry detergent without bleach."
                },
                {
                    "headline": "Dip your toothbrush in the mix and scrub the soles of your shoes.",
                    "description": "You can use this mixture on the entire bottom sole of your shoe. Firmly scrub the soles with the toothbrush, focusing extra attention on really dirty areas. Dip the toothbrush in the water mixture over and over as the toothbrush gets dirty.Warning: If your shoes are leather, do not get any detergent on the outside of your shoes. Detergent damages leather."
                },
                {
                    "headline": "Wipe off the soles of your shoes with a towel.",
                    "description": "Use a clean rag to wipe the bottoms of your shoes off. Make sure they are totally dry before you put them back on, or they could cause you to slip. You can air dry your shoes overnight if you have time."
                }
            ]
        },
        {
            "name": "Cleaning Canvas and Mesh Shoes",
            "steps": [
                {
                    "headline": "Mix 1 teaspoon (4.9 mL) of detergent with 1 cup (240 mL) of water.",
                    "description": "Use the laundry detergent that you already have in your home. Mix the detergent and water together in a container that you don’t mind getting soapy, like a mixing bowl or Tupperware container. Use a mild laundry detergent that doesn’t contain bleach."
                },
                {
                    "headline": "Dip a clean toothbrush in the mixture and spot scrub your shoes.",
                    "description": "Saturate the toothbrush in your water/detergent mixture and use it to scrub the dirty parts of your shoes. Use the bristles to firmly scrub away dirt in a circular motion. You can use your mixture on every part of the shoe.Tip: Pay special attention to the toes of your shoes, because these usually get the dirtiest."
                },
                {
                    "headline": "Use a damp sponge to wipe off the soap.",
                    "description": "Wet a clean sponge with cool water and wipe off any areas that you used your detergent mixture. Make sure there isn’t any soap left on your shoes."
                },
                {
                    "headline": "Let your shoes air dry.",
                    "description": "Leave your shoes out in the sun or a cool dry place to dry in order to prevent mildew. Make sure they are fully dry before you wear them again or store them. Drying your shoes in a dryer could cause them to shrink or warp."
                }
            ]
        },
        {
            "name": "Using Bleach on White Sneakers",
            "steps": [
                {
                    "headline": "Mix 1 part bleach and 5 parts water together.",
                    "description": "To use bleach on white sneakers, you need to dilute it so that it doesn’t discolor your shoes. Mix bleach and water together in a plastic bowl that you don’t mind getting bleach on. Wear gloves to protect your hands during this process."
                },
                {
                    "headline": "Dip a clean toothbrush into your mixture and scrub your shoes.",
                    "description": "If your sneakers are all white, you don’t have to worry about discoloring any areas of your shoes. Use your toothbrush to firmly scrub the areas that are the dirtiest, and then give a once-over to your entire shoe. If your shoes are not all white, do not use bleach on them. You could discolor the colored areas of your shoe."
                },
                {
                    "headline": "Rinse your shoes with warm water.",
                    "description": "Wash the bleach off of your shoes so that they are safe to wear by running them under warm water in your sink or tub. Make sure to rinse them thoroughly so that no bleach is left on your shoes. You can safely rinse bleach down your drain, as long as you don’t pour ammonia down it right afterwards. When ammonia and bleach mix, they create a dangerous gas that can knock you unconscious."
                },
                {
                    "headline": "Let your shoes air dry before using them.",
                    "description": "Set your shoes on a towel in the sun or a cool, dry area of your home to air dry. Leave them for a few hours or even overnight until they are no longer wet to the touch. Storing wet shoes could lead to mildew."
                }
            ]
        }
    ],
    "tyn": [
        "Scrubbing the Soles of Your Shoes",
        "Cloth or towel",
        "Laundry detergent",
        "Plastic bowl",
        "Toothbrush",
        "Cleaning Canvas and Mesh Shoes",
        "Using Bleach on White Sneakers",
        "Bleach"
    ],
    "text": " Scrubbing the Soles of Your Shoes Wipe off your shoes with a damp cloth. Your shoes might have large clumps of dirt or dust that can be washed away with water. Wipe off any large clumps of dirt or debris with a wet cloth or paper towel. Mix 1 teaspoon (4.9 mL) of laundry detergent with 1 cup (240 mL) of water. Create your mixture in a container that you don’t mind getting soapy, like a plastic bowl or Tupperware container. Use a mild laundry detergent without bleach. Dip your toothbrush in the mix and scrub the soles of your shoes. You can use this mixture on the entire bottom sole of your shoe. Firmly scrub the soles with the toothbrush, focusing extra attention on really dirty areas. Dip the toothbrush in the water mixture over and over as the toothbrush gets dirty.Warning: If your shoes are leather, do not get any detergent on the outside of your shoes. Detergent damages leather. Wipe off the soles of your shoes with a towel. Use a clean rag to wipe the bottoms of your shoes off. Make sure they are totally dry before you put them back on, or they could cause you to slip. You can air dry your shoes overnight if you have time. Cleaning Canvas and Mesh Shoes Mix 1 teaspoon (4.9 mL) of detergent with 1 cup (240 mL) of water. Use the laundry detergent that you already have in your home. Mix the detergent and water together in a container that you don’t mind getting soapy, like a mixing bowl or Tupperware container. Use a mild laundry detergent that doesn’t contain bleach. Dip a clean toothbrush in the mixture and spot scrub your shoes. Saturate the toothbrush in your water/detergent mixture and use it to scrub the dirty parts of your shoes. Use the bristles to firmly scrub away dirt in a circular motion. You can use your mixture on every part of the shoe.Tip: Pay special attention to the toes of your shoes, because these usually get the dirtiest. Use a damp sponge to wipe off the soap. Wet a clean sponge with cool water and wipe off any areas that you used your detergent mixture. Make sure there isn’t any soap left on your shoes. Let your shoes air dry. Leave your shoes out in the sun or a cool dry place to dry in order to prevent mildew. Make sure they are fully dry before you wear them again or store them. Drying your shoes in a dryer could cause them to shrink or warp. Using Bleach on White Sneakers Mix 1 part bleach and 5 parts water together. To use bleach on white sneakers, you need to dilute it so that it doesn’t discolor your shoes. Mix bleach and water together in a plastic bowl that you don’t mind getting bleach on. Wear gloves to protect your hands during this process. Dip a clean toothbrush into your mixture and scrub your shoes. If your sneakers are all white, you don’t have to worry about discoloring any areas of your shoes. Use your toothbrush to firmly scrub the areas that are the dirtiest, and then give a once-over to your entire shoe. If your shoes are not all white, do not use bleach on them. You could discolor the colored areas of your shoe. Rinse your shoes with warm water. Wash the bleach off of your shoes so that they are safe to wear by running them under warm water in your sink or tub. Make sure to rinse them thoroughly so that no bleach is left on your shoes. You can safely rinse bleach down your drain, as long as you don’t pour ammonia down it right afterwards. When ammonia and bleach mix, they create a dangerous gas that can knock you unconscious. Let your shoes air dry before using them. Set your shoes on a towel in the sun or a cool, dry area of your home to air dry. Leave them for a few hours or even overnight until they are no longer wet to the touch. Storing wet shoes could lead to mildew.",
    "sentences": [
        " Scrubbing the Soles of Your Shoes Wipe off your shoes with a damp cloth.",
        "Your shoes might have large clumps of dirt or dust that can be washed away with water.",
        "Wipe off any large clumps of dirt or debris with a wet cloth or paper towel.",
        "Mix 1 teaspoon (4.9 mL) of laundry detergent with 1 cup (240 mL) of water.",
        "Create your mixture in a container that you don’t mind getting soapy, like a plastic bowl or Tupperware container.",
        "Use a mild laundry detergent without bleach.",
        "Dip your toothbrush in the mix and scrub the soles of your shoes.",
        "You can use this mixture on the entire bottom sole of your shoe.",
        "Firmly scrub the soles with the toothbrush, focusing extra attention on really dirty areas.",
        "Dip the toothbrush in the water mixture over and over as the toothbrush gets dirty.Warning: If your shoes are leather, do not get any detergent on the outside of your shoes.",
        "Detergent damages leather.",
        "Wipe off the soles of your shoes with a towel.",
        "Use a clean rag to wipe the bottoms of your shoes off.",
        "Make sure they are totally dry before you put them back on, or they could cause you to slip.",
        "You can air dry your shoes overnight if you have time.",
        "Cleaning Canvas and Mesh Shoes Mix 1 teaspoon (4.9 mL) of detergent with 1 cup (240 mL) of water.",
        "Use the laundry detergent that you already have in your home.",
        "Mix the detergent and water together in a container that you don’t mind getting soapy, like a mixing bowl or Tupperware container.",
        "Use a mild laundry detergent that doesn’t contain bleach.",
        "Dip a clean toothbrush in the mixture and spot scrub your shoes.",
        "Saturate the toothbrush in your water/detergent mixture and use it to scrub the dirty parts of your shoes.",
        "Use the bristles to firmly scrub away dirt in a circular motion.",
        "You can use your mixture on every part of the shoe.Tip: Pay special attention to the toes of your shoes, because these usually get the dirtiest.",
        "Use a damp sponge to wipe off the soap.",
        "Wet a clean sponge with cool water and wipe off any areas that you used your detergent mixture.",
        "Make sure there isn’t any soap left on your shoes.",
        "Let your shoes air dry.",
        "Leave your shoes out in the sun or a cool dry place to dry in order to prevent mildew.",
        "Make sure they are fully dry before you wear them again or store them.",
        "Drying your shoes in a dryer could cause them to shrink or warp.",
        "Using Bleach on White Sneakers Mix 1 part bleach and 5 parts water together.",
        "To use bleach on white sneakers, you need to dilute it so that it doesn’t discolor your shoes.",
        "Mix bleach and water together in a plastic bowl that you don’t mind getting bleach on.",
        "Wear gloves to protect your hands during this process.",
        "Dip a clean toothbrush into your mixture and scrub your shoes.",
        "If your sneakers are all white, you don’t have to worry about discoloring any areas of your shoes.",
        "Use your toothbrush to firmly scrub the areas that are the dirtiest, and then give a once-over to your entire shoe.",
        "If your shoes are not all white, do not use bleach on them.",
        "You could discolor the colored areas of your shoe.",
        "Rinse your shoes with warm water.",
        "Wash the bleach off of your shoes so that they are safe to wear by running them under warm water in your sink or tub.",
        "Make sure to rinse them thoroughly so that no bleach is left on your shoes.",
        "You can safely rinse bleach down your drain, as long as you don’t pour ammonia down it right afterwards.",
        "When ammonia and bleach mix, they create a dangerous gas that can knock you unconscious.",
        "Let your shoes air dry before using them.",
        "Set your shoes on a towel in the sun or a cool, dry area of your home to air dry.",
        "Leave them for a few hours or even overnight until they are no longer wet to the touch.",
        "Storing wet shoes could lead to mildew."
    ]
}