{
    "title": "How to Freeze Dill",
    "url": "https://www.wikihow.com/Freeze-Dill",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Planting and Growing",
        "Growing Herbs and Spices"
    ],
    "methods": [
        {
            "name": "Cleaning the Dill",
            "steps": [
                {
                    "headline": "Remove the lower stalk of the plant with a knife.",
                    "description": "Take a close look at your dill weed to find the fronds, branched stems, and lower stalk. Identify the fronds by finding the soft, frilly tips on the edge of the dill plant. You can find the branched stems attached to these fronds, and a lower, thicker stalk toward the bottom of the plant. Use a knife to slice off this stalk portion, as you won’t be using it in future recipes. The lower stalk isn’t edible, so there’s no point in freezing it."
                },
                {
                    "headline": "Wash the dill off thoroughly with cool water.",
                    "description": "Hold the trimmed bunch of dill beneath a stream of cool, running water. Rotate the plant so that all of the fronds get evenly soaked. After you turn the water off, let any excess water drip over the sink. Hold the herbs over the sink until they’re no longer dripping wet."
                },
                {
                    "headline": "Dry off the herbs with a paper towel.",
                    "description": "Lay a dry paper towel onto a flat surface and spread the dill across the sheet. Take an additional paper towel and blot away any additional moisture from the herbs. Continue dabbing at the dill until it’s no longer wet to the touch. If the dill is still visibly wet after being washed, the leftover water could end up freezing later on."
                }
            ]
        },
        {
            "name": "Freezing Plain Dill in Freezer Bags",
            "steps": [
                {
                    "headline": "Chop the dill into coarse pieces.",
                    "description": "Take a knife and cut the dill into coarser slices. Don’t worry about chopping the herb finely; instead, cut the dill into similarly sized pieces that are convenient for cooking. As you cut the dill, start setting the pieces aside."
                },
                {
                    "headline": "Place the herbs onto a cookie sheet in a single layer.",
                    "description": "Sprinkle the chopped dill over the surface of the baking sheet. Do your best to keep the dill in a thin, separated layer without much overlap between the different pieces. You won’t have to wait as long for the dill pieces to freeze if you avoid stacking them. Don’t worry about lining the sheet—you’re only using it to contain the dill pieces as they freeze."
                },
                {
                    "headline": "Set the cookie sheet in the freezer for 12 hours.",
                    "description": "Place the tray on an empty shelf in the freezer with plenty of open space so the dill pieces can freeze evenly. Before you close the freezer door, check that there are no precarious items in the freezer that could fall onto the tray and slow down the process. Let the herbs stay in the freezer overnight before you check the dill pieces for firmness. If the dill pieces still aren’t frozen after 1 night, leave them in for an additional 2-4 hours. Continue checking periodically until they’re completely firm to the touch. Households with larger, more powerful freezers might not have to wait as long."
                },
                {
                    "headline": "Stick the frozen dill in a freezer-safe plastic bag.",
                    "description": "Remove the cookie sheet from the freezer once the dill pieces are frozen. Scoop the herbs into a freezer-safe plastic bag, making sure to seal it afterwards. Label the bag so you can keep track of the dill’s freshness. If you’re storing a lot of dill, you might need to use more than 1 plastic storage bag."
                },
                {
                    "headline": "Use the dill within 6 months.",
                    "description": "To prevent the herbs from getting freezer burn, aim to use the dill pieces within 4-6 months. Try and keep the herbs in the front of the appliance so you don’t forget about it."
                }
            ]
        },
        {
            "name": "Using an Ice Cube Tray",
            "steps": [
                {
                    "headline": "Freeze dill in oil if you plan to use it in sauces or stews.",
                    "description": "Create a go-to garnish or bonus ingredient for future meals by adding dill to an ice cube tray and pouring olive oil over it. If you’re planning on preparing fresher recipes like salads or dips, opt for fresh dill instead of the frozen variety. Freezing dill (or any kind of herb) in water can make a great decorative ice cube for cocktails."
                },
                {
                    "headline": "Chop the dill into coarse, evenly-sized pieces.",
                    "description": "Take a knife and slice the dill into smaller pieces, so the herbs can fit in the ice cube tray wells. Don’t cut the herb too finely, unless you’d prefer to be in tiny pieces for future recipes. If you don’t feel like chopping the dill, you can keep the herb in larger portions."
                },
                {
                    "headline": "Fill the ice cube wells with dill and olive oil.",
                    "description": "Take a small amount of the chopped dill and place it into each of the ice cube wells. Continue adding dill until all of the wells are ⅔-filled. Finally, pour olive oil over the dill to completely saturate the tray with oil. Don’t pour too much oil into each well. You want each of the ice cubes to be separate, without any oil overlapping."
                },
                {
                    "headline": "Cover the ice cube tray in plastic wrap.",
                    "description": "Take a long sheet of plastic wrap and secure it over the liquid oil. Wrap the plastic tightly around the edges of the tray, so the oil doesn’t get onto any other items in the freezer. Feel free to use as many sheets of plastic wrap as you need."
                },
                {
                    "headline": "Let the oil cubes freeze overnight.",
                    "description": "Place the filled ice cube tray on an empty surface in your freezer. Make sure that there are no loose or precarious items nearby that could fall and tip the tray over. Wait a full night for the oil and dill to freeze before checking on the ice tray again. If the oil still isn’t frozen after 1 night, keep it in the freezer for several more hours."
                },
                {
                    "headline": "Place the cubes into freezer bags for long-term storage.",
                    "description": "Remove the frozen oil cubes from the tray individually and set them in the bottom of a freezer bag. Once all of the cubes are removed, label the bag with the current date. Try and use the dill within 1 year for the freshest possible results! Make sure to push out any excess air from the freezer safe bags. This helps to prevent freezer burn."
                }
            ]
        },
        {
            "name": "Preserving as a Paste",
            "steps": [
                {
                    "headline": "Pick the fronds off of the dill stems.",
                    "description": "Take a large bunch of dill weed and begin pinching off the fluffy, dangling fronds from the edge of the branch stems. Set these fronds in a bowl as you go. Continue plucking off the fronds until you have 2 cups (20 g) of dill set aside. If you’d prefer, you can also include the branch stems in the sauce."
                },
                {
                    "headline": "Blend 2 cups (20 g) of dill and 2 tsp (11.4 g) of salt in a food processor.",
                    "description": "Pour the dill fronds into a food processor, along with a small amount of salt. Turn on the device to a high speed so the dill and salt mixture can turn into a paste. Keep the food processor on for several seconds, or until you see a thicker consistency forming."
                },
                {
                    "headline": "Add in 1 cup (240 mL) of olive oil to the mixture.",
                    "description": "Gradually add small amounts of olive oil into the food processor as it’s mixing. Use the opening at the top of your device to pour the oil in. If your food processor doesn’t have this compartment, pause the appliance to add in the oil. Continue mixing the ingredients together until a moist paste forms. Split the oil into 3-4 parts to add it gradually to the sauce. Wait for the small portion of oil to mix with the dill before adding in any more. If you don’t have olive oil on hand, use whichever oil you normally use while cooking."
                },
                {
                    "headline": "Pour the paste into an ice cube tray.",
                    "description": "Turn off the food processor and remove the main container. Completely fill each ice cube well with the sauce. If needed, use an additional tray to hold the rest of the mixture. Try not to pour too much paste into the ice cube trays, as you don’t want the individual wells to overflow. Ideally, you want separated ice cubes to form in the freezer."
                },
                {
                    "headline": "Freeze the sauce mixture overnight.",
                    "description": "Place the ice cube tray(s) on a flat, open surface in your freezer. Make sure that there are no items near the trays that could fall over and slow down the freezing process. Leave the tray(s) in the freezer overnight, and check the following day to see if the sauce is frozen."
                },
                {
                    "headline": "Place the sauce cubes in double-layered freezer-bags for 4 months.",
                    "description": "Remove the frozen sauce chunks from the ice cube trays and seal them in a large, freezer-safe plastic bag. Once the bag is filled with sauce cubes, place it inside of a second freezer-safe bag for additional security. Roll down the top of the sealed inner bag, which allows you to seal the second, outer bag. Defrost and use the dill sauce within 4 months. Be sure to squeeze out any excess air from both bags before you store the sauce cubes. Label the bag so you don’t forget when you prepared the sauce."
                }
            ]
        }
    ],
    "tyn": [
        "Cleaning the Dill",
        "Water",
        "Paper towel",
        "Placing in Freezer Bags",
        "Knife",
        "Cookie sheet",
        "Freezer-safe plastic bags",
        "Using an Ice Cube Tray",
        "Olive oil",
        "Ice cube tray",
        "Plastic wrap",
        "Preserving as Paste",
        "Bowl",
        "Food processor"
    ],
    "text": " Cleaning the Dill Remove the lower stalk of the plant with a knife. Take a close look at your dill weed to find the fronds, branched stems, and lower stalk. Identify the fronds by finding the soft, frilly tips on the edge of the dill plant. You can find the branched stems attached to these fronds, and a lower, thicker stalk toward the bottom of the plant. Use a knife to slice off this stalk portion, as you won’t be using it in future recipes. The lower stalk isn’t edible, so there’s no point in freezing it. Wash the dill off thoroughly with cool water. Hold the trimmed bunch of dill beneath a stream of cool, running water. Rotate the plant so that all of the fronds get evenly soaked. After you turn the water off, let any excess water drip over the sink. Hold the herbs over the sink until they’re no longer dripping wet. Dry off the herbs with a paper towel. Lay a dry paper towel onto a flat surface and spread the dill across the sheet. Take an additional paper towel and blot away any additional moisture from the herbs. Continue dabbing at the dill until it’s no longer wet to the touch. If the dill is still visibly wet after being washed, the leftover water could end up freezing later on. Freezing Plain Dill in Freezer Bags Chop the dill into coarse pieces. Take a knife and cut the dill into coarser slices. Don’t worry about chopping the herb finely; instead, cut the dill into similarly sized pieces that are convenient for cooking. As you cut the dill, start setting the pieces aside. Place the herbs onto a cookie sheet in a single layer. Sprinkle the chopped dill over the surface of the baking sheet. Do your best to keep the dill in a thin, separated layer without much overlap between the different pieces. You won’t have to wait as long for the dill pieces to freeze if you avoid stacking them. Don’t worry about lining the sheet—you’re only using it to contain the dill pieces as they freeze. Set the cookie sheet in the freezer for 12 hours. Place the tray on an empty shelf in the freezer with plenty of open space so the dill pieces can freeze evenly. Before you close the freezer door, check that there are no precarious items in the freezer that could fall onto the tray and slow down the process. Let the herbs stay in the freezer overnight before you check the dill pieces for firmness. If the dill pieces still aren’t frozen after 1 night, leave them in for an additional 2-4 hours. Continue checking periodically until they’re completely firm to the touch. Households with larger, more powerful freezers might not have to wait as long. Stick the frozen dill in a freezer-safe plastic bag. Remove the cookie sheet from the freezer once the dill pieces are frozen. Scoop the herbs into a freezer-safe plastic bag, making sure to seal it afterwards. Label the bag so you can keep track of the dill’s freshness. If you’re storing a lot of dill, you might need to use more than 1 plastic storage bag. Use the dill within 6 months. To prevent the herbs from getting freezer burn, aim to use the dill pieces within 4-6 months. Try and keep the herbs in the front of the appliance so you don’t forget about it. Using an Ice Cube Tray Freeze dill in oil if you plan to use it in sauces or stews. Create a go-to garnish or bonus ingredient for future meals by adding dill to an ice cube tray and pouring olive oil over it. If you’re planning on preparing fresher recipes like salads or dips, opt for fresh dill instead of the frozen variety. Freezing dill (or any kind of herb) in water can make a great decorative ice cube for cocktails. Chop the dill into coarse, evenly-sized pieces. Take a knife and slice the dill into smaller pieces, so the herbs can fit in the ice cube tray wells. Don’t cut the herb too finely, unless you’d prefer to be in tiny pieces for future recipes. If you don’t feel like chopping the dill, you can keep the herb in larger portions. Fill the ice cube wells with dill and olive oil. Take a small amount of the chopped dill and place it into each of the ice cube wells. Continue adding dill until all of the wells are ⅔-filled. Finally, pour olive oil over the dill to completely saturate the tray with oil. Don’t pour too much oil into each well. You want each of the ice cubes to be separate, without any oil overlapping. Cover the ice cube tray in plastic wrap. Take a long sheet of plastic wrap and secure it over the liquid oil. Wrap the plastic tightly around the edges of the tray, so the oil doesn’t get onto any other items in the freezer. Feel free to use as many sheets of plastic wrap as you need. Let the oil cubes freeze overnight. Place the filled ice cube tray on an empty surface in your freezer. Make sure that there are no loose or precarious items nearby that could fall and tip the tray over. Wait a full night for the oil and dill to freeze before checking on the ice tray again. If the oil still isn’t frozen after 1 night, keep it in the freezer for several more hours. Place the cubes into freezer bags for long-term storage. Remove the frozen oil cubes from the tray individually and set them in the bottom of a freezer bag. Once all of the cubes are removed, label the bag with the current date. Try and use the dill within 1 year for the freshest possible results! Make sure to push out any excess air from the freezer safe bags. This helps to prevent freezer burn. Preserving as a Paste Pick the fronds off of the dill stems. Take a large bunch of dill weed and begin pinching off the fluffy, dangling fronds from the edge of the branch stems. Set these fronds in a bowl as you go. Continue plucking off the fronds until you have 2 cups (20 g) of dill set aside. If you’d prefer, you can also include the branch stems in the sauce. Blend 2 cups (20 g) of dill and 2 tsp (11.4 g) of salt in a food processor. Pour the dill fronds into a food processor, along with a small amount of salt. Turn on the device to a high speed so the dill and salt mixture can turn into a paste. Keep the food processor on for several seconds, or until you see a thicker consistency forming. Add in 1 cup (240 mL) of olive oil to the mixture. Gradually add small amounts of olive oil into the food processor as it’s mixing. Use the opening at the top of your device to pour the oil in. If your food processor doesn’t have this compartment, pause the appliance to add in the oil. Continue mixing the ingredients together until a moist paste forms. Split the oil into 3-4 parts to add it gradually to the sauce. Wait for the small portion of oil to mix with the dill before adding in any more. If you don’t have olive oil on hand, use whichever oil you normally use while cooking. Pour the paste into an ice cube tray. Turn off the food processor and remove the main container. Completely fill each ice cube well with the sauce. If needed, use an additional tray to hold the rest of the mixture. Try not to pour too much paste into the ice cube trays, as you don’t want the individual wells to overflow. Ideally, you want separated ice cubes to form in the freezer. Freeze the sauce mixture overnight. Place the ice cube tray(s) on a flat, open surface in your freezer. Make sure that there are no items near the trays that could fall over and slow down the freezing process. Leave the tray(s) in the freezer overnight, and check the following day to see if the sauce is frozen. Place the sauce cubes in double-layered freezer-bags for 4 months. Remove the frozen sauce chunks from the ice cube trays and seal them in a large, freezer-safe plastic bag. Once the bag is filled with sauce cubes, place it inside of a second freezer-safe bag for additional security. Roll down the top of the sealed inner bag, which allows you to seal the second, outer bag. Defrost and use the dill sauce within 4 months. Be sure to squeeze out any excess air from both bags before you store the sauce cubes. Label the bag so you don’t forget when you prepared the sauce.",
    "sentences": [
        " Cleaning the Dill Remove the lower stalk of the plant with a knife.",
        "Take a close look at your dill weed to find the fronds, branched stems, and lower stalk.",
        "Identify the fronds by finding the soft, frilly tips on the edge of the dill plant.",
        "You can find the branched stems attached to these fronds, and a lower, thicker stalk toward the bottom of the plant.",
        "Use a knife to slice off this stalk portion, as you won’t be using it in future recipes.",
        "The lower stalk isn’t edible, so there’s no point in freezing it.",
        "Wash the dill off thoroughly with cool water.",
        "Hold the trimmed bunch of dill beneath a stream of cool, running water.",
        "Rotate the plant so that all of the fronds get evenly soaked.",
        "After you turn the water off, let any excess water drip over the sink.",
        "Hold the herbs over the sink until they’re no longer dripping wet.",
        "Dry off the herbs with a paper towel.",
        "Lay a dry paper towel onto a flat surface and spread the dill across the sheet.",
        "Take an additional paper towel and blot away any additional moisture from the herbs.",
        "Continue dabbing at the dill until it’s no longer wet to the touch.",
        "If the dill is still visibly wet after being washed, the leftover water could end up freezing later on.",
        "Freezing Plain Dill in Freezer Bags Chop the dill into coarse pieces.",
        "Take a knife and cut the dill into coarser slices.",
        "Don’t worry about chopping the herb finely; instead, cut the dill into similarly sized pieces that are convenient for cooking.",
        "As you cut the dill, start setting the pieces aside.",
        "Place the herbs onto a cookie sheet in a single layer.",
        "Sprinkle the chopped dill over the surface of the baking sheet.",
        "Do your best to keep the dill in a thin, separated layer without much overlap between the different pieces.",
        "You won’t have to wait as long for the dill pieces to freeze if you avoid stacking them.",
        "Don’t worry about lining the sheet—you’re only using it to contain the dill pieces as they freeze.",
        "Set the cookie sheet in the freezer for 12 hours.",
        "Place the tray on an empty shelf in the freezer with plenty of open space so the dill pieces can freeze evenly.",
        "Before you close the freezer door, check that there are no precarious items in the freezer that could fall onto the tray and slow down the process.",
        "Let the herbs stay in the freezer overnight before you check the dill pieces for firmness.",
        "If the dill pieces still aren’t frozen after 1 night, leave them in for an additional 2-4 hours.",
        "Continue checking periodically until they’re completely firm to the touch.",
        "Households with larger, more powerful freezers might not have to wait as long.",
        "Stick the frozen dill in a freezer-safe plastic bag.",
        "Remove the cookie sheet from the freezer once the dill pieces are frozen.",
        "Scoop the herbs into a freezer-safe plastic bag, making sure to seal it afterwards.",
        "Label the bag so you can keep track of the dill’s freshness.",
        "If you’re storing a lot of dill, you might need to use more than 1 plastic storage bag.",
        "Use the dill within 6 months.",
        "To prevent the herbs from getting freezer burn, aim to use the dill pieces within 4-6 months.",
        "Try and keep the herbs in the front of the appliance so you don’t forget about it.",
        "Using an Ice Cube Tray Freeze dill in oil if you plan to use it in sauces or stews.",
        "Create a go-to garnish or bonus ingredient for future meals by adding dill to an ice cube tray and pouring olive oil over it.",
        "If you’re planning on preparing fresher recipes like salads or dips, opt for fresh dill instead of the frozen variety.",
        "Freezing dill (or any kind of herb) in water can make a great decorative ice cube for cocktails.",
        "Chop the dill into coarse, evenly-sized pieces.",
        "Take a knife and slice the dill into smaller pieces, so the herbs can fit in the ice cube tray wells.",
        "Don’t cut the herb too finely, unless you’d prefer to be in tiny pieces for future recipes.",
        "If you don’t feel like chopping the dill, you can keep the herb in larger portions.",
        "Fill the ice cube wells with dill and olive oil.",
        "Take a small amount of the chopped dill and place it into each of the ice cube wells.",
        "Continue adding dill until all of the wells are ⅔-filled.",
        "Finally, pour olive oil over the dill to completely saturate the tray with oil.",
        "Don’t pour too much oil into each well.",
        "You want each of the ice cubes to be separate, without any oil overlapping.",
        "Cover the ice cube tray in plastic wrap.",
        "Take a long sheet of plastic wrap and secure it over the liquid oil.",
        "Wrap the plastic tightly around the edges of the tray, so the oil doesn’t get onto any other items in the freezer.",
        "Feel free to use as many sheets of plastic wrap as you need.",
        "Let the oil cubes freeze overnight.",
        "Place the filled ice cube tray on an empty surface in your freezer.",
        "Make sure that there are no loose or precarious items nearby that could fall and tip the tray over.",
        "Wait a full night for the oil and dill to freeze before checking on the ice tray again.",
        "If the oil still isn’t frozen after 1 night, keep it in the freezer for several more hours.",
        "Place the cubes into freezer bags for long-term storage.",
        "Remove the frozen oil cubes from the tray individually and set them in the bottom of a freezer bag.",
        "Once all of the cubes are removed, label the bag with the current date.",
        "Try and use the dill within 1 year for the freshest possible results!",
        "Make sure to push out any excess air from the freezer safe bags.",
        "This helps to prevent freezer burn.",
        "Preserving as a Paste Pick the fronds off of the dill stems.",
        "Take a large bunch of dill weed and begin pinching off the fluffy, dangling fronds from the edge of the branch stems.",
        "Set these fronds in a bowl as you go.",
        "Continue plucking off the fronds until you have 2 cups (20 g) of dill set aside.",
        "If you’d prefer, you can also include the branch stems in the sauce.",
        "Blend 2 cups (20 g) of dill and 2 tsp (11.4 g) of salt in a food processor.",
        "Pour the dill fronds into a food processor, along with a small amount of salt.",
        "Turn on the device to a high speed so the dill and salt mixture can turn into a paste.",
        "Keep the food processor on for several seconds, or until you see a thicker consistency forming.",
        "Add in 1 cup (240 mL) of olive oil to the mixture.",
        "Gradually add small amounts of olive oil into the food processor as it’s mixing.",
        "Use the opening at the top of your device to pour the oil in.",
        "If your food processor doesn’t have this compartment, pause the appliance to add in the oil.",
        "Continue mixing the ingredients together until a moist paste forms.",
        "Split the oil into 3-4 parts to add it gradually to the sauce.",
        "Wait for the small portion of oil to mix with the dill before adding in any more.",
        "If you don’t have olive oil on hand, use whichever oil you normally use while cooking.",
        "Pour the paste into an ice cube tray.",
        "Turn off the food processor and remove the main container.",
        "Completely fill each ice cube well with the sauce.",
        "If needed, use an additional tray to hold the rest of the mixture.",
        "Try not to pour too much paste into the ice cube trays, as you don’t want the individual wells to overflow.",
        "Ideally, you want separated ice cubes to form in the freezer.",
        "Freeze the sauce mixture overnight.",
        "Place the ice cube tray(s) on a flat, open surface in your freezer.",
        "Make sure that there are no items near the trays that could fall over and slow down the freezing process.",
        "Leave the tray(s) in the freezer overnight, and check the following day to see if the sauce is frozen.",
        "Place the sauce cubes in double-layered freezer-bags for 4 months.",
        "Remove the frozen sauce chunks from the ice cube trays and seal them in a large, freezer-safe plastic bag.",
        "Once the bag is filled with sauce cubes, place it inside of a second freezer-safe bag for additional security.",
        "Roll down the top of the sealed inner bag, which allows you to seal the second, outer bag.",
        "Defrost and use the dill sauce within 4 months.",
        "Be sure to squeeze out any excess air from both bags before you store the sauce cubes.",
        "Label the bag so you don’t forget when you prepared the sauce."
    ]
}