{
    "title": "How to Move a Piano",
    "url": "https://www.wikihow.com/Move-a-Piano",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "Transporting Musical Instruments"
    ],
    "methods": [
        {
            "name": "Moving a Spinet Piano",
            "steps": [
                {
                    "headline": "Know your piano.",
                    "description": "The spinet piano is the smallest type of piano commonly seen in homes. Manufactured from the 1930s on through the end of the 20th century, a spinet piano's compact size is achieved by clever engineering of the key mechanisms inside. Spinet pianos are not very tall, topping out at about 3 feet (0.9 m) in height, and they are generally 58 inches (147.3 cm) long, the same as other types of upright piano. Despite their relatively small size, they usually weigh at least 300 pounds, making the job of moving them a team effort not to be undertaken lightly."
                },
                {
                    "headline": "Plan your route.",
                    "description": "Have a clear route from start to finish in mind before you begin to move the piano, and communicate it to everyone who is helping you move. Using a tape measure, ensure that the spinet will fit through every door or opening you plan to move it through. If the piano is being moved out of the house to a moving truck, have the truck open and any moving ramps deployed in advance of the move, and plan to move the piano before any other, lighter furniture so that there is plenty of room for your team to maneuver it into place. For safety reasons, one person per 100 pounds is recommended for this and all upright piano moves. This may work out to more people than are strictly needed, but extra personnel can help in other ways (such as opening doors), and can step in should somebody start to get worn out."
                },
                {
                    "headline": "Prepare the piano.",
                    "description": "Lock down the spinet's lid and the keyboard lid, if there is one. Wrap the piano in thick blankets or special moving blankets and use packing tape to secure the blankets around the piano. This will prevent scuffing on the finish and corners."
                },
                {
                    "headline": "Move the piano.",
                    "description": "A spinet's low profile makes for a relatively easy move. Using as much help as you deem necessary, have each person lift up a different part of the piano at the same time. Be sure that everyone is lifting from firmly underneath the body of the piano. In small, measured steps, walk the piano to its destination. Never move the piano more than a few feet without stopping to reset your grip."
                }
            ]
        },
        {
            "name": "Moving a Studio or Large Upright Piano",
            "steps": [
                {
                    "headline": "Know your piano.",
                    "description": "One the most common types of piano today is the upright piano. These pianos are both normally 58 inches (147.3 cm) wide, and despite their differences, both the full vertical and the smaller studio upright can be moved using essentially the same method. The smaller \"studio\" uprights usually weigh between 400 and 600 pounds. The monstrous \"full vertical\" or large upright piano can weigh as much as half a ton. A studio piano's center of gravity is also lower than a large upright's, as it is about 4 feet (1.2 m) tall as opposed to a large upright's roughly 5-foot height."
                },
                {
                    "headline": "Plan your route.",
                    "description": "Begin by clearing a path to your destination and measuring all entrances to ensure that the piano will fit through them. Have your moving truck open with the ramp deployed, if you are moving the piano onto the truck. Try to get one person per 100 pounds of estimated weight to help you move your piano. Ensure that every member of your piano moving grew is wearing rugged leather work gloves, and if at all possible, thick weightlifting support belts to help prevent back strain."
                },
                {
                    "headline": "Prepare the piano.",
                    "description": "Unlike a spinet, these larger upright piano models are too top-heavy and bulky to reasonably move without tilting them onto a wide dolly. After you have locked the piano down and wrapped it in blankets and tape, move the dolly to one end of the piano and, with the help of your crew, gently lean it back onto the dolly. As many people as possible should be at the dolly end of the piano, to support its weight as it tips back, and along the sides of the piano to keep it on an even keel. This is an especially important point to remember with large upright pianos, since they tend to be quite top-heavy. Don't let gravity  do any of your work for you; ease the piano gently using manpower from beginning to end."
                },
                {
                    "headline": "Move the piano.",
                    "description": "With your crew supporting the weight of the piano according to its center of gravity, lead it slowly by the dolly to its destination. If the piano is too high on the dolly to move through a doorway, it will have to be lifted and scooted slowly through the door a few inches at a time. Once it is through the doorway, be sure it is settled firmly on the dolly before continuing to move it. The proper way to lift any object is to squat, maintain a straight back, and lift with your legs. Be sure everyone who is helping you move knows to lift this way. If the piano feels out of balance at any time, yell “Stop!” and instruct everyone to gently set the piano down. Make any required adjustments to the position of the dolly or your crew and try again."
                }
            ]
        },
        {
            "name": "Moving a Grand Piano",
            "steps": [
                {
                    "headline": "Know your piano.",
                    "description": "A grand piano is long and low, which improves its sound over an upright but also causes it to take up a lot more floor space. For this reason, grand pianos are rarely seen in private homes. Grand pianos, like uprights, are divided by size into “petite” grand pianos, which can weigh as little as 500 pounds, on to standard grands, and finally “concert” grand pianos, the largest pianos of all, which can weigh as much as 1300 pounds and measure more than 9 feet (2.7 m) across. However, moving a grand piano of any size requires the same basic steps."
                },
                {
                    "headline": "Plan your route.",
                    "description": "As always, clearing the way and taking measurements are the first steps to a successful grand piano move. Because of the grand piano's bulk, it is generally moved on-end, so double check that any doors you plan to move your piano through are tall enough to accommodate its front-to-back length, with several inches to spare. If the piano is too deep to fit through a door with several inches of clearance to spare, professional help will be required."
                },
                {
                    "headline": "Prepare the piano.",
                    "description": "This is where moving a grand piano becomes much more complicated than moving an upright. The safest way to move a grand piano (and the way that professional movers do it) is to load it onto a rolling skid board, which is basically a load-bearing board on wheels. With as many people as possible on hand to assist you, lift the bass corner of the piano and unscrew or otherwise remove the leg there. Gently set the piano down and secure the removed leg in blankets; then, with the help of your crew, blanket and tape the body and remaining legs of the piano itself. Equipment rental shops should be able to rent you a skid board if you don't own one. Be sure that the top of the piano is securely locked down, as well as the keyboard cover."
                },
                {
                    "headline": "Move the piano.",
                    "description": "Carefully lift the piano from the back end upward, while simultaneously lifting the keyboard end off the ground as evenly as possible. Once the piano is balanced on the skid board, it can be moved by slowly pushing it from the rear end while pulling from the front end. Extra helpers should stand on either side of the piano to help keep it upright in case of bumps and wobbles. The goal is to set the piano vertically on the skid board with the left side (bass side) down on the board, so that the treble side of the piano points skyward and the keyboard is vertical. Remember that the piano gets heavier toward the bass end, which means the center of balance is likely to be closer to that end than the other."
                }
            ]
        },
        {
            "name": "Multistory Piano Moving Tips",
            "steps": [
                {
                    "headline": "Get professional help.",
                    "description": "By far the safest and surest way to move a piano up or down flights of stairs is by hiring professional piano movers. A piano's large size, incredible weight, and unclear center of gravity make it a dangerous item to move through vertical space for those who are not experts."
                },
                {
                    "headline": "Use whatever equipment you can get.",
                    "description": "Visit an equipment rental store and talk to a knowledgeable clerk there about the size and weight of your piano to help decide what setup will be best for your move. A piano dolly or furniture dolly with straps can help make a move up a flight of stairs much easier. Specially designed piano skids are also a sensible option."
                },
                {
                    "headline": "Learn about the staircase.",
                    "description": "Find out whatever information you can about its age, design, and composition. In some cases, a staircase may not be able to properly support a 700-pound piano and four or five grown movers all at once, in which case the move should be aborted. It is better to know ahead of time than risk causing severe property damage and possible injury."
                },
                {
                    "headline": "Support the low end.",
                    "description": "If, for whatever reason, you decide not to get professional assistance moving your piano up or down a building, remember that the downward-pointing end of the piano will carry even more of the piano's overall weight on a staircase than it does on flat ground. The majority of people helping you move the piano should be at the lower 50% of the piano at all times to help keep it stable. However, nobody should stand directly behind the piano without plenty of room to step aside, since one slip from another crew member could mean being crushed underneath its weight. Ensure that everyone can easily step to the side if control over the piano is lost."
                },
                {
                    "headline": "Move slowly.",
                    "description": "Even more so than during a flat move, taking regular breaks to readjust and catch your breath is vital during a staircase piano move. Plan to stop at each new step, gently set the piano down, reset your grip, and lift for the next step. By being slow and methodical, you will ensure a solid grip from beginning to end and minimize the risk of injury."
                },
                {
                    "headline": "Beware of landings.",
                    "description": "At each landing, even on skids or a special piano dolly, it is possible that the piano will have to be turned on-end or otherwise manipulated in order to turn the corner. A few strong and well-balanced people can make the turn. Just be sure that everyone has as much room as possible and is planted firmly on both feet."
                }
            ]
        }
    ],
    "tyn": [
        "Measuring tape",
        "Truck or trailer",
        "Thick furniture blankets",
        "Packaging tape",
        "Dolly or skid",
        "Work gloves",
        "Weightlifting belts",
        "Loading ramp",
        "Dolly straps",
        "Plenty of manpower"
    ],
    "text": " Moving a Spinet Piano Know your piano. The spinet piano is the smallest type of piano commonly seen in homes. Manufactured from the 1930s on through the end of the 20th century, a spinet piano's compact size is achieved by clever engineering of the key mechanisms inside. Spinet pianos are not very tall, topping out at about 3 feet (0.9 m) in height, and they are generally 58 inches (147.3 cm) long, the same as other types of upright piano. Despite their relatively small size, they usually weigh at least 300 pounds, making the job of moving them a team effort not to be undertaken lightly. Plan your route. Have a clear route from start to finish in mind before you begin to move the piano, and communicate it to everyone who is helping you move. Using a tape measure, ensure that the spinet will fit through every door or opening you plan to move it through. If the piano is being moved out of the house to a moving truck, have the truck open and any moving ramps deployed in advance of the move, and plan to move the piano before any other, lighter furniture so that there is plenty of room for your team to maneuver it into place. For safety reasons, one person per 100 pounds is recommended for this and all upright piano moves. This may work out to more people than are strictly needed, but extra personnel can help in other ways (such as opening doors), and can step in should somebody start to get worn out. Prepare the piano. Lock down the spinet's lid and the keyboard lid, if there is one. Wrap the piano in thick blankets or special moving blankets and use packing tape to secure the blankets around the piano. This will prevent scuffing on the finish and corners. Move the piano. A spinet's low profile makes for a relatively easy move. Using as much help as you deem necessary, have each person lift up a different part of the piano at the same time. Be sure that everyone is lifting from firmly underneath the body of the piano. In small, measured steps, walk the piano to its destination. Never move the piano more than a few feet without stopping to reset your grip. Moving a Studio or Large Upright Piano Know your piano. One the most common types of piano today is the upright piano. These pianos are both normally 58 inches (147.3 cm) wide, and despite their differences, both the full vertical and the smaller studio upright can be moved using essentially the same method. The smaller \"studio\" uprights usually weigh between 400 and 600 pounds. The monstrous \"full vertical\" or large upright piano can weigh as much as half a ton. A studio piano's center of gravity is also lower than a large upright's, as it is about 4 feet (1.2 m) tall as opposed to a large upright's roughly 5-foot height. Plan your route. Begin by clearing a path to your destination and measuring all entrances to ensure that the piano will fit through them. Have your moving truck open with the ramp deployed, if you are moving the piano onto the truck. Try to get one person per 100 pounds of estimated weight to help you move your piano. Ensure that every member of your piano moving grew is wearing rugged leather work gloves, and if at all possible, thick weightlifting support belts to help prevent back strain. Prepare the piano. Unlike a spinet, these larger upright piano models are too top-heavy and bulky to reasonably move without tilting them onto a wide dolly. After you have locked the piano down and wrapped it in blankets and tape, move the dolly to one end of the piano and, with the help of your crew, gently lean it back onto the dolly. As many people as possible should be at the dolly end of the piano, to support its weight as it tips back, and along the sides of the piano to keep it on an even keel. This is an especially important point to remember with large upright pianos, since they tend to be quite top-heavy. Don't let gravity  do any of your work for you; ease the piano gently using manpower from beginning to end. Move the piano. With your crew supporting the weight of the piano according to its center of gravity, lead it slowly by the dolly to its destination. If the piano is too high on the dolly to move through a doorway, it will have to be lifted and scooted slowly through the door a few inches at a time. Once it is through the doorway, be sure it is settled firmly on the dolly before continuing to move it. The proper way to lift any object is to squat, maintain a straight back, and lift with your legs. Be sure everyone who is helping you move knows to lift this way. If the piano feels out of balance at any time, yell “Stop!” and instruct everyone to gently set the piano down. Make any required adjustments to the position of the dolly or your crew and try again. Moving a Grand Piano Know your piano. A grand piano is long and low, which improves its sound over an upright but also causes it to take up a lot more floor space. For this reason, grand pianos are rarely seen in private homes. Grand pianos, like uprights, are divided by size into “petite” grand pianos, which can weigh as little as 500 pounds, on to standard grands, and finally “concert” grand pianos, the largest pianos of all, which can weigh as much as 1300 pounds and measure more than 9 feet (2.7 m) across. However, moving a grand piano of any size requires the same basic steps. Plan your route. As always, clearing the way and taking measurements are the first steps to a successful grand piano move. Because of the grand piano's bulk, it is generally moved on-end, so double check that any doors you plan to move your piano through are tall enough to accommodate its front-to-back length, with several inches to spare. If the piano is too deep to fit through a door with several inches of clearance to spare, professional help will be required. Prepare the piano. This is where moving a grand piano becomes much more complicated than moving an upright. The safest way to move a grand piano (and the way that professional movers do it) is to load it onto a rolling skid board, which is basically a load-bearing board on wheels. With as many people as possible on hand to assist you, lift the bass corner of the piano and unscrew or otherwise remove the leg there. Gently set the piano down and secure the removed leg in blankets; then, with the help of your crew, blanket and tape the body and remaining legs of the piano itself. Equipment rental shops should be able to rent you a skid board if you don't own one. Be sure that the top of the piano is securely locked down, as well as the keyboard cover. Move the piano. Carefully lift the piano from the back end upward, while simultaneously lifting the keyboard end off the ground as evenly as possible. Once the piano is balanced on the skid board, it can be moved by slowly pushing it from the rear end while pulling from the front end. Extra helpers should stand on either side of the piano to help keep it upright in case of bumps and wobbles. The goal is to set the piano vertically on the skid board with the left side (bass side) down on the board, so that the treble side of the piano points skyward and the keyboard is vertical. Remember that the piano gets heavier toward the bass end, which means the center of balance is likely to be closer to that end than the other. Multistory Piano Moving Tips Get professional help. By far the safest and surest way to move a piano up or down flights of stairs is by hiring professional piano movers. A piano's large size, incredible weight, and unclear center of gravity make it a dangerous item to move through vertical space for those who are not experts. Use whatever equipment you can get. Visit an equipment rental store and talk to a knowledgeable clerk there about the size and weight of your piano to help decide what setup will be best for your move. A piano dolly or furniture dolly with straps can help make a move up a flight of stairs much easier. Specially designed piano skids are also a sensible option. Learn about the staircase. Find out whatever information you can about its age, design, and composition. In some cases, a staircase may not be able to properly support a 700-pound piano and four or five grown movers all at once, in which case the move should be aborted. It is better to know ahead of time than risk causing severe property damage and possible injury. Support the low end. If, for whatever reason, you decide not to get professional assistance moving your piano up or down a building, remember that the downward-pointing end of the piano will carry even more of the piano's overall weight on a staircase than it does on flat ground. The majority of people helping you move the piano should be at the lower 50% of the piano at all times to help keep it stable. However, nobody should stand directly behind the piano without plenty of room to step aside, since one slip from another crew member could mean being crushed underneath its weight. Ensure that everyone can easily step to the side if control over the piano is lost. Move slowly. Even more so than during a flat move, taking regular breaks to readjust and catch your breath is vital during a staircase piano move. Plan to stop at each new step, gently set the piano down, reset your grip, and lift for the next step. By being slow and methodical, you will ensure a solid grip from beginning to end and minimize the risk of injury. Beware of landings. At each landing, even on skids or a special piano dolly, it is possible that the piano will have to be turned on-end or otherwise manipulated in order to turn the corner. A few strong and well-balanced people can make the turn. Just be sure that everyone has as much room as possible and is planted firmly on both feet.",
    "sentences": [
        " Moving a Spinet Piano Know your piano.",
        "The spinet piano is the smallest type of piano commonly seen in homes.",
        "Manufactured from the 1930s on through the end of the 20th century, a spinet piano's compact size is achieved by clever engineering of the key mechanisms inside.",
        "Spinet pianos are not very tall, topping out at about 3 feet (0.9 m) in height, and they are generally 58 inches (147.3 cm) long, the same as other types of upright piano.",
        "Despite their relatively small size, they usually weigh at least 300 pounds, making the job of moving them a team effort not to be undertaken lightly.",
        "Plan your route.",
        "Have a clear route from start to finish in mind before you begin to move the piano, and communicate it to everyone who is helping you move.",
        "Using a tape measure, ensure that the spinet will fit through every door or opening you plan to move it through.",
        "If the piano is being moved out of the house to a moving truck, have the truck open and any moving ramps deployed in advance of the move, and plan to move the piano before any other, lighter furniture so that there is plenty of room for your team to maneuver it into place.",
        "For safety reasons, one person per 100 pounds is recommended for this and all upright piano moves.",
        "This may work out to more people than are strictly needed, but extra personnel can help in other ways (such as opening doors), and can step in should somebody start to get worn out.",
        "Prepare the piano.",
        "Lock down the spinet's lid and the keyboard lid, if there is one.",
        "Wrap the piano in thick blankets or special moving blankets and use packing tape to secure the blankets around the piano.",
        "This will prevent scuffing on the finish and corners.",
        "Move the piano.",
        "A spinet's low profile makes for a relatively easy move.",
        "Using as much help as you deem necessary, have each person lift up a different part of the piano at the same time.",
        "Be sure that everyone is lifting from firmly underneath the body of the piano.",
        "In small, measured steps, walk the piano to its destination.",
        "Never move the piano more than a few feet without stopping to reset your grip.",
        "Moving a Studio or Large Upright Piano Know your piano.",
        "One the most common types of piano today is the upright piano.",
        "These pianos are both normally 58 inches (147.3 cm) wide, and despite their differences, both the full vertical and the smaller studio upright can be moved using essentially the same method.",
        "The smaller \"studio\" uprights usually weigh between 400 and 600 pounds.",
        "The monstrous \"full vertical\" or large upright piano can weigh as much as half a ton.",
        "A studio piano's center of gravity is also lower than a large upright's, as it is about 4 feet (1.2 m) tall as opposed to a large upright's roughly 5-foot height.",
        "Plan your route.",
        "Begin by clearing a path to your destination and measuring all entrances to ensure that the piano will fit through them.",
        "Have your moving truck open with the ramp deployed, if you are moving the piano onto the truck.",
        "Try to get one person per 100 pounds of estimated weight to help you move your piano.",
        "Ensure that every member of your piano moving grew is wearing rugged leather work gloves, and if at all possible, thick weightlifting support belts to help prevent back strain.",
        "Prepare the piano.",
        "Unlike a spinet, these larger upright piano models are too top-heavy and bulky to reasonably move without tilting them onto a wide dolly.",
        "After you have locked the piano down and wrapped it in blankets and tape, move the dolly to one end of the piano and, with the help of your crew, gently lean it back onto the dolly.",
        "As many people as possible should be at the dolly end of the piano, to support its weight as it tips back, and along the sides of the piano to keep it on an even keel.",
        "This is an especially important point to remember with large upright pianos, since they tend to be quite top-heavy.",
        "Don't let gravity  do any of your work for you; ease the piano gently using manpower from beginning to end.",
        "Move the piano.",
        "With your crew supporting the weight of the piano according to its center of gravity, lead it slowly by the dolly to its destination.",
        "If the piano is too high on the dolly to move through a doorway, it will have to be lifted and scooted slowly through the door a few inches at a time.",
        "Once it is through the doorway, be sure it is settled firmly on the dolly before continuing to move it.",
        "The proper way to lift any object is to squat, maintain a straight back, and lift with your legs.",
        "Be sure everyone who is helping you move knows to lift this way.",
        "If the piano feels out of balance at any time, yell “Stop!” and instruct everyone to gently set the piano down.",
        "Make any required adjustments to the position of the dolly or your crew and try again.",
        "Moving a Grand Piano Know your piano.",
        "A grand piano is long and low, which improves its sound over an upright but also causes it to take up a lot more floor space.",
        "For this reason, grand pianos are rarely seen in private homes.",
        "Grand pianos, like uprights, are divided by size into “petite” grand pianos, which can weigh as little as 500 pounds, on to standard grands, and finally “concert” grand pianos, the largest pianos of all, which can weigh as much as 1300 pounds and measure more than 9 feet (2.7 m) across.",
        "However, moving a grand piano of any size requires the same basic steps.",
        "Plan your route.",
        "As always, clearing the way and taking measurements are the first steps to a successful grand piano move.",
        "Because of the grand piano's bulk, it is generally moved on-end, so double check that any doors you plan to move your piano through are tall enough to accommodate its front-to-back length, with several inches to spare.",
        "If the piano is too deep to fit through a door with several inches of clearance to spare, professional help will be required.",
        "Prepare the piano.",
        "This is where moving a grand piano becomes much more complicated than moving an upright.",
        "The safest way to move a grand piano (and the way that professional movers do it) is to load it onto a rolling skid board, which is basically a load-bearing board on wheels.",
        "With as many people as possible on hand to assist you, lift the bass corner of the piano and unscrew or otherwise remove the leg there.",
        "Gently set the piano down and secure the removed leg in blankets; then, with the help of your crew, blanket and tape the body and remaining legs of the piano itself.",
        "Equipment rental shops should be able to rent you a skid board if you don't own one.",
        "Be sure that the top of the piano is securely locked down, as well as the keyboard cover.",
        "Move the piano.",
        "Carefully lift the piano from the back end upward, while simultaneously lifting the keyboard end off the ground as evenly as possible.",
        "Once the piano is balanced on the skid board, it can be moved by slowly pushing it from the rear end while pulling from the front end.",
        "Extra helpers should stand on either side of the piano to help keep it upright in case of bumps and wobbles.",
        "The goal is to set the piano vertically on the skid board with the left side (bass side) down on the board, so that the treble side of the piano points skyward and the keyboard is vertical.",
        "Remember that the piano gets heavier toward the bass end, which means the center of balance is likely to be closer to that end than the other.",
        "Multistory Piano Moving Tips Get professional help.",
        "By far the safest and surest way to move a piano up or down flights of stairs is by hiring professional piano movers.",
        "A piano's large size, incredible weight, and unclear center of gravity make it a dangerous item to move through vertical space for those who are not experts.",
        "Use whatever equipment you can get.",
        "Visit an equipment rental store and talk to a knowledgeable clerk there about the size and weight of your piano to help decide what setup will be best for your move.",
        "A piano dolly or furniture dolly with straps can help make a move up a flight of stairs much easier.",
        "Specially designed piano skids are also a sensible option.",
        "Learn about the staircase.",
        "Find out whatever information you can about its age, design, and composition.",
        "In some cases, a staircase may not be able to properly support a 700-pound piano and four or five grown movers all at once, in which case the move should be aborted.",
        "It is better to know ahead of time than risk causing severe property damage and possible injury.",
        "Support the low end.",
        "If, for whatever reason, you decide not to get professional assistance moving your piano up or down a building, remember that the downward-pointing end of the piano will carry even more of the piano's overall weight on a staircase than it does on flat ground.",
        "The majority of people helping you move the piano should be at the lower 50% of the piano at all times to help keep it stable.",
        "However, nobody should stand directly behind the piano without plenty of room to step aside, since one slip from another crew member could mean being crushed underneath its weight.",
        "Ensure that everyone can easily step to the side if control over the piano is lost.",
        "Move slowly.",
        "Even more so than during a flat move, taking regular breaks to readjust and catch your breath is vital during a staircase piano move.",
        "Plan to stop at each new step, gently set the piano down, reset your grip, and lift for the next step.",
        "By being slow and methodical, you will ensure a solid grip from beginning to end and minimize the risk of injury.",
        "Beware of landings.",
        "At each landing, even on skids or a special piano dolly, it is possible that the piano will have to be turned on-end or otherwise manipulated in order to turn the corner.",
        "A few strong and well-balanced people can make the turn.",
        "Just be sure that everyone has as much room as possible and is planted firmly on both feet."
    ]
}