{
    "title": "How to Find an Address from the Latitude and Longitude",
    "url": "https://www.wikihow.com/Find-an-Address-from-the-Latitude-and-Longitude",
    "category_hierarchy": [
        "Travel",
        "Navigation and Directions",
        "Maps"
    ],
    "methods": [
        {
            "name": "Using a Reverse Geocoding Tool",
            "steps": [
                {
                    "headline": "Choose a geocoding tool to find the most accurate address possible.",
                    "description": "A geocoding tool is a digital program or code that converts addresses to GPS coordinates. A reverse geocoding tool does the opposite and finds the nearest address for a given set of coordinates. Find a geocoding tool online to get the most accurate address based on your longitude and latitude. Some popular reverse geocoding tools include:\nLatLong: https://www.latlong.net/\n\nTexas A&M’s Geoservices department: https://geoservices.tamu.edu/Services/ReverseGeocoding/Interactive/\n\nGPS-Coordinates: https://www.gps-coordinates.net/"
                },
                {
                    "headline": "Enter your longitude and latitude in the corresponding forms.",
                    "description": "There are 2 boxes, 1 for each coordinate that you’re entering. In your longitude box, enter the east/west coordinate. In the latitude box, enter the north/south coordinate. Include all minutes and seconds to get the most accurate results possible.Tip: If you’re unsure which coordinate you have is longitude and which coordinate is latitude, the first number listed before the comma is always the latitude. Coordinates are listed in degrees, minutes, and seconds. So a coordinate of 44° 56’ 9.816\" S reads as 44 degrees, 56 minutes, and 9.816 seconds. Occasionally, western and southern coordinates will use a minus sign (-) instead of a cardinal direction. You may come across coordinates that list the degree and gives the minutes and seconds as a decimal. Type your coordinates in using whatever format you have in front of you."
                },
                {
                    "headline": "Press the search button to pull up your address.",
                    "description": "Once you’ve entered both of your coordinates, press the \"Search\" button to retrieve your address. The address will pop up once the geocoding tool retrieves the appropriate location. Reverse geocaching tools typically include a map as well. This makes it easy to visualize the address. Programmers often use reverse geocaching tools to ensure that their website’s map function is accurate and up-to-date."
                }
            ]
        },
        {
            "name": "Finding an Address with Google Maps",
            "steps": [
                {
                    "headline": "Open Google Maps on your phone or computer.",
                    "description": "Google Maps is an easy way to pull up coordinates if you want to use a familiar program to find your address. You can use longitude and latitude to find an address on Google Maps from your phone, tablet, or computer. Visit the website or open the app to start looking for your address. You can visit Google Maps online at https://www.google.com/maps. They also have a dedicated Google Maps app for Android and iPhone."
                },
                {
                    "headline": "Enter the coordinates, listing the latitude first.",
                    "description": "Start by typing in your latitude. Then, put a comma after the latitude and enter your longitude. You can enter the coordinates using the degrees, or substitute a south or west reading with a minus sign (-). You can also use a space to replace the degree symbol and list the seconds as a decimal. Include the minutes and seconds if you want to get an accurate location. If you don’t, Google will pull up an approximate address in the area.Tip: For example, you can type 44° 56’ 9.816\" S, 116° 32’ 8.192\" E or you can enter -44 56.9816, 116 32.8192. Alternatively, you can list each coordinate as a decimal with the degree in the front. This would turn 44° 56’ 9.816\" S into 44.569816."
                },
                {
                    "headline": "Press the “Search” button or “Enter” to pull up the coordinates.",
                    "description": "Once you’ve entered your coordinates, click the “Search” button with your finger or cursor. You can also hit “Enter” on a keyboard to initiate the search. Give Google 2-10 seconds to retrieve your position. The more accurate your coordinates are, the longer Google will take to process the search. This is a fair compromise for an accurate search, though!"
                },
                {
                    "headline": "Click on the location and press “What’s Here” to find the address.",
                    "description": "On a computer, the address for your location will not be listed immediately. Right click or press “Control” and left click on the location to pull up the context menu. Hover your cursor over the option that says “What’s Here?” and click it to pull up the address. The address will be automatically listed at the bottom of your screen. On a PC, right click to pull up the context menu. On an Apple computer, press the Control key (Ctrl on the keyboard)."
                },
                {
                    "headline": "Hold your finger down to pull up the address on your phone.",
                    "description": "On the Google Maps app, you can’t pull up a context menu. To find the address for your coordinates, hold your finger down over the red pin that shows your coordinates. Then, after 1-3 seconds, the address will pop up on the bottom of your screen. Google will also include the name of any business or landmark that is at your address."
                }
            ]
        },
        {
            "name": "Getting an Approximate Address",
            "steps": [
                {
                    "headline": "Find a map that contains longitude and latitude lines.",
                    "description": "Many standard maps don’t list the longitude or latitude, so start by finding a map that lists the longitude and latitude on a vertical and horizontal grid. This type of map has latitude and longitude guidelines with numbers listed around the outside of the map to provide a key. Get one of these maps to find an approximate address using longitude and latitude. Topographical and geographical maps always list longitude and latitude. These coordinates are also often overlaid on a globe or world map. Longitude and latitude coordinates are so accurate that you cannot find an exact address without using a geocoding tool or digital map. The human eye and a standard map don’t have the level of magnification and accuracy needed to manually get an address out of GPS coordinates. Pull up a list of geographical and topographical maps at https://www.usgs.gov/products/maps/topo-maps."
                },
                {
                    "headline": "Track the latitude by using the Equator to go north or south.",
                    "description": "Latitude refers to a location’s position in reference to the Equator, and it is used to determine how far north or south a location is. The equator is 0°, with the North Pole at 90° N and the South Pole at 90° S. Use the scale on the side of the map to determine how far north or south your latitude is. Start at the Equator, and work your way up or down the horizontal lines on the map until you’ve found the corresponding location on the side of the scale.Tip: Longitude and latitude are usually listed in degrees (°) with a cardinal direction (north, south, east, or west). Sometimes, the coordinates will be given in time. These coordinates replace south and west with a minus (-) in the front of them. On a world map, the guidelines often represent 15° each, so the first guideline above the equator is 15° N, and the second guideline is 30° N. So if your latitude is given as 44° 56’ 9.816‘‘ S, start at the Equator and move down 3 horizontal lines to reach 45° S. Your latitude will be just above this line. Keep in mind, your scale may be different and each line may represent increments of 5, 10, or 30 degrees."
                },
                {
                    "headline": "Use the Prime Meridian to find the longitude going east or west.",
                    "description": "Once you know how far north or south your location is, move to the Prime Meridian, which is the vertical line that runs through Africa and England. This is 0° longitude. Longitude runs in 180 degrees in either direction going east or west. Start at the Prime Meridian and move left or right based on your map’s scale until you’ve located your approximate location. For example, if your longitude is given as 116° 32’ 8.192\" E, and your scale lists every guideline as 10 degrees, start at the Prime Meridian and move 11 lines to the right to reach 110° E. Then, move halfway to the middle of the 2 guidelines and slightly to the right to get near 116°."
                },
                {
                    "headline": "Adjust your location 70 mi (110 km) for every 1 degree.",
                    "description": "For a more accurate approximation, use the map’s scale to determine the distance between your guidelines. Look for a bar at the bottom of the map where it lists the length of each mile or kilometer. Measure this line using a ruler. Then, measure the distance between guidelines to determine how wide and tall each box on your grid is. Adjust your location by moving 70 mi (110 km) for every 1 degree in your coordinate. For example, if 100 miles (160 km) is 1 in (2.5 cm) on your ruler, you know that each 1/16 of an inch is the equivalent of 6.25 miles (10.06 km) and every 1 mm is equal to 1 mile (1.6 km). If you’re trying to reach 44° 56’ 9.816\" S and you’re at the guideline for 45°, you know that you need to move up 11.2 hash marks on your ruler if you’re using inches and 70 mm if you’re using the centimeter side."
                },
                {
                    "headline": "Move 1.15 mi (1.85 km) for every 1 minute in your coordinate.",
                    "description": "To make minor adjustments to your location, include the minutes listed after the degrees in your calculation. For example, 44° 56’ lists 56 in the minutes position. Multiply 56 by 1.15 mi (1.85 km) to determine how many miles or kilometers you need to add. For 44° 56’, this corresponds to 64.4 miles (10,360,000 cm). If 100 miles (160 km) is 1 in (2.5 cm), then move 0.64 in (1.6 cm) based on the coordinate’s cardinal direction. You can only do this if you have a map with a smaller scale. You can get even more accurate by adding 80 feet (24 m) for every 1 second. This can be nearly impossible to get right without a highly-magnified map, though."
                },
                {
                    "headline": "Reference a standard map to find your approximate address.",
                    "description": "Once you have the physical location of your coordinates located, swap to a map that lists street addresses. Transfer your location to the second map to find the physical address that corresponds with your longitude and latitude. If you’re doing this without the help of a geocoding tool, you’re going to probably be off a few miles or kilometers. This method works best for finding approximate addresses of coordinates."
                }
            ]
        }
    ],
    "tyn": [
        "Getting an Approximate Address",
        "Ruler",
        "Map"
    ],
    "text": " Using a Reverse Geocoding Tool Choose a geocoding tool to find the most accurate address possible. A geocoding tool is a digital program or code that converts addresses to GPS coordinates. A reverse geocoding tool does the opposite and finds the nearest address for a given set of coordinates. Find a geocoding tool online to get the most accurate address based on your longitude and latitude. Some popular reverse geocoding tools include:\nLatLong: https://www.latlong.net/\n\nTexas A&M’s Geoservices department: https://geoservices.tamu.edu/Services/ReverseGeocoding/Interactive/\n\nGPS-Coordinates: https://www.gps-coordinates.net/ Enter your longitude and latitude in the corresponding forms. There are 2 boxes, 1 for each coordinate that you’re entering. In your longitude box, enter the east/west coordinate. In the latitude box, enter the north/south coordinate. Include all minutes and seconds to get the most accurate results possible.Tip: If you’re unsure which coordinate you have is longitude and which coordinate is latitude, the first number listed before the comma is always the latitude. Coordinates are listed in degrees, minutes, and seconds. So a coordinate of 44° 56’ 9.816\" S reads as 44 degrees, 56 minutes, and 9.816 seconds. Occasionally, western and southern coordinates will use a minus sign (-) instead of a cardinal direction. You may come across coordinates that list the degree and gives the minutes and seconds as a decimal. Type your coordinates in using whatever format you have in front of you. Press the search button to pull up your address. Once you’ve entered both of your coordinates, press the \"Search\" button to retrieve your address. The address will pop up once the geocoding tool retrieves the appropriate location. Reverse geocaching tools typically include a map as well. This makes it easy to visualize the address. Programmers often use reverse geocaching tools to ensure that their website’s map function is accurate and up-to-date. Finding an Address with Google Maps Open Google Maps on your phone or computer. Google Maps is an easy way to pull up coordinates if you want to use a familiar program to find your address. You can use longitude and latitude to find an address on Google Maps from your phone, tablet, or computer. Visit the website or open the app to start looking for your address. You can visit Google Maps online at https://www.google.com/maps. They also have a dedicated Google Maps app for Android and iPhone. Enter the coordinates, listing the latitude first. Start by typing in your latitude. Then, put a comma after the latitude and enter your longitude. You can enter the coordinates using the degrees, or substitute a south or west reading with a minus sign (-). You can also use a space to replace the degree symbol and list the seconds as a decimal. Include the minutes and seconds if you want to get an accurate location. If you don’t, Google will pull up an approximate address in the area.Tip: For example, you can type 44° 56’ 9.816\" S, 116° 32’ 8.192\" E or you can enter -44 56.9816, 116 32.8192. Alternatively, you can list each coordinate as a decimal with the degree in the front. This would turn 44° 56’ 9.816\" S into 44.569816. Press the “Search” button or “Enter” to pull up the coordinates. Once you’ve entered your coordinates, click the “Search” button with your finger or cursor. You can also hit “Enter” on a keyboard to initiate the search. Give Google 2-10 seconds to retrieve your position. The more accurate your coordinates are, the longer Google will take to process the search. This is a fair compromise for an accurate search, though! Click on the location and press “What’s Here” to find the address. On a computer, the address for your location will not be listed immediately. Right click or press “Control” and left click on the location to pull up the context menu. Hover your cursor over the option that says “What’s Here?” and click it to pull up the address. The address will be automatically listed at the bottom of your screen. On a PC, right click to pull up the context menu. On an Apple computer, press the Control key (Ctrl on the keyboard). Hold your finger down to pull up the address on your phone. On the Google Maps app, you can’t pull up a context menu. To find the address for your coordinates, hold your finger down over the red pin that shows your coordinates. Then, after 1-3 seconds, the address will pop up on the bottom of your screen. Google will also include the name of any business or landmark that is at your address. Getting an Approximate Address Find a map that contains longitude and latitude lines. Many standard maps don’t list the longitude or latitude, so start by finding a map that lists the longitude and latitude on a vertical and horizontal grid. This type of map has latitude and longitude guidelines with numbers listed around the outside of the map to provide a key. Get one of these maps to find an approximate address using longitude and latitude. Topographical and geographical maps always list longitude and latitude. These coordinates are also often overlaid on a globe or world map. Longitude and latitude coordinates are so accurate that you cannot find an exact address without using a geocoding tool or digital map. The human eye and a standard map don’t have the level of magnification and accuracy needed to manually get an address out of GPS coordinates. Pull up a list of geographical and topographical maps at https://www.usgs.gov/products/maps/topo-maps. Track the latitude by using the Equator to go north or south. Latitude refers to a location’s position in reference to the Equator, and it is used to determine how far north or south a location is. The equator is 0°, with the North Pole at 90° N and the South Pole at 90° S. Use the scale on the side of the map to determine how far north or south your latitude is. Start at the Equator, and work your way up or down the horizontal lines on the map until you’ve found the corresponding location on the side of the scale.Tip: Longitude and latitude are usually listed in degrees (°) with a cardinal direction (north, south, east, or west). Sometimes, the coordinates will be given in time. These coordinates replace south and west with a minus (-) in the front of them. On a world map, the guidelines often represent 15° each, so the first guideline above the equator is 15° N, and the second guideline is 30° N. So if your latitude is given as 44° 56’ 9.816‘‘ S, start at the Equator and move down 3 horizontal lines to reach 45° S. Your latitude will be just above this line. Keep in mind, your scale may be different and each line may represent increments of 5, 10, or 30 degrees. Use the Prime Meridian to find the longitude going east or west. Once you know how far north or south your location is, move to the Prime Meridian, which is the vertical line that runs through Africa and England. This is 0° longitude. Longitude runs in 180 degrees in either direction going east or west. Start at the Prime Meridian and move left or right based on your map’s scale until you’ve located your approximate location. For example, if your longitude is given as 116° 32’ 8.192\" E, and your scale lists every guideline as 10 degrees, start at the Prime Meridian and move 11 lines to the right to reach 110° E. Then, move halfway to the middle of the 2 guidelines and slightly to the right to get near 116°. Adjust your location 70 mi (110 km) for every 1 degree. For a more accurate approximation, use the map’s scale to determine the distance between your guidelines. Look for a bar at the bottom of the map where it lists the length of each mile or kilometer. Measure this line using a ruler. Then, measure the distance between guidelines to determine how wide and tall each box on your grid is. Adjust your location by moving 70 mi (110 km) for every 1 degree in your coordinate. For example, if 100 miles (160 km) is 1 in (2.5 cm) on your ruler, you know that each 1/16 of an inch is the equivalent of 6.25 miles (10.06 km) and every 1 mm is equal to 1 mile (1.6 km). If you’re trying to reach 44° 56’ 9.816\" S and you’re at the guideline for 45°, you know that you need to move up 11.2 hash marks on your ruler if you’re using inches and 70 mm if you’re using the centimeter side. Move 1.15 mi (1.85 km) for every 1 minute in your coordinate. To make minor adjustments to your location, include the minutes listed after the degrees in your calculation. For example, 44° 56’ lists 56 in the minutes position. Multiply 56 by 1.15 mi (1.85 km) to determine how many miles or kilometers you need to add. For 44° 56’, this corresponds to 64.4 miles (10,360,000 cm). If 100 miles (160 km) is 1 in (2.5 cm), then move 0.64 in (1.6 cm) based on the coordinate’s cardinal direction. You can only do this if you have a map with a smaller scale. You can get even more accurate by adding 80 feet (24 m) for every 1 second. This can be nearly impossible to get right without a highly-magnified map, though. Reference a standard map to find your approximate address. Once you have the physical location of your coordinates located, swap to a map that lists street addresses. Transfer your location to the second map to find the physical address that corresponds with your longitude and latitude. If you’re doing this without the help of a geocoding tool, you’re going to probably be off a few miles or kilometers. This method works best for finding approximate addresses of coordinates.",
    "sentences": [
        " Using a Reverse Geocoding Tool Choose a geocoding tool to find the most accurate address possible.",
        "A geocoding tool is a digital program or code that converts addresses to GPS coordinates.",
        "A reverse geocoding tool does the opposite and finds the nearest address for a given set of coordinates.",
        "Find a geocoding tool online to get the most accurate address based on your longitude and latitude.",
        "Some popular reverse geocoding tools include:\nLatLong: https://www.latlong.net/\n\nTexas A&M’s Geoservices department: https://geoservices.tamu.edu/Services/ReverseGeocoding/Interactive/\n\nGPS-Coordinates: https://www.gps-coordinates.net/ Enter your longitude and latitude in the corresponding forms.",
        "There are 2 boxes, 1 for each coordinate that you’re entering.",
        "In your longitude box, enter the east/west coordinate.",
        "In the latitude box, enter the north/south coordinate.",
        "Include all minutes and seconds to get the most accurate results possible.Tip: If you’re unsure which coordinate you have is longitude and which coordinate is latitude, the first number listed before the comma is always the latitude.",
        "Coordinates are listed in degrees, minutes, and seconds.",
        "So a coordinate of 44° 56’ 9.816\" S reads as 44 degrees, 56 minutes, and 9.816 seconds.",
        "Occasionally, western and southern coordinates will use a minus sign (-) instead of a cardinal direction.",
        "You may come across coordinates that list the degree and gives the minutes and seconds as a decimal.",
        "Type your coordinates in using whatever format you have in front of you.",
        "Press the search button to pull up your address.",
        "Once you’ve entered both of your coordinates, press the \"Search\" button to retrieve your address.",
        "The address will pop up once the geocoding tool retrieves the appropriate location.",
        "Reverse geocaching tools typically include a map as well.",
        "This makes it easy to visualize the address.",
        "Programmers often use reverse geocaching tools to ensure that their website’s map function is accurate and up-to-date.",
        "Finding an Address with Google Maps Open Google Maps on your phone or computer.",
        "Google Maps is an easy way to pull up coordinates if you want to use a familiar program to find your address.",
        "You can use longitude and latitude to find an address on Google Maps from your phone, tablet, or computer.",
        "Visit the website or open the app to start looking for your address.",
        "You can visit Google Maps online at https://www.google.com/maps.",
        "They also have a dedicated Google Maps app for Android and iPhone.",
        "Enter the coordinates, listing the latitude first.",
        "Start by typing in your latitude.",
        "Then, put a comma after the latitude and enter your longitude.",
        "You can enter the coordinates using the degrees, or substitute a south or west reading with a minus sign (-).",
        "You can also use a space to replace the degree symbol and list the seconds as a decimal.",
        "Include the minutes and seconds if you want to get an accurate location.",
        "If you don’t, Google will pull up an approximate address in the area.Tip: For example, you can type 44° 56’ 9.816\" S, 116° 32’ 8.192\" E or you can enter -44 56.9816, 116 32.8192.",
        "Alternatively, you can list each coordinate as a decimal with the degree in the front.",
        "This would turn 44° 56’ 9.816\" S into 44.569816.",
        "Press the “Search” button or “Enter” to pull up the coordinates.",
        "Once you’ve entered your coordinates, click the “Search” button with your finger or cursor.",
        "You can also hit “Enter” on a keyboard to initiate the search.",
        "Give Google 2-10 seconds to retrieve your position.",
        "The more accurate your coordinates are, the longer Google will take to process the search.",
        "This is a fair compromise for an accurate search, though!",
        "Click on the location and press “What’s Here” to find the address.",
        "On a computer, the address for your location will not be listed immediately.",
        "Right click or press “Control” and left click on the location to pull up the context menu.",
        "Hover your cursor over the option that says “What’s Here?” and click it to pull up the address.",
        "The address will be automatically listed at the bottom of your screen.",
        "On a PC, right click to pull up the context menu.",
        "On an Apple computer, press the Control key (Ctrl on the keyboard).",
        "Hold your finger down to pull up the address on your phone.",
        "On the Google Maps app, you can’t pull up a context menu.",
        "To find the address for your coordinates, hold your finger down over the red pin that shows your coordinates.",
        "Then, after 1-3 seconds, the address will pop up on the bottom of your screen.",
        "Google will also include the name of any business or landmark that is at your address.",
        "Getting an Approximate Address Find a map that contains longitude and latitude lines.",
        "Many standard maps don’t list the longitude or latitude, so start by finding a map that lists the longitude and latitude on a vertical and horizontal grid.",
        "This type of map has latitude and longitude guidelines with numbers listed around the outside of the map to provide a key.",
        "Get one of these maps to find an approximate address using longitude and latitude.",
        "Topographical and geographical maps always list longitude and latitude.",
        "These coordinates are also often overlaid on a globe or world map.",
        "Longitude and latitude coordinates are so accurate that you cannot find an exact address without using a geocoding tool or digital map.",
        "The human eye and a standard map don’t have the level of magnification and accuracy needed to manually get an address out of GPS coordinates.",
        "Pull up a list of geographical and topographical maps at https://www.usgs.gov/products/maps/topo-maps.",
        "Track the latitude by using the Equator to go north or south.",
        "Latitude refers to a location’s position in reference to the Equator, and it is used to determine how far north or south a location is.",
        "The equator is 0°, with the North Pole at 90° N and the South Pole at 90° S. Use the scale on the side of the map to determine how far north or south your latitude is.",
        "Start at the Equator, and work your way up or down the horizontal lines on the map until you’ve found the corresponding location on the side of the scale.Tip: Longitude and latitude are usually listed in degrees (°) with a cardinal direction (north, south, east, or west).",
        "Sometimes, the coordinates will be given in time.",
        "These coordinates replace south and west with a minus (-) in the front of them.",
        "On a world map, the guidelines often represent 15° each, so the first guideline above the equator is 15° N, and the second guideline is 30° N. So if your latitude is given as 44° 56’ 9.816‘‘ S, start at the Equator and move down 3 horizontal lines to reach 45° S. Your latitude will be just above this line.",
        "Keep in mind, your scale may be different and each line may represent increments of 5, 10, or 30 degrees.",
        "Use the Prime Meridian to find the longitude going east or west.",
        "Once you know how far north or south your location is, move to the Prime Meridian, which is the vertical line that runs through Africa and England.",
        "This is 0° longitude.",
        "Longitude runs in 180 degrees in either direction going east or west.",
        "Start at the Prime Meridian and move left or right based on your map’s scale until you’ve located your approximate location.",
        "For example, if your longitude is given as 116° 32’ 8.192\" E, and your scale lists every guideline as 10 degrees, start at the Prime Meridian and move 11 lines to the right to reach 110° E. Then, move halfway to the middle of the 2 guidelines and slightly to the right to get near 116°.",
        "Adjust your location 70 mi (110 km) for every 1 degree.",
        "For a more accurate approximation, use the map’s scale to determine the distance between your guidelines.",
        "Look for a bar at the bottom of the map where it lists the length of each mile or kilometer.",
        "Measure this line using a ruler.",
        "Then, measure the distance between guidelines to determine how wide and tall each box on your grid is.",
        "Adjust your location by moving 70 mi (110 km) for every 1 degree in your coordinate.",
        "For example, if 100 miles (160 km) is 1 in (2.5 cm) on your ruler, you know that each 1/16 of an inch is the equivalent of 6.25 miles (10.06 km) and every 1 mm is equal to 1 mile (1.6 km).",
        "If you’re trying to reach 44° 56’ 9.816\" S and you’re at the guideline for 45°, you know that you need to move up 11.2 hash marks on your ruler if you’re using inches and 70 mm if you’re using the centimeter side.",
        "Move 1.15 mi (1.85 km) for every 1 minute in your coordinate.",
        "To make minor adjustments to your location, include the minutes listed after the degrees in your calculation.",
        "For example, 44° 56’ lists 56 in the minutes position.",
        "Multiply 56 by 1.15 mi (1.85 km) to determine how many miles or kilometers you need to add.",
        "For 44° 56’, this corresponds to 64.4 miles (10,360,000 cm).",
        "If 100 miles (160 km) is 1 in (2.5 cm), then move 0.64 in (1.6 cm) based on the coordinate’s cardinal direction.",
        "You can only do this if you have a map with a smaller scale.",
        "You can get even more accurate by adding 80 feet (24 m) for every 1 second.",
        "This can be nearly impossible to get right without a highly-magnified map, though.",
        "Reference a standard map to find your approximate address.",
        "Once you have the physical location of your coordinates located, swap to a map that lists street addresses.",
        "Transfer your location to the second map to find the physical address that corresponds with your longitude and latitude.",
        "If you’re doing this without the help of a geocoding tool, you’re going to probably be off a few miles or kilometers.",
        "This method works best for finding approximate addresses of coordinates."
    ]
}