{
    "title": "How to Take Herbalife",
    "url": "https://www.wikihow.com/Take-Herbalife",
    "category_hierarchy": [
        "Health",
        "Nutrition and Food Health",
        "Dietary Nutrients",
        "Dietary Supplements"
    ],
    "methods": [
        {
            "name": "Choosing the Right Product",
            "steps": [
                {
                    "headline": "Use Formula 1 to replace your meals.",
                    "description": "Mix Formula 1 shake powder with milk to add fiber, protein, antioxidants, vitamins, and minerals to your diet. Opt to prepare these shakes around breakfast, lunch, and dinner, or whenever you feel especially hungry. This is the only Formula ingredient you need to make nutritional shakes. If you have any serious medical conditions, talk to your doctor before switching to Herbalife products. Did you know? Herbalife shakes come in different powder flavors. Currently, mint chocolate, orange cream, cafe latte, cookies ‘n cream, dulce de leche, Dutch chocolate, piña colada, wild berry, French vanilla, and banana caramel are available for purchase. If you’d prefer ingredients without genetically modified ingredients, there are 2 vanilla variations that you can choose from."
                },
                {
                    "headline": "Try boosting your cells and immune system with Formulas 2 and 3.",
                    "description": "Take 2 Multivitamin Complex Formula 2 pills, which contain lots of Vitamin A, E, calcium, folic acid, and iron. Additionally, take 2 cell activating Formula 3 capsules to boost antioxidant activity in your body. Don’t add these to every meal—instead, only take 1 dose per day, as recommended on each bottle. Formula 2 vitamins contain a lot of nutrients that benefit your skin, hair, and nails. Formula 3 capsules include aloe vera, which aid your cells in absorbing micronutrients. While you don’t need to take Formulas 2 and 3 with your Formula 1 shakes, they help complete the full diet program created by Herbalife."
                },
                {
                    "headline": "Boost your metabolism with Herbal Tea Concentrate.",
                    "description": "Add ½ tsp (1.7 g) of tea concentrate powder into a  6 to 12 fluid ounces (180 to 350 mL) glass of water. Stir in the powder to get a boost in your metabolism as well as your antioxidants. If you’d prefer a quicker addition to your diet, take 1-2 Total Control tablets to help your metabolism along. Both of these products contain caffeine, and are designed to help wake you up. Read the Total Control bottle label to see what your recommended serving size is. The Herbal Tea Concentrate comes in several flavors, including lemon, original, raspberry, and peach."
                },
                {
                    "headline": "Pick Herbal Aloe Concentration as a refreshing drink alternative.",
                    "description": "Pour yourself a 6 to 12 fluid ounces (180 to 350 mL) glass of Herbal Aloe Concentrate. Drink this once a day or on an as-needed basis to relax your stomach and get rid of blatant indigestion. You can get this drink in a 1 gallon (3.8 L) size, or in a 14 fluid ounces (410 mL) size. This product is also available in powder form. Follow the instructions on the bottle to use the correct dosage."
                },
                {
                    "headline": "Add fiber, electrolyte, and enzyme products to your diet as a supplement.",
                    "description": "Look into Herbalife’s Aminogen, Cell-U-Loss, Thermo-Bond, and Snack Defense pills to add good enzymes, fiber, electrolyte balance, and chromium to your diet. Take 2 pills of Snack Defense or Aminogen with the beverage of your choice. When taking Cell-U-Loss or Thermo-Bond, swallow 1 pill with water or another drink. Read the label on the bottle for more specific dosage instructions."
                },
                {
                    "headline": "Go for Herbalife snacks if you’re always on the go.",
                    "description": "Pack a protein bar or package of roasted soy nuts for source of energy and protein on-the-go. When snacking on a Protein Bar Deluxe, choose between chocolate peanut, vanilla almond, and citrus lemon flavors. Generic Herbalife protein bars only come in chocolate coconut flavor. Roasted soy nuts are only packaged in chile lime flavor."
                },
                {
                    "headline": "Opt for Herbalife probiotic powder to balance your GI tract.",
                    "description": "Mix 1 scoop of probiotic powder into your food or beverage to improve the health of your digestive system. Don’t worry about refrigerating this product—unlike probiotic yogurts and other products, it’s fine if you leave the powder out. Probiotic powder doesn’t add any calories to your food or drink. Each scoop of powder adds 1 billion active probiotic cultures into your GI tract."
                }
            ]
        },
        {
            "name": "Creating a Shake with Formula 1 Powder",
            "steps": [
                {
                    "headline": "Use 8 fluid ounces (240 mL) of dairy or soy as a liquid base.",
                    "description": "Pour a small amount of skim milk or soy milk into a blender container, or into a liquid measuring cup. Add this liquid in before any powdery or solid ingredients, as it will serve as the base for your shake. Avoid using whole or partially fatty milk for your recipe, as this will make the shake less healthy. You can also use water instead of milk, if you’d prefer a less creamy base. Read the instructions on your powder canister. Some shake flavors might taste better with a milk base (e.g., cookies ‘n cream, Dutch chocolate), while others might taste better with a water base (e.g., wild berry)."
                },
                {
                    "headline": "Pour in 2 scoops of Formula 1 shake powder.",
                    "description": "Take the scoop that came with the powder canister to dump the powder over the milk. Try to mix all of the ingredients in a blender container, as this will help streamline the process. You can use the scoop provided with the bottle to create an exact measurement."
                },
                {
                    "headline": "Incorporate other supplement powders to boost your shake.",
                    "description": "Add in any powdered ingredient that benefits your current dietary needs. If you’re trying to boost your GI health, add in 1 scoop of probiotic powder. If you’d prefer to lower your body’s calorie intake, dump in a spoonful of Herbalife’s Prolessa Duo powder. Before adding more than 1 nutritional supplement, check each bottle to see if multiple nutrient/supplement powders can be combined in a shake. Only use 1 dose of these powders per day."
                },
                {
                    "headline": "Add frozen produce to give your shake more nutrients.",
                    "description": "Take 2-3 small pieces of fruit, like strawberries or peach slices, and add them into your smoothie mixture. Don’t put too many pieces of fruit in, as this could affect the flavor ratio in the smoothie. You can also add vegetables without a lot of natural flavor to the smoothie, like kale leaves. If you’re adding in a smaller fruit, like blueberries or raspberries, try tossing a small handful of the fruit into the shake mix. Ice cubes also work as a cold addition."
                },
                {
                    "headline": "Blend the ingredients at a low speed for 2-4 minutes.",
                    "description": "Place the top on your blender and check that it’s secure. Next, press the “blend” button, selecting a lower speed, if possible. To make your meal shake especially thick, leave the blender on for several minutes, which allows the mixture to thicken. If you don’t care about the texture of the shake, set the blender to a higher setting. If you raise the setting, you’ll only have to blend your shake for a minute or so."
                },
                {
                    "headline": "Drink your shake immediately after preparing it.",
                    "description": "Try to drink your Formula 1 meal shake as soon as you make it, so the ingredients stay as fresh as possible. Use your shake as a meal replacement for as many meals as you’d like, or use it in conjunction with a healthy meal option, like a salad. To drink your shake, pour it into the glass or cup of your choice. Herbalife shakes taste best when they’re fresh."
                }
            ]
        }
    ],
    "tyn": [
        "Creating a Shake with Formula 1 Powder",
        "Blender",
        "Glass or cup"
    ],
    "text": " Choosing the Right Product Use Formula 1 to replace your meals. Mix Formula 1 shake powder with milk to add fiber, protein, antioxidants, vitamins, and minerals to your diet. Opt to prepare these shakes around breakfast, lunch, and dinner, or whenever you feel especially hungry. This is the only Formula ingredient you need to make nutritional shakes. If you have any serious medical conditions, talk to your doctor before switching to Herbalife products. Did you know? Herbalife shakes come in different powder flavors. Currently, mint chocolate, orange cream, cafe latte, cookies ‘n cream, dulce de leche, Dutch chocolate, piña colada, wild berry, French vanilla, and banana caramel are available for purchase. If you’d prefer ingredients without genetically modified ingredients, there are 2 vanilla variations that you can choose from. Try boosting your cells and immune system with Formulas 2 and 3. Take 2 Multivitamin Complex Formula 2 pills, which contain lots of Vitamin A, E, calcium, folic acid, and iron. Additionally, take 2 cell activating Formula 3 capsules to boost antioxidant activity in your body. Don’t add these to every meal—instead, only take 1 dose per day, as recommended on each bottle. Formula 2 vitamins contain a lot of nutrients that benefit your skin, hair, and nails. Formula 3 capsules include aloe vera, which aid your cells in absorbing micronutrients. While you don’t need to take Formulas 2 and 3 with your Formula 1 shakes, they help complete the full diet program created by Herbalife. Boost your metabolism with Herbal Tea Concentrate. Add ½ tsp (1.7 g) of tea concentrate powder into a  6 to 12 fluid ounces (180 to 350 mL) glass of water. Stir in the powder to get a boost in your metabolism as well as your antioxidants. If you’d prefer a quicker addition to your diet, take 1-2 Total Control tablets to help your metabolism along. Both of these products contain caffeine, and are designed to help wake you up. Read the Total Control bottle label to see what your recommended serving size is. The Herbal Tea Concentrate comes in several flavors, including lemon, original, raspberry, and peach. Pick Herbal Aloe Concentration as a refreshing drink alternative. Pour yourself a 6 to 12 fluid ounces (180 to 350 mL) glass of Herbal Aloe Concentrate. Drink this once a day or on an as-needed basis to relax your stomach and get rid of blatant indigestion. You can get this drink in a 1 gallon (3.8 L) size, or in a 14 fluid ounces (410 mL) size. This product is also available in powder form. Follow the instructions on the bottle to use the correct dosage. Add fiber, electrolyte, and enzyme products to your diet as a supplement. Look into Herbalife’s Aminogen, Cell-U-Loss, Thermo-Bond, and Snack Defense pills to add good enzymes, fiber, electrolyte balance, and chromium to your diet. Take 2 pills of Snack Defense or Aminogen with the beverage of your choice. When taking Cell-U-Loss or Thermo-Bond, swallow 1 pill with water or another drink. Read the label on the bottle for more specific dosage instructions. Go for Herbalife snacks if you’re always on the go. Pack a protein bar or package of roasted soy nuts for source of energy and protein on-the-go. When snacking on a Protein Bar Deluxe, choose between chocolate peanut, vanilla almond, and citrus lemon flavors. Generic Herbalife protein bars only come in chocolate coconut flavor. Roasted soy nuts are only packaged in chile lime flavor. Opt for Herbalife probiotic powder to balance your GI tract. Mix 1 scoop of probiotic powder into your food or beverage to improve the health of your digestive system. Don’t worry about refrigerating this product—unlike probiotic yogurts and other products, it’s fine if you leave the powder out. Probiotic powder doesn’t add any calories to your food or drink. Each scoop of powder adds 1 billion active probiotic cultures into your GI tract. Creating a Shake with Formula 1 Powder Use 8 fluid ounces (240 mL) of dairy or soy as a liquid base. Pour a small amount of skim milk or soy milk into a blender container, or into a liquid measuring cup. Add this liquid in before any powdery or solid ingredients, as it will serve as the base for your shake. Avoid using whole or partially fatty milk for your recipe, as this will make the shake less healthy. You can also use water instead of milk, if you’d prefer a less creamy base. Read the instructions on your powder canister. Some shake flavors might taste better with a milk base (e.g., cookies ‘n cream, Dutch chocolate), while others might taste better with a water base (e.g., wild berry). Pour in 2 scoops of Formula 1 shake powder. Take the scoop that came with the powder canister to dump the powder over the milk. Try to mix all of the ingredients in a blender container, as this will help streamline the process. You can use the scoop provided with the bottle to create an exact measurement. Incorporate other supplement powders to boost your shake. Add in any powdered ingredient that benefits your current dietary needs. If you’re trying to boost your GI health, add in 1 scoop of probiotic powder. If you’d prefer to lower your body’s calorie intake, dump in a spoonful of Herbalife’s Prolessa Duo powder. Before adding more than 1 nutritional supplement, check each bottle to see if multiple nutrient/supplement powders can be combined in a shake. Only use 1 dose of these powders per day. Add frozen produce to give your shake more nutrients. Take 2-3 small pieces of fruit, like strawberries or peach slices, and add them into your smoothie mixture. Don’t put too many pieces of fruit in, as this could affect the flavor ratio in the smoothie. You can also add vegetables without a lot of natural flavor to the smoothie, like kale leaves. If you’re adding in a smaller fruit, like blueberries or raspberries, try tossing a small handful of the fruit into the shake mix. Ice cubes also work as a cold addition. Blend the ingredients at a low speed for 2-4 minutes. Place the top on your blender and check that it’s secure. Next, press the “blend” button, selecting a lower speed, if possible. To make your meal shake especially thick, leave the blender on for several minutes, which allows the mixture to thicken. If you don’t care about the texture of the shake, set the blender to a higher setting. If you raise the setting, you’ll only have to blend your shake for a minute or so. Drink your shake immediately after preparing it. Try to drink your Formula 1 meal shake as soon as you make it, so the ingredients stay as fresh as possible. Use your shake as a meal replacement for as many meals as you’d like, or use it in conjunction with a healthy meal option, like a salad. To drink your shake, pour it into the glass or cup of your choice. Herbalife shakes taste best when they’re fresh.",
    "sentences": [
        " Choosing the Right Product Use Formula 1 to replace your meals.",
        "Mix Formula 1 shake powder with milk to add fiber, protein, antioxidants, vitamins, and minerals to your diet.",
        "Opt to prepare these shakes around breakfast, lunch, and dinner, or whenever you feel especially hungry.",
        "This is the only Formula ingredient you need to make nutritional shakes.",
        "If you have any serious medical conditions, talk to your doctor before switching to Herbalife products.",
        "Did you know?",
        "Herbalife shakes come in different powder flavors.",
        "Currently, mint chocolate, orange cream, cafe latte, cookies ‘n cream, dulce de leche, Dutch chocolate, piña colada, wild berry, French vanilla, and banana caramel are available for purchase.",
        "If you’d prefer ingredients without genetically modified ingredients, there are 2 vanilla variations that you can choose from.",
        "Try boosting your cells and immune system with Formulas 2 and 3.",
        "Take 2 Multivitamin Complex Formula 2 pills, which contain lots of Vitamin A, E, calcium, folic acid, and iron.",
        "Additionally, take 2 cell activating Formula 3 capsules to boost antioxidant activity in your body.",
        "Don’t add these to every meal—instead, only take 1 dose per day, as recommended on each bottle.",
        "Formula 2 vitamins contain a lot of nutrients that benefit your skin, hair, and nails.",
        "Formula 3 capsules include aloe vera, which aid your cells in absorbing micronutrients.",
        "While you don’t need to take Formulas 2 and 3 with your Formula 1 shakes, they help complete the full diet program created by Herbalife.",
        "Boost your metabolism with Herbal Tea Concentrate.",
        "Add ½ tsp (1.7 g) of tea concentrate powder into a  6 to 12 fluid ounces (180 to 350 mL) glass of water.",
        "Stir in the powder to get a boost in your metabolism as well as your antioxidants.",
        "If you’d prefer a quicker addition to your diet, take 1-2 Total Control tablets to help your metabolism along.",
        "Both of these products contain caffeine, and are designed to help wake you up.",
        "Read the Total Control bottle label to see what your recommended serving size is.",
        "The Herbal Tea Concentrate comes in several flavors, including lemon, original, raspberry, and peach.",
        "Pick Herbal Aloe Concentration as a refreshing drink alternative.",
        "Pour yourself a 6 to 12 fluid ounces (180 to 350 mL) glass of Herbal Aloe Concentrate.",
        "Drink this once a day or on an as-needed basis to relax your stomach and get rid of blatant indigestion.",
        "You can get this drink in a 1 gallon (3.8 L) size, or in a 14 fluid ounces (410 mL) size.",
        "This product is also available in powder form.",
        "Follow the instructions on the bottle to use the correct dosage.",
        "Add fiber, electrolyte, and enzyme products to your diet as a supplement.",
        "Look into Herbalife’s Aminogen, Cell-U-Loss, Thermo-Bond, and Snack Defense pills to add good enzymes, fiber, electrolyte balance, and chromium to your diet.",
        "Take 2 pills of Snack Defense or Aminogen with the beverage of your choice.",
        "When taking Cell-U-Loss or Thermo-Bond, swallow 1 pill with water or another drink.",
        "Read the label on the bottle for more specific dosage instructions.",
        "Go for Herbalife snacks if you’re always on the go.",
        "Pack a protein bar or package of roasted soy nuts for source of energy and protein on-the-go.",
        "When snacking on a Protein Bar Deluxe, choose between chocolate peanut, vanilla almond, and citrus lemon flavors.",
        "Generic Herbalife protein bars only come in chocolate coconut flavor.",
        "Roasted soy nuts are only packaged in chile lime flavor.",
        "Opt for Herbalife probiotic powder to balance your GI tract.",
        "Mix 1 scoop of probiotic powder into your food or beverage to improve the health of your digestive system.",
        "Don’t worry about refrigerating this product—unlike probiotic yogurts and other products, it’s fine if you leave the powder out.",
        "Probiotic powder doesn’t add any calories to your food or drink.",
        "Each scoop of powder adds 1 billion active probiotic cultures into your GI tract.",
        "Creating a Shake with Formula 1 Powder Use 8 fluid ounces (240 mL) of dairy or soy as a liquid base.",
        "Pour a small amount of skim milk or soy milk into a blender container, or into a liquid measuring cup.",
        "Add this liquid in before any powdery or solid ingredients, as it will serve as the base for your shake.",
        "Avoid using whole or partially fatty milk for your recipe, as this will make the shake less healthy.",
        "You can also use water instead of milk, if you’d prefer a less creamy base.",
        "Read the instructions on your powder canister.",
        "Some shake flavors might taste better with a milk base (e.g., cookies ‘n cream, Dutch chocolate), while others might taste better with a water base (e.g., wild berry).",
        "Pour in 2 scoops of Formula 1 shake powder.",
        "Take the scoop that came with the powder canister to dump the powder over the milk.",
        "Try to mix all of the ingredients in a blender container, as this will help streamline the process.",
        "You can use the scoop provided with the bottle to create an exact measurement.",
        "Incorporate other supplement powders to boost your shake.",
        "Add in any powdered ingredient that benefits your current dietary needs.",
        "If you’re trying to boost your GI health, add in 1 scoop of probiotic powder.",
        "If you’d prefer to lower your body’s calorie intake, dump in a spoonful of Herbalife’s Prolessa Duo powder.",
        "Before adding more than 1 nutritional supplement, check each bottle to see if multiple nutrient/supplement powders can be combined in a shake.",
        "Only use 1 dose of these powders per day.",
        "Add frozen produce to give your shake more nutrients.",
        "Take 2-3 small pieces of fruit, like strawberries or peach slices, and add them into your smoothie mixture.",
        "Don’t put too many pieces of fruit in, as this could affect the flavor ratio in the smoothie.",
        "You can also add vegetables without a lot of natural flavor to the smoothie, like kale leaves.",
        "If you’re adding in a smaller fruit, like blueberries or raspberries, try tossing a small handful of the fruit into the shake mix.",
        "Ice cubes also work as a cold addition.",
        "Blend the ingredients at a low speed for 2-4 minutes.",
        "Place the top on your blender and check that it’s secure.",
        "Next, press the “blend” button, selecting a lower speed, if possible.",
        "To make your meal shake especially thick, leave the blender on for several minutes, which allows the mixture to thicken.",
        "If you don’t care about the texture of the shake, set the blender to a higher setting.",
        "If you raise the setting, you’ll only have to blend your shake for a minute or so.",
        "Drink your shake immediately after preparing it.",
        "Try to drink your Formula 1 meal shake as soon as you make it, so the ingredients stay as fresh as possible.",
        "Use your shake as a meal replacement for as many meals as you’d like, or use it in conjunction with a healthy meal option, like a salad.",
        "To drink your shake, pour it into the glass or cup of your choice.",
        "Herbalife shakes taste best when they’re fresh."
    ]
}