{
    "title": "How to Make a Rose Braid",
    "url": "https://www.wikihow.com/Make-a-Rose-Braid",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hairstyles",
        "Braids"
    ],
    "methods": [
        {
            "name": "Doing a Twist Braid",
            "steps": [
                {
                    "headline": "Tie a handful of hair on your crown into a small ponytail.",
                    "description": "Rose braids work the best with a small amount of hair that can be manipulated. Grab some hair from the front and sides of your face and pull it back onto the crown of your head. Use a small hair tie to tie your hair into a ponytail. Leave the majority of your hair loose. Use a clear hair tie to keep your ponytail as subtle as possible. You can braid the sides of your hair if you’d like an extra accent."
                },
                {
                    "headline": "Separate the hair in your ponytail into 2 even sections.",
                    "description": "Use your fingers to gently comb through the hair in your ponytail. Section your hair into 2 parts that are mostly even. The sections don’t have to be perfect, but the more even they are, the better your rose will look in the end. Depending on the thickness of your hair, these sections can be fairly large or quite thin."
                },
                {
                    "headline": "Twist each section individually in the same direction.",
                    "description": "Start from the top of the hair nearest the hair tie. Gently twist 1 section of hair to the right until you reach the bottom of your hair. Keep the section twisted by pinching it or having a friend hold it in place. Repeat the twist to the right on the other section of your hair. Make sure the twists are tight enough that there are minimal flyaways. Add some hairspray or gel to tame your flyaways."
                },
                {
                    "headline": "Twist the sections of your hair together to the left.",
                    "description": "Create a twist braid by twisting the sections of your hair together in the opposite direction. Wind them together keeping your twist going to the left. Secure your twist braid with a small elastic at the bottom of your hair. If your twists are not tight enough, they will not hold in a twist braid. Try to twist the sections of your hair tighter if they fall out of the braid."
                },
                {
                    "headline": "Grab the end of the twist braid and spin it up and around itself.",
                    "description": "Lay the edges of the twist braid down on the back of your head until it is mostly flat. Tuck the end of your braid underneath of the rest so it is hidden."
                },
                {
                    "headline": "Secure your rose braid with bobby pins.",
                    "description": "Use bobby pins that closely match the color of your hair. Pin at least 4 bobby pins into your hair around the edges of the rose braid. Pin most of the bobby pins around the edges of the braid where flyaways are most likely to happen. You may need to add more bobby pins if your hair is especially thick.Tip: Keep some bobby pins handy as you go about your day in case your braid falls out. Use a light spritz of hairspray for extra hold."
                }
            ]
        },
        {
            "name": "Using a French Braid",
            "steps": [
                {
                    "headline": "Create 2 French braids on either side of the crown of your head.",
                    "description": "Grab 3 strands of hair from the front of your head. Braid them together, adding more hair each time you cross a section over itself. Use the hair from your head that you would use to make a half-up half-down hairstyle. Do this on both sides of your hair, but do not connect the braids. Secure each braid with a small hair tie. Use a clear hair tie to be as unobtrusive as possible."
                },
                {
                    "headline": "Pull your French braids so they are loose.",
                    "description": "Start from the top of each French braid. Pull on each section of the braid to make your braid slightly loose. Do not pull so hard that you undo the braid. Focus on the ends of the French braid especially. A loose French braid is called a lace effect."
                },
                {
                    "headline": "Twist 1 French braid into a circle on the back of your head.",
                    "description": "Grab the end of 1 French braid. Twist it up over itself to create a small circle as big as you want your flower. Depending on the length of your hair, you may have to twist it more or less times. Tuck the end of the French braid underneath itself to hide the hair tie.Tip: If you have especially long hair, you may be able to make an entire rose out of 1 French braid. In that case, use your second French braid to make another rose."
                },
                {
                    "headline": "Secure the French braid into place with bobby pins.",
                    "description": "Use 2 to 4 bobby pins to attach the French braid to the back of your head. If your hair is super thick, you may need more bobby pins. Focus the pins on the edges of the French braid in case it comes apart."
                },
                {
                    "headline": "Twist the second French braid under the first one and secure it.",
                    "description": "Grab the French braid that is hanging loose and twist it up and underneath of the first French braid. Wrap it around the first French braid until it is fully hidden underneath of it. This will give your flower more volume and add more petals. Use 5 to 10 bobby pins to secure the rose to your head. If you are making a second rose, twist the second French braid up and over itself into a rose shape next to the first one. Secure it with bobby pins. Use some hairspray to keep your braid even more secure."
                }
            ]
        }
    ],
    "tyn": [
        "Small hair ties",
        "Bobby pins"
    ],
    "text": " Doing a Twist Braid Tie a handful of hair on your crown into a small ponytail. Rose braids work the best with a small amount of hair that can be manipulated. Grab some hair from the front and sides of your face and pull it back onto the crown of your head. Use a small hair tie to tie your hair into a ponytail. Leave the majority of your hair loose. Use a clear hair tie to keep your ponytail as subtle as possible. You can braid the sides of your hair if you’d like an extra accent. Separate the hair in your ponytail into 2 even sections. Use your fingers to gently comb through the hair in your ponytail. Section your hair into 2 parts that are mostly even. The sections don’t have to be perfect, but the more even they are, the better your rose will look in the end. Depending on the thickness of your hair, these sections can be fairly large or quite thin. Twist each section individually in the same direction. Start from the top of the hair nearest the hair tie. Gently twist 1 section of hair to the right until you reach the bottom of your hair. Keep the section twisted by pinching it or having a friend hold it in place. Repeat the twist to the right on the other section of your hair. Make sure the twists are tight enough that there are minimal flyaways. Add some hairspray or gel to tame your flyaways. Twist the sections of your hair together to the left. Create a twist braid by twisting the sections of your hair together in the opposite direction. Wind them together keeping your twist going to the left. Secure your twist braid with a small elastic at the bottom of your hair. If your twists are not tight enough, they will not hold in a twist braid. Try to twist the sections of your hair tighter if they fall out of the braid. Grab the end of the twist braid and spin it up and around itself. Lay the edges of the twist braid down on the back of your head until it is mostly flat. Tuck the end of your braid underneath of the rest so it is hidden. Secure your rose braid with bobby pins. Use bobby pins that closely match the color of your hair. Pin at least 4 bobby pins into your hair around the edges of the rose braid. Pin most of the bobby pins around the edges of the braid where flyaways are most likely to happen. You may need to add more bobby pins if your hair is especially thick.Tip: Keep some bobby pins handy as you go about your day in case your braid falls out. Use a light spritz of hairspray for extra hold. Using a French Braid Create 2 French braids on either side of the crown of your head. Grab 3 strands of hair from the front of your head. Braid them together, adding more hair each time you cross a section over itself. Use the hair from your head that you would use to make a half-up half-down hairstyle. Do this on both sides of your hair, but do not connect the braids. Secure each braid with a small hair tie. Use a clear hair tie to be as unobtrusive as possible. Pull your French braids so they are loose. Start from the top of each French braid. Pull on each section of the braid to make your braid slightly loose. Do not pull so hard that you undo the braid. Focus on the ends of the French braid especially. A loose French braid is called a lace effect. Twist 1 French braid into a circle on the back of your head. Grab the end of 1 French braid. Twist it up over itself to create a small circle as big as you want your flower. Depending on the length of your hair, you may have to twist it more or less times. Tuck the end of the French braid underneath itself to hide the hair tie.Tip: If you have especially long hair, you may be able to make an entire rose out of 1 French braid. In that case, use your second French braid to make another rose. Secure the French braid into place with bobby pins. Use 2 to 4 bobby pins to attach the French braid to the back of your head. If your hair is super thick, you may need more bobby pins. Focus the pins on the edges of the French braid in case it comes apart. Twist the second French braid under the first one and secure it. Grab the French braid that is hanging loose and twist it up and underneath of the first French braid. Wrap it around the first French braid until it is fully hidden underneath of it. This will give your flower more volume and add more petals. Use 5 to 10 bobby pins to secure the rose to your head. If you are making a second rose, twist the second French braid up and over itself into a rose shape next to the first one. Secure it with bobby pins. Use some hairspray to keep your braid even more secure.",
    "sentences": [
        " Doing a Twist Braid Tie a handful of hair on your crown into a small ponytail.",
        "Rose braids work the best with a small amount of hair that can be manipulated.",
        "Grab some hair from the front and sides of your face and pull it back onto the crown of your head.",
        "Use a small hair tie to tie your hair into a ponytail.",
        "Leave the majority of your hair loose.",
        "Use a clear hair tie to keep your ponytail as subtle as possible.",
        "You can braid the sides of your hair if you’d like an extra accent.",
        "Separate the hair in your ponytail into 2 even sections.",
        "Use your fingers to gently comb through the hair in your ponytail.",
        "Section your hair into 2 parts that are mostly even.",
        "The sections don’t have to be perfect, but the more even they are, the better your rose will look in the end.",
        "Depending on the thickness of your hair, these sections can be fairly large or quite thin.",
        "Twist each section individually in the same direction.",
        "Start from the top of the hair nearest the hair tie.",
        "Gently twist 1 section of hair to the right until you reach the bottom of your hair.",
        "Keep the section twisted by pinching it or having a friend hold it in place.",
        "Repeat the twist to the right on the other section of your hair.",
        "Make sure the twists are tight enough that there are minimal flyaways.",
        "Add some hairspray or gel to tame your flyaways.",
        "Twist the sections of your hair together to the left.",
        "Create a twist braid by twisting the sections of your hair together in the opposite direction.",
        "Wind them together keeping your twist going to the left.",
        "Secure your twist braid with a small elastic at the bottom of your hair.",
        "If your twists are not tight enough, they will not hold in a twist braid.",
        "Try to twist the sections of your hair tighter if they fall out of the braid.",
        "Grab the end of the twist braid and spin it up and around itself.",
        "Lay the edges of the twist braid down on the back of your head until it is mostly flat.",
        "Tuck the end of your braid underneath of the rest so it is hidden.",
        "Secure your rose braid with bobby pins.",
        "Use bobby pins that closely match the color of your hair.",
        "Pin at least 4 bobby pins into your hair around the edges of the rose braid.",
        "Pin most of the bobby pins around the edges of the braid where flyaways are most likely to happen.",
        "You may need to add more bobby pins if your hair is especially thick.Tip: Keep some bobby pins handy as you go about your day in case your braid falls out.",
        "Use a light spritz of hairspray for extra hold.",
        "Using a French Braid Create 2 French braids on either side of the crown of your head.",
        "Grab 3 strands of hair from the front of your head.",
        "Braid them together, adding more hair each time you cross a section over itself.",
        "Use the hair from your head that you would use to make a half-up half-down hairstyle.",
        "Do this on both sides of your hair, but do not connect the braids.",
        "Secure each braid with a small hair tie.",
        "Use a clear hair tie to be as unobtrusive as possible.",
        "Pull your French braids so they are loose.",
        "Start from the top of each French braid.",
        "Pull on each section of the braid to make your braid slightly loose.",
        "Do not pull so hard that you undo the braid.",
        "Focus on the ends of the French braid especially.",
        "A loose French braid is called a lace effect.",
        "Twist 1 French braid into a circle on the back of your head.",
        "Grab the end of 1 French braid.",
        "Twist it up over itself to create a small circle as big as you want your flower.",
        "Depending on the length of your hair, you may have to twist it more or less times.",
        "Tuck the end of the French braid underneath itself to hide the hair tie.Tip: If you have especially long hair, you may be able to make an entire rose out of 1 French braid.",
        "In that case, use your second French braid to make another rose.",
        "Secure the French braid into place with bobby pins.",
        "Use 2 to 4 bobby pins to attach the French braid to the back of your head.",
        "If your hair is super thick, you may need more bobby pins.",
        "Focus the pins on the edges of the French braid in case it comes apart.",
        "Twist the second French braid under the first one and secure it.",
        "Grab the French braid that is hanging loose and twist it up and underneath of the first French braid.",
        "Wrap it around the first French braid until it is fully hidden underneath of it.",
        "This will give your flower more volume and add more petals.",
        "Use 5 to 10 bobby pins to secure the rose to your head.",
        "If you are making a second rose, twist the second French braid up and over itself into a rose shape next to the first one.",
        "Secure it with bobby pins.",
        "Use some hairspray to keep your braid even more secure."
    ]
}