{
    "title": "How to Get Wrinkles Out of Polyester",
    "url": "https://www.wikihow.com/Get-Wrinkles-Out-of-Polyester",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Laundry",
        "Cleaning Fabric",
        "Cleaning Synthetic Fabric"
    ],
    "methods": [
        {
            "name": "Washing and Drying the Item",
            "steps": [
                {
                    "headline": "Check the care instructions on the item’s tag.",
                    "description": "The suggested wash cycle and water temperature may vary depending on if the item is pure polyester or if it’s a blend. Delicate fabrics, such as a polyester and silk blend, may require a delicate wash cycle with cool or warm water. If you’re unsure, wash the item with cold or warm water on the permanent press cycle. Never use hot water to wash a polyester item as it can damage the fabric. The care tag will also indicate if it’s okay to iron or dry the item, which you might want to know if washing and drying does not remove the wrinkles."
                },
                {
                    "headline": "Add a gentle detergent and fabric softener to your washing machine.",
                    "description": "A gentle detergent is less likely to damage the item, especially if it’s a delicate fabric blend. Add a gentle fabric softener to the washing machine as well. This will help to reduce the static after you dry the item. Polyester is known for its tendency to develop lots of static, so using fabric softener is highly recommended."
                },
                {
                    "headline": "Start the wash and remove the item right after the cycle ends.",
                    "description": "Press the start button on the washing machine after you add the detergent and fabric softener. Listen for the cycle to finish and transfer the wet polyester from the washer to the dryer right away. Otherwise, the polyester item may develop new wrinkles."
                },
                {
                    "headline": "Dry the item on the permanent press cycle for 15 to 20 minutes.",
                    "description": "Toss in a dryer sheet with the item to help reduce static, if desired. Then, set the heat to low and turn the dial to 20 minutes max. This should be enough heat and time to get the item dry. You can dry the item for longer if needed, but make sure to check it every 5 minutes after it's been in for 20 minutes. If your dryer does not have a permanent press cycle, then you can just select the lowest heat setting.Warning: Never dry a polyester item on high heat or leave it in the dryer for too long. Polyester can’t withstand high temperatures."
                },
                {
                    "headline": "Hang the item up immediately after it’s dry to prevent new wrinkles.",
                    "description": "Leaving the item sitting in the dryer may result in new wrinkles and possibly even permanent wrinkles. Take the item out of the dryer as soon as it’s dry and place it on a hanger to cool. Leave the item alone for at least 5 minutes or as long as it takes for the fabric to cool down. Once the fabric feels cool to the touch, you can safely wear or fold the item without wrinkling it. In a hurry? Toss the polyester item into your dryer with a damp towel and dryer sheet and tumble dry it on low for 10 minutes. Take it out immediately and lay it flat or hang it up to cool."
                }
            ]
        },
        {
            "name": "Using an Iron",
            "steps": [
                {
                    "headline": "Turn on an iron to the lowest setting.",
                    "description": "Polyester fabric cannot withstand high temperatures, so don’t crank the heat on your iron up to the max. Set it to low or turn it to the synthetic or polyester setting if your iron has one. Check your iron’s instruction manual if you are unsure about what setting might be best for a polyester item."
                },
                {
                    "headline": "Spray the item with plain water to moisten the fabric.",
                    "description": "Fill a clean spray bottle with plain water and then spritz the polyester item all over to make it damp. If you don’t have a spray bottle, hold the item under running water and then wring out the excess. Make sure that the item is not dripping wet when you iron it. If needed, hang it up and allow it to dry a little before ironing it."
                },
                {
                    "headline": "Turn the item inside out and spread it on an ironing board.",
                    "description": "Stretch it gently with your hands to ensure that it is laying flat. Smooth out the wrinkles in the item with your hand so that it is lying as flat as possible. If you don’t have an ironing board, fold a towel in half and place it on a table, countertop, or bed. Then, place the polyester item on top of the towel. Turning the item inside out will help to prevent visible damage to the item if it gets too hot."
                },
                {
                    "headline": "Cover the item with a thin towel or T-shirt.",
                    "description": "Ensure that the towel or T-shirt is clean and dry. Smooth it out over the polyester item so that it lays flat. This will help to protect the item from becoming damaged by the heat of the iron."
                },
                {
                    "headline": "Iron the fabric through the towel or shirt on low heat.",
                    "description": "Press the heated iron down on the towel or T-shirt and iron over the fabric to smooth it out. Continue to move the iron back and forth across the fabric until you have covered all of it 2-3 times.Warning: Be careful not to rest the iron on any one spot of the item for more than 10 seconds as this may damage the fabric."
                },
                {
                    "headline": "Hang the item or leave it on the ironing board to dry it flat for 5 minutes.",
                    "description": "Don’t try to fold or wear the item right away or it could develop new wrinkles. Instead, place the item on a hanger or leave it on the ironing board to cool. Then, don’t touch the item until it is completely cool. Check to ensure that the fabric feels cool before you fold or wear it."
                }
            ]
        },
        {
            "name": "Steaming out the Wrinkles",
            "steps": [
                {
                    "headline": "Fill the iron’s reservoir with water and turn it on the steam setting.",
                    "description": "Check the manufacturer’s instructions to determine how much water to add to the reservoir and to determine how long it will take to warm up. In most cases, 10-15 minutes should be plenty of time for the iron to get hot and start releasing steam. You can also use a handheld steamer if you have one. Follow the manufacturer’s instructions for how much water to add to the reservoir and how long to let it heat up."
                },
                {
                    "headline": "Turn the polyester item inside out and place it on an ironing board.",
                    "description": "While the iron is warming up, prepare your fabric on the ironing board. Turn it inside out so that you will be less likely to damage the fabric. Then, smooth it out on the ironing board as best you can. If you don’t have an ironing board, fold a towel in half and place it on a table, countertop, or bed. Then, place the polyester item on top of it. Make sure to avoid using a colorful towel if the item is light or a pastel color.Tip: If you’re steaming curtains, you can also leave them on the curtain rod and steam them while they hang. The weight of the curtains will help to release any wrinkles in them."
                },
                {
                    "headline": "Move the iron up and down while hovering it above the item.",
                    "description": "Once the iron is releasing steam, pick it up and position it so that it is about 2–3 in (5.1–7.6 cm) above the polyester item. Move it up and down over each of the wrinkled areas to smooth them out. Tug the edges of the item gently as you do this to help release the wrinkles. Be very careful not to steam your skin! The steam is very hot and it can easily burn you."
                },
                {
                    "headline": "Hang the item or leave it on the ironing board to cool for 5 minutes.",
                    "description": "After you finish steaming each of the wrinkled sections of the item, transfer it to a hanger or leave it lying flat on the ironing board. Let the polyester item cool for 5 minutes. Don’t try to wear or fold the item until it is completely cool or it may develop new wrinkles. Touch the fabric after 5 minutes to see if it is cool. If it is, you can wear the item or fold it and put it away. In a hurry? Spray the item with a mixture of 1 cup (240 mL) of water and 1 tsp (5 mL) of fabric softener. Then, hang it up in your bathroom and take a shower. The steam from the shower will help to release any wrinkles in the item. Toss the item in a dryer for a few minutes if it’s still damp after your shower."
                }
            ]
        }
    ],
    "tyn": [
        "Washing and Drying the Item",
        "Washing machine",
        "Laundry detergent",
        "Fabric softener",
        "Dryer",
        "Dryer sheets",
        "Hanger",
        "Using an Iron",
        "Spray bottle",
        "Iron",
        "Ironing board or towel",
        "Thin towel or T-shirt",
        "Steaming out the Wrinkles",
        "Iron or handheld steamer"
    ],
    "text": " Washing and Drying the Item Check the care instructions on the item’s tag. The suggested wash cycle and water temperature may vary depending on if the item is pure polyester or if it’s a blend. Delicate fabrics, such as a polyester and silk blend, may require a delicate wash cycle with cool or warm water. If you’re unsure, wash the item with cold or warm water on the permanent press cycle. Never use hot water to wash a polyester item as it can damage the fabric. The care tag will also indicate if it’s okay to iron or dry the item, which you might want to know if washing and drying does not remove the wrinkles. Add a gentle detergent and fabric softener to your washing machine. A gentle detergent is less likely to damage the item, especially if it’s a delicate fabric blend. Add a gentle fabric softener to the washing machine as well. This will help to reduce the static after you dry the item. Polyester is known for its tendency to develop lots of static, so using fabric softener is highly recommended. Start the wash and remove the item right after the cycle ends. Press the start button on the washing machine after you add the detergent and fabric softener. Listen for the cycle to finish and transfer the wet polyester from the washer to the dryer right away. Otherwise, the polyester item may develop new wrinkles. Dry the item on the permanent press cycle for 15 to 20 minutes. Toss in a dryer sheet with the item to help reduce static, if desired. Then, set the heat to low and turn the dial to 20 minutes max. This should be enough heat and time to get the item dry. You can dry the item for longer if needed, but make sure to check it every 5 minutes after it's been in for 20 minutes. If your dryer does not have a permanent press cycle, then you can just select the lowest heat setting.Warning: Never dry a polyester item on high heat or leave it in the dryer for too long. Polyester can’t withstand high temperatures. Hang the item up immediately after it’s dry to prevent new wrinkles. Leaving the item sitting in the dryer may result in new wrinkles and possibly even permanent wrinkles. Take the item out of the dryer as soon as it’s dry and place it on a hanger to cool. Leave the item alone for at least 5 minutes or as long as it takes for the fabric to cool down. Once the fabric feels cool to the touch, you can safely wear or fold the item without wrinkling it. In a hurry? Toss the polyester item into your dryer with a damp towel and dryer sheet and tumble dry it on low for 10 minutes. Take it out immediately and lay it flat or hang it up to cool. Using an Iron Turn on an iron to the lowest setting. Polyester fabric cannot withstand high temperatures, so don’t crank the heat on your iron up to the max. Set it to low or turn it to the synthetic or polyester setting if your iron has one. Check your iron’s instruction manual if you are unsure about what setting might be best for a polyester item. Spray the item with plain water to moisten the fabric. Fill a clean spray bottle with plain water and then spritz the polyester item all over to make it damp. If you don’t have a spray bottle, hold the item under running water and then wring out the excess. Make sure that the item is not dripping wet when you iron it. If needed, hang it up and allow it to dry a little before ironing it. Turn the item inside out and spread it on an ironing board. Stretch it gently with your hands to ensure that it is laying flat. Smooth out the wrinkles in the item with your hand so that it is lying as flat as possible. If you don’t have an ironing board, fold a towel in half and place it on a table, countertop, or bed. Then, place the polyester item on top of the towel. Turning the item inside out will help to prevent visible damage to the item if it gets too hot. Cover the item with a thin towel or T-shirt. Ensure that the towel or T-shirt is clean and dry. Smooth it out over the polyester item so that it lays flat. This will help to protect the item from becoming damaged by the heat of the iron. Iron the fabric through the towel or shirt on low heat. Press the heated iron down on the towel or T-shirt and iron over the fabric to smooth it out. Continue to move the iron back and forth across the fabric until you have covered all of it 2-3 times.Warning: Be careful not to rest the iron on any one spot of the item for more than 10 seconds as this may damage the fabric. Hang the item or leave it on the ironing board to dry it flat for 5 minutes. Don’t try to fold or wear the item right away or it could develop new wrinkles. Instead, place the item on a hanger or leave it on the ironing board to cool. Then, don’t touch the item until it is completely cool. Check to ensure that the fabric feels cool before you fold or wear it. Steaming out the Wrinkles Fill the iron’s reservoir with water and turn it on the steam setting. Check the manufacturer’s instructions to determine how much water to add to the reservoir and to determine how long it will take to warm up. In most cases, 10-15 minutes should be plenty of time for the iron to get hot and start releasing steam. You can also use a handheld steamer if you have one. Follow the manufacturer’s instructions for how much water to add to the reservoir and how long to let it heat up. Turn the polyester item inside out and place it on an ironing board. While the iron is warming up, prepare your fabric on the ironing board. Turn it inside out so that you will be less likely to damage the fabric. Then, smooth it out on the ironing board as best you can. If you don’t have an ironing board, fold a towel in half and place it on a table, countertop, or bed. Then, place the polyester item on top of it. Make sure to avoid using a colorful towel if the item is light or a pastel color.Tip: If you’re steaming curtains, you can also leave them on the curtain rod and steam them while they hang. The weight of the curtains will help to release any wrinkles in them. Move the iron up and down while hovering it above the item. Once the iron is releasing steam, pick it up and position it so that it is about 2–3 in (5.1–7.6 cm) above the polyester item. Move it up and down over each of the wrinkled areas to smooth them out. Tug the edges of the item gently as you do this to help release the wrinkles. Be very careful not to steam your skin! The steam is very hot and it can easily burn you. Hang the item or leave it on the ironing board to cool for 5 minutes. After you finish steaming each of the wrinkled sections of the item, transfer it to a hanger or leave it lying flat on the ironing board. Let the polyester item cool for 5 minutes. Don’t try to wear or fold the item until it is completely cool or it may develop new wrinkles. Touch the fabric after 5 minutes to see if it is cool. If it is, you can wear the item or fold it and put it away. In a hurry? Spray the item with a mixture of 1 cup (240 mL) of water and 1 tsp (5 mL) of fabric softener. Then, hang it up in your bathroom and take a shower. The steam from the shower will help to release any wrinkles in the item. Toss the item in a dryer for a few minutes if it’s still damp after your shower.",
    "sentences": [
        " Washing and Drying the Item Check the care instructions on the item’s tag.",
        "The suggested wash cycle and water temperature may vary depending on if the item is pure polyester or if it’s a blend.",
        "Delicate fabrics, such as a polyester and silk blend, may require a delicate wash cycle with cool or warm water.",
        "If you’re unsure, wash the item with cold or warm water on the permanent press cycle.",
        "Never use hot water to wash a polyester item as it can damage the fabric.",
        "The care tag will also indicate if it’s okay to iron or dry the item, which you might want to know if washing and drying does not remove the wrinkles.",
        "Add a gentle detergent and fabric softener to your washing machine.",
        "A gentle detergent is less likely to damage the item, especially if it’s a delicate fabric blend.",
        "Add a gentle fabric softener to the washing machine as well.",
        "This will help to reduce the static after you dry the item.",
        "Polyester is known for its tendency to develop lots of static, so using fabric softener is highly recommended.",
        "Start the wash and remove the item right after the cycle ends.",
        "Press the start button on the washing machine after you add the detergent and fabric softener.",
        "Listen for the cycle to finish and transfer the wet polyester from the washer to the dryer right away.",
        "Otherwise, the polyester item may develop new wrinkles.",
        "Dry the item on the permanent press cycle for 15 to 20 minutes.",
        "Toss in a dryer sheet with the item to help reduce static, if desired.",
        "Then, set the heat to low and turn the dial to 20 minutes max.",
        "This should be enough heat and time to get the item dry.",
        "You can dry the item for longer if needed, but make sure to check it every 5 minutes after it's been in for 20 minutes.",
        "If your dryer does not have a permanent press cycle, then you can just select the lowest heat setting.Warning: Never dry a polyester item on high heat or leave it in the dryer for too long.",
        "Polyester can’t withstand high temperatures.",
        "Hang the item up immediately after it’s dry to prevent new wrinkles.",
        "Leaving the item sitting in the dryer may result in new wrinkles and possibly even permanent wrinkles.",
        "Take the item out of the dryer as soon as it’s dry and place it on a hanger to cool.",
        "Leave the item alone for at least 5 minutes or as long as it takes for the fabric to cool down.",
        "Once the fabric feels cool to the touch, you can safely wear or fold the item without wrinkling it.",
        "In a hurry?",
        "Toss the polyester item into your dryer with a damp towel and dryer sheet and tumble dry it on low for 10 minutes.",
        "Take it out immediately and lay it flat or hang it up to cool.",
        "Using an Iron Turn on an iron to the lowest setting.",
        "Polyester fabric cannot withstand high temperatures, so don’t crank the heat on your iron up to the max.",
        "Set it to low or turn it to the synthetic or polyester setting if your iron has one.",
        "Check your iron’s instruction manual if you are unsure about what setting might be best for a polyester item.",
        "Spray the item with plain water to moisten the fabric.",
        "Fill a clean spray bottle with plain water and then spritz the polyester item all over to make it damp.",
        "If you don’t have a spray bottle, hold the item under running water and then wring out the excess.",
        "Make sure that the item is not dripping wet when you iron it.",
        "If needed, hang it up and allow it to dry a little before ironing it.",
        "Turn the item inside out and spread it on an ironing board.",
        "Stretch it gently with your hands to ensure that it is laying flat.",
        "Smooth out the wrinkles in the item with your hand so that it is lying as flat as possible.",
        "If you don’t have an ironing board, fold a towel in half and place it on a table, countertop, or bed.",
        "Then, place the polyester item on top of the towel.",
        "Turning the item inside out will help to prevent visible damage to the item if it gets too hot.",
        "Cover the item with a thin towel or T-shirt.",
        "Ensure that the towel or T-shirt is clean and dry.",
        "Smooth it out over the polyester item so that it lays flat.",
        "This will help to protect the item from becoming damaged by the heat of the iron.",
        "Iron the fabric through the towel or shirt on low heat.",
        "Press the heated iron down on the towel or T-shirt and iron over the fabric to smooth it out.",
        "Continue to move the iron back and forth across the fabric until you have covered all of it 2-3 times.Warning: Be careful not to rest the iron on any one spot of the item for more than 10 seconds as this may damage the fabric.",
        "Hang the item or leave it on the ironing board to dry it flat for 5 minutes.",
        "Don’t try to fold or wear the item right away or it could develop new wrinkles.",
        "Instead, place the item on a hanger or leave it on the ironing board to cool.",
        "Then, don’t touch the item until it is completely cool.",
        "Check to ensure that the fabric feels cool before you fold or wear it.",
        "Steaming out the Wrinkles Fill the iron’s reservoir with water and turn it on the steam setting.",
        "Check the manufacturer’s instructions to determine how much water to add to the reservoir and to determine how long it will take to warm up.",
        "In most cases, 10-15 minutes should be plenty of time for the iron to get hot and start releasing steam.",
        "You can also use a handheld steamer if you have one.",
        "Follow the manufacturer’s instructions for how much water to add to the reservoir and how long to let it heat up.",
        "Turn the polyester item inside out and place it on an ironing board.",
        "While the iron is warming up, prepare your fabric on the ironing board.",
        "Turn it inside out so that you will be less likely to damage the fabric.",
        "Then, smooth it out on the ironing board as best you can.",
        "If you don’t have an ironing board, fold a towel in half and place it on a table, countertop, or bed.",
        "Then, place the polyester item on top of it.",
        "Make sure to avoid using a colorful towel if the item is light or a pastel color.Tip: If you’re steaming curtains, you can also leave them on the curtain rod and steam them while they hang.",
        "The weight of the curtains will help to release any wrinkles in them.",
        "Move the iron up and down while hovering it above the item.",
        "Once the iron is releasing steam, pick it up and position it so that it is about 2–3 in (5.1–7.6 cm) above the polyester item.",
        "Move it up and down over each of the wrinkled areas to smooth them out.",
        "Tug the edges of the item gently as you do this to help release the wrinkles.",
        "Be very careful not to steam your skin!",
        "The steam is very hot and it can easily burn you.",
        "Hang the item or leave it on the ironing board to cool for 5 minutes.",
        "After you finish steaming each of the wrinkled sections of the item, transfer it to a hanger or leave it lying flat on the ironing board.",
        "Let the polyester item cool for 5 minutes.",
        "Don’t try to wear or fold the item until it is completely cool or it may develop new wrinkles.",
        "Touch the fabric after 5 minutes to see if it is cool.",
        "If it is, you can wear the item or fold it and put it away.",
        "In a hurry?",
        "Spray the item with a mixture of 1 cup (240 mL) of water and 1 tsp (5 mL) of fabric softener.",
        "Then, hang it up in your bathroom and take a shower.",
        "The steam from the shower will help to release any wrinkles in the item.",
        "Toss the item in a dryer for a few minutes if it’s still damp after your shower."
    ]
}