{
    "title": "How to Oil Paint a Copper Pot",
    "url": "https://www.wikihow.com/Oil-Paint-a-Copper-Pot",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "parts": [
        {
            "name": "Sketching the Design on Canvas",
            "steps": [
                {
                    "headline": "Paint a solid background color to serve as a backdrop.",
                    "description": "Dip your brush into the background color of your choice, and begin filling in your canvas. Since you want the copper pot to be the focal point of your painting, choose a dark or neutral color as your backdrop, like dark green or blue. If you’d rather create an informal background, try using a dusty brown or tan shade instead. Your background doesn’t have to include any fancy design. If you’re trying to hone your painting skills, make the copper pot the central focus of your painting."
                },
                {
                    "headline": "Wait 24 hours for the paint to dry.",
                    "description": "Paint your backdrop ahead of time, so you can focus specifically on your copper pot. Since oil paints typically take 1 day to dry fully, prepare your canvas and backdrop with these time limits in mind. If you don’t want to worry about drying time, try painting around the center portion of your canvas. Use this free, unpainted space for your copper pot!"
                },
                {
                    "headline": "Set up a copper pot to serve as a reference.",
                    "description": "Place a copper pot on a ledge or other prominent location near your painting area. If you don’t have a physical pot on hand, print out a picture to hang near your canvas. Ideally, use a reference that’s angled in the light, so you can practice shading and tinting your paints later on.Shading involves adding black to a color, while tinting involves adding white. Try using a single pot as a reference, instead of multiple pots, plates, and utensils."
                },
                {
                    "headline": "Scoop small amounts of warm and neutral-toned paints on your palette.",
                    "description": "Copper can be a tricky color to capture on canvas, so you’ll need a variety of bright and muddy colors at your disposal. To start, arrange a grape-sized amount of brown, black, and white paint on your palette. Additionally, add dime-sized amounts of red-orange and yellow to your painting workspace. Terracotta is another helpful paint color to have on hand when designing a copper pot. Try using a medium-brown tone for this project. Since copper relies on a lot of bright, warm colors, you don’t want the brown to overwhelm your piece of art."
                },
                {
                    "headline": "Draw a round outline of a pot onto your canvas with brown paint.",
                    "description": "Dip a small, thin brush into your brown paint. Work the brush around the canvas in a circular or cylindrical shape, depending on the shape of your reference pot. Focus on developing the rough curves and body of the pot, so you can fill it in with different tints and shades later. Don’t worry if your design isn’t exact—you can always fine-tune the details later on!"
                },
                {
                    "headline": "Shade in the pot with a thin layer of brown paint.",
                    "description": "Dip your brush into your brown paint and fill in the shape that you’ve sketched out. Try to keep this layer as thin as possible; since you’ll layering other paint colors onto the pot, you don’t want the brown to be too overbearing. Instead, use long, full strokes to color in the round shape that you’ve created. You might find it easier to work on a brown backdrop than the color of your background."
                }
            ]
        },
        {
            "name": "Painting the Base Colors",
            "steps": [
                {
                    "headline": "Mix white paint with a speck of yellow and red.",
                    "description": "Scoop a pea-sized amount of white paint with your palette knife and place it on a blank portion of your palette. After wiping off the knife, dip into your red-orange paint and mix it in with the white. Repeat this process with the yellow paint, then combine all 3 colors together. Mixing with a palette knife involves both scooping and mixing the paint. Use the base of the knife to lift and flip the paint onto the palette, then mix the paint colors together with a stirring motion. This shade helps create the reflections of light that are visible on the surface and rim of the copper pot."
                },
                {
                    "headline": "Brush the off-white paint along the center base and rim of the pot.",
                    "description": "Dip your brush into your new paint color, then dab the paint onto the canvas. Focus on the central, front section of the pot, or wherever the light source is directly hitting the copper. Paint a small, blueberry-sized white smudge on this area, then apply a line of off-white paint along the back rim of the pot. The off-white paint creates “reflective” spots, which mimic where the light source directly hits the copper pot."
                },
                {
                    "headline": "Combine brown, red-orange, and white paint to make a copper shade.",
                    "description": "Scoop a pea-sized amount of brown paint onto a separate section of the palette. After wiping off your palette knife, take a pinhead-sized amount of red-orange paint and mix it in with the brown. Lighten this shade by stirring your new shade of brown paint with a pea-sized amount of white. To make the shade especially bright, try mixing a speck of red-orange paint with the white. Then, mix the brown with this lightened red-orange paint to create your bright, copper shade. If you aren’t happy with the colors you’ve created on your palette, try experimenting with the paint ratios! For instance, if your copper brown paint color seems too dark, try stirring in a fleck of white paint to lighten it up!"
                },
                {
                    "headline": "Spread copper paint around the base of the pot.",
                    "description": "Dip your brush into the copper brown shade, then apply the paint to the left side of the pot. Use small strokes to spread the paint, dabbing and blending the copper brown with the off-white reflective spot as you go. Try to color in the left ⅔ of the pot with copper paint, as this is where the light is hitting the metal. Don’t worry if the colors look blotchy or out-of-place. Oil painting requires a lot of blending and mixing, which you’ll doing as you add more colors.Did you know? Unlike other modes of painting, you don’t need to rinse off your brush before dipping into a new color of paint. This style of paint application helps the painting to look more fluid and blended."
                }
            ]
        },
        {
            "name": "Shading in the Details",
            "steps": [
                {
                    "headline": "Blend red-orange paint in the left half of the pot to create a bright color.",
                    "description": "Dip into your red-orange paint, and begin painting the left side of the pot. Work in small, careful strokes, blending this brighter paint in with the base copper color. Only apply this paint to the left side of the pot, so you can contrast with the darker shades in the painting. Although the light source is hitting the left ⅔ of the pot, you want the left half of the pot to be as bright as possible. This creates a more gradual progression of color throughout the painting, as the pot transitions from lighter copper shades to shadowy tones."
                },
                {
                    "headline": "Add brown and red to the right half to create a shadowed effect.",
                    "description": "Use the tip of your brush to mix a fleck of red-orange into the brown section of paint on your palette. To make this shade slightly lighter, use your brush to stir in a speck of white. Once the dark copper shade is thoroughly mixed, spread this new shade along the right ⅓ of the copper pot. Work in short, careful strokes, so you can blend this shade with the brighter copper tones that are already there. If your dark copper shade looks too muted and cool, try mixing specks of black and red-orange into the paint color. Ideally, you don’t want to use any cool shades to paint a copper pot."
                },
                {
                    "headline": "Mix black and brown to shade the inside of the pot.",
                    "description": "Use your brush to move a pea-sized amount of brown paint to another section of your palette. With the same brush, stir a speck of black paint into the brown to create a darker shade. Once this new color is fully mixed together, dab the paint onto the top portion of the copper pot so you can shade the bottom half of the inner rim. This color needs to be darker than the right ⅓ of the pot."
                },
                {
                    "headline": "Include red and brown to make the inner rim more pronounced.",
                    "description": "Dip your brush into your red-brown paint mixture and spread it over the upper half of the pot’s inner rim. Add the paint in small, gradual strokes, so the brighter shade blends in with the black-brown paint that you just applied. Continue applying the paint in small strokes, slowly blending and mixing the red-brown with the off-white reflective splotch on the pot’s rim. There isn’t an exact way to shade your copper pot. Try experimenting by adding white and black paint to different shades, so you can lighten or deepen the colors on your palette!"
                },
                {
                    "headline": "Highlight the center of the pot with red-brown.",
                    "description": "Dip into your red-brown shade, and apply this paint around the left half of the pot’s base. Apply the paint in small strokes, spreading a reddish-brown sheen to the front of your pot. As you work, blend this red-brown color into the darker shadows along the right ⅓ of the pot, so the color transition looks more gradual. If you’d like to use a brighter brown shade, dip into a separate terracotta oil paint instead."
                },
                {
                    "headline": "Lighten the left edge of the pot with a touch of light gray.",
                    "description": "Use a palette knife to scoop a pea-sized amount of white paint over to an empty section of your palette. Next, stir a speck of black into the white, creating a light gray shade. Dip into this new paint with your brush, spreading the gray along the left edge of the pot’s base. Work in small, gradual strokes so you can blend the gray with the light copper shades."
                }
            ]
        }
    ],
    "tyn": [
        "Canvas",
        "Palette knife",
        "Palette",
        "Oil paints (red-orange, yellow, white, brown, black)",
        "Thin paint brush",
        "Copper pot (optional)"
    ],
    "text": " Sketching the Design on Canvas Paint a solid background color to serve as a backdrop. Dip your brush into the background color of your choice, and begin filling in your canvas. Since you want the copper pot to be the focal point of your painting, choose a dark or neutral color as your backdrop, like dark green or blue. If you’d rather create an informal background, try using a dusty brown or tan shade instead. Your background doesn’t have to include any fancy design. If you’re trying to hone your painting skills, make the copper pot the central focus of your painting. Wait 24 hours for the paint to dry. Paint your backdrop ahead of time, so you can focus specifically on your copper pot. Since oil paints typically take 1 day to dry fully, prepare your canvas and backdrop with these time limits in mind. If you don’t want to worry about drying time, try painting around the center portion of your canvas. Use this free, unpainted space for your copper pot! Set up a copper pot to serve as a reference. Place a copper pot on a ledge or other prominent location near your painting area. If you don’t have a physical pot on hand, print out a picture to hang near your canvas. Ideally, use a reference that’s angled in the light, so you can practice shading and tinting your paints later on.Shading involves adding black to a color, while tinting involves adding white. Try using a single pot as a reference, instead of multiple pots, plates, and utensils. Scoop small amounts of warm and neutral-toned paints on your palette. Copper can be a tricky color to capture on canvas, so you’ll need a variety of bright and muddy colors at your disposal. To start, arrange a grape-sized amount of brown, black, and white paint on your palette. Additionally, add dime-sized amounts of red-orange and yellow to your painting workspace. Terracotta is another helpful paint color to have on hand when designing a copper pot. Try using a medium-brown tone for this project. Since copper relies on a lot of bright, warm colors, you don’t want the brown to overwhelm your piece of art. Draw a round outline of a pot onto your canvas with brown paint. Dip a small, thin brush into your brown paint. Work the brush around the canvas in a circular or cylindrical shape, depending on the shape of your reference pot. Focus on developing the rough curves and body of the pot, so you can fill it in with different tints and shades later. Don’t worry if your design isn’t exact—you can always fine-tune the details later on! Shade in the pot with a thin layer of brown paint. Dip your brush into your brown paint and fill in the shape that you’ve sketched out. Try to keep this layer as thin as possible; since you’ll layering other paint colors onto the pot, you don’t want the brown to be too overbearing. Instead, use long, full strokes to color in the round shape that you’ve created. You might find it easier to work on a brown backdrop than the color of your background. Painting the Base Colors Mix white paint with a speck of yellow and red. Scoop a pea-sized amount of white paint with your palette knife and place it on a blank portion of your palette. After wiping off the knife, dip into your red-orange paint and mix it in with the white. Repeat this process with the yellow paint, then combine all 3 colors together. Mixing with a palette knife involves both scooping and mixing the paint. Use the base of the knife to lift and flip the paint onto the palette, then mix the paint colors together with a stirring motion. This shade helps create the reflections of light that are visible on the surface and rim of the copper pot. Brush the off-white paint along the center base and rim of the pot. Dip your brush into your new paint color, then dab the paint onto the canvas. Focus on the central, front section of the pot, or wherever the light source is directly hitting the copper. Paint a small, blueberry-sized white smudge on this area, then apply a line of off-white paint along the back rim of the pot. The off-white paint creates “reflective” spots, which mimic where the light source directly hits the copper pot. Combine brown, red-orange, and white paint to make a copper shade. Scoop a pea-sized amount of brown paint onto a separate section of the palette. After wiping off your palette knife, take a pinhead-sized amount of red-orange paint and mix it in with the brown. Lighten this shade by stirring your new shade of brown paint with a pea-sized amount of white. To make the shade especially bright, try mixing a speck of red-orange paint with the white. Then, mix the brown with this lightened red-orange paint to create your bright, copper shade. If you aren’t happy with the colors you’ve created on your palette, try experimenting with the paint ratios! For instance, if your copper brown paint color seems too dark, try stirring in a fleck of white paint to lighten it up! Spread copper paint around the base of the pot. Dip your brush into the copper brown shade, then apply the paint to the left side of the pot. Use small strokes to spread the paint, dabbing and blending the copper brown with the off-white reflective spot as you go. Try to color in the left ⅔ of the pot with copper paint, as this is where the light is hitting the metal. Don’t worry if the colors look blotchy or out-of-place. Oil painting requires a lot of blending and mixing, which you’ll doing as you add more colors.Did you know? Unlike other modes of painting, you don’t need to rinse off your brush before dipping into a new color of paint. This style of paint application helps the painting to look more fluid and blended. Shading in the Details Blend red-orange paint in the left half of the pot to create a bright color. Dip into your red-orange paint, and begin painting the left side of the pot. Work in small, careful strokes, blending this brighter paint in with the base copper color. Only apply this paint to the left side of the pot, so you can contrast with the darker shades in the painting. Although the light source is hitting the left ⅔ of the pot, you want the left half of the pot to be as bright as possible. This creates a more gradual progression of color throughout the painting, as the pot transitions from lighter copper shades to shadowy tones. Add brown and red to the right half to create a shadowed effect. Use the tip of your brush to mix a fleck of red-orange into the brown section of paint on your palette. To make this shade slightly lighter, use your brush to stir in a speck of white. Once the dark copper shade is thoroughly mixed, spread this new shade along the right ⅓ of the copper pot. Work in short, careful strokes, so you can blend this shade with the brighter copper tones that are already there. If your dark copper shade looks too muted and cool, try mixing specks of black and red-orange into the paint color. Ideally, you don’t want to use any cool shades to paint a copper pot. Mix black and brown to shade the inside of the pot. Use your brush to move a pea-sized amount of brown paint to another section of your palette. With the same brush, stir a speck of black paint into the brown to create a darker shade. Once this new color is fully mixed together, dab the paint onto the top portion of the copper pot so you can shade the bottom half of the inner rim. This color needs to be darker than the right ⅓ of the pot. Include red and brown to make the inner rim more pronounced. Dip your brush into your red-brown paint mixture and spread it over the upper half of the pot’s inner rim. Add the paint in small, gradual strokes, so the brighter shade blends in with the black-brown paint that you just applied. Continue applying the paint in small strokes, slowly blending and mixing the red-brown with the off-white reflective splotch on the pot’s rim. There isn’t an exact way to shade your copper pot. Try experimenting by adding white and black paint to different shades, so you can lighten or deepen the colors on your palette! Highlight the center of the pot with red-brown. Dip into your red-brown shade, and apply this paint around the left half of the pot’s base. Apply the paint in small strokes, spreading a reddish-brown sheen to the front of your pot. As you work, blend this red-brown color into the darker shadows along the right ⅓ of the pot, so the color transition looks more gradual. If you’d like to use a brighter brown shade, dip into a separate terracotta oil paint instead. Lighten the left edge of the pot with a touch of light gray. Use a palette knife to scoop a pea-sized amount of white paint over to an empty section of your palette. Next, stir a speck of black into the white, creating a light gray shade. Dip into this new paint with your brush, spreading the gray along the left edge of the pot’s base. Work in small, gradual strokes so you can blend the gray with the light copper shades.",
    "sentences": [
        " Sketching the Design on Canvas Paint a solid background color to serve as a backdrop.",
        "Dip your brush into the background color of your choice, and begin filling in your canvas.",
        "Since you want the copper pot to be the focal point of your painting, choose a dark or neutral color as your backdrop, like dark green or blue.",
        "If you’d rather create an informal background, try using a dusty brown or tan shade instead.",
        "Your background doesn’t have to include any fancy design.",
        "If you’re trying to hone your painting skills, make the copper pot the central focus of your painting.",
        "Wait 24 hours for the paint to dry.",
        "Paint your backdrop ahead of time, so you can focus specifically on your copper pot.",
        "Since oil paints typically take 1 day to dry fully, prepare your canvas and backdrop with these time limits in mind.",
        "If you don’t want to worry about drying time, try painting around the center portion of your canvas.",
        "Use this free, unpainted space for your copper pot!",
        "Set up a copper pot to serve as a reference.",
        "Place a copper pot on a ledge or other prominent location near your painting area.",
        "If you don’t have a physical pot on hand, print out a picture to hang near your canvas.",
        "Ideally, use a reference that’s angled in the light, so you can practice shading and tinting your paints later on.Shading involves adding black to a color, while tinting involves adding white.",
        "Try using a single pot as a reference, instead of multiple pots, plates, and utensils.",
        "Scoop small amounts of warm and neutral-toned paints on your palette.",
        "Copper can be a tricky color to capture on canvas, so you’ll need a variety of bright and muddy colors at your disposal.",
        "To start, arrange a grape-sized amount of brown, black, and white paint on your palette.",
        "Additionally, add dime-sized amounts of red-orange and yellow to your painting workspace.",
        "Terracotta is another helpful paint color to have on hand when designing a copper pot.",
        "Try using a medium-brown tone for this project.",
        "Since copper relies on a lot of bright, warm colors, you don’t want the brown to overwhelm your piece of art.",
        "Draw a round outline of a pot onto your canvas with brown paint.",
        "Dip a small, thin brush into your brown paint.",
        "Work the brush around the canvas in a circular or cylindrical shape, depending on the shape of your reference pot.",
        "Focus on developing the rough curves and body of the pot, so you can fill it in with different tints and shades later.",
        "Don’t worry if your design isn’t exact—you can always fine-tune the details later on!",
        "Shade in the pot with a thin layer of brown paint.",
        "Dip your brush into your brown paint and fill in the shape that you’ve sketched out.",
        "Try to keep this layer as thin as possible; since you’ll layering other paint colors onto the pot, you don’t want the brown to be too overbearing.",
        "Instead, use long, full strokes to color in the round shape that you’ve created.",
        "You might find it easier to work on a brown backdrop than the color of your background.",
        "Painting the Base Colors Mix white paint with a speck of yellow and red.",
        "Scoop a pea-sized amount of white paint with your palette knife and place it on a blank portion of your palette.",
        "After wiping off the knife, dip into your red-orange paint and mix it in with the white.",
        "Repeat this process with the yellow paint, then combine all 3 colors together.",
        "Mixing with a palette knife involves both scooping and mixing the paint.",
        "Use the base of the knife to lift and flip the paint onto the palette, then mix the paint colors together with a stirring motion.",
        "This shade helps create the reflections of light that are visible on the surface and rim of the copper pot.",
        "Brush the off-white paint along the center base and rim of the pot.",
        "Dip your brush into your new paint color, then dab the paint onto the canvas.",
        "Focus on the central, front section of the pot, or wherever the light source is directly hitting the copper.",
        "Paint a small, blueberry-sized white smudge on this area, then apply a line of off-white paint along the back rim of the pot.",
        "The off-white paint creates “reflective” spots, which mimic where the light source directly hits the copper pot.",
        "Combine brown, red-orange, and white paint to make a copper shade.",
        "Scoop a pea-sized amount of brown paint onto a separate section of the palette.",
        "After wiping off your palette knife, take a pinhead-sized amount of red-orange paint and mix it in with the brown.",
        "Lighten this shade by stirring your new shade of brown paint with a pea-sized amount of white.",
        "To make the shade especially bright, try mixing a speck of red-orange paint with the white.",
        "Then, mix the brown with this lightened red-orange paint to create your bright, copper shade.",
        "If you aren’t happy with the colors you’ve created on your palette, try experimenting with the paint ratios!",
        "For instance, if your copper brown paint color seems too dark, try stirring in a fleck of white paint to lighten it up!",
        "Spread copper paint around the base of the pot.",
        "Dip your brush into the copper brown shade, then apply the paint to the left side of the pot.",
        "Use small strokes to spread the paint, dabbing and blending the copper brown with the off-white reflective spot as you go.",
        "Try to color in the left ⅔ of the pot with copper paint, as this is where the light is hitting the metal.",
        "Don’t worry if the colors look blotchy or out-of-place.",
        "Oil painting requires a lot of blending and mixing, which you’ll doing as you add more colors.Did you know?",
        "Unlike other modes of painting, you don’t need to rinse off your brush before dipping into a new color of paint.",
        "This style of paint application helps the painting to look more fluid and blended.",
        "Shading in the Details Blend red-orange paint in the left half of the pot to create a bright color.",
        "Dip into your red-orange paint, and begin painting the left side of the pot.",
        "Work in small, careful strokes, blending this brighter paint in with the base copper color.",
        "Only apply this paint to the left side of the pot, so you can contrast with the darker shades in the painting.",
        "Although the light source is hitting the left ⅔ of the pot, you want the left half of the pot to be as bright as possible.",
        "This creates a more gradual progression of color throughout the painting, as the pot transitions from lighter copper shades to shadowy tones.",
        "Add brown and red to the right half to create a shadowed effect.",
        "Use the tip of your brush to mix a fleck of red-orange into the brown section of paint on your palette.",
        "To make this shade slightly lighter, use your brush to stir in a speck of white.",
        "Once the dark copper shade is thoroughly mixed, spread this new shade along the right ⅓ of the copper pot.",
        "Work in short, careful strokes, so you can blend this shade with the brighter copper tones that are already there.",
        "If your dark copper shade looks too muted and cool, try mixing specks of black and red-orange into the paint color.",
        "Ideally, you don’t want to use any cool shades to paint a copper pot.",
        "Mix black and brown to shade the inside of the pot.",
        "Use your brush to move a pea-sized amount of brown paint to another section of your palette.",
        "With the same brush, stir a speck of black paint into the brown to create a darker shade.",
        "Once this new color is fully mixed together, dab the paint onto the top portion of the copper pot so you can shade the bottom half of the inner rim.",
        "This color needs to be darker than the right ⅓ of the pot.",
        "Include red and brown to make the inner rim more pronounced.",
        "Dip your brush into your red-brown paint mixture and spread it over the upper half of the pot’s inner rim.",
        "Add the paint in small, gradual strokes, so the brighter shade blends in with the black-brown paint that you just applied.",
        "Continue applying the paint in small strokes, slowly blending and mixing the red-brown with the off-white reflective splotch on the pot’s rim.",
        "There isn’t an exact way to shade your copper pot.",
        "Try experimenting by adding white and black paint to different shades, so you can lighten or deepen the colors on your palette!",
        "Highlight the center of the pot with red-brown.",
        "Dip into your red-brown shade, and apply this paint around the left half of the pot’s base.",
        "Apply the paint in small strokes, spreading a reddish-brown sheen to the front of your pot.",
        "As you work, blend this red-brown color into the darker shadows along the right ⅓ of the pot, so the color transition looks more gradual.",
        "If you’d like to use a brighter brown shade, dip into a separate terracotta oil paint instead.",
        "Lighten the left edge of the pot with a touch of light gray.",
        "Use a palette knife to scoop a pea-sized amount of white paint over to an empty section of your palette.",
        "Next, stir a speck of black into the white, creating a light gray shade.",
        "Dip into this new paint with your brush, spreading the gray along the left edge of the pot’s base.",
        "Work in small, gradual strokes so you can blend the gray with the light copper shades."
    ]
}