{
    "title": "How to Make Indoor Halloween Decorations",
    "url": "https://www.wikihow.com/Make-Indoor-Halloween-Decorations",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Halloween",
        "Halloween Decorations"
    ],
    "methods": [
        {
            "name": "Hanging Halloween Garland",
            "steps": [
                {
                    "headline": "Pick a phrase or object for your garland.",
                    "description": "The Halloween garland can come in a variety of styles. Festive phrases like “Happy Halloween” or “Trick or Treat” are good choices. You can also make objects like pumpkins or bats. Decide which direction you’d like to take for your garland. Remember, you can make different streams of garland. Mix it up for a festive atmosphere. Make one streamer with pumpkins, one with black cats, and another saying “Happy Halloween.”"
                },
                {
                    "headline": "Get colored construction paper to match your garland theme.",
                    "description": "The specific colors you use depends on what your garland theme is. Envision the objects you’re going to make, and get construction paper that matches the colors you’ll need. For Halloween, orange and black are always good choices. For different characters or objects, mix up the colors. For example, purple would work for a witch’s hat and stockings, while yellow would look good as a black cat’s eyes."
                },
                {
                    "headline": "Cut out the letters to spell out festive phrases.",
                    "description": "If you want your garland to say something like \"Happy Halloween,\" then use one sheet of construction paper for each letter. Draw out each letter in block text and cut around those lines. Continue the process until you have the entire word or phrase cut out. You can also print out the letters on colored paper and cut them out. This avoids tracing out your own letters. For another idea, cut out letters in orange and glue them onto black paper, or vice versa. “Happy Halloween” in orange glued onto black paper would look festive. You can also make multiple garland streams with different phrases like \"Trick or Treat.\""
                },
                {
                    "headline": "Cut out the shapes or objects you want to use on your garland.",
                    "description": "If you prefer objects like bats instead of phrases on the garland, then follow the same process. Take a piece of construction paper and trace out the shape you want to hang on your garland in pencil. Then cut around the lines to make the shape you want. Repeat this as many times as you have to and get the right amount of shapes. If you’re cutting bats, for example, draw out a bat shape on a piece of black construction paper. Then cut along the line to make your bat. Repeat the process and cut out as many bats as you need. You can also mix it up with different streams using phrases and objects. Make as many as you want to. If you don't want to draw out the shapes, then print them out on colored paper and cut along the lines. You can also use these printouts as a template to trace so your shapes are all uniform. Shapes can also mix into phrases. Placing a pumpkin between each letter of \"Trick or Treat\" on the same garland stream mixes up your decorations."
                },
                {
                    "headline": "Decorate the pieces more if you want to.",
                    "description": "Some solid-colored objects are okay, like bats or pumpkins. But you may want to decorate the paper a little more. If you want to make a jack-o-lantern, for example, cut out eyes, a nose, and a mouth in black paper. Then glue those pieces on the front of the pumpkin. Repeat this as needed to make characters for your garland. If you don’t want to worry about cutting and gluing more paper, then use markers to draw on the paper instead."
                },
                {
                    "headline": "Punch holes in the top of each piece.",
                    "description": "This is to make a space for the string to pass through. Take a small hole puncher and make a hole at the top of each piece you want to hang. Letters are more difficult to punch holes in. Make the hole on the same side of each letter so they hang at the same angle."
                },
                {
                    "headline": "Run a string through each hole.",
                    "description": "Connect all the pieces together by tucking the string through each hole you punched. If possible, try to find a string color that matches the theme. Black string for jack-o-lanterns, for example, would look better than white string. Don't mix up the order of the letters if you're spelling out a word. Make sure that each word is spelled correctly."
                },
                {
                    "headline": "Tape each end of the string to an opposite side of the room.",
                    "description": "Now it’s time to hang your garland. Stand on a stepstool and tape one end on the ceiling. Then walk to a different spot so the garland makes a semi-circle and tape the other end there. Repeat this process for as many streams of garland you want. Remember that you can make several different themes to make your home especially festive. Be careful standing on a stepstool. Make sure it’s secure and not wobbly."
                }
            ]
        },
        {
            "name": "Cutting Paper Wall Decorations",
            "steps": [
                {
                    "headline": "Decide which shapes and objects you want to place on the wall.",
                    "description": "There are tons of choices for Halloween. Witches, black cats, pumpkins, and jack-o-lanterns would all bring a great holiday tone to your home. Pick out the shapes you want to make sure you get the right materials. Remember, you don’t have to stick with one. Make as many different shapes as you want to mix up your decorations."
                },
                {
                    "headline": "Get colored construction paper that matches your decoration idea.",
                    "description": "The specific colors you use depends on which shapes you want to make. Envision the objects you’re going to make, and get construction paper that matches the colors you’ll need. Classic Halloween colors are orange and black, so plan some shapes that use the color schemes like jack-o-lanterns. Mix in other colors like green, purple, and yellow for an even more festive tone. For bigger cutouts, try finding larger pieces of construction paper at the craft store. You could also glue multiple pieces of construction paper together to make bigger objects."
                },
                {
                    "headline": "Cut out the shapes you want to hang on your walls.",
                    "description": "Take a sheet of construction paper that matches the color you want to use. Then use a pencil and draw out the shape you want. Cut along those lines to make the object. Repeat this for as many pieces as you want to hang. To make a pumpkin, for example, draw out a pumpkin shape on a piece of orange construction paper. Then cut around the lines you drew. To make your designs uniform and easier to draw, try downloading and printing a template of the object you want. Then trace it onto the construction paper. This makes the drawing much easier."
                },
                {
                    "headline": "Decorate the shapes more if you want to.",
                    "description": "You can leave each cutout plain if you want to. If you want to decorate them, then use markers to accent the pieces a little more. Turn a plain pumpkin into a jack-o-lantern by drawing a face on it with a black marker. You can also cut out additional shapes and glue them on the cutouts, like making a paper witch. Get creative and decorate however you want. This is a great activity for kids, too. Le them draw or places stickers on the shapes to help decorate."
                },
                {
                    "headline": "Tape the cutouts to your walls.",
                    "description": "Finally, use clear tape and hang the cutouts around your home. Either dedicate one wall as your decorations wall, or spread them around to make the whole home feel festive."
                }
            ]
        },
        {
            "name": "Filling Creepy Specimen Jars",
            "steps": [
                {
                    "headline": "Collect a few empty glass jars.",
                    "description": "Old sauce or food jars will work perfectly. Wash the jars out to remove any remaining food remnants. If the jars have labels on them, peel them off. Then wash and scrub the jar to remove any remnants of the label. If you don’t have any jars lying around, you can buy some at craft stores. Other clear containers work as well. Test tubes or beakers also give off a creepy laboratory vibe."
                },
                {
                    "headline": "Drop Halloween-themed objects into each jar.",
                    "description": "Get creative and look for creepy objects that would look good in jars. Toy bugs, eyeballs, doll parts, skulls, or any other scary things you come across would be great. Then drop a few into each jar. Some objects may float in water. If they do, weigh them down by taping a coin to the bottom. Alternatively, put many of them in the jar so they force themselves down. If you don't have any suitable Halloween objects, then you can skip this step. Colored water alone will also look creepy!"
                },
                {
                    "headline": "Fill the jars with water and add 2 drops of food coloring.",
                    "description": "Hold each jar under the sink and fill it up. Then take different food colorings and add a few drops to each jar. Stir lightly so all the water changes color. Then scatter them throughout your home to make it look like a creepy laboratory. Remember to put the lids back on the jars to prevent spills."
                },
                {
                    "headline": "Pack the jars with Spanish moss for a water-free option.",
                    "description": "If you don’t want to worry about water making a mess, then get some Spanish moss from a craft store. Pack this around the Halloween objects instead to give your home a creepy, haunted-house look. If you want to go for a more festive look, you can also use plastic grass from a craft store. Look for orange, purple, or other Halloween colors."
                }
            ]
        },
        {
            "name": "Placing Balloon Spiders on the Ceiling",
            "steps": [
                {
                    "headline": "Get black balloons and black crepe paper.",
                    "description": "These are all the pieces you need to make creepy spider decorations. Both are widely available from craft stores or online. Crepe paper may come in long rolls or individual strips. If the paper comes in a roll, cut the paper into 3 ft (0.91 m) sections."
                },
                {
                    "headline": "Blow up the balloon.",
                    "description": "You don’t have to use helium to fill the balloons. Just using your breath is enough. Tie the end of the balloon tightly so it doesn’t come undone."
                },
                {
                    "headline": "Tape 8 strips of crepe paper to one side of the balloon.",
                    "description": "Cut 8 strips of paper so they're 3 feet (0.91 m) long. Pick a central spot on one side of the balloon. Then tape the strips of crepe paper to this point. Arrange the paper so 4 strips come out from one side and 4 strips come out from the other, like a spider’s legs. The lengths of the strips depend on the look you’re going for. Making the strips long, like on a daddy long leg, gives an extra creepy vibe. The legs don’t have to be a uniform length. Different lengths could add to the creepiness of the decoration because it looks unnatural."
                },
                {
                    "headline": "Hang the balloon on the ceiling with tape.",
                    "description": "Pick any spot on the ceiling. This decoration looks especially good in the corner of a room, resembling a spider hiding away. Fold a piece of tape over itself and stick it onto the point where the legs are taped down. Then raise it up to the ceiling and attach it. Be careful standing on a stepstool or chair. Have someone nearby in case you need help. Don’t press the balloon down too hard or you could pop it."
                },
                {
                    "headline": "Tape the end of each leg to the ceiling.",
                    "description": "Attach tape to the end of each strip of paper. Then attach it to the ceiling so the leg loops down. Repeat this for all the spider’s legs to complete the decoration. To give a walking effect, also tape the center of each strip to the ceiling. This makes it look like the spider has a joint in its leg. Make as many of these spider decorations as you want."
                }
            ]
        }
    ],
    "tyn": [
        "Hanging Halloween Garland",
        "Scissors",
        "Construction paper",
        "Glue",
        "String",
        "Clear tape",
        "Cutting Paper Wall Decorations",
        "Markers",
        "Filling Creepy Specimen Jars",
        "Clear glass jars",
        "Water",
        "Food coloring",
        "Toys or objects to put in the jars",
        "Placing Balloon Spiders on the Ceiling",
        "Black balloons",
        "Black crepe paper",
        "Tape"
    ],
    "text": " Hanging Halloween Garland Pick a phrase or object for your garland. The Halloween garland can come in a variety of styles. Festive phrases like “Happy Halloween” or “Trick or Treat” are good choices. You can also make objects like pumpkins or bats. Decide which direction you’d like to take for your garland. Remember, you can make different streams of garland. Mix it up for a festive atmosphere. Make one streamer with pumpkins, one with black cats, and another saying “Happy Halloween.” Get colored construction paper to match your garland theme. The specific colors you use depends on what your garland theme is. Envision the objects you’re going to make, and get construction paper that matches the colors you’ll need. For Halloween, orange and black are always good choices. For different characters or objects, mix up the colors. For example, purple would work for a witch’s hat and stockings, while yellow would look good as a black cat’s eyes. Cut out the letters to spell out festive phrases. If you want your garland to say something like \"Happy Halloween,\" then use one sheet of construction paper for each letter. Draw out each letter in block text and cut around those lines. Continue the process until you have the entire word or phrase cut out. You can also print out the letters on colored paper and cut them out. This avoids tracing out your own letters. For another idea, cut out letters in orange and glue them onto black paper, or vice versa. “Happy Halloween” in orange glued onto black paper would look festive. You can also make multiple garland streams with different phrases like \"Trick or Treat.\" Cut out the shapes or objects you want to use on your garland. If you prefer objects like bats instead of phrases on the garland, then follow the same process. Take a piece of construction paper and trace out the shape you want to hang on your garland in pencil. Then cut around the lines to make the shape you want. Repeat this as many times as you have to and get the right amount of shapes. If you’re cutting bats, for example, draw out a bat shape on a piece of black construction paper. Then cut along the line to make your bat. Repeat the process and cut out as many bats as you need. You can also mix it up with different streams using phrases and objects. Make as many as you want to. If you don't want to draw out the shapes, then print them out on colored paper and cut along the lines. You can also use these printouts as a template to trace so your shapes are all uniform. Shapes can also mix into phrases. Placing a pumpkin between each letter of \"Trick or Treat\" on the same garland stream mixes up your decorations. Decorate the pieces more if you want to. Some solid-colored objects are okay, like bats or pumpkins. But you may want to decorate the paper a little more. If you want to make a jack-o-lantern, for example, cut out eyes, a nose, and a mouth in black paper. Then glue those pieces on the front of the pumpkin. Repeat this as needed to make characters for your garland. If you don’t want to worry about cutting and gluing more paper, then use markers to draw on the paper instead. Punch holes in the top of each piece. This is to make a space for the string to pass through. Take a small hole puncher and make a hole at the top of each piece you want to hang. Letters are more difficult to punch holes in. Make the hole on the same side of each letter so they hang at the same angle. Run a string through each hole. Connect all the pieces together by tucking the string through each hole you punched. If possible, try to find a string color that matches the theme. Black string for jack-o-lanterns, for example, would look better than white string. Don't mix up the order of the letters if you're spelling out a word. Make sure that each word is spelled correctly. Tape each end of the string to an opposite side of the room. Now it’s time to hang your garland. Stand on a stepstool and tape one end on the ceiling. Then walk to a different spot so the garland makes a semi-circle and tape the other end there. Repeat this process for as many streams of garland you want. Remember that you can make several different themes to make your home especially festive. Be careful standing on a stepstool. Make sure it’s secure and not wobbly. Cutting Paper Wall Decorations Decide which shapes and objects you want to place on the wall. There are tons of choices for Halloween. Witches, black cats, pumpkins, and jack-o-lanterns would all bring a great holiday tone to your home. Pick out the shapes you want to make sure you get the right materials. Remember, you don’t have to stick with one. Make as many different shapes as you want to mix up your decorations. Get colored construction paper that matches your decoration idea. The specific colors you use depends on which shapes you want to make. Envision the objects you’re going to make, and get construction paper that matches the colors you’ll need. Classic Halloween colors are orange and black, so plan some shapes that use the color schemes like jack-o-lanterns. Mix in other colors like green, purple, and yellow for an even more festive tone. For bigger cutouts, try finding larger pieces of construction paper at the craft store. You could also glue multiple pieces of construction paper together to make bigger objects. Cut out the shapes you want to hang on your walls. Take a sheet of construction paper that matches the color you want to use. Then use a pencil and draw out the shape you want. Cut along those lines to make the object. Repeat this for as many pieces as you want to hang. To make a pumpkin, for example, draw out a pumpkin shape on a piece of orange construction paper. Then cut around the lines you drew. To make your designs uniform and easier to draw, try downloading and printing a template of the object you want. Then trace it onto the construction paper. This makes the drawing much easier. Decorate the shapes more if you want to. You can leave each cutout plain if you want to. If you want to decorate them, then use markers to accent the pieces a little more. Turn a plain pumpkin into a jack-o-lantern by drawing a face on it with a black marker. You can also cut out additional shapes and glue them on the cutouts, like making a paper witch. Get creative and decorate however you want. This is a great activity for kids, too. Le them draw or places stickers on the shapes to help decorate. Tape the cutouts to your walls. Finally, use clear tape and hang the cutouts around your home. Either dedicate one wall as your decorations wall, or spread them around to make the whole home feel festive. Filling Creepy Specimen Jars Collect a few empty glass jars. Old sauce or food jars will work perfectly. Wash the jars out to remove any remaining food remnants. If the jars have labels on them, peel them off. Then wash and scrub the jar to remove any remnants of the label. If you don’t have any jars lying around, you can buy some at craft stores. Other clear containers work as well. Test tubes or beakers also give off a creepy laboratory vibe. Drop Halloween-themed objects into each jar. Get creative and look for creepy objects that would look good in jars. Toy bugs, eyeballs, doll parts, skulls, or any other scary things you come across would be great. Then drop a few into each jar. Some objects may float in water. If they do, weigh them down by taping a coin to the bottom. Alternatively, put many of them in the jar so they force themselves down. If you don't have any suitable Halloween objects, then you can skip this step. Colored water alone will also look creepy! Fill the jars with water and add 2 drops of food coloring. Hold each jar under the sink and fill it up. Then take different food colorings and add a few drops to each jar. Stir lightly so all the water changes color. Then scatter them throughout your home to make it look like a creepy laboratory. Remember to put the lids back on the jars to prevent spills. Pack the jars with Spanish moss for a water-free option. If you don’t want to worry about water making a mess, then get some Spanish moss from a craft store. Pack this around the Halloween objects instead to give your home a creepy, haunted-house look. If you want to go for a more festive look, you can also use plastic grass from a craft store. Look for orange, purple, or other Halloween colors. Placing Balloon Spiders on the Ceiling Get black balloons and black crepe paper. These are all the pieces you need to make creepy spider decorations. Both are widely available from craft stores or online. Crepe paper may come in long rolls or individual strips. If the paper comes in a roll, cut the paper into 3 ft (0.91 m) sections. Blow up the balloon. You don’t have to use helium to fill the balloons. Just using your breath is enough. Tie the end of the balloon tightly so it doesn’t come undone. Tape 8 strips of crepe paper to one side of the balloon. Cut 8 strips of paper so they're 3 feet (0.91 m) long. Pick a central spot on one side of the balloon. Then tape the strips of crepe paper to this point. Arrange the paper so 4 strips come out from one side and 4 strips come out from the other, like a spider’s legs. The lengths of the strips depend on the look you’re going for. Making the strips long, like on a daddy long leg, gives an extra creepy vibe. The legs don’t have to be a uniform length. Different lengths could add to the creepiness of the decoration because it looks unnatural. Hang the balloon on the ceiling with tape. Pick any spot on the ceiling. This decoration looks especially good in the corner of a room, resembling a spider hiding away. Fold a piece of tape over itself and stick it onto the point where the legs are taped down. Then raise it up to the ceiling and attach it. Be careful standing on a stepstool or chair. Have someone nearby in case you need help. Don’t press the balloon down too hard or you could pop it. Tape the end of each leg to the ceiling. Attach tape to the end of each strip of paper. Then attach it to the ceiling so the leg loops down. Repeat this for all the spider’s legs to complete the decoration. To give a walking effect, also tape the center of each strip to the ceiling. This makes it look like the spider has a joint in its leg. Make as many of these spider decorations as you want.",
    "sentences": [
        " Hanging Halloween Garland Pick a phrase or object for your garland.",
        "The Halloween garland can come in a variety of styles.",
        "Festive phrases like “Happy Halloween” or “Trick or Treat” are good choices.",
        "You can also make objects like pumpkins or bats.",
        "Decide which direction you’d like to take for your garland.",
        "Remember, you can make different streams of garland.",
        "Mix it up for a festive atmosphere.",
        "Make one streamer with pumpkins, one with black cats, and another saying “Happy Halloween.” Get colored construction paper to match your garland theme.",
        "The specific colors you use depends on what your garland theme is.",
        "Envision the objects you’re going to make, and get construction paper that matches the colors you’ll need.",
        "For Halloween, orange and black are always good choices.",
        "For different characters or objects, mix up the colors.",
        "For example, purple would work for a witch’s hat and stockings, while yellow would look good as a black cat’s eyes.",
        "Cut out the letters to spell out festive phrases.",
        "If you want your garland to say something like \"Happy Halloween,\" then use one sheet of construction paper for each letter.",
        "Draw out each letter in block text and cut around those lines.",
        "Continue the process until you have the entire word or phrase cut out.",
        "You can also print out the letters on colored paper and cut them out.",
        "This avoids tracing out your own letters.",
        "For another idea, cut out letters in orange and glue them onto black paper, or vice versa.",
        "“Happy Halloween” in orange glued onto black paper would look festive.",
        "You can also make multiple garland streams with different phrases like \"Trick or Treat.\"",
        "Cut out the shapes or objects you want to use on your garland.",
        "If you prefer objects like bats instead of phrases on the garland, then follow the same process.",
        "Take a piece of construction paper and trace out the shape you want to hang on your garland in pencil.",
        "Then cut around the lines to make the shape you want.",
        "Repeat this as many times as you have to and get the right amount of shapes.",
        "If you’re cutting bats, for example, draw out a bat shape on a piece of black construction paper.",
        "Then cut along the line to make your bat.",
        "Repeat the process and cut out as many bats as you need.",
        "You can also mix it up with different streams using phrases and objects.",
        "Make as many as you want to.",
        "If you don't want to draw out the shapes, then print them out on colored paper and cut along the lines.",
        "You can also use these printouts as a template to trace so your shapes are all uniform.",
        "Shapes can also mix into phrases.",
        "Placing a pumpkin between each letter of \"Trick or Treat\" on the same garland stream mixes up your decorations.",
        "Decorate the pieces more if you want to.",
        "Some solid-colored objects are okay, like bats or pumpkins.",
        "But you may want to decorate the paper a little more.",
        "If you want to make a jack-o-lantern, for example, cut out eyes, a nose, and a mouth in black paper.",
        "Then glue those pieces on the front of the pumpkin.",
        "Repeat this as needed to make characters for your garland.",
        "If you don’t want to worry about cutting and gluing more paper, then use markers to draw on the paper instead.",
        "Punch holes in the top of each piece.",
        "This is to make a space for the string to pass through.",
        "Take a small hole puncher and make a hole at the top of each piece you want to hang.",
        "Letters are more difficult to punch holes in.",
        "Make the hole on the same side of each letter so they hang at the same angle.",
        "Run a string through each hole.",
        "Connect all the pieces together by tucking the string through each hole you punched.",
        "If possible, try to find a string color that matches the theme.",
        "Black string for jack-o-lanterns, for example, would look better than white string.",
        "Don't mix up the order of the letters if you're spelling out a word.",
        "Make sure that each word is spelled correctly.",
        "Tape each end of the string to an opposite side of the room.",
        "Now it’s time to hang your garland.",
        "Stand on a stepstool and tape one end on the ceiling.",
        "Then walk to a different spot so the garland makes a semi-circle and tape the other end there.",
        "Repeat this process for as many streams of garland you want.",
        "Remember that you can make several different themes to make your home especially festive.",
        "Be careful standing on a stepstool.",
        "Make sure it’s secure and not wobbly.",
        "Cutting Paper Wall Decorations Decide which shapes and objects you want to place on the wall.",
        "There are tons of choices for Halloween.",
        "Witches, black cats, pumpkins, and jack-o-lanterns would all bring a great holiday tone to your home.",
        "Pick out the shapes you want to make sure you get the right materials.",
        "Remember, you don’t have to stick with one.",
        "Make as many different shapes as you want to mix up your decorations.",
        "Get colored construction paper that matches your decoration idea.",
        "The specific colors you use depends on which shapes you want to make.",
        "Envision the objects you’re going to make, and get construction paper that matches the colors you’ll need.",
        "Classic Halloween colors are orange and black, so plan some shapes that use the color schemes like jack-o-lanterns.",
        "Mix in other colors like green, purple, and yellow for an even more festive tone.",
        "For bigger cutouts, try finding larger pieces of construction paper at the craft store.",
        "You could also glue multiple pieces of construction paper together to make bigger objects.",
        "Cut out the shapes you want to hang on your walls.",
        "Take a sheet of construction paper that matches the color you want to use.",
        "Then use a pencil and draw out the shape you want.",
        "Cut along those lines to make the object.",
        "Repeat this for as many pieces as you want to hang.",
        "To make a pumpkin, for example, draw out a pumpkin shape on a piece of orange construction paper.",
        "Then cut around the lines you drew.",
        "To make your designs uniform and easier to draw, try downloading and printing a template of the object you want.",
        "Then trace it onto the construction paper.",
        "This makes the drawing much easier.",
        "Decorate the shapes more if you want to.",
        "You can leave each cutout plain if you want to.",
        "If you want to decorate them, then use markers to accent the pieces a little more.",
        "Turn a plain pumpkin into a jack-o-lantern by drawing a face on it with a black marker.",
        "You can also cut out additional shapes and glue them on the cutouts, like making a paper witch.",
        "Get creative and decorate however you want.",
        "This is a great activity for kids, too.",
        "Le them draw or places stickers on the shapes to help decorate.",
        "Tape the cutouts to your walls.",
        "Finally, use clear tape and hang the cutouts around your home.",
        "Either dedicate one wall as your decorations wall, or spread them around to make the whole home feel festive.",
        "Filling Creepy Specimen Jars Collect a few empty glass jars.",
        "Old sauce or food jars will work perfectly.",
        "Wash the jars out to remove any remaining food remnants.",
        "If the jars have labels on them, peel them off.",
        "Then wash and scrub the jar to remove any remnants of the label.",
        "If you don’t have any jars lying around, you can buy some at craft stores.",
        "Other clear containers work as well.",
        "Test tubes or beakers also give off a creepy laboratory vibe.",
        "Drop Halloween-themed objects into each jar.",
        "Get creative and look for creepy objects that would look good in jars.",
        "Toy bugs, eyeballs, doll parts, skulls, or any other scary things you come across would be great.",
        "Then drop a few into each jar.",
        "Some objects may float in water.",
        "If they do, weigh them down by taping a coin to the bottom.",
        "Alternatively, put many of them in the jar so they force themselves down.",
        "If you don't have any suitable Halloween objects, then you can skip this step.",
        "Colored water alone will also look creepy!",
        "Fill the jars with water and add 2 drops of food coloring.",
        "Hold each jar under the sink and fill it up.",
        "Then take different food colorings and add a few drops to each jar.",
        "Stir lightly so all the water changes color.",
        "Then scatter them throughout your home to make it look like a creepy laboratory.",
        "Remember to put the lids back on the jars to prevent spills.",
        "Pack the jars with Spanish moss for a water-free option.",
        "If you don’t want to worry about water making a mess, then get some Spanish moss from a craft store.",
        "Pack this around the Halloween objects instead to give your home a creepy, haunted-house look.",
        "If you want to go for a more festive look, you can also use plastic grass from a craft store.",
        "Look for orange, purple, or other Halloween colors.",
        "Placing Balloon Spiders on the Ceiling Get black balloons and black crepe paper.",
        "These are all the pieces you need to make creepy spider decorations.",
        "Both are widely available from craft stores or online.",
        "Crepe paper may come in long rolls or individual strips.",
        "If the paper comes in a roll, cut the paper into 3 ft (0.91 m) sections.",
        "Blow up the balloon.",
        "You don’t have to use helium to fill the balloons.",
        "Just using your breath is enough.",
        "Tie the end of the balloon tightly so it doesn’t come undone.",
        "Tape 8 strips of crepe paper to one side of the balloon.",
        "Cut 8 strips of paper so they're 3 feet (0.91 m) long.",
        "Pick a central spot on one side of the balloon.",
        "Then tape the strips of crepe paper to this point.",
        "Arrange the paper so 4 strips come out from one side and 4 strips come out from the other, like a spider’s legs.",
        "The lengths of the strips depend on the look you’re going for.",
        "Making the strips long, like on a daddy long leg, gives an extra creepy vibe.",
        "The legs don’t have to be a uniform length.",
        "Different lengths could add to the creepiness of the decoration because it looks unnatural.",
        "Hang the balloon on the ceiling with tape.",
        "Pick any spot on the ceiling.",
        "This decoration looks especially good in the corner of a room, resembling a spider hiding away.",
        "Fold a piece of tape over itself and stick it onto the point where the legs are taped down.",
        "Then raise it up to the ceiling and attach it.",
        "Be careful standing on a stepstool or chair.",
        "Have someone nearby in case you need help.",
        "Don’t press the balloon down too hard or you could pop it.",
        "Tape the end of each leg to the ceiling.",
        "Attach tape to the end of each strip of paper.",
        "Then attach it to the ceiling so the leg loops down.",
        "Repeat this for all the spider’s legs to complete the decoration.",
        "To give a walking effect, also tape the center of each strip to the ceiling.",
        "This makes it look like the spider has a joint in its leg.",
        "Make as many of these spider decorations as you want."
    ]
}