{
    "title": "How to Use Linseed Oil",
    "url": "https://www.wikihow.com/Use-Linseed-Oil",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "methods": [
        {
            "name": "Finishing Wood with Linseed Oil",
            "steps": [
                {
                    "headline": "Sand the surface of your wood that you’d like to finish.",
                    "description": "Use sandpaper to gently remove the top layer of the wood surface that you want to finish. Wipe off any dust with a microfiber cloth. Use caution with your sandpaper so that you don’t gouge or mar the wood surface. Linseed oil will soak in much more readily to wood that has the top layer removed. Use an electric sander to sand your wood much faster."
                },
                {
                    "headline": "Spread a thin line of boiled linseed oil onto the wood surface.",
                    "description": "Dip a paint brush into the linseed oil or spray it out from a squirt bottle directly onto your wood surface. Put a thin line of linseed oil in the middle of your wood surface. This is just the beginning of the finish, and it doesn't have to cover the entire surface yet. You can find boiled linseed oil at most hardware stores."
                },
                {
                    "headline": "Use a clean cloth to swipe the linseed oil in a circular motion.",
                    "description": "Pick up some linseed oil with your cloth from the wood surface. Gently rub the linseed oil in small, circular motions over the entire surface of the wood until most of the oil is soaked in. Linseed oil might stain the cloth that you use. You can use your hands to spread the linseed oil instead since it won’t stain your skin."
                },
                {
                    "headline": "Wait 15 minutes for the linseed oil to dry.",
                    "description": "Before you apply any more layers of linseed oil, let the wood soak up the initial oil that you put down. Leave your wood in a cool, dry place that won’t collect a lot of particles or wood shavings while it sits. As it dries, the linseed oil will look less shiny."
                },
                {
                    "headline": "Apply 3 to 5 more layers of linseed oil until you get your desired finish.",
                    "description": "Linseed oil has a slight yellow tone to it that dries with a shiny finish. Keep applying linseed oil until your wood surface looks the way you’d like it to.Warning: Try not to apply more than 8 layers of linseed oil. Too much oil won’t soak into the wood well and could take a really long time to dry. You can apply a thin layer of paste wax on top of your dried linseed oil if you’d like to make your wood even more shiny looking."
                }
            ]
        },
        {
            "name": "Using Linseed Oil with Oil Paints",
            "steps": [
                {
                    "headline": "Paint a background on a canvas if you’d like one and let it dry.",
                    "description": "Use an artist’s canvas that is big enough for the painting that you’d like to do. If you’d like to, you can use oil paints to create a background with 1 or multiple colors. Painting a background first without linseed oil will make your brush strokes more harsh and less blendable. Let your background dry completely. This is a great technique to have 1 aspect of your painting stand out."
                },
                {
                    "headline": "Brush linseed oil over the entire canvas with a large paintbrush.",
                    "description": "Dip a large paintbrush into your container of linseed oil. Gently swipe the oil in an upward motion across the entire canvas. Make sure you cover the entire canvas in oil so it doesn’t become patchy. Linseed oil will make oil paints more fluid and glossy looking. You can find linseed oil at most art stores. Do not use cold pressed linseed oil with oil paints."
                },
                {
                    "headline": "Swipe a paper towel over the canvas to pick up excess oil.",
                    "description": "Fold a paper towel in half and gently wipe it over your entire canvas. Pay attention to the corners of your canvas where oil has a tendency to pool. Pat your entire canvas until it is no longer shiny with oil. Too much linseed oil can prevent your paint from every drying."
                },
                {
                    "headline": "Use oil paints on top of the linseed oil for a slow-drying, smooth paint.",
                    "description": "Linseed oil makes the oil paints dry slower. This makes it great for layering oil paints on top of each other. Put your next layer of oil paint immediately onto the linseed oil before it has time to dry.Tip: Linseed oil may come across as slightly yellow when you first swipe it on. Let it dry in the sun to remove any yellow tones in your painting."
                },
                {
                    "headline": "Add more linseed oil over the top of dried paints to add more layers.",
                    "description": "If you want to add another layer of oil paint, let the paint on top of the linseed oil dry completely. Then, use a paint brush to swipe more linseed oil over your entire canvas. Each layer will dry slower than the next. You can create an interesting “wrinkling” effect in your oil paints by adding linseed oil to large globs of paint."
                }
            ]
        }
    ],
    "tyn": [
        "Finishing Wood with Linseed Oil",
        "Sandpaper",
        "Boiled linseed oil",
        "Cloth",
        "Paste wax (optional)",
        "Using Linseed Oil with Oil Paints",
        "Canvas",
        "Oil paints",
        "Linseed oil",
        "Large paint brush"
    ],
    "text": " Finishing Wood with Linseed Oil Sand the surface of your wood that you’d like to finish. Use sandpaper to gently remove the top layer of the wood surface that you want to finish. Wipe off any dust with a microfiber cloth. Use caution with your sandpaper so that you don’t gouge or mar the wood surface. Linseed oil will soak in much more readily to wood that has the top layer removed. Use an electric sander to sand your wood much faster. Spread a thin line of boiled linseed oil onto the wood surface. Dip a paint brush into the linseed oil or spray it out from a squirt bottle directly onto your wood surface. Put a thin line of linseed oil in the middle of your wood surface. This is just the beginning of the finish, and it doesn't have to cover the entire surface yet. You can find boiled linseed oil at most hardware stores. Use a clean cloth to swipe the linseed oil in a circular motion. Pick up some linseed oil with your cloth from the wood surface. Gently rub the linseed oil in small, circular motions over the entire surface of the wood until most of the oil is soaked in. Linseed oil might stain the cloth that you use. You can use your hands to spread the linseed oil instead since it won’t stain your skin. Wait 15 minutes for the linseed oil to dry. Before you apply any more layers of linseed oil, let the wood soak up the initial oil that you put down. Leave your wood in a cool, dry place that won’t collect a lot of particles or wood shavings while it sits. As it dries, the linseed oil will look less shiny. Apply 3 to 5 more layers of linseed oil until you get your desired finish. Linseed oil has a slight yellow tone to it that dries with a shiny finish. Keep applying linseed oil until your wood surface looks the way you’d like it to.Warning: Try not to apply more than 8 layers of linseed oil. Too much oil won’t soak into the wood well and could take a really long time to dry. You can apply a thin layer of paste wax on top of your dried linseed oil if you’d like to make your wood even more shiny looking. Using Linseed Oil with Oil Paints Paint a background on a canvas if you’d like one and let it dry. Use an artist’s canvas that is big enough for the painting that you’d like to do. If you’d like to, you can use oil paints to create a background with 1 or multiple colors. Painting a background first without linseed oil will make your brush strokes more harsh and less blendable. Let your background dry completely. This is a great technique to have 1 aspect of your painting stand out. Brush linseed oil over the entire canvas with a large paintbrush. Dip a large paintbrush into your container of linseed oil. Gently swipe the oil in an upward motion across the entire canvas. Make sure you cover the entire canvas in oil so it doesn’t become patchy. Linseed oil will make oil paints more fluid and glossy looking. You can find linseed oil at most art stores. Do not use cold pressed linseed oil with oil paints. Swipe a paper towel over the canvas to pick up excess oil. Fold a paper towel in half and gently wipe it over your entire canvas. Pay attention to the corners of your canvas where oil has a tendency to pool. Pat your entire canvas until it is no longer shiny with oil. Too much linseed oil can prevent your paint from every drying. Use oil paints on top of the linseed oil for a slow-drying, smooth paint. Linseed oil makes the oil paints dry slower. This makes it great for layering oil paints on top of each other. Put your next layer of oil paint immediately onto the linseed oil before it has time to dry.Tip: Linseed oil may come across as slightly yellow when you first swipe it on. Let it dry in the sun to remove any yellow tones in your painting. Add more linseed oil over the top of dried paints to add more layers. If you want to add another layer of oil paint, let the paint on top of the linseed oil dry completely. Then, use a paint brush to swipe more linseed oil over your entire canvas. Each layer will dry slower than the next. You can create an interesting “wrinkling” effect in your oil paints by adding linseed oil to large globs of paint.",
    "sentences": [
        " Finishing Wood with Linseed Oil Sand the surface of your wood that you’d like to finish.",
        "Use sandpaper to gently remove the top layer of the wood surface that you want to finish.",
        "Wipe off any dust with a microfiber cloth.",
        "Use caution with your sandpaper so that you don’t gouge or mar the wood surface.",
        "Linseed oil will soak in much more readily to wood that has the top layer removed.",
        "Use an electric sander to sand your wood much faster.",
        "Spread a thin line of boiled linseed oil onto the wood surface.",
        "Dip a paint brush into the linseed oil or spray it out from a squirt bottle directly onto your wood surface.",
        "Put a thin line of linseed oil in the middle of your wood surface.",
        "This is just the beginning of the finish, and it doesn't have to cover the entire surface yet.",
        "You can find boiled linseed oil at most hardware stores.",
        "Use a clean cloth to swipe the linseed oil in a circular motion.",
        "Pick up some linseed oil with your cloth from the wood surface.",
        "Gently rub the linseed oil in small, circular motions over the entire surface of the wood until most of the oil is soaked in.",
        "Linseed oil might stain the cloth that you use.",
        "You can use your hands to spread the linseed oil instead since it won’t stain your skin.",
        "Wait 15 minutes for the linseed oil to dry.",
        "Before you apply any more layers of linseed oil, let the wood soak up the initial oil that you put down.",
        "Leave your wood in a cool, dry place that won’t collect a lot of particles or wood shavings while it sits.",
        "As it dries, the linseed oil will look less shiny.",
        "Apply 3 to 5 more layers of linseed oil until you get your desired finish.",
        "Linseed oil has a slight yellow tone to it that dries with a shiny finish.",
        "Keep applying linseed oil until your wood surface looks the way you’d like it to.Warning: Try not to apply more than 8 layers of linseed oil.",
        "Too much oil won’t soak into the wood well and could take a really long time to dry.",
        "You can apply a thin layer of paste wax on top of your dried linseed oil if you’d like to make your wood even more shiny looking.",
        "Using Linseed Oil with Oil Paints Paint a background on a canvas if you’d like one and let it dry.",
        "Use an artist’s canvas that is big enough for the painting that you’d like to do.",
        "If you’d like to, you can use oil paints to create a background with 1 or multiple colors.",
        "Painting a background first without linseed oil will make your brush strokes more harsh and less blendable.",
        "Let your background dry completely.",
        "This is a great technique to have 1 aspect of your painting stand out.",
        "Brush linseed oil over the entire canvas with a large paintbrush.",
        "Dip a large paintbrush into your container of linseed oil.",
        "Gently swipe the oil in an upward motion across the entire canvas.",
        "Make sure you cover the entire canvas in oil so it doesn’t become patchy.",
        "Linseed oil will make oil paints more fluid and glossy looking.",
        "You can find linseed oil at most art stores.",
        "Do not use cold pressed linseed oil with oil paints.",
        "Swipe a paper towel over the canvas to pick up excess oil.",
        "Fold a paper towel in half and gently wipe it over your entire canvas.",
        "Pay attention to the corners of your canvas where oil has a tendency to pool.",
        "Pat your entire canvas until it is no longer shiny with oil.",
        "Too much linseed oil can prevent your paint from every drying.",
        "Use oil paints on top of the linseed oil for a slow-drying, smooth paint.",
        "Linseed oil makes the oil paints dry slower.",
        "This makes it great for layering oil paints on top of each other.",
        "Put your next layer of oil paint immediately onto the linseed oil before it has time to dry.Tip: Linseed oil may come across as slightly yellow when you first swipe it on.",
        "Let it dry in the sun to remove any yellow tones in your painting.",
        "Add more linseed oil over the top of dried paints to add more layers.",
        "If you want to add another layer of oil paint, let the paint on top of the linseed oil dry completely.",
        "Then, use a paint brush to swipe more linseed oil over your entire canvas.",
        "Each layer will dry slower than the next.",
        "You can create an interesting “wrinkling” effect in your oil paints by adding linseed oil to large globs of paint."
    ]
}