{
    "title": "How to Upgrade a Laptop",
    "url": "https://www.wikihow.com/Upgrade-a-Laptop",
    "category_hierarchy": [
        "Computers and Electronics",
        "Computers",
        "Laptops",
        "Laptop Maintenance and Repair",
        "Optimizing Laptops"
    ],
    "methods": [
        {
            "name": "Getting the Laptop Memory Specifications",
            "steps": [
                {
                    "headline": "Look for your laptop's make and model number.",
                    "description": "Laptops will often have the manufacturer, make, and model number printed on the laptop itself. The make and model number is often printed on the bottom of the laptop, but is sometimes also printed above the keyboard on the inside of the laptop."
                },
                {
                    "headline": "Find the laptop's manual.",
                    "description": "In a search engine, type the manufacturer, make, and model number of your laptop, and then type manual. Among the search results, you'll find a link to the manual itself or to a page on the laptop manufacturer's website where you can download the manual or maintenance guide. You can also go directly to the manufacturer's website to get your laptop's manual or maintenance guide. If it's available, download the laptop's service and maintenance guide, because it will have detailed information about the specific hardware you can use to upgrade your laptop."
                },
                {
                    "headline": "Determine how much memory your Windows Vista or Windows 7 laptop is using.",
                    "description": "Click the Start menu, right-click Computer, and then click Properties. In the System section, Installed memory (RAM) shows how much memory you have installed."
                },
                {
                    "headline": "Determine how much memory your Windows 8 laptop is using.",
                    "description": "On the desktop, right-click My Computer, and then click Properties. In the System section, Installed memory (RAM) shows how much memory you have installed."
                },
                {
                    "headline": "Determine how much memory your Mac laptop is using.",
                    "description": "Click the Apple menu, and then click About This Mac. In the About This Mac window, Memory shows how much RAM you have installed. For more information, click More Info, and then click the Memory tab."
                },
                {
                    "headline": "Determine if you have the maximum RAM or not.",
                    "description": "In the laptop manual you downloaded, check the system specifications to see if you're already using the maximum RAM or not."
                }
            ]
        },
        {
            "name": "Upgrading Your Laptop's RAM Memory",
            "steps": [
                {
                    "headline": "Determine the kind of RAM your laptop uses.",
                    "description": "In the laptop manual you downloaded, look for the section on memory modules. If you can't find the information in the laptop manual, there are tools online that will show you the correct RAM for a specific make and model of laptop. Click here for an example of one of these tools. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5c\\/Upgrade-a-Laptop-Step-2-Version-2.jpg\\/v4-459px-Upgrade-a-Laptop-Step-2-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5c\\/Upgrade-a-Laptop-Step-2-Version-2.jpg\\/v4-759px-Upgrade-a-Laptop-Step-2-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":296,\"bigWidth\":760,\"bigHeight\":489.61538461538464,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Buy the RAM you need.",
                    "description": "You can buy the RAM you need in many different places. Once you've identified the specific type of RAM you want to buy, in a search engine, type the specific RAM type, and then choose an online store where you'd like to purchase the RAM. If you're using more than one RAM memory module, you need to make sure that they're each the same size. For example, you can't use a 2 GB RAM module with a 4 GB RAM module. They'll both need to be 2 GB, for example."
                },
                {
                    "headline": "Before opening the computer or handling the RAM, ground yourself.",
                    "description": "Static electricity can destroy computer components. The simplest way to do this is to touch a piece of metal before handling computer components, but there are methods you can use too."
                },
                {
                    "headline": "Use a screwdriver to open the RAM memory access panel.",
                    "description": "On many laptops, this panel is on the bottom of the laptop case and secured with one or more screws. Your laptop maintenance guide will have very specific instructions on how to do this."
                },
                {
                    "headline": "If you're replacing your old RAM completely, remove the old RAM memory.",
                    "description": "If you're adding RAM to an empty memory slot, you won't need to remove the old RAM first."
                },
                {
                    "headline": "Install the new RAM memory.",
                    "description": "Push the RAM gently, but firmly, into place Do not force the RAM if it isn't going easily. Do not do touch the RAM chips—hold the RAM only on the edges of the module."
                },
                {
                    "headline": "Use the screwdriver to close the the access panel.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Getting the Laptop Hard Drive Specifications",
            "steps": [
                {
                    "headline": "Look for your laptop's make and model number.",
                    "description": "Laptops will often have the manufacturer, make, and model number printed on the laptop itself. The make and model number is often printed on the bottom of the laptop, but is sometimes also printed above the keyboard on the inside of the laptop."
                },
                {
                    "headline": "Find the laptop's manual.",
                    "description": "In a search engine, type the manufacturer, make, and model number of your laptop, and then type manual. Among the search results, you'll find a link to the manual itself or to a page on the laptop manufacturer's website where you can download the manual or maintenance guide. You can also go directly to the manufacturer's website to get your laptop's manual or maintenance guide. If it's available, download the laptop's service and maintenance guide, because it will have detailed information about the specific hardware you can use to upgrade your laptop."
                },
                {
                    "headline": "Find out what hard drives are compatible with your laptop.",
                    "description": "In the user manual or maintenance guide, determine the hard drive models that are compatible with your laptop. In a search engine, search for the specific models of hard drives that are compatible with your laptop. If the hard drive isn't the right physical size, it won't fit in your laptop."
                }
            ]
        },
        {
            "name": "Upgrading Your Laptop's Hard Drive",
            "steps": [
                {
                    "headline": "Plugin the laptop with its power cord and turn it on.",
                    "description": "Backing up a hard drive can take more time than a laptop battery has charge. If you plug it in, you won't need to worry about how much battery life you have."
                },
                {
                    "headline": "Backup your laptop's hard drive.",
                    "description": "Before installing your new hard drive, copy the contents of your laptop's current hard drive to the new one. This will save some time, because you won't have to reinstall all of your applications. On Windows 8, System Image Backup is the program you can use to backup your hard drive. On Windows 7 and earlier, it's called Backup and Restore. On Mac OS X 10.5 or newer, you can use Time Machine to back up your hard drive. You can also use the Disk Utility to back up your hard drive to CD or DVD. If you want to start fresh with your new hard drive, don't backup to the new hard drive. Install your operating system, and then install and copy over any files that you need."
                },
                {
                    "headline": "Connect the new hard drive to your laptop's USB port.",
                    "description": "You will need a SATA-to-USB adapter to connect the two hard drives. You can also put the new hard drive into an external hard drive case which will have a USB connection."
                },
                {
                    "headline": "Install the cloning software on the old hard drive.",
                    "description": "Some hard drive manufacturers include their own cloning software, which may already be on your computer. You can also use a third-party application. Clonezilla is a multi-platform, free, open source disk cloning utility. There is a large number of cloning software for all of the major operating systems."
                },
                {
                    "headline": "Clone the old hard drive onto the new hard drive.",
                    "description": "Before cloning the hard drive, be sure to read the help files to make sure you understand the process. The cloning software will check to make sure the new hard drive is large enough to clone the old hard drive to it."
                },
                {
                    "headline": "After the cloning is finished, shut down the laptop and unplug it.",
                    "description": "Be sure to unplug and turn off the new hard drive too. Wait at least one minute for the electricity in the laptop to dissipate before continuing."
                },
                {
                    "headline": "Remove the laptop's battery.",
                    "description": "If the battery is in the laptop, it can give you an electric shock. You may also need to remove it to reach the laptop's hard drive."
                },
                {
                    "headline": "Take out the old hard drive.",
                    "description": "As noted above, you may be able to reach the hard drive through the battery compartment. On other laptops, you may have to take off the entire outer case or detach the keyboard. A few laptops offer direct access to the hard drive through an access panel on the bottom. If you're not sure how to get to the hard drive for you laptop, refer to the user manual or maintenance guide for your laptop."
                },
                {
                    "headline": "Install the new hard drive.",
                    "description": "Put the new hard drive in, but do not force it."
                },
                {
                    "headline": "Reassemble the laptop and boot it up.",
                    "description": "If you're starting up with a blank hard drive, you'll need to reinstall your operating system."
                }
            ]
        },
        {
            "name": "Getting the Laptop Video and Sound Card Specifications",
            "steps": [
                {
                    "headline": "Look for your laptop's make and model number.",
                    "description": "Laptop's will often have the manufacturer, make, and model number printed on the laptop itself. The make and model number is often printed on the bottom of the laptop, but is sometimes also printed above the keyboard on the inside of the laptop."
                },
                {
                    "headline": "Find the laptop's manual.",
                    "description": "In a search engine, type the manufacturer, make, and model number of your laptop, and then type manual. Among the search results, you'll find a link to the manual itself or to a page on the laptop manufacturer's website where you can download the manual or maintenance guide. You can also go directly to the manufacturer's website to get your laptop's manual or maintenance guide. If it's available, download the laptop's service and maintenance guide, because it will have detailed information about the specific hardware you can use to upgrade your laptop."
                },
                {
                    "headline": "Find out what video and sound cards are compatible with your laptop.",
                    "description": "In the user manual or maintenance guide, determine the video and sound cards that are compatible with your laptop. In some cases, you won't be able to upgrade your video or sound card. The user manual will have that information. In a search engine, search for the specific video or sound cards that are compatible with your laptop."
                }
            ]
        },
        {
            "name": "Upgrading Your Laptop's Video or Sound Card",
            "steps": [
                {
                    "headline": "Before starting, unplug the laptop and remove its battery.",
                    "description": ""
                },
                {
                    "headline": "Consult your laptop's maintenance guide.",
                    "description": "Due to the wide variety of laptop models, the process for getting access to the video or sound card can be quite different. Your laptop's maintenance guide will have detailed instructions on how to do this. For some high-end laptops, removing a panel on the bottom will provide access to the graphics card. For the rest, you'll need to follow the remaining steps to get to the graphics card slot."
                },
                {
                    "headline": "Detach the laptop's keyboard.",
                    "description": "For many laptops you can get access to the video and sound card by removing the keyboard.This means removing the screws from under the hinge cover, then lifting out the keyboard and unplugging its connectors. In order to keep track of the different screws, use clear adhesive tape to tape related screws to a piece of paper or cardboard, and then label them. Some laptops secure the keyboard with latches that let you detach the keyboard without having to unscrew it."
                },
                {
                    "headline": "If necessary, remove the screen apparatus.",
                    "description": "For some laptops, you'll need to remove the laptop screen in order to get access to the video and sound card cables. Take out the screws that hold the display assembly in place, and then unplug the video and wireless antenna cables."
                },
                {
                    "headline": "If necessary, remove the CD/DVD drive.",
                    "description": "On most laptops, this means pushing in the release latch and sliding out the drive bay."
                },
                {
                    "headline": "If necessary, remove the laptop's upper shell.",
                    "description": "Take out the screws that hold it to the base of the laptop."
                },
                {
                    "headline": "Remove the old graphics card.",
                    "description": ""
                },
                {
                    "headline": "Install the new graphics card in its slot.",
                    "description": "Push the card in straight, but firmly. Do not force it."
                },
                {
                    "headline": "Reassemble the laptop.",
                    "description": "Reverse the steps you followed to install the new card in order to reassemble the laptop."
                }
            ]
        }
    ],
    "tyn": [
        "Small, non-magnetic screwdriver (either regular or Phillips-head, depending on how the screws are slotted)",
        "Anti-static wrist strap (optional)",
        "Rubber mat or clean, non-static cloth (optional)",
        "For hard drive upgrades, a SATA-to-USB adapter"
    ],
    "text": " Getting the Laptop Memory Specifications Look for your laptop's make and model number. Laptops will often have the manufacturer, make, and model number printed on the laptop itself. The make and model number is often printed on the bottom of the laptop, but is sometimes also printed above the keyboard on the inside of the laptop. Find the laptop's manual. In a search engine, type the manufacturer, make, and model number of your laptop, and then type manual. Among the search results, you'll find a link to the manual itself or to a page on the laptop manufacturer's website where you can download the manual or maintenance guide. You can also go directly to the manufacturer's website to get your laptop's manual or maintenance guide. If it's available, download the laptop's service and maintenance guide, because it will have detailed information about the specific hardware you can use to upgrade your laptop. Determine how much memory your Windows Vista or Windows 7 laptop is using. Click the Start menu, right-click Computer, and then click Properties. In the System section, Installed memory (RAM) shows how much memory you have installed. Determine how much memory your Windows 8 laptop is using. On the desktop, right-click My Computer, and then click Properties. In the System section, Installed memory (RAM) shows how much memory you have installed. Determine how much memory your Mac laptop is using. Click the Apple menu, and then click About This Mac. In the About This Mac window, Memory shows how much RAM you have installed. For more information, click More Info, and then click the Memory tab. Determine if you have the maximum RAM or not. In the laptop manual you downloaded, check the system specifications to see if you're already using the maximum RAM or not. Upgrading Your Laptop's RAM Memory Determine the kind of RAM your laptop uses. In the laptop manual you downloaded, look for the section on memory modules. If you can't find the information in the laptop manual, there are tools online that will show you the correct RAM for a specific make and model of laptop. Click here for an example of one of these tools. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5c\\/Upgrade-a-Laptop-Step-2-Version-2.jpg\\/v4-459px-Upgrade-a-Laptop-Step-2-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5c\\/Upgrade-a-Laptop-Step-2-Version-2.jpg\\/v4-759px-Upgrade-a-Laptop-Step-2-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":296,\"bigWidth\":760,\"bigHeight\":489.61538461538464,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"} Buy the RAM you need. You can buy the RAM you need in many different places. Once you've identified the specific type of RAM you want to buy, in a search engine, type the specific RAM type, and then choose an online store where you'd like to purchase the RAM. If you're using more than one RAM memory module, you need to make sure that they're each the same size. For example, you can't use a 2 GB RAM module with a 4 GB RAM module. They'll both need to be 2 GB, for example. Before opening the computer or handling the RAM, ground yourself. Static electricity can destroy computer components. The simplest way to do this is to touch a piece of metal before handling computer components, but there are methods you can use too. Use a screwdriver to open the RAM memory access panel. On many laptops, this panel is on the bottom of the laptop case and secured with one or more screws. Your laptop maintenance guide will have very specific instructions on how to do this. If you're replacing your old RAM completely, remove the old RAM memory. If you're adding RAM to an empty memory slot, you won't need to remove the old RAM first. Install the new RAM memory. Push the RAM gently, but firmly, into place Do not force the RAM if it isn't going easily. Do not do touch the RAM chips—hold the RAM only on the edges of the module. Use the screwdriver to close the the access panel.  Getting the Laptop Hard Drive Specifications Look for your laptop's make and model number. Laptops will often have the manufacturer, make, and model number printed on the laptop itself. The make and model number is often printed on the bottom of the laptop, but is sometimes also printed above the keyboard on the inside of the laptop. Find the laptop's manual. In a search engine, type the manufacturer, make, and model number of your laptop, and then type manual. Among the search results, you'll find a link to the manual itself or to a page on the laptop manufacturer's website where you can download the manual or maintenance guide. You can also go directly to the manufacturer's website to get your laptop's manual or maintenance guide. If it's available, download the laptop's service and maintenance guide, because it will have detailed information about the specific hardware you can use to upgrade your laptop. Find out what hard drives are compatible with your laptop. In the user manual or maintenance guide, determine the hard drive models that are compatible with your laptop. In a search engine, search for the specific models of hard drives that are compatible with your laptop. If the hard drive isn't the right physical size, it won't fit in your laptop. Upgrading Your Laptop's Hard Drive Plugin the laptop with its power cord and turn it on. Backing up a hard drive can take more time than a laptop battery has charge. If you plug it in, you won't need to worry about how much battery life you have. Backup your laptop's hard drive. Before installing your new hard drive, copy the contents of your laptop's current hard drive to the new one. This will save some time, because you won't have to reinstall all of your applications. On Windows 8, System Image Backup is the program you can use to backup your hard drive. On Windows 7 and earlier, it's called Backup and Restore. On Mac OS X 10.5 or newer, you can use Time Machine to back up your hard drive. You can also use the Disk Utility to back up your hard drive to CD or DVD. If you want to start fresh with your new hard drive, don't backup to the new hard drive. Install your operating system, and then install and copy over any files that you need. Connect the new hard drive to your laptop's USB port. You will need a SATA-to-USB adapter to connect the two hard drives. You can also put the new hard drive into an external hard drive case which will have a USB connection. Install the cloning software on the old hard drive. Some hard drive manufacturers include their own cloning software, which may already be on your computer. You can also use a third-party application. Clonezilla is a multi-platform, free, open source disk cloning utility. There is a large number of cloning software for all of the major operating systems. Clone the old hard drive onto the new hard drive. Before cloning the hard drive, be sure to read the help files to make sure you understand the process. The cloning software will check to make sure the new hard drive is large enough to clone the old hard drive to it. After the cloning is finished, shut down the laptop and unplug it. Be sure to unplug and turn off the new hard drive too. Wait at least one minute for the electricity in the laptop to dissipate before continuing. Remove the laptop's battery. If the battery is in the laptop, it can give you an electric shock. You may also need to remove it to reach the laptop's hard drive. Take out the old hard drive. As noted above, you may be able to reach the hard drive through the battery compartment. On other laptops, you may have to take off the entire outer case or detach the keyboard. A few laptops offer direct access to the hard drive through an access panel on the bottom. If you're not sure how to get to the hard drive for you laptop, refer to the user manual or maintenance guide for your laptop. Install the new hard drive. Put the new hard drive in, but do not force it. Reassemble the laptop and boot it up. If you're starting up with a blank hard drive, you'll need to reinstall your operating system. Getting the Laptop Video and Sound Card Specifications Look for your laptop's make and model number. Laptop's will often have the manufacturer, make, and model number printed on the laptop itself. The make and model number is often printed on the bottom of the laptop, but is sometimes also printed above the keyboard on the inside of the laptop. Find the laptop's manual. In a search engine, type the manufacturer, make, and model number of your laptop, and then type manual. Among the search results, you'll find a link to the manual itself or to a page on the laptop manufacturer's website where you can download the manual or maintenance guide. You can also go directly to the manufacturer's website to get your laptop's manual or maintenance guide. If it's available, download the laptop's service and maintenance guide, because it will have detailed information about the specific hardware you can use to upgrade your laptop. Find out what video and sound cards are compatible with your laptop. In the user manual or maintenance guide, determine the video and sound cards that are compatible with your laptop. In some cases, you won't be able to upgrade your video or sound card. The user manual will have that information. In a search engine, search for the specific video or sound cards that are compatible with your laptop. Upgrading Your Laptop's Video or Sound Card Before starting, unplug the laptop and remove its battery.  Consult your laptop's maintenance guide. Due to the wide variety of laptop models, the process for getting access to the video or sound card can be quite different. Your laptop's maintenance guide will have detailed instructions on how to do this. For some high-end laptops, removing a panel on the bottom will provide access to the graphics card. For the rest, you'll need to follow the remaining steps to get to the graphics card slot. Detach the laptop's keyboard. For many laptops you can get access to the video and sound card by removing the keyboard.This means removing the screws from under the hinge cover, then lifting out the keyboard and unplugging its connectors. In order to keep track of the different screws, use clear adhesive tape to tape related screws to a piece of paper or cardboard, and then label them. Some laptops secure the keyboard with latches that let you detach the keyboard without having to unscrew it. If necessary, remove the screen apparatus. For some laptops, you'll need to remove the laptop screen in order to get access to the video and sound card cables. Take out the screws that hold the display assembly in place, and then unplug the video and wireless antenna cables. If necessary, remove the CD/DVD drive. On most laptops, this means pushing in the release latch and sliding out the drive bay. If necessary, remove the laptop's upper shell. Take out the screws that hold it to the base of the laptop. Remove the old graphics card.  Install the new graphics card in its slot. Push the card in straight, but firmly. Do not force it. Reassemble the laptop. Reverse the steps you followed to install the new card in order to reassemble the laptop.",
    "sentences": [
        " Getting the Laptop Memory Specifications Look for your laptop's make and model number.",
        "Laptops will often have the manufacturer, make, and model number printed on the laptop itself.",
        "The make and model number is often printed on the bottom of the laptop, but is sometimes also printed above the keyboard on the inside of the laptop.",
        "Find the laptop's manual.",
        "In a search engine, type the manufacturer, make, and model number of your laptop, and then type manual.",
        "Among the search results, you'll find a link to the manual itself or to a page on the laptop manufacturer's website where you can download the manual or maintenance guide.",
        "You can also go directly to the manufacturer's website to get your laptop's manual or maintenance guide.",
        "If it's available, download the laptop's service and maintenance guide, because it will have detailed information about the specific hardware you can use to upgrade your laptop.",
        "Determine how much memory your Windows Vista or Windows 7 laptop is using.",
        "Click the Start menu, right-click Computer, and then click Properties.",
        "In the System section, Installed memory (RAM) shows how much memory you have installed.",
        "Determine how much memory your Windows 8 laptop is using.",
        "On the desktop, right-click My Computer, and then click Properties.",
        "In the System section, Installed memory (RAM) shows how much memory you have installed.",
        "Determine how much memory your Mac laptop is using.",
        "Click the Apple menu, and then click About This Mac.",
        "In the About This Mac window, Memory shows how much RAM you have installed.",
        "For more information, click More Info, and then click the Memory tab.",
        "Determine if you have the maximum RAM or not.",
        "In the laptop manual you downloaded, check the system specifications to see if you're already using the maximum RAM or not.",
        "Upgrading Your Laptop's RAM Memory Determine the kind of RAM your laptop uses.",
        "In the laptop manual you downloaded, look for the section on memory modules.",
        "If you can't find the information in the laptop manual, there are tools online that will show you the correct RAM for a specific make and model of laptop.",
        "Click here for an example of one of these tools.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5c\\/Upgrade-a-Laptop-Step-2-Version-2.jpg\\/v4-459px-Upgrade-a-Laptop-Step-2-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5c\\/Upgrade-a-Laptop-Step-2-Version-2.jpg\\/v4-759px-Upgrade-a-Laptop-Step-2-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":296,\"bigWidth\":760,\"bigHeight\":489.61538461538464,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"} Buy the RAM you need.",
        "You can buy the RAM you need in many different places.",
        "Once you've identified the specific type of RAM you want to buy, in a search engine, type the specific RAM type, and then choose an online store where you'd like to purchase the RAM.",
        "If you're using more than one RAM memory module, you need to make sure that they're each the same size.",
        "For example, you can't use a 2 GB RAM module with a 4 GB RAM module.",
        "They'll both need to be 2 GB, for example.",
        "Before opening the computer or handling the RAM, ground yourself.",
        "Static electricity can destroy computer components.",
        "The simplest way to do this is to touch a piece of metal before handling computer components, but there are methods you can use too.",
        "Use a screwdriver to open the RAM memory access panel.",
        "On many laptops, this panel is on the bottom of the laptop case and secured with one or more screws.",
        "Your laptop maintenance guide will have very specific instructions on how to do this.",
        "If you're replacing your old RAM completely, remove the old RAM memory.",
        "If you're adding RAM to an empty memory slot, you won't need to remove the old RAM first.",
        "Install the new RAM memory.",
        "Push the RAM gently, but firmly, into place Do not force the RAM if it isn't going easily.",
        "Do not do touch the RAM chips—hold the RAM only on the edges of the module.",
        "Use the screwdriver to close the the access panel.",
        "Getting the Laptop Hard Drive Specifications Look for your laptop's make and model number.",
        "Laptops will often have the manufacturer, make, and model number printed on the laptop itself.",
        "The make and model number is often printed on the bottom of the laptop, but is sometimes also printed above the keyboard on the inside of the laptop.",
        "Find the laptop's manual.",
        "In a search engine, type the manufacturer, make, and model number of your laptop, and then type manual.",
        "Among the search results, you'll find a link to the manual itself or to a page on the laptop manufacturer's website where you can download the manual or maintenance guide.",
        "You can also go directly to the manufacturer's website to get your laptop's manual or maintenance guide.",
        "If it's available, download the laptop's service and maintenance guide, because it will have detailed information about the specific hardware you can use to upgrade your laptop.",
        "Find out what hard drives are compatible with your laptop.",
        "In the user manual or maintenance guide, determine the hard drive models that are compatible with your laptop.",
        "In a search engine, search for the specific models of hard drives that are compatible with your laptop.",
        "If the hard drive isn't the right physical size, it won't fit in your laptop.",
        "Upgrading Your Laptop's Hard Drive Plugin the laptop with its power cord and turn it on.",
        "Backing up a hard drive can take more time than a laptop battery has charge.",
        "If you plug it in, you won't need to worry about how much battery life you have.",
        "Backup your laptop's hard drive.",
        "Before installing your new hard drive, copy the contents of your laptop's current hard drive to the new one.",
        "This will save some time, because you won't have to reinstall all of your applications.",
        "On Windows 8, System Image Backup is the program you can use to backup your hard drive.",
        "On Windows 7 and earlier, it's called Backup and Restore.",
        "On Mac OS X 10.5 or newer, you can use Time Machine to back up your hard drive.",
        "You can also use the Disk Utility to back up your hard drive to CD or DVD.",
        "If you want to start fresh with your new hard drive, don't backup to the new hard drive.",
        "Install your operating system, and then install and copy over any files that you need.",
        "Connect the new hard drive to your laptop's USB port.",
        "You will need a SATA-to-USB adapter to connect the two hard drives.",
        "You can also put the new hard drive into an external hard drive case which will have a USB connection.",
        "Install the cloning software on the old hard drive.",
        "Some hard drive manufacturers include their own cloning software, which may already be on your computer.",
        "You can also use a third-party application.",
        "Clonezilla is a multi-platform, free, open source disk cloning utility.",
        "There is a large number of cloning software for all of the major operating systems.",
        "Clone the old hard drive onto the new hard drive.",
        "Before cloning the hard drive, be sure to read the help files to make sure you understand the process.",
        "The cloning software will check to make sure the new hard drive is large enough to clone the old hard drive to it.",
        "After the cloning is finished, shut down the laptop and unplug it.",
        "Be sure to unplug and turn off the new hard drive too.",
        "Wait at least one minute for the electricity in the laptop to dissipate before continuing.",
        "Remove the laptop's battery.",
        "If the battery is in the laptop, it can give you an electric shock.",
        "You may also need to remove it to reach the laptop's hard drive.",
        "Take out the old hard drive.",
        "As noted above, you may be able to reach the hard drive through the battery compartment.",
        "On other laptops, you may have to take off the entire outer case or detach the keyboard.",
        "A few laptops offer direct access to the hard drive through an access panel on the bottom.",
        "If you're not sure how to get to the hard drive for you laptop, refer to the user manual or maintenance guide for your laptop.",
        "Install the new hard drive.",
        "Put the new hard drive in, but do not force it.",
        "Reassemble the laptop and boot it up.",
        "If you're starting up with a blank hard drive, you'll need to reinstall your operating system.",
        "Getting the Laptop Video and Sound Card Specifications Look for your laptop's make and model number.",
        "Laptop's will often have the manufacturer, make, and model number printed on the laptop itself.",
        "The make and model number is often printed on the bottom of the laptop, but is sometimes also printed above the keyboard on the inside of the laptop.",
        "Find the laptop's manual.",
        "In a search engine, type the manufacturer, make, and model number of your laptop, and then type manual.",
        "Among the search results, you'll find a link to the manual itself or to a page on the laptop manufacturer's website where you can download the manual or maintenance guide.",
        "You can also go directly to the manufacturer's website to get your laptop's manual or maintenance guide.",
        "If it's available, download the laptop's service and maintenance guide, because it will have detailed information about the specific hardware you can use to upgrade your laptop.",
        "Find out what video and sound cards are compatible with your laptop.",
        "In the user manual or maintenance guide, determine the video and sound cards that are compatible with your laptop.",
        "In some cases, you won't be able to upgrade your video or sound card.",
        "The user manual will have that information.",
        "In a search engine, search for the specific video or sound cards that are compatible with your laptop.",
        "Upgrading Your Laptop's Video or Sound Card Before starting, unplug the laptop and remove its battery.",
        "Consult your laptop's maintenance guide.",
        "Due to the wide variety of laptop models, the process for getting access to the video or sound card can be quite different.",
        "Your laptop's maintenance guide will have detailed instructions on how to do this.",
        "For some high-end laptops, removing a panel on the bottom will provide access to the graphics card.",
        "For the rest, you'll need to follow the remaining steps to get to the graphics card slot.",
        "Detach the laptop's keyboard.",
        "For many laptops you can get access to the video and sound card by removing the keyboard.This means removing the screws from under the hinge cover, then lifting out the keyboard and unplugging its connectors.",
        "In order to keep track of the different screws, use clear adhesive tape to tape related screws to a piece of paper or cardboard, and then label them.",
        "Some laptops secure the keyboard with latches that let you detach the keyboard without having to unscrew it.",
        "If necessary, remove the screen apparatus.",
        "For some laptops, you'll need to remove the laptop screen in order to get access to the video and sound card cables.",
        "Take out the screws that hold the display assembly in place, and then unplug the video and wireless antenna cables.",
        "If necessary, remove the CD/DVD drive.",
        "On most laptops, this means pushing in the release latch and sliding out the drive bay.",
        "If necessary, remove the laptop's upper shell.",
        "Take out the screws that hold it to the base of the laptop.",
        "Remove the old graphics card.",
        "Install the new graphics card in its slot.",
        "Push the card in straight, but firmly.",
        "Do not force it.",
        "Reassemble the laptop.",
        "Reverse the steps you followed to install the new card in order to reassemble the laptop."
    ]
}