{
    "title": "How to Extract Banana DNA",
    "url": "https://www.wikihow.com/Extract-Banana-DNA",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Biology"
    ],
    "parts": [
        {
            "name": "Creating the Mashed Banana Mixture",
            "steps": [
                {
                    "headline": "Place a bottle of isopropyl alcohol in the freezer.",
                    "description": "Before you start the experiment, put your bottle of isopropyl alcohol in the freezer. You can also pour some alcohol out of the main bottle it came in and put it into an empty, clean bottle or glass and then put that bottle or glass in the freezer. Don’t worry, the isopropyl alcohol won’t actually freeze solid like water. Try to use 90% or higher isopropyl alcohol for this experiment. However, if you have isopropyl alcohol at home already that’s at least 70%, you can use that. If you don’t have any isopropyl alcohol, you can buy some at a drugstore or pharmacy; it is fairly inexpensive."
                },
                {
                    "headline": "Make sure you have a ripe banana for this experiment.",
                    "description": "You’re going to need to mash the banana up into something that looks like pudding. Therefore, you need the banana to be really soft and ripe. You know it’s really ripe when the outside of the banana is a dark yellow or brown and there are black spots on it. Peel the outside off the banana and break or cut off about half of the banana for your experiment. If you don’t have any ripe bananas, leave one out on the counter until it’s almost brown before doing this experiment. You can also use a blender to mash the banana if you don’t want to wait for one to ripen."
                },
                {
                    "headline": "Mash the banana inside a plastic resealable freezer bag.",
                    "description": "Place the portion of the banana that you broke off into a plastic resealable bag. Make sure all the air is out of the bag and then seal it closed. Use your hands to mash the banana until it looks like pudding. It should take you a minute or two to mash the banana this way. Make sure all the lumps have been mashed. You could also try mashing the banana inside the bag with a rolling pin. Simply roll the rolling pin back and forth across the bag until it’s all mashed up."
                },
                {
                    "headline": "Combine hot water and salt in a measuring cup.",
                    "description": "Pour hot water directly from the faucet into a measuring cup until you have ⁄2  c (120 mL). Use a spoon to mix the water with 1  tsp (4.9 mL) of salt until the salt is completely dissolved. Salt is being used in this step because it has a positive electrical charge. DNA, on the other hand, has a negative electrical charge. When combined, the negative and positive charges balance themselves out and will allow the DNA molecules to collect together. Make sure to use really hot, steaming water from the faucet. Be careful to only handle the measuring cup by its handle in case it’s really hot. Any type of salt will work for this step. However, finer table salt will dissolve faster than chunkier sea salt."
                },
                {
                    "headline": "Mix the salt-water mix with the mashed banana for 30-45 seconds.",
                    "description": "Re-open the plastic resealable bag and carefully pour the salt-water mixture into the bag with the mashed-up banana. Reseal the bag and remove as much air as possible. Use your hands to move and shake the bag to mix the salt-water and banana together. Keep mixing the contents of the bag for about 30-45 seconds. You may need to allow the salt-water mix to cool a bit before you pour it into the plastic bag. If the bag is too hot to handle once the water is inside, use oven mitts to hold it."
                },
                {
                    "headline": "Add liquid dish soap to the bag and mix it with the banana/salt-water.",
                    "description": "Use a measuring spoon to measure ⁄2 teaspoon (2.5 mL) of liquid dish soap. Re-open the plastic resealable bag and pour in the liquid dish soap. Reseal the bag and remove as much air as possible. Use your hands to move the bag around gently to mix the liquid dish soap into the banana/salt-water mixture. The soap used in this step will dissolve the lipids (or fats) in the cell membranes around the DNA molecules. This will allow the DNA molecules to be separated in the mixture. Mix the contents of the bag gently. You want to dissolve all the soap into the banana/salt-water mixture without creating a lot of bubbles. You can also use shampoo instead of dish soap."
                }
            ]
        },
        {
            "name": "Isolating the Banana’s DNA",
            "steps": [
                {
                    "headline": "Attach a coffee filter to the top of a narrow glass with an elastic.",
                    "description": "Slide the paper coffee filter into the top of the tall, narrow drinking glass. Fold the top of the coffee filter over the edge of the glass and secure it in place with an elastic. Even though you’ve secured the filter with an elastic, you may still need to use your hand to hold the filter in place once you start to pour stuff through it."
                },
                {
                    "headline": "Pour the contents of the bag into the glass.",
                    "description": "Open the plastic resealable bag with the banana/salt-water/soap mixture and slowly pour that mixture into the tall, narrow glass through the coffee filter. Don’t allow the filter to overflow; go slowly. This process may take several minutes to complete. The mashed banana will stay in the filter, while the liquid will filter through to the glass. The liquid flowing through the coffee filter is essentially soapy saltwater that contains the DNA molecules of the banana. The DNA molecules have been separated from the rest of the banana, therefore, the mashed banana is no longer needed. Once all the liquid has moved through the filter, you can discard the filter and its contents."
                },
                {
                    "headline": "Add the isopropyl alcohol slowly to the tilted narrow glass.",
                    "description": "Take the isopropyl alcohol out of the freezer. Pick up the tall, narrow glass with your non-dominant hand and tilt it at a 45-degree angle to one side. Use your dominant hand to pour the isopropyl alcohol in so that is slowly goes down the side of the glass. Stop pouring when there’s a layer of isopropyl alcohol about 1–2 in (2.5–5.1 cm) thick on top of the liquid mixture you filtered into the glass. Do not pour the isopropyl alcohol directly into the liquid that’s in the glass. Once done, you should see two distinct layers of liquid; the banana/soap/salt-water on the bottom and the alcohol on the top. The DNA molecules are currently dissolved in the banana/soap/salt-water mixture."
                },
                {
                    "headline": "Leave the glass on the counter for at least 8 minutes.",
                    "description": "Tilt the tall, narrow glass upright and place it on the counter. Set a timer for 8 minutes and do not touch the glass. During the 8 minutes, watch the glass for bubbles and movement. As mentioned, the DNA molecules are currently dissolved in the banana/soap/salt-water mixture. The combination of alcohol and salt causes those DNA molecules to precipitate or develop into a solid. We put the alcohol in the freezer because the lower temperatures allow more DNA molecules to form. You can leave the glass for longer than 8 minutes. The longer you leave it, the more defined the DNA material will become."
                }
            ]
        },
        {
            "name": "Keeping the DNA",
            "steps": [
                {
                    "headline": "Create a scientific storage environment with a small bottle.",
                    "description": "Find a small, clear glass bottle to use for longer-term storage. You can use a brand new bottle or reuse an old bottle (such as one previously used for spices). If you’ve decided to reuse an old bottle, make sure it’s completely clean inside and that the label has been removed. Fill the bottle with isopropyl alcohol. A dollar store is a great place to find a variety of small glass containers that may work for this purpose. The isopropyl alcohol doesn’t have to be cold for this step."
                },
                {
                    "headline": "Dip the wood skewer into the glass and stir it slowly.",
                    "description": "Stick the wood skewer into the tall, narrow glass until the tip of the skewer is located where the isopropyl alcohol meets the banana/salt-water/soap mixture. Slowly turn or stir the wood skewer in this area and watch for bubbly, stringy pieces to move into the alcohol layer. Allow the DNA strands to wrap around the wood skewer. This step provides a great photo opportunity of the DNA."
                },
                {
                    "headline": "Move the banana’s DNA into your newly created storage bottle.",
                    "description": "Slowly take the wood skewer–with the DNA wrapped around it–out of the tall, narrow glass. Place the wood skewer into the small bottle filled with isopropyl alcohol. Swirl the wood skewer a little bit to allow the DNA strand to move off the skewer and into the alcohol. Once the DNA is in the alcohol, secure the lid on the bottle and keep it as long as you’d like."
                }
            ]
        }
    ],
    "tyn": [
        "Creating the Mashed Banana Mixture",
        "cold isopropyl alcohol (>= 90%)",
        "½ banana, ripe and peeled",
        "1 US qt (950 mL) resealable plastic freezer bag",
        "measuring cup",
        "1⁄2",
        "1",
        "⁄",
        "2",
        "  c (120 mL) of hot water",
        "1  tsp (4.9 mL) of salt",
        "spoon",
        "oven mitts",
        "measuring spoons",
        "  tsp (2.5 mL) of liquid dishwashing soap",
        "Isolating the Banana’s DNA",
        "paper coffee filter",
        "tall, narrow drinking glass",
        "elastic",
        "timer",
        "camera / smartphone",
        "Keeping the DNA You Isolated",
        "small, clear glass bottle",
        "isopropyl alcohol",
        "wood skewer"
    ],
    "text": " Creating the Mashed Banana Mixture Place a bottle of isopropyl alcohol in the freezer. Before you start the experiment, put your bottle of isopropyl alcohol in the freezer. You can also pour some alcohol out of the main bottle it came in and put it into an empty, clean bottle or glass and then put that bottle or glass in the freezer. Don’t worry, the isopropyl alcohol won’t actually freeze solid like water. Try to use 90% or higher isopropyl alcohol for this experiment. However, if you have isopropyl alcohol at home already that’s at least 70%, you can use that. If you don’t have any isopropyl alcohol, you can buy some at a drugstore or pharmacy; it is fairly inexpensive. Make sure you have a ripe banana for this experiment. You’re going to need to mash the banana up into something that looks like pudding. Therefore, you need the banana to be really soft and ripe. You know it’s really ripe when the outside of the banana is a dark yellow or brown and there are black spots on it. Peel the outside off the banana and break or cut off about half of the banana for your experiment. If you don’t have any ripe bananas, leave one out on the counter until it’s almost brown before doing this experiment. You can also use a blender to mash the banana if you don’t want to wait for one to ripen. Mash the banana inside a plastic resealable freezer bag. Place the portion of the banana that you broke off into a plastic resealable bag. Make sure all the air is out of the bag and then seal it closed. Use your hands to mash the banana until it looks like pudding. It should take you a minute or two to mash the banana this way. Make sure all the lumps have been mashed. You could also try mashing the banana inside the bag with a rolling pin. Simply roll the rolling pin back and forth across the bag until it’s all mashed up. Combine hot water and salt in a measuring cup. Pour hot water directly from the faucet into a measuring cup until you have ⁄2  c (120 mL). Use a spoon to mix the water with 1  tsp (4.9 mL) of salt until the salt is completely dissolved. Salt is being used in this step because it has a positive electrical charge. DNA, on the other hand, has a negative electrical charge. When combined, the negative and positive charges balance themselves out and will allow the DNA molecules to collect together. Make sure to use really hot, steaming water from the faucet. Be careful to only handle the measuring cup by its handle in case it’s really hot. Any type of salt will work for this step. However, finer table salt will dissolve faster than chunkier sea salt. Mix the salt-water mix with the mashed banana for 30-45 seconds. Re-open the plastic resealable bag and carefully pour the salt-water mixture into the bag with the mashed-up banana. Reseal the bag and remove as much air as possible. Use your hands to move and shake the bag to mix the salt-water and banana together. Keep mixing the contents of the bag for about 30-45 seconds. You may need to allow the salt-water mix to cool a bit before you pour it into the plastic bag. If the bag is too hot to handle once the water is inside, use oven mitts to hold it. Add liquid dish soap to the bag and mix it with the banana/salt-water. Use a measuring spoon to measure ⁄2 teaspoon (2.5 mL) of liquid dish soap. Re-open the plastic resealable bag and pour in the liquid dish soap. Reseal the bag and remove as much air as possible. Use your hands to move the bag around gently to mix the liquid dish soap into the banana/salt-water mixture. The soap used in this step will dissolve the lipids (or fats) in the cell membranes around the DNA molecules. This will allow the DNA molecules to be separated in the mixture. Mix the contents of the bag gently. You want to dissolve all the soap into the banana/salt-water mixture without creating a lot of bubbles. You can also use shampoo instead of dish soap. Isolating the Banana’s DNA Attach a coffee filter to the top of a narrow glass with an elastic. Slide the paper coffee filter into the top of the tall, narrow drinking glass. Fold the top of the coffee filter over the edge of the glass and secure it in place with an elastic. Even though you’ve secured the filter with an elastic, you may still need to use your hand to hold the filter in place once you start to pour stuff through it. Pour the contents of the bag into the glass. Open the plastic resealable bag with the banana/salt-water/soap mixture and slowly pour that mixture into the tall, narrow glass through the coffee filter. Don’t allow the filter to overflow; go slowly. This process may take several minutes to complete. The mashed banana will stay in the filter, while the liquid will filter through to the glass. The liquid flowing through the coffee filter is essentially soapy saltwater that contains the DNA molecules of the banana. The DNA molecules have been separated from the rest of the banana, therefore, the mashed banana is no longer needed. Once all the liquid has moved through the filter, you can discard the filter and its contents. Add the isopropyl alcohol slowly to the tilted narrow glass. Take the isopropyl alcohol out of the freezer. Pick up the tall, narrow glass with your non-dominant hand and tilt it at a 45-degree angle to one side. Use your dominant hand to pour the isopropyl alcohol in so that is slowly goes down the side of the glass. Stop pouring when there’s a layer of isopropyl alcohol about 1–2 in (2.5–5.1 cm) thick on top of the liquid mixture you filtered into the glass. Do not pour the isopropyl alcohol directly into the liquid that’s in the glass. Once done, you should see two distinct layers of liquid; the banana/soap/salt-water on the bottom and the alcohol on the top. The DNA molecules are currently dissolved in the banana/soap/salt-water mixture. Leave the glass on the counter for at least 8 minutes. Tilt the tall, narrow glass upright and place it on the counter. Set a timer for 8 minutes and do not touch the glass. During the 8 minutes, watch the glass for bubbles and movement. As mentioned, the DNA molecules are currently dissolved in the banana/soap/salt-water mixture. The combination of alcohol and salt causes those DNA molecules to precipitate or develop into a solid. We put the alcohol in the freezer because the lower temperatures allow more DNA molecules to form. You can leave the glass for longer than 8 minutes. The longer you leave it, the more defined the DNA material will become. Keeping the DNA Create a scientific storage environment with a small bottle. Find a small, clear glass bottle to use for longer-term storage. You can use a brand new bottle or reuse an old bottle (such as one previously used for spices). If you’ve decided to reuse an old bottle, make sure it’s completely clean inside and that the label has been removed. Fill the bottle with isopropyl alcohol. A dollar store is a great place to find a variety of small glass containers that may work for this purpose. The isopropyl alcohol doesn’t have to be cold for this step. Dip the wood skewer into the glass and stir it slowly. Stick the wood skewer into the tall, narrow glass until the tip of the skewer is located where the isopropyl alcohol meets the banana/salt-water/soap mixture. Slowly turn or stir the wood skewer in this area and watch for bubbly, stringy pieces to move into the alcohol layer. Allow the DNA strands to wrap around the wood skewer. This step provides a great photo opportunity of the DNA. Move the banana’s DNA into your newly created storage bottle. Slowly take the wood skewer–with the DNA wrapped around it–out of the tall, narrow glass. Place the wood skewer into the small bottle filled with isopropyl alcohol. Swirl the wood skewer a little bit to allow the DNA strand to move off the skewer and into the alcohol. Once the DNA is in the alcohol, secure the lid on the bottle and keep it as long as you’d like.",
    "sentences": [
        " Creating the Mashed Banana Mixture Place a bottle of isopropyl alcohol in the freezer.",
        "Before you start the experiment, put your bottle of isopropyl alcohol in the freezer.",
        "You can also pour some alcohol out of the main bottle it came in and put it into an empty, clean bottle or glass and then put that bottle or glass in the freezer.",
        "Don’t worry, the isopropyl alcohol won’t actually freeze solid like water.",
        "Try to use 90% or higher isopropyl alcohol for this experiment.",
        "However, if you have isopropyl alcohol at home already that’s at least 70%, you can use that.",
        "If you don’t have any isopropyl alcohol, you can buy some at a drugstore or pharmacy; it is fairly inexpensive.",
        "Make sure you have a ripe banana for this experiment.",
        "You’re going to need to mash the banana up into something that looks like pudding.",
        "Therefore, you need the banana to be really soft and ripe.",
        "You know it’s really ripe when the outside of the banana is a dark yellow or brown and there are black spots on it.",
        "Peel the outside off the banana and break or cut off about half of the banana for your experiment.",
        "If you don’t have any ripe bananas, leave one out on the counter until it’s almost brown before doing this experiment.",
        "You can also use a blender to mash the banana if you don’t want to wait for one to ripen.",
        "Mash the banana inside a plastic resealable freezer bag.",
        "Place the portion of the banana that you broke off into a plastic resealable bag.",
        "Make sure all the air is out of the bag and then seal it closed.",
        "Use your hands to mash the banana until it looks like pudding.",
        "It should take you a minute or two to mash the banana this way.",
        "Make sure all the lumps have been mashed.",
        "You could also try mashing the banana inside the bag with a rolling pin.",
        "Simply roll the rolling pin back and forth across the bag until it’s all mashed up.",
        "Combine hot water and salt in a measuring cup.",
        "Pour hot water directly from the faucet into a measuring cup until you have ⁄2  c (120 mL).",
        "Use a spoon to mix the water with 1  tsp (4.9 mL) of salt until the salt is completely dissolved.",
        "Salt is being used in this step because it has a positive electrical charge.",
        "DNA, on the other hand, has a negative electrical charge.",
        "When combined, the negative and positive charges balance themselves out and will allow the DNA molecules to collect together.",
        "Make sure to use really hot, steaming water from the faucet.",
        "Be careful to only handle the measuring cup by its handle in case it’s really hot.",
        "Any type of salt will work for this step.",
        "However, finer table salt will dissolve faster than chunkier sea salt.",
        "Mix the salt-water mix with the mashed banana for 30-45 seconds.",
        "Re-open the plastic resealable bag and carefully pour the salt-water mixture into the bag with the mashed-up banana.",
        "Reseal the bag and remove as much air as possible.",
        "Use your hands to move and shake the bag to mix the salt-water and banana together.",
        "Keep mixing the contents of the bag for about 30-45 seconds.",
        "You may need to allow the salt-water mix to cool a bit before you pour it into the plastic bag.",
        "If the bag is too hot to handle once the water is inside, use oven mitts to hold it.",
        "Add liquid dish soap to the bag and mix it with the banana/salt-water.",
        "Use a measuring spoon to measure ⁄2 teaspoon (2.5 mL) of liquid dish soap.",
        "Re-open the plastic resealable bag and pour in the liquid dish soap.",
        "Reseal the bag and remove as much air as possible.",
        "Use your hands to move the bag around gently to mix the liquid dish soap into the banana/salt-water mixture.",
        "The soap used in this step will dissolve the lipids (or fats) in the cell membranes around the DNA molecules.",
        "This will allow the DNA molecules to be separated in the mixture.",
        "Mix the contents of the bag gently.",
        "You want to dissolve all the soap into the banana/salt-water mixture without creating a lot of bubbles.",
        "You can also use shampoo instead of dish soap.",
        "Isolating the Banana’s DNA Attach a coffee filter to the top of a narrow glass with an elastic.",
        "Slide the paper coffee filter into the top of the tall, narrow drinking glass.",
        "Fold the top of the coffee filter over the edge of the glass and secure it in place with an elastic.",
        "Even though you’ve secured the filter with an elastic, you may still need to use your hand to hold the filter in place once you start to pour stuff through it.",
        "Pour the contents of the bag into the glass.",
        "Open the plastic resealable bag with the banana/salt-water/soap mixture and slowly pour that mixture into the tall, narrow glass through the coffee filter.",
        "Don’t allow the filter to overflow; go slowly.",
        "This process may take several minutes to complete.",
        "The mashed banana will stay in the filter, while the liquid will filter through to the glass.",
        "The liquid flowing through the coffee filter is essentially soapy saltwater that contains the DNA molecules of the banana.",
        "The DNA molecules have been separated from the rest of the banana, therefore, the mashed banana is no longer needed.",
        "Once all the liquid has moved through the filter, you can discard the filter and its contents.",
        "Add the isopropyl alcohol slowly to the tilted narrow glass.",
        "Take the isopropyl alcohol out of the freezer.",
        "Pick up the tall, narrow glass with your non-dominant hand and tilt it at a 45-degree angle to one side.",
        "Use your dominant hand to pour the isopropyl alcohol in so that is slowly goes down the side of the glass.",
        "Stop pouring when there’s a layer of isopropyl alcohol about 1–2 in (2.5–5.1 cm) thick on top of the liquid mixture you filtered into the glass.",
        "Do not pour the isopropyl alcohol directly into the liquid that’s in the glass.",
        "Once done, you should see two distinct layers of liquid; the banana/soap/salt-water on the bottom and the alcohol on the top.",
        "The DNA molecules are currently dissolved in the banana/soap/salt-water mixture.",
        "Leave the glass on the counter for at least 8 minutes.",
        "Tilt the tall, narrow glass upright and place it on the counter.",
        "Set a timer for 8 minutes and do not touch the glass.",
        "During the 8 minutes, watch the glass for bubbles and movement.",
        "As mentioned, the DNA molecules are currently dissolved in the banana/soap/salt-water mixture.",
        "The combination of alcohol and salt causes those DNA molecules to precipitate or develop into a solid.",
        "We put the alcohol in the freezer because the lower temperatures allow more DNA molecules to form.",
        "You can leave the glass for longer than 8 minutes.",
        "The longer you leave it, the more defined the DNA material will become.",
        "Keeping the DNA Create a scientific storage environment with a small bottle.",
        "Find a small, clear glass bottle to use for longer-term storage.",
        "You can use a brand new bottle or reuse an old bottle (such as one previously used for spices).",
        "If you’ve decided to reuse an old bottle, make sure it’s completely clean inside and that the label has been removed.",
        "Fill the bottle with isopropyl alcohol.",
        "A dollar store is a great place to find a variety of small glass containers that may work for this purpose.",
        "The isopropyl alcohol doesn’t have to be cold for this step.",
        "Dip the wood skewer into the glass and stir it slowly.",
        "Stick the wood skewer into the tall, narrow glass until the tip of the skewer is located where the isopropyl alcohol meets the banana/salt-water/soap mixture.",
        "Slowly turn or stir the wood skewer in this area and watch for bubbly, stringy pieces to move into the alcohol layer.",
        "Allow the DNA strands to wrap around the wood skewer.",
        "This step provides a great photo opportunity of the DNA.",
        "Move the banana’s DNA into your newly created storage bottle.",
        "Slowly take the wood skewer–with the DNA wrapped around it–out of the tall, narrow glass.",
        "Place the wood skewer into the small bottle filled with isopropyl alcohol.",
        "Swirl the wood skewer a little bit to allow the DNA strand to move off the skewer and into the alcohol.",
        "Once the DNA is in the alcohol, secure the lid on the bottle and keep it as long as you’d like."
    ]
}