{
    "title": "How to Play the Guzheng (Chinese Zither)",
    "url": "https://www.wikihow.com/Play-the-Guzheng-(Chinese-Zither)",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments"
    ],
    "parts": [
        {
            "name": "Learning the Basics",
            "steps": [
                {
                    "headline": "Know how to put on your artificial nails.",
                    "description": "Guzheng players will need artificial long nails so they can play the strings. The nails are usually a brown-white marble colour, and for beginners, you'll usually need 3 of them, including the special one for the thumb. Get the tape. The tape comes in many colours and is used to stick the nails to the fingers. You'll need about 6–8 centimeter (2–3 in) of tape for each nail. Stick one end of the tape to the nail. Put the nail before your first joint on your finger and wrap the tape around the finger. Test the nail on the guzheng to see if it works. Simply pluck a string. Use the above steps for the middle and index fingers. For the thumb, follow the same steps, except you should turn the nail at a 45-degree angle to the right."
                },
                {
                    "headline": "Learn the basics of plucking the strings of the guzheng.",
                    "description": "When plucking the strings, you shouldn't use your wrist to give you strength, but instead, you should use your fingers to give you the strength to pluck the strings. Practice moving your fingers into a curve, then back up. These are the basic techniques for plucking:\nTo pluck the string with your thumb, position your thumb at a place where it will be able to make a sound out of the string. If you put on your nail correctly, the thumb should be able to pluck the string. The name for the thumb's plucking is \"tuo\". In music, its symbol is a shape of a right angle. To pluck the string with your index finger, tuck all the other fingers in your palm. Use your index finger to pluck the string, and during that, quickly move it so it aligns with the other fingers in the palm. The name for the index finger's plucking is \"mo\". Its symbol is a slash. Pluck the string with your middle finger. Do the same as you would with the index finger, except use the middle finger. The name for the middle finger is \"gou\". Its symbol is a rainbow-like shape. Try using your ring finger to pluck. Only do this when you have mastered the other 3. Pluck it the same way as your index finger. This is called \"da\". It is represented by a mountain-like structure. During, before, and after plucking, your other fingers should be curved in your hand.Tip: When plucking and playing songs, make sure you position your hand to the right of the guzheng. This will create the best sound."
                },
                {
                    "headline": "Understand how to tune your guzheng.",
                    "description": "To tune your guzheng, open the box on the right-end of the guzheng. There should be many little silver keys. To do the steps below to tune it, you should have a tuner to check your notes and a lever to adjust the strings. Play a note on your guzheng while the tuner is on. If the machine flashes a green light, you can move onto the next note. If it flashes a red light, figure out what to do. If the line is pointing toward the left, it is flat and the string needs tightening. To do this, get your lever and position it on the corresponding silver key to the note. Push it forward a bit. Then check it again, then repeat. If the line is pointing to the right, it is sharp and it needs to be looser. Do the opposite of the above: push it backwards to loosen the string. Repeat for all strings."
                },
                {
                    "headline": "Learn to read guzheng music.",
                    "description": "In guzheng music, there are only 5 notes: C, D, E, G, and A. F and B can be made by manipulating the strings, but the basic 5 are the pentatonic C scale. In order to understand which note is which, find the green strings on your guzheng. Every green string represents an octave. Every green string is the note G.\nCounting down from the green string, the notes are A and C.\nCounting forward from the green string, the notes are E and D.\nIn Chinese music, all the notes are represented by numbers. C is 1, D is 2, and so on. Note that G is still 5, not 4. Next, you'll need to learn the octaves of Chinese music. The highest note, C, on the guzheng is the string that is closest to you. The lowest note, also C, is the string that is furthest away from you. The highest C will have 2 dots above it in sheet music. So, that will be represented by 1 with 2 dots above it. The lowest C will have 2 dots below 1. The second note that is most towards you is A. Therefore, it will be 6 in Chinese music. It will have only 1 dot above it. The second note that is farthest from you will be D. It will be 2 and have 2 dots below it in Chinese music."
                },
                {
                    "headline": "Play a simple song.",
                    "description": "There are many simple songs you can find on the internet, so try one! Go for songs with a simple rhythm, as those are easier for beginners. Don't play something like \"Twinkle Twinkle Little Star\", as that requires an F. Since it requires more technique to play F on the guzheng, it's best if you don't try as a beginner. Learning plucking and getting basic knowledge of the strings are the top priorities."
                }
            ]
        },
        {
            "name": "Learning More Advanced Techniques",
            "steps": [
                {
                    "headline": "Try doing a glissando.",
                    "description": "A glissando is when you simply start at one string then move the hand to pluck every single string until you stop at another string. It is similar to the piano glissando. When doing a glissando with your thumb, shift the other parts of your hand forward."
                },
                {
                    "headline": "Try plucking away from your palm.",
                    "description": "This is the opposite of basic plucking. This takes practice, but the result is worth it! Start by doing this with your thumb, then move on to other fingers. This can be done by any finger, though it is almost never done by the pinky."
                },
                {
                    "headline": "Play some chords.",
                    "description": "Using your right hand, use your thumb and another finger to play a chord (two notes together). There are 2 forms of this- playing a chord with your index and thumb, or middle finger and thumb. For 2 notes that have less than 4 other notes between them, use your index and thumb. #*For 2 notes that have 4 or more, use your middle finger. Make sure not to touch other keys when playing the chord."
                },
                {
                    "headline": "Try doing double plucking.",
                    "description": "This is when you pluck the same note using the same finger two times in a row. Make sure to do it quickly! This can be done by either plucking away and toward your palm. Make sure all the plucks after the first one are done quickly and without putting the artificial nail on the string before plucking. If you put it on the string before plucking after the first pluck, it will result in the vibration being lost and a bad noise."
                },
                {
                    "headline": "Incorporate your left hand.",
                    "description": "Here are a couple of ways you can do this:\nWhen playing the note E, on the other side of the guzheng (your left side), press down on the string. The note will turn to an F.\nTo play B, pluck the note A while pressing down on the other side. Use your left hand on the right side to do some simple glissandos and chords/notes. Right after playing any note, lightly press down on the left side for a fun effect."
                },
                {
                    "headline": "Play songs that are quick-beat.",
                    "description": "These songs sound very good once you get the hang of it! To play these songs you'll need practice."
                }
            ]
        }
    ],
    "tyn": [
        "Working guzheng",
        "Artificial nails",
        "Special tape",
        "Sheet music",
        "Tuner",
        "Teacher (optional)"
    ],
    "text": " Learning the Basics Know how to put on your artificial nails. Guzheng players will need artificial long nails so they can play the strings. The nails are usually a brown-white marble colour, and for beginners, you'll usually need 3 of them, including the special one for the thumb. Get the tape. The tape comes in many colours and is used to stick the nails to the fingers. You'll need about 6–8 centimeter (2–3 in) of tape for each nail. Stick one end of the tape to the nail. Put the nail before your first joint on your finger and wrap the tape around the finger. Test the nail on the guzheng to see if it works. Simply pluck a string. Use the above steps for the middle and index fingers. For the thumb, follow the same steps, except you should turn the nail at a 45-degree angle to the right. Learn the basics of plucking the strings of the guzheng. When plucking the strings, you shouldn't use your wrist to give you strength, but instead, you should use your fingers to give you the strength to pluck the strings. Practice moving your fingers into a curve, then back up. These are the basic techniques for plucking:\nTo pluck the string with your thumb, position your thumb at a place where it will be able to make a sound out of the string. If you put on your nail correctly, the thumb should be able to pluck the string. The name for the thumb's plucking is \"tuo\". In music, its symbol is a shape of a right angle. To pluck the string with your index finger, tuck all the other fingers in your palm. Use your index finger to pluck the string, and during that, quickly move it so it aligns with the other fingers in the palm. The name for the index finger's plucking is \"mo\". Its symbol is a slash. Pluck the string with your middle finger. Do the same as you would with the index finger, except use the middle finger. The name for the middle finger is \"gou\". Its symbol is a rainbow-like shape. Try using your ring finger to pluck. Only do this when you have mastered the other 3. Pluck it the same way as your index finger. This is called \"da\". It is represented by a mountain-like structure. During, before, and after plucking, your other fingers should be curved in your hand.Tip: When plucking and playing songs, make sure you position your hand to the right of the guzheng. This will create the best sound. Understand how to tune your guzheng. To tune your guzheng, open the box on the right-end of the guzheng. There should be many little silver keys. To do the steps below to tune it, you should have a tuner to check your notes and a lever to adjust the strings. Play a note on your guzheng while the tuner is on. If the machine flashes a green light, you can move onto the next note. If it flashes a red light, figure out what to do. If the line is pointing toward the left, it is flat and the string needs tightening. To do this, get your lever and position it on the corresponding silver key to the note. Push it forward a bit. Then check it again, then repeat. If the line is pointing to the right, it is sharp and it needs to be looser. Do the opposite of the above: push it backwards to loosen the string. Repeat for all strings. Learn to read guzheng music. In guzheng music, there are only 5 notes: C, D, E, G, and A. F and B can be made by manipulating the strings, but the basic 5 are the pentatonic C scale. In order to understand which note is which, find the green strings on your guzheng. Every green string represents an octave. Every green string is the note G.\nCounting down from the green string, the notes are A and C.\nCounting forward from the green string, the notes are E and D.\nIn Chinese music, all the notes are represented by numbers. C is 1, D is 2, and so on. Note that G is still 5, not 4. Next, you'll need to learn the octaves of Chinese music. The highest note, C, on the guzheng is the string that is closest to you. The lowest note, also C, is the string that is furthest away from you. The highest C will have 2 dots above it in sheet music. So, that will be represented by 1 with 2 dots above it. The lowest C will have 2 dots below 1. The second note that is most towards you is A. Therefore, it will be 6 in Chinese music. It will have only 1 dot above it. The second note that is farthest from you will be D. It will be 2 and have 2 dots below it in Chinese music. Play a simple song. There are many simple songs you can find on the internet, so try one! Go for songs with a simple rhythm, as those are easier for beginners. Don't play something like \"Twinkle Twinkle Little Star\", as that requires an F. Since it requires more technique to play F on the guzheng, it's best if you don't try as a beginner. Learning plucking and getting basic knowledge of the strings are the top priorities. Learning More Advanced Techniques Try doing a glissando. A glissando is when you simply start at one string then move the hand to pluck every single string until you stop at another string. It is similar to the piano glissando. When doing a glissando with your thumb, shift the other parts of your hand forward. Try plucking away from your palm. This is the opposite of basic plucking. This takes practice, but the result is worth it! Start by doing this with your thumb, then move on to other fingers. This can be done by any finger, though it is almost never done by the pinky. Play some chords. Using your right hand, use your thumb and another finger to play a chord (two notes together). There are 2 forms of this- playing a chord with your index and thumb, or middle finger and thumb. For 2 notes that have less than 4 other notes between them, use your index and thumb. #*For 2 notes that have 4 or more, use your middle finger. Make sure not to touch other keys when playing the chord. Try doing double plucking. This is when you pluck the same note using the same finger two times in a row. Make sure to do it quickly! This can be done by either plucking away and toward your palm. Make sure all the plucks after the first one are done quickly and without putting the artificial nail on the string before plucking. If you put it on the string before plucking after the first pluck, it will result in the vibration being lost and a bad noise. Incorporate your left hand. Here are a couple of ways you can do this:\nWhen playing the note E, on the other side of the guzheng (your left side), press down on the string. The note will turn to an F.\nTo play B, pluck the note A while pressing down on the other side. Use your left hand on the right side to do some simple glissandos and chords/notes. Right after playing any note, lightly press down on the left side for a fun effect. Play songs that are quick-beat. These songs sound very good once you get the hang of it! To play these songs you'll need practice.",
    "sentences": [
        " Learning the Basics Know how to put on your artificial nails.",
        "Guzheng players will need artificial long nails so they can play the strings.",
        "The nails are usually a brown-white marble colour, and for beginners, you'll usually need 3 of them, including the special one for the thumb.",
        "Get the tape.",
        "The tape comes in many colours and is used to stick the nails to the fingers.",
        "You'll need about 6–8 centimeter (2–3 in) of tape for each nail.",
        "Stick one end of the tape to the nail.",
        "Put the nail before your first joint on your finger and wrap the tape around the finger.",
        "Test the nail on the guzheng to see if it works.",
        "Simply pluck a string.",
        "Use the above steps for the middle and index fingers.",
        "For the thumb, follow the same steps, except you should turn the nail at a 45-degree angle to the right.",
        "Learn the basics of plucking the strings of the guzheng.",
        "When plucking the strings, you shouldn't use your wrist to give you strength, but instead, you should use your fingers to give you the strength to pluck the strings.",
        "Practice moving your fingers into a curve, then back up.",
        "These are the basic techniques for plucking:\nTo pluck the string with your thumb, position your thumb at a place where it will be able to make a sound out of the string.",
        "If you put on your nail correctly, the thumb should be able to pluck the string.",
        "The name for the thumb's plucking is \"tuo\".",
        "In music, its symbol is a shape of a right angle.",
        "To pluck the string with your index finger, tuck all the other fingers in your palm.",
        "Use your index finger to pluck the string, and during that, quickly move it so it aligns with the other fingers in the palm.",
        "The name for the index finger's plucking is \"mo\".",
        "Its symbol is a slash.",
        "Pluck the string with your middle finger.",
        "Do the same as you would with the index finger, except use the middle finger.",
        "The name for the middle finger is \"gou\".",
        "Its symbol is a rainbow-like shape.",
        "Try using your ring finger to pluck.",
        "Only do this when you have mastered the other 3.",
        "Pluck it the same way as your index finger.",
        "This is called \"da\".",
        "It is represented by a mountain-like structure.",
        "During, before, and after plucking, your other fingers should be curved in your hand.Tip: When plucking and playing songs, make sure you position your hand to the right of the guzheng.",
        "This will create the best sound.",
        "Understand how to tune your guzheng.",
        "To tune your guzheng, open the box on the right-end of the guzheng.",
        "There should be many little silver keys.",
        "To do the steps below to tune it, you should have a tuner to check your notes and a lever to adjust the strings.",
        "Play a note on your guzheng while the tuner is on.",
        "If the machine flashes a green light, you can move onto the next note.",
        "If it flashes a red light, figure out what to do.",
        "If the line is pointing toward the left, it is flat and the string needs tightening.",
        "To do this, get your lever and position it on the corresponding silver key to the note.",
        "Push it forward a bit.",
        "Then check it again, then repeat.",
        "If the line is pointing to the right, it is sharp and it needs to be looser.",
        "Do the opposite of the above: push it backwards to loosen the string.",
        "Repeat for all strings.",
        "Learn to read guzheng music.",
        "In guzheng music, there are only 5 notes: C, D, E, G, and A. F and B can be made by manipulating the strings, but the basic 5 are the pentatonic C scale.",
        "In order to understand which note is which, find the green strings on your guzheng.",
        "Every green string represents an octave.",
        "Every green string is the note G.\nCounting down from the green string, the notes are A and C.\nCounting forward from the green string, the notes are E and D.\nIn Chinese music, all the notes are represented by numbers.",
        "C is 1, D is 2, and so on.",
        "Note that G is still 5, not 4.",
        "Next, you'll need to learn the octaves of Chinese music.",
        "The highest note, C, on the guzheng is the string that is closest to you.",
        "The lowest note, also C, is the string that is furthest away from you.",
        "The highest C will have 2 dots above it in sheet music.",
        "So, that will be represented by 1 with 2 dots above it.",
        "The lowest C will have 2 dots below 1.",
        "The second note that is most towards you is A.",
        "Therefore, it will be 6 in Chinese music.",
        "It will have only 1 dot above it.",
        "The second note that is farthest from you will be D. It will be 2 and have 2 dots below it in Chinese music.",
        "Play a simple song.",
        "There are many simple songs you can find on the internet, so try one!",
        "Go for songs with a simple rhythm, as those are easier for beginners.",
        "Don't play something like \"Twinkle Twinkle Little Star\", as that requires an F. Since it requires more technique to play F on the guzheng, it's best if you don't try as a beginner.",
        "Learning plucking and getting basic knowledge of the strings are the top priorities.",
        "Learning More Advanced Techniques Try doing a glissando.",
        "A glissando is when you simply start at one string then move the hand to pluck every single string until you stop at another string.",
        "It is similar to the piano glissando.",
        "When doing a glissando with your thumb, shift the other parts of your hand forward.",
        "Try plucking away from your palm.",
        "This is the opposite of basic plucking.",
        "This takes practice, but the result is worth it!",
        "Start by doing this with your thumb, then move on to other fingers.",
        "This can be done by any finger, though it is almost never done by the pinky.",
        "Play some chords.",
        "Using your right hand, use your thumb and another finger to play a chord (two notes together).",
        "There are 2 forms of this- playing a chord with your index and thumb, or middle finger and thumb.",
        "For 2 notes that have less than 4 other notes between them, use your index and thumb.",
        "#*For 2 notes that have 4 or more, use your middle finger.",
        "Make sure not to touch other keys when playing the chord.",
        "Try doing double plucking.",
        "This is when you pluck the same note using the same finger two times in a row.",
        "Make sure to do it quickly!",
        "This can be done by either plucking away and toward your palm.",
        "Make sure all the plucks after the first one are done quickly and without putting the artificial nail on the string before plucking.",
        "If you put it on the string before plucking after the first pluck, it will result in the vibration being lost and a bad noise.",
        "Incorporate your left hand.",
        "Here are a couple of ways you can do this:\nWhen playing the note E, on the other side of the guzheng (your left side), press down on the string.",
        "The note will turn to an F.\nTo play B, pluck the note A while pressing down on the other side.",
        "Use your left hand on the right side to do some simple glissandos and chords/notes.",
        "Right after playing any note, lightly press down on the left side for a fun effect.",
        "Play songs that are quick-beat.",
        "These songs sound very good once you get the hang of it!",
        "To play these songs you'll need practice."
    ]
}