{
    "title": "How to Hang a TV Mount",
    "url": "https://www.wikihow.com/Hang-a-TV-Mount",
    "category_hierarchy": [
        "Computers and Electronics",
        "Consumer Electronics",
        "Television"
    ],
    "parts": [
        {
            "name": "Finding a Location",
            "steps": [
                {
                    "headline": "Choose a spot where you can watch the TV while sitting.",
                    "description": "The TV placement depends on the layout of the room. Generally, find a spot that you can watch the TV from straight ahead, without uncomfortably turning your head. For the best picture, mount the TV just about eye-level with you when you’re sitting. If you have to mount the TV higher than eye level, consider using a tiled mount to reduce glare and improve the picture."
                },
                {
                    "headline": "Locate the TV close to an outlet to avoid running cables across the room.",
                    "description": "Try to mount the TV just above an outlet or close to it. This way, you won’t have to run long cables around the room. If you want to hide the cables, you can install a cable concealer to run the cables down. Cut the concealer so it fits between the TV and outlet, then tuck the cables inside it. Peel off the paper on the back and stick it to the wall. Paint the cover the same color as the wall so it blends in."
                },
                {
                    "headline": "Avoid placing the TV in a spot where the temperature tops 100 °F (38 °C).",
                    "description": "This is especially important if you want to place the TV above a fireplace. While this looks good, the heat can damage the TV’s electronics. Don’t place the TV directly above a heat source like this. Instead, locate it off-center so the heat doesn’t rise directly into the TV. If your fireplace is only for show and you don’t light it, then it’s fine to place the TV above it. Gas or electric fireplaces don’t produce as much heat as wood-burning ones. If you have one of these, then it’s safer to mount the TV above it. Confirm with the manufacturer before mounting it."
                }
            ]
        },
        {
            "name": "Sizing the Mount",
            "steps": [
                {
                    "headline": "Get a mounting kit that matches your TV.",
                    "description": "If your TV didn’t come with mounting hardware, then find a kit that will fit your TV. If your TV manufacturer also makes a mounting kit, then ordering from them is a good option. Otherwise, search for a kit that fits your TV model. Check the size requirements of each mounting kit before buying to make sure it fits your TV. Also check the weight that the mount can hold so your TV doesn't fall. There are basic mounts that just attach the TV flat against the wall. Other types are tilted to prevent glare, or use a swivel so you can adjust the TV. Choose a type that matches your needs. The process of hanging the mount is similar for all types. Always refer to the installation manual that comes with your TV mount for the correct procedure."
                },
                {
                    "headline": "Hold the mount onto the TV and measure the distance from the top.",
                    "description": "The mount only covers a small section on the back of the TV, so your installation will be off if you don’t measure the TV as well. Hold the mount onto the back of the TV in same spot where it attaches. This is usually near the center. Use a tape measure to measure the distance from the top of the mount to the top of the TV. This measurement tells you how high to install the mount so the TV is at the correct level. For example, if the mount is 6 inches (15 cm) from the top of the TV, then install the mount 6 inches (15 cm) below where you want the top of the sit to rest."
                },
                {
                    "headline": "Mark where you want the top of your TV and the height of the mount.",
                    "description": "First, choose the spot you want the TV to rest and draw a line on the wall. Then measure down the distance you took between the mount and the top of the TV and draw a line there as well. When you install the mount, locate its top edge on this line. If you want the TV top to sit 60 inches (150 cm) from the ground and the mount is 6 inches (15 cm) below the top of the TV, then install the mount at 54 inches (140 cm) on the wall. Don't worry about making marks on the wall because the TV will cover them."
                }
            ]
        },
        {
            "name": "Marking Studs and Holes",
            "steps": [
                {
                    "headline": "Mark the studs on the wall where you want your TV.",
                    "description": "You need 2 studs to attach the mount to. Find 2 studs in the area you’re installing the mount. Then mark the center of each one. A stud finder is the easiest way to find studs. If you don’t have one, tap on the wall with a solid object. If you hear a hollow noise, there is no stud there. If you hear a solid sound, you found a stud. Standard studs are 16 inches (41 cm) apart."
                },
                {
                    "headline": "Press the mount onto the wall and make it level.",
                    "description": "Take the mount and hold it up to the lower line that you drew. Make sure the screw holes in the mount hover over the stud centers. Press it onto the wall and hold a level on top of it. Adjust the mount until it’s completely level. TV mounts can be heavy, so having a partner help you hold it up will make the job easier."
                },
                {
                    "headline": "Mark the 4 screw positions on the wall.",
                    "description": "While still holding the mount against the wall, use a pencil and mark 4 hole positions on the wall, 1 for each corner of the mount. If you have to, slide the mount until the screw holes are over the center of the studs. Mounts usually have multiple holes that you can drill the screws through. Choose holes that rest in the center of the studs."
                },
                {
                    "headline": "Drill pilot holes into each mark.",
                    "description": "Take a power drill and attach a drill bit the same size as the body of the bolts you’re using (not including the width of the threads). Then drill a hole into each mark you made for the bolts. If you drill through the drywall and don’t feel anything behind it, then you missed the stud. Recheck the stud location and try again. Some mounting kits have fasteners that go onto the wall before you hang the mount. Always check the instructions on your mounting kit to confirm the correct process."
                }
            ]
        },
        {
            "name": "Attaching the Mount",
            "steps": [
                {
                    "headline": "Line up the holes in the mount with the pilot holes.",
                    "description": "Hold the mount up and press it against the wall. Slide it so the screw holes line up with the pilot holes. Check that the mount is level one more time before attaching it. If you have a partner, let them hold the mount while you drill, or vice versa. This will make the job much easier."
                },
                {
                    "headline": "Drill a lag bolt into each pilot hole.",
                    "description": "Keep the mount pressed onto the wall and place a lag bolt into each hole. Press each one in slightly with your hand before drilling. Then use the power drill and drill each bolt into the wall. The mounting kit will probably come with lag bolts, but if not, you can buy them from hardware stores."
                },
                {
                    "headline": "Confirm that the mount is level.",
                    "description": "Before continuing with mounting the TV, do one final check. Hold the level on top and make sure the mount is completely level. If so, then go on mounting the TV. If the mount is not level, then pull the bolts out by running the drill in reverse. Readjust the mount and reattach it when it’s level."
                }
            ]
        }
    ],
    "tyn": [
        "TV mounting kit",
        "Power drill",
        "Level",
        "Screwdriver",
        "Pencil",
        "Tape measure",
        "Screws",
        "Lag bolts"
    ],
    "text": " Finding a Location Choose a spot where you can watch the TV while sitting. The TV placement depends on the layout of the room. Generally, find a spot that you can watch the TV from straight ahead, without uncomfortably turning your head. For the best picture, mount the TV just about eye-level with you when you’re sitting. If you have to mount the TV higher than eye level, consider using a tiled mount to reduce glare and improve the picture. Locate the TV close to an outlet to avoid running cables across the room. Try to mount the TV just above an outlet or close to it. This way, you won’t have to run long cables around the room. If you want to hide the cables, you can install a cable concealer to run the cables down. Cut the concealer so it fits between the TV and outlet, then tuck the cables inside it. Peel off the paper on the back and stick it to the wall. Paint the cover the same color as the wall so it blends in. Avoid placing the TV in a spot where the temperature tops 100 °F (38 °C). This is especially important if you want to place the TV above a fireplace. While this looks good, the heat can damage the TV’s electronics. Don’t place the TV directly above a heat source like this. Instead, locate it off-center so the heat doesn’t rise directly into the TV. If your fireplace is only for show and you don’t light it, then it’s fine to place the TV above it. Gas or electric fireplaces don’t produce as much heat as wood-burning ones. If you have one of these, then it’s safer to mount the TV above it. Confirm with the manufacturer before mounting it. Sizing the Mount Get a mounting kit that matches your TV. If your TV didn’t come with mounting hardware, then find a kit that will fit your TV. If your TV manufacturer also makes a mounting kit, then ordering from them is a good option. Otherwise, search for a kit that fits your TV model. Check the size requirements of each mounting kit before buying to make sure it fits your TV. Also check the weight that the mount can hold so your TV doesn't fall. There are basic mounts that just attach the TV flat against the wall. Other types are tilted to prevent glare, or use a swivel so you can adjust the TV. Choose a type that matches your needs. The process of hanging the mount is similar for all types. Always refer to the installation manual that comes with your TV mount for the correct procedure. Hold the mount onto the TV and measure the distance from the top. The mount only covers a small section on the back of the TV, so your installation will be off if you don’t measure the TV as well. Hold the mount onto the back of the TV in same spot where it attaches. This is usually near the center. Use a tape measure to measure the distance from the top of the mount to the top of the TV. This measurement tells you how high to install the mount so the TV is at the correct level. For example, if the mount is 6 inches (15 cm) from the top of the TV, then install the mount 6 inches (15 cm) below where you want the top of the sit to rest. Mark where you want the top of your TV and the height of the mount. First, choose the spot you want the TV to rest and draw a line on the wall. Then measure down the distance you took between the mount and the top of the TV and draw a line there as well. When you install the mount, locate its top edge on this line. If you want the TV top to sit 60 inches (150 cm) from the ground and the mount is 6 inches (15 cm) below the top of the TV, then install the mount at 54 inches (140 cm) on the wall. Don't worry about making marks on the wall because the TV will cover them. Marking Studs and Holes Mark the studs on the wall where you want your TV. You need 2 studs to attach the mount to. Find 2 studs in the area you’re installing the mount. Then mark the center of each one. A stud finder is the easiest way to find studs. If you don’t have one, tap on the wall with a solid object. If you hear a hollow noise, there is no stud there. If you hear a solid sound, you found a stud. Standard studs are 16 inches (41 cm) apart. Press the mount onto the wall and make it level. Take the mount and hold it up to the lower line that you drew. Make sure the screw holes in the mount hover over the stud centers. Press it onto the wall and hold a level on top of it. Adjust the mount until it’s completely level. TV mounts can be heavy, so having a partner help you hold it up will make the job easier. Mark the 4 screw positions on the wall. While still holding the mount against the wall, use a pencil and mark 4 hole positions on the wall, 1 for each corner of the mount. If you have to, slide the mount until the screw holes are over the center of the studs. Mounts usually have multiple holes that you can drill the screws through. Choose holes that rest in the center of the studs. Drill pilot holes into each mark. Take a power drill and attach a drill bit the same size as the body of the bolts you’re using (not including the width of the threads). Then drill a hole into each mark you made for the bolts. If you drill through the drywall and don’t feel anything behind it, then you missed the stud. Recheck the stud location and try again. Some mounting kits have fasteners that go onto the wall before you hang the mount. Always check the instructions on your mounting kit to confirm the correct process. Attaching the Mount Line up the holes in the mount with the pilot holes. Hold the mount up and press it against the wall. Slide it so the screw holes line up with the pilot holes. Check that the mount is level one more time before attaching it. If you have a partner, let them hold the mount while you drill, or vice versa. This will make the job much easier. Drill a lag bolt into each pilot hole. Keep the mount pressed onto the wall and place a lag bolt into each hole. Press each one in slightly with your hand before drilling. Then use the power drill and drill each bolt into the wall. The mounting kit will probably come with lag bolts, but if not, you can buy them from hardware stores. Confirm that the mount is level. Before continuing with mounting the TV, do one final check. Hold the level on top and make sure the mount is completely level. If so, then go on mounting the TV. If the mount is not level, then pull the bolts out by running the drill in reverse. Readjust the mount and reattach it when it’s level.",
    "sentences": [
        " Finding a Location Choose a spot where you can watch the TV while sitting.",
        "The TV placement depends on the layout of the room.",
        "Generally, find a spot that you can watch the TV from straight ahead, without uncomfortably turning your head.",
        "For the best picture, mount the TV just about eye-level with you when you’re sitting.",
        "If you have to mount the TV higher than eye level, consider using a tiled mount to reduce glare and improve the picture.",
        "Locate the TV close to an outlet to avoid running cables across the room.",
        "Try to mount the TV just above an outlet or close to it.",
        "This way, you won’t have to run long cables around the room.",
        "If you want to hide the cables, you can install a cable concealer to run the cables down.",
        "Cut the concealer so it fits between the TV and outlet, then tuck the cables inside it.",
        "Peel off the paper on the back and stick it to the wall.",
        "Paint the cover the same color as the wall so it blends in.",
        "Avoid placing the TV in a spot where the temperature tops 100 °F (38 °C).",
        "This is especially important if you want to place the TV above a fireplace.",
        "While this looks good, the heat can damage the TV’s electronics.",
        "Don’t place the TV directly above a heat source like this.",
        "Instead, locate it off-center so the heat doesn’t rise directly into the TV.",
        "If your fireplace is only for show and you don’t light it, then it’s fine to place the TV above it.",
        "Gas or electric fireplaces don’t produce as much heat as wood-burning ones.",
        "If you have one of these, then it’s safer to mount the TV above it.",
        "Confirm with the manufacturer before mounting it.",
        "Sizing the Mount Get a mounting kit that matches your TV.",
        "If your TV didn’t come with mounting hardware, then find a kit that will fit your TV.",
        "If your TV manufacturer also makes a mounting kit, then ordering from them is a good option.",
        "Otherwise, search for a kit that fits your TV model.",
        "Check the size requirements of each mounting kit before buying to make sure it fits your TV.",
        "Also check the weight that the mount can hold so your TV doesn't fall.",
        "There are basic mounts that just attach the TV flat against the wall.",
        "Other types are tilted to prevent glare, or use a swivel so you can adjust the TV.",
        "Choose a type that matches your needs.",
        "The process of hanging the mount is similar for all types.",
        "Always refer to the installation manual that comes with your TV mount for the correct procedure.",
        "Hold the mount onto the TV and measure the distance from the top.",
        "The mount only covers a small section on the back of the TV, so your installation will be off if you don’t measure the TV as well.",
        "Hold the mount onto the back of the TV in same spot where it attaches.",
        "This is usually near the center.",
        "Use a tape measure to measure the distance from the top of the mount to the top of the TV.",
        "This measurement tells you how high to install the mount so the TV is at the correct level.",
        "For example, if the mount is 6 inches (15 cm) from the top of the TV, then install the mount 6 inches (15 cm) below where you want the top of the sit to rest.",
        "Mark where you want the top of your TV and the height of the mount.",
        "First, choose the spot you want the TV to rest and draw a line on the wall.",
        "Then measure down the distance you took between the mount and the top of the TV and draw a line there as well.",
        "When you install the mount, locate its top edge on this line.",
        "If you want the TV top to sit 60 inches (150 cm) from the ground and the mount is 6 inches (15 cm) below the top of the TV, then install the mount at 54 inches (140 cm) on the wall.",
        "Don't worry about making marks on the wall because the TV will cover them.",
        "Marking Studs and Holes Mark the studs on the wall where you want your TV.",
        "You need 2 studs to attach the mount to.",
        "Find 2 studs in the area you’re installing the mount.",
        "Then mark the center of each one.",
        "A stud finder is the easiest way to find studs.",
        "If you don’t have one, tap on the wall with a solid object.",
        "If you hear a hollow noise, there is no stud there.",
        "If you hear a solid sound, you found a stud.",
        "Standard studs are 16 inches (41 cm) apart.",
        "Press the mount onto the wall and make it level.",
        "Take the mount and hold it up to the lower line that you drew.",
        "Make sure the screw holes in the mount hover over the stud centers.",
        "Press it onto the wall and hold a level on top of it.",
        "Adjust the mount until it’s completely level.",
        "TV mounts can be heavy, so having a partner help you hold it up will make the job easier.",
        "Mark the 4 screw positions on the wall.",
        "While still holding the mount against the wall, use a pencil and mark 4 hole positions on the wall, 1 for each corner of the mount.",
        "If you have to, slide the mount until the screw holes are over the center of the studs.",
        "Mounts usually have multiple holes that you can drill the screws through.",
        "Choose holes that rest in the center of the studs.",
        "Drill pilot holes into each mark.",
        "Take a power drill and attach a drill bit the same size as the body of the bolts you’re using (not including the width of the threads).",
        "Then drill a hole into each mark you made for the bolts.",
        "If you drill through the drywall and don’t feel anything behind it, then you missed the stud.",
        "Recheck the stud location and try again.",
        "Some mounting kits have fasteners that go onto the wall before you hang the mount.",
        "Always check the instructions on your mounting kit to confirm the correct process.",
        "Attaching the Mount Line up the holes in the mount with the pilot holes.",
        "Hold the mount up and press it against the wall.",
        "Slide it so the screw holes line up with the pilot holes.",
        "Check that the mount is level one more time before attaching it.",
        "If you have a partner, let them hold the mount while you drill, or vice versa.",
        "This will make the job much easier.",
        "Drill a lag bolt into each pilot hole.",
        "Keep the mount pressed onto the wall and place a lag bolt into each hole.",
        "Press each one in slightly with your hand before drilling.",
        "Then use the power drill and drill each bolt into the wall.",
        "The mounting kit will probably come with lag bolts, but if not, you can buy them from hardware stores.",
        "Confirm that the mount is level.",
        "Before continuing with mounting the TV, do one final check.",
        "Hold the level on top and make sure the mount is completely level.",
        "If so, then go on mounting the TV.",
        "If the mount is not level, then pull the bolts out by running the drill in reverse.",
        "Readjust the mount and reattach it when it’s level."
    ]
}