{
    "title": "How to Clean a Travel Perfume Bottle",
    "url": "https://www.wikihow.com/Clean-a-Travel-Perfume-Bottle",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Perfume and Body Fragrances",
        "Perfume Containers"
    ],
    "parts": [
        {
            "name": "Making a Soap and Water Mixture",
            "steps": [
                {
                    "headline": "Drain out any excess perfume from your travel bottle.",
                    "description": "Spray any excess perfume that is left in your perfume bottle into the sink and rinse it down the drain. Depending on how full your bottle is, you may have to do this for a few minutes. Starting with an empty perfume bottle will make it much easier to clean. Do not try to spray the excess perfume back into its original bottle. This will most likely create a mess."
                },
                {
                    "headline": "Fill a spray bottle with water and 1 drop of dish soap.",
                    "description": "Find an empty spray bottle that has a similar top to a normal perfume bottle. Rinse the bottle out to remove any leftover product that might be in it. Fill the bottle up about halfway with warm water and 1 drop of dish soap.Tip: If your perfume bottle has a lid that can be taken off, just pour the water and dish soap directly into your perfume bottle. You can either buy an empty spray bottle or use one from a product that you’ve used up. If you use one from an old product, rinse it out super well before you put water and soap into it. Use a mild dish soap that doesn’t have much of a scent."
                },
                {
                    "headline": "Shake your spray bottle to combine the water and soap.",
                    "description": "Put the lid on your spray bottle and gently shake it from side to side for about 1 minute to mix the water and the soap together. If your mixture is really sudsy, add some water to dilute the soap. If your mixture is too soapy and the bubbles overflow out of the bottle, it could leave soap residue in your perfume bottle that is hard to clean out."
                }
            ]
        },
        {
            "name": "Pumping the Mixture Through Your Bottle",
            "steps": [
                {
                    "headline": "Pump water and dish soap into the perfume bottle.",
                    "description": "Take the plastic part that you press down onto off of the spray bottle so that the pump mechanism is sticking out of the top. Insert the exposed tube into the bottom of your perfume bottle and pump water and soap into your travel perfume bottle like you would normal perfume. Fill your perfume bottle up about halfway."
                },
                {
                    "headline": "Spray the water and soap out through the spritzer of the perfume bottle.",
                    "description": "Pump your perfume bottle into the sink or a washcloth until the water and soap is all gone. Make sure to spray out all of the water so that it doesn’t dilute the next perfume you put into the bottle."
                },
                {
                    "headline": "Fill your perfume bottle with warm water.",
                    "description": "Either take off the lid of your perfume bottle and fill it up directly or use the same spray bottle as your soap mixture with just plain water. Fill your perfume bottle up about halfway. If you use the same spray bottle that had your soap and water mixture, make sure to rinse it out thoroughly to get rid of any soap residue before you use it again."
                },
                {
                    "headline": "Pump the water through the perfume bottle to get rid of any soap.",
                    "description": "Spray your perfume bottle into a washcloth or the sink until all of the water is gone. Make sure to get out every last drop of water so that there is no soap left in your bottle.Tip: Test to see if all of the perfume is gone by spritzing the last few pumps of water onto your wrist. Smell your wrist to see if you can still smell any perfume. If you can, you may need to clean out your perfume bottle again."
                }
            ]
        }
    ],
    "tyn": [
        "Empty spray bottle",
        "Dish soap"
    ],
    "text": " Making a Soap and Water Mixture Drain out any excess perfume from your travel bottle. Spray any excess perfume that is left in your perfume bottle into the sink and rinse it down the drain. Depending on how full your bottle is, you may have to do this for a few minutes. Starting with an empty perfume bottle will make it much easier to clean. Do not try to spray the excess perfume back into its original bottle. This will most likely create a mess. Fill a spray bottle with water and 1 drop of dish soap. Find an empty spray bottle that has a similar top to a normal perfume bottle. Rinse the bottle out to remove any leftover product that might be in it. Fill the bottle up about halfway with warm water and 1 drop of dish soap.Tip: If your perfume bottle has a lid that can be taken off, just pour the water and dish soap directly into your perfume bottle. You can either buy an empty spray bottle or use one from a product that you’ve used up. If you use one from an old product, rinse it out super well before you put water and soap into it. Use a mild dish soap that doesn’t have much of a scent. Shake your spray bottle to combine the water and soap. Put the lid on your spray bottle and gently shake it from side to side for about 1 minute to mix the water and the soap together. If your mixture is really sudsy, add some water to dilute the soap. If your mixture is too soapy and the bubbles overflow out of the bottle, it could leave soap residue in your perfume bottle that is hard to clean out. Pumping the Mixture Through Your Bottle Pump water and dish soap into the perfume bottle. Take the plastic part that you press down onto off of the spray bottle so that the pump mechanism is sticking out of the top. Insert the exposed tube into the bottom of your perfume bottle and pump water and soap into your travel perfume bottle like you would normal perfume. Fill your perfume bottle up about halfway. Spray the water and soap out through the spritzer of the perfume bottle. Pump your perfume bottle into the sink or a washcloth until the water and soap is all gone. Make sure to spray out all of the water so that it doesn’t dilute the next perfume you put into the bottle. Fill your perfume bottle with warm water. Either take off the lid of your perfume bottle and fill it up directly or use the same spray bottle as your soap mixture with just plain water. Fill your perfume bottle up about halfway. If you use the same spray bottle that had your soap and water mixture, make sure to rinse it out thoroughly to get rid of any soap residue before you use it again. Pump the water through the perfume bottle to get rid of any soap. Spray your perfume bottle into a washcloth or the sink until all of the water is gone. Make sure to get out every last drop of water so that there is no soap left in your bottle.Tip: Test to see if all of the perfume is gone by spritzing the last few pumps of water onto your wrist. Smell your wrist to see if you can still smell any perfume. If you can, you may need to clean out your perfume bottle again.",
    "sentences": [
        " Making a Soap and Water Mixture Drain out any excess perfume from your travel bottle.",
        "Spray any excess perfume that is left in your perfume bottle into the sink and rinse it down the drain.",
        "Depending on how full your bottle is, you may have to do this for a few minutes.",
        "Starting with an empty perfume bottle will make it much easier to clean.",
        "Do not try to spray the excess perfume back into its original bottle.",
        "This will most likely create a mess.",
        "Fill a spray bottle with water and 1 drop of dish soap.",
        "Find an empty spray bottle that has a similar top to a normal perfume bottle.",
        "Rinse the bottle out to remove any leftover product that might be in it.",
        "Fill the bottle up about halfway with warm water and 1 drop of dish soap.Tip: If your perfume bottle has a lid that can be taken off, just pour the water and dish soap directly into your perfume bottle.",
        "You can either buy an empty spray bottle or use one from a product that you’ve used up.",
        "If you use one from an old product, rinse it out super well before you put water and soap into it.",
        "Use a mild dish soap that doesn’t have much of a scent.",
        "Shake your spray bottle to combine the water and soap.",
        "Put the lid on your spray bottle and gently shake it from side to side for about 1 minute to mix the water and the soap together.",
        "If your mixture is really sudsy, add some water to dilute the soap.",
        "If your mixture is too soapy and the bubbles overflow out of the bottle, it could leave soap residue in your perfume bottle that is hard to clean out.",
        "Pumping the Mixture Through Your Bottle Pump water and dish soap into the perfume bottle.",
        "Take the plastic part that you press down onto off of the spray bottle so that the pump mechanism is sticking out of the top.",
        "Insert the exposed tube into the bottom of your perfume bottle and pump water and soap into your travel perfume bottle like you would normal perfume.",
        "Fill your perfume bottle up about halfway.",
        "Spray the water and soap out through the spritzer of the perfume bottle.",
        "Pump your perfume bottle into the sink or a washcloth until the water and soap is all gone.",
        "Make sure to spray out all of the water so that it doesn’t dilute the next perfume you put into the bottle.",
        "Fill your perfume bottle with warm water.",
        "Either take off the lid of your perfume bottle and fill it up directly or use the same spray bottle as your soap mixture with just plain water.",
        "Fill your perfume bottle up about halfway.",
        "If you use the same spray bottle that had your soap and water mixture, make sure to rinse it out thoroughly to get rid of any soap residue before you use it again.",
        "Pump the water through the perfume bottle to get rid of any soap.",
        "Spray your perfume bottle into a washcloth or the sink until all of the water is gone.",
        "Make sure to get out every last drop of water so that there is no soap left in your bottle.Tip: Test to see if all of the perfume is gone by spritzing the last few pumps of water onto your wrist.",
        "Smell your wrist to see if you can still smell any perfume.",
        "If you can, you may need to clean out your perfume bottle again."
    ]
}