{
    "title": "How to Apply Onion on Hair",
    "url": "https://www.wikihow.com/Apply-Onion-on-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Fixing Hair Problems"
    ],
    "methods": [
        {
            "name": "Juicing Onions with a Juicer",
            "steps": [
                {
                    "headline": "Set up the collection and pulp containers on your juicer.",
                    "description": "Place a collection cup under the spout of the juicer and, if your juicer has one, attach the pulp container onto the base. Use your juicer’s manual as a guide if you have a model with other accessories or if you’re not sure where to locate the parts. Some juicers come with a collection pitcher, but if not, any cup or bowl will do. If your juicer has a plunger to push fruits or vegetables into the chute, make sure it’s washed with water and dish soap beforehand."
                },
                {
                    "headline": "Slice the ends off of 1 or 2 onions and peel off the outer skin.",
                    "description": "A single onion will yield about ⁄4 cup (59 mL) of onion juice, which is enough for 2 applications. Use a sharp knife to cut the top and bottom, then peel off the paper-like skin. Discard these scraps in a compost bin if you have one. It’s best to use yellow onions because they have the most sulfur and vitamins, but you can use any kind you have on hand. Make sure not to peel off too much of the outer layer because that’s where most of the vitamins and sulfur compounds are stored."
                },
                {
                    "headline": "Cut the onion into quarters or eighths depending on the size of your juicer.",
                    "description": "If your juicer’s chute allows you to drop large chunks into it, simply chop the onions in half then cut each half again to make 4 pieces. If large chunks won’t fit into your juicer’s spout, slice each chunk in half again. Check your juicer’s user manual to see the recommended size of fruits and vegetables."
                },
                {
                    "headline": "Feed one chunk at a time into the juicing chute.",
                    "description": "Use the appliance's plunger to gently push the onion chunk down into the chute. To avoid jamming up your juicer, don’t add another chunk until you see juice come out through the spout and pulp coming out of the pulp chute. Do not use your fingers to push the onion down into the machine. If you don’t have a plunger, use the handle of a dull knife or stirring spoon and don’t insert it more than 2 inches (5.1 cm) into the chute. Repeat this process until you’ve juiced all of the onion chunks."
                },
                {
                    "headline": "Pour the juice into a spray bottle or refrigerate it in an airtight jar for later.",
                    "description": "If you’re doing a scalp treatment right away, pour the juice into a clean spray bottle for the easiest application. Otherwise, pour it into an airtight container and store it in the refrigerator for up to 2 weeks. You can also pour it into any bottle with an applicator tip (like a clean ketchup bottle). While the refrigerated onion juice will stay fresh for 2 weeks, it’s best to use it within 3 to 4 days before the sulfuric acid content will dissipate over time and make the treatment less effective."
                }
            ]
        },
        {
            "name": "Making Onion Juice with a Blender",
            "steps": [
                {
                    "headline": "Cut off the ends, remove the skin, and chop 1 onion into quarters.",
                    "description": "Use a sharp knife to cut off each end of the onion, then peel off the paper-like outer skin. Slice it down the middle to cut it in half and then cut each half to make 4 chunks. A single onion will produce about ⁄4 cup (59 mL) of juice, which is enough for 2 applications. Throw away the skins or toss them in your compost bin if you have one."
                },
                {
                    "headline": "Blend the sliced onions in a high-speed blender for 30 to 60 seconds.",
                    "description": "Place the cut onions into a blender and put the lid on. Set the speed to high and wait 30 to 60 seconds until there are no more onion chunks left. If you're using a bullet blender, it may only take 15 to 20 seconds. If you don't have a blender, slice the onions into pieces that are 1 inch (2.5 cm) in diameter. Then put 1 or 2 chunks into a garlic press and squeeze the juice into a glass."
                },
                {
                    "headline": "Place a layer of cheesecloth over the top of a cup or jar.",
                    "description": "Cut a square of cheesecloth to be 6 inches (15 cm) by 6 inches (15 cm) and lay it over the top of a collection cup or jar. You can also use a coffee filter or pantyhose if you don't have cheesecloth. As an alternative set a fine-mesh strainer over the top of a jar or bowl."
                },
                {
                    "headline": "Pour ⁄2 cup (120 mL) of mashed onions on top of the cloth.",
                    "description": "Use your thumb and index finger on your left hand to hold the cheesecloth over the mouth of the jar. Pour ⁄2 cup (120 mL) of the onion mash onto the cheesecloth. Save any leftovers by pouring the mixture into an ice cube tray and sliding the tray into a large freezer bag. The onion cubes will keep for 3 to 6 months and you can use them to make another hair mask or in many recipes that call for onion flavor (like soups and stews)."
                },
                {
                    "headline": "Gather the sides of the cloth and squeeze out the juice.",
                    "description": "Bring all of the sides of the cloth together around the onion mash and use your hands to squeeze out as much of the juice as you can. Be sure to hold the cloth over the collection cup or jar so you don't lose any juice. If you're using a fine-mesh strainer, pour the onion mash into the strainer and mash out the juice with a spoon. Store the extra juice in an airtight container in the refrigerator for up to 7 days."
                },
                {
                    "headline": "Add 3 drops of lemon and lemongrass essential oils if desired.",
                    "description": "Essential oils will help mask the sulfuric smell of the onion treatment. For the most benefits without the onion smell, add 3 drops of each oil and stir the mixture with a spoon. Lemon has antifungal properties, which is perfect if you have dandruff or a scalp infection like ringworm. Lemongrass has antibacterial properties, which will strengthen your hair follicles and promote long, healthy hair."
                }
            ]
        },
        {
            "name": "Applying Onion Juice to Your Scalp",
            "steps": [
                {
                    "headline": "Make sure your hair is clean and dry.",
                    "description": "A clean, dry scalp is going to soak up the vitamins and minerals from the onion juice better than an oily or wet scalp. It's okay if you have some product on the ends of your hair because you’ll only be applying the juice to your scalp. If your hair is dirty, wash it with shampoo and conditioner then let it air dry. You can blow dry it, but it’s not recommended because the air and heat could further irritate a dry, itchy, or infected scalp."
                },
                {
                    "headline": "Do a quick patch test by putting some of the juice on your inner elbow.",
                    "description": "Dip a cotton ball into the onion juice and rub it on your inner elbow on or near the crease. Wait for 2 to 3 minutes to see if any redness, burning, or irritation develops. If not, it’s safe to use on your scalp. If you notice a burning or itching sensation or if your inner-elbow skin turns red, don’t use the onion juice."
                },
                {
                    "headline": "Pour the onion juice into a clean spray bottle if you had it stored.",
                    "description": "Carefully pour the onion juice from its storage container into a spray bottle using a steady hand or a funnel. If you're reusing a spray bottle that contained cleaning solution, make sure to wash it out with dish soap and water. You'll need about ⁄8 cup (30 mL) of juice for 1 application. If you don’t have a spray bottle, pour it into any bottle (preferably one that has an applicator tip)."
                },
                {
                    "headline": "Part your hair down the middle and massage the juice onto your scalp.",
                    "description": "Use a comb to part your hair down the middle then spray your scalp 5 or 6 times or until it’s damp. No need to brush your hair, just use your fingers to massage the onion oil onto your scalp. If your scalp is extremely dry, apply the onion juice first and then massage in 2 teaspoons (9.9 mL) of coconut or olive oil. If you’re not using a spray bottle, pour a quarter-sized amount of the liquid into your palm, drip it onto your scalp, and massage it in."
                },
                {
                    "headline": "Pin your hair up to expose the back of your scalp and apply the juice.",
                    "description": "Use large clips, hair ties, or pins to lift and secure your hair so you can apply it to the back of your scalp. Massage the oil onto your scalp with your fingers, focusing on any problem areas where you have bald spots or itchiness. You can also flip your hair over and spray it in sections: the middle-back, right-back, and left-back."
                },
                {
                    "headline": "Spray the onion juice on any problem areas on the sides of your scalp.",
                    "description": "Flip your hair over to the right to spray the juice onto itchy or balding areas, then do the same for the left side. Make sure to massage it into the areas just above and around your ears because these can be prone to dryness and flaking (especially if you have psoriasis, eczema, or alopecia). If you have very thick hair, it may help to pin parts of it back to expose the side scalp areas."
                },
                {
                    "headline": "Put on a shower cap and wait 1 hour.",
                    "description": "Putting a shower cap over your head will help retain heat, opening the follicles on your scalp so the onion juice can soak in. If you don’t have a shower cap, wrap your hair in a clean, dry towel just like you would do getting out of the shower. Put the towel in the dryer for 1 minute on high heat to warm it up—the extra heat will help the juice work its magic! A cap will also prevent any of the juice from dripping and getting in your eyes and causing redness and burning. If you experience a burning sensation, rinse your hair immediately and wash it with shampoo and conditioner."
                },
                {
                    "headline": "Wash your hair with shampoo and conditioner.",
                    "description": "After the 1-hour mark, rinse your hair with warm water in the shower then wash it with shampoo and conditioner. If you have alopecia, use a shampoo or conditioner that contains jojoba oil or grapeseed oil for a more effective treatment. Don’t use onion juice as an overnight treatment—leaving it on longer than 1 hour won’t have any additional benefits and may irritate your scalp if you have sensitive skin. Apply the juice once or twice a week for the best results. Note that it can take 3 or 4 months to notice any visible results."
                }
            ]
        }
    ],
    "tyn": [
        "Juicing Onions with a Juicer",
        "1 or 2 onions",
        "Juicer",
        "Collection cup",
        "Spray bottle (for immediate use)",
        "Airtight jar or container (optional, for storage)",
        "Making Onion Juice with a Blender",
        "High-speed blender",
        "Cheesecloth (or pantyhose, or fine-mesh strainer and a spoon)",
        "Cup or jar",
        "Ice cube tray (optional, for freezing onion mash)",
        "Applying Onion Juice to Your Scalp",
        "Cotton ball (for patch test)",
        "Spray bottle",
        "Shower cap",
        "Hair clips and ties (optional)"
    ],
    "text": " Juicing Onions with a Juicer Set up the collection and pulp containers on your juicer. Place a collection cup under the spout of the juicer and, if your juicer has one, attach the pulp container onto the base. Use your juicer’s manual as a guide if you have a model with other accessories or if you’re not sure where to locate the parts. Some juicers come with a collection pitcher, but if not, any cup or bowl will do. If your juicer has a plunger to push fruits or vegetables into the chute, make sure it’s washed with water and dish soap beforehand. Slice the ends off of 1 or 2 onions and peel off the outer skin. A single onion will yield about ⁄4 cup (59 mL) of onion juice, which is enough for 2 applications. Use a sharp knife to cut the top and bottom, then peel off the paper-like skin. Discard these scraps in a compost bin if you have one. It’s best to use yellow onions because they have the most sulfur and vitamins, but you can use any kind you have on hand. Make sure not to peel off too much of the outer layer because that’s where most of the vitamins and sulfur compounds are stored. Cut the onion into quarters or eighths depending on the size of your juicer. If your juicer’s chute allows you to drop large chunks into it, simply chop the onions in half then cut each half again to make 4 pieces. If large chunks won’t fit into your juicer’s spout, slice each chunk in half again. Check your juicer’s user manual to see the recommended size of fruits and vegetables. Feed one chunk at a time into the juicing chute. Use the appliance's plunger to gently push the onion chunk down into the chute. To avoid jamming up your juicer, don’t add another chunk until you see juice come out through the spout and pulp coming out of the pulp chute. Do not use your fingers to push the onion down into the machine. If you don’t have a plunger, use the handle of a dull knife or stirring spoon and don’t insert it more than 2 inches (5.1 cm) into the chute. Repeat this process until you’ve juiced all of the onion chunks. Pour the juice into a spray bottle or refrigerate it in an airtight jar for later. If you’re doing a scalp treatment right away, pour the juice into a clean spray bottle for the easiest application. Otherwise, pour it into an airtight container and store it in the refrigerator for up to 2 weeks. You can also pour it into any bottle with an applicator tip (like a clean ketchup bottle). While the refrigerated onion juice will stay fresh for 2 weeks, it’s best to use it within 3 to 4 days before the sulfuric acid content will dissipate over time and make the treatment less effective. Making Onion Juice with a Blender Cut off the ends, remove the skin, and chop 1 onion into quarters. Use a sharp knife to cut off each end of the onion, then peel off the paper-like outer skin. Slice it down the middle to cut it in half and then cut each half to make 4 chunks. A single onion will produce about ⁄4 cup (59 mL) of juice, which is enough for 2 applications. Throw away the skins or toss them in your compost bin if you have one. Blend the sliced onions in a high-speed blender for 30 to 60 seconds. Place the cut onions into a blender and put the lid on. Set the speed to high and wait 30 to 60 seconds until there are no more onion chunks left. If you're using a bullet blender, it may only take 15 to 20 seconds. If you don't have a blender, slice the onions into pieces that are 1 inch (2.5 cm) in diameter. Then put 1 or 2 chunks into a garlic press and squeeze the juice into a glass. Place a layer of cheesecloth over the top of a cup or jar. Cut a square of cheesecloth to be 6 inches (15 cm) by 6 inches (15 cm) and lay it over the top of a collection cup or jar. You can also use a coffee filter or pantyhose if you don't have cheesecloth. As an alternative set a fine-mesh strainer over the top of a jar or bowl. Pour ⁄2 cup (120 mL) of mashed onions on top of the cloth. Use your thumb and index finger on your left hand to hold the cheesecloth over the mouth of the jar. Pour ⁄2 cup (120 mL) of the onion mash onto the cheesecloth. Save any leftovers by pouring the mixture into an ice cube tray and sliding the tray into a large freezer bag. The onion cubes will keep for 3 to 6 months and you can use them to make another hair mask or in many recipes that call for onion flavor (like soups and stews). Gather the sides of the cloth and squeeze out the juice. Bring all of the sides of the cloth together around the onion mash and use your hands to squeeze out as much of the juice as you can. Be sure to hold the cloth over the collection cup or jar so you don't lose any juice. If you're using a fine-mesh strainer, pour the onion mash into the strainer and mash out the juice with a spoon. Store the extra juice in an airtight container in the refrigerator for up to 7 days. Add 3 drops of lemon and lemongrass essential oils if desired. Essential oils will help mask the sulfuric smell of the onion treatment. For the most benefits without the onion smell, add 3 drops of each oil and stir the mixture with a spoon. Lemon has antifungal properties, which is perfect if you have dandruff or a scalp infection like ringworm. Lemongrass has antibacterial properties, which will strengthen your hair follicles and promote long, healthy hair. Applying Onion Juice to Your Scalp Make sure your hair is clean and dry. A clean, dry scalp is going to soak up the vitamins and minerals from the onion juice better than an oily or wet scalp. It's okay if you have some product on the ends of your hair because you’ll only be applying the juice to your scalp. If your hair is dirty, wash it with shampoo and conditioner then let it air dry. You can blow dry it, but it’s not recommended because the air and heat could further irritate a dry, itchy, or infected scalp. Do a quick patch test by putting some of the juice on your inner elbow. Dip a cotton ball into the onion juice and rub it on your inner elbow on or near the crease. Wait for 2 to 3 minutes to see if any redness, burning, or irritation develops. If not, it’s safe to use on your scalp. If you notice a burning or itching sensation or if your inner-elbow skin turns red, don’t use the onion juice. Pour the onion juice into a clean spray bottle if you had it stored. Carefully pour the onion juice from its storage container into a spray bottle using a steady hand or a funnel. If you're reusing a spray bottle that contained cleaning solution, make sure to wash it out with dish soap and water. You'll need about ⁄8 cup (30 mL) of juice for 1 application. If you don’t have a spray bottle, pour it into any bottle (preferably one that has an applicator tip). Part your hair down the middle and massage the juice onto your scalp. Use a comb to part your hair down the middle then spray your scalp 5 or 6 times or until it’s damp. No need to brush your hair, just use your fingers to massage the onion oil onto your scalp. If your scalp is extremely dry, apply the onion juice first and then massage in 2 teaspoons (9.9 mL) of coconut or olive oil. If you’re not using a spray bottle, pour a quarter-sized amount of the liquid into your palm, drip it onto your scalp, and massage it in. Pin your hair up to expose the back of your scalp and apply the juice. Use large clips, hair ties, or pins to lift and secure your hair so you can apply it to the back of your scalp. Massage the oil onto your scalp with your fingers, focusing on any problem areas where you have bald spots or itchiness. You can also flip your hair over and spray it in sections: the middle-back, right-back, and left-back. Spray the onion juice on any problem areas on the sides of your scalp. Flip your hair over to the right to spray the juice onto itchy or balding areas, then do the same for the left side. Make sure to massage it into the areas just above and around your ears because these can be prone to dryness and flaking (especially if you have psoriasis, eczema, or alopecia). If you have very thick hair, it may help to pin parts of it back to expose the side scalp areas. Put on a shower cap and wait 1 hour. Putting a shower cap over your head will help retain heat, opening the follicles on your scalp so the onion juice can soak in. If you don’t have a shower cap, wrap your hair in a clean, dry towel just like you would do getting out of the shower. Put the towel in the dryer for 1 minute on high heat to warm it up—the extra heat will help the juice work its magic! A cap will also prevent any of the juice from dripping and getting in your eyes and causing redness and burning. If you experience a burning sensation, rinse your hair immediately and wash it with shampoo and conditioner. Wash your hair with shampoo and conditioner. After the 1-hour mark, rinse your hair with warm water in the shower then wash it with shampoo and conditioner. If you have alopecia, use a shampoo or conditioner that contains jojoba oil or grapeseed oil for a more effective treatment. Don’t use onion juice as an overnight treatment—leaving it on longer than 1 hour won’t have any additional benefits and may irritate your scalp if you have sensitive skin. Apply the juice once or twice a week for the best results. Note that it can take 3 or 4 months to notice any visible results.",
    "sentences": [
        " Juicing Onions with a Juicer Set up the collection and pulp containers on your juicer.",
        "Place a collection cup under the spout of the juicer and, if your juicer has one, attach the pulp container onto the base.",
        "Use your juicer’s manual as a guide if you have a model with other accessories or if you’re not sure where to locate the parts.",
        "Some juicers come with a collection pitcher, but if not, any cup or bowl will do.",
        "If your juicer has a plunger to push fruits or vegetables into the chute, make sure it’s washed with water and dish soap beforehand.",
        "Slice the ends off of 1 or 2 onions and peel off the outer skin.",
        "A single onion will yield about ⁄4 cup (59 mL) of onion juice, which is enough for 2 applications.",
        "Use a sharp knife to cut the top and bottom, then peel off the paper-like skin.",
        "Discard these scraps in a compost bin if you have one.",
        "It’s best to use yellow onions because they have the most sulfur and vitamins, but you can use any kind you have on hand.",
        "Make sure not to peel off too much of the outer layer because that’s where most of the vitamins and sulfur compounds are stored.",
        "Cut the onion into quarters or eighths depending on the size of your juicer.",
        "If your juicer’s chute allows you to drop large chunks into it, simply chop the onions in half then cut each half again to make 4 pieces.",
        "If large chunks won’t fit into your juicer’s spout, slice each chunk in half again.",
        "Check your juicer’s user manual to see the recommended size of fruits and vegetables.",
        "Feed one chunk at a time into the juicing chute.",
        "Use the appliance's plunger to gently push the onion chunk down into the chute.",
        "To avoid jamming up your juicer, don’t add another chunk until you see juice come out through the spout and pulp coming out of the pulp chute.",
        "Do not use your fingers to push the onion down into the machine.",
        "If you don’t have a plunger, use the handle of a dull knife or stirring spoon and don’t insert it more than 2 inches (5.1 cm) into the chute.",
        "Repeat this process until you’ve juiced all of the onion chunks.",
        "Pour the juice into a spray bottle or refrigerate it in an airtight jar for later.",
        "If you’re doing a scalp treatment right away, pour the juice into a clean spray bottle for the easiest application.",
        "Otherwise, pour it into an airtight container and store it in the refrigerator for up to 2 weeks.",
        "You can also pour it into any bottle with an applicator tip (like a clean ketchup bottle).",
        "While the refrigerated onion juice will stay fresh for 2 weeks, it’s best to use it within 3 to 4 days before the sulfuric acid content will dissipate over time and make the treatment less effective.",
        "Making Onion Juice with a Blender Cut off the ends, remove the skin, and chop 1 onion into quarters.",
        "Use a sharp knife to cut off each end of the onion, then peel off the paper-like outer skin.",
        "Slice it down the middle to cut it in half and then cut each half to make 4 chunks.",
        "A single onion will produce about ⁄4 cup (59 mL) of juice, which is enough for 2 applications.",
        "Throw away the skins or toss them in your compost bin if you have one.",
        "Blend the sliced onions in a high-speed blender for 30 to 60 seconds.",
        "Place the cut onions into a blender and put the lid on.",
        "Set the speed to high and wait 30 to 60 seconds until there are no more onion chunks left.",
        "If you're using a bullet blender, it may only take 15 to 20 seconds.",
        "If you don't have a blender, slice the onions into pieces that are 1 inch (2.5 cm) in diameter.",
        "Then put 1 or 2 chunks into a garlic press and squeeze the juice into a glass.",
        "Place a layer of cheesecloth over the top of a cup or jar.",
        "Cut a square of cheesecloth to be 6 inches (15 cm) by 6 inches (15 cm) and lay it over the top of a collection cup or jar.",
        "You can also use a coffee filter or pantyhose if you don't have cheesecloth.",
        "As an alternative set a fine-mesh strainer over the top of a jar or bowl.",
        "Pour ⁄2 cup (120 mL) of mashed onions on top of the cloth.",
        "Use your thumb and index finger on your left hand to hold the cheesecloth over the mouth of the jar.",
        "Pour ⁄2 cup (120 mL) of the onion mash onto the cheesecloth.",
        "Save any leftovers by pouring the mixture into an ice cube tray and sliding the tray into a large freezer bag.",
        "The onion cubes will keep for 3 to 6 months and you can use them to make another hair mask or in many recipes that call for onion flavor (like soups and stews).",
        "Gather the sides of the cloth and squeeze out the juice.",
        "Bring all of the sides of the cloth together around the onion mash and use your hands to squeeze out as much of the juice as you can.",
        "Be sure to hold the cloth over the collection cup or jar so you don't lose any juice.",
        "If you're using a fine-mesh strainer, pour the onion mash into the strainer and mash out the juice with a spoon.",
        "Store the extra juice in an airtight container in the refrigerator for up to 7 days.",
        "Add 3 drops of lemon and lemongrass essential oils if desired.",
        "Essential oils will help mask the sulfuric smell of the onion treatment.",
        "For the most benefits without the onion smell, add 3 drops of each oil and stir the mixture with a spoon.",
        "Lemon has antifungal properties, which is perfect if you have dandruff or a scalp infection like ringworm.",
        "Lemongrass has antibacterial properties, which will strengthen your hair follicles and promote long, healthy hair.",
        "Applying Onion Juice to Your Scalp Make sure your hair is clean and dry.",
        "A clean, dry scalp is going to soak up the vitamins and minerals from the onion juice better than an oily or wet scalp.",
        "It's okay if you have some product on the ends of your hair because you’ll only be applying the juice to your scalp.",
        "If your hair is dirty, wash it with shampoo and conditioner then let it air dry.",
        "You can blow dry it, but it’s not recommended because the air and heat could further irritate a dry, itchy, or infected scalp.",
        "Do a quick patch test by putting some of the juice on your inner elbow.",
        "Dip a cotton ball into the onion juice and rub it on your inner elbow on or near the crease.",
        "Wait for 2 to 3 minutes to see if any redness, burning, or irritation develops.",
        "If not, it’s safe to use on your scalp.",
        "If you notice a burning or itching sensation or if your inner-elbow skin turns red, don’t use the onion juice.",
        "Pour the onion juice into a clean spray bottle if you had it stored.",
        "Carefully pour the onion juice from its storage container into a spray bottle using a steady hand or a funnel.",
        "If you're reusing a spray bottle that contained cleaning solution, make sure to wash it out with dish soap and water.",
        "You'll need about ⁄8 cup (30 mL) of juice for 1 application.",
        "If you don’t have a spray bottle, pour it into any bottle (preferably one that has an applicator tip).",
        "Part your hair down the middle and massage the juice onto your scalp.",
        "Use a comb to part your hair down the middle then spray your scalp 5 or 6 times or until it’s damp.",
        "No need to brush your hair, just use your fingers to massage the onion oil onto your scalp.",
        "If your scalp is extremely dry, apply the onion juice first and then massage in 2 teaspoons (9.9 mL) of coconut or olive oil.",
        "If you’re not using a spray bottle, pour a quarter-sized amount of the liquid into your palm, drip it onto your scalp, and massage it in.",
        "Pin your hair up to expose the back of your scalp and apply the juice.",
        "Use large clips, hair ties, or pins to lift and secure your hair so you can apply it to the back of your scalp.",
        "Massage the oil onto your scalp with your fingers, focusing on any problem areas where you have bald spots or itchiness.",
        "You can also flip your hair over and spray it in sections: the middle-back, right-back, and left-back.",
        "Spray the onion juice on any problem areas on the sides of your scalp.",
        "Flip your hair over to the right to spray the juice onto itchy or balding areas, then do the same for the left side.",
        "Make sure to massage it into the areas just above and around your ears because these can be prone to dryness and flaking (especially if you have psoriasis, eczema, or alopecia).",
        "If you have very thick hair, it may help to pin parts of it back to expose the side scalp areas.",
        "Put on a shower cap and wait 1 hour.",
        "Putting a shower cap over your head will help retain heat, opening the follicles on your scalp so the onion juice can soak in.",
        "If you don’t have a shower cap, wrap your hair in a clean, dry towel just like you would do getting out of the shower.",
        "Put the towel in the dryer for 1 minute on high heat to warm it up—the extra heat will help the juice work its magic!",
        "A cap will also prevent any of the juice from dripping and getting in your eyes and causing redness and burning.",
        "If you experience a burning sensation, rinse your hair immediately and wash it with shampoo and conditioner.",
        "Wash your hair with shampoo and conditioner.",
        "After the 1-hour mark, rinse your hair with warm water in the shower then wash it with shampoo and conditioner.",
        "If you have alopecia, use a shampoo or conditioner that contains jojoba oil or grapeseed oil for a more effective treatment.",
        "Don’t use onion juice as an overnight treatment—leaving it on longer than 1 hour won’t have any additional benefits and may irritate your scalp if you have sensitive skin.",
        "Apply the juice once or twice a week for the best results.",
        "Note that it can take 3 or 4 months to notice any visible results."
    ]
}