{
    "title": "How to Freeze Macaroni and Cheese",
    "url": "https://www.wikihow.com/Freeze-Macaroni-and-Cheese",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Pasta and Noodles",
        "Macaroni and Cheese"
    ],
    "methods": [
        {
            "name": "Storing Cooked Macaroni and Cheese",
            "steps": [
                {
                    "headline": "Pour ice water into a large, flat pan.",
                    "description": "Find a metal pan that’s larger and wider than the serving dish for your macaroni and cheese. To make a cooling bath, fill the pan with cold water and a few ice cubes. Only fill the pan about halfway, so the water doesn’t overflow later on. If it’s large enough, you can plug your sink drain and fill it with ice water. Make sure that you’ve cleaned it out beforehand! Ice baths are a better option than letting your dish cool naturally. If you leave your food at room temperature for multiple hours, you’re more at risk for foodborne illnesses."
                },
                {
                    "headline": "Place your macaroni and cheese dish in the bath for 5 minutes.",
                    "description": "If your cooking pan is still hot the touch, use hot pads or oven mitts to move the pasta dish into the ice water. Before letting go of the dish, check that it’s securely resting in the pan. Leave the macaroni and cheese in the bath for 5 minutes, or until the surface of the food is cool to the touch.Tip: If you prepared your macaroni and cheese in a skillet or other pan, consider transferring the pasta to a foil-lined casserole dish. Arrange a large sheet of aluminum foil over the bottom and edges of a new casserole dish. Before storing the baked macaroni, scoop the pasta into the foil-lined dish. This type of container may make it easier to reheat and serve the pasta later on!"
                },
                {
                    "headline": "Insulate the dish with plastic wrap and freezer-safe tape.",
                    "description": "Stretch and tear away a large piece of plastic wrap that fits over the surface of your dish. Next, pull along the edges of the wrap to secure it tightly around the container. To keep the plastic in place, apply small strips of freezer-safe tape along the ends of the wrap. This process helps to create a tight seal."
                },
                {
                    "headline": "Cover a full dish of macaroni and cheese with foil.",
                    "description": "Tear off another sheet of aluminum foil that’s larger than the surface of the casserole dish. Next, tuck the foil around the pan to create a tight seal. Double-check all the edges of the pan to make sure that no air will get in. Feel free to use 2 sheets of foil, if necessary. If you’d like to save individual portions of your macaroni and cheese, store them in small, circular baking dishes. You can also use freezer-safe plastic containers to preserve your food for long-term storage."
                },
                {
                    "headline": "Freeze the macaroni for up to 3 months.",
                    "description": "Use a label or piece of masking tape to mark the current date on your dish. Once the food is labeled, place it in your freezer for no more than 3 months. If you leave your pasta in the freezer for too long, it will taste freezer-burned."
                },
                {
                    "headline": "Defrost the pasta in the oven at 400 °F (204 °C) for 1 hour.",
                    "description": "Remove the foil and arrange your macaroni and cheese in the oven. Set a timer for 1 hour, and wait for the pasta to warm up. Check on the dish periodically, using a food thermometer to monitor the internal temperature. When the macaroni is consistently 165 °F (74 °C) throughout, remove it from the oven and serve it. When reheating 1 quart (137 g) of macaroni and cheese, leave the pasta in the oven for 1 hour and 45 minutes."
                },
                {
                    "headline": "Heat the pasta in the microwave to defrost individual portions.",
                    "description": "Transfer a portion of macaroni and cheese to a microwave-safe bowl or plate, then loosely cover the dish with microwave-safe paper or wrap. Depending on your appliance, use the “defrost” button, or change the power settings to 30%. For every 1 pound (450 g) of pasta, heat the dish for at least 7 minutes. Check that the macaroni and cheese has an internal temperature of 165 °F (74 °C) or more. If your pasta is cooler than this, you could be at risk for foodborne illnesses. Always serve food immediately after defrosting it."
                }
            ]
        },
        {
            "name": "Preserving Uncooked Portions",
            "steps": [
                {
                    "headline": "Scoop the pasta into an individual baking dish if you’re feeding 1 person.",
                    "description": "After mixing your ingredients together, divide your cooked cheesy noodles among several small, rounded, oven-safe dishes. Fill each container slightly below the rim, so the pasta is easier to store later on. If your recipe calls for breadcrumbs, be sure to top off each individual dish. Small dishes can be helpful if you live by yourself, or if you’re trying to control your portions."
                },
                {
                    "headline": "Arrange the macaroni in a casserole dish if you’re freezing a large amount.",
                    "description": "If you’re cooking for more than 1 person, pour or scoop the pasta mixture into a large, oven-safe casserole dish. Try distributing the macaroni in an even layer, so the food can cook consistently."
                },
                {
                    "headline": "Wrap each individual dish carefully with plastic wrap.",
                    "description": "Take a large section of wrap and place it on top of the individual, circular dishes. Pull along the edges of the plastic wrap to make it tight, then press along the ends to secure it into place. Try to wrap each dish as tightly as possible so no air gets into the food. Make sure that each sheet of plastic wrap is larger than the surface of the dish."
                },
                {
                    "headline": "Cover a larger casserole dish with aluminum foil.",
                    "description": "Measure and tear off a piece of foil that fits over the dish’s surface. Next, tuck the edges of the foil around the dish to form a tight seal, so no air gets into the pasta. Double-check the edges of the foil to ensure that they’re folded tightly."
                },
                {
                    "headline": "Store the pasta in the freezer for up to 3 months.",
                    "description": "Use a food label or piece of masking tape to jot down the current date. Before  freezing your food, stick these labels on your macaroni and cheese dishes. Next, arrange the individual dishes or larger casserole tray in a flat, open area of your freezer. Try to keep your food in a visible area, so you don’t forget about it."
                },
                {
                    "headline": "Preheat the oven to 375 °F (191 °C) to cook the pasta.",
                    "description": "Remove your macaroni dishes from the freezer and set them on a flat surface. To ensure an even bake, wait for the oven to heat up completely before cooking your food.Tip: You can defrost your macaroni and cheese in the microwave before cooking it! After placing the pasta in a microwave-safe dish, cover the food with microwave-safe wrap or paper. Next, use the “defrost” setting on your appliance, or manually set the power to 30%. For every 1 pound (450 g) of macaroni, heat the dish for at least 7 minutes. Once the food is defrosted, cook it in the oven right away."
                },
                {
                    "headline": "Bake the foil-covered macaroni and cheese for 25-50 minutes.",
                    "description": "Remove the plastic wrap from the individually-wrapped dishes and cover them with foil. Once your oven is heated, arrange the dish or dishes in the appliance. If you’re baking individual portions of macaroni and cheese, place the dishes on a large cookie sheet and bake them for 40-50 minutes. If you’re cooking a larger tray of pasta, start baking the dish for 25 minutes. The foil only stays on for part of the baking process. The baking sheet makes it easier to remove the individual macaroni dishes later on."
                },
                {
                    "headline": "Remove the foil and bake the dish for another 5-25 minutes.",
                    "description": "If you’re cooking individual portions of macaroni and cheese, bake the dishes for an additional 5 to 10 minutes. If you’re baking a large tray of pasta, continue cooking the dish for another 25 minutes. Once the macaroni and cheese looks golden brown, remove it from the oven and let it cool for several minutes before serving."
                }
            ]
        }
    ],
    "tyn": [
        "Storing Cooked Macaroni and Cheese",
        "Cold water",
        "Large pan",
        "Casserole dish",
        "Aluminum foil",
        "Freezer-safe tape",
        "Plastic wrap",
        "Microwave-safe paper paper or wrap(optional)",
        "Preserving Uncooked Portions",
        "Individual circular dishes",
        "Cookie sheet",
        "Microwave-safe paper or wrap (optional)"
    ],
    "text": " Storing Cooked Macaroni and Cheese Pour ice water into a large, flat pan. Find a metal pan that’s larger and wider than the serving dish for your macaroni and cheese. To make a cooling bath, fill the pan with cold water and a few ice cubes. Only fill the pan about halfway, so the water doesn’t overflow later on. If it’s large enough, you can plug your sink drain and fill it with ice water. Make sure that you’ve cleaned it out beforehand! Ice baths are a better option than letting your dish cool naturally. If you leave your food at room temperature for multiple hours, you’re more at risk for foodborne illnesses. Place your macaroni and cheese dish in the bath for 5 minutes. If your cooking pan is still hot the touch, use hot pads or oven mitts to move the pasta dish into the ice water. Before letting go of the dish, check that it’s securely resting in the pan. Leave the macaroni and cheese in the bath for 5 minutes, or until the surface of the food is cool to the touch.Tip: If you prepared your macaroni and cheese in a skillet or other pan, consider transferring the pasta to a foil-lined casserole dish. Arrange a large sheet of aluminum foil over the bottom and edges of a new casserole dish. Before storing the baked macaroni, scoop the pasta into the foil-lined dish. This type of container may make it easier to reheat and serve the pasta later on! Insulate the dish with plastic wrap and freezer-safe tape. Stretch and tear away a large piece of plastic wrap that fits over the surface of your dish. Next, pull along the edges of the wrap to secure it tightly around the container. To keep the plastic in place, apply small strips of freezer-safe tape along the ends of the wrap. This process helps to create a tight seal. Cover a full dish of macaroni and cheese with foil. Tear off another sheet of aluminum foil that’s larger than the surface of the casserole dish. Next, tuck the foil around the pan to create a tight seal. Double-check all the edges of the pan to make sure that no air will get in. Feel free to use 2 sheets of foil, if necessary. If you’d like to save individual portions of your macaroni and cheese, store them in small, circular baking dishes. You can also use freezer-safe plastic containers to preserve your food for long-term storage. Freeze the macaroni for up to 3 months. Use a label or piece of masking tape to mark the current date on your dish. Once the food is labeled, place it in your freezer for no more than 3 months. If you leave your pasta in the freezer for too long, it will taste freezer-burned. Defrost the pasta in the oven at 400 °F (204 °C) for 1 hour. Remove the foil and arrange your macaroni and cheese in the oven. Set a timer for 1 hour, and wait for the pasta to warm up. Check on the dish periodically, using a food thermometer to monitor the internal temperature. When the macaroni is consistently 165 °F (74 °C) throughout, remove it from the oven and serve it. When reheating 1 quart (137 g) of macaroni and cheese, leave the pasta in the oven for 1 hour and 45 minutes. Heat the pasta in the microwave to defrost individual portions. Transfer a portion of macaroni and cheese to a microwave-safe bowl or plate, then loosely cover the dish with microwave-safe paper or wrap. Depending on your appliance, use the “defrost” button, or change the power settings to 30%. For every 1 pound (450 g) of pasta, heat the dish for at least 7 minutes. Check that the macaroni and cheese has an internal temperature of 165 °F (74 °C) or more. If your pasta is cooler than this, you could be at risk for foodborne illnesses. Always serve food immediately after defrosting it. Preserving Uncooked Portions Scoop the pasta into an individual baking dish if you’re feeding 1 person. After mixing your ingredients together, divide your cooked cheesy noodles among several small, rounded, oven-safe dishes. Fill each container slightly below the rim, so the pasta is easier to store later on. If your recipe calls for breadcrumbs, be sure to top off each individual dish. Small dishes can be helpful if you live by yourself, or if you’re trying to control your portions. Arrange the macaroni in a casserole dish if you’re freezing a large amount. If you’re cooking for more than 1 person, pour or scoop the pasta mixture into a large, oven-safe casserole dish. Try distributing the macaroni in an even layer, so the food can cook consistently. Wrap each individual dish carefully with plastic wrap. Take a large section of wrap and place it on top of the individual, circular dishes. Pull along the edges of the plastic wrap to make it tight, then press along the ends to secure it into place. Try to wrap each dish as tightly as possible so no air gets into the food. Make sure that each sheet of plastic wrap is larger than the surface of the dish. Cover a larger casserole dish with aluminum foil. Measure and tear off a piece of foil that fits over the dish’s surface. Next, tuck the edges of the foil around the dish to form a tight seal, so no air gets into the pasta. Double-check the edges of the foil to ensure that they’re folded tightly. Store the pasta in the freezer for up to 3 months. Use a food label or piece of masking tape to jot down the current date. Before  freezing your food, stick these labels on your macaroni and cheese dishes. Next, arrange the individual dishes or larger casserole tray in a flat, open area of your freezer. Try to keep your food in a visible area, so you don’t forget about it. Preheat the oven to 375 °F (191 °C) to cook the pasta. Remove your macaroni dishes from the freezer and set them on a flat surface. To ensure an even bake, wait for the oven to heat up completely before cooking your food.Tip: You can defrost your macaroni and cheese in the microwave before cooking it! After placing the pasta in a microwave-safe dish, cover the food with microwave-safe wrap or paper. Next, use the “defrost” setting on your appliance, or manually set the power to 30%. For every 1 pound (450 g) of macaroni, heat the dish for at least 7 minutes. Once the food is defrosted, cook it in the oven right away. Bake the foil-covered macaroni and cheese for 25-50 minutes. Remove the plastic wrap from the individually-wrapped dishes and cover them with foil. Once your oven is heated, arrange the dish or dishes in the appliance. If you’re baking individual portions of macaroni and cheese, place the dishes on a large cookie sheet and bake them for 40-50 minutes. If you’re cooking a larger tray of pasta, start baking the dish for 25 minutes. The foil only stays on for part of the baking process. The baking sheet makes it easier to remove the individual macaroni dishes later on. Remove the foil and bake the dish for another 5-25 minutes. If you’re cooking individual portions of macaroni and cheese, bake the dishes for an additional 5 to 10 minutes. If you’re baking a large tray of pasta, continue cooking the dish for another 25 minutes. Once the macaroni and cheese looks golden brown, remove it from the oven and let it cool for several minutes before serving.",
    "sentences": [
        " Storing Cooked Macaroni and Cheese Pour ice water into a large, flat pan.",
        "Find a metal pan that’s larger and wider than the serving dish for your macaroni and cheese.",
        "To make a cooling bath, fill the pan with cold water and a few ice cubes.",
        "Only fill the pan about halfway, so the water doesn’t overflow later on.",
        "If it’s large enough, you can plug your sink drain and fill it with ice water.",
        "Make sure that you’ve cleaned it out beforehand!",
        "Ice baths are a better option than letting your dish cool naturally.",
        "If you leave your food at room temperature for multiple hours, you’re more at risk for foodborne illnesses.",
        "Place your macaroni and cheese dish in the bath for 5 minutes.",
        "If your cooking pan is still hot the touch, use hot pads or oven mitts to move the pasta dish into the ice water.",
        "Before letting go of the dish, check that it’s securely resting in the pan.",
        "Leave the macaroni and cheese in the bath for 5 minutes, or until the surface of the food is cool to the touch.Tip: If you prepared your macaroni and cheese in a skillet or other pan, consider transferring the pasta to a foil-lined casserole dish.",
        "Arrange a large sheet of aluminum foil over the bottom and edges of a new casserole dish.",
        "Before storing the baked macaroni, scoop the pasta into the foil-lined dish.",
        "This type of container may make it easier to reheat and serve the pasta later on!",
        "Insulate the dish with plastic wrap and freezer-safe tape.",
        "Stretch and tear away a large piece of plastic wrap that fits over the surface of your dish.",
        "Next, pull along the edges of the wrap to secure it tightly around the container.",
        "To keep the plastic in place, apply small strips of freezer-safe tape along the ends of the wrap.",
        "This process helps to create a tight seal.",
        "Cover a full dish of macaroni and cheese with foil.",
        "Tear off another sheet of aluminum foil that’s larger than the surface of the casserole dish.",
        "Next, tuck the foil around the pan to create a tight seal.",
        "Double-check all the edges of the pan to make sure that no air will get in.",
        "Feel free to use 2 sheets of foil, if necessary.",
        "If you’d like to save individual portions of your macaroni and cheese, store them in small, circular baking dishes.",
        "You can also use freezer-safe plastic containers to preserve your food for long-term storage.",
        "Freeze the macaroni for up to 3 months.",
        "Use a label or piece of masking tape to mark the current date on your dish.",
        "Once the food is labeled, place it in your freezer for no more than 3 months.",
        "If you leave your pasta in the freezer for too long, it will taste freezer-burned.",
        "Defrost the pasta in the oven at 400 °F (204 °C) for 1 hour.",
        "Remove the foil and arrange your macaroni and cheese in the oven.",
        "Set a timer for 1 hour, and wait for the pasta to warm up.",
        "Check on the dish periodically, using a food thermometer to monitor the internal temperature.",
        "When the macaroni is consistently 165 °F (74 °C) throughout, remove it from the oven and serve it.",
        "When reheating 1 quart (137 g) of macaroni and cheese, leave the pasta in the oven for 1 hour and 45 minutes.",
        "Heat the pasta in the microwave to defrost individual portions.",
        "Transfer a portion of macaroni and cheese to a microwave-safe bowl or plate, then loosely cover the dish with microwave-safe paper or wrap.",
        "Depending on your appliance, use the “defrost” button, or change the power settings to 30%.",
        "For every 1 pound (450 g) of pasta, heat the dish for at least 7 minutes.",
        "Check that the macaroni and cheese has an internal temperature of 165 °F (74 °C) or more.",
        "If your pasta is cooler than this, you could be at risk for foodborne illnesses.",
        "Always serve food immediately after defrosting it.",
        "Preserving Uncooked Portions Scoop the pasta into an individual baking dish if you’re feeding 1 person.",
        "After mixing your ingredients together, divide your cooked cheesy noodles among several small, rounded, oven-safe dishes.",
        "Fill each container slightly below the rim, so the pasta is easier to store later on.",
        "If your recipe calls for breadcrumbs, be sure to top off each individual dish.",
        "Small dishes can be helpful if you live by yourself, or if you’re trying to control your portions.",
        "Arrange the macaroni in a casserole dish if you’re freezing a large amount.",
        "If you’re cooking for more than 1 person, pour or scoop the pasta mixture into a large, oven-safe casserole dish.",
        "Try distributing the macaroni in an even layer, so the food can cook consistently.",
        "Wrap each individual dish carefully with plastic wrap.",
        "Take a large section of wrap and place it on top of the individual, circular dishes.",
        "Pull along the edges of the plastic wrap to make it tight, then press along the ends to secure it into place.",
        "Try to wrap each dish as tightly as possible so no air gets into the food.",
        "Make sure that each sheet of plastic wrap is larger than the surface of the dish.",
        "Cover a larger casserole dish with aluminum foil.",
        "Measure and tear off a piece of foil that fits over the dish’s surface.",
        "Next, tuck the edges of the foil around the dish to form a tight seal, so no air gets into the pasta.",
        "Double-check the edges of the foil to ensure that they’re folded tightly.",
        "Store the pasta in the freezer for up to 3 months.",
        "Use a food label or piece of masking tape to jot down the current date.",
        "Before  freezing your food, stick these labels on your macaroni and cheese dishes.",
        "Next, arrange the individual dishes or larger casserole tray in a flat, open area of your freezer.",
        "Try to keep your food in a visible area, so you don’t forget about it.",
        "Preheat the oven to 375 °F (191 °C) to cook the pasta.",
        "Remove your macaroni dishes from the freezer and set them on a flat surface.",
        "To ensure an even bake, wait for the oven to heat up completely before cooking your food.Tip: You can defrost your macaroni and cheese in the microwave before cooking it!",
        "After placing the pasta in a microwave-safe dish, cover the food with microwave-safe wrap or paper.",
        "Next, use the “defrost” setting on your appliance, or manually set the power to 30%.",
        "For every 1 pound (450 g) of macaroni, heat the dish for at least 7 minutes.",
        "Once the food is defrosted, cook it in the oven right away.",
        "Bake the foil-covered macaroni and cheese for 25-50 minutes.",
        "Remove the plastic wrap from the individually-wrapped dishes and cover them with foil.",
        "Once your oven is heated, arrange the dish or dishes in the appliance.",
        "If you’re baking individual portions of macaroni and cheese, place the dishes on a large cookie sheet and bake them for 40-50 minutes.",
        "If you’re cooking a larger tray of pasta, start baking the dish for 25 minutes.",
        "The foil only stays on for part of the baking process.",
        "The baking sheet makes it easier to remove the individual macaroni dishes later on.",
        "Remove the foil and bake the dish for another 5-25 minutes.",
        "If you’re cooking individual portions of macaroni and cheese, bake the dishes for an additional 5 to 10 minutes.",
        "If you’re baking a large tray of pasta, continue cooking the dish for another 25 minutes.",
        "Once the macaroni and cheese looks golden brown, remove it from the oven and let it cool for several minutes before serving."
    ]
}