{
    "title": "How to Take Professional Photos of Yourself",
    "url": "https://www.wikihow.com/Take-Professional-Photos-of-Yourself",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Photography"
    ],
    "parts": [
        {
            "name": "Choosing a Location",
            "steps": [
                {
                    "headline": "Shoot indoors for a standard headshot with a basic background.",
                    "description": "If you’re shooting professional photos for personal use, like for social media, choose any backdrop that you think will be interesting. If you’re shooting a professional headshot, choose a blank wall, shoot with bookshelves behind you, or hang a simple bedsheet behind you.Tip: Avoid shooting business headshots with personal items or furniture in the background. You don’t want it to look like you took this at home, even if that’s exactly what you’re doing! To hang a sheet for a portrait, use tape or a curtain rod to hang the sheet vertically behind you. If you want to add a little more attitude or personality to your image, feel free to shoot your business headshot against a textured or wallpapered wall."
                },
                {
                    "headline": "Set your shot up next to a bright window and add lights as needed.",
                    "description": "Shoot during the day and set up your shot in a bright, sunny room. Use lamps, your camera flash, and ceiling lights to complement the light from your window. You can rent or buy a softbox for perfect portrait lighting if you’d like. Set additional light sources to the right or left of the camera to create dynamic shadows and highlights. If you use additional lighting sources, use light sources that produce white light, as opposed to yellow or blue light. A softbox is a professional piece of equipment that produces high-quality white light."
                },
                {
                    "headline": "Take photos outdoors for a more dynamic, natural shot.",
                    "description": "Look for a nice backdrop outdoors where the background will match the tone that you’re aiming for in your image. Stairs, porches, and backyards can provide interesting locations for a self-portrait. If you’re shooting a headshot, a simple brick wall or city skyline can provide a standard backdrop that won’t stand out too much or dominate the image."
                },
                {
                    "headline": "Shoot outdoor photos during the day with the sun behind the camera.",
                    "description": "Shoot during the day when the sun is out to get bright, natural lighting. Choose an angle where you aren’t directly in front of the sun. Otherwise, your face won't be illuminated. Avoid shooting around noon when the sun is high in the sky to avoid washing your image out in light. For a more dynamic look, shoot 15-45 minutes after sunrise or before sunset. These periods are known as the golden hours, and they’re the periods in the day when the light is softer and more radiant. Avoid shooting in overcast conditions. It is difficult to achieve strong highlights and shadows if there isn’t much direct light outside."
                },
                {
                    "headline": "Choose an outfit that matches the goal of your photo.",
                    "description": "If you're taking self-portraits for personal use, you can wear whatever you want for your photo! Dress professionally for a business headshot. If you’re wearing a suit, make sure that it has been dry cleaned and ironed. If you’re going for a more traditional look, put a tie on. For a more contemporary, trendy look, skip the tie. If you’re wearing a dress, make sure that it is business appropriate. Wash, comb, and gel your hair the way you normally would for a job interview or important business meeting. if you’re in an industry that generally benefits from a less-formal look, feel free to dress a little more casually. Wear a trendier dress or a unique suit jacket without a tie. A sweater over a collared shirt can work as well. This would be appropriate for graphic designers, programmers, or writers. Most business headshots are from the waist or chest and up. If you don’t plan on taking any full-body shots, feel free to wear some comfortable sweatpants or something like that."
                },
                {
                    "headline": "Compare examples online or from coworkers to find what looks appropriate.",
                    "description": "Look at your boss’s headshot on social media to get a sense for what’s appropriate in your industry. If you can’t find it online, look for people in similar positions online. This is a great way to get a sense for where you should take your photo and how you should dress. If you’re looking for a new position or promotion, look at how the managers and directors in your field dress. For example, if you’re a mechanical engineer, look at how the head of engineering departments look in their headshots. LinkedIn is great for this. Go on LinkedIn and browse profiles to compare how people present themselves in their photos. This is less important if you aren’t shooting a business headshot since you can wear whatever you want."
                }
            ]
        },
        {
            "name": "Setting up the Camera",
            "steps": [
                {
                    "headline": "Use a DSLR camera or newer smartphone to get a high-quality image.",
                    "description": "A DSLR will give you more control over your image, but you can certainly use a phone with a high-quality lens if you that's all you have available. It will be hard to get a high-quality image using a cheap camera or old phone. If you’re aiming for a professional look, it’s not worth wasting your time if you don’t have a great camera. Newer iPhones and Samsung models made after 2016 are known for having great cameras. If your phone’s camera has more than 12 megapixels (MP), the quality is likely very good. Megapixels refer to the number of pixels in each image. The more pixels there are, the more detailed the image will be. DSLR stands for digital single-lens reflex camera. DSLRs are the bulky cameras with big lenses that you see tourists and professional photographers using."
                },
                {
                    "headline": "Set up your camera on a tripod or a flat, stable surface.",
                    "description": "Since you won't be able take professional-looking photos while holding your camera, you'll need a tripod or a flat surface to balance it on. Either attach your camera or smartphone to a tripod, or rest it on a flat surface, like a bookshelf, some books stacked on a table, a bench, or any other surface that's high enough to capture your shot. Tripods for DSLRs are universal, and basically every camera should fit on a standard camera tripod. You can also get a tripod for your phone if that’s how you’re shooting your photos."
                },
                {
                    "headline": "Set the shutter speed between 1/60-1/200 for a sharp photo.",
                    "description": "Shutter speed refers to how long the lens is exposed for an image. A faster shutter speed results in a sharper image, but requires a lot of light to illuminate the subject. A slower shutter speed will result in a brighter image, but things will be blurry if the camera and subject aren’t perfectly still. Keep the shutter speed at 1/60 or lower for a clear, sharp image. Prioritize shutter speed over the other settings for a business headshot. Raise the ISO or lower the aperture before you increase the shutter speed."
                },
                {
                    "headline": "Turn the ISO to 100-400 for a clear, grain-free image.",
                    "description": "ISO stands for International Organization for Standardization. A higher ISO results in a grainer image, but requires a low exposure. A lower ISO will result in a higher-quality image, but requires a longer exposure. Start with the ISO at 100, 200, or 400 and make adjustments as needed based on the light you have available. Do not exceed 800 ISO. If you do, you’re going to end up with noise in your photo and it may look grainy. The only time you should exceed 800 ISO is if you’re shooting an artistic portrait and want the digital image to resemble film."
                },
                {
                    "headline": "Adjust the aperture based on the depth of the image you want.",
                    "description": "Aperture, or f-stop, refers to the depth of field in an image. The lower the aperture, the blurrier images in the background will be. A high aperture requires a longer shutter speed. Unless you want to draw attention to something in the background, keep the f-stop under f/12. For an outdoor business headshot, set the aperture as low as you can (usually around f/2) to blur the background out. You want the emphasis to be on you, not the background."
                }
            ]
        },
        {
            "name": "Taking the Pictures",
            "steps": [
                {
                    "headline": "Place an item where you plan on standing and adjust the focus.",
                    "description": "Once you set your camera and lights up, put a chair, standing lamp, broom, or some other object in the location where you’re going to stand for the self-portrait. Then, either adjust the focus manually or use the automatic focus setting to bring your object into focus. This way, you know that you’ll be in focus when you replace the object for your portrait. On most phones, you touch the screen where the object is to put it into focus. On a DSLR, the focus setting is typically on the side of the lens itself. “M” stands for manual while “A” stands for automatic. When it’s set to automatic, you press the shutter button halfway down and the lens will adjust accordingly based on what you’re looking at in the viewfinder."
                },
                {
                    "headline": "Set the timer on your camera.",
                    "description": "Every camera has a delayed-timer setting which should give you enough time to move from the camera to the spot where you’re going to stand for the photo. Unfortunately, you will need to repeat this process every time you want to take a photo. To take multiple photos at once, connect an intervalometer or remote shutter to your camera and use that instead. An intervalometer is an automated attachment that you plug into your camera. Set it to take a photo every 1, 5, or 10 seconds to change your pose or facial expression after every shot. Intervalometers are typically used to make stop-motion videos or in time-lapse photography. A remote shutter is an attachment that plugs into you camera. It comes with a clicker that you can click from anywhere to take a photo without being behind the camera."
                },
                {
                    "headline": "Run to your mark and pose for the camera.",
                    "description": "Once you set the timer, move quickly to the spot where you’re taking your photo and pose. Position yourself so that you’re in the exact location where the object you used to set the focus. Take a breath and make whatever expression or gesture you’d like for your photo. For a business headshot, be sure to relax your arms at your side and stand up straight. Tense arms can make you hunch over a little, which can make you look dishonest or tired. You can stuff your hands in your pockets if it makes it easier for you to relax. If you’re shooting some artful self-portraits, feel free to make whatever facial expression you think works for the image you’re going for."
                },
                {
                    "headline": "Review the results of your shot and adjust the settings as needed.",
                    "description": "Once you’ve taken a single shot, go back to the camera and review your image. Use this first shot as a metric for what settings or adjustments you need to make in terms of how you look and what the camera settings are. If the image is too dark, try raising the ISO 100-200 or lowering the shutter speed. If you’re blurry, readjust the focus. If the image is washed out in light, lower the ISO to 200-400 before moving the shutter speed down. It is extremely unlikely that your first photo will look right. Don’t worry--the closer you get to the right settings for your shot, the more likely you are to find the perfect self-portrait!"
                },
                {
                    "headline": "Continue taking photos until you have several portraits to choose from.",
                    "description": "Once you’ve adjusted your settings based on your first image, continue taking photos. Make adjustments as needed and shoot multiple images until you achieve your goal. Shoot at least 10-20 images to increase the chances that at least 1 of your portraits is excellent! The more images you take, the more likely it is that you’ll capture something truly special. At the same time, it can take a long time to sort through hundreds of photos! Ideally, you should have at least 5 options to choose from."
                },
                {
                    "headline": "Edit your photographs using professional editing software.",
                    "description": "If you know how to use a complex editing program like Photoshop, upload your photos and edit the ones you really like in your editing program. Otherwise, download a simple and free editing program like PhotoScape, Photoshop Express, or Gimp. Crop your images to get the best ratio between your body and the negative space, adjust the light levels, and apply filters as desired to improve the look of your photos. If the color of the lighting is off, change the white balance settings. To make your image brighter or darker, use the brightness or contrast settings to adjust the light in your photo. Professional headshots typically don’t use flashy camera filters. If you really want to stand out and you’re in a creative industry, feel free to opt for a black and white filter, though! If you’re using your phone, click the “edit” button in the gallery screen to change a photo. You can always edit photos from your camera in a computer program after you edit them, though. In a professional headshot, there should probably be a 2:1 ratio between your body and the background. You want the focus to be on you, not the background."
                }
            ]
        }
    ],
    "tyn": [
        "Tripod",
        "DSLR or phone camera"
    ],
    "text": " Choosing a Location Shoot indoors for a standard headshot with a basic background. If you’re shooting professional photos for personal use, like for social media, choose any backdrop that you think will be interesting. If you’re shooting a professional headshot, choose a blank wall, shoot with bookshelves behind you, or hang a simple bedsheet behind you.Tip: Avoid shooting business headshots with personal items or furniture in the background. You don’t want it to look like you took this at home, even if that’s exactly what you’re doing! To hang a sheet for a portrait, use tape or a curtain rod to hang the sheet vertically behind you. If you want to add a little more attitude or personality to your image, feel free to shoot your business headshot against a textured or wallpapered wall. Set your shot up next to a bright window and add lights as needed. Shoot during the day and set up your shot in a bright, sunny room. Use lamps, your camera flash, and ceiling lights to complement the light from your window. You can rent or buy a softbox for perfect portrait lighting if you’d like. Set additional light sources to the right or left of the camera to create dynamic shadows and highlights. If you use additional lighting sources, use light sources that produce white light, as opposed to yellow or blue light. A softbox is a professional piece of equipment that produces high-quality white light. Take photos outdoors for a more dynamic, natural shot. Look for a nice backdrop outdoors where the background will match the tone that you’re aiming for in your image. Stairs, porches, and backyards can provide interesting locations for a self-portrait. If you’re shooting a headshot, a simple brick wall or city skyline can provide a standard backdrop that won’t stand out too much or dominate the image. Shoot outdoor photos during the day with the sun behind the camera. Shoot during the day when the sun is out to get bright, natural lighting. Choose an angle where you aren’t directly in front of the sun. Otherwise, your face won't be illuminated. Avoid shooting around noon when the sun is high in the sky to avoid washing your image out in light. For a more dynamic look, shoot 15-45 minutes after sunrise or before sunset. These periods are known as the golden hours, and they’re the periods in the day when the light is softer and more radiant. Avoid shooting in overcast conditions. It is difficult to achieve strong highlights and shadows if there isn’t much direct light outside. Choose an outfit that matches the goal of your photo. If you're taking self-portraits for personal use, you can wear whatever you want for your photo! Dress professionally for a business headshot. If you’re wearing a suit, make sure that it has been dry cleaned and ironed. If you’re going for a more traditional look, put a tie on. For a more contemporary, trendy look, skip the tie. If you’re wearing a dress, make sure that it is business appropriate. Wash, comb, and gel your hair the way you normally would for a job interview or important business meeting. if you’re in an industry that generally benefits from a less-formal look, feel free to dress a little more casually. Wear a trendier dress or a unique suit jacket without a tie. A sweater over a collared shirt can work as well. This would be appropriate for graphic designers, programmers, or writers. Most business headshots are from the waist or chest and up. If you don’t plan on taking any full-body shots, feel free to wear some comfortable sweatpants or something like that. Compare examples online or from coworkers to find what looks appropriate. Look at your boss’s headshot on social media to get a sense for what’s appropriate in your industry. If you can’t find it online, look for people in similar positions online. This is a great way to get a sense for where you should take your photo and how you should dress. If you’re looking for a new position or promotion, look at how the managers and directors in your field dress. For example, if you’re a mechanical engineer, look at how the head of engineering departments look in their headshots. LinkedIn is great for this. Go on LinkedIn and browse profiles to compare how people present themselves in their photos. This is less important if you aren’t shooting a business headshot since you can wear whatever you want. Setting up the Camera Use a DSLR camera or newer smartphone to get a high-quality image. A DSLR will give you more control over your image, but you can certainly use a phone with a high-quality lens if you that's all you have available. It will be hard to get a high-quality image using a cheap camera or old phone. If you’re aiming for a professional look, it’s not worth wasting your time if you don’t have a great camera. Newer iPhones and Samsung models made after 2016 are known for having great cameras. If your phone’s camera has more than 12 megapixels (MP), the quality is likely very good. Megapixels refer to the number of pixels in each image. The more pixels there are, the more detailed the image will be. DSLR stands for digital single-lens reflex camera. DSLRs are the bulky cameras with big lenses that you see tourists and professional photographers using. Set up your camera on a tripod or a flat, stable surface. Since you won't be able take professional-looking photos while holding your camera, you'll need a tripod or a flat surface to balance it on. Either attach your camera or smartphone to a tripod, or rest it on a flat surface, like a bookshelf, some books stacked on a table, a bench, or any other surface that's high enough to capture your shot. Tripods for DSLRs are universal, and basically every camera should fit on a standard camera tripod. You can also get a tripod for your phone if that’s how you’re shooting your photos. Set the shutter speed between 1/60-1/200 for a sharp photo. Shutter speed refers to how long the lens is exposed for an image. A faster shutter speed results in a sharper image, but requires a lot of light to illuminate the subject. A slower shutter speed will result in a brighter image, but things will be blurry if the camera and subject aren’t perfectly still. Keep the shutter speed at 1/60 or lower for a clear, sharp image. Prioritize shutter speed over the other settings for a business headshot. Raise the ISO or lower the aperture before you increase the shutter speed. Turn the ISO to 100-400 for a clear, grain-free image. ISO stands for International Organization for Standardization. A higher ISO results in a grainer image, but requires a low exposure. A lower ISO will result in a higher-quality image, but requires a longer exposure. Start with the ISO at 100, 200, or 400 and make adjustments as needed based on the light you have available. Do not exceed 800 ISO. If you do, you’re going to end up with noise in your photo and it may look grainy. The only time you should exceed 800 ISO is if you’re shooting an artistic portrait and want the digital image to resemble film. Adjust the aperture based on the depth of the image you want. Aperture, or f-stop, refers to the depth of field in an image. The lower the aperture, the blurrier images in the background will be. A high aperture requires a longer shutter speed. Unless you want to draw attention to something in the background, keep the f-stop under f/12. For an outdoor business headshot, set the aperture as low as you can (usually around f/2) to blur the background out. You want the emphasis to be on you, not the background. Taking the Pictures Place an item where you plan on standing and adjust the focus. Once you set your camera and lights up, put a chair, standing lamp, broom, or some other object in the location where you’re going to stand for the self-portrait. Then, either adjust the focus manually or use the automatic focus setting to bring your object into focus. This way, you know that you’ll be in focus when you replace the object for your portrait. On most phones, you touch the screen where the object is to put it into focus. On a DSLR, the focus setting is typically on the side of the lens itself. “M” stands for manual while “A” stands for automatic. When it’s set to automatic, you press the shutter button halfway down and the lens will adjust accordingly based on what you’re looking at in the viewfinder. Set the timer on your camera. Every camera has a delayed-timer setting which should give you enough time to move from the camera to the spot where you’re going to stand for the photo. Unfortunately, you will need to repeat this process every time you want to take a photo. To take multiple photos at once, connect an intervalometer or remote shutter to your camera and use that instead. An intervalometer is an automated attachment that you plug into your camera. Set it to take a photo every 1, 5, or 10 seconds to change your pose or facial expression after every shot. Intervalometers are typically used to make stop-motion videos or in time-lapse photography. A remote shutter is an attachment that plugs into you camera. It comes with a clicker that you can click from anywhere to take a photo without being behind the camera. Run to your mark and pose for the camera. Once you set the timer, move quickly to the spot where you’re taking your photo and pose. Position yourself so that you’re in the exact location where the object you used to set the focus. Take a breath and make whatever expression or gesture you’d like for your photo. For a business headshot, be sure to relax your arms at your side and stand up straight. Tense arms can make you hunch over a little, which can make you look dishonest or tired. You can stuff your hands in your pockets if it makes it easier for you to relax. If you’re shooting some artful self-portraits, feel free to make whatever facial expression you think works for the image you’re going for. Review the results of your shot and adjust the settings as needed. Once you’ve taken a single shot, go back to the camera and review your image. Use this first shot as a metric for what settings or adjustments you need to make in terms of how you look and what the camera settings are. If the image is too dark, try raising the ISO 100-200 or lowering the shutter speed. If you’re blurry, readjust the focus. If the image is washed out in light, lower the ISO to 200-400 before moving the shutter speed down. It is extremely unlikely that your first photo will look right. Don’t worry--the closer you get to the right settings for your shot, the more likely you are to find the perfect self-portrait! Continue taking photos until you have several portraits to choose from. Once you’ve adjusted your settings based on your first image, continue taking photos. Make adjustments as needed and shoot multiple images until you achieve your goal. Shoot at least 10-20 images to increase the chances that at least 1 of your portraits is excellent! The more images you take, the more likely it is that you’ll capture something truly special. At the same time, it can take a long time to sort through hundreds of photos! Ideally, you should have at least 5 options to choose from. Edit your photographs using professional editing software. If you know how to use a complex editing program like Photoshop, upload your photos and edit the ones you really like in your editing program. Otherwise, download a simple and free editing program like PhotoScape, Photoshop Express, or Gimp. Crop your images to get the best ratio between your body and the negative space, adjust the light levels, and apply filters as desired to improve the look of your photos. If the color of the lighting is off, change the white balance settings. To make your image brighter or darker, use the brightness or contrast settings to adjust the light in your photo. Professional headshots typically don’t use flashy camera filters. If you really want to stand out and you’re in a creative industry, feel free to opt for a black and white filter, though! If you’re using your phone, click the “edit” button in the gallery screen to change a photo. You can always edit photos from your camera in a computer program after you edit them, though. In a professional headshot, there should probably be a 2:1 ratio between your body and the background. You want the focus to be on you, not the background.",
    "sentences": [
        " Choosing a Location Shoot indoors for a standard headshot with a basic background.",
        "If you’re shooting professional photos for personal use, like for social media, choose any backdrop that you think will be interesting.",
        "If you’re shooting a professional headshot, choose a blank wall, shoot with bookshelves behind you, or hang a simple bedsheet behind you.Tip: Avoid shooting business headshots with personal items or furniture in the background.",
        "You don’t want it to look like you took this at home, even if that’s exactly what you’re doing!",
        "To hang a sheet for a portrait, use tape or a curtain rod to hang the sheet vertically behind you.",
        "If you want to add a little more attitude or personality to your image, feel free to shoot your business headshot against a textured or wallpapered wall.",
        "Set your shot up next to a bright window and add lights as needed.",
        "Shoot during the day and set up your shot in a bright, sunny room.",
        "Use lamps, your camera flash, and ceiling lights to complement the light from your window.",
        "You can rent or buy a softbox for perfect portrait lighting if you’d like.",
        "Set additional light sources to the right or left of the camera to create dynamic shadows and highlights.",
        "If you use additional lighting sources, use light sources that produce white light, as opposed to yellow or blue light.",
        "A softbox is a professional piece of equipment that produces high-quality white light.",
        "Take photos outdoors for a more dynamic, natural shot.",
        "Look for a nice backdrop outdoors where the background will match the tone that you’re aiming for in your image.",
        "Stairs, porches, and backyards can provide interesting locations for a self-portrait.",
        "If you’re shooting a headshot, a simple brick wall or city skyline can provide a standard backdrop that won’t stand out too much or dominate the image.",
        "Shoot outdoor photos during the day with the sun behind the camera.",
        "Shoot during the day when the sun is out to get bright, natural lighting.",
        "Choose an angle where you aren’t directly in front of the sun.",
        "Otherwise, your face won't be illuminated.",
        "Avoid shooting around noon when the sun is high in the sky to avoid washing your image out in light.",
        "For a more dynamic look, shoot 15-45 minutes after sunrise or before sunset.",
        "These periods are known as the golden hours, and they’re the periods in the day when the light is softer and more radiant.",
        "Avoid shooting in overcast conditions.",
        "It is difficult to achieve strong highlights and shadows if there isn’t much direct light outside.",
        "Choose an outfit that matches the goal of your photo.",
        "If you're taking self-portraits for personal use, you can wear whatever you want for your photo!",
        "Dress professionally for a business headshot.",
        "If you’re wearing a suit, make sure that it has been dry cleaned and ironed.",
        "If you’re going for a more traditional look, put a tie on.",
        "For a more contemporary, trendy look, skip the tie.",
        "If you’re wearing a dress, make sure that it is business appropriate.",
        "Wash, comb, and gel your hair the way you normally would for a job interview or important business meeting.",
        "if you’re in an industry that generally benefits from a less-formal look, feel free to dress a little more casually.",
        "Wear a trendier dress or a unique suit jacket without a tie.",
        "A sweater over a collared shirt can work as well.",
        "This would be appropriate for graphic designers, programmers, or writers.",
        "Most business headshots are from the waist or chest and up.",
        "If you don’t plan on taking any full-body shots, feel free to wear some comfortable sweatpants or something like that.",
        "Compare examples online or from coworkers to find what looks appropriate.",
        "Look at your boss’s headshot on social media to get a sense for what’s appropriate in your industry.",
        "If you can’t find it online, look for people in similar positions online.",
        "This is a great way to get a sense for where you should take your photo and how you should dress.",
        "If you’re looking for a new position or promotion, look at how the managers and directors in your field dress.",
        "For example, if you’re a mechanical engineer, look at how the head of engineering departments look in their headshots.",
        "LinkedIn is great for this.",
        "Go on LinkedIn and browse profiles to compare how people present themselves in their photos.",
        "This is less important if you aren’t shooting a business headshot since you can wear whatever you want.",
        "Setting up the Camera Use a DSLR camera or newer smartphone to get a high-quality image.",
        "A DSLR will give you more control over your image, but you can certainly use a phone with a high-quality lens if you that's all you have available.",
        "It will be hard to get a high-quality image using a cheap camera or old phone.",
        "If you’re aiming for a professional look, it’s not worth wasting your time if you don’t have a great camera.",
        "Newer iPhones and Samsung models made after 2016 are known for having great cameras.",
        "If your phone’s camera has more than 12 megapixels (MP), the quality is likely very good.",
        "Megapixels refer to the number of pixels in each image.",
        "The more pixels there are, the more detailed the image will be.",
        "DSLR stands for digital single-lens reflex camera.",
        "DSLRs are the bulky cameras with big lenses that you see tourists and professional photographers using.",
        "Set up your camera on a tripod or a flat, stable surface.",
        "Since you won't be able take professional-looking photos while holding your camera, you'll need a tripod or a flat surface to balance it on.",
        "Either attach your camera or smartphone to a tripod, or rest it on a flat surface, like a bookshelf, some books stacked on a table, a bench, or any other surface that's high enough to capture your shot.",
        "Tripods for DSLRs are universal, and basically every camera should fit on a standard camera tripod.",
        "You can also get a tripod for your phone if that’s how you’re shooting your photos.",
        "Set the shutter speed between 1/60-1/200 for a sharp photo.",
        "Shutter speed refers to how long the lens is exposed for an image.",
        "A faster shutter speed results in a sharper image, but requires a lot of light to illuminate the subject.",
        "A slower shutter speed will result in a brighter image, but things will be blurry if the camera and subject aren’t perfectly still.",
        "Keep the shutter speed at 1/60 or lower for a clear, sharp image.",
        "Prioritize shutter speed over the other settings for a business headshot.",
        "Raise the ISO or lower the aperture before you increase the shutter speed.",
        "Turn the ISO to 100-400 for a clear, grain-free image.",
        "ISO stands for International Organization for Standardization.",
        "A higher ISO results in a grainer image, but requires a low exposure.",
        "A lower ISO will result in a higher-quality image, but requires a longer exposure.",
        "Start with the ISO at 100, 200, or 400 and make adjustments as needed based on the light you have available.",
        "Do not exceed 800 ISO.",
        "If you do, you’re going to end up with noise in your photo and it may look grainy.",
        "The only time you should exceed 800 ISO is if you’re shooting an artistic portrait and want the digital image to resemble film.",
        "Adjust the aperture based on the depth of the image you want.",
        "Aperture, or f-stop, refers to the depth of field in an image.",
        "The lower the aperture, the blurrier images in the background will be.",
        "A high aperture requires a longer shutter speed.",
        "Unless you want to draw attention to something in the background, keep the f-stop under f/12.",
        "For an outdoor business headshot, set the aperture as low as you can (usually around f/2) to blur the background out.",
        "You want the emphasis to be on you, not the background.",
        "Taking the Pictures Place an item where you plan on standing and adjust the focus.",
        "Once you set your camera and lights up, put a chair, standing lamp, broom, or some other object in the location where you’re going to stand for the self-portrait.",
        "Then, either adjust the focus manually or use the automatic focus setting to bring your object into focus.",
        "This way, you know that you’ll be in focus when you replace the object for your portrait.",
        "On most phones, you touch the screen where the object is to put it into focus.",
        "On a DSLR, the focus setting is typically on the side of the lens itself.",
        "“M” stands for manual while “A” stands for automatic.",
        "When it’s set to automatic, you press the shutter button halfway down and the lens will adjust accordingly based on what you’re looking at in the viewfinder.",
        "Set the timer on your camera.",
        "Every camera has a delayed-timer setting which should give you enough time to move from the camera to the spot where you’re going to stand for the photo.",
        "Unfortunately, you will need to repeat this process every time you want to take a photo.",
        "To take multiple photos at once, connect an intervalometer or remote shutter to your camera and use that instead.",
        "An intervalometer is an automated attachment that you plug into your camera.",
        "Set it to take a photo every 1, 5, or 10 seconds to change your pose or facial expression after every shot.",
        "Intervalometers are typically used to make stop-motion videos or in time-lapse photography.",
        "A remote shutter is an attachment that plugs into you camera.",
        "It comes with a clicker that you can click from anywhere to take a photo without being behind the camera.",
        "Run to your mark and pose for the camera.",
        "Once you set the timer, move quickly to the spot where you’re taking your photo and pose.",
        "Position yourself so that you’re in the exact location where the object you used to set the focus.",
        "Take a breath and make whatever expression or gesture you’d like for your photo.",
        "For a business headshot, be sure to relax your arms at your side and stand up straight.",
        "Tense arms can make you hunch over a little, which can make you look dishonest or tired.",
        "You can stuff your hands in your pockets if it makes it easier for you to relax.",
        "If you’re shooting some artful self-portraits, feel free to make whatever facial expression you think works for the image you’re going for.",
        "Review the results of your shot and adjust the settings as needed.",
        "Once you’ve taken a single shot, go back to the camera and review your image.",
        "Use this first shot as a metric for what settings or adjustments you need to make in terms of how you look and what the camera settings are.",
        "If the image is too dark, try raising the ISO 100-200 or lowering the shutter speed.",
        "If you’re blurry, readjust the focus.",
        "If the image is washed out in light, lower the ISO to 200-400 before moving the shutter speed down.",
        "It is extremely unlikely that your first photo will look right.",
        "Don’t worry--the closer you get to the right settings for your shot, the more likely you are to find the perfect self-portrait!",
        "Continue taking photos until you have several portraits to choose from.",
        "Once you’ve adjusted your settings based on your first image, continue taking photos.",
        "Make adjustments as needed and shoot multiple images until you achieve your goal.",
        "Shoot at least 10-20 images to increase the chances that at least 1 of your portraits is excellent!",
        "The more images you take, the more likely it is that you’ll capture something truly special.",
        "At the same time, it can take a long time to sort through hundreds of photos!",
        "Ideally, you should have at least 5 options to choose from.",
        "Edit your photographs using professional editing software.",
        "If you know how to use a complex editing program like Photoshop, upload your photos and edit the ones you really like in your editing program.",
        "Otherwise, download a simple and free editing program like PhotoScape, Photoshop Express, or Gimp.",
        "Crop your images to get the best ratio between your body and the negative space, adjust the light levels, and apply filters as desired to improve the look of your photos.",
        "If the color of the lighting is off, change the white balance settings.",
        "To make your image brighter or darker, use the brightness or contrast settings to adjust the light in your photo.",
        "Professional headshots typically don’t use flashy camera filters.",
        "If you really want to stand out and you’re in a creative industry, feel free to opt for a black and white filter, though!",
        "If you’re using your phone, click the “edit” button in the gallery screen to change a photo.",
        "You can always edit photos from your camera in a computer program after you edit them, though.",
        "In a professional headshot, there should probably be a 2:1 ratio between your body and the background.",
        "You want the focus to be on you, not the background."
    ]
}