{
    "title": "How to Polish a Floor",
    "url": "https://www.wikihow.com/Polish-a-Floor",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Floors and Stairs",
        "Cleaning Floors",
        "Floor Polish"
    ],
    "methods": [
        {
            "name": "Cleaning Flooring",
            "steps": [
                {
                    "headline": "Empty the room of rugs and furniture.",
                    "description": "Remove anything that could get in your way while you’re working. Take care of anything mobile so you don’t have to stop to remove it while you’re applying polish. Furniture and other fixtures contain hidden debris, so be careful of what you leave behind. Expose the flooring as much as possible, but note anything you are unable to remove. If you can’t remove something, leave it behind and work around it. For example, if you’re stuck with a heavy cabinet, you won’t be able to polish the floor underneath it, but you can still treat the visible spots."
                },
                {
                    "headline": "Sweep or vacuum the floor to remove debris.",
                    "description": "All debris has to be removed before you are able to polish a floor. Select a broom with fine, soft bristles to avoid scratching more delicate types of flooring. Go over the floor with a quality floor vacuum to ensure you eliminate as much of the debris as possible. Stiff-bristled brooms can scratch delicate flooring, such as wood or marble. When in doubt, use a soft-bristled broom to avoid potential damage. Remember to eliminate hidden debris, such as anything on the grout between floor tiles or near the walls. Vacuums are more effective than brooms at pulling out stubborn debris."
                },
                {
                    "headline": "Mop stone, tile, and other flooring with soapy water.",
                    "description": "For a basic cleaner, mix about ⁄4 cup (59 mL) of a mild dish soap into 16 cups (3,800 mL) of warm water. Stir the water until it is soapy. Then, dampen the mop with a light amount of water and begin spreading it over the floor. Work from one end of the room to the other, taking care not to leave puddles of standing water behind. A mild dish soap is anything pH neutral without intense scents, chemicals, or degreasers. This cleaning solution works on most floors to remove stuck grime. Household cleaners like vinegar and baking soda can be used sparingly on most floors. For example, mix about ⁄4 in (0.64 cm) cup of vinegar into the soapy water for a better hardwood floor cleaner."
                },
                {
                    "headline": "Clean laminate and some wood floors through dry mopping.",
                    "description": "Some types of flooring are easily damaged by moisture and should not be washed. Avoid adding water to cork, laminate, or unsealed hardwood. If you have a sealed hardwood floor, dry mop it if it has a penetrating finish instead of a surface finish. Penetrating finishes absorb water, but surface finishes are waterproof. One way to test a hardwood floor is by carefully scraping part of the finish with a knife. A surface finish leaves clear, unsmudged material on the knife. If you’re uncertain about using water on the floor, always dry mop or vacuum it instead."
                },
                {
                    "headline": "Treat the floor with a specialty cleaner to eliminate tough stains.",
                    "description": "If you’re having trouble getting rid of a stain, get a cleaner matching the type of floor you have. For example, get a wood floor cleaner to scrub wood floors or slate oil for slate floors. Spray a light amount of cleaner onto stains to cover them, then scrub them with a microfiber mop. If you have a tile floor, remember to scrub the gaps in between the individual tiles. These spaces can get very dirty and are often tough to clean. Apply a grout cleaner to make the process easier. Specialty cleaners, along with all other cleaning and polishing products, are available online and at most hardware stores. General stores also carry some of what you may need."
                },
                {
                    "headline": "Dry flooring right away with a clean microfiber towel.",
                    "description": "Scrub the entire floor with a soft towel to avoid scratches. Make sure you don’t leave any moisture behind. Some surfaces, such as wood, will sustain permanent damage if you let water seep in. As your towel gets saturated, switch to a fresh one in order to continue absorbing more of the moisture. Some surfaces can be left to dry overnight if you don’t wish to mop up the moisture on your own. Stone flooring, for example, is waterproof."
                }
            ]
        },
        {
            "name": "Treating Wood Floors",
            "steps": [
                {
                    "headline": "Test the floor with a sharp knife if you’re uncertain what kind of finish it has.",
                    "description": "Hardwood floors can have different types of finishes that require different types of polish. To test a floor, scrape up part of the waxy coating on top of it. Take off just a little bit so the blade doesn’t scratch the wood. If the material looks clear, then your floor has a wax finish and can be polished. Smudges mean that your floor has a penetrating finish that requires a wax polish. Most modern wood floors have a clear polyurethane finish. Varnish, shellac, and lacquer are also used as surface finishes. Wax leaves a yellow-brown stain and is often used to top floors treated with a penetrating finish. You could also test the finish with a few drops of denatured alcohol and lacquer thinner. Sprinkle a couple of drops of each on the floor, then wipe them up with a rag. If the finish softens, strip and wax your floor yearly."
                },
                {
                    "headline": "Pour at least 2 tablespoons (30 mL) of wood polish from the bottle onto the floor.",
                    "description": "Walk to the far end of the room so you are able to work toward one of the exits. Apply a light amount of polish, just enough to coat the floor with a thin layer of it. Check the manufacturer’s instructions for an estimate of how much to use at one time. Using too little polish is better than using too much. You can always cover missed areas or apply a second layer of polish later."
                },
                {
                    "headline": "Scrub along the wood’s grain with a flat microfiber mop.",
                    "description": "If you look closely at the floorboards, you will be able to see their dark grain lines. Work along the lines instead of moving across from them. It reduces your chances of scratching the floor and leads to a more consistent finish. You could also use a microfiber cloth. If you’re doing this, apply a “feathering technique” by scrubbing the floor in semi-circles while moving along the grain."
                },
                {
                    "headline": "Cover 3 to 5 ft (0.91 to 1.52 m) sections of the floor at a time.",
                    "description": "Divide the floor up into separate sections so the polish doesn’t dry out before you finish spreading it out. Make sure each part has a smooth, consistent finish before moving onto the next one. Gradually work your way toward the exit, polishing each section as you go. Scrub each area until the coat of polish looks thin and consistent. If you notice excess polish pooling in one area, push it toward a dryer spot. Be careful of any baseboards or furniture in the room. Splashed polish could damage them."
                },
                {
                    "headline": "Wait at least 1 hour before allowing light foot traffic on the floor.",
                    "description": "Stepping on the floor before then could dull or remove the polish. Even after 1 hour, the polish won’t be completely settled. Let it cure for 24 hours before moving furniture back into the room. When you’re ready to put the furniture back, pick it up instead of sliding it across the floor. Be sure to consult the manufacturer’s recommendations to find out the specific drying time required for the product you're using."
                }
            ]
        },
        {
            "name": "Shining Vinyl and Tile Floors",
            "steps": [
                {
                    "headline": "Select a neutral-pH floor polish to pour onto the floor.",
                    "description": "Vinyl-specific polishes are available for vinyl floors, but you will most likely have to get a general floor polish to treat tile. Acidic cleaners could ruin some types of vinyl, so be careful about what product you choose. Check the product label as well as the manufacturer’s recommendations to see if it is compatible with your floor. If you’re unsure about using a polish, test it in an inconspicuous spot first. Vinyl and tile floors don’t require much effort to polish. In fact, cleaning them often is enough to make them look shinier, but using a floor polish can make them look even brighter."
                },
                {
                    "headline": "Pour at least 2 tablespoons (30 mL) of the polish onto the floor.",
                    "description": "Spread it directly from the bottle. Use just enough to cover the floor without leaving excess moisture behind. If you’re uncertain how much to use, start with a small amount, then add more as you go along. You could also dampen a rag in the polish if you plan on polishing the floor by hand. That way, you can avoid leaving any excess behind. If you’re looking for a natural alternative, combine equal amounts of water and white vinegar. Mop the floor with the mixture to make it look shinier. You can mop the floor with club soda afterward for extra brightness."
                },
                {
                    "headline": "Scrub the entire floor with a flat microfiber mop.",
                    "description": "Start at the back of the room and work your way toward the exit. Move across the width of the room, spreading the polish with the mop. Continue across the dry portions until the entire floor is covered with a thin but consistent layer of the polish. Spread out any puddles of polish you notice forming. Thinner layers dry faster, and you can always apply additional polish if it is needed. For tile floors, be sure to push some of the polish into the gaps between the individual tiles. It’s easy to do with a mop, but you could overlook it if you’re using a cloth."
                },
                {
                    "headline": "Let the polish dry overnight before using the floor.",
                    "description": "Give the polish plenty of time to soak in. If the floor feels damp or sticky, the polish hasn’t finished drying yet. You can step on most floors after about an hour, but wait up to 24 hours before putting furniture back on the floor. Consult the manufacturer’s recommendations for an official drying time. It can vary a little from product to product."
                }
            ]
        },
        {
            "name": "Finishing Concrete and Stone Floors",
            "steps": [
                {
                    "headline": "Rent a concrete grinding machine to polish the floor on your own.",
                    "description": "The machine wears down and polishes the floor as you push it along. It has diamond-coated abrasive disks on its underside that do the polishing. Get one that has a range of disks, from 30-grit to 3,000 grit. Also, make sure yours has a skirt and vacuum to contain dust. Check your local hardware store to see if they have grinding machines available for rent. The machines are somewhat expensive, so you could also call a professional cleaner to take care of the floor for you. Another way to polish stone is by applying a polishing powder. Wet it with water according to the manufacturer’s instructions, then use a 175 rpm buffing pad to work it into the floor."
                },
                {
                    "headline": "Scrub the floor with a 30-grit diamond pad.",
                    "description": "Always start with the lowest-grit pad you have available. Fit it on the underside of the machine, then begin pushing it along the width of the floor. Start at the tail end of the room and work toward the exit. Move the grinder at a slow but steady pace to ensure it is effective on the entire floor. If you’re using a grinding machine without a dust vacuum, put on a dust mask before working on the floor. Vacuum up remaining dust after finishing the floor. Most grinders have a hard time reaching corners. To remedy this, rent a separate edging machine and push it along the walls."
                },
                {
                    "headline": "Spray a chemical hardener on the floor.",
                    "description": "Hardeners, also called densifiers, are meant to seal flooring to prevent stains and powdery dust from settling on it. Choose a hardener that matches the type of floor you’re polishing. Then, apply the polish with a spray bottle or a hand-pumped sprayer. Coat the entire floor with an even, consistent layer of the polish. Some grinding machines have a built-in liquid dispenser. If yours has one, take advantage of it to get a more consistent application of the hardener. You don’t have to wait for the hardener to dry before continuing to polish the floor. For maximum effect, add a new coating of hardener each time you swap out grinding disks."
                },
                {
                    "headline": "Switch to a 300-grit grinding disk and treat the floor again.",
                    "description": "Swap out disks, then push the grinder to the rear part of the room. After activating it, work back toward the exist. Make sure you cover the entire floor. The new grinding disk will smooth out the finish left by the rougher disk. To get a better finish, use any lower-grit disks you have available before finishing with the 300-grit one. It may seem like a lot of work, but your floor will have a better polish if you use a bunch of different disks. For example, polish the floor with an 80 and 150-grit disk, then follow up with the 300-grit one. If you don’t have other disks, just use the 300-grit one."
                },
                {
                    "headline": "Finish grinding the floor with a 1,500 or 3,000-grit disk.",
                    "description": "Change out the 300-grit disk for the highest-grit one you have available. If you have multiple high-grit disks, use them in order from lowest to highest in order to get a better finish. Start at the tail end of the room and work your way forward once more. After you finish, the floor will already look much shinier than it did before. For example, you might use an 400-grit disc, followed by an 800-grit one, and then finish with the 1,500 or 3,000 one. If you take the time to use the disks in order, your floor will end up much shinier than usual."
                },
                {
                    "headline": "Apply a stone or concrete sealer with a burnishing pad to further shine it.",
                    "description": "Spread the appropriate sealer using a mop or sprayer, then switch the grinding disk out for a burnishing pad. Go back over the entire floor to work the sealer into it. The pad buffs the floor without grinding it, giving it a bright, clean, and protective finish similar to wax or oil. Grinding the floor without burnishing it usually leads to a good finish. However, adding the sealer makes the finish even better. Stone and concrete floors have to be sealed once a year to keep them waterproof. The best time to reseal the floor is right after grinding it."
                }
            ]
        }
    ],
    "tyn": [
        "Cleaning Flooring",
        "Soft-bristled broom or vacuum",
        "Mild dish soap",
        "Water",
        "Mixing bucket",
        "Microfiber mop",
        "Microfiber towel",
        "Surface-specific cleaners (optional)",
        "Treating Wood Floors",
        "Wood floor polish",
        "Flat mop or microfiber cloth",
        "Sharp utility knife (optional)",
        "Shining Vinyl and Tile Floors",
        "Vinyl or tile floor polish",
        "Finishing Concrete and Stone Floors",
        "Concrete grinding machine",
        "30-grit diamond-coated grinding disk",
        "300-grit diamond-coated grinding disk",
        "Stone or concrete chemical hardener",
        "1,500 or 3,000-grit diamond-coated grinding disk"
    ],
    "text": " Cleaning Flooring Empty the room of rugs and furniture. Remove anything that could get in your way while you’re working. Take care of anything mobile so you don’t have to stop to remove it while you’re applying polish. Furniture and other fixtures contain hidden debris, so be careful of what you leave behind. Expose the flooring as much as possible, but note anything you are unable to remove. If you can’t remove something, leave it behind and work around it. For example, if you’re stuck with a heavy cabinet, you won’t be able to polish the floor underneath it, but you can still treat the visible spots. Sweep or vacuum the floor to remove debris. All debris has to be removed before you are able to polish a floor. Select a broom with fine, soft bristles to avoid scratching more delicate types of flooring. Go over the floor with a quality floor vacuum to ensure you eliminate as much of the debris as possible. Stiff-bristled brooms can scratch delicate flooring, such as wood or marble. When in doubt, use a soft-bristled broom to avoid potential damage. Remember to eliminate hidden debris, such as anything on the grout between floor tiles or near the walls. Vacuums are more effective than brooms at pulling out stubborn debris. Mop stone, tile, and other flooring with soapy water. For a basic cleaner, mix about ⁄4 cup (59 mL) of a mild dish soap into 16 cups (3,800 mL) of warm water. Stir the water until it is soapy. Then, dampen the mop with a light amount of water and begin spreading it over the floor. Work from one end of the room to the other, taking care not to leave puddles of standing water behind. A mild dish soap is anything pH neutral without intense scents, chemicals, or degreasers. This cleaning solution works on most floors to remove stuck grime. Household cleaners like vinegar and baking soda can be used sparingly on most floors. For example, mix about ⁄4 in (0.64 cm) cup of vinegar into the soapy water for a better hardwood floor cleaner. Clean laminate and some wood floors through dry mopping. Some types of flooring are easily damaged by moisture and should not be washed. Avoid adding water to cork, laminate, or unsealed hardwood. If you have a sealed hardwood floor, dry mop it if it has a penetrating finish instead of a surface finish. Penetrating finishes absorb water, but surface finishes are waterproof. One way to test a hardwood floor is by carefully scraping part of the finish with a knife. A surface finish leaves clear, unsmudged material on the knife. If you’re uncertain about using water on the floor, always dry mop or vacuum it instead. Treat the floor with a specialty cleaner to eliminate tough stains. If you’re having trouble getting rid of a stain, get a cleaner matching the type of floor you have. For example, get a wood floor cleaner to scrub wood floors or slate oil for slate floors. Spray a light amount of cleaner onto stains to cover them, then scrub them with a microfiber mop. If you have a tile floor, remember to scrub the gaps in between the individual tiles. These spaces can get very dirty and are often tough to clean. Apply a grout cleaner to make the process easier. Specialty cleaners, along with all other cleaning and polishing products, are available online and at most hardware stores. General stores also carry some of what you may need. Dry flooring right away with a clean microfiber towel. Scrub the entire floor with a soft towel to avoid scratches. Make sure you don’t leave any moisture behind. Some surfaces, such as wood, will sustain permanent damage if you let water seep in. As your towel gets saturated, switch to a fresh one in order to continue absorbing more of the moisture. Some surfaces can be left to dry overnight if you don’t wish to mop up the moisture on your own. Stone flooring, for example, is waterproof. Treating Wood Floors Test the floor with a sharp knife if you’re uncertain what kind of finish it has. Hardwood floors can have different types of finishes that require different types of polish. To test a floor, scrape up part of the waxy coating on top of it. Take off just a little bit so the blade doesn’t scratch the wood. If the material looks clear, then your floor has a wax finish and can be polished. Smudges mean that your floor has a penetrating finish that requires a wax polish. Most modern wood floors have a clear polyurethane finish. Varnish, shellac, and lacquer are also used as surface finishes. Wax leaves a yellow-brown stain and is often used to top floors treated with a penetrating finish. You could also test the finish with a few drops of denatured alcohol and lacquer thinner. Sprinkle a couple of drops of each on the floor, then wipe them up with a rag. If the finish softens, strip and wax your floor yearly. Pour at least 2 tablespoons (30 mL) of wood polish from the bottle onto the floor. Walk to the far end of the room so you are able to work toward one of the exits. Apply a light amount of polish, just enough to coat the floor with a thin layer of it. Check the manufacturer’s instructions for an estimate of how much to use at one time. Using too little polish is better than using too much. You can always cover missed areas or apply a second layer of polish later. Scrub along the wood’s grain with a flat microfiber mop. If you look closely at the floorboards, you will be able to see their dark grain lines. Work along the lines instead of moving across from them. It reduces your chances of scratching the floor and leads to a more consistent finish. You could also use a microfiber cloth. If you’re doing this, apply a “feathering technique” by scrubbing the floor in semi-circles while moving along the grain. Cover 3 to 5 ft (0.91 to 1.52 m) sections of the floor at a time. Divide the floor up into separate sections so the polish doesn’t dry out before you finish spreading it out. Make sure each part has a smooth, consistent finish before moving onto the next one. Gradually work your way toward the exit, polishing each section as you go. Scrub each area until the coat of polish looks thin and consistent. If you notice excess polish pooling in one area, push it toward a dryer spot. Be careful of any baseboards or furniture in the room. Splashed polish could damage them. Wait at least 1 hour before allowing light foot traffic on the floor. Stepping on the floor before then could dull or remove the polish. Even after 1 hour, the polish won’t be completely settled. Let it cure for 24 hours before moving furniture back into the room. When you’re ready to put the furniture back, pick it up instead of sliding it across the floor. Be sure to consult the manufacturer’s recommendations to find out the specific drying time required for the product you're using. Shining Vinyl and Tile Floors Select a neutral-pH floor polish to pour onto the floor. Vinyl-specific polishes are available for vinyl floors, but you will most likely have to get a general floor polish to treat tile. Acidic cleaners could ruin some types of vinyl, so be careful about what product you choose. Check the product label as well as the manufacturer’s recommendations to see if it is compatible with your floor. If you’re unsure about using a polish, test it in an inconspicuous spot first. Vinyl and tile floors don’t require much effort to polish. In fact, cleaning them often is enough to make them look shinier, but using a floor polish can make them look even brighter. Pour at least 2 tablespoons (30 mL) of the polish onto the floor. Spread it directly from the bottle. Use just enough to cover the floor without leaving excess moisture behind. If you’re uncertain how much to use, start with a small amount, then add more as you go along. You could also dampen a rag in the polish if you plan on polishing the floor by hand. That way, you can avoid leaving any excess behind. If you’re looking for a natural alternative, combine equal amounts of water and white vinegar. Mop the floor with the mixture to make it look shinier. You can mop the floor with club soda afterward for extra brightness. Scrub the entire floor with a flat microfiber mop. Start at the back of the room and work your way toward the exit. Move across the width of the room, spreading the polish with the mop. Continue across the dry portions until the entire floor is covered with a thin but consistent layer of the polish. Spread out any puddles of polish you notice forming. Thinner layers dry faster, and you can always apply additional polish if it is needed. For tile floors, be sure to push some of the polish into the gaps between the individual tiles. It’s easy to do with a mop, but you could overlook it if you’re using a cloth. Let the polish dry overnight before using the floor. Give the polish plenty of time to soak in. If the floor feels damp or sticky, the polish hasn’t finished drying yet. You can step on most floors after about an hour, but wait up to 24 hours before putting furniture back on the floor. Consult the manufacturer’s recommendations for an official drying time. It can vary a little from product to product. Finishing Concrete and Stone Floors Rent a concrete grinding machine to polish the floor on your own. The machine wears down and polishes the floor as you push it along. It has diamond-coated abrasive disks on its underside that do the polishing. Get one that has a range of disks, from 30-grit to 3,000 grit. Also, make sure yours has a skirt and vacuum to contain dust. Check your local hardware store to see if they have grinding machines available for rent. The machines are somewhat expensive, so you could also call a professional cleaner to take care of the floor for you. Another way to polish stone is by applying a polishing powder. Wet it with water according to the manufacturer’s instructions, then use a 175 rpm buffing pad to work it into the floor. Scrub the floor with a 30-grit diamond pad. Always start with the lowest-grit pad you have available. Fit it on the underside of the machine, then begin pushing it along the width of the floor. Start at the tail end of the room and work toward the exit. Move the grinder at a slow but steady pace to ensure it is effective on the entire floor. If you’re using a grinding machine without a dust vacuum, put on a dust mask before working on the floor. Vacuum up remaining dust after finishing the floor. Most grinders have a hard time reaching corners. To remedy this, rent a separate edging machine and push it along the walls. Spray a chemical hardener on the floor. Hardeners, also called densifiers, are meant to seal flooring to prevent stains and powdery dust from settling on it. Choose a hardener that matches the type of floor you’re polishing. Then, apply the polish with a spray bottle or a hand-pumped sprayer. Coat the entire floor with an even, consistent layer of the polish. Some grinding machines have a built-in liquid dispenser. If yours has one, take advantage of it to get a more consistent application of the hardener. You don’t have to wait for the hardener to dry before continuing to polish the floor. For maximum effect, add a new coating of hardener each time you swap out grinding disks. Switch to a 300-grit grinding disk and treat the floor again. Swap out disks, then push the grinder to the rear part of the room. After activating it, work back toward the exist. Make sure you cover the entire floor. The new grinding disk will smooth out the finish left by the rougher disk. To get a better finish, use any lower-grit disks you have available before finishing with the 300-grit one. It may seem like a lot of work, but your floor will have a better polish if you use a bunch of different disks. For example, polish the floor with an 80 and 150-grit disk, then follow up with the 300-grit one. If you don’t have other disks, just use the 300-grit one. Finish grinding the floor with a 1,500 or 3,000-grit disk. Change out the 300-grit disk for the highest-grit one you have available. If you have multiple high-grit disks, use them in order from lowest to highest in order to get a better finish. Start at the tail end of the room and work your way forward once more. After you finish, the floor will already look much shinier than it did before. For example, you might use an 400-grit disc, followed by an 800-grit one, and then finish with the 1,500 or 3,000 one. If you take the time to use the disks in order, your floor will end up much shinier than usual. Apply a stone or concrete sealer with a burnishing pad to further shine it. Spread the appropriate sealer using a mop or sprayer, then switch the grinding disk out for a burnishing pad. Go back over the entire floor to work the sealer into it. The pad buffs the floor without grinding it, giving it a bright, clean, and protective finish similar to wax or oil. Grinding the floor without burnishing it usually leads to a good finish. However, adding the sealer makes the finish even better. Stone and concrete floors have to be sealed once a year to keep them waterproof. The best time to reseal the floor is right after grinding it.",
    "sentences": [
        " Cleaning Flooring Empty the room of rugs and furniture.",
        "Remove anything that could get in your way while you’re working.",
        "Take care of anything mobile so you don’t have to stop to remove it while you’re applying polish.",
        "Furniture and other fixtures contain hidden debris, so be careful of what you leave behind.",
        "Expose the flooring as much as possible, but note anything you are unable to remove.",
        "If you can’t remove something, leave it behind and work around it.",
        "For example, if you’re stuck with a heavy cabinet, you won’t be able to polish the floor underneath it, but you can still treat the visible spots.",
        "Sweep or vacuum the floor to remove debris.",
        "All debris has to be removed before you are able to polish a floor.",
        "Select a broom with fine, soft bristles to avoid scratching more delicate types of flooring.",
        "Go over the floor with a quality floor vacuum to ensure you eliminate as much of the debris as possible.",
        "Stiff-bristled brooms can scratch delicate flooring, such as wood or marble.",
        "When in doubt, use a soft-bristled broom to avoid potential damage.",
        "Remember to eliminate hidden debris, such as anything on the grout between floor tiles or near the walls.",
        "Vacuums are more effective than brooms at pulling out stubborn debris.",
        "Mop stone, tile, and other flooring with soapy water.",
        "For a basic cleaner, mix about ⁄4 cup (59 mL) of a mild dish soap into 16 cups (3,800 mL) of warm water.",
        "Stir the water until it is soapy.",
        "Then, dampen the mop with a light amount of water and begin spreading it over the floor.",
        "Work from one end of the room to the other, taking care not to leave puddles of standing water behind.",
        "A mild dish soap is anything pH neutral without intense scents, chemicals, or degreasers.",
        "This cleaning solution works on most floors to remove stuck grime.",
        "Household cleaners like vinegar and baking soda can be used sparingly on most floors.",
        "For example, mix about ⁄4 in (0.64 cm) cup of vinegar into the soapy water for a better hardwood floor cleaner.",
        "Clean laminate and some wood floors through dry mopping.",
        "Some types of flooring are easily damaged by moisture and should not be washed.",
        "Avoid adding water to cork, laminate, or unsealed hardwood.",
        "If you have a sealed hardwood floor, dry mop it if it has a penetrating finish instead of a surface finish.",
        "Penetrating finishes absorb water, but surface finishes are waterproof.",
        "One way to test a hardwood floor is by carefully scraping part of the finish with a knife.",
        "A surface finish leaves clear, unsmudged material on the knife.",
        "If you’re uncertain about using water on the floor, always dry mop or vacuum it instead.",
        "Treat the floor with a specialty cleaner to eliminate tough stains.",
        "If you’re having trouble getting rid of a stain, get a cleaner matching the type of floor you have.",
        "For example, get a wood floor cleaner to scrub wood floors or slate oil for slate floors.",
        "Spray a light amount of cleaner onto stains to cover them, then scrub them with a microfiber mop.",
        "If you have a tile floor, remember to scrub the gaps in between the individual tiles.",
        "These spaces can get very dirty and are often tough to clean.",
        "Apply a grout cleaner to make the process easier.",
        "Specialty cleaners, along with all other cleaning and polishing products, are available online and at most hardware stores.",
        "General stores also carry some of what you may need.",
        "Dry flooring right away with a clean microfiber towel.",
        "Scrub the entire floor with a soft towel to avoid scratches.",
        "Make sure you don’t leave any moisture behind.",
        "Some surfaces, such as wood, will sustain permanent damage if you let water seep in.",
        "As your towel gets saturated, switch to a fresh one in order to continue absorbing more of the moisture.",
        "Some surfaces can be left to dry overnight if you don’t wish to mop up the moisture on your own.",
        "Stone flooring, for example, is waterproof.",
        "Treating Wood Floors Test the floor with a sharp knife if you’re uncertain what kind of finish it has.",
        "Hardwood floors can have different types of finishes that require different types of polish.",
        "To test a floor, scrape up part of the waxy coating on top of it.",
        "Take off just a little bit so the blade doesn’t scratch the wood.",
        "If the material looks clear, then your floor has a wax finish and can be polished.",
        "Smudges mean that your floor has a penetrating finish that requires a wax polish.",
        "Most modern wood floors have a clear polyurethane finish.",
        "Varnish, shellac, and lacquer are also used as surface finishes.",
        "Wax leaves a yellow-brown stain and is often used to top floors treated with a penetrating finish.",
        "You could also test the finish with a few drops of denatured alcohol and lacquer thinner.",
        "Sprinkle a couple of drops of each on the floor, then wipe them up with a rag.",
        "If the finish softens, strip and wax your floor yearly.",
        "Pour at least 2 tablespoons (30 mL) of wood polish from the bottle onto the floor.",
        "Walk to the far end of the room so you are able to work toward one of the exits.",
        "Apply a light amount of polish, just enough to coat the floor with a thin layer of it.",
        "Check the manufacturer’s instructions for an estimate of how much to use at one time.",
        "Using too little polish is better than using too much.",
        "You can always cover missed areas or apply a second layer of polish later.",
        "Scrub along the wood’s grain with a flat microfiber mop.",
        "If you look closely at the floorboards, you will be able to see their dark grain lines.",
        "Work along the lines instead of moving across from them.",
        "It reduces your chances of scratching the floor and leads to a more consistent finish.",
        "You could also use a microfiber cloth.",
        "If you’re doing this, apply a “feathering technique” by scrubbing the floor in semi-circles while moving along the grain.",
        "Cover 3 to 5 ft (0.91 to 1.52 m) sections of the floor at a time.",
        "Divide the floor up into separate sections so the polish doesn’t dry out before you finish spreading it out.",
        "Make sure each part has a smooth, consistent finish before moving onto the next one.",
        "Gradually work your way toward the exit, polishing each section as you go.",
        "Scrub each area until the coat of polish looks thin and consistent.",
        "If you notice excess polish pooling in one area, push it toward a dryer spot.",
        "Be careful of any baseboards or furniture in the room.",
        "Splashed polish could damage them.",
        "Wait at least 1 hour before allowing light foot traffic on the floor.",
        "Stepping on the floor before then could dull or remove the polish.",
        "Even after 1 hour, the polish won’t be completely settled.",
        "Let it cure for 24 hours before moving furniture back into the room.",
        "When you’re ready to put the furniture back, pick it up instead of sliding it across the floor.",
        "Be sure to consult the manufacturer’s recommendations to find out the specific drying time required for the product you're using.",
        "Shining Vinyl and Tile Floors Select a neutral-pH floor polish to pour onto the floor.",
        "Vinyl-specific polishes are available for vinyl floors, but you will most likely have to get a general floor polish to treat tile.",
        "Acidic cleaners could ruin some types of vinyl, so be careful about what product you choose.",
        "Check the product label as well as the manufacturer’s recommendations to see if it is compatible with your floor.",
        "If you’re unsure about using a polish, test it in an inconspicuous spot first.",
        "Vinyl and tile floors don’t require much effort to polish.",
        "In fact, cleaning them often is enough to make them look shinier, but using a floor polish can make them look even brighter.",
        "Pour at least 2 tablespoons (30 mL) of the polish onto the floor.",
        "Spread it directly from the bottle.",
        "Use just enough to cover the floor without leaving excess moisture behind.",
        "If you’re uncertain how much to use, start with a small amount, then add more as you go along.",
        "You could also dampen a rag in the polish if you plan on polishing the floor by hand.",
        "That way, you can avoid leaving any excess behind.",
        "If you’re looking for a natural alternative, combine equal amounts of water and white vinegar.",
        "Mop the floor with the mixture to make it look shinier.",
        "You can mop the floor with club soda afterward for extra brightness.",
        "Scrub the entire floor with a flat microfiber mop.",
        "Start at the back of the room and work your way toward the exit.",
        "Move across the width of the room, spreading the polish with the mop.",
        "Continue across the dry portions until the entire floor is covered with a thin but consistent layer of the polish.",
        "Spread out any puddles of polish you notice forming.",
        "Thinner layers dry faster, and you can always apply additional polish if it is needed.",
        "For tile floors, be sure to push some of the polish into the gaps between the individual tiles.",
        "It’s easy to do with a mop, but you could overlook it if you’re using a cloth.",
        "Let the polish dry overnight before using the floor.",
        "Give the polish plenty of time to soak in.",
        "If the floor feels damp or sticky, the polish hasn’t finished drying yet.",
        "You can step on most floors after about an hour, but wait up to 24 hours before putting furniture back on the floor.",
        "Consult the manufacturer’s recommendations for an official drying time.",
        "It can vary a little from product to product.",
        "Finishing Concrete and Stone Floors Rent a concrete grinding machine to polish the floor on your own.",
        "The machine wears down and polishes the floor as you push it along.",
        "It has diamond-coated abrasive disks on its underside that do the polishing.",
        "Get one that has a range of disks, from 30-grit to 3,000 grit.",
        "Also, make sure yours has a skirt and vacuum to contain dust.",
        "Check your local hardware store to see if they have grinding machines available for rent.",
        "The machines are somewhat expensive, so you could also call a professional cleaner to take care of the floor for you.",
        "Another way to polish stone is by applying a polishing powder.",
        "Wet it with water according to the manufacturer’s instructions, then use a 175 rpm buffing pad to work it into the floor.",
        "Scrub the floor with a 30-grit diamond pad.",
        "Always start with the lowest-grit pad you have available.",
        "Fit it on the underside of the machine, then begin pushing it along the width of the floor.",
        "Start at the tail end of the room and work toward the exit.",
        "Move the grinder at a slow but steady pace to ensure it is effective on the entire floor.",
        "If you’re using a grinding machine without a dust vacuum, put on a dust mask before working on the floor.",
        "Vacuum up remaining dust after finishing the floor.",
        "Most grinders have a hard time reaching corners.",
        "To remedy this, rent a separate edging machine and push it along the walls.",
        "Spray a chemical hardener on the floor.",
        "Hardeners, also called densifiers, are meant to seal flooring to prevent stains and powdery dust from settling on it.",
        "Choose a hardener that matches the type of floor you’re polishing.",
        "Then, apply the polish with a spray bottle or a hand-pumped sprayer.",
        "Coat the entire floor with an even, consistent layer of the polish.",
        "Some grinding machines have a built-in liquid dispenser.",
        "If yours has one, take advantage of it to get a more consistent application of the hardener.",
        "You don’t have to wait for the hardener to dry before continuing to polish the floor.",
        "For maximum effect, add a new coating of hardener each time you swap out grinding disks.",
        "Switch to a 300-grit grinding disk and treat the floor again.",
        "Swap out disks, then push the grinder to the rear part of the room.",
        "After activating it, work back toward the exist.",
        "Make sure you cover the entire floor.",
        "The new grinding disk will smooth out the finish left by the rougher disk.",
        "To get a better finish, use any lower-grit disks you have available before finishing with the 300-grit one.",
        "It may seem like a lot of work, but your floor will have a better polish if you use a bunch of different disks.",
        "For example, polish the floor with an 80 and 150-grit disk, then follow up with the 300-grit one.",
        "If you don’t have other disks, just use the 300-grit one.",
        "Finish grinding the floor with a 1,500 or 3,000-grit disk.",
        "Change out the 300-grit disk for the highest-grit one you have available.",
        "If you have multiple high-grit disks, use them in order from lowest to highest in order to get a better finish.",
        "Start at the tail end of the room and work your way forward once more.",
        "After you finish, the floor will already look much shinier than it did before.",
        "For example, you might use an 400-grit disc, followed by an 800-grit one, and then finish with the 1,500 or 3,000 one.",
        "If you take the time to use the disks in order, your floor will end up much shinier than usual.",
        "Apply a stone or concrete sealer with a burnishing pad to further shine it.",
        "Spread the appropriate sealer using a mop or sprayer, then switch the grinding disk out for a burnishing pad.",
        "Go back over the entire floor to work the sealer into it.",
        "The pad buffs the floor without grinding it, giving it a bright, clean, and protective finish similar to wax or oil.",
        "Grinding the floor without burnishing it usually leads to a good finish.",
        "However, adding the sealer makes the finish even better.",
        "Stone and concrete floors have to be sealed once a year to keep them waterproof.",
        "The best time to reseal the floor is right after grinding it."
    ]
}