{
    "title": "How to Care for a Butcher Block Countertop",
    "url": "https://www.wikihow.com/Care-for-a-Butcher-Block-Countertop",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation"
    ],
    "methods": [
        {
            "name": "Cleaning a Butcher Block for Daily Use",
            "steps": [
                {
                    "headline": "Remove food remnants with a damp rag for a quick clean.",
                    "description": "Wet a clean rag or paper towel with water and use it to clean off any food crumbs or dirt from the countertop. This is a good way to clean off any light spills as well. Wipe down the entire counter thoroughly to be sure you don’t leave any crumbs. This is a great way to clean if you’re short on time and the butcher block countertop wasn’t super dirty to begin with. Wipe down the counter with a dry towel to remove any excess moisture after you've used a damp rag."
                },
                {
                    "headline": "Use dish soap and water for a more thorough cleaning.",
                    "description": "Wetting a clean rag with dish soap and water is a good way to remove larger spills or wipe away more stubborn food remnants. Wipe the entire butcher block countertop with the soapy rag before using a clean, damp rag to remove any lingering soap. Use a dry rag or paper towel to dry the countertop once it’s clean, if desired. Use dish soap and water for things like orange juice spills or sticky crumbs."
                },
                {
                    "headline": "Wipe down the counter using vinegar to disinfect it.",
                    "description": "If you used your butcher block countertop to prepare raw meats or other foods that might lead to contamination, disinfect the countertop so it's clean. Remove any crumbs or debris from the countertop using a regular damp cloth first. Dampen a clean rag or paper towel with vinegar and wipe down the dirty area thoroughly. Use regular white vinegar to disinfect the butcher block. Dry the countertop using a clean, dry towel after it's disinfected or wait for the counter to dry naturally."
                }
            ]
        },
        {
            "name": "Removing Stains",
            "steps": [
                {
                    "headline": "Wipe away potential stains before they absorb into the wood, if possible.",
                    "description": "If your butcher block doesn’t have several layers of oil built up to protect its surface, liquids will soak into the wood quickly and leave a stain. If anything spills onto the butcher block or foods leave behind discoloration, wipe this up as soon as possible to prevent the liquid or food from soaking into the wood."
                },
                {
                    "headline": "Rub salt and lemon on the counter for a thorough stain removal.",
                    "description": "If there’s a stain on the counter that isn’t coming out easily, sprinkle salt on the area. Cut a lemon in half and squeeze a little bit of the juice out on the area before rubbing the salt into the butcher block using the lemon half to remove the stain. Wipe down the area with a damp rag to remove the salt and lemon juice after the stain is gone. Any type of salt will work."
                },
                {
                    "headline": "Let baking soda soak into the counter to remove deep stains.",
                    "description": "Sprinkle a layer of baking soda onto trickier stains. Rub the baking soda into the countertop using a damp rag or a vinegar-soaked sponge. Apply another layer of baking soda to the stain after you’ve scrubbed the first layer in if needed. Let the baking soda sit on the butcher block countertop for 10-20 minutes for it to soak in after you apply each layer, if desired. Wipe the baking soda off of the counter using a clean, damp rag."
                }
            ]
        },
        {
            "name": "Refinishing the Butcher Block",
            "steps": [
                {
                    "headline": "Sand the butcher block surface with a coarse-grit sandpaper to remove a stain.",
                    "description": "Sand the top layer of the countertop off if there's a deep, lingering stain. Use a coarse sandpaper to remove the stain, rubbing the area using circular motions until the stain is gone. Only use the coarse-grit sandpaper on the stain and not the entire countertop. Use a medium-coarse sandpaper with a grit between 100 and 150. It's not necessary to use an electric sander on the stain since you won't be sanding the entire surface yet."
                },
                {
                    "headline": "Use a finer-grit sandpaper to smooth out the surface.",
                    "description": "This removes any rough patches and makes sure the butcher block is smooth and even. Use circular motions to smooth out the spot that had the stain on it, and then go over the entire surface of the butcher block countertop so the oil will soak in more easily. Use sandpaper with a grit of 180-220. Sand the counter by hand or use an electric sander for an even surface. Wipe away dust from sanding the countertop using a damp rag before you apply the oil."
                },
                {
                    "headline": "Cover the countertop evenly with a food-safe oil using a clean rag.",
                    "description": "Purchase a food-grade mineral oil to cover the countertop with. Raw linseed oil, walnut oil, and almond oil are all options that will protect the butcher block and build up a resistance to things like stains and scratches. Apply the oil to the rag and wipe it into the countertop, using small amounts of oil until you've covered the entire surface in a thin, even layer. Wipe going with the grain to be sure the oil gets into the nooks and crannies of the countertop. Avoid using an oil made of nuts if you or someone in your household is allergic. Don't use cooking oils like vegetable or olive oil on the countertop because they won't be able to protect your countertop like food-grade mineral oils."
                },
                {
                    "headline": "Let it sit for 30 minutes before wiping away the excess oil.",
                    "description": "Set a timer for 30 minutes so you know how long the oil has been absorbing into the wood. After 30 minutes, use a clean, dry rag to wipe the excess oil off of the countertop using circular motions."
                },
                {
                    "headline": "Apply a second coat if the oil absorbed into the wood quickly.",
                    "description": "If the first layer of oil soaked into the butcher block easily, use the rag to apply a second layer over the entire countertop evenly. Use circular motions to apply the second coat and let it sit for at least 30 minutes to dry. Wipe away any excess oil with a rag after 20-30 minutes. To test whether the oil absorbs into the wood quickly, pour a drop or 2 of oil onto the countertop and watch it closely. If it stays pooled on the surface, you don’t need another coat. If it starts to soak into the wood, a second coat is best."
                }
            ]
        }
    ],
    "tyn": [
        "Cleaning a Butcher Block for Daily Use",
        "Clean rag",
        "Paper towels",
        "Dish soap (optional)",
        "Vinegar (optional)",
        "Removing Stains",
        "Paper towel or clean rag",
        "Salt (optional)",
        "Lemon (optional)",
        "Knife (optional)",
        "Baking soda (optional)",
        "Sponge (optional)",
        "Refinishing the Butcher Block",
        "Coarse-grit sandpaper",
        "Finer-grit sandpaper",
        "Food-safe mineral oil"
    ],
    "text": " Cleaning a Butcher Block for Daily Use Remove food remnants with a damp rag for a quick clean. Wet a clean rag or paper towel with water and use it to clean off any food crumbs or dirt from the countertop. This is a good way to clean off any light spills as well. Wipe down the entire counter thoroughly to be sure you don’t leave any crumbs. This is a great way to clean if you’re short on time and the butcher block countertop wasn’t super dirty to begin with. Wipe down the counter with a dry towel to remove any excess moisture after you've used a damp rag. Use dish soap and water for a more thorough cleaning. Wetting a clean rag with dish soap and water is a good way to remove larger spills or wipe away more stubborn food remnants. Wipe the entire butcher block countertop with the soapy rag before using a clean, damp rag to remove any lingering soap. Use a dry rag or paper towel to dry the countertop once it’s clean, if desired. Use dish soap and water for things like orange juice spills or sticky crumbs. Wipe down the counter using vinegar to disinfect it. If you used your butcher block countertop to prepare raw meats or other foods that might lead to contamination, disinfect the countertop so it's clean. Remove any crumbs or debris from the countertop using a regular damp cloth first. Dampen a clean rag or paper towel with vinegar and wipe down the dirty area thoroughly. Use regular white vinegar to disinfect the butcher block. Dry the countertop using a clean, dry towel after it's disinfected or wait for the counter to dry naturally. Removing Stains Wipe away potential stains before they absorb into the wood, if possible. If your butcher block doesn’t have several layers of oil built up to protect its surface, liquids will soak into the wood quickly and leave a stain. If anything spills onto the butcher block or foods leave behind discoloration, wipe this up as soon as possible to prevent the liquid or food from soaking into the wood. Rub salt and lemon on the counter for a thorough stain removal. If there’s a stain on the counter that isn’t coming out easily, sprinkle salt on the area. Cut a lemon in half and squeeze a little bit of the juice out on the area before rubbing the salt into the butcher block using the lemon half to remove the stain. Wipe down the area with a damp rag to remove the salt and lemon juice after the stain is gone. Any type of salt will work. Let baking soda soak into the counter to remove deep stains. Sprinkle a layer of baking soda onto trickier stains. Rub the baking soda into the countertop using a damp rag or a vinegar-soaked sponge. Apply another layer of baking soda to the stain after you’ve scrubbed the first layer in if needed. Let the baking soda sit on the butcher block countertop for 10-20 minutes for it to soak in after you apply each layer, if desired. Wipe the baking soda off of the counter using a clean, damp rag. Refinishing the Butcher Block Sand the butcher block surface with a coarse-grit sandpaper to remove a stain. Sand the top layer of the countertop off if there's a deep, lingering stain. Use a coarse sandpaper to remove the stain, rubbing the area using circular motions until the stain is gone. Only use the coarse-grit sandpaper on the stain and not the entire countertop. Use a medium-coarse sandpaper with a grit between 100 and 150. It's not necessary to use an electric sander on the stain since you won't be sanding the entire surface yet. Use a finer-grit sandpaper to smooth out the surface. This removes any rough patches and makes sure the butcher block is smooth and even. Use circular motions to smooth out the spot that had the stain on it, and then go over the entire surface of the butcher block countertop so the oil will soak in more easily. Use sandpaper with a grit of 180-220. Sand the counter by hand or use an electric sander for an even surface. Wipe away dust from sanding the countertop using a damp rag before you apply the oil. Cover the countertop evenly with a food-safe oil using a clean rag. Purchase a food-grade mineral oil to cover the countertop with. Raw linseed oil, walnut oil, and almond oil are all options that will protect the butcher block and build up a resistance to things like stains and scratches. Apply the oil to the rag and wipe it into the countertop, using small amounts of oil until you've covered the entire surface in a thin, even layer. Wipe going with the grain to be sure the oil gets into the nooks and crannies of the countertop. Avoid using an oil made of nuts if you or someone in your household is allergic. Don't use cooking oils like vegetable or olive oil on the countertop because they won't be able to protect your countertop like food-grade mineral oils. Let it sit for 30 minutes before wiping away the excess oil. Set a timer for 30 minutes so you know how long the oil has been absorbing into the wood. After 30 minutes, use a clean, dry rag to wipe the excess oil off of the countertop using circular motions. Apply a second coat if the oil absorbed into the wood quickly. If the first layer of oil soaked into the butcher block easily, use the rag to apply a second layer over the entire countertop evenly. Use circular motions to apply the second coat and let it sit for at least 30 minutes to dry. Wipe away any excess oil with a rag after 20-30 minutes. To test whether the oil absorbs into the wood quickly, pour a drop or 2 of oil onto the countertop and watch it closely. If it stays pooled on the surface, you don’t need another coat. If it starts to soak into the wood, a second coat is best.",
    "sentences": [
        " Cleaning a Butcher Block for Daily Use Remove food remnants with a damp rag for a quick clean.",
        "Wet a clean rag or paper towel with water and use it to clean off any food crumbs or dirt from the countertop.",
        "This is a good way to clean off any light spills as well.",
        "Wipe down the entire counter thoroughly to be sure you don’t leave any crumbs.",
        "This is a great way to clean if you’re short on time and the butcher block countertop wasn’t super dirty to begin with.",
        "Wipe down the counter with a dry towel to remove any excess moisture after you've used a damp rag.",
        "Use dish soap and water for a more thorough cleaning.",
        "Wetting a clean rag with dish soap and water is a good way to remove larger spills or wipe away more stubborn food remnants.",
        "Wipe the entire butcher block countertop with the soapy rag before using a clean, damp rag to remove any lingering soap.",
        "Use a dry rag or paper towel to dry the countertop once it’s clean, if desired.",
        "Use dish soap and water for things like orange juice spills or sticky crumbs.",
        "Wipe down the counter using vinegar to disinfect it.",
        "If you used your butcher block countertop to prepare raw meats or other foods that might lead to contamination, disinfect the countertop so it's clean.",
        "Remove any crumbs or debris from the countertop using a regular damp cloth first.",
        "Dampen a clean rag or paper towel with vinegar and wipe down the dirty area thoroughly.",
        "Use regular white vinegar to disinfect the butcher block.",
        "Dry the countertop using a clean, dry towel after it's disinfected or wait for the counter to dry naturally.",
        "Removing Stains Wipe away potential stains before they absorb into the wood, if possible.",
        "If your butcher block doesn’t have several layers of oil built up to protect its surface, liquids will soak into the wood quickly and leave a stain.",
        "If anything spills onto the butcher block or foods leave behind discoloration, wipe this up as soon as possible to prevent the liquid or food from soaking into the wood.",
        "Rub salt and lemon on the counter for a thorough stain removal.",
        "If there’s a stain on the counter that isn’t coming out easily, sprinkle salt on the area.",
        "Cut a lemon in half and squeeze a little bit of the juice out on the area before rubbing the salt into the butcher block using the lemon half to remove the stain.",
        "Wipe down the area with a damp rag to remove the salt and lemon juice after the stain is gone.",
        "Any type of salt will work.",
        "Let baking soda soak into the counter to remove deep stains.",
        "Sprinkle a layer of baking soda onto trickier stains.",
        "Rub the baking soda into the countertop using a damp rag or a vinegar-soaked sponge.",
        "Apply another layer of baking soda to the stain after you’ve scrubbed the first layer in if needed.",
        "Let the baking soda sit on the butcher block countertop for 10-20 minutes for it to soak in after you apply each layer, if desired.",
        "Wipe the baking soda off of the counter using a clean, damp rag.",
        "Refinishing the Butcher Block Sand the butcher block surface with a coarse-grit sandpaper to remove a stain.",
        "Sand the top layer of the countertop off if there's a deep, lingering stain.",
        "Use a coarse sandpaper to remove the stain, rubbing the area using circular motions until the stain is gone.",
        "Only use the coarse-grit sandpaper on the stain and not the entire countertop.",
        "Use a medium-coarse sandpaper with a grit between 100 and 150.",
        "It's not necessary to use an electric sander on the stain since you won't be sanding the entire surface yet.",
        "Use a finer-grit sandpaper to smooth out the surface.",
        "This removes any rough patches and makes sure the butcher block is smooth and even.",
        "Use circular motions to smooth out the spot that had the stain on it, and then go over the entire surface of the butcher block countertop so the oil will soak in more easily.",
        "Use sandpaper with a grit of 180-220.",
        "Sand the counter by hand or use an electric sander for an even surface.",
        "Wipe away dust from sanding the countertop using a damp rag before you apply the oil.",
        "Cover the countertop evenly with a food-safe oil using a clean rag.",
        "Purchase a food-grade mineral oil to cover the countertop with.",
        "Raw linseed oil, walnut oil, and almond oil are all options that will protect the butcher block and build up a resistance to things like stains and scratches.",
        "Apply the oil to the rag and wipe it into the countertop, using small amounts of oil until you've covered the entire surface in a thin, even layer.",
        "Wipe going with the grain to be sure the oil gets into the nooks and crannies of the countertop.",
        "Avoid using an oil made of nuts if you or someone in your household is allergic.",
        "Don't use cooking oils like vegetable or olive oil on the countertop because they won't be able to protect your countertop like food-grade mineral oils.",
        "Let it sit for 30 minutes before wiping away the excess oil.",
        "Set a timer for 30 minutes so you know how long the oil has been absorbing into the wood.",
        "After 30 minutes, use a clean, dry rag to wipe the excess oil off of the countertop using circular motions.",
        "Apply a second coat if the oil absorbed into the wood quickly.",
        "If the first layer of oil soaked into the butcher block easily, use the rag to apply a second layer over the entire countertop evenly.",
        "Use circular motions to apply the second coat and let it sit for at least 30 minutes to dry.",
        "Wipe away any excess oil with a rag after 20-30 minutes.",
        "To test whether the oil absorbs into the wood quickly, pour a drop or 2 of oil onto the countertop and watch it closely.",
        "If it stays pooled on the surface, you don’t need another coat.",
        "If it starts to soak into the wood, a second coat is best."
    ]
}