{
    "title": "How to Install a PVC Door",
    "url": "https://www.wikihow.com/Install-a-PVC-Door",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Removing the Door and Installing the Sill",
            "steps": [
                {
                    "headline": "Remove your preexisting door by popping the hinge pins off if you’re replacing a door.",
                    "description": "Hold a flathead screwdriver under the hinge pin at the bottom of your door at a 45-degree angle. Tap the back of the screwdriver gently with a mallet or hammer until the pin comes loose. Then, pull it up by hand. Repeat this process for the other 2 hinges and lift the door out of the frame. You obviously don’t need to do this is there wasn’t a door in this location."
                },
                {
                    "headline": "Uninstall your old frame by unscrewing the hinges and prying it out if necessary.",
                    "description": "PVC doors come pre-hung, which means they’re already assembled in the frame. Remove your old frame if there is one by unscrewing the hinges from the jambs. Then, use a utility knife to cut along the seams where the frame meet the wall. Use a pry bar or chisel to pry the frame out and reveal the jambs. Use a nail remover to pull out the nails connecting the frame to the wall and rip the frame out. A jamb refers to the wood post that sits inside a doorway. It holds the weight of the door in place and is often covered by a frame. You do not need to do this if your door is hung directly on the jambs and there is no frame for it. This doesn’t need to be pretty. You’ll eventually cover this part of the door up with the trim for your PVC door."
                },
                {
                    "headline": "Set the sill in position at the base of the doorway and level it.",
                    "description": "The sill refers to the base of the door that sits in the frame. Set the sill down between the 2 vertical jambs and line the sides up with the center of your door. Put a spirit level on top of the door and check the air bubble to see if it’s level. If it isn’t, insert shims between the sill and the floor to adjust the level angle until it sits flat. Nail any shims into place using 1 inch (2.5 cm) nails.Tip: You may need to cut the sill depending on whether your sill was cut to size before you ordered it. To do this, measure the distance of the opening on the bottom of the door. Mark your cut on the sill after transferring the measurement. Use a hand saw to trim the sill down."
                },
                {
                    "headline": "Adhere the sill to the floor using a PVC sealant or screws.",
                    "description": "If you’re installing an exterior door, the bottom of the doorway is likely concrete and requires sealant. If it’s an interior door, it’s probably wood and can be secured with screws. For the sealant, use the manufacturer’s recommended adhesive to adhere the door to the floor. Apply a thick bead of the sealant across the middle of the sill and press it down. For wood floors, drill 2.5 in (6.4 cm) wood screws through the prefabricated slots in the sill. Use your spirit level to check the sill to make sure it’s level again before moving on. If the sill isn’t level, the door won’t be plumb. If it isn’t level, readjust the sill before the sealant dries. If you used screws, remove them and reposition shims before reinstalling the screws."
                },
                {
                    "headline": "Run a bead of silicone caulk along the rim where your door will sit.",
                    "description": "There is a raised, rectangular lip in the sill where the bottom frame of your door will sit. To ensure a tight fit and prevent air from coming in through this gap, apply a 1 in (2.5 cm) thick bead of silicone along the interior rim where this lip is located. This way, when you insert the frame into the doorway, the gap between the frame and the sill will be blocked. If you have a white door, use white caulk. For a black door, get black caulk. The frame may push some of the caulk out of the sill, but it won’t be noticeable if it’s the same color as the frame."
                }
            ]
        },
        {
            "name": "Setting Your Door and Frame",
            "steps": [
                {
                    "headline": "Remove the packaging and protective corners from your door.",
                    "description": "This step is different depending on how the manufacturer packaged your door. Typically, there are corner protectors that are screwed into the frame to prevent damage during shipment. Use a screwdriver or drill to remove these protectors. Then, peel the tape off of the edges of the frame where it will connect to the doorway. If you have any tape on the panels in the middle of the door, leave it on until you’re done installing the door."
                },
                {
                    "headline": "Assemble the handle if it isn’t already attached.",
                    "description": "You’re going to open and close the door several times while installing it in the doorway, so attach the handle if it isn’t already installed. While it depends on the style of your handle and the type of door you’ve ordered, the handle typically slides into prefabricated slots on the front of the door. On the frame of the handle, there are 2-4 screws. Screw the accompanying screws into the frame of the handle to secure it to the door. If you’re hanging an exterior door, the lock is already preassembled. The rest of the door assembly comes preassembled. Unlike wood doors where you can cut and install a lock and handle wherever you want, PVC is fairly difficult to cut without specialized tools. The manufacturer always does this part for you."
                },
                {
                    "headline": "Lift the door up and carefully slide it on top of the sill.",
                    "description": "This is much easier if you have a friend to help you brace the door from the other side, so get some help if you can. Orient the door so that it will open the direction you want it to. Then, pick the door up at a 15-degree angle and carefully slide the bottom of the frame into the slot on the sill. Gently and carefully slide the top of the door up while pulling the bottom of the frame into the sill. Hold the door and frame in place to brace it. Make sure that you double-check which direction the door will open before installing it. A door can open into a building or away from it. It’s totally up to you."
                },
                {
                    "headline": "Double-check the opening around the door to ensure you have space.",
                    "description": "Before moving forward, inspect the gap around the door frame on the sides and the top. There should be a 0.2–0.3 in (0.51–0.76 cm) gap between the new door frame and the jambs. If there isn’t a gap, the frame will have constant pressure put on it and may bend or break in the future. If the gap is too big, the frame may become loose and fall out of the doorway over time. If the gap is too big or small, install a new jamb to resize the doorway. If the gap is too big, you can use larger shims to hold the door in place, but the door will be more likely to break in the future."
                },
                {
                    "headline": "Use shims to hold the frame in the doorway.",
                    "description": "Get some 0.5–1 in (1.3–2.5 cm) shims. Starting in the middle of the vertical jambs, slide a shim in between the door frame and the jamb. Then, add a symmetrical shim on the opposite side of the frame. Repeat this process on the top and bottom portions of the jambs to secure the door. Continuously check the size of the gap between the jamb and the frame to ensure it stays 0.2–0.3 in (0.51–0.76 cm) while you apply the shims.Tip: This process is more of an art than a science. The goal is to apply enough shims to hold the door frame in place while maintaining your 0.2–0.3 in (0.51–0.76 cm) gap around the door frame. The shims create tension between the jambs and the frame to keep the door in place. Wood shims are soft enough that if serious pressure is applied to the door, it won’t break or bend."
                },
                {
                    "headline": "Make sure the door is plumb and use a mallet to make adjustments.",
                    "description": "Hold your spirit level vertically against the door to ensure that it is perfectly vertical. Use a rubber mallet to gently tap the door into place. Continue tapping gently on the top or bottom of the frame as needed until the door is plumb. A door is considered plumb when it is sitting perfectly vertically in the door frame."
                }
            ]
        },
        {
            "name": "Securing Your Door and Adding the Trim",
            "steps": [
                {
                    "headline": "Open the door and drill assembly screws through the frame.",
                    "description": "With your frame in place, use the handle to open the door. Set books or some other objects underneath the door to hold it open. Then, use your drill to run assembly screws through the prefabricated holes on the interior of your frame to attach it to your jambs. Start in the middle, then add the screws at the bottom. Next, add screws at the top before adding your remaining screws.Tip: Most PVC doors come with the screws needed for this portion of the installation process. If your door didn’t come with screws, use 2.5 in (6.4 cm) wood or concrete screws depending on what your jamb is made out of. If there aren’t prefabricated screws, install at least 5 screws in each jamb. Place one screw every 6–8 inches (15–20 cm)."
                },
                {
                    "headline": "Cut the excess shims off using a putty knife and mallet.",
                    "description": "With your door in place, portions of the wood shims are likely sticking out past the frame and jamb. To remove them, stick the edge of putty knife or chisel against the shim where it meets the frame at a 45-degree angle. Then, tap the back of the knife or chisel with a rubber mallet until the shims snap off in place. Repeat this process for every shim sticking out past the frame."
                },
                {
                    "headline": "Cut the trim to size if it isn’t prefabricated to fit your frame.",
                    "description": "Since jambs come in a variety of sizes, you probably have to cut the trim to size. Measure the distance between jambs for the top and each side of your frame. Then, transfer the measurements to the pieces of your trim and mark your cuts off with a grease pencil. Use a miter saw with a carbide-tip blade to cut your trim to size. Place each marked cut under the saw, turn it on, and slowly lower the blade over your cut. Wear gloves, protective eyewear, and a dust mask when cutting the PVC. Keep in mind, one set of trim is going to be shorter to compensate for the top or bottom. In other words, if the trim goes at the top goes all the way across the frame, the trim on the sides must be long enough to meet the trim at the top, not the jamb. You can also choose to miter the corners by cutting each end at an angle and fitting them together. If you don’t have a miter saw, you can use a handsaw. Your cuts may be slightly uneven if you use a handsaw, but you can always fill in the gaps with silicone caulk."
                },
                {
                    "headline": "Install the trim using PVC glue or adhesive sealant.",
                    "description": "Follow the manufacturer’s instructions regarding the required adhesive. In most cases, you’ll need PVC glue or some adhesive sealant that came with your door. Apply a bead of glue or adhesive to the back of your trim. Then, press your trim into doorway where the gap around the frame sits. Hold it in place for 20-30 seconds to set it in place. Repeat this process for the other 2 pieces of trim."
                },
                {
                    "headline": "Run silicone caulk around the frame of the door to finish the installation.",
                    "description": "To finish your installation, run a thin bead of silicone caulk around the trim where it meets the jamb to cover any gaps and keep air out. You can do this using a free hand and smooth it out with your finger, or run painter’s tape along the trim to keep it clean and get an even finish. Once you’re done, remove any remaining tape or plastic that was covering your door. Check the door by opening and closing it several times before finishing to make sure that it is opening and closing correctly."
                }
            ]
        }
    ],
    "tyn": [
        "PVC door",
        "Screwdriver",
        "Rubber mallet",
        "Chisel",
        "Handsaw",
        "Spirit level",
        "Caulk gun",
        "Silicone caulk",
        "Shims",
        "Drill",
        "Screws",
        "Putty knife",
        "PVC adhesive or sealant",
        "Miter saw"
    ],
    "text": " Removing the Door and Installing the Sill Remove your preexisting door by popping the hinge pins off if you’re replacing a door. Hold a flathead screwdriver under the hinge pin at the bottom of your door at a 45-degree angle. Tap the back of the screwdriver gently with a mallet or hammer until the pin comes loose. Then, pull it up by hand. Repeat this process for the other 2 hinges and lift the door out of the frame. You obviously don’t need to do this is there wasn’t a door in this location. Uninstall your old frame by unscrewing the hinges and prying it out if necessary. PVC doors come pre-hung, which means they’re already assembled in the frame. Remove your old frame if there is one by unscrewing the hinges from the jambs. Then, use a utility knife to cut along the seams where the frame meet the wall. Use a pry bar or chisel to pry the frame out and reveal the jambs. Use a nail remover to pull out the nails connecting the frame to the wall and rip the frame out. A jamb refers to the wood post that sits inside a doorway. It holds the weight of the door in place and is often covered by a frame. You do not need to do this if your door is hung directly on the jambs and there is no frame for it. This doesn’t need to be pretty. You’ll eventually cover this part of the door up with the trim for your PVC door. Set the sill in position at the base of the doorway and level it. The sill refers to the base of the door that sits in the frame. Set the sill down between the 2 vertical jambs and line the sides up with the center of your door. Put a spirit level on top of the door and check the air bubble to see if it’s level. If it isn’t, insert shims between the sill and the floor to adjust the level angle until it sits flat. Nail any shims into place using 1 inch (2.5 cm) nails.Tip: You may need to cut the sill depending on whether your sill was cut to size before you ordered it. To do this, measure the distance of the opening on the bottom of the door. Mark your cut on the sill after transferring the measurement. Use a hand saw to trim the sill down. Adhere the sill to the floor using a PVC sealant or screws. If you’re installing an exterior door, the bottom of the doorway is likely concrete and requires sealant. If it’s an interior door, it’s probably wood and can be secured with screws. For the sealant, use the manufacturer’s recommended adhesive to adhere the door to the floor. Apply a thick bead of the sealant across the middle of the sill and press it down. For wood floors, drill 2.5 in (6.4 cm) wood screws through the prefabricated slots in the sill. Use your spirit level to check the sill to make sure it’s level again before moving on. If the sill isn’t level, the door won’t be plumb. If it isn’t level, readjust the sill before the sealant dries. If you used screws, remove them and reposition shims before reinstalling the screws. Run a bead of silicone caulk along the rim where your door will sit. There is a raised, rectangular lip in the sill where the bottom frame of your door will sit. To ensure a tight fit and prevent air from coming in through this gap, apply a 1 in (2.5 cm) thick bead of silicone along the interior rim where this lip is located. This way, when you insert the frame into the doorway, the gap between the frame and the sill will be blocked. If you have a white door, use white caulk. For a black door, get black caulk. The frame may push some of the caulk out of the sill, but it won’t be noticeable if it’s the same color as the frame. Setting Your Door and Frame Remove the packaging and protective corners from your door. This step is different depending on how the manufacturer packaged your door. Typically, there are corner protectors that are screwed into the frame to prevent damage during shipment. Use a screwdriver or drill to remove these protectors. Then, peel the tape off of the edges of the frame where it will connect to the doorway. If you have any tape on the panels in the middle of the door, leave it on until you’re done installing the door. Assemble the handle if it isn’t already attached. You’re going to open and close the door several times while installing it in the doorway, so attach the handle if it isn’t already installed. While it depends on the style of your handle and the type of door you’ve ordered, the handle typically slides into prefabricated slots on the front of the door. On the frame of the handle, there are 2-4 screws. Screw the accompanying screws into the frame of the handle to secure it to the door. If you’re hanging an exterior door, the lock is already preassembled. The rest of the door assembly comes preassembled. Unlike wood doors where you can cut and install a lock and handle wherever you want, PVC is fairly difficult to cut without specialized tools. The manufacturer always does this part for you. Lift the door up and carefully slide it on top of the sill. This is much easier if you have a friend to help you brace the door from the other side, so get some help if you can. Orient the door so that it will open the direction you want it to. Then, pick the door up at a 15-degree angle and carefully slide the bottom of the frame into the slot on the sill. Gently and carefully slide the top of the door up while pulling the bottom of the frame into the sill. Hold the door and frame in place to brace it. Make sure that you double-check which direction the door will open before installing it. A door can open into a building or away from it. It’s totally up to you. Double-check the opening around the door to ensure you have space. Before moving forward, inspect the gap around the door frame on the sides and the top. There should be a 0.2–0.3 in (0.51–0.76 cm) gap between the new door frame and the jambs. If there isn’t a gap, the frame will have constant pressure put on it and may bend or break in the future. If the gap is too big, the frame may become loose and fall out of the doorway over time. If the gap is too big or small, install a new jamb to resize the doorway. If the gap is too big, you can use larger shims to hold the door in place, but the door will be more likely to break in the future. Use shims to hold the frame in the doorway. Get some 0.5–1 in (1.3–2.5 cm) shims. Starting in the middle of the vertical jambs, slide a shim in between the door frame and the jamb. Then, add a symmetrical shim on the opposite side of the frame. Repeat this process on the top and bottom portions of the jambs to secure the door. Continuously check the size of the gap between the jamb and the frame to ensure it stays 0.2–0.3 in (0.51–0.76 cm) while you apply the shims.Tip: This process is more of an art than a science. The goal is to apply enough shims to hold the door frame in place while maintaining your 0.2–0.3 in (0.51–0.76 cm) gap around the door frame. The shims create tension between the jambs and the frame to keep the door in place. Wood shims are soft enough that if serious pressure is applied to the door, it won’t break or bend. Make sure the door is plumb and use a mallet to make adjustments. Hold your spirit level vertically against the door to ensure that it is perfectly vertical. Use a rubber mallet to gently tap the door into place. Continue tapping gently on the top or bottom of the frame as needed until the door is plumb. A door is considered plumb when it is sitting perfectly vertically in the door frame. Securing Your Door and Adding the Trim Open the door and drill assembly screws through the frame. With your frame in place, use the handle to open the door. Set books or some other objects underneath the door to hold it open. Then, use your drill to run assembly screws through the prefabricated holes on the interior of your frame to attach it to your jambs. Start in the middle, then add the screws at the bottom. Next, add screws at the top before adding your remaining screws.Tip: Most PVC doors come with the screws needed for this portion of the installation process. If your door didn’t come with screws, use 2.5 in (6.4 cm) wood or concrete screws depending on what your jamb is made out of. If there aren’t prefabricated screws, install at least 5 screws in each jamb. Place one screw every 6–8 inches (15–20 cm). Cut the excess shims off using a putty knife and mallet. With your door in place, portions of the wood shims are likely sticking out past the frame and jamb. To remove them, stick the edge of putty knife or chisel against the shim where it meets the frame at a 45-degree angle. Then, tap the back of the knife or chisel with a rubber mallet until the shims snap off in place. Repeat this process for every shim sticking out past the frame. Cut the trim to size if it isn’t prefabricated to fit your frame. Since jambs come in a variety of sizes, you probably have to cut the trim to size. Measure the distance between jambs for the top and each side of your frame. Then, transfer the measurements to the pieces of your trim and mark your cuts off with a grease pencil. Use a miter saw with a carbide-tip blade to cut your trim to size. Place each marked cut under the saw, turn it on, and slowly lower the blade over your cut. Wear gloves, protective eyewear, and a dust mask when cutting the PVC. Keep in mind, one set of trim is going to be shorter to compensate for the top or bottom. In other words, if the trim goes at the top goes all the way across the frame, the trim on the sides must be long enough to meet the trim at the top, not the jamb. You can also choose to miter the corners by cutting each end at an angle and fitting them together. If you don’t have a miter saw, you can use a handsaw. Your cuts may be slightly uneven if you use a handsaw, but you can always fill in the gaps with silicone caulk. Install the trim using PVC glue or adhesive sealant. Follow the manufacturer’s instructions regarding the required adhesive. In most cases, you’ll need PVC glue or some adhesive sealant that came with your door. Apply a bead of glue or adhesive to the back of your trim. Then, press your trim into doorway where the gap around the frame sits. Hold it in place for 20-30 seconds to set it in place. Repeat this process for the other 2 pieces of trim. Run silicone caulk around the frame of the door to finish the installation. To finish your installation, run a thin bead of silicone caulk around the trim where it meets the jamb to cover any gaps and keep air out. You can do this using a free hand and smooth it out with your finger, or run painter’s tape along the trim to keep it clean and get an even finish. Once you’re done, remove any remaining tape or plastic that was covering your door. Check the door by opening and closing it several times before finishing to make sure that it is opening and closing correctly.",
    "sentences": [
        " Removing the Door and Installing the Sill Remove your preexisting door by popping the hinge pins off if you’re replacing a door.",
        "Hold a flathead screwdriver under the hinge pin at the bottom of your door at a 45-degree angle.",
        "Tap the back of the screwdriver gently with a mallet or hammer until the pin comes loose.",
        "Then, pull it up by hand.",
        "Repeat this process for the other 2 hinges and lift the door out of the frame.",
        "You obviously don’t need to do this is there wasn’t a door in this location.",
        "Uninstall your old frame by unscrewing the hinges and prying it out if necessary.",
        "PVC doors come pre-hung, which means they’re already assembled in the frame.",
        "Remove your old frame if there is one by unscrewing the hinges from the jambs.",
        "Then, use a utility knife to cut along the seams where the frame meet the wall.",
        "Use a pry bar or chisel to pry the frame out and reveal the jambs.",
        "Use a nail remover to pull out the nails connecting the frame to the wall and rip the frame out.",
        "A jamb refers to the wood post that sits inside a doorway.",
        "It holds the weight of the door in place and is often covered by a frame.",
        "You do not need to do this if your door is hung directly on the jambs and there is no frame for it.",
        "This doesn’t need to be pretty.",
        "You’ll eventually cover this part of the door up with the trim for your PVC door.",
        "Set the sill in position at the base of the doorway and level it.",
        "The sill refers to the base of the door that sits in the frame.",
        "Set the sill down between the 2 vertical jambs and line the sides up with the center of your door.",
        "Put a spirit level on top of the door and check the air bubble to see if it’s level.",
        "If it isn’t, insert shims between the sill and the floor to adjust the level angle until it sits flat.",
        "Nail any shims into place using 1 inch (2.5 cm) nails.Tip: You may need to cut the sill depending on whether your sill was cut to size before you ordered it.",
        "To do this, measure the distance of the opening on the bottom of the door.",
        "Mark your cut on the sill after transferring the measurement.",
        "Use a hand saw to trim the sill down.",
        "Adhere the sill to the floor using a PVC sealant or screws.",
        "If you’re installing an exterior door, the bottom of the doorway is likely concrete and requires sealant.",
        "If it’s an interior door, it’s probably wood and can be secured with screws.",
        "For the sealant, use the manufacturer’s recommended adhesive to adhere the door to the floor.",
        "Apply a thick bead of the sealant across the middle of the sill and press it down.",
        "For wood floors, drill 2.5 in (6.4 cm) wood screws through the prefabricated slots in the sill.",
        "Use your spirit level to check the sill to make sure it’s level again before moving on.",
        "If the sill isn’t level, the door won’t be plumb.",
        "If it isn’t level, readjust the sill before the sealant dries.",
        "If you used screws, remove them and reposition shims before reinstalling the screws.",
        "Run a bead of silicone caulk along the rim where your door will sit.",
        "There is a raised, rectangular lip in the sill where the bottom frame of your door will sit.",
        "To ensure a tight fit and prevent air from coming in through this gap, apply a 1 in (2.5 cm) thick bead of silicone along the interior rim where this lip is located.",
        "This way, when you insert the frame into the doorway, the gap between the frame and the sill will be blocked.",
        "If you have a white door, use white caulk.",
        "For a black door, get black caulk.",
        "The frame may push some of the caulk out of the sill, but it won’t be noticeable if it’s the same color as the frame.",
        "Setting Your Door and Frame Remove the packaging and protective corners from your door.",
        "This step is different depending on how the manufacturer packaged your door.",
        "Typically, there are corner protectors that are screwed into the frame to prevent damage during shipment.",
        "Use a screwdriver or drill to remove these protectors.",
        "Then, peel the tape off of the edges of the frame where it will connect to the doorway.",
        "If you have any tape on the panels in the middle of the door, leave it on until you’re done installing the door.",
        "Assemble the handle if it isn’t already attached.",
        "You’re going to open and close the door several times while installing it in the doorway, so attach the handle if it isn’t already installed.",
        "While it depends on the style of your handle and the type of door you’ve ordered, the handle typically slides into prefabricated slots on the front of the door.",
        "On the frame of the handle, there are 2-4 screws.",
        "Screw the accompanying screws into the frame of the handle to secure it to the door.",
        "If you’re hanging an exterior door, the lock is already preassembled.",
        "The rest of the door assembly comes preassembled.",
        "Unlike wood doors where you can cut and install a lock and handle wherever you want, PVC is fairly difficult to cut without specialized tools.",
        "The manufacturer always does this part for you.",
        "Lift the door up and carefully slide it on top of the sill.",
        "This is much easier if you have a friend to help you brace the door from the other side, so get some help if you can.",
        "Orient the door so that it will open the direction you want it to.",
        "Then, pick the door up at a 15-degree angle and carefully slide the bottom of the frame into the slot on the sill.",
        "Gently and carefully slide the top of the door up while pulling the bottom of the frame into the sill.",
        "Hold the door and frame in place to brace it.",
        "Make sure that you double-check which direction the door will open before installing it.",
        "A door can open into a building or away from it.",
        "It’s totally up to you.",
        "Double-check the opening around the door to ensure you have space.",
        "Before moving forward, inspect the gap around the door frame on the sides and the top.",
        "There should be a 0.2–0.3 in (0.51–0.76 cm) gap between the new door frame and the jambs.",
        "If there isn’t a gap, the frame will have constant pressure put on it and may bend or break in the future.",
        "If the gap is too big, the frame may become loose and fall out of the doorway over time.",
        "If the gap is too big or small, install a new jamb to resize the doorway.",
        "If the gap is too big, you can use larger shims to hold the door in place, but the door will be more likely to break in the future.",
        "Use shims to hold the frame in the doorway.",
        "Get some 0.5–1 in (1.3–2.5 cm) shims.",
        "Starting in the middle of the vertical jambs, slide a shim in between the door frame and the jamb.",
        "Then, add a symmetrical shim on the opposite side of the frame.",
        "Repeat this process on the top and bottom portions of the jambs to secure the door.",
        "Continuously check the size of the gap between the jamb and the frame to ensure it stays 0.2–0.3 in (0.51–0.76 cm) while you apply the shims.Tip: This process is more of an art than a science.",
        "The goal is to apply enough shims to hold the door frame in place while maintaining your 0.2–0.3 in (0.51–0.76 cm) gap around the door frame.",
        "The shims create tension between the jambs and the frame to keep the door in place.",
        "Wood shims are soft enough that if serious pressure is applied to the door, it won’t break or bend.",
        "Make sure the door is plumb and use a mallet to make adjustments.",
        "Hold your spirit level vertically against the door to ensure that it is perfectly vertical.",
        "Use a rubber mallet to gently tap the door into place.",
        "Continue tapping gently on the top or bottom of the frame as needed until the door is plumb.",
        "A door is considered plumb when it is sitting perfectly vertically in the door frame.",
        "Securing Your Door and Adding the Trim Open the door and drill assembly screws through the frame.",
        "With your frame in place, use the handle to open the door.",
        "Set books or some other objects underneath the door to hold it open.",
        "Then, use your drill to run assembly screws through the prefabricated holes on the interior of your frame to attach it to your jambs.",
        "Start in the middle, then add the screws at the bottom.",
        "Next, add screws at the top before adding your remaining screws.Tip: Most PVC doors come with the screws needed for this portion of the installation process.",
        "If your door didn’t come with screws, use 2.5 in (6.4 cm) wood or concrete screws depending on what your jamb is made out of.",
        "If there aren’t prefabricated screws, install at least 5 screws in each jamb.",
        "Place one screw every 6–8 inches (15–20 cm).",
        "Cut the excess shims off using a putty knife and mallet.",
        "With your door in place, portions of the wood shims are likely sticking out past the frame and jamb.",
        "To remove them, stick the edge of putty knife or chisel against the shim where it meets the frame at a 45-degree angle.",
        "Then, tap the back of the knife or chisel with a rubber mallet until the shims snap off in place.",
        "Repeat this process for every shim sticking out past the frame.",
        "Cut the trim to size if it isn’t prefabricated to fit your frame.",
        "Since jambs come in a variety of sizes, you probably have to cut the trim to size.",
        "Measure the distance between jambs for the top and each side of your frame.",
        "Then, transfer the measurements to the pieces of your trim and mark your cuts off with a grease pencil.",
        "Use a miter saw with a carbide-tip blade to cut your trim to size.",
        "Place each marked cut under the saw, turn it on, and slowly lower the blade over your cut.",
        "Wear gloves, protective eyewear, and a dust mask when cutting the PVC.",
        "Keep in mind, one set of trim is going to be shorter to compensate for the top or bottom.",
        "In other words, if the trim goes at the top goes all the way across the frame, the trim on the sides must be long enough to meet the trim at the top, not the jamb.",
        "You can also choose to miter the corners by cutting each end at an angle and fitting them together.",
        "If you don’t have a miter saw, you can use a handsaw.",
        "Your cuts may be slightly uneven if you use a handsaw, but you can always fill in the gaps with silicone caulk.",
        "Install the trim using PVC glue or adhesive sealant.",
        "Follow the manufacturer’s instructions regarding the required adhesive.",
        "In most cases, you’ll need PVC glue or some adhesive sealant that came with your door.",
        "Apply a bead of glue or adhesive to the back of your trim.",
        "Then, press your trim into doorway where the gap around the frame sits.",
        "Hold it in place for 20-30 seconds to set it in place.",
        "Repeat this process for the other 2 pieces of trim.",
        "Run silicone caulk around the frame of the door to finish the installation.",
        "To finish your installation, run a thin bead of silicone caulk around the trim where it meets the jamb to cover any gaps and keep air out.",
        "You can do this using a free hand and smooth it out with your finger, or run painter’s tape along the trim to keep it clean and get an even finish.",
        "Once you’re done, remove any remaining tape or plastic that was covering your door.",
        "Check the door by opening and closing it several times before finishing to make sure that it is opening and closing correctly."
    ]
}