{
    "title": "How to Grow Cordyceps",
    "url": "https://www.wikihow.com/Grow-Cordyceps",
    "category_hierarchy": [
        "Health",
        "Nutrition and Food Health",
        "Dietary Nutrients",
        "Dietary Supplements"
    ],
    "methods": [
        {
            "name": "Inoculating Grains with Cordyceps Spores",
            "steps": [
                {
                    "headline": "Purchase cordyceps inoculating fluid online.",
                    "description": "Cordyceps inoculating fluids contain spores that are ready for planting. Search for an inoculating fluid that’s shipped to your region. It’s easier to get it if you’re in China or India, but it’s also available in other parts of the world. You can buy cordyceps inoculating fluid or spores from a medicinal company, research company, or someone who grows cordyceps.Did You Know? Since cordyceps are native to the Chinese provinces of Tibet, Qinghai, Sichuan, and Yunnan, it's difficult to get fruiting bodies on your cordyceps outside of that region. Fruiting bodies are the most potent part of the mushroom. However, you can likely grow mycelium, the vegetative part of cordyceps, which may provide the benefits you want."
                },
                {
                    "headline": "Add 50 grams of your grain substrate to a pint-sized jar.",
                    "description": "Substrate is the material or surface that a plant grows on, in this case grains. Use a pint-sized Mason jar to hold your substrate because it provides a healthy environment for growing cordyceps. Measure out 50 grams (1.8 oz) of your grain of choice, then pour it into your jar. Good options for grain substrate include:\nBrown rice\nStandard millet\nGerman millet\nIndian millet\nChinese barley\nStandard barley\nBlack riceTip: Brown rice is considered the best grain substrate for cordyceps."
                },
                {
                    "headline": "Mix 60 mL (2.0  fl oz) of distilled water into the grain.",
                    "description": "Use a measuring spoon or syringe to measure out 60 mL (2.0  fl oz) of distilled water. Then, add the water to your substrate. Cover the jar with a lid and shake it to combine the grain and water. It’s best to use distilled water because it won’t have impurities. Tap water can contain chemicals and microbes that may affect your cordyceps."
                },
                {
                    "headline": "Sterilize your substrate by baking it in a pan for 20 minutes at 121 °C (250 °F).",
                    "description": "Sterilizing your substrate helps keep your crop pure. Preheat your oven to 121 °C (250 °F). Pour your substrate into a clean baking dish, then place the dish in the preheated oven. Set a timer for 20 minutes and remove the pan when the timer goes off. It’s not safe to bake a jar, so don’t sterilize your substrate in the jar."
                },
                {
                    "headline": "Pour the substrate back into your jar after it cools.",
                    "description": "Leave the substrate to cool for 30 minutes to an hour. Then, carefully transfer the substrate to the jar. If necessary, use a clean spoon to help the substrate slide out of the pan and into the jar. The substrate shouldn’t be hard after you heat it, but it may be thicker and lumpier."
                },
                {
                    "headline": "Put 20 mL (0.68  fl oz) of inoculating fluid into the substrate.",
                    "description": "Read the instructions that came with your inoculating fluid so you know how it’s supposed to be used. Open your inoculating fluid and add it to your substrate. It’s okay to put it on the surface because you’ll mix it in by shaking the jar. Your inoculating fluid will likely come pre-measured, so you shouldn’t have to worry about measuring it."
                },
                {
                    "headline": "Cover the jar and shake it to mix the inoculating fluid into the substrate.",
                    "description": "Screw the lid back on the jar so you won’t spill any of your substrate. Then, shake the jar for 3-5 minutes to mix the inoculating fluid into the substrate. Once they’re mixed, remove the lid from the jar. Mixing the inoculating fluid into the substrate will help your cultures grow."
                },
                {
                    "headline": "Introduce insect larvae to your substrate for potent cordyceps.",
                    "description": "While you can try to grow cordyceps without insect larvae, they’re less likely to grow in grains alone. This type of fungi feeds off of a host, so you’re more likely to get a crop if you incorporate larvae into the substrate. Choose a type of insect larvae that you can obtain in your area. Then, purchase it online or collect the larvae in nature. Ghost moth larvae are typically the host insect for cordyceps. However, you might also use silkworm pupa or caterpillars. Ground up silkworm pupa is also an option. You can buy these online. While they’ll likely arrive dead, they can still be a food source for the cordyceps. If you want to harvest larvae, you might check leaves, branches, and the ground for caterpillars. Put the caterpillars in a container and then transfer them to your substrate, along with fresh leaves. Replenish the leaves often so your caterpillars have a food supply."
                }
            ]
        },
        {
            "name": "Setting up a Cordyceps Grow-Kit",
            "steps": [
                {
                    "headline": "Purchase a grow-kit online for an easy option.",
                    "description": "Using a grow-kit is a convenient way to grow cordyceps because it comes with everything you need. Kits are available for purchase online. Read the details carefully to find out what the kit contains and what size crop you can expect. Pick a kit that fits your preferences. You can find kits starting at around $25."
                },
                {
                    "headline": "Pour the substrate in your kit into the container provided.",
                    "description": "Pull out the substrate and jar or tube provided in your kit. Remove the lid from the container and open the substrate package. Then, carefully drop the substrate into the jar or tube. Kits may provide different types of substrate. You might receive grains, soil, or ground up insect larvae."
                },
                {
                    "headline": "Add the cordyceps spores or inoculation liquid to the substrate.",
                    "description": "Read your kit’s instructions for inserting the spores or liquid into the substrate. Open the cordyceps spores or inoculation liquid that came in your kit. Then, spread the spores or inoculation liquid over the substrate. Always follow the instructions that came with your kit so you’re more likely to get the results you expect."
                },
                {
                    "headline": "Cover and shake the container to mix the cordyceps into the substrate.",
                    "description": "Put the lid back on the jar or tube that came with your kit. Then, shake the container for 3-5 minutes to combine the cordyceps spores or inoculating fluid with the substrate. If your kit’s instructions have different instructions, always follow them to make sure your spores or inoculating fluid are properly mixed into the substrate."
                }
            ]
        },
        {
            "name": "Tending the Cordyceps",
            "steps": [
                {
                    "headline": "Give the substrate continuous light and 70-80% humidity.",
                    "description": "Place the jar or tube under a grow light or lamp. Then, place a humidity meter on the container or nearby to monitor the room humidity. If you need to raise the humidity, spray the container with water. If the humidity is too high, turn on a dehumidifier to reduce it. You can purchase a humidity meter online, at a pet store, or at a gardening store. You can purchase a dehumidifier at a department store, home improvement store, or online.Variation: Some experts recommend alternating between light and darkness. Instead of giving your cordyceps continuous light, turn on the light for 16 hours and provide 8 hours of darkness."
                },
                {
                    "headline": "Keep the container at 20 °C (68 °F) so the cordyceps can grow.",
                    "description": "Place a thermometer near the jar or tube so you can monitor the temperature. Then, set the room temperature at around 20 °C (68 °F) if possible. To cool the area, turn on a fan and aim it at your plant. If it’s too cold, use a heat lamp or small space heater to warm the area around your container. The temperature is very important for growing cordyceps. Make sure it stays within a few degrees of 20 °C (68 °F). Otherwise, your crop may not grow or could be stunted."
                },
                {
                    "headline": "Allow your cordyceps to incubate for 60 days.",
                    "description": "Leave your cordyceps undisturbed while they’re growing. You will likely notice sprouts within 2 weeks of planting your cordyceps. Expect them to reach their full maturity in about 60 days. It’s okay to occasionally spray your cordyceps with water if you live in a low humidity area. Otherwise, don’t worry about tending to them."
                },
                {
                    "headline": "Harvest your cordyceps when they reach the top of the jar or after 60 days.",
                    "description": "Your cordyceps likely won’t grow taller than the top of your jar, so pick them when they reach the lip of the jar. Some cordyceps won’t reach the top of the jar, so go ahead and harvest them when they’ve been growing for 60 days. Harvest them by plucking them from the substrate. Keep in mind that cordyceps won’t have a second crop, so you don’t need to worry about destroying the root systems. If you’re using a kit, check the instructions to find out when the manufacturer recommends harvesting the cordyceps."
                }
            ]
        }
    ],
    "tyn": [
        "Inoculating Grains with Cordyceps Spores",
        "Cordyceps inoculating fluid",
        "Pint-sized jar",
        "Grain, such as brown rice, standard millet, German millet, Indian millet, Chinese barley, standard barley, or brown rice",
        "Measuring spoon or syringe",
        "Distilled water",
        "Baking pan",
        "Spoon (optional)",
        "Insect larvae (optional)",
        "Setting up a Cordyceps Grow-Kit",
        "Cordyceps Grow-Kit",
        "Tending the Cordyceps",
        "Grow light or lamp",
        "Humidity meter",
        "Spray bottle (optional)",
        "Dehumidifier (optional)",
        "Thermometer"
    ],
    "text": " Inoculating Grains with Cordyceps Spores Purchase cordyceps inoculating fluid online. Cordyceps inoculating fluids contain spores that are ready for planting. Search for an inoculating fluid that’s shipped to your region. It’s easier to get it if you’re in China or India, but it’s also available in other parts of the world. You can buy cordyceps inoculating fluid or spores from a medicinal company, research company, or someone who grows cordyceps.Did You Know? Since cordyceps are native to the Chinese provinces of Tibet, Qinghai, Sichuan, and Yunnan, it's difficult to get fruiting bodies on your cordyceps outside of that region. Fruiting bodies are the most potent part of the mushroom. However, you can likely grow mycelium, the vegetative part of cordyceps, which may provide the benefits you want. Add 50 grams of your grain substrate to a pint-sized jar. Substrate is the material or surface that a plant grows on, in this case grains. Use a pint-sized Mason jar to hold your substrate because it provides a healthy environment for growing cordyceps. Measure out 50 grams (1.8 oz) of your grain of choice, then pour it into your jar. Good options for grain substrate include:\nBrown rice\nStandard millet\nGerman millet\nIndian millet\nChinese barley\nStandard barley\nBlack riceTip: Brown rice is considered the best grain substrate for cordyceps. Mix 60 mL (2.0  fl oz) of distilled water into the grain. Use a measuring spoon or syringe to measure out 60 mL (2.0  fl oz) of distilled water. Then, add the water to your substrate. Cover the jar with a lid and shake it to combine the grain and water. It’s best to use distilled water because it won’t have impurities. Tap water can contain chemicals and microbes that may affect your cordyceps. Sterilize your substrate by baking it in a pan for 20 minutes at 121 °C (250 °F). Sterilizing your substrate helps keep your crop pure. Preheat your oven to 121 °C (250 °F). Pour your substrate into a clean baking dish, then place the dish in the preheated oven. Set a timer for 20 minutes and remove the pan when the timer goes off. It’s not safe to bake a jar, so don’t sterilize your substrate in the jar. Pour the substrate back into your jar after it cools. Leave the substrate to cool for 30 minutes to an hour. Then, carefully transfer the substrate to the jar. If necessary, use a clean spoon to help the substrate slide out of the pan and into the jar. The substrate shouldn’t be hard after you heat it, but it may be thicker and lumpier. Put 20 mL (0.68  fl oz) of inoculating fluid into the substrate. Read the instructions that came with your inoculating fluid so you know how it’s supposed to be used. Open your inoculating fluid and add it to your substrate. It’s okay to put it on the surface because you’ll mix it in by shaking the jar. Your inoculating fluid will likely come pre-measured, so you shouldn’t have to worry about measuring it. Cover the jar and shake it to mix the inoculating fluid into the substrate. Screw the lid back on the jar so you won’t spill any of your substrate. Then, shake the jar for 3-5 minutes to mix the inoculating fluid into the substrate. Once they’re mixed, remove the lid from the jar. Mixing the inoculating fluid into the substrate will help your cultures grow. Introduce insect larvae to your substrate for potent cordyceps. While you can try to grow cordyceps without insect larvae, they’re less likely to grow in grains alone. This type of fungi feeds off of a host, so you’re more likely to get a crop if you incorporate larvae into the substrate. Choose a type of insect larvae that you can obtain in your area. Then, purchase it online or collect the larvae in nature. Ghost moth larvae are typically the host insect for cordyceps. However, you might also use silkworm pupa or caterpillars. Ground up silkworm pupa is also an option. You can buy these online. While they’ll likely arrive dead, they can still be a food source for the cordyceps. If you want to harvest larvae, you might check leaves, branches, and the ground for caterpillars. Put the caterpillars in a container and then transfer them to your substrate, along with fresh leaves. Replenish the leaves often so your caterpillars have a food supply. Setting up a Cordyceps Grow-Kit Purchase a grow-kit online for an easy option. Using a grow-kit is a convenient way to grow cordyceps because it comes with everything you need. Kits are available for purchase online. Read the details carefully to find out what the kit contains and what size crop you can expect. Pick a kit that fits your preferences. You can find kits starting at around $25. Pour the substrate in your kit into the container provided. Pull out the substrate and jar or tube provided in your kit. Remove the lid from the container and open the substrate package. Then, carefully drop the substrate into the jar or tube. Kits may provide different types of substrate. You might receive grains, soil, or ground up insect larvae. Add the cordyceps spores or inoculation liquid to the substrate. Read your kit’s instructions for inserting the spores or liquid into the substrate. Open the cordyceps spores or inoculation liquid that came in your kit. Then, spread the spores or inoculation liquid over the substrate. Always follow the instructions that came with your kit so you’re more likely to get the results you expect. Cover and shake the container to mix the cordyceps into the substrate. Put the lid back on the jar or tube that came with your kit. Then, shake the container for 3-5 minutes to combine the cordyceps spores or inoculating fluid with the substrate. If your kit’s instructions have different instructions, always follow them to make sure your spores or inoculating fluid are properly mixed into the substrate. Tending the Cordyceps Give the substrate continuous light and 70-80% humidity. Place the jar or tube under a grow light or lamp. Then, place a humidity meter on the container or nearby to monitor the room humidity. If you need to raise the humidity, spray the container with water. If the humidity is too high, turn on a dehumidifier to reduce it. You can purchase a humidity meter online, at a pet store, or at a gardening store. You can purchase a dehumidifier at a department store, home improvement store, or online.Variation: Some experts recommend alternating between light and darkness. Instead of giving your cordyceps continuous light, turn on the light for 16 hours and provide 8 hours of darkness. Keep the container at 20 °C (68 °F) so the cordyceps can grow. Place a thermometer near the jar or tube so you can monitor the temperature. Then, set the room temperature at around 20 °C (68 °F) if possible. To cool the area, turn on a fan and aim it at your plant. If it’s too cold, use a heat lamp or small space heater to warm the area around your container. The temperature is very important for growing cordyceps. Make sure it stays within a few degrees of 20 °C (68 °F). Otherwise, your crop may not grow or could be stunted. Allow your cordyceps to incubate for 60 days. Leave your cordyceps undisturbed while they’re growing. You will likely notice sprouts within 2 weeks of planting your cordyceps. Expect them to reach their full maturity in about 60 days. It’s okay to occasionally spray your cordyceps with water if you live in a low humidity area. Otherwise, don’t worry about tending to them. Harvest your cordyceps when they reach the top of the jar or after 60 days. Your cordyceps likely won’t grow taller than the top of your jar, so pick them when they reach the lip of the jar. Some cordyceps won’t reach the top of the jar, so go ahead and harvest them when they’ve been growing for 60 days. Harvest them by plucking them from the substrate. Keep in mind that cordyceps won’t have a second crop, so you don’t need to worry about destroying the root systems. If you’re using a kit, check the instructions to find out when the manufacturer recommends harvesting the cordyceps.",
    "sentences": [
        " Inoculating Grains with Cordyceps Spores Purchase cordyceps inoculating fluid online.",
        "Cordyceps inoculating fluids contain spores that are ready for planting.",
        "Search for an inoculating fluid that’s shipped to your region.",
        "It’s easier to get it if you’re in China or India, but it’s also available in other parts of the world.",
        "You can buy cordyceps inoculating fluid or spores from a medicinal company, research company, or someone who grows cordyceps.Did You Know?",
        "Since cordyceps are native to the Chinese provinces of Tibet, Qinghai, Sichuan, and Yunnan, it's difficult to get fruiting bodies on your cordyceps outside of that region.",
        "Fruiting bodies are the most potent part of the mushroom.",
        "However, you can likely grow mycelium, the vegetative part of cordyceps, which may provide the benefits you want.",
        "Add 50 grams of your grain substrate to a pint-sized jar.",
        "Substrate is the material or surface that a plant grows on, in this case grains.",
        "Use a pint-sized Mason jar to hold your substrate because it provides a healthy environment for growing cordyceps.",
        "Measure out 50 grams (1.8 oz) of your grain of choice, then pour it into your jar.",
        "Good options for grain substrate include:\nBrown rice\nStandard millet\nGerman millet\nIndian millet\nChinese barley\nStandard barley\nBlack riceTip: Brown rice is considered the best grain substrate for cordyceps.",
        "Mix 60 mL (2.0  fl oz) of distilled water into the grain.",
        "Use a measuring spoon or syringe to measure out 60 mL (2.0  fl oz) of distilled water.",
        "Then, add the water to your substrate.",
        "Cover the jar with a lid and shake it to combine the grain and water.",
        "It’s best to use distilled water because it won’t have impurities.",
        "Tap water can contain chemicals and microbes that may affect your cordyceps.",
        "Sterilize your substrate by baking it in a pan for 20 minutes at 121 °C (250 °F).",
        "Sterilizing your substrate helps keep your crop pure.",
        "Preheat your oven to 121 °C (250 °F).",
        "Pour your substrate into a clean baking dish, then place the dish in the preheated oven.",
        "Set a timer for 20 minutes and remove the pan when the timer goes off.",
        "It’s not safe to bake a jar, so don’t sterilize your substrate in the jar.",
        "Pour the substrate back into your jar after it cools.",
        "Leave the substrate to cool for 30 minutes to an hour.",
        "Then, carefully transfer the substrate to the jar.",
        "If necessary, use a clean spoon to help the substrate slide out of the pan and into the jar.",
        "The substrate shouldn’t be hard after you heat it, but it may be thicker and lumpier.",
        "Put 20 mL (0.68  fl oz) of inoculating fluid into the substrate.",
        "Read the instructions that came with your inoculating fluid so you know how it’s supposed to be used.",
        "Open your inoculating fluid and add it to your substrate.",
        "It’s okay to put it on the surface because you’ll mix it in by shaking the jar.",
        "Your inoculating fluid will likely come pre-measured, so you shouldn’t have to worry about measuring it.",
        "Cover the jar and shake it to mix the inoculating fluid into the substrate.",
        "Screw the lid back on the jar so you won’t spill any of your substrate.",
        "Then, shake the jar for 3-5 minutes to mix the inoculating fluid into the substrate.",
        "Once they’re mixed, remove the lid from the jar.",
        "Mixing the inoculating fluid into the substrate will help your cultures grow.",
        "Introduce insect larvae to your substrate for potent cordyceps.",
        "While you can try to grow cordyceps without insect larvae, they’re less likely to grow in grains alone.",
        "This type of fungi feeds off of a host, so you’re more likely to get a crop if you incorporate larvae into the substrate.",
        "Choose a type of insect larvae that you can obtain in your area.",
        "Then, purchase it online or collect the larvae in nature.",
        "Ghost moth larvae are typically the host insect for cordyceps.",
        "However, you might also use silkworm pupa or caterpillars.",
        "Ground up silkworm pupa is also an option.",
        "You can buy these online.",
        "While they’ll likely arrive dead, they can still be a food source for the cordyceps.",
        "If you want to harvest larvae, you might check leaves, branches, and the ground for caterpillars.",
        "Put the caterpillars in a container and then transfer them to your substrate, along with fresh leaves.",
        "Replenish the leaves often so your caterpillars have a food supply.",
        "Setting up a Cordyceps Grow-Kit Purchase a grow-kit online for an easy option.",
        "Using a grow-kit is a convenient way to grow cordyceps because it comes with everything you need.",
        "Kits are available for purchase online.",
        "Read the details carefully to find out what the kit contains and what size crop you can expect.",
        "Pick a kit that fits your preferences.",
        "You can find kits starting at around $25.",
        "Pour the substrate in your kit into the container provided.",
        "Pull out the substrate and jar or tube provided in your kit.",
        "Remove the lid from the container and open the substrate package.",
        "Then, carefully drop the substrate into the jar or tube.",
        "Kits may provide different types of substrate.",
        "You might receive grains, soil, or ground up insect larvae.",
        "Add the cordyceps spores or inoculation liquid to the substrate.",
        "Read your kit’s instructions for inserting the spores or liquid into the substrate.",
        "Open the cordyceps spores or inoculation liquid that came in your kit.",
        "Then, spread the spores or inoculation liquid over the substrate.",
        "Always follow the instructions that came with your kit so you’re more likely to get the results you expect.",
        "Cover and shake the container to mix the cordyceps into the substrate.",
        "Put the lid back on the jar or tube that came with your kit.",
        "Then, shake the container for 3-5 minutes to combine the cordyceps spores or inoculating fluid with the substrate.",
        "If your kit’s instructions have different instructions, always follow them to make sure your spores or inoculating fluid are properly mixed into the substrate.",
        "Tending the Cordyceps Give the substrate continuous light and 70-80% humidity.",
        "Place the jar or tube under a grow light or lamp.",
        "Then, place a humidity meter on the container or nearby to monitor the room humidity.",
        "If you need to raise the humidity, spray the container with water.",
        "If the humidity is too high, turn on a dehumidifier to reduce it.",
        "You can purchase a humidity meter online, at a pet store, or at a gardening store.",
        "You can purchase a dehumidifier at a department store, home improvement store, or online.Variation: Some experts recommend alternating between light and darkness.",
        "Instead of giving your cordyceps continuous light, turn on the light for 16 hours and provide 8 hours of darkness.",
        "Keep the container at 20 °C (68 °F) so the cordyceps can grow.",
        "Place a thermometer near the jar or tube so you can monitor the temperature.",
        "Then, set the room temperature at around 20 °C (68 °F) if possible.",
        "To cool the area, turn on a fan and aim it at your plant.",
        "If it’s too cold, use a heat lamp or small space heater to warm the area around your container.",
        "The temperature is very important for growing cordyceps.",
        "Make sure it stays within a few degrees of 20 °C (68 °F).",
        "Otherwise, your crop may not grow or could be stunted.",
        "Allow your cordyceps to incubate for 60 days.",
        "Leave your cordyceps undisturbed while they’re growing.",
        "You will likely notice sprouts within 2 weeks of planting your cordyceps.",
        "Expect them to reach their full maturity in about 60 days.",
        "It’s okay to occasionally spray your cordyceps with water if you live in a low humidity area.",
        "Otherwise, don’t worry about tending to them.",
        "Harvest your cordyceps when they reach the top of the jar or after 60 days.",
        "Your cordyceps likely won’t grow taller than the top of your jar, so pick them when they reach the lip of the jar.",
        "Some cordyceps won’t reach the top of the jar, so go ahead and harvest them when they’ve been growing for 60 days.",
        "Harvest them by plucking them from the substrate.",
        "Keep in mind that cordyceps won’t have a second crop, so you don’t need to worry about destroying the root systems.",
        "If you’re using a kit, check the instructions to find out when the manufacturer recommends harvesting the cordyceps."
    ]
}