{
    "title": "How to Measure a Conga Head",
    "url": "https://www.wikihow.com/Measure-a-Conga-Head",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "Percussion",
        "Drums"
    ],
    "methods": [
        {
            "name": "Measuring Different Parts of a Conga",
            "steps": [
                {
                    "headline": "Find the playing surface diameter if the congo head is attached.",
                    "description": "The flat area of the congo drum head is the playing surface. Center the ruler or tape measure flat across the widest part of the drum and check the measurement in inches. For example, if the conga head’s playing surface measures 10.5 in (27 cm), this is the replacement size you’ll need.Tip: Congos have a flat area on top with a sloping, crimped edge along the sides, but don’t include these crimped edges in your measurement."
                },
                {
                    "headline": "Check the diameter of the bearing edge if the head is missing.",
                    "description": "The bearing edge is at the top ⁄4 in (0.64 cm) of the drum shell. Find this part of the congo if there’s no drum head on the shell. Hold a ruler or measuring tape against the bearing edge and center it across the widest part of the drum to find the diameter. Record the measurement so you can buy the correct replacement size later on. The shell is the hard outer part of the congo that the drum head attaches onto."
                },
                {
                    "headline": "Measure the conga's hoop rim if you don’t mind removing it.",
                    "description": "Unscrew or unlatch the conga hoop rim. Place a ruler or tape measure across the widest section of the hoop rim and record the diameter. This will give you the replacement conga head size. For example, if the hoop rim measures 11 in (28 cm), then you will need a replacement conga head in this size."
                }
            ]
        },
        {
            "name": "Choosing Your Replacement Conga Head",
            "steps": [
                {
                    "headline": "Use the diameter measurement to find the correct size.",
                    "description": "The measurement of the conga head’s playing surface, hoop rim, or bearing edge in inches indicates the conga head size you’ll need. Use the measurement you recorded to find a suitable replacement conga head. For example, if the conga head’s playing surface, hoop rim, or bearing edge measures 11.5 in (29 cm), then you’ll need a replacement head in this size. Some conga head manufacturers have specific drum head sizes depending on the type of drum you have. Consult the manufacturer’s website for replacement size recommendations if you know who made your drum.Did you know? A standard conga head measures between 11–11.5 in (28–29 cm). Sizes outside this range are also considered conga drums, but they go by different names: tumbadora and quinto. The tumbadora measures 12 to 12.5 in (30 to 32 cm), and the quinto measures 10 to 10.5 in (25 to 27 cm)."
                },
                {
                    "headline": "Opt for an animal skin conga head for the best quality and sound.",
                    "description": "Although they’re more expensive, animal skin drum heads are known for their warmth and high quality sound, so get an animal skin conga head replacement if possible. Animal skin drum heads will shrink and stretch with changes in the weather, so make sure to protect your conga from the elements as much as possible. Calfskin is the most commonly used animal skin used for conga drum heads. Other animal skins, such as mule and goat skin, are no longer used because they are so much thicker and produce a lower quality sound."
                },
                {
                    "headline": "Go with a plastic conga head for more volume and stability.",
                    "description": "Plastic conga heads are less expensive and tend to have higher, brighter tones. They are also much less likely to stretch or shrink with changes in the weather, so this might be a good option if you live in a climate with lots of fluctuations."
                }
            ]
        }
    ],
    "tyn": [
        "Ruler or measuring tape"
    ],
    "text": " Measuring Different Parts of a Conga Find the playing surface diameter if the congo head is attached. The flat area of the congo drum head is the playing surface. Center the ruler or tape measure flat across the widest part of the drum and check the measurement in inches. For example, if the conga head’s playing surface measures 10.5 in (27 cm), this is the replacement size you’ll need.Tip: Congos have a flat area on top with a sloping, crimped edge along the sides, but don’t include these crimped edges in your measurement. Check the diameter of the bearing edge if the head is missing. The bearing edge is at the top ⁄4 in (0.64 cm) of the drum shell. Find this part of the congo if there’s no drum head on the shell. Hold a ruler or measuring tape against the bearing edge and center it across the widest part of the drum to find the diameter. Record the measurement so you can buy the correct replacement size later on. The shell is the hard outer part of the congo that the drum head attaches onto. Measure the conga's hoop rim if you don’t mind removing it. Unscrew or unlatch the conga hoop rim. Place a ruler or tape measure across the widest section of the hoop rim and record the diameter. This will give you the replacement conga head size. For example, if the hoop rim measures 11 in (28 cm), then you will need a replacement conga head in this size. Choosing Your Replacement Conga Head Use the diameter measurement to find the correct size. The measurement of the conga head’s playing surface, hoop rim, or bearing edge in inches indicates the conga head size you’ll need. Use the measurement you recorded to find a suitable replacement conga head. For example, if the conga head’s playing surface, hoop rim, or bearing edge measures 11.5 in (29 cm), then you’ll need a replacement head in this size. Some conga head manufacturers have specific drum head sizes depending on the type of drum you have. Consult the manufacturer’s website for replacement size recommendations if you know who made your drum.Did you know? A standard conga head measures between 11–11.5 in (28–29 cm). Sizes outside this range are also considered conga drums, but they go by different names: tumbadora and quinto. The tumbadora measures 12 to 12.5 in (30 to 32 cm), and the quinto measures 10 to 10.5 in (25 to 27 cm). Opt for an animal skin conga head for the best quality and sound. Although they’re more expensive, animal skin drum heads are known for their warmth and high quality sound, so get an animal skin conga head replacement if possible. Animal skin drum heads will shrink and stretch with changes in the weather, so make sure to protect your conga from the elements as much as possible. Calfskin is the most commonly used animal skin used for conga drum heads. Other animal skins, such as mule and goat skin, are no longer used because they are so much thicker and produce a lower quality sound. Go with a plastic conga head for more volume and stability. Plastic conga heads are less expensive and tend to have higher, brighter tones. They are also much less likely to stretch or shrink with changes in the weather, so this might be a good option if you live in a climate with lots of fluctuations.",
    "sentences": [
        " Measuring Different Parts of a Conga Find the playing surface diameter if the congo head is attached.",
        "The flat area of the congo drum head is the playing surface.",
        "Center the ruler or tape measure flat across the widest part of the drum and check the measurement in inches.",
        "For example, if the conga head’s playing surface measures 10.5 in (27 cm), this is the replacement size you’ll need.Tip: Congos have a flat area on top with a sloping, crimped edge along the sides, but don’t include these crimped edges in your measurement.",
        "Check the diameter of the bearing edge if the head is missing.",
        "The bearing edge is at the top ⁄4 in (0.64 cm) of the drum shell.",
        "Find this part of the congo if there’s no drum head on the shell.",
        "Hold a ruler or measuring tape against the bearing edge and center it across the widest part of the drum to find the diameter.",
        "Record the measurement so you can buy the correct replacement size later on.",
        "The shell is the hard outer part of the congo that the drum head attaches onto.",
        "Measure the conga's hoop rim if you don’t mind removing it.",
        "Unscrew or unlatch the conga hoop rim.",
        "Place a ruler or tape measure across the widest section of the hoop rim and record the diameter.",
        "This will give you the replacement conga head size.",
        "For example, if the hoop rim measures 11 in (28 cm), then you will need a replacement conga head in this size.",
        "Choosing Your Replacement Conga Head Use the diameter measurement to find the correct size.",
        "The measurement of the conga head’s playing surface, hoop rim, or bearing edge in inches indicates the conga head size you’ll need.",
        "Use the measurement you recorded to find a suitable replacement conga head.",
        "For example, if the conga head’s playing surface, hoop rim, or bearing edge measures 11.5 in (29 cm), then you’ll need a replacement head in this size.",
        "Some conga head manufacturers have specific drum head sizes depending on the type of drum you have.",
        "Consult the manufacturer’s website for replacement size recommendations if you know who made your drum.Did you know?",
        "A standard conga head measures between 11–11.5 in (28–29 cm).",
        "Sizes outside this range are also considered conga drums, but they go by different names: tumbadora and quinto.",
        "The tumbadora measures 12 to 12.5 in (30 to 32 cm), and the quinto measures 10 to 10.5 in (25 to 27 cm).",
        "Opt for an animal skin conga head for the best quality and sound.",
        "Although they’re more expensive, animal skin drum heads are known for their warmth and high quality sound, so get an animal skin conga head replacement if possible.",
        "Animal skin drum heads will shrink and stretch with changes in the weather, so make sure to protect your conga from the elements as much as possible.",
        "Calfskin is the most commonly used animal skin used for conga drum heads.",
        "Other animal skins, such as mule and goat skin, are no longer used because they are so much thicker and produce a lower quality sound.",
        "Go with a plastic conga head for more volume and stability.",
        "Plastic conga heads are less expensive and tend to have higher, brighter tones.",
        "They are also much less likely to stretch or shrink with changes in the weather, so this might be a good option if you live in a climate with lots of fluctuations."
    ]
}