{
    "title": "How to Write a Metal Riff",
    "url": "https://www.wikihow.com/Write-a-Metal-Riff",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "String Instruments",
        "Guitar"
    ],
    "steps": [
        {
            "headline": "Learn to palm mute.",
            "description": "This will make the sound that makes heavy metal sound heavy. If your guitar is in standard tuning (EBGDAE) play an Em with palm muting. Just play the first three strings (EAD). Example: The bridge on Raining Blood by Slayer."
        },
        {
            "headline": "Learn how to play power chords.",
            "description": "Without them this will be useless. They give another heavy sound in the song. Power chords on the low E string sound great. Most metal songs use power chords, so it's basic. A great simple power chord progression is: Milk by Anthrax."
        },
        {
            "headline": "Add single notes in the space between chords.",
            "description": "It will sound great, awesome and heavy. Example: Harvester of Sorrow by Metallica."
        },
        {
            "headline": "Play single note riffs.",
            "description": "This will be more complicated but after you're in the right position you'll make it. Example: Master of Puppets by Metallica, Washington is Next! by Megadeth."
        },
        {
            "headline": "Downtune your guitar.",
            "description": "The rhythm is the important thing, not the heaviness. In the 80's The Big Four didn't downtune their guitars. But, it makes playing easier. Some good downtunings are Open G, Drop D & Drop C. The Drop C gives a kinda mystical tone. Bands that use a lot of downtunings are System Of A Down (Drop C), Disturbed (Drop C, Drop D and others), Rise Against (Drop D) & Dream Theater's John Petrucci uses a different tuning for each song."
        },
        {
            "headline": "Build up your solo technique.",
            "description": "You'll need these techniques: Sweep Picking, Bends, Vibratos, Tremolo Picking, Tapping, Slides, Hammer Ons, Pull-Offs, Thrills, String Skipping and if you want a little Zakk Wylde use some Pinch Harmonics. To get the hang of the soloing learn solos by Metallica (Master of Puppets album), Megadeth (Countdown to Extinction album), Slayer(Reign In Blood album), Anthrax & Dream Theater."
        },
        {
            "headline": "Practice scales to work on your technique and speed.",
            "description": "You have to use scales, and working on them makes you a better all-around player. Just go up and down the scale slowly at first, then try to incorporate scales into your playing."
        },
        {
            "headline": "Use alternate picking.",
            "description": "Just pick up and down."
        },
        {
            "headline": "For more rhythmic variety, experiment with triplets.",
            "description": "They sound cool, they're fast and help your alternate picking. Try muting the triplets. Example: Disposable Heroes by Metallica."
        },
        {
            "headline": "Use scales like harmonic minor, melodic minor, diminished etc.",
            "description": "Heavy metal doesn't have any rules. If you want to make your songs heavy and dark use the above said scales. Harmonic minor gives a middle eastern feel, but you don't have to stick to a one scale. For a melodic sound use the minor scale."
        }
    ],
    "tyn": [
        "Picks",
        "Electric guitar",
        "Whammy Bar",
        "Amp",
        "Master Of Puppets by Metallica IS A MUST HAVE.",
        "Strings",
        "Tuner",
        "Distortion Pedal (Optional)"
    ],
    "text": " Learn to palm mute. This will make the sound that makes heavy metal sound heavy. If your guitar is in standard tuning (EBGDAE) play an Em with palm muting. Just play the first three strings (EAD). Example: The bridge on Raining Blood by Slayer. Learn how to play power chords. Without them this will be useless. They give another heavy sound in the song. Power chords on the low E string sound great. Most metal songs use power chords, so it's basic. A great simple power chord progression is: Milk by Anthrax. Add single notes in the space between chords. It will sound great, awesome and heavy. Example: Harvester of Sorrow by Metallica. Play single note riffs. This will be more complicated but after you're in the right position you'll make it. Example: Master of Puppets by Metallica, Washington is Next! by Megadeth. Downtune your guitar. The rhythm is the important thing, not the heaviness. In the 80's The Big Four didn't downtune their guitars. But, it makes playing easier. Some good downtunings are Open G, Drop D & Drop C. The Drop C gives a kinda mystical tone. Bands that use a lot of downtunings are System Of A Down (Drop C), Disturbed (Drop C, Drop D and others), Rise Against (Drop D) & Dream Theater's John Petrucci uses a different tuning for each song. Build up your solo technique. You'll need these techniques: Sweep Picking, Bends, Vibratos, Tremolo Picking, Tapping, Slides, Hammer Ons, Pull-Offs, Thrills, String Skipping and if you want a little Zakk Wylde use some Pinch Harmonics. To get the hang of the soloing learn solos by Metallica (Master of Puppets album), Megadeth (Countdown to Extinction album), Slayer(Reign In Blood album), Anthrax & Dream Theater. Practice scales to work on your technique and speed. You have to use scales, and working on them makes you a better all-around player. Just go up and down the scale slowly at first, then try to incorporate scales into your playing. Use alternate picking. Just pick up and down. For more rhythmic variety, experiment with triplets. They sound cool, they're fast and help your alternate picking. Try muting the triplets. Example: Disposable Heroes by Metallica. Use scales like harmonic minor, melodic minor, diminished etc. Heavy metal doesn't have any rules. If you want to make your songs heavy and dark use the above said scales. Harmonic minor gives a middle eastern feel, but you don't have to stick to a one scale. For a melodic sound use the minor scale.",
    "sentences": [
        " Learn to palm mute.",
        "This will make the sound that makes heavy metal sound heavy.",
        "If your guitar is in standard tuning (EBGDAE) play an Em with palm muting.",
        "Just play the first three strings (EAD).",
        "Example: The bridge on Raining Blood by Slayer.",
        "Learn how to play power chords.",
        "Without them this will be useless.",
        "They give another heavy sound in the song.",
        "Power chords on the low E string sound great.",
        "Most metal songs use power chords, so it's basic.",
        "A great simple power chord progression is: Milk by Anthrax.",
        "Add single notes in the space between chords.",
        "It will sound great, awesome and heavy.",
        "Example: Harvester of Sorrow by Metallica.",
        "Play single note riffs.",
        "This will be more complicated but after you're in the right position you'll make it.",
        "Example: Master of Puppets by Metallica, Washington is Next!",
        "by Megadeth.",
        "Downtune your guitar.",
        "The rhythm is the important thing, not the heaviness.",
        "In the 80's The Big Four didn't downtune their guitars.",
        "But, it makes playing easier.",
        "Some good downtunings are Open G, Drop D & Drop C. The Drop C gives a kinda mystical tone.",
        "Bands that use a lot of downtunings are System Of A Down (Drop C), Disturbed (Drop C, Drop D and others), Rise Against (Drop D) & Dream Theater's John Petrucci uses a different tuning for each song.",
        "Build up your solo technique.",
        "You'll need these techniques: Sweep Picking, Bends, Vibratos, Tremolo Picking, Tapping, Slides, Hammer Ons, Pull-Offs, Thrills, String Skipping and if you want a little Zakk Wylde use some Pinch Harmonics.",
        "To get the hang of the soloing learn solos by Metallica (Master of Puppets album), Megadeth (Countdown to Extinction album), Slayer(Reign In Blood album), Anthrax & Dream Theater.",
        "Practice scales to work on your technique and speed.",
        "You have to use scales, and working on them makes you a better all-around player.",
        "Just go up and down the scale slowly at first, then try to incorporate scales into your playing.",
        "Use alternate picking.",
        "Just pick up and down.",
        "For more rhythmic variety, experiment with triplets.",
        "They sound cool, they're fast and help your alternate picking.",
        "Try muting the triplets.",
        "Example: Disposable Heroes by Metallica.",
        "Use scales like harmonic minor, melodic minor, diminished etc.",
        "Heavy metal doesn't have any rules.",
        "If you want to make your songs heavy and dark use the above said scales.",
        "Harmonic minor gives a middle eastern feel, but you don't have to stick to a one scale.",
        "For a melodic sound use the minor scale."
    ]
}