{
    "title": "How to Paint Outdoor Plastic",
    "url": "https://www.wikihow.com/Paint-Outdoor-Plastic",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "parts": [
        {
            "name": "Cleaning and Sanding the Plastic",
            "steps": [
                {
                    "headline": "Wipe down the plastic surface with mineral spirits or rubbing alcohol.",
                    "description": "Moisten a clean rag with mineral spirits or rubbing alcohol. Scrub the plastic thoroughly with the rag to remove dirt and residue from the surface.Tip: You can use this method to safely paint most types of outdoor plastic including patio furniture, flower pots, and even plastic outdoor toys. Consider painting outdoor plastic to save and continue to use it rather than recycling it or taking it to the landfill. This will also help break down any sealants on the plastic if it happens to be a new item that you are going to paint. Make sure to do this outside or in a well-ventilated area with windows and doors open to avoid breathing in the fumes."
                },
                {
                    "headline": "Sand the item lightly using fine-grit sandpaper.",
                    "description": "Use sandpaper that is 220-grit or even finer so you don’t scratch the plastic. Rub the sandpaper all over the surface of the item using your hand or a sanding block until you rough up the whole surface. You don’t need to worry about doing a perfect job and getting into every nook and cranny. Just try to give the item a quick once over of all the easy-to-reach smooth surfaces to help the paint stick when you spray paint it."
                },
                {
                    "headline": "Wipe away dust from sanding with a wet cloth.",
                    "description": "Wet a rag with water from a tap or hose and wring it out so it isn’t dripping. Use the wet rag to wipe down the plastic item thoroughly to clean it off. If the item is fairly large, such as a lawn chair, you could also rinse it off with a hose. Just keep in mind it will take longer to dry if you use this method, so you will have to wait longer to paint it."
                },
                {
                    "headline": "Let the plastic air dry completely before painting it.",
                    "description": "Leave the item to dry for 15-30 minutes when you finish cleaning it. Check that it is dry to the touch before proceeding to paint the plastic. If there are any droplets of water remaining on the plastic, you can wipe them up with a dry towel to speed up the process."
                }
            ]
        },
        {
            "name": "Applying Spray Paint",
            "steps": [
                {
                    "headline": "Cover your work area with a drop sheet to protect against paint splatter.",
                    "description": "Choose a well-ventilated area to work in, such as a yard or a garage with the door open. Lay down a plastic sheet, tarp, or other type of drop cloth to protect the ground while you spray paint. If you don’t have a large drop sheet, you can create a work surface by taping together several unfolded cardboard boxes or laying down 2-3 overlapping layers of newspaper. Always work in a well-ventilated area when you spray paint something to avoid breathing in the fumes. You can also wear a respirator if the fumes are strong."
                },
                {
                    "headline": "Tape off any parts of the plastic item you don’t want to paint.",
                    "description": "Use blue painter’s tape or masking tape. Stretch out strips of tape over large, relatively flat areas you want to protect and press them flat against the plastic. Wrap pieces of tape around odd-shaped parts of the item. Always overlap the tape on areas you protect so there is no exposed plastic.Tip: You can also use tape to create patterns if you want to paint the plastic with multiple colors or with different designs. For example, if you’re painting a plastic lawn chair, you could tape off the top half at an angle, then paint it a different color later to create a funky 2-tone chair. If you need to cover large areas, you can tape plastic over them rather than covering them with individual pieces of tape."
                },
                {
                    "headline": "Use a spray paint formulated specifically for plastic.",
                    "description": "Choose a spray paint that is made for plastic so it sticks to the surface and withstands the elements better. Brands that make this type of spray paint include Rust-Oleum and Krylon. Some spray paints are made for multiple types of surfaces. Read different cans closely when you’re shopping for spray paint to find one that says it can be used on plastic. It doesn’t have to specify that it is for outdoor surfaces. As long as you use a spray paint meant for plastic, you don’t need to prime the plastic and you won’t need to apply a lot of coats to get good coverage."
                },
                {
                    "headline": "Turn the item you want to paint upside down on the drop sheet.",
                    "description": "Flip the plastic item upside down in order to begin painting it from the bottom side. Place it in the center of your protected work area. Starting from the bottom gives you a chance to practice spraying on the paint on an area that isn’t that noticeable. That way, you’ll have the hang of it by the time you flip the item over to spray the other side."
                },
                {
                    "headline": "Spray a coat of paint onto the bottom of the item using a side-to-side motion.",
                    "description": "Shake the can vigorously up and down for 5-10 seconds and hold the spray nozzle about 6–10 in (15–25 cm) away from the item. Press down on the cap to start spraying and move your arm back and forth in sweeping motions back and forth across the entire bottom surface until you cover it with 1 thin coat of paint. If there are any areas you missed or where the coverage looks uneven, wait 1-3 minutes for the paint to start drying, then go back over those areas using quick side-to-side motions."
                },
                {
                    "headline": "Flip the item over once the paint is dry.",
                    "description": "Let the paint dry for 20-30 minutes, or longer if the spray paint can states that it has a longer drying time. Turn the item right-side-up when the paint is dry to the touch. Most spray paints for plastic, including those made by Krylon and Rust-Oleum, state that they are dry in under 30 minutes."
                },
                {
                    "headline": "Apply a coat of paint to the rest of the item using sweeping strokes.",
                    "description": "Shake the spray can up and down for 5-10 seconds before each coat. Press the cap down while holding the nozzle 6–10 in (15–25 cm) away from the plastic surface and move your arm back and forth non-stop with controlled, steady strokes until you cover the entire top side of the item in a thin, even coat of paint. Keep the spray can moving at all times to avoid spraying on too thick of a coat. If the paint is too thick, it will take longer to dry and can have a lumpy texture. It’s better to spray on multiple thin coats to get good, even coverage."
                },
                {
                    "headline": "Spray on additional coats of paint until you get solid coverage.",
                    "description": "Wait 20-30 minutes between each coat and remember to shake the can after it has been sitting. Apply a second, third, and maybe fourth coat to the top side of the item as needed until the color looks solid and the texture is smooth all over. If you taped off any areas before you started painting, remove the tape carefully as soon as you finish applying the last coat of paint."
                }
            ]
        }
    ],
    "tyn": [
        "Mineral spirits or rubbing alcohol",
        "Fine-grit sandpaper",
        "Clean rags",
        "Drop sheet",
        "Plastic spray paint",
        "Painter’s tape or masking tape"
    ],
    "text": " Cleaning and Sanding the Plastic Wipe down the plastic surface with mineral spirits or rubbing alcohol. Moisten a clean rag with mineral spirits or rubbing alcohol. Scrub the plastic thoroughly with the rag to remove dirt and residue from the surface.Tip: You can use this method to safely paint most types of outdoor plastic including patio furniture, flower pots, and even plastic outdoor toys. Consider painting outdoor plastic to save and continue to use it rather than recycling it or taking it to the landfill. This will also help break down any sealants on the plastic if it happens to be a new item that you are going to paint. Make sure to do this outside or in a well-ventilated area with windows and doors open to avoid breathing in the fumes. Sand the item lightly using fine-grit sandpaper. Use sandpaper that is 220-grit or even finer so you don’t scratch the plastic. Rub the sandpaper all over the surface of the item using your hand or a sanding block until you rough up the whole surface. You don’t need to worry about doing a perfect job and getting into every nook and cranny. Just try to give the item a quick once over of all the easy-to-reach smooth surfaces to help the paint stick when you spray paint it. Wipe away dust from sanding with a wet cloth. Wet a rag with water from a tap or hose and wring it out so it isn’t dripping. Use the wet rag to wipe down the plastic item thoroughly to clean it off. If the item is fairly large, such as a lawn chair, you could also rinse it off with a hose. Just keep in mind it will take longer to dry if you use this method, so you will have to wait longer to paint it. Let the plastic air dry completely before painting it. Leave the item to dry for 15-30 minutes when you finish cleaning it. Check that it is dry to the touch before proceeding to paint the plastic. If there are any droplets of water remaining on the plastic, you can wipe them up with a dry towel to speed up the process. Applying Spray Paint Cover your work area with a drop sheet to protect against paint splatter. Choose a well-ventilated area to work in, such as a yard or a garage with the door open. Lay down a plastic sheet, tarp, or other type of drop cloth to protect the ground while you spray paint. If you don’t have a large drop sheet, you can create a work surface by taping together several unfolded cardboard boxes or laying down 2-3 overlapping layers of newspaper. Always work in a well-ventilated area when you spray paint something to avoid breathing in the fumes. You can also wear a respirator if the fumes are strong. Tape off any parts of the plastic item you don’t want to paint. Use blue painter’s tape or masking tape. Stretch out strips of tape over large, relatively flat areas you want to protect and press them flat against the plastic. Wrap pieces of tape around odd-shaped parts of the item. Always overlap the tape on areas you protect so there is no exposed plastic.Tip: You can also use tape to create patterns if you want to paint the plastic with multiple colors or with different designs. For example, if you’re painting a plastic lawn chair, you could tape off the top half at an angle, then paint it a different color later to create a funky 2-tone chair. If you need to cover large areas, you can tape plastic over them rather than covering them with individual pieces of tape. Use a spray paint formulated specifically for plastic. Choose a spray paint that is made for plastic so it sticks to the surface and withstands the elements better. Brands that make this type of spray paint include Rust-Oleum and Krylon. Some spray paints are made for multiple types of surfaces. Read different cans closely when you’re shopping for spray paint to find one that says it can be used on plastic. It doesn’t have to specify that it is for outdoor surfaces. As long as you use a spray paint meant for plastic, you don’t need to prime the plastic and you won’t need to apply a lot of coats to get good coverage. Turn the item you want to paint upside down on the drop sheet. Flip the plastic item upside down in order to begin painting it from the bottom side. Place it in the center of your protected work area. Starting from the bottom gives you a chance to practice spraying on the paint on an area that isn’t that noticeable. That way, you’ll have the hang of it by the time you flip the item over to spray the other side. Spray a coat of paint onto the bottom of the item using a side-to-side motion. Shake the can vigorously up and down for 5-10 seconds and hold the spray nozzle about 6–10 in (15–25 cm) away from the item. Press down on the cap to start spraying and move your arm back and forth in sweeping motions back and forth across the entire bottom surface until you cover it with 1 thin coat of paint. If there are any areas you missed or where the coverage looks uneven, wait 1-3 minutes for the paint to start drying, then go back over those areas using quick side-to-side motions. Flip the item over once the paint is dry. Let the paint dry for 20-30 minutes, or longer if the spray paint can states that it has a longer drying time. Turn the item right-side-up when the paint is dry to the touch. Most spray paints for plastic, including those made by Krylon and Rust-Oleum, state that they are dry in under 30 minutes. Apply a coat of paint to the rest of the item using sweeping strokes. Shake the spray can up and down for 5-10 seconds before each coat. Press the cap down while holding the nozzle 6–10 in (15–25 cm) away from the plastic surface and move your arm back and forth non-stop with controlled, steady strokes until you cover the entire top side of the item in a thin, even coat of paint. Keep the spray can moving at all times to avoid spraying on too thick of a coat. If the paint is too thick, it will take longer to dry and can have a lumpy texture. It’s better to spray on multiple thin coats to get good, even coverage. Spray on additional coats of paint until you get solid coverage. Wait 20-30 minutes between each coat and remember to shake the can after it has been sitting. Apply a second, third, and maybe fourth coat to the top side of the item as needed until the color looks solid and the texture is smooth all over. If you taped off any areas before you started painting, remove the tape carefully as soon as you finish applying the last coat of paint.",
    "sentences": [
        " Cleaning and Sanding the Plastic Wipe down the plastic surface with mineral spirits or rubbing alcohol.",
        "Moisten a clean rag with mineral spirits or rubbing alcohol.",
        "Scrub the plastic thoroughly with the rag to remove dirt and residue from the surface.Tip: You can use this method to safely paint most types of outdoor plastic including patio furniture, flower pots, and even plastic outdoor toys.",
        "Consider painting outdoor plastic to save and continue to use it rather than recycling it or taking it to the landfill.",
        "This will also help break down any sealants on the plastic if it happens to be a new item that you are going to paint.",
        "Make sure to do this outside or in a well-ventilated area with windows and doors open to avoid breathing in the fumes.",
        "Sand the item lightly using fine-grit sandpaper.",
        "Use sandpaper that is 220-grit or even finer so you don’t scratch the plastic.",
        "Rub the sandpaper all over the surface of the item using your hand or a sanding block until you rough up the whole surface.",
        "You don’t need to worry about doing a perfect job and getting into every nook and cranny.",
        "Just try to give the item a quick once over of all the easy-to-reach smooth surfaces to help the paint stick when you spray paint it.",
        "Wipe away dust from sanding with a wet cloth.",
        "Wet a rag with water from a tap or hose and wring it out so it isn’t dripping.",
        "Use the wet rag to wipe down the plastic item thoroughly to clean it off.",
        "If the item is fairly large, such as a lawn chair, you could also rinse it off with a hose.",
        "Just keep in mind it will take longer to dry if you use this method, so you will have to wait longer to paint it.",
        "Let the plastic air dry completely before painting it.",
        "Leave the item to dry for 15-30 minutes when you finish cleaning it.",
        "Check that it is dry to the touch before proceeding to paint the plastic.",
        "If there are any droplets of water remaining on the plastic, you can wipe them up with a dry towel to speed up the process.",
        "Applying Spray Paint Cover your work area with a drop sheet to protect against paint splatter.",
        "Choose a well-ventilated area to work in, such as a yard or a garage with the door open.",
        "Lay down a plastic sheet, tarp, or other type of drop cloth to protect the ground while you spray paint.",
        "If you don’t have a large drop sheet, you can create a work surface by taping together several unfolded cardboard boxes or laying down 2-3 overlapping layers of newspaper.",
        "Always work in a well-ventilated area when you spray paint something to avoid breathing in the fumes.",
        "You can also wear a respirator if the fumes are strong.",
        "Tape off any parts of the plastic item you don’t want to paint.",
        "Use blue painter’s tape or masking tape.",
        "Stretch out strips of tape over large, relatively flat areas you want to protect and press them flat against the plastic.",
        "Wrap pieces of tape around odd-shaped parts of the item.",
        "Always overlap the tape on areas you protect so there is no exposed plastic.Tip: You can also use tape to create patterns if you want to paint the plastic with multiple colors or with different designs.",
        "For example, if you’re painting a plastic lawn chair, you could tape off the top half at an angle, then paint it a different color later to create a funky 2-tone chair.",
        "If you need to cover large areas, you can tape plastic over them rather than covering them with individual pieces of tape.",
        "Use a spray paint formulated specifically for plastic.",
        "Choose a spray paint that is made for plastic so it sticks to the surface and withstands the elements better.",
        "Brands that make this type of spray paint include Rust-Oleum and Krylon.",
        "Some spray paints are made for multiple types of surfaces.",
        "Read different cans closely when you’re shopping for spray paint to find one that says it can be used on plastic.",
        "It doesn’t have to specify that it is for outdoor surfaces.",
        "As long as you use a spray paint meant for plastic, you don’t need to prime the plastic and you won’t need to apply a lot of coats to get good coverage.",
        "Turn the item you want to paint upside down on the drop sheet.",
        "Flip the plastic item upside down in order to begin painting it from the bottom side.",
        "Place it in the center of your protected work area.",
        "Starting from the bottom gives you a chance to practice spraying on the paint on an area that isn’t that noticeable.",
        "That way, you’ll have the hang of it by the time you flip the item over to spray the other side.",
        "Spray a coat of paint onto the bottom of the item using a side-to-side motion.",
        "Shake the can vigorously up and down for 5-10 seconds and hold the spray nozzle about 6–10 in (15–25 cm) away from the item.",
        "Press down on the cap to start spraying and move your arm back and forth in sweeping motions back and forth across the entire bottom surface until you cover it with 1 thin coat of paint.",
        "If there are any areas you missed or where the coverage looks uneven, wait 1-3 minutes for the paint to start drying, then go back over those areas using quick side-to-side motions.",
        "Flip the item over once the paint is dry.",
        "Let the paint dry for 20-30 minutes, or longer if the spray paint can states that it has a longer drying time.",
        "Turn the item right-side-up when the paint is dry to the touch.",
        "Most spray paints for plastic, including those made by Krylon and Rust-Oleum, state that they are dry in under 30 minutes.",
        "Apply a coat of paint to the rest of the item using sweeping strokes.",
        "Shake the spray can up and down for 5-10 seconds before each coat.",
        "Press the cap down while holding the nozzle 6–10 in (15–25 cm) away from the plastic surface and move your arm back and forth non-stop with controlled, steady strokes until you cover the entire top side of the item in a thin, even coat of paint.",
        "Keep the spray can moving at all times to avoid spraying on too thick of a coat.",
        "If the paint is too thick, it will take longer to dry and can have a lumpy texture.",
        "It’s better to spray on multiple thin coats to get good, even coverage.",
        "Spray on additional coats of paint until you get solid coverage.",
        "Wait 20-30 minutes between each coat and remember to shake the can after it has been sitting.",
        "Apply a second, third, and maybe fourth coat to the top side of the item as needed until the color looks solid and the texture is smooth all over.",
        "If you taped off any areas before you started painting, remove the tape carefully as soon as you finish applying the last coat of paint."
    ]
}