{
    "title": "How to Make Bhapa Pithas",
    "url": "https://www.wikihow.com/Make-Bhapa-Pithas",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes"
    ],
    "parts": [
        {
            "name": "Making the \"Wet-Sand\" Rice Mixture",
            "steps": [
                {
                    "headline": "Make homemade rice flour.",
                    "description": "Take the 2.5 cups of white rice and wash thoroughly with cold water. Soak the rice in a bowl of room temperature overnight (or at least for 7-8 hours). Transfer the soaked rice to a cloth or baking rack and spread the rice evenly. Place the rice in a warm, dry area and allow it to dry completely. Take the rice and grind it down to a coarse powder once it's dry. Do this in either a grinder or a food processor. Sift the flour into a clean bowl so that there are no big clumps in the flour. As an alternative, you can use store bought rice flour. Take two cups of store bought rice flour and grind it in either a grinder or food processor to make sure it is a coarse powder. Sift the flour into a clean bowl so that there are no big clumps in the flour."
                },
                {
                    "headline": "Add 1 teaspoon of salt to your bowl of sifted rice flour.",
                    "description": "Mix thoroughly."
                },
                {
                    "headline": "Take cup of either warm milk or warm water and add about 1 tablespoon (15 ml) to the rice flour.",
                    "description": "Mix thoroughly. Keep adding the warm water or milk to the flour, mixing thoroughly in between additions. You want to continue to do this until the rice flour has a “wet sand” type of consistency. You want the rice flour to be moist, but not so wet that it combines together and becomes a homogeneous dough. You want the rice flour to be able to somewhat crumble. There should not be any dry flour left in the bowl and the rice should be able to take shape when you squeeze it in your hand."
                },
                {
                    "headline": "Set the mixture aside in a room temperature area.",
                    "description": "Cover the moist rice flour mixture with a towel or piece of cloth for about 30-60 minutes. This will give the flour time to absorb the water or milk. While you are resting the flour mixture, take a separate bowl and fill it with water and soak your cheese or cotton cloths."
                },
                {
                    "headline": "Re-sift the rice flour mixture.",
                    "description": "Take the moist rice flour mixture and mix it around with either your hand or a spoon. Make sure that the mixture is the right consistency and that the mixture is not too wet after allowing the flour to absorb the water or milk. If it is, gradually add more rice flour until it is the right consistency (coarse and able to hold shape, but not like wet batter or homogeneous dough). After the consistency is right, sift the mixture through a sifter/strainer. You might have to push the moist mixture through the sifter/strainer with your hand in order to sift it all the way through."
                }
            ]
        },
        {
            "name": "Preparing the Pitha",
            "steps": [
                {
                    "headline": "Prepare your steamer.",
                    "description": "There are three types of steamers described below:\nIf you're using a homemade steamer, fill half of a saucepan with water and tightly cover the top with two layers of aluminum so that any vapor cannot escape. Afterwards, take a fork and poke a few holes in the aluminum foil in the center. When the pithas are ready for cooking, bring your homemade steamer to the stove and bring the water in your saucepan steamer to a boil. If using a bamboo steamer, line the layer you are going to put the pithas in with lettuce or cloth so that the pithas do not stick to the bamboo. Fill a pot with about 3 inches (8 cm) of water and let it come to a simmer. Make sure that you bamboo steamer either sits on top of the pot or fits snugly in the pot over the water line. Once you are ready to steam the pithas, place them in the bamboo steamer, place that over/in the pot. Add 2–3 inches (5.1–7.6 cm) of water to the pot if you see if starting to dry out. If using a rice cooker, fill your rice cooker to the halfway point with water. Close the rice cooker and turn it on to medium to high heat, allowing the water inside to boil. When you are ready to cook the pithas, open the rice cooker,  place a sifter or colander on top of the rice cooker, and place the pithas on top of the colander or sifter, allowing the steam to reach the pitha."
                },
                {
                    "headline": "Create the base.",
                    "description": "Take a small bowl, about the size of your palm or a little smaller, and pack your rice mixture in. You only want to pack it in until it is half full."
                },
                {
                    "headline": "Fill the pitha.",
                    "description": "After packing the base, you are ready to put in the filling. Taking about 2 tablespoons (30 ml) of coconut flakes, place them into the center of the bowl, over your base (you can use less/more than 2 tablespoon based on your preference). Afterwards, add about 3 tablespoons (44 ml) of jaggery (grate it to make it like flakes) or date molasses (amount is based on personal preference). Then add another layer of coconut flakes."
                },
                {
                    "headline": "Top the pitha.",
                    "description": "After putting your fillings insider of the pita, add more rice mixture to the bowl in order to cover your filling completely and create a type of “jaggery & coconut” sandwich. You want to pack it tightly together so the filling stays put in the middle and the pitha will not fall apart when you take it out of the bowl."
                }
            ]
        },
        {
            "name": "Cooking the Pitha",
            "steps": [
                {
                    "headline": "Put the pitha in a cloth.",
                    "description": "Take your cheese or cotton cloths out of the bowl of water they were soaking in and wring them out so that they are damp, not soaking or wet. Spread the cloth over the small bowl with your pitha in it. Holding the corners of your cloth up, slowly flip the small bowl over so that the cloth is now at the bottom. Gently tap the bottom of the bowl until your bhapa pitha unmolds itself from the bowl and into the cloth."
                },
                {
                    "headline": "Cook the pitha.",
                    "description": "Take the damp cloth and wrap it so that it takes the shape of your bhapa pitha. You want to wrap it tightly enough that your pitha is secure, but not so tightly that the cloth will stick and get stuck to your bhapa pitha. Afterwards, take your cloth covered pitha and place it in your steamer (whichever one you may be using). You want to steam your bhapa pitha for about 5-8 minutes."
                },
                {
                    "headline": "Unwrap the pitha.",
                    "description": "After allowing the bhapa pitha to steam for 5-8 minutes, take it out (with the cloth still around the actual pitha) using a ladle or tongs. Using a spatula, very gently pry the bhapa pitha from the warm cloth and put the bhapa pitha on a plate. Place the warm cloth back into the bowl and allow it to soak until you are ready to make and cook your next bhapa pitha."
                },
                {
                    "headline": "Serve the bhapa pithas while they are still warm and fresh and the inside filling is soft.",
                    "description": "If your bhapa pitha becomes cold, simply wrap it back up in a damp cloth and put it in your steamer for about 2-3 minutes in order to reheat and become fresh again. You may serve the bhapa pitha with a side of date syrup to dip it in or eat it alone. Enjoy your rightfully earned sweet treat!"
                }
            ]
        }
    ],
    "tyn": [
        "Bamboo steamer (alternatives include rice cooker or saucepan & aluminum foil)",
        "Cheese cloth (alternative: a thin, clean cotton cloth)",
        "Mixing bowl",
        "Grinder/food processor",
        "Measuring spoons (teaspoon and tablespoon)",
        "Measuring cups",
        "Small souffle bowls/small tins/small dish (to shape the bhapa pithas)",
        "Sifter",
        "Aluminum foil (for homemade steamer)",
        "Ladle or tongs"
    ],
    "text": " Making the \"Wet-Sand\" Rice Mixture Make homemade rice flour. Take the 2.5 cups of white rice and wash thoroughly with cold water. Soak the rice in a bowl of room temperature overnight (or at least for 7-8 hours). Transfer the soaked rice to a cloth or baking rack and spread the rice evenly. Place the rice in a warm, dry area and allow it to dry completely. Take the rice and grind it down to a coarse powder once it's dry. Do this in either a grinder or a food processor. Sift the flour into a clean bowl so that there are no big clumps in the flour. As an alternative, you can use store bought rice flour. Take two cups of store bought rice flour and grind it in either a grinder or food processor to make sure it is a coarse powder. Sift the flour into a clean bowl so that there are no big clumps in the flour. Add 1 teaspoon of salt to your bowl of sifted rice flour. Mix thoroughly. Take cup of either warm milk or warm water and add about 1 tablespoon (15 ml) to the rice flour. Mix thoroughly. Keep adding the warm water or milk to the flour, mixing thoroughly in between additions. You want to continue to do this until the rice flour has a “wet sand” type of consistency. You want the rice flour to be moist, but not so wet that it combines together and becomes a homogeneous dough. You want the rice flour to be able to somewhat crumble. There should not be any dry flour left in the bowl and the rice should be able to take shape when you squeeze it in your hand. Set the mixture aside in a room temperature area. Cover the moist rice flour mixture with a towel or piece of cloth for about 30-60 minutes. This will give the flour time to absorb the water or milk. While you are resting the flour mixture, take a separate bowl and fill it with water and soak your cheese or cotton cloths. Re-sift the rice flour mixture. Take the moist rice flour mixture and mix it around with either your hand or a spoon. Make sure that the mixture is the right consistency and that the mixture is not too wet after allowing the flour to absorb the water or milk. If it is, gradually add more rice flour until it is the right consistency (coarse and able to hold shape, but not like wet batter or homogeneous dough). After the consistency is right, sift the mixture through a sifter/strainer. You might have to push the moist mixture through the sifter/strainer with your hand in order to sift it all the way through. Preparing the Pitha Prepare your steamer. There are three types of steamers described below:\nIf you're using a homemade steamer, fill half of a saucepan with water and tightly cover the top with two layers of aluminum so that any vapor cannot escape. Afterwards, take a fork and poke a few holes in the aluminum foil in the center. When the pithas are ready for cooking, bring your homemade steamer to the stove and bring the water in your saucepan steamer to a boil. If using a bamboo steamer, line the layer you are going to put the pithas in with lettuce or cloth so that the pithas do not stick to the bamboo. Fill a pot with about 3 inches (8 cm) of water and let it come to a simmer. Make sure that you bamboo steamer either sits on top of the pot or fits snugly in the pot over the water line. Once you are ready to steam the pithas, place them in the bamboo steamer, place that over/in the pot. Add 2–3 inches (5.1–7.6 cm) of water to the pot if you see if starting to dry out. If using a rice cooker, fill your rice cooker to the halfway point with water. Close the rice cooker and turn it on to medium to high heat, allowing the water inside to boil. When you are ready to cook the pithas, open the rice cooker,  place a sifter or colander on top of the rice cooker, and place the pithas on top of the colander or sifter, allowing the steam to reach the pitha. Create the base. Take a small bowl, about the size of your palm or a little smaller, and pack your rice mixture in. You only want to pack it in until it is half full. Fill the pitha. After packing the base, you are ready to put in the filling. Taking about 2 tablespoons (30 ml) of coconut flakes, place them into the center of the bowl, over your base (you can use less/more than 2 tablespoon based on your preference). Afterwards, add about 3 tablespoons (44 ml) of jaggery (grate it to make it like flakes) or date molasses (amount is based on personal preference). Then add another layer of coconut flakes. Top the pitha. After putting your fillings insider of the pita, add more rice mixture to the bowl in order to cover your filling completely and create a type of “jaggery & coconut” sandwich. You want to pack it tightly together so the filling stays put in the middle and the pitha will not fall apart when you take it out of the bowl. Cooking the Pitha Put the pitha in a cloth. Take your cheese or cotton cloths out of the bowl of water they were soaking in and wring them out so that they are damp, not soaking or wet. Spread the cloth over the small bowl with your pitha in it. Holding the corners of your cloth up, slowly flip the small bowl over so that the cloth is now at the bottom. Gently tap the bottom of the bowl until your bhapa pitha unmolds itself from the bowl and into the cloth. Cook the pitha. Take the damp cloth and wrap it so that it takes the shape of your bhapa pitha. You want to wrap it tightly enough that your pitha is secure, but not so tightly that the cloth will stick and get stuck to your bhapa pitha. Afterwards, take your cloth covered pitha and place it in your steamer (whichever one you may be using). You want to steam your bhapa pitha for about 5-8 minutes. Unwrap the pitha. After allowing the bhapa pitha to steam for 5-8 minutes, take it out (with the cloth still around the actual pitha) using a ladle or tongs. Using a spatula, very gently pry the bhapa pitha from the warm cloth and put the bhapa pitha on a plate. Place the warm cloth back into the bowl and allow it to soak until you are ready to make and cook your next bhapa pitha. Serve the bhapa pithas while they are still warm and fresh and the inside filling is soft. If your bhapa pitha becomes cold, simply wrap it back up in a damp cloth and put it in your steamer for about 2-3 minutes in order to reheat and become fresh again. You may serve the bhapa pitha with a side of date syrup to dip it in or eat it alone. Enjoy your rightfully earned sweet treat!",
    "sentences": [
        " Making the \"Wet-Sand\" Rice Mixture Make homemade rice flour.",
        "Take the 2.5 cups of white rice and wash thoroughly with cold water.",
        "Soak the rice in a bowl of room temperature overnight (or at least for 7-8 hours).",
        "Transfer the soaked rice to a cloth or baking rack and spread the rice evenly.",
        "Place the rice in a warm, dry area and allow it to dry completely.",
        "Take the rice and grind it down to a coarse powder once it's dry.",
        "Do this in either a grinder or a food processor.",
        "Sift the flour into a clean bowl so that there are no big clumps in the flour.",
        "As an alternative, you can use store bought rice flour.",
        "Take two cups of store bought rice flour and grind it in either a grinder or food processor to make sure it is a coarse powder.",
        "Sift the flour into a clean bowl so that there are no big clumps in the flour.",
        "Add 1 teaspoon of salt to your bowl of sifted rice flour.",
        "Mix thoroughly.",
        "Take cup of either warm milk or warm water and add about 1 tablespoon (15 ml) to the rice flour.",
        "Mix thoroughly.",
        "Keep adding the warm water or milk to the flour, mixing thoroughly in between additions.",
        "You want to continue to do this until the rice flour has a “wet sand” type of consistency.",
        "You want the rice flour to be moist, but not so wet that it combines together and becomes a homogeneous dough.",
        "You want the rice flour to be able to somewhat crumble.",
        "There should not be any dry flour left in the bowl and the rice should be able to take shape when you squeeze it in your hand.",
        "Set the mixture aside in a room temperature area.",
        "Cover the moist rice flour mixture with a towel or piece of cloth for about 30-60 minutes.",
        "This will give the flour time to absorb the water or milk.",
        "While you are resting the flour mixture, take a separate bowl and fill it with water and soak your cheese or cotton cloths.",
        "Re-sift the rice flour mixture.",
        "Take the moist rice flour mixture and mix it around with either your hand or a spoon.",
        "Make sure that the mixture is the right consistency and that the mixture is not too wet after allowing the flour to absorb the water or milk.",
        "If it is, gradually add more rice flour until it is the right consistency (coarse and able to hold shape, but not like wet batter or homogeneous dough).",
        "After the consistency is right, sift the mixture through a sifter/strainer.",
        "You might have to push the moist mixture through the sifter/strainer with your hand in order to sift it all the way through.",
        "Preparing the Pitha Prepare your steamer.",
        "There are three types of steamers described below:\nIf you're using a homemade steamer, fill half of a saucepan with water and tightly cover the top with two layers of aluminum so that any vapor cannot escape.",
        "Afterwards, take a fork and poke a few holes in the aluminum foil in the center.",
        "When the pithas are ready for cooking, bring your homemade steamer to the stove and bring the water in your saucepan steamer to a boil.",
        "If using a bamboo steamer, line the layer you are going to put the pithas in with lettuce or cloth so that the pithas do not stick to the bamboo.",
        "Fill a pot with about 3 inches (8 cm) of water and let it come to a simmer.",
        "Make sure that you bamboo steamer either sits on top of the pot or fits snugly in the pot over the water line.",
        "Once you are ready to steam the pithas, place them in the bamboo steamer, place that over/in the pot.",
        "Add 2–3 inches (5.1–7.6 cm) of water to the pot if you see if starting to dry out.",
        "If using a rice cooker, fill your rice cooker to the halfway point with water.",
        "Close the rice cooker and turn it on to medium to high heat, allowing the water inside to boil.",
        "When you are ready to cook the pithas, open the rice cooker,  place a sifter or colander on top of the rice cooker, and place the pithas on top of the colander or sifter, allowing the steam to reach the pitha.",
        "Create the base.",
        "Take a small bowl, about the size of your palm or a little smaller, and pack your rice mixture in.",
        "You only want to pack it in until it is half full.",
        "Fill the pitha.",
        "After packing the base, you are ready to put in the filling.",
        "Taking about 2 tablespoons (30 ml) of coconut flakes, place them into the center of the bowl, over your base (you can use less/more than 2 tablespoon based on your preference).",
        "Afterwards, add about 3 tablespoons (44 ml) of jaggery (grate it to make it like flakes) or date molasses (amount is based on personal preference).",
        "Then add another layer of coconut flakes.",
        "Top the pitha.",
        "After putting your fillings insider of the pita, add more rice mixture to the bowl in order to cover your filling completely and create a type of “jaggery & coconut” sandwich.",
        "You want to pack it tightly together so the filling stays put in the middle and the pitha will not fall apart when you take it out of the bowl.",
        "Cooking the Pitha Put the pitha in a cloth.",
        "Take your cheese or cotton cloths out of the bowl of water they were soaking in and wring them out so that they are damp, not soaking or wet.",
        "Spread the cloth over the small bowl with your pitha in it.",
        "Holding the corners of your cloth up, slowly flip the small bowl over so that the cloth is now at the bottom.",
        "Gently tap the bottom of the bowl until your bhapa pitha unmolds itself from the bowl and into the cloth.",
        "Cook the pitha.",
        "Take the damp cloth and wrap it so that it takes the shape of your bhapa pitha.",
        "You want to wrap it tightly enough that your pitha is secure, but not so tightly that the cloth will stick and get stuck to your bhapa pitha.",
        "Afterwards, take your cloth covered pitha and place it in your steamer (whichever one you may be using).",
        "You want to steam your bhapa pitha for about 5-8 minutes.",
        "Unwrap the pitha.",
        "After allowing the bhapa pitha to steam for 5-8 minutes, take it out (with the cloth still around the actual pitha) using a ladle or tongs.",
        "Using a spatula, very gently pry the bhapa pitha from the warm cloth and put the bhapa pitha on a plate.",
        "Place the warm cloth back into the bowl and allow it to soak until you are ready to make and cook your next bhapa pitha.",
        "Serve the bhapa pithas while they are still warm and fresh and the inside filling is soft.",
        "If your bhapa pitha becomes cold, simply wrap it back up in a damp cloth and put it in your steamer for about 2-3 minutes in order to reheat and become fresh again.",
        "You may serve the bhapa pitha with a side of date syrup to dip it in or eat it alone.",
        "Enjoy your rightfully earned sweet treat!"
    ]
}