{
    "title": "How to Do a Braid Out on Natural Hair",
    "url": "https://www.wikihow.com/Do-a-Braid-Out-on-Natural-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Hairstyles",
        "Braids"
    ],
    "parts": [
        {
            "name": "Prepping Your Hair",
            "steps": [
                {
                    "headline": "Wash and condition your hair.",
                    "description": "Braid outs usually look best on freshly washed hair; however, this part is optional if you are starting with stretched hair. Wash and condition your hair normally, preferably using a sulfate-free shampoo and conditioner."
                },
                {
                    "headline": "Detangle your hair.",
                    "description": "While there is still conditioner in your hair, detangle your hair in small sections from tip to root using either a wide toothed comb or a Denman brush."
                },
                {
                    "headline": "Dry your hair.",
                    "description": "Blot dry your hair using a t-shirt or microfiber towel. The material from normal towels can cause frizz and breakage in natural hair."
                },
                {
                    "headline": "Apply heat protectant.",
                    "description": "Apply a heat protectant of your choosing to prepare for the blow drying/stretching process and avoid heat damage."
                },
                {
                    "headline": "Stretch your hair.",
                    "description": "Using a blow dryer on low heat, use the tension method. In small sections, hold your hair taut using your hand or a Denman brush and blow dry the length of the hair to stretch the hair. Repeat until all of your hair is stretched."
                }
            ]
        },
        {
            "name": "Braiding Your Hair",
            "steps": [
                {
                    "headline": "Separate your hair into 4 equal sections.",
                    "description": "Part your hair using a rattail comb to separate your hair into equal sections. Work through one section at a time."
                },
                {
                    "headline": "Apply product.",
                    "description": "Apply a moisturizing curl defining product in the section you are working on. This helps the curls set."
                },
                {
                    "headline": "Braid the hair.",
                    "description": "From your large section, take a smaller 1 inch section and braid the hair normally. Separate the smaller section into 3 even strands and braid by crossing one over the other. A detailed how-to for braiding hair can be found in Do a Basic Hair Braid. Coil the ends of your braid around your finger to maintain curl definition. Repeat until the  entire section is braided - each section should have about 6 braids."
                },
                {
                    "headline": "Repeat steps 2-3 until all your hair is braided.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Taking Down and Styling Your Braid Out",
            "steps": [
                {
                    "headline": "Let your hair dry completely.",
                    "description": "Your hair will be slightly damp from the moisturizer, but your hair must be dry for the style to completely set. You may either use a blow dryer or let your hair air dry overnight for this step."
                },
                {
                    "headline": "Apply oil to your hands.",
                    "description": "Use a light oil like coconut or jojoba oil. This will prevent your hair from frizzing up while taking down your braids."
                },
                {
                    "headline": "Carefully take down your braids.",
                    "description": "Grab a single braid at the bottom and use your oiled fingers to carefully split and separate the braids until they are completely unraveled. Repeat until all the braids are taken down."
                },
                {
                    "headline": "Fluff the hair.",
                    "description": "For a more voluminous look, separate your unbraided strands into more strands and use a comb or afro pick to fluff up your hair at the roots."
                }
            ]
        }
    ],
    "tyn": [
        "Shampoo and conditioner",
        "Blow dryer",
        "Wide toothed comb/Afro pick",
        "Rattail comb",
        "Curl defining product",
        "Light hair oil"
    ],
    "text": " Prepping Your Hair Wash and condition your hair. Braid outs usually look best on freshly washed hair; however, this part is optional if you are starting with stretched hair. Wash and condition your hair normally, preferably using a sulfate-free shampoo and conditioner. Detangle your hair. While there is still conditioner in your hair, detangle your hair in small sections from tip to root using either a wide toothed comb or a Denman brush. Dry your hair. Blot dry your hair using a t-shirt or microfiber towel. The material from normal towels can cause frizz and breakage in natural hair. Apply heat protectant. Apply a heat protectant of your choosing to prepare for the blow drying/stretching process and avoid heat damage. Stretch your hair. Using a blow dryer on low heat, use the tension method. In small sections, hold your hair taut using your hand or a Denman brush and blow dry the length of the hair to stretch the hair. Repeat until all of your hair is stretched. Braiding Your Hair Separate your hair into 4 equal sections. Part your hair using a rattail comb to separate your hair into equal sections. Work through one section at a time. Apply product. Apply a moisturizing curl defining product in the section you are working on. This helps the curls set. Braid the hair. From your large section, take a smaller 1 inch section and braid the hair normally. Separate the smaller section into 3 even strands and braid by crossing one over the other. A detailed how-to for braiding hair can be found in Do a Basic Hair Braid. Coil the ends of your braid around your finger to maintain curl definition. Repeat until the  entire section is braided - each section should have about 6 braids. Repeat steps 2-3 until all your hair is braided.  Taking Down and Styling Your Braid Out Let your hair dry completely. Your hair will be slightly damp from the moisturizer, but your hair must be dry for the style to completely set. You may either use a blow dryer or let your hair air dry overnight for this step. Apply oil to your hands. Use a light oil like coconut or jojoba oil. This will prevent your hair from frizzing up while taking down your braids. Carefully take down your braids. Grab a single braid at the bottom and use your oiled fingers to carefully split and separate the braids until they are completely unraveled. Repeat until all the braids are taken down. Fluff the hair. For a more voluminous look, separate your unbraided strands into more strands and use a comb or afro pick to fluff up your hair at the roots.",
    "sentences": [
        " Prepping Your Hair Wash and condition your hair.",
        "Braid outs usually look best on freshly washed hair; however, this part is optional if you are starting with stretched hair.",
        "Wash and condition your hair normally, preferably using a sulfate-free shampoo and conditioner.",
        "Detangle your hair.",
        "While there is still conditioner in your hair, detangle your hair in small sections from tip to root using either a wide toothed comb or a Denman brush.",
        "Dry your hair.",
        "Blot dry your hair using a t-shirt or microfiber towel.",
        "The material from normal towels can cause frizz and breakage in natural hair.",
        "Apply heat protectant.",
        "Apply a heat protectant of your choosing to prepare for the blow drying/stretching process and avoid heat damage.",
        "Stretch your hair.",
        "Using a blow dryer on low heat, use the tension method.",
        "In small sections, hold your hair taut using your hand or a Denman brush and blow dry the length of the hair to stretch the hair.",
        "Repeat until all of your hair is stretched.",
        "Braiding Your Hair Separate your hair into 4 equal sections.",
        "Part your hair using a rattail comb to separate your hair into equal sections.",
        "Work through one section at a time.",
        "Apply product.",
        "Apply a moisturizing curl defining product in the section you are working on.",
        "This helps the curls set.",
        "Braid the hair.",
        "From your large section, take a smaller 1 inch section and braid the hair normally.",
        "Separate the smaller section into 3 even strands and braid by crossing one over the other.",
        "A detailed how-to for braiding hair can be found in Do a Basic Hair Braid.",
        "Coil the ends of your braid around your finger to maintain curl definition.",
        "Repeat until the  entire section is braided - each section should have about 6 braids.",
        "Repeat steps 2-3 until all your hair is braided.",
        "Taking Down and Styling Your Braid Out Let your hair dry completely.",
        "Your hair will be slightly damp from the moisturizer, but your hair must be dry for the style to completely set.",
        "You may either use a blow dryer or let your hair air dry overnight for this step.",
        "Apply oil to your hands.",
        "Use a light oil like coconut or jojoba oil.",
        "This will prevent your hair from frizzing up while taking down your braids.",
        "Carefully take down your braids.",
        "Grab a single braid at the bottom and use your oiled fingers to carefully split and separate the braids until they are completely unraveled.",
        "Repeat until all the braids are taken down.",
        "Fluff the hair.",
        "For a more voluminous look, separate your unbraided strands into more strands and use a comb or afro pick to fluff up your hair at the roots."
    ]
}