{
    "title": "How to Measure Sleeve Width",
    "url": "https://www.wikihow.com/Measure-Sleeve-Width",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Body Type and Fashion"
    ],
    "methods": [
        {
            "name": "Finding Sleeve Width on a Shirt",
            "steps": [
                {
                    "headline": "Lay your shirt on a firm surface so the sleeves are flat.",
                    "description": "Place the shirt face-up on a table or another hard surface and smooth it out so there are no folds. Pull the sleeve straight out from the shirt’s torso so the seam attached to the armpit lines up on the bottom of the sleeve.You can measure a short- or long-sleeved shirt. If the shirt has a lot of wrinkles, try washing or ironing it first. Well-fitting sleeves should allow you to extend your arm through its full range of motion without feeling tight or restrictive, which usually means they’re 1–2 inches (2.5–5.1 cm) wider than the widest part of your arm."
                },
                {
                    "headline": "Hold a tape measure on the sleeve’s seam 1 in (2.5 cm) in from the armpit.",
                    "description": "Locate the seam along the bottom of the sleeve that connects to the side of the shirt. Measure 1 inch (2.5 cm) in from the corner made by the armpit. Place the end of a fabric tape measure so it runs perpendicular to the bottom of the sleeve.Fabric tape measures are made from a flexible material to take body and clothing measurements. You can buy them from craft supply stores.Tip: Avoid using a standard tape measure since it won’t be flexible and may give an inaccurate measurement."
                },
                {
                    "headline": "Pull the tape measure so it’s perpendicular to the sleeve’s top edge.",
                    "description": "Stretch the tape measure straight up so it stays pressed flat against the sleeve. Bring the other end of the tape measure toward the top crease of the sleeve so it forms a 90-degree angle where they intersect. The tape measure will be near parallel with the vertical seam that attaches the sleeve to the front of your shirt.Be sure to hold the end of the tape measure against the bottom of the sleeve so it doesn’t move."
                },
                {
                    "headline": "Round your measurement up to the nearest quarter inch.",
                    "description": "Read where the tape measure crosses the crease on top of the sleeve to find the width. Then round up to the next quarter inch to ensure the measurement isn’t too small. Write down the measurement so you don’t forget it.For example, if your measurement was 7 ⁄8 inches (18 cm), then you would round it up to 7 ⁄4 inches (18 cm) instead."
                }
            ]
        },
        {
            "name": "Measuring Your Arm",
            "steps": [
                {
                    "headline": "Find the widest part of your bicep 5–6 in (13–15 cm) down from your shoulder.",
                    "description": "You can wear a thin, loose-fitting shirt while you take your measurements. Keep your arm relaxed by your side and measure down about 5 or 6 inches (13 or 15 cm) from the tip of your shoulder.If you have trouble taking your measurement or finding the widest spot around your bicep, try looking in a mirror."
                },
                {
                    "headline": "Wrap a fabric measure tape tightly around your bicep.",
                    "description": "Hold the end of the fabric tape measure between your arm and the side of your body. Use your free arm to wrap the rest of the tape measure around your bicep so it stays horizontal. Make sure the tape measure lays flat against your skin and doesn’t compress your bicep to ensure you get an accurate measurement.If you have trouble measuring your bicep on your own, ask a helper to measure it for you."
                },
                {
                    "headline": "Take your measurement while your arms are relaxed.",
                    "description": "Make sure you aren’t flexing your biceps since it will make your sleeve width seem larger. Keep your arm completely relaxed and look where the end of the tape measure overlaps. Round your measurement up to the nearest half-inch.For example, if your measurement was 12 ⁄8 inches (31 cm), you would round it up to 12 ⁄2 inches (32 cm)."
                },
                {
                    "headline": "Add 1 ⁄2–2 in (3.8–5.1 cm) to allow a full range of motion.",
                    "description": "Take the measurement you found around your bicep and include an additional bit of length. This allows you to easily fit your arms through your sleeves so they don’t feel tight or uncomfortable.For example, if your measured sleeve width was 13 inches (33 cm), then the final width should be 14 ⁄2–15 inches (37–38 cm).Warning: If you don’t add to your sleeve width measurement, they will rip easier or you won’t be able to fit your arms inside."
                },
                {
                    "headline": "Measure around your wrist and add 2 in (5.1 cm) to find your cuff size.",
                    "description": "Hold the tape measure right above the bulge of your wrist bone and keep it horizontal. Wrap the tape measure around your wrist and look where it intersects the end. Add Round your measurement up to the nearest quarter inch before adding 2 inches (5.1 cm) so you can fit your hand through it.For example, if your measurement was 7 ⁄8 inches (19 cm), round it up to 7 ⁄2 inches (19 cm). Then add 2 inches (5.1 cm) to find that your final cuff size is 9 ⁄2 inches (24 cm). You only need your cuff size if you’re measuring for a long-sleeve dress shirt. This will determine how much the sleeve tapers."
                }
            ]
        }
    ],
    "tyn": [
        "Fabric measuring tape"
    ],
    "text": " Finding Sleeve Width on a Shirt Lay your shirt on a firm surface so the sleeves are flat. Place the shirt face-up on a table or another hard surface and smooth it out so there are no folds. Pull the sleeve straight out from the shirt’s torso so the seam attached to the armpit lines up on the bottom of the sleeve.You can measure a short- or long-sleeved shirt. If the shirt has a lot of wrinkles, try washing or ironing it first. Well-fitting sleeves should allow you to extend your arm through its full range of motion without feeling tight or restrictive, which usually means they’re 1–2 inches (2.5–5.1 cm) wider than the widest part of your arm. Hold a tape measure on the sleeve’s seam 1 in (2.5 cm) in from the armpit. Locate the seam along the bottom of the sleeve that connects to the side of the shirt. Measure 1 inch (2.5 cm) in from the corner made by the armpit. Place the end of a fabric tape measure so it runs perpendicular to the bottom of the sleeve.Fabric tape measures are made from a flexible material to take body and clothing measurements. You can buy them from craft supply stores.Tip: Avoid using a standard tape measure since it won’t be flexible and may give an inaccurate measurement. Pull the tape measure so it’s perpendicular to the sleeve’s top edge. Stretch the tape measure straight up so it stays pressed flat against the sleeve. Bring the other end of the tape measure toward the top crease of the sleeve so it forms a 90-degree angle where they intersect. The tape measure will be near parallel with the vertical seam that attaches the sleeve to the front of your shirt.Be sure to hold the end of the tape measure against the bottom of the sleeve so it doesn’t move. Round your measurement up to the nearest quarter inch. Read where the tape measure crosses the crease on top of the sleeve to find the width. Then round up to the next quarter inch to ensure the measurement isn’t too small. Write down the measurement so you don’t forget it.For example, if your measurement was 7 ⁄8 inches (18 cm), then you would round it up to 7 ⁄4 inches (18 cm) instead. Measuring Your Arm Find the widest part of your bicep 5–6 in (13–15 cm) down from your shoulder. You can wear a thin, loose-fitting shirt while you take your measurements. Keep your arm relaxed by your side and measure down about 5 or 6 inches (13 or 15 cm) from the tip of your shoulder.If you have trouble taking your measurement or finding the widest spot around your bicep, try looking in a mirror. Wrap a fabric measure tape tightly around your bicep. Hold the end of the fabric tape measure between your arm and the side of your body. Use your free arm to wrap the rest of the tape measure around your bicep so it stays horizontal. Make sure the tape measure lays flat against your skin and doesn’t compress your bicep to ensure you get an accurate measurement.If you have trouble measuring your bicep on your own, ask a helper to measure it for you. Take your measurement while your arms are relaxed. Make sure you aren’t flexing your biceps since it will make your sleeve width seem larger. Keep your arm completely relaxed and look where the end of the tape measure overlaps. Round your measurement up to the nearest half-inch.For example, if your measurement was 12 ⁄8 inches (31 cm), you would round it up to 12 ⁄2 inches (32 cm). Add 1 ⁄2–2 in (3.8–5.1 cm) to allow a full range of motion. Take the measurement you found around your bicep and include an additional bit of length. This allows you to easily fit your arms through your sleeves so they don’t feel tight or uncomfortable.For example, if your measured sleeve width was 13 inches (33 cm), then the final width should be 14 ⁄2–15 inches (37–38 cm).Warning: If you don’t add to your sleeve width measurement, they will rip easier or you won’t be able to fit your arms inside. Measure around your wrist and add 2 in (5.1 cm) to find your cuff size. Hold the tape measure right above the bulge of your wrist bone and keep it horizontal. Wrap the tape measure around your wrist and look where it intersects the end. Add Round your measurement up to the nearest quarter inch before adding 2 inches (5.1 cm) so you can fit your hand through it.For example, if your measurement was 7 ⁄8 inches (19 cm), round it up to 7 ⁄2 inches (19 cm). Then add 2 inches (5.1 cm) to find that your final cuff size is 9 ⁄2 inches (24 cm). You only need your cuff size if you’re measuring for a long-sleeve dress shirt. This will determine how much the sleeve tapers.",
    "sentences": [
        " Finding Sleeve Width on a Shirt Lay your shirt on a firm surface so the sleeves are flat.",
        "Place the shirt face-up on a table or another hard surface and smooth it out so there are no folds.",
        "Pull the sleeve straight out from the shirt’s torso so the seam attached to the armpit lines up on the bottom of the sleeve.You can measure a short- or long-sleeved shirt.",
        "If the shirt has a lot of wrinkles, try washing or ironing it first.",
        "Well-fitting sleeves should allow you to extend your arm through its full range of motion without feeling tight or restrictive, which usually means they’re 1–2 inches (2.5–5.1 cm) wider than the widest part of your arm.",
        "Hold a tape measure on the sleeve’s seam 1 in (2.5 cm) in from the armpit.",
        "Locate the seam along the bottom of the sleeve that connects to the side of the shirt.",
        "Measure 1 inch (2.5 cm) in from the corner made by the armpit.",
        "Place the end of a fabric tape measure so it runs perpendicular to the bottom of the sleeve.Fabric tape measures are made from a flexible material to take body and clothing measurements.",
        "You can buy them from craft supply stores.Tip: Avoid using a standard tape measure since it won’t be flexible and may give an inaccurate measurement.",
        "Pull the tape measure so it’s perpendicular to the sleeve’s top edge.",
        "Stretch the tape measure straight up so it stays pressed flat against the sleeve.",
        "Bring the other end of the tape measure toward the top crease of the sleeve so it forms a 90-degree angle where they intersect.",
        "The tape measure will be near parallel with the vertical seam that attaches the sleeve to the front of your shirt.Be sure to hold the end of the tape measure against the bottom of the sleeve so it doesn’t move.",
        "Round your measurement up to the nearest quarter inch.",
        "Read where the tape measure crosses the crease on top of the sleeve to find the width.",
        "Then round up to the next quarter inch to ensure the measurement isn’t too small.",
        "Write down the measurement so you don’t forget it.For example, if your measurement was 7 ⁄8 inches (18 cm), then you would round it up to 7 ⁄4 inches (18 cm) instead.",
        "Measuring Your Arm Find the widest part of your bicep 5–6 in (13–15 cm) down from your shoulder.",
        "You can wear a thin, loose-fitting shirt while you take your measurements.",
        "Keep your arm relaxed by your side and measure down about 5 or 6 inches (13 or 15 cm) from the tip of your shoulder.If you have trouble taking your measurement or finding the widest spot around your bicep, try looking in a mirror.",
        "Wrap a fabric measure tape tightly around your bicep.",
        "Hold the end of the fabric tape measure between your arm and the side of your body.",
        "Use your free arm to wrap the rest of the tape measure around your bicep so it stays horizontal.",
        "Make sure the tape measure lays flat against your skin and doesn’t compress your bicep to ensure you get an accurate measurement.If you have trouble measuring your bicep on your own, ask a helper to measure it for you.",
        "Take your measurement while your arms are relaxed.",
        "Make sure you aren’t flexing your biceps since it will make your sleeve width seem larger.",
        "Keep your arm completely relaxed and look where the end of the tape measure overlaps.",
        "Round your measurement up to the nearest half-inch.For example, if your measurement was 12 ⁄8 inches (31 cm), you would round it up to 12 ⁄2 inches (32 cm).",
        "Add 1 ⁄2–2 in (3.8–5.1 cm) to allow a full range of motion.",
        "Take the measurement you found around your bicep and include an additional bit of length.",
        "This allows you to easily fit your arms through your sleeves so they don’t feel tight or uncomfortable.For example, if your measured sleeve width was 13 inches (33 cm), then the final width should be 14 ⁄2–15 inches (37–38 cm).Warning: If you don’t add to your sleeve width measurement, they will rip easier or you won’t be able to fit your arms inside.",
        "Measure around your wrist and add 2 in (5.1 cm) to find your cuff size.",
        "Hold the tape measure right above the bulge of your wrist bone and keep it horizontal.",
        "Wrap the tape measure around your wrist and look where it intersects the end.",
        "Add Round your measurement up to the nearest quarter inch before adding 2 inches (5.1 cm) so you can fit your hand through it.For example, if your measurement was 7 ⁄8 inches (19 cm), round it up to 7 ⁄2 inches (19 cm).",
        "Then add 2 inches (5.1 cm) to find that your final cuff size is 9 ⁄2 inches (24 cm).",
        "You only need your cuff size if you’re measuring for a long-sleeve dress shirt.",
        "This will determine how much the sleeve tapers."
    ]
}