{
    "title": "How to Make a Chocolate Facial Mask",
    "url": "https://www.wikihow.com/Make-a-Chocolate-Facial-Mask",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Handmade Cosmetics",
        "Plant Based Cosmetics",
        "Chocolate Cosmetics"
    ],
    "methods": [
        {
            "name": "Making a Basic Facial Mask",
            "steps": [
                {
                    "headline": "Melt the chocolate over low to medium heat in a double-boiler.",
                    "description": "Fill a pot with 1 to 2 inches (2.54 to 5.08 centimeters) of water, and place a heat-safe bowl on top; the bottom of the bowl should not be touching the water. Break the chocolate into smaller chunks, and place it into the bowl. Heat over low to medium heat until melted, stirring occasionally. It will take about 3 minutes. If you can't find any dark chocolate bars, use dark chocolate chips. You will need about 3.5 ounces (100 grams)."
                },
                {
                    "headline": "Mix the sea salt, brown sugar, and milk in a bowl until evenly combined.",
                    "description": "You can do this with a fork or whisk. Be sure to break up any clumps."
                },
                {
                    "headline": "Add the melted chocolate into the milk mixture.",
                    "description": "Use a rubber spatula to guide the chocolate into the milk, making sure to scrape everything off the sides of the bowl. Stir everything together using a whisk."
                },
                {
                    "headline": "Let the mixture cool.",
                    "description": "You can do this quickly by stirring it briskly in front of a fan. Don't get impatient, or the mixture will be too hot for your face!"
                },
                {
                    "headline": "Apply the mixture to your face and wait 15 to 30 minutes.",
                    "description": "During this time, the mixture may harden—don't worry, this is perfectly fine. Take care to avoid the eye area when applying this mask."
                },
                {
                    "headline": "Rinse the face mask off using warm water, and pat your face dry with a clean towel.",
                    "description": "If you need to, use a mild facial cleanser to remove any residue, and apply some lotion afterwards."
                }
            ]
        },
        {
            "name": "Making an Acne-Free Strawberry Mask",
            "steps": [
                {
                    "headline": "Rinse and slice 4 fresh strawberries, and discard the stems.",
                    "description": "Strawberries contain salicylic acid, which helps improve acne. The seeds also act as a mild exfoliant."
                },
                {
                    "headline": "Put all of the ingredients into a blender.",
                    "description": "The honey will help moisturize your skin; its antibacterial properties will also help clarify the acne. The yogurt will help exfoliate your skin and reduce blemishes. Lastly, the cocoa powder will help keep your skin healthy, thanks to all of its beneficial antioxidants."
                },
                {
                    "headline": "Blend until smooth and evenly combined.",
                    "description": "From time to time, you will want to push down the walls of the blender with a rubber spatula so that everything mixes evenly. Don't worry if you see some strawberry seeds; they will help exfoliate your skin!"
                },
                {
                    "headline": "Spread the mixture over a clean face and wait 15 to 20 minutes.",
                    "description": "You can do this using your fingers or a soft brush (such as a foundation brush) for a more luxurious feel. Take care to avoid the areas around the eyes."
                },
                {
                    "headline": "Rinse the mask off with warm water and pat your face dry.",
                    "description": "If there is any residue on your face, wash it off using a mild face soap."
                }
            ]
        },
        {
            "name": "Making an Exfoliating Oatmeal Mask",
            "steps": [
                {
                    "headline": "Add the cocoa powder, honey, oatmeal powder, and heavy cream into a small bowl.",
                    "description": "If you can't find any oatmeal powder, use old fashioned oats instead. Pulse them in a blender or food processor until finely ground."
                },
                {
                    "headline": "Mix everything together with a spoon or spatula.",
                    "description": "Be sure to break up any lumps or clumps. You want the mixture to be very smooth."
                },
                {
                    "headline": "Spread the mixture onto a clean face, and then gently massage it for about 5 seconds.",
                    "description": "Use your fingers to spread the mask onto your face, taking care to avoid the eye area. Then, gently massage your skin using small, circular motions for about 5 seconds. This will help exfoliate your skin."
                },
                {
                    "headline": "Rinse the mixture off with warm water after 15 to 30 minutes, and then gently pat your face dry.",
                    "description": "If you see any residue, wash it off using a mild facial soap."
                }
            ]
        }
    ],
    "tyn": [
        "Basic Facial Mask",
        "Double-boiler (pot and glass bowl)",
        "Mixing bowl",
        "Whisk",
        "Rubber spatula",
        "Soft brush (optional)",
        "Acne-Free Strawberry Mask",
        "Cutting board",
        "Knife",
        "Blender",
        "Making an Exfoliating Oatmeal Mask",
        "Spoon or spatula"
    ],
    "text": " Making a Basic Facial Mask Melt the chocolate over low to medium heat in a double-boiler. Fill a pot with 1 to 2 inches (2.54 to 5.08 centimeters) of water, and place a heat-safe bowl on top; the bottom of the bowl should not be touching the water. Break the chocolate into smaller chunks, and place it into the bowl. Heat over low to medium heat until melted, stirring occasionally. It will take about 3 minutes. If you can't find any dark chocolate bars, use dark chocolate chips. You will need about 3.5 ounces (100 grams). Mix the sea salt, brown sugar, and milk in a bowl until evenly combined. You can do this with a fork or whisk. Be sure to break up any clumps. Add the melted chocolate into the milk mixture. Use a rubber spatula to guide the chocolate into the milk, making sure to scrape everything off the sides of the bowl. Stir everything together using a whisk. Let the mixture cool. You can do this quickly by stirring it briskly in front of a fan. Don't get impatient, or the mixture will be too hot for your face! Apply the mixture to your face and wait 15 to 30 minutes. During this time, the mixture may harden—don't worry, this is perfectly fine. Take care to avoid the eye area when applying this mask. Rinse the face mask off using warm water, and pat your face dry with a clean towel. If you need to, use a mild facial cleanser to remove any residue, and apply some lotion afterwards. Making an Acne-Free Strawberry Mask Rinse and slice 4 fresh strawberries, and discard the stems. Strawberries contain salicylic acid, which helps improve acne. The seeds also act as a mild exfoliant. Put all of the ingredients into a blender. The honey will help moisturize your skin; its antibacterial properties will also help clarify the acne. The yogurt will help exfoliate your skin and reduce blemishes. Lastly, the cocoa powder will help keep your skin healthy, thanks to all of its beneficial antioxidants. Blend until smooth and evenly combined. From time to time, you will want to push down the walls of the blender with a rubber spatula so that everything mixes evenly. Don't worry if you see some strawberry seeds; they will help exfoliate your skin! Spread the mixture over a clean face and wait 15 to 20 minutes. You can do this using your fingers or a soft brush (such as a foundation brush) for a more luxurious feel. Take care to avoid the areas around the eyes. Rinse the mask off with warm water and pat your face dry. If there is any residue on your face, wash it off using a mild face soap. Making an Exfoliating Oatmeal Mask Add the cocoa powder, honey, oatmeal powder, and heavy cream into a small bowl. If you can't find any oatmeal powder, use old fashioned oats instead. Pulse them in a blender or food processor until finely ground. Mix everything together with a spoon or spatula. Be sure to break up any lumps or clumps. You want the mixture to be very smooth. Spread the mixture onto a clean face, and then gently massage it for about 5 seconds. Use your fingers to spread the mask onto your face, taking care to avoid the eye area. Then, gently massage your skin using small, circular motions for about 5 seconds. This will help exfoliate your skin. Rinse the mixture off with warm water after 15 to 30 minutes, and then gently pat your face dry. If you see any residue, wash it off using a mild facial soap.",
    "sentences": [
        " Making a Basic Facial Mask Melt the chocolate over low to medium heat in a double-boiler.",
        "Fill a pot with 1 to 2 inches (2.54 to 5.08 centimeters) of water, and place a heat-safe bowl on top; the bottom of the bowl should not be touching the water.",
        "Break the chocolate into smaller chunks, and place it into the bowl.",
        "Heat over low to medium heat until melted, stirring occasionally.",
        "It will take about 3 minutes.",
        "If you can't find any dark chocolate bars, use dark chocolate chips.",
        "You will need about 3.5 ounces (100 grams).",
        "Mix the sea salt, brown sugar, and milk in a bowl until evenly combined.",
        "You can do this with a fork or whisk.",
        "Be sure to break up any clumps.",
        "Add the melted chocolate into the milk mixture.",
        "Use a rubber spatula to guide the chocolate into the milk, making sure to scrape everything off the sides of the bowl.",
        "Stir everything together using a whisk.",
        "Let the mixture cool.",
        "You can do this quickly by stirring it briskly in front of a fan.",
        "Don't get impatient, or the mixture will be too hot for your face!",
        "Apply the mixture to your face and wait 15 to 30 minutes.",
        "During this time, the mixture may harden—don't worry, this is perfectly fine.",
        "Take care to avoid the eye area when applying this mask.",
        "Rinse the face mask off using warm water, and pat your face dry with a clean towel.",
        "If you need to, use a mild facial cleanser to remove any residue, and apply some lotion afterwards.",
        "Making an Acne-Free Strawberry Mask Rinse and slice 4 fresh strawberries, and discard the stems.",
        "Strawberries contain salicylic acid, which helps improve acne.",
        "The seeds also act as a mild exfoliant.",
        "Put all of the ingredients into a blender.",
        "The honey will help moisturize your skin; its antibacterial properties will also help clarify the acne.",
        "The yogurt will help exfoliate your skin and reduce blemishes.",
        "Lastly, the cocoa powder will help keep your skin healthy, thanks to all of its beneficial antioxidants.",
        "Blend until smooth and evenly combined.",
        "From time to time, you will want to push down the walls of the blender with a rubber spatula so that everything mixes evenly.",
        "Don't worry if you see some strawberry seeds; they will help exfoliate your skin!",
        "Spread the mixture over a clean face and wait 15 to 20 minutes.",
        "You can do this using your fingers or a soft brush (such as a foundation brush) for a more luxurious feel.",
        "Take care to avoid the areas around the eyes.",
        "Rinse the mask off with warm water and pat your face dry.",
        "If there is any residue on your face, wash it off using a mild face soap.",
        "Making an Exfoliating Oatmeal Mask Add the cocoa powder, honey, oatmeal powder, and heavy cream into a small bowl.",
        "If you can't find any oatmeal powder, use old fashioned oats instead.",
        "Pulse them in a blender or food processor until finely ground.",
        "Mix everything together with a spoon or spatula.",
        "Be sure to break up any lumps or clumps.",
        "You want the mixture to be very smooth.",
        "Spread the mixture onto a clean face, and then gently massage it for about 5 seconds.",
        "Use your fingers to spread the mask onto your face, taking care to avoid the eye area.",
        "Then, gently massage your skin using small, circular motions for about 5 seconds.",
        "This will help exfoliate your skin.",
        "Rinse the mixture off with warm water after 15 to 30 minutes, and then gently pat your face dry.",
        "If you see any residue, wash it off using a mild facial soap."
    ]
}