{
    "title": "How to Make a Symmetrical Paper Heart",
    "url": "https://www.wikihow.com/Make-a-Symmetrical-Paper-Heart",
    "category_hierarchy": [
        "Health",
        "Psychological Health",
        "Emotions and Feelings"
    ],
    "methods": [
        {
            "name": "Making the Heart",
            "steps": [
                {
                    "headline": "Fold a piece of paper in half.",
                    "description": "It can be a rectangle or square-shaped piece of paper – either will work. For a classic, festive heart, use red, pink, or purple construction paper. If you want a big heart, then use a big paper."
                },
                {
                    "headline": "Draw the outline of half of a heart.",
                    "description": "Start sketching from the paper crease, so that both the top and bottom of the heart come from the crease. When you cut out this line from each folded side of the paper, you will ensure that each half of the heart is perfectly symmetrical to the other. The outline you draw will determine the final heart shape, so now is the time to decide the aesthetic fate of your paper heart. Use a pencil if you plan to erase the line. Use a pen if you don't mind a dark border to your paper heart."
                },
                {
                    "headline": "Cut along the penciled outline.",
                    "description": "Start from the crease—the top or bottom-center of the heart—and cut out the line you drew. Snip carefully, but don't worry too much about precision. Once you unfold your heart, each side will be symmetrical no matter how skewed your cut. Make sure that you are cutting both halves of the fold. If you don't want the dark line to show on the finished heart: cut just inside the pencil mark, or carefully erase it later."
                },
                {
                    "headline": "Unfold the paper.",
                    "description": "You should have a symmetrical paper heart. You're now ready to give the heart to someone or use it in a larger craft project!"
                }
            ]
        },
        {
            "name": "Giving the Heart",
            "steps": [
                {
                    "headline": "Use your heart.",
                    "description": "Give it to someone or incorporate it into a larger craft project. If Valentine's Day is coming up, then a paper heart can make a great simple gift for someone you like. However, don't be afraid to do this at any time of year!"
                },
                {
                    "headline": "Make a heart-shaped card.",
                    "description": "Turn the heart into a card by writing sweet words on it and folding it together. You can even paste the card to a larger, rectangular card, and then write your words in the heart. Write a note to someone that you like. For a playful card, write, \"Will you be my Valentine?\" or \"I think you're awesome.\" For a more serious card, write something like, \"I love you,\" or \"I give my heart to you.\" Make sure you're giving it to someone who will receive this news well!"
                },
                {
                    "headline": "Add the heart to a larger project.",
                    "description": "Stick the paper heart to a card or poster. Use tape or tack to attach it to your wall or window. Use it as a piece in a pop-up book. Get creative!"
                }
            ]
        }
    ],
    "tyn": [
        "Paper",
        "Pencil (and eraser for lines)",
        "Scissors",
        "Flat surface"
    ],
    "text": " Making the Heart Fold a piece of paper in half. It can be a rectangle or square-shaped piece of paper – either will work. For a classic, festive heart, use red, pink, or purple construction paper. If you want a big heart, then use a big paper. Draw the outline of half of a heart. Start sketching from the paper crease, so that both the top and bottom of the heart come from the crease. When you cut out this line from each folded side of the paper, you will ensure that each half of the heart is perfectly symmetrical to the other. The outline you draw will determine the final heart shape, so now is the time to decide the aesthetic fate of your paper heart. Use a pencil if you plan to erase the line. Use a pen if you don't mind a dark border to your paper heart. Cut along the penciled outline. Start from the crease—the top or bottom-center of the heart—and cut out the line you drew. Snip carefully, but don't worry too much about precision. Once you unfold your heart, each side will be symmetrical no matter how skewed your cut. Make sure that you are cutting both halves of the fold. If you don't want the dark line to show on the finished heart: cut just inside the pencil mark, or carefully erase it later. Unfold the paper. You should have a symmetrical paper heart. You're now ready to give the heart to someone or use it in a larger craft project! Giving the Heart Use your heart. Give it to someone or incorporate it into a larger craft project. If Valentine's Day is coming up, then a paper heart can make a great simple gift for someone you like. However, don't be afraid to do this at any time of year! Make a heart-shaped card. Turn the heart into a card by writing sweet words on it and folding it together. You can even paste the card to a larger, rectangular card, and then write your words in the heart. Write a note to someone that you like. For a playful card, write, \"Will you be my Valentine?\" or \"I think you're awesome.\" For a more serious card, write something like, \"I love you,\" or \"I give my heart to you.\" Make sure you're giving it to someone who will receive this news well! Add the heart to a larger project. Stick the paper heart to a card or poster. Use tape or tack to attach it to your wall or window. Use it as a piece in a pop-up book. Get creative!",
    "sentences": [
        " Making the Heart Fold a piece of paper in half.",
        "It can be a rectangle or square-shaped piece of paper – either will work.",
        "For a classic, festive heart, use red, pink, or purple construction paper.",
        "If you want a big heart, then use a big paper.",
        "Draw the outline of half of a heart.",
        "Start sketching from the paper crease, so that both the top and bottom of the heart come from the crease.",
        "When you cut out this line from each folded side of the paper, you will ensure that each half of the heart is perfectly symmetrical to the other.",
        "The outline you draw will determine the final heart shape, so now is the time to decide the aesthetic fate of your paper heart.",
        "Use a pencil if you plan to erase the line.",
        "Use a pen if you don't mind a dark border to your paper heart.",
        "Cut along the penciled outline.",
        "Start from the crease—the top or bottom-center of the heart—and cut out the line you drew.",
        "Snip carefully, but don't worry too much about precision.",
        "Once you unfold your heart, each side will be symmetrical no matter how skewed your cut.",
        "Make sure that you are cutting both halves of the fold.",
        "If you don't want the dark line to show on the finished heart: cut just inside the pencil mark, or carefully erase it later.",
        "Unfold the paper.",
        "You should have a symmetrical paper heart.",
        "You're now ready to give the heart to someone or use it in a larger craft project!",
        "Giving the Heart Use your heart.",
        "Give it to someone or incorporate it into a larger craft project.",
        "If Valentine's Day is coming up, then a paper heart can make a great simple gift for someone you like.",
        "However, don't be afraid to do this at any time of year!",
        "Make a heart-shaped card.",
        "Turn the heart into a card by writing sweet words on it and folding it together.",
        "You can even paste the card to a larger, rectangular card, and then write your words in the heart.",
        "Write a note to someone that you like.",
        "For a playful card, write, \"Will you be my Valentine?\"",
        "or \"I think you're awesome.\"",
        "For a more serious card, write something like, \"I love you,\" or \"I give my heart to you.\"",
        "Make sure you're giving it to someone who will receive this news well!",
        "Add the heart to a larger project.",
        "Stick the paper heart to a card or poster.",
        "Use tape or tack to attach it to your wall or window.",
        "Use it as a piece in a pop-up book.",
        "Get creative!"
    ]
}