{
    "title": "How to Fit Mini Trunking Corners",
    "url": "https://www.wikihow.com/Fit-Mini-Trunking-Corners",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Measuring and Cutting the Straight Lengths",
            "steps": [
                {
                    "headline": "Measure the walls where you want to install straight lengths.",
                    "description": "Use a tape measure to measure the length of each wall against which you want to hide cables inside lengths of mini trunking. Write down each measurement as you go.If you plan to install mini trunking on many different walls, it can help to draw a rough sketch of the room or rooms and write the measurements down next to each wall to keep it all straight. You can buy straight pieces of mini trunking at a home improvement center or online. There are different brands with slight variations in style and appearance, but they all work in essentially the same way."
                },
                {
                    "headline": "Subtract 16-20 mm from the measurement of any wall with an inside corner.",
                    "description": "An inside corner is where 2 walls meet and form an internal angle. Subtract 16-20 mm from the measurements you got for any such walls to allow room for the internal corner pieces to fit into place.Make sure you write down the new measurements for these walls and cross out the old ones."
                },
                {
                    "headline": "Measure and mark the straight lengths of mini trunking you need to cut.",
                    "description": "Use your tape measure to measure a piece of mini trunking to the correct length for each wall. Make a straight line using a pencil where you will cut the pieces to length.Mini trunking typically comes in sections of 2–3 m (6.6–9.8 ft)."
                },
                {
                    "headline": "Use a mini hacksaw and a miter box to cut the mini trunking pieces to length.",
                    "description": "Place a section of mini trunking in a miter box so that the cut line you marked is lined up with the straight saw slot in the box. Cut straight through the piece of mini trunking along the cut line using a miniature hacksaw.Warning: Be careful whenever you use a saw to cut things. Keep your fingers and other body parts well out of the way. A miniature hacksaw is also known as a junior hacksaw. These have very small blades and thus can be used to make precise cuts in things like plastic or metal tubing."
                }
            ]
        },
        {
            "name": "Installing the Straight Pieces",
            "steps": [
                {
                    "headline": "Peel off the film that covers the adhesive on the back pieces of the lengths.",
                    "description": "Use your fingers to carefully peel off the blue protective backing off from a length of mini trunking. Do this for 1 length at a time when you are ready to stick that piece on the wall.There might also be a clear protective film on the top of the mini trunking. Remove this as well if this is the case."
                },
                {
                    "headline": "Line up the straight pieces on your wall with appropriate spacing.",
                    "description": "Carefully position a length of mini trunking where you want to put it on your wall with the adhesive side facing the wall. Leave 16-20 mm of space between the ends of the mini trunking and the opposite wall in any inside corners.Tip: If your mini trunking has a hinge on 1 side, position it so this side faces downwards so you can easily flip the pieces open to put your cables inside. The lengths can touch on the outside corners, which are the corners where 2 walls meet and form an external angle."
                },
                {
                    "headline": "Stick the straight pieces of mini trunking to the wall using the adhesive.",
                    "description": "Press the adhesive side of each length of mini trunking firmly against the wall to stick it in place. Make sure the pieces are straight and correctly spaced before you stick them to the wall because the adhesive is strong.For particularly long pieces, start sticking the piece to the wall at 1 end, then work your way down to the other end, pressing it against the wall as you go."
                },
                {
                    "headline": "Position the cables you want to hide inside the lengths of mini trunking.",
                    "description": "Unclip the top pieces from the lengths of mini trunking. Tuck the cables neatly inside the lengths and pull them taut so they lie flat inside the mini trunking and don’t bulge out in the corners.You can leave the top pieces unclipped for now in case you have the type of mini trunking corners that fit underneath them."
                }
            ]
        },
        {
            "name": "Clipping the Corners into Place",
            "steps": [
                {
                    "headline": "Check if your mini trunking corners fit over or inside straight lengths.",
                    "description": "Look at the packaging for your mini trunking corner pieces to see if they are clip-over or clip-under. Clip-over corner pieces go on top of closed straight lengths and hold themselves in place, while clip-under corner pieces go inside the straight lengths and are held in place by the top pieces of the lengths.Tip: Clip-under type mini trunking corners are also sometimes called smooth-fit internal bends or external bends. If you don’t have any packaging or instructions for your mini trunking corners, you can compare them to the straight lengths to figure out how they fit. If the diameter is smaller, they go inside the straight lengths. If the diameter is bigger, they go on top of the straight pieces. You can purchase mini trunking corner pieces at a home improvement center or online. If you’re looking online, you can search for “mini trunking finishing accessories.”"
                },
                {
                    "headline": "Clip the top pieces of straight lengths in place if your corner pieces go on top.",
                    "description": "Position the top pieces over the cables and push them onto the back pieces until they lock into place. Don’t put them in place yet if your mini trunking corners go inside the straight lengths.If your straight sections of mini trunking open with a hinge, just flip the top pieces up over the cables and press along the edge without the hinge to lock them in place."
                },
                {
                    "headline": "Snap external corner pieces into place on each outside corner.",
                    "description": "Position the external mini trunking corner pieces over the cables on the outside corners. Clip them into place on top of the closed straight lengths if they are the clip-over variety or position them underneath the top pieces of the straight lengths if they are the clip-under variety.Some varieties of clip-over mini trunking corners have adhesive on the back. Make sure to remove the backing from the adhesive before you press the corner pieces into place if this is the case. If you have clip-under mini trunking corners, start pressing the top pieces of the straight lengths into place over them to keep them from falling out. Just snap the top pieces into place right over the corners and leave the rest of the length unattached until all the corner pieces are in place."
                },
                {
                    "headline": "Clip internal corner pieces into all inside corners.",
                    "description": "Position the internal mini corner trunking pieces over the cables in the inside corners. Put them underneath the top pieces of the straight lengths if they are the clip-under style or clip them on top of the closed straight lengths if they are the clip-over type.If you’re having difficulty fitting inside corner pieces in place because there are imperfections in the wall, you can use a file to shape the pieces so they fit better. For example, if an inside corner is somewhat rounded, you can file the mini trunking corner to round the sharp edges so it sits flush in the corner."
                },
                {
                    "headline": "Attach the top pieces of straight lengths if you didn’t already do so.",
                    "description": "This only applies if you used the clip-under style of mini trunking corners. Press the top pieces against the bottom pieces until they snap into place over the cables.This will already be done if you installed the clip-over type of mini trunking corners."
                }
            ]
        }
    ],
    "tyn": [
        "Tape measure",
        "Pencil",
        "Mini hacksaw",
        "Miter box",
        "Mini trunking straight lengths",
        "Mini trunking corners"
    ],
    "text": " Measuring and Cutting the Straight Lengths Measure the walls where you want to install straight lengths. Use a tape measure to measure the length of each wall against which you want to hide cables inside lengths of mini trunking. Write down each measurement as you go.If you plan to install mini trunking on many different walls, it can help to draw a rough sketch of the room or rooms and write the measurements down next to each wall to keep it all straight. You can buy straight pieces of mini trunking at a home improvement center or online. There are different brands with slight variations in style and appearance, but they all work in essentially the same way. Subtract 16-20 mm from the measurement of any wall with an inside corner. An inside corner is where 2 walls meet and form an internal angle. Subtract 16-20 mm from the measurements you got for any such walls to allow room for the internal corner pieces to fit into place.Make sure you write down the new measurements for these walls and cross out the old ones. Measure and mark the straight lengths of mini trunking you need to cut. Use your tape measure to measure a piece of mini trunking to the correct length for each wall. Make a straight line using a pencil where you will cut the pieces to length.Mini trunking typically comes in sections of 2–3 m (6.6–9.8 ft). Use a mini hacksaw and a miter box to cut the mini trunking pieces to length. Place a section of mini trunking in a miter box so that the cut line you marked is lined up with the straight saw slot in the box. Cut straight through the piece of mini trunking along the cut line using a miniature hacksaw.Warning: Be careful whenever you use a saw to cut things. Keep your fingers and other body parts well out of the way. A miniature hacksaw is also known as a junior hacksaw. These have very small blades and thus can be used to make precise cuts in things like plastic or metal tubing. Installing the Straight Pieces Peel off the film that covers the adhesive on the back pieces of the lengths. Use your fingers to carefully peel off the blue protective backing off from a length of mini trunking. Do this for 1 length at a time when you are ready to stick that piece on the wall.There might also be a clear protective film on the top of the mini trunking. Remove this as well if this is the case. Line up the straight pieces on your wall with appropriate spacing. Carefully position a length of mini trunking where you want to put it on your wall with the adhesive side facing the wall. Leave 16-20 mm of space between the ends of the mini trunking and the opposite wall in any inside corners.Tip: If your mini trunking has a hinge on 1 side, position it so this side faces downwards so you can easily flip the pieces open to put your cables inside. The lengths can touch on the outside corners, which are the corners where 2 walls meet and form an external angle. Stick the straight pieces of mini trunking to the wall using the adhesive. Press the adhesive side of each length of mini trunking firmly against the wall to stick it in place. Make sure the pieces are straight and correctly spaced before you stick them to the wall because the adhesive is strong.For particularly long pieces, start sticking the piece to the wall at 1 end, then work your way down to the other end, pressing it against the wall as you go. Position the cables you want to hide inside the lengths of mini trunking. Unclip the top pieces from the lengths of mini trunking. Tuck the cables neatly inside the lengths and pull them taut so they lie flat inside the mini trunking and don’t bulge out in the corners.You can leave the top pieces unclipped for now in case you have the type of mini trunking corners that fit underneath them. Clipping the Corners into Place Check if your mini trunking corners fit over or inside straight lengths. Look at the packaging for your mini trunking corner pieces to see if they are clip-over or clip-under. Clip-over corner pieces go on top of closed straight lengths and hold themselves in place, while clip-under corner pieces go inside the straight lengths and are held in place by the top pieces of the lengths.Tip: Clip-under type mini trunking corners are also sometimes called smooth-fit internal bends or external bends. If you don’t have any packaging or instructions for your mini trunking corners, you can compare them to the straight lengths to figure out how they fit. If the diameter is smaller, they go inside the straight lengths. If the diameter is bigger, they go on top of the straight pieces. You can purchase mini trunking corner pieces at a home improvement center or online. If you’re looking online, you can search for “mini trunking finishing accessories.” Clip the top pieces of straight lengths in place if your corner pieces go on top. Position the top pieces over the cables and push them onto the back pieces until they lock into place. Don’t put them in place yet if your mini trunking corners go inside the straight lengths.If your straight sections of mini trunking open with a hinge, just flip the top pieces up over the cables and press along the edge without the hinge to lock them in place. Snap external corner pieces into place on each outside corner. Position the external mini trunking corner pieces over the cables on the outside corners. Clip them into place on top of the closed straight lengths if they are the clip-over variety or position them underneath the top pieces of the straight lengths if they are the clip-under variety.Some varieties of clip-over mini trunking corners have adhesive on the back. Make sure to remove the backing from the adhesive before you press the corner pieces into place if this is the case. If you have clip-under mini trunking corners, start pressing the top pieces of the straight lengths into place over them to keep them from falling out. Just snap the top pieces into place right over the corners and leave the rest of the length unattached until all the corner pieces are in place. Clip internal corner pieces into all inside corners. Position the internal mini corner trunking pieces over the cables in the inside corners. Put them underneath the top pieces of the straight lengths if they are the clip-under style or clip them on top of the closed straight lengths if they are the clip-over type.If you’re having difficulty fitting inside corner pieces in place because there are imperfections in the wall, you can use a file to shape the pieces so they fit better. For example, if an inside corner is somewhat rounded, you can file the mini trunking corner to round the sharp edges so it sits flush in the corner. Attach the top pieces of straight lengths if you didn’t already do so. This only applies if you used the clip-under style of mini trunking corners. Press the top pieces against the bottom pieces until they snap into place over the cables.This will already be done if you installed the clip-over type of mini trunking corners.",
    "sentences": [
        " Measuring and Cutting the Straight Lengths Measure the walls where you want to install straight lengths.",
        "Use a tape measure to measure the length of each wall against which you want to hide cables inside lengths of mini trunking.",
        "Write down each measurement as you go.If you plan to install mini trunking on many different walls, it can help to draw a rough sketch of the room or rooms and write the measurements down next to each wall to keep it all straight.",
        "You can buy straight pieces of mini trunking at a home improvement center or online.",
        "There are different brands with slight variations in style and appearance, but they all work in essentially the same way.",
        "Subtract 16-20 mm from the measurement of any wall with an inside corner.",
        "An inside corner is where 2 walls meet and form an internal angle.",
        "Subtract 16-20 mm from the measurements you got for any such walls to allow room for the internal corner pieces to fit into place.Make sure you write down the new measurements for these walls and cross out the old ones.",
        "Measure and mark the straight lengths of mini trunking you need to cut.",
        "Use your tape measure to measure a piece of mini trunking to the correct length for each wall.",
        "Make a straight line using a pencil where you will cut the pieces to length.Mini trunking typically comes in sections of 2–3 m (6.6–9.8 ft).",
        "Use a mini hacksaw and a miter box to cut the mini trunking pieces to length.",
        "Place a section of mini trunking in a miter box so that the cut line you marked is lined up with the straight saw slot in the box.",
        "Cut straight through the piece of mini trunking along the cut line using a miniature hacksaw.Warning: Be careful whenever you use a saw to cut things.",
        "Keep your fingers and other body parts well out of the way.",
        "A miniature hacksaw is also known as a junior hacksaw.",
        "These have very small blades and thus can be used to make precise cuts in things like plastic or metal tubing.",
        "Installing the Straight Pieces Peel off the film that covers the adhesive on the back pieces of the lengths.",
        "Use your fingers to carefully peel off the blue protective backing off from a length of mini trunking.",
        "Do this for 1 length at a time when you are ready to stick that piece on the wall.There might also be a clear protective film on the top of the mini trunking.",
        "Remove this as well if this is the case.",
        "Line up the straight pieces on your wall with appropriate spacing.",
        "Carefully position a length of mini trunking where you want to put it on your wall with the adhesive side facing the wall.",
        "Leave 16-20 mm of space between the ends of the mini trunking and the opposite wall in any inside corners.Tip: If your mini trunking has a hinge on 1 side, position it so this side faces downwards so you can easily flip the pieces open to put your cables inside.",
        "The lengths can touch on the outside corners, which are the corners where 2 walls meet and form an external angle.",
        "Stick the straight pieces of mini trunking to the wall using the adhesive.",
        "Press the adhesive side of each length of mini trunking firmly against the wall to stick it in place.",
        "Make sure the pieces are straight and correctly spaced before you stick them to the wall because the adhesive is strong.For particularly long pieces, start sticking the piece to the wall at 1 end, then work your way down to the other end, pressing it against the wall as you go.",
        "Position the cables you want to hide inside the lengths of mini trunking.",
        "Unclip the top pieces from the lengths of mini trunking.",
        "Tuck the cables neatly inside the lengths and pull them taut so they lie flat inside the mini trunking and don’t bulge out in the corners.You can leave the top pieces unclipped for now in case you have the type of mini trunking corners that fit underneath them.",
        "Clipping the Corners into Place Check if your mini trunking corners fit over or inside straight lengths.",
        "Look at the packaging for your mini trunking corner pieces to see if they are clip-over or clip-under.",
        "Clip-over corner pieces go on top of closed straight lengths and hold themselves in place, while clip-under corner pieces go inside the straight lengths and are held in place by the top pieces of the lengths.Tip: Clip-under type mini trunking corners are also sometimes called smooth-fit internal bends or external bends.",
        "If you don’t have any packaging or instructions for your mini trunking corners, you can compare them to the straight lengths to figure out how they fit.",
        "If the diameter is smaller, they go inside the straight lengths.",
        "If the diameter is bigger, they go on top of the straight pieces.",
        "You can purchase mini trunking corner pieces at a home improvement center or online.",
        "If you’re looking online, you can search for “mini trunking finishing accessories.” Clip the top pieces of straight lengths in place if your corner pieces go on top.",
        "Position the top pieces over the cables and push them onto the back pieces until they lock into place.",
        "Don’t put them in place yet if your mini trunking corners go inside the straight lengths.If your straight sections of mini trunking open with a hinge, just flip the top pieces up over the cables and press along the edge without the hinge to lock them in place.",
        "Snap external corner pieces into place on each outside corner.",
        "Position the external mini trunking corner pieces over the cables on the outside corners.",
        "Clip them into place on top of the closed straight lengths if they are the clip-over variety or position them underneath the top pieces of the straight lengths if they are the clip-under variety.Some varieties of clip-over mini trunking corners have adhesive on the back.",
        "Make sure to remove the backing from the adhesive before you press the corner pieces into place if this is the case.",
        "If you have clip-under mini trunking corners, start pressing the top pieces of the straight lengths into place over them to keep them from falling out.",
        "Just snap the top pieces into place right over the corners and leave the rest of the length unattached until all the corner pieces are in place.",
        "Clip internal corner pieces into all inside corners.",
        "Position the internal mini corner trunking pieces over the cables in the inside corners.",
        "Put them underneath the top pieces of the straight lengths if they are the clip-under style or clip them on top of the closed straight lengths if they are the clip-over type.If you’re having difficulty fitting inside corner pieces in place because there are imperfections in the wall, you can use a file to shape the pieces so they fit better.",
        "For example, if an inside corner is somewhat rounded, you can file the mini trunking corner to round the sharp edges so it sits flush in the corner.",
        "Attach the top pieces of straight lengths if you didn’t already do so.",
        "This only applies if you used the clip-under style of mini trunking corners.",
        "Press the top pieces against the bottom pieces until they snap into place over the cables.This will already be done if you installed the clip-over type of mini trunking corners."
    ]
}