{
    "title": "How to Cook Prunes",
    "url": "https://www.wikihow.com/Cook-Prunes",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Food Preservation Techniques"
    ],
    "methods": [
        {
            "name": "Stewing Prunes",
            "steps": [
                {
                    "headline": "Place the prunes, water, and orange juice into a small pan.",
                    "description": "Grab about 15 prunes and combine them with 1.5 cups (350 mL) of water and 1 to 2 tablespoons (15 to 30 mL) of orange juice. You don’t have to put in the orange juice unless you’d like a slightly sweeter, more tart taste.Tip: You can also put 1/8 tsp (4 g) of cinnamon into the mixture if you aren’t using stewed prunes to relieve constipation. Cinnamon will harden up your stool, not soften it, but it will make your stewed prunes tastier. To make spiced prunes, add 1 tsp (5 g) of ground cinnamon, 1 tsp (5 g) of ground cloves, 1/2 tsp (2.5 g) of ground ginger, and 3 tablespoons (44 mL) of lemon juice instead of orange juice."
                },
                {
                    "headline": "Bring the mixture to a boil, then cover it.",
                    "description": "Turn your stovetop on high until you see large bubbles forming in your mixture, or for about 5 minutes. Then, use a lid for your pan and cover up the mixture so that the steam can’t escape. Trapping the steam in your pan will soften the prunes faster."
                },
                {
                    "headline": "Simmer your mixture for 30 minutes.",
                    "description": "Turn your stovetop down to medium heat so that small bubbles rise to the surface of your mixture. Keep an eye on your pan, and if it starts to bubble over, turn the heat down again. Simmering allows the water to cook out slightly and turn your mixture into more of a thick syrup."
                },
                {
                    "headline": "Serve the prunes and hot syrup in a bowl.",
                    "description": "Transfer your mixture directly to a bowl and eat it while it’s hot. You can pour milk over it to eat it traditionally, or eat it plain for medicinal purposes. Stewed prunes are great for reducing constipation since they are so high in fiber. You can also pour your stewed prunes over greek yogurt for a simple dessert. Keep your stewed prunes in the fridge in an airtight container for 4 to 5 days."
                }
            ]
        },
        {
            "name": "Making a Prune Puree for Babies",
            "steps": [
                {
                    "headline": "Soak your prunes in water for 30 minutes.",
                    "description": "Fill a large bowl about half full with lukewarm water from your sink. Soak 15 to 20 prunes in the water until they get soft enough to mash. You can also steam them on the stovetop with 1 to 2 tablespoons (15 to 30 mL) of water for about 10 minutes instead."
                },
                {
                    "headline": "Puree them in a blender with the water.",
                    "description": "Pulse your blender a few times until the prunes are smooth. Add in more water if you need to, since prunes tend to get sticky when they are pureed.Tip: Add in 2 to 3 tablespoons (30 to 44 mL) of orange juice to make the puree taste better. If you don’t have a blender, use a fork to mash up the prunes instead."
                },
                {
                    "headline": "Mash out any lumps with a fork or your hands.",
                    "description": "Pour the puree into a bowl and make sure it is completely smooth. Use a fork to mash out any lumps so that your baby doesn’t have any trouble eating the puree."
                },
                {
                    "headline": "Serve the puree to your baby to relieve constipation.",
                    "description": "Prunes are high in fiber, so they are great for helping induce bowel movements. You can give a prune puree to a baby as young as 6 months old. If your baby doesn’t like the taste of prunes, try adding them to porridge or oatmeal. Talk to your doctor if your baby is constipated for more than 5 days in a row."
                }
            ]
        },
        {
            "name": "Cooking Bacon-Wrapped Prunes",
            "steps": [
                {
                    "headline": "Preheat your oven to 400 °F (204 °C).",
                    "description": "The heat of your oven will cook the bacon while softening the prune on the inside. Keep your oven up high so that the bacon cooks quickly."
                },
                {
                    "headline": "Grease a baking tray with vegetable oil.",
                    "description": "Use a pastry brush or a paper towel to lightly brush 1 to 2 drops of vegetable oil onto a baking tray. Don’t let the oil pool up anywhere; instead, make sure there is a thin coating over the entire tray. The oil will also help crisp up the bacon while it’s in the oven."
                },
                {
                    "headline": "Lay out your slices of bacon and place a prune at the top of each one.",
                    "description": "Spread out each bacon slice onto a flat surface, like your countertop or kitchen table. Place 1 prune at the top of each slice of bacon to get ready to roll them.Tip: If you want to, stuff an almond into each prune before you start for some extra crunchy and nutty flavor. If your bacon slices are wider than the prunes, cut them in half."
                },
                {
                    "headline": "Roll the prune into the bacon and secure it with a toothpick.",
                    "description": "Tuck the top part of the bacon piece over the top of the prune and continue rolling it down until it reaches the end of the bacon. Stick a toothpick into the top of the bacon and prune roll to keep it all together. Without a toothpick, the bacon will probably unroll in the oven."
                },
                {
                    "headline": "Bake the prunes for 10 to 15 minutes.",
                    "description": "Wait until the bacon is crispy and dark brown on both sides. If the bacon starts to turn black, take your prunes out of the oven right away. If you need to, turn the prune and bacon rolls over in the oven so they cook evenly."
                },
                {
                    "headline": "Serve your bacon wraps while they are warm.",
                    "description": "Transfer your bacon-wrapped prunes to a serving dish or tray and hand them out to your guests. Keep the toothpicks in them so that your guests can pick them up easily without getting their hands dirty. Bacon-wrapped prunes are great for cocktail hours or appetizers."
                }
            ]
        }
    ],
    "tyn": [
        "Stewing Prunes",
        "Small pan",
        "Lid",
        "Bowl",
        "Making a Prune Puree for Babies",
        "Large bowl",
        "Blender or fork",
        "Cooking Bacon Wrapped Prunes",
        "Baking tray",
        "Toothpicks"
    ],
    "text": " Stewing Prunes Place the prunes, water, and orange juice into a small pan. Grab about 15 prunes and combine them with 1.5 cups (350 mL) of water and 1 to 2 tablespoons (15 to 30 mL) of orange juice. You don’t have to put in the orange juice unless you’d like a slightly sweeter, more tart taste.Tip: You can also put 1/8 tsp (4 g) of cinnamon into the mixture if you aren’t using stewed prunes to relieve constipation. Cinnamon will harden up your stool, not soften it, but it will make your stewed prunes tastier. To make spiced prunes, add 1 tsp (5 g) of ground cinnamon, 1 tsp (5 g) of ground cloves, 1/2 tsp (2.5 g) of ground ginger, and 3 tablespoons (44 mL) of lemon juice instead of orange juice. Bring the mixture to a boil, then cover it. Turn your stovetop on high until you see large bubbles forming in your mixture, or for about 5 minutes. Then, use a lid for your pan and cover up the mixture so that the steam can’t escape. Trapping the steam in your pan will soften the prunes faster. Simmer your mixture for 30 minutes. Turn your stovetop down to medium heat so that small bubbles rise to the surface of your mixture. Keep an eye on your pan, and if it starts to bubble over, turn the heat down again. Simmering allows the water to cook out slightly and turn your mixture into more of a thick syrup. Serve the prunes and hot syrup in a bowl. Transfer your mixture directly to a bowl and eat it while it’s hot. You can pour milk over it to eat it traditionally, or eat it plain for medicinal purposes. Stewed prunes are great for reducing constipation since they are so high in fiber. You can also pour your stewed prunes over greek yogurt for a simple dessert. Keep your stewed prunes in the fridge in an airtight container for 4 to 5 days. Making a Prune Puree for Babies Soak your prunes in water for 30 minutes. Fill a large bowl about half full with lukewarm water from your sink. Soak 15 to 20 prunes in the water until they get soft enough to mash. You can also steam them on the stovetop with 1 to 2 tablespoons (15 to 30 mL) of water for about 10 minutes instead. Puree them in a blender with the water. Pulse your blender a few times until the prunes are smooth. Add in more water if you need to, since prunes tend to get sticky when they are pureed.Tip: Add in 2 to 3 tablespoons (30 to 44 mL) of orange juice to make the puree taste better. If you don’t have a blender, use a fork to mash up the prunes instead. Mash out any lumps with a fork or your hands. Pour the puree into a bowl and make sure it is completely smooth. Use a fork to mash out any lumps so that your baby doesn’t have any trouble eating the puree. Serve the puree to your baby to relieve constipation. Prunes are high in fiber, so they are great for helping induce bowel movements. You can give a prune puree to a baby as young as 6 months old. If your baby doesn’t like the taste of prunes, try adding them to porridge or oatmeal. Talk to your doctor if your baby is constipated for more than 5 days in a row. Cooking Bacon-Wrapped Prunes Preheat your oven to 400 °F (204 °C). The heat of your oven will cook the bacon while softening the prune on the inside. Keep your oven up high so that the bacon cooks quickly. Grease a baking tray with vegetable oil. Use a pastry brush or a paper towel to lightly brush 1 to 2 drops of vegetable oil onto a baking tray. Don’t let the oil pool up anywhere; instead, make sure there is a thin coating over the entire tray. The oil will also help crisp up the bacon while it’s in the oven. Lay out your slices of bacon and place a prune at the top of each one. Spread out each bacon slice onto a flat surface, like your countertop or kitchen table. Place 1 prune at the top of each slice of bacon to get ready to roll them.Tip: If you want to, stuff an almond into each prune before you start for some extra crunchy and nutty flavor. If your bacon slices are wider than the prunes, cut them in half. Roll the prune into the bacon and secure it with a toothpick. Tuck the top part of the bacon piece over the top of the prune and continue rolling it down until it reaches the end of the bacon. Stick a toothpick into the top of the bacon and prune roll to keep it all together. Without a toothpick, the bacon will probably unroll in the oven. Bake the prunes for 10 to 15 minutes. Wait until the bacon is crispy and dark brown on both sides. If the bacon starts to turn black, take your prunes out of the oven right away. If you need to, turn the prune and bacon rolls over in the oven so they cook evenly. Serve your bacon wraps while they are warm. Transfer your bacon-wrapped prunes to a serving dish or tray and hand them out to your guests. Keep the toothpicks in them so that your guests can pick them up easily without getting their hands dirty. Bacon-wrapped prunes are great for cocktail hours or appetizers.",
    "sentences": [
        " Stewing Prunes Place the prunes, water, and orange juice into a small pan.",
        "Grab about 15 prunes and combine them with 1.5 cups (350 mL) of water and 1 to 2 tablespoons (15 to 30 mL) of orange juice.",
        "You don’t have to put in the orange juice unless you’d like a slightly sweeter, more tart taste.Tip: You can also put 1/8 tsp (4 g) of cinnamon into the mixture if you aren’t using stewed prunes to relieve constipation.",
        "Cinnamon will harden up your stool, not soften it, but it will make your stewed prunes tastier.",
        "To make spiced prunes, add 1 tsp (5 g) of ground cinnamon, 1 tsp (5 g) of ground cloves, 1/2 tsp (2.5 g) of ground ginger, and 3 tablespoons (44 mL) of lemon juice instead of orange juice.",
        "Bring the mixture to a boil, then cover it.",
        "Turn your stovetop on high until you see large bubbles forming in your mixture, or for about 5 minutes.",
        "Then, use a lid for your pan and cover up the mixture so that the steam can’t escape.",
        "Trapping the steam in your pan will soften the prunes faster.",
        "Simmer your mixture for 30 minutes.",
        "Turn your stovetop down to medium heat so that small bubbles rise to the surface of your mixture.",
        "Keep an eye on your pan, and if it starts to bubble over, turn the heat down again.",
        "Simmering allows the water to cook out slightly and turn your mixture into more of a thick syrup.",
        "Serve the prunes and hot syrup in a bowl.",
        "Transfer your mixture directly to a bowl and eat it while it’s hot.",
        "You can pour milk over it to eat it traditionally, or eat it plain for medicinal purposes.",
        "Stewed prunes are great for reducing constipation since they are so high in fiber.",
        "You can also pour your stewed prunes over greek yogurt for a simple dessert.",
        "Keep your stewed prunes in the fridge in an airtight container for 4 to 5 days.",
        "Making a Prune Puree for Babies Soak your prunes in water for 30 minutes.",
        "Fill a large bowl about half full with lukewarm water from your sink.",
        "Soak 15 to 20 prunes in the water until they get soft enough to mash.",
        "You can also steam them on the stovetop with 1 to 2 tablespoons (15 to 30 mL) of water for about 10 minutes instead.",
        "Puree them in a blender with the water.",
        "Pulse your blender a few times until the prunes are smooth.",
        "Add in more water if you need to, since prunes tend to get sticky when they are pureed.Tip: Add in 2 to 3 tablespoons (30 to 44 mL) of orange juice to make the puree taste better.",
        "If you don’t have a blender, use a fork to mash up the prunes instead.",
        "Mash out any lumps with a fork or your hands.",
        "Pour the puree into a bowl and make sure it is completely smooth.",
        "Use a fork to mash out any lumps so that your baby doesn’t have any trouble eating the puree.",
        "Serve the puree to your baby to relieve constipation.",
        "Prunes are high in fiber, so they are great for helping induce bowel movements.",
        "You can give a prune puree to a baby as young as 6 months old.",
        "If your baby doesn’t like the taste of prunes, try adding them to porridge or oatmeal.",
        "Talk to your doctor if your baby is constipated for more than 5 days in a row.",
        "Cooking Bacon-Wrapped Prunes Preheat your oven to 400 °F (204 °C).",
        "The heat of your oven will cook the bacon while softening the prune on the inside.",
        "Keep your oven up high so that the bacon cooks quickly.",
        "Grease a baking tray with vegetable oil.",
        "Use a pastry brush or a paper towel to lightly brush 1 to 2 drops of vegetable oil onto a baking tray.",
        "Don’t let the oil pool up anywhere; instead, make sure there is a thin coating over the entire tray.",
        "The oil will also help crisp up the bacon while it’s in the oven.",
        "Lay out your slices of bacon and place a prune at the top of each one.",
        "Spread out each bacon slice onto a flat surface, like your countertop or kitchen table.",
        "Place 1 prune at the top of each slice of bacon to get ready to roll them.Tip: If you want to, stuff an almond into each prune before you start for some extra crunchy and nutty flavor.",
        "If your bacon slices are wider than the prunes, cut them in half.",
        "Roll the prune into the bacon and secure it with a toothpick.",
        "Tuck the top part of the bacon piece over the top of the prune and continue rolling it down until it reaches the end of the bacon.",
        "Stick a toothpick into the top of the bacon and prune roll to keep it all together.",
        "Without a toothpick, the bacon will probably unroll in the oven.",
        "Bake the prunes for 10 to 15 minutes.",
        "Wait until the bacon is crispy and dark brown on both sides.",
        "If the bacon starts to turn black, take your prunes out of the oven right away.",
        "If you need to, turn the prune and bacon rolls over in the oven so they cook evenly.",
        "Serve your bacon wraps while they are warm.",
        "Transfer your bacon-wrapped prunes to a serving dish or tray and hand them out to your guests.",
        "Keep the toothpicks in them so that your guests can pick them up easily without getting their hands dirty.",
        "Bacon-wrapped prunes are great for cocktail hours or appetizers."
    ]
}