{
    "title": "How to Draw Scooby Doo",
    "url": "https://www.wikihow.com/Draw-Scooby-Doo",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Movies",
        "Filmmaking",
        "Animation"
    ],
    "steps": [
        {
            "headline": "Draw three circular shapes.",
            "description": "Draw two true circles for the beginning of Scooby's body; the largest circle forms Scooby's torso and the smaller circle forms his rear end. The third and highest shape should be an oval drawn vertically for Scooby's head."
        },
        {
            "headline": "Sketch a horizontal oval that rests at approximately the middle of the original head oval.",
            "description": "This is for Scooby Doo's snout. Draw a small circle at the end of his snout for the nose."
        },
        {
            "headline": "Draw two light lines going from his head downward, to create Scooby Doo's neck.",
            "description": "The front line should touch the front edge of the torso circle."
        },
        {
            "headline": "Draw the torso and rear of Scooby.",
            "description": "The back line should curve and skim across the top lines of the circles for Scooby Doo's torso and rear. Add a small curved line between the bottom of these circles to form his belly."
        },
        {
            "headline": "Sketch a half heart under his snout for his chin and lower lip.",
            "description": ""
        },
        {
            "headline": "Draw a line about 1 inch (2.5cm) long from the top of the rear circle down.",
            "description": ""
        },
        {
            "headline": "Make a small circle for Scooby's knee.",
            "description": "Draw a smaller line from the knee's bottom down for the lower leg. Repeat for the other rear leg."
        },
        {
            "headline": "Draw two \"boot\"-like shapes for Scooby's back paws and an \"S\"-shaped line from the top of his rear for the beginning of his tail.",
            "description": ""
        },
        {
            "headline": "Draw four straight lines from the front circle to make Scooby's front legs.",
            "description": "The line ends should be slightly kinked so that the paws face away from each other."
        },
        {
            "headline": "Finish Scooby's tail by connecting a line from the tip back to the hip.",
            "description": "The tail should look like a snake. Place four small lines across the back paws to make toes."
        },
        {
            "headline": "Draw two crooked cones for Scooby's ears.",
            "description": "Make two marks near the top of the oval for his eyebrows."
        },
        {
            "headline": "Draw two small circles on top of Scooby's snout for his eyes.",
            "description": "Draw two connecting lines around his neck for a collar."
        },
        {
            "headline": "Draw the \"boot\" shape for the front paws, making sure they point away from each other.",
            "description": "Add four lines in each paw for toes."
        },
        {
            "headline": "Draw the spots on Scooby's back and legs.",
            "description": "Add two dots for his eyeballs and a small \"V\" inside the ears to complete them."
        },
        {
            "headline": "Sketch a semi-circle onto the collar and a diamond on the end of Scooby's name tag.",
            "description": "Erase your guide marks and color as desired."
        },
        {
            "headline": "Erase the parts you don't need",
            "description": ""
        }
    ],
    "tyn": [
        "White paper",
        "2 pencils (preferably one dark and one light)",
        "Eraser"
    ],
    "text": " Draw three circular shapes. Draw two true circles for the beginning of Scooby's body; the largest circle forms Scooby's torso and the smaller circle forms his rear end. The third and highest shape should be an oval drawn vertically for Scooby's head. Sketch a horizontal oval that rests at approximately the middle of the original head oval. This is for Scooby Doo's snout. Draw a small circle at the end of his snout for the nose. Draw two light lines going from his head downward, to create Scooby Doo's neck. The front line should touch the front edge of the torso circle. Draw the torso and rear of Scooby. The back line should curve and skim across the top lines of the circles for Scooby Doo's torso and rear. Add a small curved line between the bottom of these circles to form his belly. Sketch a half heart under his snout for his chin and lower lip.  Draw a line about 1 inch (2.5cm) long from the top of the rear circle down.  Make a small circle for Scooby's knee. Draw a smaller line from the knee's bottom down for the lower leg. Repeat for the other rear leg. Draw two \"boot\"-like shapes for Scooby's back paws and an \"S\"-shaped line from the top of his rear for the beginning of his tail.  Draw four straight lines from the front circle to make Scooby's front legs. The line ends should be slightly kinked so that the paws face away from each other. Finish Scooby's tail by connecting a line from the tip back to the hip. The tail should look like a snake. Place four small lines across the back paws to make toes. Draw two crooked cones for Scooby's ears. Make two marks near the top of the oval for his eyebrows. Draw two small circles on top of Scooby's snout for his eyes. Draw two connecting lines around his neck for a collar. Draw the \"boot\" shape for the front paws, making sure they point away from each other. Add four lines in each paw for toes. Draw the spots on Scooby's back and legs. Add two dots for his eyeballs and a small \"V\" inside the ears to complete them. Sketch a semi-circle onto the collar and a diamond on the end of Scooby's name tag. Erase your guide marks and color as desired. Erase the parts you don't need ",
    "sentences": [
        " Draw three circular shapes.",
        "Draw two true circles for the beginning of Scooby's body; the largest circle forms Scooby's torso and the smaller circle forms his rear end.",
        "The third and highest shape should be an oval drawn vertically for Scooby's head.",
        "Sketch a horizontal oval that rests at approximately the middle of the original head oval.",
        "This is for Scooby Doo's snout.",
        "Draw a small circle at the end of his snout for the nose.",
        "Draw two light lines going from his head downward, to create Scooby Doo's neck.",
        "The front line should touch the front edge of the torso circle.",
        "Draw the torso and rear of Scooby.",
        "The back line should curve and skim across the top lines of the circles for Scooby Doo's torso and rear.",
        "Add a small curved line between the bottom of these circles to form his belly.",
        "Sketch a half heart under his snout for his chin and lower lip.",
        "Draw a line about 1 inch (2.5cm) long from the top of the rear circle down.",
        "Make a small circle for Scooby's knee.",
        "Draw a smaller line from the knee's bottom down for the lower leg.",
        "Repeat for the other rear leg.",
        "Draw two \"boot\"-like shapes for Scooby's back paws and an \"S\"-shaped line from the top of his rear for the beginning of his tail.",
        "Draw four straight lines from the front circle to make Scooby's front legs.",
        "The line ends should be slightly kinked so that the paws face away from each other.",
        "Finish Scooby's tail by connecting a line from the tip back to the hip.",
        "The tail should look like a snake.",
        "Place four small lines across the back paws to make toes.",
        "Draw two crooked cones for Scooby's ears.",
        "Make two marks near the top of the oval for his eyebrows.",
        "Draw two small circles on top of Scooby's snout for his eyes.",
        "Draw two connecting lines around his neck for a collar.",
        "Draw the \"boot\" shape for the front paws, making sure they point away from each other.",
        "Add four lines in each paw for toes.",
        "Draw the spots on Scooby's back and legs.",
        "Add two dots for his eyeballs and a small \"V\" inside the ears to complete them.",
        "Sketch a semi-circle onto the collar and a diamond on the end of Scooby's name tag.",
        "Erase your guide marks and color as desired.",
        "Erase the parts you don't need"
    ]
}