{
    "title": "How to Cut Your Own Curly Hair",
    "url": "https://www.wikihow.com/Cut-Your-Own-Curly-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Haircuts"
    ],
    "methods": [
        {
            "name": "Cutting Dry Curly Hair",
            "steps": [
                {
                    "headline": "Style your hair as usual.",
                    "description": "Before you begin trimming your curls, start with dry hair that is styled how you normally wear it. Make sure that your curls are laid out the way that you like them to be."
                },
                {
                    "headline": "Wrap a towel around your neck and shoulders.",
                    "description": "Secure the towel with a strong hair clip or safety pin. The towel will help prevent hair from getting on your neck and clothing. You may also want to put some newspaper on the floor to catch the hair that you trim off. If you have a hairdresser's cape, you can use this in place of a towel."
                },
                {
                    "headline": "Arrange your mirrors.",
                    "description": "Before you begin, make sure that you will be able to see the front and back of your hair by placing one mirror in front of you and another behind you. You can use your bathroom mirror as one of the mirrors for this purpose. The mirrors should be facing each other. Adjust the mirrors until you can see the front and the back of your head in the mirror in front of you. If you have long hair, this step is optional since you should be able to bring each strand forward as you trim your curls."
                },
                {
                    "headline": "Trim your curls.",
                    "description": "Separate your hair into sections to give you the most control over your cut. Then, using a pair of sharp haircutting scissors, trim the ends of each of your curls. Make sure the scissors you use are meant for cutting hair and that they are very sharp.Cut the hair near the ends or in the curve of the curl. Begin by trimming the topmost layers and work your way down through your curls, section by section."
                },
                {
                    "headline": "Separate the trimmed curls from the untrimmed curls.",
                    "description": "After you finish trimming the ends of one layer, use a hair clip to separate the trimmed hair from the hair that you have not yet cut. Keeping the trimmed hair separate will help prevent you from cutting the same curls twice. Continue trimming the ends of your curls until you have trimmed them all. This may take a while, especially if you have thick hair. Just be patient and don’t rush!"
                },
                {
                    "headline": "Shake out your curls.",
                    "description": "When you are finished, run your fingers through your curls and shake them out."
                },
                {
                    "headline": "Inspect your curls.",
                    "description": "Inspect your hair from all angles and make sure it looks how you want it to look. Use the scissors to touch up any spots that don’t look right. Look for any strands that are drastically longer than others or that are angled differently and trim as needed."
                }
            ]
        },
        {
            "name": "Cutting Braided Curly Hair",
            "steps": [
                {
                    "headline": "Detangle your hair.",
                    "description": "Brush all of your hair until the brush moves through your hair easily, with little or no resistance. Make sure that there are no tangles and that your hair is ready to be braided."
                },
                {
                    "headline": "Separate your hair into 1” sections and braid each section as you go.",
                    "description": "Use a comb to separate each section from the rest of your hair. After you have separated each section, braid it and secure it with a small elastic hair band. Leave about a 1” tail of unbraided hair at the bottom of the braid."
                },
                {
                    "headline": "Braid all of your hair.",
                    "description": "Continue sectioning and braiding your hair until you have braided all of it. The number of braids you will have when you are done will depend on the thickness of your hair, but you should have several small braids when you are done."
                },
                {
                    "headline": "Wrap a towel around your neck and shoulders.",
                    "description": "Secure the towel with a strong hair clip or safety pin. The towel will help prevent hair from getting on your neck and clothing. You may also want to put some newspaper on the floor to catch the hair that you trim off."
                },
                {
                    "headline": "Trim the end of each braid.",
                    "description": "Cut the ¼”- ½”section off the bottom of the braid. Make sure the scissors you use are meant for cutting hair and that they are very sharp. Make sure that you cut straight across and not at an angle. After you make your first cut, measure the next braid side-by-side with the first. Use the already-cut braids as a guide for the next braid to make sure your hair is as even as possible."
                },
                {
                    "headline": "Remove the braids from your hair.",
                    "description": "Take your hair out of the braids, run your fingers through your hair, and shake out your curls."
                },
                {
                    "headline": "Inspect your curls.",
                    "description": "Inspect your hair from all angles and make sure it looks how you want it to look. Use the scissors to touch up any spots that don’t look right. Look for any strands that are drastically longer than others or that are angled differently and trim as needed."
                }
            ]
        },
        {
            "name": "Cutting Hair in Pigtails",
            "steps": [
                {
                    "headline": "Detangle your hair.",
                    "description": "Brush all of your hair until the brush moves through your hair easily, with little or no resistance. Make sure that there are no tangles and that your hair is ready to be put into pigtails."
                },
                {
                    "headline": "Put your hair into pigtails.",
                    "description": "Separate your hair into two low pigtails on the sides of your head. Bring the ends of the pigtails in front of your shoulders so that you can see what you are doing."
                },
                {
                    "headline": "Wrap a towel around your neck and shoulders.",
                    "description": "Secure the towel with a strong hair clip or safety pin. The towel will help prevent hair from getting on your neck and clothing. You may also want to put some newspaper on the floor to catch the hair that you trim off."
                },
                {
                    "headline": "Decide how short you want to go.",
                    "description": "Identify the amount of length that you would like to cut and hold your hair around this section using your middle and index fingers."
                },
                {
                    "headline": "Cut your hair.",
                    "description": "For each pigtail, cut the hair in a straight line just below where you are holding it with your fingers. Make sure the scissors you use are meant for cutting hair and that they are very sharp. You can cut your hair at a slight angle if you’d like a bit of a slant to your cut. Just make sure that you cut the other pigtail at a similar complementary angle."
                },
                {
                    "headline": "Remove the elastic hairbands.",
                    "description": "Take your hair out of the pigtails, run your fingers through your hair, and shake out your curls."
                },
                {
                    "headline": "Inspect your curls.",
                    "description": "Inspect your hair from all angles and make sure it looks how you want it to look. Use the scissors to touch up any spots that don’t look right. Look for any strands that are drastically longer than others or that are angled differently and trim as needed."
                }
            ]
        },
        {
            "name": "Cutting Damp Curly Hair",
            "steps": [
                {
                    "headline": "Wash and condition your hair.",
                    "description": "After you have finished washing your hair, dry it with a towel and proceed with your normal styling routine, but do not blow dry your hair. Let your hair air dry for a while until it is just damp."
                },
                {
                    "headline": "Wrap a towel around your neck and shoulders.",
                    "description": "Secure the towel with a strong hair clip or safety pin. The towel will help prevent hair from getting on your neck and clothing. You may also want to put some newspaper on the floor to catch the hair that you trim off."
                },
                {
                    "headline": "Arrange your mirrors.",
                    "description": "Before you begin, make sure that you will be able to see the front and back of your hair by placing one mirror in front of you and another behind you. The mirrors should be facing each other. Adjust the mirrors until you can see the front and the back of your head in the mirror in front of you. If you have long hair, this step is optional since you should be able to bring each strand forward as you trim your curls."
                },
                {
                    "headline": "Trim your curls.",
                    "description": "Using a pair of sharp haircutting scissors, trim the ends of each of your curls. Make sure the scissors you use are meant for cutting hair and that they are very sharp. Cut the hair near the ends or in the curve of the curl. Begin by trimming the topmost layers and work your way down through your curls, layer by layer."
                },
                {
                    "headline": "Separate the trimmed curls from the untrimmed curls.",
                    "description": "After you finish trimming the ends of one layer, use a hair clip to separate the trimmed hair from the hair that you have not yet cut. Keeping the trimmed hair separate will help prevent you from cutting the same curls twice. Continue trimming the ends of your curls until you have trimmed them all. This may take a while, especially if you have thick hair. Just be patient and don’t rush!"
                },
                {
                    "headline": "Shake out your curls.",
                    "description": "When you are finished, run your fingers through your curls and shake them out."
                },
                {
                    "headline": "Inspect your curls.",
                    "description": "Inspect your hair from all angles and make sure it looks how you want it to look. Use the scissors to touch up any spots that don’t look right. Look for any strands that are drastically longer than others or that are angled differently and trim as needed."
                }
            ]
        }
    ],
    "tyn": [
        "Method 1",
        "pair of haircutting scissors",
        "hair clips",
        "two mirrors",
        "towel",
        "Method 2",
        "hair bands",
        "comb and/or brush",
        "Method 3",
        "Method 4",
        "shampoo and conditioner",
        "comb and brush"
    ],
    "text": " Cutting Dry Curly Hair Style your hair as usual. Before you begin trimming your curls, start with dry hair that is styled how you normally wear it. Make sure that your curls are laid out the way that you like them to be. Wrap a towel around your neck and shoulders. Secure the towel with a strong hair clip or safety pin. The towel will help prevent hair from getting on your neck and clothing. You may also want to put some newspaper on the floor to catch the hair that you trim off. If you have a hairdresser's cape, you can use this in place of a towel. Arrange your mirrors. Before you begin, make sure that you will be able to see the front and back of your hair by placing one mirror in front of you and another behind you. You can use your bathroom mirror as one of the mirrors for this purpose. The mirrors should be facing each other. Adjust the mirrors until you can see the front and the back of your head in the mirror in front of you. If you have long hair, this step is optional since you should be able to bring each strand forward as you trim your curls. Trim your curls. Separate your hair into sections to give you the most control over your cut. Then, using a pair of sharp haircutting scissors, trim the ends of each of your curls. Make sure the scissors you use are meant for cutting hair and that they are very sharp.Cut the hair near the ends or in the curve of the curl. Begin by trimming the topmost layers and work your way down through your curls, section by section. Separate the trimmed curls from the untrimmed curls. After you finish trimming the ends of one layer, use a hair clip to separate the trimmed hair from the hair that you have not yet cut. Keeping the trimmed hair separate will help prevent you from cutting the same curls twice. Continue trimming the ends of your curls until you have trimmed them all. This may take a while, especially if you have thick hair. Just be patient and don’t rush! Shake out your curls. When you are finished, run your fingers through your curls and shake them out. Inspect your curls. Inspect your hair from all angles and make sure it looks how you want it to look. Use the scissors to touch up any spots that don’t look right. Look for any strands that are drastically longer than others or that are angled differently and trim as needed. Cutting Braided Curly Hair Detangle your hair. Brush all of your hair until the brush moves through your hair easily, with little or no resistance. Make sure that there are no tangles and that your hair is ready to be braided. Separate your hair into 1” sections and braid each section as you go. Use a comb to separate each section from the rest of your hair. After you have separated each section, braid it and secure it with a small elastic hair band. Leave about a 1” tail of unbraided hair at the bottom of the braid. Braid all of your hair. Continue sectioning and braiding your hair until you have braided all of it. The number of braids you will have when you are done will depend on the thickness of your hair, but you should have several small braids when you are done. Wrap a towel around your neck and shoulders. Secure the towel with a strong hair clip or safety pin. The towel will help prevent hair from getting on your neck and clothing. You may also want to put some newspaper on the floor to catch the hair that you trim off. Trim the end of each braid. Cut the ¼”- ½”section off the bottom of the braid. Make sure the scissors you use are meant for cutting hair and that they are very sharp. Make sure that you cut straight across and not at an angle. After you make your first cut, measure the next braid side-by-side with the first. Use the already-cut braids as a guide for the next braid to make sure your hair is as even as possible. Remove the braids from your hair. Take your hair out of the braids, run your fingers through your hair, and shake out your curls. Inspect your curls. Inspect your hair from all angles and make sure it looks how you want it to look. Use the scissors to touch up any spots that don’t look right. Look for any strands that are drastically longer than others or that are angled differently and trim as needed. Cutting Hair in Pigtails Detangle your hair. Brush all of your hair until the brush moves through your hair easily, with little or no resistance. Make sure that there are no tangles and that your hair is ready to be put into pigtails. Put your hair into pigtails. Separate your hair into two low pigtails on the sides of your head. Bring the ends of the pigtails in front of your shoulders so that you can see what you are doing. Wrap a towel around your neck and shoulders. Secure the towel with a strong hair clip or safety pin. The towel will help prevent hair from getting on your neck and clothing. You may also want to put some newspaper on the floor to catch the hair that you trim off. Decide how short you want to go. Identify the amount of length that you would like to cut and hold your hair around this section using your middle and index fingers. Cut your hair. For each pigtail, cut the hair in a straight line just below where you are holding it with your fingers. Make sure the scissors you use are meant for cutting hair and that they are very sharp. You can cut your hair at a slight angle if you’d like a bit of a slant to your cut. Just make sure that you cut the other pigtail at a similar complementary angle. Remove the elastic hairbands. Take your hair out of the pigtails, run your fingers through your hair, and shake out your curls. Inspect your curls. Inspect your hair from all angles and make sure it looks how you want it to look. Use the scissors to touch up any spots that don’t look right. Look for any strands that are drastically longer than others or that are angled differently and trim as needed. Cutting Damp Curly Hair Wash and condition your hair. After you have finished washing your hair, dry it with a towel and proceed with your normal styling routine, but do not blow dry your hair. Let your hair air dry for a while until it is just damp. Wrap a towel around your neck and shoulders. Secure the towel with a strong hair clip or safety pin. The towel will help prevent hair from getting on your neck and clothing. You may also want to put some newspaper on the floor to catch the hair that you trim off. Arrange your mirrors. Before you begin, make sure that you will be able to see the front and back of your hair by placing one mirror in front of you and another behind you. The mirrors should be facing each other. Adjust the mirrors until you can see the front and the back of your head in the mirror in front of you. If you have long hair, this step is optional since you should be able to bring each strand forward as you trim your curls. Trim your curls. Using a pair of sharp haircutting scissors, trim the ends of each of your curls. Make sure the scissors you use are meant for cutting hair and that they are very sharp. Cut the hair near the ends or in the curve of the curl. Begin by trimming the topmost layers and work your way down through your curls, layer by layer. Separate the trimmed curls from the untrimmed curls. After you finish trimming the ends of one layer, use a hair clip to separate the trimmed hair from the hair that you have not yet cut. Keeping the trimmed hair separate will help prevent you from cutting the same curls twice. Continue trimming the ends of your curls until you have trimmed them all. This may take a while, especially if you have thick hair. Just be patient and don’t rush! Shake out your curls. When you are finished, run your fingers through your curls and shake them out. Inspect your curls. Inspect your hair from all angles and make sure it looks how you want it to look. Use the scissors to touch up any spots that don’t look right. Look for any strands that are drastically longer than others or that are angled differently and trim as needed.",
    "sentences": [
        " Cutting Dry Curly Hair Style your hair as usual.",
        "Before you begin trimming your curls, start with dry hair that is styled how you normally wear it.",
        "Make sure that your curls are laid out the way that you like them to be.",
        "Wrap a towel around your neck and shoulders.",
        "Secure the towel with a strong hair clip or safety pin.",
        "The towel will help prevent hair from getting on your neck and clothing.",
        "You may also want to put some newspaper on the floor to catch the hair that you trim off.",
        "If you have a hairdresser's cape, you can use this in place of a towel.",
        "Arrange your mirrors.",
        "Before you begin, make sure that you will be able to see the front and back of your hair by placing one mirror in front of you and another behind you.",
        "You can use your bathroom mirror as one of the mirrors for this purpose.",
        "The mirrors should be facing each other.",
        "Adjust the mirrors until you can see the front and the back of your head in the mirror in front of you.",
        "If you have long hair, this step is optional since you should be able to bring each strand forward as you trim your curls.",
        "Trim your curls.",
        "Separate your hair into sections to give you the most control over your cut.",
        "Then, using a pair of sharp haircutting scissors, trim the ends of each of your curls.",
        "Make sure the scissors you use are meant for cutting hair and that they are very sharp.Cut the hair near the ends or in the curve of the curl.",
        "Begin by trimming the topmost layers and work your way down through your curls, section by section.",
        "Separate the trimmed curls from the untrimmed curls.",
        "After you finish trimming the ends of one layer, use a hair clip to separate the trimmed hair from the hair that you have not yet cut.",
        "Keeping the trimmed hair separate will help prevent you from cutting the same curls twice.",
        "Continue trimming the ends of your curls until you have trimmed them all.",
        "This may take a while, especially if you have thick hair.",
        "Just be patient and don’t rush!",
        "Shake out your curls.",
        "When you are finished, run your fingers through your curls and shake them out.",
        "Inspect your curls.",
        "Inspect your hair from all angles and make sure it looks how you want it to look.",
        "Use the scissors to touch up any spots that don’t look right.",
        "Look for any strands that are drastically longer than others or that are angled differently and trim as needed.",
        "Cutting Braided Curly Hair Detangle your hair.",
        "Brush all of your hair until the brush moves through your hair easily, with little or no resistance.",
        "Make sure that there are no tangles and that your hair is ready to be braided.",
        "Separate your hair into 1” sections and braid each section as you go.",
        "Use a comb to separate each section from the rest of your hair.",
        "After you have separated each section, braid it and secure it with a small elastic hair band.",
        "Leave about a 1” tail of unbraided hair at the bottom of the braid.",
        "Braid all of your hair.",
        "Continue sectioning and braiding your hair until you have braided all of it.",
        "The number of braids you will have when you are done will depend on the thickness of your hair, but you should have several small braids when you are done.",
        "Wrap a towel around your neck and shoulders.",
        "Secure the towel with a strong hair clip or safety pin.",
        "The towel will help prevent hair from getting on your neck and clothing.",
        "You may also want to put some newspaper on the floor to catch the hair that you trim off.",
        "Trim the end of each braid.",
        "Cut the ¼”- ½”section off the bottom of the braid.",
        "Make sure the scissors you use are meant for cutting hair and that they are very sharp.",
        "Make sure that you cut straight across and not at an angle.",
        "After you make your first cut, measure the next braid side-by-side with the first.",
        "Use the already-cut braids as a guide for the next braid to make sure your hair is as even as possible.",
        "Remove the braids from your hair.",
        "Take your hair out of the braids, run your fingers through your hair, and shake out your curls.",
        "Inspect your curls.",
        "Inspect your hair from all angles and make sure it looks how you want it to look.",
        "Use the scissors to touch up any spots that don’t look right.",
        "Look for any strands that are drastically longer than others or that are angled differently and trim as needed.",
        "Cutting Hair in Pigtails Detangle your hair.",
        "Brush all of your hair until the brush moves through your hair easily, with little or no resistance.",
        "Make sure that there are no tangles and that your hair is ready to be put into pigtails.",
        "Put your hair into pigtails.",
        "Separate your hair into two low pigtails on the sides of your head.",
        "Bring the ends of the pigtails in front of your shoulders so that you can see what you are doing.",
        "Wrap a towel around your neck and shoulders.",
        "Secure the towel with a strong hair clip or safety pin.",
        "The towel will help prevent hair from getting on your neck and clothing.",
        "You may also want to put some newspaper on the floor to catch the hair that you trim off.",
        "Decide how short you want to go.",
        "Identify the amount of length that you would like to cut and hold your hair around this section using your middle and index fingers.",
        "Cut your hair.",
        "For each pigtail, cut the hair in a straight line just below where you are holding it with your fingers.",
        "Make sure the scissors you use are meant for cutting hair and that they are very sharp.",
        "You can cut your hair at a slight angle if you’d like a bit of a slant to your cut.",
        "Just make sure that you cut the other pigtail at a similar complementary angle.",
        "Remove the elastic hairbands.",
        "Take your hair out of the pigtails, run your fingers through your hair, and shake out your curls.",
        "Inspect your curls.",
        "Inspect your hair from all angles and make sure it looks how you want it to look.",
        "Use the scissors to touch up any spots that don’t look right.",
        "Look for any strands that are drastically longer than others or that are angled differently and trim as needed.",
        "Cutting Damp Curly Hair Wash and condition your hair.",
        "After you have finished washing your hair, dry it with a towel and proceed with your normal styling routine, but do not blow dry your hair.",
        "Let your hair air dry for a while until it is just damp.",
        "Wrap a towel around your neck and shoulders.",
        "Secure the towel with a strong hair clip or safety pin.",
        "The towel will help prevent hair from getting on your neck and clothing.",
        "You may also want to put some newspaper on the floor to catch the hair that you trim off.",
        "Arrange your mirrors.",
        "Before you begin, make sure that you will be able to see the front and back of your hair by placing one mirror in front of you and another behind you.",
        "The mirrors should be facing each other.",
        "Adjust the mirrors until you can see the front and the back of your head in the mirror in front of you.",
        "If you have long hair, this step is optional since you should be able to bring each strand forward as you trim your curls.",
        "Trim your curls.",
        "Using a pair of sharp haircutting scissors, trim the ends of each of your curls.",
        "Make sure the scissors you use are meant for cutting hair and that they are very sharp.",
        "Cut the hair near the ends or in the curve of the curl.",
        "Begin by trimming the topmost layers and work your way down through your curls, layer by layer.",
        "Separate the trimmed curls from the untrimmed curls.",
        "After you finish trimming the ends of one layer, use a hair clip to separate the trimmed hair from the hair that you have not yet cut.",
        "Keeping the trimmed hair separate will help prevent you from cutting the same curls twice.",
        "Continue trimming the ends of your curls until you have trimmed them all.",
        "This may take a while, especially if you have thick hair.",
        "Just be patient and don’t rush!",
        "Shake out your curls.",
        "When you are finished, run your fingers through your curls and shake them out.",
        "Inspect your curls.",
        "Inspect your hair from all angles and make sure it looks how you want it to look.",
        "Use the scissors to touch up any spots that don’t look right.",
        "Look for any strands that are drastically longer than others or that are angled differently and trim as needed."
    ]
}