{
    "title": "How to Make a Rose and Lavender Perfume",
    "url": "https://www.wikihow.com/Make-a-Rose-and-Lavender-Perfume",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Handmade Cosmetics",
        "Plant Based Cosmetics"
    ],
    "steps": [
        {
            "headline": "Look round your garden for roses and lavender flowers.",
            "description": "Make sure they are fresh and smell great, before picking 1 good sized rose and about 3 lavender flower heads."
        },
        {
            "headline": "Remove the petals from the rose and the buds from the lavender.",
            "description": "Place the petals and buds in a small bowl ready for washing."
        },
        {
            "headline": "Rinse the petals and lavender buds gently with water.",
            "description": "This is to remove all the dirt/soil from the garden. The great scents will remain."
        },
        {
            "headline": "Take two cups full of water and pour into a pan.",
            "description": "Heat the water on the stove and bring to boil."
        },
        {
            "headline": "Drop in the petals and buds to the boiling water carefully.",
            "description": "Reduce the heat and leave to simmer about 15 minutes."
        },
        {
            "headline": "Pour the water, petals and buds into a jug to cool.",
            "description": "Let all the scents (and colours) from the petals and buds seep into the water. Leave to sit for a few hours."
        },
        {
            "headline": "Strain the scented water, petals and buds.",
            "description": "So place a sieve over a bowl and pour all of the water and flowers from the jug. The petals and buds should be left behind in the sieve, and the water will have slipped through into the bowl."
        },
        {
            "headline": "Pour the scented 'water' into a pretty container.",
            "description": "It's now your homemade flower perfume!"
        },
        {
            "headline": "Dab spots of your new perfume over your skin.",
            "description": "Dabbing onto pulse points are best, for a delicate lovely signature scent."
        }
    ],
    "tyn": [
        "Roses",
        "Lavender flowers",
        "Water",
        "Pretty container"
    ],
    "text": " Look round your garden for roses and lavender flowers. Make sure they are fresh and smell great, before picking 1 good sized rose and about 3 lavender flower heads. Remove the petals from the rose and the buds from the lavender. Place the petals and buds in a small bowl ready for washing. Rinse the petals and lavender buds gently with water. This is to remove all the dirt/soil from the garden. The great scents will remain. Take two cups full of water and pour into a pan. Heat the water on the stove and bring to boil. Drop in the petals and buds to the boiling water carefully. Reduce the heat and leave to simmer about 15 minutes. Pour the water, petals and buds into a jug to cool. Let all the scents (and colours) from the petals and buds seep into the water. Leave to sit for a few hours. Strain the scented water, petals and buds. So place a sieve over a bowl and pour all of the water and flowers from the jug. The petals and buds should be left behind in the sieve, and the water will have slipped through into the bowl. Pour the scented 'water' into a pretty container. It's now your homemade flower perfume! Dab spots of your new perfume over your skin. Dabbing onto pulse points are best, for a delicate lovely signature scent.",
    "sentences": [
        " Look round your garden for roses and lavender flowers.",
        "Make sure they are fresh and smell great, before picking 1 good sized rose and about 3 lavender flower heads.",
        "Remove the petals from the rose and the buds from the lavender.",
        "Place the petals and buds in a small bowl ready for washing.",
        "Rinse the petals and lavender buds gently with water.",
        "This is to remove all the dirt/soil from the garden.",
        "The great scents will remain.",
        "Take two cups full of water and pour into a pan.",
        "Heat the water on the stove and bring to boil.",
        "Drop in the petals and buds to the boiling water carefully.",
        "Reduce the heat and leave to simmer about 15 minutes.",
        "Pour the water, petals and buds into a jug to cool.",
        "Let all the scents (and colours) from the petals and buds seep into the water.",
        "Leave to sit for a few hours.",
        "Strain the scented water, petals and buds.",
        "So place a sieve over a bowl and pour all of the water and flowers from the jug.",
        "The petals and buds should be left behind in the sieve, and the water will have slipped through into the bowl.",
        "Pour the scented 'water' into a pretty container.",
        "It's now your homemade flower perfume!",
        "Dab spots of your new perfume over your skin.",
        "Dabbing onto pulse points are best, for a delicate lovely signature scent."
    ]
}