{
    "title": "How to Make Makeup Last All Day",
    "url": "https://www.wikihow.com/Make-Makeup-Last-All-Day",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Makeup",
        "Makeup Accessories",
        "Care of Makeup"
    ],
    "methods": [
        {
            "name": "Prepping Your Face",
            "steps": [
                {
                    "headline": "Wash your face.",
                    "description": "Washing away dirt, sebum and old makeup will help your fresh makeup stay in place a lot longer. If you put fresh makeup on a dirty face, it'll tend to slip off or flake away. Wash your face in the morning, before putting on makeup. Don't use harsh soap on your face. It can cause irritation and dryness, which will make your makeup come off sooner."
                },
                {
                    "headline": "Exfoliate a few times a week.",
                    "description": "Dead skin tends to accumulate on the face, especially with age, so it's important to exfoliate a few times a week to remove it. Putting makeup over dead skin will cause it to flake off during the day. Your makeup will look, feel and behave better on a smooth, exfoliated face. You can use a facial brush to lightly brush the dead skin from your face. Rub it in circles, never pressing too hard. A homemade sugar scrub also works well as a gentle exfoliant. Don't forget your lips! They need to be exfoliated, too, in order for lipstick to stay in place."
                },
                {
                    "headline": "Moisturize.",
                    "description": "For oily skin, buy an oil-free or gel moisturizer, and for dry skin, buy a more nourishing one. Make sure to get a moisturizer with at least SPF 15 in it to protect you skin from the sun, or a separate SPF 30 if you live in a sunny place. If you are older, you can use a moisturizer with anti-wrinkle properties. Don't use a rich, creamy moisturizer during the day. It could make your face too slick for your makeup. Instead, apply creams before bed and wear them overnight to get the moisturizing benefits without messing up your makeup."
                },
                {
                    "headline": "Prime your face.",
                    "description": "Using a good primer is the trick to having makeup that stays throughout the whole day. Some primers can get a little pricey, but you don't need to use very much for a good finish. Apply the primer over your entire face, especially over red areas or oily areas, and any blemishes that you want to cover. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaura Martin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLicensed Cosmetologist\t\t\t\t\t\t\t\tLaura Martin is a Licensed Cosmetologist in Georgia. She has been a hair stylist since 2007 and a cosmetology teacher since 2013. Laura Martin\t\t\tLicensed Cosmetologist\t\t\t\tLaura Martin, a licensed cosmetologist, advises: \"Wearing primer underneath your makeup is the best way to make it last all day. Just be sure to choose a primer formulated for your skin type.\""
                },
                {
                    "headline": "Use an eye primer.",
                    "description": "It makes your eyeshadow last longer and prevents creasing in the lid. Also, it makes colors seem more vibrant and less translucent. A liquid concealer can work for this also. If you don't use a lot of eye makeup, an eye primer may not be necessary. However, it can really help if your eye makeup tends to smudge and end up below your eyes. Eye primer can also help your eyeliner stay in place."
                }
            ]
        },
        {
            "name": "Choosing the Right Makeup",
            "steps": [
                {
                    "headline": "Get a good matte foundation.",
                    "description": "If you don't want to use a liquid foundation, you should get a mineral powder instead of foundation. This gives lighter coverage than liquid, but it will also trap fewer bacteria in your skin and will allow your face to breathe. Alternatively, try a cream foundation, powder foundation, cream-to-powder foundation, or tinted moisturizer. Mineral makeup may be good for some, but others may find it too drying or quick to wear off. Getting the color right can be difficult if you have yellow undertones."
                },
                {
                    "headline": "Use a translucent setting powder.",
                    "description": "This is simply a clear or very lightly tinted face powder that sets and gives a matte appearance to your face without the added coverage of a colored powder. There are a variety of setting powders available, from affordable drug store brands to more pricey, high-end products."
                },
                {
                    "headline": "Choose long-wear lip color.",
                    "description": "This type of lip color is formulated to stay on your lips all day long, even when you eat and drink. Make sure to moisturize your lips properly before applying, as long-wear formulas are very drying. There are a variety of long-wear lip products on the market, depending on the type of look you’re going for. Lip stains and long-wear lipsticks will last a long time, as will any type of lipstick with a matte finish. For even longer-lasting color, use a lipliner around your color. This helps the shape stay firm all day long."
                },
                {
                    "headline": "Use powdered eye shadow.",
                    "description": "Applying this type of shadow over primer will keep your color in place all day long. Cream shadows tend to slip off a lot more easily. Apply the powder to the primer using an eyeshadow brush, and let it set."
                },
                {
                    "headline": "Use water-resistant mascara.",
                    "description": "Water-resistant mascara works well to keep your eyes looking fresh all day. It won't budge if you happen to get wet or cry. Just make sure you don't sleep with it, as it will clump and make your lashes fall off. Do not waste money on mascara primer. Mascara primer weighs down your eyelashes, making them look shorter. Unless it’s really urgent that you keep your mascara in place all day—such as for a special occasion like a wedding or a poolside photo shoot—opt for “water-resistant” mascaras over “waterproof” formulations. Waterproof mascaras can be damaging, and are not good for everyday use."
                }
            ]
        },
        {
            "name": "Keeping It in Place",
            "steps": [
                {
                    "headline": "Take your time applying your makeup.",
                    "description": "Slapping it on in the morning and rushing out the door won't give your makeup time to set. After each layer you apply, wait 5 minutes before applying the next one. This will go a long way toward helping your makeup stay in place all day long."
                },
                {
                    "headline": "Avoid touching your face during the day.",
                    "description": "Every time you touch your face, you're removing a little bit of makeup and increasing the chances it'll get smudged. Avoiding touching your face with your fingers as much as possible."
                },
                {
                    "headline": "Go lighter during the summer.",
                    "description": "When it's hot outside, wearing a ton of makeup is never a good idea. As you perspire, your makeup will naturally come off a lot more easily. The best thing to do is wear waterproof eye makeup and go easy on the foundation, rather than fighting to keep it in place all day long."
                },
                {
                    "headline": "Wear your hair up more often.",
                    "description": "Having your hair brush against your face all day long is a sure way to take off your makeup a little faster. When it's essential for your makeup to stay set all day, go for an updo style that day."
                }
            ]
        }
    ],
    "tyn": [
        "Primer",
        "Moisturizer",
        "Cleanser",
        "Make-up wipes",
        "Mascara",
        "Liquid/felt-tip eyeliner",
        "Make up holding spray (optional)",
        "Translucent Setting Powder"
    ],
    "text": " Prepping Your Face Wash your face. Washing away dirt, sebum and old makeup will help your fresh makeup stay in place a lot longer. If you put fresh makeup on a dirty face, it'll tend to slip off or flake away. Wash your face in the morning, before putting on makeup. Don't use harsh soap on your face. It can cause irritation and dryness, which will make your makeup come off sooner. Exfoliate a few times a week. Dead skin tends to accumulate on the face, especially with age, so it's important to exfoliate a few times a week to remove it. Putting makeup over dead skin will cause it to flake off during the day. Your makeup will look, feel and behave better on a smooth, exfoliated face. You can use a facial brush to lightly brush the dead skin from your face. Rub it in circles, never pressing too hard. A homemade sugar scrub also works well as a gentle exfoliant. Don't forget your lips! They need to be exfoliated, too, in order for lipstick to stay in place. Moisturize. For oily skin, buy an oil-free or gel moisturizer, and for dry skin, buy a more nourishing one. Make sure to get a moisturizer with at least SPF 15 in it to protect you skin from the sun, or a separate SPF 30 if you live in a sunny place. If you are older, you can use a moisturizer with anti-wrinkle properties. Don't use a rich, creamy moisturizer during the day. It could make your face too slick for your makeup. Instead, apply creams before bed and wear them overnight to get the moisturizing benefits without messing up your makeup. Prime your face. Using a good primer is the trick to having makeup that stays throughout the whole day. Some primers can get a little pricey, but you don't need to use very much for a good finish. Apply the primer over your entire face, especially over red areas or oily areas, and any blemishes that you want to cover. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaura Martin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLicensed Cosmetologist\t\t\t\t\t\t\t\tLaura Martin is a Licensed Cosmetologist in Georgia. She has been a hair stylist since 2007 and a cosmetology teacher since 2013. Laura Martin\t\t\tLicensed Cosmetologist\t\t\t\tLaura Martin, a licensed cosmetologist, advises: \"Wearing primer underneath your makeup is the best way to make it last all day. Just be sure to choose a primer formulated for your skin type.\" Use an eye primer. It makes your eyeshadow last longer and prevents creasing in the lid. Also, it makes colors seem more vibrant and less translucent. A liquid concealer can work for this also. If you don't use a lot of eye makeup, an eye primer may not be necessary. However, it can really help if your eye makeup tends to smudge and end up below your eyes. Eye primer can also help your eyeliner stay in place. Choosing the Right Makeup Get a good matte foundation. If you don't want to use a liquid foundation, you should get a mineral powder instead of foundation. This gives lighter coverage than liquid, but it will also trap fewer bacteria in your skin and will allow your face to breathe. Alternatively, try a cream foundation, powder foundation, cream-to-powder foundation, or tinted moisturizer. Mineral makeup may be good for some, but others may find it too drying or quick to wear off. Getting the color right can be difficult if you have yellow undertones. Use a translucent setting powder. This is simply a clear or very lightly tinted face powder that sets and gives a matte appearance to your face without the added coverage of a colored powder. There are a variety of setting powders available, from affordable drug store brands to more pricey, high-end products. Choose long-wear lip color. This type of lip color is formulated to stay on your lips all day long, even when you eat and drink. Make sure to moisturize your lips properly before applying, as long-wear formulas are very drying. There are a variety of long-wear lip products on the market, depending on the type of look you’re going for. Lip stains and long-wear lipsticks will last a long time, as will any type of lipstick with a matte finish. For even longer-lasting color, use a lipliner around your color. This helps the shape stay firm all day long. Use powdered eye shadow. Applying this type of shadow over primer will keep your color in place all day long. Cream shadows tend to slip off a lot more easily. Apply the powder to the primer using an eyeshadow brush, and let it set. Use water-resistant mascara. Water-resistant mascara works well to keep your eyes looking fresh all day. It won't budge if you happen to get wet or cry. Just make sure you don't sleep with it, as it will clump and make your lashes fall off. Do not waste money on mascara primer. Mascara primer weighs down your eyelashes, making them look shorter. Unless it’s really urgent that you keep your mascara in place all day—such as for a special occasion like a wedding or a poolside photo shoot—opt for “water-resistant” mascaras over “waterproof” formulations. Waterproof mascaras can be damaging, and are not good for everyday use. Keeping It in Place Take your time applying your makeup. Slapping it on in the morning and rushing out the door won't give your makeup time to set. After each layer you apply, wait 5 minutes before applying the next one. This will go a long way toward helping your makeup stay in place all day long. Avoid touching your face during the day. Every time you touch your face, you're removing a little bit of makeup and increasing the chances it'll get smudged. Avoiding touching your face with your fingers as much as possible. Go lighter during the summer. When it's hot outside, wearing a ton of makeup is never a good idea. As you perspire, your makeup will naturally come off a lot more easily. The best thing to do is wear waterproof eye makeup and go easy on the foundation, rather than fighting to keep it in place all day long. Wear your hair up more often. Having your hair brush against your face all day long is a sure way to take off your makeup a little faster. When it's essential for your makeup to stay set all day, go for an updo style that day.",
    "sentences": [
        " Prepping Your Face Wash your face.",
        "Washing away dirt, sebum and old makeup will help your fresh makeup stay in place a lot longer.",
        "If you put fresh makeup on a dirty face, it'll tend to slip off or flake away.",
        "Wash your face in the morning, before putting on makeup.",
        "Don't use harsh soap on your face.",
        "It can cause irritation and dryness, which will make your makeup come off sooner.",
        "Exfoliate a few times a week.",
        "Dead skin tends to accumulate on the face, especially with age, so it's important to exfoliate a few times a week to remove it.",
        "Putting makeup over dead skin will cause it to flake off during the day.",
        "Your makeup will look, feel and behave better on a smooth, exfoliated face.",
        "You can use a facial brush to lightly brush the dead skin from your face.",
        "Rub it in circles, never pressing too hard.",
        "A homemade sugar scrub also works well as a gentle exfoliant.",
        "Don't forget your lips!",
        "They need to be exfoliated, too, in order for lipstick to stay in place.",
        "Moisturize.",
        "For oily skin, buy an oil-free or gel moisturizer, and for dry skin, buy a more nourishing one.",
        "Make sure to get a moisturizer with at least SPF 15 in it to protect you skin from the sun, or a separate SPF 30 if you live in a sunny place.",
        "If you are older, you can use a moisturizer with anti-wrinkle properties.",
        "Don't use a rich, creamy moisturizer during the day.",
        "It could make your face too slick for your makeup.",
        "Instead, apply creams before bed and wear them overnight to get the moisturizing benefits without messing up your makeup.",
        "Prime your face.",
        "Using a good primer is the trick to having makeup that stays throughout the whole day.",
        "Some primers can get a little pricey, but you don't need to use very much for a good finish.",
        "Apply the primer over your entire face, especially over red areas or oily areas, and any blemishes that you want to cover.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaura Martin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLicensed Cosmetologist\t\t\t\t\t\t\t\tLaura Martin is a Licensed Cosmetologist in Georgia.",
        "She has been a hair stylist since 2007 and a cosmetology teacher since 2013.",
        "Laura Martin\t\t\tLicensed Cosmetologist\t\t\t\tLaura Martin, a licensed cosmetologist, advises: \"Wearing primer underneath your makeup is the best way to make it last all day.",
        "Just be sure to choose a primer formulated for your skin type.\"",
        "Use an eye primer.",
        "It makes your eyeshadow last longer and prevents creasing in the lid.",
        "Also, it makes colors seem more vibrant and less translucent.",
        "A liquid concealer can work for this also.",
        "If you don't use a lot of eye makeup, an eye primer may not be necessary.",
        "However, it can really help if your eye makeup tends to smudge and end up below your eyes.",
        "Eye primer can also help your eyeliner stay in place.",
        "Choosing the Right Makeup Get a good matte foundation.",
        "If you don't want to use a liquid foundation, you should get a mineral powder instead of foundation.",
        "This gives lighter coverage than liquid, but it will also trap fewer bacteria in your skin and will allow your face to breathe.",
        "Alternatively, try a cream foundation, powder foundation, cream-to-powder foundation, or tinted moisturizer.",
        "Mineral makeup may be good for some, but others may find it too drying or quick to wear off.",
        "Getting the color right can be difficult if you have yellow undertones.",
        "Use a translucent setting powder.",
        "This is simply a clear or very lightly tinted face powder that sets and gives a matte appearance to your face without the added coverage of a colored powder.",
        "There are a variety of setting powders available, from affordable drug store brands to more pricey, high-end products.",
        "Choose long-wear lip color.",
        "This type of lip color is formulated to stay on your lips all day long, even when you eat and drink.",
        "Make sure to moisturize your lips properly before applying, as long-wear formulas are very drying.",
        "There are a variety of long-wear lip products on the market, depending on the type of look you’re going for.",
        "Lip stains and long-wear lipsticks will last a long time, as will any type of lipstick with a matte finish.",
        "For even longer-lasting color, use a lipliner around your color.",
        "This helps the shape stay firm all day long.",
        "Use powdered eye shadow.",
        "Applying this type of shadow over primer will keep your color in place all day long.",
        "Cream shadows tend to slip off a lot more easily.",
        "Apply the powder to the primer using an eyeshadow brush, and let it set.",
        "Use water-resistant mascara.",
        "Water-resistant mascara works well to keep your eyes looking fresh all day.",
        "It won't budge if you happen to get wet or cry.",
        "Just make sure you don't sleep with it, as it will clump and make your lashes fall off.",
        "Do not waste money on mascara primer.",
        "Mascara primer weighs down your eyelashes, making them look shorter.",
        "Unless it’s really urgent that you keep your mascara in place all day—such as for a special occasion like a wedding or a poolside photo shoot—opt for “water-resistant” mascaras over “waterproof” formulations.",
        "Waterproof mascaras can be damaging, and are not good for everyday use.",
        "Keeping It in Place Take your time applying your makeup.",
        "Slapping it on in the morning and rushing out the door won't give your makeup time to set.",
        "After each layer you apply, wait 5 minutes before applying the next one.",
        "This will go a long way toward helping your makeup stay in place all day long.",
        "Avoid touching your face during the day.",
        "Every time you touch your face, you're removing a little bit of makeup and increasing the chances it'll get smudged.",
        "Avoiding touching your face with your fingers as much as possible.",
        "Go lighter during the summer.",
        "When it's hot outside, wearing a ton of makeup is never a good idea.",
        "As you perspire, your makeup will naturally come off a lot more easily.",
        "The best thing to do is wear waterproof eye makeup and go easy on the foundation, rather than fighting to keep it in place all day long.",
        "Wear your hair up more often.",
        "Having your hair brush against your face all day long is a sure way to take off your makeup a little faster.",
        "When it's essential for your makeup to stay set all day, go for an updo style that day."
    ]
}