{
    "title": "How to Treat Colds With Elderberry",
    "url": "https://www.wikihow.com/Treat-Colds-With-Elderberry",
    "category_hierarchy": [
        "Health",
        "Respiratory System Health"
    ],
    "methods": [
        {
            "name": "Making Elderberry Syrup",
            "steps": [
                {
                    "headline": "Gather your ingredients.",
                    "description": "You will need 1 cup (340 g) fresh or ½ cup (170 g) dried Elderberries and 3 cups (.7 liters) of water. To improve the taste, you can add 1 cup of honey (237 mL), one cinnamon stick, and three cloves. You can harvest the elderberries yourself or purchase them online from a health food store. If you are harvesting the berries yourself, only use blue or black berries. The red berries are poisonous. You can find Elderberries in moist areas by rivers, roads, and in forests."
                },
                {
                    "headline": "Place the ingredients in a sauce pan.",
                    "description": "Put the berries, spices, and water in a saucepan. Bring the mixture to a boil and then reduce to low heat. Let the mixture simmer for 30 minutes. Remove the saucepan from the heat and use the back of a spoon or a potato masher to smash the berries."
                },
                {
                    "headline": "Strain the mixture.",
                    "description": "Pour the mixture through a mesh strainer into a small bowl. Press as much liquid as you can from the berries using the back of your spoon. Allow the liquid to cool for a few minutes and then add honey to the juice if you wish. Store the syrup in a container with a lid. Allow the syrup to cool and then you can store it in the refrigerator. It will last for two or three months."
                },
                {
                    "headline": "Buy elderberry syrup.",
                    "description": "If you do not want to make your own syrup, you can buy the syrup. Elderberry syrup is called Sambucol. Sambucol typically contains 38% elderberry extract for adults and 19% extract for children. If you buy the syrup, the amount of elderberry extract should be standardized (look for syrups with a seal of approval from United States Pharmacopeial Convention [USP] or NSF International). When you make your own syrup, you will not know how strong the syrup is. Standardized extracts may be more effective."
                },
                {
                    "headline": "Take syrup daily.",
                    "description": "If you have the cold or a flu, take 4 tablespoons of syrup a day for three days. This could shorten the length of your cold by three days. You can also use the syrup on pancakes and waffles when you do not have a cold. This may help prevent colds. Start taking the syrup as soon as you have symptoms. Treatment may be more effective if you start when you first get sick."
                }
            ]
        },
        {
            "name": "Drinking Elderberry Tea",
            "steps": [
                {
                    "headline": "Make your own tea.",
                    "description": "Place 3 – 5 grams of dried elderberry flowers in one cup of boiling water. Allow the flowers to steep in the water for 10 – 15 minutes. Pour the mixture over a strainer to remove the flowers from the mixture. You can sweeten the tea with honey or add some spices such as cinnamon and cloves if you like. If you do not have any dried elderberry, you can use 2 tablespoons of syrup to make the tea. If you do not want to make your own tea, you can purchase elderberry tea bags that you can steep in water."
                },
                {
                    "headline": "Drink the tea three times a day.",
                    "description": "If you are sick, drink the tea three times a day. Start drinking the tea as soon as your symptoms start. Again, the strength of homemade tea is unknown, but it should be just as effective as the syrup. Your symptoms should go away faster. Avoid drinking the tea for more than five days."
                },
                {
                    "headline": "Purchase elderberry pills or lozenges.",
                    "description": "If you do not want to drink a syrup or tea, you can take elderberry pills or lozenges. Read the package instructions before taking them. The pills and lozenges work best if you take them as soon as your symptoms start. Lozenges that contain 175 mg of elderberry extract can help reduce flu symptoms. The amount of elderberry extract will vary depending on the brand that you buy. Read the package to see how much elderberry extract your pills and lozenges actually contain, and make sure they have a USP or NSF seal of approval to confirm that the ingredients have been verified."
                }
            ]
        },
        {
            "name": "Taking Safety Precautions",
            "steps": [
                {
                    "headline": "Avoid adverse drug interactions.",
                    "description": "Elderberry can interact with certain prescription medications. Always talk to your doctor or pharmacist before you begin using elderberry. Avoid elderberry if you are taking any of the following types of medications:\nHigh blood pressure medications\nChemotherapy drugs\nDiabetes medications\nDiuretics\nTheophylline"
                },
                {
                    "headline": "Avoid raw elderberry.",
                    "description": "Berries must be cooked before they are ingested because raw berries contain a chemical similar to cyanide. Uncooked elderberries can cause cyanide poisoning, vomiting, diarrhea, cramps, and nausea. Do not drink any elderberry juice that was made from crushed stems, leaves, or uncooked berries. You should be fine as long as you boil or cook the elderberry before use. If you experience any of these symptoms, seek medical care and stop taking the elderberry."
                },
                {
                    "headline": "Do not give elderberry or any product containing elder to a child.",
                    "description": "Before giving any herbal remedies to your child, first talk to the pediatrician."
                },
                {
                    "headline": "Do not take elderberry if you have an autoimmune disease such as rheumatoid arthritis or lupus.",
                    "description": "Elderberry stimulates your immune system, which may cause a flare up. Consult your healthcare provider before taking elderberry."
                },
                {
                    "headline": "Do not use if you are pregnant or breastfeeding.",
                    "description": "If you are pregnant or breastfeeding, speak to your doctor before taking elderberry. There is not much information about the effects of using elderberry when you are pregnant or lactating. It is unclear whether it is safe or harmful. Because of this, it is recommended that you not take elderberry."
                }
            ]
        }
    ],
    "tyn": [
        "Cinnamon stick",
        "Elderberries",
        "Water",
        "Whole cloves",
        "Small bowl",
        "Saucepan",
        "Stove",
        "Honey",
        "Container with lid",
        "Potato masher",
        "Spoon",
        "Mesh strainer"
    ],
    "text": " Making Elderberry Syrup Gather your ingredients. You will need 1 cup (340 g) fresh or ½ cup (170 g) dried Elderberries and 3 cups (.7 liters) of water. To improve the taste, you can add 1 cup of honey (237 mL), one cinnamon stick, and three cloves. You can harvest the elderberries yourself or purchase them online from a health food store. If you are harvesting the berries yourself, only use blue or black berries. The red berries are poisonous. You can find Elderberries in moist areas by rivers, roads, and in forests. Place the ingredients in a sauce pan. Put the berries, spices, and water in a saucepan. Bring the mixture to a boil and then reduce to low heat. Let the mixture simmer for 30 minutes. Remove the saucepan from the heat and use the back of a spoon or a potato masher to smash the berries. Strain the mixture. Pour the mixture through a mesh strainer into a small bowl. Press as much liquid as you can from the berries using the back of your spoon. Allow the liquid to cool for a few minutes and then add honey to the juice if you wish. Store the syrup in a container with a lid. Allow the syrup to cool and then you can store it in the refrigerator. It will last for two or three months. Buy elderberry syrup. If you do not want to make your own syrup, you can buy the syrup. Elderberry syrup is called Sambucol. Sambucol typically contains 38% elderberry extract for adults and 19% extract for children. If you buy the syrup, the amount of elderberry extract should be standardized (look for syrups with a seal of approval from United States Pharmacopeial Convention [USP] or NSF International). When you make your own syrup, you will not know how strong the syrup is. Standardized extracts may be more effective. Take syrup daily. If you have the cold or a flu, take 4 tablespoons of syrup a day for three days. This could shorten the length of your cold by three days. You can also use the syrup on pancakes and waffles when you do not have a cold. This may help prevent colds. Start taking the syrup as soon as you have symptoms. Treatment may be more effective if you start when you first get sick. Drinking Elderberry Tea Make your own tea. Place 3 – 5 grams of dried elderberry flowers in one cup of boiling water. Allow the flowers to steep in the water for 10 – 15 minutes. Pour the mixture over a strainer to remove the flowers from the mixture. You can sweeten the tea with honey or add some spices such as cinnamon and cloves if you like. If you do not have any dried elderberry, you can use 2 tablespoons of syrup to make the tea. If you do not want to make your own tea, you can purchase elderberry tea bags that you can steep in water. Drink the tea three times a day. If you are sick, drink the tea three times a day. Start drinking the tea as soon as your symptoms start. Again, the strength of homemade tea is unknown, but it should be just as effective as the syrup. Your symptoms should go away faster. Avoid drinking the tea for more than five days. Purchase elderberry pills or lozenges. If you do not want to drink a syrup or tea, you can take elderberry pills or lozenges. Read the package instructions before taking them. The pills and lozenges work best if you take them as soon as your symptoms start. Lozenges that contain 175 mg of elderberry extract can help reduce flu symptoms. The amount of elderberry extract will vary depending on the brand that you buy. Read the package to see how much elderberry extract your pills and lozenges actually contain, and make sure they have a USP or NSF seal of approval to confirm that the ingredients have been verified. Taking Safety Precautions Avoid adverse drug interactions. Elderberry can interact with certain prescription medications. Always talk to your doctor or pharmacist before you begin using elderberry. Avoid elderberry if you are taking any of the following types of medications:\nHigh blood pressure medications\nChemotherapy drugs\nDiabetes medications\nDiuretics\nTheophylline Avoid raw elderberry. Berries must be cooked before they are ingested because raw berries contain a chemical similar to cyanide. Uncooked elderberries can cause cyanide poisoning, vomiting, diarrhea, cramps, and nausea. Do not drink any elderberry juice that was made from crushed stems, leaves, or uncooked berries. You should be fine as long as you boil or cook the elderberry before use. If you experience any of these symptoms, seek medical care and stop taking the elderberry. Do not give elderberry or any product containing elder to a child. Before giving any herbal remedies to your child, first talk to the pediatrician. Do not take elderberry if you have an autoimmune disease such as rheumatoid arthritis or lupus. Elderberry stimulates your immune system, which may cause a flare up. Consult your healthcare provider before taking elderberry. Do not use if you are pregnant or breastfeeding. If you are pregnant or breastfeeding, speak to your doctor before taking elderberry. There is not much information about the effects of using elderberry when you are pregnant or lactating. It is unclear whether it is safe or harmful. Because of this, it is recommended that you not take elderberry.",
    "sentences": [
        " Making Elderberry Syrup Gather your ingredients.",
        "You will need 1 cup (340 g) fresh or ½ cup (170 g) dried Elderberries and 3 cups (.7 liters) of water.",
        "To improve the taste, you can add 1 cup of honey (237 mL), one cinnamon stick, and three cloves.",
        "You can harvest the elderberries yourself or purchase them online from a health food store.",
        "If you are harvesting the berries yourself, only use blue or black berries.",
        "The red berries are poisonous.",
        "You can find Elderberries in moist areas by rivers, roads, and in forests.",
        "Place the ingredients in a sauce pan.",
        "Put the berries, spices, and water in a saucepan.",
        "Bring the mixture to a boil and then reduce to low heat.",
        "Let the mixture simmer for 30 minutes.",
        "Remove the saucepan from the heat and use the back of a spoon or a potato masher to smash the berries.",
        "Strain the mixture.",
        "Pour the mixture through a mesh strainer into a small bowl.",
        "Press as much liquid as you can from the berries using the back of your spoon.",
        "Allow the liquid to cool for a few minutes and then add honey to the juice if you wish.",
        "Store the syrup in a container with a lid.",
        "Allow the syrup to cool and then you can store it in the refrigerator.",
        "It will last for two or three months.",
        "Buy elderberry syrup.",
        "If you do not want to make your own syrup, you can buy the syrup.",
        "Elderberry syrup is called Sambucol.",
        "Sambucol typically contains 38% elderberry extract for adults and 19% extract for children.",
        "If you buy the syrup, the amount of elderberry extract should be standardized (look for syrups with a seal of approval from United States Pharmacopeial Convention [USP] or NSF International).",
        "When you make your own syrup, you will not know how strong the syrup is.",
        "Standardized extracts may be more effective.",
        "Take syrup daily.",
        "If you have the cold or a flu, take 4 tablespoons of syrup a day for three days.",
        "This could shorten the length of your cold by three days.",
        "You can also use the syrup on pancakes and waffles when you do not have a cold.",
        "This may help prevent colds.",
        "Start taking the syrup as soon as you have symptoms.",
        "Treatment may be more effective if you start when you first get sick.",
        "Drinking Elderberry Tea Make your own tea.",
        "Place 3 – 5 grams of dried elderberry flowers in one cup of boiling water.",
        "Allow the flowers to steep in the water for 10 – 15 minutes.",
        "Pour the mixture over a strainer to remove the flowers from the mixture.",
        "You can sweeten the tea with honey or add some spices such as cinnamon and cloves if you like.",
        "If you do not have any dried elderberry, you can use 2 tablespoons of syrup to make the tea.",
        "If you do not want to make your own tea, you can purchase elderberry tea bags that you can steep in water.",
        "Drink the tea three times a day.",
        "If you are sick, drink the tea three times a day.",
        "Start drinking the tea as soon as your symptoms start.",
        "Again, the strength of homemade tea is unknown, but it should be just as effective as the syrup.",
        "Your symptoms should go away faster.",
        "Avoid drinking the tea for more than five days.",
        "Purchase elderberry pills or lozenges.",
        "If you do not want to drink a syrup or tea, you can take elderberry pills or lozenges.",
        "Read the package instructions before taking them.",
        "The pills and lozenges work best if you take them as soon as your symptoms start.",
        "Lozenges that contain 175 mg of elderberry extract can help reduce flu symptoms.",
        "The amount of elderberry extract will vary depending on the brand that you buy.",
        "Read the package to see how much elderberry extract your pills and lozenges actually contain, and make sure they have a USP or NSF seal of approval to confirm that the ingredients have been verified.",
        "Taking Safety Precautions Avoid adverse drug interactions.",
        "Elderberry can interact with certain prescription medications.",
        "Always talk to your doctor or pharmacist before you begin using elderberry.",
        "Avoid elderberry if you are taking any of the following types of medications:\nHigh blood pressure medications\nChemotherapy drugs\nDiabetes medications\nDiuretics\nTheophylline Avoid raw elderberry.",
        "Berries must be cooked before they are ingested because raw berries contain a chemical similar to cyanide.",
        "Uncooked elderberries can cause cyanide poisoning, vomiting, diarrhea, cramps, and nausea.",
        "Do not drink any elderberry juice that was made from crushed stems, leaves, or uncooked berries.",
        "You should be fine as long as you boil or cook the elderberry before use.",
        "If you experience any of these symptoms, seek medical care and stop taking the elderberry.",
        "Do not give elderberry or any product containing elder to a child.",
        "Before giving any herbal remedies to your child, first talk to the pediatrician.",
        "Do not take elderberry if you have an autoimmune disease such as rheumatoid arthritis or lupus.",
        "Elderberry stimulates your immune system, which may cause a flare up.",
        "Consult your healthcare provider before taking elderberry.",
        "Do not use if you are pregnant or breastfeeding.",
        "If you are pregnant or breastfeeding, speak to your doctor before taking elderberry.",
        "There is not much information about the effects of using elderberry when you are pregnant or lactating.",
        "It is unclear whether it is safe or harmful.",
        "Because of this, it is recommended that you not take elderberry."
    ]
}