{
    "title": "How to Harvest Cashmere",
    "url": "https://www.wikihow.com/Harvest-Cashmere",
    "category_hierarchy": [
        "Work World",
        "Occupations",
        "Farming"
    ],
    "steps": [
        {
            "headline": "Clip the goats between the end of June (mid-winter southern hemisphere) and before September.",
            "description": "(In the northern hemisphere, this probably equates to the end of December to before March but check with local conditions and ask breeders or goat associations for confirmation.) The downy hair will moult as winter comes to an end, leaving only the coarse fibres."
        },
        {
            "headline": "Measure the down.",
            "description": "It must be at least 30mm in length to make it worthwhile. Do not shear parts of the goat that are shorter than this, and do not shear at all if the goat's downy hair is not at least this long anywhere."
        },
        {
            "headline": "Try to avoid the worst of the winter weather.",
            "description": "If you cannot avoid it, do not shear pregnant does, as the stress may cause them to abort. Whatever you do, you must be assured of having adequate shelter for the goats after shearing because goats do not have a layer of fat to keep them warm (unlike sheep)."
        },
        {
            "headline": "Shear the goats in different colour lots to avoid cross-contamination of the fleeces.",
            "description": "Shear white goats first, then grey, then brown."
        },
        {
            "headline": "Place the goat in a shearing restraint for shearing.",
            "description": "Usually this will mean only its head is restrained. Shear tail to shoulder length first, each side. Shear down the shoulders. Finish by shearing shoulder to tail."
        },
        {
            "headline": "Feed and shelter well.",
            "description": "After harvesting the cashmere, keep the food highly nutritious and regular. Regardless of your shearing, cashmere goats will continue to moult, losing even the stubble that remains after shearing."
        },
        {
            "headline": "Sort the fleeces.",
            "description": "Remove any contaminants such as vegetable matter and stains."
        }
    ],
    "tyn": [
        "Shearing gear",
        "Good shelter",
        "Nutritious feed"
    ],
    "text": " Clip the goats between the end of June (mid-winter southern hemisphere) and before September. (In the northern hemisphere, this probably equates to the end of December to before March but check with local conditions and ask breeders or goat associations for confirmation.) The downy hair will moult as winter comes to an end, leaving only the coarse fibres. Measure the down. It must be at least 30mm in length to make it worthwhile. Do not shear parts of the goat that are shorter than this, and do not shear at all if the goat's downy hair is not at least this long anywhere. Try to avoid the worst of the winter weather. If you cannot avoid it, do not shear pregnant does, as the stress may cause them to abort. Whatever you do, you must be assured of having adequate shelter for the goats after shearing because goats do not have a layer of fat to keep them warm (unlike sheep). Shear the goats in different colour lots to avoid cross-contamination of the fleeces. Shear white goats first, then grey, then brown. Place the goat in a shearing restraint for shearing. Usually this will mean only its head is restrained. Shear tail to shoulder length first, each side. Shear down the shoulders. Finish by shearing shoulder to tail. Feed and shelter well. After harvesting the cashmere, keep the food highly nutritious and regular. Regardless of your shearing, cashmere goats will continue to moult, losing even the stubble that remains after shearing. Sort the fleeces. Remove any contaminants such as vegetable matter and stains.",
    "sentences": [
        " Clip the goats between the end of June (mid-winter southern hemisphere) and before September.",
        "(In the northern hemisphere, this probably equates to the end of December to before March but check with local conditions and ask breeders or goat associations for confirmation.)",
        "The downy hair will moult as winter comes to an end, leaving only the coarse fibres.",
        "Measure the down.",
        "It must be at least 30mm in length to make it worthwhile.",
        "Do not shear parts of the goat that are shorter than this, and do not shear at all if the goat's downy hair is not at least this long anywhere.",
        "Try to avoid the worst of the winter weather.",
        "If you cannot avoid it, do not shear pregnant does, as the stress may cause them to abort.",
        "Whatever you do, you must be assured of having adequate shelter for the goats after shearing because goats do not have a layer of fat to keep them warm (unlike sheep).",
        "Shear the goats in different colour lots to avoid cross-contamination of the fleeces.",
        "Shear white goats first, then grey, then brown.",
        "Place the goat in a shearing restraint for shearing.",
        "Usually this will mean only its head is restrained.",
        "Shear tail to shoulder length first, each side.",
        "Shear down the shoulders.",
        "Finish by shearing shoulder to tail.",
        "Feed and shelter well.",
        "After harvesting the cashmere, keep the food highly nutritious and regular.",
        "Regardless of your shearing, cashmere goats will continue to moult, losing even the stubble that remains after shearing.",
        "Sort the fleeces.",
        "Remove any contaminants such as vegetable matter and stains."
    ]
}