{
    "title": "How to Make a Candy Wreath",
    "url": "https://www.wikihow.com/Make-a-Candy-Wreath",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Halloween",
        "Halloween Decorations"
    ],
    "methods": [
        {
            "name": "Making a Tied Candy Wreath",
            "steps": [
                {
                    "headline": "Bend a wire coat hanger into a circle shape.",
                    "description": "Simply bend the bottom, sides, and top until you get a circle. It doesn't have to be perfect. Don't cut the hanger part off; you can use this later on to hang your finished wreath!If you can't find a wire coat hanger, you can also use a metal ring instead."
                },
                {
                    "headline": "Cut some string into 3 to 8-inch (7.62 to 20.32 centimeters) pieces.",
                    "description": "You will be using these to tie your candy to the coat hanger base. The measurements don't have to be exact, so you could even wrap the string several times around a DVD case, then cut it to create many short pieces of string. You will be eventually trimming the string down. If you'd like a more decorative wreath, however, you could leave the string uncut. In this case, consider using curling ribbon instead."
                },
                {
                    "headline": "Tie each string to each piece of candy.",
                    "description": "Try to get the string right between the twisted part of the wrapper and the candy itself. You only have to tie the string to one side of the candy, and you not need to create a double knot. Do this step for all of the candy that you have. You can use any type of twist-wrapped candy, such as peppermints, Jolly Ranchers, taffy, and butterscotch."
                },
                {
                    "headline": "Tie the candy to the coat hanger.",
                    "description": "Take one of your tied candies, and use the tail ends of the string to tie it to the hanger. Tie the string in a tight, double knot. For a neater finish, snip the loose ends of the string off. For a more decorative finish, leave the string uncut; it will become part of the wreath's design."
                },
                {
                    "headline": "Keep tying the candy until the wreath is all covered and you can't fit anymore candy.",
                    "description": "Gently push down on the candy as you tie it so that it squishes together and gives you a fuller wreath."
                },
                {
                    "headline": "Tie a piece of ribbon into a bow around the top of the wreath.",
                    "description": "Wrap a piece of ribbon at the base of the hanger, and tie it into a bow. Cut the tail ends of the bow at into angles or into V-shaped notches. The ribbon can be simple satin or velvet, or it could be one of those fancier ribbons with glitter or printed designs."
                },
                {
                    "headline": "Use the hook to hang your wreath.",
                    "description": "If you'd like the hook to be less visible, you can paint it to match your wall or door. Ordinary acrylic paint will do, but enamel/model paint will also work. Nail polish will also do in a pinch."
                }
            ]
        },
        {
            "name": "Making a Glued Candy Wreath",
            "steps": [
                {
                    "headline": "Wrap a 16-inch (40.64 centimeters) Styrofoam wreath with 1½-inch (3.81 centimeters) wide floral ribbon.",
                    "description": "Choose a color that matches your peppermint candy, such as white or red; if your peppermint candy is green, then you could even use green ribbon. This will give the hot glue something to stick to. It will also conceal any Styrofoam that might show through any gaps. Secure both ends of the ribbon to the back of the wreath using hot glue. Choose the kind of Styrofoam wreath that is flat on the back, as opposed to one that is a tube shape. It will be easier to fill with candy."
                },
                {
                    "headline": "Unwrap the peppermint candies.",
                    "description": "You will be gluing the candies directly onto the wreath to create a tiled, mosaic effect. If you'd like a non-permanent wreath, one where you can pull the candies off to eat, leave the candies in their wrappers. You can use other types of candies for this method; a mixed bag of Halloween candy would work great! Leave these candies in their wrappers, however."
                },
                {
                    "headline": "Hot glue the peppermints to the wreath.",
                    "description": "Arrange the candies in a brick-like pattern instead of straight rows. This will help conceal any gaps. Start gluing from inside the ring first, then work your way outward towards the outer edge. Stop when you are 1 inch (2.54 centimeters) away from the back edge. Your candies likely won't fit all the way, so you will hide it with a ribbon trim.Do not cover the back of the wreath with candy. If you are using a mixed bag of candy, consider laying them in a random order and overlapping some of them. This will give you a \"bushier\" wreath."
                },
                {
                    "headline": "Coat the wreath with clear, glossy spray sealer.",
                    "description": "Take the wreath outside, or into a well-ventilated area. Coat the entire wreath using spray sealer, then let the sealer dry. If you need to, give it a second coat. This will keep the candy from getting dirty or sticky.If you made the wreath using regular candy, you do not need to spray it. The candies' original wrappers will protect them."
                },
                {
                    "headline": "Glue a ribbon all the way around the edge of the wreath.",
                    "description": "Remember the 1-inch (2.54 centimeter) gap you left unfilled along the back edge of the wreath? Now is the time to hot glue a strip of ribbon to that edge. Glue the ribbon a little bit at a time; that way, the glue won't set too fast. You can use the same floral ribbon you used to wrap around your wreath in the very beginning. You can also use a fancier ribbon instead."
                },
                {
                    "headline": "Cut a 3½-foot (1.07 meters) piece of fancy ribbon and wrap it around the top of the wreath.",
                    "description": "Tie the ends of the ribbon into a large bow. If you'd like, you can cut the ends of the ribbon at an angle or into a V-shaped notch."
                },
                {
                    "headline": "Thread some more ribbon through the top of the bow, and tie it into a loop.",
                    "description": "Use this loop to hang the wreath over the front of your door, on the wall above your fireplace, or wherever you'd like."
                }
            ]
        },
        {
            "name": "Making a Pinned Candy Wreath",
            "steps": [
                {
                    "headline": "Cut 4 feet (1.22 meters) of 22-gauge floral wire and bend it in half twice.",
                    "description": "This will eventually make the hanger for your wreath."
                },
                {
                    "headline": "Wrap the wire around the top of a 16-inch (40.64 centimeters) Styrofoam ring to make the hanger.",
                    "description": "Place the wire behind the wreath, with the bent part 3 to 4 inches (7.62 to 10.16 centimeters) above the top. Wrap the loose ends of the wire around the wreath once, then wrap them around the base of the wire loop. Wrap the loose ends once more time around the wreath, then poke the ends into the Styrofoam."
                },
                {
                    "headline": "Lay a piece of cardboard or foamcore on your work surface.",
                    "description": "This will not only protect it, but also make attaching the candy to the greening pins easier."
                },
                {
                    "headline": "Attach two pieces of candy to a greening pin.",
                    "description": "Lay the candy flat on the cardboard or foamcore, and poke one of the greening pin's legs through the wrapper—just between the twist and the candy itself. Do this for the other piece of candy and the other leg. Repeat this step with about 40 to 50 candies. You can do this with any type of wrapped candy, from taffy, to Jolly Ranchers, to peppermints, to butterscotch candies. Avoid poking the pins through the wrappers outside of the twisted part. The candy will be more likely to fall off."
                },
                {
                    "headline": "Line the inside of the Styrofoam ring with the prepared candies.",
                    "description": "Take a greening pin, and poke the prongs into the Styrofoam. Push it all the way into the foam, pinning the candies against the wreath. Keep doing this until the inside part of the wreath is all covered with candy."
                },
                {
                    "headline": "Prepare more candies, then start pinning them to the outside of the Styrofoam wreath.",
                    "description": "Work your way from the outside of the wreath towards the inside. You don't have to worry about covering the back of the wreath, because it will be resting against a door or wall."
                },
                {
                    "headline": "Fill any gaps with individual candies.",
                    "description": "Use T-pins (for quilting) to secure single candy pieces to any holes or gaps in the wreath."
                },
                {
                    "headline": "Attach a bow near the top or bottom of the wreath.",
                    "description": "You can make your own bow, or buy a pre-made one from the craft store. Secure the bow to the wreath using a greening pin. If the pre-made bow has wires attached to it, you can simply wrap the wires around the wreath and twist them shut in the back."
                },
                {
                    "headline": "Thread some more ribbon through the top of the bow and tie it into a loop.",
                    "description": "Hang the wreath wherever you want. To eat the candies, simply untwist the wrapper, and pull the candy out. leave the wrapper on the wreath."
                }
            ]
        },
        {
            "name": "Making a Candy Cane Wreath",
            "steps": [
                {
                    "headline": "Hot glue the candy canes together to form heart shapes.",
                    "description": "Take two candy canes and glue them together where they touch. This would be at the bottom of the cane and at the tip of the hook. Do this for the rest of the candy canes so that you end up with ten hearts. For a nicer looking wreath, take the candy canes out of their wrappers first. Candy canes don't have to be just red and white. You can use ones in different colors too, such as pink, blue, or rainbow!"
                },
                {
                    "headline": "Arrange the candy cane hearts to form a circle, with the points facing inwards.",
                    "description": "The long, straight edges of the hearts should be facing one another. Don't worry if the straight edges don't completely touch one another; as long as the candy canes are all touching at the bottom, you will be fine."
                },
                {
                    "headline": "Glue the candy cane hearts together where they touch.",
                    "description": "This will be mostly along the long, straight edge of each heart. Don't worry if the candy canes don't touch all the way along the straight edge; focus on the center of the circle. For a fancier touch, tie a piece of red or green ribbon around the candy canes where they join, near the top. Tie each ribbon into a pretty bow."
                },
                {
                    "headline": "Make a smaller wreath in the same fashion using 12 mini candy canes.",
                    "description": "Take the mini candy canes out of their wrappers first, then glue them together to form six mini hearts. Glue the hearts together to form a circle with the points facing inwards."
                },
                {
                    "headline": "Glue the mini wreath on top of the larger wreath, right in the middle.",
                    "description": "Make sure that the centers of both wreaths match up."
                },
                {
                    "headline": "Glue a round peppermint to the center of the wreath.",
                    "description": "Take the peppermint out of its wrapper first, then cover the back with hot glue. Gently press the mint into the center of the wreath. The best type of mint to use for this would be the red-and-white \"starlight\" kind of mint. For a fancier wreath, hot glue more mints onto the top of each large candy cane \"heart,\" right where the two arches come together."
                },
                {
                    "headline": "Spray the wreath with clear, glossy sealant to make it last longer.",
                    "description": "This is a must in areas that get hot and humid. It will prevent the wreath from getting sticky. Spray the front first and let it dry, then flip the wreath over and spray the back. If you need to, do this step twice for more coverage. Be sure to spray outdoors or in a well-ventilated area. The fumes from the spray can get strong and cause headaches."
                },
                {
                    "headline": "Tie a ribbon to the top of the wreath to make a hanger.",
                    "description": "Thread a red or green ribbon through one of the hearts, then tie the ends together to make a loop."
                },
                {
                    "headline": "Hang the wreath up when you are done.",
                    "description": "Even though you sprayed the wreath with sealant, you might still want to avoid hanging the wreath in areas that get hot, damp, or humid. When the holiday season is over, store the wreath between two sheets of wax paper."
                }
            ]
        }
    ],
    "tyn": [
        "Making a Tied Candy Wreath",
        "3 to 6 pounds (1.64 to 3.28 kilograms) of individually-wrapped candy",
        "Coat hanger",
        "String or curling ribbon",
        "Scissors",
        "Decorative ribbon",
        "Making a Glued Candy Wreath",
        "16 inch (40.64 centimeters)  Styrofoam wreath",
        "Two 20-ounce (566 grams) bags of round, peppermint candies",
        "One 20-yard (18.29 meters) roll of 1½-inch (3.81 centimeters) floral ribbon",
        "One 4-yard (3.66  meters) roll of 1½-inch (3.81 centimeters) ribbon",
        "Hot glue gun",
        "Hot glue",
        "Clear, glossy spray sealer",
        "Making a Pinned Candy Wreath",
        "16-inch (40.64 centimeters) Styrofoam ring",
        "4 feet (1.22 meters) of 22-gauge floral wire",
        "9 pounds (4.92 kilograms) bags of individually-wrapped candy",
        "150 to 200 greening pins",
        "10-20 quilter’s T-pins",
        "Decorative ribbon or bow",
        "Cardboard or foamcore",
        "Making a Candy Cane Wreath",
        "20 candy canes",
        "12 mini candy canes",
        "1 starlight mint",
        "Red or green ribbon"
    ],
    "text": " Making a Tied Candy Wreath Bend a wire coat hanger into a circle shape. Simply bend the bottom, sides, and top until you get a circle. It doesn't have to be perfect. Don't cut the hanger part off; you can use this later on to hang your finished wreath!If you can't find a wire coat hanger, you can also use a metal ring instead. Cut some string into 3 to 8-inch (7.62 to 20.32 centimeters) pieces. You will be using these to tie your candy to the coat hanger base. The measurements don't have to be exact, so you could even wrap the string several times around a DVD case, then cut it to create many short pieces of string. You will be eventually trimming the string down. If you'd like a more decorative wreath, however, you could leave the string uncut. In this case, consider using curling ribbon instead. Tie each string to each piece of candy. Try to get the string right between the twisted part of the wrapper and the candy itself. You only have to tie the string to one side of the candy, and you not need to create a double knot. Do this step for all of the candy that you have. You can use any type of twist-wrapped candy, such as peppermints, Jolly Ranchers, taffy, and butterscotch. Tie the candy to the coat hanger. Take one of your tied candies, and use the tail ends of the string to tie it to the hanger. Tie the string in a tight, double knot. For a neater finish, snip the loose ends of the string off. For a more decorative finish, leave the string uncut; it will become part of the wreath's design. Keep tying the candy until the wreath is all covered and you can't fit anymore candy. Gently push down on the candy as you tie it so that it squishes together and gives you a fuller wreath. Tie a piece of ribbon into a bow around the top of the wreath. Wrap a piece of ribbon at the base of the hanger, and tie it into a bow. Cut the tail ends of the bow at into angles or into V-shaped notches. The ribbon can be simple satin or velvet, or it could be one of those fancier ribbons with glitter or printed designs. Use the hook to hang your wreath. If you'd like the hook to be less visible, you can paint it to match your wall or door. Ordinary acrylic paint will do, but enamel/model paint will also work. Nail polish will also do in a pinch. Making a Glued Candy Wreath Wrap a 16-inch (40.64 centimeters) Styrofoam wreath with 1½-inch (3.81 centimeters) wide floral ribbon. Choose a color that matches your peppermint candy, such as white or red; if your peppermint candy is green, then you could even use green ribbon. This will give the hot glue something to stick to. It will also conceal any Styrofoam that might show through any gaps. Secure both ends of the ribbon to the back of the wreath using hot glue. Choose the kind of Styrofoam wreath that is flat on the back, as opposed to one that is a tube shape. It will be easier to fill with candy. Unwrap the peppermint candies. You will be gluing the candies directly onto the wreath to create a tiled, mosaic effect. If you'd like a non-permanent wreath, one where you can pull the candies off to eat, leave the candies in their wrappers. You can use other types of candies for this method; a mixed bag of Halloween candy would work great! Leave these candies in their wrappers, however. Hot glue the peppermints to the wreath. Arrange the candies in a brick-like pattern instead of straight rows. This will help conceal any gaps. Start gluing from inside the ring first, then work your way outward towards the outer edge. Stop when you are 1 inch (2.54 centimeters) away from the back edge. Your candies likely won't fit all the way, so you will hide it with a ribbon trim.Do not cover the back of the wreath with candy. If you are using a mixed bag of candy, consider laying them in a random order and overlapping some of them. This will give you a \"bushier\" wreath. Coat the wreath with clear, glossy spray sealer. Take the wreath outside, or into a well-ventilated area. Coat the entire wreath using spray sealer, then let the sealer dry. If you need to, give it a second coat. This will keep the candy from getting dirty or sticky.If you made the wreath using regular candy, you do not need to spray it. The candies' original wrappers will protect them. Glue a ribbon all the way around the edge of the wreath. Remember the 1-inch (2.54 centimeter) gap you left unfilled along the back edge of the wreath? Now is the time to hot glue a strip of ribbon to that edge. Glue the ribbon a little bit at a time; that way, the glue won't set too fast. You can use the same floral ribbon you used to wrap around your wreath in the very beginning. You can also use a fancier ribbon instead. Cut a 3½-foot (1.07 meters) piece of fancy ribbon and wrap it around the top of the wreath. Tie the ends of the ribbon into a large bow. If you'd like, you can cut the ends of the ribbon at an angle or into a V-shaped notch. Thread some more ribbon through the top of the bow, and tie it into a loop. Use this loop to hang the wreath over the front of your door, on the wall above your fireplace, or wherever you'd like. Making a Pinned Candy Wreath Cut 4 feet (1.22 meters) of 22-gauge floral wire and bend it in half twice. This will eventually make the hanger for your wreath. Wrap the wire around the top of a 16-inch (40.64 centimeters) Styrofoam ring to make the hanger. Place the wire behind the wreath, with the bent part 3 to 4 inches (7.62 to 10.16 centimeters) above the top. Wrap the loose ends of the wire around the wreath once, then wrap them around the base of the wire loop. Wrap the loose ends once more time around the wreath, then poke the ends into the Styrofoam. Lay a piece of cardboard or foamcore on your work surface. This will not only protect it, but also make attaching the candy to the greening pins easier. Attach two pieces of candy to a greening pin. Lay the candy flat on the cardboard or foamcore, and poke one of the greening pin's legs through the wrapper—just between the twist and the candy itself. Do this for the other piece of candy and the other leg. Repeat this step with about 40 to 50 candies. You can do this with any type of wrapped candy, from taffy, to Jolly Ranchers, to peppermints, to butterscotch candies. Avoid poking the pins through the wrappers outside of the twisted part. The candy will be more likely to fall off. Line the inside of the Styrofoam ring with the prepared candies. Take a greening pin, and poke the prongs into the Styrofoam. Push it all the way into the foam, pinning the candies against the wreath. Keep doing this until the inside part of the wreath is all covered with candy. Prepare more candies, then start pinning them to the outside of the Styrofoam wreath. Work your way from the outside of the wreath towards the inside. You don't have to worry about covering the back of the wreath, because it will be resting against a door or wall. Fill any gaps with individual candies. Use T-pins (for quilting) to secure single candy pieces to any holes or gaps in the wreath. Attach a bow near the top or bottom of the wreath. You can make your own bow, or buy a pre-made one from the craft store. Secure the bow to the wreath using a greening pin. If the pre-made bow has wires attached to it, you can simply wrap the wires around the wreath and twist them shut in the back. Thread some more ribbon through the top of the bow and tie it into a loop. Hang the wreath wherever you want. To eat the candies, simply untwist the wrapper, and pull the candy out. leave the wrapper on the wreath. Making a Candy Cane Wreath Hot glue the candy canes together to form heart shapes. Take two candy canes and glue them together where they touch. This would be at the bottom of the cane and at the tip of the hook. Do this for the rest of the candy canes so that you end up with ten hearts. For a nicer looking wreath, take the candy canes out of their wrappers first. Candy canes don't have to be just red and white. You can use ones in different colors too, such as pink, blue, or rainbow! Arrange the candy cane hearts to form a circle, with the points facing inwards. The long, straight edges of the hearts should be facing one another. Don't worry if the straight edges don't completely touch one another; as long as the candy canes are all touching at the bottom, you will be fine. Glue the candy cane hearts together where they touch. This will be mostly along the long, straight edge of each heart. Don't worry if the candy canes don't touch all the way along the straight edge; focus on the center of the circle. For a fancier touch, tie a piece of red or green ribbon around the candy canes where they join, near the top. Tie each ribbon into a pretty bow. Make a smaller wreath in the same fashion using 12 mini candy canes. Take the mini candy canes out of their wrappers first, then glue them together to form six mini hearts. Glue the hearts together to form a circle with the points facing inwards. Glue the mini wreath on top of the larger wreath, right in the middle. Make sure that the centers of both wreaths match up. Glue a round peppermint to the center of the wreath. Take the peppermint out of its wrapper first, then cover the back with hot glue. Gently press the mint into the center of the wreath. The best type of mint to use for this would be the red-and-white \"starlight\" kind of mint. For a fancier wreath, hot glue more mints onto the top of each large candy cane \"heart,\" right where the two arches come together. Spray the wreath with clear, glossy sealant to make it last longer. This is a must in areas that get hot and humid. It will prevent the wreath from getting sticky. Spray the front first and let it dry, then flip the wreath over and spray the back. If you need to, do this step twice for more coverage. Be sure to spray outdoors or in a well-ventilated area. The fumes from the spray can get strong and cause headaches. Tie a ribbon to the top of the wreath to make a hanger. Thread a red or green ribbon through one of the hearts, then tie the ends together to make a loop. Hang the wreath up when you are done. Even though you sprayed the wreath with sealant, you might still want to avoid hanging the wreath in areas that get hot, damp, or humid. When the holiday season is over, store the wreath between two sheets of wax paper.",
    "sentences": [
        " Making a Tied Candy Wreath Bend a wire coat hanger into a circle shape.",
        "Simply bend the bottom, sides, and top until you get a circle.",
        "It doesn't have to be perfect.",
        "Don't cut the hanger part off; you can use this later on to hang your finished wreath!If you can't find a wire coat hanger, you can also use a metal ring instead.",
        "Cut some string into 3 to 8-inch (7.62 to 20.32 centimeters) pieces.",
        "You will be using these to tie your candy to the coat hanger base.",
        "The measurements don't have to be exact, so you could even wrap the string several times around a DVD case, then cut it to create many short pieces of string.",
        "You will be eventually trimming the string down.",
        "If you'd like a more decorative wreath, however, you could leave the string uncut.",
        "In this case, consider using curling ribbon instead.",
        "Tie each string to each piece of candy.",
        "Try to get the string right between the twisted part of the wrapper and the candy itself.",
        "You only have to tie the string to one side of the candy, and you not need to create a double knot.",
        "Do this step for all of the candy that you have.",
        "You can use any type of twist-wrapped candy, such as peppermints, Jolly Ranchers, taffy, and butterscotch.",
        "Tie the candy to the coat hanger.",
        "Take one of your tied candies, and use the tail ends of the string to tie it to the hanger.",
        "Tie the string in a tight, double knot.",
        "For a neater finish, snip the loose ends of the string off.",
        "For a more decorative finish, leave the string uncut; it will become part of the wreath's design.",
        "Keep tying the candy until the wreath is all covered and you can't fit anymore candy.",
        "Gently push down on the candy as you tie it so that it squishes together and gives you a fuller wreath.",
        "Tie a piece of ribbon into a bow around the top of the wreath.",
        "Wrap a piece of ribbon at the base of the hanger, and tie it into a bow.",
        "Cut the tail ends of the bow at into angles or into V-shaped notches.",
        "The ribbon can be simple satin or velvet, or it could be one of those fancier ribbons with glitter or printed designs.",
        "Use the hook to hang your wreath.",
        "If you'd like the hook to be less visible, you can paint it to match your wall or door.",
        "Ordinary acrylic paint will do, but enamel/model paint will also work.",
        "Nail polish will also do in a pinch.",
        "Making a Glued Candy Wreath Wrap a 16-inch (40.64 centimeters) Styrofoam wreath with 1½-inch (3.81 centimeters) wide floral ribbon.",
        "Choose a color that matches your peppermint candy, such as white or red; if your peppermint candy is green, then you could even use green ribbon.",
        "This will give the hot glue something to stick to.",
        "It will also conceal any Styrofoam that might show through any gaps.",
        "Secure both ends of the ribbon to the back of the wreath using hot glue.",
        "Choose the kind of Styrofoam wreath that is flat on the back, as opposed to one that is a tube shape.",
        "It will be easier to fill with candy.",
        "Unwrap the peppermint candies.",
        "You will be gluing the candies directly onto the wreath to create a tiled, mosaic effect.",
        "If you'd like a non-permanent wreath, one where you can pull the candies off to eat, leave the candies in their wrappers.",
        "You can use other types of candies for this method; a mixed bag of Halloween candy would work great!",
        "Leave these candies in their wrappers, however.",
        "Hot glue the peppermints to the wreath.",
        "Arrange the candies in a brick-like pattern instead of straight rows.",
        "This will help conceal any gaps.",
        "Start gluing from inside the ring first, then work your way outward towards the outer edge.",
        "Stop when you are 1 inch (2.54 centimeters) away from the back edge.",
        "Your candies likely won't fit all the way, so you will hide it with a ribbon trim.Do not cover the back of the wreath with candy.",
        "If you are using a mixed bag of candy, consider laying them in a random order and overlapping some of them.",
        "This will give you a \"bushier\" wreath.",
        "Coat the wreath with clear, glossy spray sealer.",
        "Take the wreath outside, or into a well-ventilated area.",
        "Coat the entire wreath using spray sealer, then let the sealer dry.",
        "If you need to, give it a second coat.",
        "This will keep the candy from getting dirty or sticky.If you made the wreath using regular candy, you do not need to spray it.",
        "The candies' original wrappers will protect them.",
        "Glue a ribbon all the way around the edge of the wreath.",
        "Remember the 1-inch (2.54 centimeter) gap you left unfilled along the back edge of the wreath?",
        "Now is the time to hot glue a strip of ribbon to that edge.",
        "Glue the ribbon a little bit at a time; that way, the glue won't set too fast.",
        "You can use the same floral ribbon you used to wrap around your wreath in the very beginning.",
        "You can also use a fancier ribbon instead.",
        "Cut a 3½-foot (1.07 meters) piece of fancy ribbon and wrap it around the top of the wreath.",
        "Tie the ends of the ribbon into a large bow.",
        "If you'd like, you can cut the ends of the ribbon at an angle or into a V-shaped notch.",
        "Thread some more ribbon through the top of the bow, and tie it into a loop.",
        "Use this loop to hang the wreath over the front of your door, on the wall above your fireplace, or wherever you'd like.",
        "Making a Pinned Candy Wreath Cut 4 feet (1.22 meters) of 22-gauge floral wire and bend it in half twice.",
        "This will eventually make the hanger for your wreath.",
        "Wrap the wire around the top of a 16-inch (40.64 centimeters) Styrofoam ring to make the hanger.",
        "Place the wire behind the wreath, with the bent part 3 to 4 inches (7.62 to 10.16 centimeters) above the top.",
        "Wrap the loose ends of the wire around the wreath once, then wrap them around the base of the wire loop.",
        "Wrap the loose ends once more time around the wreath, then poke the ends into the Styrofoam.",
        "Lay a piece of cardboard or foamcore on your work surface.",
        "This will not only protect it, but also make attaching the candy to the greening pins easier.",
        "Attach two pieces of candy to a greening pin.",
        "Lay the candy flat on the cardboard or foamcore, and poke one of the greening pin's legs through the wrapper—just between the twist and the candy itself.",
        "Do this for the other piece of candy and the other leg.",
        "Repeat this step with about 40 to 50 candies.",
        "You can do this with any type of wrapped candy, from taffy, to Jolly Ranchers, to peppermints, to butterscotch candies.",
        "Avoid poking the pins through the wrappers outside of the twisted part.",
        "The candy will be more likely to fall off.",
        "Line the inside of the Styrofoam ring with the prepared candies.",
        "Take a greening pin, and poke the prongs into the Styrofoam.",
        "Push it all the way into the foam, pinning the candies against the wreath.",
        "Keep doing this until the inside part of the wreath is all covered with candy.",
        "Prepare more candies, then start pinning them to the outside of the Styrofoam wreath.",
        "Work your way from the outside of the wreath towards the inside.",
        "You don't have to worry about covering the back of the wreath, because it will be resting against a door or wall.",
        "Fill any gaps with individual candies.",
        "Use T-pins (for quilting) to secure single candy pieces to any holes or gaps in the wreath.",
        "Attach a bow near the top or bottom of the wreath.",
        "You can make your own bow, or buy a pre-made one from the craft store.",
        "Secure the bow to the wreath using a greening pin.",
        "If the pre-made bow has wires attached to it, you can simply wrap the wires around the wreath and twist them shut in the back.",
        "Thread some more ribbon through the top of the bow and tie it into a loop.",
        "Hang the wreath wherever you want.",
        "To eat the candies, simply untwist the wrapper, and pull the candy out.",
        "leave the wrapper on the wreath.",
        "Making a Candy Cane Wreath Hot glue the candy canes together to form heart shapes.",
        "Take two candy canes and glue them together where they touch.",
        "This would be at the bottom of the cane and at the tip of the hook.",
        "Do this for the rest of the candy canes so that you end up with ten hearts.",
        "For a nicer looking wreath, take the candy canes out of their wrappers first.",
        "Candy canes don't have to be just red and white.",
        "You can use ones in different colors too, such as pink, blue, or rainbow!",
        "Arrange the candy cane hearts to form a circle, with the points facing inwards.",
        "The long, straight edges of the hearts should be facing one another.",
        "Don't worry if the straight edges don't completely touch one another; as long as the candy canes are all touching at the bottom, you will be fine.",
        "Glue the candy cane hearts together where they touch.",
        "This will be mostly along the long, straight edge of each heart.",
        "Don't worry if the candy canes don't touch all the way along the straight edge; focus on the center of the circle.",
        "For a fancier touch, tie a piece of red or green ribbon around the candy canes where they join, near the top.",
        "Tie each ribbon into a pretty bow.",
        "Make a smaller wreath in the same fashion using 12 mini candy canes.",
        "Take the mini candy canes out of their wrappers first, then glue them together to form six mini hearts.",
        "Glue the hearts together to form a circle with the points facing inwards.",
        "Glue the mini wreath on top of the larger wreath, right in the middle.",
        "Make sure that the centers of both wreaths match up.",
        "Glue a round peppermint to the center of the wreath.",
        "Take the peppermint out of its wrapper first, then cover the back with hot glue.",
        "Gently press the mint into the center of the wreath.",
        "The best type of mint to use for this would be the red-and-white \"starlight\" kind of mint.",
        "For a fancier wreath, hot glue more mints onto the top of each large candy cane \"heart,\" right where the two arches come together.",
        "Spray the wreath with clear, glossy sealant to make it last longer.",
        "This is a must in areas that get hot and humid.",
        "It will prevent the wreath from getting sticky.",
        "Spray the front first and let it dry, then flip the wreath over and spray the back.",
        "If you need to, do this step twice for more coverage.",
        "Be sure to spray outdoors or in a well-ventilated area.",
        "The fumes from the spray can get strong and cause headaches.",
        "Tie a ribbon to the top of the wreath to make a hanger.",
        "Thread a red or green ribbon through one of the hearts, then tie the ends together to make a loop.",
        "Hang the wreath up when you are done.",
        "Even though you sprayed the wreath with sealant, you might still want to avoid hanging the wreath in areas that get hot, damp, or humid.",
        "When the holiday season is over, store the wreath between two sheets of wax paper."
    ]
}