{
    "title": "How to Clean a Touch Screen",
    "url": "https://www.wikihow.com/Clean-a-Touch-Screen",
    "category_hierarchy": [
        "Computers and Electronics",
        "Telephones",
        "Caring for Your Phone"
    ],
    "methods": [
        {
            "name": "Cleaning with a Microfiber Cloth",
            "steps": [
                {
                    "headline": "Choose a microfiber cloth.",
                    "description": "This is ideal for cleaning a touchscreen. Some devices will have such a cloth included or perhaps you can borrow one you use on your sunglasses. The cost of such cloth varies. For cloth recommended by companies for their products, the price can be considerably higher simply because of the recommendation. Look around for a good deal on such cloth or substitute with a cheaper but still effective microfiber cloth."
                },
                {
                    "headline": "Turn off the device before commencing to clean it.",
                    "description": "It is usually much easier to see where to clean when the device is switched off."
                },
                {
                    "headline": "Give the screen a once over by brushing it with the microfiber in small circles.",
                    "description": "This will remove the majority of simple imperfections."
                },
                {
                    "headline": "Only if truly needed, moisten a cotton cloth, even the corner of your cotton shirt, and repeat the small circular motions.",
                    "description": "It may actually be enough to just breathe over the screen and use that moisture to clean with. Read the instructions accompanying the cloth you're using. Some of them need to be made slightly damp before use. If this is the case, skip this step and follow the cloth's instructions instead. If dampening a cloth, it is best to use distilled water or a cleaner specifically designed for cleaning touch screens."
                },
                {
                    "headline": "Brush again with the microfiber cloth to finish off.",
                    "description": "Don't over-rub though! And if there is any dampness left, just leave it to air dry. Do not put too much pressure on the screen when cleaning it."
                },
                {
                    "headline": "Wash the microfiber cloth.",
                    "description": "To wash the microfiber cloth, soak it in warm, soapy water. The warm water serves to open the fibers and release the grime that may have gathered. Scrub the cloth lightly while soaking it (not too hard or you will damage the cloth). After soaking, avoid  squeezing out any excess water, let the cloth out to air dry. If you're in a hurry, you may want to blow dry it. Do not wash any screens with the cloth until dry (or lightly damp) to the touch."
                }
            ]
        },
        {
            "name": "Disinfection with Alcohol Gel",
            "steps": [
                {
                    "headline": "Get some alcohol gel.",
                    "description": "It is also known as hand sanitizer."
                },
                {
                    "headline": "Take a clean paper towel.",
                    "description": ""
                },
                {
                    "headline": "Squeeze a little gel into the paper towel.",
                    "description": ""
                },
                {
                    "headline": "Wipe down the screen.",
                    "description": ""
                },
                {
                    "headline": "Use a clean microfiber cloth to remove smudges - but there shouldn't be any!",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Microfiber cloth or a similar, soft and lint-free cloth.",
        "Distilled water or commercial touchscreen targeted cleaning agent."
    ],
    "text": " Cleaning with a Microfiber Cloth Choose a microfiber cloth. This is ideal for cleaning a touchscreen. Some devices will have such a cloth included or perhaps you can borrow one you use on your sunglasses. The cost of such cloth varies. For cloth recommended by companies for their products, the price can be considerably higher simply because of the recommendation. Look around for a good deal on such cloth or substitute with a cheaper but still effective microfiber cloth. Turn off the device before commencing to clean it. It is usually much easier to see where to clean when the device is switched off. Give the screen a once over by brushing it with the microfiber in small circles. This will remove the majority of simple imperfections. Only if truly needed, moisten a cotton cloth, even the corner of your cotton shirt, and repeat the small circular motions. It may actually be enough to just breathe over the screen and use that moisture to clean with. Read the instructions accompanying the cloth you're using. Some of them need to be made slightly damp before use. If this is the case, skip this step and follow the cloth's instructions instead. If dampening a cloth, it is best to use distilled water or a cleaner specifically designed for cleaning touch screens. Brush again with the microfiber cloth to finish off. Don't over-rub though! And if there is any dampness left, just leave it to air dry. Do not put too much pressure on the screen when cleaning it. Wash the microfiber cloth. To wash the microfiber cloth, soak it in warm, soapy water. The warm water serves to open the fibers and release the grime that may have gathered. Scrub the cloth lightly while soaking it (not too hard or you will damage the cloth). After soaking, avoid  squeezing out any excess water, let the cloth out to air dry. If you're in a hurry, you may want to blow dry it. Do not wash any screens with the cloth until dry (or lightly damp) to the touch. Disinfection with Alcohol Gel Get some alcohol gel. It is also known as hand sanitizer. Take a clean paper towel.  Squeeze a little gel into the paper towel.  Wipe down the screen.  Use a clean microfiber cloth to remove smudges - but there shouldn't be any! ",
    "sentences": [
        " Cleaning with a Microfiber Cloth Choose a microfiber cloth.",
        "This is ideal for cleaning a touchscreen.",
        "Some devices will have such a cloth included or perhaps you can borrow one you use on your sunglasses.",
        "The cost of such cloth varies.",
        "For cloth recommended by companies for their products, the price can be considerably higher simply because of the recommendation.",
        "Look around for a good deal on such cloth or substitute with a cheaper but still effective microfiber cloth.",
        "Turn off the device before commencing to clean it.",
        "It is usually much easier to see where to clean when the device is switched off.",
        "Give the screen a once over by brushing it with the microfiber in small circles.",
        "This will remove the majority of simple imperfections.",
        "Only if truly needed, moisten a cotton cloth, even the corner of your cotton shirt, and repeat the small circular motions.",
        "It may actually be enough to just breathe over the screen and use that moisture to clean with.",
        "Read the instructions accompanying the cloth you're using.",
        "Some of them need to be made slightly damp before use.",
        "If this is the case, skip this step and follow the cloth's instructions instead.",
        "If dampening a cloth, it is best to use distilled water or a cleaner specifically designed for cleaning touch screens.",
        "Brush again with the microfiber cloth to finish off.",
        "Don't over-rub though!",
        "And if there is any dampness left, just leave it to air dry.",
        "Do not put too much pressure on the screen when cleaning it.",
        "Wash the microfiber cloth.",
        "To wash the microfiber cloth, soak it in warm, soapy water.",
        "The warm water serves to open the fibers and release the grime that may have gathered.",
        "Scrub the cloth lightly while soaking it (not too hard or you will damage the cloth).",
        "After soaking, avoid  squeezing out any excess water, let the cloth out to air dry.",
        "If you're in a hurry, you may want to blow dry it.",
        "Do not wash any screens with the cloth until dry (or lightly damp) to the touch.",
        "Disinfection with Alcohol Gel Get some alcohol gel.",
        "It is also known as hand sanitizer.",
        "Take a clean paper towel.",
        "Squeeze a little gel into the paper towel.",
        "Wipe down the screen.",
        "Use a clean microfiber cloth to remove smudges - but there shouldn't be any!"
    ]
}