{
    "title": "How to Care for a Fire Bellied Toad (Bombina Orientalis)",
    "url": "https://www.wikihow.com/Care-for-a-Fire-Bellied-Toad-(Bombina-Orientalis)",
    "category_hierarchy": [
        "Pets and Animals",
        "Amphibian",
        "Frogs"
    ],
    "parts": [
        {
            "name": "Setting Up an Enclosure",
            "steps": [
                {
                    "headline": "Get a 10- to 15-gallon (38- to 57-Liter) aquarium.",
                    "description": "An aquarium or other container of similar size provides enough space for 2 or 3 toads. Make sure the enclosure has enough floor space for you to include land and water areas for these semi-aquatic creatures. While an aquarium may be better for you if you plan on watching your fire-bellied toads, a container with opaque sides may be less stressful for the animals. Fire-bellies like to jump, so make sure whatever enclosure you get has a lid to keep them from getting out. Plastic or wire mesh is fine."
                },
                {
                    "headline": "Treat water with an aquarium additive a day in advance.",
                    "description": "If you're using tap water, use a water conditioner or aquarium additive to remove chlorine and other chemicals from the water that may harm your toad. Leave the water sitting for 24 hours at room temperature before you introduce it to your toad's enclosure. If you don't want to go through the trouble of conditioning tap water, you can also use bottled spring water. However, don't use distilled water. It lacks minerals that fire-bellied toads need.Tip: If you have a larger water area, you can use an aquarium filter to improve the water quality. Use a large rock or piece of driftwood to deflect so the filter doesn't create a current in the water."
                },
                {
                    "headline": "Line your land area with 3 to 4 inches (7.6 to 10.2 cm) of topsoil.",
                    "description": "Fire-bellied toads are semi-aquatic, so they need both land and water. Plan for the land area to cover at least half of the enclosure's floor space. Use clean bagged topsoil with no additives – fertilizers and other additives can harm fire-bellied toads. Add cork bark to separate the substrate from the water. You can find substrate materials at any garden store. Some exotic pet stores may also have substrate materials packaged specifically for use in amphibian enclosures. Topsoil provides a more natural look for the enclosure, and won't harm your fire-bellies if they accidentally ingest some of it along with their food. Some fire-bellies also like to burrow in the soil to hide. Sheet moss and java moss also make good substrates. If you plan on growing live plants in the enclosure, you might need deeper substrate, depending on the needs of the plants.Variation: If you're using large river rocks to create your land areas, you may not need any substrate at all."
                },
                {
                    "headline": "Use bark, stones, and driftwood to create variation in your land area.",
                    "description": "Exotic pet stores have various items you can use to decorate the land area of your toad's enclosure. Choose items that look interesting to you and will provide different levels and hiding spaces in the land area. Your fire-bellied toad's enclosure can be as simple or as fancy as you like. At a minimum, your toad needs high and low areas, a slope into the water, and areas of cover where it can hide."
                },
                {
                    "headline": "Pour 1 to 2 inches (2.5 to 5.1 cm) of treated water into the water area.",
                    "description": "Place river stones throughout the water area to create shallow places. Despite being semi-aquatic creates, fire-bellies don't like to be submerged in water and aren't really fond of swimming. Use stones or moss around the edge of the water area to create a gentle slope into the water so that your toad can easily get in and out. Add pieces of driftwood or river rocks to the water, particularly in the deepest parts, so that your toad can rest if it wants.Variation: You can also put the water in a shallow dish and place the whole thing in the enclosure. Using a dish may make it easier to change the water when it becomes soiled."
                },
                {
                    "headline": "Add water plants to give your toad some shelter.",
                    "description": "You can grow floating vegetation, such as Amazon frogbit and giant salvinia, on the surface of the water to give your toad cover as it moves through the water. Aquatic plants such as ferns also add a natural touch to the enclosure and help keep the water clean. You can increase the depth of your water as needed to accommodate the water plants. Just make sure you have some shallower areas, as well as plenty of rocks or driftwood for your toad to land on in deeper water. Fire-bellies also like to dig, so make sure aquatic plants are at a depth that will prevent them from being uprooted.Tip: Add an incandescent light if you have live plants growing in the enclosure to ensure the plants have plenty of light."
                },
                {
                    "headline": "Create a hide box so your toad feels secure.",
                    "description": "Any object such as a broken flower pot, large pieces of driftwood, or another container can be used as a hide box where your toad can go when it feels threatened. In addition to the larger hide box, include plenty of covered areas throughout the enclosure where your toad can seek shelter. Overhanging stones, plants, and driftwood all create hiding places as well as adding interesting features to the enclosure. If you have multiple fire-bellies, make sure you have enough hiding places that each of them can hide securely at the same time."
                },
                {
                    "headline": "Monitor the temperature in the enclosure and adjust as necessary.",
                    "description": "Fire-bellied toads are comfortable at room temperature, so you might not need to make much adjustment. Your fire-bellies will be just fine with a temperature range between 65 and 78 °F (18 and 26 °C). Place a thermometer in the enclosure to monitor the temperature. Fire-bellied toads are in danger if the temperature rises to 82 °F (28 °C). They'll be okay in temperatures as low as 50 °F (10 °C), but it's still a good idea to place the enclosure away from any windows or drafty areas."
                },
                {
                    "headline": "Maintain 50 to 70 percent humidity.",
                    "description": "Proper humidity is perhaps the most important condition for the well-being of your fire-bellies. Monitor humidity with a hygrometer and use a hydrostat to maintain the correct moisture level in the enclosure. These tools are available at exotic pet stores. Keeping the substrate damp and using misters can help keep proper humidity levels. Make sure any water used in misters or foggers has been conditioned with an aquarium conditioner or additive unless you're using bottled spring water."
                },
                {
                    "headline": "Use an ultraviolet light to provide 10 hours of light each day.",
                    "description": "Fire-bellied toads have a light cycle requiring around 10 hours of light and 14 hours of darkness in a 24-hour period. An ultraviolet light can help you maintain the correct light balance. Many ultraviolet lights can be set up on a timer so you can maintain the same light cycle for your fire-bellies every day without having to manually turn the light on and off."
                }
            ]
        },
        {
            "name": "Feeding Your Fire-Bellied Toad",
            "steps": [
                {
                    "headline": "Provide daily feedings of live crickets for the first year.",
                    "description": "Like most amphibians, fire-bellied toads only recognize live prey. Live crickets, which you can purchase at any pet store or feed store, make up the bulk of their diet. You can supplement with wax worms, earthworms, and similar food items. For young fire-bellies, feed them as much as they can eat in 10 or 15 minutes. This typically amounts to between 2 and 6 crickets."
                },
                {
                    "headline": "Give adult fire-bellied toads live crickets every 2 or 3 days.",
                    "description": "Once your fire-bellied toads have reached maturity, continue to feed them the same amount. However, decrease their feedings from daily to once every 2 or 3 days. For most adult fire-bellied toads, this amounts to between 2 and 6 live food items at each feeding.Tip: Some keepers use tweezers or forceps to deliver food to their fire-bellies. If you feed your toads by hand, wear gloves and wash your hands after."
                },
                {
                    "headline": "Add reptile vitamin and mineral supplements once every 2 to 4 feedings.",
                    "description": "Buy reptile vitamins and mineral supplements of high quality from a local exotic pet store, or online. To use it, cover the crickets or other live food with the supplement before feeding. In your toad's first year, give it supplements with every other feeding. If you're unsure about the quality of supplements, ask your exotic pet veterinarian what brands they recommend."
                },
                {
                    "headline": "Remove uneaten food or dead food items immediately.",
                    "description": "Both dead and living crickets and other food items can potentially foul the water and cause an imbalance in your toad's habitat. When it's clear that your fire-bellies are done eating, promptly remove the leftovers and discard them. Always wear gloves when reaching inside the toad's enclosure and wash your hands immediately after disposing of the leftovers."
                }
            ]
        },
        {
            "name": "Maintaining the Enclosure",
            "steps": [
                {
                    "headline": "Spot-clean the substrate daily to remove waste and fungus.",
                    "description": "Each day, look over the substrate and remove anything that looks dirty or scummy. If fungus is starting to grow, remove the fungus and the substrate immediately around it and replace. Gently swirl the soil around with a finger to make sure there aren't any contaminants hiding below the surface. Always wear gloves, as the oils on your hands can harm your fire-bellies. If more extensive cleaning is required, you may want to remove your fire-bellies from the enclosure first. Place them in a bucket or plastic container. Make sure there's a properly ventilated lid so they don't jump out.Tip: Remove waste, such as feces, immediately when you see it. This can quickly foul your toad's environment."
                },
                {
                    "headline": "Change the water when it becomes murky or soiled.",
                    "description": "How often you need to change the water depends on the size of your set-up and the number of fire-bellies you have. If the water in your enclosure consists of a small dish of water, change it every day. Larger water areas may only need to be changed weekly. If you have an aquarium filter for your water, you likely only need to change it once every other week. However, even if you have a filter, you should still monitor the water quality daily and remove waste and other contaminants."
                },
                {
                    "headline": "Sprinkle water on the substrate once or twice a week.",
                    "description": "Use water that has been conditioned and left out at room temperature for 24 hours, or get bottled spring water. Moisten the substrate so that it's damp. Check the moisture of the substrate before adding more water. Don't allow it to become soggy or water-logged. If you are using river stones instead of substrate, simply spray them down with water so that the stones are damp. You shouldn't have any pooling water on or between stones (unless the stones are at the edge of the water area)."
                },
                {
                    "headline": "Use hot water to clean the enclosure when necessary.",
                    "description": "If the sides of the enclosure need cleaning, remove everything from the enclosure (including the toads), then wipe it down with hot water only. Do not use soap, disinfectants, or other cleaners as they could harm your toads. Clean any features in the enclosure with hot water as well. Throw out the old substrate and replace it with new substrate when you return everything to the clean enclosure.Tip: Make sure the temperature and humidity are appropriate before returning your fire-bellies to their enclosure."
                }
            ]
        }
    ],
    "tyn": [
        "10 to 15 gallons (38 to 57 L) aquarium or similar-sized container",
        "Topsoil, moss, or other substrate",
        "Water conditioner or additive",
        "Plants, rocks, or other features",
        "Thermometer and thermostat",
        "Hygrometer and hydrostat",
        "Ultraviolet light",
        "Live feeders",
        "Reptile vitamin and mineral supplements"
    ],
    "text": " Setting Up an Enclosure Get a 10- to 15-gallon (38- to 57-Liter) aquarium. An aquarium or other container of similar size provides enough space for 2 or 3 toads. Make sure the enclosure has enough floor space for you to include land and water areas for these semi-aquatic creatures. While an aquarium may be better for you if you plan on watching your fire-bellied toads, a container with opaque sides may be less stressful for the animals. Fire-bellies like to jump, so make sure whatever enclosure you get has a lid to keep them from getting out. Plastic or wire mesh is fine. Treat water with an aquarium additive a day in advance. If you're using tap water, use a water conditioner or aquarium additive to remove chlorine and other chemicals from the water that may harm your toad. Leave the water sitting for 24 hours at room temperature before you introduce it to your toad's enclosure. If you don't want to go through the trouble of conditioning tap water, you can also use bottled spring water. However, don't use distilled water. It lacks minerals that fire-bellied toads need.Tip: If you have a larger water area, you can use an aquarium filter to improve the water quality. Use a large rock or piece of driftwood to deflect so the filter doesn't create a current in the water. Line your land area with 3 to 4 inches (7.6 to 10.2 cm) of topsoil. Fire-bellied toads are semi-aquatic, so they need both land and water. Plan for the land area to cover at least half of the enclosure's floor space. Use clean bagged topsoil with no additives – fertilizers and other additives can harm fire-bellied toads. Add cork bark to separate the substrate from the water. You can find substrate materials at any garden store. Some exotic pet stores may also have substrate materials packaged specifically for use in amphibian enclosures. Topsoil provides a more natural look for the enclosure, and won't harm your fire-bellies if they accidentally ingest some of it along with their food. Some fire-bellies also like to burrow in the soil to hide. Sheet moss and java moss also make good substrates. If you plan on growing live plants in the enclosure, you might need deeper substrate, depending on the needs of the plants.Variation: If you're using large river rocks to create your land areas, you may not need any substrate at all. Use bark, stones, and driftwood to create variation in your land area. Exotic pet stores have various items you can use to decorate the land area of your toad's enclosure. Choose items that look interesting to you and will provide different levels and hiding spaces in the land area. Your fire-bellied toad's enclosure can be as simple or as fancy as you like. At a minimum, your toad needs high and low areas, a slope into the water, and areas of cover where it can hide. Pour 1 to 2 inches (2.5 to 5.1 cm) of treated water into the water area. Place river stones throughout the water area to create shallow places. Despite being semi-aquatic creates, fire-bellies don't like to be submerged in water and aren't really fond of swimming. Use stones or moss around the edge of the water area to create a gentle slope into the water so that your toad can easily get in and out. Add pieces of driftwood or river rocks to the water, particularly in the deepest parts, so that your toad can rest if it wants.Variation: You can also put the water in a shallow dish and place the whole thing in the enclosure. Using a dish may make it easier to change the water when it becomes soiled. Add water plants to give your toad some shelter. You can grow floating vegetation, such as Amazon frogbit and giant salvinia, on the surface of the water to give your toad cover as it moves through the water. Aquatic plants such as ferns also add a natural touch to the enclosure and help keep the water clean. You can increase the depth of your water as needed to accommodate the water plants. Just make sure you have some shallower areas, as well as plenty of rocks or driftwood for your toad to land on in deeper water. Fire-bellies also like to dig, so make sure aquatic plants are at a depth that will prevent them from being uprooted.Tip: Add an incandescent light if you have live plants growing in the enclosure to ensure the plants have plenty of light. Create a hide box so your toad feels secure. Any object such as a broken flower pot, large pieces of driftwood, or another container can be used as a hide box where your toad can go when it feels threatened. In addition to the larger hide box, include plenty of covered areas throughout the enclosure where your toad can seek shelter. Overhanging stones, plants, and driftwood all create hiding places as well as adding interesting features to the enclosure. If you have multiple fire-bellies, make sure you have enough hiding places that each of them can hide securely at the same time. Monitor the temperature in the enclosure and adjust as necessary. Fire-bellied toads are comfortable at room temperature, so you might not need to make much adjustment. Your fire-bellies will be just fine with a temperature range between 65 and 78 °F (18 and 26 °C). Place a thermometer in the enclosure to monitor the temperature. Fire-bellied toads are in danger if the temperature rises to 82 °F (28 °C). They'll be okay in temperatures as low as 50 °F (10 °C), but it's still a good idea to place the enclosure away from any windows or drafty areas. Maintain 50 to 70 percent humidity. Proper humidity is perhaps the most important condition for the well-being of your fire-bellies. Monitor humidity with a hygrometer and use a hydrostat to maintain the correct moisture level in the enclosure. These tools are available at exotic pet stores. Keeping the substrate damp and using misters can help keep proper humidity levels. Make sure any water used in misters or foggers has been conditioned with an aquarium conditioner or additive unless you're using bottled spring water. Use an ultraviolet light to provide 10 hours of light each day. Fire-bellied toads have a light cycle requiring around 10 hours of light and 14 hours of darkness in a 24-hour period. An ultraviolet light can help you maintain the correct light balance. Many ultraviolet lights can be set up on a timer so you can maintain the same light cycle for your fire-bellies every day without having to manually turn the light on and off. Feeding Your Fire-Bellied Toad Provide daily feedings of live crickets for the first year. Like most amphibians, fire-bellied toads only recognize live prey. Live crickets, which you can purchase at any pet store or feed store, make up the bulk of their diet. You can supplement with wax worms, earthworms, and similar food items. For young fire-bellies, feed them as much as they can eat in 10 or 15 minutes. This typically amounts to between 2 and 6 crickets. Give adult fire-bellied toads live crickets every 2 or 3 days. Once your fire-bellied toads have reached maturity, continue to feed them the same amount. However, decrease their feedings from daily to once every 2 or 3 days. For most adult fire-bellied toads, this amounts to between 2 and 6 live food items at each feeding.Tip: Some keepers use tweezers or forceps to deliver food to their fire-bellies. If you feed your toads by hand, wear gloves and wash your hands after. Add reptile vitamin and mineral supplements once every 2 to 4 feedings. Buy reptile vitamins and mineral supplements of high quality from a local exotic pet store, or online. To use it, cover the crickets or other live food with the supplement before feeding. In your toad's first year, give it supplements with every other feeding. If you're unsure about the quality of supplements, ask your exotic pet veterinarian what brands they recommend. Remove uneaten food or dead food items immediately. Both dead and living crickets and other food items can potentially foul the water and cause an imbalance in your toad's habitat. When it's clear that your fire-bellies are done eating, promptly remove the leftovers and discard them. Always wear gloves when reaching inside the toad's enclosure and wash your hands immediately after disposing of the leftovers. Maintaining the Enclosure Spot-clean the substrate daily to remove waste and fungus. Each day, look over the substrate and remove anything that looks dirty or scummy. If fungus is starting to grow, remove the fungus and the substrate immediately around it and replace. Gently swirl the soil around with a finger to make sure there aren't any contaminants hiding below the surface. Always wear gloves, as the oils on your hands can harm your fire-bellies. If more extensive cleaning is required, you may want to remove your fire-bellies from the enclosure first. Place them in a bucket or plastic container. Make sure there's a properly ventilated lid so they don't jump out.Tip: Remove waste, such as feces, immediately when you see it. This can quickly foul your toad's environment. Change the water when it becomes murky or soiled. How often you need to change the water depends on the size of your set-up and the number of fire-bellies you have. If the water in your enclosure consists of a small dish of water, change it every day. Larger water areas may only need to be changed weekly. If you have an aquarium filter for your water, you likely only need to change it once every other week. However, even if you have a filter, you should still monitor the water quality daily and remove waste and other contaminants. Sprinkle water on the substrate once or twice a week. Use water that has been conditioned and left out at room temperature for 24 hours, or get bottled spring water. Moisten the substrate so that it's damp. Check the moisture of the substrate before adding more water. Don't allow it to become soggy or water-logged. If you are using river stones instead of substrate, simply spray them down with water so that the stones are damp. You shouldn't have any pooling water on or between stones (unless the stones are at the edge of the water area). Use hot water to clean the enclosure when necessary. If the sides of the enclosure need cleaning, remove everything from the enclosure (including the toads), then wipe it down with hot water only. Do not use soap, disinfectants, or other cleaners as they could harm your toads. Clean any features in the enclosure with hot water as well. Throw out the old substrate and replace it with new substrate when you return everything to the clean enclosure.Tip: Make sure the temperature and humidity are appropriate before returning your fire-bellies to their enclosure.",
    "sentences": [
        " Setting Up an Enclosure Get a 10- to 15-gallon (38- to 57-Liter) aquarium.",
        "An aquarium or other container of similar size provides enough space for 2 or 3 toads.",
        "Make sure the enclosure has enough floor space for you to include land and water areas for these semi-aquatic creatures.",
        "While an aquarium may be better for you if you plan on watching your fire-bellied toads, a container with opaque sides may be less stressful for the animals.",
        "Fire-bellies like to jump, so make sure whatever enclosure you get has a lid to keep them from getting out.",
        "Plastic or wire mesh is fine.",
        "Treat water with an aquarium additive a day in advance.",
        "If you're using tap water, use a water conditioner or aquarium additive to remove chlorine and other chemicals from the water that may harm your toad.",
        "Leave the water sitting for 24 hours at room temperature before you introduce it to your toad's enclosure.",
        "If you don't want to go through the trouble of conditioning tap water, you can also use bottled spring water.",
        "However, don't use distilled water.",
        "It lacks minerals that fire-bellied toads need.Tip: If you have a larger water area, you can use an aquarium filter to improve the water quality.",
        "Use a large rock or piece of driftwood to deflect so the filter doesn't create a current in the water.",
        "Line your land area with 3 to 4 inches (7.6 to 10.2 cm) of topsoil.",
        "Fire-bellied toads are semi-aquatic, so they need both land and water.",
        "Plan for the land area to cover at least half of the enclosure's floor space.",
        "Use clean bagged topsoil with no additives – fertilizers and other additives can harm fire-bellied toads.",
        "Add cork bark to separate the substrate from the water.",
        "You can find substrate materials at any garden store.",
        "Some exotic pet stores may also have substrate materials packaged specifically for use in amphibian enclosures.",
        "Topsoil provides a more natural look for the enclosure, and won't harm your fire-bellies if they accidentally ingest some of it along with their food.",
        "Some fire-bellies also like to burrow in the soil to hide.",
        "Sheet moss and java moss also make good substrates.",
        "If you plan on growing live plants in the enclosure, you might need deeper substrate, depending on the needs of the plants.Variation: If you're using large river rocks to create your land areas, you may not need any substrate at all.",
        "Use bark, stones, and driftwood to create variation in your land area.",
        "Exotic pet stores have various items you can use to decorate the land area of your toad's enclosure.",
        "Choose items that look interesting to you and will provide different levels and hiding spaces in the land area.",
        "Your fire-bellied toad's enclosure can be as simple or as fancy as you like.",
        "At a minimum, your toad needs high and low areas, a slope into the water, and areas of cover where it can hide.",
        "Pour 1 to 2 inches (2.5 to 5.1 cm) of treated water into the water area.",
        "Place river stones throughout the water area to create shallow places.",
        "Despite being semi-aquatic creates, fire-bellies don't like to be submerged in water and aren't really fond of swimming.",
        "Use stones or moss around the edge of the water area to create a gentle slope into the water so that your toad can easily get in and out.",
        "Add pieces of driftwood or river rocks to the water, particularly in the deepest parts, so that your toad can rest if it wants.Variation: You can also put the water in a shallow dish and place the whole thing in the enclosure.",
        "Using a dish may make it easier to change the water when it becomes soiled.",
        "Add water plants to give your toad some shelter.",
        "You can grow floating vegetation, such as Amazon frogbit and giant salvinia, on the surface of the water to give your toad cover as it moves through the water.",
        "Aquatic plants such as ferns also add a natural touch to the enclosure and help keep the water clean.",
        "You can increase the depth of your water as needed to accommodate the water plants.",
        "Just make sure you have some shallower areas, as well as plenty of rocks or driftwood for your toad to land on in deeper water.",
        "Fire-bellies also like to dig, so make sure aquatic plants are at a depth that will prevent them from being uprooted.Tip: Add an incandescent light if you have live plants growing in the enclosure to ensure the plants have plenty of light.",
        "Create a hide box so your toad feels secure.",
        "Any object such as a broken flower pot, large pieces of driftwood, or another container can be used as a hide box where your toad can go when it feels threatened.",
        "In addition to the larger hide box, include plenty of covered areas throughout the enclosure where your toad can seek shelter.",
        "Overhanging stones, plants, and driftwood all create hiding places as well as adding interesting features to the enclosure.",
        "If you have multiple fire-bellies, make sure you have enough hiding places that each of them can hide securely at the same time.",
        "Monitor the temperature in the enclosure and adjust as necessary.",
        "Fire-bellied toads are comfortable at room temperature, so you might not need to make much adjustment.",
        "Your fire-bellies will be just fine with a temperature range between 65 and 78 °F (18 and 26 °C).",
        "Place a thermometer in the enclosure to monitor the temperature.",
        "Fire-bellied toads are in danger if the temperature rises to 82 °F (28 °C).",
        "They'll be okay in temperatures as low as 50 °F (10 °C), but it's still a good idea to place the enclosure away from any windows or drafty areas.",
        "Maintain 50 to 70 percent humidity.",
        "Proper humidity is perhaps the most important condition for the well-being of your fire-bellies.",
        "Monitor humidity with a hygrometer and use a hydrostat to maintain the correct moisture level in the enclosure.",
        "These tools are available at exotic pet stores.",
        "Keeping the substrate damp and using misters can help keep proper humidity levels.",
        "Make sure any water used in misters or foggers has been conditioned with an aquarium conditioner or additive unless you're using bottled spring water.",
        "Use an ultraviolet light to provide 10 hours of light each day.",
        "Fire-bellied toads have a light cycle requiring around 10 hours of light and 14 hours of darkness in a 24-hour period.",
        "An ultraviolet light can help you maintain the correct light balance.",
        "Many ultraviolet lights can be set up on a timer so you can maintain the same light cycle for your fire-bellies every day without having to manually turn the light on and off.",
        "Feeding Your Fire-Bellied Toad Provide daily feedings of live crickets for the first year.",
        "Like most amphibians, fire-bellied toads only recognize live prey.",
        "Live crickets, which you can purchase at any pet store or feed store, make up the bulk of their diet.",
        "You can supplement with wax worms, earthworms, and similar food items.",
        "For young fire-bellies, feed them as much as they can eat in 10 or 15 minutes.",
        "This typically amounts to between 2 and 6 crickets.",
        "Give adult fire-bellied toads live crickets every 2 or 3 days.",
        "Once your fire-bellied toads have reached maturity, continue to feed them the same amount.",
        "However, decrease their feedings from daily to once every 2 or 3 days.",
        "For most adult fire-bellied toads, this amounts to between 2 and 6 live food items at each feeding.Tip: Some keepers use tweezers or forceps to deliver food to their fire-bellies.",
        "If you feed your toads by hand, wear gloves and wash your hands after.",
        "Add reptile vitamin and mineral supplements once every 2 to 4 feedings.",
        "Buy reptile vitamins and mineral supplements of high quality from a local exotic pet store, or online.",
        "To use it, cover the crickets or other live food with the supplement before feeding.",
        "In your toad's first year, give it supplements with every other feeding.",
        "If you're unsure about the quality of supplements, ask your exotic pet veterinarian what brands they recommend.",
        "Remove uneaten food or dead food items immediately.",
        "Both dead and living crickets and other food items can potentially foul the water and cause an imbalance in your toad's habitat.",
        "When it's clear that your fire-bellies are done eating, promptly remove the leftovers and discard them.",
        "Always wear gloves when reaching inside the toad's enclosure and wash your hands immediately after disposing of the leftovers.",
        "Maintaining the Enclosure Spot-clean the substrate daily to remove waste and fungus.",
        "Each day, look over the substrate and remove anything that looks dirty or scummy.",
        "If fungus is starting to grow, remove the fungus and the substrate immediately around it and replace.",
        "Gently swirl the soil around with a finger to make sure there aren't any contaminants hiding below the surface.",
        "Always wear gloves, as the oils on your hands can harm your fire-bellies.",
        "If more extensive cleaning is required, you may want to remove your fire-bellies from the enclosure first.",
        "Place them in a bucket or plastic container.",
        "Make sure there's a properly ventilated lid so they don't jump out.Tip: Remove waste, such as feces, immediately when you see it.",
        "This can quickly foul your toad's environment.",
        "Change the water when it becomes murky or soiled.",
        "How often you need to change the water depends on the size of your set-up and the number of fire-bellies you have.",
        "If the water in your enclosure consists of a small dish of water, change it every day.",
        "Larger water areas may only need to be changed weekly.",
        "If you have an aquarium filter for your water, you likely only need to change it once every other week.",
        "However, even if you have a filter, you should still monitor the water quality daily and remove waste and other contaminants.",
        "Sprinkle water on the substrate once or twice a week.",
        "Use water that has been conditioned and left out at room temperature for 24 hours, or get bottled spring water.",
        "Moisten the substrate so that it's damp.",
        "Check the moisture of the substrate before adding more water.",
        "Don't allow it to become soggy or water-logged.",
        "If you are using river stones instead of substrate, simply spray them down with water so that the stones are damp.",
        "You shouldn't have any pooling water on or between stones (unless the stones are at the edge of the water area).",
        "Use hot water to clean the enclosure when necessary.",
        "If the sides of the enclosure need cleaning, remove everything from the enclosure (including the toads), then wipe it down with hot water only.",
        "Do not use soap, disinfectants, or other cleaners as they could harm your toads.",
        "Clean any features in the enclosure with hot water as well.",
        "Throw out the old substrate and replace it with new substrate when you return everything to the clean enclosure.Tip: Make sure the temperature and humidity are appropriate before returning your fire-bellies to their enclosure."
    ]
}