{
    "title": "How to Make a Pumpkin Facial Mask",
    "url": "https://www.wikihow.com/Make-a-Pumpkin-Facial-Mask",
    "category_hierarchy": [
        "Personal Care and Style",
        "Skin Care",
        "Face Care",
        "Facial Preparations",
        "Face Masks",
        "Vegetable Face Masks"
    ],
    "methods": [
        {
            "name": "Making a Basic Pumpkin Mask",
            "steps": [
                {
                    "headline": "Make a basic pumpkin facial mask if you have normal, dry, or oily skin.",
                    "description": "This mask is great for all skin types because it is gently exfoliating. It also helps remove excess dirt and buff away dead skin cells. After this mask, you may notice that your skin appears softer and brighter. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDiana Yerkes\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLead Esthetician, Rescue Spa NYC\t\t\t\t\t\t\t\tDiana Yerkes is the Lead Esthetician at Rescue Spa in New York City, New York. Diana is a member of the Associated Skin Care Professionals (ASCP) and holds certifications from the Wellness for Cancer and Look Good Feel Better programs. She received her esthetics education from the Aveda Institute and the International Dermal Institute. Diana Yerkes\t\t\tLead Esthetician, Rescue Spa NYC\t\t\t\tUse a pumpkin mask to soothe your post-summer skin. Pumpkin is a really great exfoliant, and it also contains antioxidants like vitamins A, C, and E. Pumpkin masks are especially effective at treating sun damage, so they're perfect for fall, when you've just had a full summer of sun exposure."
                },
                {
                    "headline": "Put 1 tablespoon of organic, canned pumpkin into a small cup or bowl.",
                    "description": "Pumpkin has many benefits for the skin. It is rich in vitamins, minerals, and enzymes. All of these can help gently exfoliate your skin, reduce acne, control excess oil production, reduce the appearance of sun and age spots, and promote brighter, healthier-looking skin."
                },
                {
                    "headline": "Add 1 teaspoon of honey.",
                    "description": "Honey is one of the best things you could put onto your face. It is a natural humectant, so it helps hydrate and moisturize dry skin. It is also naturally antibacterial and antimicrobial, so it helps manage pimples and acne."
                },
                {
                    "headline": "Consider adding some extras.",
                    "description": "Although this mask is suitable for most skin types, there are a few extra ingredients you could add to make it even better for your skin. If you have acne, consider adding up to 1 teaspoon of raw apple cider vinegar. Apple cider vinegar helps restore your skin's natural pH levels as well as kill off acne-causing bacteria. If you have dry skin, consider adding 1 teaspoon of vitamin E oil. It is very hydrating and moisturizing. It can also help heal damaged skin."
                },
                {
                    "headline": "Mix everything together with a fork.",
                    "description": "Scrape the bottom of the cup or bowl often to ensure that everything mixes in evenly."
                },
                {
                    "headline": "Apply the mask to a clean face.",
                    "description": "Wash your face and hands with warm water and a gentle facial soap. Pat your face dry, then apply the mask using your fingertips. Take care to avoid the sensitive skin around the eyes. This mask can get messy, so you might want to clip or tie your hair back."
                },
                {
                    "headline": "Wait 15 minutes.",
                    "description": "Try to avoid moving around too much during this point, or the mask may start to run. For a more spa-like experience, consider laying down or sitting in a comfortable chair, closing your eyes, and listening to some relaxing music."
                },
                {
                    "headline": "Wash the mask off with lukewarm water.",
                    "description": "Once you have the mask off, splash your face with cool water to seal your pores, then pat your face dry with a clean towel. After this, you can follow up with some toner and your usual moisturizer. You can use this mask up to 2 to 3 times a week."
                }
            ]
        },
        {
            "name": "Making a Pumpkin and Oatmeal Mask",
            "steps": [
                {
                    "headline": "Make a pumpkin and oatmeal mask if you have acne or want something a little more exfoliating.",
                    "description": "Oatmeal is naturally exfoliating, making it ideal for dry skin. It is also great for acne because it helps absorb excess oil, sooth inflammation, and reduce redness."
                },
                {
                    "headline": "Put 2 tablespoons of canned pumpkin purée into a small cup or bowl.",
                    "description": "Pumpkin contains many beneficial vitamins and minerals, including zinc, which helps control oil production and hormone levels. It can also help prevent pimples, acne, and blackheads."
                },
                {
                    "headline": "Add 1 tablespoon of oatmeal.",
                    "description": "Oatmeal is great for your skin in many ways. Not only is it gently exfoliating, but it is also naturally soothing, making it perfect for sensitive skin. It may also help fight acne. If you'd like, you can grind the oatmeal in a blender, food processor, or coffee grinder first. This will give you a finer texture, which will make the mask gentler. This is great if you are looking for something that is more like a mask and less like a scrub. If you want to make the mask more soothing, cook the oatmeal first; this will make it more effective at reducing inflammation. Combine 1 tablespoon oatmeal with 2 tablespoons of water, then cook it in the microwave for about 1 minute. Let it cool, then use it in your mask."
                },
                {
                    "headline": "Pour in 1 teaspoon of jojoba oil.",
                    "description": "If you can't get any jojoba oil, you can use any other food grade, skin safe oil, such as sweet almond oil, olive oil, or even coconut oil. You can also use honey instead, which is naturally antibacterial and antimicrobial."
                },
                {
                    "headline": "Consider adding ½ teaspoon of pumpkin pie spice.",
                    "description": "While not completely necessary, this will give your pumpkin mask a wonderful aroma. If you have sensitive skin, however, you might want to skip this."
                },
                {
                    "headline": "Use a fork to mix everything together.",
                    "description": "Scrape the bottom of the cup or bowl from time to time so that all of the ingredients get evenly mixed. You want the oatmeal to be distributed evenly throughout the pumpkin."
                },
                {
                    "headline": "Apply the mask to your face.",
                    "description": "Wash your hands using soap and warm water, then clean your face using your favorite facial cleanser. Gently pat your face dry, then apply the mask using your fingertips. Take care to avoid the area around your eyes. This mask may drip, so it might be a good idea to clip or tie your hair back, and drape a towel over your shoulders. To get some exfoliating benefits out of this mask, apply it using circular motions, gently massaging it into your skin."
                },
                {
                    "headline": "Wait 10 to 15 minutes.",
                    "description": "Sit or lay down some place comfortable and try to relax. The more you move around, the more likely the mask will drip. You can listen to your favorite music, read a book, or daydream during this time."
                },
                {
                    "headline": "Wash the mask off with lukewarm water.",
                    "description": "Use circular motions while washing the mask off; this will turn it into a scrub, and help the oatmeal exfoliate your skin. Once you have the mask all off, splash your face with cool water, and pat your face dry with a soft, clean towel. If you need to, follow up with some toner and moisturizer."
                }
            ]
        },
        {
            "name": "Making a Pumpkin and Yogurt Mask",
            "steps": [
                {
                    "headline": "Make a pumpkin and yogurt mask if you'd like soft, smooth skin.",
                    "description": "One of the reasons why skin may appear dry and dull is because it needs to be exfoliated. The ingredients in this mask can help your skin appear smoother and softer by gently exfoliating away the dead skin cells, which contribute to a dry, dull complexion."
                },
                {
                    "headline": "Start with 4 tablespoons of organic pumpkin purée.",
                    "description": "Pumpkin contains enzymes that gently exfoliate away dead skin. This will reveal the soft, smooth skin underneath. It is also rich in vitamin C and K, which can help fade sun spots and age spots, and lead to brighter, healthier-looking skin."
                },
                {
                    "headline": "Add 2 to 4 tablespoons (59.1 ml) of plain yogurt.",
                    "description": "If you can, try to use full-fat Greek yogurt, as it will be the most hydrating and moisturizing for your skin. Yogurt is great for the skin because it is hydrating and moisturizing. The lactic acid in yogurt also makes it naturally exfoliating, which can leave your skin feeling soft and smooth. Some people also find that yogurt helps brighten their skin as well."
                },
                {
                    "headline": "Add 2 teaspoons of honey.",
                    "description": "Honey is incredible for the skin. It is hydrating and moisturizing, making it perfect for dry or sensitive skin. It is also antibacterial and antimicrobial, making it great for those suffering from acne."
                },
                {
                    "headline": "Consider adding ½ teaspoon of ground cinnamon.",
                    "description": "While not completely necessary, this can lend your mask a wonderful aroma. It does have antimicrobial properties, however, making it ideal for those who are struggling with acne."
                },
                {
                    "headline": "Mix everything together with a fork.",
                    "description": "Scrape the bottom and sides of the cup or bowl often to ensure that everything gets mixed in. You want the color and texture to be even and consistent, with no streaks or swirls of yogurt."
                },
                {
                    "headline": "Spread the mask over a clean face.",
                    "description": "Wash your hands first, then your face. Pat your face dry, then apply the mask using your fingers. Take care to avoid the sensitive skin around your eyes. It might also be a good idea to clip or tie your hair back at this point so that it doesn't get dirty."
                },
                {
                    "headline": "Wait 15 to 20 minutes.",
                    "description": "Try not to move around too much during this time, or the mask may start to drip. If you want to, sit or lay down someplace comfortable, and listen to your favorite music."
                },
                {
                    "headline": "Wash the mask off using lukewarm water and circular motions.",
                    "description": "Once you have the mask all off, splash your face with cool water to seal the pores. Pat your face dry with a soft, clean towel, then follow up with toner and moisturizer, if desired. Store the rest of the mask in an airtight container in the fridge, and use it within a few weeks. You can use this mask once to twice a week."
                }
            ]
        },
        {
            "name": "Making a Pumpkin and Egg Mask",
            "steps": [
                {
                    "headline": "Make a pumpkin and egg mask if you have oily skin.",
                    "description": "When treating oily skin, it is important not to let it become too dry. If you let oily skin become dry, it will start to produce even more oils to compensate. This mask contains ingredients that may help control excess oil production without drying out your skin. Some of the ingredients are also helpful when it comes to treating acne."
                },
                {
                    "headline": "Beat 1 egg in a small cup or bowl with a fork or mini whisk.",
                    "description": "Crack an egg open into a small cup or bowl, then beat it briskly with a fork or mini whisk until it is pale and frothy. Egg yolks help hydrate skin, which is important even for oily skin types. The yolks also contain zinc, which can help treat acne. Egg whites help tighten the skin and close up pores, which can help reduce acne."
                },
                {
                    "headline": "Add 4 tablespoons of organic pumpkin purée.",
                    "description": "Pumpkin is rich in vitamins and minerals. It also contains zinc, which can help control hormone levels and excess oil production."
                },
                {
                    "headline": "Add 1 tablespoon of raw honey.",
                    "description": "Honey does wonders for the skin. It is a natural humectant, so it helps draw moisture into the skin. It is also naturally antibacterial and antimicrobial, so it helps manage acne."
                },
                {
                    "headline": "Add some milk or raw apple cider vinegar, if desired.",
                    "description": "At this point, your mask has all of the necessary ingredients, but you can make it even better by adding some milk or apple cider vinegar. Both do different things for your skin, so choose one that suits your skin's needs the best. If you have dull skin, add 1 tablespoon of milk. The lactic acid in milk is gently exfoliating, so it can leave your skin feeling softer, smoother, and brighter. If you have oily skin or acne, add 1 tablespoon of raw apple cider vinegar."
                },
                {
                    "headline": "Mix it all together with a fork.",
                    "description": "Keep stirring the mixture until everything is evenly combined. You do not want to see any streaks or swirls of egg yolk."
                },
                {
                    "headline": "Apply the mask all over your face, taking care to avoid the eyes, nose, and mouth.",
                    "description": "Because this mask contains raw egg, it is very important to avoid the mouth and nose in addition to the eyes. You can apply the mask using your fingers, but make sure to wash them well first with soap and warm water. Keep your hair clipped or tied back so that the mask doesn't get all over it."
                },
                {
                    "headline": "Wait 15 to 20 minutes, or until the mask dries.",
                    "description": "Avoid moving around too much during this time, or the mask may start to drip. If you can, sit or lay down someplace comfortable. You can pass the time by reading a book, listening to music, daydreaming, or watching your favorite show."
                },
                {
                    "headline": "Wash the mask off.",
                    "description": "You may need to use a washcloth and some facial cleaner in order to get the mask all off. Once your face is clean, splash your face with cool water to seal your pores, then gently pat it dry with a soft, clean towel. Follow up with your usual toner and moisturizer, if desired. You can use this mask once a week."
                }
            ]
        }
    ],
    "tyn": [
        "Making a Basic Pumpkin Mask",
        "1 tablespoon organic pumpkin purée",
        "1 teaspoon honey",
        "1 teaspoon raw apple cider vinegar (optional)",
        "1 teaspoon vitamin E oil (optional)",
        "Small cup or bowl",
        "Fork",
        "Soft brush or foundation brush (optional)",
        "Clean, soft towel",
        "Making a Pumpkin and Oatmeal Mask",
        "2 tablespoons organic pumpkin purée",
        "1 tablespoon plain oatmeal",
        "1 teaspoon jojoba oil",
        "½ teaspoon pumpkin pie spice (optional)",
        "Making a Pumpkin and Yogurt Mask",
        "4 tablespoons organic pumpkin purée",
        "2 to 4 tablespoons yogurt",
        "2 teaspoons honey",
        "½ teaspoon ground cinnamon (optional)",
        "Making a Pumpkin and Egg Mask",
        "1 egg",
        "1 tablespoon honey",
        "1 tablespoon milk (optional)",
        "1 tablespoon raw apple cider vinegar (optional)"
    ],
    "text": " Making a Basic Pumpkin Mask Make a basic pumpkin facial mask if you have normal, dry, or oily skin. This mask is great for all skin types because it is gently exfoliating. It also helps remove excess dirt and buff away dead skin cells. After this mask, you may notice that your skin appears softer and brighter. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDiana Yerkes\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLead Esthetician, Rescue Spa NYC\t\t\t\t\t\t\t\tDiana Yerkes is the Lead Esthetician at Rescue Spa in New York City, New York. Diana is a member of the Associated Skin Care Professionals (ASCP) and holds certifications from the Wellness for Cancer and Look Good Feel Better programs. She received her esthetics education from the Aveda Institute and the International Dermal Institute. Diana Yerkes\t\t\tLead Esthetician, Rescue Spa NYC\t\t\t\tUse a pumpkin mask to soothe your post-summer skin. Pumpkin is a really great exfoliant, and it also contains antioxidants like vitamins A, C, and E. Pumpkin masks are especially effective at treating sun damage, so they're perfect for fall, when you've just had a full summer of sun exposure. Put 1 tablespoon of organic, canned pumpkin into a small cup or bowl. Pumpkin has many benefits for the skin. It is rich in vitamins, minerals, and enzymes. All of these can help gently exfoliate your skin, reduce acne, control excess oil production, reduce the appearance of sun and age spots, and promote brighter, healthier-looking skin. Add 1 teaspoon of honey. Honey is one of the best things you could put onto your face. It is a natural humectant, so it helps hydrate and moisturize dry skin. It is also naturally antibacterial and antimicrobial, so it helps manage pimples and acne. Consider adding some extras. Although this mask is suitable for most skin types, there are a few extra ingredients you could add to make it even better for your skin. If you have acne, consider adding up to 1 teaspoon of raw apple cider vinegar. Apple cider vinegar helps restore your skin's natural pH levels as well as kill off acne-causing bacteria. If you have dry skin, consider adding 1 teaspoon of vitamin E oil. It is very hydrating and moisturizing. It can also help heal damaged skin. Mix everything together with a fork. Scrape the bottom of the cup or bowl often to ensure that everything mixes in evenly. Apply the mask to a clean face. Wash your face and hands with warm water and a gentle facial soap. Pat your face dry, then apply the mask using your fingertips. Take care to avoid the sensitive skin around the eyes. This mask can get messy, so you might want to clip or tie your hair back. Wait 15 minutes. Try to avoid moving around too much during this point, or the mask may start to run. For a more spa-like experience, consider laying down or sitting in a comfortable chair, closing your eyes, and listening to some relaxing music. Wash the mask off with lukewarm water. Once you have the mask off, splash your face with cool water to seal your pores, then pat your face dry with a clean towel. After this, you can follow up with some toner and your usual moisturizer. You can use this mask up to 2 to 3 times a week. Making a Pumpkin and Oatmeal Mask Make a pumpkin and oatmeal mask if you have acne or want something a little more exfoliating. Oatmeal is naturally exfoliating, making it ideal for dry skin. It is also great for acne because it helps absorb excess oil, sooth inflammation, and reduce redness. Put 2 tablespoons of canned pumpkin purée into a small cup or bowl. Pumpkin contains many beneficial vitamins and minerals, including zinc, which helps control oil production and hormone levels. It can also help prevent pimples, acne, and blackheads. Add 1 tablespoon of oatmeal. Oatmeal is great for your skin in many ways. Not only is it gently exfoliating, but it is also naturally soothing, making it perfect for sensitive skin. It may also help fight acne. If you'd like, you can grind the oatmeal in a blender, food processor, or coffee grinder first. This will give you a finer texture, which will make the mask gentler. This is great if you are looking for something that is more like a mask and less like a scrub. If you want to make the mask more soothing, cook the oatmeal first; this will make it more effective at reducing inflammation. Combine 1 tablespoon oatmeal with 2 tablespoons of water, then cook it in the microwave for about 1 minute. Let it cool, then use it in your mask. Pour in 1 teaspoon of jojoba oil. If you can't get any jojoba oil, you can use any other food grade, skin safe oil, such as sweet almond oil, olive oil, or even coconut oil. You can also use honey instead, which is naturally antibacterial and antimicrobial. Consider adding ½ teaspoon of pumpkin pie spice. While not completely necessary, this will give your pumpkin mask a wonderful aroma. If you have sensitive skin, however, you might want to skip this. Use a fork to mix everything together. Scrape the bottom of the cup or bowl from time to time so that all of the ingredients get evenly mixed. You want the oatmeal to be distributed evenly throughout the pumpkin. Apply the mask to your face. Wash your hands using soap and warm water, then clean your face using your favorite facial cleanser. Gently pat your face dry, then apply the mask using your fingertips. Take care to avoid the area around your eyes. This mask may drip, so it might be a good idea to clip or tie your hair back, and drape a towel over your shoulders. To get some exfoliating benefits out of this mask, apply it using circular motions, gently massaging it into your skin. Wait 10 to 15 minutes. Sit or lay down some place comfortable and try to relax. The more you move around, the more likely the mask will drip. You can listen to your favorite music, read a book, or daydream during this time. Wash the mask off with lukewarm water. Use circular motions while washing the mask off; this will turn it into a scrub, and help the oatmeal exfoliate your skin. Once you have the mask all off, splash your face with cool water, and pat your face dry with a soft, clean towel. If you need to, follow up with some toner and moisturizer. Making a Pumpkin and Yogurt Mask Make a pumpkin and yogurt mask if you'd like soft, smooth skin. One of the reasons why skin may appear dry and dull is because it needs to be exfoliated. The ingredients in this mask can help your skin appear smoother and softer by gently exfoliating away the dead skin cells, which contribute to a dry, dull complexion. Start with 4 tablespoons of organic pumpkin purée. Pumpkin contains enzymes that gently exfoliate away dead skin. This will reveal the soft, smooth skin underneath. It is also rich in vitamin C and K, which can help fade sun spots and age spots, and lead to brighter, healthier-looking skin. Add 2 to 4 tablespoons (59.1 ml) of plain yogurt. If you can, try to use full-fat Greek yogurt, as it will be the most hydrating and moisturizing for your skin. Yogurt is great for the skin because it is hydrating and moisturizing. The lactic acid in yogurt also makes it naturally exfoliating, which can leave your skin feeling soft and smooth. Some people also find that yogurt helps brighten their skin as well. Add 2 teaspoons of honey. Honey is incredible for the skin. It is hydrating and moisturizing, making it perfect for dry or sensitive skin. It is also antibacterial and antimicrobial, making it great for those suffering from acne. Consider adding ½ teaspoon of ground cinnamon. While not completely necessary, this can lend your mask a wonderful aroma. It does have antimicrobial properties, however, making it ideal for those who are struggling with acne. Mix everything together with a fork. Scrape the bottom and sides of the cup or bowl often to ensure that everything gets mixed in. You want the color and texture to be even and consistent, with no streaks or swirls of yogurt. Spread the mask over a clean face. Wash your hands first, then your face. Pat your face dry, then apply the mask using your fingers. Take care to avoid the sensitive skin around your eyes. It might also be a good idea to clip or tie your hair back at this point so that it doesn't get dirty. Wait 15 to 20 minutes. Try not to move around too much during this time, or the mask may start to drip. If you want to, sit or lay down someplace comfortable, and listen to your favorite music. Wash the mask off using lukewarm water and circular motions. Once you have the mask all off, splash your face with cool water to seal the pores. Pat your face dry with a soft, clean towel, then follow up with toner and moisturizer, if desired. Store the rest of the mask in an airtight container in the fridge, and use it within a few weeks. You can use this mask once to twice a week. Making a Pumpkin and Egg Mask Make a pumpkin and egg mask if you have oily skin. When treating oily skin, it is important not to let it become too dry. If you let oily skin become dry, it will start to produce even more oils to compensate. This mask contains ingredients that may help control excess oil production without drying out your skin. Some of the ingredients are also helpful when it comes to treating acne. Beat 1 egg in a small cup or bowl with a fork or mini whisk. Crack an egg open into a small cup or bowl, then beat it briskly with a fork or mini whisk until it is pale and frothy. Egg yolks help hydrate skin, which is important even for oily skin types. The yolks also contain zinc, which can help treat acne. Egg whites help tighten the skin and close up pores, which can help reduce acne. Add 4 tablespoons of organic pumpkin purée. Pumpkin is rich in vitamins and minerals. It also contains zinc, which can help control hormone levels and excess oil production. Add 1 tablespoon of raw honey. Honey does wonders for the skin. It is a natural humectant, so it helps draw moisture into the skin. It is also naturally antibacterial and antimicrobial, so it helps manage acne. Add some milk or raw apple cider vinegar, if desired. At this point, your mask has all of the necessary ingredients, but you can make it even better by adding some milk or apple cider vinegar. Both do different things for your skin, so choose one that suits your skin's needs the best. If you have dull skin, add 1 tablespoon of milk. The lactic acid in milk is gently exfoliating, so it can leave your skin feeling softer, smoother, and brighter. If you have oily skin or acne, add 1 tablespoon of raw apple cider vinegar. Mix it all together with a fork. Keep stirring the mixture until everything is evenly combined. You do not want to see any streaks or swirls of egg yolk. Apply the mask all over your face, taking care to avoid the eyes, nose, and mouth. Because this mask contains raw egg, it is very important to avoid the mouth and nose in addition to the eyes. You can apply the mask using your fingers, but make sure to wash them well first with soap and warm water. Keep your hair clipped or tied back so that the mask doesn't get all over it. Wait 15 to 20 minutes, or until the mask dries. Avoid moving around too much during this time, or the mask may start to drip. If you can, sit or lay down someplace comfortable. You can pass the time by reading a book, listening to music, daydreaming, or watching your favorite show. Wash the mask off. You may need to use a washcloth and some facial cleaner in order to get the mask all off. Once your face is clean, splash your face with cool water to seal your pores, then gently pat it dry with a soft, clean towel. Follow up with your usual toner and moisturizer, if desired. You can use this mask once a week.",
    "sentences": [
        " Making a Basic Pumpkin Mask Make a basic pumpkin facial mask if you have normal, dry, or oily skin.",
        "This mask is great for all skin types because it is gently exfoliating.",
        "It also helps remove excess dirt and buff away dead skin cells.",
        "After this mask, you may notice that your skin appears softer and brighter.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDiana Yerkes\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLead Esthetician, Rescue Spa NYC\t\t\t\t\t\t\t\tDiana Yerkes is the Lead Esthetician at Rescue Spa in New York City, New York.",
        "Diana is a member of the Associated Skin Care Professionals (ASCP) and holds certifications from the Wellness for Cancer and Look Good Feel Better programs.",
        "She received her esthetics education from the Aveda Institute and the International Dermal Institute.",
        "Diana Yerkes\t\t\tLead Esthetician, Rescue Spa NYC\t\t\t\tUse a pumpkin mask to soothe your post-summer skin.",
        "Pumpkin is a really great exfoliant, and it also contains antioxidants like vitamins A, C, and E. Pumpkin masks are especially effective at treating sun damage, so they're perfect for fall, when you've just had a full summer of sun exposure.",
        "Put 1 tablespoon of organic, canned pumpkin into a small cup or bowl.",
        "Pumpkin has many benefits for the skin.",
        "It is rich in vitamins, minerals, and enzymes.",
        "All of these can help gently exfoliate your skin, reduce acne, control excess oil production, reduce the appearance of sun and age spots, and promote brighter, healthier-looking skin.",
        "Add 1 teaspoon of honey.",
        "Honey is one of the best things you could put onto your face.",
        "It is a natural humectant, so it helps hydrate and moisturize dry skin.",
        "It is also naturally antibacterial and antimicrobial, so it helps manage pimples and acne.",
        "Consider adding some extras.",
        "Although this mask is suitable for most skin types, there are a few extra ingredients you could add to make it even better for your skin.",
        "If you have acne, consider adding up to 1 teaspoon of raw apple cider vinegar.",
        "Apple cider vinegar helps restore your skin's natural pH levels as well as kill off acne-causing bacteria.",
        "If you have dry skin, consider adding 1 teaspoon of vitamin E oil.",
        "It is very hydrating and moisturizing.",
        "It can also help heal damaged skin.",
        "Mix everything together with a fork.",
        "Scrape the bottom of the cup or bowl often to ensure that everything mixes in evenly.",
        "Apply the mask to a clean face.",
        "Wash your face and hands with warm water and a gentle facial soap.",
        "Pat your face dry, then apply the mask using your fingertips.",
        "Take care to avoid the sensitive skin around the eyes.",
        "This mask can get messy, so you might want to clip or tie your hair back.",
        "Wait 15 minutes.",
        "Try to avoid moving around too much during this point, or the mask may start to run.",
        "For a more spa-like experience, consider laying down or sitting in a comfortable chair, closing your eyes, and listening to some relaxing music.",
        "Wash the mask off with lukewarm water.",
        "Once you have the mask off, splash your face with cool water to seal your pores, then pat your face dry with a clean towel.",
        "After this, you can follow up with some toner and your usual moisturizer.",
        "You can use this mask up to 2 to 3 times a week.",
        "Making a Pumpkin and Oatmeal Mask Make a pumpkin and oatmeal mask if you have acne or want something a little more exfoliating.",
        "Oatmeal is naturally exfoliating, making it ideal for dry skin.",
        "It is also great for acne because it helps absorb excess oil, sooth inflammation, and reduce redness.",
        "Put 2 tablespoons of canned pumpkin purée into a small cup or bowl.",
        "Pumpkin contains many beneficial vitamins and minerals, including zinc, which helps control oil production and hormone levels.",
        "It can also help prevent pimples, acne, and blackheads.",
        "Add 1 tablespoon of oatmeal.",
        "Oatmeal is great for your skin in many ways.",
        "Not only is it gently exfoliating, but it is also naturally soothing, making it perfect for sensitive skin.",
        "It may also help fight acne.",
        "If you'd like, you can grind the oatmeal in a blender, food processor, or coffee grinder first.",
        "This will give you a finer texture, which will make the mask gentler.",
        "This is great if you are looking for something that is more like a mask and less like a scrub.",
        "If you want to make the mask more soothing, cook the oatmeal first; this will make it more effective at reducing inflammation.",
        "Combine 1 tablespoon oatmeal with 2 tablespoons of water, then cook it in the microwave for about 1 minute.",
        "Let it cool, then use it in your mask.",
        "Pour in 1 teaspoon of jojoba oil.",
        "If you can't get any jojoba oil, you can use any other food grade, skin safe oil, such as sweet almond oil, olive oil, or even coconut oil.",
        "You can also use honey instead, which is naturally antibacterial and antimicrobial.",
        "Consider adding ½ teaspoon of pumpkin pie spice.",
        "While not completely necessary, this will give your pumpkin mask a wonderful aroma.",
        "If you have sensitive skin, however, you might want to skip this.",
        "Use a fork to mix everything together.",
        "Scrape the bottom of the cup or bowl from time to time so that all of the ingredients get evenly mixed.",
        "You want the oatmeal to be distributed evenly throughout the pumpkin.",
        "Apply the mask to your face.",
        "Wash your hands using soap and warm water, then clean your face using your favorite facial cleanser.",
        "Gently pat your face dry, then apply the mask using your fingertips.",
        "Take care to avoid the area around your eyes.",
        "This mask may drip, so it might be a good idea to clip or tie your hair back, and drape a towel over your shoulders.",
        "To get some exfoliating benefits out of this mask, apply it using circular motions, gently massaging it into your skin.",
        "Wait 10 to 15 minutes.",
        "Sit or lay down some place comfortable and try to relax.",
        "The more you move around, the more likely the mask will drip.",
        "You can listen to your favorite music, read a book, or daydream during this time.",
        "Wash the mask off with lukewarm water.",
        "Use circular motions while washing the mask off; this will turn it into a scrub, and help the oatmeal exfoliate your skin.",
        "Once you have the mask all off, splash your face with cool water, and pat your face dry with a soft, clean towel.",
        "If you need to, follow up with some toner and moisturizer.",
        "Making a Pumpkin and Yogurt Mask Make a pumpkin and yogurt mask if you'd like soft, smooth skin.",
        "One of the reasons why skin may appear dry and dull is because it needs to be exfoliated.",
        "The ingredients in this mask can help your skin appear smoother and softer by gently exfoliating away the dead skin cells, which contribute to a dry, dull complexion.",
        "Start with 4 tablespoons of organic pumpkin purée.",
        "Pumpkin contains enzymes that gently exfoliate away dead skin.",
        "This will reveal the soft, smooth skin underneath.",
        "It is also rich in vitamin C and K, which can help fade sun spots and age spots, and lead to brighter, healthier-looking skin.",
        "Add 2 to 4 tablespoons (59.1 ml) of plain yogurt.",
        "If you can, try to use full-fat Greek yogurt, as it will be the most hydrating and moisturizing for your skin.",
        "Yogurt is great for the skin because it is hydrating and moisturizing.",
        "The lactic acid in yogurt also makes it naturally exfoliating, which can leave your skin feeling soft and smooth.",
        "Some people also find that yogurt helps brighten their skin as well.",
        "Add 2 teaspoons of honey.",
        "Honey is incredible for the skin.",
        "It is hydrating and moisturizing, making it perfect for dry or sensitive skin.",
        "It is also antibacterial and antimicrobial, making it great for those suffering from acne.",
        "Consider adding ½ teaspoon of ground cinnamon.",
        "While not completely necessary, this can lend your mask a wonderful aroma.",
        "It does have antimicrobial properties, however, making it ideal for those who are struggling with acne.",
        "Mix everything together with a fork.",
        "Scrape the bottom and sides of the cup or bowl often to ensure that everything gets mixed in.",
        "You want the color and texture to be even and consistent, with no streaks or swirls of yogurt.",
        "Spread the mask over a clean face.",
        "Wash your hands first, then your face.",
        "Pat your face dry, then apply the mask using your fingers.",
        "Take care to avoid the sensitive skin around your eyes.",
        "It might also be a good idea to clip or tie your hair back at this point so that it doesn't get dirty.",
        "Wait 15 to 20 minutes.",
        "Try not to move around too much during this time, or the mask may start to drip.",
        "If you want to, sit or lay down someplace comfortable, and listen to your favorite music.",
        "Wash the mask off using lukewarm water and circular motions.",
        "Once you have the mask all off, splash your face with cool water to seal the pores.",
        "Pat your face dry with a soft, clean towel, then follow up with toner and moisturizer, if desired.",
        "Store the rest of the mask in an airtight container in the fridge, and use it within a few weeks.",
        "You can use this mask once to twice a week.",
        "Making a Pumpkin and Egg Mask Make a pumpkin and egg mask if you have oily skin.",
        "When treating oily skin, it is important not to let it become too dry.",
        "If you let oily skin become dry, it will start to produce even more oils to compensate.",
        "This mask contains ingredients that may help control excess oil production without drying out your skin.",
        "Some of the ingredients are also helpful when it comes to treating acne.",
        "Beat 1 egg in a small cup or bowl with a fork or mini whisk.",
        "Crack an egg open into a small cup or bowl, then beat it briskly with a fork or mini whisk until it is pale and frothy.",
        "Egg yolks help hydrate skin, which is important even for oily skin types.",
        "The yolks also contain zinc, which can help treat acne.",
        "Egg whites help tighten the skin and close up pores, which can help reduce acne.",
        "Add 4 tablespoons of organic pumpkin purée.",
        "Pumpkin is rich in vitamins and minerals.",
        "It also contains zinc, which can help control hormone levels and excess oil production.",
        "Add 1 tablespoon of raw honey.",
        "Honey does wonders for the skin.",
        "It is a natural humectant, so it helps draw moisture into the skin.",
        "It is also naturally antibacterial and antimicrobial, so it helps manage acne.",
        "Add some milk or raw apple cider vinegar, if desired.",
        "At this point, your mask has all of the necessary ingredients, but you can make it even better by adding some milk or apple cider vinegar.",
        "Both do different things for your skin, so choose one that suits your skin's needs the best.",
        "If you have dull skin, add 1 tablespoon of milk.",
        "The lactic acid in milk is gently exfoliating, so it can leave your skin feeling softer, smoother, and brighter.",
        "If you have oily skin or acne, add 1 tablespoon of raw apple cider vinegar.",
        "Mix it all together with a fork.",
        "Keep stirring the mixture until everything is evenly combined.",
        "You do not want to see any streaks or swirls of egg yolk.",
        "Apply the mask all over your face, taking care to avoid the eyes, nose, and mouth.",
        "Because this mask contains raw egg, it is very important to avoid the mouth and nose in addition to the eyes.",
        "You can apply the mask using your fingers, but make sure to wash them well first with soap and warm water.",
        "Keep your hair clipped or tied back so that the mask doesn't get all over it.",
        "Wait 15 to 20 minutes, or until the mask dries.",
        "Avoid moving around too much during this time, or the mask may start to drip.",
        "If you can, sit or lay down someplace comfortable.",
        "You can pass the time by reading a book, listening to music, daydreaming, or watching your favorite show.",
        "Wash the mask off.",
        "You may need to use a washcloth and some facial cleaner in order to get the mask all off.",
        "Once your face is clean, splash your face with cool water to seal your pores, then gently pat it dry with a soft, clean towel.",
        "Follow up with your usual toner and moisturizer, if desired.",
        "You can use this mask once a week."
    ]
}