{
    "title": "How to Dry Your Hair",
    "url": "https://www.wikihow.com/Dry-Your-Hair",
    "category_hierarchy": [
        "Personal Care and Style",
        "Hair Care",
        "Regular Hair Care",
        "Drying Hair"
    ],
    "methods": [
        {
            "name": "Air Drying Hair",
            "steps": [
                {
                    "headline": "Pat your hair dry with a towel.",
                    "description": "If you can, try to use a microfiber towel or an old, clean t-shirt. Microfiber towels and t-shirts are soft and gentle on all hair types. They are less likely to snag, rip, or tear your hair than a regular towel. Microfiber towels and t-shirts can also help reduce frizz. EXPERT TIP\tAir drying your hair puts less stress on your strands than using a hair dryer, and is better for your hair's health. Laura MartinLicensed Cosmetologist"
                },
                {
                    "headline": "Detangle your hair when it is about 50% dry.",
                    "description": "Use a wide-tooth comb to do this. Work in small sections, starting from the ends of your hair and working your way towards the top. Never comb straight down from the roots, unless your hair is completely tangle-free. Doing this may cause your hair to snap and break. Spray some leave-in conditioner into your hair before combing it if it is tangled."
                },
                {
                    "headline": "Add in your favorite hair product.",
                    "description": "You can use some gel for extra hold, or cream to smooth away frizz and dryness. You can also add in a little lightweight mousse for extra volume."
                },
                {
                    "headline": "Put your hair into the desired style before it dries.",
                    "description": "As you comb through your hair, arrange it the way that you want to wear it. For example, you can twist a few sections into curls, comb it to make it straight, or fluff out your hair around the roots to add volume."
                },
                {
                    "headline": "Consider draping a towel around your shoulders.",
                    "description": "This will help keep your clothes dry, and might be a great idea during the colder winter months. If you need to, secure the ends of the towel with a hair tie or hair clip."
                },
                {
                    "headline": "Wait for your hair to dry, then style it if necessary.",
                    "description": "Once your hair is completely dry, you can add in a little styling cream or gel. If you tend to get frizzy hair, you can add in a little bit of hair oil. Put a small amount of product into your palm, and use your fingers to comb the product through your hair. If you have curly, kinky, or textured hair, do not brush your hair. If you do, you will disrupt the curl pattern. You hair will turn frizzy, puffy, and bushy. Use your fingers to separate the curls instead. If you have straight hair, you can add some volume back to your hair by tucking some Velcro hair rollers into the top layers of your hair. Spray the rollers and your hair with some hair spray. Wait a few minutes, then take the rollers out."
                }
            ]
        },
        {
            "name": "Plopping Curly, Kinky, or Textured Hair",
            "steps": [
                {
                    "headline": "Find a t-shirt.",
                    "description": "If you can, try to get one with long sleeves. Any t-shirt will do, but if you have thick or long hair, you may want to get a larger t-shirt. T-shirts are made out of softer material than towels. Because they are so smooth, they snag on your hair less. This will help minimize rips, tears, and frizz."
                },
                {
                    "headline": "Squeeze any extra moisture out of your hair and apply hair products.",
                    "description": "The best time to add hair products to curly, kinky, or textured hair types is when the hair is still wet. If your hair is tangled, you can gently comb it at this point. Use a wide-tooth comb, and work in small sections, starting from the ends first. Never use a brush."
                },
                {
                    "headline": "Spread a t-shirt out on a chair or table.",
                    "description": "The arms and neck hole should be facing you, and the bottom hem should be facing away from you."
                },
                {
                    "headline": "Lean over the shirt and plop your hair down onto the fabric.",
                    "description": "Try to get your hair as centered as possible. Your hair should be right between the shirt and the top of your head. You want your head very close to the shirt and your plopped hair, but not actually touching it."
                },
                {
                    "headline": "Flip the bottom hem of the shirt onto the back of your head.",
                    "description": "Pinch the hem between your fingers, and lift it off the table or chair. Bring it over towards your neck, and let go. The hem should be covering the entire back and nape of your head."
                },
                {
                    "headline": "Pull the front part of the shirt against your forehead.",
                    "description": "Take the shirt by the shoulders and pull it up and against your forehead. Slide your hands along the sleeves, and hold them tightly."
                },
                {
                    "headline": "Wrap the arms of the shirt around your head and tie them in a knot.",
                    "description": "Pull the arms towards the back of your head. They should cross right over the shirt hem. Tie them in a tight knot. If the sleeves are long enough, you can wrap them back around your head, and tie them in a knot right above your forehead. The sleeves of the shirt will hold your shirt-turban in place. If the sleeves are too short, try securing them with a bobby pin or a safety pin."
                },
                {
                    "headline": "Wait for your hair to dry.",
                    "description": "It will take a while for your hair to dry, depending on how thick or long your hair is. Some people like to plop-dry their hair before blow-drying it the rest of the way. You can also let it dry overnight."
                }
            ]
        },
        {
            "name": "Blow Drying Curly Hair",
            "steps": [
                {
                    "headline": "Gather your supplies.",
                    "description": "Curly hair is different from straight hair, and requires special care. People with wavy hair can also use this method. If you have kinky or textured hair, however, you might want to try this one. Here's what you'll need:\nHairdryer\nDiffuser attachment\nWide-tooth comb\nLeave-in conditioner\nGel or styling cream (optional)\nHair serum or oil"
                },
                {
                    "headline": "Comb your hair to get rid of any tangles.",
                    "description": "Start from the ends first, and work your way up to the roots in small chunks. Use a wide-tooth comb."
                },
                {
                    "headline": "Apply some leave-in conditioner to your hair.",
                    "description": "You want to do this while your hair is still soaking-wet. Gently squeeze the excess water out of your hair when you are done."
                },
                {
                    "headline": "Consider applying some styling gel to your hair.",
                    "description": "Use your fingers or a wide-toothed comb to spread the gel through your hair. Start from the roots and work your way down towards the ends. Once you've applied the gel, give your curls a little shake; this will help reshape them. You don't have to do this, but the gel will help give your curls some shape and structure."
                },
                {
                    "headline": "Attach a diffuser to the nozzle of your hairdryer.",
                    "description": "The diffuser will help distribute the heat and keep your hair from getting too frizzy. It will also help the curls keep their shape."
                },
                {
                    "headline": "Start blow drying your hair from the roots, using a low or medium heat setting.",
                    "description": "If your hairdryer has a speed setting, use the medium setting. Try not to blow dry the ends of your hair. They tend to be the driest part, so the less heat you use on them, the better."
                },
                {
                    "headline": "Apply some serum or oil to your hair once you are done drying it.",
                    "description": "Start with a pea-sized amount. Comb it through your hair using your fingers or a wide-tooth comb if you want it to be straight, or distribute it with your fingers and scrunch your hair with your hands to maintain your curls. Start from your hairline, and work your way back. Apply a pea-sized amount of serum or oil to hair, starting from hairline. If you used gel and your hair is too clumpy, finger comb your hair a little until the clumps break up. If you want to make your hair appear more full, then gently massage your scalp using your fingers."
                }
            ]
        },
        {
            "name": "Blow Drying Kinky or Textured Hair",
            "steps": [
                {
                    "headline": "Gather your supplies.",
                    "description": "Kinky or textured hair can look great and amazing, but it is also delicate and prone to damage. If you have kinky or textured hair, you'll need to take a few extra steps to protect it from the heat of a blow dryer. Here's what you'll need:\nHairdryer\nWide-tooth comb attachment\nHeat protecting spray\nStyling foam or mousse\nHair cream or serum\nWide-toothed comb\nCeramic round brush"
                },
                {
                    "headline": "Start by combing your hair.",
                    "description": "Use a wide-toothed comb, and start from the ends of your hair first. Only comb your hair from the roots straight down if your hair is completely tangle-free."
                },
                {
                    "headline": "Apply any hair products while your hair is still wet.",
                    "description": "Use a styling foam or mousse if you plan on having a blowout. If you want to straighten your hair later, use a styling cream or serum; it will give your hair more protection."
                },
                {
                    "headline": "Let your hair air dry partway.",
                    "description": "You want it to be almost dry before you start using a hairdryer. If you try to blow dry your hair while it is still wet, you might \"cook\" your hair, and damage it from the inside out. Consider braiding your hair and letting it air dry all the way, or partway."
                },
                {
                    "headline": "Spray your hair with some heat protecting spray.",
                    "description": "Kinky, textured hair is delicate, and the high temperatures of a hairdryer can really damage it."
                },
                {
                    "headline": "Start blow drying your hair, using a low or medium heat setting.",
                    "description": "Aim the nozzle downward, and keep it at least 6 inches (15 cm) away from your hair. If you keep it too close, you might burn or scorch your hair, even with the heat protecting spray. Try working in smaller sections. Aiming the nozzle down the hair shaft will help prevent frizz. Start blow drying from the back of your head first. This way, you won't have to worry about messing up the front after you finish it. Use a ceramic round brush to smooth out your hair. Brush your hair from the roots to the ends and blow dry the section from roots to ends as you do this. You can blow dry your hair without using a brush, but then you will have to use a flat iron to straighten it. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNdeye Anta Niang\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHair Stylist and Master Braider\t\t\t\t\t\t\t\tNdeye Anta Niang is a Hair Stylist, Master Braider, and Founder of AntaBraids, a traveling braiding service based in New York City. Ndeye has over 20 years of experience in African hair including braiding box braids, Senegalese twists, crochet braids, faux dread locs, goddess locs, kinky twists, and lakhass braids. Ndeye was the first female of her tribe in Africa to move to America and is now sharing her knowledge of African braids passed on from generation to generation. Ndeye Anta Niang\t\t\tHair Stylist and Master Braider\t\t\t\tOur Expert Agrees: If you don't want to use heat on your hair, you can still use your hair dryer—just set it to cold or warm heat, instead. If you do use high heat on your hair, though, be sure to use a heat protectant product to avoid damage and hair loss."
                }
            ]
        },
        {
            "name": "Blow Drying Straight Hair",
            "steps": [
                {
                    "headline": "Gather your supplies.",
                    "description": "Straight hair can be easy to take care of, but it can also look limp. Fortunately, there are a few extra steps you can take to give it some boost. This section will show you how to blow dry straight hair; it will also give you some tips on how to give it a little volume. Here's what you'll need:\nHairdryer\nNozzle attachment\nRound hairbrush\nHair clip and hair tie\nMousse for thickness (optional)\nCream to smooth and soften dry, damaged hair (optional)\nHair spray to add volume and set style (optional)"
                },
                {
                    "headline": "Start by towel-drying your hair.",
                    "description": "Squeeze your hair with the towel. This will help soak up any excess moisture, and help your hair dry faster."
                },
                {
                    "headline": "Apply some mousse or styling cream.",
                    "description": "Use mousse if you want to add volume to your hair. Use a smoothing hair cream to tame dryness and repair damage."
                },
                {
                    "headline": "Put on the nozzle attachment and start blow drying your hair on a medium heat setting.",
                    "description": "If your hair dryer had a speed setting, use the high one. Dry your hair until it is about 80% dry, then turn off the hairdryer. Be sure to aim the nozzle downwards while blow drying your hair. The nozzle will help direct the air flow, and keep your hair a safe distance from the hairdryer's heat."
                },
                {
                    "headline": "Clip the outer layers of your hair out of the way.",
                    "description": "Gather the upper layers of your hair, just like doing a half-up, half-down ponytail, and secure them with a hair clip."
                },
                {
                    "headline": "Blow dry the bottom layers of your hair.",
                    "description": "Point the nozzle downward, and run the round brush through your hair while you are blow drying it."
                },
                {
                    "headline": "Pull the bottom layer of your hair out of the way once it is dry.",
                    "description": "You can pull it back into a low ponytail if you want to keep it straight. You can also twist it into a loose bun if you want it to have a slight wave to it."
                },
                {
                    "headline": "Remove the hair clip and blow dry the top layer of your hair.",
                    "description": "Run the brush through your hair while you are drying it, and point the nozzle downward. If you want to give your hair some extra volume, the point the nozzle upward when you start at the roots. Then, move the brush up and out in a c-shape motion."
                },
                {
                    "headline": "Take out the low ponytail or bun and part your hair.",
                    "description": "You can brush it back and let it part naturally. You can also set your own part using the handle of a rattail comb."
                },
                {
                    "headline": "Style your hair, if necessary.",
                    "description": "If you want to have flipped ends, run the round brush through the underside of your hair, and stop when you get to the ends. Blow dry your hair using a medium heat setting first, then dry it using a cold setting to set the style. Here are some tips on how to style your hair:\nTo give the ends of your hair a slight curl, run the round hairbrush through the underside of your hair. Twirl it until the ends of your hair are wrapped around it. Blow dry the ends with a medium setting first, and then a cold setting. The cold air will help set the curl. To make the ends of your hair straight, brush them downwards while blow drying them. Be sure to aim the nozzle downward as well. If your hair tends to get a lot of static or flyways, tame it with some styling cream or mist."
                }
            ]
        }
    ],
    "tyn": [
        "Blow Drying Curly Hair",
        "[13]",
        "X",
        "Research source",
        "[14]",
        "Hairdryer",
        "Diffuser attachment",
        "Wide-toothed comb",
        "Leave-in conditioner",
        "Gel (optional)",
        "Hair serum or oil",
        "Blow Drying Kinky or Textured Hair",
        "[15]",
        "Wide-toothed comb attachment",
        "Heat protecting spray",
        "Styling foam or mousse (optional)",
        "Hair cream or serum (optional)",
        "Wide-tooth comb",
        "Blow Drying Straight Hair",
        "[16]",
        "[17]",
        "Nozzle attachment",
        "Round hairbrush",
        "Hair clip and hair tie",
        "Mousse for thickness (optional)",
        "Cream to smooth and soften dry, damaged hair (optional)",
        "Hair spray to add volume and set style (optional)"
    ],
    "text": " Air Drying Hair Pat your hair dry with a towel. If you can, try to use a microfiber towel or an old, clean t-shirt. Microfiber towels and t-shirts are soft and gentle on all hair types. They are less likely to snag, rip, or tear your hair than a regular towel. Microfiber towels and t-shirts can also help reduce frizz. EXPERT TIP\tAir drying your hair puts less stress on your strands than using a hair dryer, and is better for your hair's health. Laura MartinLicensed Cosmetologist Detangle your hair when it is about 50% dry. Use a wide-tooth comb to do this. Work in small sections, starting from the ends of your hair and working your way towards the top. Never comb straight down from the roots, unless your hair is completely tangle-free. Doing this may cause your hair to snap and break. Spray some leave-in conditioner into your hair before combing it if it is tangled. Add in your favorite hair product. You can use some gel for extra hold, or cream to smooth away frizz and dryness. You can also add in a little lightweight mousse for extra volume. Put your hair into the desired style before it dries. As you comb through your hair, arrange it the way that you want to wear it. For example, you can twist a few sections into curls, comb it to make it straight, or fluff out your hair around the roots to add volume. Consider draping a towel around your shoulders. This will help keep your clothes dry, and might be a great idea during the colder winter months. If you need to, secure the ends of the towel with a hair tie or hair clip. Wait for your hair to dry, then style it if necessary. Once your hair is completely dry, you can add in a little styling cream or gel. If you tend to get frizzy hair, you can add in a little bit of hair oil. Put a small amount of product into your palm, and use your fingers to comb the product through your hair. If you have curly, kinky, or textured hair, do not brush your hair. If you do, you will disrupt the curl pattern. You hair will turn frizzy, puffy, and bushy. Use your fingers to separate the curls instead. If you have straight hair, you can add some volume back to your hair by tucking some Velcro hair rollers into the top layers of your hair. Spray the rollers and your hair with some hair spray. Wait a few minutes, then take the rollers out. Plopping Curly, Kinky, or Textured Hair Find a t-shirt. If you can, try to get one with long sleeves. Any t-shirt will do, but if you have thick or long hair, you may want to get a larger t-shirt. T-shirts are made out of softer material than towels. Because they are so smooth, they snag on your hair less. This will help minimize rips, tears, and frizz. Squeeze any extra moisture out of your hair and apply hair products. The best time to add hair products to curly, kinky, or textured hair types is when the hair is still wet. If your hair is tangled, you can gently comb it at this point. Use a wide-tooth comb, and work in small sections, starting from the ends first. Never use a brush. Spread a t-shirt out on a chair or table. The arms and neck hole should be facing you, and the bottom hem should be facing away from you. Lean over the shirt and plop your hair down onto the fabric. Try to get your hair as centered as possible. Your hair should be right between the shirt and the top of your head. You want your head very close to the shirt and your plopped hair, but not actually touching it. Flip the bottom hem of the shirt onto the back of your head. Pinch the hem between your fingers, and lift it off the table or chair. Bring it over towards your neck, and let go. The hem should be covering the entire back and nape of your head. Pull the front part of the shirt against your forehead. Take the shirt by the shoulders and pull it up and against your forehead. Slide your hands along the sleeves, and hold them tightly. Wrap the arms of the shirt around your head and tie them in a knot. Pull the arms towards the back of your head. They should cross right over the shirt hem. Tie them in a tight knot. If the sleeves are long enough, you can wrap them back around your head, and tie them in a knot right above your forehead. The sleeves of the shirt will hold your shirt-turban in place. If the sleeves are too short, try securing them with a bobby pin or a safety pin. Wait for your hair to dry. It will take a while for your hair to dry, depending on how thick or long your hair is. Some people like to plop-dry their hair before blow-drying it the rest of the way. You can also let it dry overnight. Blow Drying Curly Hair Gather your supplies. Curly hair is different from straight hair, and requires special care. People with wavy hair can also use this method. If you have kinky or textured hair, however, you might want to try this one. Here's what you'll need:\nHairdryer\nDiffuser attachment\nWide-tooth comb\nLeave-in conditioner\nGel or styling cream (optional)\nHair serum or oil Comb your hair to get rid of any tangles. Start from the ends first, and work your way up to the roots in small chunks. Use a wide-tooth comb. Apply some leave-in conditioner to your hair. You want to do this while your hair is still soaking-wet. Gently squeeze the excess water out of your hair when you are done. Consider applying some styling gel to your hair. Use your fingers or a wide-toothed comb to spread the gel through your hair. Start from the roots and work your way down towards the ends. Once you've applied the gel, give your curls a little shake; this will help reshape them. You don't have to do this, but the gel will help give your curls some shape and structure. Attach a diffuser to the nozzle of your hairdryer. The diffuser will help distribute the heat and keep your hair from getting too frizzy. It will also help the curls keep their shape. Start blow drying your hair from the roots, using a low or medium heat setting. If your hairdryer has a speed setting, use the medium setting. Try not to blow dry the ends of your hair. They tend to be the driest part, so the less heat you use on them, the better. Apply some serum or oil to your hair once you are done drying it. Start with a pea-sized amount. Comb it through your hair using your fingers or a wide-tooth comb if you want it to be straight, or distribute it with your fingers and scrunch your hair with your hands to maintain your curls. Start from your hairline, and work your way back. Apply a pea-sized amount of serum or oil to hair, starting from hairline. If you used gel and your hair is too clumpy, finger comb your hair a little until the clumps break up. If you want to make your hair appear more full, then gently massage your scalp using your fingers. Blow Drying Kinky or Textured Hair Gather your supplies. Kinky or textured hair can look great and amazing, but it is also delicate and prone to damage. If you have kinky or textured hair, you'll need to take a few extra steps to protect it from the heat of a blow dryer. Here's what you'll need:\nHairdryer\nWide-tooth comb attachment\nHeat protecting spray\nStyling foam or mousse\nHair cream or serum\nWide-toothed comb\nCeramic round brush Start by combing your hair. Use a wide-toothed comb, and start from the ends of your hair first. Only comb your hair from the roots straight down if your hair is completely tangle-free. Apply any hair products while your hair is still wet. Use a styling foam or mousse if you plan on having a blowout. If you want to straighten your hair later, use a styling cream or serum; it will give your hair more protection. Let your hair air dry partway. You want it to be almost dry before you start using a hairdryer. If you try to blow dry your hair while it is still wet, you might \"cook\" your hair, and damage it from the inside out. Consider braiding your hair and letting it air dry all the way, or partway. Spray your hair with some heat protecting spray. Kinky, textured hair is delicate, and the high temperatures of a hairdryer can really damage it. Start blow drying your hair, using a low or medium heat setting. Aim the nozzle downward, and keep it at least 6 inches (15 cm) away from your hair. If you keep it too close, you might burn or scorch your hair, even with the heat protecting spray. Try working in smaller sections. Aiming the nozzle down the hair shaft will help prevent frizz. Start blow drying from the back of your head first. This way, you won't have to worry about messing up the front after you finish it. Use a ceramic round brush to smooth out your hair. Brush your hair from the roots to the ends and blow dry the section from roots to ends as you do this. You can blow dry your hair without using a brush, but then you will have to use a flat iron to straighten it. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNdeye Anta Niang\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHair Stylist and Master Braider\t\t\t\t\t\t\t\tNdeye Anta Niang is a Hair Stylist, Master Braider, and Founder of AntaBraids, a traveling braiding service based in New York City. Ndeye has over 20 years of experience in African hair including braiding box braids, Senegalese twists, crochet braids, faux dread locs, goddess locs, kinky twists, and lakhass braids. Ndeye was the first female of her tribe in Africa to move to America and is now sharing her knowledge of African braids passed on from generation to generation. Ndeye Anta Niang\t\t\tHair Stylist and Master Braider\t\t\t\tOur Expert Agrees: If you don't want to use heat on your hair, you can still use your hair dryer—just set it to cold or warm heat, instead. If you do use high heat on your hair, though, be sure to use a heat protectant product to avoid damage and hair loss. Blow Drying Straight Hair Gather your supplies. Straight hair can be easy to take care of, but it can also look limp. Fortunately, there are a few extra steps you can take to give it some boost. This section will show you how to blow dry straight hair; it will also give you some tips on how to give it a little volume. Here's what you'll need:\nHairdryer\nNozzle attachment\nRound hairbrush\nHair clip and hair tie\nMousse for thickness (optional)\nCream to smooth and soften dry, damaged hair (optional)\nHair spray to add volume and set style (optional) Start by towel-drying your hair. Squeeze your hair with the towel. This will help soak up any excess moisture, and help your hair dry faster. Apply some mousse or styling cream. Use mousse if you want to add volume to your hair. Use a smoothing hair cream to tame dryness and repair damage. Put on the nozzle attachment and start blow drying your hair on a medium heat setting. If your hair dryer had a speed setting, use the high one. Dry your hair until it is about 80% dry, then turn off the hairdryer. Be sure to aim the nozzle downwards while blow drying your hair. The nozzle will help direct the air flow, and keep your hair a safe distance from the hairdryer's heat. Clip the outer layers of your hair out of the way. Gather the upper layers of your hair, just like doing a half-up, half-down ponytail, and secure them with a hair clip. Blow dry the bottom layers of your hair. Point the nozzle downward, and run the round brush through your hair while you are blow drying it. Pull the bottom layer of your hair out of the way once it is dry. You can pull it back into a low ponytail if you want to keep it straight. You can also twist it into a loose bun if you want it to have a slight wave to it. Remove the hair clip and blow dry the top layer of your hair. Run the brush through your hair while you are drying it, and point the nozzle downward. If you want to give your hair some extra volume, the point the nozzle upward when you start at the roots. Then, move the brush up and out in a c-shape motion. Take out the low ponytail or bun and part your hair. You can brush it back and let it part naturally. You can also set your own part using the handle of a rattail comb. Style your hair, if necessary. If you want to have flipped ends, run the round brush through the underside of your hair, and stop when you get to the ends. Blow dry your hair using a medium heat setting first, then dry it using a cold setting to set the style. Here are some tips on how to style your hair:\nTo give the ends of your hair a slight curl, run the round hairbrush through the underside of your hair. Twirl it until the ends of your hair are wrapped around it. Blow dry the ends with a medium setting first, and then a cold setting. The cold air will help set the curl. To make the ends of your hair straight, brush them downwards while blow drying them. Be sure to aim the nozzle downward as well. If your hair tends to get a lot of static or flyways, tame it with some styling cream or mist.",
    "sentences": [
        " Air Drying Hair Pat your hair dry with a towel.",
        "If you can, try to use a microfiber towel or an old, clean t-shirt.",
        "Microfiber towels and t-shirts are soft and gentle on all hair types.",
        "They are less likely to snag, rip, or tear your hair than a regular towel.",
        "Microfiber towels and t-shirts can also help reduce frizz.",
        "EXPERT TIP\tAir drying your hair puts less stress on your strands than using a hair dryer, and is better for your hair's health.",
        "Laura MartinLicensed Cosmetologist Detangle your hair when it is about 50% dry.",
        "Use a wide-tooth comb to do this.",
        "Work in small sections, starting from the ends of your hair and working your way towards the top.",
        "Never comb straight down from the roots, unless your hair is completely tangle-free.",
        "Doing this may cause your hair to snap and break.",
        "Spray some leave-in conditioner into your hair before combing it if it is tangled.",
        "Add in your favorite hair product.",
        "You can use some gel for extra hold, or cream to smooth away frizz and dryness.",
        "You can also add in a little lightweight mousse for extra volume.",
        "Put your hair into the desired style before it dries.",
        "As you comb through your hair, arrange it the way that you want to wear it.",
        "For example, you can twist a few sections into curls, comb it to make it straight, or fluff out your hair around the roots to add volume.",
        "Consider draping a towel around your shoulders.",
        "This will help keep your clothes dry, and might be a great idea during the colder winter months.",
        "If you need to, secure the ends of the towel with a hair tie or hair clip.",
        "Wait for your hair to dry, then style it if necessary.",
        "Once your hair is completely dry, you can add in a little styling cream or gel.",
        "If you tend to get frizzy hair, you can add in a little bit of hair oil.",
        "Put a small amount of product into your palm, and use your fingers to comb the product through your hair.",
        "If you have curly, kinky, or textured hair, do not brush your hair.",
        "If you do, you will disrupt the curl pattern.",
        "You hair will turn frizzy, puffy, and bushy.",
        "Use your fingers to separate the curls instead.",
        "If you have straight hair, you can add some volume back to your hair by tucking some Velcro hair rollers into the top layers of your hair.",
        "Spray the rollers and your hair with some hair spray.",
        "Wait a few minutes, then take the rollers out.",
        "Plopping Curly, Kinky, or Textured Hair Find a t-shirt.",
        "If you can, try to get one with long sleeves.",
        "Any t-shirt will do, but if you have thick or long hair, you may want to get a larger t-shirt.",
        "T-shirts are made out of softer material than towels.",
        "Because they are so smooth, they snag on your hair less.",
        "This will help minimize rips, tears, and frizz.",
        "Squeeze any extra moisture out of your hair and apply hair products.",
        "The best time to add hair products to curly, kinky, or textured hair types is when the hair is still wet.",
        "If your hair is tangled, you can gently comb it at this point.",
        "Use a wide-tooth comb, and work in small sections, starting from the ends first.",
        "Never use a brush.",
        "Spread a t-shirt out on a chair or table.",
        "The arms and neck hole should be facing you, and the bottom hem should be facing away from you.",
        "Lean over the shirt and plop your hair down onto the fabric.",
        "Try to get your hair as centered as possible.",
        "Your hair should be right between the shirt and the top of your head.",
        "You want your head very close to the shirt and your plopped hair, but not actually touching it.",
        "Flip the bottom hem of the shirt onto the back of your head.",
        "Pinch the hem between your fingers, and lift it off the table or chair.",
        "Bring it over towards your neck, and let go.",
        "The hem should be covering the entire back and nape of your head.",
        "Pull the front part of the shirt against your forehead.",
        "Take the shirt by the shoulders and pull it up and against your forehead.",
        "Slide your hands along the sleeves, and hold them tightly.",
        "Wrap the arms of the shirt around your head and tie them in a knot.",
        "Pull the arms towards the back of your head.",
        "They should cross right over the shirt hem.",
        "Tie them in a tight knot.",
        "If the sleeves are long enough, you can wrap them back around your head, and tie them in a knot right above your forehead.",
        "The sleeves of the shirt will hold your shirt-turban in place.",
        "If the sleeves are too short, try securing them with a bobby pin or a safety pin.",
        "Wait for your hair to dry.",
        "It will take a while for your hair to dry, depending on how thick or long your hair is.",
        "Some people like to plop-dry their hair before blow-drying it the rest of the way.",
        "You can also let it dry overnight.",
        "Blow Drying Curly Hair Gather your supplies.",
        "Curly hair is different from straight hair, and requires special care.",
        "People with wavy hair can also use this method.",
        "If you have kinky or textured hair, however, you might want to try this one.",
        "Here's what you'll need:\nHairdryer\nDiffuser attachment\nWide-tooth comb\nLeave-in conditioner\nGel or styling cream (optional)\nHair serum or oil Comb your hair to get rid of any tangles.",
        "Start from the ends first, and work your way up to the roots in small chunks.",
        "Use a wide-tooth comb.",
        "Apply some leave-in conditioner to your hair.",
        "You want to do this while your hair is still soaking-wet.",
        "Gently squeeze the excess water out of your hair when you are done.",
        "Consider applying some styling gel to your hair.",
        "Use your fingers or a wide-toothed comb to spread the gel through your hair.",
        "Start from the roots and work your way down towards the ends.",
        "Once you've applied the gel, give your curls a little shake; this will help reshape them.",
        "You don't have to do this, but the gel will help give your curls some shape and structure.",
        "Attach a diffuser to the nozzle of your hairdryer.",
        "The diffuser will help distribute the heat and keep your hair from getting too frizzy.",
        "It will also help the curls keep their shape.",
        "Start blow drying your hair from the roots, using a low or medium heat setting.",
        "If your hairdryer has a speed setting, use the medium setting.",
        "Try not to blow dry the ends of your hair.",
        "They tend to be the driest part, so the less heat you use on them, the better.",
        "Apply some serum or oil to your hair once you are done drying it.",
        "Start with a pea-sized amount.",
        "Comb it through your hair using your fingers or a wide-tooth comb if you want it to be straight, or distribute it with your fingers and scrunch your hair with your hands to maintain your curls.",
        "Start from your hairline, and work your way back.",
        "Apply a pea-sized amount of serum or oil to hair, starting from hairline.",
        "If you used gel and your hair is too clumpy, finger comb your hair a little until the clumps break up.",
        "If you want to make your hair appear more full, then gently massage your scalp using your fingers.",
        "Blow Drying Kinky or Textured Hair Gather your supplies.",
        "Kinky or textured hair can look great and amazing, but it is also delicate and prone to damage.",
        "If you have kinky or textured hair, you'll need to take a few extra steps to protect it from the heat of a blow dryer.",
        "Here's what you'll need:\nHairdryer\nWide-tooth comb attachment\nHeat protecting spray\nStyling foam or mousse\nHair cream or serum\nWide-toothed comb\nCeramic round brush Start by combing your hair.",
        "Use a wide-toothed comb, and start from the ends of your hair first.",
        "Only comb your hair from the roots straight down if your hair is completely tangle-free.",
        "Apply any hair products while your hair is still wet.",
        "Use a styling foam or mousse if you plan on having a blowout.",
        "If you want to straighten your hair later, use a styling cream or serum; it will give your hair more protection.",
        "Let your hair air dry partway.",
        "You want it to be almost dry before you start using a hairdryer.",
        "If you try to blow dry your hair while it is still wet, you might \"cook\" your hair, and damage it from the inside out.",
        "Consider braiding your hair and letting it air dry all the way, or partway.",
        "Spray your hair with some heat protecting spray.",
        "Kinky, textured hair is delicate, and the high temperatures of a hairdryer can really damage it.",
        "Start blow drying your hair, using a low or medium heat setting.",
        "Aim the nozzle downward, and keep it at least 6 inches (15 cm) away from your hair.",
        "If you keep it too close, you might burn or scorch your hair, even with the heat protecting spray.",
        "Try working in smaller sections.",
        "Aiming the nozzle down the hair shaft will help prevent frizz.",
        "Start blow drying from the back of your head first.",
        "This way, you won't have to worry about messing up the front after you finish it.",
        "Use a ceramic round brush to smooth out your hair.",
        "Brush your hair from the roots to the ends and blow dry the section from roots to ends as you do this.",
        "You can blow dry your hair without using a brush, but then you will have to use a flat iron to straighten it.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNdeye Anta Niang\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHair Stylist and Master Braider\t\t\t\t\t\t\t\tNdeye Anta Niang is a Hair Stylist, Master Braider, and Founder of AntaBraids, a traveling braiding service based in New York City.",
        "Ndeye has over 20 years of experience in African hair including braiding box braids, Senegalese twists, crochet braids, faux dread locs, goddess locs, kinky twists, and lakhass braids.",
        "Ndeye was the first female of her tribe in Africa to move to America and is now sharing her knowledge of African braids passed on from generation to generation.",
        "Ndeye Anta Niang\t\t\tHair Stylist and Master Braider\t\t\t\tOur Expert Agrees: If you don't want to use heat on your hair, you can still use your hair dryer—just set it to cold or warm heat, instead.",
        "If you do use high heat on your hair, though, be sure to use a heat protectant product to avoid damage and hair loss.",
        "Blow Drying Straight Hair Gather your supplies.",
        "Straight hair can be easy to take care of, but it can also look limp.",
        "Fortunately, there are a few extra steps you can take to give it some boost.",
        "This section will show you how to blow dry straight hair; it will also give you some tips on how to give it a little volume.",
        "Here's what you'll need:\nHairdryer\nNozzle attachment\nRound hairbrush\nHair clip and hair tie\nMousse for thickness (optional)\nCream to smooth and soften dry, damaged hair (optional)\nHair spray to add volume and set style (optional) Start by towel-drying your hair.",
        "Squeeze your hair with the towel.",
        "This will help soak up any excess moisture, and help your hair dry faster.",
        "Apply some mousse or styling cream.",
        "Use mousse if you want to add volume to your hair.",
        "Use a smoothing hair cream to tame dryness and repair damage.",
        "Put on the nozzle attachment and start blow drying your hair on a medium heat setting.",
        "If your hair dryer had a speed setting, use the high one.",
        "Dry your hair until it is about 80% dry, then turn off the hairdryer.",
        "Be sure to aim the nozzle downwards while blow drying your hair.",
        "The nozzle will help direct the air flow, and keep your hair a safe distance from the hairdryer's heat.",
        "Clip the outer layers of your hair out of the way.",
        "Gather the upper layers of your hair, just like doing a half-up, half-down ponytail, and secure them with a hair clip.",
        "Blow dry the bottom layers of your hair.",
        "Point the nozzle downward, and run the round brush through your hair while you are blow drying it.",
        "Pull the bottom layer of your hair out of the way once it is dry.",
        "You can pull it back into a low ponytail if you want to keep it straight.",
        "You can also twist it into a loose bun if you want it to have a slight wave to it.",
        "Remove the hair clip and blow dry the top layer of your hair.",
        "Run the brush through your hair while you are drying it, and point the nozzle downward.",
        "If you want to give your hair some extra volume, the point the nozzle upward when you start at the roots.",
        "Then, move the brush up and out in a c-shape motion.",
        "Take out the low ponytail or bun and part your hair.",
        "You can brush it back and let it part naturally.",
        "You can also set your own part using the handle of a rattail comb.",
        "Style your hair, if necessary.",
        "If you want to have flipped ends, run the round brush through the underside of your hair, and stop when you get to the ends.",
        "Blow dry your hair using a medium heat setting first, then dry it using a cold setting to set the style.",
        "Here are some tips on how to style your hair:\nTo give the ends of your hair a slight curl, run the round hairbrush through the underside of your hair.",
        "Twirl it until the ends of your hair are wrapped around it.",
        "Blow dry the ends with a medium setting first, and then a cold setting.",
        "The cold air will help set the curl.",
        "To make the ends of your hair straight, brush them downwards while blow drying them.",
        "Be sure to aim the nozzle downward as well.",
        "If your hair tends to get a lot of static or flyways, tame it with some styling cream or mist."
    ]
}