{
    "title": "How to Dance Emo",
    "url": "https://www.wikihow.com/Dance-Emo",
    "category_hierarchy": [
        "Youth",
        "Youth Culture",
        "Emo"
    ],
    "methods": [
        {
            "name": "Freestyling",
            "steps": [
                {
                    "headline": "Express yourself.",
                    "description": "Emo, which is short for “emotive hardcore” is music scene which stems from the Washington D.C. hardcore punk subculture. It's exactly what it sounds like; less angry version of punk rock music with emotional lyrics. Makers and listeners of this type of music use it to express their feelings. Lyrics usually convey non-metaphorical messages about happiness, sadness, depression, death, anger and despair. Learn what you're dancing to. Emo was formed when Ian Mackaye of Minor Threat turned the focus of the music community back to the individual after seeing the hardcore scene had become so violent. Minor Threat fan Guy Picciotto formed Rites of Spring in 1984, switching hardcore punks key characteristics for melodic guitars, varied rhythms and personal, impassioned lyrics.. There are different types of emo music, which include emotive hardcore, Midwest emo (often known as indie rock post-emo), hardcore emo, screamo, and emoviolence. As the decades passed, emo music took out and included different characteristics, creating new sub-genres. Many emo and screamo bands are: Rites of Spring, Embrace, Dag Nasty, Drive Like Jehu, American Football, City of Caterpillar, Circle Takes The Square, Jawbreaker, Heroin, Hot Water Music, Sunny Day Real Estate, Indian Summer, Jets to Brazil, Braid, Saetia, Cap'n Jazz, Mineral, I Hate Myself, The Academy Is..., Saves the Day and Empire! Empire! (I Was a Lonely Estate). Emo bands often can be heard live. Some bands travel here and there -- usually on a very low budget. As part of the emo culture, commercialism is highly frowned upon. Live “emo shows” are very cheap -- usually around $5 or less. Technology also is somewhat frowned upon. Recordings of emo music tend to be low budget, and copies of the music tend to be analog or sold on outdated media. True to the non-commercialism ideals emo bands sell their music very cheaply around $5 or so, and most bands do not sell t-shirts. So instead, you may DIY your own and comply with the DIY ethic. Live emo bands often play with their backs to the audience during the slow parts of the song. Then they explode by screaming and jumping around during the faster-paced parts, usually knocking things over as they go. These antics obviously have an affect on the audience as the audience responds in dance."
                },
                {
                    "headline": "Be spontaneous.",
                    "description": "The basis of emo is that you can express yourself in whatever way you wish through dance. Really feel the music, and then move in whatever way your body wants. “Freestyling” is spontaneous by nature, so nothing needs to be well-thought out, planned, or choreographed. Just move. If you are having trouble “letting go” so that you can move spontaneously, let the music drive you. In “emo dance” quick jerky shoulder, leg and arm movements are common. So, if your movements seem off-beat or spastic, don’t worry about it. Think about your frustration or angst. Stop for a moment and tune everything out but the music. Think about all you’ve endured and move your body. It’s better if you don’t let your mind get in the way and think too much. You may incorporate some elements of slam dancing and moshing. What most people think of as hard-core violent slam dancing, as its name implies, doesn’t really occur in emo dancing. Some would say that slam dancing shouldn’t be violent at all. Back in the 70s and 80s when it was created, slam dancing was basically jumping around without doing any real dance moves. It was never purposely violent. ”Mosh” in the pit. ”Moshing” is the new term for slam dancing, but it’s actually different. Slam dancing is jumping around. Moshing is dancing and jumping aggressively in a tightly-packed group of people at a live event. Since people are so close together, bumping into other people is inevitable. “Moshing” to emo music is generally less dramatic than at heavy metal and traditional punk rock concerts."
                },
                {
                    "headline": "Repeat movements.",
                    "description": "Once you started dancing, repeat the movements. It’s not necessary to switch dance steps or movements. Freestyling is often awkward and repetitive. As you begin to feel the music and move, if you find yourself rocking back-and-forth or jumping on your toes -- common “emo dance” movements -- keep going. Think of your movements as an expression of your feelings. It’s kind of the way that a child might scribble on a page without staying in the lines -- back and forth. The back-and-forth movements are an expression of the child’s energy and emotions whether sad or happy. For you, your entire body is a tool to create those gestural, often rapid repetitive movements that are generated by emotion. These movements should be carefree, expressive and intense. So, keep doing it until you feel like doing something else. Point your index  fingers. Emo dancing often involves finger pointing -- both at yourself and others. Don’t feel that you have to limit yourself to standing up or any other position. Since this is freestyle, anything goes -- even laying on the ground and shaking."
                },
                {
                    "headline": "Move faster.",
                    "description": "Dance harder. In emo, the more you feel the music, the faster you should be moving and the harder your movements should be. So, if you’re feeling it, let those emotions transmit through the body. Bob your head faster on beat with the music -- or not. Bounce higher on your toes as the music moves you. Throw your elbows."
                }
            ]
        },
        {
            "name": "Doing the Emo Trembler",
            "steps": [
                {
                    "headline": "Clasp your hands together.",
                    "description": "Either you can interlock your fingers together or you can clasp them together by forming the fingers in each hand into a claw shape and then cupping them together. Traditionally, this described as a hand gesture that people make when they are nervous or anxious."
                },
                {
                    "headline": "Lean forward and bounce on the balls of your feet.",
                    "description": "You don’t need to bounce in any particular way. Just shift your weight to the balls of your feet and bounce up and down. Do this the same way that you would tap your knee or foot when you like a certain music and your body seems to automatically respond. Same here: bounce. Remember that you should be feeling the music and moving in a carefree manner as you move in true emo fashion."
                },
                {
                    "headline": "Move your torso up and down.",
                    "description": "If you have already leaned forward, move your torso back. Then, move it forward again, and continue to repeat this motion. The movement should be done energetically and intensely -- not without emotion or feeling. Some people appear to rocking back-and-forth almost violently when they do this."
                }
            ]
        },
        {
            "name": "Doing the Chest Tap",
            "steps": [
                {
                    "headline": "Start to bounce to the music.",
                    "description": "Bend your knees a bit, but shift your weight to the balls of your feet. Let the energy flow from your feet and explode out as you bounce up and down. In other words, this should be an energetic bounce, not a calm and casual bounce."
                },
                {
                    "headline": "Bend your elbows so that your arm forms an L-shape.",
                    "description": "Or, you can bend the arm even closer to the body so that the arms makes the shape of a triangle. Swing your arms with energy and gusto to the beat. This can be in tempo with your bounce, but it can also be off-beat and to its own separate tempo. In other words, the two movements don’t need to be in sync with each other. It can be wild and chaotic."
                },
                {
                    "headline": "Point your fingers.",
                    "description": "With your index finger, start to point at yourself or point outwardly away from the body. Repeat the movement. Keep pointing as you bounce and swing your arms. Increase the pace, and point more rapidly and energetically. The more you are feeling the music, the more enthusiastic and quick-paced the pointing should be."
                }
            ]
        }
    ],
    "tyn": [
        "Music",
        "Friends"
    ],
    "text": " Freestyling Express yourself. Emo, which is short for “emotive hardcore” is music scene which stems from the Washington D.C. hardcore punk subculture. It's exactly what it sounds like; less angry version of punk rock music with emotional lyrics. Makers and listeners of this type of music use it to express their feelings. Lyrics usually convey non-metaphorical messages about happiness, sadness, depression, death, anger and despair. Learn what you're dancing to. Emo was formed when Ian Mackaye of Minor Threat turned the focus of the music community back to the individual after seeing the hardcore scene had become so violent. Minor Threat fan Guy Picciotto formed Rites of Spring in 1984, switching hardcore punks key characteristics for melodic guitars, varied rhythms and personal, impassioned lyrics.. There are different types of emo music, which include emotive hardcore, Midwest emo (often known as indie rock post-emo), hardcore emo, screamo, and emoviolence. As the decades passed, emo music took out and included different characteristics, creating new sub-genres. Many emo and screamo bands are: Rites of Spring, Embrace, Dag Nasty, Drive Like Jehu, American Football, City of Caterpillar, Circle Takes The Square, Jawbreaker, Heroin, Hot Water Music, Sunny Day Real Estate, Indian Summer, Jets to Brazil, Braid, Saetia, Cap'n Jazz, Mineral, I Hate Myself, The Academy Is..., Saves the Day and Empire! Empire! (I Was a Lonely Estate). Emo bands often can be heard live. Some bands travel here and there -- usually on a very low budget. As part of the emo culture, commercialism is highly frowned upon. Live “emo shows” are very cheap -- usually around $5 or less. Technology also is somewhat frowned upon. Recordings of emo music tend to be low budget, and copies of the music tend to be analog or sold on outdated media. True to the non-commercialism ideals emo bands sell their music very cheaply around $5 or so, and most bands do not sell t-shirts. So instead, you may DIY your own and comply with the DIY ethic. Live emo bands often play with their backs to the audience during the slow parts of the song. Then they explode by screaming and jumping around during the faster-paced parts, usually knocking things over as they go. These antics obviously have an affect on the audience as the audience responds in dance. Be spontaneous. The basis of emo is that you can express yourself in whatever way you wish through dance. Really feel the music, and then move in whatever way your body wants. “Freestyling” is spontaneous by nature, so nothing needs to be well-thought out, planned, or choreographed. Just move. If you are having trouble “letting go” so that you can move spontaneously, let the music drive you. In “emo dance” quick jerky shoulder, leg and arm movements are common. So, if your movements seem off-beat or spastic, don’t worry about it. Think about your frustration or angst. Stop for a moment and tune everything out but the music. Think about all you’ve endured and move your body. It’s better if you don’t let your mind get in the way and think too much. You may incorporate some elements of slam dancing and moshing. What most people think of as hard-core violent slam dancing, as its name implies, doesn’t really occur in emo dancing. Some would say that slam dancing shouldn’t be violent at all. Back in the 70s and 80s when it was created, slam dancing was basically jumping around without doing any real dance moves. It was never purposely violent. ”Mosh” in the pit. ”Moshing” is the new term for slam dancing, but it’s actually different. Slam dancing is jumping around. Moshing is dancing and jumping aggressively in a tightly-packed group of people at a live event. Since people are so close together, bumping into other people is inevitable. “Moshing” to emo music is generally less dramatic than at heavy metal and traditional punk rock concerts. Repeat movements. Once you started dancing, repeat the movements. It’s not necessary to switch dance steps or movements. Freestyling is often awkward and repetitive. As you begin to feel the music and move, if you find yourself rocking back-and-forth or jumping on your toes -- common “emo dance” movements -- keep going. Think of your movements as an expression of your feelings. It’s kind of the way that a child might scribble on a page without staying in the lines -- back and forth. The back-and-forth movements are an expression of the child’s energy and emotions whether sad or happy. For you, your entire body is a tool to create those gestural, often rapid repetitive movements that are generated by emotion. These movements should be carefree, expressive and intense. So, keep doing it until you feel like doing something else. Point your index  fingers. Emo dancing often involves finger pointing -- both at yourself and others. Don’t feel that you have to limit yourself to standing up or any other position. Since this is freestyle, anything goes -- even laying on the ground and shaking. Move faster. Dance harder. In emo, the more you feel the music, the faster you should be moving and the harder your movements should be. So, if you’re feeling it, let those emotions transmit through the body. Bob your head faster on beat with the music -- or not. Bounce higher on your toes as the music moves you. Throw your elbows. Doing the Emo Trembler Clasp your hands together. Either you can interlock your fingers together or you can clasp them together by forming the fingers in each hand into a claw shape and then cupping them together. Traditionally, this described as a hand gesture that people make when they are nervous or anxious. Lean forward and bounce on the balls of your feet. You don’t need to bounce in any particular way. Just shift your weight to the balls of your feet and bounce up and down. Do this the same way that you would tap your knee or foot when you like a certain music and your body seems to automatically respond. Same here: bounce. Remember that you should be feeling the music and moving in a carefree manner as you move in true emo fashion. Move your torso up and down. If you have already leaned forward, move your torso back. Then, move it forward again, and continue to repeat this motion. The movement should be done energetically and intensely -- not without emotion or feeling. Some people appear to rocking back-and-forth almost violently when they do this. Doing the Chest Tap Start to bounce to the music. Bend your knees a bit, but shift your weight to the balls of your feet. Let the energy flow from your feet and explode out as you bounce up and down. In other words, this should be an energetic bounce, not a calm and casual bounce. Bend your elbows so that your arm forms an L-shape. Or, you can bend the arm even closer to the body so that the arms makes the shape of a triangle. Swing your arms with energy and gusto to the beat. This can be in tempo with your bounce, but it can also be off-beat and to its own separate tempo. In other words, the two movements don’t need to be in sync with each other. It can be wild and chaotic. Point your fingers. With your index finger, start to point at yourself or point outwardly away from the body. Repeat the movement. Keep pointing as you bounce and swing your arms. Increase the pace, and point more rapidly and energetically. The more you are feeling the music, the more enthusiastic and quick-paced the pointing should be.",
    "sentences": [
        " Freestyling Express yourself.",
        "Emo, which is short for “emotive hardcore” is music scene which stems from the Washington D.C. hardcore punk subculture.",
        "It's exactly what it sounds like; less angry version of punk rock music with emotional lyrics.",
        "Makers and listeners of this type of music use it to express their feelings.",
        "Lyrics usually convey non-metaphorical messages about happiness, sadness, depression, death, anger and despair.",
        "Learn what you're dancing to.",
        "Emo was formed when Ian Mackaye of Minor Threat turned the focus of the music community back to the individual after seeing the hardcore scene had become so violent.",
        "Minor Threat fan Guy Picciotto formed Rites of Spring in 1984, switching hardcore punks key characteristics for melodic guitars, varied rhythms and personal, impassioned lyrics..",
        "There are different types of emo music, which include emotive hardcore, Midwest emo (often known as indie rock post-emo), hardcore emo, screamo, and emoviolence.",
        "As the decades passed, emo music took out and included different characteristics, creating new sub-genres.",
        "Many emo and screamo bands are: Rites of Spring, Embrace, Dag Nasty, Drive Like Jehu, American Football, City of Caterpillar, Circle Takes The Square, Jawbreaker, Heroin, Hot Water Music, Sunny Day Real Estate, Indian Summer, Jets to Brazil, Braid, Saetia, Cap'n Jazz, Mineral, I Hate Myself, The Academy Is..., Saves the Day and Empire!",
        "Empire!",
        "(I Was a Lonely Estate).",
        "Emo bands often can be heard live.",
        "Some bands travel here and there -- usually on a very low budget.",
        "As part of the emo culture, commercialism is highly frowned upon.",
        "Live “emo shows” are very cheap -- usually around $5 or less.",
        "Technology also is somewhat frowned upon.",
        "Recordings of emo music tend to be low budget, and copies of the music tend to be analog or sold on outdated media.",
        "True to the non-commercialism ideals emo bands sell their music very cheaply around $5 or so, and most bands do not sell t-shirts.",
        "So instead, you may DIY your own and comply with the DIY ethic.",
        "Live emo bands often play with their backs to the audience during the slow parts of the song.",
        "Then they explode by screaming and jumping around during the faster-paced parts, usually knocking things over as they go.",
        "These antics obviously have an affect on the audience as the audience responds in dance.",
        "Be spontaneous.",
        "The basis of emo is that you can express yourself in whatever way you wish through dance.",
        "Really feel the music, and then move in whatever way your body wants.",
        "“Freestyling” is spontaneous by nature, so nothing needs to be well-thought out, planned, or choreographed.",
        "Just move.",
        "If you are having trouble “letting go” so that you can move spontaneously, let the music drive you.",
        "In “emo dance” quick jerky shoulder, leg and arm movements are common.",
        "So, if your movements seem off-beat or spastic, don’t worry about it.",
        "Think about your frustration or angst.",
        "Stop for a moment and tune everything out but the music.",
        "Think about all you’ve endured and move your body.",
        "It’s better if you don’t let your mind get in the way and think too much.",
        "You may incorporate some elements of slam dancing and moshing.",
        "What most people think of as hard-core violent slam dancing, as its name implies, doesn’t really occur in emo dancing.",
        "Some would say that slam dancing shouldn’t be violent at all.",
        "Back in the 70s and 80s when it was created, slam dancing was basically jumping around without doing any real dance moves.",
        "It was never purposely violent.",
        "”Mosh” in the pit.",
        "”Moshing” is the new term for slam dancing, but it’s actually different.",
        "Slam dancing is jumping around.",
        "Moshing is dancing and jumping aggressively in a tightly-packed group of people at a live event.",
        "Since people are so close together, bumping into other people is inevitable.",
        "“Moshing” to emo music is generally less dramatic than at heavy metal and traditional punk rock concerts.",
        "Repeat movements.",
        "Once you started dancing, repeat the movements.",
        "It’s not necessary to switch dance steps or movements.",
        "Freestyling is often awkward and repetitive.",
        "As you begin to feel the music and move, if you find yourself rocking back-and-forth or jumping on your toes -- common “emo dance” movements -- keep going.",
        "Think of your movements as an expression of your feelings.",
        "It’s kind of the way that a child might scribble on a page without staying in the lines -- back and forth.",
        "The back-and-forth movements are an expression of the child’s energy and emotions whether sad or happy.",
        "For you, your entire body is a tool to create those gestural, often rapid repetitive movements that are generated by emotion.",
        "These movements should be carefree, expressive and intense.",
        "So, keep doing it until you feel like doing something else.",
        "Point your index  fingers.",
        "Emo dancing often involves finger pointing -- both at yourself and others.",
        "Don’t feel that you have to limit yourself to standing up or any other position.",
        "Since this is freestyle, anything goes -- even laying on the ground and shaking.",
        "Move faster.",
        "Dance harder.",
        "In emo, the more you feel the music, the faster you should be moving and the harder your movements should be.",
        "So, if you’re feeling it, let those emotions transmit through the body.",
        "Bob your head faster on beat with the music -- or not.",
        "Bounce higher on your toes as the music moves you.",
        "Throw your elbows.",
        "Doing the Emo Trembler Clasp your hands together.",
        "Either you can interlock your fingers together or you can clasp them together by forming the fingers in each hand into a claw shape and then cupping them together.",
        "Traditionally, this described as a hand gesture that people make when they are nervous or anxious.",
        "Lean forward and bounce on the balls of your feet.",
        "You don’t need to bounce in any particular way.",
        "Just shift your weight to the balls of your feet and bounce up and down.",
        "Do this the same way that you would tap your knee or foot when you like a certain music and your body seems to automatically respond.",
        "Same here: bounce.",
        "Remember that you should be feeling the music and moving in a carefree manner as you move in true emo fashion.",
        "Move your torso up and down.",
        "If you have already leaned forward, move your torso back.",
        "Then, move it forward again, and continue to repeat this motion.",
        "The movement should be done energetically and intensely -- not without emotion or feeling.",
        "Some people appear to rocking back-and-forth almost violently when they do this.",
        "Doing the Chest Tap Start to bounce to the music.",
        "Bend your knees a bit, but shift your weight to the balls of your feet.",
        "Let the energy flow from your feet and explode out as you bounce up and down.",
        "In other words, this should be an energetic bounce, not a calm and casual bounce.",
        "Bend your elbows so that your arm forms an L-shape.",
        "Or, you can bend the arm even closer to the body so that the arms makes the shape of a triangle.",
        "Swing your arms with energy and gusto to the beat.",
        "This can be in tempo with your bounce, but it can also be off-beat and to its own separate tempo.",
        "In other words, the two movements don’t need to be in sync with each other.",
        "It can be wild and chaotic.",
        "Point your fingers.",
        "With your index finger, start to point at yourself or point outwardly away from the body.",
        "Repeat the movement.",
        "Keep pointing as you bounce and swing your arms.",
        "Increase the pace, and point more rapidly and energetically.",
        "The more you are feeling the music, the more enthusiastic and quick-paced the pointing should be."
    ]
}