{
    "title": "How to Apply Feminine Makeup",
    "url": "https://www.wikihow.com/Apply-Feminine-Makeup",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Makeup",
        "Makeup Styles"
    ],
    "steps": [
        {
            "headline": "Apply a yellow-based sheer water-based liquid foundation to areas with discoloration.",
            "description": ""
        },
        {
            "headline": "Apply a concealer to areas with discoloration, fine lines, dark circles, or pimples.",
            "description": "Use a green based concealer for pimples and a peach based concealer for dark circles."
        },
        {
            "headline": "Apply a sheer yellow-based powder to face lightly with a large brush, concentrating on shiny areas.",
            "description": ""
        },
        {
            "headline": "Apply a powder blush to the apples of the cheeks where you are naturally flush.",
            "description": "Use a rose colored tint for fair skin and a peach colored tint for tan skin."
        },
        {
            "headline": "Apply a sheer liquid highlighter to the top of your cheekbones and under your eyebrows using a light touch.",
            "description": ""
        },
        {
            "headline": "Apply a neutral eyeshadow to the entire eyelid.",
            "description": "Use recommended tones."
        },
        {
            "headline": "Apply a slightly lighter shadow to the inner corner of the eye.",
            "description": ""
        },
        {
            "headline": "Apply a slightly darker shadow to the crease of the eye.",
            "description": ""
        },
        {
            "headline": "Apply light eyeliner in brown or black depending on skin or hair color to the top lash line and very sparingly to the bottom lash line.",
            "description": "Do not pull your lid out while applying; it will create wrinkles!"
        },
        {
            "headline": "Apply however many coats you would like of lengthening or voluminous mascara, to top lashes.",
            "description": "Apply a thin coat to the bottom lashes if you'd like. (Bottom lash mascara is optional; not everyone is for the look.)"
        },
        {
            "headline": "Apply a lip gloss or sheer lipstick.",
            "description": "Use recommended tones."
        },
        {
            "headline": "Finished.",
            "description": ""
        }
    ],
    "tyn": [
        "Concealer",
        "Foundation",
        "Powder",
        "Blush",
        "Highlighter",
        "Eyeshadow (3 shades minimum)",
        "Eyeliner",
        "Mascara",
        "Lip gloss/lipstick"
    ],
    "text": " Apply a yellow-based sheer water-based liquid foundation to areas with discoloration.  Apply a concealer to areas with discoloration, fine lines, dark circles, or pimples. Use a green based concealer for pimples and a peach based concealer for dark circles. Apply a sheer yellow-based powder to face lightly with a large brush, concentrating on shiny areas.  Apply a powder blush to the apples of the cheeks where you are naturally flush. Use a rose colored tint for fair skin and a peach colored tint for tan skin. Apply a sheer liquid highlighter to the top of your cheekbones and under your eyebrows using a light touch.  Apply a neutral eyeshadow to the entire eyelid. Use recommended tones. Apply a slightly lighter shadow to the inner corner of the eye.  Apply a slightly darker shadow to the crease of the eye.  Apply light eyeliner in brown or black depending on skin or hair color to the top lash line and very sparingly to the bottom lash line. Do not pull your lid out while applying; it will create wrinkles! Apply however many coats you would like of lengthening or voluminous mascara, to top lashes. Apply a thin coat to the bottom lashes if you'd like. (Bottom lash mascara is optional; not everyone is for the look.) Apply a lip gloss or sheer lipstick. Use recommended tones. Finished. ",
    "sentences": [
        " Apply a yellow-based sheer water-based liquid foundation to areas with discoloration.",
        "Apply a concealer to areas with discoloration, fine lines, dark circles, or pimples.",
        "Use a green based concealer for pimples and a peach based concealer for dark circles.",
        "Apply a sheer yellow-based powder to face lightly with a large brush, concentrating on shiny areas.",
        "Apply a powder blush to the apples of the cheeks where you are naturally flush.",
        "Use a rose colored tint for fair skin and a peach colored tint for tan skin.",
        "Apply a sheer liquid highlighter to the top of your cheekbones and under your eyebrows using a light touch.",
        "Apply a neutral eyeshadow to the entire eyelid.",
        "Use recommended tones.",
        "Apply a slightly lighter shadow to the inner corner of the eye.",
        "Apply a slightly darker shadow to the crease of the eye.",
        "Apply light eyeliner in brown or black depending on skin or hair color to the top lash line and very sparingly to the bottom lash line.",
        "Do not pull your lid out while applying; it will create wrinkles!",
        "Apply however many coats you would like of lengthening or voluminous mascara, to top lashes.",
        "Apply a thin coat to the bottom lashes if you'd like.",
        "(Bottom lash mascara is optional; not everyone is for the look.)",
        "Apply a lip gloss or sheer lipstick.",
        "Use recommended tones.",
        "Finished."
    ]
}