{
    "title": "How to Manage Your Time Wisely As a High School Student",
    "url": "https://www.wikihow.com/Manage-Your-Time-Wisely-As-a-High-School-Student",
    "category_hierarchy": [
        "Youth",
        "School Stuff",
        "Surviving School",
        "Surviving High School"
    ],
    "methods": [
        {
            "name": "Figuring out Your Priorities",
            "steps": [
                {
                    "headline": "Brainstorm some long-term goals.",
                    "description": "When you understand what your long-term goals are, you can determine how best to prioritize your time in high school to accomplish those goals. Write down a list of things you may be interested in doing, then read and research what careers in those fields involve. Narrow your list down until you have identified the career you’d like to pursue, as well as other things you’d like to do, like traveling or learning a language. For example, you may want to become a computer programmer when you grow up. To that end, you may want to pursue computer programming electives. Knowing the opportunities you want to pursue will help you prioritize what you spend your time on. Don’t worry if you don't think you have the \"right\" answer. You can change or adjust your goals at any time."
                },
                {
                    "headline": "Formulate short-term goals by learning how to accomplish your long-term goals.",
                    "description": "Research the steps it takes to achieve your long-term goals by talking to professionals who have achieved those goals and searching the Internet for information. Then determine what you can do in high school to start taking those steps. Make your short-term goals with both high school and college in mind. Make sure that your grades and extracurriculars match the undergraduate, vocational, or other post high school programs you intend to apply for. If you want to be an engineer, and discover that you can take engineering electives starting in your junior year if you have a certain GPA, then an immediate short-term goal might be to earn that GPA."
                },
                {
                    "headline": "Write your long-term and short-term goals down on paper.",
                    "description": "Then tack the sheet of paper up somewhere where you can see it every day. This will help you understand how you need to organize your time and motivate you to do so. Refer to your long-term goals periodically to help keep yourself focused on priority activities. Your short term goals should be action-oriented, and precise. A good example of a short-term goal is to “earn a 90 or higher in sophomore Chemistry,” while a bad example is to “ace all my classes.”\nBy thinking through and writing down what it takes to achieve your goals, you’ll have a good sense of how to manage your time appropriately."
                }
            ]
        },
        {
            "name": "Maximizing Your Class Time",
            "steps": [
                {
                    "headline": "Sit in front of the class.",
                    "description": "Doing so will help you concentrate on the lesson and avoid distractions, as less motivated students tend to cluster in the back. It will also send a signal to your teacher that you are engaged in the class. Not every high school has flexible seating because letting students sit where they want sometimes results in discipline problems. However, take advantage of the opportunity to sit in front if you have it. If you’ve been assigned a seat in the back row, respectfully ask your teacher for a seat closer to the front. Chances are they’ll accommodate you!"
                },
                {
                    "headline": "Participate in class discussions.",
                    "description": "You don’t have to have the right answer. But by asking a question or sharing a thought, you can not only raise your standing with the teacher, but also inspire others to participate and learn more. Ask for help when you don’t understand something. Your teacher is there to help you learn but they can’t help if they don’t know that you’re struggling. And if you ask a question about a difficult subject, there’s a good chance someone else is struggling with it too."
                },
                {
                    "headline": "Take notes clearly and legibly.",
                    "description": "Make sure you put the date and the topic at the top of each page of notes for easy reference. Jot down the main points, paying special attention to items the teacher emphasizes or repeats. The last thing you want to do when the teacher announces there’ll be a quiz tomorrow is to have a hard time finding your study materials! Keep your notes and handouts organized. Make sure to keep your notes arranged neatly in your folder or binder for easy access. Keep separate folders – one for each subject – to keep track of your class notes. Avoid writing down every single word. Listen for the statements the teacher repeats or indicates are important and prioritize recording that information. Also, use abbreviations when necessary."
                }
            ]
        },
        {
            "name": "Completing Homework and Studying for Tests",
            "steps": [
                {
                    "headline": "Find a quiet study space.",
                    "description": "Choose a comfortable, distraction-free location that has enough space for all of your materials. To keep yourself motivated, you may want to decorate it with items that keep you inspired. Consider keeping a wall calendar of your assignments and other projects in your study space. Cross off items that you’ve completed. Being able to visualize your progress can be tremendously motivational."
                },
                {
                    "headline": "Complete next-day assignments as soon as you get home.",
                    "description": "Start with the one you least want to do. Getting that first dreaded assignment out of the way will give you a confidence boost and make the rest of your assignments seem more manageable by comparison. You should focus on these assignments before longer-term assignments. Otherwise, you may spend so much time on a project that you lose track of time. You don’t want to be scrambling to complete homework due the next day when it’s time for bed."
                },
                {
                    "headline": "Break weekly projects into small tasks and do one each day.",
                    "description": "If you receive an assignment on Monday that’s due Friday, begin some of the work immediately rather than putting it off. Doing this will lessen any anxiety you may feel about the scope of the project, as well as help you catch mistakes you may have made. Breaking down assignments into smaller chunks also helps you adjust in case your week is disrupted. If you start your assignment on Monday, get some of it done on Tuesday, but lose time on Wednesday due to an emergency, you still have Thursday to make up the rest of it. If, on the other hand, you procrastinate and leave it all to Thursday night, you may be facing an all-nighter."
                },
                {
                    "headline": "Take advantage of weekends to work on long-term assignments.",
                    "description": "For projects that are due two or more weeks away, devote a couple of hours a weekend to work on them. Don’t worry – you can still sleep in! But by taking an afternoon and spending an hour or two to work on your project, you’ll get it done sooner. You’ll also avoid leaving it to the last minute. The longer the period the teacher gives you to complete the assignment, the higher the quality they expect. Using weekends will give you the time you need to perfect your project."
                },
                {
                    "headline": "Study for quizzes and tests as soon as your teacher announces them.",
                    "description": "The evening after a test or quiz is announced in class, spend at least a half an hour creating flashcards, identifying or making up practice problems, creating sample prompts for essay tests, or organizing your notes in a manner that makes it easy to study. Spend at least a half an hour each night studying for quizzes, and at least 45 minutes studying for tests. One way to organize your notes for easy studying is to organize them by topic. Then focus on one topic each evening. Many math textbooks contain the answers for some of the textbook problems in the back of the book. Practice these to prepare yourself for math tests."
                }
            ]
        },
        {
            "name": "Finding Time for Extracurricular and Social Activities",
            "steps": [
                {
                    "headline": "Get a daily planner and use it to schedule your time each week.",
                    "description": "Devote a certain number of minutes each day to homework assignments, to studying, to chores, and to extracurriculars. Writing down how you’ll spend your time at the start of each week will help you adjust to unanticipated circumstances without impacting all of your other responsibilities. When planning your weekly activities, start with your homework, studying and household chores. Plan extracurricular and recreational activities around your core responsibilities. When you are approaching test time, increase your study time enough to do well on your tests."
                },
                {
                    "headline": "Limit your screen time.",
                    "description": "Restrict the time spent in front of the television or browsing on your smartphone to no more than two hours per night to leave room for your homework, studying, and extracurricular activities. Television and social media can be very entertaining – and very distracting, so keep it to a minimum. It may be helpful to designate specific times to watch television or surf the web in your planner. Visualizing this limited block of time may help keep you focused."
                },
                {
                    "headline": "Finish as much schoolwork as you can during the weekdays.",
                    "description": "This way, you have more time to hang out with friends and participate in extracurricular activities on the weekend. You’ll also enjoy yourself way more if you don’t have assignments hanging over your head. Your high school years shouldn’t just be about your schoolwork. If you’re stressing about schoolwork, you’re not enjoying yourself. So get your work out of the way early, then go have fun!"
                },
                {
                    "headline": "Coordinate your schedule with your friends’ schedules.",
                    "description": "Unless Dad says so, there’s no hard and fast rule that your math homework has to be done between 4:00pm and 4:30pm. Ask your friends when they have free time and schedule your free time to coincide with theirs. Make sure you leave enough time to study though! Your friends are probably going through a similar scheduling process. Lock in some time for you all to hang out so you don’t miss out!"
                },
                {
                    "headline": "Avoid joining too many extracurricular activities.",
                    "description": "Join 1 to 3 extracurricular activities that will help you achieve your short-term and long-term goals and that you find most enjoyable. Don’t join every single club or team that catches your interest, or you’ll have little time to do other things. Keep your goals in mind when choosing between possible extracurricular activities. High school can be very stressful at times, but keeping your goals in mind can help keep you motivated. Doing so can also help you see what you should be spending your time on – and what things you should stop doing."
                },
                {
                    "headline": "Schedule time to unwind.",
                    "description": "Add a block of time in your planner to veg out in front of the TV, take a long bath, or engage in other calming activities. While extracurriculars can be enjoyable, they also usually involve hard work. Everyone needs some downtime to relax and recharge. Neglecting that time may lead to boredom, frustration, and anxiety – all of which may make it harder to focus on your work. Try drawing, coloring, or journaling to relax. Meditation is another time-tested technique that can help relieve you of stress. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlyssa Chang\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWellness + Nutrition Coach and Trainer\t\t\t\t\t\t\t\tAlyssa Chang is a nutrition coach and trainer, based in the San Francisco Bay Area. She uses her extensive background in brain-based neuroscience to work with clients on improving their connections with their brain and body to heal, reach goals, and move pain-free. She holds a BS in Kinesiology and Exercise, Nutrition and Wellness from the California State University, East Bay and is certified in Precision Nutrition, Z-health Performance and is certified by the National Council for Strength and Fitness. Alyssa Chang\t\t\tWellness + Nutrition Coach and Trainer\t\t\t\tIn addition to relieving stress, meditation can help you feel more grateful. Meditation is one of the most profound ways to be present and experience gratitude for what you have."
                }
            ]
        }
    ],
    "tyn": [
        "A Daily Planner",
        "Folders for Class Notes",
        "Paper and Pens"
    ],
    "text": " Figuring out Your Priorities Brainstorm some long-term goals. When you understand what your long-term goals are, you can determine how best to prioritize your time in high school to accomplish those goals. Write down a list of things you may be interested in doing, then read and research what careers in those fields involve. Narrow your list down until you have identified the career you’d like to pursue, as well as other things you’d like to do, like traveling or learning a language. For example, you may want to become a computer programmer when you grow up. To that end, you may want to pursue computer programming electives. Knowing the opportunities you want to pursue will help you prioritize what you spend your time on. Don’t worry if you don't think you have the \"right\" answer. You can change or adjust your goals at any time. Formulate short-term goals by learning how to accomplish your long-term goals. Research the steps it takes to achieve your long-term goals by talking to professionals who have achieved those goals and searching the Internet for information. Then determine what you can do in high school to start taking those steps. Make your short-term goals with both high school and college in mind. Make sure that your grades and extracurriculars match the undergraduate, vocational, or other post high school programs you intend to apply for. If you want to be an engineer, and discover that you can take engineering electives starting in your junior year if you have a certain GPA, then an immediate short-term goal might be to earn that GPA. Write your long-term and short-term goals down on paper. Then tack the sheet of paper up somewhere where you can see it every day. This will help you understand how you need to organize your time and motivate you to do so. Refer to your long-term goals periodically to help keep yourself focused on priority activities. Your short term goals should be action-oriented, and precise. A good example of a short-term goal is to “earn a 90 or higher in sophomore Chemistry,” while a bad example is to “ace all my classes.”\nBy thinking through and writing down what it takes to achieve your goals, you’ll have a good sense of how to manage your time appropriately. Maximizing Your Class Time Sit in front of the class. Doing so will help you concentrate on the lesson and avoid distractions, as less motivated students tend to cluster in the back. It will also send a signal to your teacher that you are engaged in the class. Not every high school has flexible seating because letting students sit where they want sometimes results in discipline problems. However, take advantage of the opportunity to sit in front if you have it. If you’ve been assigned a seat in the back row, respectfully ask your teacher for a seat closer to the front. Chances are they’ll accommodate you! Participate in class discussions. You don’t have to have the right answer. But by asking a question or sharing a thought, you can not only raise your standing with the teacher, but also inspire others to participate and learn more. Ask for help when you don’t understand something. Your teacher is there to help you learn but they can’t help if they don’t know that you’re struggling. And if you ask a question about a difficult subject, there’s a good chance someone else is struggling with it too. Take notes clearly and legibly. Make sure you put the date and the topic at the top of each page of notes for easy reference. Jot down the main points, paying special attention to items the teacher emphasizes or repeats. The last thing you want to do when the teacher announces there’ll be a quiz tomorrow is to have a hard time finding your study materials! Keep your notes and handouts organized. Make sure to keep your notes arranged neatly in your folder or binder for easy access. Keep separate folders – one for each subject – to keep track of your class notes. Avoid writing down every single word. Listen for the statements the teacher repeats or indicates are important and prioritize recording that information. Also, use abbreviations when necessary. Completing Homework and Studying for Tests Find a quiet study space. Choose a comfortable, distraction-free location that has enough space for all of your materials. To keep yourself motivated, you may want to decorate it with items that keep you inspired. Consider keeping a wall calendar of your assignments and other projects in your study space. Cross off items that you’ve completed. Being able to visualize your progress can be tremendously motivational. Complete next-day assignments as soon as you get home. Start with the one you least want to do. Getting that first dreaded assignment out of the way will give you a confidence boost and make the rest of your assignments seem more manageable by comparison. You should focus on these assignments before longer-term assignments. Otherwise, you may spend so much time on a project that you lose track of time. You don’t want to be scrambling to complete homework due the next day when it’s time for bed. Break weekly projects into small tasks and do one each day. If you receive an assignment on Monday that’s due Friday, begin some of the work immediately rather than putting it off. Doing this will lessen any anxiety you may feel about the scope of the project, as well as help you catch mistakes you may have made. Breaking down assignments into smaller chunks also helps you adjust in case your week is disrupted. If you start your assignment on Monday, get some of it done on Tuesday, but lose time on Wednesday due to an emergency, you still have Thursday to make up the rest of it. If, on the other hand, you procrastinate and leave it all to Thursday night, you may be facing an all-nighter. Take advantage of weekends to work on long-term assignments. For projects that are due two or more weeks away, devote a couple of hours a weekend to work on them. Don’t worry – you can still sleep in! But by taking an afternoon and spending an hour or two to work on your project, you’ll get it done sooner. You’ll also avoid leaving it to the last minute. The longer the period the teacher gives you to complete the assignment, the higher the quality they expect. Using weekends will give you the time you need to perfect your project. Study for quizzes and tests as soon as your teacher announces them. The evening after a test or quiz is announced in class, spend at least a half an hour creating flashcards, identifying or making up practice problems, creating sample prompts for essay tests, or organizing your notes in a manner that makes it easy to study. Spend at least a half an hour each night studying for quizzes, and at least 45 minutes studying for tests. One way to organize your notes for easy studying is to organize them by topic. Then focus on one topic each evening. Many math textbooks contain the answers for some of the textbook problems in the back of the book. Practice these to prepare yourself for math tests. Finding Time for Extracurricular and Social Activities Get a daily planner and use it to schedule your time each week. Devote a certain number of minutes each day to homework assignments, to studying, to chores, and to extracurriculars. Writing down how you’ll spend your time at the start of each week will help you adjust to unanticipated circumstances without impacting all of your other responsibilities. When planning your weekly activities, start with your homework, studying and household chores. Plan extracurricular and recreational activities around your core responsibilities. When you are approaching test time, increase your study time enough to do well on your tests. Limit your screen time. Restrict the time spent in front of the television or browsing on your smartphone to no more than two hours per night to leave room for your homework, studying, and extracurricular activities. Television and social media can be very entertaining – and very distracting, so keep it to a minimum. It may be helpful to designate specific times to watch television or surf the web in your planner. Visualizing this limited block of time may help keep you focused. Finish as much schoolwork as you can during the weekdays. This way, you have more time to hang out with friends and participate in extracurricular activities on the weekend. You’ll also enjoy yourself way more if you don’t have assignments hanging over your head. Your high school years shouldn’t just be about your schoolwork. If you’re stressing about schoolwork, you’re not enjoying yourself. So get your work out of the way early, then go have fun! Coordinate your schedule with your friends’ schedules. Unless Dad says so, there’s no hard and fast rule that your math homework has to be done between 4:00pm and 4:30pm. Ask your friends when they have free time and schedule your free time to coincide with theirs. Make sure you leave enough time to study though! Your friends are probably going through a similar scheduling process. Lock in some time for you all to hang out so you don’t miss out! Avoid joining too many extracurricular activities. Join 1 to 3 extracurricular activities that will help you achieve your short-term and long-term goals and that you find most enjoyable. Don’t join every single club or team that catches your interest, or you’ll have little time to do other things. Keep your goals in mind when choosing between possible extracurricular activities. High school can be very stressful at times, but keeping your goals in mind can help keep you motivated. Doing so can also help you see what you should be spending your time on – and what things you should stop doing. Schedule time to unwind. Add a block of time in your planner to veg out in front of the TV, take a long bath, or engage in other calming activities. While extracurriculars can be enjoyable, they also usually involve hard work. Everyone needs some downtime to relax and recharge. Neglecting that time may lead to boredom, frustration, and anxiety – all of which may make it harder to focus on your work. Try drawing, coloring, or journaling to relax. Meditation is another time-tested technique that can help relieve you of stress. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlyssa Chang\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWellness + Nutrition Coach and Trainer\t\t\t\t\t\t\t\tAlyssa Chang is a nutrition coach and trainer, based in the San Francisco Bay Area. She uses her extensive background in brain-based neuroscience to work with clients on improving their connections with their brain and body to heal, reach goals, and move pain-free. She holds a BS in Kinesiology and Exercise, Nutrition and Wellness from the California State University, East Bay and is certified in Precision Nutrition, Z-health Performance and is certified by the National Council for Strength and Fitness. Alyssa Chang\t\t\tWellness + Nutrition Coach and Trainer\t\t\t\tIn addition to relieving stress, meditation can help you feel more grateful. Meditation is one of the most profound ways to be present and experience gratitude for what you have.",
    "sentences": [
        " Figuring out Your Priorities Brainstorm some long-term goals.",
        "When you understand what your long-term goals are, you can determine how best to prioritize your time in high school to accomplish those goals.",
        "Write down a list of things you may be interested in doing, then read and research what careers in those fields involve.",
        "Narrow your list down until you have identified the career you’d like to pursue, as well as other things you’d like to do, like traveling or learning a language.",
        "For example, you may want to become a computer programmer when you grow up.",
        "To that end, you may want to pursue computer programming electives.",
        "Knowing the opportunities you want to pursue will help you prioritize what you spend your time on.",
        "Don’t worry if you don't think you have the \"right\" answer.",
        "You can change or adjust your goals at any time.",
        "Formulate short-term goals by learning how to accomplish your long-term goals.",
        "Research the steps it takes to achieve your long-term goals by talking to professionals who have achieved those goals and searching the Internet for information.",
        "Then determine what you can do in high school to start taking those steps.",
        "Make your short-term goals with both high school and college in mind.",
        "Make sure that your grades and extracurriculars match the undergraduate, vocational, or other post high school programs you intend to apply for.",
        "If you want to be an engineer, and discover that you can take engineering electives starting in your junior year if you have a certain GPA, then an immediate short-term goal might be to earn that GPA.",
        "Write your long-term and short-term goals down on paper.",
        "Then tack the sheet of paper up somewhere where you can see it every day.",
        "This will help you understand how you need to organize your time and motivate you to do so.",
        "Refer to your long-term goals periodically to help keep yourself focused on priority activities.",
        "Your short term goals should be action-oriented, and precise.",
        "A good example of a short-term goal is to “earn a 90 or higher in sophomore Chemistry,” while a bad example is to “ace all my classes.”\nBy thinking through and writing down what it takes to achieve your goals, you’ll have a good sense of how to manage your time appropriately.",
        "Maximizing Your Class Time Sit in front of the class.",
        "Doing so will help you concentrate on the lesson and avoid distractions, as less motivated students tend to cluster in the back.",
        "It will also send a signal to your teacher that you are engaged in the class.",
        "Not every high school has flexible seating because letting students sit where they want sometimes results in discipline problems.",
        "However, take advantage of the opportunity to sit in front if you have it.",
        "If you’ve been assigned a seat in the back row, respectfully ask your teacher for a seat closer to the front.",
        "Chances are they’ll accommodate you!",
        "Participate in class discussions.",
        "You don’t have to have the right answer.",
        "But by asking a question or sharing a thought, you can not only raise your standing with the teacher, but also inspire others to participate and learn more.",
        "Ask for help when you don’t understand something.",
        "Your teacher is there to help you learn but they can’t help if they don’t know that you’re struggling.",
        "And if you ask a question about a difficult subject, there’s a good chance someone else is struggling with it too.",
        "Take notes clearly and legibly.",
        "Make sure you put the date and the topic at the top of each page of notes for easy reference.",
        "Jot down the main points, paying special attention to items the teacher emphasizes or repeats.",
        "The last thing you want to do when the teacher announces there’ll be a quiz tomorrow is to have a hard time finding your study materials!",
        "Keep your notes and handouts organized.",
        "Make sure to keep your notes arranged neatly in your folder or binder for easy access.",
        "Keep separate folders – one for each subject – to keep track of your class notes.",
        "Avoid writing down every single word.",
        "Listen for the statements the teacher repeats or indicates are important and prioritize recording that information.",
        "Also, use abbreviations when necessary.",
        "Completing Homework and Studying for Tests Find a quiet study space.",
        "Choose a comfortable, distraction-free location that has enough space for all of your materials.",
        "To keep yourself motivated, you may want to decorate it with items that keep you inspired.",
        "Consider keeping a wall calendar of your assignments and other projects in your study space.",
        "Cross off items that you’ve completed.",
        "Being able to visualize your progress can be tremendously motivational.",
        "Complete next-day assignments as soon as you get home.",
        "Start with the one you least want to do.",
        "Getting that first dreaded assignment out of the way will give you a confidence boost and make the rest of your assignments seem more manageable by comparison.",
        "You should focus on these assignments before longer-term assignments.",
        "Otherwise, you may spend so much time on a project that you lose track of time.",
        "You don’t want to be scrambling to complete homework due the next day when it’s time for bed.",
        "Break weekly projects into small tasks and do one each day.",
        "If you receive an assignment on Monday that’s due Friday, begin some of the work immediately rather than putting it off.",
        "Doing this will lessen any anxiety you may feel about the scope of the project, as well as help you catch mistakes you may have made.",
        "Breaking down assignments into smaller chunks also helps you adjust in case your week is disrupted.",
        "If you start your assignment on Monday, get some of it done on Tuesday, but lose time on Wednesday due to an emergency, you still have Thursday to make up the rest of it.",
        "If, on the other hand, you procrastinate and leave it all to Thursday night, you may be facing an all-nighter.",
        "Take advantage of weekends to work on long-term assignments.",
        "For projects that are due two or more weeks away, devote a couple of hours a weekend to work on them.",
        "Don’t worry – you can still sleep in!",
        "But by taking an afternoon and spending an hour or two to work on your project, you’ll get it done sooner.",
        "You’ll also avoid leaving it to the last minute.",
        "The longer the period the teacher gives you to complete the assignment, the higher the quality they expect.",
        "Using weekends will give you the time you need to perfect your project.",
        "Study for quizzes and tests as soon as your teacher announces them.",
        "The evening after a test or quiz is announced in class, spend at least a half an hour creating flashcards, identifying or making up practice problems, creating sample prompts for essay tests, or organizing your notes in a manner that makes it easy to study.",
        "Spend at least a half an hour each night studying for quizzes, and at least 45 minutes studying for tests.",
        "One way to organize your notes for easy studying is to organize them by topic.",
        "Then focus on one topic each evening.",
        "Many math textbooks contain the answers for some of the textbook problems in the back of the book.",
        "Practice these to prepare yourself for math tests.",
        "Finding Time for Extracurricular and Social Activities Get a daily planner and use it to schedule your time each week.",
        "Devote a certain number of minutes each day to homework assignments, to studying, to chores, and to extracurriculars.",
        "Writing down how you’ll spend your time at the start of each week will help you adjust to unanticipated circumstances without impacting all of your other responsibilities.",
        "When planning your weekly activities, start with your homework, studying and household chores.",
        "Plan extracurricular and recreational activities around your core responsibilities.",
        "When you are approaching test time, increase your study time enough to do well on your tests.",
        "Limit your screen time.",
        "Restrict the time spent in front of the television or browsing on your smartphone to no more than two hours per night to leave room for your homework, studying, and extracurricular activities.",
        "Television and social media can be very entertaining – and very distracting, so keep it to a minimum.",
        "It may be helpful to designate specific times to watch television or surf the web in your planner.",
        "Visualizing this limited block of time may help keep you focused.",
        "Finish as much schoolwork as you can during the weekdays.",
        "This way, you have more time to hang out with friends and participate in extracurricular activities on the weekend.",
        "You’ll also enjoy yourself way more if you don’t have assignments hanging over your head.",
        "Your high school years shouldn’t just be about your schoolwork.",
        "If you’re stressing about schoolwork, you’re not enjoying yourself.",
        "So get your work out of the way early, then go have fun!",
        "Coordinate your schedule with your friends’ schedules.",
        "Unless Dad says so, there’s no hard and fast rule that your math homework has to be done between 4:00pm and 4:30pm.",
        "Ask your friends when they have free time and schedule your free time to coincide with theirs.",
        "Make sure you leave enough time to study though!",
        "Your friends are probably going through a similar scheduling process.",
        "Lock in some time for you all to hang out so you don’t miss out!",
        "Avoid joining too many extracurricular activities.",
        "Join 1 to 3 extracurricular activities that will help you achieve your short-term and long-term goals and that you find most enjoyable.",
        "Don’t join every single club or team that catches your interest, or you’ll have little time to do other things.",
        "Keep your goals in mind when choosing between possible extracurricular activities.",
        "High school can be very stressful at times, but keeping your goals in mind can help keep you motivated.",
        "Doing so can also help you see what you should be spending your time on – and what things you should stop doing.",
        "Schedule time to unwind.",
        "Add a block of time in your planner to veg out in front of the TV, take a long bath, or engage in other calming activities.",
        "While extracurriculars can be enjoyable, they also usually involve hard work.",
        "Everyone needs some downtime to relax and recharge.",
        "Neglecting that time may lead to boredom, frustration, and anxiety – all of which may make it harder to focus on your work.",
        "Try drawing, coloring, or journaling to relax.",
        "Meditation is another time-tested technique that can help relieve you of stress.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlyssa Chang\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWellness + Nutrition Coach and Trainer\t\t\t\t\t\t\t\tAlyssa Chang is a nutrition coach and trainer, based in the San Francisco Bay Area.",
        "She uses her extensive background in brain-based neuroscience to work with clients on improving their connections with their brain and body to heal, reach goals, and move pain-free.",
        "She holds a BS in Kinesiology and Exercise, Nutrition and Wellness from the California State University, East Bay and is certified in Precision Nutrition, Z-health Performance and is certified by the National Council for Strength and Fitness.",
        "Alyssa Chang\t\t\tWellness + Nutrition Coach and Trainer\t\t\t\tIn addition to relieving stress, meditation can help you feel more grateful.",
        "Meditation is one of the most profound ways to be present and experience gratitude for what you have."
    ]
}