{
    "title": "How to Make Mugs",
    "url": "https://www.wikihow.com/Make-Mugs",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Clay Projects"
    ],
    "methods": [
        {
            "name": "Getting a Mug",
            "steps": [
                {
                    "headline": "Use a clean, plain ceramic mug if you want to easily decorate it.",
                    "description": "The easiest way to customize your own mug is by finding a plain mug with no writing or images on it. You can purchase a new one from a home supply or thrift store, or repurpose an old mug. Wash your mug with soap and water to ensure it is completely clean before you use it. You can use mugs in colors like white, yellow, or light blue, for example. The lighter the color, the easier it will be to see your design. If you use a dark mug, make sure you have silver or white markers or paint to use. You can purchase mugs at most craft and dollar stores."
                },
                {
                    "headline": "Search online for customizable mugs if you want a ready-made option.",
                    "description": "There are countless websites offering customized mug services. If you want to make a custom mug without any effort, go online and search for “customizable mug.” Select a website, and choose to make a mug with words or images (or both!). Many sites offer a wide variety of options. You can create wraparound photo mugs, photo collage mugs, or mugs with your logo, for example."
                },
                {
                    "headline": "Find classes and workshops online to make your own functional mug.",
                    "description": "To make a food-safe mug, fired clay must be baked at over 2,000 °F (1,090 °C) in a ceramic kiln. Go online and look up \"mug making workshops,\" and browse your options. When you find a class that suits your interests, schedule, and budget, contact them by phone or email to reserve a spot. The class details will explain whether you need to pay in advance or when you arrive. You can either make a slab mug or use a pottery wheel to make your mug. Make sure you arrive on time for the class. If you arrive late, you may not get to attend the session."
                },
                {
                    "headline": "Make a mug out of clay for a decorative option.",
                    "description": "Search online to find mug stencils for making a clay mug, print them out, and cut them out using a pair of scissors. The stencil kit likely comes with a stencil for the mug body, base, and handle. Use a rolling pin to flatten the clay, and roll it out until it is about ⁄4 in (0.64 cm) thick. Then, lay your stencils over top of the clay, and cut out the pieces using a knife or blade. To assemble the mug, place the bottom of the mug on a flat surface, and stand the body of the mug up along a long side. Wrap the body around the bottom, and use your fingers to smooth out the clay. Scratch the edges with a fork, and wet your clay to fuse together both sides. Do this to attach your handle as well. Finally, bake your mug at  325 °F (163 °C) for 30 minutes. Typically, the body of the mug is about 8.5 in × 3 in (21.6 cm × 7.6 cm)."
                }
            ]
        },
        {
            "name": "Decorating the Mug",
            "steps": [
                {
                    "headline": "Trace your design onto your mug using a pencil.",
                    "description": "If you want to easily fill in your lines, first use a pencil to trace your artwork onto the mug. You can use words, phrases, images, or patterns. Make your marks dark enough so you can see them on the mug. If your lines aren't perfect, that's okay! Touch them up later when you create your image."
                },
                {
                    "headline": "Use stencils if you prefer to use guidelines for your design.",
                    "description": "You can purchase adhesive stencils, or you can use other stencils and tape them to the mug. Then, trace over your image using a pencil. This helps you easily transfer your design to your mug. You can also use a combination of stencils and freehand drawings to personalize your mug."
                },
                {
                    "headline": "Use masking tape to create effortless, straight lines or even sections.",
                    "description": "If you want to create stripes or section off areas, rip off pieces of masking tape about 2–4 in (5.1–10.2 cm) long, and stick them to your mug as desired. The tape acts as a stencil, so you can easily create straight lines. Prepping your mug with masking tape helps you easily create your designs."
                },
                {
                    "headline": "Fill in your lines with a oil-based paint marker for an easy option.",
                    "description": "To easily personalize your mug, purchase paint markers. Press down on the tip to get the paint started, then fill in the lines you drew with pencil. Paint markers work just like regular markers, except they are more fluid and dry thicker. If any extra paint gets applied to the mug, quickly wipe it up with a damp cloth. For stubborn markers, dip a cotton swab in nail polish remover, and dab away the mark. Alternatively, you can use an oil-based Sharpie marker."
                },
                {
                    "headline": "Use acrylic paint to create your designs if you want hand-painted look.",
                    "description": "Make sure your paint is safe to use for ceramic or glass surfaces (this will be listed on the packaging). Squeeze out a nickel-size amount of paint on a piece of cardboard, and dip the tip of your paint brush into the paint. Then, fill in your design using your paintbrush. If you want to apply multiple coats, let the first coat dry completely, which can take 20 to 60 minutes. Use a small paintbrush to create small designs, or go with a medium paintbrush to make large designs. Try using chalkboard paint to make a mug that you can directly write messages onto. Use glitter paint for a sparkly touch."
                },
                {
                    "headline": "Try using glass etching cream if you want to create a textured design.",
                    "description": "Tape or stencil a design on the mug first. Squeeze a few drops of etching cream into a small bowl or cup, and dip your paint brush into the etching cream. Apply a liberal amount of the cream over your artwork or inside the tape lines or stencil. Let the etching cream sit for 5-10 minutes. Remove any tape or stencils after 5-10 minutes if you used them. Then, rinse off the etching cream with cool water, and dry the mug thoroughly before use. Etching cream creates a glassy, opaque look over wherever you apply it. When you paint etching cream over your artwork, your art will look raised and have a foggy coloring."
                },
                {
                    "headline": "Bake your mug at 350 °F (177 °C) for 20 minutes if using a ceramic mug.",
                    "description": "If you are using oil-based paint markers or acrylic paint on your mug, it is best to bake it in the oven to set the paint. Simply place your mug on a cooking sheet, and put the cooking sheet in the middle of your oven after it preheats. Set a timer for 20 minutes, then take your mug out of the oven using oven mitts. Your designs will not be dishwasher safe, and you must hand-wash your mugs. Be sure to let your mug cool completely before you handle it."
                }
            ]
        }
    ],
    "tyn": [
        "Mug or clay",
        "Oven",
        "Pencil",
        "Oil-based paint marker",
        "Acrylic paint",
        "Paint brushes",
        "Etching cream"
    ],
    "text": " Getting a Mug Use a clean, plain ceramic mug if you want to easily decorate it. The easiest way to customize your own mug is by finding a plain mug with no writing or images on it. You can purchase a new one from a home supply or thrift store, or repurpose an old mug. Wash your mug with soap and water to ensure it is completely clean before you use it. You can use mugs in colors like white, yellow, or light blue, for example. The lighter the color, the easier it will be to see your design. If you use a dark mug, make sure you have silver or white markers or paint to use. You can purchase mugs at most craft and dollar stores. Search online for customizable mugs if you want a ready-made option. There are countless websites offering customized mug services. If you want to make a custom mug without any effort, go online and search for “customizable mug.” Select a website, and choose to make a mug with words or images (or both!). Many sites offer a wide variety of options. You can create wraparound photo mugs, photo collage mugs, or mugs with your logo, for example. Find classes and workshops online to make your own functional mug. To make a food-safe mug, fired clay must be baked at over 2,000 °F (1,090 °C) in a ceramic kiln. Go online and look up \"mug making workshops,\" and browse your options. When you find a class that suits your interests, schedule, and budget, contact them by phone or email to reserve a spot. The class details will explain whether you need to pay in advance or when you arrive. You can either make a slab mug or use a pottery wheel to make your mug. Make sure you arrive on time for the class. If you arrive late, you may not get to attend the session. Make a mug out of clay for a decorative option. Search online to find mug stencils for making a clay mug, print them out, and cut them out using a pair of scissors. The stencil kit likely comes with a stencil for the mug body, base, and handle. Use a rolling pin to flatten the clay, and roll it out until it is about ⁄4 in (0.64 cm) thick. Then, lay your stencils over top of the clay, and cut out the pieces using a knife or blade. To assemble the mug, place the bottom of the mug on a flat surface, and stand the body of the mug up along a long side. Wrap the body around the bottom, and use your fingers to smooth out the clay. Scratch the edges with a fork, and wet your clay to fuse together both sides. Do this to attach your handle as well. Finally, bake your mug at  325 °F (163 °C) for 30 minutes. Typically, the body of the mug is about 8.5 in × 3 in (21.6 cm × 7.6 cm). Decorating the Mug Trace your design onto your mug using a pencil. If you want to easily fill in your lines, first use a pencil to trace your artwork onto the mug. You can use words, phrases, images, or patterns. Make your marks dark enough so you can see them on the mug. If your lines aren't perfect, that's okay! Touch them up later when you create your image. Use stencils if you prefer to use guidelines for your design. You can purchase adhesive stencils, or you can use other stencils and tape them to the mug. Then, trace over your image using a pencil. This helps you easily transfer your design to your mug. You can also use a combination of stencils and freehand drawings to personalize your mug. Use masking tape to create effortless, straight lines or even sections. If you want to create stripes or section off areas, rip off pieces of masking tape about 2–4 in (5.1–10.2 cm) long, and stick them to your mug as desired. The tape acts as a stencil, so you can easily create straight lines. Prepping your mug with masking tape helps you easily create your designs. Fill in your lines with a oil-based paint marker for an easy option. To easily personalize your mug, purchase paint markers. Press down on the tip to get the paint started, then fill in the lines you drew with pencil. Paint markers work just like regular markers, except they are more fluid and dry thicker. If any extra paint gets applied to the mug, quickly wipe it up with a damp cloth. For stubborn markers, dip a cotton swab in nail polish remover, and dab away the mark. Alternatively, you can use an oil-based Sharpie marker. Use acrylic paint to create your designs if you want hand-painted look. Make sure your paint is safe to use for ceramic or glass surfaces (this will be listed on the packaging). Squeeze out a nickel-size amount of paint on a piece of cardboard, and dip the tip of your paint brush into the paint. Then, fill in your design using your paintbrush. If you want to apply multiple coats, let the first coat dry completely, which can take 20 to 60 minutes. Use a small paintbrush to create small designs, or go with a medium paintbrush to make large designs. Try using chalkboard paint to make a mug that you can directly write messages onto. Use glitter paint for a sparkly touch. Try using glass etching cream if you want to create a textured design. Tape or stencil a design on the mug first. Squeeze a few drops of etching cream into a small bowl or cup, and dip your paint brush into the etching cream. Apply a liberal amount of the cream over your artwork or inside the tape lines or stencil. Let the etching cream sit for 5-10 minutes. Remove any tape or stencils after 5-10 minutes if you used them. Then, rinse off the etching cream with cool water, and dry the mug thoroughly before use. Etching cream creates a glassy, opaque look over wherever you apply it. When you paint etching cream over your artwork, your art will look raised and have a foggy coloring. Bake your mug at 350 °F (177 °C) for 20 minutes if using a ceramic mug. If you are using oil-based paint markers or acrylic paint on your mug, it is best to bake it in the oven to set the paint. Simply place your mug on a cooking sheet, and put the cooking sheet in the middle of your oven after it preheats. Set a timer for 20 minutes, then take your mug out of the oven using oven mitts. Your designs will not be dishwasher safe, and you must hand-wash your mugs. Be sure to let your mug cool completely before you handle it.",
    "sentences": [
        " Getting a Mug Use a clean, plain ceramic mug if you want to easily decorate it.",
        "The easiest way to customize your own mug is by finding a plain mug with no writing or images on it.",
        "You can purchase a new one from a home supply or thrift store, or repurpose an old mug.",
        "Wash your mug with soap and water to ensure it is completely clean before you use it.",
        "You can use mugs in colors like white, yellow, or light blue, for example.",
        "The lighter the color, the easier it will be to see your design.",
        "If you use a dark mug, make sure you have silver or white markers or paint to use.",
        "You can purchase mugs at most craft and dollar stores.",
        "Search online for customizable mugs if you want a ready-made option.",
        "There are countless websites offering customized mug services.",
        "If you want to make a custom mug without any effort, go online and search for “customizable mug.” Select a website, and choose to make a mug with words or images (or both!).",
        "Many sites offer a wide variety of options.",
        "You can create wraparound photo mugs, photo collage mugs, or mugs with your logo, for example.",
        "Find classes and workshops online to make your own functional mug.",
        "To make a food-safe mug, fired clay must be baked at over 2,000 °F (1,090 °C) in a ceramic kiln.",
        "Go online and look up \"mug making workshops,\" and browse your options.",
        "When you find a class that suits your interests, schedule, and budget, contact them by phone or email to reserve a spot.",
        "The class details will explain whether you need to pay in advance or when you arrive.",
        "You can either make a slab mug or use a pottery wheel to make your mug.",
        "Make sure you arrive on time for the class.",
        "If you arrive late, you may not get to attend the session.",
        "Make a mug out of clay for a decorative option.",
        "Search online to find mug stencils for making a clay mug, print them out, and cut them out using a pair of scissors.",
        "The stencil kit likely comes with a stencil for the mug body, base, and handle.",
        "Use a rolling pin to flatten the clay, and roll it out until it is about ⁄4 in (0.64 cm) thick.",
        "Then, lay your stencils over top of the clay, and cut out the pieces using a knife or blade.",
        "To assemble the mug, place the bottom of the mug on a flat surface, and stand the body of the mug up along a long side.",
        "Wrap the body around the bottom, and use your fingers to smooth out the clay.",
        "Scratch the edges with a fork, and wet your clay to fuse together both sides.",
        "Do this to attach your handle as well.",
        "Finally, bake your mug at  325 °F (163 °C) for 30 minutes.",
        "Typically, the body of the mug is about 8.5 in × 3 in (21.6 cm × 7.6 cm).",
        "Decorating the Mug Trace your design onto your mug using a pencil.",
        "If you want to easily fill in your lines, first use a pencil to trace your artwork onto the mug.",
        "You can use words, phrases, images, or patterns.",
        "Make your marks dark enough so you can see them on the mug.",
        "If your lines aren't perfect, that's okay!",
        "Touch them up later when you create your image.",
        "Use stencils if you prefer to use guidelines for your design.",
        "You can purchase adhesive stencils, or you can use other stencils and tape them to the mug.",
        "Then, trace over your image using a pencil.",
        "This helps you easily transfer your design to your mug.",
        "You can also use a combination of stencils and freehand drawings to personalize your mug.",
        "Use masking tape to create effortless, straight lines or even sections.",
        "If you want to create stripes or section off areas, rip off pieces of masking tape about 2–4 in (5.1–10.2 cm) long, and stick them to your mug as desired.",
        "The tape acts as a stencil, so you can easily create straight lines.",
        "Prepping your mug with masking tape helps you easily create your designs.",
        "Fill in your lines with a oil-based paint marker for an easy option.",
        "To easily personalize your mug, purchase paint markers.",
        "Press down on the tip to get the paint started, then fill in the lines you drew with pencil.",
        "Paint markers work just like regular markers, except they are more fluid and dry thicker.",
        "If any extra paint gets applied to the mug, quickly wipe it up with a damp cloth.",
        "For stubborn markers, dip a cotton swab in nail polish remover, and dab away the mark.",
        "Alternatively, you can use an oil-based Sharpie marker.",
        "Use acrylic paint to create your designs if you want hand-painted look.",
        "Make sure your paint is safe to use for ceramic or glass surfaces (this will be listed on the packaging).",
        "Squeeze out a nickel-size amount of paint on a piece of cardboard, and dip the tip of your paint brush into the paint.",
        "Then, fill in your design using your paintbrush.",
        "If you want to apply multiple coats, let the first coat dry completely, which can take 20 to 60 minutes.",
        "Use a small paintbrush to create small designs, or go with a medium paintbrush to make large designs.",
        "Try using chalkboard paint to make a mug that you can directly write messages onto.",
        "Use glitter paint for a sparkly touch.",
        "Try using glass etching cream if you want to create a textured design.",
        "Tape or stencil a design on the mug first.",
        "Squeeze a few drops of etching cream into a small bowl or cup, and dip your paint brush into the etching cream.",
        "Apply a liberal amount of the cream over your artwork or inside the tape lines or stencil.",
        "Let the etching cream sit for 5-10 minutes.",
        "Remove any tape or stencils after 5-10 minutes if you used them.",
        "Then, rinse off the etching cream with cool water, and dry the mug thoroughly before use.",
        "Etching cream creates a glassy, opaque look over wherever you apply it.",
        "When you paint etching cream over your artwork, your art will look raised and have a foggy coloring.",
        "Bake your mug at 350 °F (177 °C) for 20 minutes if using a ceramic mug.",
        "If you are using oil-based paint markers or acrylic paint on your mug, it is best to bake it in the oven to set the paint.",
        "Simply place your mug on a cooking sheet, and put the cooking sheet in the middle of your oven after it preheats.",
        "Set a timer for 20 minutes, then take your mug out of the oven using oven mitts.",
        "Your designs will not be dishwasher safe, and you must hand-wash your mugs.",
        "Be sure to let your mug cool completely before you handle it."
    ]
}