{
    "title": "How to Prune a Peach Tree",
    "url": "https://www.wikihow.com/Prune-a-Peach-Tree",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Planting and Growing",
        "Growing Trees and Shrubs"
    ],
    "methods": [
        {
            "name": "Pruning Basics",
            "steps": [
                {
                    "headline": "Prune your peach trees to help them grow.",
                    "description": "Pruning may seem counterintuitive, but is actually incredibly beneficial in aiding new growth on peach trees. Pruning your peach trees produces new growth, which in turn produces more fruit. Therefore, pruning yields a larger crop over time. Peach trees need to be open to sunlight, as shaded branches won’t produce as much fruit. Pruning them opens up all branches to the sun. Removing dead parts of the tree is necessary so that new branches can come in. If you intend on spraying your tree with pesticides, pruning allows for an equal coverage over the entire plant."
                },
                {
                    "headline": "Know when to prune.",
                    "description": "The best time to prune your peach trees is early spring, after the last major cold snap of winter. Avoid pruning in very cold weather though, as this can reduce the trees’ cold-hardiness and total output of fruit. The best month for pruning is typically February, but adjust this time based on your local weather. Prune older trees before younger ones to allow time for the new growth. Avoid pruning when the trees are blooming or shortly after blooming, because this can negatively affect the new growth. Prune your peach trees at planting or at the next spring (if done in the fall). It is better to prune a little late in the year than a little early."
                },
                {
                    "headline": "Choose your pruning tools.",
                    "description": "Use pruning shears for smaller, more manageable branches. Remove large limbs with loppers or a pruning saw. Wound dressing is available to put on branches post-pruning, but has shown to have little to no effect in preventing fungal growth."
                },
                {
                    "headline": "Know how much to prune.",
                    "description": "When you are cutting back branches, it is best to follow the “cat tossing” rule. All the branches on your peach tree should be wide enough apart that a cat could be tossed between each of them without ever hitting a branch. A total height of 8–9 feet (2.4–2.7 m) is preferred when the tree is at its maturation. Prune the tree low to start, to encourage outward growth instead of upward. For big, full fruit, remove up to 90% of all developing fruit. A healthy tree will produce much more than it is capable of carrying, and must have most of it removed for the best output."
                }
            ]
        },
        {
            "name": "Pruning a Young Peach Tree",
            "steps": [
                {
                    "headline": "Prune at planting.",
                    "description": "As aforementioned, it is important to start the growth of your peach tree in the right direction by pruning at planting. If you plant in the fall, wait a few months till the next spring to prune."
                },
                {
                    "headline": "Prune so that the lowest branch is 15 inches (38.1 cm) from the ground.",
                    "description": "You don’t want the branches to start much higher on the trunk, because as the tree matures it will grow too tall. The tallest branch should be about 30 inches (76.2 cm) from the ground total. Trim branches that are too long to meet this number. All branches should ideally grow at a 45 degree angle. If there are none near this measurement on your tree, prune all branches to a single bud and wait for more growth."
                },
                {
                    "headline": "Select scaffold limbs in the summer.",
                    "description": "Scaffold limbs are the largest branches on the tree, beginning at the trunk. To begin, choose 2-3 scaffold limbs, but this number may grow to 4-6 over time. Scaffold limbs should form a radial pattern from the trunk, each facing away in a different direction. Scaffold limbs will house the lateral (smaller outward growing) branches as the tree matures."
                },
                {
                    "headline": "Prune branches close to the trunk.",
                    "description": "You want to cut the branches near the trunk, offering only a small collar of growth to prevent decay in the branches. Make thinning cuts, or cuts that start at the origin of the branch, on trees younger than one year old. Heading cuts are used to remove parts of branches, rather than the entirety of the branch. Avoid doing this in a young tree though, to prevent unwanted suckers and water shoot growth near the top of the tree."
                }
            ]
        },
        {
            "name": "Pruning a Mature Peach Tree",
            "steps": [
                {
                    "headline": "Remove all dead and unhealthy growth.",
                    "description": "You can remove the following growth at any time of year:\nDead or fungus-infected branches\nSuckers: the shoots that come up near the roots of the tree. Water shoots growing from the top branches\nDried fruit from the previous year’s harvest"
                },
                {
                    "headline": "Shape and train your peach tree.",
                    "description": "This is the most important step in pruning, as it is responsible for the ultimate growth pattern and fruit production of the tree. You want to choose 4-6 primary branches to work with, and cut off all the rest. All the branches you cut should be growing up at a 45 degree angle. Any branches that grow vertically or horizontally need to be removed, as they are likely to break when the tree begins bearing fruit. Prune your tree in a V-shaped pattern. All branches should have the appearance of the letter “V.”\nCut off any branches that cross over each other, since these block sunlight. The best shape for a peach tree is an open vase, with a clear center to maximize sun. Remove any branches on which the new growth is growing upwards above your head. This will make it difficult to pick the fruit."
                },
                {
                    "headline": "Prune your trees near the base of the branch.",
                    "description": "You want to cut the tree at the same angle of growth, about ¼ an inch from the lateral bud. Avoid cutting the branch at too steep an angle or too close to the collar at the base, as this opens it up for infection. For branches exceeding 1 inch (2.5 cm) in diameter, use three cuts to aid in pruning. Make the first cut about halfway up the branch from the underside. Then, make a cut from the top down about one inch further. The weight of the branch will help the branch to break easily. Then, make your cut near the collar of the branch."
                }
            ]
        }
    ],
    "tyn": [
        "Hand or pruning shears",
        "Loppers",
        "Fine-tooth pruning saw",
        "Ladder"
    ],
    "text": " Pruning Basics Prune your peach trees to help them grow. Pruning may seem counterintuitive, but is actually incredibly beneficial in aiding new growth on peach trees. Pruning your peach trees produces new growth, which in turn produces more fruit. Therefore, pruning yields a larger crop over time. Peach trees need to be open to sunlight, as shaded branches won’t produce as much fruit. Pruning them opens up all branches to the sun. Removing dead parts of the tree is necessary so that new branches can come in. If you intend on spraying your tree with pesticides, pruning allows for an equal coverage over the entire plant. Know when to prune. The best time to prune your peach trees is early spring, after the last major cold snap of winter. Avoid pruning in very cold weather though, as this can reduce the trees’ cold-hardiness and total output of fruit. The best month for pruning is typically February, but adjust this time based on your local weather. Prune older trees before younger ones to allow time for the new growth. Avoid pruning when the trees are blooming or shortly after blooming, because this can negatively affect the new growth. Prune your peach trees at planting or at the next spring (if done in the fall). It is better to prune a little late in the year than a little early. Choose your pruning tools. Use pruning shears for smaller, more manageable branches. Remove large limbs with loppers or a pruning saw. Wound dressing is available to put on branches post-pruning, but has shown to have little to no effect in preventing fungal growth. Know how much to prune. When you are cutting back branches, it is best to follow the “cat tossing” rule. All the branches on your peach tree should be wide enough apart that a cat could be tossed between each of them without ever hitting a branch. A total height of 8–9 feet (2.4–2.7 m) is preferred when the tree is at its maturation. Prune the tree low to start, to encourage outward growth instead of upward. For big, full fruit, remove up to 90% of all developing fruit. A healthy tree will produce much more than it is capable of carrying, and must have most of it removed for the best output. Pruning a Young Peach Tree Prune at planting. As aforementioned, it is important to start the growth of your peach tree in the right direction by pruning at planting. If you plant in the fall, wait a few months till the next spring to prune. Prune so that the lowest branch is 15 inches (38.1 cm) from the ground. You don’t want the branches to start much higher on the trunk, because as the tree matures it will grow too tall. The tallest branch should be about 30 inches (76.2 cm) from the ground total. Trim branches that are too long to meet this number. All branches should ideally grow at a 45 degree angle. If there are none near this measurement on your tree, prune all branches to a single bud and wait for more growth. Select scaffold limbs in the summer. Scaffold limbs are the largest branches on the tree, beginning at the trunk. To begin, choose 2-3 scaffold limbs, but this number may grow to 4-6 over time. Scaffold limbs should form a radial pattern from the trunk, each facing away in a different direction. Scaffold limbs will house the lateral (smaller outward growing) branches as the tree matures. Prune branches close to the trunk. You want to cut the branches near the trunk, offering only a small collar of growth to prevent decay in the branches. Make thinning cuts, or cuts that start at the origin of the branch, on trees younger than one year old. Heading cuts are used to remove parts of branches, rather than the entirety of the branch. Avoid doing this in a young tree though, to prevent unwanted suckers and water shoot growth near the top of the tree. Pruning a Mature Peach Tree Remove all dead and unhealthy growth. You can remove the following growth at any time of year:\nDead or fungus-infected branches\nSuckers: the shoots that come up near the roots of the tree. Water shoots growing from the top branches\nDried fruit from the previous year’s harvest Shape and train your peach tree. This is the most important step in pruning, as it is responsible for the ultimate growth pattern and fruit production of the tree. You want to choose 4-6 primary branches to work with, and cut off all the rest. All the branches you cut should be growing up at a 45 degree angle. Any branches that grow vertically or horizontally need to be removed, as they are likely to break when the tree begins bearing fruit. Prune your tree in a V-shaped pattern. All branches should have the appearance of the letter “V.”\nCut off any branches that cross over each other, since these block sunlight. The best shape for a peach tree is an open vase, with a clear center to maximize sun. Remove any branches on which the new growth is growing upwards above your head. This will make it difficult to pick the fruit. Prune your trees near the base of the branch. You want to cut the tree at the same angle of growth, about ¼ an inch from the lateral bud. Avoid cutting the branch at too steep an angle or too close to the collar at the base, as this opens it up for infection. For branches exceeding 1 inch (2.5 cm) in diameter, use three cuts to aid in pruning. Make the first cut about halfway up the branch from the underside. Then, make a cut from the top down about one inch further. The weight of the branch will help the branch to break easily. Then, make your cut near the collar of the branch.",
    "sentences": [
        " Pruning Basics Prune your peach trees to help them grow.",
        "Pruning may seem counterintuitive, but is actually incredibly beneficial in aiding new growth on peach trees.",
        "Pruning your peach trees produces new growth, which in turn produces more fruit.",
        "Therefore, pruning yields a larger crop over time.",
        "Peach trees need to be open to sunlight, as shaded branches won’t produce as much fruit.",
        "Pruning them opens up all branches to the sun.",
        "Removing dead parts of the tree is necessary so that new branches can come in.",
        "If you intend on spraying your tree with pesticides, pruning allows for an equal coverage over the entire plant.",
        "Know when to prune.",
        "The best time to prune your peach trees is early spring, after the last major cold snap of winter.",
        "Avoid pruning in very cold weather though, as this can reduce the trees’ cold-hardiness and total output of fruit.",
        "The best month for pruning is typically February, but adjust this time based on your local weather.",
        "Prune older trees before younger ones to allow time for the new growth.",
        "Avoid pruning when the trees are blooming or shortly after blooming, because this can negatively affect the new growth.",
        "Prune your peach trees at planting or at the next spring (if done in the fall).",
        "It is better to prune a little late in the year than a little early.",
        "Choose your pruning tools.",
        "Use pruning shears for smaller, more manageable branches.",
        "Remove large limbs with loppers or a pruning saw.",
        "Wound dressing is available to put on branches post-pruning, but has shown to have little to no effect in preventing fungal growth.",
        "Know how much to prune.",
        "When you are cutting back branches, it is best to follow the “cat tossing” rule.",
        "All the branches on your peach tree should be wide enough apart that a cat could be tossed between each of them without ever hitting a branch.",
        "A total height of 8–9 feet (2.4–2.7 m) is preferred when the tree is at its maturation.",
        "Prune the tree low to start, to encourage outward growth instead of upward.",
        "For big, full fruit, remove up to 90% of all developing fruit.",
        "A healthy tree will produce much more than it is capable of carrying, and must have most of it removed for the best output.",
        "Pruning a Young Peach Tree Prune at planting.",
        "As aforementioned, it is important to start the growth of your peach tree in the right direction by pruning at planting.",
        "If you plant in the fall, wait a few months till the next spring to prune.",
        "Prune so that the lowest branch is 15 inches (38.1 cm) from the ground.",
        "You don’t want the branches to start much higher on the trunk, because as the tree matures it will grow too tall.",
        "The tallest branch should be about 30 inches (76.2 cm) from the ground total.",
        "Trim branches that are too long to meet this number.",
        "All branches should ideally grow at a 45 degree angle.",
        "If there are none near this measurement on your tree, prune all branches to a single bud and wait for more growth.",
        "Select scaffold limbs in the summer.",
        "Scaffold limbs are the largest branches on the tree, beginning at the trunk.",
        "To begin, choose 2-3 scaffold limbs, but this number may grow to 4-6 over time.",
        "Scaffold limbs should form a radial pattern from the trunk, each facing away in a different direction.",
        "Scaffold limbs will house the lateral (smaller outward growing) branches as the tree matures.",
        "Prune branches close to the trunk.",
        "You want to cut the branches near the trunk, offering only a small collar of growth to prevent decay in the branches.",
        "Make thinning cuts, or cuts that start at the origin of the branch, on trees younger than one year old.",
        "Heading cuts are used to remove parts of branches, rather than the entirety of the branch.",
        "Avoid doing this in a young tree though, to prevent unwanted suckers and water shoot growth near the top of the tree.",
        "Pruning a Mature Peach Tree Remove all dead and unhealthy growth.",
        "You can remove the following growth at any time of year:\nDead or fungus-infected branches\nSuckers: the shoots that come up near the roots of the tree.",
        "Water shoots growing from the top branches\nDried fruit from the previous year’s harvest Shape and train your peach tree.",
        "This is the most important step in pruning, as it is responsible for the ultimate growth pattern and fruit production of the tree.",
        "You want to choose 4-6 primary branches to work with, and cut off all the rest.",
        "All the branches you cut should be growing up at a 45 degree angle.",
        "Any branches that grow vertically or horizontally need to be removed, as they are likely to break when the tree begins bearing fruit.",
        "Prune your tree in a V-shaped pattern.",
        "All branches should have the appearance of the letter “V.”\nCut off any branches that cross over each other, since these block sunlight.",
        "The best shape for a peach tree is an open vase, with a clear center to maximize sun.",
        "Remove any branches on which the new growth is growing upwards above your head.",
        "This will make it difficult to pick the fruit.",
        "Prune your trees near the base of the branch.",
        "You want to cut the tree at the same angle of growth, about ¼ an inch from the lateral bud.",
        "Avoid cutting the branch at too steep an angle or too close to the collar at the base, as this opens it up for infection.",
        "For branches exceeding 1 inch (2.5 cm) in diameter, use three cuts to aid in pruning.",
        "Make the first cut about halfway up the branch from the underside.",
        "Then, make a cut from the top down about one inch further.",
        "The weight of the branch will help the branch to break easily.",
        "Then, make your cut near the collar of the branch."
    ]
}