{
    "title": "How to Refill a Lighter",
    "url": "https://www.wikihow.com/Refill-a-Lighter",
    "category_hierarchy": [
        "Health",
        "Medicines and Drugs",
        "Recreational Drugs",
        "Smoking",
        "Lighters"
    ],
    "methods": [
        {
            "name": "Disposable Lighter",
            "steps": [
                {
                    "headline": "Open the refill valve.",
                    "description": "Turn your lighter upside down. There will be a small hole in the bottom with a slit leading to a small hole. Insert a push pin into the hole, flip the lighter so the pin is resting against your work surface, and press down on the lighter firmly. You should feel and hear a small \"pop\" as the pin pushes a metal beebee out of place. This beebee seals the release valve and must be pushed out of the way. To verify the beebee seal has been removed, with the push pin still inserted, shake the lighter. You should be able to hear the beebee rattle around."
                },
                {
                    "headline": "Purge remaining air in the lighter.",
                    "description": "This should only be done with empty lighters. Point the lighter away from your face and remove the push pin. You should hear a puff of air when the pin pulls free. Attempting to purge a lighter that has fuel remaining inside will cause fuel to be sprayed out of the refill valve. To prevent fuel from getting on your work surface, lay down a cover, like newspaper or a drop cloth. Wipe down any areas exposed to fuel with a water dampened rag. Also, your hands may have gotten fuel on them. Wash them with soapy water."
                },
                {
                    "headline": "Create a seal on your butane applicator with rubber grommets.",
                    "description": "It isn't likely that your butane applicator will fit perfectly into the lighters refill valve. This can cause gas to leak. Slip three rubber grommets that fit snugly onto the applicator. The rubber of the final grommet should extend just slightly beyond the tip of the butane spray applicator. Circular rubber grommets can be purchased at your local hardware store in variety packs in the hardware section."
                },
                {
                    "headline": "Fill the lighter with butane.",
                    "description": "Turn the lighter upside down so its bottom faces upwards and its top rests on your work surface. Insert the grommet covered tip of the applicator into the refill valve. Press down on the bottle to disengage the refill bottle's release valve. Because of the seal formed by the rubber grommets, you shouldn't hear any noise as the lighter refills. The lighter should refill completely in about five seconds. When finished, release pressure on the refill bottle but keep the applicator inserted in the refill valve."
                },
                {
                    "headline": "Seal the refill valve.",
                    "description": "Remove the applicator from the refill valve and quickly seal the valve with your thumb. Hold the valve tightly with your thumb and pick up the push pin with your free hand. Quick as you can, remove your thumb and plug the hole with the push pin. You may hear some hissing when your thumb is plugging the refill valve. Hold your thumb firmly to reduce the escape of fuel. This part of refilling a disposable lighter can be difficult at first. Move quickly to prevent freshly replenished fuel from escaping."
                },
                {
                    "headline": "Remove the end of the push pin when necessary.",
                    "description": "If you've used a push pin with a contoured plastic end, this may get caught on something and pull the pin out. Cut the contoured plastic at its base with clippers and file down any jagged edges with a metal file."
                }
            ]
        },
        {
            "name": "Long-stemmed Lighter",
            "steps": [
                {
                    "headline": "Remove the case screw.",
                    "description": "There should be a single screw holding the case of the lighter together at the opposite end from the stem. Unfasten this with a screwdriver, then turn the case over and tap it against your work surface to remove the screw from its hole. The screws on these types of lighters tend to be very small, so a regular-sized screwdriver may be too big. Try a mini screwdriver instead. If you can't get any mini screwdrivers, pick up a repair kit for glasses. They usually contain a mini screw driver that may work."
                },
                {
                    "headline": "Loosen the outer seam of the case with a screwdriver.",
                    "description": "The outer seam of the lighter will be held together by a light glue and some plastic pins. Run a normal sized flat head screwdriver along the outer seams to loosen the glue. If you can't get a flat head screwdriver, try a butter knife instead. You need something thin that you can wedge into the seam and pry it apart."
                },
                {
                    "headline": "Pry open the case.",
                    "description": "After the seams have been loosened, work the tip of your flat head into the seam and gently pry open the stem-opposite end. When roughly half of the case separates, remove the screwdriver."
                },
                {
                    "headline": "Remove the lighter insert.",
                    "description": "Pull apart the stem-opposite side of the case open with your fingers. Don't pull too hard; the case should only pry apart halfway. At this point, you should be able to use your fingers to pull out the fuel reservoir. The fuel reservoir looks very similar to a standard disposable lighter. Place the reservoir and a fresh disposable lighter side by side in front of you. The empty long-stemmed lighter can be set off to the side. This part won't be needed until you put the lighter back together."
                },
                {
                    "headline": "Disassemble the new disposable lighter.",
                    "description": "Pry the vented front metal band (the wind guard) from the lighter with your fingers. Pull out the flint wheel, the attached flint, and flint spring. Then pull the insert below (which includes the button), its spring, and the nozzle jet free. After these parts have been removed, keep the disassembled lighter positioned upright to prevent it from spilling fuel."
                },
                {
                    "headline": "Replace the old lighter's jet with the one from the reservoir.",
                    "description": "The top of the reservoir should have a similar button-insert as the new lighter. Remove this, its spring, and the nozzle jet from the reservoir. Replace the reservoir jet, spring, and insert on the new lighter. The jet and the spring should fall into place easily. Press the button-insert into place with moderate force. You should feel it snap into place."
                },
                {
                    "headline": "Reinsert the replacement reservoir.",
                    "description": "Pry open the case halfway one more time. Insert the replacement reservoir into the body of the lighter so the reservoir button and the trigger of the lighter align. Test the lighter. If it lights, refasten the case screw and you're done. If the lighter does not ignite, it's likely the reservoir button-insert, spring, and/or jet were not correctly installed. The reservoir should slot into place in a small, internal cavity inside the handle of the long-stemmed lighter."
                }
            ]
        },
        {
            "name": "Butane Lighter",
            "steps": [
                {
                    "headline": "Purchase butane to refill your lighter.",
                    "description": "You can find refill cans almost anywhere you can purchase cigarettes or cigars, like a tobacco store. Look for bottles that come with metal tips instead of plastic ones. Metal tips are better for inserting the butane into the lighter. Verify the butane works with your lighter by reading its label instructions. Always follow the safety directions on the canister to achieve the best results. Select a high-quality butane specifically intended for butane lighters. Low-quality fuel may not light as well."
                },
                {
                    "headline": "Select a flat, sturdy surface to work on.",
                    "description": "You'll also want this to be in a place that is well ventilated. You’ll be dealing with flammable gas while refilling. Good ventilation will prevent the buildup of harmful fumes. Your kitchen or an outside area are good places to refill your butane lighter because both are open spaces. Open a window or turn on a vent in the room if it is available. If airflow is still poor even with a window open, use a stationary fan to improve circulation. Remaining fluid or gas may spray onto your work surface while refilling. Protect your work surface with a layer of newspaper or a drop cloth."
                },
                {
                    "headline": "Purge your lighter.",
                    "description": "Release the air and remaining fuel inside the lighter. While holding the valve so it's pointed away from your face, push down on the refill lever with a screwdriver. The air will be fully released when you no longer hear a hissing sound. The refill lever is also sometimes known as the nipple. It is located on the bottom of most butane lighters and usually looks like a small hole with a tiny, circular valve inside. If you don't have a screwdriver, use a pen, paperclip, or similar tool to push down the valve and release remaining air in the lighter. If lighter fluid sprays onto your hands or tools, rinse these thoroughly in soap and water. If you forget to do so, the fuel may ignite and burn you when you test the lighter."
                },
                {
                    "headline": "Set the flame height adjuster on the lighter to the lowest level.",
                    "description": "The flame height adjuster is usually on the bottom of the lighter and looks like a screw with a flat head screwdriver slot. Use a small flat head screwdriver and turn the screw clockwise to lower the flame. By turning the adjuster to its lowest setting, even if you accidentally ignite the lighter, the flame will be small and unlikely to do harm or damage. Some lighters may indicate the minimum setting direction with a minus sign ( - ). Turn the adjuster screw towards the minus sign to lower the flame."
                },
                {
                    "headline": "Shake the can of refill fluid.",
                    "description": "If you have an older can especially, give it a few shakes up-and-down. Over time, the fluid can sink to the bottom and not spray effectively. By shaking the can, you'll prime it for refilling. While shaking the can, you'll also be able to feel fluid swish around inside it. This will give you a chance to gauge how much is in the bottle. Nearly empty bottles may not have enough fluid to fully refill your lighter and should be swapped out for a new can of replacement fuel."
                },
                {
                    "headline": "Secure the tip of the refill bottle into the refill valve on the lighter.",
                    "description": "Make sure you are holding the lighter and refill bottle straight up and down. In some cases, the bottle tip may not form a secure fit with the lighter's valve. In this situation, use a tip adapter. Most butane refill bottles come with an adapter, so before you try to refill, make sure the standard tip fits over the valve. Don’t fill the lighter at an angle. This will let air into the lighter tank. Air in the lighter will cause the lighter to not work properly. It will have to be drained and refilled."
                },
                {
                    "headline": "Fill the lighter for about five seconds.",
                    "description": "Pressing the lighter down onto the bottle will disengage the release valve on the bottle's nozzle. Press down on the lighter firmly for about five seconds to refill the lighter. After filling, if you feel like your lighter isn’t full, repeat this procedure for another five seconds. Refill cans low on fuel may take more time to refuel lighters. Some lighters have a fuel level that you can check. Check the butane level viewer if you have one to gauge the lighter's fullness. Lighters that are filled up too much will overflow. This can be dangerous, as butane can leak and catch fire when lighting."
                },
                {
                    "headline": "Set the desired flame height.",
                    "description": "Flip your lighter over and reset the adjuster to its starting position. Ideally, the flame should be about 1 to 1 ⁄2 inches (2.5 to 3.8 cm) tall. Before attempting to test the lighter, let the butane settle for a few minutes. Once you’ve refilled and set your flame height, give your lighter a minute or so to absorb the butane. As you wait for butane to be absorbed, check your lighter for leaks. Wipe up leaked fuel with a dampened rag. Rinse the rag frequently. If your lighter leaks, you may have to purge the fuel and refill it again. Check for obvious culprits first, like loose fasteners, before purging and refilling."
                },
                {
                    "headline": "Test the lighter.",
                    "description": "If there are any spills or if you smell even a hint of fumes, wait a few more minutes for these to dissipate. Hold the lighter at a safe distance from your face and ignite the flame. You may need to add more butane if the flame does not catch or seems weak. In most butane lighters, butane won't dissolve over time. Always test your lighter before refilling it to make sure that it is empty."
                }
            ]
        },
        {
            "name": "Zippo Lighter",
            "steps": [
                {
                    "headline": "Use authentic Zippo Lighter Fluid.",
                    "description": "Other brands of lighter fluid intended for similar lighters will work most of the time, but the Zippo fluid is recommended by the manufacturer for maintaining its condition and operation. If you use a different brand of lighter fluid, make sure it is a premium brand. Sub-par fuel may fail to ignite in your lighter. Never use charcoal lighter fluid. Charcoal lighter fluid is not made for a small container like a Zippo. Using charcoal fluid can be very dangerous."
                },
                {
                    "headline": "Remove the insert from the case.",
                    "description": "The insert, which includes the chimney-shaped wind guard, should be wedged inside a rectangular metal case. Use your fingers to pull the insert free of the case. Grab the chimney cap, the small rectangular portion with holes in it, and pull the lighter out. In some cases, you may need to loosen the insert by wiggling it back and forth. The refill access for Zippo lighter's (and most similarly designed lighters, too) is at the bottom of the insert."
                },
                {
                    "headline": "Lift the felt pad.",
                    "description": "Flip the insert over so the bottom faces up. You'll see a small circular pin. Surrounding this pin and sealing off the bottom will be a rectangular piece of felt, known as the felt pad. Lift the felt pad at the designated location with a screwdriver. The rectangular felt pad will say “LIFT TO FILL” on it. Lift the felt pad from this end to reveal the rayon balls, which look like cotton, and a wick underneath. There may also be a small hole in the center of the felt pad. Use a small screwdriver or pen and insert it into the hole. Use your tool as a lever to pull the felt pad up."
                },
                {
                    "headline": "Squirt in lighter fluid to refuel the lighter.",
                    "description": "While holding the felt pad back, put the tip of your lighter fluid into the lighter insert and squeeze gently. Keep squirting lighter fluid until you see the top portion of your rayon balls dampen. Be careful not to let lighter fluid drip down the outside of your Zippo or get any on your hands. Wipe up spills with a wet rag. Rinse the rag regularly while doing so to flush fuel down the drain. Refill slowly so you don’t overfill the lighter. If you add too much fluid, your lighter will leak, which can be dangerous."
                },
                {
                    "headline": "Push the top felt pad back down.",
                    "description": "Release your hold on the felt pad and wedge it back into place with your fingers or tool. Let the fluid soak in for about 45 seconds before flipping it right side up. Wipe the outside of your lighter with a damp clean rag or paper towel. It’s also a good idea to wash your hands before placing your lighter back into the casing. Some fluid might've transferred to your hands without you noticing."
                },
                {
                    "headline": "Insert your lighter back into the casing.",
                    "description": "Simply slide your Zippo back into the casing. Push down on the chimney to firmly wedge it back into place. Snap the lid shut to make sure the insert is low enough."
                },
                {
                    "headline": "Test your lighter.",
                    "description": "Light your Zippo to make sure that the wick is absorbing the fuel and your flint is creating a spark. If your lighter doesn't spark up, the most likely issue is the flint. Check out fixing and replacing this part in the next method. The first couple of times you light your Zippo after refilling, your flame may be bigger than usual. This is completely normal."
                }
            ]
        },
        {
            "name": "Replacing a Flint",
            "steps": [
                {
                    "headline": "Unstick stiff flint wheels.",
                    "description": "You shouldn't have to replace the flint of stuck flint wheels. Normal flints mechanisms have three parts: a spring, a flint, and the flint wheel. When new, these parts can stick, preventing sparks needed to ignite the flame. To resolve this issue:\nOpen the lighter. Remove the insert from the lighter case by pulling on the insert by the flame guard, which is the raised part of the insert with holes in it. Remove the flat head slotted screw fastening the flint spring at the bottom of the insert by turning it counterclockwise with a screwdriver. Pull out the screw and attached flint spring. Tap the top of the lighter to knock the flint loose. Replace the flint, spring, and refasten the screw. Your flint wheel should be unstuck."
                },
                {
                    "headline": "Unfasten the flint screw at the bottom of the insert to replace the flint.",
                    "description": "Pull the lighter insert from its case. Turn the insert upside down. You should see the brass screw fastening the flint spring. Unfasten this with a screwdriver or the case of the lighter."
                },
                {
                    "headline": "Remove the flint.",
                    "description": "While keeping the bottom of the insert oriented upward, pull out the unfastened screw and attached flint spring. Tap the insert gently into your palm to knock loose the flint so it falls into your hand. The flint will look like a very small cylinder roughly the size of the flint spring tip. Old flints can be thrown away."
                },
                {
                    "headline": "Replace the flint and reassemble the flint mechanism.",
                    "description": "While holding the insert so its bottom is still facing upwards, drop the new flint down into the flint hole. Reinsert the spring into the hole and refasten the screw."
                },
                {
                    "headline": "Test the new flint.",
                    "description": "Replace the insert back into the case. Make sure the case is seated correctly by closing the case. When the insert is correctly positioned, light the lighter as you would normally. If, after replacing the flint, your lighter still doesn't work, it might be out of fuel. Check and refill fuel as necessary."
                }
            ]
        }
    ],
    "tyn": [
        "Disposable Lighter",
        "Empty disposable lighter",
        "Push pin",
        "Butane",
        "Rubber grommets (x3)",
        "Sturdy clippers (optional)",
        "Metal file (optional)",
        "Long-stemmed Lighter",
        "Screwdrivers (x2; one small and one normal sized)",
        "Empty long-stemmed lighter",
        "New disposable lighter",
        "Butane Lighter",
        "Screwdriver (small size)",
        "Cover for work surface (like newspaper or a drop cloth; optional)",
        "Empty refillable butane lighter",
        "Zippo Lighter",
        "Empty Zippo lighter",
        "Zippo lighter fluid",
        "Flathead screwdriver",
        "Replacing a Flint",
        "Replacement flint",
        "Flat head screwdriver"
    ],
    "text": " Disposable Lighter Open the refill valve. Turn your lighter upside down. There will be a small hole in the bottom with a slit leading to a small hole. Insert a push pin into the hole, flip the lighter so the pin is resting against your work surface, and press down on the lighter firmly. You should feel and hear a small \"pop\" as the pin pushes a metal beebee out of place. This beebee seals the release valve and must be pushed out of the way. To verify the beebee seal has been removed, with the push pin still inserted, shake the lighter. You should be able to hear the beebee rattle around. Purge remaining air in the lighter. This should only be done with empty lighters. Point the lighter away from your face and remove the push pin. You should hear a puff of air when the pin pulls free. Attempting to purge a lighter that has fuel remaining inside will cause fuel to be sprayed out of the refill valve. To prevent fuel from getting on your work surface, lay down a cover, like newspaper or a drop cloth. Wipe down any areas exposed to fuel with a water dampened rag. Also, your hands may have gotten fuel on them. Wash them with soapy water. Create a seal on your butane applicator with rubber grommets. It isn't likely that your butane applicator will fit perfectly into the lighters refill valve. This can cause gas to leak. Slip three rubber grommets that fit snugly onto the applicator. The rubber of the final grommet should extend just slightly beyond the tip of the butane spray applicator. Circular rubber grommets can be purchased at your local hardware store in variety packs in the hardware section. Fill the lighter with butane. Turn the lighter upside down so its bottom faces upwards and its top rests on your work surface. Insert the grommet covered tip of the applicator into the refill valve. Press down on the bottle to disengage the refill bottle's release valve. Because of the seal formed by the rubber grommets, you shouldn't hear any noise as the lighter refills. The lighter should refill completely in about five seconds. When finished, release pressure on the refill bottle but keep the applicator inserted in the refill valve. Seal the refill valve. Remove the applicator from the refill valve and quickly seal the valve with your thumb. Hold the valve tightly with your thumb and pick up the push pin with your free hand. Quick as you can, remove your thumb and plug the hole with the push pin. You may hear some hissing when your thumb is plugging the refill valve. Hold your thumb firmly to reduce the escape of fuel. This part of refilling a disposable lighter can be difficult at first. Move quickly to prevent freshly replenished fuel from escaping. Remove the end of the push pin when necessary. If you've used a push pin with a contoured plastic end, this may get caught on something and pull the pin out. Cut the contoured plastic at its base with clippers and file down any jagged edges with a metal file. Long-stemmed Lighter Remove the case screw. There should be a single screw holding the case of the lighter together at the opposite end from the stem. Unfasten this with a screwdriver, then turn the case over and tap it against your work surface to remove the screw from its hole. The screws on these types of lighters tend to be very small, so a regular-sized screwdriver may be too big. Try a mini screwdriver instead. If you can't get any mini screwdrivers, pick up a repair kit for glasses. They usually contain a mini screw driver that may work. Loosen the outer seam of the case with a screwdriver. The outer seam of the lighter will be held together by a light glue and some plastic pins. Run a normal sized flat head screwdriver along the outer seams to loosen the glue. If you can't get a flat head screwdriver, try a butter knife instead. You need something thin that you can wedge into the seam and pry it apart. Pry open the case. After the seams have been loosened, work the tip of your flat head into the seam and gently pry open the stem-opposite end. When roughly half of the case separates, remove the screwdriver. Remove the lighter insert. Pull apart the stem-opposite side of the case open with your fingers. Don't pull too hard; the case should only pry apart halfway. At this point, you should be able to use your fingers to pull out the fuel reservoir. The fuel reservoir looks very similar to a standard disposable lighter. Place the reservoir and a fresh disposable lighter side by side in front of you. The empty long-stemmed lighter can be set off to the side. This part won't be needed until you put the lighter back together. Disassemble the new disposable lighter. Pry the vented front metal band (the wind guard) from the lighter with your fingers. Pull out the flint wheel, the attached flint, and flint spring. Then pull the insert below (which includes the button), its spring, and the nozzle jet free. After these parts have been removed, keep the disassembled lighter positioned upright to prevent it from spilling fuel. Replace the old lighter's jet with the one from the reservoir. The top of the reservoir should have a similar button-insert as the new lighter. Remove this, its spring, and the nozzle jet from the reservoir. Replace the reservoir jet, spring, and insert on the new lighter. The jet and the spring should fall into place easily. Press the button-insert into place with moderate force. You should feel it snap into place. Reinsert the replacement reservoir. Pry open the case halfway one more time. Insert the replacement reservoir into the body of the lighter so the reservoir button and the trigger of the lighter align. Test the lighter. If it lights, refasten the case screw and you're done. If the lighter does not ignite, it's likely the reservoir button-insert, spring, and/or jet were not correctly installed. The reservoir should slot into place in a small, internal cavity inside the handle of the long-stemmed lighter. Butane Lighter Purchase butane to refill your lighter. You can find refill cans almost anywhere you can purchase cigarettes or cigars, like a tobacco store. Look for bottles that come with metal tips instead of plastic ones. Metal tips are better for inserting the butane into the lighter. Verify the butane works with your lighter by reading its label instructions. Always follow the safety directions on the canister to achieve the best results. Select a high-quality butane specifically intended for butane lighters. Low-quality fuel may not light as well. Select a flat, sturdy surface to work on. You'll also want this to be in a place that is well ventilated. You’ll be dealing with flammable gas while refilling. Good ventilation will prevent the buildup of harmful fumes. Your kitchen or an outside area are good places to refill your butane lighter because both are open spaces. Open a window or turn on a vent in the room if it is available. If airflow is still poor even with a window open, use a stationary fan to improve circulation. Remaining fluid or gas may spray onto your work surface while refilling. Protect your work surface with a layer of newspaper or a drop cloth. Purge your lighter. Release the air and remaining fuel inside the lighter. While holding the valve so it's pointed away from your face, push down on the refill lever with a screwdriver. The air will be fully released when you no longer hear a hissing sound. The refill lever is also sometimes known as the nipple. It is located on the bottom of most butane lighters and usually looks like a small hole with a tiny, circular valve inside. If you don't have a screwdriver, use a pen, paperclip, or similar tool to push down the valve and release remaining air in the lighter. If lighter fluid sprays onto your hands or tools, rinse these thoroughly in soap and water. If you forget to do so, the fuel may ignite and burn you when you test the lighter. Set the flame height adjuster on the lighter to the lowest level. The flame height adjuster is usually on the bottom of the lighter and looks like a screw with a flat head screwdriver slot. Use a small flat head screwdriver and turn the screw clockwise to lower the flame. By turning the adjuster to its lowest setting, even if you accidentally ignite the lighter, the flame will be small and unlikely to do harm or damage. Some lighters may indicate the minimum setting direction with a minus sign ( - ). Turn the adjuster screw towards the minus sign to lower the flame. Shake the can of refill fluid. If you have an older can especially, give it a few shakes up-and-down. Over time, the fluid can sink to the bottom and not spray effectively. By shaking the can, you'll prime it for refilling. While shaking the can, you'll also be able to feel fluid swish around inside it. This will give you a chance to gauge how much is in the bottle. Nearly empty bottles may not have enough fluid to fully refill your lighter and should be swapped out for a new can of replacement fuel. Secure the tip of the refill bottle into the refill valve on the lighter. Make sure you are holding the lighter and refill bottle straight up and down. In some cases, the bottle tip may not form a secure fit with the lighter's valve. In this situation, use a tip adapter. Most butane refill bottles come with an adapter, so before you try to refill, make sure the standard tip fits over the valve. Don’t fill the lighter at an angle. This will let air into the lighter tank. Air in the lighter will cause the lighter to not work properly. It will have to be drained and refilled. Fill the lighter for about five seconds. Pressing the lighter down onto the bottle will disengage the release valve on the bottle's nozzle. Press down on the lighter firmly for about five seconds to refill the lighter. After filling, if you feel like your lighter isn’t full, repeat this procedure for another five seconds. Refill cans low on fuel may take more time to refuel lighters. Some lighters have a fuel level that you can check. Check the butane level viewer if you have one to gauge the lighter's fullness. Lighters that are filled up too much will overflow. This can be dangerous, as butane can leak and catch fire when lighting. Set the desired flame height. Flip your lighter over and reset the adjuster to its starting position. Ideally, the flame should be about 1 to 1 ⁄2 inches (2.5 to 3.8 cm) tall. Before attempting to test the lighter, let the butane settle for a few minutes. Once you’ve refilled and set your flame height, give your lighter a minute or so to absorb the butane. As you wait for butane to be absorbed, check your lighter for leaks. Wipe up leaked fuel with a dampened rag. Rinse the rag frequently. If your lighter leaks, you may have to purge the fuel and refill it again. Check for obvious culprits first, like loose fasteners, before purging and refilling. Test the lighter. If there are any spills or if you smell even a hint of fumes, wait a few more minutes for these to dissipate. Hold the lighter at a safe distance from your face and ignite the flame. You may need to add more butane if the flame does not catch or seems weak. In most butane lighters, butane won't dissolve over time. Always test your lighter before refilling it to make sure that it is empty. Zippo Lighter Use authentic Zippo Lighter Fluid. Other brands of lighter fluid intended for similar lighters will work most of the time, but the Zippo fluid is recommended by the manufacturer for maintaining its condition and operation. If you use a different brand of lighter fluid, make sure it is a premium brand. Sub-par fuel may fail to ignite in your lighter. Never use charcoal lighter fluid. Charcoal lighter fluid is not made for a small container like a Zippo. Using charcoal fluid can be very dangerous. Remove the insert from the case. The insert, which includes the chimney-shaped wind guard, should be wedged inside a rectangular metal case. Use your fingers to pull the insert free of the case. Grab the chimney cap, the small rectangular portion with holes in it, and pull the lighter out. In some cases, you may need to loosen the insert by wiggling it back and forth. The refill access for Zippo lighter's (and most similarly designed lighters, too) is at the bottom of the insert. Lift the felt pad. Flip the insert over so the bottom faces up. You'll see a small circular pin. Surrounding this pin and sealing off the bottom will be a rectangular piece of felt, known as the felt pad. Lift the felt pad at the designated location with a screwdriver. The rectangular felt pad will say “LIFT TO FILL” on it. Lift the felt pad from this end to reveal the rayon balls, which look like cotton, and a wick underneath. There may also be a small hole in the center of the felt pad. Use a small screwdriver or pen and insert it into the hole. Use your tool as a lever to pull the felt pad up. Squirt in lighter fluid to refuel the lighter. While holding the felt pad back, put the tip of your lighter fluid into the lighter insert and squeeze gently. Keep squirting lighter fluid until you see the top portion of your rayon balls dampen. Be careful not to let lighter fluid drip down the outside of your Zippo or get any on your hands. Wipe up spills with a wet rag. Rinse the rag regularly while doing so to flush fuel down the drain. Refill slowly so you don’t overfill the lighter. If you add too much fluid, your lighter will leak, which can be dangerous. Push the top felt pad back down. Release your hold on the felt pad and wedge it back into place with your fingers or tool. Let the fluid soak in for about 45 seconds before flipping it right side up. Wipe the outside of your lighter with a damp clean rag or paper towel. It’s also a good idea to wash your hands before placing your lighter back into the casing. Some fluid might've transferred to your hands without you noticing. Insert your lighter back into the casing. Simply slide your Zippo back into the casing. Push down on the chimney to firmly wedge it back into place. Snap the lid shut to make sure the insert is low enough. Test your lighter. Light your Zippo to make sure that the wick is absorbing the fuel and your flint is creating a spark. If your lighter doesn't spark up, the most likely issue is the flint. Check out fixing and replacing this part in the next method. The first couple of times you light your Zippo after refilling, your flame may be bigger than usual. This is completely normal. Replacing a Flint Unstick stiff flint wheels. You shouldn't have to replace the flint of stuck flint wheels. Normal flints mechanisms have three parts: a spring, a flint, and the flint wheel. When new, these parts can stick, preventing sparks needed to ignite the flame. To resolve this issue:\nOpen the lighter. Remove the insert from the lighter case by pulling on the insert by the flame guard, which is the raised part of the insert with holes in it. Remove the flat head slotted screw fastening the flint spring at the bottom of the insert by turning it counterclockwise with a screwdriver. Pull out the screw and attached flint spring. Tap the top of the lighter to knock the flint loose. Replace the flint, spring, and refasten the screw. Your flint wheel should be unstuck. Unfasten the flint screw at the bottom of the insert to replace the flint. Pull the lighter insert from its case. Turn the insert upside down. You should see the brass screw fastening the flint spring. Unfasten this with a screwdriver or the case of the lighter. Remove the flint. While keeping the bottom of the insert oriented upward, pull out the unfastened screw and attached flint spring. Tap the insert gently into your palm to knock loose the flint so it falls into your hand. The flint will look like a very small cylinder roughly the size of the flint spring tip. Old flints can be thrown away. Replace the flint and reassemble the flint mechanism. While holding the insert so its bottom is still facing upwards, drop the new flint down into the flint hole. Reinsert the spring into the hole and refasten the screw. Test the new flint. Replace the insert back into the case. Make sure the case is seated correctly by closing the case. When the insert is correctly positioned, light the lighter as you would normally. If, after replacing the flint, your lighter still doesn't work, it might be out of fuel. Check and refill fuel as necessary.",
    "sentences": [
        " Disposable Lighter Open the refill valve.",
        "Turn your lighter upside down.",
        "There will be a small hole in the bottom with a slit leading to a small hole.",
        "Insert a push pin into the hole, flip the lighter so the pin is resting against your work surface, and press down on the lighter firmly.",
        "You should feel and hear a small \"pop\" as the pin pushes a metal beebee out of place.",
        "This beebee seals the release valve and must be pushed out of the way.",
        "To verify the beebee seal has been removed, with the push pin still inserted, shake the lighter.",
        "You should be able to hear the beebee rattle around.",
        "Purge remaining air in the lighter.",
        "This should only be done with empty lighters.",
        "Point the lighter away from your face and remove the push pin.",
        "You should hear a puff of air when the pin pulls free.",
        "Attempting to purge a lighter that has fuel remaining inside will cause fuel to be sprayed out of the refill valve.",
        "To prevent fuel from getting on your work surface, lay down a cover, like newspaper or a drop cloth.",
        "Wipe down any areas exposed to fuel with a water dampened rag.",
        "Also, your hands may have gotten fuel on them.",
        "Wash them with soapy water.",
        "Create a seal on your butane applicator with rubber grommets.",
        "It isn't likely that your butane applicator will fit perfectly into the lighters refill valve.",
        "This can cause gas to leak.",
        "Slip three rubber grommets that fit snugly onto the applicator.",
        "The rubber of the final grommet should extend just slightly beyond the tip of the butane spray applicator.",
        "Circular rubber grommets can be purchased at your local hardware store in variety packs in the hardware section.",
        "Fill the lighter with butane.",
        "Turn the lighter upside down so its bottom faces upwards and its top rests on your work surface.",
        "Insert the grommet covered tip of the applicator into the refill valve.",
        "Press down on the bottle to disengage the refill bottle's release valve.",
        "Because of the seal formed by the rubber grommets, you shouldn't hear any noise as the lighter refills.",
        "The lighter should refill completely in about five seconds.",
        "When finished, release pressure on the refill bottle but keep the applicator inserted in the refill valve.",
        "Seal the refill valve.",
        "Remove the applicator from the refill valve and quickly seal the valve with your thumb.",
        "Hold the valve tightly with your thumb and pick up the push pin with your free hand.",
        "Quick as you can, remove your thumb and plug the hole with the push pin.",
        "You may hear some hissing when your thumb is plugging the refill valve.",
        "Hold your thumb firmly to reduce the escape of fuel.",
        "This part of refilling a disposable lighter can be difficult at first.",
        "Move quickly to prevent freshly replenished fuel from escaping.",
        "Remove the end of the push pin when necessary.",
        "If you've used a push pin with a contoured plastic end, this may get caught on something and pull the pin out.",
        "Cut the contoured plastic at its base with clippers and file down any jagged edges with a metal file.",
        "Long-stemmed Lighter Remove the case screw.",
        "There should be a single screw holding the case of the lighter together at the opposite end from the stem.",
        "Unfasten this with a screwdriver, then turn the case over and tap it against your work surface to remove the screw from its hole.",
        "The screws on these types of lighters tend to be very small, so a regular-sized screwdriver may be too big.",
        "Try a mini screwdriver instead.",
        "If you can't get any mini screwdrivers, pick up a repair kit for glasses.",
        "They usually contain a mini screw driver that may work.",
        "Loosen the outer seam of the case with a screwdriver.",
        "The outer seam of the lighter will be held together by a light glue and some plastic pins.",
        "Run a normal sized flat head screwdriver along the outer seams to loosen the glue.",
        "If you can't get a flat head screwdriver, try a butter knife instead.",
        "You need something thin that you can wedge into the seam and pry it apart.",
        "Pry open the case.",
        "After the seams have been loosened, work the tip of your flat head into the seam and gently pry open the stem-opposite end.",
        "When roughly half of the case separates, remove the screwdriver.",
        "Remove the lighter insert.",
        "Pull apart the stem-opposite side of the case open with your fingers.",
        "Don't pull too hard; the case should only pry apart halfway.",
        "At this point, you should be able to use your fingers to pull out the fuel reservoir.",
        "The fuel reservoir looks very similar to a standard disposable lighter.",
        "Place the reservoir and a fresh disposable lighter side by side in front of you.",
        "The empty long-stemmed lighter can be set off to the side.",
        "This part won't be needed until you put the lighter back together.",
        "Disassemble the new disposable lighter.",
        "Pry the vented front metal band (the wind guard) from the lighter with your fingers.",
        "Pull out the flint wheel, the attached flint, and flint spring.",
        "Then pull the insert below (which includes the button), its spring, and the nozzle jet free.",
        "After these parts have been removed, keep the disassembled lighter positioned upright to prevent it from spilling fuel.",
        "Replace the old lighter's jet with the one from the reservoir.",
        "The top of the reservoir should have a similar button-insert as the new lighter.",
        "Remove this, its spring, and the nozzle jet from the reservoir.",
        "Replace the reservoir jet, spring, and insert on the new lighter.",
        "The jet and the spring should fall into place easily.",
        "Press the button-insert into place with moderate force.",
        "You should feel it snap into place.",
        "Reinsert the replacement reservoir.",
        "Pry open the case halfway one more time.",
        "Insert the replacement reservoir into the body of the lighter so the reservoir button and the trigger of the lighter align.",
        "Test the lighter.",
        "If it lights, refasten the case screw and you're done.",
        "If the lighter does not ignite, it's likely the reservoir button-insert, spring, and/or jet were not correctly installed.",
        "The reservoir should slot into place in a small, internal cavity inside the handle of the long-stemmed lighter.",
        "Butane Lighter Purchase butane to refill your lighter.",
        "You can find refill cans almost anywhere you can purchase cigarettes or cigars, like a tobacco store.",
        "Look for bottles that come with metal tips instead of plastic ones.",
        "Metal tips are better for inserting the butane into the lighter.",
        "Verify the butane works with your lighter by reading its label instructions.",
        "Always follow the safety directions on the canister to achieve the best results.",
        "Select a high-quality butane specifically intended for butane lighters.",
        "Low-quality fuel may not light as well.",
        "Select a flat, sturdy surface to work on.",
        "You'll also want this to be in a place that is well ventilated.",
        "You’ll be dealing with flammable gas while refilling.",
        "Good ventilation will prevent the buildup of harmful fumes.",
        "Your kitchen or an outside area are good places to refill your butane lighter because both are open spaces.",
        "Open a window or turn on a vent in the room if it is available.",
        "If airflow is still poor even with a window open, use a stationary fan to improve circulation.",
        "Remaining fluid or gas may spray onto your work surface while refilling.",
        "Protect your work surface with a layer of newspaper or a drop cloth.",
        "Purge your lighter.",
        "Release the air and remaining fuel inside the lighter.",
        "While holding the valve so it's pointed away from your face, push down on the refill lever with a screwdriver.",
        "The air will be fully released when you no longer hear a hissing sound.",
        "The refill lever is also sometimes known as the nipple.",
        "It is located on the bottom of most butane lighters and usually looks like a small hole with a tiny, circular valve inside.",
        "If you don't have a screwdriver, use a pen, paperclip, or similar tool to push down the valve and release remaining air in the lighter.",
        "If lighter fluid sprays onto your hands or tools, rinse these thoroughly in soap and water.",
        "If you forget to do so, the fuel may ignite and burn you when you test the lighter.",
        "Set the flame height adjuster on the lighter to the lowest level.",
        "The flame height adjuster is usually on the bottom of the lighter and looks like a screw with a flat head screwdriver slot.",
        "Use a small flat head screwdriver and turn the screw clockwise to lower the flame.",
        "By turning the adjuster to its lowest setting, even if you accidentally ignite the lighter, the flame will be small and unlikely to do harm or damage.",
        "Some lighters may indicate the minimum setting direction with a minus sign ( - ).",
        "Turn the adjuster screw towards the minus sign to lower the flame.",
        "Shake the can of refill fluid.",
        "If you have an older can especially, give it a few shakes up-and-down.",
        "Over time, the fluid can sink to the bottom and not spray effectively.",
        "By shaking the can, you'll prime it for refilling.",
        "While shaking the can, you'll also be able to feel fluid swish around inside it.",
        "This will give you a chance to gauge how much is in the bottle.",
        "Nearly empty bottles may not have enough fluid to fully refill your lighter and should be swapped out for a new can of replacement fuel.",
        "Secure the tip of the refill bottle into the refill valve on the lighter.",
        "Make sure you are holding the lighter and refill bottle straight up and down.",
        "In some cases, the bottle tip may not form a secure fit with the lighter's valve.",
        "In this situation, use a tip adapter.",
        "Most butane refill bottles come with an adapter, so before you try to refill, make sure the standard tip fits over the valve.",
        "Don’t fill the lighter at an angle.",
        "This will let air into the lighter tank.",
        "Air in the lighter will cause the lighter to not work properly.",
        "It will have to be drained and refilled.",
        "Fill the lighter for about five seconds.",
        "Pressing the lighter down onto the bottle will disengage the release valve on the bottle's nozzle.",
        "Press down on the lighter firmly for about five seconds to refill the lighter.",
        "After filling, if you feel like your lighter isn’t full, repeat this procedure for another five seconds.",
        "Refill cans low on fuel may take more time to refuel lighters.",
        "Some lighters have a fuel level that you can check.",
        "Check the butane level viewer if you have one to gauge the lighter's fullness.",
        "Lighters that are filled up too much will overflow.",
        "This can be dangerous, as butane can leak and catch fire when lighting.",
        "Set the desired flame height.",
        "Flip your lighter over and reset the adjuster to its starting position.",
        "Ideally, the flame should be about 1 to 1 ⁄2 inches (2.5 to 3.8 cm) tall.",
        "Before attempting to test the lighter, let the butane settle for a few minutes.",
        "Once you’ve refilled and set your flame height, give your lighter a minute or so to absorb the butane.",
        "As you wait for butane to be absorbed, check your lighter for leaks.",
        "Wipe up leaked fuel with a dampened rag.",
        "Rinse the rag frequently.",
        "If your lighter leaks, you may have to purge the fuel and refill it again.",
        "Check for obvious culprits first, like loose fasteners, before purging and refilling.",
        "Test the lighter.",
        "If there are any spills or if you smell even a hint of fumes, wait a few more minutes for these to dissipate.",
        "Hold the lighter at a safe distance from your face and ignite the flame.",
        "You may need to add more butane if the flame does not catch or seems weak.",
        "In most butane lighters, butane won't dissolve over time.",
        "Always test your lighter before refilling it to make sure that it is empty.",
        "Zippo Lighter Use authentic Zippo Lighter Fluid.",
        "Other brands of lighter fluid intended for similar lighters will work most of the time, but the Zippo fluid is recommended by the manufacturer for maintaining its condition and operation.",
        "If you use a different brand of lighter fluid, make sure it is a premium brand.",
        "Sub-par fuel may fail to ignite in your lighter.",
        "Never use charcoal lighter fluid.",
        "Charcoal lighter fluid is not made for a small container like a Zippo.",
        "Using charcoal fluid can be very dangerous.",
        "Remove the insert from the case.",
        "The insert, which includes the chimney-shaped wind guard, should be wedged inside a rectangular metal case.",
        "Use your fingers to pull the insert free of the case.",
        "Grab the chimney cap, the small rectangular portion with holes in it, and pull the lighter out.",
        "In some cases, you may need to loosen the insert by wiggling it back and forth.",
        "The refill access for Zippo lighter's (and most similarly designed lighters, too) is at the bottom of the insert.",
        "Lift the felt pad.",
        "Flip the insert over so the bottom faces up.",
        "You'll see a small circular pin.",
        "Surrounding this pin and sealing off the bottom will be a rectangular piece of felt, known as the felt pad.",
        "Lift the felt pad at the designated location with a screwdriver.",
        "The rectangular felt pad will say “LIFT TO FILL” on it.",
        "Lift the felt pad from this end to reveal the rayon balls, which look like cotton, and a wick underneath.",
        "There may also be a small hole in the center of the felt pad.",
        "Use a small screwdriver or pen and insert it into the hole.",
        "Use your tool as a lever to pull the felt pad up.",
        "Squirt in lighter fluid to refuel the lighter.",
        "While holding the felt pad back, put the tip of your lighter fluid into the lighter insert and squeeze gently.",
        "Keep squirting lighter fluid until you see the top portion of your rayon balls dampen.",
        "Be careful not to let lighter fluid drip down the outside of your Zippo or get any on your hands.",
        "Wipe up spills with a wet rag.",
        "Rinse the rag regularly while doing so to flush fuel down the drain.",
        "Refill slowly so you don’t overfill the lighter.",
        "If you add too much fluid, your lighter will leak, which can be dangerous.",
        "Push the top felt pad back down.",
        "Release your hold on the felt pad and wedge it back into place with your fingers or tool.",
        "Let the fluid soak in for about 45 seconds before flipping it right side up.",
        "Wipe the outside of your lighter with a damp clean rag or paper towel.",
        "It’s also a good idea to wash your hands before placing your lighter back into the casing.",
        "Some fluid might've transferred to your hands without you noticing.",
        "Insert your lighter back into the casing.",
        "Simply slide your Zippo back into the casing.",
        "Push down on the chimney to firmly wedge it back into place.",
        "Snap the lid shut to make sure the insert is low enough.",
        "Test your lighter.",
        "Light your Zippo to make sure that the wick is absorbing the fuel and your flint is creating a spark.",
        "If your lighter doesn't spark up, the most likely issue is the flint.",
        "Check out fixing and replacing this part in the next method.",
        "The first couple of times you light your Zippo after refilling, your flame may be bigger than usual.",
        "This is completely normal.",
        "Replacing a Flint Unstick stiff flint wheels.",
        "You shouldn't have to replace the flint of stuck flint wheels.",
        "Normal flints mechanisms have three parts: a spring, a flint, and the flint wheel.",
        "When new, these parts can stick, preventing sparks needed to ignite the flame.",
        "To resolve this issue:\nOpen the lighter.",
        "Remove the insert from the lighter case by pulling on the insert by the flame guard, which is the raised part of the insert with holes in it.",
        "Remove the flat head slotted screw fastening the flint spring at the bottom of the insert by turning it counterclockwise with a screwdriver.",
        "Pull out the screw and attached flint spring.",
        "Tap the top of the lighter to knock the flint loose.",
        "Replace the flint, spring, and refasten the screw.",
        "Your flint wheel should be unstuck.",
        "Unfasten the flint screw at the bottom of the insert to replace the flint.",
        "Pull the lighter insert from its case.",
        "Turn the insert upside down.",
        "You should see the brass screw fastening the flint spring.",
        "Unfasten this with a screwdriver or the case of the lighter.",
        "Remove the flint.",
        "While keeping the bottom of the insert oriented upward, pull out the unfastened screw and attached flint spring.",
        "Tap the insert gently into your palm to knock loose the flint so it falls into your hand.",
        "The flint will look like a very small cylinder roughly the size of the flint spring tip.",
        "Old flints can be thrown away.",
        "Replace the flint and reassemble the flint mechanism.",
        "While holding the insert so its bottom is still facing upwards, drop the new flint down into the flint hole.",
        "Reinsert the spring into the hole and refasten the screw.",
        "Test the new flint.",
        "Replace the insert back into the case.",
        "Make sure the case is seated correctly by closing the case.",
        "When the insert is correctly positioned, light the lighter as you would normally.",
        "If, after replacing the flint, your lighter still doesn't work, it might be out of fuel.",
        "Check and refill fuel as necessary."
    ]
}