{
    "title": "How to Acid Wash Black Jeans",
    "url": "https://www.wikihow.com/Acid-Wash-Black-Jeans",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Fashion Styles",
        "Color in Fashion",
        "Wearing Black"
    ],
    "steps": [
        {
            "headline": "Wear old clothes that you would not mind getting bleached.",
            "description": "Put on rubber gloves to protect your hands when handling the bleach."
        },
        {
            "headline": "Soak pumice stones, the kind used in pedicures, in laundry bleach overnight.",
            "description": "Do this in a well-ventilated place."
        },
        {
            "headline": "Combine 2 parts bleach with 1 part water in a spray bottle.",
            "description": "Shake the bottle to mix the bleach and water together. Lay your black jeans out flat."
        },
        {
            "headline": "Bunch up areas of the jeans, if desired.",
            "description": "Hold them in place with elastic hair ties."
        },
        {
            "headline": "Spray as much or as little of the bleach solution as you want on your jeans, whether bunched up or flat, in the locations where you want the acid washed look to appear.",
            "description": ""
        },
        {
            "headline": "Scrub the bleach-soaked pumice stones onto the jeans wherever you choose.",
            "description": "This will wear the denim down and help acid wash them."
        },
        {
            "headline": "Wait 10 to 15 minutes for the fading on the jeans to occur.",
            "description": ""
        },
        {
            "headline": "Set your washing machine for a small load and fill it with water.",
            "description": "Wash your acid washed black jeans several times by themselves or with clothes that are safe to be bleached."
        },
        {
            "headline": "Put your faded jeans in the dryer and dry as normal.",
            "description": "Leave them in the dryer until completely dry if you wish them to shrink. Otherwise, remove the damp jeans and hang them to dry completely."
        }
    ],
    "tyn": [
        "Old clothes",
        "Rubber gloves",
        "Sandpaper",
        "Pumice stones",
        "Bleach",
        "Water",
        "Spray bottle",
        "Jeans",
        "Washing machine",
        "Sodium bisulfate",
        "Dryer"
    ],
    "text": " Wear old clothes that you would not mind getting bleached. Put on rubber gloves to protect your hands when handling the bleach. Soak pumice stones, the kind used in pedicures, in laundry bleach overnight. Do this in a well-ventilated place. Combine 2 parts bleach with 1 part water in a spray bottle. Shake the bottle to mix the bleach and water together. Lay your black jeans out flat. Bunch up areas of the jeans, if desired. Hold them in place with elastic hair ties. Spray as much or as little of the bleach solution as you want on your jeans, whether bunched up or flat, in the locations where you want the acid washed look to appear.  Scrub the bleach-soaked pumice stones onto the jeans wherever you choose. This will wear the denim down and help acid wash them. Wait 10 to 15 minutes for the fading on the jeans to occur.  Set your washing machine for a small load and fill it with water. Wash your acid washed black jeans several times by themselves or with clothes that are safe to be bleached. Put your faded jeans in the dryer and dry as normal. Leave them in the dryer until completely dry if you wish them to shrink. Otherwise, remove the damp jeans and hang them to dry completely.",
    "sentences": [
        " Wear old clothes that you would not mind getting bleached.",
        "Put on rubber gloves to protect your hands when handling the bleach.",
        "Soak pumice stones, the kind used in pedicures, in laundry bleach overnight.",
        "Do this in a well-ventilated place.",
        "Combine 2 parts bleach with 1 part water in a spray bottle.",
        "Shake the bottle to mix the bleach and water together.",
        "Lay your black jeans out flat.",
        "Bunch up areas of the jeans, if desired.",
        "Hold them in place with elastic hair ties.",
        "Spray as much or as little of the bleach solution as you want on your jeans, whether bunched up or flat, in the locations where you want the acid washed look to appear.",
        "Scrub the bleach-soaked pumice stones onto the jeans wherever you choose.",
        "This will wear the denim down and help acid wash them.",
        "Wait 10 to 15 minutes for the fading on the jeans to occur.",
        "Set your washing machine for a small load and fill it with water.",
        "Wash your acid washed black jeans several times by themselves or with clothes that are safe to be bleached.",
        "Put your faded jeans in the dryer and dry as normal.",
        "Leave them in the dryer until completely dry if you wish them to shrink.",
        "Otherwise, remove the damp jeans and hang them to dry completely."
    ]
}