{
    "title": "How to Play Darts",
    "url": "https://www.wikihow.com/Play-Darts",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Games",
        "Darts"
    ],
    "methods": [
        {
            "name": "Understanding the Board and Scoring System",
            "steps": [
                {
                    "headline": "Know that every dart board is the same.",
                    "description": "Each board is numbered from 1 - 20 in non-sequential order around the board. You play darts by throwing a small dart onto different parts of the board, counting your points as you go."
                },
                {
                    "headline": "Notice that the board is split into distinct sections.",
                    "description": "Each section has points associated with that section. If a dart lands in the outer green or red sections, the thrower scores double that section's number of points. For example, if you land inside the double ring under 18, you would score 36 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/97\\/Play-Darts-Step-2Bullet1.jpg\\/v4-459px-Play-Darts-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/97\\/Play-Darts-Step-2Bullet1.jpg\\/v4-759px-Play-Darts-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Know what happens when the dart lands in an \"inner\" red or green section.",
                    "description": "If a dart lands in the inner small green or red sections, the thrower scores triple that section's number of points. If you land inside the triple ring under 18, for example, you would score 54 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/1e\\/Play-Darts-Step-3Bullet1.jpg\\/v4-459px-Play-Darts-Step-3Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/1e\\/Play-Darts-Step-3Bullet1.jpg\\/v4-759px-Play-Darts-Step-3Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Understand that the center of the board is called the bullseye.",
                    "description": "The bullseye is further split into two sections. The inner section (usually red) is called the \"double bull\" or \"cork,\" and the outer section (usually green) is known as the \"single bull\" or just \"bull.\" If a dart lands in the green part of the bullseye, the thrower scores 25 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a3\\/Play-Darts-Step-4Bullet1.jpg\\/v4-459px-Play-Darts-Step-4Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a3\\/Play-Darts-Step-4Bullet1.jpg\\/v4-759px-Play-Darts-Step-4Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nIf a dart lands in the red part of the bullseye, the thrower scores 50 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/99\\/Play-Darts-Step-4Bullet2.jpg\\/v4-459px-Play-Darts-Step-4Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/99\\/Play-Darts-Step-4Bullet2.jpg\\/v4-759px-Play-Darts-Step-4Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Know that the rest of the board is split into 20 separate sections, each with a number allocated to that section.",
                    "description": "If a dart lands in a (usually) yellow or black section, the thrower scores that number of points. Let's say you land an 18 in a single point area. You would receive exactly 18 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Play-Darts-Step-5Bullet1.jpg\\/v4-459px-Play-Darts-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Play-Darts-Step-5Bullet1.jpg\\/v4-759px-Play-Darts-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                }
            ]
        },
        {
            "name": "Throwing the Dart",
            "steps": [
                {
                    "headline": "Get ready for a steady stance.",
                    "description": "Leaning forwards or backwards is tempting, but offers the thrower less stability than if he/she were to stand upright. For right-handed players, keep your right foot in front and your left foot in back. Most of your weight should be resting on your right foot, although you don't want to be leaning forward excessively. For left-handed players, keep your left foot in front and your right foot in back. Most of your weight should be resting on your left foot, although you don't want to be leaning forward excessively."
                },
                {
                    "headline": "Keep both feet firmly planted.",
                    "description": "You will want to keep your balance throughout the throw. Otherwise, you may pull or push the dart off in an unintended direction."
                },
                {
                    "headline": "Get the right fingering on a dart.",
                    "description": "Take the dart in your dominant hand's palm and run it through your fingers until you find the center of gravity. Put your thumb a bit behind the center of gravity while placing at least two, and possible four, other fingers on the dart. Do what feels comfortable for you."
                },
                {
                    "headline": "Keep the tip of dart up slightly, and try to move it as straight forward and backward as possible.",
                    "description": "Any extraneous movement here means that the dart will not fly straight."
                },
                {
                    "headline": "Smoothly launch the dart straight forward.",
                    "description": "Do not throw too hard, it is unnecessary and dangerous. Darts do not need a great deal of force to stick into the dartboard. Remember, the goal of the game is to score points, not determine who is strongest."
                }
            ]
        },
        {
            "name": "Playing \"01\"",
            "steps": [
                {
                    "headline": "Know that the most common form of the game is simply known as \"01.\"",
                    "description": "The object of the game is simple. Each player must reduce his score down to zero. Why is it called \"01\" then? \"01\" refers to the fact that each player always starts a game with a score that ends in \"01\". Single player games generally start with opponents staked 301 or 501 points. In larger, team games, the starting number of points can be set as high as 1001."
                },
                {
                    "headline": "Mark the oche (pronounced /OCK-EE/).",
                    "description": "The oche is the line that a throwing player must stand behind. It is 7 feet (2.1 m) 9 ⁄4 inches (23.5 cm) or 2.37m from the face of the board."
                },
                {
                    "headline": "Throw a dart to see who goes first.",
                    "description": "The person who gets closest to the double bull gets to throw first."
                },
                {
                    "headline": "Have each player take turns throwing three darts each.",
                    "description": "The points the player scores are then subtracted from his starting total. For example, if a player is starting with 301 points, and lands 54 points, his/her new total would be 247 points."
                },
                {
                    "headline": "As each player begins to approach 0 points, care must be taken to hit only the areas that are needed.",
                    "description": "This is because of the manner in which the game is won. In order to win, or \"close-out\" as it is called, you must reach exactly zero. In addition, the dart's score that brings you down to zero must be a double. For example, if a player has 2 points left, they must score a double 1. If he/she has 18 points left, the player must score a double 9. If a double is not possible, such as a remaining total of 19 points, a player can score a single 3 first to bring the total down to 16. From there, the player can score a double 8 to finish the game."
                }
            ]
        },
        {
            "name": "Playing \"Cricket\"",
            "steps": [
                {
                    "headline": "For Cricket, only focus on numbers 15-20, plus the bull's eye.",
                    "description": "The object of the game is to \"close out\" numbers 15-20 each three times; or to hit a double of one number and a single of the same number; or to hit a triple."
                },
                {
                    "headline": "Set up a chalk board next to the darts board.",
                    "description": "In order, list the numbers 15 through 20 so that you can check off when a player has hit all three, or closed out a number."
                },
                {
                    "headline": "Know that if you have closed out a number which your opponent hasn't, and you hit that number, you are awarded that many points.",
                    "description": "For example, you've closed out 16 but your opponent hasn't; you hit the 16, which means you get 16 points."
                },
                {
                    "headline": "Know that the person who finishes with all their numbers closed out and the most points wins.",
                    "description": "It's not just who finishes first — it's who closes out with the most points. The green bull is worth 25 points and the red bull is worth 50."
                }
            ]
        }
    ],
    "tyn": [
        "A dart board",
        "Three darts per player",
        "An opponent"
    ],
    "text": " Understanding the Board and Scoring System Know that every dart board is the same. Each board is numbered from 1 - 20 in non-sequential order around the board. You play darts by throwing a small dart onto different parts of the board, counting your points as you go. Notice that the board is split into distinct sections. Each section has points associated with that section. If a dart lands in the outer green or red sections, the thrower scores double that section's number of points. For example, if you land inside the double ring under 18, you would score 36 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/97\\/Play-Darts-Step-2Bullet1.jpg\\/v4-459px-Play-Darts-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/97\\/Play-Darts-Step-2Bullet1.jpg\\/v4-759px-Play-Darts-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Know what happens when the dart lands in an \"inner\" red or green section. If a dart lands in the inner small green or red sections, the thrower scores triple that section's number of points. If you land inside the triple ring under 18, for example, you would score 54 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/1e\\/Play-Darts-Step-3Bullet1.jpg\\/v4-459px-Play-Darts-Step-3Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/1e\\/Play-Darts-Step-3Bullet1.jpg\\/v4-759px-Play-Darts-Step-3Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Understand that the center of the board is called the bullseye. The bullseye is further split into two sections. The inner section (usually red) is called the \"double bull\" or \"cork,\" and the outer section (usually green) is known as the \"single bull\" or just \"bull.\" If a dart lands in the green part of the bullseye, the thrower scores 25 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a3\\/Play-Darts-Step-4Bullet1.jpg\\/v4-459px-Play-Darts-Step-4Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a3\\/Play-Darts-Step-4Bullet1.jpg\\/v4-759px-Play-Darts-Step-4Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nIf a dart lands in the red part of the bullseye, the thrower scores 50 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/99\\/Play-Darts-Step-4Bullet2.jpg\\/v4-459px-Play-Darts-Step-4Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/99\\/Play-Darts-Step-4Bullet2.jpg\\/v4-759px-Play-Darts-Step-4Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Know that the rest of the board is split into 20 separate sections, each with a number allocated to that section. If a dart lands in a (usually) yellow or black section, the thrower scores that number of points. Let's say you land an 18 in a single point area. You would receive exactly 18 points. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Play-Darts-Step-5Bullet1.jpg\\/v4-459px-Play-Darts-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Play-Darts-Step-5Bullet1.jpg\\/v4-759px-Play-Darts-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Throwing the Dart Get ready for a steady stance. Leaning forwards or backwards is tempting, but offers the thrower less stability than if he/she were to stand upright. For right-handed players, keep your right foot in front and your left foot in back. Most of your weight should be resting on your right foot, although you don't want to be leaning forward excessively. For left-handed players, keep your left foot in front and your right foot in back. Most of your weight should be resting on your left foot, although you don't want to be leaning forward excessively. Keep both feet firmly planted. You will want to keep your balance throughout the throw. Otherwise, you may pull or push the dart off in an unintended direction. Get the right fingering on a dart. Take the dart in your dominant hand's palm and run it through your fingers until you find the center of gravity. Put your thumb a bit behind the center of gravity while placing at least two, and possible four, other fingers on the dart. Do what feels comfortable for you. Keep the tip of dart up slightly, and try to move it as straight forward and backward as possible. Any extraneous movement here means that the dart will not fly straight. Smoothly launch the dart straight forward. Do not throw too hard, it is unnecessary and dangerous. Darts do not need a great deal of force to stick into the dartboard. Remember, the goal of the game is to score points, not determine who is strongest. Playing \"01\" Know that the most common form of the game is simply known as \"01.\" The object of the game is simple. Each player must reduce his score down to zero. Why is it called \"01\" then? \"01\" refers to the fact that each player always starts a game with a score that ends in \"01\". Single player games generally start with opponents staked 301 or 501 points. In larger, team games, the starting number of points can be set as high as 1001. Mark the oche (pronounced /OCK-EE/). The oche is the line that a throwing player must stand behind. It is 7 feet (2.1 m) 9 ⁄4 inches (23.5 cm) or 2.37m from the face of the board. Throw a dart to see who goes first. The person who gets closest to the double bull gets to throw first. Have each player take turns throwing three darts each. The points the player scores are then subtracted from his starting total. For example, if a player is starting with 301 points, and lands 54 points, his/her new total would be 247 points. As each player begins to approach 0 points, care must be taken to hit only the areas that are needed. This is because of the manner in which the game is won. In order to win, or \"close-out\" as it is called, you must reach exactly zero. In addition, the dart's score that brings you down to zero must be a double. For example, if a player has 2 points left, they must score a double 1. If he/she has 18 points left, the player must score a double 9. If a double is not possible, such as a remaining total of 19 points, a player can score a single 3 first to bring the total down to 16. From there, the player can score a double 8 to finish the game. Playing \"Cricket\" For Cricket, only focus on numbers 15-20, plus the bull's eye. The object of the game is to \"close out\" numbers 15-20 each three times; or to hit a double of one number and a single of the same number; or to hit a triple. Set up a chalk board next to the darts board. In order, list the numbers 15 through 20 so that you can check off when a player has hit all three, or closed out a number. Know that if you have closed out a number which your opponent hasn't, and you hit that number, you are awarded that many points. For example, you've closed out 16 but your opponent hasn't; you hit the 16, which means you get 16 points. Know that the person who finishes with all their numbers closed out and the most points wins. It's not just who finishes first — it's who closes out with the most points. The green bull is worth 25 points and the red bull is worth 50.",
    "sentences": [
        " Understanding the Board and Scoring System Know that every dart board is the same.",
        "Each board is numbered from 1 - 20 in non-sequential order around the board.",
        "You play darts by throwing a small dart onto different parts of the board, counting your points as you go.",
        "Notice that the board is split into distinct sections.",
        "Each section has points associated with that section.",
        "If a dart lands in the outer green or red sections, the thrower scores double that section's number of points.",
        "For example, if you land inside the double ring under 18, you would score 36 points.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/97\\/Play-Darts-Step-2Bullet1.jpg\\/v4-459px-Play-Darts-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/97\\/Play-Darts-Step-2Bullet1.jpg\\/v4-759px-Play-Darts-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Know what happens when the dart lands in an \"inner\" red or green section.",
        "If a dart lands in the inner small green or red sections, the thrower scores triple that section's number of points.",
        "If you land inside the triple ring under 18, for example, you would score 54 points.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/1e\\/Play-Darts-Step-3Bullet1.jpg\\/v4-459px-Play-Darts-Step-3Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/1e\\/Play-Darts-Step-3Bullet1.jpg\\/v4-759px-Play-Darts-Step-3Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Understand that the center of the board is called the bullseye.",
        "The bullseye is further split into two sections.",
        "The inner section (usually red) is called the \"double bull\" or \"cork,\" and the outer section (usually green) is known as the \"single bull\" or just \"bull.\"",
        "If a dart lands in the green part of the bullseye, the thrower scores 25 points.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a3\\/Play-Darts-Step-4Bullet1.jpg\\/v4-459px-Play-Darts-Step-4Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a3\\/Play-Darts-Step-4Bullet1.jpg\\/v4-759px-Play-Darts-Step-4Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nIf a dart lands in the red part of the bullseye, the thrower scores 50 points.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/99\\/Play-Darts-Step-4Bullet2.jpg\\/v4-459px-Play-Darts-Step-4Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/99\\/Play-Darts-Step-4Bullet2.jpg\\/v4-759px-Play-Darts-Step-4Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Know that the rest of the board is split into 20 separate sections, each with a number allocated to that section.",
        "If a dart lands in a (usually) yellow or black section, the thrower scores that number of points.",
        "Let's say you land an 18 in a single point area.",
        "You would receive exactly 18 points.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Play-Darts-Step-5Bullet1.jpg\\/v4-459px-Play-Darts-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Play-Darts-Step-5Bullet1.jpg\\/v4-759px-Play-Darts-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Throwing the Dart Get ready for a steady stance.",
        "Leaning forwards or backwards is tempting, but offers the thrower less stability than if he/she were to stand upright.",
        "For right-handed players, keep your right foot in front and your left foot in back.",
        "Most of your weight should be resting on your right foot, although you don't want to be leaning forward excessively.",
        "For left-handed players, keep your left foot in front and your right foot in back.",
        "Most of your weight should be resting on your left foot, although you don't want to be leaning forward excessively.",
        "Keep both feet firmly planted.",
        "You will want to keep your balance throughout the throw.",
        "Otherwise, you may pull or push the dart off in an unintended direction.",
        "Get the right fingering on a dart.",
        "Take the dart in your dominant hand's palm and run it through your fingers until you find the center of gravity.",
        "Put your thumb a bit behind the center of gravity while placing at least two, and possible four, other fingers on the dart.",
        "Do what feels comfortable for you.",
        "Keep the tip of dart up slightly, and try to move it as straight forward and backward as possible.",
        "Any extraneous movement here means that the dart will not fly straight.",
        "Smoothly launch the dart straight forward.",
        "Do not throw too hard, it is unnecessary and dangerous.",
        "Darts do not need a great deal of force to stick into the dartboard.",
        "Remember, the goal of the game is to score points, not determine who is strongest.",
        "Playing \"01\" Know that the most common form of the game is simply known as \"01.\"",
        "The object of the game is simple.",
        "Each player must reduce his score down to zero.",
        "Why is it called \"01\" then?",
        "\"01\" refers to the fact that each player always starts a game with a score that ends in \"01\".",
        "Single player games generally start with opponents staked 301 or 501 points.",
        "In larger, team games, the starting number of points can be set as high as 1001.",
        "Mark the oche (pronounced /OCK-EE/).",
        "The oche is the line that a throwing player must stand behind.",
        "It is 7 feet (2.1 m) 9 ⁄4 inches (23.5 cm) or 2.37m from the face of the board.",
        "Throw a dart to see who goes first.",
        "The person who gets closest to the double bull gets to throw first.",
        "Have each player take turns throwing three darts each.",
        "The points the player scores are then subtracted from his starting total.",
        "For example, if a player is starting with 301 points, and lands 54 points, his/her new total would be 247 points.",
        "As each player begins to approach 0 points, care must be taken to hit only the areas that are needed.",
        "This is because of the manner in which the game is won.",
        "In order to win, or \"close-out\" as it is called, you must reach exactly zero.",
        "In addition, the dart's score that brings you down to zero must be a double.",
        "For example, if a player has 2 points left, they must score a double 1.",
        "If he/she has 18 points left, the player must score a double 9.",
        "If a double is not possible, such as a remaining total of 19 points, a player can score a single 3 first to bring the total down to 16.",
        "From there, the player can score a double 8 to finish the game.",
        "Playing \"Cricket\" For Cricket, only focus on numbers 15-20, plus the bull's eye.",
        "The object of the game is to \"close out\" numbers 15-20 each three times; or to hit a double of one number and a single of the same number; or to hit a triple.",
        "Set up a chalk board next to the darts board.",
        "In order, list the numbers 15 through 20 so that you can check off when a player has hit all three, or closed out a number.",
        "Know that if you have closed out a number which your opponent hasn't, and you hit that number, you are awarded that many points.",
        "For example, you've closed out 16 but your opponent hasn't; you hit the 16, which means you get 16 points.",
        "Know that the person who finishes with all their numbers closed out and the most points wins.",
        "It's not just who finishes first — it's who closes out with the most points.",
        "The green bull is worth 25 points and the red bull is worth 50."
    ]
}