{
    "title": "How to Color Sand",
    "url": "https://www.wikihow.com/Color-Sand",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Craft for Kids"
    ],
    "methods": [
        {
            "name": "Using Liquid Food Coloring",
            "steps": [
                {
                    "headline": "Get some light-colored sand.",
                    "description": "You can buy sand in hardware stores, art stores, and in aquarium-supply stores. If you already have access to sand, you can use that instead, as long as it is light enough. Try to get the lightest color of sand you can find; white would be the best because it will allow the colors to show up better. You can use this method to tint sand at the beach and make brightly colored sandcastles with it."
                },
                {
                    "headline": "Divide the sand into plastic zippered bags.",
                    "description": "You will need one bag for each color of sand that you will be making. Leave enough room in each bag so that you can shake the sand. How much sand you put into each bag is up to you. Anywhere between ¼ and 1 cup (95 and 379 grams) will be plenty. Consider dampening the sand with water. This will make it easier to mix the food coloring into it."
                },
                {
                    "headline": "Add a few drops of food coloring into each bag.",
                    "description": "Plan on using 3 to 4 drops of food coloring for every ¼ cup (95 grams) of sand. If you used 1 cup (379 grams) of sand, 12 to 16 drops of food coloring will be plenty. You can also use liquid watercolor, but you may need to add more than just a few drops. Liquid watercolor comes in small bottles and is already diluted with water. Do not use liquid watercolor if you are doing this at the beach. Food coloring is safe for the animals, but liquid watercolor is not."
                },
                {
                    "headline": "Close the bags tightly, then shake and squeeze them to mix the sand.",
                    "description": "Zip the bags shut tightly first. Next, shake the bags to help distribute the food coloring. You can also gently squeeze and massage the sand through the bags. Keep doing this until the color is even. Add more food coloring if the color is too light for you. Keep in mind that the sand will dry lighter."
                },
                {
                    "headline": "Transfer the sand to baking sheets.",
                    "description": "Make sure that you use a clean baking sheet for each color of sand. Spread the sand across each baking sheet as thinly as you can. If you don't have enough baking sheets, you can use trays and shallow dishes."
                },
                {
                    "headline": "Allow the sand to dry overnight.",
                    "description": "If you don't want to wait that long, you can dry the sand in a preheated oven at 200 °F (93 °C) for 5 to 10 minutes. When the sand is almost dry, take it out of the oven and let it finish air drying for a few hours. Don't let the sand dry completely in the oven. If you do, the color may fade. Do not bake sand that's been colored with liquid watercolor."
                },
                {
                    "headline": "Use your sand.",
                    "description": "Fill vases with it to create beautiful, layered designs. Draw a picture on a sheet of paper with glue, then sprinkle the sand over it. Avoid getting the sand wet, however. Even though the food coloring will have stained it, there is a slight chance that it may come off on your hands if the sand gets wet. Do not put the sand in water or aquariums. It will bleed into the water."
                }
            ]
        },
        {
            "name": "Using Paint Powder or Colored Chalk",
            "steps": [
                {
                    "headline": "Purchase a bag of light-colored sand.",
                    "description": "White sand would be even better because the colors will show up brighter. You can find bags of sand in craft stores, hardware stores, and even in aquarium-supply stores. This method is not safe to use at the beach. Paint and chalk contain ingredients that could be harmful to the aquatic life."
                },
                {
                    "headline": "Place 5 tablespoons (118 grams) of sand into a zippered bag.",
                    "description": "This will be enough for one color. If you want to make more colors, you will need to fill more bags with more sand. You can also put the sand into a cup or bowl instead."
                },
                {
                    "headline": "Mist the sand with water, if desired.",
                    "description": "You don't have to do this, but many people find that it helps the paint powder stick to the sand better. The easiest way to do this would be with a spray bottle, but you can also stir a small spoonful of water into the sand instead."
                },
                {
                    "headline": "Add 1 tablespoon of tempera paint powder into the sand.",
                    "description": "You can add more paint powder later on, if you want to, but start with this amount first. You can find paint powder in arts and crafts stores. It is simply dried, powdered tempera paint. You can also use sidewalk chalk or a chalk pastel (not oil). Grind it up first using a craft blade, food grater, or sandpaper."
                },
                {
                    "headline": "Zip the bags shut and shake them to distribute the powder evenly.",
                    "description": "If you need to, gently squeeze and massage the bags to help work the paint powder into the sand. If you are mixing the sand in a bowl, simply stir it with a fork or spoon."
                },
                {
                    "headline": "Spread the colored sand out on a baking sheet to dry.",
                    "description": "Open the bag up, and spread the sand on a baking sheet or tray. Leave the sand out for a few hours so that it can dry. If you play with the wet sand too soon, the paint powder my come off on your hands. If you made multiple colors of sand, use a different tray or baking sheet for each one. If you did not dampen the sand, you do not have to dry it. It is ready to play with!"
                },
                {
                    "headline": "Play with the sand.",
                    "description": "Use the sand to make beautiful sand art. Fill vases with it, or sprinkle it over drawings made from glue. Don't let the sand get wet, otherwise the color may come off on your hands."
                }
            ]
        },
        {
            "name": "Making Fake Colored Sand",
            "steps": [
                {
                    "headline": "Purchase a bag of Epsom salt.",
                    "description": "You can find this salt in pharmacies. It is often added to bathes to soothe aching muscles. Although it contains the word \"salt,\" this product is not edible. Thanks to its pure-white color, however, the food coloring will show up much better compared to real sand. Regular table salt will also work for this method. If you want to make edible colored sand, use white, granulated sugar instead."
                },
                {
                    "headline": "Divide the salt into several zippered bags.",
                    "description": "How many bags you use depends on how many colors you want to make. You will need one bag for each color. Don't fill the bags more than half-way, however; you will need that extra room to shake the salt."
                },
                {
                    "headline": "Add 5 to 10 drops of liquid food coloring into each bag.",
                    "description": "Smaller amounts of sugar will need just 5 drops, while larger amounts will need up to 10. Don't worry if this doesn't look like it will be enough; you can always add more drops later!"
                },
                {
                    "headline": "Zip the bags close, then shake them.",
                    "description": "Make sure that the bags are tightly closed first. Next, shake the bags in order to mix the food coloring into the salt. You can even squish the bags to help distribute the food coloring further."
                },
                {
                    "headline": "Add more food coloring, if desired.",
                    "description": "If the salt did not turn out bright enough for you, open the bags up and add in a couple more drops of food coloring. Zip the bags shut and shake them again. Keep doing this until you get the color you want."
                },
                {
                    "headline": "Open the bags and let the salt dry.",
                    "description": "How long this takes depends on how dry or humid it is in your home. For most people, this will take overnight. You can speed up the drying process by spreading the salt out on a baking sheet or tray. Make sure that you use a separate sheet/tray for each color, however."
                },
                {
                    "headline": "Play with the sand, but don't let it get wet.",
                    "description": "If it gets wet, it will melt! You can use this sand to fill vases in colorful layers. You can also use it to make sand art. For example, you can draw a picture on paper with school glue, then sprinkle the salt over it to create a sand painting. You can use edible sugar sand to decorate cakes, cupcakes, or even a tropical-themed gingerbread house!"
                }
            ]
        }
    ],
    "tyn": [
        "Using Liquid Food Coloring",
        "White or light-colored sand",
        "Plastic zippered bags",
        "Liquid food coloring",
        "Baking sheets or trays",
        "Using Paint Powder or Colored Chalk",
        "Tempera paint powder, sidewalk chalk, or chalk pastels",
        "Craft blade, food grater, or sandpaper (if using chalk)",
        "Making Fake Colored Sand",
        "Epsom salt, table salt, or white, granulated sugar",
        "Injecting Some Color",
        "2 Buckets",
        "Sand",
        "Sifter",
        "Window screen",
        "Duct tape",
        "Water",
        "Assorted dyes",
        "Containers with lids",
        "Storage bags",
        "Spoons",
        "Paper plates",
        "Paper towel"
    ],
    "text": " Using Liquid Food Coloring Get some light-colored sand. You can buy sand in hardware stores, art stores, and in aquarium-supply stores. If you already have access to sand, you can use that instead, as long as it is light enough. Try to get the lightest color of sand you can find; white would be the best because it will allow the colors to show up better. You can use this method to tint sand at the beach and make brightly colored sandcastles with it. Divide the sand into plastic zippered bags. You will need one bag for each color of sand that you will be making. Leave enough room in each bag so that you can shake the sand. How much sand you put into each bag is up to you. Anywhere between ¼ and 1 cup (95 and 379 grams) will be plenty. Consider dampening the sand with water. This will make it easier to mix the food coloring into it. Add a few drops of food coloring into each bag. Plan on using 3 to 4 drops of food coloring for every ¼ cup (95 grams) of sand. If you used 1 cup (379 grams) of sand, 12 to 16 drops of food coloring will be plenty. You can also use liquid watercolor, but you may need to add more than just a few drops. Liquid watercolor comes in small bottles and is already diluted with water. Do not use liquid watercolor if you are doing this at the beach. Food coloring is safe for the animals, but liquid watercolor is not. Close the bags tightly, then shake and squeeze them to mix the sand. Zip the bags shut tightly first. Next, shake the bags to help distribute the food coloring. You can also gently squeeze and massage the sand through the bags. Keep doing this until the color is even. Add more food coloring if the color is too light for you. Keep in mind that the sand will dry lighter. Transfer the sand to baking sheets. Make sure that you use a clean baking sheet for each color of sand. Spread the sand across each baking sheet as thinly as you can. If you don't have enough baking sheets, you can use trays and shallow dishes. Allow the sand to dry overnight. If you don't want to wait that long, you can dry the sand in a preheated oven at 200 °F (93 °C) for 5 to 10 minutes. When the sand is almost dry, take it out of the oven and let it finish air drying for a few hours. Don't let the sand dry completely in the oven. If you do, the color may fade. Do not bake sand that's been colored with liquid watercolor. Use your sand. Fill vases with it to create beautiful, layered designs. Draw a picture on a sheet of paper with glue, then sprinkle the sand over it. Avoid getting the sand wet, however. Even though the food coloring will have stained it, there is a slight chance that it may come off on your hands if the sand gets wet. Do not put the sand in water or aquariums. It will bleed into the water. Using Paint Powder or Colored Chalk Purchase a bag of light-colored sand. White sand would be even better because the colors will show up brighter. You can find bags of sand in craft stores, hardware stores, and even in aquarium-supply stores. This method is not safe to use at the beach. Paint and chalk contain ingredients that could be harmful to the aquatic life. Place 5 tablespoons (118 grams) of sand into a zippered bag. This will be enough for one color. If you want to make more colors, you will need to fill more bags with more sand. You can also put the sand into a cup or bowl instead. Mist the sand with water, if desired. You don't have to do this, but many people find that it helps the paint powder stick to the sand better. The easiest way to do this would be with a spray bottle, but you can also stir a small spoonful of water into the sand instead. Add 1 tablespoon of tempera paint powder into the sand. You can add more paint powder later on, if you want to, but start with this amount first. You can find paint powder in arts and crafts stores. It is simply dried, powdered tempera paint. You can also use sidewalk chalk or a chalk pastel (not oil). Grind it up first using a craft blade, food grater, or sandpaper. Zip the bags shut and shake them to distribute the powder evenly. If you need to, gently squeeze and massage the bags to help work the paint powder into the sand. If you are mixing the sand in a bowl, simply stir it with a fork or spoon. Spread the colored sand out on a baking sheet to dry. Open the bag up, and spread the sand on a baking sheet or tray. Leave the sand out for a few hours so that it can dry. If you play with the wet sand too soon, the paint powder my come off on your hands. If you made multiple colors of sand, use a different tray or baking sheet for each one. If you did not dampen the sand, you do not have to dry it. It is ready to play with! Play with the sand. Use the sand to make beautiful sand art. Fill vases with it, or sprinkle it over drawings made from glue. Don't let the sand get wet, otherwise the color may come off on your hands. Making Fake Colored Sand Purchase a bag of Epsom salt. You can find this salt in pharmacies. It is often added to bathes to soothe aching muscles. Although it contains the word \"salt,\" this product is not edible. Thanks to its pure-white color, however, the food coloring will show up much better compared to real sand. Regular table salt will also work for this method. If you want to make edible colored sand, use white, granulated sugar instead. Divide the salt into several zippered bags. How many bags you use depends on how many colors you want to make. You will need one bag for each color. Don't fill the bags more than half-way, however; you will need that extra room to shake the salt. Add 5 to 10 drops of liquid food coloring into each bag. Smaller amounts of sugar will need just 5 drops, while larger amounts will need up to 10. Don't worry if this doesn't look like it will be enough; you can always add more drops later! Zip the bags close, then shake them. Make sure that the bags are tightly closed first. Next, shake the bags in order to mix the food coloring into the salt. You can even squish the bags to help distribute the food coloring further. Add more food coloring, if desired. If the salt did not turn out bright enough for you, open the bags up and add in a couple more drops of food coloring. Zip the bags shut and shake them again. Keep doing this until you get the color you want. Open the bags and let the salt dry. How long this takes depends on how dry or humid it is in your home. For most people, this will take overnight. You can speed up the drying process by spreading the salt out on a baking sheet or tray. Make sure that you use a separate sheet/tray for each color, however. Play with the sand, but don't let it get wet. If it gets wet, it will melt! You can use this sand to fill vases in colorful layers. You can also use it to make sand art. For example, you can draw a picture on paper with school glue, then sprinkle the salt over it to create a sand painting. You can use edible sugar sand to decorate cakes, cupcakes, or even a tropical-themed gingerbread house!",
    "sentences": [
        " Using Liquid Food Coloring Get some light-colored sand.",
        "You can buy sand in hardware stores, art stores, and in aquarium-supply stores.",
        "If you already have access to sand, you can use that instead, as long as it is light enough.",
        "Try to get the lightest color of sand you can find; white would be the best because it will allow the colors to show up better.",
        "You can use this method to tint sand at the beach and make brightly colored sandcastles with it.",
        "Divide the sand into plastic zippered bags.",
        "You will need one bag for each color of sand that you will be making.",
        "Leave enough room in each bag so that you can shake the sand.",
        "How much sand you put into each bag is up to you.",
        "Anywhere between ¼ and 1 cup (95 and 379 grams) will be plenty.",
        "Consider dampening the sand with water.",
        "This will make it easier to mix the food coloring into it.",
        "Add a few drops of food coloring into each bag.",
        "Plan on using 3 to 4 drops of food coloring for every ¼ cup (95 grams) of sand.",
        "If you used 1 cup (379 grams) of sand, 12 to 16 drops of food coloring will be plenty.",
        "You can also use liquid watercolor, but you may need to add more than just a few drops.",
        "Liquid watercolor comes in small bottles and is already diluted with water.",
        "Do not use liquid watercolor if you are doing this at the beach.",
        "Food coloring is safe for the animals, but liquid watercolor is not.",
        "Close the bags tightly, then shake and squeeze them to mix the sand.",
        "Zip the bags shut tightly first.",
        "Next, shake the bags to help distribute the food coloring.",
        "You can also gently squeeze and massage the sand through the bags.",
        "Keep doing this until the color is even.",
        "Add more food coloring if the color is too light for you.",
        "Keep in mind that the sand will dry lighter.",
        "Transfer the sand to baking sheets.",
        "Make sure that you use a clean baking sheet for each color of sand.",
        "Spread the sand across each baking sheet as thinly as you can.",
        "If you don't have enough baking sheets, you can use trays and shallow dishes.",
        "Allow the sand to dry overnight.",
        "If you don't want to wait that long, you can dry the sand in a preheated oven at 200 °F (93 °C) for 5 to 10 minutes.",
        "When the sand is almost dry, take it out of the oven and let it finish air drying for a few hours.",
        "Don't let the sand dry completely in the oven.",
        "If you do, the color may fade.",
        "Do not bake sand that's been colored with liquid watercolor.",
        "Use your sand.",
        "Fill vases with it to create beautiful, layered designs.",
        "Draw a picture on a sheet of paper with glue, then sprinkle the sand over it.",
        "Avoid getting the sand wet, however.",
        "Even though the food coloring will have stained it, there is a slight chance that it may come off on your hands if the sand gets wet.",
        "Do not put the sand in water or aquariums.",
        "It will bleed into the water.",
        "Using Paint Powder or Colored Chalk Purchase a bag of light-colored sand.",
        "White sand would be even better because the colors will show up brighter.",
        "You can find bags of sand in craft stores, hardware stores, and even in aquarium-supply stores.",
        "This method is not safe to use at the beach.",
        "Paint and chalk contain ingredients that could be harmful to the aquatic life.",
        "Place 5 tablespoons (118 grams) of sand into a zippered bag.",
        "This will be enough for one color.",
        "If you want to make more colors, you will need to fill more bags with more sand.",
        "You can also put the sand into a cup or bowl instead.",
        "Mist the sand with water, if desired.",
        "You don't have to do this, but many people find that it helps the paint powder stick to the sand better.",
        "The easiest way to do this would be with a spray bottle, but you can also stir a small spoonful of water into the sand instead.",
        "Add 1 tablespoon of tempera paint powder into the sand.",
        "You can add more paint powder later on, if you want to, but start with this amount first.",
        "You can find paint powder in arts and crafts stores.",
        "It is simply dried, powdered tempera paint.",
        "You can also use sidewalk chalk or a chalk pastel (not oil).",
        "Grind it up first using a craft blade, food grater, or sandpaper.",
        "Zip the bags shut and shake them to distribute the powder evenly.",
        "If you need to, gently squeeze and massage the bags to help work the paint powder into the sand.",
        "If you are mixing the sand in a bowl, simply stir it with a fork or spoon.",
        "Spread the colored sand out on a baking sheet to dry.",
        "Open the bag up, and spread the sand on a baking sheet or tray.",
        "Leave the sand out for a few hours so that it can dry.",
        "If you play with the wet sand too soon, the paint powder my come off on your hands.",
        "If you made multiple colors of sand, use a different tray or baking sheet for each one.",
        "If you did not dampen the sand, you do not have to dry it.",
        "It is ready to play with!",
        "Play with the sand.",
        "Use the sand to make beautiful sand art.",
        "Fill vases with it, or sprinkle it over drawings made from glue.",
        "Don't let the sand get wet, otherwise the color may come off on your hands.",
        "Making Fake Colored Sand Purchase a bag of Epsom salt.",
        "You can find this salt in pharmacies.",
        "It is often added to bathes to soothe aching muscles.",
        "Although it contains the word \"salt,\" this product is not edible.",
        "Thanks to its pure-white color, however, the food coloring will show up much better compared to real sand.",
        "Regular table salt will also work for this method.",
        "If you want to make edible colored sand, use white, granulated sugar instead.",
        "Divide the salt into several zippered bags.",
        "How many bags you use depends on how many colors you want to make.",
        "You will need one bag for each color.",
        "Don't fill the bags more than half-way, however; you will need that extra room to shake the salt.",
        "Add 5 to 10 drops of liquid food coloring into each bag.",
        "Smaller amounts of sugar will need just 5 drops, while larger amounts will need up to 10.",
        "Don't worry if this doesn't look like it will be enough; you can always add more drops later!",
        "Zip the bags close, then shake them.",
        "Make sure that the bags are tightly closed first.",
        "Next, shake the bags in order to mix the food coloring into the salt.",
        "You can even squish the bags to help distribute the food coloring further.",
        "Add more food coloring, if desired.",
        "If the salt did not turn out bright enough for you, open the bags up and add in a couple more drops of food coloring.",
        "Zip the bags shut and shake them again.",
        "Keep doing this until you get the color you want.",
        "Open the bags and let the salt dry.",
        "How long this takes depends on how dry or humid it is in your home.",
        "For most people, this will take overnight.",
        "You can speed up the drying process by spreading the salt out on a baking sheet or tray.",
        "Make sure that you use a separate sheet/tray for each color, however.",
        "Play with the sand, but don't let it get wet.",
        "If it gets wet, it will melt!",
        "You can use this sand to fill vases in colorful layers.",
        "You can also use it to make sand art.",
        "For example, you can draw a picture on paper with school glue, then sprinkle the salt over it to create a sand painting.",
        "You can use edible sugar sand to decorate cakes, cupcakes, or even a tropical-themed gingerbread house!"
    ]
}