{
    "title": "How to Install a Kitchen Faucet",
    "url": "https://www.wikihow.com/Install-a-Kitchen-Faucet",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Removing the Existing Faucet",
            "steps": [
                {
                    "headline": "Close the water valves and unplug your garbage disposal underneath the sink.",
                    "description": "Open the cabinets under your sink and find the knobs that control the water valves attached to your pipes. Turn the knobs so they’re perpendicular to the pipes to close them. If you have a garbage disposal or P-trap under your sink, unplug it or disconnect the power before moving on. Depending on your sink, you may have 1 or 2 water valves."
                },
                {
                    "headline": "Turn on your existing faucet to relieve any water pressure.",
                    "description": "After turning off the valves, lift or turn the handles to your existing faucet to clear out any water that may still be trapped in the pipes. Keep the faucet on so there isn’t a buildup of pressure in your valves."
                },
                {
                    "headline": "Loosen the nuts attached to the water lines.",
                    "description": "Your water lines are hoses connected together with hexagonal nuts. Use an adjustable wrench to unscrew the nuts from the hoses until you can start turning them in your fingers. Detach all the hoses from your current faucet. Place a bucket or towel underneath your valves in case any water still leaks out."
                },
                {
                    "headline": "Use a basin wrench to remove the nuts from the faucet.",
                    "description": "A basin wrench is a long-handled tool that makes it easier to reach underneath your sink. Adjust the length of the wrench handle and place the jaws of the wrench around the nut underneath your faucet. Grab the nut from the left side and turn the wrench counterclockwise to loosen it completely. Basin wrenches can be purchased from your local hardware store.Tip: Have someone help you hold the faucet from above so it doesn’t spin while you loosen the nut."
                },
                {
                    "headline": "Pull the faucet out of the sink and clean any grime or residue.",
                    "description": "Once you remove the nuts from the water lines and the faucet, simply pull the faucet up and out of the hole in your sink. Use a multipurpose cleaner and an old washcloth to lift up any grime that may have developed around the old faucet. If you’re having trouble removing any grime, let the cleaner sit on it for 1 minute before trying to scrub it off again."
                }
            ]
        },
        {
            "name": "Putting in the New Faucet",
            "steps": [
                {
                    "headline": "Assemble the new faucet if needed.",
                    "description": "Choose a new faucet that matches the style of your old faucet. Wrap 3 layers of Teflon tape around the threading of the supply tubes that came with your faucet. Then screw the supply tubes onto the faucet fixture using an adjustable wrench. Don’t use any excessive force when you attach the tubes. Find a faucet that matches the color of your other hardware, such as your appliances or cabinet handles. Each faucet is different. Carefully follow the instructions inside the packaging to make sure you’re assembling it correctly."
                },
                {
                    "headline": "Cover any additional holes in your sink with trim rings or a deck plate.",
                    "description": "Some sinks will have multiple holes to accommodate different types of faucets. If you’re not using all of the holes, set trim rings or a deck plate over the top of them. Align the deck plate so it isn’t crooked before securing it underneath your sink with the nuts provided in the packaging. Tighten the nuts under your sink using an adjustable or basin wrench. Deck plates and trim rings can be purchased at your local home improvement store. You can’t use a faucet that requires more holes than what your sink already has. For example, a faucet that requires 3 holes cannot be put into a sink with 1 hole.Tip: If you have additional holes left in your sink, you can use them for a built-in soap dispenser or a sink sprayer."
                },
                {
                    "headline": "Feed the supply tubes into the hole and position the new faucet.",
                    "description": "Align the faucet over the holes in your sink. Feed the tubes through the center hole one at a time so they’re easier to manage. After the tubes are in, lower the faucet onto the sink and hold it in the position where you want to secure it. Put the tubes through the hole slowly in case there are any sharp edges that could cut through them. Faucets with 2 handles usually have a 3-hole setup, while those with a single handle only require 1 hole."
                },
                {
                    "headline": "Secure the faucet by tightening the nuts with your basin wrench.",
                    "description": "Have a helper hold the faucet from above the sink so it doesn’t shift or move around. Screw on the nut with your fingers first, and then use your basin wrench from the right side to turn it clockwise. Don’t use too much force while tightening the nuts."
                },
                {
                    "headline": "Connect the sink sprayer to the faucet if you have one.",
                    "description": "Set the sprayer base in one of the holes in your sink and screw on the mounting nut to secure it in place. Feed the sprayer hose through the base and attach the end of the hose to the bottom port on your faucet. Depending on the type of sprayer, you may just have to push the hose in place or screw it together. Your faucet needs to come with a sprayer in order to attach one to your sink."
                },
                {
                    "headline": "Attach the water lines to the faucet supply hoses and reconnect your disposal.",
                    "description": "Hold the supply hoses from the faucet up to the water lines with the nuts attached to them. Screw the nuts onto the supply lines until they’re finger-tight. If you had to disconnect a garbage disposal earlier, plug it back in. Wrap 3 layers of Teflon tape around the threading of each supply line if you want additional protection from leaks. For faucets with 2 handles, make sure the hot water line is connected to the side that controls hot water, and the cold water line is attached to the cold handle."
                }
            ]
        },
        {
            "name": "Cleaning out Debris",
            "steps": [
                {
                    "headline": "Unscrew the aerator from the end of the faucet.",
                    "description": "The aerator is a thin layer of metal mesh used to help control the water flow, and is located on the end of the faucet. Turn the aerator counterclockwise to remove it from the end of your faucet. Check the instruction manual for your faucet to see how to remove it from your exact model."
                },
                {
                    "headline": "Turn the water valves back on.",
                    "description": "Rotate the valve so they’re in line with the supply tubes again. Check if there are any leaks coming out where the supply lines and valves connect. If so, turn the valve off and tighten the nuts with your wrench again. Keep a towel or bucket underneath your valves until you’re sure they don’t leak anymore."
                },
                {
                    "headline": "Turn on your faucet and let the water run for 2-3 minutes.",
                    "description": "Lift or turn the handles on your faucet so the water runs out. Keep the faucet on for a few minutes so any debris or dust inside gets flushed out. If your faucet has 2 handles, turn both of them on to clear out all of the lines.Tip: Check underneath your sink while the water is running to see if you notice any leaks. If so, tighten the nuts on the water lines."
                },
                {
                    "headline": "Replace the aerator.",
                    "description": "Turn off your faucet and screw the aerator clockwise back into place. Once it’s reattached, you can use your new faucet!"
                }
            ]
        }
    ],
    "tyn": [
        "Bucket",
        "Towel",
        "Adjustable wrench",
        "Basin wrench",
        "Multipurpose cleaner",
        "Cleaning cloth"
    ],
    "text": " Removing the Existing Faucet Close the water valves and unplug your garbage disposal underneath the sink. Open the cabinets under your sink and find the knobs that control the water valves attached to your pipes. Turn the knobs so they’re perpendicular to the pipes to close them. If you have a garbage disposal or P-trap under your sink, unplug it or disconnect the power before moving on. Depending on your sink, you may have 1 or 2 water valves. Turn on your existing faucet to relieve any water pressure. After turning off the valves, lift or turn the handles to your existing faucet to clear out any water that may still be trapped in the pipes. Keep the faucet on so there isn’t a buildup of pressure in your valves. Loosen the nuts attached to the water lines. Your water lines are hoses connected together with hexagonal nuts. Use an adjustable wrench to unscrew the nuts from the hoses until you can start turning them in your fingers. Detach all the hoses from your current faucet. Place a bucket or towel underneath your valves in case any water still leaks out. Use a basin wrench to remove the nuts from the faucet. A basin wrench is a long-handled tool that makes it easier to reach underneath your sink. Adjust the length of the wrench handle and place the jaws of the wrench around the nut underneath your faucet. Grab the nut from the left side and turn the wrench counterclockwise to loosen it completely. Basin wrenches can be purchased from your local hardware store.Tip: Have someone help you hold the faucet from above so it doesn’t spin while you loosen the nut. Pull the faucet out of the sink and clean any grime or residue. Once you remove the nuts from the water lines and the faucet, simply pull the faucet up and out of the hole in your sink. Use a multipurpose cleaner and an old washcloth to lift up any grime that may have developed around the old faucet. If you’re having trouble removing any grime, let the cleaner sit on it for 1 minute before trying to scrub it off again. Putting in the New Faucet Assemble the new faucet if needed. Choose a new faucet that matches the style of your old faucet. Wrap 3 layers of Teflon tape around the threading of the supply tubes that came with your faucet. Then screw the supply tubes onto the faucet fixture using an adjustable wrench. Don’t use any excessive force when you attach the tubes. Find a faucet that matches the color of your other hardware, such as your appliances or cabinet handles. Each faucet is different. Carefully follow the instructions inside the packaging to make sure you’re assembling it correctly. Cover any additional holes in your sink with trim rings or a deck plate. Some sinks will have multiple holes to accommodate different types of faucets. If you’re not using all of the holes, set trim rings or a deck plate over the top of them. Align the deck plate so it isn’t crooked before securing it underneath your sink with the nuts provided in the packaging. Tighten the nuts under your sink using an adjustable or basin wrench. Deck plates and trim rings can be purchased at your local home improvement store. You can’t use a faucet that requires more holes than what your sink already has. For example, a faucet that requires 3 holes cannot be put into a sink with 1 hole.Tip: If you have additional holes left in your sink, you can use them for a built-in soap dispenser or a sink sprayer. Feed the supply tubes into the hole and position the new faucet. Align the faucet over the holes in your sink. Feed the tubes through the center hole one at a time so they’re easier to manage. After the tubes are in, lower the faucet onto the sink and hold it in the position where you want to secure it. Put the tubes through the hole slowly in case there are any sharp edges that could cut through them. Faucets with 2 handles usually have a 3-hole setup, while those with a single handle only require 1 hole. Secure the faucet by tightening the nuts with your basin wrench. Have a helper hold the faucet from above the sink so it doesn’t shift or move around. Screw on the nut with your fingers first, and then use your basin wrench from the right side to turn it clockwise. Don’t use too much force while tightening the nuts. Connect the sink sprayer to the faucet if you have one. Set the sprayer base in one of the holes in your sink and screw on the mounting nut to secure it in place. Feed the sprayer hose through the base and attach the end of the hose to the bottom port on your faucet. Depending on the type of sprayer, you may just have to push the hose in place or screw it together. Your faucet needs to come with a sprayer in order to attach one to your sink. Attach the water lines to the faucet supply hoses and reconnect your disposal. Hold the supply hoses from the faucet up to the water lines with the nuts attached to them. Screw the nuts onto the supply lines until they’re finger-tight. If you had to disconnect a garbage disposal earlier, plug it back in. Wrap 3 layers of Teflon tape around the threading of each supply line if you want additional protection from leaks. For faucets with 2 handles, make sure the hot water line is connected to the side that controls hot water, and the cold water line is attached to the cold handle. Cleaning out Debris Unscrew the aerator from the end of the faucet. The aerator is a thin layer of metal mesh used to help control the water flow, and is located on the end of the faucet. Turn the aerator counterclockwise to remove it from the end of your faucet. Check the instruction manual for your faucet to see how to remove it from your exact model. Turn the water valves back on. Rotate the valve so they’re in line with the supply tubes again. Check if there are any leaks coming out where the supply lines and valves connect. If so, turn the valve off and tighten the nuts with your wrench again. Keep a towel or bucket underneath your valves until you’re sure they don’t leak anymore. Turn on your faucet and let the water run for 2-3 minutes. Lift or turn the handles on your faucet so the water runs out. Keep the faucet on for a few minutes so any debris or dust inside gets flushed out. If your faucet has 2 handles, turn both of them on to clear out all of the lines.Tip: Check underneath your sink while the water is running to see if you notice any leaks. If so, tighten the nuts on the water lines. Replace the aerator. Turn off your faucet and screw the aerator clockwise back into place. Once it’s reattached, you can use your new faucet!",
    "sentences": [
        " Removing the Existing Faucet Close the water valves and unplug your garbage disposal underneath the sink.",
        "Open the cabinets under your sink and find the knobs that control the water valves attached to your pipes.",
        "Turn the knobs so they’re perpendicular to the pipes to close them.",
        "If you have a garbage disposal or P-trap under your sink, unplug it or disconnect the power before moving on.",
        "Depending on your sink, you may have 1 or 2 water valves.",
        "Turn on your existing faucet to relieve any water pressure.",
        "After turning off the valves, lift or turn the handles to your existing faucet to clear out any water that may still be trapped in the pipes.",
        "Keep the faucet on so there isn’t a buildup of pressure in your valves.",
        "Loosen the nuts attached to the water lines.",
        "Your water lines are hoses connected together with hexagonal nuts.",
        "Use an adjustable wrench to unscrew the nuts from the hoses until you can start turning them in your fingers.",
        "Detach all the hoses from your current faucet.",
        "Place a bucket or towel underneath your valves in case any water still leaks out.",
        "Use a basin wrench to remove the nuts from the faucet.",
        "A basin wrench is a long-handled tool that makes it easier to reach underneath your sink.",
        "Adjust the length of the wrench handle and place the jaws of the wrench around the nut underneath your faucet.",
        "Grab the nut from the left side and turn the wrench counterclockwise to loosen it completely.",
        "Basin wrenches can be purchased from your local hardware store.Tip: Have someone help you hold the faucet from above so it doesn’t spin while you loosen the nut.",
        "Pull the faucet out of the sink and clean any grime or residue.",
        "Once you remove the nuts from the water lines and the faucet, simply pull the faucet up and out of the hole in your sink.",
        "Use a multipurpose cleaner and an old washcloth to lift up any grime that may have developed around the old faucet.",
        "If you’re having trouble removing any grime, let the cleaner sit on it for 1 minute before trying to scrub it off again.",
        "Putting in the New Faucet Assemble the new faucet if needed.",
        "Choose a new faucet that matches the style of your old faucet.",
        "Wrap 3 layers of Teflon tape around the threading of the supply tubes that came with your faucet.",
        "Then screw the supply tubes onto the faucet fixture using an adjustable wrench.",
        "Don’t use any excessive force when you attach the tubes.",
        "Find a faucet that matches the color of your other hardware, such as your appliances or cabinet handles.",
        "Each faucet is different.",
        "Carefully follow the instructions inside the packaging to make sure you’re assembling it correctly.",
        "Cover any additional holes in your sink with trim rings or a deck plate.",
        "Some sinks will have multiple holes to accommodate different types of faucets.",
        "If you’re not using all of the holes, set trim rings or a deck plate over the top of them.",
        "Align the deck plate so it isn’t crooked before securing it underneath your sink with the nuts provided in the packaging.",
        "Tighten the nuts under your sink using an adjustable or basin wrench.",
        "Deck plates and trim rings can be purchased at your local home improvement store.",
        "You can’t use a faucet that requires more holes than what your sink already has.",
        "For example, a faucet that requires 3 holes cannot be put into a sink with 1 hole.Tip: If you have additional holes left in your sink, you can use them for a built-in soap dispenser or a sink sprayer.",
        "Feed the supply tubes into the hole and position the new faucet.",
        "Align the faucet over the holes in your sink.",
        "Feed the tubes through the center hole one at a time so they’re easier to manage.",
        "After the tubes are in, lower the faucet onto the sink and hold it in the position where you want to secure it.",
        "Put the tubes through the hole slowly in case there are any sharp edges that could cut through them.",
        "Faucets with 2 handles usually have a 3-hole setup, while those with a single handle only require 1 hole.",
        "Secure the faucet by tightening the nuts with your basin wrench.",
        "Have a helper hold the faucet from above the sink so it doesn’t shift or move around.",
        "Screw on the nut with your fingers first, and then use your basin wrench from the right side to turn it clockwise.",
        "Don’t use too much force while tightening the nuts.",
        "Connect the sink sprayer to the faucet if you have one.",
        "Set the sprayer base in one of the holes in your sink and screw on the mounting nut to secure it in place.",
        "Feed the sprayer hose through the base and attach the end of the hose to the bottom port on your faucet.",
        "Depending on the type of sprayer, you may just have to push the hose in place or screw it together.",
        "Your faucet needs to come with a sprayer in order to attach one to your sink.",
        "Attach the water lines to the faucet supply hoses and reconnect your disposal.",
        "Hold the supply hoses from the faucet up to the water lines with the nuts attached to them.",
        "Screw the nuts onto the supply lines until they’re finger-tight.",
        "If you had to disconnect a garbage disposal earlier, plug it back in.",
        "Wrap 3 layers of Teflon tape around the threading of each supply line if you want additional protection from leaks.",
        "For faucets with 2 handles, make sure the hot water line is connected to the side that controls hot water, and the cold water line is attached to the cold handle.",
        "Cleaning out Debris Unscrew the aerator from the end of the faucet.",
        "The aerator is a thin layer of metal mesh used to help control the water flow, and is located on the end of the faucet.",
        "Turn the aerator counterclockwise to remove it from the end of your faucet.",
        "Check the instruction manual for your faucet to see how to remove it from your exact model.",
        "Turn the water valves back on.",
        "Rotate the valve so they’re in line with the supply tubes again.",
        "Check if there are any leaks coming out where the supply lines and valves connect.",
        "If so, turn the valve off and tighten the nuts with your wrench again.",
        "Keep a towel or bucket underneath your valves until you’re sure they don’t leak anymore.",
        "Turn on your faucet and let the water run for 2-3 minutes.",
        "Lift or turn the handles on your faucet so the water runs out.",
        "Keep the faucet on for a few minutes so any debris or dust inside gets flushed out.",
        "If your faucet has 2 handles, turn both of them on to clear out all of the lines.Tip: Check underneath your sink while the water is running to see if you notice any leaks.",
        "If so, tighten the nuts on the water lines.",
        "Replace the aerator.",
        "Turn off your faucet and screw the aerator clockwise back into place.",
        "Once it’s reattached, you can use your new faucet!"
    ]
}