{
    "title": "How to Make Glycerin Soap",
    "url": "https://www.wikihow.com/Make-Glycerin-Soap",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Making Basic Glycerin Soap",
            "steps": [
                {
                    "headline": "Buy supplies.",
                    "description": "Craft stores sell glycerin, which is a soap base, in solid, meltable blocks. If you're feeling ambitious, you can  make your own glycerin, but it's easier to buy blocks of clear glycerin, white glycerin, or a different color. Clear glycerin soap always looks a little transparent, no matter what color you choose. In addition to glycerin, you'll need the following supplies:\nEssential oils. Craft stores sell essential oils meant for use in glycerin soap. You'll only need a few drops to scent an entire batch of soap, so you can buy a small bottle. Choose  lemon verbena oil, rose oil, lavender oil, peppermint oil, or another oil you'd like to use to scent your soap. Soap molds. Craft stores sell many different types of molds, ranging from very small to very large in size. Be sure to get a type of mold that is usable for glycerin soap, which will pop right out of the mold as soon as it has set. Rubbing alcohol. If you don't already have some in your medicine cabinet, pick up a bottle at the drugstore. Pour some into a clean spray bottle; you'll need it to remove bubbles from the glycerin before it sets."
                },
                {
                    "headline": "Melt the glycerin in a double boiler.",
                    "description": "Cut off as much glycerin as you need to fill the soap molds you bought, then slice it into small pieces that will be easier to melt. Place the glycerin pieces in a double boiler, fill the boiler with water, and place it over medium heat. Continue heating the glycerin until it is completely melted. If you don't have a double boiler, you can make one. Find two pots, a large one and a smaller one that fits inside. Fill the larger pot with a few inches of water. Set the smaller pot inside the larger pot so that it floats on the water. Place the pots on a burner over medium heat. Put the glycerin chunks into the dry, smaller pot and allow them to melt. You can also melt the glycerin in the microwave. Place the chunks in a microwave safe bowl and heat them in 30 second increments until they are entirely melted. You can melt the entire block of glycerin or just cut off a little at a time until you've melted an amount that seems suitable for your soap-making project. The finished soaps will have the same mass and volume as the glycerin chunks, they'll just be reformed into pretty shapes."
                },
                {
                    "headline": "Stir in the essential oil.",
                    "description": "Add just a few drops of the oil; since it's so concentrated, a little goes a long way. Use a wooden spoon to stir the drops in until they are thoroughly combined with the glycerin, then remove it from heat."
                },
                {
                    "headline": "Prepare the soap molds.",
                    "description": "Set the molds on a flat surface lined with paper towels. Use the spray bottle full of rubbing alcohol to lightly mist the insides of the soap molds, coating the area where the glycerin will go. The alcohol prevents bubbles from forming in the soap as it cools and dries. If you don't use alcohol, your finished soap may have a layer of bubbles."
                },
                {
                    "headline": "Pour the soap.",
                    "description": "Lift the top of the double boiler and carefully pour the soap into the molds. Fill each mold to its rim. Be careful not to let it overflow, or the soap will come out misshapen. If the soap is tricky to pour using your double boiler, use a funnel to pour it into a bottle or pitcher with a spout, then transfer the liquid to the soap molds. You'll have to do this quickly, though, so the soap doesn't get too cool before it makes it to the molds. If necessary, reheat the soap before you pour it. Heat it back up in the double boiler or place it in the microwave for a few more short bursts of heat to make it easier to pour."
                },
                {
                    "headline": "Spritz it with more alcohol.",
                    "description": "Use the spray bottle to mist the soap after it has been poured into the molds and while it's still in its liquid stage. This way you'll prevent the formation of bubbles on the flat side of the soap, too."
                },
                {
                    "headline": "Let the soaps cool, then pop them out.",
                    "description": "Let the soaps cool in their molds for an hour or two, until they're completely hard. Invert the soap molds to pop out your brand new glycerin soaps. Tap the back of the mold gently if the soap does not come out right away. Store the soaps in an air-tight container until you are ready to use them."
                }
            ]
        },
        {
            "name": "Trying Fun Variations",
            "steps": [
                {
                    "headline": "Make soap on a rope.",
                    "description": "After melting the glycerin, pour it into a large metal or plastic bowl. Add a few drops of the essential oil of your choice. Dip a length of rope into the liquid, then remove it from the bowl and let the liquid cool and harden. Dip it again to add a second coating, then remove it from the liquid and let the second layer cool and harden. Continue dipping the soap in this manner until the soap has reached your desired thickness. Get creative with the material you use for your rope. Rather than dipping a straight length of rope into the glycerin, try tying it into a loop or a knot to create soap in different shapes. Hang the rope from your shower head so it's handy to use each time you take a shower."
                },
                {
                    "headline": "Make soap of different colors.",
                    "description": "You can buy a block of clear glycerin and color it yourself using cosmetic-grade coloring, available at craft stores. After melting the glycerin, separate it into a few different containers and add a few drops of coloring to each one before pouring the liquid into the soap molds."
                },
                {
                    "headline": "Add decorations to the soaps.",
                    "description": "You can add solid objects to the soaps if you want to give them extra flair. This is a great way to personalize soaps to make favors for baby showers or kids' birthday parties, or to match your bathroom décor. Consider the following options:\nMake floral soaps by suspending dried flower petals in the liquid glycerin before you pour it into the molds. Make birthday party soaps by filling the molds halfway and then inserting a small toy, like a tiny plastic animal or other gadget, in the center of the soap. Pour more liquid soap over the toy to cover it completely. Make baby shower soaps by pouring soap into the molds and then inserting small plastic rattles or other baby items into the soap."
                },
                {
                    "headline": "Make your own molds.",
                    "description": "If you can't find a mold you like at the craft store, try making your own. Any hard plastic item can serve as a mold. If you use an item that's usually used to make food, be sure to wash it carefully before you use it again. Ice cube trays make excellent soap molds. Use simple square trays or buy trays with interesting shapes, like fish, shells or skulls. To make larger soaps, use small plastic bowls or cups. You could also use a recycled plastic container, like a yogurt cup."
                }
            ]
        }
    ],
    "tyn": [
        "Soap molds",
        "Rubbing alcohol",
        "Spray bottle",
        "Glycerin",
        "Essential oils",
        "Knife",
        "Double boiler or microwavable container",
        "Spoon",
        "Soap colorant"
    ],
    "text": " Making Basic Glycerin Soap Buy supplies. Craft stores sell glycerin, which is a soap base, in solid, meltable blocks. If you're feeling ambitious, you can  make your own glycerin, but it's easier to buy blocks of clear glycerin, white glycerin, or a different color. Clear glycerin soap always looks a little transparent, no matter what color you choose. In addition to glycerin, you'll need the following supplies:\nEssential oils. Craft stores sell essential oils meant for use in glycerin soap. You'll only need a few drops to scent an entire batch of soap, so you can buy a small bottle. Choose  lemon verbena oil, rose oil, lavender oil, peppermint oil, or another oil you'd like to use to scent your soap. Soap molds. Craft stores sell many different types of molds, ranging from very small to very large in size. Be sure to get a type of mold that is usable for glycerin soap, which will pop right out of the mold as soon as it has set. Rubbing alcohol. If you don't already have some in your medicine cabinet, pick up a bottle at the drugstore. Pour some into a clean spray bottle; you'll need it to remove bubbles from the glycerin before it sets. Melt the glycerin in a double boiler. Cut off as much glycerin as you need to fill the soap molds you bought, then slice it into small pieces that will be easier to melt. Place the glycerin pieces in a double boiler, fill the boiler with water, and place it over medium heat. Continue heating the glycerin until it is completely melted. If you don't have a double boiler, you can make one. Find two pots, a large one and a smaller one that fits inside. Fill the larger pot with a few inches of water. Set the smaller pot inside the larger pot so that it floats on the water. Place the pots on a burner over medium heat. Put the glycerin chunks into the dry, smaller pot and allow them to melt. You can also melt the glycerin in the microwave. Place the chunks in a microwave safe bowl and heat them in 30 second increments until they are entirely melted. You can melt the entire block of glycerin or just cut off a little at a time until you've melted an amount that seems suitable for your soap-making project. The finished soaps will have the same mass and volume as the glycerin chunks, they'll just be reformed into pretty shapes. Stir in the essential oil. Add just a few drops of the oil; since it's so concentrated, a little goes a long way. Use a wooden spoon to stir the drops in until they are thoroughly combined with the glycerin, then remove it from heat. Prepare the soap molds. Set the molds on a flat surface lined with paper towels. Use the spray bottle full of rubbing alcohol to lightly mist the insides of the soap molds, coating the area where the glycerin will go. The alcohol prevents bubbles from forming in the soap as it cools and dries. If you don't use alcohol, your finished soap may have a layer of bubbles. Pour the soap. Lift the top of the double boiler and carefully pour the soap into the molds. Fill each mold to its rim. Be careful not to let it overflow, or the soap will come out misshapen. If the soap is tricky to pour using your double boiler, use a funnel to pour it into a bottle or pitcher with a spout, then transfer the liquid to the soap molds. You'll have to do this quickly, though, so the soap doesn't get too cool before it makes it to the molds. If necessary, reheat the soap before you pour it. Heat it back up in the double boiler or place it in the microwave for a few more short bursts of heat to make it easier to pour. Spritz it with more alcohol. Use the spray bottle to mist the soap after it has been poured into the molds and while it's still in its liquid stage. This way you'll prevent the formation of bubbles on the flat side of the soap, too. Let the soaps cool, then pop them out. Let the soaps cool in their molds for an hour or two, until they're completely hard. Invert the soap molds to pop out your brand new glycerin soaps. Tap the back of the mold gently if the soap does not come out right away. Store the soaps in an air-tight container until you are ready to use them. Trying Fun Variations Make soap on a rope. After melting the glycerin, pour it into a large metal or plastic bowl. Add a few drops of the essential oil of your choice. Dip a length of rope into the liquid, then remove it from the bowl and let the liquid cool and harden. Dip it again to add a second coating, then remove it from the liquid and let the second layer cool and harden. Continue dipping the soap in this manner until the soap has reached your desired thickness. Get creative with the material you use for your rope. Rather than dipping a straight length of rope into the glycerin, try tying it into a loop or a knot to create soap in different shapes. Hang the rope from your shower head so it's handy to use each time you take a shower. Make soap of different colors. You can buy a block of clear glycerin and color it yourself using cosmetic-grade coloring, available at craft stores. After melting the glycerin, separate it into a few different containers and add a few drops of coloring to each one before pouring the liquid into the soap molds. Add decorations to the soaps. You can add solid objects to the soaps if you want to give them extra flair. This is a great way to personalize soaps to make favors for baby showers or kids' birthday parties, or to match your bathroom décor. Consider the following options:\nMake floral soaps by suspending dried flower petals in the liquid glycerin before you pour it into the molds. Make birthday party soaps by filling the molds halfway and then inserting a small toy, like a tiny plastic animal or other gadget, in the center of the soap. Pour more liquid soap over the toy to cover it completely. Make baby shower soaps by pouring soap into the molds and then inserting small plastic rattles or other baby items into the soap. Make your own molds. If you can't find a mold you like at the craft store, try making your own. Any hard plastic item can serve as a mold. If you use an item that's usually used to make food, be sure to wash it carefully before you use it again. Ice cube trays make excellent soap molds. Use simple square trays or buy trays with interesting shapes, like fish, shells or skulls. To make larger soaps, use small plastic bowls or cups. You could also use a recycled plastic container, like a yogurt cup.",
    "sentences": [
        " Making Basic Glycerin Soap Buy supplies.",
        "Craft stores sell glycerin, which is a soap base, in solid, meltable blocks.",
        "If you're feeling ambitious, you can  make your own glycerin, but it's easier to buy blocks of clear glycerin, white glycerin, or a different color.",
        "Clear glycerin soap always looks a little transparent, no matter what color you choose.",
        "In addition to glycerin, you'll need the following supplies:\nEssential oils.",
        "Craft stores sell essential oils meant for use in glycerin soap.",
        "You'll only need a few drops to scent an entire batch of soap, so you can buy a small bottle.",
        "Choose  lemon verbena oil, rose oil, lavender oil, peppermint oil, or another oil you'd like to use to scent your soap.",
        "Soap molds.",
        "Craft stores sell many different types of molds, ranging from very small to very large in size.",
        "Be sure to get a type of mold that is usable for glycerin soap, which will pop right out of the mold as soon as it has set.",
        "Rubbing alcohol.",
        "If you don't already have some in your medicine cabinet, pick up a bottle at the drugstore.",
        "Pour some into a clean spray bottle; you'll need it to remove bubbles from the glycerin before it sets.",
        "Melt the glycerin in a double boiler.",
        "Cut off as much glycerin as you need to fill the soap molds you bought, then slice it into small pieces that will be easier to melt.",
        "Place the glycerin pieces in a double boiler, fill the boiler with water, and place it over medium heat.",
        "Continue heating the glycerin until it is completely melted.",
        "If you don't have a double boiler, you can make one.",
        "Find two pots, a large one and a smaller one that fits inside.",
        "Fill the larger pot with a few inches of water.",
        "Set the smaller pot inside the larger pot so that it floats on the water.",
        "Place the pots on a burner over medium heat.",
        "Put the glycerin chunks into the dry, smaller pot and allow them to melt.",
        "You can also melt the glycerin in the microwave.",
        "Place the chunks in a microwave safe bowl and heat them in 30 second increments until they are entirely melted.",
        "You can melt the entire block of glycerin or just cut off a little at a time until you've melted an amount that seems suitable for your soap-making project.",
        "The finished soaps will have the same mass and volume as the glycerin chunks, they'll just be reformed into pretty shapes.",
        "Stir in the essential oil.",
        "Add just a few drops of the oil; since it's so concentrated, a little goes a long way.",
        "Use a wooden spoon to stir the drops in until they are thoroughly combined with the glycerin, then remove it from heat.",
        "Prepare the soap molds.",
        "Set the molds on a flat surface lined with paper towels.",
        "Use the spray bottle full of rubbing alcohol to lightly mist the insides of the soap molds, coating the area where the glycerin will go.",
        "The alcohol prevents bubbles from forming in the soap as it cools and dries.",
        "If you don't use alcohol, your finished soap may have a layer of bubbles.",
        "Pour the soap.",
        "Lift the top of the double boiler and carefully pour the soap into the molds.",
        "Fill each mold to its rim.",
        "Be careful not to let it overflow, or the soap will come out misshapen.",
        "If the soap is tricky to pour using your double boiler, use a funnel to pour it into a bottle or pitcher with a spout, then transfer the liquid to the soap molds.",
        "You'll have to do this quickly, though, so the soap doesn't get too cool before it makes it to the molds.",
        "If necessary, reheat the soap before you pour it.",
        "Heat it back up in the double boiler or place it in the microwave for a few more short bursts of heat to make it easier to pour.",
        "Spritz it with more alcohol.",
        "Use the spray bottle to mist the soap after it has been poured into the molds and while it's still in its liquid stage.",
        "This way you'll prevent the formation of bubbles on the flat side of the soap, too.",
        "Let the soaps cool, then pop them out.",
        "Let the soaps cool in their molds for an hour or two, until they're completely hard.",
        "Invert the soap molds to pop out your brand new glycerin soaps.",
        "Tap the back of the mold gently if the soap does not come out right away.",
        "Store the soaps in an air-tight container until you are ready to use them.",
        "Trying Fun Variations Make soap on a rope.",
        "After melting the glycerin, pour it into a large metal or plastic bowl.",
        "Add a few drops of the essential oil of your choice.",
        "Dip a length of rope into the liquid, then remove it from the bowl and let the liquid cool and harden.",
        "Dip it again to add a second coating, then remove it from the liquid and let the second layer cool and harden.",
        "Continue dipping the soap in this manner until the soap has reached your desired thickness.",
        "Get creative with the material you use for your rope.",
        "Rather than dipping a straight length of rope into the glycerin, try tying it into a loop or a knot to create soap in different shapes.",
        "Hang the rope from your shower head so it's handy to use each time you take a shower.",
        "Make soap of different colors.",
        "You can buy a block of clear glycerin and color it yourself using cosmetic-grade coloring, available at craft stores.",
        "After melting the glycerin, separate it into a few different containers and add a few drops of coloring to each one before pouring the liquid into the soap molds.",
        "Add decorations to the soaps.",
        "You can add solid objects to the soaps if you want to give them extra flair.",
        "This is a great way to personalize soaps to make favors for baby showers or kids' birthday parties, or to match your bathroom décor.",
        "Consider the following options:\nMake floral soaps by suspending dried flower petals in the liquid glycerin before you pour it into the molds.",
        "Make birthday party soaps by filling the molds halfway and then inserting a small toy, like a tiny plastic animal or other gadget, in the center of the soap.",
        "Pour more liquid soap over the toy to cover it completely.",
        "Make baby shower soaps by pouring soap into the molds and then inserting small plastic rattles or other baby items into the soap.",
        "Make your own molds.",
        "If you can't find a mold you like at the craft store, try making your own.",
        "Any hard plastic item can serve as a mold.",
        "If you use an item that's usually used to make food, be sure to wash it carefully before you use it again.",
        "Ice cube trays make excellent soap molds.",
        "Use simple square trays or buy trays with interesting shapes, like fish, shells or skulls.",
        "To make larger soaps, use small plastic bowls or cups.",
        "You could also use a recycled plastic container, like a yogurt cup."
    ]
}