{
    "title": "How to Grill Halibut",
    "url": "https://www.wikihow.com/Grill-Halibut",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood"
    ],
    "methods": [
        {
            "name": "Cooking Halibut on the Grill",
            "steps": [
                {
                    "headline": "Preheat the grill to 400 °F (204 °C).",
                    "description": "Turn the grill on so that it is ready to go once the halibut is prepared. Most grills take 10-15 minutes to heat up. Make sure that the grate on the grill is clean before you turn it on. It’s much easier and safer to clean it when it’s cold!"
                },
                {
                    "headline": "Remove the skin from the halibut if you prefer skinless fish.",
                    "description": "Halibut skin is edible and becomes nice and crispy when it is grilled. However, if you prefer to eat halibut without skin, use a sharp knife to remove the skin from the flesh of the fish. A fillet knife works best for removing the skin, however, any sharp knife will do the job."
                },
                {
                    "headline": "Cover the halibut with a marinade or seasoning.",
                    "description": "This helps to add flavour to the halibut and makes the outside of the fish crispy. Salt, pepper, and garlic are great seasoning options. Melted butter, lemon juice, and soy sauce are good marinating liquids. Experiment with different seasonings and marinades until you find your favourite. If you have fresh herbs in your pantry, add these to your seasoning or marinade to give the fish a fresh and earthy flavour."
                },
                {
                    "headline": "Place the fillets onto the grill at 400 °F (204 °C) for 5 minutes.",
                    "description": "Try to spread the fillets out so that they cook evenly. Set a timer to help remind you to check the halibut after 5 minutes. If you can smell the fish burning, turn down the grill. Always be careful when cooking on a grill to avoid burns."
                },
                {
                    "headline": "Turn the fish fillets over and cook them for another 5 minutes.",
                    "description": "Use a metal spatula to carefully turn each halibut fillet over. Once again, try to spread the fillets out so that they cook at the same speed. After 5 minutes, insert an instant-read food thermometer into the middle of the halibut and check that it has reached 135 °F (57 °C). This ensures that the fish is safe to eat. Continue to cook the halibut until it reaches 135 °F (57 °C). Always use metal utensils when cooking on a grill as plastic utensils will melt from the heat."
                },
                {
                    "headline": "Transfer the fish to a plate and leave it to rest for 5 minutes.",
                    "description": "Use a metal spatula to lift the halibut fillets off the grill and onto a plate. Resting the halibut helps to make it tender and full of flavour."
                },
                {
                    "headline": "Serve the halibut with lemon wedges and your favourite vegetables.",
                    "description": "Slice a lemon into wedges and place it beside the halibut on each plate. This can be squeezed onto the fish to add a fresh flavour. Serve the fish with your favourite vegetables, such as potato, carrots, peas, beans, or broccoli. Halibut tastes best when eaten hot."
                },
                {
                    "headline": "Store the halibut in an airtight container in the fridge for up to 3 days.",
                    "description": "Transfer the cooked halibut into an airtight container and place it in the fridge. If you want to eat the halibut at a later date, place the airtight container in the freezer for up to 3 months. If you don’t have an airtight container, use a sealable bag instead. If the halibut has a bad smell or slimy texture after it has been stored, this signals that it has gone off."
                }
            ]
        },
        {
            "name": "Seasoning Halibut with a Marinade",
            "steps": [
                {
                    "headline": "Measure the butter, honey, lemon, soy sauce, pepper, and garlic into a bowl.",
                    "description": "Measure 2 tablespoons (28.5 grams) of melted butter, 2 tablespoons (42.5 grams) of honey, 2 teaspoons (11 grams) of soy sauce, and 1/2 teaspoon (1.1 grams) of pepper into a small bowl. Add the juice from ½ a medium-sized lemon and 2 cloves of minced garlic. If you don’t like garlic, simply leave it out. Use manuka honey for maximum health benefits."
                },
                {
                    "headline": "Mix the ingredients with a spoon.",
                    "description": "Continue to mix the ingredients until they are thoroughly combined and the marinade has an even texture. This helps the marinade to have a consistent taste when it is cooked. If there are any lumps in the mixture, use the back of the spoon to squash them."
                },
                {
                    "headline": "Brush both sides of the halibut fillets with the marinade.",
                    "description": "Dip a pastry brush into the marinade and paint it over the halibut fillets. Make sure that the entire surface of the fish is covered with the marinade. This helps to make the skin crispy and full of flavour. If you don’t have a pastry brush, use a spoon to drizzle the mixture over both sides of the fish instead."
                },
                {
                    "headline": "Grill the halibut for 5 minutes on each side.",
                    "description": "Place the halibut onto the grill for 5 minutes. Use a metal spatula to turn the fish over and cook it for another 5 minutes. Insert an instant-read food thermometer into the middle of the fish and check that it has reached 135 °F (57 °C). This indicates that the halibut is ready to eat. Enjoy!"
                }
            ]
        }
    ],
    "tyn": [
        "Small bowl",
        "Measuring spoons",
        "Spoon",
        "Pastry brush",
        "Metal spatula",
        "Knife"
    ],
    "text": " Cooking Halibut on the Grill Preheat the grill to 400 °F (204 °C). Turn the grill on so that it is ready to go once the halibut is prepared. Most grills take 10-15 minutes to heat up. Make sure that the grate on the grill is clean before you turn it on. It’s much easier and safer to clean it when it’s cold! Remove the skin from the halibut if you prefer skinless fish. Halibut skin is edible and becomes nice and crispy when it is grilled. However, if you prefer to eat halibut without skin, use a sharp knife to remove the skin from the flesh of the fish. A fillet knife works best for removing the skin, however, any sharp knife will do the job. Cover the halibut with a marinade or seasoning. This helps to add flavour to the halibut and makes the outside of the fish crispy. Salt, pepper, and garlic are great seasoning options. Melted butter, lemon juice, and soy sauce are good marinating liquids. Experiment with different seasonings and marinades until you find your favourite. If you have fresh herbs in your pantry, add these to your seasoning or marinade to give the fish a fresh and earthy flavour. Place the fillets onto the grill at 400 °F (204 °C) for 5 minutes. Try to spread the fillets out so that they cook evenly. Set a timer to help remind you to check the halibut after 5 minutes. If you can smell the fish burning, turn down the grill. Always be careful when cooking on a grill to avoid burns. Turn the fish fillets over and cook them for another 5 minutes. Use a metal spatula to carefully turn each halibut fillet over. Once again, try to spread the fillets out so that they cook at the same speed. After 5 minutes, insert an instant-read food thermometer into the middle of the halibut and check that it has reached 135 °F (57 °C). This ensures that the fish is safe to eat. Continue to cook the halibut until it reaches 135 °F (57 °C). Always use metal utensils when cooking on a grill as plastic utensils will melt from the heat. Transfer the fish to a plate and leave it to rest for 5 minutes. Use a metal spatula to lift the halibut fillets off the grill and onto a plate. Resting the halibut helps to make it tender and full of flavour. Serve the halibut with lemon wedges and your favourite vegetables. Slice a lemon into wedges and place it beside the halibut on each plate. This can be squeezed onto the fish to add a fresh flavour. Serve the fish with your favourite vegetables, such as potato, carrots, peas, beans, or broccoli. Halibut tastes best when eaten hot. Store the halibut in an airtight container in the fridge for up to 3 days. Transfer the cooked halibut into an airtight container and place it in the fridge. If you want to eat the halibut at a later date, place the airtight container in the freezer for up to 3 months. If you don’t have an airtight container, use a sealable bag instead. If the halibut has a bad smell or slimy texture after it has been stored, this signals that it has gone off. Seasoning Halibut with a Marinade Measure the butter, honey, lemon, soy sauce, pepper, and garlic into a bowl. Measure 2 tablespoons (28.5 grams) of melted butter, 2 tablespoons (42.5 grams) of honey, 2 teaspoons (11 grams) of soy sauce, and 1/2 teaspoon (1.1 grams) of pepper into a small bowl. Add the juice from ½ a medium-sized lemon and 2 cloves of minced garlic. If you don’t like garlic, simply leave it out. Use manuka honey for maximum health benefits. Mix the ingredients with a spoon. Continue to mix the ingredients until they are thoroughly combined and the marinade has an even texture. This helps the marinade to have a consistent taste when it is cooked. If there are any lumps in the mixture, use the back of the spoon to squash them. Brush both sides of the halibut fillets with the marinade. Dip a pastry brush into the marinade and paint it over the halibut fillets. Make sure that the entire surface of the fish is covered with the marinade. This helps to make the skin crispy and full of flavour. If you don’t have a pastry brush, use a spoon to drizzle the mixture over both sides of the fish instead. Grill the halibut for 5 minutes on each side. Place the halibut onto the grill for 5 minutes. Use a metal spatula to turn the fish over and cook it for another 5 minutes. Insert an instant-read food thermometer into the middle of the fish and check that it has reached 135 °F (57 °C). This indicates that the halibut is ready to eat. Enjoy!",
    "sentences": [
        " Cooking Halibut on the Grill Preheat the grill to 400 °F (204 °C).",
        "Turn the grill on so that it is ready to go once the halibut is prepared.",
        "Most grills take 10-15 minutes to heat up.",
        "Make sure that the grate on the grill is clean before you turn it on.",
        "It’s much easier and safer to clean it when it’s cold!",
        "Remove the skin from the halibut if you prefer skinless fish.",
        "Halibut skin is edible and becomes nice and crispy when it is grilled.",
        "However, if you prefer to eat halibut without skin, use a sharp knife to remove the skin from the flesh of the fish.",
        "A fillet knife works best for removing the skin, however, any sharp knife will do the job.",
        "Cover the halibut with a marinade or seasoning.",
        "This helps to add flavour to the halibut and makes the outside of the fish crispy.",
        "Salt, pepper, and garlic are great seasoning options.",
        "Melted butter, lemon juice, and soy sauce are good marinating liquids.",
        "Experiment with different seasonings and marinades until you find your favourite.",
        "If you have fresh herbs in your pantry, add these to your seasoning or marinade to give the fish a fresh and earthy flavour.",
        "Place the fillets onto the grill at 400 °F (204 °C) for 5 minutes.",
        "Try to spread the fillets out so that they cook evenly.",
        "Set a timer to help remind you to check the halibut after 5 minutes.",
        "If you can smell the fish burning, turn down the grill.",
        "Always be careful when cooking on a grill to avoid burns.",
        "Turn the fish fillets over and cook them for another 5 minutes.",
        "Use a metal spatula to carefully turn each halibut fillet over.",
        "Once again, try to spread the fillets out so that they cook at the same speed.",
        "After 5 minutes, insert an instant-read food thermometer into the middle of the halibut and check that it has reached 135 °F (57 °C).",
        "This ensures that the fish is safe to eat.",
        "Continue to cook the halibut until it reaches 135 °F (57 °C).",
        "Always use metal utensils when cooking on a grill as plastic utensils will melt from the heat.",
        "Transfer the fish to a plate and leave it to rest for 5 minutes.",
        "Use a metal spatula to lift the halibut fillets off the grill and onto a plate.",
        "Resting the halibut helps to make it tender and full of flavour.",
        "Serve the halibut with lemon wedges and your favourite vegetables.",
        "Slice a lemon into wedges and place it beside the halibut on each plate.",
        "This can be squeezed onto the fish to add a fresh flavour.",
        "Serve the fish with your favourite vegetables, such as potato, carrots, peas, beans, or broccoli.",
        "Halibut tastes best when eaten hot.",
        "Store the halibut in an airtight container in the fridge for up to 3 days.",
        "Transfer the cooked halibut into an airtight container and place it in the fridge.",
        "If you want to eat the halibut at a later date, place the airtight container in the freezer for up to 3 months.",
        "If you don’t have an airtight container, use a sealable bag instead.",
        "If the halibut has a bad smell or slimy texture after it has been stored, this signals that it has gone off.",
        "Seasoning Halibut with a Marinade Measure the butter, honey, lemon, soy sauce, pepper, and garlic into a bowl.",
        "Measure 2 tablespoons (28.5 grams) of melted butter, 2 tablespoons (42.5 grams) of honey, 2 teaspoons (11 grams) of soy sauce, and 1/2 teaspoon (1.1 grams) of pepper into a small bowl.",
        "Add the juice from ½ a medium-sized lemon and 2 cloves of minced garlic.",
        "If you don’t like garlic, simply leave it out.",
        "Use manuka honey for maximum health benefits.",
        "Mix the ingredients with a spoon.",
        "Continue to mix the ingredients until they are thoroughly combined and the marinade has an even texture.",
        "This helps the marinade to have a consistent taste when it is cooked.",
        "If there are any lumps in the mixture, use the back of the spoon to squash them.",
        "Brush both sides of the halibut fillets with the marinade.",
        "Dip a pastry brush into the marinade and paint it over the halibut fillets.",
        "Make sure that the entire surface of the fish is covered with the marinade.",
        "This helps to make the skin crispy and full of flavour.",
        "If you don’t have a pastry brush, use a spoon to drizzle the mixture over both sides of the fish instead.",
        "Grill the halibut for 5 minutes on each side.",
        "Place the halibut onto the grill for 5 minutes.",
        "Use a metal spatula to turn the fish over and cook it for another 5 minutes.",
        "Insert an instant-read food thermometer into the middle of the fish and check that it has reached 135 °F (57 °C).",
        "This indicates that the halibut is ready to eat.",
        "Enjoy!"
    ]
}