{
    "title": "How to Spray Paint Furniture",
    "url": "https://www.wikihow.com/Spray-Paint-Furniture",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Cleaning and Sanding the Furniture",
            "steps": [
                {
                    "headline": "Lay down a drop cloth in a well-ventilated area and place the furniture on it.",
                    "description": "Place an old tarp, bed sheet, or piece of cardboard on a flat surface where you can work. Make sure the area has plenty of windows for ventilation and wear a face mask while you paint since spray paint can release chemicals that are harmful when you breathe them in. If the furniture is heavy, ask someone for help before moving it! For added ventilation, run a fan directed toward a window to push small particles out of your workspace."
                },
                {
                    "headline": "Remove any hardware or fabric from the item that you’re painting.",
                    "description": "Use a screwdriver to take off any knobs, hinges, or pulls. If you’re painting a chair or item with a cushion, remove that part of the furniture before beginning to paint. If the furniture has drawers, remove those, and set the pieces aside to paint or refinish them separately. If the hardware has previously been painted over, you can strip the paint by soaking the pieces in a slow cooker set to low with a mixture of liquid dish soap and water. Let the pieces soak overnight and use a toothbrush to chip off the remaining paint. Then, you can paint them. If you’re removing cushions, consider reupholstering the cushions for a new look."
                },
                {
                    "headline": "Clean the furniture with mild liquid soap and water, then let it dry.",
                    "description": "Mix a few drops of liquid dish soap with water and dip a clean cloth into the solution. Wipe down every surface of the furniture, including the drawers, legs, and ledges. Let the furniture dry for 2-3 hours before moving on to sanding or priming. If there are any areas of caked-on dirt, spray mineral spirits on a clean cloth and rub it on the spot to remove the dirt. Mineral spirits are safe to use on most wooden, plastic, and metal furniture finishes since you’re going to be painting the item anyway."
                },
                {
                    "headline": "Sand the surface with 150-grit sandpaper if the item has a glossy finish.",
                    "description": "Using an orbital sander or sanding by hand, quickly pass over the surface of the furniture. Focus on making the surface rough so that the paint sticks, but don’t try to completely remove the finish. Avoid sanding any area for more than 3-5 seconds, since you can gouge the material and make it uneven. The surface of the furniture should look matte, rather than shiny, once you’ve finished sanding it. If you’re painting a piece of plastic or metal furniture, sand only to remove loose rust or paint chips. If the item doesn’t have a glossy finish, you can proceed directly to priming the furniture.Warning: Always wear gloves and a mask when sanding and spray painting the furniture."
                },
                {
                    "headline": "Wipe the furniture with a tack cloth to remove any dirt or debris from sanding.",
                    "description": "Tack cloth has a sticky coating to pick up debris from sanding. Run the cloth all over the furniture to ensure that there are no small particles sticking to the surface, which can cause bumps in your paint. If you don’t have tack cloth available, use a wet cloth to remove as much as possible. Let the furniture dry for 2-3 hours before priming."
                }
            ]
        },
        {
            "name": "Priming and Painting",
            "steps": [
                {
                    "headline": "Choose a universal spray paint and primer for a variety of surfaces.",
                    "description": "There are plenty of spray paints available that will work on a variety of surfaces. Look for canisters of primer and paint labeled “universal,” which can be used on metal, wood, plastic, and other finishes. These also tend to be easy to spray from any direction. Some spray paint is labeled as a “paint and primer” in one. If you’re using an all-in-one product, simply skip the priming step and go straight to applying the first coat of paint. If you’re spraying a piece of outdoor furniture, be sure to select a spray paint that’s safe for outdoor use! Unique Spray Paint Finishes\nMetallic: Metallic spray paint has a sparkly shine and is great for painting surfaces like plastic or metal. It comes in classic colors, like gold and silver, or non-traditional shades, like pink, teal, and red. Textured: Textured spray paint contains flecks of rock for a stone-like finish. It's ideal for more durable items and outdoor furniture. Chalkboard: Chalkboard spray paint converts the surface of the furniture into an actual chalk board that you can write on. This is great for children's furniture or a game room."
                },
                {
                    "headline": "Spray the furniture all over with a coat of primer and let it dry completely.",
                    "description": "Shake the primer for about 1 minute before removing the cap. Then, apply the primer using even side to side strokes until there’s a light coat on the material. Prime the bottom first, let it dry for 10-15 minutes, and then flip the item over and prime the sides and top. Wait at least 1 hour for the primer to dry before moving on to sanding. If you have a set of drawers to paint, remember to prime and paint these separately. If you’re painting a dark-colored piece of furniture, it’s normal to see some of the original finish through the coat of primer."
                },
                {
                    "headline": "Apply a light coat of spray paint to the furniture using even strokes.",
                    "description": "Once the primer has dried, shake the spray paint for at least 1 minute before removing the lid. Hold the canister about 12 inches (30 cm) away from the surface of the furniture, and spray with even up and down or side to side strokes with overlapping lines. Start by painting the bottom of the furniture, let it dry for 10-15 minutes, and then flip it over to paint the sides and top. Keep the canister moving to avoid drips in the paint, and continue painting until all of the surfaces have an even coat. Remember to shake the canister intermittently while you’re applying the coat of paint to ensure that it stays mixed in the can. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeff Huynh\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\t\t\t\t\tJeff Huynh is the General Manager of Handyman Rescue Team, a full service solution in home services, renovations, and repair in the Greater Seattle area. He has over five years of handyman experience. He has a BS in Business Administration from the San Francisco State University and his Certificate in Industrial Electronics Technology from North Seattle College. Jeff Huynh\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\tExpert Trick: Give the furniture a light sanding between coats. This roughs up the surface just a little, which helps the paint to adhere better and keeps you from having to apply lots and lots of coats of paint."
                },
                {
                    "headline": "Wait 2-3 hours for the spray paint to dry completely.",
                    "description": "After applying the first coat, let the paint dry. Check the directions on the canister to see how long you should wait in between coats for the specific brand. If there isn’t a time listed, 2 hours is normally enough time for the paint to dry to the touch. If you’re also painting drawers, you can use this time to apply the first coat of paint to them. If you’re unsure of whether the paint has dried, put on a pair of gloves and touch an inconspicuous area, like the back of the item. If it’s dry, none of the paint will stick to your finger. If there are drips in the paint once it’s dry, gently sand them by hand with 220-grit sandpaper to make the area smooth. Be sure to wipe down the area with a tack cloth before proceeding."
                },
                {
                    "headline": "Use spray polycrylic sealant between coats if the furniture will be used often.",
                    "description": "For items like a coffee table or chair, it’s important to seal the paint to prevent knicks and scratches. Purchase a spray sealant and apply it evenly like you would a regular coat of paint. Wait 2 hours for the sealant to dry before adding another coat of paint on top of it. If the furniture is going to be used less often, such as a decorative table or a bookshelf, you don’t have to use a sealant. You can safely use sealant with a textured or specialty finish since it’s applied in between coats and the finish will still appear on the topcoat."
                },
                {
                    "headline": "Add a second layer of spray paint to the furniture for more coverage.",
                    "description": "Shake the canister of paint for 1 minute and then apply another even coat using up and down and side to side motions. Be sure to cover hard-to-reach places, such as ledges and corners. Focus on getting more coverage on areas that were sparse on the first coat. It’s easy to forget to paint the underside of a chair or other piece of furniture, so carefully tip the piece of furniture on its side to make sure there aren’t any bare surfaces! If you applied a sealant in between the coats of paint, you don’t need to add another after your second coat has dried."
                },
                {
                    "headline": "Let the paint cure for 24 hours before reattaching any hardware.",
                    "description": "Store the painted furniture overnight in a well-ventilated room so the paint can cure. After a day, carefully reattach any hardware, insert drawers, and inspect the furniture to make sure there are no chips in the paint. If you reattach the hardware or move the furniture before the paint cures, it may crack or chip more easily. If the paint does chip, you may be able to fix the blemish. Spray some of the spray paint onto a paper plate, and use a paintbrush to apply a coat of paint to the blemish. Let it dry for 2-3 hours before applying a second coat to blend the paint."
                }
            ]
        }
    ],
    "tyn": [
        "Drop cloth",
        "Screwdriver (to remove hardware)",
        "Mild liquid soap and water",
        "Clean cloth",
        "150-grit sandpaper",
        "Tack cloth",
        "Primer",
        "Spray paint",
        "Polycrylic sealant (for high-traffic furniture)"
    ],
    "text": " Cleaning and Sanding the Furniture Lay down a drop cloth in a well-ventilated area and place the furniture on it. Place an old tarp, bed sheet, or piece of cardboard on a flat surface where you can work. Make sure the area has plenty of windows for ventilation and wear a face mask while you paint since spray paint can release chemicals that are harmful when you breathe them in. If the furniture is heavy, ask someone for help before moving it! For added ventilation, run a fan directed toward a window to push small particles out of your workspace. Remove any hardware or fabric from the item that you’re painting. Use a screwdriver to take off any knobs, hinges, or pulls. If you’re painting a chair or item with a cushion, remove that part of the furniture before beginning to paint. If the furniture has drawers, remove those, and set the pieces aside to paint or refinish them separately. If the hardware has previously been painted over, you can strip the paint by soaking the pieces in a slow cooker set to low with a mixture of liquid dish soap and water. Let the pieces soak overnight and use a toothbrush to chip off the remaining paint. Then, you can paint them. If you’re removing cushions, consider reupholstering the cushions for a new look. Clean the furniture with mild liquid soap and water, then let it dry. Mix a few drops of liquid dish soap with water and dip a clean cloth into the solution. Wipe down every surface of the furniture, including the drawers, legs, and ledges. Let the furniture dry for 2-3 hours before moving on to sanding or priming. If there are any areas of caked-on dirt, spray mineral spirits on a clean cloth and rub it on the spot to remove the dirt. Mineral spirits are safe to use on most wooden, plastic, and metal furniture finishes since you’re going to be painting the item anyway. Sand the surface with 150-grit sandpaper if the item has a glossy finish. Using an orbital sander or sanding by hand, quickly pass over the surface of the furniture. Focus on making the surface rough so that the paint sticks, but don’t try to completely remove the finish. Avoid sanding any area for more than 3-5 seconds, since you can gouge the material and make it uneven. The surface of the furniture should look matte, rather than shiny, once you’ve finished sanding it. If you’re painting a piece of plastic or metal furniture, sand only to remove loose rust or paint chips. If the item doesn’t have a glossy finish, you can proceed directly to priming the furniture.Warning: Always wear gloves and a mask when sanding and spray painting the furniture. Wipe the furniture with a tack cloth to remove any dirt or debris from sanding. Tack cloth has a sticky coating to pick up debris from sanding. Run the cloth all over the furniture to ensure that there are no small particles sticking to the surface, which can cause bumps in your paint. If you don’t have tack cloth available, use a wet cloth to remove as much as possible. Let the furniture dry for 2-3 hours before priming. Priming and Painting Choose a universal spray paint and primer for a variety of surfaces. There are plenty of spray paints available that will work on a variety of surfaces. Look for canisters of primer and paint labeled “universal,” which can be used on metal, wood, plastic, and other finishes. These also tend to be easy to spray from any direction. Some spray paint is labeled as a “paint and primer” in one. If you’re using an all-in-one product, simply skip the priming step and go straight to applying the first coat of paint. If you’re spraying a piece of outdoor furniture, be sure to select a spray paint that’s safe for outdoor use! Unique Spray Paint Finishes\nMetallic: Metallic spray paint has a sparkly shine and is great for painting surfaces like plastic or metal. It comes in classic colors, like gold and silver, or non-traditional shades, like pink, teal, and red. Textured: Textured spray paint contains flecks of rock for a stone-like finish. It's ideal for more durable items and outdoor furniture. Chalkboard: Chalkboard spray paint converts the surface of the furniture into an actual chalk board that you can write on. This is great for children's furniture or a game room. Spray the furniture all over with a coat of primer and let it dry completely. Shake the primer for about 1 minute before removing the cap. Then, apply the primer using even side to side strokes until there’s a light coat on the material. Prime the bottom first, let it dry for 10-15 minutes, and then flip the item over and prime the sides and top. Wait at least 1 hour for the primer to dry before moving on to sanding. If you have a set of drawers to paint, remember to prime and paint these separately. If you’re painting a dark-colored piece of furniture, it’s normal to see some of the original finish through the coat of primer. Apply a light coat of spray paint to the furniture using even strokes. Once the primer has dried, shake the spray paint for at least 1 minute before removing the lid. Hold the canister about 12 inches (30 cm) away from the surface of the furniture, and spray with even up and down or side to side strokes with overlapping lines. Start by painting the bottom of the furniture, let it dry for 10-15 minutes, and then flip it over to paint the sides and top. Keep the canister moving to avoid drips in the paint, and continue painting until all of the surfaces have an even coat. Remember to shake the canister intermittently while you’re applying the coat of paint to ensure that it stays mixed in the can. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeff Huynh\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\t\t\t\t\tJeff Huynh is the General Manager of Handyman Rescue Team, a full service solution in home services, renovations, and repair in the Greater Seattle area. He has over five years of handyman experience. He has a BS in Business Administration from the San Francisco State University and his Certificate in Industrial Electronics Technology from North Seattle College. Jeff Huynh\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\tExpert Trick: Give the furniture a light sanding between coats. This roughs up the surface just a little, which helps the paint to adhere better and keeps you from having to apply lots and lots of coats of paint. Wait 2-3 hours for the spray paint to dry completely. After applying the first coat, let the paint dry. Check the directions on the canister to see how long you should wait in between coats for the specific brand. If there isn’t a time listed, 2 hours is normally enough time for the paint to dry to the touch. If you’re also painting drawers, you can use this time to apply the first coat of paint to them. If you’re unsure of whether the paint has dried, put on a pair of gloves and touch an inconspicuous area, like the back of the item. If it’s dry, none of the paint will stick to your finger. If there are drips in the paint once it’s dry, gently sand them by hand with 220-grit sandpaper to make the area smooth. Be sure to wipe down the area with a tack cloth before proceeding. Use spray polycrylic sealant between coats if the furniture will be used often. For items like a coffee table or chair, it’s important to seal the paint to prevent knicks and scratches. Purchase a spray sealant and apply it evenly like you would a regular coat of paint. Wait 2 hours for the sealant to dry before adding another coat of paint on top of it. If the furniture is going to be used less often, such as a decorative table or a bookshelf, you don’t have to use a sealant. You can safely use sealant with a textured or specialty finish since it’s applied in between coats and the finish will still appear on the topcoat. Add a second layer of spray paint to the furniture for more coverage. Shake the canister of paint for 1 minute and then apply another even coat using up and down and side to side motions. Be sure to cover hard-to-reach places, such as ledges and corners. Focus on getting more coverage on areas that were sparse on the first coat. It’s easy to forget to paint the underside of a chair or other piece of furniture, so carefully tip the piece of furniture on its side to make sure there aren’t any bare surfaces! If you applied a sealant in between the coats of paint, you don’t need to add another after your second coat has dried. Let the paint cure for 24 hours before reattaching any hardware. Store the painted furniture overnight in a well-ventilated room so the paint can cure. After a day, carefully reattach any hardware, insert drawers, and inspect the furniture to make sure there are no chips in the paint. If you reattach the hardware or move the furniture before the paint cures, it may crack or chip more easily. If the paint does chip, you may be able to fix the blemish. Spray some of the spray paint onto a paper plate, and use a paintbrush to apply a coat of paint to the blemish. Let it dry for 2-3 hours before applying a second coat to blend the paint.",
    "sentences": [
        " Cleaning and Sanding the Furniture Lay down a drop cloth in a well-ventilated area and place the furniture on it.",
        "Place an old tarp, bed sheet, or piece of cardboard on a flat surface where you can work.",
        "Make sure the area has plenty of windows for ventilation and wear a face mask while you paint since spray paint can release chemicals that are harmful when you breathe them in.",
        "If the furniture is heavy, ask someone for help before moving it!",
        "For added ventilation, run a fan directed toward a window to push small particles out of your workspace.",
        "Remove any hardware or fabric from the item that you’re painting.",
        "Use a screwdriver to take off any knobs, hinges, or pulls.",
        "If you’re painting a chair or item with a cushion, remove that part of the furniture before beginning to paint.",
        "If the furniture has drawers, remove those, and set the pieces aside to paint or refinish them separately.",
        "If the hardware has previously been painted over, you can strip the paint by soaking the pieces in a slow cooker set to low with a mixture of liquid dish soap and water.",
        "Let the pieces soak overnight and use a toothbrush to chip off the remaining paint.",
        "Then, you can paint them.",
        "If you’re removing cushions, consider reupholstering the cushions for a new look.",
        "Clean the furniture with mild liquid soap and water, then let it dry.",
        "Mix a few drops of liquid dish soap with water and dip a clean cloth into the solution.",
        "Wipe down every surface of the furniture, including the drawers, legs, and ledges.",
        "Let the furniture dry for 2-3 hours before moving on to sanding or priming.",
        "If there are any areas of caked-on dirt, spray mineral spirits on a clean cloth and rub it on the spot to remove the dirt.",
        "Mineral spirits are safe to use on most wooden, plastic, and metal furniture finishes since you’re going to be painting the item anyway.",
        "Sand the surface with 150-grit sandpaper if the item has a glossy finish.",
        "Using an orbital sander or sanding by hand, quickly pass over the surface of the furniture.",
        "Focus on making the surface rough so that the paint sticks, but don’t try to completely remove the finish.",
        "Avoid sanding any area for more than 3-5 seconds, since you can gouge the material and make it uneven.",
        "The surface of the furniture should look matte, rather than shiny, once you’ve finished sanding it.",
        "If you’re painting a piece of plastic or metal furniture, sand only to remove loose rust or paint chips.",
        "If the item doesn’t have a glossy finish, you can proceed directly to priming the furniture.Warning: Always wear gloves and a mask when sanding and spray painting the furniture.",
        "Wipe the furniture with a tack cloth to remove any dirt or debris from sanding.",
        "Tack cloth has a sticky coating to pick up debris from sanding.",
        "Run the cloth all over the furniture to ensure that there are no small particles sticking to the surface, which can cause bumps in your paint.",
        "If you don’t have tack cloth available, use a wet cloth to remove as much as possible.",
        "Let the furniture dry for 2-3 hours before priming.",
        "Priming and Painting Choose a universal spray paint and primer for a variety of surfaces.",
        "There are plenty of spray paints available that will work on a variety of surfaces.",
        "Look for canisters of primer and paint labeled “universal,” which can be used on metal, wood, plastic, and other finishes.",
        "These also tend to be easy to spray from any direction.",
        "Some spray paint is labeled as a “paint and primer” in one.",
        "If you’re using an all-in-one product, simply skip the priming step and go straight to applying the first coat of paint.",
        "If you’re spraying a piece of outdoor furniture, be sure to select a spray paint that’s safe for outdoor use!",
        "Unique Spray Paint Finishes\nMetallic: Metallic spray paint has a sparkly shine and is great for painting surfaces like plastic or metal.",
        "It comes in classic colors, like gold and silver, or non-traditional shades, like pink, teal, and red.",
        "Textured: Textured spray paint contains flecks of rock for a stone-like finish.",
        "It's ideal for more durable items and outdoor furniture.",
        "Chalkboard: Chalkboard spray paint converts the surface of the furniture into an actual chalk board that you can write on.",
        "This is great for children's furniture or a game room.",
        "Spray the furniture all over with a coat of primer and let it dry completely.",
        "Shake the primer for about 1 minute before removing the cap.",
        "Then, apply the primer using even side to side strokes until there’s a light coat on the material.",
        "Prime the bottom first, let it dry for 10-15 minutes, and then flip the item over and prime the sides and top.",
        "Wait at least 1 hour for the primer to dry before moving on to sanding.",
        "If you have a set of drawers to paint, remember to prime and paint these separately.",
        "If you’re painting a dark-colored piece of furniture, it’s normal to see some of the original finish through the coat of primer.",
        "Apply a light coat of spray paint to the furniture using even strokes.",
        "Once the primer has dried, shake the spray paint for at least 1 minute before removing the lid.",
        "Hold the canister about 12 inches (30 cm) away from the surface of the furniture, and spray with even up and down or side to side strokes with overlapping lines.",
        "Start by painting the bottom of the furniture, let it dry for 10-15 minutes, and then flip it over to paint the sides and top.",
        "Keep the canister moving to avoid drips in the paint, and continue painting until all of the surfaces have an even coat.",
        "Remember to shake the canister intermittently while you’re applying the coat of paint to ensure that it stays mixed in the can.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJeff Huynh\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\t\t\t\t\tJeff Huynh is the General Manager of Handyman Rescue Team, a full service solution in home services, renovations, and repair in the Greater Seattle area.",
        "He has over five years of handyman experience.",
        "He has a BS in Business Administration from the San Francisco State University and his Certificate in Industrial Electronics Technology from North Seattle College.",
        "Jeff Huynh\t\t\tGeneral Manager, Handyman Rescue Team\t\t\t\tExpert Trick: Give the furniture a light sanding between coats.",
        "This roughs up the surface just a little, which helps the paint to adhere better and keeps you from having to apply lots and lots of coats of paint.",
        "Wait 2-3 hours for the spray paint to dry completely.",
        "After applying the first coat, let the paint dry.",
        "Check the directions on the canister to see how long you should wait in between coats for the specific brand.",
        "If there isn’t a time listed, 2 hours is normally enough time for the paint to dry to the touch.",
        "If you’re also painting drawers, you can use this time to apply the first coat of paint to them.",
        "If you’re unsure of whether the paint has dried, put on a pair of gloves and touch an inconspicuous area, like the back of the item.",
        "If it’s dry, none of the paint will stick to your finger.",
        "If there are drips in the paint once it’s dry, gently sand them by hand with 220-grit sandpaper to make the area smooth.",
        "Be sure to wipe down the area with a tack cloth before proceeding.",
        "Use spray polycrylic sealant between coats if the furniture will be used often.",
        "For items like a coffee table or chair, it’s important to seal the paint to prevent knicks and scratches.",
        "Purchase a spray sealant and apply it evenly like you would a regular coat of paint.",
        "Wait 2 hours for the sealant to dry before adding another coat of paint on top of it.",
        "If the furniture is going to be used less often, such as a decorative table or a bookshelf, you don’t have to use a sealant.",
        "You can safely use sealant with a textured or specialty finish since it’s applied in between coats and the finish will still appear on the topcoat.",
        "Add a second layer of spray paint to the furniture for more coverage.",
        "Shake the canister of paint for 1 minute and then apply another even coat using up and down and side to side motions.",
        "Be sure to cover hard-to-reach places, such as ledges and corners.",
        "Focus on getting more coverage on areas that were sparse on the first coat.",
        "It’s easy to forget to paint the underside of a chair or other piece of furniture, so carefully tip the piece of furniture on its side to make sure there aren’t any bare surfaces!",
        "If you applied a sealant in between the coats of paint, you don’t need to add another after your second coat has dried.",
        "Let the paint cure for 24 hours before reattaching any hardware.",
        "Store the painted furniture overnight in a well-ventilated room so the paint can cure.",
        "After a day, carefully reattach any hardware, insert drawers, and inspect the furniture to make sure there are no chips in the paint.",
        "If you reattach the hardware or move the furniture before the paint cures, it may crack or chip more easily.",
        "If the paint does chip, you may be able to fix the blemish.",
        "Spray some of the spray paint onto a paper plate, and use a paintbrush to apply a coat of paint to the blemish.",
        "Let it dry for 2-3 hours before applying a second coat to blend the paint."
    ]
}