{
    "title": "How to Make Palitaw",
    "url": "https://www.wikihow.com/Make-Palitaw",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Asian Cuisine",
        "Philippine Dishes"
    ],
    "methods": [
        {
            "name": "Making Basic Palitaw",
            "steps": [
                {
                    "headline": "Combine the toasted sesame seeds and sugar, then set them aside.",
                    "description": "Place 4 tablespoons (36 g) of toasted sesame seeds into a small bowl. Add ½ cup (115 g) of granulated white sugar, then stir them together with a fork. Set the bowl aside for later. Toast the sesame seeds in a pan over medium heat for 30 to 45 seconds, then let them cool before using them."
                },
                {
                    "headline": "Mix the rice flour and water in a separate bowl to make a dough.",
                    "description": "Place 2 cups (300 g) of glutinous rice flour into a bowl. Add 1 cup (240 mL) of room-temperature water, then stir it in with a whisk. Once the dough comes together, knead it a few times with your hands to form a clump."
                },
                {
                    "headline": "Form the dough into balls, then flatten them into disks.",
                    "description": "Roll the dough into 1 in (2.5 cm) balls, then flatten them until they are ⁄4 inch (0.64 cm) thick. Work with wet hands to keep the dough from sticking to your palms and fingers. Use about 1 to 2 tablespoons (15 to 30 g) of dough for each ball. The patties will be about 2 to 3 inches (5.1 to 7.6 cm) wide once you flatten them."
                },
                {
                    "headline": "Bring a pot of water to a boil over medium to medium-high heat.",
                    "description": "Fill a pot with 2 quarts (1.9 L) of water. Ensure that it is at least 5 inches (13 cm) deep, then bring it to a boil over medium to medium-high heat. If the water is too shallow, the palitaw won't cook properly. Add more water, if needed, or switch to a deeper pot."
                },
                {
                    "headline": "Cook the palitaw 3 to 4 at a time for 1 to 3 minutes.",
                    "description": "Drop the palitaw 3 or 4 into the pot, or however many you can fit without them touching. Allow them to cook until they float to the top of the water. This will take about 1 to 3 minutes. How many palitaw you fit will depend on the size of the pot. The larger the pot is, the more you'll fit. The smaller the pot is, the fewer you'll fit. Do not dump all of the patties into the water or they will stick together."
                },
                {
                    "headline": "Remove the palitaw with a slotted spoon, then cook more.",
                    "description": "Place the palitaw on a baking sheet lined with parchment paper to dry. Once the pot is empty, slip more patties into the water and cook them as well. Keep going until you've cooked all of the patties. Spread the palitaw out on the baking sheet; don't lump them together. Keep an eye on the water. If it gets too shallow, add more water. Let it return to a boil before adding the palitaw."
                },
                {
                    "headline": "Dip the patties in grated coconut, then transfer them to a platter.",
                    "description": "Pour 1 cup (75 g) of grated coconut into a shallow dish. Place a palitaw into the coconut, then flip it over and press the other side into it as well. Do this for all of the patties, transferring them to a platter as you finish each one. This is just like dredging meat through flour and breadcrumbs when you make deep fried food. Don't let the patties cool off; the coconut will stick much better while they are still warm."
                },
                {
                    "headline": "Sprinkle the patties with the sesame-sugar, then serve them.",
                    "description": "You can serve them while they are still warm, or allow them to cool down to room temperature. Alternatively, put the sesame-sugar into a small bowl. This way, your guests can season the palitaw themselves."
                }
            ]
        },
        {
            "name": "Trying Palitaw with Yema Filling",
            "steps": [
                {
                    "headline": "Melt the butter in a pan, then whisk in the condensed milk and egg yolk.",
                    "description": "Place 1 tablespoon (15 g) of butter into a non-stick pan. Heat the butter over medium heat until it melts, then add 1 can (300 mL) of condensed milk and 3 egg yolks. Stir everything together with a whisk until the texture is consistent. For extra flavor, add 1 rind of lemon. This is your yema, which is a custard-like filling. It is very sweet. Do not use the egg whites. Separate the yolks from the whites first. Use the yolks in this recipe and save the whites for another, such as meringues."
                },
                {
                    "headline": "Cook the yema over medium heat for 10 minutes, then set it aside.",
                    "description": "Stir the mixture constantly with a wooden spoon as it cooks so that it doesn’t burn. After about 10 minutes or so, it will thicken into a scoopable lump. At this point, switch off the burner and set the pan aside. Allow the mixture to cool to room temperature. As the mixture cools, get started on the dough. This will help save you some time. If you added a lemon rind, pull it out as soon as you take the mixture off the stove."
                },
                {
                    "headline": "Prepare a batch of palitaw dough.",
                    "description": "Make the dough as usual, using 2 cups (300 g) of glutinous rice flour and 1 cup (240 mL) of room-temperature water. For an even tastier treat, use pandan-inflused water. To make pandan-infused water, boil the water with pandan leaves. Strain the leaves out, then let the water cool to room temperature before using it. Pandan leaves have a very unique flavor. Some people say it is similar to vanilla."
                },
                {
                    "headline": "Form the dough into small balls with a thumbprint in the middle.",
                    "description": "Pluck about 2 tablespoons  (30 g) worth of palitaw dough and roll it into an oval-shaped ball. Use your thumb to make an indent in the middle of the ball. Do this for all the dough. If the dough sticks to your hands, coat them with glutinous rice flour."
                },
                {
                    "headline": "Drop some yema into each thumbprint, then seal it.",
                    "description": "Pick up a palitaw ball and fill the thumbprint with about 1 tablespoon (15 mL) of yema. Fold the dough over the yema to seal it completely, then set it aside on a baking sheet lined with parchment paper or wax paper. Continue until all the palitaw are filled with yema. Make sure that the balls have no seams or gaps, or they will come apart in the water. For a more traditional palitaw shape, gently flatten the ball between your palms. You won't be able to make it ⁄4 inch (0.64 cm) thick, which is fine."
                },
                {
                    "headline": "Boil the palitaw in 5 inches (13 cm) of water until they float.",
                    "description": "Fill a pot with 5 inches (13 cm) of water, about 2 quarts (1.9 L), then bring it to a boil. Slip 3 to 4 palitaw into the water, and allow them to cook until they float to the top. This will take about 3 minutes. Don't dump all of the palitaw into the pot. If you do this, they'll stick together. If your pot is small, cook in smaller batches of 2 or 3 palitaw."
                },
                {
                    "headline": "Scoop the palitaw out and cook some more.",
                    "description": "As you finish each batch of palitaw, set them aside on a baking sheet lined with wax paper or parchment paper so that they can dry."
                },
                {
                    "headline": "Roll the palitaw in coconut.",
                    "description": "Pour 1 cup (75 g) of grated coconut into a shallow bowl. Gently roll the cooked palitaw across the coconut to coat it. If you flattened the palitaw, pat both sides of each patty into the coconut instead. Transfer the palitaw to a serving platter as you finish coating them in coconut. Work 1 palitaw at a time."
                },
                {
                    "headline": "Sprinkle the palitaw with a mixture of sugar and toasted sesame.",
                    "description": "In a small bowl, combine ½ cup (115 g) of granulated white sugar with ¼ cup (36 g) of toasted sesame seeds. Sprinkle this mixture over each palitaw. Alternatively, leave the sesame-sugar in the bowl so that people can choose whether or not they want to use it. Toast the seeds ahead of time in a frying pan over medium heat for 30 to 45 seconds. Let them cool before you add them to the coconut and sugar."
                },
                {
                    "headline": "Serve the palitaw hot or warm.",
                    "description": "As the palitaw cool down, the yema will firm up. If you want the yema to be more gooey, serve the palitaw while they are still hot."
                }
            ]
        }
    ],
    "tyn": [
        "Making Basic Palitaw",
        "Large mixing bowl",
        "Small mixing bowl",
        "Shallow bowl or dish",
        "Deep saucepan",
        "Slotted spoon",
        "Whisk",
        "Measuring cups",
        "Measuring spoons",
        "Serving platter",
        "Trying Palitaw with Yema Filling",
        "Non-stick frying pan",
        "Wooden spoon"
    ],
    "text": " Making Basic Palitaw Combine the toasted sesame seeds and sugar, then set them aside. Place 4 tablespoons (36 g) of toasted sesame seeds into a small bowl. Add ½ cup (115 g) of granulated white sugar, then stir them together with a fork. Set the bowl aside for later. Toast the sesame seeds in a pan over medium heat for 30 to 45 seconds, then let them cool before using them. Mix the rice flour and water in a separate bowl to make a dough. Place 2 cups (300 g) of glutinous rice flour into a bowl. Add 1 cup (240 mL) of room-temperature water, then stir it in with a whisk. Once the dough comes together, knead it a few times with your hands to form a clump. Form the dough into balls, then flatten them into disks. Roll the dough into 1 in (2.5 cm) balls, then flatten them until they are ⁄4 inch (0.64 cm) thick. Work with wet hands to keep the dough from sticking to your palms and fingers. Use about 1 to 2 tablespoons (15 to 30 g) of dough for each ball. The patties will be about 2 to 3 inches (5.1 to 7.6 cm) wide once you flatten them. Bring a pot of water to a boil over medium to medium-high heat. Fill a pot with 2 quarts (1.9 L) of water. Ensure that it is at least 5 inches (13 cm) deep, then bring it to a boil over medium to medium-high heat. If the water is too shallow, the palitaw won't cook properly. Add more water, if needed, or switch to a deeper pot. Cook the palitaw 3 to 4 at a time for 1 to 3 minutes. Drop the palitaw 3 or 4 into the pot, or however many you can fit without them touching. Allow them to cook until they float to the top of the water. This will take about 1 to 3 minutes. How many palitaw you fit will depend on the size of the pot. The larger the pot is, the more you'll fit. The smaller the pot is, the fewer you'll fit. Do not dump all of the patties into the water or they will stick together. Remove the palitaw with a slotted spoon, then cook more. Place the palitaw on a baking sheet lined with parchment paper to dry. Once the pot is empty, slip more patties into the water and cook them as well. Keep going until you've cooked all of the patties. Spread the palitaw out on the baking sheet; don't lump them together. Keep an eye on the water. If it gets too shallow, add more water. Let it return to a boil before adding the palitaw. Dip the patties in grated coconut, then transfer them to a platter. Pour 1 cup (75 g) of grated coconut into a shallow dish. Place a palitaw into the coconut, then flip it over and press the other side into it as well. Do this for all of the patties, transferring them to a platter as you finish each one. This is just like dredging meat through flour and breadcrumbs when you make deep fried food. Don't let the patties cool off; the coconut will stick much better while they are still warm. Sprinkle the patties with the sesame-sugar, then serve them. You can serve them while they are still warm, or allow them to cool down to room temperature. Alternatively, put the sesame-sugar into a small bowl. This way, your guests can season the palitaw themselves. Trying Palitaw with Yema Filling Melt the butter in a pan, then whisk in the condensed milk and egg yolk. Place 1 tablespoon (15 g) of butter into a non-stick pan. Heat the butter over medium heat until it melts, then add 1 can (300 mL) of condensed milk and 3 egg yolks. Stir everything together with a whisk until the texture is consistent. For extra flavor, add 1 rind of lemon. This is your yema, which is a custard-like filling. It is very sweet. Do not use the egg whites. Separate the yolks from the whites first. Use the yolks in this recipe and save the whites for another, such as meringues. Cook the yema over medium heat for 10 minutes, then set it aside. Stir the mixture constantly with a wooden spoon as it cooks so that it doesn’t burn. After about 10 minutes or so, it will thicken into a scoopable lump. At this point, switch off the burner and set the pan aside. Allow the mixture to cool to room temperature. As the mixture cools, get started on the dough. This will help save you some time. If you added a lemon rind, pull it out as soon as you take the mixture off the stove. Prepare a batch of palitaw dough. Make the dough as usual, using 2 cups (300 g) of glutinous rice flour and 1 cup (240 mL) of room-temperature water. For an even tastier treat, use pandan-inflused water. To make pandan-infused water, boil the water with pandan leaves. Strain the leaves out, then let the water cool to room temperature before using it. Pandan leaves have a very unique flavor. Some people say it is similar to vanilla. Form the dough into small balls with a thumbprint in the middle. Pluck about 2 tablespoons  (30 g) worth of palitaw dough and roll it into an oval-shaped ball. Use your thumb to make an indent in the middle of the ball. Do this for all the dough. If the dough sticks to your hands, coat them with glutinous rice flour. Drop some yema into each thumbprint, then seal it. Pick up a palitaw ball and fill the thumbprint with about 1 tablespoon (15 mL) of yema. Fold the dough over the yema to seal it completely, then set it aside on a baking sheet lined with parchment paper or wax paper. Continue until all the palitaw are filled with yema. Make sure that the balls have no seams or gaps, or they will come apart in the water. For a more traditional palitaw shape, gently flatten the ball between your palms. You won't be able to make it ⁄4 inch (0.64 cm) thick, which is fine. Boil the palitaw in 5 inches (13 cm) of water until they float. Fill a pot with 5 inches (13 cm) of water, about 2 quarts (1.9 L), then bring it to a boil. Slip 3 to 4 palitaw into the water, and allow them to cook until they float to the top. This will take about 3 minutes. Don't dump all of the palitaw into the pot. If you do this, they'll stick together. If your pot is small, cook in smaller batches of 2 or 3 palitaw. Scoop the palitaw out and cook some more. As you finish each batch of palitaw, set them aside on a baking sheet lined with wax paper or parchment paper so that they can dry. Roll the palitaw in coconut. Pour 1 cup (75 g) of grated coconut into a shallow bowl. Gently roll the cooked palitaw across the coconut to coat it. If you flattened the palitaw, pat both sides of each patty into the coconut instead. Transfer the palitaw to a serving platter as you finish coating them in coconut. Work 1 palitaw at a time. Sprinkle the palitaw with a mixture of sugar and toasted sesame. In a small bowl, combine ½ cup (115 g) of granulated white sugar with ¼ cup (36 g) of toasted sesame seeds. Sprinkle this mixture over each palitaw. Alternatively, leave the sesame-sugar in the bowl so that people can choose whether or not they want to use it. Toast the seeds ahead of time in a frying pan over medium heat for 30 to 45 seconds. Let them cool before you add them to the coconut and sugar. Serve the palitaw hot or warm. As the palitaw cool down, the yema will firm up. If you want the yema to be more gooey, serve the palitaw while they are still hot.",
    "sentences": [
        " Making Basic Palitaw Combine the toasted sesame seeds and sugar, then set them aside.",
        "Place 4 tablespoons (36 g) of toasted sesame seeds into a small bowl.",
        "Add ½ cup (115 g) of granulated white sugar, then stir them together with a fork.",
        "Set the bowl aside for later.",
        "Toast the sesame seeds in a pan over medium heat for 30 to 45 seconds, then let them cool before using them.",
        "Mix the rice flour and water in a separate bowl to make a dough.",
        "Place 2 cups (300 g) of glutinous rice flour into a bowl.",
        "Add 1 cup (240 mL) of room-temperature water, then stir it in with a whisk.",
        "Once the dough comes together, knead it a few times with your hands to form a clump.",
        "Form the dough into balls, then flatten them into disks.",
        "Roll the dough into 1 in (2.5 cm) balls, then flatten them until they are ⁄4 inch (0.64 cm) thick.",
        "Work with wet hands to keep the dough from sticking to your palms and fingers.",
        "Use about 1 to 2 tablespoons (15 to 30 g) of dough for each ball.",
        "The patties will be about 2 to 3 inches (5.1 to 7.6 cm) wide once you flatten them.",
        "Bring a pot of water to a boil over medium to medium-high heat.",
        "Fill a pot with 2 quarts (1.9 L) of water.",
        "Ensure that it is at least 5 inches (13 cm) deep, then bring it to a boil over medium to medium-high heat.",
        "If the water is too shallow, the palitaw won't cook properly.",
        "Add more water, if needed, or switch to a deeper pot.",
        "Cook the palitaw 3 to 4 at a time for 1 to 3 minutes.",
        "Drop the palitaw 3 or 4 into the pot, or however many you can fit without them touching.",
        "Allow them to cook until they float to the top of the water.",
        "This will take about 1 to 3 minutes.",
        "How many palitaw you fit will depend on the size of the pot.",
        "The larger the pot is, the more you'll fit.",
        "The smaller the pot is, the fewer you'll fit.",
        "Do not dump all of the patties into the water or they will stick together.",
        "Remove the palitaw with a slotted spoon, then cook more.",
        "Place the palitaw on a baking sheet lined with parchment paper to dry.",
        "Once the pot is empty, slip more patties into the water and cook them as well.",
        "Keep going until you've cooked all of the patties.",
        "Spread the palitaw out on the baking sheet; don't lump them together.",
        "Keep an eye on the water.",
        "If it gets too shallow, add more water.",
        "Let it return to a boil before adding the palitaw.",
        "Dip the patties in grated coconut, then transfer them to a platter.",
        "Pour 1 cup (75 g) of grated coconut into a shallow dish.",
        "Place a palitaw into the coconut, then flip it over and press the other side into it as well.",
        "Do this for all of the patties, transferring them to a platter as you finish each one.",
        "This is just like dredging meat through flour and breadcrumbs when you make deep fried food.",
        "Don't let the patties cool off; the coconut will stick much better while they are still warm.",
        "Sprinkle the patties with the sesame-sugar, then serve them.",
        "You can serve them while they are still warm, or allow them to cool down to room temperature.",
        "Alternatively, put the sesame-sugar into a small bowl.",
        "This way, your guests can season the palitaw themselves.",
        "Trying Palitaw with Yema Filling Melt the butter in a pan, then whisk in the condensed milk and egg yolk.",
        "Place 1 tablespoon (15 g) of butter into a non-stick pan.",
        "Heat the butter over medium heat until it melts, then add 1 can (300 mL) of condensed milk and 3 egg yolks.",
        "Stir everything together with a whisk until the texture is consistent.",
        "For extra flavor, add 1 rind of lemon.",
        "This is your yema, which is a custard-like filling.",
        "It is very sweet.",
        "Do not use the egg whites.",
        "Separate the yolks from the whites first.",
        "Use the yolks in this recipe and save the whites for another, such as meringues.",
        "Cook the yema over medium heat for 10 minutes, then set it aside.",
        "Stir the mixture constantly with a wooden spoon as it cooks so that it doesn’t burn.",
        "After about 10 minutes or so, it will thicken into a scoopable lump.",
        "At this point, switch off the burner and set the pan aside.",
        "Allow the mixture to cool to room temperature.",
        "As the mixture cools, get started on the dough.",
        "This will help save you some time.",
        "If you added a lemon rind, pull it out as soon as you take the mixture off the stove.",
        "Prepare a batch of palitaw dough.",
        "Make the dough as usual, using 2 cups (300 g) of glutinous rice flour and 1 cup (240 mL) of room-temperature water.",
        "For an even tastier treat, use pandan-inflused water.",
        "To make pandan-infused water, boil the water with pandan leaves.",
        "Strain the leaves out, then let the water cool to room temperature before using it.",
        "Pandan leaves have a very unique flavor.",
        "Some people say it is similar to vanilla.",
        "Form the dough into small balls with a thumbprint in the middle.",
        "Pluck about 2 tablespoons  (30 g) worth of palitaw dough and roll it into an oval-shaped ball.",
        "Use your thumb to make an indent in the middle of the ball.",
        "Do this for all the dough.",
        "If the dough sticks to your hands, coat them with glutinous rice flour.",
        "Drop some yema into each thumbprint, then seal it.",
        "Pick up a palitaw ball and fill the thumbprint with about 1 tablespoon (15 mL) of yema.",
        "Fold the dough over the yema to seal it completely, then set it aside on a baking sheet lined with parchment paper or wax paper.",
        "Continue until all the palitaw are filled with yema.",
        "Make sure that the balls have no seams or gaps, or they will come apart in the water.",
        "For a more traditional palitaw shape, gently flatten the ball between your palms.",
        "You won't be able to make it ⁄4 inch (0.64 cm) thick, which is fine.",
        "Boil the palitaw in 5 inches (13 cm) of water until they float.",
        "Fill a pot with 5 inches (13 cm) of water, about 2 quarts (1.9 L), then bring it to a boil.",
        "Slip 3 to 4 palitaw into the water, and allow them to cook until they float to the top.",
        "This will take about 3 minutes.",
        "Don't dump all of the palitaw into the pot.",
        "If you do this, they'll stick together.",
        "If your pot is small, cook in smaller batches of 2 or 3 palitaw.",
        "Scoop the palitaw out and cook some more.",
        "As you finish each batch of palitaw, set them aside on a baking sheet lined with wax paper or parchment paper so that they can dry.",
        "Roll the palitaw in coconut.",
        "Pour 1 cup (75 g) of grated coconut into a shallow bowl.",
        "Gently roll the cooked palitaw across the coconut to coat it.",
        "If you flattened the palitaw, pat both sides of each patty into the coconut instead.",
        "Transfer the palitaw to a serving platter as you finish coating them in coconut.",
        "Work 1 palitaw at a time.",
        "Sprinkle the palitaw with a mixture of sugar and toasted sesame.",
        "In a small bowl, combine ½ cup (115 g) of granulated white sugar with ¼ cup (36 g) of toasted sesame seeds.",
        "Sprinkle this mixture over each palitaw.",
        "Alternatively, leave the sesame-sugar in the bowl so that people can choose whether or not they want to use it.",
        "Toast the seeds ahead of time in a frying pan over medium heat for 30 to 45 seconds.",
        "Let them cool before you add them to the coconut and sugar.",
        "Serve the palitaw hot or warm.",
        "As the palitaw cool down, the yema will firm up.",
        "If you want the yema to be more gooey, serve the palitaw while they are still hot."
    ]
}