{
    "title": "How to Make a Floral Headdress",
    "url": "https://www.wikihow.com/Make-a-Floral-Headdress",
    "category_hierarchy": [
        "Family Life",
        "Weddings",
        "Wedding Flowers"
    ],
    "parts": [
        {
            "name": "Selecting Your Florals and Greenery",
            "steps": [
                {
                    "headline": "Choose the main flowers for your headdress.",
                    "description": "Visit a florist, grocery store, or any retailer that sells flowers in your area and choose the flowers you want to use to create your floral headdress. Depending on the size of the flowers and bunches they are sold in, you will need 1 to 2 bunches of your main flowers (about 6 to 12 stems). The main flowers set the tone for your headdress and make the biggest statement, so keep in mind what color scheme and vibe you are going for. You can use real or fake flowers depending on the occasion and your personal preference. Choose one main flower for your headdress, or mix it up with 2 or 3 options. Roses, dahlias, daisies, carnations, and peonies are all great options that tend to hold up well on floral headdresses."
                },
                {
                    "headline": "Find filler flowers to enhance and complement your main flowers.",
                    "description": "Filler flowers are smaller flowers that can be used to fill in any dead space on your floral headdress. While you can certainly make a floral headdress using only your main flowers, adding filler flowers is a great option if you want to add more color and visual interest to your headdress. Baby’s breath, poms, and statice make great options for filler flowers. Depending on the size of the flowers and the bunches they are sold in, you will likely need 1 or 2 bunches of filler flowers."
                },
                {
                    "headline": "Select greenery for the base of your headdress.",
                    "description": "Like filler flowers, greenery adds visual interest to your floral headdress. Adding greenery is also helpful if you want to disguise the florist wire base of your headdress and hide it from view. Ivy, eucalyptus, and ferns are some great greenery options. These plants have long and bendable stems or leaves, making them easy to wrap around the florist wire base."
                }
            ]
        },
        {
            "name": "Shaping the Florist Wire",
            "steps": [
                {
                    "headline": "Measure your head with measuring tape.",
                    "description": "Using a bendable measuring tape, wrap the measuring tape across your forehead and around the back of your head. Once the measuring tape is wrapped in a circle around your head, hold the tape between two fingers to mark where the tape meets. You may want to write down your measurement, as you will need to refer to this later on. When wrapping the measuring tape around your head, make sure that you don’t hold the tape too tightly or the crown may be tight and uncomfortable."
                },
                {
                    "headline": "Cut the floral wire for your headdress with scissors.",
                    "description": "Once you have measured your head, line up the measuring tape to your green florist wire. Add 2 inches (5.1 cm) to the length, then use scissors to cut the wire. You will need to overlap the ends of the florist wire in order to connect it into a circular crown, so adding about 2 inches (5.1 cm) to the length is crucial."
                },
                {
                    "headline": "Mold the florist wire into a crown shape.",
                    "description": "Once you have measured and cut the green florist wire, wrap it across your forehead and around the back of your head. Overlap the extra 2 inches (5.1 cm) in length and hold it together tightly between your finger and thumb on one hand. Use your fingers on the other hand to adjust the shape of the wire so that it fits comfortably around your head. Since you will be adding flowers and greenery, leave a little bit of wiggle room so that the crown doesn’t get too tight with the floral additions later on."
                },
                {
                    "headline": "Tape the overlapping florist wire to secure in a circle.",
                    "description": "After you have molded the florist wire to fit your head, remove it while maintaining your hold on the overlapping ends. Wrap the overlapping ends tightly with florist tape, replacing your fingers with the tape. You can also use thin craft wire to secure the ends. To do this, cut a 2 inches (5.1 cm) to 3 inches (7.6 cm) piece of craft wire. Twist the craft wire around the overlapping section to secure in place."
                }
            ]
        },
        {
            "name": "Making Your Floral Bunches",
            "steps": [
                {
                    "headline": "Cut your floral stems.",
                    "description": "Using scissors, cut both your main and filler flower stems about 2 inches (5.1 cm) down from the base of the flower head. You will attach the flowers together and to the florist wire crown by the stems, so it is important that you leave enough stem to do this. While the stems may look a bit long, you will be able to trim them later on."
                },
                {
                    "headline": "Arrange the flowers in small bunches.",
                    "description": "Gather together 1 or 2 of your main flowers, along with a few sprigs of the filler flowers (about 1 to 5 depending on how big your flowers are). Separate these into a small pile away from the rest of your flowers. Repeat this process until all your main flowers and fillers are separated into small bunches. Note that while you may not end up needing all your flower bunches, it is helpful to have them separated and arranged to your taste in case you do end up needing them all. This way, you don’t have to stop and make more as you go – they will be ready to go as needed."
                },
                {
                    "headline": "Secure the bunches together.",
                    "description": "Using floral tape or craft wire, secure each of the bunches together by wrapping the tape or wire around the stems. Start just below the flower heads and wrap down the stems until they are securely fastened together. Leave a little bit of room at the bottom of the stems so that you can trim later if needed."
                }
            ]
        },
        {
            "name": "Adding Your Flowers and Greenery",
            "steps": [
                {
                    "headline": "Secure your greenery to the florist wire crown.",
                    "description": "If you are using a long type of greenery, such as ivy or eucalyptus, you can attach this easily by cutting it about 2 inches (5.1 cm) longer than your florist wire crown and wrapping it around the crown, alternate over and under. Secure the greenery by overlapping the excess 2 inches (5.1 cm) and wrapping the overlapped section with floral tape or thin craft wire. If you are using a shorter type of greenery, such as individual leaves or sprigs, attach each individually. You can do this by placing each leaf or sprig where you want it on the florist wire crown and holding it in place with your fingers. Then, secure it to the crown by wrapping the stem and florist wire together with florist tape or craft wire. Repeat until all your greenery is attached. Attaching your greenery first will make it easier for you to seamlessly nestle your flower bunches amongst the greenery."
                },
                {
                    "headline": "Attach the floral bunches to your headdress.",
                    "description": "Start by selecting one of your pre-arranged floral bunches. Decide where you want to attach the bunch and hold it in place on the crown with your fingers. Secure the bunch to the crown by wrapping the stems and florist wire together with florist tape or craft wire. Repeat this until you have attached all the floral bunches you need to achieve your desired look. Attach the floral bunches one by one, stopping to briefly examine the crown so that you can adjust the placement as you go to get the look you are going for."
                },
                {
                    "headline": "Trim any extra stems.",
                    "description": "To complete your floral headdress, use scissors to clip off any stems that are sticking out. Be careful not to cut any of the flowers or any of the florist tape or wire that holds your crown together."
                }
            ]
        }
    ],
    "tyn": [
        "Main flowers of choice",
        "Filler flowers of choice",
        "Greenery of choice",
        "Green florist wire",
        "Scissors",
        "Floral tape or craft wire"
    ],
    "text": " Selecting Your Florals and Greenery Choose the main flowers for your headdress. Visit a florist, grocery store, or any retailer that sells flowers in your area and choose the flowers you want to use to create your floral headdress. Depending on the size of the flowers and bunches they are sold in, you will need 1 to 2 bunches of your main flowers (about 6 to 12 stems). The main flowers set the tone for your headdress and make the biggest statement, so keep in mind what color scheme and vibe you are going for. You can use real or fake flowers depending on the occasion and your personal preference. Choose one main flower for your headdress, or mix it up with 2 or 3 options. Roses, dahlias, daisies, carnations, and peonies are all great options that tend to hold up well on floral headdresses. Find filler flowers to enhance and complement your main flowers. Filler flowers are smaller flowers that can be used to fill in any dead space on your floral headdress. While you can certainly make a floral headdress using only your main flowers, adding filler flowers is a great option if you want to add more color and visual interest to your headdress. Baby’s breath, poms, and statice make great options for filler flowers. Depending on the size of the flowers and the bunches they are sold in, you will likely need 1 or 2 bunches of filler flowers. Select greenery for the base of your headdress. Like filler flowers, greenery adds visual interest to your floral headdress. Adding greenery is also helpful if you want to disguise the florist wire base of your headdress and hide it from view. Ivy, eucalyptus, and ferns are some great greenery options. These plants have long and bendable stems or leaves, making them easy to wrap around the florist wire base. Shaping the Florist Wire Measure your head with measuring tape. Using a bendable measuring tape, wrap the measuring tape across your forehead and around the back of your head. Once the measuring tape is wrapped in a circle around your head, hold the tape between two fingers to mark where the tape meets. You may want to write down your measurement, as you will need to refer to this later on. When wrapping the measuring tape around your head, make sure that you don’t hold the tape too tightly or the crown may be tight and uncomfortable. Cut the floral wire for your headdress with scissors. Once you have measured your head, line up the measuring tape to your green florist wire. Add 2 inches (5.1 cm) to the length, then use scissors to cut the wire. You will need to overlap the ends of the florist wire in order to connect it into a circular crown, so adding about 2 inches (5.1 cm) to the length is crucial. Mold the florist wire into a crown shape. Once you have measured and cut the green florist wire, wrap it across your forehead and around the back of your head. Overlap the extra 2 inches (5.1 cm) in length and hold it together tightly between your finger and thumb on one hand. Use your fingers on the other hand to adjust the shape of the wire so that it fits comfortably around your head. Since you will be adding flowers and greenery, leave a little bit of wiggle room so that the crown doesn’t get too tight with the floral additions later on. Tape the overlapping florist wire to secure in a circle. After you have molded the florist wire to fit your head, remove it while maintaining your hold on the overlapping ends. Wrap the overlapping ends tightly with florist tape, replacing your fingers with the tape. You can also use thin craft wire to secure the ends. To do this, cut a 2 inches (5.1 cm) to 3 inches (7.6 cm) piece of craft wire. Twist the craft wire around the overlapping section to secure in place. Making Your Floral Bunches Cut your floral stems. Using scissors, cut both your main and filler flower stems about 2 inches (5.1 cm) down from the base of the flower head. You will attach the flowers together and to the florist wire crown by the stems, so it is important that you leave enough stem to do this. While the stems may look a bit long, you will be able to trim them later on. Arrange the flowers in small bunches. Gather together 1 or 2 of your main flowers, along with a few sprigs of the filler flowers (about 1 to 5 depending on how big your flowers are). Separate these into a small pile away from the rest of your flowers. Repeat this process until all your main flowers and fillers are separated into small bunches. Note that while you may not end up needing all your flower bunches, it is helpful to have them separated and arranged to your taste in case you do end up needing them all. This way, you don’t have to stop and make more as you go – they will be ready to go as needed. Secure the bunches together. Using floral tape or craft wire, secure each of the bunches together by wrapping the tape or wire around the stems. Start just below the flower heads and wrap down the stems until they are securely fastened together. Leave a little bit of room at the bottom of the stems so that you can trim later if needed. Adding Your Flowers and Greenery Secure your greenery to the florist wire crown. If you are using a long type of greenery, such as ivy or eucalyptus, you can attach this easily by cutting it about 2 inches (5.1 cm) longer than your florist wire crown and wrapping it around the crown, alternate over and under. Secure the greenery by overlapping the excess 2 inches (5.1 cm) and wrapping the overlapped section with floral tape or thin craft wire. If you are using a shorter type of greenery, such as individual leaves or sprigs, attach each individually. You can do this by placing each leaf or sprig where you want it on the florist wire crown and holding it in place with your fingers. Then, secure it to the crown by wrapping the stem and florist wire together with florist tape or craft wire. Repeat until all your greenery is attached. Attaching your greenery first will make it easier for you to seamlessly nestle your flower bunches amongst the greenery. Attach the floral bunches to your headdress. Start by selecting one of your pre-arranged floral bunches. Decide where you want to attach the bunch and hold it in place on the crown with your fingers. Secure the bunch to the crown by wrapping the stems and florist wire together with florist tape or craft wire. Repeat this until you have attached all the floral bunches you need to achieve your desired look. Attach the floral bunches one by one, stopping to briefly examine the crown so that you can adjust the placement as you go to get the look you are going for. Trim any extra stems. To complete your floral headdress, use scissors to clip off any stems that are sticking out. Be careful not to cut any of the flowers or any of the florist tape or wire that holds your crown together.",
    "sentences": [
        " Selecting Your Florals and Greenery Choose the main flowers for your headdress.",
        "Visit a florist, grocery store, or any retailer that sells flowers in your area and choose the flowers you want to use to create your floral headdress.",
        "Depending on the size of the flowers and bunches they are sold in, you will need 1 to 2 bunches of your main flowers (about 6 to 12 stems).",
        "The main flowers set the tone for your headdress and make the biggest statement, so keep in mind what color scheme and vibe you are going for.",
        "You can use real or fake flowers depending on the occasion and your personal preference.",
        "Choose one main flower for your headdress, or mix it up with 2 or 3 options.",
        "Roses, dahlias, daisies, carnations, and peonies are all great options that tend to hold up well on floral headdresses.",
        "Find filler flowers to enhance and complement your main flowers.",
        "Filler flowers are smaller flowers that can be used to fill in any dead space on your floral headdress.",
        "While you can certainly make a floral headdress using only your main flowers, adding filler flowers is a great option if you want to add more color and visual interest to your headdress.",
        "Baby’s breath, poms, and statice make great options for filler flowers.",
        "Depending on the size of the flowers and the bunches they are sold in, you will likely need 1 or 2 bunches of filler flowers.",
        "Select greenery for the base of your headdress.",
        "Like filler flowers, greenery adds visual interest to your floral headdress.",
        "Adding greenery is also helpful if you want to disguise the florist wire base of your headdress and hide it from view.",
        "Ivy, eucalyptus, and ferns are some great greenery options.",
        "These plants have long and bendable stems or leaves, making them easy to wrap around the florist wire base.",
        "Shaping the Florist Wire Measure your head with measuring tape.",
        "Using a bendable measuring tape, wrap the measuring tape across your forehead and around the back of your head.",
        "Once the measuring tape is wrapped in a circle around your head, hold the tape between two fingers to mark where the tape meets.",
        "You may want to write down your measurement, as you will need to refer to this later on.",
        "When wrapping the measuring tape around your head, make sure that you don’t hold the tape too tightly or the crown may be tight and uncomfortable.",
        "Cut the floral wire for your headdress with scissors.",
        "Once you have measured your head, line up the measuring tape to your green florist wire.",
        "Add 2 inches (5.1 cm) to the length, then use scissors to cut the wire.",
        "You will need to overlap the ends of the florist wire in order to connect it into a circular crown, so adding about 2 inches (5.1 cm) to the length is crucial.",
        "Mold the florist wire into a crown shape.",
        "Once you have measured and cut the green florist wire, wrap it across your forehead and around the back of your head.",
        "Overlap the extra 2 inches (5.1 cm) in length and hold it together tightly between your finger and thumb on one hand.",
        "Use your fingers on the other hand to adjust the shape of the wire so that it fits comfortably around your head.",
        "Since you will be adding flowers and greenery, leave a little bit of wiggle room so that the crown doesn’t get too tight with the floral additions later on.",
        "Tape the overlapping florist wire to secure in a circle.",
        "After you have molded the florist wire to fit your head, remove it while maintaining your hold on the overlapping ends.",
        "Wrap the overlapping ends tightly with florist tape, replacing your fingers with the tape.",
        "You can also use thin craft wire to secure the ends.",
        "To do this, cut a 2 inches (5.1 cm) to 3 inches (7.6 cm) piece of craft wire.",
        "Twist the craft wire around the overlapping section to secure in place.",
        "Making Your Floral Bunches Cut your floral stems.",
        "Using scissors, cut both your main and filler flower stems about 2 inches (5.1 cm) down from the base of the flower head.",
        "You will attach the flowers together and to the florist wire crown by the stems, so it is important that you leave enough stem to do this.",
        "While the stems may look a bit long, you will be able to trim them later on.",
        "Arrange the flowers in small bunches.",
        "Gather together 1 or 2 of your main flowers, along with a few sprigs of the filler flowers (about 1 to 5 depending on how big your flowers are).",
        "Separate these into a small pile away from the rest of your flowers.",
        "Repeat this process until all your main flowers and fillers are separated into small bunches.",
        "Note that while you may not end up needing all your flower bunches, it is helpful to have them separated and arranged to your taste in case you do end up needing them all.",
        "This way, you don’t have to stop and make more as you go – they will be ready to go as needed.",
        "Secure the bunches together.",
        "Using floral tape or craft wire, secure each of the bunches together by wrapping the tape or wire around the stems.",
        "Start just below the flower heads and wrap down the stems until they are securely fastened together.",
        "Leave a little bit of room at the bottom of the stems so that you can trim later if needed.",
        "Adding Your Flowers and Greenery Secure your greenery to the florist wire crown.",
        "If you are using a long type of greenery, such as ivy or eucalyptus, you can attach this easily by cutting it about 2 inches (5.1 cm) longer than your florist wire crown and wrapping it around the crown, alternate over and under.",
        "Secure the greenery by overlapping the excess 2 inches (5.1 cm) and wrapping the overlapped section with floral tape or thin craft wire.",
        "If you are using a shorter type of greenery, such as individual leaves or sprigs, attach each individually.",
        "You can do this by placing each leaf or sprig where you want it on the florist wire crown and holding it in place with your fingers.",
        "Then, secure it to the crown by wrapping the stem and florist wire together with florist tape or craft wire.",
        "Repeat until all your greenery is attached.",
        "Attaching your greenery first will make it easier for you to seamlessly nestle your flower bunches amongst the greenery.",
        "Attach the floral bunches to your headdress.",
        "Start by selecting one of your pre-arranged floral bunches.",
        "Decide where you want to attach the bunch and hold it in place on the crown with your fingers.",
        "Secure the bunch to the crown by wrapping the stems and florist wire together with florist tape or craft wire.",
        "Repeat this until you have attached all the floral bunches you need to achieve your desired look.",
        "Attach the floral bunches one by one, stopping to briefly examine the crown so that you can adjust the placement as you go to get the look you are going for.",
        "Trim any extra stems.",
        "To complete your floral headdress, use scissors to clip off any stems that are sticking out.",
        "Be careful not to cut any of the flowers or any of the florist tape or wire that holds your crown together."
    ]
}