{
    "title": "How to Make a Wrist Corsage",
    "url": "https://www.wikihow.com/Make-a-Wrist-Corsage",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Performing Arts",
        "Dancing"
    ],
    "methods": [
        {
            "name": "Traditional Corsage",
            "steps": [
                {
                    "headline": "Decide on a color theme.",
                    "description": "Stick to colors that compliment each other. Consider the colors found on the dress or suit, and make sure your theme matches appropriately. If for prom, consider using your school colors. You can look at an interior design color wheel for inspiration if necessary. Choose colors that are opposite from each other on the wheel — for instance, yellow and purple, or blue and orange."
                },
                {
                    "headline": "Choose your flowers.",
                    "description": "Purchase (or pick from the garden) flowers that are close to fully blooming, and keep them in water before you make the corsage. Plan on getting three to five blooms, depending on their size. In general, try to choose sturdy flowers that can hold up to some wear — they'll look better at the end of the night than delicate flowers, such as tulips. Here are some popular options to consider:\nRoses\nDaisies\nOrchids\nLilies\nCymbidium"
                },
                {
                    "headline": "Choose a filler flower.",
                    "description": "This is an accent to the main flowers. It adds fullness to the overall corsage and highlights the color. Examples of filler flowers include:\nBaby's breath (gypsophila)\nFern leaves\nEucalyptus"
                },
                {
                    "headline": "Choose your wristband.",
                    "description": "The flowers are the main event, but how you anchor your corsage can change the aesthetic. Try these options:\nBuy a corsage bracelet\nMake a band out of coordinating ribbon or lace\nAny band that is snug on your wrist"
                },
                {
                    "headline": "Choose any coordinating trinkets, if desired.",
                    "description": "An accent to a wrist corsage can be eye-catching and personalize your corsage. Bracelet charms\nPearls\nLace"
                },
                {
                    "headline": "Cut the stems of the flowers short.",
                    "description": "Leave about 1/2 to 1 inch (1.3 to 2.5 cm) under the bud. Use wire cutters or scissors to cut the stems to equal lengths. Add wire to any flowers with too-short stems."
                },
                {
                    "headline": "Bind each of the flower stems with floral wire and tape.",
                    "description": "This will make it easier for you to bend the flowers into the position desired. Start from the top of the stems and work towards the bottom. The tape wraps at a diagonal, like the stripes on a barber pole. Make two rounds with the floral tape to completely cover the stems."
                },
                {
                    "headline": "Assemble the base of the corsage.",
                    "description": "Tape the primary flowers together in a bundle with the floral tape. Use the same diagonal method. Tape the filler flowers in a separate bundle. Again, use the same diagonal taping method. Bind the two bundles together with florist wire. Attach any trinkets with florist wire at this stage."
                },
                {
                    "headline": "Place the band in between the two sections.",
                    "description": "Attach the band to the group of flowers, again with floral wire. The flowers should be pointing towards the elbow."
                },
                {
                    "headline": "Form a bow out of ribbon.",
                    "description": "Several strands of thin ribbon or one strand of wide ribbon work best. The easiest way to form a bow is to make six loops of ribbon around your hand and cut off the ends at an angle. Slip the ribbon off the hand and, holding the loops flat, wrap another section of ribbon around the center of the loops and tie tightly. Start with the innermost loop of ribbon, slide it out and give the ribbon a twist to the left. Pull out the next loop and twist to the right. Continue pulling out the loops and alternating the twists until both sides of the bow loops are out. Hold the cut ends and shake the bow slightly to let it puff up."
                },
                {
                    "headline": "Attach the bow with the band and flowers.",
                    "description": "Use florist wire to arrange. Make sure the band is big enough to fit snugly on your wrist without cutting off circulation. Adjust as necessary."
                }
            ]
        },
        {
            "name": "Modern Corsage",
            "steps": [
                {
                    "headline": "Cut a length of velvet ribbon long enough to wrap around the wrist.",
                    "description": "Leave 3 to 4 inches to hang down at each end. Coordinate the ribbon color with the dress and the flower."
                },
                {
                    "headline": "Fold the ribbon in half.",
                    "description": "Make a small slit in the center for the flower stem."
                },
                {
                    "headline": "Choose a large, healthy blossom.",
                    "description": "This flower should be able to stand on its own. Lilies, Sunflowers, Gerbera daisies, Hydrangeas, etc., are the right size."
                },
                {
                    "headline": "Cut the stem.",
                    "description": "Leave about 2 1/2 inches (6.35 cm). Wrap the stem with floral tape to protect it and to keep it from slipping out of the slit after it's been inserted."
                },
                {
                    "headline": "Tuck the blossom through the slit in the ribbon.",
                    "description": "Use floral glue or tape to keep the blossom from moving."
                }
            ]
        }
    ],
    "tyn": [
        "Real or fabric flowers",
        "Filler flowers",
        "Small-sized floral leaves (optional)",
        "Floral wire and tape",
        "Decorative elastic strap or ribbon",
        "Embellishments",
        "Scissors"
    ],
    "text": " Traditional Corsage Decide on a color theme. Stick to colors that compliment each other. Consider the colors found on the dress or suit, and make sure your theme matches appropriately. If for prom, consider using your school colors. You can look at an interior design color wheel for inspiration if necessary. Choose colors that are opposite from each other on the wheel — for instance, yellow and purple, or blue and orange. Choose your flowers. Purchase (or pick from the garden) flowers that are close to fully blooming, and keep them in water before you make the corsage. Plan on getting three to five blooms, depending on their size. In general, try to choose sturdy flowers that can hold up to some wear — they'll look better at the end of the night than delicate flowers, such as tulips. Here are some popular options to consider:\nRoses\nDaisies\nOrchids\nLilies\nCymbidium Choose a filler flower. This is an accent to the main flowers. It adds fullness to the overall corsage and highlights the color. Examples of filler flowers include:\nBaby's breath (gypsophila)\nFern leaves\nEucalyptus Choose your wristband. The flowers are the main event, but how you anchor your corsage can change the aesthetic. Try these options:\nBuy a corsage bracelet\nMake a band out of coordinating ribbon or lace\nAny band that is snug on your wrist Choose any coordinating trinkets, if desired. An accent to a wrist corsage can be eye-catching and personalize your corsage. Bracelet charms\nPearls\nLace Cut the stems of the flowers short. Leave about 1/2 to 1 inch (1.3 to 2.5 cm) under the bud. Use wire cutters or scissors to cut the stems to equal lengths. Add wire to any flowers with too-short stems. Bind each of the flower stems with floral wire and tape. This will make it easier for you to bend the flowers into the position desired. Start from the top of the stems and work towards the bottom. The tape wraps at a diagonal, like the stripes on a barber pole. Make two rounds with the floral tape to completely cover the stems. Assemble the base of the corsage. Tape the primary flowers together in a bundle with the floral tape. Use the same diagonal method. Tape the filler flowers in a separate bundle. Again, use the same diagonal taping method. Bind the two bundles together with florist wire. Attach any trinkets with florist wire at this stage. Place the band in between the two sections. Attach the band to the group of flowers, again with floral wire. The flowers should be pointing towards the elbow. Form a bow out of ribbon. Several strands of thin ribbon or one strand of wide ribbon work best. The easiest way to form a bow is to make six loops of ribbon around your hand and cut off the ends at an angle. Slip the ribbon off the hand and, holding the loops flat, wrap another section of ribbon around the center of the loops and tie tightly. Start with the innermost loop of ribbon, slide it out and give the ribbon a twist to the left. Pull out the next loop and twist to the right. Continue pulling out the loops and alternating the twists until both sides of the bow loops are out. Hold the cut ends and shake the bow slightly to let it puff up. Attach the bow with the band and flowers. Use florist wire to arrange. Make sure the band is big enough to fit snugly on your wrist without cutting off circulation. Adjust as necessary. Modern Corsage Cut a length of velvet ribbon long enough to wrap around the wrist. Leave 3 to 4 inches to hang down at each end. Coordinate the ribbon color with the dress and the flower. Fold the ribbon in half. Make a small slit in the center for the flower stem. Choose a large, healthy blossom. This flower should be able to stand on its own. Lilies, Sunflowers, Gerbera daisies, Hydrangeas, etc., are the right size. Cut the stem. Leave about 2 1/2 inches (6.35 cm). Wrap the stem with floral tape to protect it and to keep it from slipping out of the slit after it's been inserted. Tuck the blossom through the slit in the ribbon. Use floral glue or tape to keep the blossom from moving.",
    "sentences": [
        " Traditional Corsage Decide on a color theme.",
        "Stick to colors that compliment each other.",
        "Consider the colors found on the dress or suit, and make sure your theme matches appropriately.",
        "If for prom, consider using your school colors.",
        "You can look at an interior design color wheel for inspiration if necessary.",
        "Choose colors that are opposite from each other on the wheel — for instance, yellow and purple, or blue and orange.",
        "Choose your flowers.",
        "Purchase (or pick from the garden) flowers that are close to fully blooming, and keep them in water before you make the corsage.",
        "Plan on getting three to five blooms, depending on their size.",
        "In general, try to choose sturdy flowers that can hold up to some wear — they'll look better at the end of the night than delicate flowers, such as tulips.",
        "Here are some popular options to consider:\nRoses\nDaisies\nOrchids\nLilies\nCymbidium Choose a filler flower.",
        "This is an accent to the main flowers.",
        "It adds fullness to the overall corsage and highlights the color.",
        "Examples of filler flowers include:\nBaby's breath (gypsophila)\nFern leaves\nEucalyptus Choose your wristband.",
        "The flowers are the main event, but how you anchor your corsage can change the aesthetic.",
        "Try these options:\nBuy a corsage bracelet\nMake a band out of coordinating ribbon or lace\nAny band that is snug on your wrist Choose any coordinating trinkets, if desired.",
        "An accent to a wrist corsage can be eye-catching and personalize your corsage.",
        "Bracelet charms\nPearls\nLace Cut the stems of the flowers short.",
        "Leave about 1/2 to 1 inch (1.3 to 2.5 cm) under the bud.",
        "Use wire cutters or scissors to cut the stems to equal lengths.",
        "Add wire to any flowers with too-short stems.",
        "Bind each of the flower stems with floral wire and tape.",
        "This will make it easier for you to bend the flowers into the position desired.",
        "Start from the top of the stems and work towards the bottom.",
        "The tape wraps at a diagonal, like the stripes on a barber pole.",
        "Make two rounds with the floral tape to completely cover the stems.",
        "Assemble the base of the corsage.",
        "Tape the primary flowers together in a bundle with the floral tape.",
        "Use the same diagonal method.",
        "Tape the filler flowers in a separate bundle.",
        "Again, use the same diagonal taping method.",
        "Bind the two bundles together with florist wire.",
        "Attach any trinkets with florist wire at this stage.",
        "Place the band in between the two sections.",
        "Attach the band to the group of flowers, again with floral wire.",
        "The flowers should be pointing towards the elbow.",
        "Form a bow out of ribbon.",
        "Several strands of thin ribbon or one strand of wide ribbon work best.",
        "The easiest way to form a bow is to make six loops of ribbon around your hand and cut off the ends at an angle.",
        "Slip the ribbon off the hand and, holding the loops flat, wrap another section of ribbon around the center of the loops and tie tightly.",
        "Start with the innermost loop of ribbon, slide it out and give the ribbon a twist to the left.",
        "Pull out the next loop and twist to the right.",
        "Continue pulling out the loops and alternating the twists until both sides of the bow loops are out.",
        "Hold the cut ends and shake the bow slightly to let it puff up.",
        "Attach the bow with the band and flowers.",
        "Use florist wire to arrange.",
        "Make sure the band is big enough to fit snugly on your wrist without cutting off circulation.",
        "Adjust as necessary.",
        "Modern Corsage Cut a length of velvet ribbon long enough to wrap around the wrist.",
        "Leave 3 to 4 inches to hang down at each end.",
        "Coordinate the ribbon color with the dress and the flower.",
        "Fold the ribbon in half.",
        "Make a small slit in the center for the flower stem.",
        "Choose a large, healthy blossom.",
        "This flower should be able to stand on its own.",
        "Lilies, Sunflowers, Gerbera daisies, Hydrangeas, etc., are the right size.",
        "Cut the stem.",
        "Leave about 2 1/2 inches (6.35 cm).",
        "Wrap the stem with floral tape to protect it and to keep it from slipping out of the slit after it's been inserted.",
        "Tuck the blossom through the slit in the ribbon.",
        "Use floral glue or tape to keep the blossom from moving."
    ]
}