{
    "title": "How to Make Marble Cake",
    "url": "https://www.wikihow.com/Make-Marble-Cake",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cakes"
    ],
    "methods": [
        {
            "name": "Marble Cake from a Mix",
            "steps": [
                {
                    "headline": "Preheat the oven to 350 °F (177 °C) and grease 2 round cake pans.",
                    "description": "Choose 9 in (23 cm) pans that are at least 2 inches (5.1 cm) deep. Spray the inside with baking spray to prevent the marble cakes from sticking. To make a large, single-layer cake, use a 9 in × 13 in (23 cm × 33 cm) cake pan."
                },
                {
                    "headline": "Put the mix, sugar, salt, eggs, vanilla, fats, milk, and water in a bowl.",
                    "description": "Open a 15.25-ounce (432 g) box of yellow or white cake mix and put it in a large mixing bowl. Ignore the instructions on the box and instead add 1/2 cup (100 g) of granulated sugar and 1/4 teaspoon (1.5 g) of salt. Add 4 eggs and these liquids:\n2 teaspoons (9.9 ml) of vanilla extract\n\n⁄3 cup (79 ml) of canola oil or vegetable oil\n4 tablespoons (56 g) of melted butter\n\n⁄4 cup (59 ml) of whole milk\n1 cup (240 ml) of water"
                },
                {
                    "headline": "Beat the ingredients in the bowl for 2 minutes.",
                    "description": "Turn a hand or stand mixer to low and beat until the eggs are combined. Then turn the mixer up to medium speed and beat the batter for 2 minutes. Stop the mixer and scrape down the sides of the bowl with a spatula once or twice."
                },
                {
                    "headline": "Stir in the flour until it's incorporated.",
                    "description": "Reduce the mixer speed to low and gradually beat in 2/3 cup (83 g) of all-purpose flour or 3/4 cup (75 g) of cake flour. Beat just until the flour is mixed into the wet batter.Did You Know? While you can use all-purpose or cake flour, the cake flour has a lower protein content. This will make the cake a little lighter and fluffier than a cake that uses all-purpose flour."
                },
                {
                    "headline": "Mix the cocoa, sour cream, and 1 cup (340 g) of the batter in a another bowl.",
                    "description": "Put 3 tablespoons (22 g) of unsweetened cocoa powder into a separate mixing bowl and add 2 tablespoons (24 g) of sour cream. Stir or whisk the cocoa until it's incorporated. Then stir in 1 cup (340 g) of the batter from the other mixing bowl. This will make the chocolate batter for the marble cake."
                },
                {
                    "headline": "Spread the plain batter and spoon the chocolate batter on top.",
                    "description": "Divide the plain white or yellow cake batter between the prepared cake pans or pour the plain batter into the large cake pan. Then dollop large spoonfuls of the chocolate batter over the plain batter in the pan. Leave about 2 inches (5.1 cm) of space between the blobs of chocolate batter."
                },
                {
                    "headline": "Use a skewer to swirl the batters.",
                    "description": "Insert the skewer so it almost reaches the bottom of the pan and then drag it in a figure-8 pattern so it moves through several of the chocolate blobs. Then insert the skewer into another part of the pan and make another figure-8. Do this 1 to 2 more times so each chocolate blob is marbled. It's important to not over-swirl or the batters will mix and you won't be able to see the marbled effect."
                },
                {
                    "headline": "Bake the marble cake for 30 minutes.",
                    "description": "Put the cake pans in the preheated oven and bake them until they pull away from the sides of the pan. To test if they're done, insert a toothpick into the center and pull it out. If it comes away clean or with just a crumb, the marble cake is finished. If batter sticks on the toothpick, bake the cake for 3 to 5 more minutes and check it again."
                },
                {
                    "headline": "Cool the cake completely before you frost and serve it.",
                    "description": "Turn off the oven and transfer the cakes to a wire rack to cool for 10 minutes. Carefully flip the cakes out of the pans and leave them to cool completely before you frost them with 3 cups (700 g) of your favorite chocolate buttercream, ganache, or icing. Cover the leftover cake and store it at room temperature for up to 2 or 3 days. You can also refrigerate it for up to 5 days."
                }
            ]
        },
        {
            "name": "Homemade Marble Cake",
            "steps": [
                {
                    "headline": "Preheat the oven to 350 °F (177 °C) and grease 2 round cake pans.",
                    "description": "Use 9 in (23 cm) pans that are at least 2 inches (5.1 cm) high. To prevent the cakes from sticking, spray the inside of the pans with baking spray. If you prefer to make a single-layer sheet cake, grease a 9 in × 13 in (23 cm × 33 cm) cake pan."
                },
                {
                    "headline": "Sift the flour, baking powder, and salt.",
                    "description": "Get out a large mixing bowl and put 2 cups (230 g) of cake flour, 2 teaspoons (8 g) of baking powder, and 1/2 teaspoon (2.5 g) of salt into a sifter. Shake the sifter so the dry ingredients fall into the bowl and put the bowl aside.Tip: To make your own cake flour, sift 1 3/4 cups (219 g) of all-purpose flour with 1/4 cup (27 g) of cornstarch. Cake flour has a lower protein content than all-purpose flour. This will make a lighter textured marble cake."
                },
                {
                    "headline": "Cream the butter and sugars for 4 to 5 minutes.",
                    "description": "Put 1 cup (230 g) of room-temperature unsalted butter into a large mixing bowl and beat it on high speed for 1 minute. Once the butter is smooth, beat in 3/4 cup (150 g) of granulated sugar and 1/2 cup (100 g) of packed light brown sugar. Keep beating on high for 3 to 4 minutes so the mixture becomes light and fluffy. Stop and scrape down the sides of the bowl with a spatula occasionally. If your butter is too cold, it won't combine smoothly with the sugars and you'll see tiny lumps of butter in the mixture."
                },
                {
                    "headline": "Mix in the eggs, yolks, and vanilla on low speed.",
                    "description": "Reduce the mixer speed to low and add 1 whole egg to the creamed butter mixture. Once the egg is incorporated, beat in the remaining 1 whole egg and 4 egg yolks, 1 at a time. Then beat in 1 tablespoon (15 ml) of vanilla extract on medium speed. Using room temperature ingredients will ensure that they combine perfectly in the batter. This will trap air so your cake turns out light and fluffy."
                },
                {
                    "headline": "Mix in the dry ingredients alternating with the buttermilk.",
                    "description": "Turn the mixer back down to low and beat in 1/3 of the dry mixture. Then mix in ⁄3 cup (79 ml) of the buttermilk. Add another 1/3 of the dry mixture followed by the remaining ⁄3 cup (79 ml) of buttermilk. Finish mixing in the rest of the dry ingredients. The batter will be thick, but there shouldn't be large lumps. It's alright if there are a few small lumps, since it's important not to over mix the batter."
                },
                {
                    "headline": "Melt the chocolate and stir in 1 cup (340 g) of the batter.",
                    "description": "Put 4 ounces (113 g) of coarsely chopped bittersweet or semi-sweet chocolate into a microwave-safe bowl. Microwave the chocolate in 20-second increments until it's melted. Then stir in 1 cup (340 g) of the batter and set it aside. This will make the chocolate batter that you'll need to marble the cake."
                },
                {
                    "headline": "Spread some plain batter in the pans and top it with chocolate batter.",
                    "description": "Divide 1/2 of the plain batter between your prepared pans and spread it evenly or pour all of the plain batter into the large pan. Drop large spoonfuls of the chocolate batter onto the plain batter. Then pour the rest of the plain batter over the batter in the pans."
                },
                {
                    "headline": "Use a skewer to swirl the batters.",
                    "description": "Dip a skewer into some of the chocolate batter and drag it through the plain batter in a figure-8 pattern. Do this 2 to 3 more times so there's a marble effect. Ensure that you're not mixing the batters or you won't see a swirl. If you don't have a skewer, use a butter knife."
                },
                {
                    "headline": "Bake the round cakes for 22 to 27 minutes.",
                    "description": "Put the cake pans in the preheated oven and bake the cakes until they begin to pull away from the sides of the pans. Insert a toothpick to see if it comes out without wet crumbs sticking to it. If there's still batter on the toothpick, bake the cakes for a few more minutes and check them again. If you're baking a 9 in × 13 in (23 cm × 33 cm) marble cake, it may take a few more minutes to finish baking. Check the cake once it's baked for 30 minutes."
                },
                {
                    "headline": "Remove and cool the marble cake completely.",
                    "description": "Turn off the oven and take the cakes out. Set them on a wire rack to cool for a few minutes and then turn them out onto the wire rack. Let the cakes cool before you stack and frost them with 3 cups (700 g) of your favorite chocolate frosting. Cover leftover cake and store it at room temperature for up to 2 or 3 days. You can also refrigerate leftover cake for up to 5 days."
                }
            ]
        }
    ],
    "tyn": [
        "Marble Cake from a Mix",
        "Measuring cups and spoons",
        "Mixing bowls",
        "Spoons",
        "2 9 in (23 cm) round cake pans or 1 9 in × 13 in (23 cm × 33 cm) pan",
        "Hand or stand mixer with beater attachment",
        "Skewer",
        "Wire rack",
        "Toothpick",
        "Homemade Marble Cake",
        "Sifter",
        "Microwave-safe bowl",
        "Skewer or butter knife"
    ],
    "text": " Marble Cake from a Mix Preheat the oven to 350 °F (177 °C) and grease 2 round cake pans. Choose 9 in (23 cm) pans that are at least 2 inches (5.1 cm) deep. Spray the inside with baking spray to prevent the marble cakes from sticking. To make a large, single-layer cake, use a 9 in × 13 in (23 cm × 33 cm) cake pan. Put the mix, sugar, salt, eggs, vanilla, fats, milk, and water in a bowl. Open a 15.25-ounce (432 g) box of yellow or white cake mix and put it in a large mixing bowl. Ignore the instructions on the box and instead add 1/2 cup (100 g) of granulated sugar and 1/4 teaspoon (1.5 g) of salt. Add 4 eggs and these liquids:\n2 teaspoons (9.9 ml) of vanilla extract\n\n⁄3 cup (79 ml) of canola oil or vegetable oil\n4 tablespoons (56 g) of melted butter\n\n⁄4 cup (59 ml) of whole milk\n1 cup (240 ml) of water Beat the ingredients in the bowl for 2 minutes. Turn a hand or stand mixer to low and beat until the eggs are combined. Then turn the mixer up to medium speed and beat the batter for 2 minutes. Stop the mixer and scrape down the sides of the bowl with a spatula once or twice. Stir in the flour until it's incorporated. Reduce the mixer speed to low and gradually beat in 2/3 cup (83 g) of all-purpose flour or 3/4 cup (75 g) of cake flour. Beat just until the flour is mixed into the wet batter.Did You Know? While you can use all-purpose or cake flour, the cake flour has a lower protein content. This will make the cake a little lighter and fluffier than a cake that uses all-purpose flour. Mix the cocoa, sour cream, and 1 cup (340 g) of the batter in a another bowl. Put 3 tablespoons (22 g) of unsweetened cocoa powder into a separate mixing bowl and add 2 tablespoons (24 g) of sour cream. Stir or whisk the cocoa until it's incorporated. Then stir in 1 cup (340 g) of the batter from the other mixing bowl. This will make the chocolate batter for the marble cake. Spread the plain batter and spoon the chocolate batter on top. Divide the plain white or yellow cake batter between the prepared cake pans or pour the plain batter into the large cake pan. Then dollop large spoonfuls of the chocolate batter over the plain batter in the pan. Leave about 2 inches (5.1 cm) of space between the blobs of chocolate batter. Use a skewer to swirl the batters. Insert the skewer so it almost reaches the bottom of the pan and then drag it in a figure-8 pattern so it moves through several of the chocolate blobs. Then insert the skewer into another part of the pan and make another figure-8. Do this 1 to 2 more times so each chocolate blob is marbled. It's important to not over-swirl or the batters will mix and you won't be able to see the marbled effect. Bake the marble cake for 30 minutes. Put the cake pans in the preheated oven and bake them until they pull away from the sides of the pan. To test if they're done, insert a toothpick into the center and pull it out. If it comes away clean or with just a crumb, the marble cake is finished. If batter sticks on the toothpick, bake the cake for 3 to 5 more minutes and check it again. Cool the cake completely before you frost and serve it. Turn off the oven and transfer the cakes to a wire rack to cool for 10 minutes. Carefully flip the cakes out of the pans and leave them to cool completely before you frost them with 3 cups (700 g) of your favorite chocolate buttercream, ganache, or icing. Cover the leftover cake and store it at room temperature for up to 2 or 3 days. You can also refrigerate it for up to 5 days. Homemade Marble Cake Preheat the oven to 350 °F (177 °C) and grease 2 round cake pans. Use 9 in (23 cm) pans that are at least 2 inches (5.1 cm) high. To prevent the cakes from sticking, spray the inside of the pans with baking spray. If you prefer to make a single-layer sheet cake, grease a 9 in × 13 in (23 cm × 33 cm) cake pan. Sift the flour, baking powder, and salt. Get out a large mixing bowl and put 2 cups (230 g) of cake flour, 2 teaspoons (8 g) of baking powder, and 1/2 teaspoon (2.5 g) of salt into a sifter. Shake the sifter so the dry ingredients fall into the bowl and put the bowl aside.Tip: To make your own cake flour, sift 1 3/4 cups (219 g) of all-purpose flour with 1/4 cup (27 g) of cornstarch. Cake flour has a lower protein content than all-purpose flour. This will make a lighter textured marble cake. Cream the butter and sugars for 4 to 5 minutes. Put 1 cup (230 g) of room-temperature unsalted butter into a large mixing bowl and beat it on high speed for 1 minute. Once the butter is smooth, beat in 3/4 cup (150 g) of granulated sugar and 1/2 cup (100 g) of packed light brown sugar. Keep beating on high for 3 to 4 minutes so the mixture becomes light and fluffy. Stop and scrape down the sides of the bowl with a spatula occasionally. If your butter is too cold, it won't combine smoothly with the sugars and you'll see tiny lumps of butter in the mixture. Mix in the eggs, yolks, and vanilla on low speed. Reduce the mixer speed to low and add 1 whole egg to the creamed butter mixture. Once the egg is incorporated, beat in the remaining 1 whole egg and 4 egg yolks, 1 at a time. Then beat in 1 tablespoon (15 ml) of vanilla extract on medium speed. Using room temperature ingredients will ensure that they combine perfectly in the batter. This will trap air so your cake turns out light and fluffy. Mix in the dry ingredients alternating with the buttermilk. Turn the mixer back down to low and beat in 1/3 of the dry mixture. Then mix in ⁄3 cup (79 ml) of the buttermilk. Add another 1/3 of the dry mixture followed by the remaining ⁄3 cup (79 ml) of buttermilk. Finish mixing in the rest of the dry ingredients. The batter will be thick, but there shouldn't be large lumps. It's alright if there are a few small lumps, since it's important not to over mix the batter. Melt the chocolate and stir in 1 cup (340 g) of the batter. Put 4 ounces (113 g) of coarsely chopped bittersweet or semi-sweet chocolate into a microwave-safe bowl. Microwave the chocolate in 20-second increments until it's melted. Then stir in 1 cup (340 g) of the batter and set it aside. This will make the chocolate batter that you'll need to marble the cake. Spread some plain batter in the pans and top it with chocolate batter. Divide 1/2 of the plain batter between your prepared pans and spread it evenly or pour all of the plain batter into the large pan. Drop large spoonfuls of the chocolate batter onto the plain batter. Then pour the rest of the plain batter over the batter in the pans. Use a skewer to swirl the batters. Dip a skewer into some of the chocolate batter and drag it through the plain batter in a figure-8 pattern. Do this 2 to 3 more times so there's a marble effect. Ensure that you're not mixing the batters or you won't see a swirl. If you don't have a skewer, use a butter knife. Bake the round cakes for 22 to 27 minutes. Put the cake pans in the preheated oven and bake the cakes until they begin to pull away from the sides of the pans. Insert a toothpick to see if it comes out without wet crumbs sticking to it. If there's still batter on the toothpick, bake the cakes for a few more minutes and check them again. If you're baking a 9 in × 13 in (23 cm × 33 cm) marble cake, it may take a few more minutes to finish baking. Check the cake once it's baked for 30 minutes. Remove and cool the marble cake completely. Turn off the oven and take the cakes out. Set them on a wire rack to cool for a few minutes and then turn them out onto the wire rack. Let the cakes cool before you stack and frost them with 3 cups (700 g) of your favorite chocolate frosting. Cover leftover cake and store it at room temperature for up to 2 or 3 days. You can also refrigerate leftover cake for up to 5 days.",
    "sentences": [
        " Marble Cake from a Mix Preheat the oven to 350 °F (177 °C) and grease 2 round cake pans.",
        "Choose 9 in (23 cm) pans that are at least 2 inches (5.1 cm) deep.",
        "Spray the inside with baking spray to prevent the marble cakes from sticking.",
        "To make a large, single-layer cake, use a 9 in × 13 in (23 cm × 33 cm) cake pan.",
        "Put the mix, sugar, salt, eggs, vanilla, fats, milk, and water in a bowl.",
        "Open a 15.25-ounce (432 g) box of yellow or white cake mix and put it in a large mixing bowl.",
        "Ignore the instructions on the box and instead add 1/2 cup (100 g) of granulated sugar and 1/4 teaspoon (1.5 g) of salt.",
        "Add 4 eggs and these liquids:\n2 teaspoons (9.9 ml) of vanilla extract\n\n⁄3 cup (79 ml) of canola oil or vegetable oil\n4 tablespoons (56 g) of melted butter\n\n⁄4 cup (59 ml) of whole milk\n1 cup (240 ml) of water Beat the ingredients in the bowl for 2 minutes.",
        "Turn a hand or stand mixer to low and beat until the eggs are combined.",
        "Then turn the mixer up to medium speed and beat the batter for 2 minutes.",
        "Stop the mixer and scrape down the sides of the bowl with a spatula once or twice.",
        "Stir in the flour until it's incorporated.",
        "Reduce the mixer speed to low and gradually beat in 2/3 cup (83 g) of all-purpose flour or 3/4 cup (75 g) of cake flour.",
        "Beat just until the flour is mixed into the wet batter.Did You Know?",
        "While you can use all-purpose or cake flour, the cake flour has a lower protein content.",
        "This will make the cake a little lighter and fluffier than a cake that uses all-purpose flour.",
        "Mix the cocoa, sour cream, and 1 cup (340 g) of the batter in a another bowl.",
        "Put 3 tablespoons (22 g) of unsweetened cocoa powder into a separate mixing bowl and add 2 tablespoons (24 g) of sour cream.",
        "Stir or whisk the cocoa until it's incorporated.",
        "Then stir in 1 cup (340 g) of the batter from the other mixing bowl.",
        "This will make the chocolate batter for the marble cake.",
        "Spread the plain batter and spoon the chocolate batter on top.",
        "Divide the plain white or yellow cake batter between the prepared cake pans or pour the plain batter into the large cake pan.",
        "Then dollop large spoonfuls of the chocolate batter over the plain batter in the pan.",
        "Leave about 2 inches (5.1 cm) of space between the blobs of chocolate batter.",
        "Use a skewer to swirl the batters.",
        "Insert the skewer so it almost reaches the bottom of the pan and then drag it in a figure-8 pattern so it moves through several of the chocolate blobs.",
        "Then insert the skewer into another part of the pan and make another figure-8.",
        "Do this 1 to 2 more times so each chocolate blob is marbled.",
        "It's important to not over-swirl or the batters will mix and you won't be able to see the marbled effect.",
        "Bake the marble cake for 30 minutes.",
        "Put the cake pans in the preheated oven and bake them until they pull away from the sides of the pan.",
        "To test if they're done, insert a toothpick into the center and pull it out.",
        "If it comes away clean or with just a crumb, the marble cake is finished.",
        "If batter sticks on the toothpick, bake the cake for 3 to 5 more minutes and check it again.",
        "Cool the cake completely before you frost and serve it.",
        "Turn off the oven and transfer the cakes to a wire rack to cool for 10 minutes.",
        "Carefully flip the cakes out of the pans and leave them to cool completely before you frost them with 3 cups (700 g) of your favorite chocolate buttercream, ganache, or icing.",
        "Cover the leftover cake and store it at room temperature for up to 2 or 3 days.",
        "You can also refrigerate it for up to 5 days.",
        "Homemade Marble Cake Preheat the oven to 350 °F (177 °C) and grease 2 round cake pans.",
        "Use 9 in (23 cm) pans that are at least 2 inches (5.1 cm) high.",
        "To prevent the cakes from sticking, spray the inside of the pans with baking spray.",
        "If you prefer to make a single-layer sheet cake, grease a 9 in × 13 in (23 cm × 33 cm) cake pan.",
        "Sift the flour, baking powder, and salt.",
        "Get out a large mixing bowl and put 2 cups (230 g) of cake flour, 2 teaspoons (8 g) of baking powder, and 1/2 teaspoon (2.5 g) of salt into a sifter.",
        "Shake the sifter so the dry ingredients fall into the bowl and put the bowl aside.Tip: To make your own cake flour, sift 1 3/4 cups (219 g) of all-purpose flour with 1/4 cup (27 g) of cornstarch.",
        "Cake flour has a lower protein content than all-purpose flour.",
        "This will make a lighter textured marble cake.",
        "Cream the butter and sugars for 4 to 5 minutes.",
        "Put 1 cup (230 g) of room-temperature unsalted butter into a large mixing bowl and beat it on high speed for 1 minute.",
        "Once the butter is smooth, beat in 3/4 cup (150 g) of granulated sugar and 1/2 cup (100 g) of packed light brown sugar.",
        "Keep beating on high for 3 to 4 minutes so the mixture becomes light and fluffy.",
        "Stop and scrape down the sides of the bowl with a spatula occasionally.",
        "If your butter is too cold, it won't combine smoothly with the sugars and you'll see tiny lumps of butter in the mixture.",
        "Mix in the eggs, yolks, and vanilla on low speed.",
        "Reduce the mixer speed to low and add 1 whole egg to the creamed butter mixture.",
        "Once the egg is incorporated, beat in the remaining 1 whole egg and 4 egg yolks, 1 at a time.",
        "Then beat in 1 tablespoon (15 ml) of vanilla extract on medium speed.",
        "Using room temperature ingredients will ensure that they combine perfectly in the batter.",
        "This will trap air so your cake turns out light and fluffy.",
        "Mix in the dry ingredients alternating with the buttermilk.",
        "Turn the mixer back down to low and beat in 1/3 of the dry mixture.",
        "Then mix in ⁄3 cup (79 ml) of the buttermilk.",
        "Add another 1/3 of the dry mixture followed by the remaining ⁄3 cup (79 ml) of buttermilk.",
        "Finish mixing in the rest of the dry ingredients.",
        "The batter will be thick, but there shouldn't be large lumps.",
        "It's alright if there are a few small lumps, since it's important not to over mix the batter.",
        "Melt the chocolate and stir in 1 cup (340 g) of the batter.",
        "Put 4 ounces (113 g) of coarsely chopped bittersweet or semi-sweet chocolate into a microwave-safe bowl.",
        "Microwave the chocolate in 20-second increments until it's melted.",
        "Then stir in 1 cup (340 g) of the batter and set it aside.",
        "This will make the chocolate batter that you'll need to marble the cake.",
        "Spread some plain batter in the pans and top it with chocolate batter.",
        "Divide 1/2 of the plain batter between your prepared pans and spread it evenly or pour all of the plain batter into the large pan.",
        "Drop large spoonfuls of the chocolate batter onto the plain batter.",
        "Then pour the rest of the plain batter over the batter in the pans.",
        "Use a skewer to swirl the batters.",
        "Dip a skewer into some of the chocolate batter and drag it through the plain batter in a figure-8 pattern.",
        "Do this 2 to 3 more times so there's a marble effect.",
        "Ensure that you're not mixing the batters or you won't see a swirl.",
        "If you don't have a skewer, use a butter knife.",
        "Bake the round cakes for 22 to 27 minutes.",
        "Put the cake pans in the preheated oven and bake the cakes until they begin to pull away from the sides of the pans.",
        "Insert a toothpick to see if it comes out without wet crumbs sticking to it.",
        "If there's still batter on the toothpick, bake the cakes for a few more minutes and check them again.",
        "If you're baking a 9 in × 13 in (23 cm × 33 cm) marble cake, it may take a few more minutes to finish baking.",
        "Check the cake once it's baked for 30 minutes.",
        "Remove and cool the marble cake completely.",
        "Turn off the oven and take the cakes out.",
        "Set them on a wire rack to cool for a few minutes and then turn them out onto the wire rack.",
        "Let the cakes cool before you stack and frost them with 3 cups (700 g) of your favorite chocolate frosting.",
        "Cover leftover cake and store it at room temperature for up to 2 or 3 days.",
        "You can also refrigerate leftover cake for up to 5 days."
    ]
}