{
    "title": "How to Measure for a Suit",
    "url": "https://www.wikihow.com/Measure-for-a-Suit",
    "category_hierarchy": [
        "Finance and Business",
        "Business"
    ],
    "parts": [
        {
            "name": "Measuring the Jacket",
            "steps": [
                {
                    "headline": "Check your height and weight.",
                    "description": "Use a pencil to mark your height on a wall, then use a tape measure to get an exact measurement. Next, get your current weight using a bathroom scale. While the individual measurements associated with the suit are also important to get the right fit, your height and weight can help you estimate your fit. This is especially important if you're going to have your suit tailored, because height and weight helps tailors determine your “drop” of the suit, which is the difference between the size of the pants and jacket."
                },
                {
                    "headline": "Wear a dress shirt while measuring so your jacket will fit over it.",
                    "description": "Choose the type of shirt that you’d normally wear under a suit. This will help you avoid getting a jacket that’s too snug. For example, you might put on an undershirt and a white dress shirt if that’s what you normally wear."
                },
                {
                    "headline": "Measure shoulder-to-shoulder to get your over-arm measurement.",
                    "description": "The over-arm measurement will help to find the width of the entire jacket, from shoulder-to-shoulder. Start your tape measure at the joint of one shoulder. Then, run it across the top of your shoulders, behind your neck, and to the joint of your other shoulder. When determining measurements, don't pull the tape measure tight. Instead, make sure it fits snugly around your body."
                },
                {
                    "headline": "Raise your arms and measure around the widest part of your chest.",
                    "description": "This measurement is essential to get the right body-fit and a flattering cut for your jacket. To take it, raise both arms and run the tape measure around the fullest part of your chest, underneath both your arms. Go all the way around your body. Then, lower your arms to secure the tape measure and record the measurement. Your nipples are typically where the widest part of your chest is. Don't flex your chest muscles while taking this measurement, as this could make your suit fit too big."
                },
                {
                    "headline": "Measure your arm from your shoulder down to your wrist.",
                    "description": "Place the end of your tape measure at the shoulder seam of your dress shirt. Then, slide the tape measure down your arm toward your wrist. Take the measurement at your wrist to find your proper sleeve length. You may also need to provide your coat in-sleeve measurement for a custom-made suit. This is the measurement of the underside of your arm. To get it, place the end of the tape measure in your armpit, then pull it down to your wrist and record the measurement."
                },
                {
                    "headline": "Get your jacket length by measuring from your neck to your thumb.",
                    "description": "Put your arms down at your sides, with your hands relaxed over your hips. Then, position the tape at the base of your neck and run it down the front of your body. Stop when the tape reaches your thumb and take the measurement. Your jacket will probably end around your upper thigh area, depending on how long your arms are."
                },
                {
                    "headline": "Measure around your neck under your Adam’s apple.",
                    "description": "Wrap your tape measure around the base of your neck, just above your collarbone. The tape should feel snug but not tight. Then, record the measurement. This will help you buy the right size dress shirt for layering under your suit."
                }
            ]
        },
        {
            "name": "Measuring the Pants",
            "steps": [
                {
                    "headline": "Wear your dress shoes when measuring for pants.",
                    "description": "Your shoes change the way you stand and alter your height, so you need to wear them when taking your measurements. Choose the shoes that you would typically wear with your pants so that your pants are the correct length."
                },
                {
                    "headline": "Measure your waist where you typically belt your pants.",
                    "description": "Position the tape measure where you normally wear a belt. Then, wrap the tape measure around your waist. Slide your finger under the tape so that your pants will fit comfortably. Finally, take the measurement."
                },
                {
                    "headline": "Find your outseam by measuring from your waistband to the ground.",
                    "description": "The outseam is the measurement of outside part of the pants leg. To take this measurement, position your tape at the top of your waistband at your side. Then, slide the measuring tape down to the point where your pants hit your shoes. Take the measurement at the spot where you want your pants to meet your shoes. Make sure you’re wearing the shoes you plan to wear with your suit."
                },
                {
                    "headline": "Get your inseam by measuring from your crotch to the bottom of your ankle.",
                    "description": "Position the tape inside your leg as high as it will go. This should be where your leg meets your groin. Then, slide the tape down your leg until it meets the bottom of your ankle. Take your inseam measurement. It's also possible to take this measurement on a pair of pants that you already have that fit you well. Lay the pants out on a flat surface, hip side down. Fold one pant leg out of the way and measure down the entire length of the inseam."
                },
                {
                    "headline": "Find your rise by measuring from the bottom of your crotch to your waist.",
                    "description": "The rise will determine how high your pants come up. Position your tape measure at the lowest point of your crotch, then bring it up to the spot where you typically wear your belt. Make note of the measurement. Choosing the best rise for you will help your body look proportional. Pants that are labeled as “normal rise” will have a rise between 9 to 12 in (23 to 30 cm). They’re a great option if you’re of average height. “Short rise” pants typically have a rise between 7 to 9 in (18 to 23 cm). This rise can look very flattering if you’re shorter than average height. “High rise” pants have a rise that’s over 10 in (25 cm), and they’re a great option if you’re taller than 6 ft (1.8 m) tall."
                }
            ]
        },
        {
            "name": "Getting the Right Fit",
            "steps": [
                {
                    "headline": "Learn how jackets are sized.",
                    "description": "Suits typically have a number that defines their chest measurement and length. This allows you to pick the jack that most closely matches your measurements. The most common jacket sizes for adults include:\n38 jackets are for people with a 40 in. chest, 18 in. shoulder, and 24.5 in. sleeves. 40 jackets are for people with a 42 in. chest, 18.5 in. shoulder, and 25 in. sleeves. 42 jackets are for people with a 44 in. chest, 19 in. shoulder, and 25.5 in. sleeves. 44 jackets are for people with a 46 in. chest, 19 in. shoulder, and 26 in. sleeves."
                },
                {
                    "headline": "Learn how coat length is determined.",
                    "description": "Coat length is based on height, so you should be able to know what size coat you’ll need if you know size of the dress shirts you get and your height. A short is typically made for people under 5’7, with sleeves up to 32 in. A regular is for people between 5’8 and 5’11, with sleeves of 32-33 in. A long is for people between 6’0 and 6’2, with sleeves of 34-36 in. An extra-long is for people taller than 6’2, with sleeves longer than 36 in."
                },
                {
                    "headline": "Make sure the armholes aren’t snug.",
                    "description": "When you try a jacket on, the armholes should be loose enough that you feel comfortable and have a full range of motion. In a new suit, you don't want to risk ripping the interior lining of the jacket because it's too snug. You may be able to get an improperly fitting jacket tailored."
                },
                {
                    "headline": "Confirm that the coat is smooth across your back.",
                    "description": "Coats shouldn't look bunched up across your back shoulders. They should create a smooth surface across your back and shoulders, with clean lines that flatter your build. If you have bunching, you may have a jacket that's too small, poorly stitched, or just the wrong size."
                },
                {
                    "headline": "Make sure the sleeves are the appropriate length.",
                    "description": "Let your arms hang loosely at your sides to check and make sure the sleeves are of the appropriate length. The sleeve hem should hang down your knuckles, and reveal about a ⁄2 inch (1.3 cm) of the shirt cuff when your arms are extended out in front of you."
                },
                {
                    "headline": "Check that the pants are the correct length.",
                    "description": "Trousers should be hemmed evenly with the heel of your shoe, gently breaking on the top of the shoe. They shouldn't drape too much or bunch, and should hang over the shoes gently. If the length is wrong, it’s very easy to get your pants hemmed by a tailor."
                }
            ]
        }
    ],
    "tyn": [
        "Tape measure",
        "A helper"
    ],
    "text": " Measuring the Jacket Check your height and weight. Use a pencil to mark your height on a wall, then use a tape measure to get an exact measurement. Next, get your current weight using a bathroom scale. While the individual measurements associated with the suit are also important to get the right fit, your height and weight can help you estimate your fit. This is especially important if you're going to have your suit tailored, because height and weight helps tailors determine your “drop” of the suit, which is the difference between the size of the pants and jacket. Wear a dress shirt while measuring so your jacket will fit over it. Choose the type of shirt that you’d normally wear under a suit. This will help you avoid getting a jacket that’s too snug. For example, you might put on an undershirt and a white dress shirt if that’s what you normally wear. Measure shoulder-to-shoulder to get your over-arm measurement. The over-arm measurement will help to find the width of the entire jacket, from shoulder-to-shoulder. Start your tape measure at the joint of one shoulder. Then, run it across the top of your shoulders, behind your neck, and to the joint of your other shoulder. When determining measurements, don't pull the tape measure tight. Instead, make sure it fits snugly around your body. Raise your arms and measure around the widest part of your chest. This measurement is essential to get the right body-fit and a flattering cut for your jacket. To take it, raise both arms and run the tape measure around the fullest part of your chest, underneath both your arms. Go all the way around your body. Then, lower your arms to secure the tape measure and record the measurement. Your nipples are typically where the widest part of your chest is. Don't flex your chest muscles while taking this measurement, as this could make your suit fit too big. Measure your arm from your shoulder down to your wrist. Place the end of your tape measure at the shoulder seam of your dress shirt. Then, slide the tape measure down your arm toward your wrist. Take the measurement at your wrist to find your proper sleeve length. You may also need to provide your coat in-sleeve measurement for a custom-made suit. This is the measurement of the underside of your arm. To get it, place the end of the tape measure in your armpit, then pull it down to your wrist and record the measurement. Get your jacket length by measuring from your neck to your thumb. Put your arms down at your sides, with your hands relaxed over your hips. Then, position the tape at the base of your neck and run it down the front of your body. Stop when the tape reaches your thumb and take the measurement. Your jacket will probably end around your upper thigh area, depending on how long your arms are. Measure around your neck under your Adam’s apple. Wrap your tape measure around the base of your neck, just above your collarbone. The tape should feel snug but not tight. Then, record the measurement. This will help you buy the right size dress shirt for layering under your suit. Measuring the Pants Wear your dress shoes when measuring for pants. Your shoes change the way you stand and alter your height, so you need to wear them when taking your measurements. Choose the shoes that you would typically wear with your pants so that your pants are the correct length. Measure your waist where you typically belt your pants. Position the tape measure where you normally wear a belt. Then, wrap the tape measure around your waist. Slide your finger under the tape so that your pants will fit comfortably. Finally, take the measurement. Find your outseam by measuring from your waistband to the ground. The outseam is the measurement of outside part of the pants leg. To take this measurement, position your tape at the top of your waistband at your side. Then, slide the measuring tape down to the point where your pants hit your shoes. Take the measurement at the spot where you want your pants to meet your shoes. Make sure you’re wearing the shoes you plan to wear with your suit. Get your inseam by measuring from your crotch to the bottom of your ankle. Position the tape inside your leg as high as it will go. This should be where your leg meets your groin. Then, slide the tape down your leg until it meets the bottom of your ankle. Take your inseam measurement. It's also possible to take this measurement on a pair of pants that you already have that fit you well. Lay the pants out on a flat surface, hip side down. Fold one pant leg out of the way and measure down the entire length of the inseam. Find your rise by measuring from the bottom of your crotch to your waist. The rise will determine how high your pants come up. Position your tape measure at the lowest point of your crotch, then bring it up to the spot where you typically wear your belt. Make note of the measurement. Choosing the best rise for you will help your body look proportional. Pants that are labeled as “normal rise” will have a rise between 9 to 12 in (23 to 30 cm). They’re a great option if you’re of average height. “Short rise” pants typically have a rise between 7 to 9 in (18 to 23 cm). This rise can look very flattering if you’re shorter than average height. “High rise” pants have a rise that’s over 10 in (25 cm), and they’re a great option if you’re taller than 6 ft (1.8 m) tall. Getting the Right Fit Learn how jackets are sized. Suits typically have a number that defines their chest measurement and length. This allows you to pick the jack that most closely matches your measurements. The most common jacket sizes for adults include:\n38 jackets are for people with a 40 in. chest, 18 in. shoulder, and 24.5 in. sleeves. 40 jackets are for people with a 42 in. chest, 18.5 in. shoulder, and 25 in. sleeves. 42 jackets are for people with a 44 in. chest, 19 in. shoulder, and 25.5 in. sleeves. 44 jackets are for people with a 46 in. chest, 19 in. shoulder, and 26 in. sleeves. Learn how coat length is determined. Coat length is based on height, so you should be able to know what size coat you’ll need if you know size of the dress shirts you get and your height. A short is typically made for people under 5’7, with sleeves up to 32 in. A regular is for people between 5’8 and 5’11, with sleeves of 32-33 in. A long is for people between 6’0 and 6’2, with sleeves of 34-36 in. An extra-long is for people taller than 6’2, with sleeves longer than 36 in. Make sure the armholes aren’t snug. When you try a jacket on, the armholes should be loose enough that you feel comfortable and have a full range of motion. In a new suit, you don't want to risk ripping the interior lining of the jacket because it's too snug. You may be able to get an improperly fitting jacket tailored. Confirm that the coat is smooth across your back. Coats shouldn't look bunched up across your back shoulders. They should create a smooth surface across your back and shoulders, with clean lines that flatter your build. If you have bunching, you may have a jacket that's too small, poorly stitched, or just the wrong size. Make sure the sleeves are the appropriate length. Let your arms hang loosely at your sides to check and make sure the sleeves are of the appropriate length. The sleeve hem should hang down your knuckles, and reveal about a ⁄2 inch (1.3 cm) of the shirt cuff when your arms are extended out in front of you. Check that the pants are the correct length. Trousers should be hemmed evenly with the heel of your shoe, gently breaking on the top of the shoe. They shouldn't drape too much or bunch, and should hang over the shoes gently. If the length is wrong, it’s very easy to get your pants hemmed by a tailor.",
    "sentences": [
        " Measuring the Jacket Check your height and weight.",
        "Use a pencil to mark your height on a wall, then use a tape measure to get an exact measurement.",
        "Next, get your current weight using a bathroom scale.",
        "While the individual measurements associated with the suit are also important to get the right fit, your height and weight can help you estimate your fit.",
        "This is especially important if you're going to have your suit tailored, because height and weight helps tailors determine your “drop” of the suit, which is the difference between the size of the pants and jacket.",
        "Wear a dress shirt while measuring so your jacket will fit over it.",
        "Choose the type of shirt that you’d normally wear under a suit.",
        "This will help you avoid getting a jacket that’s too snug.",
        "For example, you might put on an undershirt and a white dress shirt if that’s what you normally wear.",
        "Measure shoulder-to-shoulder to get your over-arm measurement.",
        "The over-arm measurement will help to find the width of the entire jacket, from shoulder-to-shoulder.",
        "Start your tape measure at the joint of one shoulder.",
        "Then, run it across the top of your shoulders, behind your neck, and to the joint of your other shoulder.",
        "When determining measurements, don't pull the tape measure tight.",
        "Instead, make sure it fits snugly around your body.",
        "Raise your arms and measure around the widest part of your chest.",
        "This measurement is essential to get the right body-fit and a flattering cut for your jacket.",
        "To take it, raise both arms and run the tape measure around the fullest part of your chest, underneath both your arms.",
        "Go all the way around your body.",
        "Then, lower your arms to secure the tape measure and record the measurement.",
        "Your nipples are typically where the widest part of your chest is.",
        "Don't flex your chest muscles while taking this measurement, as this could make your suit fit too big.",
        "Measure your arm from your shoulder down to your wrist.",
        "Place the end of your tape measure at the shoulder seam of your dress shirt.",
        "Then, slide the tape measure down your arm toward your wrist.",
        "Take the measurement at your wrist to find your proper sleeve length.",
        "You may also need to provide your coat in-sleeve measurement for a custom-made suit.",
        "This is the measurement of the underside of your arm.",
        "To get it, place the end of the tape measure in your armpit, then pull it down to your wrist and record the measurement.",
        "Get your jacket length by measuring from your neck to your thumb.",
        "Put your arms down at your sides, with your hands relaxed over your hips.",
        "Then, position the tape at the base of your neck and run it down the front of your body.",
        "Stop when the tape reaches your thumb and take the measurement.",
        "Your jacket will probably end around your upper thigh area, depending on how long your arms are.",
        "Measure around your neck under your Adam’s apple.",
        "Wrap your tape measure around the base of your neck, just above your collarbone.",
        "The tape should feel snug but not tight.",
        "Then, record the measurement.",
        "This will help you buy the right size dress shirt for layering under your suit.",
        "Measuring the Pants Wear your dress shoes when measuring for pants.",
        "Your shoes change the way you stand and alter your height, so you need to wear them when taking your measurements.",
        "Choose the shoes that you would typically wear with your pants so that your pants are the correct length.",
        "Measure your waist where you typically belt your pants.",
        "Position the tape measure where you normally wear a belt.",
        "Then, wrap the tape measure around your waist.",
        "Slide your finger under the tape so that your pants will fit comfortably.",
        "Finally, take the measurement.",
        "Find your outseam by measuring from your waistband to the ground.",
        "The outseam is the measurement of outside part of the pants leg.",
        "To take this measurement, position your tape at the top of your waistband at your side.",
        "Then, slide the measuring tape down to the point where your pants hit your shoes.",
        "Take the measurement at the spot where you want your pants to meet your shoes.",
        "Make sure you’re wearing the shoes you plan to wear with your suit.",
        "Get your inseam by measuring from your crotch to the bottom of your ankle.",
        "Position the tape inside your leg as high as it will go.",
        "This should be where your leg meets your groin.",
        "Then, slide the tape down your leg until it meets the bottom of your ankle.",
        "Take your inseam measurement.",
        "It's also possible to take this measurement on a pair of pants that you already have that fit you well.",
        "Lay the pants out on a flat surface, hip side down.",
        "Fold one pant leg out of the way and measure down the entire length of the inseam.",
        "Find your rise by measuring from the bottom of your crotch to your waist.",
        "The rise will determine how high your pants come up.",
        "Position your tape measure at the lowest point of your crotch, then bring it up to the spot where you typically wear your belt.",
        "Make note of the measurement.",
        "Choosing the best rise for you will help your body look proportional.",
        "Pants that are labeled as “normal rise” will have a rise between 9 to 12 in (23 to 30 cm).",
        "They’re a great option if you’re of average height.",
        "“Short rise” pants typically have a rise between 7 to 9 in (18 to 23 cm).",
        "This rise can look very flattering if you’re shorter than average height.",
        "“High rise” pants have a rise that’s over 10 in (25 cm), and they’re a great option if you’re taller than 6 ft (1.8 m) tall.",
        "Getting the Right Fit Learn how jackets are sized.",
        "Suits typically have a number that defines their chest measurement and length.",
        "This allows you to pick the jack that most closely matches your measurements.",
        "The most common jacket sizes for adults include:\n38 jackets are for people with a 40 in.",
        "chest, 18 in.",
        "shoulder, and 24.5 in.",
        "sleeves.",
        "40 jackets are for people with a 42 in.",
        "chest, 18.5 in.",
        "shoulder, and 25 in.",
        "sleeves.",
        "42 jackets are for people with a 44 in.",
        "chest, 19 in.",
        "shoulder, and 25.5 in.",
        "sleeves.",
        "44 jackets are for people with a 46 in.",
        "chest, 19 in.",
        "shoulder, and 26 in.",
        "sleeves.",
        "Learn how coat length is determined.",
        "Coat length is based on height, so you should be able to know what size coat you’ll need if you know size of the dress shirts you get and your height.",
        "A short is typically made for people under 5’7, with sleeves up to 32 in.",
        "A regular is for people between 5’8 and 5’11, with sleeves of 32-33 in.",
        "A long is for people between 6’0 and 6’2, with sleeves of 34-36 in.",
        "An extra-long is for people taller than 6’2, with sleeves longer than 36 in.",
        "Make sure the armholes aren’t snug.",
        "When you try a jacket on, the armholes should be loose enough that you feel comfortable and have a full range of motion.",
        "In a new suit, you don't want to risk ripping the interior lining of the jacket because it's too snug.",
        "You may be able to get an improperly fitting jacket tailored.",
        "Confirm that the coat is smooth across your back.",
        "Coats shouldn't look bunched up across your back shoulders.",
        "They should create a smooth surface across your back and shoulders, with clean lines that flatter your build.",
        "If you have bunching, you may have a jacket that's too small, poorly stitched, or just the wrong size.",
        "Make sure the sleeves are the appropriate length.",
        "Let your arms hang loosely at your sides to check and make sure the sleeves are of the appropriate length.",
        "The sleeve hem should hang down your knuckles, and reveal about a ⁄2 inch (1.3 cm) of the shirt cuff when your arms are extended out in front of you.",
        "Check that the pants are the correct length.",
        "Trousers should be hemmed evenly with the heel of your shoe, gently breaking on the top of the shoe.",
        "They shouldn't drape too much or bunch, and should hang over the shoes gently.",
        "If the length is wrong, it’s very easy to get your pants hemmed by a tailor."
    ]
}