{
    "title": "How to Properly Open a Bottle of Sparkling Wine",
    "url": "https://www.wikihow.com/Properly-Open-a-Bottle-of-Sparkling-Wine",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks",
        "Wine"
    ],
    "steps": [
        {
            "headline": "Chill the bottle well prior to opening.",
            "description": "A bottle that is not properly chilled will push the cork out on its own and will foam up and out of the bottle aggressively, making a mess and wasting wine."
        },
        {
            "headline": "Locate a dish, bar, or serving towel.",
            "description": "Use it to dry off the bottle, if wet from being chilled. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristopher Lucchese\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Sommelier\t\t\t\t\t\t\t\tChristopher Lucchese is a Certified Sommelier affiliated with Home Somm, a Los Angeles, California-based business that does private wine tastings, education and paired wine dinners. Christopher was also a Sommelier for Michael Mina's Bourbon Steak, a Michelin-rated restaurant for three years. He is a Level 4 Diploma Student with the WSET (Wine & Spirit Education Trust). He is also a Certified Sommelier by the Court of Master Sommeliers and has trained with the Wine Scholar Guild and The Culinary Institute of America. He took two semesters at UC Davis for winemaking, viticulture and enology. Christopher Lucchese\t\t\tCertified Sommelier\t\t\t\tOur Expert Agrees: Chilled bottles can get very slippery, especially if they were on ice. The last thing you want to happen is for the wine bottle to fall out of your hands. Make sure you always have a dry serviette or towel with you."
        },
        {
            "headline": "Grasp the neck of the bottle with four fingers of your left hand (if right-handed) and place your thumb over the top of the basket.",
            "description": "Keep the bottle pointed away from you and others. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristopher Lucchese\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Sommelier\t\t\t\t\t\t\t\tChristopher Lucchese is a Certified Sommelier affiliated with Home Somm, a Los Angeles, California-based business that does private wine tastings, education and paired wine dinners. Christopher was also a Sommelier for Michael Mina's Bourbon Steak, a Michelin-rated restaurant for three years. He is a Level 4 Diploma Student with the WSET (Wine & Spirit Education Trust). He is also a Certified Sommelier by the Court of Master Sommeliers and has trained with the Wine Scholar Guild and The Culinary Institute of America. He took two semesters at UC Davis for winemaking, viticulture and enology. Christopher Lucchese\t\t\tCertified Sommelier\t\t\t\tKeep your thumb on top of the wire cage. With your other hand, undo the cage and with your index finger and thumb, grab the cork and slowly release it from the bottle. Once you start releasing the wire cage and removing the cork, the cork wants to come out fast because of the pressure inside of the bottle."
        },
        {
            "headline": "Twist the retaining wire on the wire cage six half-turns counter-clockwise.",
            "description": "The cork may be pushed out by the pressure any time after the basket is loosened, so apply firm pressure with your thumb on the top of the basket. If your wine was adequately chilled, the cork will rarely if ever get pushed out on its own."
        },
        {
            "headline": "Either leaving the wine cage on the cork or removing it, put your thumb on top of the cork and grasp it with the rest of your hand.",
            "description": "While holding the cork steady, firmly twist the bottle with your right hand. It is most comfortable to do this with the bottle held at a 45 degree angle and balanced on your side or hip."
        },
        {
            "headline": "If you do not feel the cork loosening, pull with increasing pressure on the cork with your left hand while still rotating the bottle with your right hand.",
            "description": ""
        },
        {
            "headline": "When the cork starts to come out, slow its exit with your left thumb, allowing it to barely pop out.",
            "description": ""
        },
        {
            "headline": "The goal of this operation is to barely make a sound when the cork comes out.",
            "description": ""
        },
        {
            "headline": "Pour the wine into clean Champagne flutes.",
            "description": ""
        }
    ],
    "tyn": [
        "Chilled champagne",
        "Kitchen towel",
        "Champagne glasses"
    ],
    "text": " Chill the bottle well prior to opening. A bottle that is not properly chilled will push the cork out on its own and will foam up and out of the bottle aggressively, making a mess and wasting wine. Locate a dish, bar, or serving towel. Use it to dry off the bottle, if wet from being chilled. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristopher Lucchese\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Sommelier\t\t\t\t\t\t\t\tChristopher Lucchese is a Certified Sommelier affiliated with Home Somm, a Los Angeles, California-based business that does private wine tastings, education and paired wine dinners. Christopher was also a Sommelier for Michael Mina's Bourbon Steak, a Michelin-rated restaurant for three years. He is a Level 4 Diploma Student with the WSET (Wine & Spirit Education Trust). He is also a Certified Sommelier by the Court of Master Sommeliers and has trained with the Wine Scholar Guild and The Culinary Institute of America. He took two semesters at UC Davis for winemaking, viticulture and enology. Christopher Lucchese\t\t\tCertified Sommelier\t\t\t\tOur Expert Agrees: Chilled bottles can get very slippery, especially if they were on ice. The last thing you want to happen is for the wine bottle to fall out of your hands. Make sure you always have a dry serviette or towel with you. Grasp the neck of the bottle with four fingers of your left hand (if right-handed) and place your thumb over the top of the basket. Keep the bottle pointed away from you and others. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristopher Lucchese\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Sommelier\t\t\t\t\t\t\t\tChristopher Lucchese is a Certified Sommelier affiliated with Home Somm, a Los Angeles, California-based business that does private wine tastings, education and paired wine dinners. Christopher was also a Sommelier for Michael Mina's Bourbon Steak, a Michelin-rated restaurant for three years. He is a Level 4 Diploma Student with the WSET (Wine & Spirit Education Trust). He is also a Certified Sommelier by the Court of Master Sommeliers and has trained with the Wine Scholar Guild and The Culinary Institute of America. He took two semesters at UC Davis for winemaking, viticulture and enology. Christopher Lucchese\t\t\tCertified Sommelier\t\t\t\tKeep your thumb on top of the wire cage. With your other hand, undo the cage and with your index finger and thumb, grab the cork and slowly release it from the bottle. Once you start releasing the wire cage and removing the cork, the cork wants to come out fast because of the pressure inside of the bottle. Twist the retaining wire on the wire cage six half-turns counter-clockwise. The cork may be pushed out by the pressure any time after the basket is loosened, so apply firm pressure with your thumb on the top of the basket. If your wine was adequately chilled, the cork will rarely if ever get pushed out on its own. Either leaving the wine cage on the cork or removing it, put your thumb on top of the cork and grasp it with the rest of your hand. While holding the cork steady, firmly twist the bottle with your right hand. It is most comfortable to do this with the bottle held at a 45 degree angle and balanced on your side or hip. If you do not feel the cork loosening, pull with increasing pressure on the cork with your left hand while still rotating the bottle with your right hand.  When the cork starts to come out, slow its exit with your left thumb, allowing it to barely pop out.  The goal of this operation is to barely make a sound when the cork comes out.  Pour the wine into clean Champagne flutes. ",
    "sentences": [
        " Chill the bottle well prior to opening.",
        "A bottle that is not properly chilled will push the cork out on its own and will foam up and out of the bottle aggressively, making a mess and wasting wine.",
        "Locate a dish, bar, or serving towel.",
        "Use it to dry off the bottle, if wet from being chilled.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristopher Lucchese\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Sommelier\t\t\t\t\t\t\t\tChristopher Lucchese is a Certified Sommelier affiliated with Home Somm, a Los Angeles, California-based business that does private wine tastings, education and paired wine dinners.",
        "Christopher was also a Sommelier for Michael Mina's Bourbon Steak, a Michelin-rated restaurant for three years.",
        "He is a Level 4 Diploma Student with the WSET (Wine & Spirit Education Trust).",
        "He is also a Certified Sommelier by the Court of Master Sommeliers and has trained with the Wine Scholar Guild and The Culinary Institute of America.",
        "He took two semesters at UC Davis for winemaking, viticulture and enology.",
        "Christopher Lucchese\t\t\tCertified Sommelier\t\t\t\tOur Expert Agrees: Chilled bottles can get very slippery, especially if they were on ice.",
        "The last thing you want to happen is for the wine bottle to fall out of your hands.",
        "Make sure you always have a dry serviette or towel with you.",
        "Grasp the neck of the bottle with four fingers of your left hand (if right-handed) and place your thumb over the top of the basket.",
        "Keep the bottle pointed away from you and others.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristopher Lucchese\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Sommelier\t\t\t\t\t\t\t\tChristopher Lucchese is a Certified Sommelier affiliated with Home Somm, a Los Angeles, California-based business that does private wine tastings, education and paired wine dinners.",
        "Christopher was also a Sommelier for Michael Mina's Bourbon Steak, a Michelin-rated restaurant for three years.",
        "He is a Level 4 Diploma Student with the WSET (Wine & Spirit Education Trust).",
        "He is also a Certified Sommelier by the Court of Master Sommeliers and has trained with the Wine Scholar Guild and The Culinary Institute of America.",
        "He took two semesters at UC Davis for winemaking, viticulture and enology.",
        "Christopher Lucchese\t\t\tCertified Sommelier\t\t\t\tKeep your thumb on top of the wire cage.",
        "With your other hand, undo the cage and with your index finger and thumb, grab the cork and slowly release it from the bottle.",
        "Once you start releasing the wire cage and removing the cork, the cork wants to come out fast because of the pressure inside of the bottle.",
        "Twist the retaining wire on the wire cage six half-turns counter-clockwise.",
        "The cork may be pushed out by the pressure any time after the basket is loosened, so apply firm pressure with your thumb on the top of the basket.",
        "If your wine was adequately chilled, the cork will rarely if ever get pushed out on its own.",
        "Either leaving the wine cage on the cork or removing it, put your thumb on top of the cork and grasp it with the rest of your hand.",
        "While holding the cork steady, firmly twist the bottle with your right hand.",
        "It is most comfortable to do this with the bottle held at a 45 degree angle and balanced on your side or hip.",
        "If you do not feel the cork loosening, pull with increasing pressure on the cork with your left hand while still rotating the bottle with your right hand.",
        "When the cork starts to come out, slow its exit with your left thumb, allowing it to barely pop out.",
        "The goal of this operation is to barely make a sound when the cork comes out.",
        "Pour the wine into clean Champagne flutes."
    ]
}