{
    "title": "How to Fillet a Mackerel",
    "url": "https://www.wikihow.com/Fillet-a-Mackerel",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood"
    ],
    "steps": [
        {
            "headline": "Place the fish onto a cutting board.",
            "description": ""
        },
        {
            "headline": "Fold down the pectoral fin (on the side of body) against the head.",
            "description": ""
        },
        {
            "headline": "Put the blade of your knife behind the folded fin, holding the knife at a slight angle.",
            "description": ""
        },
        {
            "headline": "Sever the head and fins from the body in one slice of the knife.",
            "description": "When you are cutting a mackerel, do not press down with the hand holding the fish. Instead gently hold it in place."
        },
        {
            "headline": "Insert the knife tip into the stomach cavity with one hand and gently pull the knife down, stopping at the beginning of the vent (reproductive organs).",
            "description": "Ensure that you are using just the tip of your knife, since pressing too far inside the stomach cavity could cause damage to the final presentation."
        },
        {
            "headline": "Lift the severed flap of skin to reveal the body cavity.",
            "description": ""
        },
        {
            "headline": "Place your knife behind the gut and, using your hand, push the contents onto the knife and discard.",
            "description": ""
        },
        {
            "headline": "Turn the fish around so the tail is facing you.",
            "description": ""
        },
        {
            "headline": "Place the middle of your knife blade against the top of the mackerel, slightly above the center bone.",
            "description": ""
        },
        {
            "headline": "Hold the top of the fish with the palm of your hand, directly above the inserted blade.",
            "description": ""
        },
        {
            "headline": "Pull the blade in a continuous line through the length of the fish and at the depth of the ribcage, imagining the bone running through the fish.",
            "description": "Stop cutting three quarters of the way down the fish."
        },
        {
            "headline": "Push the knife tip forward into the cut cavity, taking care to avoid your fingers.",
            "description": "Your knife should now be seen on both sides of the fish."
        },
        {
            "headline": "Make sure the blade is flat against the bone.",
            "description": ""
        },
        {
            "headline": "Pull the blade down the remaining length of the fish, using controlled motion until you have finished cutting through the tail.",
            "description": ""
        },
        {
            "headline": "Put the knife blade atop the exposed mackerel bone.",
            "description": "Pull 2 inches (5.08 cm) of the knife, slanted toward the stomach cavity, toward the tail. Follow the ribcage, but do not cut the bone. Your first mackerel fillet will now be free from the bone."
        },
        {
            "headline": "Flip the fish so that the tail is in the opposite direction.",
            "description": ""
        },
        {
            "headline": "Place the blade against the front opening of the fish, right above the bone.",
            "description": ""
        },
        {
            "headline": "Position the flat of your hand atop the fish.",
            "description": ""
        },
        {
            "headline": "Draw your knife with the handle in front of the blade along the bone length using a slight downward pressure, while still keeping the blade above the bone.",
            "description": ""
        },
        {
            "headline": "Observe that the fillet has been released.",
            "description": ""
        }
    ],
    "tyn": [
        "Mackerel fish",
        "1 boning knife",
        "1 cutting board"
    ],
    "text": " Place the fish onto a cutting board.  Fold down the pectoral fin (on the side of body) against the head.  Put the blade of your knife behind the folded fin, holding the knife at a slight angle.  Sever the head and fins from the body in one slice of the knife. When you are cutting a mackerel, do not press down with the hand holding the fish. Instead gently hold it in place. Insert the knife tip into the stomach cavity with one hand and gently pull the knife down, stopping at the beginning of the vent (reproductive organs). Ensure that you are using just the tip of your knife, since pressing too far inside the stomach cavity could cause damage to the final presentation. Lift the severed flap of skin to reveal the body cavity.  Place your knife behind the gut and, using your hand, push the contents onto the knife and discard.  Turn the fish around so the tail is facing you.  Place the middle of your knife blade against the top of the mackerel, slightly above the center bone.  Hold the top of the fish with the palm of your hand, directly above the inserted blade.  Pull the blade in a continuous line through the length of the fish and at the depth of the ribcage, imagining the bone running through the fish. Stop cutting three quarters of the way down the fish. Push the knife tip forward into the cut cavity, taking care to avoid your fingers. Your knife should now be seen on both sides of the fish. Make sure the blade is flat against the bone.  Pull the blade down the remaining length of the fish, using controlled motion until you have finished cutting through the tail.  Put the knife blade atop the exposed mackerel bone. Pull 2 inches (5.08 cm) of the knife, slanted toward the stomach cavity, toward the tail. Follow the ribcage, but do not cut the bone. Your first mackerel fillet will now be free from the bone. Flip the fish so that the tail is in the opposite direction.  Place the blade against the front opening of the fish, right above the bone.  Position the flat of your hand atop the fish.  Draw your knife with the handle in front of the blade along the bone length using a slight downward pressure, while still keeping the blade above the bone.  Observe that the fillet has been released. ",
    "sentences": [
        " Place the fish onto a cutting board.",
        "Fold down the pectoral fin (on the side of body) against the head.",
        "Put the blade of your knife behind the folded fin, holding the knife at a slight angle.",
        "Sever the head and fins from the body in one slice of the knife.",
        "When you are cutting a mackerel, do not press down with the hand holding the fish.",
        "Instead gently hold it in place.",
        "Insert the knife tip into the stomach cavity with one hand and gently pull the knife down, stopping at the beginning of the vent (reproductive organs).",
        "Ensure that you are using just the tip of your knife, since pressing too far inside the stomach cavity could cause damage to the final presentation.",
        "Lift the severed flap of skin to reveal the body cavity.",
        "Place your knife behind the gut and, using your hand, push the contents onto the knife and discard.",
        "Turn the fish around so the tail is facing you.",
        "Place the middle of your knife blade against the top of the mackerel, slightly above the center bone.",
        "Hold the top of the fish with the palm of your hand, directly above the inserted blade.",
        "Pull the blade in a continuous line through the length of the fish and at the depth of the ribcage, imagining the bone running through the fish.",
        "Stop cutting three quarters of the way down the fish.",
        "Push the knife tip forward into the cut cavity, taking care to avoid your fingers.",
        "Your knife should now be seen on both sides of the fish.",
        "Make sure the blade is flat against the bone.",
        "Pull the blade down the remaining length of the fish, using controlled motion until you have finished cutting through the tail.",
        "Put the knife blade atop the exposed mackerel bone.",
        "Pull 2 inches (5.08 cm) of the knife, slanted toward the stomach cavity, toward the tail.",
        "Follow the ribcage, but do not cut the bone.",
        "Your first mackerel fillet will now be free from the bone.",
        "Flip the fish so that the tail is in the opposite direction.",
        "Place the blade against the front opening of the fish, right above the bone.",
        "Position the flat of your hand atop the fish.",
        "Draw your knife with the handle in front of the blade along the bone length using a slight downward pressure, while still keeping the blade above the bone.",
        "Observe that the fillet has been released."
    ]
}