{
    "title": "How to Add a File to Sharepoint",
    "url": "https://www.wikihow.com/Add-a-File-to-Sharepoint",
    "category_hierarchy": [
        "Computers and Electronics",
        "Internet",
        "Downloading",
        "File Sharing"
    ],
    "methods": [
        {
            "name": "Uploading Documents",
            "steps": [
                {
                    "headline": "Open the \"Documents\" link and then \"Shared Documents.\"",
                    "description": ""
                },
                {
                    "headline": "Click on \"Upload Document.\"",
                    "description": ""
                },
                {
                    "headline": "Click \"Choose File.\"",
                    "description": ""
                },
                {
                    "headline": "Search for your file.",
                    "description": "Note that the file will need to be stored somewhere on the computer you are working on in order to upload the file. You cannot directly upload from email or the web."
                },
                {
                    "headline": "Select the file you wish to upload.",
                    "description": "If you wish to write over an already loaded document make sure the \"Overwrite if Document Already Exist\" box is checked."
                },
                {
                    "headline": "Click \"Save and Close.\"",
                    "description": "You will be taken back to the Shared Documents page, where your document will now be available."
                }
            ]
        },
        {
            "name": "Create a New Document",
            "steps": [
                {
                    "headline": "Click \"New Document.\"",
                    "description": "Note that a program compatible with SharePoint Team Services is required to use this document creating function."
                },
                {
                    "headline": "Create the document.",
                    "description": "You can create several document types including Word, Excel, html and PowerPoint documents."
                },
                {
                    "headline": "Use the \"File\" menu to click \"Save.\"",
                    "description": ""
                },
                {
                    "headline": "Type the name of the new file in the \"File Name\" box.",
                    "description": "Use \"Save As\" to select a specific document format. The new document will be created and added to your library."
                }
            ]
        }
    ],
    "tyn": [
        "Computer",
        "Internet access",
        "SharePoint access"
    ],
    "text": " Uploading Documents Open the \"Documents\" link and then \"Shared Documents.\"  Click on \"Upload Document.\"  Click \"Choose File.\"  Search for your file. Note that the file will need to be stored somewhere on the computer you are working on in order to upload the file. You cannot directly upload from email or the web. Select the file you wish to upload. If you wish to write over an already loaded document make sure the \"Overwrite if Document Already Exist\" box is checked. Click \"Save and Close.\" You will be taken back to the Shared Documents page, where your document will now be available. Create a New Document Click \"New Document.\" Note that a program compatible with SharePoint Team Services is required to use this document creating function. Create the document. You can create several document types including Word, Excel, html and PowerPoint documents. Use the \"File\" menu to click \"Save.\"  Type the name of the new file in the \"File Name\" box. Use \"Save As\" to select a specific document format. The new document will be created and added to your library.",
    "sentences": [
        " Uploading Documents Open the \"Documents\" link and then \"Shared Documents.\"",
        "Click on \"Upload Document.\"",
        "Click \"Choose File.\"",
        "Search for your file.",
        "Note that the file will need to be stored somewhere on the computer you are working on in order to upload the file.",
        "You cannot directly upload from email or the web.",
        "Select the file you wish to upload.",
        "If you wish to write over an already loaded document make sure the \"Overwrite if Document Already Exist\" box is checked.",
        "Click \"Save and Close.\"",
        "You will be taken back to the Shared Documents page, where your document will now be available.",
        "Create a New Document Click \"New Document.\"",
        "Note that a program compatible with SharePoint Team Services is required to use this document creating function.",
        "Create the document.",
        "You can create several document types including Word, Excel, html and PowerPoint documents.",
        "Use the \"File\" menu to click \"Save.\"",
        "Type the name of the new file in the \"File Name\" box.",
        "Use \"Save As\" to select a specific document format.",
        "The new document will be created and added to your library."
    ]
}