{
    "title": "How to Build a Rabbit Hutch",
    "url": "https://www.wikihow.com/Build-a-Rabbit-Hutch",
    "category_hierarchy": [
        "Pets and Animals",
        "Rabbits",
        "Rabbit Accessories",
        "Housing Rabbits"
    ],
    "parts": [
        {
            "name": "Prepping Your Supplies",
            "steps": [
                {
                    "headline": "Plan out the design.",
                    "description": "Most hutches are made out of a wood frame with wire windows and doors. When thinking about the size of your hutch, consider how many rabbits will be staying in it. They’ll need enough room to move around, roughly 4 times the body size per rabbit. A minimum height of 16 inches (41 cm) is also a good idea. For example, if your rabbit is 5 inches (13 cm) wide and 10 inches (25 cm) long, then it needs 4.2 feet (1.3 m) square footage of space. If you will be housing multiple rabbits in a single hutch, consider whether or not you’ll want to add in dividers. This can be useful when you want to separate individual animals. Try to keep your hutch less than 30 inches (76 cm) deep. If you go deeper than this, it can be difficult to reach inside and get out your rabbits without a struggle."
                },
                {
                    "headline": "Get sturdy wood for the frame and supports.",
                    "description": "Use 2 by 4 inches (5.1 by 10.2 cm) wood pieces for the frame and 4 by 4 inches (10 by 10 cm) wood pieces for the posts. Look for wood that is straight, not warped. Do not choose pieces with large knots or signs of splitting at the edges. The amount of wood pieces that you’ll need will depend on the size of your hutch. Untreated pine wood is a good choice for the frame and supports. It holds up well under varying weather conditions and is nontoxic to rabbits if consumed. For example, if you are building a hutch that will be 40” X 28” X 20”, then you’ll need 4 40 inches (100 cm) length pieces, 4 28 inches (71 cm) width pieces, and 4 20 inches (51 cm) height pieces to construct the frame. If you want to attach a wooden door to your hutch, then you’ll need to get wood to construct a door frame and the door itself. You can generally go with a smaller size wood, such as a 1 by 1 inch (2.5 by 2.5 cm) or even 1 by ⁄2 inch (2.5 by 1.3 cm). Give some thought to how high off the ground you’ll want your hutch to be. If you want your hutch to sit 4 feet (1.2 m) off the ground, then you’ll need 4 4 feet (1.2 m) posts as supports."
                },
                {
                    "headline": "Choose plywood for the floor and roof.",
                    "description": "You’ll need 1 roof piece of wood and 1 flooring piece of wood that match the length and width dimensions of your hutch. Plywood comes in large sheets, so it usually a good idea to buy 1-2 sheets at the start of your project. You can then cut out the pieces that you need and use the remaining wood for other projects. Look for plywood that is a golden or light reddish color. It should be free of large knots or signs that the wood if fraying or flaking up. For example, if you are building a hutch that will be 40” X 28” X 20”, then you’ll need to cut out 2 plywood pieces (1 for the roof, and 1 for the floor) that are 40 by 28 inches (102 by 71 cm)."
                },
                {
                    "headline": "Measure your wood pieces.",
                    "description": "Lay out all of your wood pieces, so that you can see exactly what you have to work with. Select a single piece of wood, place your measuring tape on it, and measure out the length that you’ll need. Make a mark on the final measurement spot with a pencil or marker. This is where you’ll make the cut. Repeat until all of your pieces are measured. Divide your wood into “type sections” to make your measurements. For example, measure each support post individually, but do them back-to-back. This is better than jumping back and forth between different wood pieces for different purposes and potentially mis-measuring."
                },
                {
                    "headline": "Cut your wood pieces.",
                    "description": "Put on your safety goggles and gloves. Set up your saw horse (if you are using a hand saw) or your table saw (if you are using an attached saw). Set a single piece of wood into the saw horse or against the table saw at a time. Align the saw blade with your measurement mark and make a clean, single cut. Make sure that you’ve read all of the instructions regarding using your saw and feel very comfortable cutting with it before attempting a complicated project, such as building a rabbit hutch. Before you make each cut with your saw, do a quick safety check to ensure that your limbs are in the proper position and away from the trajectory of the saw blade. If you do not have a saw or are not comfortable using one, many hardware or home improvement stores will actually cut your wood pieces for you. You’ll simply need to buy the wood in store, provide them with your measurements for each piece, and then wait for the cuts to be completed by a staff member."
                },
                {
                    "headline": "Select your wire mesh pieces.",
                    "description": "The best wire to use is 14 or 16 gauge galvanized, as it will not break if your rabbit tries to chew on it. Use 1 by 2 inches (2.5 by 5.1 cm) rabbit mesh for the sides and door. Use ⁄2 by 1 inch (1.3 by 2.5 cm) weave rabbit mesh for the flooring. The smooth mesh will protect your rabbit’s feet. Don’t use chicken wire for your hutch, as it is not strong enough to contain rabbits. You can buy your mesh from an animal specialty store online in a roll or in pre-cut panels. Most traditional hardware stores do not carry rabbit mesh in the appropriate specs."
                },
                {
                    "headline": "Cut your wire mesh pieces.",
                    "description": "Use a pair of wire cutters to snip your cage wire into pieces that will fit on the outside of your hutch. You will need 4 pieces for the sides. You may also need to cut out an additional piece of wire to fit your wooden doorframe."
                },
                {
                    "headline": "Set out the rest of your supplies.",
                    "description": "Purchase shingles for the roof if you know that your hutch will be exposed to any kind of outdoor weather. This will maximize the life of your roof. Get 2 hinges and a sliding bolt lock mechanism for your cage door. You can purchase the shingles and the lock materials at most hardware stores. You’ll need shingles that can slightly overlap and still cover the same dimension of the roof."
                }
            ]
        },
        {
            "name": "Setting up the Basic Structure",
            "steps": [
                {
                    "headline": "Screw together your 2 end sections.",
                    "description": "Use wood screws to attach 2 of the width pieces to 2 of the height pieces. They should form a rectangle once connected. The width pieces should be opposite one another, the same with the height pieces. Then, do the same process again with your remaining 4 short pieces of wood. You should now have 2 rectangles that will form the ends of your hutch."
                },
                {
                    "headline": "Attach the length pieces to the ends.",
                    "description": "Use wood screws to secure each single length piece of wood so that it runs from the corner of one end to the corner of the other completed end. Continue until you’ve screwed in all 4 long pieces. In the end, your rabbit hutch frame should resemble a three-dimensional rectangle."
                },
                {
                    "headline": "Attach the mesh to the wood frame.",
                    "description": "Rotate the frame on the ground until it is properly positioned, minus the supports. This will help you to visualize how to attach the mesh. Get each cut mesh piece and secure it to one of the open spaces in the frame using an industrial staple gun and staples. Use about a staple every inch or so (or every several centimeters) to secure the mesh to prevent any gaps from forming. Make sure that you hold the mesh tight as you attach it. For that reason, it really helps to have another person help you with this stage of the building process."
                },
                {
                    "headline": "Attach the top and bottom last.",
                    "description": "With the hutch facing upright, position your roof on top of the frame. Screw it in to the frame around the edges. Get another person to help you flip the hutch over on to its top, so the bottom if facing upwards. Position the flooring plywood on the frame and screw it in securely. Flip the hutch back over carefully. You can use a simple piece of cut plywood as a divider. To keep the air moving in the cage, it’s best if you punch or bore out a few smooth holes into the wood before inserting it."
                },
                {
                    "headline": "Create the door.",
                    "description": "Use your wire cutters to cut the mesh and make a space in the front of the cage for a door. Roll pieces of plastic trim over the newly exposed edges of the wire mesh. You can also make a square wood frame for your door, attach two hinges to it, and then cover it with wire mesh before installing it. Or, you can make your door out of wire alone. Attach the door to the main structure using c-rings or staples. A wire door is simpler to create. However, it can become difficult to open and close over time. A wood door is sturdier. However, it takes more time to construct. Consider adding a latch for your door as well. This will help to prevent the possibility of your rabbits’ escaping. A simple sliding latch is the best option for a wooden door. If you use a wire door, then you may want to go with a wire hook latch."
                },
                {
                    "headline": "Attach the support posts.",
                    "description": "With a helper, flip the hutch upside down once more. Then, use a combination of L-brackets and wood screws to secure the legs posts to the base. You should attach a single leg to each of the 4 corners of the frame."
                }
            ]
        },
        {
            "name": "Installing and Finishing Your Hutch",
            "steps": [
                {
                    "headline": "Add shingles and drainage.",
                    "description": "A shingled roof is not a necessity for a rabbit hutch, but it will make it last longer. Nail down shingles or metal roofing pieces onto a plywood foundation on the top of your hutch. If you are worried about drainage, extend the shingles so that they slightly overhang the edges of the hutch. You can also stack them to create a slight downward angle. If you add a layer of tar paper under the shingles, this will create even more water protection."
                },
                {
                    "headline": "Find a safe and secure location for your hutch.",
                    "description": "You want a spot that will not be too noisy or subject to too much foot traffic. It’s best if the area is away from any overly forested areas that wildlife might live in or frequent. If you can position your hutch under a tree to keep it from direct sunlight 24/7, that’s even better. It’s also a good idea to place your hutch in a spot where you can easily keep an eye on it and its inhabitants."
                },
                {
                    "headline": "Secure the support posts using concrete.",
                    "description": "Most hutches are heavy enough that they don’t require any additional stability aside from their own weight. However, if you are worried about your hutch moving or tipping over, then you can dig 4 holes in the ground in the future locations of your support posts. Then, place the posts into the holes, checking to make sure that the hutch is balanced, and add a bit of ready mixed concrete into each of them."
                },
                {
                    "headline": "Add in food, water, floor coverings, and toys.",
                    "description": "You can set the food bowl directly on the floor, but you’ll want to hook the water bottle to the side of the cage. You can add straw or unbleached shredded paper to the floor. This will help to protect your rabbit’s delicate feet. Make sure to throw in a few favorite toys as well."
                }
            ]
        }
    ],
    "tyn": [
        "Safety glasses",
        "Quality work gloves",
        "Wood",
        "14 to 16-gauge galvanized wire",
        "Wood screws",
        "Screwdriver",
        "Dremel tool or metal file",
        "Wire cutters",
        "Industrial staples and stapler",
        "Measuring tape",
        "Sliding latch",
        "Hinges",
        "Plastic trim",
        "Good quality straw, hay, or paper",
        "Shingles",
        "Water bottle",
        "Sturdy food bowl",
        "Lots of toys"
    ],
    "text": " Prepping Your Supplies Plan out the design. Most hutches are made out of a wood frame with wire windows and doors. When thinking about the size of your hutch, consider how many rabbits will be staying in it. They’ll need enough room to move around, roughly 4 times the body size per rabbit. A minimum height of 16 inches (41 cm) is also a good idea. For example, if your rabbit is 5 inches (13 cm) wide and 10 inches (25 cm) long, then it needs 4.2 feet (1.3 m) square footage of space. If you will be housing multiple rabbits in a single hutch, consider whether or not you’ll want to add in dividers. This can be useful when you want to separate individual animals. Try to keep your hutch less than 30 inches (76 cm) deep. If you go deeper than this, it can be difficult to reach inside and get out your rabbits without a struggle. Get sturdy wood for the frame and supports. Use 2 by 4 inches (5.1 by 10.2 cm) wood pieces for the frame and 4 by 4 inches (10 by 10 cm) wood pieces for the posts. Look for wood that is straight, not warped. Do not choose pieces with large knots or signs of splitting at the edges. The amount of wood pieces that you’ll need will depend on the size of your hutch. Untreated pine wood is a good choice for the frame and supports. It holds up well under varying weather conditions and is nontoxic to rabbits if consumed. For example, if you are building a hutch that will be 40” X 28” X 20”, then you’ll need 4 40 inches (100 cm) length pieces, 4 28 inches (71 cm) width pieces, and 4 20 inches (51 cm) height pieces to construct the frame. If you want to attach a wooden door to your hutch, then you’ll need to get wood to construct a door frame and the door itself. You can generally go with a smaller size wood, such as a 1 by 1 inch (2.5 by 2.5 cm) or even 1 by ⁄2 inch (2.5 by 1.3 cm). Give some thought to how high off the ground you’ll want your hutch to be. If you want your hutch to sit 4 feet (1.2 m) off the ground, then you’ll need 4 4 feet (1.2 m) posts as supports. Choose plywood for the floor and roof. You’ll need 1 roof piece of wood and 1 flooring piece of wood that match the length and width dimensions of your hutch. Plywood comes in large sheets, so it usually a good idea to buy 1-2 sheets at the start of your project. You can then cut out the pieces that you need and use the remaining wood for other projects. Look for plywood that is a golden or light reddish color. It should be free of large knots or signs that the wood if fraying or flaking up. For example, if you are building a hutch that will be 40” X 28” X 20”, then you’ll need to cut out 2 plywood pieces (1 for the roof, and 1 for the floor) that are 40 by 28 inches (102 by 71 cm). Measure your wood pieces. Lay out all of your wood pieces, so that you can see exactly what you have to work with. Select a single piece of wood, place your measuring tape on it, and measure out the length that you’ll need. Make a mark on the final measurement spot with a pencil or marker. This is where you’ll make the cut. Repeat until all of your pieces are measured. Divide your wood into “type sections” to make your measurements. For example, measure each support post individually, but do them back-to-back. This is better than jumping back and forth between different wood pieces for different purposes and potentially mis-measuring. Cut your wood pieces. Put on your safety goggles and gloves. Set up your saw horse (if you are using a hand saw) or your table saw (if you are using an attached saw). Set a single piece of wood into the saw horse or against the table saw at a time. Align the saw blade with your measurement mark and make a clean, single cut. Make sure that you’ve read all of the instructions regarding using your saw and feel very comfortable cutting with it before attempting a complicated project, such as building a rabbit hutch. Before you make each cut with your saw, do a quick safety check to ensure that your limbs are in the proper position and away from the trajectory of the saw blade. If you do not have a saw or are not comfortable using one, many hardware or home improvement stores will actually cut your wood pieces for you. You’ll simply need to buy the wood in store, provide them with your measurements for each piece, and then wait for the cuts to be completed by a staff member. Select your wire mesh pieces. The best wire to use is 14 or 16 gauge galvanized, as it will not break if your rabbit tries to chew on it. Use 1 by 2 inches (2.5 by 5.1 cm) rabbit mesh for the sides and door. Use ⁄2 by 1 inch (1.3 by 2.5 cm) weave rabbit mesh for the flooring. The smooth mesh will protect your rabbit’s feet. Don’t use chicken wire for your hutch, as it is not strong enough to contain rabbits. You can buy your mesh from an animal specialty store online in a roll or in pre-cut panels. Most traditional hardware stores do not carry rabbit mesh in the appropriate specs. Cut your wire mesh pieces. Use a pair of wire cutters to snip your cage wire into pieces that will fit on the outside of your hutch. You will need 4 pieces for the sides. You may also need to cut out an additional piece of wire to fit your wooden doorframe. Set out the rest of your supplies. Purchase shingles for the roof if you know that your hutch will be exposed to any kind of outdoor weather. This will maximize the life of your roof. Get 2 hinges and a sliding bolt lock mechanism for your cage door. You can purchase the shingles and the lock materials at most hardware stores. You’ll need shingles that can slightly overlap and still cover the same dimension of the roof. Setting up the Basic Structure Screw together your 2 end sections. Use wood screws to attach 2 of the width pieces to 2 of the height pieces. They should form a rectangle once connected. The width pieces should be opposite one another, the same with the height pieces. Then, do the same process again with your remaining 4 short pieces of wood. You should now have 2 rectangles that will form the ends of your hutch. Attach the length pieces to the ends. Use wood screws to secure each single length piece of wood so that it runs from the corner of one end to the corner of the other completed end. Continue until you’ve screwed in all 4 long pieces. In the end, your rabbit hutch frame should resemble a three-dimensional rectangle. Attach the mesh to the wood frame. Rotate the frame on the ground until it is properly positioned, minus the supports. This will help you to visualize how to attach the mesh. Get each cut mesh piece and secure it to one of the open spaces in the frame using an industrial staple gun and staples. Use about a staple every inch or so (or every several centimeters) to secure the mesh to prevent any gaps from forming. Make sure that you hold the mesh tight as you attach it. For that reason, it really helps to have another person help you with this stage of the building process. Attach the top and bottom last. With the hutch facing upright, position your roof on top of the frame. Screw it in to the frame around the edges. Get another person to help you flip the hutch over on to its top, so the bottom if facing upwards. Position the flooring plywood on the frame and screw it in securely. Flip the hutch back over carefully. You can use a simple piece of cut plywood as a divider. To keep the air moving in the cage, it’s best if you punch or bore out a few smooth holes into the wood before inserting it. Create the door. Use your wire cutters to cut the mesh and make a space in the front of the cage for a door. Roll pieces of plastic trim over the newly exposed edges of the wire mesh. You can also make a square wood frame for your door, attach two hinges to it, and then cover it with wire mesh before installing it. Or, you can make your door out of wire alone. Attach the door to the main structure using c-rings or staples. A wire door is simpler to create. However, it can become difficult to open and close over time. A wood door is sturdier. However, it takes more time to construct. Consider adding a latch for your door as well. This will help to prevent the possibility of your rabbits’ escaping. A simple sliding latch is the best option for a wooden door. If you use a wire door, then you may want to go with a wire hook latch. Attach the support posts. With a helper, flip the hutch upside down once more. Then, use a combination of L-brackets and wood screws to secure the legs posts to the base. You should attach a single leg to each of the 4 corners of the frame. Installing and Finishing Your Hutch Add shingles and drainage. A shingled roof is not a necessity for a rabbit hutch, but it will make it last longer. Nail down shingles or metal roofing pieces onto a plywood foundation on the top of your hutch. If you are worried about drainage, extend the shingles so that they slightly overhang the edges of the hutch. You can also stack them to create a slight downward angle. If you add a layer of tar paper under the shingles, this will create even more water protection. Find a safe and secure location for your hutch. You want a spot that will not be too noisy or subject to too much foot traffic. It’s best if the area is away from any overly forested areas that wildlife might live in or frequent. If you can position your hutch under a tree to keep it from direct sunlight 24/7, that’s even better. It’s also a good idea to place your hutch in a spot where you can easily keep an eye on it and its inhabitants. Secure the support posts using concrete. Most hutches are heavy enough that they don’t require any additional stability aside from their own weight. However, if you are worried about your hutch moving or tipping over, then you can dig 4 holes in the ground in the future locations of your support posts. Then, place the posts into the holes, checking to make sure that the hutch is balanced, and add a bit of ready mixed concrete into each of them. Add in food, water, floor coverings, and toys. You can set the food bowl directly on the floor, but you’ll want to hook the water bottle to the side of the cage. You can add straw or unbleached shredded paper to the floor. This will help to protect your rabbit’s delicate feet. Make sure to throw in a few favorite toys as well.",
    "sentences": [
        " Prepping Your Supplies Plan out the design.",
        "Most hutches are made out of a wood frame with wire windows and doors.",
        "When thinking about the size of your hutch, consider how many rabbits will be staying in it.",
        "They’ll need enough room to move around, roughly 4 times the body size per rabbit.",
        "A minimum height of 16 inches (41 cm) is also a good idea.",
        "For example, if your rabbit is 5 inches (13 cm) wide and 10 inches (25 cm) long, then it needs 4.2 feet (1.3 m) square footage of space.",
        "If you will be housing multiple rabbits in a single hutch, consider whether or not you’ll want to add in dividers.",
        "This can be useful when you want to separate individual animals.",
        "Try to keep your hutch less than 30 inches (76 cm) deep.",
        "If you go deeper than this, it can be difficult to reach inside and get out your rabbits without a struggle.",
        "Get sturdy wood for the frame and supports.",
        "Use 2 by 4 inches (5.1 by 10.2 cm) wood pieces for the frame and 4 by 4 inches (10 by 10 cm) wood pieces for the posts.",
        "Look for wood that is straight, not warped.",
        "Do not choose pieces with large knots or signs of splitting at the edges.",
        "The amount of wood pieces that you’ll need will depend on the size of your hutch.",
        "Untreated pine wood is a good choice for the frame and supports.",
        "It holds up well under varying weather conditions and is nontoxic to rabbits if consumed.",
        "For example, if you are building a hutch that will be 40” X 28” X 20”, then you’ll need 4 40 inches (100 cm) length pieces, 4 28 inches (71 cm) width pieces, and 4 20 inches (51 cm) height pieces to construct the frame.",
        "If you want to attach a wooden door to your hutch, then you’ll need to get wood to construct a door frame and the door itself.",
        "You can generally go with a smaller size wood, such as a 1 by 1 inch (2.5 by 2.5 cm) or even 1 by ⁄2 inch (2.5 by 1.3 cm).",
        "Give some thought to how high off the ground you’ll want your hutch to be.",
        "If you want your hutch to sit 4 feet (1.2 m) off the ground, then you’ll need 4 4 feet (1.2 m) posts as supports.",
        "Choose plywood for the floor and roof.",
        "You’ll need 1 roof piece of wood and 1 flooring piece of wood that match the length and width dimensions of your hutch.",
        "Plywood comes in large sheets, so it usually a good idea to buy 1-2 sheets at the start of your project.",
        "You can then cut out the pieces that you need and use the remaining wood for other projects.",
        "Look for plywood that is a golden or light reddish color.",
        "It should be free of large knots or signs that the wood if fraying or flaking up.",
        "For example, if you are building a hutch that will be 40” X 28” X 20”, then you’ll need to cut out 2 plywood pieces (1 for the roof, and 1 for the floor) that are 40 by 28 inches (102 by 71 cm).",
        "Measure your wood pieces.",
        "Lay out all of your wood pieces, so that you can see exactly what you have to work with.",
        "Select a single piece of wood, place your measuring tape on it, and measure out the length that you’ll need.",
        "Make a mark on the final measurement spot with a pencil or marker.",
        "This is where you’ll make the cut.",
        "Repeat until all of your pieces are measured.",
        "Divide your wood into “type sections” to make your measurements.",
        "For example, measure each support post individually, but do them back-to-back.",
        "This is better than jumping back and forth between different wood pieces for different purposes and potentially mis-measuring.",
        "Cut your wood pieces.",
        "Put on your safety goggles and gloves.",
        "Set up your saw horse (if you are using a hand saw) or your table saw (if you are using an attached saw).",
        "Set a single piece of wood into the saw horse or against the table saw at a time.",
        "Align the saw blade with your measurement mark and make a clean, single cut.",
        "Make sure that you’ve read all of the instructions regarding using your saw and feel very comfortable cutting with it before attempting a complicated project, such as building a rabbit hutch.",
        "Before you make each cut with your saw, do a quick safety check to ensure that your limbs are in the proper position and away from the trajectory of the saw blade.",
        "If you do not have a saw or are not comfortable using one, many hardware or home improvement stores will actually cut your wood pieces for you.",
        "You’ll simply need to buy the wood in store, provide them with your measurements for each piece, and then wait for the cuts to be completed by a staff member.",
        "Select your wire mesh pieces.",
        "The best wire to use is 14 or 16 gauge galvanized, as it will not break if your rabbit tries to chew on it.",
        "Use 1 by 2 inches (2.5 by 5.1 cm) rabbit mesh for the sides and door.",
        "Use ⁄2 by 1 inch (1.3 by 2.5 cm) weave rabbit mesh for the flooring.",
        "The smooth mesh will protect your rabbit’s feet.",
        "Don’t use chicken wire for your hutch, as it is not strong enough to contain rabbits.",
        "You can buy your mesh from an animal specialty store online in a roll or in pre-cut panels.",
        "Most traditional hardware stores do not carry rabbit mesh in the appropriate specs.",
        "Cut your wire mesh pieces.",
        "Use a pair of wire cutters to snip your cage wire into pieces that will fit on the outside of your hutch.",
        "You will need 4 pieces for the sides.",
        "You may also need to cut out an additional piece of wire to fit your wooden doorframe.",
        "Set out the rest of your supplies.",
        "Purchase shingles for the roof if you know that your hutch will be exposed to any kind of outdoor weather.",
        "This will maximize the life of your roof.",
        "Get 2 hinges and a sliding bolt lock mechanism for your cage door.",
        "You can purchase the shingles and the lock materials at most hardware stores.",
        "You’ll need shingles that can slightly overlap and still cover the same dimension of the roof.",
        "Setting up the Basic Structure Screw together your 2 end sections.",
        "Use wood screws to attach 2 of the width pieces to 2 of the height pieces.",
        "They should form a rectangle once connected.",
        "The width pieces should be opposite one another, the same with the height pieces.",
        "Then, do the same process again with your remaining 4 short pieces of wood.",
        "You should now have 2 rectangles that will form the ends of your hutch.",
        "Attach the length pieces to the ends.",
        "Use wood screws to secure each single length piece of wood so that it runs from the corner of one end to the corner of the other completed end.",
        "Continue until you’ve screwed in all 4 long pieces.",
        "In the end, your rabbit hutch frame should resemble a three-dimensional rectangle.",
        "Attach the mesh to the wood frame.",
        "Rotate the frame on the ground until it is properly positioned, minus the supports.",
        "This will help you to visualize how to attach the mesh.",
        "Get each cut mesh piece and secure it to one of the open spaces in the frame using an industrial staple gun and staples.",
        "Use about a staple every inch or so (or every several centimeters) to secure the mesh to prevent any gaps from forming.",
        "Make sure that you hold the mesh tight as you attach it.",
        "For that reason, it really helps to have another person help you with this stage of the building process.",
        "Attach the top and bottom last.",
        "With the hutch facing upright, position your roof on top of the frame.",
        "Screw it in to the frame around the edges.",
        "Get another person to help you flip the hutch over on to its top, so the bottom if facing upwards.",
        "Position the flooring plywood on the frame and screw it in securely.",
        "Flip the hutch back over carefully.",
        "You can use a simple piece of cut plywood as a divider.",
        "To keep the air moving in the cage, it’s best if you punch or bore out a few smooth holes into the wood before inserting it.",
        "Create the door.",
        "Use your wire cutters to cut the mesh and make a space in the front of the cage for a door.",
        "Roll pieces of plastic trim over the newly exposed edges of the wire mesh.",
        "You can also make a square wood frame for your door, attach two hinges to it, and then cover it with wire mesh before installing it.",
        "Or, you can make your door out of wire alone.",
        "Attach the door to the main structure using c-rings or staples.",
        "A wire door is simpler to create.",
        "However, it can become difficult to open and close over time.",
        "A wood door is sturdier.",
        "However, it takes more time to construct.",
        "Consider adding a latch for your door as well.",
        "This will help to prevent the possibility of your rabbits’ escaping.",
        "A simple sliding latch is the best option for a wooden door.",
        "If you use a wire door, then you may want to go with a wire hook latch.",
        "Attach the support posts.",
        "With a helper, flip the hutch upside down once more.",
        "Then, use a combination of L-brackets and wood screws to secure the legs posts to the base.",
        "You should attach a single leg to each of the 4 corners of the frame.",
        "Installing and Finishing Your Hutch Add shingles and drainage.",
        "A shingled roof is not a necessity for a rabbit hutch, but it will make it last longer.",
        "Nail down shingles or metal roofing pieces onto a plywood foundation on the top of your hutch.",
        "If you are worried about drainage, extend the shingles so that they slightly overhang the edges of the hutch.",
        "You can also stack them to create a slight downward angle.",
        "If you add a layer of tar paper under the shingles, this will create even more water protection.",
        "Find a safe and secure location for your hutch.",
        "You want a spot that will not be too noisy or subject to too much foot traffic.",
        "It’s best if the area is away from any overly forested areas that wildlife might live in or frequent.",
        "If you can position your hutch under a tree to keep it from direct sunlight 24/7, that’s even better.",
        "It’s also a good idea to place your hutch in a spot where you can easily keep an eye on it and its inhabitants.",
        "Secure the support posts using concrete.",
        "Most hutches are heavy enough that they don’t require any additional stability aside from their own weight.",
        "However, if you are worried about your hutch moving or tipping over, then you can dig 4 holes in the ground in the future locations of your support posts.",
        "Then, place the posts into the holes, checking to make sure that the hutch is balanced, and add a bit of ready mixed concrete into each of them.",
        "Add in food, water, floor coverings, and toys.",
        "You can set the food bowl directly on the floor, but you’ll want to hook the water bottle to the side of the cage.",
        "You can add straw or unbleached shredded paper to the floor.",
        "This will help to protect your rabbit’s delicate feet.",
        "Make sure to throw in a few favorite toys as well."
    ]
}