{
    "title": "How to Make a Weighted Blanket",
    "url": "https://www.wikihow.com/Make-a-Weighted-Blanket",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Sewing",
        "Sewing Crafts",
        "Sewing Blankets"
    ],
    "parts": [
        {
            "name": "Calculating Blanket Weight and Choosing Materials",
            "steps": [
                {
                    "headline": "Use current weight if the blanket is for a child or ideal weight if it's for an adult.",
                    "description": "Find out what the child weighs to begin calculating the ideal weight for their blanket. If the recipient will be an adult, use their height and consult a weight range chart to determine their ideal body weight.For example, if a child weighs 48 pounds (22 kg), then this should be your starting point. If the adult is 69 in (180 cm), then their ideal body weight is between 128 and 168 pounds (58 and 76 kg). Use a number somewhere in the middle to do your blanket calculations, such as 148 pounds (67 kg). Use an online calculator to find the ideal body weight or weight range for an adult, such as https://www.calculator.net/ideal-weight-calculator.html\n\nYour child can continue to use the blanket as long as they are within 5 to 10 pounds (2.3 to 4.5 kg) of the weight of the blanket. The amount of time a child can use the blanket will depend on the age of your child and how quickly they are growing, which may vary greatly. They may be able to use the blanket for just a few months, or up to a year or 2. Adults can use the blanket for much longer."
                },
                {
                    "headline": "Multiply the weight by 0.10 to find out how much the blanket should weigh.",
                    "description": "Once you have determined the weight, multiply this number by 0.10. This will give you the amount for 10% of the person's weight. It is especially important to avoid making the blanket too heavy for a child. Err on the side of caution by sticking with 10% to calculate the weight of the blanket.If an adult's ideal body weight is 148 pounds (67 kg), then you could make your blanket 14.8 pounds (6.7 kg)."
                },
                {
                    "headline": "Purchase the required amount of poly pellets for your blanket.",
                    "description": "Poly pellets are small plastic pellets meant for crafting. They are available at craft supply stores in packages with the weight clearly marked on them. Check the weight on the package and purchase the number of packages you will need. For example, if the poly pellets come in 5 lb (2.3 kg) packages and you want to make a weighted blanket that is 14.8 pounds (6.7 kg), then you will need 3 packages of poly pellets."
                },
                {
                    "headline": "Convert the desired weight of the blanket into 0.5 oz (14 g) amounts.",
                    "description": "Use a digital scale to measure out the amount of poly pellets you will need and then scoop them out into a container or large plastic bag using an 8 oz (230 g) measure. Count the number of cups as you do so. Then, multiply the total number of 8 oz (230 g) cups by 16 (total number of 0.5 oz (14 g) amounts in a cup) to find the number of 0.5 oz (14 g) amounts you will need to put into each section of the blanket.For example, if you need 14.8 pounds (6.7 kg) of poly pellets to achieve the desired blanket weight, then divide this amount in ounces (236.8 oz (6,710 g)) into 8 oz (230 g) amounts, which equals 29.6 (about 30). If the total number of 8 oz (230 g) amounts is 30, then multiply 30 by 16 for a total of 480 0.5 oz (14 g) amounts. Converting the total amount of poly pellets into 0.5 oz (14 g) amounts will make it easier to distribute the pellets evenly. Weigh out the amounts with a digital scale and place the required amount into each section of the blanket."
                },
                {
                    "headline": "Select enough durable fabric to make the desired size blanket.",
                    "description": "You will need 2 equally-sized pieces to make your blanket. Opt for a fabric that is lightweight for a blanket that the person can use during warm weather, such as cotton or broadcloth. If you want to make a warm blanket for the person to use during cold weather, choose flannel or fleece. Purchase enough fabric to make the blanket in the desired dimensions plus 1 in (2.5 cm) added to the length and width for the seam allowance. Some suggested blanket sizes include:\nYoung child: 42 by 48 inches (110 by 120 cm)\nOlder child, teen, or adult: 48 by 60 inches (120 by 150 cm)\nLap blanket: 36 by 48 inches (91 by 122 cm)"
                }
            ]
        },
        {
            "name": "Securing the Fabric Pieces Together",
            "steps": [
                {
                    "headline": "Align and pin the fabric pieces with the right (print) sides facing each other.",
                    "description": "Cut your fabric pieces so that they are the desired dimensions for your blanket including 1 in (2.5 cm) added to the length and width for the seam allowance. Then, place them together so that the right sides are facing each other. Pin along 3 of the edges.Place pins about 2 to 3 inches (5.1 to 7.6 cm) apart to secure the edges. Insert the pins so that they are perpendicular to the raw edges of the blanket."
                },
                {
                    "headline": "Sew 0.5 in (1.3 cm) from each of the pinned edges.",
                    "description": "Select the straight stitch setting on your sewing machine. Begin sewing at the corner of 1 of the pinned and unpinned edges. Then, sew all the way around the pinned edges of the blanket. Make sure to leave 1 of the edges of the blanket open. This is essential to put the poly pellets into the blanket. Remove the pins as you sew. Make sure not to sew over the pins since this may damage your sewing machine."
                },
                {
                    "headline": "Turn the blanket right side out.",
                    "description": "After you have sewn 3 sides of the blanket, invert the blanket so that the right sides will be on the outside. Push out the fabric around the inner corners of the blanket as needed. If the corners seem bulky, you can snip a notch into the fabric at the corner to make it easier to push them out. Make sure not to cut into the seam. Make sure that you have removed every single pin before you continue working on the blanket!"
                }
            ]
        },
        {
            "name": "Measuring and Marking the Blanket Sections",
            "steps": [
                {
                    "headline": "Mark every 4 in (10 cm) on the open edge and 1 adjacent edge.",
                    "description": "Measure along the open edge of the blanket and use chalk to make a mark every 4 in (10 cm) along this edge. Then, do the same thing along 1 of the adjacent edges of the blanket.After you sew over these lines, you will be placing poly pellets into the blanket in 4 by 4 in (10 by 10 cm) sections so that the weight will be evenly distributed. Dividing the blanket into a grid will make it easier to do that. Make sure that 1.5 the total size of the blanket is divisible by 4 in (10 cm)."
                },
                {
                    "headline": "Multiply the number of columns on 1 side by the number on the other side.",
                    "description": "Multiply the total number of columns on the open edge of the blanket by the total number of columns on the adjacent edge. A column is the space between each of the marks along the edge, plus the 2 end sections. Count the spaces between the markings and end seams to find the total for 1 side, then do the same for the other side. Multiply these 2 numbers.For example, if you have 10 columns on 1 side and 12 columns on the other side, then your total number of squares would be 120."
                },
                {
                    "headline": "Divide the total number of squares by the total 0.5 oz (14 g) amounts.",
                    "description": "Once you have your total number of squares and 0.5 oz (14 g) amounts, you can do the final calculation to figure out how many 0.5 oz (14 g) amounts of pellets to put into each square. Divide the total number of squares for the blanket by the total number of 0.5 oz (14 g) amounts that are needed to achieve the desired weight.For example, if you have determined that you need 480 0.5 oz (14 g) amounts in a blanket with 120 squares, then you will need to add 4 oz (110 g) of poly pellets to each square."
                }
            ]
        },
        {
            "name": "Filling and Sewing the Blanket",
            "steps": [
                {
                    "headline": "Sew across the lines running down from the open end of the blanket.",
                    "description": "Sew a straight stitch down each of the lines you have marked along the open edge. This will ensure that the opening of the columns will be along the open edge of the blanket and you can pour the poly pellets into the columns.All of the lines you sew should be parallel to each other. Do not sew across any of the other lines you have drawn on the fabric yet!"
                },
                {
                    "headline": "Place poly pellets into each of the columns and shake them down.",
                    "description": "Measure out the number of pellets you need for each square and pour this amount of pellets into each of the columns.For example, if you have determined that each of the squares should have 4 oz (110 g) of pellets, then pour 4 oz (110 g) of pellets into the open end of each of the columns."
                },
                {
                    "headline": "Sew across the columns to secure the poly squares.",
                    "description": "Use 1 of the lines you made on the edge of your blanket as a guide and sew across the columns in a straight line. Make sure that the poly pellets are at the bottom of the columns so that you will not sew over them.Hold the blanket at the open end and give the blanket a shake before you start sewing. Then place the blanket so that the part of the columns with poly pellets in them will be hanging over the outer edge of your sewing machine as you sew."
                },
                {
                    "headline": "Continue to fill columns and sew across the blanket.",
                    "description": "Repeat this process until you have distributed the required amount of pellets to achieve the desired weight. Continue to fill the columns with poly pellets, shake them down to the bottom of the columns, and sew across the columns to secure them.This will get harder as you continue to expand the size of the blanket. Be very careful not to let the poly pellets come out the open end of the blanket."
                },
                {
                    "headline": "Finish the blanket's final edge with a folded seam.",
                    "description": "When you get to the last row, fold over 0.5 in (1.3 cm) of the edge of the blanket so that the raw edge is on the back or underside of the blanket. Then, sew across the fabric about 0.25 in (0.64 cm) from the fold to secure the edge of the blanket. Another option for finishing the blanket is to serge the edges. If you have a serger, you can simply sew over the edges of the blanket all the way around the edges for a simple finish."
                }
            ]
        },
        {
            "name": "Adding a Soft Border for Extra Comfort",
            "steps": [
                {
                    "headline": "Choose a satiny or soft fabric to go around the edges of the blanket.",
                    "description": "You can purchase satin blanket binding to cover the edges of your blanket or choose another type of fabric to use for the binding. You will need enough to go all the way around your blanket, so make sure that you know the total length of the perimeter before you buy your fabric.You can purchase blanket binding that is already in the required dimensions for covering the edges of your blanket. You can a 3 in (7.6 cm) wide strip for each of the 4 sides of the blanket. Make sure that each of the strips are 1 in (2.5 cm) longer than each of the blanket's edges."
                },
                {
                    "headline": "Fold over each of the edges of the strips by 0.5 in (1.3 cm).",
                    "description": "If you are making your own binding, then fold the fabric over at the edges by 0.5 in (1.3 cm) and iron along the folded edges to crease them. Make sure to do this for the short edges as well so that they will not have any raw edges. If you are using pre-cut blanket binding, then the edges may already be creased. Make sure that the raw edges are tucked under so that they will be hidden when you apply the binding to the edges of the blanket."
                },
                {
                    "headline": "Wrap a strip around the edge of the blanket and pin it into place.",
                    "description": "Place the binding over the outer edge of 1 side of the blanket. Make sure that the raw edges of the binding are tucked under and there is an equal amount of fabric on both sides of the blanket edge. Place pins about 2 to 3 in (5.1 to 7.6 cm) apart along the binding.Make sure that the pins go all the way through the blanket fabric and binding on both sides."
                },
                {
                    "headline": "Sew along the edges of the binding strips with a wide zigzag stitch.",
                    "description": "Start sewing at 1 end of the binding strip with the needle directly above the folded edge of the binding. Then, sew all the way down the strip to secure it in place.Select the zigzag stitch setting on your sewing machine and increase the stitch width to the highest number setting on your machine."
                },
                {
                    "headline": "Repeat for the rest of the strips.",
                    "description": "Continue to sew down the length of each of the strips to secure them in place on the edges of your blanket. When you reach each end, turn the blanket by 90 degrees and start sewing the next binding strip without cutting the thread.After you have secured the last piece of binding, cut the excess threads. Your blanket is now complete!"
                }
            ]
        }
    ],
    "tyn": [
        "2 yd (1.8 m) or more of soft, machine-washable fabric",
        "Poly pellets to use as filler for the blanket",
        "Scissors",
        "Ruler or tape measure",
        "Chalk",
        "Sewing machine",
        "Thread"
    ],
    "text": " Calculating Blanket Weight and Choosing Materials Use current weight if the blanket is for a child or ideal weight if it's for an adult. Find out what the child weighs to begin calculating the ideal weight for their blanket. If the recipient will be an adult, use their height and consult a weight range chart to determine their ideal body weight.For example, if a child weighs 48 pounds (22 kg), then this should be your starting point. If the adult is 69 in (180 cm), then their ideal body weight is between 128 and 168 pounds (58 and 76 kg). Use a number somewhere in the middle to do your blanket calculations, such as 148 pounds (67 kg). Use an online calculator to find the ideal body weight or weight range for an adult, such as https://www.calculator.net/ideal-weight-calculator.html\n\nYour child can continue to use the blanket as long as they are within 5 to 10 pounds (2.3 to 4.5 kg) of the weight of the blanket. The amount of time a child can use the blanket will depend on the age of your child and how quickly they are growing, which may vary greatly. They may be able to use the blanket for just a few months, or up to a year or 2. Adults can use the blanket for much longer. Multiply the weight by 0.10 to find out how much the blanket should weigh. Once you have determined the weight, multiply this number by 0.10. This will give you the amount for 10% of the person's weight. It is especially important to avoid making the blanket too heavy for a child. Err on the side of caution by sticking with 10% to calculate the weight of the blanket.If an adult's ideal body weight is 148 pounds (67 kg), then you could make your blanket 14.8 pounds (6.7 kg). Purchase the required amount of poly pellets for your blanket. Poly pellets are small plastic pellets meant for crafting. They are available at craft supply stores in packages with the weight clearly marked on them. Check the weight on the package and purchase the number of packages you will need. For example, if the poly pellets come in 5 lb (2.3 kg) packages and you want to make a weighted blanket that is 14.8 pounds (6.7 kg), then you will need 3 packages of poly pellets. Convert the desired weight of the blanket into 0.5 oz (14 g) amounts. Use a digital scale to measure out the amount of poly pellets you will need and then scoop them out into a container or large plastic bag using an 8 oz (230 g) measure. Count the number of cups as you do so. Then, multiply the total number of 8 oz (230 g) cups by 16 (total number of 0.5 oz (14 g) amounts in a cup) to find the number of 0.5 oz (14 g) amounts you will need to put into each section of the blanket.For example, if you need 14.8 pounds (6.7 kg) of poly pellets to achieve the desired blanket weight, then divide this amount in ounces (236.8 oz (6,710 g)) into 8 oz (230 g) amounts, which equals 29.6 (about 30). If the total number of 8 oz (230 g) amounts is 30, then multiply 30 by 16 for a total of 480 0.5 oz (14 g) amounts. Converting the total amount of poly pellets into 0.5 oz (14 g) amounts will make it easier to distribute the pellets evenly. Weigh out the amounts with a digital scale and place the required amount into each section of the blanket. Select enough durable fabric to make the desired size blanket. You will need 2 equally-sized pieces to make your blanket. Opt for a fabric that is lightweight for a blanket that the person can use during warm weather, such as cotton or broadcloth. If you want to make a warm blanket for the person to use during cold weather, choose flannel or fleece. Purchase enough fabric to make the blanket in the desired dimensions plus 1 in (2.5 cm) added to the length and width for the seam allowance. Some suggested blanket sizes include:\nYoung child: 42 by 48 inches (110 by 120 cm)\nOlder child, teen, or adult: 48 by 60 inches (120 by 150 cm)\nLap blanket: 36 by 48 inches (91 by 122 cm) Securing the Fabric Pieces Together Align and pin the fabric pieces with the right (print) sides facing each other. Cut your fabric pieces so that they are the desired dimensions for your blanket including 1 in (2.5 cm) added to the length and width for the seam allowance. Then, place them together so that the right sides are facing each other. Pin along 3 of the edges.Place pins about 2 to 3 inches (5.1 to 7.6 cm) apart to secure the edges. Insert the pins so that they are perpendicular to the raw edges of the blanket. Sew 0.5 in (1.3 cm) from each of the pinned edges. Select the straight stitch setting on your sewing machine. Begin sewing at the corner of 1 of the pinned and unpinned edges. Then, sew all the way around the pinned edges of the blanket. Make sure to leave 1 of the edges of the blanket open. This is essential to put the poly pellets into the blanket. Remove the pins as you sew. Make sure not to sew over the pins since this may damage your sewing machine. Turn the blanket right side out. After you have sewn 3 sides of the blanket, invert the blanket so that the right sides will be on the outside. Push out the fabric around the inner corners of the blanket as needed. If the corners seem bulky, you can snip a notch into the fabric at the corner to make it easier to push them out. Make sure not to cut into the seam. Make sure that you have removed every single pin before you continue working on the blanket! Measuring and Marking the Blanket Sections Mark every 4 in (10 cm) on the open edge and 1 adjacent edge. Measure along the open edge of the blanket and use chalk to make a mark every 4 in (10 cm) along this edge. Then, do the same thing along 1 of the adjacent edges of the blanket.After you sew over these lines, you will be placing poly pellets into the blanket in 4 by 4 in (10 by 10 cm) sections so that the weight will be evenly distributed. Dividing the blanket into a grid will make it easier to do that. Make sure that 1.5 the total size of the blanket is divisible by 4 in (10 cm). Multiply the number of columns on 1 side by the number on the other side. Multiply the total number of columns on the open edge of the blanket by the total number of columns on the adjacent edge. A column is the space between each of the marks along the edge, plus the 2 end sections. Count the spaces between the markings and end seams to find the total for 1 side, then do the same for the other side. Multiply these 2 numbers.For example, if you have 10 columns on 1 side and 12 columns on the other side, then your total number of squares would be 120. Divide the total number of squares by the total 0.5 oz (14 g) amounts. Once you have your total number of squares and 0.5 oz (14 g) amounts, you can do the final calculation to figure out how many 0.5 oz (14 g) amounts of pellets to put into each square. Divide the total number of squares for the blanket by the total number of 0.5 oz (14 g) amounts that are needed to achieve the desired weight.For example, if you have determined that you need 480 0.5 oz (14 g) amounts in a blanket with 120 squares, then you will need to add 4 oz (110 g) of poly pellets to each square. Filling and Sewing the Blanket Sew across the lines running down from the open end of the blanket. Sew a straight stitch down each of the lines you have marked along the open edge. This will ensure that the opening of the columns will be along the open edge of the blanket and you can pour the poly pellets into the columns.All of the lines you sew should be parallel to each other. Do not sew across any of the other lines you have drawn on the fabric yet! Place poly pellets into each of the columns and shake them down. Measure out the number of pellets you need for each square and pour this amount of pellets into each of the columns.For example, if you have determined that each of the squares should have 4 oz (110 g) of pellets, then pour 4 oz (110 g) of pellets into the open end of each of the columns. Sew across the columns to secure the poly squares. Use 1 of the lines you made on the edge of your blanket as a guide and sew across the columns in a straight line. Make sure that the poly pellets are at the bottom of the columns so that you will not sew over them.Hold the blanket at the open end and give the blanket a shake before you start sewing. Then place the blanket so that the part of the columns with poly pellets in them will be hanging over the outer edge of your sewing machine as you sew. Continue to fill columns and sew across the blanket. Repeat this process until you have distributed the required amount of pellets to achieve the desired weight. Continue to fill the columns with poly pellets, shake them down to the bottom of the columns, and sew across the columns to secure them.This will get harder as you continue to expand the size of the blanket. Be very careful not to let the poly pellets come out the open end of the blanket. Finish the blanket's final edge with a folded seam. When you get to the last row, fold over 0.5 in (1.3 cm) of the edge of the blanket so that the raw edge is on the back or underside of the blanket. Then, sew across the fabric about 0.25 in (0.64 cm) from the fold to secure the edge of the blanket. Another option for finishing the blanket is to serge the edges. If you have a serger, you can simply sew over the edges of the blanket all the way around the edges for a simple finish. Adding a Soft Border for Extra Comfort Choose a satiny or soft fabric to go around the edges of the blanket. You can purchase satin blanket binding to cover the edges of your blanket or choose another type of fabric to use for the binding. You will need enough to go all the way around your blanket, so make sure that you know the total length of the perimeter before you buy your fabric.You can purchase blanket binding that is already in the required dimensions for covering the edges of your blanket. You can a 3 in (7.6 cm) wide strip for each of the 4 sides of the blanket. Make sure that each of the strips are 1 in (2.5 cm) longer than each of the blanket's edges. Fold over each of the edges of the strips by 0.5 in (1.3 cm). If you are making your own binding, then fold the fabric over at the edges by 0.5 in (1.3 cm) and iron along the folded edges to crease them. Make sure to do this for the short edges as well so that they will not have any raw edges. If you are using pre-cut blanket binding, then the edges may already be creased. Make sure that the raw edges are tucked under so that they will be hidden when you apply the binding to the edges of the blanket. Wrap a strip around the edge of the blanket and pin it into place. Place the binding over the outer edge of 1 side of the blanket. Make sure that the raw edges of the binding are tucked under and there is an equal amount of fabric on both sides of the blanket edge. Place pins about 2 to 3 in (5.1 to 7.6 cm) apart along the binding.Make sure that the pins go all the way through the blanket fabric and binding on both sides. Sew along the edges of the binding strips with a wide zigzag stitch. Start sewing at 1 end of the binding strip with the needle directly above the folded edge of the binding. Then, sew all the way down the strip to secure it in place.Select the zigzag stitch setting on your sewing machine and increase the stitch width to the highest number setting on your machine. Repeat for the rest of the strips. Continue to sew down the length of each of the strips to secure them in place on the edges of your blanket. When you reach each end, turn the blanket by 90 degrees and start sewing the next binding strip without cutting the thread.After you have secured the last piece of binding, cut the excess threads. Your blanket is now complete!",
    "sentences": [
        " Calculating Blanket Weight and Choosing Materials Use current weight if the blanket is for a child or ideal weight if it's for an adult.",
        "Find out what the child weighs to begin calculating the ideal weight for their blanket.",
        "If the recipient will be an adult, use their height and consult a weight range chart to determine their ideal body weight.For example, if a child weighs 48 pounds (22 kg), then this should be your starting point.",
        "If the adult is 69 in (180 cm), then their ideal body weight is between 128 and 168 pounds (58 and 76 kg).",
        "Use a number somewhere in the middle to do your blanket calculations, such as 148 pounds (67 kg).",
        "Use an online calculator to find the ideal body weight or weight range for an adult, such as https://www.calculator.net/ideal-weight-calculator.html\n\nYour child can continue to use the blanket as long as they are within 5 to 10 pounds (2.3 to 4.5 kg) of the weight of the blanket.",
        "The amount of time a child can use the blanket will depend on the age of your child and how quickly they are growing, which may vary greatly.",
        "They may be able to use the blanket for just a few months, or up to a year or 2.",
        "Adults can use the blanket for much longer.",
        "Multiply the weight by 0.10 to find out how much the blanket should weigh.",
        "Once you have determined the weight, multiply this number by 0.10.",
        "This will give you the amount for 10% of the person's weight.",
        "It is especially important to avoid making the blanket too heavy for a child.",
        "Err on the side of caution by sticking with 10% to calculate the weight of the blanket.If an adult's ideal body weight is 148 pounds (67 kg), then you could make your blanket 14.8 pounds (6.7 kg).",
        "Purchase the required amount of poly pellets for your blanket.",
        "Poly pellets are small plastic pellets meant for crafting.",
        "They are available at craft supply stores in packages with the weight clearly marked on them.",
        "Check the weight on the package and purchase the number of packages you will need.",
        "For example, if the poly pellets come in 5 lb (2.3 kg) packages and you want to make a weighted blanket that is 14.8 pounds (6.7 kg), then you will need 3 packages of poly pellets.",
        "Convert the desired weight of the blanket into 0.5 oz (14 g) amounts.",
        "Use a digital scale to measure out the amount of poly pellets you will need and then scoop them out into a container or large plastic bag using an 8 oz (230 g) measure.",
        "Count the number of cups as you do so.",
        "Then, multiply the total number of 8 oz (230 g) cups by 16 (total number of 0.5 oz (14 g) amounts in a cup) to find the number of 0.5 oz (14 g) amounts you will need to put into each section of the blanket.For example, if you need 14.8 pounds (6.7 kg) of poly pellets to achieve the desired blanket weight, then divide this amount in ounces (236.8 oz (6,710 g)) into 8 oz (230 g) amounts, which equals 29.6 (about 30).",
        "If the total number of 8 oz (230 g) amounts is 30, then multiply 30 by 16 for a total of 480 0.5 oz (14 g) amounts.",
        "Converting the total amount of poly pellets into 0.5 oz (14 g) amounts will make it easier to distribute the pellets evenly.",
        "Weigh out the amounts with a digital scale and place the required amount into each section of the blanket.",
        "Select enough durable fabric to make the desired size blanket.",
        "You will need 2 equally-sized pieces to make your blanket.",
        "Opt for a fabric that is lightweight for a blanket that the person can use during warm weather, such as cotton or broadcloth.",
        "If you want to make a warm blanket for the person to use during cold weather, choose flannel or fleece.",
        "Purchase enough fabric to make the blanket in the desired dimensions plus 1 in (2.5 cm) added to the length and width for the seam allowance.",
        "Some suggested blanket sizes include:\nYoung child: 42 by 48 inches (110 by 120 cm)\nOlder child, teen, or adult: 48 by 60 inches (120 by 150 cm)\nLap blanket: 36 by 48 inches (91 by 122 cm) Securing the Fabric Pieces Together Align and pin the fabric pieces with the right (print) sides facing each other.",
        "Cut your fabric pieces so that they are the desired dimensions for your blanket including 1 in (2.5 cm) added to the length and width for the seam allowance.",
        "Then, place them together so that the right sides are facing each other.",
        "Pin along 3 of the edges.Place pins about 2 to 3 inches (5.1 to 7.6 cm) apart to secure the edges.",
        "Insert the pins so that they are perpendicular to the raw edges of the blanket.",
        "Sew 0.5 in (1.3 cm) from each of the pinned edges.",
        "Select the straight stitch setting on your sewing machine.",
        "Begin sewing at the corner of 1 of the pinned and unpinned edges.",
        "Then, sew all the way around the pinned edges of the blanket.",
        "Make sure to leave 1 of the edges of the blanket open.",
        "This is essential to put the poly pellets into the blanket.",
        "Remove the pins as you sew.",
        "Make sure not to sew over the pins since this may damage your sewing machine.",
        "Turn the blanket right side out.",
        "After you have sewn 3 sides of the blanket, invert the blanket so that the right sides will be on the outside.",
        "Push out the fabric around the inner corners of the blanket as needed.",
        "If the corners seem bulky, you can snip a notch into the fabric at the corner to make it easier to push them out.",
        "Make sure not to cut into the seam.",
        "Make sure that you have removed every single pin before you continue working on the blanket!",
        "Measuring and Marking the Blanket Sections Mark every 4 in (10 cm) on the open edge and 1 adjacent edge.",
        "Measure along the open edge of the blanket and use chalk to make a mark every 4 in (10 cm) along this edge.",
        "Then, do the same thing along 1 of the adjacent edges of the blanket.After you sew over these lines, you will be placing poly pellets into the blanket in 4 by 4 in (10 by 10 cm) sections so that the weight will be evenly distributed.",
        "Dividing the blanket into a grid will make it easier to do that.",
        "Make sure that 1.5 the total size of the blanket is divisible by 4 in (10 cm).",
        "Multiply the number of columns on 1 side by the number on the other side.",
        "Multiply the total number of columns on the open edge of the blanket by the total number of columns on the adjacent edge.",
        "A column is the space between each of the marks along the edge, plus the 2 end sections.",
        "Count the spaces between the markings and end seams to find the total for 1 side, then do the same for the other side.",
        "Multiply these 2 numbers.For example, if you have 10 columns on 1 side and 12 columns on the other side, then your total number of squares would be 120.",
        "Divide the total number of squares by the total 0.5 oz (14 g) amounts.",
        "Once you have your total number of squares and 0.5 oz (14 g) amounts, you can do the final calculation to figure out how many 0.5 oz (14 g) amounts of pellets to put into each square.",
        "Divide the total number of squares for the blanket by the total number of 0.5 oz (14 g) amounts that are needed to achieve the desired weight.For example, if you have determined that you need 480 0.5 oz (14 g) amounts in a blanket with 120 squares, then you will need to add 4 oz (110 g) of poly pellets to each square.",
        "Filling and Sewing the Blanket Sew across the lines running down from the open end of the blanket.",
        "Sew a straight stitch down each of the lines you have marked along the open edge.",
        "This will ensure that the opening of the columns will be along the open edge of the blanket and you can pour the poly pellets into the columns.All of the lines you sew should be parallel to each other.",
        "Do not sew across any of the other lines you have drawn on the fabric yet!",
        "Place poly pellets into each of the columns and shake them down.",
        "Measure out the number of pellets you need for each square and pour this amount of pellets into each of the columns.For example, if you have determined that each of the squares should have 4 oz (110 g) of pellets, then pour 4 oz (110 g) of pellets into the open end of each of the columns.",
        "Sew across the columns to secure the poly squares.",
        "Use 1 of the lines you made on the edge of your blanket as a guide and sew across the columns in a straight line.",
        "Make sure that the poly pellets are at the bottom of the columns so that you will not sew over them.Hold the blanket at the open end and give the blanket a shake before you start sewing.",
        "Then place the blanket so that the part of the columns with poly pellets in them will be hanging over the outer edge of your sewing machine as you sew.",
        "Continue to fill columns and sew across the blanket.",
        "Repeat this process until you have distributed the required amount of pellets to achieve the desired weight.",
        "Continue to fill the columns with poly pellets, shake them down to the bottom of the columns, and sew across the columns to secure them.This will get harder as you continue to expand the size of the blanket.",
        "Be very careful not to let the poly pellets come out the open end of the blanket.",
        "Finish the blanket's final edge with a folded seam.",
        "When you get to the last row, fold over 0.5 in (1.3 cm) of the edge of the blanket so that the raw edge is on the back or underside of the blanket.",
        "Then, sew across the fabric about 0.25 in (0.64 cm) from the fold to secure the edge of the blanket.",
        "Another option for finishing the blanket is to serge the edges.",
        "If you have a serger, you can simply sew over the edges of the blanket all the way around the edges for a simple finish.",
        "Adding a Soft Border for Extra Comfort Choose a satiny or soft fabric to go around the edges of the blanket.",
        "You can purchase satin blanket binding to cover the edges of your blanket or choose another type of fabric to use for the binding.",
        "You will need enough to go all the way around your blanket, so make sure that you know the total length of the perimeter before you buy your fabric.You can purchase blanket binding that is already in the required dimensions for covering the edges of your blanket.",
        "You can a 3 in (7.6 cm) wide strip for each of the 4 sides of the blanket.",
        "Make sure that each of the strips are 1 in (2.5 cm) longer than each of the blanket's edges.",
        "Fold over each of the edges of the strips by 0.5 in (1.3 cm).",
        "If you are making your own binding, then fold the fabric over at the edges by 0.5 in (1.3 cm) and iron along the folded edges to crease them.",
        "Make sure to do this for the short edges as well so that they will not have any raw edges.",
        "If you are using pre-cut blanket binding, then the edges may already be creased.",
        "Make sure that the raw edges are tucked under so that they will be hidden when you apply the binding to the edges of the blanket.",
        "Wrap a strip around the edge of the blanket and pin it into place.",
        "Place the binding over the outer edge of 1 side of the blanket.",
        "Make sure that the raw edges of the binding are tucked under and there is an equal amount of fabric on both sides of the blanket edge.",
        "Place pins about 2 to 3 in (5.1 to 7.6 cm) apart along the binding.Make sure that the pins go all the way through the blanket fabric and binding on both sides.",
        "Sew along the edges of the binding strips with a wide zigzag stitch.",
        "Start sewing at 1 end of the binding strip with the needle directly above the folded edge of the binding.",
        "Then, sew all the way down the strip to secure it in place.Select the zigzag stitch setting on your sewing machine and increase the stitch width to the highest number setting on your machine.",
        "Repeat for the rest of the strips.",
        "Continue to sew down the length of each of the strips to secure them in place on the edges of your blanket.",
        "When you reach each end, turn the blanket by 90 degrees and start sewing the next binding strip without cutting the thread.After you have secured the last piece of binding, cut the excess threads.",
        "Your blanket is now complete!"
    ]
}