{
    "title": "How to Splice Wire",
    "url": "https://www.wikihow.com/Splice-Wire",
    "category_hierarchy": [
        "Computers and Electronics",
        "Hardware",
        "Cabling and Wiring Connection"
    ],
    "methods": [
        {
            "name": "Stripping Wires before Splicing Them",
            "steps": [
                {
                    "headline": "Disconnect power from the wires.",
                    "description": "Unplug the device that you’re splicing wires to if you can. If the wire is in the wall or can’t be unplugged, turn off the circuit leading to the area so you don’t get shocked while working. If you can’t disconnect the power, do not attempt to splice the wire or else you could get electrocuted."
                },
                {
                    "headline": "Strip back 1 in (2.5 cm) of each wire’s insulation.",
                    "description": "Pick a hole on the wire stripper that’s 1-2 sizes smaller than your wire. Clamp the wire in the hole and pull the stripper towards the end to completely remove the insulation. Repeat the process on the other piece of wire. Wire strippers can be bought at your local hardware store. If you are using uninsulated wire, you can skip this step."
                },
                {
                    "headline": "Slide a 3 in (7.6 cm) piece of shrink tube onto one of the wires.",
                    "description": "Shrink tube is made from plastic that gets smaller when it’s heated. Slide a piece of the shrink tube on your wire before you splice them so you can easily slide it into place once you’re finished. You don’t need to use shrink tube if you’re splicing with a wire cap. Shrink tube can be purchased in the electrical department of your local hardware store.Tip: Shrink tube comes in multiple different colors. Find a color that matches the current insulation on your wire if you want them to look nice when you’re finished."
                }
            ]
        },
        {
            "name": "Using a Twist-On Wire Cap",
            "steps": [
                {
                    "headline": "Hold the wire ends so they’re touching one another.",
                    "description": "Press the exposed ends of the wires together so they’re right next to each other. Don’t twist or coil the wires together or else they won’t stay as secure in the wire cap."
                },
                {
                    "headline": "Twist a wire cap clockwise onto the exposed wires.",
                    "description": "Set a wire cap on top of the exposed wires and start twisting it on with your fingers. Turn it clockwise for about 5 seconds so the wires wrap and coil inside of the cap. Lightly tug on the wires to see if they stay in place. If not, tighten the wire cap more. Wire caps can be purchased from your local home improvement or hardware store. Strip off more insulation if you need to keep twisting the wire.Tip: You can easily remove wire caps by turning them counterclockwise. Take the wire caps off if you need to change the wires or how they’re connected."
                },
                {
                    "headline": "Layer electrical tape around the wire cap and exposed wires.",
                    "description": "Wrap black electrical tape around the bottom of the wire cap so it’s completely covered. Overlap each layer of tape by half so there’s no chance for exposed wiring. Use a pair of scissors or a utility knife to cut the tape when you’re finished. If you’re working on multiple wiring projects, use different colors of electric tape to mark which wires are connected."
                }
            ]
        },
        {
            "name": "Installing a Butt Splice",
            "steps": [
                {
                    "headline": "Slide 1 of the exposed wires into the end of your butt splice.",
                    "description": "Butt splices are small tubes with openings on each end to insert wires. Take one of your wires and place it in the center of the butt splice. Push the exposed end until it’s in the middle of the splice. Butt splices can be bought at your local hardware store in the electrical department."
                },
                {
                    "headline": "Use a wire crimper one-quarter of the way in from the end of the splice.",
                    "description": "Match the crimper hole to the size of your butt splice. Place the jaws of the crimper ⁄4–⁄2 in (0.64–1.27 cm) from the edge of the butt splice. Squeeze the crimper handles all the way so the wire is held in place. Don’t use a hole that’s too small or else you may cut through your wire. Many wire strippers have a crimper built into them so you don’t have to get multiple tools.Tip: Use a slightly larger crimper hole on the end of the butt splice to secure it tighter to the insulation."
                },
                {
                    "headline": "Put the second wire in the other side of the splice and crimp it.",
                    "description": "Repeat the process on the other side of the butt splice. When you insert the second wire, make sure it touches the first one inside of the splice. Use your crimper to secure the second wire in place. Some butt splices are see-through in the center so you can tell when the wires are touching one another."
                },
                {
                    "headline": "Slide the shrink tube over the butt splice.",
                    "description": "Take the shrink tube from one of your wires and completely cover the butt splice. If the shrink tube is too loose or falls off of the butt splice, crimp it in place. If you forgot to use shrink tube before you spliced your wires, you can wrap the entire splice and any exposed wires with electrical tape."
                },
                {
                    "headline": "Heat the shrink tube with a heat gun.",
                    "description": "Turn on your heat gun and point the nozzle toward the shrink tubing. Rotate the wire in your hands so the tube shrinks evenly around the splice to insulate the wires. If you don’t have access to a heat gun, you can use a small torch or a lighter to heat the tubing. Don’t let the flame touch the wire or tubing so it doesn’t melt."
                }
            ]
        },
        {
            "name": "Making a Lineman’s Splice",
            "steps": [
                {
                    "headline": "Form a 90-degree angle with each of the exposed wires.",
                    "description": "Bend each of the wires with your fingers or needle-nose pliers into L-shapes. Make sure each side of the angle measures ⁄2 inch (1.3 cm) long so you have space to wrap the wires."
                },
                {
                    "headline": "Hook the wires together so the corners are touching.",
                    "description": "Set one wire onto the other so one L-shape is upside down and the other is rightside up. Make sure the corners of the wires are touching one another before moving on."
                },
                {
                    "headline": "Coil the end of the upright wire around the wire perpendicular to it.",
                    "description": "Wrap the end of the wire that’s pointing up around the straight piece of the other wire. Make sure the wrap is tight so the wires make a solid connection with one another. Aim to get at least 3 coils around the other wire if you can. Repeat the process on the other side. Use needle-nose pliers if you have trouble coiling the wire with your fingers."
                },
                {
                    "headline": "Solder the coils together to hold them in place.",
                    "description": "Heat up your soldering iron and hold it near your wire coils with your dominant hand. Hold a rod of silver solder with your non-dominant hand next to the tip of your soldering iron. Melt the silver onto your coils so it drips between your wires and coats your entire splice. Avoid touching the end of your soldering iron with your bare hands or else you’ll get burned. Line your work surface with paper towel or scrap wood to protect against any accidental drips."
                },
                {
                    "headline": "Move the shrink tube over the soldered wires.",
                    "description": "Slide the tube over the entire splice so none of the wires are exposed to the outside. Crimp the tube in place if it moves around easily. Wrap electrical tape around the coils if you don’t have any shrink tube."
                },
                {
                    "headline": "Heat the shrink tube with a heat gun until it’s tight.",
                    "description": "Turn on your heat gun and point it toward the shrink tube. Spin the wire in your hand to evenly heat the tube so it shrinks around the coils. Continue heating the shrink tube until it’s tight against the wire insulation. Use a lighter or torch to heat the tube if you don’t have a heat gun."
                }
            ]
        }
    ],
    "tyn": [
        "Getting the Wires Ready",
        "Wire stripper",
        "Shrink tube",
        "Using a Twist-On Wire Cap",
        "Wire cap",
        "Electrical tape",
        "Installing a Butt Splice",
        "Butt splice",
        "Wire crimper",
        "Heat gun",
        "Making a Lineman’s Splice",
        "Soldering iron"
    ],
    "text": " Stripping Wires before Splicing Them Disconnect power from the wires. Unplug the device that you’re splicing wires to if you can. If the wire is in the wall or can’t be unplugged, turn off the circuit leading to the area so you don’t get shocked while working. If you can’t disconnect the power, do not attempt to splice the wire or else you could get electrocuted. Strip back 1 in (2.5 cm) of each wire’s insulation. Pick a hole on the wire stripper that’s 1-2 sizes smaller than your wire. Clamp the wire in the hole and pull the stripper towards the end to completely remove the insulation. Repeat the process on the other piece of wire. Wire strippers can be bought at your local hardware store. If you are using uninsulated wire, you can skip this step. Slide a 3 in (7.6 cm) piece of shrink tube onto one of the wires. Shrink tube is made from plastic that gets smaller when it’s heated. Slide a piece of the shrink tube on your wire before you splice them so you can easily slide it into place once you’re finished. You don’t need to use shrink tube if you’re splicing with a wire cap. Shrink tube can be purchased in the electrical department of your local hardware store.Tip: Shrink tube comes in multiple different colors. Find a color that matches the current insulation on your wire if you want them to look nice when you’re finished. Using a Twist-On Wire Cap Hold the wire ends so they’re touching one another. Press the exposed ends of the wires together so they’re right next to each other. Don’t twist or coil the wires together or else they won’t stay as secure in the wire cap. Twist a wire cap clockwise onto the exposed wires. Set a wire cap on top of the exposed wires and start twisting it on with your fingers. Turn it clockwise for about 5 seconds so the wires wrap and coil inside of the cap. Lightly tug on the wires to see if they stay in place. If not, tighten the wire cap more. Wire caps can be purchased from your local home improvement or hardware store. Strip off more insulation if you need to keep twisting the wire.Tip: You can easily remove wire caps by turning them counterclockwise. Take the wire caps off if you need to change the wires or how they’re connected. Layer electrical tape around the wire cap and exposed wires. Wrap black electrical tape around the bottom of the wire cap so it’s completely covered. Overlap each layer of tape by half so there’s no chance for exposed wiring. Use a pair of scissors or a utility knife to cut the tape when you’re finished. If you’re working on multiple wiring projects, use different colors of electric tape to mark which wires are connected. Installing a Butt Splice Slide 1 of the exposed wires into the end of your butt splice. Butt splices are small tubes with openings on each end to insert wires. Take one of your wires and place it in the center of the butt splice. Push the exposed end until it’s in the middle of the splice. Butt splices can be bought at your local hardware store in the electrical department. Use a wire crimper one-quarter of the way in from the end of the splice. Match the crimper hole to the size of your butt splice. Place the jaws of the crimper ⁄4–⁄2 in (0.64–1.27 cm) from the edge of the butt splice. Squeeze the crimper handles all the way so the wire is held in place. Don’t use a hole that’s too small or else you may cut through your wire. Many wire strippers have a crimper built into them so you don’t have to get multiple tools.Tip: Use a slightly larger crimper hole on the end of the butt splice to secure it tighter to the insulation. Put the second wire in the other side of the splice and crimp it. Repeat the process on the other side of the butt splice. When you insert the second wire, make sure it touches the first one inside of the splice. Use your crimper to secure the second wire in place. Some butt splices are see-through in the center so you can tell when the wires are touching one another. Slide the shrink tube over the butt splice. Take the shrink tube from one of your wires and completely cover the butt splice. If the shrink tube is too loose or falls off of the butt splice, crimp it in place. If you forgot to use shrink tube before you spliced your wires, you can wrap the entire splice and any exposed wires with electrical tape. Heat the shrink tube with a heat gun. Turn on your heat gun and point the nozzle toward the shrink tubing. Rotate the wire in your hands so the tube shrinks evenly around the splice to insulate the wires. If you don’t have access to a heat gun, you can use a small torch or a lighter to heat the tubing. Don’t let the flame touch the wire or tubing so it doesn’t melt. Making a Lineman’s Splice Form a 90-degree angle with each of the exposed wires. Bend each of the wires with your fingers or needle-nose pliers into L-shapes. Make sure each side of the angle measures ⁄2 inch (1.3 cm) long so you have space to wrap the wires. Hook the wires together so the corners are touching. Set one wire onto the other so one L-shape is upside down and the other is rightside up. Make sure the corners of the wires are touching one another before moving on. Coil the end of the upright wire around the wire perpendicular to it. Wrap the end of the wire that’s pointing up around the straight piece of the other wire. Make sure the wrap is tight so the wires make a solid connection with one another. Aim to get at least 3 coils around the other wire if you can. Repeat the process on the other side. Use needle-nose pliers if you have trouble coiling the wire with your fingers. Solder the coils together to hold them in place. Heat up your soldering iron and hold it near your wire coils with your dominant hand. Hold a rod of silver solder with your non-dominant hand next to the tip of your soldering iron. Melt the silver onto your coils so it drips between your wires and coats your entire splice. Avoid touching the end of your soldering iron with your bare hands or else you’ll get burned. Line your work surface with paper towel or scrap wood to protect against any accidental drips. Move the shrink tube over the soldered wires. Slide the tube over the entire splice so none of the wires are exposed to the outside. Crimp the tube in place if it moves around easily. Wrap electrical tape around the coils if you don’t have any shrink tube. Heat the shrink tube with a heat gun until it’s tight. Turn on your heat gun and point it toward the shrink tube. Spin the wire in your hand to evenly heat the tube so it shrinks around the coils. Continue heating the shrink tube until it’s tight against the wire insulation. Use a lighter or torch to heat the tube if you don’t have a heat gun.",
    "sentences": [
        " Stripping Wires before Splicing Them Disconnect power from the wires.",
        "Unplug the device that you’re splicing wires to if you can.",
        "If the wire is in the wall or can’t be unplugged, turn off the circuit leading to the area so you don’t get shocked while working.",
        "If you can’t disconnect the power, do not attempt to splice the wire or else you could get electrocuted.",
        "Strip back 1 in (2.5 cm) of each wire’s insulation.",
        "Pick a hole on the wire stripper that’s 1-2 sizes smaller than your wire.",
        "Clamp the wire in the hole and pull the stripper towards the end to completely remove the insulation.",
        "Repeat the process on the other piece of wire.",
        "Wire strippers can be bought at your local hardware store.",
        "If you are using uninsulated wire, you can skip this step.",
        "Slide a 3 in (7.6 cm) piece of shrink tube onto one of the wires.",
        "Shrink tube is made from plastic that gets smaller when it’s heated.",
        "Slide a piece of the shrink tube on your wire before you splice them so you can easily slide it into place once you’re finished.",
        "You don’t need to use shrink tube if you’re splicing with a wire cap.",
        "Shrink tube can be purchased in the electrical department of your local hardware store.Tip: Shrink tube comes in multiple different colors.",
        "Find a color that matches the current insulation on your wire if you want them to look nice when you’re finished.",
        "Using a Twist-On Wire Cap Hold the wire ends so they’re touching one another.",
        "Press the exposed ends of the wires together so they’re right next to each other.",
        "Don’t twist or coil the wires together or else they won’t stay as secure in the wire cap.",
        "Twist a wire cap clockwise onto the exposed wires.",
        "Set a wire cap on top of the exposed wires and start twisting it on with your fingers.",
        "Turn it clockwise for about 5 seconds so the wires wrap and coil inside of the cap.",
        "Lightly tug on the wires to see if they stay in place.",
        "If not, tighten the wire cap more.",
        "Wire caps can be purchased from your local home improvement or hardware store.",
        "Strip off more insulation if you need to keep twisting the wire.Tip: You can easily remove wire caps by turning them counterclockwise.",
        "Take the wire caps off if you need to change the wires or how they’re connected.",
        "Layer electrical tape around the wire cap and exposed wires.",
        "Wrap black electrical tape around the bottom of the wire cap so it’s completely covered.",
        "Overlap each layer of tape by half so there’s no chance for exposed wiring.",
        "Use a pair of scissors or a utility knife to cut the tape when you’re finished.",
        "If you’re working on multiple wiring projects, use different colors of electric tape to mark which wires are connected.",
        "Installing a Butt Splice Slide 1 of the exposed wires into the end of your butt splice.",
        "Butt splices are small tubes with openings on each end to insert wires.",
        "Take one of your wires and place it in the center of the butt splice.",
        "Push the exposed end until it’s in the middle of the splice.",
        "Butt splices can be bought at your local hardware store in the electrical department.",
        "Use a wire crimper one-quarter of the way in from the end of the splice.",
        "Match the crimper hole to the size of your butt splice.",
        "Place the jaws of the crimper ⁄4–⁄2 in (0.64–1.27 cm) from the edge of the butt splice.",
        "Squeeze the crimper handles all the way so the wire is held in place.",
        "Don’t use a hole that’s too small or else you may cut through your wire.",
        "Many wire strippers have a crimper built into them so you don’t have to get multiple tools.Tip: Use a slightly larger crimper hole on the end of the butt splice to secure it tighter to the insulation.",
        "Put the second wire in the other side of the splice and crimp it.",
        "Repeat the process on the other side of the butt splice.",
        "When you insert the second wire, make sure it touches the first one inside of the splice.",
        "Use your crimper to secure the second wire in place.",
        "Some butt splices are see-through in the center so you can tell when the wires are touching one another.",
        "Slide the shrink tube over the butt splice.",
        "Take the shrink tube from one of your wires and completely cover the butt splice.",
        "If the shrink tube is too loose or falls off of the butt splice, crimp it in place.",
        "If you forgot to use shrink tube before you spliced your wires, you can wrap the entire splice and any exposed wires with electrical tape.",
        "Heat the shrink tube with a heat gun.",
        "Turn on your heat gun and point the nozzle toward the shrink tubing.",
        "Rotate the wire in your hands so the tube shrinks evenly around the splice to insulate the wires.",
        "If you don’t have access to a heat gun, you can use a small torch or a lighter to heat the tubing.",
        "Don’t let the flame touch the wire or tubing so it doesn’t melt.",
        "Making a Lineman’s Splice Form a 90-degree angle with each of the exposed wires.",
        "Bend each of the wires with your fingers or needle-nose pliers into L-shapes.",
        "Make sure each side of the angle measures ⁄2 inch (1.3 cm) long so you have space to wrap the wires.",
        "Hook the wires together so the corners are touching.",
        "Set one wire onto the other so one L-shape is upside down and the other is rightside up.",
        "Make sure the corners of the wires are touching one another before moving on.",
        "Coil the end of the upright wire around the wire perpendicular to it.",
        "Wrap the end of the wire that’s pointing up around the straight piece of the other wire.",
        "Make sure the wrap is tight so the wires make a solid connection with one another.",
        "Aim to get at least 3 coils around the other wire if you can.",
        "Repeat the process on the other side.",
        "Use needle-nose pliers if you have trouble coiling the wire with your fingers.",
        "Solder the coils together to hold them in place.",
        "Heat up your soldering iron and hold it near your wire coils with your dominant hand.",
        "Hold a rod of silver solder with your non-dominant hand next to the tip of your soldering iron.",
        "Melt the silver onto your coils so it drips between your wires and coats your entire splice.",
        "Avoid touching the end of your soldering iron with your bare hands or else you’ll get burned.",
        "Line your work surface with paper towel or scrap wood to protect against any accidental drips.",
        "Move the shrink tube over the soldered wires.",
        "Slide the tube over the entire splice so none of the wires are exposed to the outside.",
        "Crimp the tube in place if it moves around easily.",
        "Wrap electrical tape around the coils if you don’t have any shrink tube.",
        "Heat the shrink tube with a heat gun until it’s tight.",
        "Turn on your heat gun and point it toward the shrink tube.",
        "Spin the wire in your hand to evenly heat the tube so it shrinks around the coils.",
        "Continue heating the shrink tube until it’s tight against the wire insulation.",
        "Use a lighter or torch to heat the tube if you don’t have a heat gun."
    ]
}