{
    "title": "How to Make Cinnamon Sugar",
    "url": "https://www.wikihow.com/Make-Cinnamon-Sugar",
    "category_hierarchy": [
        "Food and Entertaining",
        "Herbs and Spices"
    ],
    "methods": [
        {
            "name": "Cinnamon Sugar",
            "steps": [
                {
                    "headline": "Measure out sugar and cinnamon in a 4:1 ratio.",
                    "description": "Measure 1 cup (196 g) of granulated white sugar and 1/4 cup (36 g) of ground cinnamon. For a smaller amount of cinnamon sugar, simply reduce the amounts but keep the same ratio. Some cinnamon is stronger than others, so you can add or subtract cinnamon to taste if you need to."
                },
                {
                    "headline": "Mix the cinnamon and sugar together thoroughly in a small bowl.",
                    "description": "Use a fork to stir the cinnamon and sugar together. Stir until the mix has a uniform color and consistency. Taste the blend to see if you need to adjust the amount of cinnamon."
                },
                {
                    "headline": "Add the cinnamon sugar mixture to a variety of desserts and meals.",
                    "description": "Use it to make sweet breakfast foods like cinnamon sugar toast or cinnamon rolls. Sprinkle it on top of belgian waffles. You can also use the blend as a sweetener for tea or coffee."
                },
                {
                    "headline": "Store any leftover mixture in an airtight container at room temperature.",
                    "description": "Put the cinnamon sugar in a clean jar or container with a lid. Make sure that no moisture or air will get in and the mixture will last forever. Mason jars are great for storing spices!"
                }
            ]
        },
        {
            "name": "Cinnamon Sugar Butter",
            "steps": [
                {
                    "headline": "Combine sugar, cinnamon, and butter in a small bowl.",
                    "description": "Measure out 1 tbsp (14 g) of unsalted butter, 1 tbsp (12.5 g) of granulated white sugar, and 1 tsp (2 g) of ground cinnamon into a bowl. Use unsalted butter. You can make the cinnamon sugar ahead of time to add to butter whenever you want."
                },
                {
                    "headline": "Cream the mixture together with a spoon or spatula.",
                    "description": "Mash and stir the sugar and cinnamon into the butter until it is evenly distributed. Stop mixing when the butter is an even color and consistency. If the butter is too hard, let it sit at room temperature for a bit until it softens up."
                },
                {
                    "headline": "Use the butter right away or store it in the fridge to use later.",
                    "description": "Put the butter on toast, pancakes, waffles, or any other food of your choosing. Make a large batch and store it in a container in the refrigerator. You can use a butter substitute if you are vegan or don't eat dairy. Refer to the expiration date of the butter you used to get an idea of how long the cinnamon sugar butter will last. In general, butter will last for about 6-9 months in the fridge."
                }
            ]
        }
    ],
    "tyn": [
        "Cinnamon Sugar",
        "Measuring cup",
        "Small bowl",
        "Fork",
        "Airtight container",
        "Cinnamon Sugar Butter",
        "Measuring spoons",
        "Spoon or spatula",
        "Container"
    ],
    "text": " Cinnamon Sugar Measure out sugar and cinnamon in a 4:1 ratio. Measure 1 cup (196 g) of granulated white sugar and 1/4 cup (36 g) of ground cinnamon. For a smaller amount of cinnamon sugar, simply reduce the amounts but keep the same ratio. Some cinnamon is stronger than others, so you can add or subtract cinnamon to taste if you need to. Mix the cinnamon and sugar together thoroughly in a small bowl. Use a fork to stir the cinnamon and sugar together. Stir until the mix has a uniform color and consistency. Taste the blend to see if you need to adjust the amount of cinnamon. Add the cinnamon sugar mixture to a variety of desserts and meals. Use it to make sweet breakfast foods like cinnamon sugar toast or cinnamon rolls. Sprinkle it on top of belgian waffles. You can also use the blend as a sweetener for tea or coffee. Store any leftover mixture in an airtight container at room temperature. Put the cinnamon sugar in a clean jar or container with a lid. Make sure that no moisture or air will get in and the mixture will last forever. Mason jars are great for storing spices! Cinnamon Sugar Butter Combine sugar, cinnamon, and butter in a small bowl. Measure out 1 tbsp (14 g) of unsalted butter, 1 tbsp (12.5 g) of granulated white sugar, and 1 tsp (2 g) of ground cinnamon into a bowl. Use unsalted butter. You can make the cinnamon sugar ahead of time to add to butter whenever you want. Cream the mixture together with a spoon or spatula. Mash and stir the sugar and cinnamon into the butter until it is evenly distributed. Stop mixing when the butter is an even color and consistency. If the butter is too hard, let it sit at room temperature for a bit until it softens up. Use the butter right away or store it in the fridge to use later. Put the butter on toast, pancakes, waffles, or any other food of your choosing. Make a large batch and store it in a container in the refrigerator. You can use a butter substitute if you are vegan or don't eat dairy. Refer to the expiration date of the butter you used to get an idea of how long the cinnamon sugar butter will last. In general, butter will last for about 6-9 months in the fridge.",
    "sentences": [
        " Cinnamon Sugar Measure out sugar and cinnamon in a 4:1 ratio.",
        "Measure 1 cup (196 g) of granulated white sugar and 1/4 cup (36 g) of ground cinnamon.",
        "For a smaller amount of cinnamon sugar, simply reduce the amounts but keep the same ratio.",
        "Some cinnamon is stronger than others, so you can add or subtract cinnamon to taste if you need to.",
        "Mix the cinnamon and sugar together thoroughly in a small bowl.",
        "Use a fork to stir the cinnamon and sugar together.",
        "Stir until the mix has a uniform color and consistency.",
        "Taste the blend to see if you need to adjust the amount of cinnamon.",
        "Add the cinnamon sugar mixture to a variety of desserts and meals.",
        "Use it to make sweet breakfast foods like cinnamon sugar toast or cinnamon rolls.",
        "Sprinkle it on top of belgian waffles.",
        "You can also use the blend as a sweetener for tea or coffee.",
        "Store any leftover mixture in an airtight container at room temperature.",
        "Put the cinnamon sugar in a clean jar or container with a lid.",
        "Make sure that no moisture or air will get in and the mixture will last forever.",
        "Mason jars are great for storing spices!",
        "Cinnamon Sugar Butter Combine sugar, cinnamon, and butter in a small bowl.",
        "Measure out 1 tbsp (14 g) of unsalted butter, 1 tbsp (12.5 g) of granulated white sugar, and 1 tsp (2 g) of ground cinnamon into a bowl.",
        "Use unsalted butter.",
        "You can make the cinnamon sugar ahead of time to add to butter whenever you want.",
        "Cream the mixture together with a spoon or spatula.",
        "Mash and stir the sugar and cinnamon into the butter until it is evenly distributed.",
        "Stop mixing when the butter is an even color and consistency.",
        "If the butter is too hard, let it sit at room temperature for a bit until it softens up.",
        "Use the butter right away or store it in the fridge to use later.",
        "Put the butter on toast, pancakes, waffles, or any other food of your choosing.",
        "Make a large batch and store it in a container in the refrigerator.",
        "You can use a butter substitute if you are vegan or don't eat dairy.",
        "Refer to the expiration date of the butter you used to get an idea of how long the cinnamon sugar butter will last.",
        "In general, butter will last for about 6-9 months in the fridge."
    ]
}