{
    "title": "How to Make Hakama Pants",
    "url": "https://www.wikihow.com/Make-Hakama-Pants",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing",
        "Clothes by Type",
        "Pants and Shorts"
    ],
    "parts": [
        {
            "name": "Preparing the material",
            "steps": [
                {
                    "headline": "Choose your preferred material.",
                    "description": "Traditional male hakama pants are made from a stiff silk material, but a more modern style can be made from a medium weight cotton fabric (about the weight of bed sheeting)."
                },
                {
                    "headline": "Launder the fabric to remove any dirt or sizing.",
                    "description": "Iron smooth if the laundering process produces a wrinkled material."
                },
                {
                    "headline": "Lay the material flat and cut off any hemmed or finished edges.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making the ties",
            "steps": [
                {
                    "headline": "Cut three strips of fabric approximately 4 inches wide from the longest edge of your material.",
                    "description": "These strips will become the straps that secure the samurai pants. Each fabric strip should be long enough to go around the intended wearer's waist with 8-10\" (20-25 cm) to spare."
                },
                {
                    "headline": "Make one long strip.",
                    "description": "Sew two of the strips together along the short edges, leaving the third strip at its original length— half the length of the long strip."
                },
                {
                    "headline": "Form two tubes - one long, one short.",
                    "description": "Fold each strip in half lengthwise and pin, then sew a seam along the unfinished edges to create two tubes. Turn both tubes inside out so the seam is on the inside with the unfinished edges no longer visible, then set the tubes aside."
                }
            ]
        },
        {
            "name": "Cutting the pant legs",
            "steps": [
                {
                    "headline": "Cut the remaining fabric in half.",
                    "description": "Fold the remaining fabric in half lengthwise and carefully cut along the fold. These two pieces will form the legs of your samurai pants."
                },
                {
                    "headline": "Fold the leg pieces in half lengthwise.",
                    "description": "Then, set one on top of the other so the folded edges are facing you and the unfinished edges away from you."
                },
                {
                    "headline": "Cut an area for the crotch.",
                    "description": "Cut a half \"U\" on the folded side of both leg pieces, starting approximately 1/3 of the way down the pants. Start perpendicular to the fold and curve smoothly to form the bottom of the \"U\". When you come parallel to the fold, run along the parallel line up to the top fabric edge. The inner or middle part of the \"U\" should be facing you. Make sure to cut both leg pieces equally."
                },
                {
                    "headline": "Unfold the leg pieces and even the crotch area of each.",
                    "description": "When you unfold them, each should have a full \"U\" through the middle of the top third of each of the pant pieces. Lay the two unfolded pant pieces on top of each other. The \"U\" shapes should match. If not, make the necessary adjustments."
                }
            ]
        },
        {
            "name": "Forming the pants",
            "steps": [
                {
                    "headline": "Fasten the crotch area.",
                    "description": "Place the leg pieces on top of each other with the \"U\" in the middle. Pin and sew the pieces together along the \"U\" shape to fasten the crotch area. For security, you probably want to use a double seam here."
                },
                {
                    "headline": "Unfold the fabric.",
                    "description": "The newly sewn crotch should be in the middle with the sewn edge up and the pant legs on either side of the seam."
                },
                {
                    "headline": "Sew along the outside edges of each leg.",
                    "description": "Pinning first, begin approximately 6-8\" (15-20 cm) from the top of the pant and continue all the way to the bottom."
                },
                {
                    "headline": "Hem the top of the pants.",
                    "description": "Use closely spaced stitches and a double line of stitching."
                },
                {
                    "headline": "Turn the fabric right-side out.",
                    "description": "The sewn portions will now be on the inside of the pants."
                }
            ]
        },
        {
            "name": "Making the pleats",
            "steps": [
                {
                    "headline": "Form the front pleats.",
                    "description": "Fold and pin four evenly spaced pleats on the front top of the hakama pants with all folds facing the middle of the pants - i.e., the two folds on each side will face each other."
                },
                {
                    "headline": "Secure the front pleats.",
                    "description": "Sew a straight line across only the top front of the samurai pants, approximately 2-3\" (5-7.5 cm) from the top. Reinforce the pants by sewing a second line to make them more sturdy."
                },
                {
                    "headline": "Form the back pleats.",
                    "description": "Fold two pleats on the backside of the pants with both folds facing the middle of the pants, then pin the pleats in place."
                },
                {
                    "headline": "Secure the back pleats.",
                    "description": "Sew two straight lines along the top backside of the pants, just as you did in the front. They should be approximately 2-3\" (5-7.5 cm) from the top— the same as in the front."
                }
            ]
        },
        {
            "name": "Attaching the ties",
            "steps": [
                {
                    "headline": "Iron the tubes.",
                    "description": "Iron both the tubes so that the seams run fairly straight down the middle of one side of each tube so that they become strips."
                },
                {
                    "headline": "Finish one end of each tie strip by tucking the last inch (2.5cm) of fabric into the tube and sewing across the end, 1/2\" (1 cm) from the edge of the tube.",
                    "description": "This can be done with a sewing machine or by hand."
                },
                {
                    "headline": "Position the longer tube.",
                    "description": "Take the longer tube and place it along the front of the hakama pants, aligning the finished end of the strip with the crotch seam. This strip will be the tie that wraps around your back and continues on around to the front where you tie the pants."
                },
                {
                    "headline": "Secure the longer strip.",
                    "description": "Pin the tube/strip along the top edge of the pants with the seam down, then sew along the bottom edge of the strip. Start at the front, then continue along the backside of the hakama pants. For extra durability, sew the top length of the strip to the pants as well. Note: The seam of the tube should be hidden on the underside, against the pant fabric. Terminate the stitching with a rectangle (long edge across the width of the tie). You can stitch an \"X\" within the rectangle to build in long term durability at this strain point."
                },
                {
                    "headline": "Place and secure the shorter tube.",
                    "description": "Take the shorter tube and lay it against the backside of the hakama pants, again positioning the finished end of the tube on the crotch seam. This strip will only wrap around to the front as a tie. Sew it in place along the top and bottom edge, stopping on the side or continuing a bit onto the front. Again, terminate the stitching with an \"X\"ed rectangle."
                },
                {
                    "headline": "Trim the excess fabric from the tie strips.",
                    "description": "Remove all pins from the hakama pants and try them on. Cut the tie strips so that each extends beyond the belly button about 9-11\" (23-28 cm)."
                },
                {
                    "headline": "Finish the ends of the tie strips by tucking the last inch (2.5 cm) of fabric into the tube and sewing across the end, 1/2\" (1 cm) from the edge of the tube.",
                    "description": "Again, this can be done by hand or with a sewing machine."
                }
            ]
        },
        {
            "name": "Finishing the pants",
            "steps": [
                {
                    "headline": "Adjust the length.",
                    "description": "Try the pants on in order to fit them to your specific leg length, making sure to secure them where they will be worn. Secure the the pants by tying the tie strips in front, making sure the fit is comfortable. The ideal pant length is with the bottom hem at the malleolus, or big part of the ankle bone. Cut excess fabric from the bottom cuffs of each leg and hem them to finish your samurai hakama pant look."
                },
                {
                    "headline": "Go out in your sporty new hakama pants and wow them!",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "3 yards (2.75 m) of fabric or 1 twin size flat bed sheet",
        "Scissors (or fabric cutting wheel)",
        "Thread",
        "Sewing machine",
        "Pins"
    ],
    "text": " Preparing the material Choose your preferred material. Traditional male hakama pants are made from a stiff silk material, but a more modern style can be made from a medium weight cotton fabric (about the weight of bed sheeting). Launder the fabric to remove any dirt or sizing. Iron smooth if the laundering process produces a wrinkled material. Lay the material flat and cut off any hemmed or finished edges.  Making the ties Cut three strips of fabric approximately 4 inches wide from the longest edge of your material. These strips will become the straps that secure the samurai pants. Each fabric strip should be long enough to go around the intended wearer's waist with 8-10\" (20-25 cm) to spare. Make one long strip. Sew two of the strips together along the short edges, leaving the third strip at its original length— half the length of the long strip. Form two tubes - one long, one short. Fold each strip in half lengthwise and pin, then sew a seam along the unfinished edges to create two tubes. Turn both tubes inside out so the seam is on the inside with the unfinished edges no longer visible, then set the tubes aside. Cutting the pant legs Cut the remaining fabric in half. Fold the remaining fabric in half lengthwise and carefully cut along the fold. These two pieces will form the legs of your samurai pants. Fold the leg pieces in half lengthwise. Then, set one on top of the other so the folded edges are facing you and the unfinished edges away from you. Cut an area for the crotch. Cut a half \"U\" on the folded side of both leg pieces, starting approximately 1/3 of the way down the pants. Start perpendicular to the fold and curve smoothly to form the bottom of the \"U\". When you come parallel to the fold, run along the parallel line up to the top fabric edge. The inner or middle part of the \"U\" should be facing you. Make sure to cut both leg pieces equally. Unfold the leg pieces and even the crotch area of each. When you unfold them, each should have a full \"U\" through the middle of the top third of each of the pant pieces. Lay the two unfolded pant pieces on top of each other. The \"U\" shapes should match. If not, make the necessary adjustments. Forming the pants Fasten the crotch area. Place the leg pieces on top of each other with the \"U\" in the middle. Pin and sew the pieces together along the \"U\" shape to fasten the crotch area. For security, you probably want to use a double seam here. Unfold the fabric. The newly sewn crotch should be in the middle with the sewn edge up and the pant legs on either side of the seam. Sew along the outside edges of each leg. Pinning first, begin approximately 6-8\" (15-20 cm) from the top of the pant and continue all the way to the bottom. Hem the top of the pants. Use closely spaced stitches and a double line of stitching. Turn the fabric right-side out. The sewn portions will now be on the inside of the pants. Making the pleats Form the front pleats. Fold and pin four evenly spaced pleats on the front top of the hakama pants with all folds facing the middle of the pants - i.e., the two folds on each side will face each other. Secure the front pleats. Sew a straight line across only the top front of the samurai pants, approximately 2-3\" (5-7.5 cm) from the top. Reinforce the pants by sewing a second line to make them more sturdy. Form the back pleats. Fold two pleats on the backside of the pants with both folds facing the middle of the pants, then pin the pleats in place. Secure the back pleats. Sew two straight lines along the top backside of the pants, just as you did in the front. They should be approximately 2-3\" (5-7.5 cm) from the top— the same as in the front. Attaching the ties Iron the tubes. Iron both the tubes so that the seams run fairly straight down the middle of one side of each tube so that they become strips. Finish one end of each tie strip by tucking the last inch (2.5cm) of fabric into the tube and sewing across the end, 1/2\" (1 cm) from the edge of the tube. This can be done with a sewing machine or by hand. Position the longer tube. Take the longer tube and place it along the front of the hakama pants, aligning the finished end of the strip with the crotch seam. This strip will be the tie that wraps around your back and continues on around to the front where you tie the pants. Secure the longer strip. Pin the tube/strip along the top edge of the pants with the seam down, then sew along the bottom edge of the strip. Start at the front, then continue along the backside of the hakama pants. For extra durability, sew the top length of the strip to the pants as well. Note: The seam of the tube should be hidden on the underside, against the pant fabric. Terminate the stitching with a rectangle (long edge across the width of the tie). You can stitch an \"X\" within the rectangle to build in long term durability at this strain point. Place and secure the shorter tube. Take the shorter tube and lay it against the backside of the hakama pants, again positioning the finished end of the tube on the crotch seam. This strip will only wrap around to the front as a tie. Sew it in place along the top and bottom edge, stopping on the side or continuing a bit onto the front. Again, terminate the stitching with an \"X\"ed rectangle. Trim the excess fabric from the tie strips. Remove all pins from the hakama pants and try them on. Cut the tie strips so that each extends beyond the belly button about 9-11\" (23-28 cm). Finish the ends of the tie strips by tucking the last inch (2.5 cm) of fabric into the tube and sewing across the end, 1/2\" (1 cm) from the edge of the tube. Again, this can be done by hand or with a sewing machine. Finishing the pants Adjust the length. Try the pants on in order to fit them to your specific leg length, making sure to secure them where they will be worn. Secure the the pants by tying the tie strips in front, making sure the fit is comfortable. The ideal pant length is with the bottom hem at the malleolus, or big part of the ankle bone. Cut excess fabric from the bottom cuffs of each leg and hem them to finish your samurai hakama pant look. Go out in your sporty new hakama pants and wow them! ",
    "sentences": [
        " Preparing the material Choose your preferred material.",
        "Traditional male hakama pants are made from a stiff silk material, but a more modern style can be made from a medium weight cotton fabric (about the weight of bed sheeting).",
        "Launder the fabric to remove any dirt or sizing.",
        "Iron smooth if the laundering process produces a wrinkled material.",
        "Lay the material flat and cut off any hemmed or finished edges.",
        "Making the ties Cut three strips of fabric approximately 4 inches wide from the longest edge of your material.",
        "These strips will become the straps that secure the samurai pants.",
        "Each fabric strip should be long enough to go around the intended wearer's waist with 8-10\" (20-25 cm) to spare.",
        "Make one long strip.",
        "Sew two of the strips together along the short edges, leaving the third strip at its original length— half the length of the long strip.",
        "Form two tubes - one long, one short.",
        "Fold each strip in half lengthwise and pin, then sew a seam along the unfinished edges to create two tubes.",
        "Turn both tubes inside out so the seam is on the inside with the unfinished edges no longer visible, then set the tubes aside.",
        "Cutting the pant legs Cut the remaining fabric in half.",
        "Fold the remaining fabric in half lengthwise and carefully cut along the fold.",
        "These two pieces will form the legs of your samurai pants.",
        "Fold the leg pieces in half lengthwise.",
        "Then, set one on top of the other so the folded edges are facing you and the unfinished edges away from you.",
        "Cut an area for the crotch.",
        "Cut a half \"U\" on the folded side of both leg pieces, starting approximately 1/3 of the way down the pants.",
        "Start perpendicular to the fold and curve smoothly to form the bottom of the \"U\".",
        "When you come parallel to the fold, run along the parallel line up to the top fabric edge.",
        "The inner or middle part of the \"U\" should be facing you.",
        "Make sure to cut both leg pieces equally.",
        "Unfold the leg pieces and even the crotch area of each.",
        "When you unfold them, each should have a full \"U\" through the middle of the top third of each of the pant pieces.",
        "Lay the two unfolded pant pieces on top of each other.",
        "The \"U\" shapes should match.",
        "If not, make the necessary adjustments.",
        "Forming the pants Fasten the crotch area.",
        "Place the leg pieces on top of each other with the \"U\" in the middle.",
        "Pin and sew the pieces together along the \"U\" shape to fasten the crotch area.",
        "For security, you probably want to use a double seam here.",
        "Unfold the fabric.",
        "The newly sewn crotch should be in the middle with the sewn edge up and the pant legs on either side of the seam.",
        "Sew along the outside edges of each leg.",
        "Pinning first, begin approximately 6-8\" (15-20 cm) from the top of the pant and continue all the way to the bottom.",
        "Hem the top of the pants.",
        "Use closely spaced stitches and a double line of stitching.",
        "Turn the fabric right-side out.",
        "The sewn portions will now be on the inside of the pants.",
        "Making the pleats Form the front pleats.",
        "Fold and pin four evenly spaced pleats on the front top of the hakama pants with all folds facing the middle of the pants - i.e., the two folds on each side will face each other.",
        "Secure the front pleats.",
        "Sew a straight line across only the top front of the samurai pants, approximately 2-3\" (5-7.5 cm) from the top.",
        "Reinforce the pants by sewing a second line to make them more sturdy.",
        "Form the back pleats.",
        "Fold two pleats on the backside of the pants with both folds facing the middle of the pants, then pin the pleats in place.",
        "Secure the back pleats.",
        "Sew two straight lines along the top backside of the pants, just as you did in the front.",
        "They should be approximately 2-3\" (5-7.5 cm) from the top— the same as in the front.",
        "Attaching the ties Iron the tubes.",
        "Iron both the tubes so that the seams run fairly straight down the middle of one side of each tube so that they become strips.",
        "Finish one end of each tie strip by tucking the last inch (2.5cm) of fabric into the tube and sewing across the end, 1/2\" (1 cm) from the edge of the tube.",
        "This can be done with a sewing machine or by hand.",
        "Position the longer tube.",
        "Take the longer tube and place it along the front of the hakama pants, aligning the finished end of the strip with the crotch seam.",
        "This strip will be the tie that wraps around your back and continues on around to the front where you tie the pants.",
        "Secure the longer strip.",
        "Pin the tube/strip along the top edge of the pants with the seam down, then sew along the bottom edge of the strip.",
        "Start at the front, then continue along the backside of the hakama pants.",
        "For extra durability, sew the top length of the strip to the pants as well.",
        "Note: The seam of the tube should be hidden on the underside, against the pant fabric.",
        "Terminate the stitching with a rectangle (long edge across the width of the tie).",
        "You can stitch an \"X\" within the rectangle to build in long term durability at this strain point.",
        "Place and secure the shorter tube.",
        "Take the shorter tube and lay it against the backside of the hakama pants, again positioning the finished end of the tube on the crotch seam.",
        "This strip will only wrap around to the front as a tie.",
        "Sew it in place along the top and bottom edge, stopping on the side or continuing a bit onto the front.",
        "Again, terminate the stitching with an \"X\"ed rectangle.",
        "Trim the excess fabric from the tie strips.",
        "Remove all pins from the hakama pants and try them on.",
        "Cut the tie strips so that each extends beyond the belly button about 9-11\" (23-28 cm).",
        "Finish the ends of the tie strips by tucking the last inch (2.5 cm) of fabric into the tube and sewing across the end, 1/2\" (1 cm) from the edge of the tube.",
        "Again, this can be done by hand or with a sewing machine.",
        "Finishing the pants Adjust the length.",
        "Try the pants on in order to fit them to your specific leg length, making sure to secure them where they will be worn.",
        "Secure the the pants by tying the tie strips in front, making sure the fit is comfortable.",
        "The ideal pant length is with the bottom hem at the malleolus, or big part of the ankle bone.",
        "Cut excess fabric from the bottom cuffs of each leg and hem them to finish your samurai hakama pant look.",
        "Go out in your sporty new hakama pants and wow them!"
    ]
}