{
    "title": "How to Recycle a Used Oil Filter",
    "url": "https://www.wikihow.com/Recycle-a-Used-Oil-Filter",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Household Waste Disposal",
        "Recycling"
    ],
    "steps": [
        {
            "headline": "Drain your car's oil into a drain pan.",
            "description": "Before you begin an oil change, get a pan ready to collect the oil as it pours from your car. A disposable aluminum baking pan works well for this, but any wide, shallow pan will work in a pinch."
        },
        {
            "headline": "Clean up any spills during the oil change with an absorbent material.",
            "description": "If you spill any oil onto your work area, do not hose down the area to clean it up. Instead, spread an absorbent material like sawdust or cat litter on the spilled oil, and then bag the soaked material in a leak-proof bag for recycling."
        },
        {
            "headline": "Pour the used oil from your pan into a plastic container.",
            "description": "Saving the original container is the easiest method, but any clean plastic container with a tight-fitting lid will work. Use a funnel when filling the container to minimize spills. Do not add any other waste liquids to the oil. Contaminated oil cannot be recycled; it must be treated as hazardous waste."
        },
        {
            "headline": "Place your used oil filter in a sealed plastic bag.",
            "description": "Once you remove your old oil filter, bag it carefully in a leak-proof bag with a tight seal. Large zip-top bags work well for this."
        },
        {
            "headline": "Store the used oil and oil filter properly until you are able to recycle them.",
            "description": "Mark each plastic bag with the words \"waste oil,\" and store them away from direct sunlight. Aim to take them to a recycling center as soon as possible."
        },
        {
            "headline": "Locate an oil recycling center near you.",
            "description": "Many quick lube businesses and service stations will recycle your used oil for you, so call nearby locations to see if that is an option. Many local governments also run oil recycling programs. In the United States, both the American Petroleum Institute and Earth911.org maintain resources that can help you locate a recycling center near you."
        },
        {
            "headline": "Take your used oil and oil filter to the recycling center.",
            "description": "As long as you have stored the oil in leak-proof bags or containers, you should have no problem handing them off to the recycling center. If you are driving the used oil to the recycling center, be sure to store the oil in the trunk during the drive, not in the cabin."
        }
    ],
    "tyn": [
        "Oil pan",
        "Sawdust",
        "Leak-proof plastic containers",
        "Funnel",
        "Marker"
    ],
    "text": " Drain your car's oil into a drain pan. Before you begin an oil change, get a pan ready to collect the oil as it pours from your car. A disposable aluminum baking pan works well for this, but any wide, shallow pan will work in a pinch. Clean up any spills during the oil change with an absorbent material. If you spill any oil onto your work area, do not hose down the area to clean it up. Instead, spread an absorbent material like sawdust or cat litter on the spilled oil, and then bag the soaked material in a leak-proof bag for recycling. Pour the used oil from your pan into a plastic container. Saving the original container is the easiest method, but any clean plastic container with a tight-fitting lid will work. Use a funnel when filling the container to minimize spills. Do not add any other waste liquids to the oil. Contaminated oil cannot be recycled; it must be treated as hazardous waste. Place your used oil filter in a sealed plastic bag. Once you remove your old oil filter, bag it carefully in a leak-proof bag with a tight seal. Large zip-top bags work well for this. Store the used oil and oil filter properly until you are able to recycle them. Mark each plastic bag with the words \"waste oil,\" and store them away from direct sunlight. Aim to take them to a recycling center as soon as possible. Locate an oil recycling center near you. Many quick lube businesses and service stations will recycle your used oil for you, so call nearby locations to see if that is an option. Many local governments also run oil recycling programs. In the United States, both the American Petroleum Institute and Earth911.org maintain resources that can help you locate a recycling center near you. Take your used oil and oil filter to the recycling center. As long as you have stored the oil in leak-proof bags or containers, you should have no problem handing them off to the recycling center. If you are driving the used oil to the recycling center, be sure to store the oil in the trunk during the drive, not in the cabin.",
    "sentences": [
        " Drain your car's oil into a drain pan.",
        "Before you begin an oil change, get a pan ready to collect the oil as it pours from your car.",
        "A disposable aluminum baking pan works well for this, but any wide, shallow pan will work in a pinch.",
        "Clean up any spills during the oil change with an absorbent material.",
        "If you spill any oil onto your work area, do not hose down the area to clean it up.",
        "Instead, spread an absorbent material like sawdust or cat litter on the spilled oil, and then bag the soaked material in a leak-proof bag for recycling.",
        "Pour the used oil from your pan into a plastic container.",
        "Saving the original container is the easiest method, but any clean plastic container with a tight-fitting lid will work.",
        "Use a funnel when filling the container to minimize spills.",
        "Do not add any other waste liquids to the oil.",
        "Contaminated oil cannot be recycled; it must be treated as hazardous waste.",
        "Place your used oil filter in a sealed plastic bag.",
        "Once you remove your old oil filter, bag it carefully in a leak-proof bag with a tight seal.",
        "Large zip-top bags work well for this.",
        "Store the used oil and oil filter properly until you are able to recycle them.",
        "Mark each plastic bag with the words \"waste oil,\" and store them away from direct sunlight.",
        "Aim to take them to a recycling center as soon as possible.",
        "Locate an oil recycling center near you.",
        "Many quick lube businesses and service stations will recycle your used oil for you, so call nearby locations to see if that is an option.",
        "Many local governments also run oil recycling programs.",
        "In the United States, both the American Petroleum Institute and Earth911.org maintain resources that can help you locate a recycling center near you.",
        "Take your used oil and oil filter to the recycling center.",
        "As long as you have stored the oil in leak-proof bags or containers, you should have no problem handing them off to the recycling center.",
        "If you are driving the used oil to the recycling center, be sure to store the oil in the trunk during the drive, not in the cabin."
    ]
}