{
    "title": "How to Paint a Textured Ceiling",
    "url": "https://www.wikihow.com/Paint-a-Textured-Ceiling",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Walls and Ceilings",
        "Ceilings",
        "Textured Ceilings"
    ],
    "parts": [
        {
            "name": "Setting Up",
            "steps": [
                {
                    "headline": "Cover the entire floor and any furnishings with as many drop-cloths or sheets as needed.",
                    "description": ""
                },
                {
                    "headline": "Set up a ladder or scaffolding that is tall enough to allow you to reach the ceiling without straining.",
                    "description": ""
                },
                {
                    "headline": "Put on safety glasses to protect your eyes from loose texture and dripping paint.",
                    "description": ""
                },
                {
                    "headline": "Vacuum the ceiling using a hand-held vacuum cleaner with a soft-bristled attachment, being careful not to damage the texture.",
                    "description": ""
                },
                {
                    "headline": "Tape around all the wall edges with painters tape if you are painting the ceiling a color that differs from the walls.",
                    "description": "If the walls and the ceiling will be the same color, you can skip this step."
                },
                {
                    "headline": "Decide on your application technique.",
                    "description": "If you choose to use a roller, be sure to get one with a 1 inch (2.54 cm) thick nap to ensure full coverage. A spray gun can also be used and may save some time but it might be necessary to practice on a different surface first to get a feel for the way the gun handles and how far you should hold the sprayer to the surface for the best coverage."
                }
            ]
        },
        {
            "name": "Painting the Ceiling",
            "steps": [
                {
                    "headline": "Load textured paint into a paint pan, if you're using a roller, or a spray gun.",
                    "description": "Textured paint is thicker than normal paint and is designed for textured surfaces. There are different varieties for different textures so be sure to choose the correct paint for your texture. For example, coarse paint for a coarse or popcorn ceiling."
                },
                {
                    "headline": "Roll or spray the textured paint onto the ceiling.",
                    "description": "If using a roller, be sure to press gently and use slow, even strokes. If using a spray gun, spray lightly and evenly."
                },
                {
                    "headline": "Continue painting until you have covered the entire ceiling.",
                    "description": "Don't worry if your coverage is not perfect. You will have the opportunity to catch any missed spots when you apply a second coat."
                },
                {
                    "headline": "Allow the paint to dry fully.",
                    "description": ""
                },
                {
                    "headline": "Apply a second coat of paint, making sure to change the direction of your roller or sprayer.",
                    "description": "For example, if your first strokes were north/south, paint the second coat in an east/west direction."
                },
                {
                    "headline": "Allow the second coat to dry fully.",
                    "description": ""
                },
                {
                    "headline": "Paint around the edges of the ceiling, close to the walls, with a paintbrush.",
                    "description": ""
                },
                {
                    "headline": "Touch-up any missed spots with a paintbrush.",
                    "description": ""
                },
                {
                    "headline": "Let the paint dry again.",
                    "description": ""
                },
                {
                    "headline": "Remove tape and drop-cloths or sheets.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Drop-cloths or sheets",
        "Ladder or scaffolding",
        "Safety glasses",
        "Hand-held vacuum",
        "Painters tape",
        "Texture paint",
        "Roller with 1 inch (2.54 cm) thick nap or spray gun",
        "Paint pan",
        "Paintbrush"
    ],
    "text": " Setting Up Cover the entire floor and any furnishings with as many drop-cloths or sheets as needed.  Set up a ladder or scaffolding that is tall enough to allow you to reach the ceiling without straining.  Put on safety glasses to protect your eyes from loose texture and dripping paint.  Vacuum the ceiling using a hand-held vacuum cleaner with a soft-bristled attachment, being careful not to damage the texture.  Tape around all the wall edges with painters tape if you are painting the ceiling a color that differs from the walls. If the walls and the ceiling will be the same color, you can skip this step. Decide on your application technique. If you choose to use a roller, be sure to get one with a 1 inch (2.54 cm) thick nap to ensure full coverage. A spray gun can also be used and may save some time but it might be necessary to practice on a different surface first to get a feel for the way the gun handles and how far you should hold the sprayer to the surface for the best coverage. Painting the Ceiling Load textured paint into a paint pan, if you're using a roller, or a spray gun. Textured paint is thicker than normal paint and is designed for textured surfaces. There are different varieties for different textures so be sure to choose the correct paint for your texture. For example, coarse paint for a coarse or popcorn ceiling. Roll or spray the textured paint onto the ceiling. If using a roller, be sure to press gently and use slow, even strokes. If using a spray gun, spray lightly and evenly. Continue painting until you have covered the entire ceiling. Don't worry if your coverage is not perfect. You will have the opportunity to catch any missed spots when you apply a second coat. Allow the paint to dry fully.  Apply a second coat of paint, making sure to change the direction of your roller or sprayer. For example, if your first strokes were north/south, paint the second coat in an east/west direction. Allow the second coat to dry fully.  Paint around the edges of the ceiling, close to the walls, with a paintbrush.  Touch-up any missed spots with a paintbrush.  Let the paint dry again.  Remove tape and drop-cloths or sheets. ",
    "sentences": [
        " Setting Up Cover the entire floor and any furnishings with as many drop-cloths or sheets as needed.",
        "Set up a ladder or scaffolding that is tall enough to allow you to reach the ceiling without straining.",
        "Put on safety glasses to protect your eyes from loose texture and dripping paint.",
        "Vacuum the ceiling using a hand-held vacuum cleaner with a soft-bristled attachment, being careful not to damage the texture.",
        "Tape around all the wall edges with painters tape if you are painting the ceiling a color that differs from the walls.",
        "If the walls and the ceiling will be the same color, you can skip this step.",
        "Decide on your application technique.",
        "If you choose to use a roller, be sure to get one with a 1 inch (2.54 cm) thick nap to ensure full coverage.",
        "A spray gun can also be used and may save some time but it might be necessary to practice on a different surface first to get a feel for the way the gun handles and how far you should hold the sprayer to the surface for the best coverage.",
        "Painting the Ceiling Load textured paint into a paint pan, if you're using a roller, or a spray gun.",
        "Textured paint is thicker than normal paint and is designed for textured surfaces.",
        "There are different varieties for different textures so be sure to choose the correct paint for your texture.",
        "For example, coarse paint for a coarse or popcorn ceiling.",
        "Roll or spray the textured paint onto the ceiling.",
        "If using a roller, be sure to press gently and use slow, even strokes.",
        "If using a spray gun, spray lightly and evenly.",
        "Continue painting until you have covered the entire ceiling.",
        "Don't worry if your coverage is not perfect.",
        "You will have the opportunity to catch any missed spots when you apply a second coat.",
        "Allow the paint to dry fully.",
        "Apply a second coat of paint, making sure to change the direction of your roller or sprayer.",
        "For example, if your first strokes were north/south, paint the second coat in an east/west direction.",
        "Allow the second coat to dry fully.",
        "Paint around the edges of the ceiling, close to the walls, with a paintbrush.",
        "Touch-up any missed spots with a paintbrush.",
        "Let the paint dry again.",
        "Remove tape and drop-cloths or sheets."
    ]
}