{
    "title": "How to Make Liquid Castile Soap",
    "url": "https://www.wikihow.com/Make-Liquid-Castile-Soap",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Mixing Your Own Liquid Castile Soap",
            "steps": [
                {
                    "headline": "Add 40 fluid ounces (1,200 mL) of olive oil to your slow cooker on high heat.",
                    "description": "First, use a measuring cup to measure out and pour 40 fluid ounces (1,200 mL) of olive oil into your slow cooker. Then, turn the slow cooker on high to heat the oil. While traditional castile soap only uses olive oil, you can use additional vegetable oils in place of some of the olive oil as well. For example, you can replace 16 fluid ounces (470 mL)  of the olive oil with 16 ounces (450 g) of coconut oil for an extra hydrating and cleaning liquid soap. You can also replace some of the olive oil with hemp oil or jojoba oil to help fight skin inflammation and redness. Just make sure that the amount of oil used still adds up to 40 fluid ounces (1,200 mL)."
                },
                {
                    "headline": "Wear safety gloves and goggles in a ventilated space.",
                    "description": "While the oil is heating up, put on safety gloves and goggles to protect your skin and eyes. Then, ventilate your space by turning on the vent hood and opening 1 or 2 windows. Direct contact to potassium hydroxide lye flakes, and even exposure due to lack of ventilation, can burn your skin and even cause blindness if it gets in your eyes."
                },
                {
                    "headline": "Mix the potassium hydroxide lye flakes with distilled water.",
                    "description": "Use a measuring cup to pour 32 fluid ounces (950 mL) of distilled water into a large glass mixing bowl. Then, measure out 9 ounces (260 g) of potassium hydroxide lye flakes and add them carefully to the distilled water. Use a silicone spatula to mix the lye solution, stirring slowly and carefully until the flakes are completely dissolved. You can buy potassium hydroxide lye flakes online and at some apothecary stores. Using distilled water is necessary because the pH and mineral content of tap water varies from one place to another. This can greatly impact the chemical reactions during the soap-making process, as well as its purity and cleaning ability. If you want the castile soap to be even more moisturizing, you can add 8 ounces (230 g) of glycerin to the lye solution."
                },
                {
                    "headline": "Stir the oil and add the lye solution into the slow cooker.",
                    "description": "First, use your spatula to stir the oil that’s been heating up in the slow cooker to make sure it’s warm and mixed, if you used more than 1 type of oil. Then, carefully pour the lye solution into the slow cooker, adding it slowly so the solution doesn’t splash."
                },
                {
                    "headline": "Use an immersion blender to blend the oil and lye together.",
                    "description": "Place the end of your immersion blender into the slow cooker. Then, turn it on the medium setting and blend the liquids for about 5 minutes, moving the blender around in the slow cooker to make sure all the oils and lye solution are mixed. After 5 minutes, the mixture will turn more opaque and begin to thicken into a pudding-like consistency."
                },
                {
                    "headline": "Cover the soap and cook it for 3 hours, stirring every 30 minutes.",
                    "description": "Once the soap mixture thickens, set the timer on your slow cooker for 3 hours. Cover the slow cooker with the lid, returning to stir the mixture every 30 minutes with a silicone spatula. This will ensure that the soap ingredients don’t separate as they cook in the slow cooker. As the soap cooks, it will become increasingly more translucent. If your slow cooker’s high heat setting doesn’t get very hot, you may need to cook the mixture for up to 5 hours."
                },
                {
                    "headline": "Add ⁄2 ounce (14 g) of the soap mixture to hot water to test the clarity.",
                    "description": "After about 3 hours, check to see if the soap looks translucent with a gel-like consistency. If it does, use a measuring spoon to transfer ⁄2 ounce (14 g) of the soap mixture into 1 fluid ounce (30 mL) of hot water. If the soap melts and remains translucent, it’s ready to be diluted. If it’s still cloudy, cook the soap mixture in the slow cooker for another 30 minutes before performing the clarity test again."
                },
                {
                    "headline": "Heat 10 cups (2,400 mL) of distilled water on the stove.",
                    "description": "Use a measuring cup to measure out and add 10 cups (2,400 mL) of distilled water to a pot. Then, heat the water on the stove until it just starts to boil. Since the soap mixture and slow cooker will be hot, using hot water will keep your slow cooker pot from cracking as the result of an instant temperature change."
                },
                {
                    "headline": "Dilute the soap mixture with the 10 cups (2,400 mL) of hot distilled water.",
                    "description": "Carefully add the hot distilled water into the slow cooker, pouring slowly so it doesn’t splash on your skin. Then, use a silicone spatula to stir the soap and distilled water until combined."
                },
                {
                    "headline": "Leave the slow cooker covered on the warm setting for 8 hours.",
                    "description": "Once the soap mixture is diluted with hot distilled water, set your slow cooker on the “keep warm” setting. Leave the soap to liquefy for about 8 hours or overnight. If you aren’t comfortable leaving your slow cooker on overnight, you can turn it off and let the soap liquefy at room temperature. If you do this, leave it for 10 to 12 hours instead of 8 hours."
                },
                {
                    "headline": "Transfer the liquid castile soap into a container(s) to store it.",
                    "description": "Use a ladle to transfer the liquid castile soap in a large glass jug, or separate it into several smaller soap dispensers. You can then use your liquid castile soap as a cleaning solution, hand wash, body wash, shampoo, dish soap, or shower scrub. To make your soap extra moisturizing, add about 25 drops of vitamin E oil to the container. You can use a funnel to help you transfer the liquid castile soap into containers without spilling."
                }
            ]
        },
        {
            "name": "Melting Castile Soap Bars into Liquid",
            "steps": [
                {
                    "headline": "Boil 2 cups (470 mL) of water for every bar of soap on the stove.",
                    "description": "Using a measuring cup, add the appropriate amount of water for the number of soap bars you’re melting into liquid. Then, turn the stove on high to bring the water to a boil. While it’s crucial that you use distilled water when making liquid castile soap from scratch, you can use regular water when making liquid soap from a bar if you want."
                },
                {
                    "headline": "Grate the bar of castile soap into a slow cooker with a cheese grater.",
                    "description": "While the water is heating up on the stove, use a cheese grater to grate the bar of castile soap into the slow cooker. You can do this by holding the cheese grater over the slow cooker pot and running the soap bar back and forth over the grates. While you can melt bars of castile soap whole, they will melt much faster and more evenly if you grate them into small pieces. Use caution when you’re using the cheese grater, as they tend to be very sharp."
                },
                {
                    "headline": "Add the boiling water and set the slow cooker on high for 1 hour.",
                    "description": "Pour the boiling water on top of the grated castile soap in the slow cooker pot. Then, cover the slow cooker pot with the lid and turn it on the high heat setting. Set the timer on the slow cooker for 1 hour. Make sure that you pour the boiling water slowly and carefully so it doesn’t splash and burn your skin."
                },
                {
                    "headline": "Stir the liquid soap with a whisk or immersion blender.",
                    "description": "After 1 hour, remove the lid from the slow cooker. Use a whisk or immersion blender to stir the liquid soap for about 5 minutes or until it’s completely blended. If you use an immersion blender, set it on the low or medium setting to ensure that the hot, liquefied soap doesn’t splash on your skin."
                },
                {
                    "headline": "Remove the pot from the slow cooker and let it cool for 1 hour.",
                    "description": "Grab the handles on either side of the slow cooker’s pot and remove it from the slow cooker setting. Place the pot on a heat-safe mat or on the stovetop if it’s turned off to cool for at least 1 hour. Depending on the temperature in your kitchen, it may take longer than 1 hour for the liquid to cool. If so, leave it for about 15 to 30 minutes."
                },
                {
                    "headline": "Use a ladle to transfer the liquid soap into a container.",
                    "description": "Using a ladle, carefully scoop the liquid castile soap into a large container to store it. You can also transfer your liquid castile soap into smaller containers or soap dispensers. Use a funnel to help you transfer the liquid castile soap into containers without spilling."
                }
            ]
        }
    ],
    "tyn": [
        "Mixing Your Own Liquid Castile Soap",
        "Large slow cooker (6 quarts or larger)",
        "Immersion blender",
        "Measuring cups",
        "Silicone spatula",
        "Glass mixing bowl",
        "Potassium hydroxide lye flakes",
        "Distilled water",
        "Olive oil",
        "Optional additional oils (olive oil, coconut oil, hemp oil, jojoba oil, vitamin E oil)",
        "Glass container(s)",
        "Melting Castile Soap Bars into Liquid",
        "Slow cooker",
        "Cheese grater",
        "Immersion blender or whisk",
        "Water",
        "Castile soap bar(s)"
    ],
    "text": " Mixing Your Own Liquid Castile Soap Add 40 fluid ounces (1,200 mL) of olive oil to your slow cooker on high heat. First, use a measuring cup to measure out and pour 40 fluid ounces (1,200 mL) of olive oil into your slow cooker. Then, turn the slow cooker on high to heat the oil. While traditional castile soap only uses olive oil, you can use additional vegetable oils in place of some of the olive oil as well. For example, you can replace 16 fluid ounces (470 mL)  of the olive oil with 16 ounces (450 g) of coconut oil for an extra hydrating and cleaning liquid soap. You can also replace some of the olive oil with hemp oil or jojoba oil to help fight skin inflammation and redness. Just make sure that the amount of oil used still adds up to 40 fluid ounces (1,200 mL). Wear safety gloves and goggles in a ventilated space. While the oil is heating up, put on safety gloves and goggles to protect your skin and eyes. Then, ventilate your space by turning on the vent hood and opening 1 or 2 windows. Direct contact to potassium hydroxide lye flakes, and even exposure due to lack of ventilation, can burn your skin and even cause blindness if it gets in your eyes. Mix the potassium hydroxide lye flakes with distilled water. Use a measuring cup to pour 32 fluid ounces (950 mL) of distilled water into a large glass mixing bowl. Then, measure out 9 ounces (260 g) of potassium hydroxide lye flakes and add them carefully to the distilled water. Use a silicone spatula to mix the lye solution, stirring slowly and carefully until the flakes are completely dissolved. You can buy potassium hydroxide lye flakes online and at some apothecary stores. Using distilled water is necessary because the pH and mineral content of tap water varies from one place to another. This can greatly impact the chemical reactions during the soap-making process, as well as its purity and cleaning ability. If you want the castile soap to be even more moisturizing, you can add 8 ounces (230 g) of glycerin to the lye solution. Stir the oil and add the lye solution into the slow cooker. First, use your spatula to stir the oil that’s been heating up in the slow cooker to make sure it’s warm and mixed, if you used more than 1 type of oil. Then, carefully pour the lye solution into the slow cooker, adding it slowly so the solution doesn’t splash. Use an immersion blender to blend the oil and lye together. Place the end of your immersion blender into the slow cooker. Then, turn it on the medium setting and blend the liquids for about 5 minutes, moving the blender around in the slow cooker to make sure all the oils and lye solution are mixed. After 5 minutes, the mixture will turn more opaque and begin to thicken into a pudding-like consistency. Cover the soap and cook it for 3 hours, stirring every 30 minutes. Once the soap mixture thickens, set the timer on your slow cooker for 3 hours. Cover the slow cooker with the lid, returning to stir the mixture every 30 minutes with a silicone spatula. This will ensure that the soap ingredients don’t separate as they cook in the slow cooker. As the soap cooks, it will become increasingly more translucent. If your slow cooker’s high heat setting doesn’t get very hot, you may need to cook the mixture for up to 5 hours. Add ⁄2 ounce (14 g) of the soap mixture to hot water to test the clarity. After about 3 hours, check to see if the soap looks translucent with a gel-like consistency. If it does, use a measuring spoon to transfer ⁄2 ounce (14 g) of the soap mixture into 1 fluid ounce (30 mL) of hot water. If the soap melts and remains translucent, it’s ready to be diluted. If it’s still cloudy, cook the soap mixture in the slow cooker for another 30 minutes before performing the clarity test again. Heat 10 cups (2,400 mL) of distilled water on the stove. Use a measuring cup to measure out and add 10 cups (2,400 mL) of distilled water to a pot. Then, heat the water on the stove until it just starts to boil. Since the soap mixture and slow cooker will be hot, using hot water will keep your slow cooker pot from cracking as the result of an instant temperature change. Dilute the soap mixture with the 10 cups (2,400 mL) of hot distilled water. Carefully add the hot distilled water into the slow cooker, pouring slowly so it doesn’t splash on your skin. Then, use a silicone spatula to stir the soap and distilled water until combined. Leave the slow cooker covered on the warm setting for 8 hours. Once the soap mixture is diluted with hot distilled water, set your slow cooker on the “keep warm” setting. Leave the soap to liquefy for about 8 hours or overnight. If you aren’t comfortable leaving your slow cooker on overnight, you can turn it off and let the soap liquefy at room temperature. If you do this, leave it for 10 to 12 hours instead of 8 hours. Transfer the liquid castile soap into a container(s) to store it. Use a ladle to transfer the liquid castile soap in a large glass jug, or separate it into several smaller soap dispensers. You can then use your liquid castile soap as a cleaning solution, hand wash, body wash, shampoo, dish soap, or shower scrub. To make your soap extra moisturizing, add about 25 drops of vitamin E oil to the container. You can use a funnel to help you transfer the liquid castile soap into containers without spilling. Melting Castile Soap Bars into Liquid Boil 2 cups (470 mL) of water for every bar of soap on the stove. Using a measuring cup, add the appropriate amount of water for the number of soap bars you’re melting into liquid. Then, turn the stove on high to bring the water to a boil. While it’s crucial that you use distilled water when making liquid castile soap from scratch, you can use regular water when making liquid soap from a bar if you want. Grate the bar of castile soap into a slow cooker with a cheese grater. While the water is heating up on the stove, use a cheese grater to grate the bar of castile soap into the slow cooker. You can do this by holding the cheese grater over the slow cooker pot and running the soap bar back and forth over the grates. While you can melt bars of castile soap whole, they will melt much faster and more evenly if you grate them into small pieces. Use caution when you’re using the cheese grater, as they tend to be very sharp. Add the boiling water and set the slow cooker on high for 1 hour. Pour the boiling water on top of the grated castile soap in the slow cooker pot. Then, cover the slow cooker pot with the lid and turn it on the high heat setting. Set the timer on the slow cooker for 1 hour. Make sure that you pour the boiling water slowly and carefully so it doesn’t splash and burn your skin. Stir the liquid soap with a whisk or immersion blender. After 1 hour, remove the lid from the slow cooker. Use a whisk or immersion blender to stir the liquid soap for about 5 minutes or until it’s completely blended. If you use an immersion blender, set it on the low or medium setting to ensure that the hot, liquefied soap doesn’t splash on your skin. Remove the pot from the slow cooker and let it cool for 1 hour. Grab the handles on either side of the slow cooker’s pot and remove it from the slow cooker setting. Place the pot on a heat-safe mat or on the stovetop if it’s turned off to cool for at least 1 hour. Depending on the temperature in your kitchen, it may take longer than 1 hour for the liquid to cool. If so, leave it for about 15 to 30 minutes. Use a ladle to transfer the liquid soap into a container. Using a ladle, carefully scoop the liquid castile soap into a large container to store it. You can also transfer your liquid castile soap into smaller containers or soap dispensers. Use a funnel to help you transfer the liquid castile soap into containers without spilling.",
    "sentences": [
        " Mixing Your Own Liquid Castile Soap Add 40 fluid ounces (1,200 mL) of olive oil to your slow cooker on high heat.",
        "First, use a measuring cup to measure out and pour 40 fluid ounces (1,200 mL) of olive oil into your slow cooker.",
        "Then, turn the slow cooker on high to heat the oil.",
        "While traditional castile soap only uses olive oil, you can use additional vegetable oils in place of some of the olive oil as well.",
        "For example, you can replace 16 fluid ounces (470 mL)  of the olive oil with 16 ounces (450 g) of coconut oil for an extra hydrating and cleaning liquid soap.",
        "You can also replace some of the olive oil with hemp oil or jojoba oil to help fight skin inflammation and redness.",
        "Just make sure that the amount of oil used still adds up to 40 fluid ounces (1,200 mL).",
        "Wear safety gloves and goggles in a ventilated space.",
        "While the oil is heating up, put on safety gloves and goggles to protect your skin and eyes.",
        "Then, ventilate your space by turning on the vent hood and opening 1 or 2 windows.",
        "Direct contact to potassium hydroxide lye flakes, and even exposure due to lack of ventilation, can burn your skin and even cause blindness if it gets in your eyes.",
        "Mix the potassium hydroxide lye flakes with distilled water.",
        "Use a measuring cup to pour 32 fluid ounces (950 mL) of distilled water into a large glass mixing bowl.",
        "Then, measure out 9 ounces (260 g) of potassium hydroxide lye flakes and add them carefully to the distilled water.",
        "Use a silicone spatula to mix the lye solution, stirring slowly and carefully until the flakes are completely dissolved.",
        "You can buy potassium hydroxide lye flakes online and at some apothecary stores.",
        "Using distilled water is necessary because the pH and mineral content of tap water varies from one place to another.",
        "This can greatly impact the chemical reactions during the soap-making process, as well as its purity and cleaning ability.",
        "If you want the castile soap to be even more moisturizing, you can add 8 ounces (230 g) of glycerin to the lye solution.",
        "Stir the oil and add the lye solution into the slow cooker.",
        "First, use your spatula to stir the oil that’s been heating up in the slow cooker to make sure it’s warm and mixed, if you used more than 1 type of oil.",
        "Then, carefully pour the lye solution into the slow cooker, adding it slowly so the solution doesn’t splash.",
        "Use an immersion blender to blend the oil and lye together.",
        "Place the end of your immersion blender into the slow cooker.",
        "Then, turn it on the medium setting and blend the liquids for about 5 minutes, moving the blender around in the slow cooker to make sure all the oils and lye solution are mixed.",
        "After 5 minutes, the mixture will turn more opaque and begin to thicken into a pudding-like consistency.",
        "Cover the soap and cook it for 3 hours, stirring every 30 minutes.",
        "Once the soap mixture thickens, set the timer on your slow cooker for 3 hours.",
        "Cover the slow cooker with the lid, returning to stir the mixture every 30 minutes with a silicone spatula.",
        "This will ensure that the soap ingredients don’t separate as they cook in the slow cooker.",
        "As the soap cooks, it will become increasingly more translucent.",
        "If your slow cooker’s high heat setting doesn’t get very hot, you may need to cook the mixture for up to 5 hours.",
        "Add ⁄2 ounce (14 g) of the soap mixture to hot water to test the clarity.",
        "After about 3 hours, check to see if the soap looks translucent with a gel-like consistency.",
        "If it does, use a measuring spoon to transfer ⁄2 ounce (14 g) of the soap mixture into 1 fluid ounce (30 mL) of hot water.",
        "If the soap melts and remains translucent, it’s ready to be diluted.",
        "If it’s still cloudy, cook the soap mixture in the slow cooker for another 30 minutes before performing the clarity test again.",
        "Heat 10 cups (2,400 mL) of distilled water on the stove.",
        "Use a measuring cup to measure out and add 10 cups (2,400 mL) of distilled water to a pot.",
        "Then, heat the water on the stove until it just starts to boil.",
        "Since the soap mixture and slow cooker will be hot, using hot water will keep your slow cooker pot from cracking as the result of an instant temperature change.",
        "Dilute the soap mixture with the 10 cups (2,400 mL) of hot distilled water.",
        "Carefully add the hot distilled water into the slow cooker, pouring slowly so it doesn’t splash on your skin.",
        "Then, use a silicone spatula to stir the soap and distilled water until combined.",
        "Leave the slow cooker covered on the warm setting for 8 hours.",
        "Once the soap mixture is diluted with hot distilled water, set your slow cooker on the “keep warm” setting.",
        "Leave the soap to liquefy for about 8 hours or overnight.",
        "If you aren’t comfortable leaving your slow cooker on overnight, you can turn it off and let the soap liquefy at room temperature.",
        "If you do this, leave it for 10 to 12 hours instead of 8 hours.",
        "Transfer the liquid castile soap into a container(s) to store it.",
        "Use a ladle to transfer the liquid castile soap in a large glass jug, or separate it into several smaller soap dispensers.",
        "You can then use your liquid castile soap as a cleaning solution, hand wash, body wash, shampoo, dish soap, or shower scrub.",
        "To make your soap extra moisturizing, add about 25 drops of vitamin E oil to the container.",
        "You can use a funnel to help you transfer the liquid castile soap into containers without spilling.",
        "Melting Castile Soap Bars into Liquid Boil 2 cups (470 mL) of water for every bar of soap on the stove.",
        "Using a measuring cup, add the appropriate amount of water for the number of soap bars you’re melting into liquid.",
        "Then, turn the stove on high to bring the water to a boil.",
        "While it’s crucial that you use distilled water when making liquid castile soap from scratch, you can use regular water when making liquid soap from a bar if you want.",
        "Grate the bar of castile soap into a slow cooker with a cheese grater.",
        "While the water is heating up on the stove, use a cheese grater to grate the bar of castile soap into the slow cooker.",
        "You can do this by holding the cheese grater over the slow cooker pot and running the soap bar back and forth over the grates.",
        "While you can melt bars of castile soap whole, they will melt much faster and more evenly if you grate them into small pieces.",
        "Use caution when you’re using the cheese grater, as they tend to be very sharp.",
        "Add the boiling water and set the slow cooker on high for 1 hour.",
        "Pour the boiling water on top of the grated castile soap in the slow cooker pot.",
        "Then, cover the slow cooker pot with the lid and turn it on the high heat setting.",
        "Set the timer on the slow cooker for 1 hour.",
        "Make sure that you pour the boiling water slowly and carefully so it doesn’t splash and burn your skin.",
        "Stir the liquid soap with a whisk or immersion blender.",
        "After 1 hour, remove the lid from the slow cooker.",
        "Use a whisk or immersion blender to stir the liquid soap for about 5 minutes or until it’s completely blended.",
        "If you use an immersion blender, set it on the low or medium setting to ensure that the hot, liquefied soap doesn’t splash on your skin.",
        "Remove the pot from the slow cooker and let it cool for 1 hour.",
        "Grab the handles on either side of the slow cooker’s pot and remove it from the slow cooker setting.",
        "Place the pot on a heat-safe mat or on the stovetop if it’s turned off to cool for at least 1 hour.",
        "Depending on the temperature in your kitchen, it may take longer than 1 hour for the liquid to cool.",
        "If so, leave it for about 15 to 30 minutes.",
        "Use a ladle to transfer the liquid soap into a container.",
        "Using a ladle, carefully scoop the liquid castile soap into a large container to store it.",
        "You can also transfer your liquid castile soap into smaller containers or soap dispensers.",
        "Use a funnel to help you transfer the liquid castile soap into containers without spilling."
    ]
}