{
    "title": "How to Size a Road Bike",
    "url": "https://www.wikihow.com/Size-a-Road-Bike",
    "category_hierarchy": [
        "Cars & Other Vehicles"
    ],
    "methods": [
        {
            "name": "Finding the Right Frame Size",
            "steps": [
                {
                    "headline": "Use your total height and a road bike sizing chart for a basic guideline.",
                    "description": "Standing against a wall, measure your total height and record it in centimeters, as this is how road bike frames are measured. Through an online search or by borrowing a chart at a road bike store, find the bike height that is associated with your total height. Use the chart to find whether you need an extra small, small, medium, large, or extra large road bike frame. You can convert your height from inches to centimeters by multiplying it by 2.54. Road bike height charts should not be used as the only resource for sizing a road bike, but are a good starting point for the basic frame size you should be looking for. Some road bike charts are more specific, with up to 6 or 7 categories of bike frame sizes."
                },
                {
                    "headline": "Measure your inseam with measuring tape.",
                    "description": "Spread your feet 8 to 10 inches (20 to 25 cm) apart, like you're on a bike. Then, place a book vertically between your legs, touching your crotch to simulate a bike seat. While holding the book in place with your hands, have a friend measure from the top of the book to the floor and record these measurements for later. The book should be held between your upper thighs, simulating a road bike seat. If you recorded your measurement in inches, convert the measurement to centimeters by multiplying it by 2.54. You can take this measurement several times and record the average for a more accurate number."
                },
                {
                    "headline": "Multiply your inseam measurement (in centimeters) by 0.67 for a suggested size.",
                    "description": "This equation will produce your ideal vertical frame size, or the seat tube, in centimeters. You will use this number to find a seat tube that fits your body. Record this number in a notebook or on your cell phone, as it is what you will be using when visiting the bike shop or measuring your current road bike. This formula will provide you with a suggested size, but it's not a guaranteed fit. Double check your math and if you feel that you have made a mistake start over, as this number is essential to sizing a road bike. For example, if your leg inseam is 80 centimeters, your frame size will be approximately 54 centimeters."
                },
                {
                    "headline": "Measure your road bike’s seat tube.",
                    "description": "Identify the top of the seat tube, where the seat clamp holds the seat post. Find the center of the bottom bracket, which is where the axle binds to the road bike’s the crank arms. With a tape measure, record the distance between these 2 points to find the length of your seat tube. This distance should match your inseam measurement for a proper road bike frame size. This measurement is known as a C-T measurement and is used to identify the frame size."
                },
                {
                    "headline": "Compare your inseam measurement to the road bike’s C-T measurement.",
                    "description": "Identify the correlation between the inseam measurement and the seat tube measurement and record their correlation. The difference between these measurements should be within 2.54 centimetres (1.00 in) for a properly-sized road bike frame. If you are buying a new road bike, choose a frame that has a seat tube measurement matching your inseam. If you are measuring your current road bike, consider purchasing a new frame if the bike’s seat tube measurement differs from your inseam."
                }
            ]
        },
        {
            "name": "Getting the Right Sized Top Tube",
            "steps": [
                {
                    "headline": "Measure your torso length.",
                    "description": "With a tape measure, record the distance from your hip to your shoulder. To get an accurate measurement, place a book between your legs vertically, simulating a bicycle seat, and measure from the top of the book to your collarbone. Measure this distance in inches and write the measurement on a piece of paper. You can also record this distance by measuring from your hip bone to the top of your shoulder with a tape measure."
                },
                {
                    "headline": "Record your arm span.",
                    "description": "Spread one arm so that it is parallel with the floor and measure the distance from your fingertips to your shoulder. For a more accurate measurement, hold a pencil in your hand and measure the distance between the pencil and your collarbone."
                },
                {
                    "headline": "Equate your total reach using these measurements.",
                    "description": "To find your total reach, add these measurements together, then divide the sum by 2. Then, add 4 inches (10 cm) to this number and write the sum down on a piece of paper. Your total reach will be used to find the correct Top Tube measurement on your road bike. This equation looks like: [(Torso Length + Arm Span) / 2] + 4 inches (10 cm) = Total Reach"
                },
                {
                    "headline": "Find and measure the top tube of the road bike.",
                    "description": "With a tape measure, record the distance between the head tube, or where your frame connects to the bike’s handlebars, and the seat tube. This distance should closely match your total reach in order for you to have a comfortably fitting road bike. If your top tube length is longer than your total reach, your road bike frame is too big. If your top tube length is shorter than your total reach, try finding a bigger bike frame that fits your measurements. As an alternative to replacing the entire frame if the top tube is the wrong size, you can replace the handlebar stem with one that is longer or shorter, depending on what you need."
                }
            ]
        },
        {
            "name": "Making Adjustments to the Road Bike",
            "steps": [
                {
                    "headline": "Adjust your seat height for a more comfortable reach.",
                    "description": "If your top tube length closely matches your total reach and you still feel uncomfortable on the bicycle, adjusting your seat could solve the problem. With a wrench, loosen the bolt that connects your seat post to the seat tube. Using a bike trainer or a doorway to support yourself, you legs should be fully extended with your heel on the pedal. Raise or lower the seat and tighten the bolt again. Avoid over-tightening the bolt, which could damage the seat post, particularly if it is made of carbon. You should have a slight bend in your knee when pedaling. If there is no bend in your knee when you pedal, your seat is too high. Make adjustments to the seat height until you feel comfortable and have a slight bend in your knee as you ride."
                },
                {
                    "headline": "Level your seat.",
                    "description": "Lean your bike against a wall or other flat surface and loosen the bolts underneath the seat. Use a carpenter’s levelling tool to make small adjustments until the seat is level. A level seat supports all of your weight without forcing you to use any back or core muscles, gives you full pedal mobility, and allows you to shift your weight on the seat. If a level seat does not feel comfortable, tipping the seat 3 degrees up or down may help your body positioning. You can purchase foam pads for your seat if you find it uncomfortable or hard to ride for long periods of time."
                },
                {
                    "headline": "Raise or lower your handlebars.",
                    "description": "Your back should be at a 45-degree angle when riding and having handlebars that are too high or too low can cause injury and soreness. Road bike handlebars should be 1 to 4 inches (2.5 to 10.2 cm) lower than the seat for an average rider. Loosen all the bolts on the stem cap to raise or lower the handlebars. Adjust the handlebars to your comfort level and then tighten the bolts. If your bike has a threadless stem, you might need to tighten the bolts to a certain torque in a specific sequence. If you’re not sure, consult a bike shop. Most riders like having their handlebars at the same height as their saddle. The width of your handlebars should be the similar to the width of your shoulders, so consider purchasing a new set if they do not fit your body."
                },
                {
                    "headline": "Let a professional adjust your road bike.",
                    "description": "If you do not feel comfortable making these adjustments on your own, visit a local bike shop to have a professional fit your bike. Any bike store will help you make adjustments to your handlebar position, seat height, and will help make sure the frame is the correct size. Ask questions and be honest with the professional about what feels comfortable and what feels uncomfortable. Be sure to make an appointment by calling the bike shop ahead of time."
                }
            ]
        }
    ],
    "tyn": [
        "Road bike",
        "Pencil",
        "Tape measure",
        "Book",
        "Wrench"
    ],
    "text": " Finding the Right Frame Size Use your total height and a road bike sizing chart for a basic guideline. Standing against a wall, measure your total height and record it in centimeters, as this is how road bike frames are measured. Through an online search or by borrowing a chart at a road bike store, find the bike height that is associated with your total height. Use the chart to find whether you need an extra small, small, medium, large, or extra large road bike frame. You can convert your height from inches to centimeters by multiplying it by 2.54. Road bike height charts should not be used as the only resource for sizing a road bike, but are a good starting point for the basic frame size you should be looking for. Some road bike charts are more specific, with up to 6 or 7 categories of bike frame sizes. Measure your inseam with measuring tape. Spread your feet 8 to 10 inches (20 to 25 cm) apart, like you're on a bike. Then, place a book vertically between your legs, touching your crotch to simulate a bike seat. While holding the book in place with your hands, have a friend measure from the top of the book to the floor and record these measurements for later. The book should be held between your upper thighs, simulating a road bike seat. If you recorded your measurement in inches, convert the measurement to centimeters by multiplying it by 2.54. You can take this measurement several times and record the average for a more accurate number. Multiply your inseam measurement (in centimeters) by 0.67 for a suggested size. This equation will produce your ideal vertical frame size, or the seat tube, in centimeters. You will use this number to find a seat tube that fits your body. Record this number in a notebook or on your cell phone, as it is what you will be using when visiting the bike shop or measuring your current road bike. This formula will provide you with a suggested size, but it's not a guaranteed fit. Double check your math and if you feel that you have made a mistake start over, as this number is essential to sizing a road bike. For example, if your leg inseam is 80 centimeters, your frame size will be approximately 54 centimeters. Measure your road bike’s seat tube. Identify the top of the seat tube, where the seat clamp holds the seat post. Find the center of the bottom bracket, which is where the axle binds to the road bike’s the crank arms. With a tape measure, record the distance between these 2 points to find the length of your seat tube. This distance should match your inseam measurement for a proper road bike frame size. This measurement is known as a C-T measurement and is used to identify the frame size. Compare your inseam measurement to the road bike’s C-T measurement. Identify the correlation between the inseam measurement and the seat tube measurement and record their correlation. The difference between these measurements should be within 2.54 centimetres (1.00 in) for a properly-sized road bike frame. If you are buying a new road bike, choose a frame that has a seat tube measurement matching your inseam. If you are measuring your current road bike, consider purchasing a new frame if the bike’s seat tube measurement differs from your inseam. Getting the Right Sized Top Tube Measure your torso length. With a tape measure, record the distance from your hip to your shoulder. To get an accurate measurement, place a book between your legs vertically, simulating a bicycle seat, and measure from the top of the book to your collarbone. Measure this distance in inches and write the measurement on a piece of paper. You can also record this distance by measuring from your hip bone to the top of your shoulder with a tape measure. Record your arm span. Spread one arm so that it is parallel with the floor and measure the distance from your fingertips to your shoulder. For a more accurate measurement, hold a pencil in your hand and measure the distance between the pencil and your collarbone. Equate your total reach using these measurements. To find your total reach, add these measurements together, then divide the sum by 2. Then, add 4 inches (10 cm) to this number and write the sum down on a piece of paper. Your total reach will be used to find the correct Top Tube measurement on your road bike. This equation looks like: [(Torso Length + Arm Span) / 2] + 4 inches (10 cm) = Total Reach Find and measure the top tube of the road bike. With a tape measure, record the distance between the head tube, or where your frame connects to the bike’s handlebars, and the seat tube. This distance should closely match your total reach in order for you to have a comfortably fitting road bike. If your top tube length is longer than your total reach, your road bike frame is too big. If your top tube length is shorter than your total reach, try finding a bigger bike frame that fits your measurements. As an alternative to replacing the entire frame if the top tube is the wrong size, you can replace the handlebar stem with one that is longer or shorter, depending on what you need. Making Adjustments to the Road Bike Adjust your seat height for a more comfortable reach. If your top tube length closely matches your total reach and you still feel uncomfortable on the bicycle, adjusting your seat could solve the problem. With a wrench, loosen the bolt that connects your seat post to the seat tube. Using a bike trainer or a doorway to support yourself, you legs should be fully extended with your heel on the pedal. Raise or lower the seat and tighten the bolt again. Avoid over-tightening the bolt, which could damage the seat post, particularly if it is made of carbon. You should have a slight bend in your knee when pedaling. If there is no bend in your knee when you pedal, your seat is too high. Make adjustments to the seat height until you feel comfortable and have a slight bend in your knee as you ride. Level your seat. Lean your bike against a wall or other flat surface and loosen the bolts underneath the seat. Use a carpenter’s levelling tool to make small adjustments until the seat is level. A level seat supports all of your weight without forcing you to use any back or core muscles, gives you full pedal mobility, and allows you to shift your weight on the seat. If a level seat does not feel comfortable, tipping the seat 3 degrees up or down may help your body positioning. You can purchase foam pads for your seat if you find it uncomfortable or hard to ride for long periods of time. Raise or lower your handlebars. Your back should be at a 45-degree angle when riding and having handlebars that are too high or too low can cause injury and soreness. Road bike handlebars should be 1 to 4 inches (2.5 to 10.2 cm) lower than the seat for an average rider. Loosen all the bolts on the stem cap to raise or lower the handlebars. Adjust the handlebars to your comfort level and then tighten the bolts. If your bike has a threadless stem, you might need to tighten the bolts to a certain torque in a specific sequence. If you’re not sure, consult a bike shop. Most riders like having their handlebars at the same height as their saddle. The width of your handlebars should be the similar to the width of your shoulders, so consider purchasing a new set if they do not fit your body. Let a professional adjust your road bike. If you do not feel comfortable making these adjustments on your own, visit a local bike shop to have a professional fit your bike. Any bike store will help you make adjustments to your handlebar position, seat height, and will help make sure the frame is the correct size. Ask questions and be honest with the professional about what feels comfortable and what feels uncomfortable. Be sure to make an appointment by calling the bike shop ahead of time.",
    "sentences": [
        " Finding the Right Frame Size Use your total height and a road bike sizing chart for a basic guideline.",
        "Standing against a wall, measure your total height and record it in centimeters, as this is how road bike frames are measured.",
        "Through an online search or by borrowing a chart at a road bike store, find the bike height that is associated with your total height.",
        "Use the chart to find whether you need an extra small, small, medium, large, or extra large road bike frame.",
        "You can convert your height from inches to centimeters by multiplying it by 2.54.",
        "Road bike height charts should not be used as the only resource for sizing a road bike, but are a good starting point for the basic frame size you should be looking for.",
        "Some road bike charts are more specific, with up to 6 or 7 categories of bike frame sizes.",
        "Measure your inseam with measuring tape.",
        "Spread your feet 8 to 10 inches (20 to 25 cm) apart, like you're on a bike.",
        "Then, place a book vertically between your legs, touching your crotch to simulate a bike seat.",
        "While holding the book in place with your hands, have a friend measure from the top of the book to the floor and record these measurements for later.",
        "The book should be held between your upper thighs, simulating a road bike seat.",
        "If you recorded your measurement in inches, convert the measurement to centimeters by multiplying it by 2.54.",
        "You can take this measurement several times and record the average for a more accurate number.",
        "Multiply your inseam measurement (in centimeters) by 0.67 for a suggested size.",
        "This equation will produce your ideal vertical frame size, or the seat tube, in centimeters.",
        "You will use this number to find a seat tube that fits your body.",
        "Record this number in a notebook or on your cell phone, as it is what you will be using when visiting the bike shop or measuring your current road bike.",
        "This formula will provide you with a suggested size, but it's not a guaranteed fit.",
        "Double check your math and if you feel that you have made a mistake start over, as this number is essential to sizing a road bike.",
        "For example, if your leg inseam is 80 centimeters, your frame size will be approximately 54 centimeters.",
        "Measure your road bike’s seat tube.",
        "Identify the top of the seat tube, where the seat clamp holds the seat post.",
        "Find the center of the bottom bracket, which is where the axle binds to the road bike’s the crank arms.",
        "With a tape measure, record the distance between these 2 points to find the length of your seat tube.",
        "This distance should match your inseam measurement for a proper road bike frame size.",
        "This measurement is known as a C-T measurement and is used to identify the frame size.",
        "Compare your inseam measurement to the road bike’s C-T measurement.",
        "Identify the correlation between the inseam measurement and the seat tube measurement and record their correlation.",
        "The difference between these measurements should be within 2.54 centimetres (1.00 in) for a properly-sized road bike frame.",
        "If you are buying a new road bike, choose a frame that has a seat tube measurement matching your inseam.",
        "If you are measuring your current road bike, consider purchasing a new frame if the bike’s seat tube measurement differs from your inseam.",
        "Getting the Right Sized Top Tube Measure your torso length.",
        "With a tape measure, record the distance from your hip to your shoulder.",
        "To get an accurate measurement, place a book between your legs vertically, simulating a bicycle seat, and measure from the top of the book to your collarbone.",
        "Measure this distance in inches and write the measurement on a piece of paper.",
        "You can also record this distance by measuring from your hip bone to the top of your shoulder with a tape measure.",
        "Record your arm span.",
        "Spread one arm so that it is parallel with the floor and measure the distance from your fingertips to your shoulder.",
        "For a more accurate measurement, hold a pencil in your hand and measure the distance between the pencil and your collarbone.",
        "Equate your total reach using these measurements.",
        "To find your total reach, add these measurements together, then divide the sum by 2.",
        "Then, add 4 inches (10 cm) to this number and write the sum down on a piece of paper.",
        "Your total reach will be used to find the correct Top Tube measurement on your road bike.",
        "This equation looks like: [(Torso Length + Arm Span) / 2] + 4 inches (10 cm) = Total Reach Find and measure the top tube of the road bike.",
        "With a tape measure, record the distance between the head tube, or where your frame connects to the bike’s handlebars, and the seat tube.",
        "This distance should closely match your total reach in order for you to have a comfortably fitting road bike.",
        "If your top tube length is longer than your total reach, your road bike frame is too big.",
        "If your top tube length is shorter than your total reach, try finding a bigger bike frame that fits your measurements.",
        "As an alternative to replacing the entire frame if the top tube is the wrong size, you can replace the handlebar stem with one that is longer or shorter, depending on what you need.",
        "Making Adjustments to the Road Bike Adjust your seat height for a more comfortable reach.",
        "If your top tube length closely matches your total reach and you still feel uncomfortable on the bicycle, adjusting your seat could solve the problem.",
        "With a wrench, loosen the bolt that connects your seat post to the seat tube.",
        "Using a bike trainer or a doorway to support yourself, you legs should be fully extended with your heel on the pedal.",
        "Raise or lower the seat and tighten the bolt again.",
        "Avoid over-tightening the bolt, which could damage the seat post, particularly if it is made of carbon.",
        "You should have a slight bend in your knee when pedaling.",
        "If there is no bend in your knee when you pedal, your seat is too high.",
        "Make adjustments to the seat height until you feel comfortable and have a slight bend in your knee as you ride.",
        "Level your seat.",
        "Lean your bike against a wall or other flat surface and loosen the bolts underneath the seat.",
        "Use a carpenter’s levelling tool to make small adjustments until the seat is level.",
        "A level seat supports all of your weight without forcing you to use any back or core muscles, gives you full pedal mobility, and allows you to shift your weight on the seat.",
        "If a level seat does not feel comfortable, tipping the seat 3 degrees up or down may help your body positioning.",
        "You can purchase foam pads for your seat if you find it uncomfortable or hard to ride for long periods of time.",
        "Raise or lower your handlebars.",
        "Your back should be at a 45-degree angle when riding and having handlebars that are too high or too low can cause injury and soreness.",
        "Road bike handlebars should be 1 to 4 inches (2.5 to 10.2 cm) lower than the seat for an average rider.",
        "Loosen all the bolts on the stem cap to raise or lower the handlebars.",
        "Adjust the handlebars to your comfort level and then tighten the bolts.",
        "If your bike has a threadless stem, you might need to tighten the bolts to a certain torque in a specific sequence.",
        "If you’re not sure, consult a bike shop.",
        "Most riders like having their handlebars at the same height as their saddle.",
        "The width of your handlebars should be the similar to the width of your shoulders, so consider purchasing a new set if they do not fit your body.",
        "Let a professional adjust your road bike.",
        "If you do not feel comfortable making these adjustments on your own, visit a local bike shop to have a professional fit your bike.",
        "Any bike store will help you make adjustments to your handlebar position, seat height, and will help make sure the frame is the correct size.",
        "Ask questions and be honest with the professional about what feels comfortable and what feels uncomfortable.",
        "Be sure to make an appointment by calling the bike shop ahead of time."
    ]
}