{
    "title": "How to Antique Mirrors",
    "url": "https://www.wikihow.com/Antique-Mirrors",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Glass and Stained Glass Projects"
    ],
    "parts": [
        {
            "name": "Stripping Paint from the Mirror",
            "steps": [
                {
                    "headline": "Put on a pair of latex gloves.",
                    "description": "You should wear gloves when antiquing a mirror to protect your hands from the paints and chemicals you will use. Latex gloves work best because they protect your hands while allowing you maximum dexterity. If you're allergic to latex and cannot use latex gloves, try using a pair of rubber gloves like you'd use to wash dishes. Many online retailers also sell nitrile and other types of gloves. You can purchase latex or rubber gloves at a hardware store or local supermarket."
                },
                {
                    "headline": "Remove the mirror from its frame so the frame isn't damaged or stained.",
                    "description": "Most framed mirrors are backed in cardboard and attached to the frame with staples. Use a flat head screwdriver to pry the staples out of the wood. Be careful when doing this so that you do not accidentally scratch the wooden frame. Once you've pried the staples out by about ⁄8 in (3.2 mm), use a pair of pliers to pull the staples the rest of the way out of the frame. Then, simply lift the mirror out of the frame. Store the frame somewhere safe while you're antiquing the mirror."
                },
                {
                    "headline": "Place the mirror face down on a disposable surface.",
                    "description": "A piece of cardboard works well for this purpose. Handle the mirror gently while you're inverting it to avoid dropping the mirror, which could shatter the glass. If you don't have cardboard handy, you could also stack 2-3 towels (or 20-30 sheets of newspaper) and set the mirror on top of those."
                },
                {
                    "headline": "Apply paint stripper to the back of the mirror.",
                    "description": "Dip a 1 inch (2.5 cm) brush into a can of paint stripper. Brush the painter stripper along the back of the mirror glass. Work in long, vertical strokes to ensure even coverage across the entire surface of the mirror. You can purchase paint stripper at any hardware store or paint supply store."
                },
                {
                    "headline": "Wait 6–7 hours for the paint stripper to dry.",
                    "description": "During this time, leave the mirror undisturbed. Also keep any children or pets away from the drying paint stripper. After 6–7 hours, you should be able to easily remove the paint. If you begin removing the paint and it doesn't come off relatively easily, wait another 2-3 hours for the paint stripper to work."
                },
                {
                    "headline": "Remove 80–90% of the paint with a plastic putty knife.",
                    "description": "To remove the paint, place the putty knife against the back of the mirror at roughly a 45-degree angle. The paint remnants will not be perfectly covered by the patina you'll apply and will give the mirror an authentically antique look. If you remove 100% of the paint, the mirror will not look genuinely antique. So, take some artistic license! Deliberately leave some patches of paint behind in a way that looks good to you."
                },
                {
                    "headline": "Wash the back of the mirror with warm water and soap.",
                    "description": "Add 1-2 squirts of dish soap into a bucket, and fill the bucket with warm water. Dip a clean rag into the bucket, then wring out most of the water. Lightly rub the rag along the surface of the mirror that you've finished stripping paint from. You may need to re-wet your rag 4 or 5 times in order to clean the surface of the mirror."
                },
                {
                    "headline": "Dry the mirror thoroughly with clean rags.",
                    "description": "Grab 2 or 3 clean, dry rags and lightly run them up and down across the entire surface of the mirror to dry it. The mirror should be completely dry before you move on to applying patina."
                },
                {
                    "headline": "Dispose of the pieces of cardboard or old towels.",
                    "description": "Since these materials may have noxious fumes on them, place them in a garbage bag. Tie the bag shut or close it with a rubber band. Then place the bag into a trash can with a lid."
                }
            ]
        },
        {
            "name": "Applying Patina to the Back of the Mirror Glass",
            "steps": [
                {
                    "headline": "Place the mirror face down on a new piece of cardboard.",
                    "description": "As before, you can also use towels, newspaper, or a washable surface. The important thing is that you don't re-use the same cardboard from the prior steps, since it may have paint stripper on it."
                },
                {
                    "headline": "Apply black patina solution to the back of the mirror.",
                    "description": "Dip a 1 inch (2.5 cm) paintbrush into the patina solution, and brush a generous coat along the back of the mirror glass. The black patina solution is basically acid, so it will begin to eat through and tarnish the mirror's surface in about 1 minute. Be sure to keep your latex (or rubber) gloves on while you're doing this, as the patina could burn your hands. You can purchase black patina solution at a local hardware store or paint store."
                },
                {
                    "headline": "Paint on the patina from the edges inwards.",
                    "description": "If you want to replicate a genuine antique look, apply the patina more heavily around the edges of the mirror and lighter in the middle. Work in long strokes that all go in the same direction (e.g., vertical or horizontal). If you find yourself feeling dizzy or lightheaded while applying the patina, take a break and stand outside for 10 minutes. Ventilate your working area when you go back inside to avoid feeling sick again."
                },
                {
                    "headline": "Rinse the mirror when the desired level of antiquing has occurred.",
                    "description": "Keep a close eye on the mirror as the patina tarnishes the surface. Once you're happy with the way the antiquing effect looks, rinse the patina off. This will only take between 2 and 5 minutes. Do this by dipping a clean rag into a bucket of water. Wring out about half of the water from the rag, and rub it across the patina-covered surface of the mirror. Repeat this process until the patina has been rinsed off of the mirror. Water neutralizes the acid and will stop the antiquing effect of the patina."
                },
                {
                    "headline": "Allow the mirror to air dry overnight.",
                    "description": "The back surface of the mirror will be wet at this point, since you've saturated it with patina and rinsed it with water. Letting it dry for 8–10 hours overnight would be best, so that you don't find yourself applying paint to a still-damp mirror."
                },
                {
                    "headline": "Apply glass paint to the entirety of the back of the mirror.",
                    "description": "Choose black, silver, or gold glass paint for the most antique look. Use a new 1 inch (2.5 cm) paintbrush. Dip the brush into the paint and then apply a generous coat to the glass. Work from the outer edges inward. Whatever color of paint you choose will show through where the patina solution created spots on the mirror's back. Glass paints will adhere to the back of the mirror most effectively since they're formulated specifically to be applied to glass. You can also use an acrylic paint to paint the back of the mirror. Also consider painting the back with a combination of dark and light paint colors."
                },
                {
                    "headline": "Wait 4–5 hours until the paint has dried.",
                    "description": "If you're not sure if the paint is dry or not, lightly tap the tip of 1 finger on the edge of the painted surface. If your finger comes away clean, the paint is dry. If your finger comes away with a smudge of paint on it, give the mirror 2–3 more hours to finish drying."
                },
                {
                    "headline": "Reassemble the mirror by reinserting the staples into the frame.",
                    "description": "Once the paint on the mirror has dried, it's ready to be put back together. Line the sturdy staples back up with the holes that you pulled them out of. Then, use a hammer to lightly tap the staples back in place. Once the mirror is reassembled, hang the mirror in the desired location. If you'd rather not have the mirror hanging on the wall, try setting it above your mantel to add visual interest to your hearth and fireplace."
                },
                {
                    "headline": "Clean the brushes with soap and water.",
                    "description": "Remove all of the paint stripper, patina, and paint from your brushes before putting them away. First, rinse the paint stripper off with tap water. Put a little hand soap on the bristles, and rub the soap around before rinsing the brush with water again. Dry the bristles with a paper towel. Be sure to never store a brush with its bristles wet, as they'll stick together."
                }
            ]
        }
    ],
    "tyn": [
        "Gloves (preferably latex)",
        "Framed mirror",
        "Cardboard",
        "Clean rags",
        "Paint stripper",
        "3 1 inch (2.5 cm) paintbrush",
        "Putty knife",
        "Bucket",
        "Soap and water",
        "Black patina solution",
        "Paint (black, gold, or silver)",
        "Hammer"
    ],
    "text": " Stripping Paint from the Mirror Put on a pair of latex gloves. You should wear gloves when antiquing a mirror to protect your hands from the paints and chemicals you will use. Latex gloves work best because they protect your hands while allowing you maximum dexterity. If you're allergic to latex and cannot use latex gloves, try using a pair of rubber gloves like you'd use to wash dishes. Many online retailers also sell nitrile and other types of gloves. You can purchase latex or rubber gloves at a hardware store or local supermarket. Remove the mirror from its frame so the frame isn't damaged or stained. Most framed mirrors are backed in cardboard and attached to the frame with staples. Use a flat head screwdriver to pry the staples out of the wood. Be careful when doing this so that you do not accidentally scratch the wooden frame. Once you've pried the staples out by about ⁄8 in (3.2 mm), use a pair of pliers to pull the staples the rest of the way out of the frame. Then, simply lift the mirror out of the frame. Store the frame somewhere safe while you're antiquing the mirror. Place the mirror face down on a disposable surface. A piece of cardboard works well for this purpose. Handle the mirror gently while you're inverting it to avoid dropping the mirror, which could shatter the glass. If you don't have cardboard handy, you could also stack 2-3 towels (or 20-30 sheets of newspaper) and set the mirror on top of those. Apply paint stripper to the back of the mirror. Dip a 1 inch (2.5 cm) brush into a can of paint stripper. Brush the painter stripper along the back of the mirror glass. Work in long, vertical strokes to ensure even coverage across the entire surface of the mirror. You can purchase paint stripper at any hardware store or paint supply store. Wait 6–7 hours for the paint stripper to dry. During this time, leave the mirror undisturbed. Also keep any children or pets away from the drying paint stripper. After 6–7 hours, you should be able to easily remove the paint. If you begin removing the paint and it doesn't come off relatively easily, wait another 2-3 hours for the paint stripper to work. Remove 80–90% of the paint with a plastic putty knife. To remove the paint, place the putty knife against the back of the mirror at roughly a 45-degree angle. The paint remnants will not be perfectly covered by the patina you'll apply and will give the mirror an authentically antique look. If you remove 100% of the paint, the mirror will not look genuinely antique. So, take some artistic license! Deliberately leave some patches of paint behind in a way that looks good to you. Wash the back of the mirror with warm water and soap. Add 1-2 squirts of dish soap into a bucket, and fill the bucket with warm water. Dip a clean rag into the bucket, then wring out most of the water. Lightly rub the rag along the surface of the mirror that you've finished stripping paint from. You may need to re-wet your rag 4 or 5 times in order to clean the surface of the mirror. Dry the mirror thoroughly with clean rags. Grab 2 or 3 clean, dry rags and lightly run them up and down across the entire surface of the mirror to dry it. The mirror should be completely dry before you move on to applying patina. Dispose of the pieces of cardboard or old towels. Since these materials may have noxious fumes on them, place them in a garbage bag. Tie the bag shut or close it with a rubber band. Then place the bag into a trash can with a lid. Applying Patina to the Back of the Mirror Glass Place the mirror face down on a new piece of cardboard. As before, you can also use towels, newspaper, or a washable surface. The important thing is that you don't re-use the same cardboard from the prior steps, since it may have paint stripper on it. Apply black patina solution to the back of the mirror. Dip a 1 inch (2.5 cm) paintbrush into the patina solution, and brush a generous coat along the back of the mirror glass. The black patina solution is basically acid, so it will begin to eat through and tarnish the mirror's surface in about 1 minute. Be sure to keep your latex (or rubber) gloves on while you're doing this, as the patina could burn your hands. You can purchase black patina solution at a local hardware store or paint store. Paint on the patina from the edges inwards. If you want to replicate a genuine antique look, apply the patina more heavily around the edges of the mirror and lighter in the middle. Work in long strokes that all go in the same direction (e.g., vertical or horizontal). If you find yourself feeling dizzy or lightheaded while applying the patina, take a break and stand outside for 10 minutes. Ventilate your working area when you go back inside to avoid feeling sick again. Rinse the mirror when the desired level of antiquing has occurred. Keep a close eye on the mirror as the patina tarnishes the surface. Once you're happy with the way the antiquing effect looks, rinse the patina off. This will only take between 2 and 5 minutes. Do this by dipping a clean rag into a bucket of water. Wring out about half of the water from the rag, and rub it across the patina-covered surface of the mirror. Repeat this process until the patina has been rinsed off of the mirror. Water neutralizes the acid and will stop the antiquing effect of the patina. Allow the mirror to air dry overnight. The back surface of the mirror will be wet at this point, since you've saturated it with patina and rinsed it with water. Letting it dry for 8–10 hours overnight would be best, so that you don't find yourself applying paint to a still-damp mirror. Apply glass paint to the entirety of the back of the mirror. Choose black, silver, or gold glass paint for the most antique look. Use a new 1 inch (2.5 cm) paintbrush. Dip the brush into the paint and then apply a generous coat to the glass. Work from the outer edges inward. Whatever color of paint you choose will show through where the patina solution created spots on the mirror's back. Glass paints will adhere to the back of the mirror most effectively since they're formulated specifically to be applied to glass. You can also use an acrylic paint to paint the back of the mirror. Also consider painting the back with a combination of dark and light paint colors. Wait 4–5 hours until the paint has dried. If you're not sure if the paint is dry or not, lightly tap the tip of 1 finger on the edge of the painted surface. If your finger comes away clean, the paint is dry. If your finger comes away with a smudge of paint on it, give the mirror 2–3 more hours to finish drying. Reassemble the mirror by reinserting the staples into the frame. Once the paint on the mirror has dried, it's ready to be put back together. Line the sturdy staples back up with the holes that you pulled them out of. Then, use a hammer to lightly tap the staples back in place. Once the mirror is reassembled, hang the mirror in the desired location. If you'd rather not have the mirror hanging on the wall, try setting it above your mantel to add visual interest to your hearth and fireplace. Clean the brushes with soap and water. Remove all of the paint stripper, patina, and paint from your brushes before putting them away. First, rinse the paint stripper off with tap water. Put a little hand soap on the bristles, and rub the soap around before rinsing the brush with water again. Dry the bristles with a paper towel. Be sure to never store a brush with its bristles wet, as they'll stick together.",
    "sentences": [
        " Stripping Paint from the Mirror Put on a pair of latex gloves.",
        "You should wear gloves when antiquing a mirror to protect your hands from the paints and chemicals you will use.",
        "Latex gloves work best because they protect your hands while allowing you maximum dexterity.",
        "If you're allergic to latex and cannot use latex gloves, try using a pair of rubber gloves like you'd use to wash dishes.",
        "Many online retailers also sell nitrile and other types of gloves.",
        "You can purchase latex or rubber gloves at a hardware store or local supermarket.",
        "Remove the mirror from its frame so the frame isn't damaged or stained.",
        "Most framed mirrors are backed in cardboard and attached to the frame with staples.",
        "Use a flat head screwdriver to pry the staples out of the wood.",
        "Be careful when doing this so that you do not accidentally scratch the wooden frame.",
        "Once you've pried the staples out by about ⁄8 in (3.2 mm), use a pair of pliers to pull the staples the rest of the way out of the frame.",
        "Then, simply lift the mirror out of the frame.",
        "Store the frame somewhere safe while you're antiquing the mirror.",
        "Place the mirror face down on a disposable surface.",
        "A piece of cardboard works well for this purpose.",
        "Handle the mirror gently while you're inverting it to avoid dropping the mirror, which could shatter the glass.",
        "If you don't have cardboard handy, you could also stack 2-3 towels (or 20-30 sheets of newspaper) and set the mirror on top of those.",
        "Apply paint stripper to the back of the mirror.",
        "Dip a 1 inch (2.5 cm) brush into a can of paint stripper.",
        "Brush the painter stripper along the back of the mirror glass.",
        "Work in long, vertical strokes to ensure even coverage across the entire surface of the mirror.",
        "You can purchase paint stripper at any hardware store or paint supply store.",
        "Wait 6–7 hours for the paint stripper to dry.",
        "During this time, leave the mirror undisturbed.",
        "Also keep any children or pets away from the drying paint stripper.",
        "After 6–7 hours, you should be able to easily remove the paint.",
        "If you begin removing the paint and it doesn't come off relatively easily, wait another 2-3 hours for the paint stripper to work.",
        "Remove 80–90% of the paint with a plastic putty knife.",
        "To remove the paint, place the putty knife against the back of the mirror at roughly a 45-degree angle.",
        "The paint remnants will not be perfectly covered by the patina you'll apply and will give the mirror an authentically antique look.",
        "If you remove 100% of the paint, the mirror will not look genuinely antique.",
        "So, take some artistic license!",
        "Deliberately leave some patches of paint behind in a way that looks good to you.",
        "Wash the back of the mirror with warm water and soap.",
        "Add 1-2 squirts of dish soap into a bucket, and fill the bucket with warm water.",
        "Dip a clean rag into the bucket, then wring out most of the water.",
        "Lightly rub the rag along the surface of the mirror that you've finished stripping paint from.",
        "You may need to re-wet your rag 4 or 5 times in order to clean the surface of the mirror.",
        "Dry the mirror thoroughly with clean rags.",
        "Grab 2 or 3 clean, dry rags and lightly run them up and down across the entire surface of the mirror to dry it.",
        "The mirror should be completely dry before you move on to applying patina.",
        "Dispose of the pieces of cardboard or old towels.",
        "Since these materials may have noxious fumes on them, place them in a garbage bag.",
        "Tie the bag shut or close it with a rubber band.",
        "Then place the bag into a trash can with a lid.",
        "Applying Patina to the Back of the Mirror Glass Place the mirror face down on a new piece of cardboard.",
        "As before, you can also use towels, newspaper, or a washable surface.",
        "The important thing is that you don't re-use the same cardboard from the prior steps, since it may have paint stripper on it.",
        "Apply black patina solution to the back of the mirror.",
        "Dip a 1 inch (2.5 cm) paintbrush into the patina solution, and brush a generous coat along the back of the mirror glass.",
        "The black patina solution is basically acid, so it will begin to eat through and tarnish the mirror's surface in about 1 minute.",
        "Be sure to keep your latex (or rubber) gloves on while you're doing this, as the patina could burn your hands.",
        "You can purchase black patina solution at a local hardware store or paint store.",
        "Paint on the patina from the edges inwards.",
        "If you want to replicate a genuine antique look, apply the patina more heavily around the edges of the mirror and lighter in the middle.",
        "Work in long strokes that all go in the same direction (e.g., vertical or horizontal).",
        "If you find yourself feeling dizzy or lightheaded while applying the patina, take a break and stand outside for 10 minutes.",
        "Ventilate your working area when you go back inside to avoid feeling sick again.",
        "Rinse the mirror when the desired level of antiquing has occurred.",
        "Keep a close eye on the mirror as the patina tarnishes the surface.",
        "Once you're happy with the way the antiquing effect looks, rinse the patina off.",
        "This will only take between 2 and 5 minutes.",
        "Do this by dipping a clean rag into a bucket of water.",
        "Wring out about half of the water from the rag, and rub it across the patina-covered surface of the mirror.",
        "Repeat this process until the patina has been rinsed off of the mirror.",
        "Water neutralizes the acid and will stop the antiquing effect of the patina.",
        "Allow the mirror to air dry overnight.",
        "The back surface of the mirror will be wet at this point, since you've saturated it with patina and rinsed it with water.",
        "Letting it dry for 8–10 hours overnight would be best, so that you don't find yourself applying paint to a still-damp mirror.",
        "Apply glass paint to the entirety of the back of the mirror.",
        "Choose black, silver, or gold glass paint for the most antique look.",
        "Use a new 1 inch (2.5 cm) paintbrush.",
        "Dip the brush into the paint and then apply a generous coat to the glass.",
        "Work from the outer edges inward.",
        "Whatever color of paint you choose will show through where the patina solution created spots on the mirror's back.",
        "Glass paints will adhere to the back of the mirror most effectively since they're formulated specifically to be applied to glass.",
        "You can also use an acrylic paint to paint the back of the mirror.",
        "Also consider painting the back with a combination of dark and light paint colors.",
        "Wait 4–5 hours until the paint has dried.",
        "If you're not sure if the paint is dry or not, lightly tap the tip of 1 finger on the edge of the painted surface.",
        "If your finger comes away clean, the paint is dry.",
        "If your finger comes away with a smudge of paint on it, give the mirror 2–3 more hours to finish drying.",
        "Reassemble the mirror by reinserting the staples into the frame.",
        "Once the paint on the mirror has dried, it's ready to be put back together.",
        "Line the sturdy staples back up with the holes that you pulled them out of.",
        "Then, use a hammer to lightly tap the staples back in place.",
        "Once the mirror is reassembled, hang the mirror in the desired location.",
        "If you'd rather not have the mirror hanging on the wall, try setting it above your mantel to add visual interest to your hearth and fireplace.",
        "Clean the brushes with soap and water.",
        "Remove all of the paint stripper, patina, and paint from your brushes before putting them away.",
        "First, rinse the paint stripper off with tap water.",
        "Put a little hand soap on the bristles, and rub the soap around before rinsing the brush with water again.",
        "Dry the bristles with a paper towel.",
        "Be sure to never store a brush with its bristles wet, as they'll stick together."
    ]
}