{
    "title": "How to Make Chocolate Brownies",
    "url": "https://www.wikihow.com/Make-Chocolate-Brownies",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Baking",
        "Cakes",
        "Brownies"
    ],
    "methods": [
        {
            "name": "Baking Basic Chocolate Brownies",
            "steps": [
                {
                    "headline": "Do the prep work.",
                    "description": "Set the oven rack to the middle position, and heat the oven to 350ºF (180°C). Grease the baking dish, making sure to get all the corners."
                },
                {
                    "headline": "Blend dry ingredients.",
                    "description": "In a small bowl, whisk together the flour, baking powder, and salt"
                },
                {
                    "headline": "Prepare the chocolate.",
                    "description": "In a medium-sized saucepan or double boiler, slowly melt the chopped chocolate and butter until thoroughly combined. Stir occasionally. When done, remove from heat."
                },
                {
                    "headline": "Add sugar.",
                    "description": "Whisk the sugar a few tablespoons at a time into the chocolate mixture until combined. Then whisk in dry ingredients."
                },
                {
                    "headline": "Add beaten eggs to the mixture.",
                    "description": "Whisk well, and then add the vanilla. Whisk until the batter is thoroughly combined, then pour into the greased baking dish."
                },
                {
                    "headline": "Bake it in the oven for approximately 30 minutes.",
                    "description": "Test for doneness by inserting a toothpick into the center. If it comes out with batter, it's not done yet. If it comes out dry, take it out. Ideally, you want to have some crumb attached to the toothpick so your brownies will be just right! The outsides will be crisp with the insides remaining sticky."
                },
                {
                    "headline": "Cool on a wire rack for an hour or two.",
                    "description": "Top with confectioner's sugar and toasted nuts if desired."
                },
                {
                    "headline": "Enjoy!",
                    "description": ""
                }
            ]
        },
        {
            "name": "Baking Chewy Chocolate Brownies",
            "steps": [
                {
                    "headline": "Preheat the oven to 300° F (150° C).",
                    "description": "Grease a baking dish with room-temperature butter. Sprinkle a light amount of flour onto the greased pan, covering completely. Pick a pan that is big enough. Brownies are traditionally flat, meaning that you should pick a bigger pan over a smaller one. Smaller pans will necessitate more time in the oven."
                },
                {
                    "headline": "Melt the butter over low heat.",
                    "description": "Alternately, melt the butter in a microwave until just fully melted. Let cool."
                },
                {
                    "headline": "Add the remaining wet ingredients.",
                    "description": "Add the sugar, mixing thoroughly. Add the vanilla extract and eggs, beating until just incorporated."
                },
                {
                    "headline": "Mix the dry ingredients, in a separate bowl.",
                    "description": "Mix the cocoa powder, flour, salt, and baking powder. Mixing the dry ingredients completely before transferring into the wet ingredients will cut down on the amount of time you mix the batter. The less the batter is mixed, the creamier and fluffier your brownies will turn out."
                },
                {
                    "headline": "Incorporate the dry ingredients into the wet ingredients.",
                    "description": "Mix until just barely incorporated."
                },
                {
                    "headline": "Pour the brownie batter into the greased and floured pan.",
                    "description": "Spread batter evenly."
                },
                {
                    "headline": "Cook in the oven at 300° F for 30 minutes.",
                    "description": "Perform the toothpick test to check for doneness. Leave brownies to cool for at least 10 minutes."
                },
                {
                    "headline": "Cool the brownies.",
                    "description": "Once cooled, dust them with confectioners' sugar. Dust an even layer across the brownies."
                },
                {
                    "headline": "Cut the brownies.",
                    "description": "Enjoy!"
                }
            ]
        },
        {
            "name": "Baking Caramel Brownies",
            "steps": [
                {
                    "headline": "Preheat oven to 350° F (177° C).",
                    "description": "Grease a baking dish with room-temperature butter. Sprinkle a light amount of flour onto the greased pan, covering completely."
                },
                {
                    "headline": "Melt the butter over low heat.",
                    "description": "Alternately, melt the butter in a microwave until just fully melted. Let cool."
                },
                {
                    "headline": "Combine the melted butter and evaporated milk once the butter has cooled.",
                    "description": "These will be your wet ingredients."
                },
                {
                    "headline": "Combine the cake mix into the wet ingredients.",
                    "description": "Mix until just barely incorporated, but fully mixed."
                },
                {
                    "headline": "Pour 2/3 of the brownie batter into the greased and floured pan.",
                    "description": "Sprinkle chopped walnuts over mixture."
                },
                {
                    "headline": "Bake at 350° F (177° C) for 8 to 10 minutes.",
                    "description": ""
                },
                {
                    "headline": "Melt caramels and the rest of the evaporated milk into a sauce.",
                    "description": "Melt over medium heat."
                },
                {
                    "headline": "Remove brownies from oven after 8 to 10 minutes.",
                    "description": "Pour all caramel sauce over brownies and top with the rest of the brownie batter. Sprinkle chocolate chips on top of brownie batter."
                },
                {
                    "headline": "Bake for an additional 15 to 18 minutes.",
                    "description": "Allow brownies to cool. Cut the brownies and enjoy!"
                }
            ]
        }
    ],
    "tyn": [
        "Saucepan or double boiler",
        "Oven",
        "Whisk",
        "Wooden spoon",
        "Spatula",
        "2 bowls",
        "Baking dish"
    ],
    "text": " Baking Basic Chocolate Brownies Do the prep work. Set the oven rack to the middle position, and heat the oven to 350ºF (180°C). Grease the baking dish, making sure to get all the corners. Blend dry ingredients. In a small bowl, whisk together the flour, baking powder, and salt Prepare the chocolate. In a medium-sized saucepan or double boiler, slowly melt the chopped chocolate and butter until thoroughly combined. Stir occasionally. When done, remove from heat. Add sugar. Whisk the sugar a few tablespoons at a time into the chocolate mixture until combined. Then whisk in dry ingredients. Add beaten eggs to the mixture. Whisk well, and then add the vanilla. Whisk until the batter is thoroughly combined, then pour into the greased baking dish. Bake it in the oven for approximately 30 minutes. Test for doneness by inserting a toothpick into the center. If it comes out with batter, it's not done yet. If it comes out dry, take it out. Ideally, you want to have some crumb attached to the toothpick so your brownies will be just right! The outsides will be crisp with the insides remaining sticky. Cool on a wire rack for an hour or two. Top with confectioner's sugar and toasted nuts if desired. Enjoy!  Baking Chewy Chocolate Brownies Preheat the oven to 300° F (150° C). Grease a baking dish with room-temperature butter. Sprinkle a light amount of flour onto the greased pan, covering completely. Pick a pan that is big enough. Brownies are traditionally flat, meaning that you should pick a bigger pan over a smaller one. Smaller pans will necessitate more time in the oven. Melt the butter over low heat. Alternately, melt the butter in a microwave until just fully melted. Let cool. Add the remaining wet ingredients. Add the sugar, mixing thoroughly. Add the vanilla extract and eggs, beating until just incorporated. Mix the dry ingredients, in a separate bowl. Mix the cocoa powder, flour, salt, and baking powder. Mixing the dry ingredients completely before transferring into the wet ingredients will cut down on the amount of time you mix the batter. The less the batter is mixed, the creamier and fluffier your brownies will turn out. Incorporate the dry ingredients into the wet ingredients. Mix until just barely incorporated. Pour the brownie batter into the greased and floured pan. Spread batter evenly. Cook in the oven at 300° F for 30 minutes. Perform the toothpick test to check for doneness. Leave brownies to cool for at least 10 minutes. Cool the brownies. Once cooled, dust them with confectioners' sugar. Dust an even layer across the brownies. Cut the brownies. Enjoy! Baking Caramel Brownies Preheat oven to 350° F (177° C). Grease a baking dish with room-temperature butter. Sprinkle a light amount of flour onto the greased pan, covering completely. Melt the butter over low heat. Alternately, melt the butter in a microwave until just fully melted. Let cool. Combine the melted butter and evaporated milk once the butter has cooled. These will be your wet ingredients. Combine the cake mix into the wet ingredients. Mix until just barely incorporated, but fully mixed. Pour 2/3 of the brownie batter into the greased and floured pan. Sprinkle chopped walnuts over mixture. Bake at 350° F (177° C) for 8 to 10 minutes.  Melt caramels and the rest of the evaporated milk into a sauce. Melt over medium heat. Remove brownies from oven after 8 to 10 minutes. Pour all caramel sauce over brownies and top with the rest of the brownie batter. Sprinkle chocolate chips on top of brownie batter. Bake for an additional 15 to 18 minutes. Allow brownies to cool. Cut the brownies and enjoy!",
    "sentences": [
        " Baking Basic Chocolate Brownies Do the prep work.",
        "Set the oven rack to the middle position, and heat the oven to 350ºF (180°C).",
        "Grease the baking dish, making sure to get all the corners.",
        "Blend dry ingredients.",
        "In a small bowl, whisk together the flour, baking powder, and salt Prepare the chocolate.",
        "In a medium-sized saucepan or double boiler, slowly melt the chopped chocolate and butter until thoroughly combined.",
        "Stir occasionally.",
        "When done, remove from heat.",
        "Add sugar.",
        "Whisk the sugar a few tablespoons at a time into the chocolate mixture until combined.",
        "Then whisk in dry ingredients.",
        "Add beaten eggs to the mixture.",
        "Whisk well, and then add the vanilla.",
        "Whisk until the batter is thoroughly combined, then pour into the greased baking dish.",
        "Bake it in the oven for approximately 30 minutes.",
        "Test for doneness by inserting a toothpick into the center.",
        "If it comes out with batter, it's not done yet.",
        "If it comes out dry, take it out.",
        "Ideally, you want to have some crumb attached to the toothpick so your brownies will be just right!",
        "The outsides will be crisp with the insides remaining sticky.",
        "Cool on a wire rack for an hour or two.",
        "Top with confectioner's sugar and toasted nuts if desired.",
        "Enjoy!",
        "Baking Chewy Chocolate Brownies Preheat the oven to 300° F (150° C).",
        "Grease a baking dish with room-temperature butter.",
        "Sprinkle a light amount of flour onto the greased pan, covering completely.",
        "Pick a pan that is big enough.",
        "Brownies are traditionally flat, meaning that you should pick a bigger pan over a smaller one.",
        "Smaller pans will necessitate more time in the oven.",
        "Melt the butter over low heat.",
        "Alternately, melt the butter in a microwave until just fully melted.",
        "Let cool.",
        "Add the remaining wet ingredients.",
        "Add the sugar, mixing thoroughly.",
        "Add the vanilla extract and eggs, beating until just incorporated.",
        "Mix the dry ingredients, in a separate bowl.",
        "Mix the cocoa powder, flour, salt, and baking powder.",
        "Mixing the dry ingredients completely before transferring into the wet ingredients will cut down on the amount of time you mix the batter.",
        "The less the batter is mixed, the creamier and fluffier your brownies will turn out.",
        "Incorporate the dry ingredients into the wet ingredients.",
        "Mix until just barely incorporated.",
        "Pour the brownie batter into the greased and floured pan.",
        "Spread batter evenly.",
        "Cook in the oven at 300° F for 30 minutes.",
        "Perform the toothpick test to check for doneness.",
        "Leave brownies to cool for at least 10 minutes.",
        "Cool the brownies.",
        "Once cooled, dust them with confectioners' sugar.",
        "Dust an even layer across the brownies.",
        "Cut the brownies.",
        "Enjoy!",
        "Baking Caramel Brownies Preheat oven to 350° F (177° C).",
        "Grease a baking dish with room-temperature butter.",
        "Sprinkle a light amount of flour onto the greased pan, covering completely.",
        "Melt the butter over low heat.",
        "Alternately, melt the butter in a microwave until just fully melted.",
        "Let cool.",
        "Combine the melted butter and evaporated milk once the butter has cooled.",
        "These will be your wet ingredients.",
        "Combine the cake mix into the wet ingredients.",
        "Mix until just barely incorporated, but fully mixed.",
        "Pour 2/3 of the brownie batter into the greased and floured pan.",
        "Sprinkle chopped walnuts over mixture.",
        "Bake at 350° F (177° C) for 8 to 10 minutes.",
        "Melt caramels and the rest of the evaporated milk into a sauce.",
        "Melt over medium heat.",
        "Remove brownies from oven after 8 to 10 minutes.",
        "Pour all caramel sauce over brownies and top with the rest of the brownie batter.",
        "Sprinkle chocolate chips on top of brownie batter.",
        "Bake for an additional 15 to 18 minutes.",
        "Allow brownies to cool.",
        "Cut the brownies and enjoy!"
    ]
}