{
    "title": "How to Glaze a Cabinet",
    "url": "https://www.wikihow.com/Glaze-a-Cabinet",
    "category_hierarchy": [
        "Home and Garden",
        "Furniture",
        "Cabinets and Cupboards"
    ],
    "parts": [
        {
            "name": "Masking and Prepping the Area",
            "steps": [
                {
                    "headline": "Cover the floors and other nearby surfaces with drop-cloths.",
                    "description": "Take care to protect any and all surfaces near your cabinets that you don’t want to glaze before you get started. Glaze is designed to stick to things, so make sure it only sticks to the surfaces you want to transform with glaze. If you don’t have drop cloths, you can use plastic garbage bags, cardboard, or construction paper. Just make sure you adequately cover all nearby surfaces."
                },
                {
                    "headline": "Tape off the walls around the edges of the cabinets with painter's tape.",
                    "description": "Cover each and every wall adjacent to your cabinets. Apply the tape in pieces that are just a few feet long to avoid it from tangling and bunching, and press each piece into the wall to help it stick and avoid glaze from seeping under the tape. It’s better to spend a bit of extra time prepping the area than to have to repaint your walls because you missed a spot."
                },
                {
                    "headline": "Lay down drop cloths in a well-ventilated area for glazing cabinet doors.",
                    "description": "Use your garage or an outdoor space on your deck or lawn if the weather is warm, dry, and not too windy. Otherwise, you can aid ventilation in an indoor space by opening windows and doors. Glazes and stains contain harsh chemicals that can omit strong and unpleasant odors. Glazing the cabinet doors in a properly ventilated area will limit the amount of chemicals you breathe in while glazing, especially if your cabinets are not in a room with good airflow."
                }
            ]
        },
        {
            "name": "Removing the Doors and Cleaning the Cabinets",
            "steps": [
                {
                    "headline": "Use a screwdriver to remove the cabinet doors.",
                    "description": "Take out all the screws from the door’s hinges to separate them from the cabinets completely. If you have multiple cabinet doors to glaze, keep track of each door by working around the room from left to right, removing the screws from top to bottom. It’s helpful to put each screw in a plastic bag as soon as you remove it, as they’re easy to lose."
                },
                {
                    "headline": "Place the cabinet doors on the drop-cloths in the ventilated area.",
                    "description": "Lay them face up on the cloth, cardboard, or garbage bags you laid out and double check that you’ve removed all of the hardware and screws from the doors."
                },
                {
                    "headline": "Remove any remaining hardware from the cabinets with the screwdriver.",
                    "description": "Make sure to put all the remaining hardware into the plastic bag with the other screws, so they don’t get misplaced while you’re glazing your cabinets. This will help you avoid getting the glaze on the hardware and allow you to achieve a cleaner finished look."
                },
                {
                    "headline": "Wash the cabinets and doors with a sponge, mild soap, and clean water.",
                    "description": "Be as thorough as you can be and try to get into all the nooks and crannies. If you haven’t cleaned your cabinets in awhile, you may want to use a vacuum first to get rid of any cobwebs or excess dust before washing with soap and water. Cleaning the cabinets will prevent dust and other particles from getting caught in the glaze while you’re applying it."
                },
                {
                    "headline": "Open any windows and doors near your cabinets to improve airflow.",
                    "description": "If possible, open windows and doors on separate sides of the room to cross-ventilate the air. Not only will this help the cabinets dry more quickly after you’ve washed them, but it will also keep the air more clean and fresh while you’re glazing."
                },
                {
                    "headline": "Leave the cabinets and doors to dry for at least 2 hours before glazing.",
                    "description": "Allow your cabinets to dry for a few hours after you’ve washed them with soap and water to ensure no excess water mixes with your glaze, which could dilute it. Alternatively, if you don’t have time to let the cabinets air dry, you can wipe them dry with a clean rag."
                }
            ]
        },
        {
            "name": "Applying the Glaze",
            "steps": [
                {
                    "headline": "Open the container of glaze and mix well with a paint stirrer.",
                    "description": "You want to do this just before you’re ready to begin applying the glaze. This will make the glaze easier to work with and help it go on more smoothly and evenly. Glaze comes in 2 varieties: oil-based and water-based. Oil-based glaze is ideal for stained cabinets, while water-based glaze is better suited to painted cabinets. If you want to mix your own glaze, rather than buying a ready-to-use one, you can buy a clear glaze and mix it with latex paint in the color of your choice. If you choose to mix your own, make sure to follow the instructions on the clear glaze container for the best results."
                },
                {
                    "headline": "Apply the glaze to a small section of the cabinets using a foam brush.",
                    "description": "Start with a less visible part of the cabinets, covering a 2–3 ft (0.61–0.91 m) section to begin with. Go with the grain, rather than against it. Apply a liberal amount, making sure to thoroughly coat the section and ensure the glaze gets into any recesses of the cabinets. Once applied, the glaze should appear uneven and darker than your desired results. It’s a good idea to have multiple foam brushes available in different sizes and shapes to help you cover every part of the cabinets. You may also choose to apply the glaze with a clean rag, rubbing it into the cabinets using a circular motion."
                },
                {
                    "headline": "Wipe off the excess glaze with a clean rag.",
                    "description": "Remove the bulk of the glaze until you can clearly see the grain of the wood or the paint color underneath. Continue to wipe, using circular motions, until you’re satisfied with the results. If you like the look of the glaze, but want it a little darker, re-apply the glaze to the same section and leave it to sit for 5 to 10 minutes before wiping it off. If you don’t like the results, or decide you want to use a different color, you can remove the glaze using paint thinner and a clean rag."
                },
                {
                    "headline": "Continue glazing and wiping in sections until the cabinets are covered.",
                    "description": "Use the exact same process you did with the first section to achieve a uniform look. As you work around corners and crevices, make sure the glaze gets into those areas. If you have trouble wiping it away with the cloth, you can use a cotton swab or clean foam brush instead. Working in 2–3 ft (0.61–0.91 m) sections instead of glazing every surface of the cabinets at once allows you to fix any mistakes and evaluate your work before the glaze dries."
                },
                {
                    "headline": "Glaze the doors using the same process you did with the cabinets.",
                    "description": "Use the same number of coats in order to achieve a cohesive look once the doors are reattached. You want the cabinets and doors to match in color and texture as closely as possible. It’s up to you whether or not you want to glaze the inside of the doors as well as the outside. If you do decide to glaze the inside, make sure you let the outside dry thoroughly before you turn the door over to avoid ruining your work."
                },
                {
                    "headline": "Leave the cabinets to dry for at least 24 hours.",
                    "description": "Generally, this is enough time for the glaze to completely dry. However, it’s a good idea to check the glaze container for specific manufacturer guidelines on drying times."
                }
            ]
        },
        {
            "name": "Touching Up and Cleaning",
            "steps": [
                {
                    "headline": "Inspect the cabinets for flaws and consider adding more to the grooves.",
                    "description": "Don’t forget to check corners, crevices, and any recessed areas in the cabinets and doors, as these places are easy to miss. There may be areas where there isn’t quite enough glaze, and other places where extra glaze has collected during the drying process. This is also the time to decide if there are any areas you want an extra layer of glaze, to achieve a more dramatic look. For example, you can apply an additional layer of glaze in the grooves of the cabinet doors if you want more dimension."
                },
                {
                    "headline": "Touch up any areas as needed.",
                    "description": "Apply another layer of glaze to any areas needing touch-ups, using the same process you did the first time. For the best results, only apply a small amount of glaze in exactly the places you want to touch up, and then wipe clean. If there are any spots of glaze that need to be removed, do this using paint thinner."
                },
                {
                    "headline": "Clean the foam brushes in mineral spirits and dispose of the rags.",
                    "description": "Fill a small cup full of mineral spirits and gently dip the foam brushes into it, swirling them around a few times to help dissolve the remaining glaze. This will prevent the brushes from becoming stiff and allow you to use them for future touch-ups or other glazing projects. While you can also clean the rags using the same method, it requires a great deal of mineral spirits to dissolve all the glaze, so it’s easiest to simply throw them away."
                },
                {
                    "headline": "Remove the painter’s tape and drop cloths.",
                    "description": "Grab each piece of tape at the corner and peel the tape back slowly, holding the end of each piece at approximately a 45-degree angle. It’s important to take your time with this process and try to keep each piece intact as you remove it. You don’t want to leave behind small pieces of painter’s tape, which can be difficult to remove. It’s a good idea to store your drop cloths rather than throwing them away. They may be useful for future glazing, staining, or painting projects."
                },
                {
                    "headline": "Reattach the cabinet doors and hardware using the screwdriver.",
                    "description": "Once the cabinets are completely dry and you’re satisfied with the color and evenness, it’s time to reassemble them and admire your results!"
                }
            ]
        }
    ],
    "tyn": [
        "Drop-cloths or plastic",
        "Painter's tape",
        "Screwdriver",
        "Plastic bag",
        "Sponge",
        "Mild soap",
        "Clean water",
        "Paint stirrer",
        "Glaze",
        "Foam brushes",
        "Clean rags",
        "Mineral spirits"
    ],
    "text": " Masking and Prepping the Area Cover the floors and other nearby surfaces with drop-cloths. Take care to protect any and all surfaces near your cabinets that you don’t want to glaze before you get started. Glaze is designed to stick to things, so make sure it only sticks to the surfaces you want to transform with glaze. If you don’t have drop cloths, you can use plastic garbage bags, cardboard, or construction paper. Just make sure you adequately cover all nearby surfaces. Tape off the walls around the edges of the cabinets with painter's tape. Cover each and every wall adjacent to your cabinets. Apply the tape in pieces that are just a few feet long to avoid it from tangling and bunching, and press each piece into the wall to help it stick and avoid glaze from seeping under the tape. It’s better to spend a bit of extra time prepping the area than to have to repaint your walls because you missed a spot. Lay down drop cloths in a well-ventilated area for glazing cabinet doors. Use your garage or an outdoor space on your deck or lawn if the weather is warm, dry, and not too windy. Otherwise, you can aid ventilation in an indoor space by opening windows and doors. Glazes and stains contain harsh chemicals that can omit strong and unpleasant odors. Glazing the cabinet doors in a properly ventilated area will limit the amount of chemicals you breathe in while glazing, especially if your cabinets are not in a room with good airflow. Removing the Doors and Cleaning the Cabinets Use a screwdriver to remove the cabinet doors. Take out all the screws from the door’s hinges to separate them from the cabinets completely. If you have multiple cabinet doors to glaze, keep track of each door by working around the room from left to right, removing the screws from top to bottom. It’s helpful to put each screw in a plastic bag as soon as you remove it, as they’re easy to lose. Place the cabinet doors on the drop-cloths in the ventilated area. Lay them face up on the cloth, cardboard, or garbage bags you laid out and double check that you’ve removed all of the hardware and screws from the doors. Remove any remaining hardware from the cabinets with the screwdriver. Make sure to put all the remaining hardware into the plastic bag with the other screws, so they don’t get misplaced while you’re glazing your cabinets. This will help you avoid getting the glaze on the hardware and allow you to achieve a cleaner finished look. Wash the cabinets and doors with a sponge, mild soap, and clean water. Be as thorough as you can be and try to get into all the nooks and crannies. If you haven’t cleaned your cabinets in awhile, you may want to use a vacuum first to get rid of any cobwebs or excess dust before washing with soap and water. Cleaning the cabinets will prevent dust and other particles from getting caught in the glaze while you’re applying it. Open any windows and doors near your cabinets to improve airflow. If possible, open windows and doors on separate sides of the room to cross-ventilate the air. Not only will this help the cabinets dry more quickly after you’ve washed them, but it will also keep the air more clean and fresh while you’re glazing. Leave the cabinets and doors to dry for at least 2 hours before glazing. Allow your cabinets to dry for a few hours after you’ve washed them with soap and water to ensure no excess water mixes with your glaze, which could dilute it. Alternatively, if you don’t have time to let the cabinets air dry, you can wipe them dry with a clean rag. Applying the Glaze Open the container of glaze and mix well with a paint stirrer. You want to do this just before you’re ready to begin applying the glaze. This will make the glaze easier to work with and help it go on more smoothly and evenly. Glaze comes in 2 varieties: oil-based and water-based. Oil-based glaze is ideal for stained cabinets, while water-based glaze is better suited to painted cabinets. If you want to mix your own glaze, rather than buying a ready-to-use one, you can buy a clear glaze and mix it with latex paint in the color of your choice. If you choose to mix your own, make sure to follow the instructions on the clear glaze container for the best results. Apply the glaze to a small section of the cabinets using a foam brush. Start with a less visible part of the cabinets, covering a 2–3 ft (0.61–0.91 m) section to begin with. Go with the grain, rather than against it. Apply a liberal amount, making sure to thoroughly coat the section and ensure the glaze gets into any recesses of the cabinets. Once applied, the glaze should appear uneven and darker than your desired results. It’s a good idea to have multiple foam brushes available in different sizes and shapes to help you cover every part of the cabinets. You may also choose to apply the glaze with a clean rag, rubbing it into the cabinets using a circular motion. Wipe off the excess glaze with a clean rag. Remove the bulk of the glaze until you can clearly see the grain of the wood or the paint color underneath. Continue to wipe, using circular motions, until you’re satisfied with the results. If you like the look of the glaze, but want it a little darker, re-apply the glaze to the same section and leave it to sit for 5 to 10 minutes before wiping it off. If you don’t like the results, or decide you want to use a different color, you can remove the glaze using paint thinner and a clean rag. Continue glazing and wiping in sections until the cabinets are covered. Use the exact same process you did with the first section to achieve a uniform look. As you work around corners and crevices, make sure the glaze gets into those areas. If you have trouble wiping it away with the cloth, you can use a cotton swab or clean foam brush instead. Working in 2–3 ft (0.61–0.91 m) sections instead of glazing every surface of the cabinets at once allows you to fix any mistakes and evaluate your work before the glaze dries. Glaze the doors using the same process you did with the cabinets. Use the same number of coats in order to achieve a cohesive look once the doors are reattached. You want the cabinets and doors to match in color and texture as closely as possible. It’s up to you whether or not you want to glaze the inside of the doors as well as the outside. If you do decide to glaze the inside, make sure you let the outside dry thoroughly before you turn the door over to avoid ruining your work. Leave the cabinets to dry for at least 24 hours. Generally, this is enough time for the glaze to completely dry. However, it’s a good idea to check the glaze container for specific manufacturer guidelines on drying times. Touching Up and Cleaning Inspect the cabinets for flaws and consider adding more to the grooves. Don’t forget to check corners, crevices, and any recessed areas in the cabinets and doors, as these places are easy to miss. There may be areas where there isn’t quite enough glaze, and other places where extra glaze has collected during the drying process. This is also the time to decide if there are any areas you want an extra layer of glaze, to achieve a more dramatic look. For example, you can apply an additional layer of glaze in the grooves of the cabinet doors if you want more dimension. Touch up any areas as needed. Apply another layer of glaze to any areas needing touch-ups, using the same process you did the first time. For the best results, only apply a small amount of glaze in exactly the places you want to touch up, and then wipe clean. If there are any spots of glaze that need to be removed, do this using paint thinner. Clean the foam brushes in mineral spirits and dispose of the rags. Fill a small cup full of mineral spirits and gently dip the foam brushes into it, swirling them around a few times to help dissolve the remaining glaze. This will prevent the brushes from becoming stiff and allow you to use them for future touch-ups or other glazing projects. While you can also clean the rags using the same method, it requires a great deal of mineral spirits to dissolve all the glaze, so it’s easiest to simply throw them away. Remove the painter’s tape and drop cloths. Grab each piece of tape at the corner and peel the tape back slowly, holding the end of each piece at approximately a 45-degree angle. It’s important to take your time with this process and try to keep each piece intact as you remove it. You don’t want to leave behind small pieces of painter’s tape, which can be difficult to remove. It’s a good idea to store your drop cloths rather than throwing them away. They may be useful for future glazing, staining, or painting projects. Reattach the cabinet doors and hardware using the screwdriver. Once the cabinets are completely dry and you’re satisfied with the color and evenness, it’s time to reassemble them and admire your results!",
    "sentences": [
        " Masking and Prepping the Area Cover the floors and other nearby surfaces with drop-cloths.",
        "Take care to protect any and all surfaces near your cabinets that you don’t want to glaze before you get started.",
        "Glaze is designed to stick to things, so make sure it only sticks to the surfaces you want to transform with glaze.",
        "If you don’t have drop cloths, you can use plastic garbage bags, cardboard, or construction paper.",
        "Just make sure you adequately cover all nearby surfaces.",
        "Tape off the walls around the edges of the cabinets with painter's tape.",
        "Cover each and every wall adjacent to your cabinets.",
        "Apply the tape in pieces that are just a few feet long to avoid it from tangling and bunching, and press each piece into the wall to help it stick and avoid glaze from seeping under the tape.",
        "It’s better to spend a bit of extra time prepping the area than to have to repaint your walls because you missed a spot.",
        "Lay down drop cloths in a well-ventilated area for glazing cabinet doors.",
        "Use your garage or an outdoor space on your deck or lawn if the weather is warm, dry, and not too windy.",
        "Otherwise, you can aid ventilation in an indoor space by opening windows and doors.",
        "Glazes and stains contain harsh chemicals that can omit strong and unpleasant odors.",
        "Glazing the cabinet doors in a properly ventilated area will limit the amount of chemicals you breathe in while glazing, especially if your cabinets are not in a room with good airflow.",
        "Removing the Doors and Cleaning the Cabinets Use a screwdriver to remove the cabinet doors.",
        "Take out all the screws from the door’s hinges to separate them from the cabinets completely.",
        "If you have multiple cabinet doors to glaze, keep track of each door by working around the room from left to right, removing the screws from top to bottom.",
        "It’s helpful to put each screw in a plastic bag as soon as you remove it, as they’re easy to lose.",
        "Place the cabinet doors on the drop-cloths in the ventilated area.",
        "Lay them face up on the cloth, cardboard, or garbage bags you laid out and double check that you’ve removed all of the hardware and screws from the doors.",
        "Remove any remaining hardware from the cabinets with the screwdriver.",
        "Make sure to put all the remaining hardware into the plastic bag with the other screws, so they don’t get misplaced while you’re glazing your cabinets.",
        "This will help you avoid getting the glaze on the hardware and allow you to achieve a cleaner finished look.",
        "Wash the cabinets and doors with a sponge, mild soap, and clean water.",
        "Be as thorough as you can be and try to get into all the nooks and crannies.",
        "If you haven’t cleaned your cabinets in awhile, you may want to use a vacuum first to get rid of any cobwebs or excess dust before washing with soap and water.",
        "Cleaning the cabinets will prevent dust and other particles from getting caught in the glaze while you’re applying it.",
        "Open any windows and doors near your cabinets to improve airflow.",
        "If possible, open windows and doors on separate sides of the room to cross-ventilate the air.",
        "Not only will this help the cabinets dry more quickly after you’ve washed them, but it will also keep the air more clean and fresh while you’re glazing.",
        "Leave the cabinets and doors to dry for at least 2 hours before glazing.",
        "Allow your cabinets to dry for a few hours after you’ve washed them with soap and water to ensure no excess water mixes with your glaze, which could dilute it.",
        "Alternatively, if you don’t have time to let the cabinets air dry, you can wipe them dry with a clean rag.",
        "Applying the Glaze Open the container of glaze and mix well with a paint stirrer.",
        "You want to do this just before you’re ready to begin applying the glaze.",
        "This will make the glaze easier to work with and help it go on more smoothly and evenly.",
        "Glaze comes in 2 varieties: oil-based and water-based.",
        "Oil-based glaze is ideal for stained cabinets, while water-based glaze is better suited to painted cabinets.",
        "If you want to mix your own glaze, rather than buying a ready-to-use one, you can buy a clear glaze and mix it with latex paint in the color of your choice.",
        "If you choose to mix your own, make sure to follow the instructions on the clear glaze container for the best results.",
        "Apply the glaze to a small section of the cabinets using a foam brush.",
        "Start with a less visible part of the cabinets, covering a 2–3 ft (0.61–0.91 m) section to begin with.",
        "Go with the grain, rather than against it.",
        "Apply a liberal amount, making sure to thoroughly coat the section and ensure the glaze gets into any recesses of the cabinets.",
        "Once applied, the glaze should appear uneven and darker than your desired results.",
        "It’s a good idea to have multiple foam brushes available in different sizes and shapes to help you cover every part of the cabinets.",
        "You may also choose to apply the glaze with a clean rag, rubbing it into the cabinets using a circular motion.",
        "Wipe off the excess glaze with a clean rag.",
        "Remove the bulk of the glaze until you can clearly see the grain of the wood or the paint color underneath.",
        "Continue to wipe, using circular motions, until you’re satisfied with the results.",
        "If you like the look of the glaze, but want it a little darker, re-apply the glaze to the same section and leave it to sit for 5 to 10 minutes before wiping it off.",
        "If you don’t like the results, or decide you want to use a different color, you can remove the glaze using paint thinner and a clean rag.",
        "Continue glazing and wiping in sections until the cabinets are covered.",
        "Use the exact same process you did with the first section to achieve a uniform look.",
        "As you work around corners and crevices, make sure the glaze gets into those areas.",
        "If you have trouble wiping it away with the cloth, you can use a cotton swab or clean foam brush instead.",
        "Working in 2–3 ft (0.61–0.91 m) sections instead of glazing every surface of the cabinets at once allows you to fix any mistakes and evaluate your work before the glaze dries.",
        "Glaze the doors using the same process you did with the cabinets.",
        "Use the same number of coats in order to achieve a cohesive look once the doors are reattached.",
        "You want the cabinets and doors to match in color and texture as closely as possible.",
        "It’s up to you whether or not you want to glaze the inside of the doors as well as the outside.",
        "If you do decide to glaze the inside, make sure you let the outside dry thoroughly before you turn the door over to avoid ruining your work.",
        "Leave the cabinets to dry for at least 24 hours.",
        "Generally, this is enough time for the glaze to completely dry.",
        "However, it’s a good idea to check the glaze container for specific manufacturer guidelines on drying times.",
        "Touching Up and Cleaning Inspect the cabinets for flaws and consider adding more to the grooves.",
        "Don’t forget to check corners, crevices, and any recessed areas in the cabinets and doors, as these places are easy to miss.",
        "There may be areas where there isn’t quite enough glaze, and other places where extra glaze has collected during the drying process.",
        "This is also the time to decide if there are any areas you want an extra layer of glaze, to achieve a more dramatic look.",
        "For example, you can apply an additional layer of glaze in the grooves of the cabinet doors if you want more dimension.",
        "Touch up any areas as needed.",
        "Apply another layer of glaze to any areas needing touch-ups, using the same process you did the first time.",
        "For the best results, only apply a small amount of glaze in exactly the places you want to touch up, and then wipe clean.",
        "If there are any spots of glaze that need to be removed, do this using paint thinner.",
        "Clean the foam brushes in mineral spirits and dispose of the rags.",
        "Fill a small cup full of mineral spirits and gently dip the foam brushes into it, swirling them around a few times to help dissolve the remaining glaze.",
        "This will prevent the brushes from becoming stiff and allow you to use them for future touch-ups or other glazing projects.",
        "While you can also clean the rags using the same method, it requires a great deal of mineral spirits to dissolve all the glaze, so it’s easiest to simply throw them away.",
        "Remove the painter’s tape and drop cloths.",
        "Grab each piece of tape at the corner and peel the tape back slowly, holding the end of each piece at approximately a 45-degree angle.",
        "It’s important to take your time with this process and try to keep each piece intact as you remove it.",
        "You don’t want to leave behind small pieces of painter’s tape, which can be difficult to remove.",
        "It’s a good idea to store your drop cloths rather than throwing them away.",
        "They may be useful for future glazing, staining, or painting projects.",
        "Reattach the cabinet doors and hardware using the screwdriver.",
        "Once the cabinets are completely dry and you’re satisfied with the color and evenness, it’s time to reassemble them and admire your results!"
    ]
}