{
    "title": "How to Make French Bread",
    "url": "https://www.wikihow.com/Make-French-Bread",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "European Cuisine",
        "French Cuisine"
    ],
    "parts": [
        {
            "name": "Making the Dough",
            "steps": [
                {
                    "headline": "Proof the yeast.",
                    "description": "Mix 1/4 cup of flour and 1/2 cup of warm water to make a slurry, then add the yeast and wait for it to proof. It will begin foaming when it's ready."
                },
                {
                    "headline": "Place the remaining flour and the salt in a mixing bowl.",
                    "description": "Whisk it to combine, or use a dough hook attachment on your mixer to stir it up."
                },
                {
                    "headline": "Add the proofed yeast.",
                    "description": ""
                },
                {
                    "headline": "Mix the dough and add water.",
                    "description": "Turn on the dough hook attachment at its lowest speed, or use a wooden spoon to mix the dough. Add water a few tablespoons at a time, mixing constantly, until the dough comes together and pulls away from the sides of the bowl."
                },
                {
                    "headline": "Stop mixing and let the dough rest.",
                    "description": "Allow it to absorb the water for a few minutes. This will make it easier to get the final flour/water ratio correct."
                },
                {
                    "headline": "Continue mixing.",
                    "description": "Add additional water or flour slowly until the bowl is “clean,” without lots of bits of dough clinging to the sides. When you pinch the dough it should be just slightly sticky. If it seems too wet, add some more flour (try about ¼ to ½ cup) and process a bit more."
                },
                {
                    "headline": "Knead the dough.",
                    "description": "Turn on the dough hook attachment to a medium speed. If you are not using a machine, you will need to knead about 10 to 15 minutes by hand to distribute the ingredients and develop the gluten in the flour. Flour your work surface and hands, then turn out the dough onto the surface and knead."
                },
                {
                    "headline": "Let the dough rise.",
                    "description": "Put the dough into a bowl 3 times larger than the amount of flour used. Oil the bowl with cooking oil, the place the dough in the bowl and cover it with plastic wrap or a kitchen towel. Set it in a warm area of the kitchen to rise. The first rising will take a couple of hours, depending on how warm a spot the bowl is left in. You can let the dough rise in the refrigerator overnight if you prefer."
                },
                {
                    "headline": "Punch down the dough.",
                    "description": "After the dough has roughly tripled in volume, you should “punch down” the dough by poking it with your fingers to deflate it."
                },
                {
                    "headline": "Let the dough rise again.",
                    "description": "Place it back in an oiled bowl and cover with plastic wrap. Set it in a warm area to rise a second time. When it has doubled in size, punch it down again."
                },
                {
                    "headline": "Let the dough rise a third time.",
                    "description": "Three risings encourage smaller bubbles in the dough. If you want to speed the process or prefer a courser bread (more large bubbles), you can eliminate one or two of these risings."
                }
            ]
        },
        {
            "name": "Shaping the Dough",
            "steps": [
                {
                    "headline": "Form batons or baguettes.",
                    "description": "Cut the dough into two or three lumps and work on one lump at a time. Flour your work surface and hands. Roll out the dough into a rectangle about as long as desired for the baton (a shorter, wider loaf) or baguette (long and thin). Starting at one long edge, roll the dough tightly into the baton or baguette shape and pinch the seam when done. Other shapes are certainly possible. A round loaf can be made by tucking the sides of the “lump” under to form a round, smooth loaf. A baguette is just a thinner baton."
                },
                {
                    "headline": "Put the shaped dough into a baking pan.",
                    "description": "If you're using a cookie sheet, lightly oil and sprinkle with cornmeal; for holed sheets, lightly oil. You can fit two or three pieces on the same sheet."
                },
                {
                    "headline": "Let the dough rise a final time.",
                    "description": "Cover the loaves on the sheet with a damp kitchen towel and let rise until roughly doubled in size. This should take about 45 minutes to an hour, depending on the temperature in your kitchen."
                }
            ]
        },
        {
            "name": "Baking the Bread",
            "steps": [
                {
                    "headline": "Preheat on the oven to 450 degrees.",
                    "description": ""
                },
                {
                    "headline": "Slit the loaves.",
                    "description": "Uncover the loaves and slit each loaf with a very sharp knife. (Artistic skills are helpful but not required). The usual pattern is a diagonal slicing about 1/2-inch deep and about 1 inch (2.5 cm) apart. More artistic types can create a “wheat sheaf” pattern. A salty crust is something many eaters prefer. Two possible techniques are to paint the loaves with a mixture of 1 egg white, about 1 tablespoon of salt, and 1/4 cup or so of warm water; or spray the loaves lightly with some water and sprinkle on coarse salt. For a really salty crust combine both approaches (paint first, then sprinkle)."
                },
                {
                    "headline": "Put the loaves in the oven and add moisture.",
                    "description": "When the oven is hot, put the loaves on a middle rack. Spray some water into the oven to make a moist baking environment. You want a moist environment to encourage the dough to rise without splitting the surface (the slitting with a knife predefines where it should split) and to develop the crust. Another technique is to put a pan of water on a bottom rack for the first 10 minutes. If you have a gas oven, the moisture levels in the oven will be higher naturally than for an electric oven. A real baker’s oven is ideal but they cost something like $12,000."
                },
                {
                    "headline": "After 10 minutes, turn the oven down to 350 degrees.",
                    "description": "Another spray with the water will also help with moisture and temperature."
                },
                {
                    "headline": "Bake the bread for 20 more minutes.",
                    "description": "Remove the bread from the oven when the internal temperature is 190 degrees. Much cooler than this, the bread will be “doughy;” much hotter and it will be dry. You can measure the temperature with a thermometer."
                },
                {
                    "headline": "Remove from the oven and put on a cooling rack.",
                    "description": "When cool, the bread can be eaten immediately. Some purists insist on tearing off chunks but it is OK to cut slices since many people seemed to mangle the loaf in the tearing process. Top with butter/margarine (savory) or a fruit jam (sweet), if desired. De gustibus non testutantum est – Latin: “One cannot dispute taste.”"
                }
            ]
        }
    ],
    "tyn": [
        "Mixer with dough hook, or a big bowl and large wooden spoon",
        "Rolling pin",
        "Bread sheet or cookie sheet",
        "Water spray bottle"
    ],
    "text": " Making the Dough Proof the yeast. Mix 1/4 cup of flour and 1/2 cup of warm water to make a slurry, then add the yeast and wait for it to proof. It will begin foaming when it's ready. Place the remaining flour and the salt in a mixing bowl. Whisk it to combine, or use a dough hook attachment on your mixer to stir it up. Add the proofed yeast.  Mix the dough and add water. Turn on the dough hook attachment at its lowest speed, or use a wooden spoon to mix the dough. Add water a few tablespoons at a time, mixing constantly, until the dough comes together and pulls away from the sides of the bowl. Stop mixing and let the dough rest. Allow it to absorb the water for a few minutes. This will make it easier to get the final flour/water ratio correct. Continue mixing. Add additional water or flour slowly until the bowl is “clean,” without lots of bits of dough clinging to the sides. When you pinch the dough it should be just slightly sticky. If it seems too wet, add some more flour (try about ¼ to ½ cup) and process a bit more. Knead the dough. Turn on the dough hook attachment to a medium speed. If you are not using a machine, you will need to knead about 10 to 15 minutes by hand to distribute the ingredients and develop the gluten in the flour. Flour your work surface and hands, then turn out the dough onto the surface and knead. Let the dough rise. Put the dough into a bowl 3 times larger than the amount of flour used. Oil the bowl with cooking oil, the place the dough in the bowl and cover it with plastic wrap or a kitchen towel. Set it in a warm area of the kitchen to rise. The first rising will take a couple of hours, depending on how warm a spot the bowl is left in. You can let the dough rise in the refrigerator overnight if you prefer. Punch down the dough. After the dough has roughly tripled in volume, you should “punch down” the dough by poking it with your fingers to deflate it. Let the dough rise again. Place it back in an oiled bowl and cover with plastic wrap. Set it in a warm area to rise a second time. When it has doubled in size, punch it down again. Let the dough rise a third time. Three risings encourage smaller bubbles in the dough. If you want to speed the process or prefer a courser bread (more large bubbles), you can eliminate one or two of these risings. Shaping the Dough Form batons or baguettes. Cut the dough into two or three lumps and work on one lump at a time. Flour your work surface and hands. Roll out the dough into a rectangle about as long as desired for the baton (a shorter, wider loaf) or baguette (long and thin). Starting at one long edge, roll the dough tightly into the baton or baguette shape and pinch the seam when done. Other shapes are certainly possible. A round loaf can be made by tucking the sides of the “lump” under to form a round, smooth loaf. A baguette is just a thinner baton. Put the shaped dough into a baking pan. If you're using a cookie sheet, lightly oil and sprinkle with cornmeal; for holed sheets, lightly oil. You can fit two or three pieces on the same sheet. Let the dough rise a final time. Cover the loaves on the sheet with a damp kitchen towel and let rise until roughly doubled in size. This should take about 45 minutes to an hour, depending on the temperature in your kitchen. Baking the Bread Preheat on the oven to 450 degrees.  Slit the loaves. Uncover the loaves and slit each loaf with a very sharp knife. (Artistic skills are helpful but not required). The usual pattern is a diagonal slicing about 1/2-inch deep and about 1 inch (2.5 cm) apart. More artistic types can create a “wheat sheaf” pattern. A salty crust is something many eaters prefer. Two possible techniques are to paint the loaves with a mixture of 1 egg white, about 1 tablespoon of salt, and 1/4 cup or so of warm water; or spray the loaves lightly with some water and sprinkle on coarse salt. For a really salty crust combine both approaches (paint first, then sprinkle). Put the loaves in the oven and add moisture. When the oven is hot, put the loaves on a middle rack. Spray some water into the oven to make a moist baking environment. You want a moist environment to encourage the dough to rise without splitting the surface (the slitting with a knife predefines where it should split) and to develop the crust. Another technique is to put a pan of water on a bottom rack for the first 10 minutes. If you have a gas oven, the moisture levels in the oven will be higher naturally than for an electric oven. A real baker’s oven is ideal but they cost something like $12,000. After 10 minutes, turn the oven down to 350 degrees. Another spray with the water will also help with moisture and temperature. Bake the bread for 20 more minutes. Remove the bread from the oven when the internal temperature is 190 degrees. Much cooler than this, the bread will be “doughy;” much hotter and it will be dry. You can measure the temperature with a thermometer. Remove from the oven and put on a cooling rack. When cool, the bread can be eaten immediately. Some purists insist on tearing off chunks but it is OK to cut slices since many people seemed to mangle the loaf in the tearing process. Top with butter/margarine (savory) or a fruit jam (sweet), if desired. De gustibus non testutantum est – Latin: “One cannot dispute taste.”",
    "sentences": [
        " Making the Dough Proof the yeast.",
        "Mix 1/4 cup of flour and 1/2 cup of warm water to make a slurry, then add the yeast and wait for it to proof.",
        "It will begin foaming when it's ready.",
        "Place the remaining flour and the salt in a mixing bowl.",
        "Whisk it to combine, or use a dough hook attachment on your mixer to stir it up.",
        "Add the proofed yeast.",
        "Mix the dough and add water.",
        "Turn on the dough hook attachment at its lowest speed, or use a wooden spoon to mix the dough.",
        "Add water a few tablespoons at a time, mixing constantly, until the dough comes together and pulls away from the sides of the bowl.",
        "Stop mixing and let the dough rest.",
        "Allow it to absorb the water for a few minutes.",
        "This will make it easier to get the final flour/water ratio correct.",
        "Continue mixing.",
        "Add additional water or flour slowly until the bowl is “clean,” without lots of bits of dough clinging to the sides.",
        "When you pinch the dough it should be just slightly sticky.",
        "If it seems too wet, add some more flour (try about ¼ to ½ cup) and process a bit more.",
        "Knead the dough.",
        "Turn on the dough hook attachment to a medium speed.",
        "If you are not using a machine, you will need to knead about 10 to 15 minutes by hand to distribute the ingredients and develop the gluten in the flour.",
        "Flour your work surface and hands, then turn out the dough onto the surface and knead.",
        "Let the dough rise.",
        "Put the dough into a bowl 3 times larger than the amount of flour used.",
        "Oil the bowl with cooking oil, the place the dough in the bowl and cover it with plastic wrap or a kitchen towel.",
        "Set it in a warm area of the kitchen to rise.",
        "The first rising will take a couple of hours, depending on how warm a spot the bowl is left in.",
        "You can let the dough rise in the refrigerator overnight if you prefer.",
        "Punch down the dough.",
        "After the dough has roughly tripled in volume, you should “punch down” the dough by poking it with your fingers to deflate it.",
        "Let the dough rise again.",
        "Place it back in an oiled bowl and cover with plastic wrap.",
        "Set it in a warm area to rise a second time.",
        "When it has doubled in size, punch it down again.",
        "Let the dough rise a third time.",
        "Three risings encourage smaller bubbles in the dough.",
        "If you want to speed the process or prefer a courser bread (more large bubbles), you can eliminate one or two of these risings.",
        "Shaping the Dough Form batons or baguettes.",
        "Cut the dough into two or three lumps and work on one lump at a time.",
        "Flour your work surface and hands.",
        "Roll out the dough into a rectangle about as long as desired for the baton (a shorter, wider loaf) or baguette (long and thin).",
        "Starting at one long edge, roll the dough tightly into the baton or baguette shape and pinch the seam when done.",
        "Other shapes are certainly possible.",
        "A round loaf can be made by tucking the sides of the “lump” under to form a round, smooth loaf.",
        "A baguette is just a thinner baton.",
        "Put the shaped dough into a baking pan.",
        "If you're using a cookie sheet, lightly oil and sprinkle with cornmeal; for holed sheets, lightly oil.",
        "You can fit two or three pieces on the same sheet.",
        "Let the dough rise a final time.",
        "Cover the loaves on the sheet with a damp kitchen towel and let rise until roughly doubled in size.",
        "This should take about 45 minutes to an hour, depending on the temperature in your kitchen.",
        "Baking the Bread Preheat on the oven to 450 degrees.",
        "Slit the loaves.",
        "Uncover the loaves and slit each loaf with a very sharp knife.",
        "(Artistic skills are helpful but not required).",
        "The usual pattern is a diagonal slicing about 1/2-inch deep and about 1 inch (2.5 cm) apart.",
        "More artistic types can create a “wheat sheaf” pattern.",
        "A salty crust is something many eaters prefer.",
        "Two possible techniques are to paint the loaves with a mixture of 1 egg white, about 1 tablespoon of salt, and 1/4 cup or so of warm water; or spray the loaves lightly with some water and sprinkle on coarse salt.",
        "For a really salty crust combine both approaches (paint first, then sprinkle).",
        "Put the loaves in the oven and add moisture.",
        "When the oven is hot, put the loaves on a middle rack.",
        "Spray some water into the oven to make a moist baking environment.",
        "You want a moist environment to encourage the dough to rise without splitting the surface (the slitting with a knife predefines where it should split) and to develop the crust.",
        "Another technique is to put a pan of water on a bottom rack for the first 10 minutes.",
        "If you have a gas oven, the moisture levels in the oven will be higher naturally than for an electric oven.",
        "A real baker’s oven is ideal but they cost something like $12,000.",
        "After 10 minutes, turn the oven down to 350 degrees.",
        "Another spray with the water will also help with moisture and temperature.",
        "Bake the bread for 20 more minutes.",
        "Remove the bread from the oven when the internal temperature is 190 degrees.",
        "Much cooler than this, the bread will be “doughy;” much hotter and it will be dry.",
        "You can measure the temperature with a thermometer.",
        "Remove from the oven and put on a cooling rack.",
        "When cool, the bread can be eaten immediately.",
        "Some purists insist on tearing off chunks but it is OK to cut slices since many people seemed to mangle the loaf in the tearing process.",
        "Top with butter/margarine (savory) or a fruit jam (sweet), if desired.",
        "De gustibus non testutantum est – Latin: “One cannot dispute taste.”"
    ]
}