{
    "title": "How to Make Potholders",
    "url": "https://www.wikihow.com/Make-Potholders",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Sewing",
        "Sewing Crafts",
        "Sewing Kitchen Accessories"
    ],
    "methods": [
        {
            "name": "Sewing a Quilted Potholder",
            "steps": [
                {
                    "headline": "Cut a 9 in (23 cm) rounded square out of paper for the template.",
                    "description": "Use a pencil and a ruler to draw a 9 in (23 cm) square on a sheet of paper. Next, use a small jar as a stencil to round the corners. Cut the rounded square out when you’re done. You don’t have to make the corners rounded if you don’t want to, but it’ll be much easier to attach the bias tape to the corners if they’re rounded."
                },
                {
                    "headline": "Use the template to cut your fabric, batting, and fleece.",
                    "description": "Cut 2 pieces of cotton fabric, 2 pieces of cotton batting, and 1 piece of heat-resistant fleece. Set the template aside when you're done. You can use the same color/pattern for both cotton squares, or you can use different ones. For example, 1 piece could be solid-colored while the other could be patterned."
                },
                {
                    "headline": "Stack the pieces, with the cotton on the outside and the rest in the middle.",
                    "description": "Set 1 of your cotton squares on the table, right-side-down. Place the batting on top, followed by the fleece. Set the second piece of batting on top of that, followed by the second cotton square, right-side-up. Stack the pieces in this order: fabric, batting, fleece, batting, fabric. The right side of the fabric is the same as the front. The wrong side is the back."
                },
                {
                    "headline": "Secure the edges with pins, then hand sew a basting stitch around them.",
                    "description": "Pin the edges of the stacked fabric squares first. Next, thread your needle and knot the end. Sew a loose straight stitch by pushing the needle through the front of the fabric, out the back, and through the front again. Work your way around the edges of the fabric, keeping the stitches about 1 inch (2.5 cm) apart. Remove the pins when you’re done. The seam allowance doesn't matter, but something around ⁄2 inch (1.3 cm) would be good. Use a contrasting thread color. This will make it easier to see the basting stitch so that you can pull it out later."
                },
                {
                    "headline": "Draw diagonal lines, 1 inch (2.5 cm) apart, to make a quilted pattern.",
                    "description": "Use a ruler and chalk to draw a diagonal line from the top-right to the bottom-left corner. Continue to draw parallel lines to either side of it until you reach the opposite corners.Repeat this process for the top-left and bottom-right corner. Consider using a different chalk color to make the lines easier to tell apart. Don't worry if the last set of lines are a little further than 1 inch (2.5 cm) from the corners. The bias tape will cover this up."
                },
                {
                    "headline": "Sew the diagonal lines using a straight stitch on a sewing machine.",
                    "description": "Start with the first line that you sketched, from the top-right corner to the bottom-left corner. Cut the thread, then do all the lines to the left of it, then all the lines to the right. After you finish sewing each line, cut the thread, and begin sewing the next line. Repeat this process for the top-left, bottom-right set of lines. You do not need to backstitch here, but you can if you want to. The straight stitch is the most basic stitch on a sewing machine. How you get this stitch on your sewing machine depends on the brand. Refer to the manual that came with it. Use a contrasting thread color if you want the lines to stand out. For a more subtle design, match the thread color to the fabric."
                },
                {
                    "headline": "Remove the basting stitch.",
                    "description": "Use your fingers to tug and pull the thread out. You shouldn't have to use a seam ripper for this since basting stitches are so loose. Don't worry, the potholder won't come apart. The quilting stitches are holding it together. If you knotted the basting stitch, cut the knot first."
                },
                {
                    "headline": "Unfold a bias tape and pin it right-side-down around the potholder.",
                    "description": "Open up a double-fold bias tape, then fold 1 of the narrow ends down towards the wrong side by ⁄4 to ⁄2 inch (0.64 to 1.27 cm). Pin the tape by the long, raw edge all the way around your potholder. The right side of the bias tape should face the potholder.The bias tape should be right on top of the potholder, not hanging off the edge. You will sew it down first, then fold it over. Pin the folded, narrow edge down first. Overlap the other end of the bias tape by 1 inch (2.5 cm), then cut the rest off. Choose bias tape in a contrasting color for a more colorful look. Something between ⁄4 and ⁄2 inch (0.64 and 1.27 cm) would work great here."
                },
                {
                    "headline": "Tuck a loop of folded bias tape under 1 of the corners, if desired.",
                    "description": "Cut 6 inches (15 cm) of bias tape. Sew along the open, long edge on your sewing machine using a straight stitch and a matching thread color. Fold the bias tape in half so that the narrow ends touch. Tuck it under 1 of the bias-taped corners on your potholder and secure it with a pin.The ends of the loop should touch the raw edges of your potholder. The rest of the loop should be on top of the potholder. Remove some of the pins holding the bias tape down, then slip the loop under it so that it’s between the potholder and the bias tape. This is simply a hanging loop. You don't have to include it, if you don't want to."
                },
                {
                    "headline": "Sew the bias tape to the potholder using the crease as a guide.",
                    "description": "Your bias tape will have 3 creases; use the crease that’s closest to the edge of the potholder as a guide. Using a straight stitch on your sewing machine, begin sewing at the narrow end that you folded over. Work your way around the potholder, then finish sewing at the other end of the bias tape.Match the thread color to the actual fabric of the potholder. This way, if any of the stitching shows through at the end, it won’t be as visible. Reverse the sewing machine for a few stitches when you start and finish sewing. This is known as “backstitching” and will keep your stitches from coming apart."
                },
                {
                    "headline": "Fold the bias tape over, tuck the raw edges in, and pin it down.",
                    "description": "Flip the potholder over so that the back is facing you. Fold the raw edge of the bias tape back down, using the crease as a guide. Next, fold the bias tape over the raw edge of the potholder. Pin it in place.If you added a hanging loop, fold the loop up so that it's sticking out over the edge of the potholder. Pin it down too. Pull the bias tape tightly enough so that it covers the stitching from when you sewed the bias tape in place."
                },
                {
                    "headline": "Sew the bias tape close to the edge using a straight stitch.",
                    "description": "There is no specific seam allowance, but try to sew as close to the inside edge of the tape as possible—about ⁄8 inch (0.32 cm) will do. Remember to backstitch then you start and finish sewing, and to remove the pins as you sew.Use your sewing machine for this step. Match the thread color and bobbin color to the bias tape. If you added a hanging loop, then sew the top edge of the bias tape to the loop to tack it in place."
                }
            ]
        },
        {
            "name": "Weaving a Potholder on a Loom",
            "steps": [
                {
                    "headline": "Purchase a weaving loom kit from a craft store or fabric store.",
                    "description": "The kit should contain a square plastic weaving loom with \"prongs\" on all 4 sides, a pack of fabric bands, and a hook.Check the kids crafting section first. If you can't find it there, try the rug making aisle next. Do not use a regular weaving room for rugs. It’s not the same thing. The loom needs to have prongs on all 4 sides. The looms in these kits come in a standard size. If you have an option between large, medium, and small sizes, however, stick with the smaller size."
                },
                {
                    "headline": "Wrap the loops around the prongs on the loom going horizontally.",
                    "description": "Take a band and slip it over the first prong on the bottom-left side of the loom. Stretch it across the loom towards the matching prong on the bottom-right. Slip it over the prong and move on to the next band. Work your way towards the top of the loom. Be careful not to let the bands get twisted. Put the bands left and right prongs, not the top and bottom prongs. This will create the base for your potholder. The bands come in all sorts of colors, so get creative with the pattern. Try all 1 color, a rainbow pattern, or an alternating pattern. You can also just do a random pattern."
                },
                {
                    "headline": "Rotate the loom so that the bands are going vertically.",
                    "description": "The prongs on the left and right sides of the loom should now be free of bands. It will be much easier to weave new bands across the loom going horizontally rather than vertically."
                },
                {
                    "headline": "Weave your crochet hook over-and-under across the vertical bands.",
                    "description": "Place your crochet hook on 1 side of the loom, towards the bottom. Move the hook across the first band, then slide it under the next band. Continue to weave the hook through the bands, over-and-under, until you reach the opposite side.Each band creates a double strand. Treat these strands as a single strand. For example, if you have a pink band, weave across the entire pink band. If you're left-handed, start on the left side of the loom and finish on the right. If you're right handed, start on the right side and finish on the left. Keep the hook woven across the bands. One end of the hook should be on the left side of the loom, and the other end of the hook should be on the right side."
                },
                {
                    "headline": "Use the hook to pull a new band back through.",
                    "description": "Slip a band over the curved part of your hook. Next, pull the hook back through the vertical bands, dragging the band you just latched onto it through them. Make sure that the opposite end of the band catches onto the prong. If it doesn't, slip it onto the prong. Once you reach the other end of the loom, take the hook off and slid the band onto the prong. If you started weaving on the left, pull the hook back towards the left. If you started weaving on the right, pull the hook towards the right."
                },
                {
                    "headline": "Repeat the process for the next row, but start weaving from underneath.",
                    "description": "Go back to the same side you started weaving on. Slide the hook under the first band and over the next one. Continue to weave the hook under-and-over across the bands until you reach the opposite side. Use the hook to pull another horizontal band through the vertical ones. Remember to hook both ends of the band over the prongs."
                },
                {
                    "headline": "Continue to weave rows of bands until you reach the top of the loom.",
                    "description": "Alternate the position of the hook with each row that you start. For example, when you get to the third row, start with the hook on top of the first band. When you get to the fourth row, start with the hook under the first band. The potholder may start to curve around the edges, which is normal. Just keep weaving."
                },
                {
                    "headline": "Crochet the edges by pulling the first loop through the next loop.",
                    "description": "Slide your hook through the first 2 bands on 1 corner; make sure that the hook is pointing away from the corner. Pull both loops off the prongs, then use the hook to pull the second band (furthest from the corner) through the first band (closest to the corner). When you're done, the second loop should still be on the hook. If you're left-handed, start on the top-left corner and work towards the right. If you're right-handed, start on the top-right corner and work towards the left."
                },
                {
                    "headline": "Continue to crochet around the loom until you're back where you started.",
                    "description": "Use the hook to pull the next band (third from the corner) off the prong. Pull the loop through the loop that's already on the hook. Continue in this fashion until you're back where you started on the bottom-right corner.Work your way around the loom, pulling the previous band through the next one. The potholder will come off the loom bit by bit as you crochet the loops together, so don't worry about pulling it off."
                },
                {
                    "headline": "Pull the second-to-last loop through the last one, then pull it tightly.",
                    "description": "Crochet the final loops together by pulling the last loop through the one that's already on the hook. Use the hook to pull the last loop tightly until the bands tighten. This should be enough to hold the potholder together.Gently stretch the edges of the potholder to help it maintain a square-like shape. For a more secure hold, tie the 2 loops together in a double-knot instead of crocheting them."
                }
            ]
        }
    ],
    "tyn": [
        "Sewing a Quilted Potholder",
        "Cotton fabric",
        "Cotton batting",
        "Heat-resistant fleece",
        "Needle",
        "Thread",
        "Sewing machine",
        "Sewing pins",
        "Fabric scissors",
        "Tailor's chalk",
        "Ruler",
        "1⁄4",
        "1",
        "⁄",
        "4",
        " to ",
        "1⁄2",
        "2",
        " in (0.64 to 1.27 cm) double-fold bias tape",
        "Weaving a Potholder on a Loom",
        "Fabric band weaving kit"
    ],
    "text": " Sewing a Quilted Potholder Cut a 9 in (23 cm) rounded square out of paper for the template. Use a pencil and a ruler to draw a 9 in (23 cm) square on a sheet of paper. Next, use a small jar as a stencil to round the corners. Cut the rounded square out when you’re done. You don’t have to make the corners rounded if you don’t want to, but it’ll be much easier to attach the bias tape to the corners if they’re rounded. Use the template to cut your fabric, batting, and fleece. Cut 2 pieces of cotton fabric, 2 pieces of cotton batting, and 1 piece of heat-resistant fleece. Set the template aside when you're done. You can use the same color/pattern for both cotton squares, or you can use different ones. For example, 1 piece could be solid-colored while the other could be patterned. Stack the pieces, with the cotton on the outside and the rest in the middle. Set 1 of your cotton squares on the table, right-side-down. Place the batting on top, followed by the fleece. Set the second piece of batting on top of that, followed by the second cotton square, right-side-up. Stack the pieces in this order: fabric, batting, fleece, batting, fabric. The right side of the fabric is the same as the front. The wrong side is the back. Secure the edges with pins, then hand sew a basting stitch around them. Pin the edges of the stacked fabric squares first. Next, thread your needle and knot the end. Sew a loose straight stitch by pushing the needle through the front of the fabric, out the back, and through the front again. Work your way around the edges of the fabric, keeping the stitches about 1 inch (2.5 cm) apart. Remove the pins when you’re done. The seam allowance doesn't matter, but something around ⁄2 inch (1.3 cm) would be good. Use a contrasting thread color. This will make it easier to see the basting stitch so that you can pull it out later. Draw diagonal lines, 1 inch (2.5 cm) apart, to make a quilted pattern. Use a ruler and chalk to draw a diagonal line from the top-right to the bottom-left corner. Continue to draw parallel lines to either side of it until you reach the opposite corners.Repeat this process for the top-left and bottom-right corner. Consider using a different chalk color to make the lines easier to tell apart. Don't worry if the last set of lines are a little further than 1 inch (2.5 cm) from the corners. The bias tape will cover this up. Sew the diagonal lines using a straight stitch on a sewing machine. Start with the first line that you sketched, from the top-right corner to the bottom-left corner. Cut the thread, then do all the lines to the left of it, then all the lines to the right. After you finish sewing each line, cut the thread, and begin sewing the next line. Repeat this process for the top-left, bottom-right set of lines. You do not need to backstitch here, but you can if you want to. The straight stitch is the most basic stitch on a sewing machine. How you get this stitch on your sewing machine depends on the brand. Refer to the manual that came with it. Use a contrasting thread color if you want the lines to stand out. For a more subtle design, match the thread color to the fabric. Remove the basting stitch. Use your fingers to tug and pull the thread out. You shouldn't have to use a seam ripper for this since basting stitches are so loose. Don't worry, the potholder won't come apart. The quilting stitches are holding it together. If you knotted the basting stitch, cut the knot first. Unfold a bias tape and pin it right-side-down around the potholder. Open up a double-fold bias tape, then fold 1 of the narrow ends down towards the wrong side by ⁄4 to ⁄2 inch (0.64 to 1.27 cm). Pin the tape by the long, raw edge all the way around your potholder. The right side of the bias tape should face the potholder.The bias tape should be right on top of the potholder, not hanging off the edge. You will sew it down first, then fold it over. Pin the folded, narrow edge down first. Overlap the other end of the bias tape by 1 inch (2.5 cm), then cut the rest off. Choose bias tape in a contrasting color for a more colorful look. Something between ⁄4 and ⁄2 inch (0.64 and 1.27 cm) would work great here. Tuck a loop of folded bias tape under 1 of the corners, if desired. Cut 6 inches (15 cm) of bias tape. Sew along the open, long edge on your sewing machine using a straight stitch and a matching thread color. Fold the bias tape in half so that the narrow ends touch. Tuck it under 1 of the bias-taped corners on your potholder and secure it with a pin.The ends of the loop should touch the raw edges of your potholder. The rest of the loop should be on top of the potholder. Remove some of the pins holding the bias tape down, then slip the loop under it so that it’s between the potholder and the bias tape. This is simply a hanging loop. You don't have to include it, if you don't want to. Sew the bias tape to the potholder using the crease as a guide. Your bias tape will have 3 creases; use the crease that’s closest to the edge of the potholder as a guide. Using a straight stitch on your sewing machine, begin sewing at the narrow end that you folded over. Work your way around the potholder, then finish sewing at the other end of the bias tape.Match the thread color to the actual fabric of the potholder. This way, if any of the stitching shows through at the end, it won’t be as visible. Reverse the sewing machine for a few stitches when you start and finish sewing. This is known as “backstitching” and will keep your stitches from coming apart. Fold the bias tape over, tuck the raw edges in, and pin it down. Flip the potholder over so that the back is facing you. Fold the raw edge of the bias tape back down, using the crease as a guide. Next, fold the bias tape over the raw edge of the potholder. Pin it in place.If you added a hanging loop, fold the loop up so that it's sticking out over the edge of the potholder. Pin it down too. Pull the bias tape tightly enough so that it covers the stitching from when you sewed the bias tape in place. Sew the bias tape close to the edge using a straight stitch. There is no specific seam allowance, but try to sew as close to the inside edge of the tape as possible—about ⁄8 inch (0.32 cm) will do. Remember to backstitch then you start and finish sewing, and to remove the pins as you sew.Use your sewing machine for this step. Match the thread color and bobbin color to the bias tape. If you added a hanging loop, then sew the top edge of the bias tape to the loop to tack it in place. Weaving a Potholder on a Loom Purchase a weaving loom kit from a craft store or fabric store. The kit should contain a square plastic weaving loom with \"prongs\" on all 4 sides, a pack of fabric bands, and a hook.Check the kids crafting section first. If you can't find it there, try the rug making aisle next. Do not use a regular weaving room for rugs. It’s not the same thing. The loom needs to have prongs on all 4 sides. The looms in these kits come in a standard size. If you have an option between large, medium, and small sizes, however, stick with the smaller size. Wrap the loops around the prongs on the loom going horizontally. Take a band and slip it over the first prong on the bottom-left side of the loom. Stretch it across the loom towards the matching prong on the bottom-right. Slip it over the prong and move on to the next band. Work your way towards the top of the loom. Be careful not to let the bands get twisted. Put the bands left and right prongs, not the top and bottom prongs. This will create the base for your potholder. The bands come in all sorts of colors, so get creative with the pattern. Try all 1 color, a rainbow pattern, or an alternating pattern. You can also just do a random pattern. Rotate the loom so that the bands are going vertically. The prongs on the left and right sides of the loom should now be free of bands. It will be much easier to weave new bands across the loom going horizontally rather than vertically. Weave your crochet hook over-and-under across the vertical bands. Place your crochet hook on 1 side of the loom, towards the bottom. Move the hook across the first band, then slide it under the next band. Continue to weave the hook through the bands, over-and-under, until you reach the opposite side.Each band creates a double strand. Treat these strands as a single strand. For example, if you have a pink band, weave across the entire pink band. If you're left-handed, start on the left side of the loom and finish on the right. If you're right handed, start on the right side and finish on the left. Keep the hook woven across the bands. One end of the hook should be on the left side of the loom, and the other end of the hook should be on the right side. Use the hook to pull a new band back through. Slip a band over the curved part of your hook. Next, pull the hook back through the vertical bands, dragging the band you just latched onto it through them. Make sure that the opposite end of the band catches onto the prong. If it doesn't, slip it onto the prong. Once you reach the other end of the loom, take the hook off and slid the band onto the prong. If you started weaving on the left, pull the hook back towards the left. If you started weaving on the right, pull the hook towards the right. Repeat the process for the next row, but start weaving from underneath. Go back to the same side you started weaving on. Slide the hook under the first band and over the next one. Continue to weave the hook under-and-over across the bands until you reach the opposite side. Use the hook to pull another horizontal band through the vertical ones. Remember to hook both ends of the band over the prongs. Continue to weave rows of bands until you reach the top of the loom. Alternate the position of the hook with each row that you start. For example, when you get to the third row, start with the hook on top of the first band. When you get to the fourth row, start with the hook under the first band. The potholder may start to curve around the edges, which is normal. Just keep weaving. Crochet the edges by pulling the first loop through the next loop. Slide your hook through the first 2 bands on 1 corner; make sure that the hook is pointing away from the corner. Pull both loops off the prongs, then use the hook to pull the second band (furthest from the corner) through the first band (closest to the corner). When you're done, the second loop should still be on the hook. If you're left-handed, start on the top-left corner and work towards the right. If you're right-handed, start on the top-right corner and work towards the left. Continue to crochet around the loom until you're back where you started. Use the hook to pull the next band (third from the corner) off the prong. Pull the loop through the loop that's already on the hook. Continue in this fashion until you're back where you started on the bottom-right corner.Work your way around the loom, pulling the previous band through the next one. The potholder will come off the loom bit by bit as you crochet the loops together, so don't worry about pulling it off. Pull the second-to-last loop through the last one, then pull it tightly. Crochet the final loops together by pulling the last loop through the one that's already on the hook. Use the hook to pull the last loop tightly until the bands tighten. This should be enough to hold the potholder together.Gently stretch the edges of the potholder to help it maintain a square-like shape. For a more secure hold, tie the 2 loops together in a double-knot instead of crocheting them.",
    "sentences": [
        " Sewing a Quilted Potholder Cut a 9 in (23 cm) rounded square out of paper for the template.",
        "Use a pencil and a ruler to draw a 9 in (23 cm) square on a sheet of paper.",
        "Next, use a small jar as a stencil to round the corners.",
        "Cut the rounded square out when you’re done.",
        "You don’t have to make the corners rounded if you don’t want to, but it’ll be much easier to attach the bias tape to the corners if they’re rounded.",
        "Use the template to cut your fabric, batting, and fleece.",
        "Cut 2 pieces of cotton fabric, 2 pieces of cotton batting, and 1 piece of heat-resistant fleece.",
        "Set the template aside when you're done.",
        "You can use the same color/pattern for both cotton squares, or you can use different ones.",
        "For example, 1 piece could be solid-colored while the other could be patterned.",
        "Stack the pieces, with the cotton on the outside and the rest in the middle.",
        "Set 1 of your cotton squares on the table, right-side-down.",
        "Place the batting on top, followed by the fleece.",
        "Set the second piece of batting on top of that, followed by the second cotton square, right-side-up.",
        "Stack the pieces in this order: fabric, batting, fleece, batting, fabric.",
        "The right side of the fabric is the same as the front.",
        "The wrong side is the back.",
        "Secure the edges with pins, then hand sew a basting stitch around them.",
        "Pin the edges of the stacked fabric squares first.",
        "Next, thread your needle and knot the end.",
        "Sew a loose straight stitch by pushing the needle through the front of the fabric, out the back, and through the front again.",
        "Work your way around the edges of the fabric, keeping the stitches about 1 inch (2.5 cm) apart.",
        "Remove the pins when you’re done.",
        "The seam allowance doesn't matter, but something around ⁄2 inch (1.3 cm) would be good.",
        "Use a contrasting thread color.",
        "This will make it easier to see the basting stitch so that you can pull it out later.",
        "Draw diagonal lines, 1 inch (2.5 cm) apart, to make a quilted pattern.",
        "Use a ruler and chalk to draw a diagonal line from the top-right to the bottom-left corner.",
        "Continue to draw parallel lines to either side of it until you reach the opposite corners.Repeat this process for the top-left and bottom-right corner.",
        "Consider using a different chalk color to make the lines easier to tell apart.",
        "Don't worry if the last set of lines are a little further than 1 inch (2.5 cm) from the corners.",
        "The bias tape will cover this up.",
        "Sew the diagonal lines using a straight stitch on a sewing machine.",
        "Start with the first line that you sketched, from the top-right corner to the bottom-left corner.",
        "Cut the thread, then do all the lines to the left of it, then all the lines to the right.",
        "After you finish sewing each line, cut the thread, and begin sewing the next line.",
        "Repeat this process for the top-left, bottom-right set of lines.",
        "You do not need to backstitch here, but you can if you want to.",
        "The straight stitch is the most basic stitch on a sewing machine.",
        "How you get this stitch on your sewing machine depends on the brand.",
        "Refer to the manual that came with it.",
        "Use a contrasting thread color if you want the lines to stand out.",
        "For a more subtle design, match the thread color to the fabric.",
        "Remove the basting stitch.",
        "Use your fingers to tug and pull the thread out.",
        "You shouldn't have to use a seam ripper for this since basting stitches are so loose.",
        "Don't worry, the potholder won't come apart.",
        "The quilting stitches are holding it together.",
        "If you knotted the basting stitch, cut the knot first.",
        "Unfold a bias tape and pin it right-side-down around the potholder.",
        "Open up a double-fold bias tape, then fold 1 of the narrow ends down towards the wrong side by ⁄4 to ⁄2 inch (0.64 to 1.27 cm).",
        "Pin the tape by the long, raw edge all the way around your potholder.",
        "The right side of the bias tape should face the potholder.The bias tape should be right on top of the potholder, not hanging off the edge.",
        "You will sew it down first, then fold it over.",
        "Pin the folded, narrow edge down first.",
        "Overlap the other end of the bias tape by 1 inch (2.5 cm), then cut the rest off.",
        "Choose bias tape in a contrasting color for a more colorful look.",
        "Something between ⁄4 and ⁄2 inch (0.64 and 1.27 cm) would work great here.",
        "Tuck a loop of folded bias tape under 1 of the corners, if desired.",
        "Cut 6 inches (15 cm) of bias tape.",
        "Sew along the open, long edge on your sewing machine using a straight stitch and a matching thread color.",
        "Fold the bias tape in half so that the narrow ends touch.",
        "Tuck it under 1 of the bias-taped corners on your potholder and secure it with a pin.The ends of the loop should touch the raw edges of your potholder.",
        "The rest of the loop should be on top of the potholder.",
        "Remove some of the pins holding the bias tape down, then slip the loop under it so that it’s between the potholder and the bias tape.",
        "This is simply a hanging loop.",
        "You don't have to include it, if you don't want to.",
        "Sew the bias tape to the potholder using the crease as a guide.",
        "Your bias tape will have 3 creases; use the crease that’s closest to the edge of the potholder as a guide.",
        "Using a straight stitch on your sewing machine, begin sewing at the narrow end that you folded over.",
        "Work your way around the potholder, then finish sewing at the other end of the bias tape.Match the thread color to the actual fabric of the potholder.",
        "This way, if any of the stitching shows through at the end, it won’t be as visible.",
        "Reverse the sewing machine for a few stitches when you start and finish sewing.",
        "This is known as “backstitching” and will keep your stitches from coming apart.",
        "Fold the bias tape over, tuck the raw edges in, and pin it down.",
        "Flip the potholder over so that the back is facing you.",
        "Fold the raw edge of the bias tape back down, using the crease as a guide.",
        "Next, fold the bias tape over the raw edge of the potholder.",
        "Pin it in place.If you added a hanging loop, fold the loop up so that it's sticking out over the edge of the potholder.",
        "Pin it down too.",
        "Pull the bias tape tightly enough so that it covers the stitching from when you sewed the bias tape in place.",
        "Sew the bias tape close to the edge using a straight stitch.",
        "There is no specific seam allowance, but try to sew as close to the inside edge of the tape as possible—about ⁄8 inch (0.32 cm) will do.",
        "Remember to backstitch then you start and finish sewing, and to remove the pins as you sew.Use your sewing machine for this step.",
        "Match the thread color and bobbin color to the bias tape.",
        "If you added a hanging loop, then sew the top edge of the bias tape to the loop to tack it in place.",
        "Weaving a Potholder on a Loom Purchase a weaving loom kit from a craft store or fabric store.",
        "The kit should contain a square plastic weaving loom with \"prongs\" on all 4 sides, a pack of fabric bands, and a hook.Check the kids crafting section first.",
        "If you can't find it there, try the rug making aisle next.",
        "Do not use a regular weaving room for rugs.",
        "It’s not the same thing.",
        "The loom needs to have prongs on all 4 sides.",
        "The looms in these kits come in a standard size.",
        "If you have an option between large, medium, and small sizes, however, stick with the smaller size.",
        "Wrap the loops around the prongs on the loom going horizontally.",
        "Take a band and slip it over the first prong on the bottom-left side of the loom.",
        "Stretch it across the loom towards the matching prong on the bottom-right.",
        "Slip it over the prong and move on to the next band.",
        "Work your way towards the top of the loom.",
        "Be careful not to let the bands get twisted.",
        "Put the bands left and right prongs, not the top and bottom prongs.",
        "This will create the base for your potholder.",
        "The bands come in all sorts of colors, so get creative with the pattern.",
        "Try all 1 color, a rainbow pattern, or an alternating pattern.",
        "You can also just do a random pattern.",
        "Rotate the loom so that the bands are going vertically.",
        "The prongs on the left and right sides of the loom should now be free of bands.",
        "It will be much easier to weave new bands across the loom going horizontally rather than vertically.",
        "Weave your crochet hook over-and-under across the vertical bands.",
        "Place your crochet hook on 1 side of the loom, towards the bottom.",
        "Move the hook across the first band, then slide it under the next band.",
        "Continue to weave the hook through the bands, over-and-under, until you reach the opposite side.Each band creates a double strand.",
        "Treat these strands as a single strand.",
        "For example, if you have a pink band, weave across the entire pink band.",
        "If you're left-handed, start on the left side of the loom and finish on the right.",
        "If you're right handed, start on the right side and finish on the left.",
        "Keep the hook woven across the bands.",
        "One end of the hook should be on the left side of the loom, and the other end of the hook should be on the right side.",
        "Use the hook to pull a new band back through.",
        "Slip a band over the curved part of your hook.",
        "Next, pull the hook back through the vertical bands, dragging the band you just latched onto it through them.",
        "Make sure that the opposite end of the band catches onto the prong.",
        "If it doesn't, slip it onto the prong.",
        "Once you reach the other end of the loom, take the hook off and slid the band onto the prong.",
        "If you started weaving on the left, pull the hook back towards the left.",
        "If you started weaving on the right, pull the hook towards the right.",
        "Repeat the process for the next row, but start weaving from underneath.",
        "Go back to the same side you started weaving on.",
        "Slide the hook under the first band and over the next one.",
        "Continue to weave the hook under-and-over across the bands until you reach the opposite side.",
        "Use the hook to pull another horizontal band through the vertical ones.",
        "Remember to hook both ends of the band over the prongs.",
        "Continue to weave rows of bands until you reach the top of the loom.",
        "Alternate the position of the hook with each row that you start.",
        "For example, when you get to the third row, start with the hook on top of the first band.",
        "When you get to the fourth row, start with the hook under the first band.",
        "The potholder may start to curve around the edges, which is normal.",
        "Just keep weaving.",
        "Crochet the edges by pulling the first loop through the next loop.",
        "Slide your hook through the first 2 bands on 1 corner; make sure that the hook is pointing away from the corner.",
        "Pull both loops off the prongs, then use the hook to pull the second band (furthest from the corner) through the first band (closest to the corner).",
        "When you're done, the second loop should still be on the hook.",
        "If you're left-handed, start on the top-left corner and work towards the right.",
        "If you're right-handed, start on the top-right corner and work towards the left.",
        "Continue to crochet around the loom until you're back where you started.",
        "Use the hook to pull the next band (third from the corner) off the prong.",
        "Pull the loop through the loop that's already on the hook.",
        "Continue in this fashion until you're back where you started on the bottom-right corner.Work your way around the loom, pulling the previous band through the next one.",
        "The potholder will come off the loom bit by bit as you crochet the loops together, so don't worry about pulling it off.",
        "Pull the second-to-last loop through the last one, then pull it tightly.",
        "Crochet the final loops together by pulling the last loop through the one that's already on the hook.",
        "Use the hook to pull the last loop tightly until the bands tighten.",
        "This should be enough to hold the potholder together.Gently stretch the edges of the potholder to help it maintain a square-like shape.",
        "For a more secure hold, tie the 2 loops together in a double-knot instead of crocheting them."
    ]
}