{
    "title": "How to Size Jeans",
    "url": "https://www.wikihow.com/Size-Jeans",
    "category_hierarchy": [
        "Personal Care and Style",
        "Clothing",
        "Denim"
    ],
    "methods": [
        {
            "name": "Determining the Size of a Pair of Jeans",
            "steps": [
                {
                    "headline": "Lay a pair of jeans flat on a workspace.",
                    "description": "To get accurate measurements, smooth out the jeans flat on the surface. Wrinkles can throw your measurements off. Button and zip up your jeans before beginning."
                },
                {
                    "headline": "Measure the waistband and double the number to get the waist measurement.",
                    "description": "The waist measurement is one of the most common measurements you'll see in a store. Use a tape measure to go across the top of the jeans. Make sure the waist isn't drooping or sagging at all. If your waistband is made from elastic material, don't stretch it as you measure or you will inflate the waist measurement. Make a note of whether the jeans are labeled as \"high-wasted\" or \"low rise.\" If the jeans are intended to sit somewhere besides your natural waistline, you need to know that before buying a new pair."
                },
                {
                    "headline": "Check the inseam by measuring the length.",
                    "description": "The inseam is from the crotch seam down to the hem of the jeans; do not measure from the waist. It's often used by stores to help you find your size, especially in men's sizes. It's what's typically used to measure length for pants. Take the measurement down. Make sure the jeans are completely flat when taking this measurement."
                },
                {
                    "headline": "Take the measurement from the crotch to the waist to get the rise.",
                    "description": "It's not as common to see this measurement as it is to see waist or inseam measurements, but you may need it sometimes. Some pant sizes may offer a \"front rise\" and \"back rise\" measurement. The front rise is from the crotch to the waistband in front, and the back rise is from the crotch to the waistband in back."
                },
                {
                    "headline": "Measure the thighs 2 inches (5.1 cm) below the crotch seam to get the thigh thickness.",
                    "description": "Measure horizontally across the leg. Double this number to get your thigh measurement. This measurement also isn't as common."
                },
                {
                    "headline": "Choose an appropriate jean size by comparing your measurements to a chart.",
                    "description": "For women's jeans, the waist size will be the most important, though the inseam can determine whether you have tall, regular, or a petite pair of jeans. Compare the measurements to a size chart to find the right size. Men's jeans include both the waist measurement and the length. Try this chart to look at sizes from different brands: http://sev.h-cdn.co/assets/cm/15/08/54e782633993b_-_size-chart.pdf. Most shopping websites have size charts for their products, so if you're looking for a particular brand, use their size chart. Keep in mind that with men's jeans, you may need to go up a few inches or centimeters in size, as clothing manufacturers have made sizes smaller, a problem known as vanity sizing."
                }
            ]
        },
        {
            "name": "Measuring Yourself to Find the Perfect Fit",
            "steps": [
                {
                    "headline": "Use a soft tape measure to measure around your waist for the waist measurement.",
                    "description": "The tape measure has to bend around your waist, so it needs to be soft. Place the measuring tape directly against your skin about 4 inches (10 cm) below your belly button. Go around the back of your body and back to the front to measure your waist. You'll find many stores use this measurement. If you're not measuring against you're skin, you won't get an accurate measurement. Keep track of these measurements on a piece of paper. Your natural waist is actually a bit higher, just slightly above your belly button. However, most jeans fit lower."
                },
                {
                    "headline": "Check your inseam by measuring your leg length from the crotch down.",
                    "description": "With your legs shoulder-width apart, measure from your foot to your crotch on the inside of your leg. If you need to, ask someone you trust to help you. Measure from where you like your jeans to fall on your foot. You'll see this measurement often, especially in men's sizes. For instance, if you like your jeans a bit long, measure from the bottom of your foot. Try not to bend to read the measurement. Instead, use a mirror or mark with the finger holding the measuring tape. If you're struggling to hold the measuring tape in place, try using adhesive tape to secure one end to your ankle while you hold the other at your crotch."
                },
                {
                    "headline": "Get your hip measurement by measuring around your hips.",
                    "description": "Some jeans will also have this measurement. Wrap the tape measure around your hips where they are the widest. Make sure the tape measure isn't lifting up or drooping in the back. You won't see this measurement as often, but you can still use it if you're measuring jeans before trying them on."
                },
                {
                    "headline": "Take your thigh measurement around one thigh.",
                    "description": "Wrap the tape measure around your skin where your thighs are the thickest. Only take a measurement for one thigh; you don't need to do both. If one is slightly thicker, take the measurement for that thigh. This measurement also isn't very common. Try not to pull your measuring tape too tight or you can give yourself an inaccurate thigh measurement and wind up in an uncomfortable pair of jeans. The tape should be snug, but you should still be able to slip one finger underneath."
                },
                {
                    "headline": "Check your front rise from your crotch to your belly button.",
                    "description": "Stretch a tape measure from just behind your crotch line up and over the front of your pelvis to your waist. For women, this is around the belly button; for men, usually an inch or two or a couple of centimeters below. It can be helpful to wear a belt for the front rise measurement to give yourself an indication of where your jean waist would lie. You won't see this measurement as much, but sometimes stores use it to define how high or low the jeans sit. If you need to measure the back rise, do the same thing going the opposite direction."
                },
                {
                    "headline": "Use your measurements to find a pair of jeans using size charts.",
                    "description": "In women's jeans, look at the waist, which will be the best indicator of size. You may also use the inseam measurement. For men, you'll use both the length and waist measurement when finding a size on a size chart. Note that sizes may run a little small or large, so it's always best to check the actual chart. When shopping online, use the brand's size chart to find a good fit for that brand. If you need to see sizes in different brands, look at this chart: http://sev.h-cdn.co/assets/cm/15/08/54e782633993b_-_size-chart.pdf."
                }
            ]
        },
        {
            "name": "Finding a Pair of Jeans that Fits",
            "steps": [
                {
                    "headline": "Factor your preferred rise height into your waist measurement.",
                    "description": "A low-rise jean will sit 2 to 4 inches (5.1 to 10.2 cm) below your belly button. Mid-rise jeans fall just below your belly button, while high-rise sits closer to the natural waist, at your belly button or a bit above. If you need to, take a waist measurement where you prefer your jeans to fall."
                },
                {
                    "headline": "Measure jeans in the store before you try them on.",
                    "description": "If you hate trying jeans on, use a tape measure to check out the jeans first. Match them up to your measurements to help you find pairs that will fit. If you can't find a perfect match, choose jeans that are slightly bigger. You could also bring a pair of jeans that fit well to the store with you. Hold the jeans up against new pairs to find ones that will fit well."
                },
                {
                    "headline": "Try jeans on before you buy them to see if the measurements were correct.",
                    "description": "Even if you measure your jeans, it's still a good idea to try the jeans on. You won't have as many pairs to try on, so the process will go faster. Each pair of jeans will also feel a little bit different, particularly if some have stretch in them while others do not. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathi Burns, CPO®\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tImage Consultant\t\t\t\t\t\t\t\tKathi Burns is an Image Consultant, Board Certified Professional Organizer (CPO), and the Founder of addSpace To Your Life!, her consulting business with a mission to empower people to master their environment and personal image by assisting them in taking control, making change and organizing their lives. Kathi has over 16 years of organizing experience and her work has been featured on Better Homes and Gardens, NBC News, Good Morning America, and Entrepreneur. She has a BS in Communication from Ohio University. Kathi Burns, CPO®\t\t\tImage Consultant\t\t\t\tTake a friend with you when you're shopping for jeans. When you try on jeans, having a friend can help because they'll be able to see how the jeans fit you in the back. You're not going to be able to tell how well those jeans are working just by twisting around to look in the mirror."
                },
                {
                    "headline": "Study size charts and descriptions when buying online to find the right size.",
                    "description": "Most online stores have size charts where you can check out exactly what each of their sizes mean. Plus, many stores will also have size descriptions on the product page, which may include the hip measurement and the front rise measurement, so you can get a clearer idea of what you're buying. Always be aware of vanity sizing, as you may not be the same size at every store. Don't worry so much about the \"correct\" size. Focus on finding the right measurements. That holds true for men's sizes, too, which in theory are \"measured\" but can also fall prey to different sizes across stores."
                },
                {
                    "headline": "Learn the brands that fit you well so you don't need to measure as often.",
                    "description": "Some brands will always run smaller or larger, so it can be helpful to take note of what brands fit you best. Also, keep notes on what brands run true to size and which ones don't. For instance, one site ranked these brands on a scale, with the first one being closest to true size up to the last one, which was much larger than true size: H&M, Calvin Klein, Alfani, Gap, Haggar, Dockers, Old Navy. If you're shopping for jeans online, read customer feedback and reviews to get a sense for how the pants fit, such as if they run large or small. You may also want to consider buying from retailers with generous return policies for online sales so you can trade them in for another pair if you need to."
                },
                {
                    "headline": "Buy jeans slightly smaller if you think they will stretch.",
                    "description": "Unless they shrink in the wash, most pairs of jeans are at their tightest the first time you wear them. With the stresses from repeated wearing, most jeans loosen up slightly over time, becoming more comfortable to wear. If a pair of jeans feels just just a bit too tight when you try them on, you may be able to get away with wearing them in the long run."
                },
                {
                    "headline": "Consider having your pants tailored for a better fit.",
                    "description": "If you're not happy with the fit of your jeans, having them tailored can make them fit perfectly. Find a nearby tailor who can make some adjustments, which often costs less than buying a bespoke pair of jeans."
                }
            ]
        }
    ],
    "tyn": [
        "Flexible tape measure",
        "Your favorite pair of jeans",
        "Sizing chart"
    ],
    "text": " Determining the Size of a Pair of Jeans Lay a pair of jeans flat on a workspace. To get accurate measurements, smooth out the jeans flat on the surface. Wrinkles can throw your measurements off. Button and zip up your jeans before beginning. Measure the waistband and double the number to get the waist measurement. The waist measurement is one of the most common measurements you'll see in a store. Use a tape measure to go across the top of the jeans. Make sure the waist isn't drooping or sagging at all. If your waistband is made from elastic material, don't stretch it as you measure or you will inflate the waist measurement. Make a note of whether the jeans are labeled as \"high-wasted\" or \"low rise.\" If the jeans are intended to sit somewhere besides your natural waistline, you need to know that before buying a new pair. Check the inseam by measuring the length. The inseam is from the crotch seam down to the hem of the jeans; do not measure from the waist. It's often used by stores to help you find your size, especially in men's sizes. It's what's typically used to measure length for pants. Take the measurement down. Make sure the jeans are completely flat when taking this measurement. Take the measurement from the crotch to the waist to get the rise. It's not as common to see this measurement as it is to see waist or inseam measurements, but you may need it sometimes. Some pant sizes may offer a \"front rise\" and \"back rise\" measurement. The front rise is from the crotch to the waistband in front, and the back rise is from the crotch to the waistband in back. Measure the thighs 2 inches (5.1 cm) below the crotch seam to get the thigh thickness. Measure horizontally across the leg. Double this number to get your thigh measurement. This measurement also isn't as common. Choose an appropriate jean size by comparing your measurements to a chart. For women's jeans, the waist size will be the most important, though the inseam can determine whether you have tall, regular, or a petite pair of jeans. Compare the measurements to a size chart to find the right size. Men's jeans include both the waist measurement and the length. Try this chart to look at sizes from different brands: http://sev.h-cdn.co/assets/cm/15/08/54e782633993b_-_size-chart.pdf. Most shopping websites have size charts for their products, so if you're looking for a particular brand, use their size chart. Keep in mind that with men's jeans, you may need to go up a few inches or centimeters in size, as clothing manufacturers have made sizes smaller, a problem known as vanity sizing. Measuring Yourself to Find the Perfect Fit Use a soft tape measure to measure around your waist for the waist measurement. The tape measure has to bend around your waist, so it needs to be soft. Place the measuring tape directly against your skin about 4 inches (10 cm) below your belly button. Go around the back of your body and back to the front to measure your waist. You'll find many stores use this measurement. If you're not measuring against you're skin, you won't get an accurate measurement. Keep track of these measurements on a piece of paper. Your natural waist is actually a bit higher, just slightly above your belly button. However, most jeans fit lower. Check your inseam by measuring your leg length from the crotch down. With your legs shoulder-width apart, measure from your foot to your crotch on the inside of your leg. If you need to, ask someone you trust to help you. Measure from where you like your jeans to fall on your foot. You'll see this measurement often, especially in men's sizes. For instance, if you like your jeans a bit long, measure from the bottom of your foot. Try not to bend to read the measurement. Instead, use a mirror or mark with the finger holding the measuring tape. If you're struggling to hold the measuring tape in place, try using adhesive tape to secure one end to your ankle while you hold the other at your crotch. Get your hip measurement by measuring around your hips. Some jeans will also have this measurement. Wrap the tape measure around your hips where they are the widest. Make sure the tape measure isn't lifting up or drooping in the back. You won't see this measurement as often, but you can still use it if you're measuring jeans before trying them on. Take your thigh measurement around one thigh. Wrap the tape measure around your skin where your thighs are the thickest. Only take a measurement for one thigh; you don't need to do both. If one is slightly thicker, take the measurement for that thigh. This measurement also isn't very common. Try not to pull your measuring tape too tight or you can give yourself an inaccurate thigh measurement and wind up in an uncomfortable pair of jeans. The tape should be snug, but you should still be able to slip one finger underneath. Check your front rise from your crotch to your belly button. Stretch a tape measure from just behind your crotch line up and over the front of your pelvis to your waist. For women, this is around the belly button; for men, usually an inch or two or a couple of centimeters below. It can be helpful to wear a belt for the front rise measurement to give yourself an indication of where your jean waist would lie. You won't see this measurement as much, but sometimes stores use it to define how high or low the jeans sit. If you need to measure the back rise, do the same thing going the opposite direction. Use your measurements to find a pair of jeans using size charts. In women's jeans, look at the waist, which will be the best indicator of size. You may also use the inseam measurement. For men, you'll use both the length and waist measurement when finding a size on a size chart. Note that sizes may run a little small or large, so it's always best to check the actual chart. When shopping online, use the brand's size chart to find a good fit for that brand. If you need to see sizes in different brands, look at this chart: http://sev.h-cdn.co/assets/cm/15/08/54e782633993b_-_size-chart.pdf. Finding a Pair of Jeans that Fits Factor your preferred rise height into your waist measurement. A low-rise jean will sit 2 to 4 inches (5.1 to 10.2 cm) below your belly button. Mid-rise jeans fall just below your belly button, while high-rise sits closer to the natural waist, at your belly button or a bit above. If you need to, take a waist measurement where you prefer your jeans to fall. Measure jeans in the store before you try them on. If you hate trying jeans on, use a tape measure to check out the jeans first. Match them up to your measurements to help you find pairs that will fit. If you can't find a perfect match, choose jeans that are slightly bigger. You could also bring a pair of jeans that fit well to the store with you. Hold the jeans up against new pairs to find ones that will fit well. Try jeans on before you buy them to see if the measurements were correct. Even if you measure your jeans, it's still a good idea to try the jeans on. You won't have as many pairs to try on, so the process will go faster. Each pair of jeans will also feel a little bit different, particularly if some have stretch in them while others do not. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathi Burns, CPO®\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tImage Consultant\t\t\t\t\t\t\t\tKathi Burns is an Image Consultant, Board Certified Professional Organizer (CPO), and the Founder of addSpace To Your Life!, her consulting business with a mission to empower people to master their environment and personal image by assisting them in taking control, making change and organizing their lives. Kathi has over 16 years of organizing experience and her work has been featured on Better Homes and Gardens, NBC News, Good Morning America, and Entrepreneur. She has a BS in Communication from Ohio University. Kathi Burns, CPO®\t\t\tImage Consultant\t\t\t\tTake a friend with you when you're shopping for jeans. When you try on jeans, having a friend can help because they'll be able to see how the jeans fit you in the back. You're not going to be able to tell how well those jeans are working just by twisting around to look in the mirror. Study size charts and descriptions when buying online to find the right size. Most online stores have size charts where you can check out exactly what each of their sizes mean. Plus, many stores will also have size descriptions on the product page, which may include the hip measurement and the front rise measurement, so you can get a clearer idea of what you're buying. Always be aware of vanity sizing, as you may not be the same size at every store. Don't worry so much about the \"correct\" size. Focus on finding the right measurements. That holds true for men's sizes, too, which in theory are \"measured\" but can also fall prey to different sizes across stores. Learn the brands that fit you well so you don't need to measure as often. Some brands will always run smaller or larger, so it can be helpful to take note of what brands fit you best. Also, keep notes on what brands run true to size and which ones don't. For instance, one site ranked these brands on a scale, with the first one being closest to true size up to the last one, which was much larger than true size: H&M, Calvin Klein, Alfani, Gap, Haggar, Dockers, Old Navy. If you're shopping for jeans online, read customer feedback and reviews to get a sense for how the pants fit, such as if they run large or small. You may also want to consider buying from retailers with generous return policies for online sales so you can trade them in for another pair if you need to. Buy jeans slightly smaller if you think they will stretch. Unless they shrink in the wash, most pairs of jeans are at their tightest the first time you wear them. With the stresses from repeated wearing, most jeans loosen up slightly over time, becoming more comfortable to wear. If a pair of jeans feels just just a bit too tight when you try them on, you may be able to get away with wearing them in the long run. Consider having your pants tailored for a better fit. If you're not happy with the fit of your jeans, having them tailored can make them fit perfectly. Find a nearby tailor who can make some adjustments, which often costs less than buying a bespoke pair of jeans.",
    "sentences": [
        " Determining the Size of a Pair of Jeans Lay a pair of jeans flat on a workspace.",
        "To get accurate measurements, smooth out the jeans flat on the surface.",
        "Wrinkles can throw your measurements off.",
        "Button and zip up your jeans before beginning.",
        "Measure the waistband and double the number to get the waist measurement.",
        "The waist measurement is one of the most common measurements you'll see in a store.",
        "Use a tape measure to go across the top of the jeans.",
        "Make sure the waist isn't drooping or sagging at all.",
        "If your waistband is made from elastic material, don't stretch it as you measure or you will inflate the waist measurement.",
        "Make a note of whether the jeans are labeled as \"high-wasted\" or \"low rise.\"",
        "If the jeans are intended to sit somewhere besides your natural waistline, you need to know that before buying a new pair.",
        "Check the inseam by measuring the length.",
        "The inseam is from the crotch seam down to the hem of the jeans; do not measure from the waist.",
        "It's often used by stores to help you find your size, especially in men's sizes.",
        "It's what's typically used to measure length for pants.",
        "Take the measurement down.",
        "Make sure the jeans are completely flat when taking this measurement.",
        "Take the measurement from the crotch to the waist to get the rise.",
        "It's not as common to see this measurement as it is to see waist or inseam measurements, but you may need it sometimes.",
        "Some pant sizes may offer a \"front rise\" and \"back rise\" measurement.",
        "The front rise is from the crotch to the waistband in front, and the back rise is from the crotch to the waistband in back.",
        "Measure the thighs 2 inches (5.1 cm) below the crotch seam to get the thigh thickness.",
        "Measure horizontally across the leg.",
        "Double this number to get your thigh measurement.",
        "This measurement also isn't as common.",
        "Choose an appropriate jean size by comparing your measurements to a chart.",
        "For women's jeans, the waist size will be the most important, though the inseam can determine whether you have tall, regular, or a petite pair of jeans.",
        "Compare the measurements to a size chart to find the right size.",
        "Men's jeans include both the waist measurement and the length.",
        "Try this chart to look at sizes from different brands: http://sev.h-cdn.co/assets/cm/15/08/54e782633993b_-_size-chart.pdf.",
        "Most shopping websites have size charts for their products, so if you're looking for a particular brand, use their size chart.",
        "Keep in mind that with men's jeans, you may need to go up a few inches or centimeters in size, as clothing manufacturers have made sizes smaller, a problem known as vanity sizing.",
        "Measuring Yourself to Find the Perfect Fit Use a soft tape measure to measure around your waist for the waist measurement.",
        "The tape measure has to bend around your waist, so it needs to be soft.",
        "Place the measuring tape directly against your skin about 4 inches (10 cm) below your belly button.",
        "Go around the back of your body and back to the front to measure your waist.",
        "You'll find many stores use this measurement.",
        "If you're not measuring against you're skin, you won't get an accurate measurement.",
        "Keep track of these measurements on a piece of paper.",
        "Your natural waist is actually a bit higher, just slightly above your belly button.",
        "However, most jeans fit lower.",
        "Check your inseam by measuring your leg length from the crotch down.",
        "With your legs shoulder-width apart, measure from your foot to your crotch on the inside of your leg.",
        "If you need to, ask someone you trust to help you.",
        "Measure from where you like your jeans to fall on your foot.",
        "You'll see this measurement often, especially in men's sizes.",
        "For instance, if you like your jeans a bit long, measure from the bottom of your foot.",
        "Try not to bend to read the measurement.",
        "Instead, use a mirror or mark with the finger holding the measuring tape.",
        "If you're struggling to hold the measuring tape in place, try using adhesive tape to secure one end to your ankle while you hold the other at your crotch.",
        "Get your hip measurement by measuring around your hips.",
        "Some jeans will also have this measurement.",
        "Wrap the tape measure around your hips where they are the widest.",
        "Make sure the tape measure isn't lifting up or drooping in the back.",
        "You won't see this measurement as often, but you can still use it if you're measuring jeans before trying them on.",
        "Take your thigh measurement around one thigh.",
        "Wrap the tape measure around your skin where your thighs are the thickest.",
        "Only take a measurement for one thigh; you don't need to do both.",
        "If one is slightly thicker, take the measurement for that thigh.",
        "This measurement also isn't very common.",
        "Try not to pull your measuring tape too tight or you can give yourself an inaccurate thigh measurement and wind up in an uncomfortable pair of jeans.",
        "The tape should be snug, but you should still be able to slip one finger underneath.",
        "Check your front rise from your crotch to your belly button.",
        "Stretch a tape measure from just behind your crotch line up and over the front of your pelvis to your waist.",
        "For women, this is around the belly button; for men, usually an inch or two or a couple of centimeters below.",
        "It can be helpful to wear a belt for the front rise measurement to give yourself an indication of where your jean waist would lie.",
        "You won't see this measurement as much, but sometimes stores use it to define how high or low the jeans sit.",
        "If you need to measure the back rise, do the same thing going the opposite direction.",
        "Use your measurements to find a pair of jeans using size charts.",
        "In women's jeans, look at the waist, which will be the best indicator of size.",
        "You may also use the inseam measurement.",
        "For men, you'll use both the length and waist measurement when finding a size on a size chart.",
        "Note that sizes may run a little small or large, so it's always best to check the actual chart.",
        "When shopping online, use the brand's size chart to find a good fit for that brand.",
        "If you need to see sizes in different brands, look at this chart: http://sev.h-cdn.co/assets/cm/15/08/54e782633993b_-_size-chart.pdf.",
        "Finding a Pair of Jeans that Fits Factor your preferred rise height into your waist measurement.",
        "A low-rise jean will sit 2 to 4 inches (5.1 to 10.2 cm) below your belly button.",
        "Mid-rise jeans fall just below your belly button, while high-rise sits closer to the natural waist, at your belly button or a bit above.",
        "If you need to, take a waist measurement where you prefer your jeans to fall.",
        "Measure jeans in the store before you try them on.",
        "If you hate trying jeans on, use a tape measure to check out the jeans first.",
        "Match them up to your measurements to help you find pairs that will fit.",
        "If you can't find a perfect match, choose jeans that are slightly bigger.",
        "You could also bring a pair of jeans that fit well to the store with you.",
        "Hold the jeans up against new pairs to find ones that will fit well.",
        "Try jeans on before you buy them to see if the measurements were correct.",
        "Even if you measure your jeans, it's still a good idea to try the jeans on.",
        "You won't have as many pairs to try on, so the process will go faster.",
        "Each pair of jeans will also feel a little bit different, particularly if some have stretch in them while others do not.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathi Burns, CPO®\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tImage Consultant\t\t\t\t\t\t\t\tKathi Burns is an Image Consultant, Board Certified Professional Organizer (CPO), and the Founder of addSpace To Your Life!, her consulting business with a mission to empower people to master their environment and personal image by assisting them in taking control, making change and organizing their lives.",
        "Kathi has over 16 years of organizing experience and her work has been featured on Better Homes and Gardens, NBC News, Good Morning America, and Entrepreneur.",
        "She has a BS in Communication from Ohio University.",
        "Kathi Burns, CPO®\t\t\tImage Consultant\t\t\t\tTake a friend with you when you're shopping for jeans.",
        "When you try on jeans, having a friend can help because they'll be able to see how the jeans fit you in the back.",
        "You're not going to be able to tell how well those jeans are working just by twisting around to look in the mirror.",
        "Study size charts and descriptions when buying online to find the right size.",
        "Most online stores have size charts where you can check out exactly what each of their sizes mean.",
        "Plus, many stores will also have size descriptions on the product page, which may include the hip measurement and the front rise measurement, so you can get a clearer idea of what you're buying.",
        "Always be aware of vanity sizing, as you may not be the same size at every store.",
        "Don't worry so much about the \"correct\" size.",
        "Focus on finding the right measurements.",
        "That holds true for men's sizes, too, which in theory are \"measured\" but can also fall prey to different sizes across stores.",
        "Learn the brands that fit you well so you don't need to measure as often.",
        "Some brands will always run smaller or larger, so it can be helpful to take note of what brands fit you best.",
        "Also, keep notes on what brands run true to size and which ones don't.",
        "For instance, one site ranked these brands on a scale, with the first one being closest to true size up to the last one, which was much larger than true size: H&M, Calvin Klein, Alfani, Gap, Haggar, Dockers, Old Navy.",
        "If you're shopping for jeans online, read customer feedback and reviews to get a sense for how the pants fit, such as if they run large or small.",
        "You may also want to consider buying from retailers with generous return policies for online sales so you can trade them in for another pair if you need to.",
        "Buy jeans slightly smaller if you think they will stretch.",
        "Unless they shrink in the wash, most pairs of jeans are at their tightest the first time you wear them.",
        "With the stresses from repeated wearing, most jeans loosen up slightly over time, becoming more comfortable to wear.",
        "If a pair of jeans feels just just a bit too tight when you try them on, you may be able to get away with wearing them in the long run.",
        "Consider having your pants tailored for a better fit.",
        "If you're not happy with the fit of your jeans, having them tailored can make them fit perfectly.",
        "Find a nearby tailor who can make some adjustments, which often costs less than buying a bespoke pair of jeans."
    ]
}