{
    "title": "How to Broil Chicken Breasts",
    "url": "https://www.wikihow.com/Broil-Chicken-Breasts",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Meat",
        "Poultry Recipes",
        "Chicken"
    ],
    "parts": [
        {
            "name": "Defrosting and Seasoning the Chicken",
            "steps": [
                {
                    "headline": "Defrost the chicken breasts in the fridge for at least 5 hours.",
                    "description": "The best way to defrost any type of frozen meat is to place it in the refrigerator and let it thaw out over several hours. If you don’t have time to leave the chicken in the fridge this long, you can defrost it in cold water for 2-3 hours or use a microwave if you’re in a pinch. Using the refrigerator is safer than other options because it prevents the chicken from being exposed to bacteria that can grow in warmer temperatures. It also helps the chicken maintain its flavor. If you’ve bought your chicken breast fresh (unfrozen), you can skip the defrosting step altogether."
                },
                {
                    "headline": "Mix 5 tbsp of olive oil, 3 tsp of salt, and 2 tsp of pepper in a bowl.",
                    "description": "Stir these ingredients thoroughly together with a spoon or brush. You may also choose to add additional herbs and spices, such as garlic, thyme, or fennel, to your mixture for extra taste and texture. The olive oil adds flavor to the chicken and helps the seasonings adhere better to each breast."
                },
                {
                    "headline": "Rub the mixture into the chicken using your hands or a pastry brush.",
                    "description": "Coat each chicken breast as thoroughly as possible before cooking and take your time with each one. Once you’ve coated each chicken breast, you can sprinkle additional salt, pepper, and other seasonings over the chicken for added flavor."
                },
                {
                    "headline": "Coat a large cooking sheet with a nonstick spray.",
                    "description": "Saturate the sheet evenly, using plenty of spray. If the chicken sticks to the sheet while it’s broiling, you may lose some of the seasoning and flavor. Alternatively, you can spread a very thin layer of olive oil over the sheet."
                },
                {
                    "headline": "Place the chicken breasts on the cooking sheet a few inches apart.",
                    "description": "Make sure the chicken breasts aren’t touching each other. Each breast should be exposed to the heat of the broiler while it cooks. Spacing the chicken breasts a few inches apart also makes turning them over during the cooking process easier."
                }
            ]
        },
        {
            "name": "Cooking the Chicken in the Broiler",
            "steps": [
                {
                    "headline": "Place the oven rack about 6 inches (15 cm) from the heat source.",
                    "description": "There should be some space between the chicken and the broiling element in your oven to prevent the outside of the chicken from burning. The thicker the chicken breasts, the farther they should be from the broiler. So, if you have larger chicken breasts, you’ll want to lower the rack a couple of inches to accommodate the extra thickness."
                },
                {
                    "headline": "Preheat the oven’s broiler about 5 minutes before cooking.",
                    "description": "Most ovens only have 2 broiler settings: on and off. If your broiler has multiple settings, use the lower setting."
                },
                {
                    "headline": "Put the cooking sheet with the seasoned chicken under the broiler.",
                    "description": "You may want to use oven mitts to avoid burning your hands. Keep in mind that you’re cooking with direct heat and the oven will be very hot. Place the pan in the center of the oven rack for the best results."
                },
                {
                    "headline": "Broil the chicken for about 10 minutes, leaving the oven door ajar.",
                    "description": "You don’t want to have the door completely open, but leave a small gap to help vent steam out of the oven. Too much steam can prevent the outside of the chicken from crisping (which is part of the point of broiling in the first place)."
                },
                {
                    "headline": "Watch the chicken breasts carefully as they cook.",
                    "description": "You may choose to place aluminum foil around the edges of the chicken breasts if they begin to brown to prevent burning on the thinner parts of the chicken. Broilers are extremely hot and chicken can easily burn if it’s not monitored. The size of the chicken breasts and the temperature of your broiler can impact cooking time."
                },
                {
                    "headline": "Turn the chicken over with metal tongs when one side has browned.",
                    "description": "Generally, it will take about 10 minutes for the chicken to be ready to turn. The chicken breasts should be golden brown on top. Use long metal tongs to avoid burning your hands under the hot broiler. It’s best not to use a fork or other sharp object to turn the chicken breasts. Piercing the chicken can cause the juices to escape and make your chicken dry and less flavorful."
                },
                {
                    "headline": "Brush the chicken with additional olive oil and seasoning.",
                    "description": "This keeps the chicken moist, even while it’s being broiled at extreme temperatures. Adding additional oil and seasoning also helps replace any seasoning that may have come off when you transferred the chicken onto the cooking sheet and into the oven."
                },
                {
                    "headline": "Broil the chicken for 10 more minutes or until fully cooked.",
                    "description": "Continue broiling until the juices run clear and the chicken is no longer pink in the center. Cooking times vary depending on the thickness of the meat. To be sure the chicken is fully cooked, you can use a meat thermometer to check the chicken’s internal temperature. It should be around 165 °F (74 °C) when it’s done."
                },
                {
                    "headline": "Remove the chicken and let it sit for 5 minutes before serving.",
                    "description": "Use oven mitts to remove the cooking sheet from the oven. The chicken will be extremely hot, so make sure to let it cool before enjoying it."
                }
            ]
        }
    ],
    "tyn": [
        "Bowl",
        "Measuring spoons",
        "Pastry brush",
        "Nonstick spray",
        "Cooking sheet",
        "Broiler",
        "Metal tongs",
        "Oven mitts",
        "Aluminum foil (optional)"
    ],
    "text": " Defrosting and Seasoning the Chicken Defrost the chicken breasts in the fridge for at least 5 hours. The best way to defrost any type of frozen meat is to place it in the refrigerator and let it thaw out over several hours. If you don’t have time to leave the chicken in the fridge this long, you can defrost it in cold water for 2-3 hours or use a microwave if you’re in a pinch. Using the refrigerator is safer than other options because it prevents the chicken from being exposed to bacteria that can grow in warmer temperatures. It also helps the chicken maintain its flavor. If you’ve bought your chicken breast fresh (unfrozen), you can skip the defrosting step altogether. Mix 5 tbsp of olive oil, 3 tsp of salt, and 2 tsp of pepper in a bowl. Stir these ingredients thoroughly together with a spoon or brush. You may also choose to add additional herbs and spices, such as garlic, thyme, or fennel, to your mixture for extra taste and texture. The olive oil adds flavor to the chicken and helps the seasonings adhere better to each breast. Rub the mixture into the chicken using your hands or a pastry brush. Coat each chicken breast as thoroughly as possible before cooking and take your time with each one. Once you’ve coated each chicken breast, you can sprinkle additional salt, pepper, and other seasonings over the chicken for added flavor. Coat a large cooking sheet with a nonstick spray. Saturate the sheet evenly, using plenty of spray. If the chicken sticks to the sheet while it’s broiling, you may lose some of the seasoning and flavor. Alternatively, you can spread a very thin layer of olive oil over the sheet. Place the chicken breasts on the cooking sheet a few inches apart. Make sure the chicken breasts aren’t touching each other. Each breast should be exposed to the heat of the broiler while it cooks. Spacing the chicken breasts a few inches apart also makes turning them over during the cooking process easier. Cooking the Chicken in the Broiler Place the oven rack about 6 inches (15 cm) from the heat source. There should be some space between the chicken and the broiling element in your oven to prevent the outside of the chicken from burning. The thicker the chicken breasts, the farther they should be from the broiler. So, if you have larger chicken breasts, you’ll want to lower the rack a couple of inches to accommodate the extra thickness. Preheat the oven’s broiler about 5 minutes before cooking. Most ovens only have 2 broiler settings: on and off. If your broiler has multiple settings, use the lower setting. Put the cooking sheet with the seasoned chicken under the broiler. You may want to use oven mitts to avoid burning your hands. Keep in mind that you’re cooking with direct heat and the oven will be very hot. Place the pan in the center of the oven rack for the best results. Broil the chicken for about 10 minutes, leaving the oven door ajar. You don’t want to have the door completely open, but leave a small gap to help vent steam out of the oven. Too much steam can prevent the outside of the chicken from crisping (which is part of the point of broiling in the first place). Watch the chicken breasts carefully as they cook. You may choose to place aluminum foil around the edges of the chicken breasts if they begin to brown to prevent burning on the thinner parts of the chicken. Broilers are extremely hot and chicken can easily burn if it’s not monitored. The size of the chicken breasts and the temperature of your broiler can impact cooking time. Turn the chicken over with metal tongs when one side has browned. Generally, it will take about 10 minutes for the chicken to be ready to turn. The chicken breasts should be golden brown on top. Use long metal tongs to avoid burning your hands under the hot broiler. It’s best not to use a fork or other sharp object to turn the chicken breasts. Piercing the chicken can cause the juices to escape and make your chicken dry and less flavorful. Brush the chicken with additional olive oil and seasoning. This keeps the chicken moist, even while it’s being broiled at extreme temperatures. Adding additional oil and seasoning also helps replace any seasoning that may have come off when you transferred the chicken onto the cooking sheet and into the oven. Broil the chicken for 10 more minutes or until fully cooked. Continue broiling until the juices run clear and the chicken is no longer pink in the center. Cooking times vary depending on the thickness of the meat. To be sure the chicken is fully cooked, you can use a meat thermometer to check the chicken’s internal temperature. It should be around 165 °F (74 °C) when it’s done. Remove the chicken and let it sit for 5 minutes before serving. Use oven mitts to remove the cooking sheet from the oven. The chicken will be extremely hot, so make sure to let it cool before enjoying it.",
    "sentences": [
        " Defrosting and Seasoning the Chicken Defrost the chicken breasts in the fridge for at least 5 hours.",
        "The best way to defrost any type of frozen meat is to place it in the refrigerator and let it thaw out over several hours.",
        "If you don’t have time to leave the chicken in the fridge this long, you can defrost it in cold water for 2-3 hours or use a microwave if you’re in a pinch.",
        "Using the refrigerator is safer than other options because it prevents the chicken from being exposed to bacteria that can grow in warmer temperatures.",
        "It also helps the chicken maintain its flavor.",
        "If you’ve bought your chicken breast fresh (unfrozen), you can skip the defrosting step altogether.",
        "Mix 5 tbsp of olive oil, 3 tsp of salt, and 2 tsp of pepper in a bowl.",
        "Stir these ingredients thoroughly together with a spoon or brush.",
        "You may also choose to add additional herbs and spices, such as garlic, thyme, or fennel, to your mixture for extra taste and texture.",
        "The olive oil adds flavor to the chicken and helps the seasonings adhere better to each breast.",
        "Rub the mixture into the chicken using your hands or a pastry brush.",
        "Coat each chicken breast as thoroughly as possible before cooking and take your time with each one.",
        "Once you’ve coated each chicken breast, you can sprinkle additional salt, pepper, and other seasonings over the chicken for added flavor.",
        "Coat a large cooking sheet with a nonstick spray.",
        "Saturate the sheet evenly, using plenty of spray.",
        "If the chicken sticks to the sheet while it’s broiling, you may lose some of the seasoning and flavor.",
        "Alternatively, you can spread a very thin layer of olive oil over the sheet.",
        "Place the chicken breasts on the cooking sheet a few inches apart.",
        "Make sure the chicken breasts aren’t touching each other.",
        "Each breast should be exposed to the heat of the broiler while it cooks.",
        "Spacing the chicken breasts a few inches apart also makes turning them over during the cooking process easier.",
        "Cooking the Chicken in the Broiler Place the oven rack about 6 inches (15 cm) from the heat source.",
        "There should be some space between the chicken and the broiling element in your oven to prevent the outside of the chicken from burning.",
        "The thicker the chicken breasts, the farther they should be from the broiler.",
        "So, if you have larger chicken breasts, you’ll want to lower the rack a couple of inches to accommodate the extra thickness.",
        "Preheat the oven’s broiler about 5 minutes before cooking.",
        "Most ovens only have 2 broiler settings: on and off.",
        "If your broiler has multiple settings, use the lower setting.",
        "Put the cooking sheet with the seasoned chicken under the broiler.",
        "You may want to use oven mitts to avoid burning your hands.",
        "Keep in mind that you’re cooking with direct heat and the oven will be very hot.",
        "Place the pan in the center of the oven rack for the best results.",
        "Broil the chicken for about 10 minutes, leaving the oven door ajar.",
        "You don’t want to have the door completely open, but leave a small gap to help vent steam out of the oven.",
        "Too much steam can prevent the outside of the chicken from crisping (which is part of the point of broiling in the first place).",
        "Watch the chicken breasts carefully as they cook.",
        "You may choose to place aluminum foil around the edges of the chicken breasts if they begin to brown to prevent burning on the thinner parts of the chicken.",
        "Broilers are extremely hot and chicken can easily burn if it’s not monitored.",
        "The size of the chicken breasts and the temperature of your broiler can impact cooking time.",
        "Turn the chicken over with metal tongs when one side has browned.",
        "Generally, it will take about 10 minutes for the chicken to be ready to turn.",
        "The chicken breasts should be golden brown on top.",
        "Use long metal tongs to avoid burning your hands under the hot broiler.",
        "It’s best not to use a fork or other sharp object to turn the chicken breasts.",
        "Piercing the chicken can cause the juices to escape and make your chicken dry and less flavorful.",
        "Brush the chicken with additional olive oil and seasoning.",
        "This keeps the chicken moist, even while it’s being broiled at extreme temperatures.",
        "Adding additional oil and seasoning also helps replace any seasoning that may have come off when you transferred the chicken onto the cooking sheet and into the oven.",
        "Broil the chicken for 10 more minutes or until fully cooked.",
        "Continue broiling until the juices run clear and the chicken is no longer pink in the center.",
        "Cooking times vary depending on the thickness of the meat.",
        "To be sure the chicken is fully cooked, you can use a meat thermometer to check the chicken’s internal temperature.",
        "It should be around 165 °F (74 °C) when it’s done.",
        "Remove the chicken and let it sit for 5 minutes before serving.",
        "Use oven mitts to remove the cooking sheet from the oven.",
        "The chicken will be extremely hot, so make sure to let it cool before enjoying it."
    ]
}