{
    "title": "How to Mix Grout",
    "url": "https://www.wikihow.com/Mix-Grout",
    "category_hierarchy": [
        "Home and Garden",
        "DIY",
        "Tiles and Tiling",
        "Tiling Grout"
    ],
    "parts": [
        {
            "name": "Choosing the Grout",
            "steps": [
                {
                    "headline": "Use sanded grout for wider grout lines.",
                    "description": "Sanded grout has been mixed with fine sand, which helps keep it in place across the entire joint instead of shrinking. Choose sanded grout when filling gaps ⅛ inch (3.2 millimeters) or wider. Sanded grout is not ideal for narrow lines, as the sand can take up too much of the width and weaken the structure."
                },
                {
                    "headline": "Use non-sanded grout for narrow lines.",
                    "description": "Non-sanded grout, also called \"unsanded\" or \"wall grout,\" is typically recommended for lines under ⅛\" (3.2 mm) wide, but some prefer to reserve non-sanded grout for lines /16\" (1.6 mm) or smaller. Non-sanded grout will shrink significantly as it dries, but the more narrow the line, the less noticeable this is. This grout is also stickier and easier to work with than sanded grout, especially on vertical surfaces."
                },
                {
                    "headline": "Be cautious when treating polished stone.",
                    "description": "If you are applying the grout to polished stone, test sanded grout on an inconspicuous corner first to check for scratching from sand particles. If the stone does end up scratched, use non-sanded grout instead. If the grout joints are considerably larger than ⅛\" (3.2 mm) wide, consider epoxy grout instead. Highly reflective polished stone is more likely to be scratched than honed stone, with a matte appearance."
                },
                {
                    "headline": "Use epoxy grout only for high-risk areas.",
                    "description": "Epoxy grout resists grease, acid, and wear much better than ordinary grout, and can substitute for either sanded or unsanded grout. It provides serious protection for kitchen countertops or other areas with high spill risk, but dries much faster and is much harder to apply than other forms of grout. It also tends to be considerably more expensive. It’s usually only needed in commercial kitchens, such as the ones in restaurants. Epoxy grout can discolor some porous, unglazed, stone materials. Seal the stone first before you apply the epoxy grout."
                },
                {
                    "headline": "Use caulk to join surfaces at an angle.",
                    "description": "Caulk creates a more flexible seal. Use it instead of grout when filling the gap between a wall and a floor, or another joint between two different planes. If you’re concerned about matching throughout, you can also purchase either sanded or unsanded grout caulk, which is a mixture of the two."
                },
                {
                    "headline": "Choose a color.",
                    "description": "The safest choice is an unobtrusive grout that matches the material you'll be joining, but you can try for a striking contrast if you're certain you like the look. Because white grout turns dirty yellow or off-white over time, light grey or light brown are generally better options, especially in humid or wet environments. If you do not plan on sealing your grout, a darker grout may be a better option. Dust from black, green, and red grout tends to be more difficult to clean off surrounding materials, so make sure to wipe the excess grout away thoroughly if you choose one of these colors."
                }
            ]
        },
        {
            "name": "Mixing the Grout",
            "steps": [
                {
                    "headline": "Consider an additive.",
                    "description": "A polymer grout additive increases the grout's durability, but read the grout's label first, as it may already contain an additive. If it does not, you may purchase an additive and follow the instructions on its label while mixing, replacing some or all of the water as directed. Otherwise, the process is the same as described below."
                },
                {
                    "headline": "Follow label instructions for epoxy grout.",
                    "description": "Epoxy grout products typically consist of two or three components, and the mixing proportions between these vary depending on the brand. For more traditional grout products, the steps below should work, but check the label first in case of unusual instructions."
                },
                {
                    "headline": "Gather materials.",
                    "description": "You'll need an empty bucket, a container of water, and a sponge. Find a pointer trowel, margin trowel, or a mixer paddle drill bit to use to mix the grout and apply it. Finally, pull on a pair of gloves."
                },
                {
                    "headline": "Add the grout powder to the bucket.",
                    "description": "Measure out all of the grout powder required for the quantity of grout you’re producing and pour it into the bucket."
                },
                {
                    "headline": "Add ¾ of the total water needed.",
                    "description": "Check the grout label to find out how much water you need for the amount of space you'll be covering. Pour ¾ of the amount of water required in with the grout powder. If you have a large area to cover, consider mixing half the grout at a time, so the grout in the bucket doesn't dry out before you're done."
                },
                {
                    "headline": "Mix the grout with a trowel.",
                    "description": "Use your trowel to mix the powder into the water, until you've made a thick paste with no dry lumps. Tilt the bucket toward you slightly, rolling it on its edge as you scrape off any dry grout from the sides. If you have a mixing drill and attached grout paddle, you can use that instead. Stay below 150 rpm to avoid weakening the grout with excess air bubbles."
                },
                {
                    "headline": "Squeeze in more water with the sponge.",
                    "description": "Add water one squeeze at a time from a sponge, mixing it thoroughly into the grout. Aim for a smooth \"peanut butter\" consistency, with no lumps. If the grout gets watery, pour in a little bit more powder."
                },
                {
                    "headline": "Leave the grout alone for 5–10 minutes.",
                    "description": "Allow the grout to \"slake,\" or strengthen through chemical reactions. Leave your trowel on newspaper or other surface to prevent a mess."
                },
                {
                    "headline": "Remix and apply.",
                    "description": "Briefly mix together the grout again, as it will become slightly stiff during slaking. Use immediately, as most grout sets within 30–60 minutes. If the grout has already hardened, you'll need to discard it and make a new batch. Adding more water after slaking will not be effective."
                }
            ]
        }
    ],
    "tyn": [
        "Grout powder",
        "Water",
        "Trowel",
        "Bucket",
        "Sponge",
        "Mixing drill with grout paddle (optional)",
        "Gloves",
        "Grout float"
    ],
    "text": " Choosing the Grout Use sanded grout for wider grout lines. Sanded grout has been mixed with fine sand, which helps keep it in place across the entire joint instead of shrinking. Choose sanded grout when filling gaps ⅛ inch (3.2 millimeters) or wider. Sanded grout is not ideal for narrow lines, as the sand can take up too much of the width and weaken the structure. Use non-sanded grout for narrow lines. Non-sanded grout, also called \"unsanded\" or \"wall grout,\" is typically recommended for lines under ⅛\" (3.2 mm) wide, but some prefer to reserve non-sanded grout for lines /16\" (1.6 mm) or smaller. Non-sanded grout will shrink significantly as it dries, but the more narrow the line, the less noticeable this is. This grout is also stickier and easier to work with than sanded grout, especially on vertical surfaces. Be cautious when treating polished stone. If you are applying the grout to polished stone, test sanded grout on an inconspicuous corner first to check for scratching from sand particles. If the stone does end up scratched, use non-sanded grout instead. If the grout joints are considerably larger than ⅛\" (3.2 mm) wide, consider epoxy grout instead. Highly reflective polished stone is more likely to be scratched than honed stone, with a matte appearance. Use epoxy grout only for high-risk areas. Epoxy grout resists grease, acid, and wear much better than ordinary grout, and can substitute for either sanded or unsanded grout. It provides serious protection for kitchen countertops or other areas with high spill risk, but dries much faster and is much harder to apply than other forms of grout. It also tends to be considerably more expensive. It’s usually only needed in commercial kitchens, such as the ones in restaurants. Epoxy grout can discolor some porous, unglazed, stone materials. Seal the stone first before you apply the epoxy grout. Use caulk to join surfaces at an angle. Caulk creates a more flexible seal. Use it instead of grout when filling the gap between a wall and a floor, or another joint between two different planes. If you’re concerned about matching throughout, you can also purchase either sanded or unsanded grout caulk, which is a mixture of the two. Choose a color. The safest choice is an unobtrusive grout that matches the material you'll be joining, but you can try for a striking contrast if you're certain you like the look. Because white grout turns dirty yellow or off-white over time, light grey or light brown are generally better options, especially in humid or wet environments. If you do not plan on sealing your grout, a darker grout may be a better option. Dust from black, green, and red grout tends to be more difficult to clean off surrounding materials, so make sure to wipe the excess grout away thoroughly if you choose one of these colors. Mixing the Grout Consider an additive. A polymer grout additive increases the grout's durability, but read the grout's label first, as it may already contain an additive. If it does not, you may purchase an additive and follow the instructions on its label while mixing, replacing some or all of the water as directed. Otherwise, the process is the same as described below. Follow label instructions for epoxy grout. Epoxy grout products typically consist of two or three components, and the mixing proportions between these vary depending on the brand. For more traditional grout products, the steps below should work, but check the label first in case of unusual instructions. Gather materials. You'll need an empty bucket, a container of water, and a sponge. Find a pointer trowel, margin trowel, or a mixer paddle drill bit to use to mix the grout and apply it. Finally, pull on a pair of gloves. Add the grout powder to the bucket. Measure out all of the grout powder required for the quantity of grout you’re producing and pour it into the bucket. Add ¾ of the total water needed. Check the grout label to find out how much water you need for the amount of space you'll be covering. Pour ¾ of the amount of water required in with the grout powder. If you have a large area to cover, consider mixing half the grout at a time, so the grout in the bucket doesn't dry out before you're done. Mix the grout with a trowel. Use your trowel to mix the powder into the water, until you've made a thick paste with no dry lumps. Tilt the bucket toward you slightly, rolling it on its edge as you scrape off any dry grout from the sides. If you have a mixing drill and attached grout paddle, you can use that instead. Stay below 150 rpm to avoid weakening the grout with excess air bubbles. Squeeze in more water with the sponge. Add water one squeeze at a time from a sponge, mixing it thoroughly into the grout. Aim for a smooth \"peanut butter\" consistency, with no lumps. If the grout gets watery, pour in a little bit more powder. Leave the grout alone for 5–10 minutes. Allow the grout to \"slake,\" or strengthen through chemical reactions. Leave your trowel on newspaper or other surface to prevent a mess. Remix and apply. Briefly mix together the grout again, as it will become slightly stiff during slaking. Use immediately, as most grout sets within 30–60 minutes. If the grout has already hardened, you'll need to discard it and make a new batch. Adding more water after slaking will not be effective.",
    "sentences": [
        " Choosing the Grout Use sanded grout for wider grout lines.",
        "Sanded grout has been mixed with fine sand, which helps keep it in place across the entire joint instead of shrinking.",
        "Choose sanded grout when filling gaps ⅛ inch (3.2 millimeters) or wider.",
        "Sanded grout is not ideal for narrow lines, as the sand can take up too much of the width and weaken the structure.",
        "Use non-sanded grout for narrow lines.",
        "Non-sanded grout, also called \"unsanded\" or \"wall grout,\" is typically recommended for lines under ⅛\" (3.2 mm) wide, but some prefer to reserve non-sanded grout for lines /16\" (1.6 mm) or smaller.",
        "Non-sanded grout will shrink significantly as it dries, but the more narrow the line, the less noticeable this is.",
        "This grout is also stickier and easier to work with than sanded grout, especially on vertical surfaces.",
        "Be cautious when treating polished stone.",
        "If you are applying the grout to polished stone, test sanded grout on an inconspicuous corner first to check for scratching from sand particles.",
        "If the stone does end up scratched, use non-sanded grout instead.",
        "If the grout joints are considerably larger than ⅛\" (3.2 mm) wide, consider epoxy grout instead.",
        "Highly reflective polished stone is more likely to be scratched than honed stone, with a matte appearance.",
        "Use epoxy grout only for high-risk areas.",
        "Epoxy grout resists grease, acid, and wear much better than ordinary grout, and can substitute for either sanded or unsanded grout.",
        "It provides serious protection for kitchen countertops or other areas with high spill risk, but dries much faster and is much harder to apply than other forms of grout.",
        "It also tends to be considerably more expensive.",
        "It’s usually only needed in commercial kitchens, such as the ones in restaurants.",
        "Epoxy grout can discolor some porous, unglazed, stone materials.",
        "Seal the stone first before you apply the epoxy grout.",
        "Use caulk to join surfaces at an angle.",
        "Caulk creates a more flexible seal.",
        "Use it instead of grout when filling the gap between a wall and a floor, or another joint between two different planes.",
        "If you’re concerned about matching throughout, you can also purchase either sanded or unsanded grout caulk, which is a mixture of the two.",
        "Choose a color.",
        "The safest choice is an unobtrusive grout that matches the material you'll be joining, but you can try for a striking contrast if you're certain you like the look.",
        "Because white grout turns dirty yellow or off-white over time, light grey or light brown are generally better options, especially in humid or wet environments.",
        "If you do not plan on sealing your grout, a darker grout may be a better option.",
        "Dust from black, green, and red grout tends to be more difficult to clean off surrounding materials, so make sure to wipe the excess grout away thoroughly if you choose one of these colors.",
        "Mixing the Grout Consider an additive.",
        "A polymer grout additive increases the grout's durability, but read the grout's label first, as it may already contain an additive.",
        "If it does not, you may purchase an additive and follow the instructions on its label while mixing, replacing some or all of the water as directed.",
        "Otherwise, the process is the same as described below.",
        "Follow label instructions for epoxy grout.",
        "Epoxy grout products typically consist of two or three components, and the mixing proportions between these vary depending on the brand.",
        "For more traditional grout products, the steps below should work, but check the label first in case of unusual instructions.",
        "Gather materials.",
        "You'll need an empty bucket, a container of water, and a sponge.",
        "Find a pointer trowel, margin trowel, or a mixer paddle drill bit to use to mix the grout and apply it.",
        "Finally, pull on a pair of gloves.",
        "Add the grout powder to the bucket.",
        "Measure out all of the grout powder required for the quantity of grout you’re producing and pour it into the bucket.",
        "Add ¾ of the total water needed.",
        "Check the grout label to find out how much water you need for the amount of space you'll be covering.",
        "Pour ¾ of the amount of water required in with the grout powder.",
        "If you have a large area to cover, consider mixing half the grout at a time, so the grout in the bucket doesn't dry out before you're done.",
        "Mix the grout with a trowel.",
        "Use your trowel to mix the powder into the water, until you've made a thick paste with no dry lumps.",
        "Tilt the bucket toward you slightly, rolling it on its edge as you scrape off any dry grout from the sides.",
        "If you have a mixing drill and attached grout paddle, you can use that instead.",
        "Stay below 150 rpm to avoid weakening the grout with excess air bubbles.",
        "Squeeze in more water with the sponge.",
        "Add water one squeeze at a time from a sponge, mixing it thoroughly into the grout.",
        "Aim for a smooth \"peanut butter\" consistency, with no lumps.",
        "If the grout gets watery, pour in a little bit more powder.",
        "Leave the grout alone for 5–10 minutes.",
        "Allow the grout to \"slake,\" or strengthen through chemical reactions.",
        "Leave your trowel on newspaper or other surface to prevent a mess.",
        "Remix and apply.",
        "Briefly mix together the grout again, as it will become slightly stiff during slaking.",
        "Use immediately, as most grout sets within 30–60 minutes.",
        "If the grout has already hardened, you'll need to discard it and make a new batch.",
        "Adding more water after slaking will not be effective."
    ]
}