{
    "title": "How to Set up an Internet Cafe",
    "url": "https://www.wikihow.com/Set-up-an-Internet-Cafe",
    "category_hierarchy": [
        "Finance and Business",
        "Business",
        "Business by Industry",
        "Hospitality and Tourism Businesses",
        "Food and Drink Businesses",
        "Restaurant and Cafe Management"
    ],
    "methods": [
        {
            "name": "Planning Your Internet Café",
            "steps": [
                {
                    "headline": "Formulate an idea of how you want to run your Internet café.",
                    "description": "Write down the different amenities and services you want to offer and the audience you wish to cater to. Visit other Internet cafés in your area and in other cities to help form your ideas. Speak with the owners of other Internet cafés and ask about the advantages and disadvantages of this type of business."
                },
                {
                    "headline": "Research the feasibility of your plan.",
                    "description": "Investigate the area in which you hope to open your café. Look specifically at the demand for an Internet café and competitors in the area. Make a rough estimate of how much money you will require as an initial investment for computer equipment, furniture, software and amenities. You can find prices for equipment, furniture and software on the Internet, in catalogues or in office supply stores. Do not choose an area where residents have a high income level, as chances are people have their own computers at home. You also do not want to locate near a library where people can use computers for free."
                },
                {
                    "headline": "Create a comprehensive business plan.",
                    "description": "Enumerate every detail for your Internet café from computers that you will need to purchase to long-term operational costs. Incorporate the results from your previous market research and explain how your café will stay profitable over time. Your business plan should include the following elements:\nYour business concept: The focus here is on describing your business and the market for your café. Market research: Market research is critical, as it describes the nature of the market you are entering into. Identify who your major competitors are, who your target market is, and the preferences and needs of your target market. A marketing plan: This should describe how you plan on addressing the needs of your market, how you will communicate with customers, and how you will advertise your café. An operations plan: This will describe your operations on a day to day basis. It would include, for example, a timeline, hours the café will be open, and the people and equipment required. A financial plan: This would outline how you will finance your business, what your expected costs are, and five-year projections as to your revenue. Make sure to make your business plan clear and understandable and be able to explain it to anyone, especially those who do not know the technical jargon."
                }
            ]
        },
        {
            "name": "Finding Investment Capital and a Location",
            "steps": [
                {
                    "headline": "Estimate how much start-up capital you'll need.",
                    "description": "Using your financial plan, determine your projected annual expenses and gross income. You'll need to have enough capital to cover both your start-up and operating expenses. If you do not, you will need to take out a loan. Operating expenses include licenses, permits, insurance, rent or mortgage, a security system, employees' salaries, computer equipment and software, and professional services such as an accountant or bookkeeper. You can lease equipment or purchase used equipment to save money on operating costs."
                },
                {
                    "headline": "Look for investment money.",
                    "description": "This could be from your own savings, an investment partner, or a bank. Other entrepreneurs have used a line of credit with their bank, a home equity loan, a credit card or micro lending."
                },
                {
                    "headline": "Contact the SBA regarding an SBA guaranteed small business loan.",
                    "description": "You would then apply for the SBA loan at a local bank or credit union. This type of loan guarantees repayment by the SBA if you default."
                },
                {
                    "headline": "Consider a home equity loan.",
                    "description": "Find a bank who will give you a home equity loan or home equity line of credit. You would be using your own home as collateral. Make sure you can pay back this loan or you risk losing your home. You will also have to have a credit score in the high 600s to take out this type of loan."
                },
                {
                    "headline": "Consider micro lending.",
                    "description": "Internet micro lending services (also called peer to peer lending) help borrowers find lenders for relatively small loans, usually under $35,000. Research these sites and familiarize yourself with all of the rules and regulations in order to avoid misunderstandings later. Popular micro lending sites include Kiva, Prosper and Lending Club."
                }
            ]
        },
        {
            "name": "Finding a Good Location and Choosing a Name",
            "steps": [
                {
                    "headline": "Find a suitable location for your café.",
                    "description": "You will want a place that is likely to attract stable as well as casual customers. Locating near a school or college may attract younger customers, or if you locate near other food cafés or small shops you might be able to catch pedestrians in the area. It could also be advantageous to locate near large hotels where many business travelers stay."
                },
                {
                    "headline": "Work with a commercial real estate agent.",
                    "description": "An agent experienced in commercial businesses will be able to show you properties that might meet your needs and are available for lease within your budget. You could also contact the commercial real estate development company that owns a specific property that interests you. A good alternative would be to take over an existing Internet café that has a loyal client base. A commercial real estate broker will know about these opportunities as well."
                },
                {
                    "headline": "Conduct research on your potential business location.",
                    "description": "Search public records of how the location was used previously and statistical data such as the average income in the area. Find out if there are competitors and similar ventures nearby. When you find a potential location, observe the area for a few hours and analyze the foot traffic in the neighborhood. Is it near public transportation or highways? Is there enough parking? You will want to also analyze the demographics of the area. Does the income level match the type of clientele you hope to attract? Your local librarian or commercial real estate broker can help provide this information. Once you find a location you will need to purchase insurance policies for general liability and fire insurance."
                },
                {
                    "headline": "Choose a name for your business.",
                    "description": "Establish a unique identifier that resonates with customers and sets you apart from other businesses. Search databases such as Hoovers, the Better Business Bureau and the Web to find information about other business names so you don't choose one that is already taken. You can refer to Name Your Business for tips on how to choose a business name."
                }
            ]
        },
        {
            "name": "Obtaining the Necessary Licenses and Permits",
            "steps": [
                {
                    "headline": "Register your business name with your state government, if necessary.",
                    "description": "A DBA (Doing Business As) is needed whenever you are doing business under a name other than your own. Registering a DBA name is typically done through your state government or county clerk's office."
                },
                {
                    "headline": "Apply for a sales tax permit.",
                    "description": "This can be obtained from your state Department of Taxation and Finance. You will need to keep careful records on which items were sold with the amount paid, and how much in sales tax was collected."
                },
                {
                    "headline": "Obtain a federal tax ID number.",
                    "description": "You will need to file a separate tax return for your business and therefore will need to have a federal tax ID number. You can find the form online at www.irs.gov."
                },
                {
                    "headline": "Obtain building permits.",
                    "description": "Check with your local municipality for the types of permits required. Get a legal adviser if you don't know how to fill out the forms—better to pay small costs up front and have peace of mind than to have expensive complications down the road."
                }
            ]
        },
        {
            "name": "Setting Up the Hardware and Software",
            "steps": [
                {
                    "headline": "Choose an Internet service provider (ISP).",
                    "description": "Your café's Internet connection will most likely need a higher grade, more robust connection than a normal household set up. Negotiate with the ISP as they may offer special deals for businesses, especially Internet cafés. (You also might want to determine if you need a \"static IP\" address for Local Area Network (LAN) services and or programs.) A static IP address is for one customer only. A dynamic IP address will provide a different IP address each time you log on to your computer. Having a dynamic IP address means that you are sharing an IP address with several other customers."
                },
                {
                    "headline": "Design the layout to fit the space.",
                    "description": "If possible, use a professional designer. Work with the designer so that they understand the special requirements of an Internet café such as keeping food and beverage preparation and consumption from damaging computer equipment. Include an electrician in the design process to ensure that the infrastructure will be able to handle the load of all the electronic devices in your café."
                },
                {
                    "headline": "Purchase all the necessary equipment.",
                    "description": "Following your business plan, purchase computers, network cable, routers, printers, crimping tools and RJ-45 jacks. If you are including amenities also purchase any food and beverage preparation items  such as plates, cups, and microwave ovens."
                },
                {
                    "headline": "Set up your Internet café.",
                    "description": "This includes all the construction and renovations, electrical work, network setup, computer and software installation, and a security system. Add any other specialty services such as an area for food and drink preparation."
                },
                {
                    "headline": "Manage your software effectively.",
                    "description": "Use free software alternatives such as Linux as an alternative to Microsoft Windows or the Mac OS and the OpenOffice.org suite as an alternative to the Microsoft Office suite. Consider using live CDs without hard disk drives (dumb terminals) in the computers to reduce maintenance. Install a firewall on your router if it does not already have one to protect your network from worms, viruses and other outside attacks. Find a software solution that will protect your computers from viruses such as virus protection software or live CDs."
                }
            ]
        },
        {
            "name": "Preparing to Open the Business",
            "steps": [
                {
                    "headline": "Develop a plan for staffing your café.",
                    "description": "Consider hours of operation, wages and applicable overtime and anti-discrimination laws. Research state and federal labor laws on the Internet, through your local Small Business Administration or at your local library."
                },
                {
                    "headline": "Interview and hire employees.",
                    "description": "Place ads online at such sites as Craig's List, Indeed and Monster.com. Choose those who not only are technically savvy and have good references, but also friendly and easy to work with. Make sure to run a background check on each potential employee before hiring. Your local police department can run the background checks for you."
                },
                {
                    "headline": "Promote your Internet café in the neighborhood through fliers, advertisements in newspapers, word of mouth and especially social media.",
                    "description": "You will need to develop a website and can use templates you can find online for free, or use a service like WordPress that starts at about $70. Develop a Facebook page for your business and update it frequently. Consider having a grand opening with door prizes or discount coupons. Advertise the opening in newspapers, radio stations, Facebook, and on your website. You could also offer local entertainment and food."
                },
                {
                    "headline": "Listen to and incorporate feedback from your customers.",
                    "description": "They may want more bandwidth, or may complain about the amount of performance-degrading spyware. You can contract with an expert to solve problems, if you don't already have a suitable administrator."
                },
                {
                    "headline": "Evaluate opportunities to expand your business.",
                    "description": "This could include color printing and copying or hosting computer game competitions. Get customer feedback as to what services and amenities they would like to have in order to determine the demand in your area."
                }
            ]
        }
    ],
    "tyn": [
        "Business plan",
        "Computers (high-quality devices complete with monitors, mouse devices and keyboards)",
        "Software (Operating systems, productivity software, gaming software)",
        "Networking equipment (routers, switches, cabling)",
        "Uninterruptable power supply (UPS) units to protect from power surges",
        "Furniture"
    ],
    "text": " Planning Your Internet Café Formulate an idea of how you want to run your Internet café. Write down the different amenities and services you want to offer and the audience you wish to cater to. Visit other Internet cafés in your area and in other cities to help form your ideas. Speak with the owners of other Internet cafés and ask about the advantages and disadvantages of this type of business. Research the feasibility of your plan. Investigate the area in which you hope to open your café. Look specifically at the demand for an Internet café and competitors in the area. Make a rough estimate of how much money you will require as an initial investment for computer equipment, furniture, software and amenities. You can find prices for equipment, furniture and software on the Internet, in catalogues or in office supply stores. Do not choose an area where residents have a high income level, as chances are people have their own computers at home. You also do not want to locate near a library where people can use computers for free. Create a comprehensive business plan. Enumerate every detail for your Internet café from computers that you will need to purchase to long-term operational costs. Incorporate the results from your previous market research and explain how your café will stay profitable over time. Your business plan should include the following elements:\nYour business concept: The focus here is on describing your business and the market for your café. Market research: Market research is critical, as it describes the nature of the market you are entering into. Identify who your major competitors are, who your target market is, and the preferences and needs of your target market. A marketing plan: This should describe how you plan on addressing the needs of your market, how you will communicate with customers, and how you will advertise your café. An operations plan: This will describe your operations on a day to day basis. It would include, for example, a timeline, hours the café will be open, and the people and equipment required. A financial plan: This would outline how you will finance your business, what your expected costs are, and five-year projections as to your revenue. Make sure to make your business plan clear and understandable and be able to explain it to anyone, especially those who do not know the technical jargon. Finding Investment Capital and a Location Estimate how much start-up capital you'll need. Using your financial plan, determine your projected annual expenses and gross income. You'll need to have enough capital to cover both your start-up and operating expenses. If you do not, you will need to take out a loan. Operating expenses include licenses, permits, insurance, rent or mortgage, a security system, employees' salaries, computer equipment and software, and professional services such as an accountant or bookkeeper. You can lease equipment or purchase used equipment to save money on operating costs. Look for investment money. This could be from your own savings, an investment partner, or a bank. Other entrepreneurs have used a line of credit with their bank, a home equity loan, a credit card or micro lending. Contact the SBA regarding an SBA guaranteed small business loan. You would then apply for the SBA loan at a local bank or credit union. This type of loan guarantees repayment by the SBA if you default. Consider a home equity loan. Find a bank who will give you a home equity loan or home equity line of credit. You would be using your own home as collateral. Make sure you can pay back this loan or you risk losing your home. You will also have to have a credit score in the high 600s to take out this type of loan. Consider micro lending. Internet micro lending services (also called peer to peer lending) help borrowers find lenders for relatively small loans, usually under $35,000. Research these sites and familiarize yourself with all of the rules and regulations in order to avoid misunderstandings later. Popular micro lending sites include Kiva, Prosper and Lending Club. Finding a Good Location and Choosing a Name Find a suitable location for your café. You will want a place that is likely to attract stable as well as casual customers. Locating near a school or college may attract younger customers, or if you locate near other food cafés or small shops you might be able to catch pedestrians in the area. It could also be advantageous to locate near large hotels where many business travelers stay. Work with a commercial real estate agent. An agent experienced in commercial businesses will be able to show you properties that might meet your needs and are available for lease within your budget. You could also contact the commercial real estate development company that owns a specific property that interests you. A good alternative would be to take over an existing Internet café that has a loyal client base. A commercial real estate broker will know about these opportunities as well. Conduct research on your potential business location. Search public records of how the location was used previously and statistical data such as the average income in the area. Find out if there are competitors and similar ventures nearby. When you find a potential location, observe the area for a few hours and analyze the foot traffic in the neighborhood. Is it near public transportation or highways? Is there enough parking? You will want to also analyze the demographics of the area. Does the income level match the type of clientele you hope to attract? Your local librarian or commercial real estate broker can help provide this information. Once you find a location you will need to purchase insurance policies for general liability and fire insurance. Choose a name for your business. Establish a unique identifier that resonates with customers and sets you apart from other businesses. Search databases such as Hoovers, the Better Business Bureau and the Web to find information about other business names so you don't choose one that is already taken. You can refer to Name Your Business for tips on how to choose a business name. Obtaining the Necessary Licenses and Permits Register your business name with your state government, if necessary. A DBA (Doing Business As) is needed whenever you are doing business under a name other than your own. Registering a DBA name is typically done through your state government or county clerk's office. Apply for a sales tax permit. This can be obtained from your state Department of Taxation and Finance. You will need to keep careful records on which items were sold with the amount paid, and how much in sales tax was collected. Obtain a federal tax ID number. You will need to file a separate tax return for your business and therefore will need to have a federal tax ID number. You can find the form online at www.irs.gov. Obtain building permits. Check with your local municipality for the types of permits required. Get a legal adviser if you don't know how to fill out the forms—better to pay small costs up front and have peace of mind than to have expensive complications down the road. Setting Up the Hardware and Software Choose an Internet service provider (ISP). Your café's Internet connection will most likely need a higher grade, more robust connection than a normal household set up. Negotiate with the ISP as they may offer special deals for businesses, especially Internet cafés. (You also might want to determine if you need a \"static IP\" address for Local Area Network (LAN) services and or programs.) A static IP address is for one customer only. A dynamic IP address will provide a different IP address each time you log on to your computer. Having a dynamic IP address means that you are sharing an IP address with several other customers. Design the layout to fit the space. If possible, use a professional designer. Work with the designer so that they understand the special requirements of an Internet café such as keeping food and beverage preparation and consumption from damaging computer equipment. Include an electrician in the design process to ensure that the infrastructure will be able to handle the load of all the electronic devices in your café. Purchase all the necessary equipment. Following your business plan, purchase computers, network cable, routers, printers, crimping tools and RJ-45 jacks. If you are including amenities also purchase any food and beverage preparation items  such as plates, cups, and microwave ovens. Set up your Internet café. This includes all the construction and renovations, electrical work, network setup, computer and software installation, and a security system. Add any other specialty services such as an area for food and drink preparation. Manage your software effectively. Use free software alternatives such as Linux as an alternative to Microsoft Windows or the Mac OS and the OpenOffice.org suite as an alternative to the Microsoft Office suite. Consider using live CDs without hard disk drives (dumb terminals) in the computers to reduce maintenance. Install a firewall on your router if it does not already have one to protect your network from worms, viruses and other outside attacks. Find a software solution that will protect your computers from viruses such as virus protection software or live CDs. Preparing to Open the Business Develop a plan for staffing your café. Consider hours of operation, wages and applicable overtime and anti-discrimination laws. Research state and federal labor laws on the Internet, through your local Small Business Administration or at your local library. Interview and hire employees. Place ads online at such sites as Craig's List, Indeed and Monster.com. Choose those who not only are technically savvy and have good references, but also friendly and easy to work with. Make sure to run a background check on each potential employee before hiring. Your local police department can run the background checks for you. Promote your Internet café in the neighborhood through fliers, advertisements in newspapers, word of mouth and especially social media. You will need to develop a website and can use templates you can find online for free, or use a service like WordPress that starts at about $70. Develop a Facebook page for your business and update it frequently. Consider having a grand opening with door prizes or discount coupons. Advertise the opening in newspapers, radio stations, Facebook, and on your website. You could also offer local entertainment and food. Listen to and incorporate feedback from your customers. They may want more bandwidth, or may complain about the amount of performance-degrading spyware. You can contract with an expert to solve problems, if you don't already have a suitable administrator. Evaluate opportunities to expand your business. This could include color printing and copying or hosting computer game competitions. Get customer feedback as to what services and amenities they would like to have in order to determine the demand in your area.",
    "sentences": [
        " Planning Your Internet Café Formulate an idea of how you want to run your Internet café.",
        "Write down the different amenities and services you want to offer and the audience you wish to cater to.",
        "Visit other Internet cafés in your area and in other cities to help form your ideas.",
        "Speak with the owners of other Internet cafés and ask about the advantages and disadvantages of this type of business.",
        "Research the feasibility of your plan.",
        "Investigate the area in which you hope to open your café.",
        "Look specifically at the demand for an Internet café and competitors in the area.",
        "Make a rough estimate of how much money you will require as an initial investment for computer equipment, furniture, software and amenities.",
        "You can find prices for equipment, furniture and software on the Internet, in catalogues or in office supply stores.",
        "Do not choose an area where residents have a high income level, as chances are people have their own computers at home.",
        "You also do not want to locate near a library where people can use computers for free.",
        "Create a comprehensive business plan.",
        "Enumerate every detail for your Internet café from computers that you will need to purchase to long-term operational costs.",
        "Incorporate the results from your previous market research and explain how your café will stay profitable over time.",
        "Your business plan should include the following elements:\nYour business concept: The focus here is on describing your business and the market for your café.",
        "Market research: Market research is critical, as it describes the nature of the market you are entering into.",
        "Identify who your major competitors are, who your target market is, and the preferences and needs of your target market.",
        "A marketing plan: This should describe how you plan on addressing the needs of your market, how you will communicate with customers, and how you will advertise your café.",
        "An operations plan: This will describe your operations on a day to day basis.",
        "It would include, for example, a timeline, hours the café will be open, and the people and equipment required.",
        "A financial plan: This would outline how you will finance your business, what your expected costs are, and five-year projections as to your revenue.",
        "Make sure to make your business plan clear and understandable and be able to explain it to anyone, especially those who do not know the technical jargon.",
        "Finding Investment Capital and a Location Estimate how much start-up capital you'll need.",
        "Using your financial plan, determine your projected annual expenses and gross income.",
        "You'll need to have enough capital to cover both your start-up and operating expenses.",
        "If you do not, you will need to take out a loan.",
        "Operating expenses include licenses, permits, insurance, rent or mortgage, a security system, employees' salaries, computer equipment and software, and professional services such as an accountant or bookkeeper.",
        "You can lease equipment or purchase used equipment to save money on operating costs.",
        "Look for investment money.",
        "This could be from your own savings, an investment partner, or a bank.",
        "Other entrepreneurs have used a line of credit with their bank, a home equity loan, a credit card or micro lending.",
        "Contact the SBA regarding an SBA guaranteed small business loan.",
        "You would then apply for the SBA loan at a local bank or credit union.",
        "This type of loan guarantees repayment by the SBA if you default.",
        "Consider a home equity loan.",
        "Find a bank who will give you a home equity loan or home equity line of credit.",
        "You would be using your own home as collateral.",
        "Make sure you can pay back this loan or you risk losing your home.",
        "You will also have to have a credit score in the high 600s to take out this type of loan.",
        "Consider micro lending.",
        "Internet micro lending services (also called peer to peer lending) help borrowers find lenders for relatively small loans, usually under $35,000.",
        "Research these sites and familiarize yourself with all of the rules and regulations in order to avoid misunderstandings later.",
        "Popular micro lending sites include Kiva, Prosper and Lending Club.",
        "Finding a Good Location and Choosing a Name Find a suitable location for your café.",
        "You will want a place that is likely to attract stable as well as casual customers.",
        "Locating near a school or college may attract younger customers, or if you locate near other food cafés or small shops you might be able to catch pedestrians in the area.",
        "It could also be advantageous to locate near large hotels where many business travelers stay.",
        "Work with a commercial real estate agent.",
        "An agent experienced in commercial businesses will be able to show you properties that might meet your needs and are available for lease within your budget.",
        "You could also contact the commercial real estate development company that owns a specific property that interests you.",
        "A good alternative would be to take over an existing Internet café that has a loyal client base.",
        "A commercial real estate broker will know about these opportunities as well.",
        "Conduct research on your potential business location.",
        "Search public records of how the location was used previously and statistical data such as the average income in the area.",
        "Find out if there are competitors and similar ventures nearby.",
        "When you find a potential location, observe the area for a few hours and analyze the foot traffic in the neighborhood.",
        "Is it near public transportation or highways?",
        "Is there enough parking?",
        "You will want to also analyze the demographics of the area.",
        "Does the income level match the type of clientele you hope to attract?",
        "Your local librarian or commercial real estate broker can help provide this information.",
        "Once you find a location you will need to purchase insurance policies for general liability and fire insurance.",
        "Choose a name for your business.",
        "Establish a unique identifier that resonates with customers and sets you apart from other businesses.",
        "Search databases such as Hoovers, the Better Business Bureau and the Web to find information about other business names so you don't choose one that is already taken.",
        "You can refer to Name Your Business for tips on how to choose a business name.",
        "Obtaining the Necessary Licenses and Permits Register your business name with your state government, if necessary.",
        "A DBA (Doing Business As) is needed whenever you are doing business under a name other than your own.",
        "Registering a DBA name is typically done through your state government or county clerk's office.",
        "Apply for a sales tax permit.",
        "This can be obtained from your state Department of Taxation and Finance.",
        "You will need to keep careful records on which items were sold with the amount paid, and how much in sales tax was collected.",
        "Obtain a federal tax ID number.",
        "You will need to file a separate tax return for your business and therefore will need to have a federal tax ID number.",
        "You can find the form online at www.irs.gov.",
        "Obtain building permits.",
        "Check with your local municipality for the types of permits required.",
        "Get a legal adviser if you don't know how to fill out the forms—better to pay small costs up front and have peace of mind than to have expensive complications down the road.",
        "Setting Up the Hardware and Software Choose an Internet service provider (ISP).",
        "Your café's Internet connection will most likely need a higher grade, more robust connection than a normal household set up.",
        "Negotiate with the ISP as they may offer special deals for businesses, especially Internet cafés.",
        "(You also might want to determine if you need a \"static IP\" address for Local Area Network (LAN) services and or programs.)",
        "A static IP address is for one customer only.",
        "A dynamic IP address will provide a different IP address each time you log on to your computer.",
        "Having a dynamic IP address means that you are sharing an IP address with several other customers.",
        "Design the layout to fit the space.",
        "If possible, use a professional designer.",
        "Work with the designer so that they understand the special requirements of an Internet café such as keeping food and beverage preparation and consumption from damaging computer equipment.",
        "Include an electrician in the design process to ensure that the infrastructure will be able to handle the load of all the electronic devices in your café.",
        "Purchase all the necessary equipment.",
        "Following your business plan, purchase computers, network cable, routers, printers, crimping tools and RJ-45 jacks.",
        "If you are including amenities also purchase any food and beverage preparation items  such as plates, cups, and microwave ovens.",
        "Set up your Internet café.",
        "This includes all the construction and renovations, electrical work, network setup, computer and software installation, and a security system.",
        "Add any other specialty services such as an area for food and drink preparation.",
        "Manage your software effectively.",
        "Use free software alternatives such as Linux as an alternative to Microsoft Windows or the Mac OS and the OpenOffice.org suite as an alternative to the Microsoft Office suite.",
        "Consider using live CDs without hard disk drives (dumb terminals) in the computers to reduce maintenance.",
        "Install a firewall on your router if it does not already have one to protect your network from worms, viruses and other outside attacks.",
        "Find a software solution that will protect your computers from viruses such as virus protection software or live CDs.",
        "Preparing to Open the Business Develop a plan for staffing your café.",
        "Consider hours of operation, wages and applicable overtime and anti-discrimination laws.",
        "Research state and federal labor laws on the Internet, through your local Small Business Administration or at your local library.",
        "Interview and hire employees.",
        "Place ads online at such sites as Craig's List, Indeed and Monster.com.",
        "Choose those who not only are technically savvy and have good references, but also friendly and easy to work with.",
        "Make sure to run a background check on each potential employee before hiring.",
        "Your local police department can run the background checks for you.",
        "Promote your Internet café in the neighborhood through fliers, advertisements in newspapers, word of mouth and especially social media.",
        "You will need to develop a website and can use templates you can find online for free, or use a service like WordPress that starts at about $70.",
        "Develop a Facebook page for your business and update it frequently.",
        "Consider having a grand opening with door prizes or discount coupons.",
        "Advertise the opening in newspapers, radio stations, Facebook, and on your website.",
        "You could also offer local entertainment and food.",
        "Listen to and incorporate feedback from your customers.",
        "They may want more bandwidth, or may complain about the amount of performance-degrading spyware.",
        "You can contract with an expert to solve problems, if you don't already have a suitable administrator.",
        "Evaluate opportunities to expand your business.",
        "This could include color printing and copying or hosting computer game competitions.",
        "Get customer feedback as to what services and amenities they would like to have in order to determine the demand in your area."
    ]
}