{
    "title": "How to Make Wasabi",
    "url": "https://www.wikihow.com/Make-Wasabi",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments"
    ],
    "methods": [
        {
            "name": "Making Wasabi Paste with Genuine Wasabi Powder",
            "steps": [
                {
                    "headline": "Measure out 5 teaspoons (22.5 grams) of wasabi powder.",
                    "description": "You can buy genuine wasabi powder at most Asian grocery markets or online. Measure out 5 teaspoons (22.5 grams) of the powder and put it in a small bowl. This recipe makes about 5 servings of wasabi paste.Warning: Wash your hands after handling wasabi powder. If you get it on your hands and accidentally touch your eyes, it will burn. Also, prolonged contact with skin will cause irritation."
                },
                {
                    "headline": "Add 3 teaspoons (15 ml) of water to the powder.",
                    "description": "It doesn’t matter what the water temperature is and it’s totally fine to use tap water for this. You can also choose to use filtered, bottled, or purified water if you prefer the taste of that. Measure out the water and add it to the powder in the bowl."
                },
                {
                    "headline": "Stir until the mixture reaches a thick, paste-like texture.",
                    "description": "Use a wooden spoon or chopsticks to mix the water and powder together until the ingredients are thoroughly combined. The resulting product should be a thick paste that clings to the spoon rather than drips off."
                },
                {
                    "headline": "Turn the bowl upside down and let the paste sit for 1 minute.",
                    "description": "Gather the paste into a ball in the bottom of the bowl. Then, flip the bowl upside and let the paste rest for about 60 seconds so the flavors can develop. The paste is thick and will stick to the bottom of the bowl. Turning the bowl upside down simply protects the wasabi paste from exposure to oxygen. It starts to lose potency as soon as it's exposed to oxygen. If you prefer, you can cover the mouth of the bowl with a plate or plastic wrap. You can let the paste sit for up to 10-15 minutes if you want the flavor to develop even more."
                },
                {
                    "headline": "Serve the paste at room temperature for the best flavor.",
                    "description": "Paste made from genuine wasabi powder tastes best when it's freshly mixed. However, if you made more than you can eat at one sitting, transfer the leftovers to an air-tight container and store it in the fridge. When properly stored, the paste should last for 3-4 months. Keep in mind that the paste will lose potency and flavor over time. If you see blue or gray specks on top of the paste, it has gone bad. Toss it out and whip up a fresh batch."
                }
            ]
        },
        {
            "name": "Making Paste with Fresh Wasabi",
            "steps": [
                {
                    "headline": "Buy fresh wasabi rhizome from an Asian grocer.",
                    "description": "Choose a firm, unwrinkled root with fresh, crisp-looking leaves. These rhizomes may not be readily available since they are local only to Japan and are grown in limited areas of Canada and northwestern United States. However, check your local Asian grocery stores for availability. If you can’t find fresh wasabi rhizome, look for the ground powder and try that recipe instead."
                },
                {
                    "headline": "Cut off the leaves from the end of the rhizome with a knife.",
                    "description": "You do not need the leaves to make wasabi paste. The leaves do not necessarily need to be discarded, however—they can be eaten and make a flavorful addition to salads.Tip: Wasabi’s intense flavor only lasts about 20 minutes after grating it. Don’t prepare your wasabi paste until you’re ready to enjoy your meal!"
                },
                {
                    "headline": "Rinse the wasabi and trim off any bumps or marks on the surface.",
                    "description": "Wash the outside of the rhizome with cool water to get rid of any dirt and debris. Use a sharp knife to trim off any odd bumps, discolorations, and marks. Then, lay the root on a paper towel and let it air-dry. If you’re in a hurry, you can pat the exterior dry with a clean paper towel."
                },
                {
                    "headline": "Use a grater to shave off the amount you want.",
                    "description": "This recipe has no other ingredients, so the amount of fresh wasabi you shave off the root is the amount of paste you’ll end up with. Use slow, circular motions to grate the root to release its intense flavor compounds. Be sure to choose a sharp grater with small teeth. The fine teeth on the grater will create the paste-like consistency."
                },
                {
                    "headline": "Gather the wasabi in a neat pile and let it rest for 1-2 minutes.",
                    "description": "Use your fingers to form and press the wasabi into a tight ball. Then, let the paste sit 1-2 minutes to allow the flavor to develop. Be sure to wash your hands after handling wasabi. If you accidentally touch your eyes or nose without washing them, it will burn. Prolonged contact with your skin will cause irritation."
                },
                {
                    "headline": "Serve the wasabi paste immediately at room temperature.",
                    "description": "Place the ball of paste on the side of your main dish or in a separate bowl and serve it right away for the best flavor. Fresh wasabi starts losing its potency after being exposed to air for 20 minutes. Storing the fresh paste isn’t recommended, so make as much as you need for 1 meal and enjoy it right away."
                }
            ]
        }
    ],
    "tyn": [
        "Wasabi powder",
        "Water",
        "Measuring spoons",
        "Small bowl or container with lid",
        "Olive oil",
        "Spoon",
        "Wasabi rhizome",
        "Hand grater",
        "Knife"
    ],
    "text": " Making Wasabi Paste with Genuine Wasabi Powder Measure out 5 teaspoons (22.5 grams) of wasabi powder. You can buy genuine wasabi powder at most Asian grocery markets or online. Measure out 5 teaspoons (22.5 grams) of the powder and put it in a small bowl. This recipe makes about 5 servings of wasabi paste.Warning: Wash your hands after handling wasabi powder. If you get it on your hands and accidentally touch your eyes, it will burn. Also, prolonged contact with skin will cause irritation. Add 3 teaspoons (15 ml) of water to the powder. It doesn’t matter what the water temperature is and it’s totally fine to use tap water for this. You can also choose to use filtered, bottled, or purified water if you prefer the taste of that. Measure out the water and add it to the powder in the bowl. Stir until the mixture reaches a thick, paste-like texture. Use a wooden spoon or chopsticks to mix the water and powder together until the ingredients are thoroughly combined. The resulting product should be a thick paste that clings to the spoon rather than drips off. Turn the bowl upside down and let the paste sit for 1 minute. Gather the paste into a ball in the bottom of the bowl. Then, flip the bowl upside and let the paste rest for about 60 seconds so the flavors can develop. The paste is thick and will stick to the bottom of the bowl. Turning the bowl upside down simply protects the wasabi paste from exposure to oxygen. It starts to lose potency as soon as it's exposed to oxygen. If you prefer, you can cover the mouth of the bowl with a plate or plastic wrap. You can let the paste sit for up to 10-15 minutes if you want the flavor to develop even more. Serve the paste at room temperature for the best flavor. Paste made from genuine wasabi powder tastes best when it's freshly mixed. However, if you made more than you can eat at one sitting, transfer the leftovers to an air-tight container and store it in the fridge. When properly stored, the paste should last for 3-4 months. Keep in mind that the paste will lose potency and flavor over time. If you see blue or gray specks on top of the paste, it has gone bad. Toss it out and whip up a fresh batch. Making Paste with Fresh Wasabi Buy fresh wasabi rhizome from an Asian grocer. Choose a firm, unwrinkled root with fresh, crisp-looking leaves. These rhizomes may not be readily available since they are local only to Japan and are grown in limited areas of Canada and northwestern United States. However, check your local Asian grocery stores for availability. If you can’t find fresh wasabi rhizome, look for the ground powder and try that recipe instead. Cut off the leaves from the end of the rhizome with a knife. You do not need the leaves to make wasabi paste. The leaves do not necessarily need to be discarded, however—they can be eaten and make a flavorful addition to salads.Tip: Wasabi’s intense flavor only lasts about 20 minutes after grating it. Don’t prepare your wasabi paste until you’re ready to enjoy your meal! Rinse the wasabi and trim off any bumps or marks on the surface. Wash the outside of the rhizome with cool water to get rid of any dirt and debris. Use a sharp knife to trim off any odd bumps, discolorations, and marks. Then, lay the root on a paper towel and let it air-dry. If you’re in a hurry, you can pat the exterior dry with a clean paper towel. Use a grater to shave off the amount you want. This recipe has no other ingredients, so the amount of fresh wasabi you shave off the root is the amount of paste you’ll end up with. Use slow, circular motions to grate the root to release its intense flavor compounds. Be sure to choose a sharp grater with small teeth. The fine teeth on the grater will create the paste-like consistency. Gather the wasabi in a neat pile and let it rest for 1-2 minutes. Use your fingers to form and press the wasabi into a tight ball. Then, let the paste sit 1-2 minutes to allow the flavor to develop. Be sure to wash your hands after handling wasabi. If you accidentally touch your eyes or nose without washing them, it will burn. Prolonged contact with your skin will cause irritation. Serve the wasabi paste immediately at room temperature. Place the ball of paste on the side of your main dish or in a separate bowl and serve it right away for the best flavor. Fresh wasabi starts losing its potency after being exposed to air for 20 minutes. Storing the fresh paste isn’t recommended, so make as much as you need for 1 meal and enjoy it right away.",
    "sentences": [
        " Making Wasabi Paste with Genuine Wasabi Powder Measure out 5 teaspoons (22.5 grams) of wasabi powder.",
        "You can buy genuine wasabi powder at most Asian grocery markets or online.",
        "Measure out 5 teaspoons (22.5 grams) of the powder and put it in a small bowl.",
        "This recipe makes about 5 servings of wasabi paste.Warning: Wash your hands after handling wasabi powder.",
        "If you get it on your hands and accidentally touch your eyes, it will burn.",
        "Also, prolonged contact with skin will cause irritation.",
        "Add 3 teaspoons (15 ml) of water to the powder.",
        "It doesn’t matter what the water temperature is and it’s totally fine to use tap water for this.",
        "You can also choose to use filtered, bottled, or purified water if you prefer the taste of that.",
        "Measure out the water and add it to the powder in the bowl.",
        "Stir until the mixture reaches a thick, paste-like texture.",
        "Use a wooden spoon or chopsticks to mix the water and powder together until the ingredients are thoroughly combined.",
        "The resulting product should be a thick paste that clings to the spoon rather than drips off.",
        "Turn the bowl upside down and let the paste sit for 1 minute.",
        "Gather the paste into a ball in the bottom of the bowl.",
        "Then, flip the bowl upside and let the paste rest for about 60 seconds so the flavors can develop.",
        "The paste is thick and will stick to the bottom of the bowl.",
        "Turning the bowl upside down simply protects the wasabi paste from exposure to oxygen.",
        "It starts to lose potency as soon as it's exposed to oxygen.",
        "If you prefer, you can cover the mouth of the bowl with a plate or plastic wrap.",
        "You can let the paste sit for up to 10-15 minutes if you want the flavor to develop even more.",
        "Serve the paste at room temperature for the best flavor.",
        "Paste made from genuine wasabi powder tastes best when it's freshly mixed.",
        "However, if you made more than you can eat at one sitting, transfer the leftovers to an air-tight container and store it in the fridge.",
        "When properly stored, the paste should last for 3-4 months.",
        "Keep in mind that the paste will lose potency and flavor over time.",
        "If you see blue or gray specks on top of the paste, it has gone bad.",
        "Toss it out and whip up a fresh batch.",
        "Making Paste with Fresh Wasabi Buy fresh wasabi rhizome from an Asian grocer.",
        "Choose a firm, unwrinkled root with fresh, crisp-looking leaves.",
        "These rhizomes may not be readily available since they are local only to Japan and are grown in limited areas of Canada and northwestern United States.",
        "However, check your local Asian grocery stores for availability.",
        "If you can’t find fresh wasabi rhizome, look for the ground powder and try that recipe instead.",
        "Cut off the leaves from the end of the rhizome with a knife.",
        "You do not need the leaves to make wasabi paste.",
        "The leaves do not necessarily need to be discarded, however—they can be eaten and make a flavorful addition to salads.Tip: Wasabi’s intense flavor only lasts about 20 minutes after grating it.",
        "Don’t prepare your wasabi paste until you’re ready to enjoy your meal!",
        "Rinse the wasabi and trim off any bumps or marks on the surface.",
        "Wash the outside of the rhizome with cool water to get rid of any dirt and debris.",
        "Use a sharp knife to trim off any odd bumps, discolorations, and marks.",
        "Then, lay the root on a paper towel and let it air-dry.",
        "If you’re in a hurry, you can pat the exterior dry with a clean paper towel.",
        "Use a grater to shave off the amount you want.",
        "This recipe has no other ingredients, so the amount of fresh wasabi you shave off the root is the amount of paste you’ll end up with.",
        "Use slow, circular motions to grate the root to release its intense flavor compounds.",
        "Be sure to choose a sharp grater with small teeth.",
        "The fine teeth on the grater will create the paste-like consistency.",
        "Gather the wasabi in a neat pile and let it rest for 1-2 minutes.",
        "Use your fingers to form and press the wasabi into a tight ball.",
        "Then, let the paste sit 1-2 minutes to allow the flavor to develop.",
        "Be sure to wash your hands after handling wasabi.",
        "If you accidentally touch your eyes or nose without washing them, it will burn.",
        "Prolonged contact with your skin will cause irritation.",
        "Serve the wasabi paste immediately at room temperature.",
        "Place the ball of paste on the side of your main dish or in a separate bowl and serve it right away for the best flavor.",
        "Fresh wasabi starts losing its potency after being exposed to air for 20 minutes.",
        "Storing the fresh paste isn’t recommended, so make as much as you need for 1 meal and enjoy it right away."
    ]
}