{
    "title": "How to Change an ATV Tire",
    "url": "https://www.wikihow.com/Change-an-ATV-Tire",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Off Road Vehicles",
        "All Terrain Vehicles and Quads"
    ],
    "methods": [
        {
            "name": "Separate the ATV Tire",
            "steps": [
                {
                    "headline": "Drain all air from the ATV tires you want to change.",
                    "description": "You can do this quickly by removing the valve stems with a valve stem remover or slowly by depressing the nut inside the valve stem."
                },
                {
                    "headline": "Break the seal between the tire and the wheel.",
                    "description": "This is a wire rim in your ATV tire that sits in a groove in the wheel. You can break this seal by pressing hard on the sidewall of the tire. In some models of ATV tire, you will find a tab you must flip to release the wire rim."
                }
            ]
        },
        {
            "name": "Remove the Old ATV Tire",
            "steps": [
                {
                    "headline": "Wedge in the flat blade of your tire iron between the edge of the ATV tire and the rim of the wheel.",
                    "description": ""
                },
                {
                    "headline": "Wedge the second tire iron in about 8 inches (20.3 cm) along the rim from the first.",
                    "description": ""
                },
                {
                    "headline": "Slide the second tire iron around the rim of the wheel until it makes contact with the first.",
                    "description": "With some tires, this will be sufficient to fully remove the ATV tire. With others, you'll have to repeat with the opposite edge of the tire."
                }
            ]
        },
        {
            "name": "Install New ATV Tire",
            "steps": [
                {
                    "headline": "Set the new ATV tire on top of your wheel.",
                    "description": "Do this with the wheel lying on a wide, flat surface. The wheel won't be as stable as when you were removing the old tire."
                },
                {
                    "headline": "Lever one section of the tire onto the wheel using your tire iron.",
                    "description": "Be careful not to cut or otherwise damage the new ATV tire."
                },
                {
                    "headline": "Slide the other tire iron in place and pass it around to set the tire on the wheel.",
                    "description": "This is essentially the same process as removing the old ATV tire, reversed. This step may be easier if you apply a thin layer of lubricant to the edge of the ATV tire."
                },
                {
                    "headline": "Repeat with the opposite wall of the tire, if necessary.",
                    "description": "As with getting tires off, some models will require this step, while others will fall into place with just the first pass."
                },
                {
                    "headline": "Fill the new ATV tires with air using an air compressor.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Valve stem remover",
        "2 tire irons",
        "New or replacement tires for your ATV",
        "Mechanic's lubricant, water-based",
        "Air compressor"
    ],
    "text": " Separate the ATV Tire Drain all air from the ATV tires you want to change. You can do this quickly by removing the valve stems with a valve stem remover or slowly by depressing the nut inside the valve stem. Break the seal between the tire and the wheel. This is a wire rim in your ATV tire that sits in a groove in the wheel. You can break this seal by pressing hard on the sidewall of the tire. In some models of ATV tire, you will find a tab you must flip to release the wire rim. Remove the Old ATV Tire Wedge in the flat blade of your tire iron between the edge of the ATV tire and the rim of the wheel.  Wedge the second tire iron in about 8 inches (20.3 cm) along the rim from the first.  Slide the second tire iron around the rim of the wheel until it makes contact with the first. With some tires, this will be sufficient to fully remove the ATV tire. With others, you'll have to repeat with the opposite edge of the tire. Install New ATV Tire Set the new ATV tire on top of your wheel. Do this with the wheel lying on a wide, flat surface. The wheel won't be as stable as when you were removing the old tire. Lever one section of the tire onto the wheel using your tire iron. Be careful not to cut or otherwise damage the new ATV tire. Slide the other tire iron in place and pass it around to set the tire on the wheel. This is essentially the same process as removing the old ATV tire, reversed. This step may be easier if you apply a thin layer of lubricant to the edge of the ATV tire. Repeat with the opposite wall of the tire, if necessary. As with getting tires off, some models will require this step, while others will fall into place with just the first pass. Fill the new ATV tires with air using an air compressor. ",
    "sentences": [
        " Separate the ATV Tire Drain all air from the ATV tires you want to change.",
        "You can do this quickly by removing the valve stems with a valve stem remover or slowly by depressing the nut inside the valve stem.",
        "Break the seal between the tire and the wheel.",
        "This is a wire rim in your ATV tire that sits in a groove in the wheel.",
        "You can break this seal by pressing hard on the sidewall of the tire.",
        "In some models of ATV tire, you will find a tab you must flip to release the wire rim.",
        "Remove the Old ATV Tire Wedge in the flat blade of your tire iron between the edge of the ATV tire and the rim of the wheel.",
        "Wedge the second tire iron in about 8 inches (20.3 cm) along the rim from the first.",
        "Slide the second tire iron around the rim of the wheel until it makes contact with the first.",
        "With some tires, this will be sufficient to fully remove the ATV tire.",
        "With others, you'll have to repeat with the opposite edge of the tire.",
        "Install New ATV Tire Set the new ATV tire on top of your wheel.",
        "Do this with the wheel lying on a wide, flat surface.",
        "The wheel won't be as stable as when you were removing the old tire.",
        "Lever one section of the tire onto the wheel using your tire iron.",
        "Be careful not to cut or otherwise damage the new ATV tire.",
        "Slide the other tire iron in place and pass it around to set the tire on the wheel.",
        "This is essentially the same process as removing the old ATV tire, reversed.",
        "This step may be easier if you apply a thin layer of lubricant to the edge of the ATV tire.",
        "Repeat with the opposite wall of the tire, if necessary.",
        "As with getting tires off, some models will require this step, while others will fall into place with just the first pass.",
        "Fill the new ATV tires with air using an air compressor."
    ]
}