{
    "title": "How to Start a Nursing Agency",
    "url": "https://www.wikihow.com/Start-a-Nursing-Agency",
    "category_hierarchy": [
        "Finance and Business",
        "Business",
        "Business by Industry"
    ],
    "steps": [
        {
            "headline": "Obtain your nurse's license through an accredited nursing training program at your local hospital or at a nursing school.",
            "description": "Though as the owner of a nursing agency you don't have to be a licensed nurse, it will give you a better understanding of customers' and employees' situations. Some places will require qualifications as part of registration requirements (see fit person tests)."
        },
        {
            "headline": "Research the health and safety code in your jurisdiction that pertains to nursing agencies to find out what the legal requirements and obligations of a nursing agency are.",
            "description": "Often this will be available from the registration authority."
        },
        {
            "headline": "Create a business plan.",
            "description": "Include your start-up costs, initial payroll costs, market, operating strategy, taxes, and advertisement campaign. It's advisable to have an accountant review your business plan for any omissions or mistakes."
        },
        {
            "headline": "Raise the investment capital to start a nursing agency with a business loan or from private investors.",
            "description": "Starting a nursing agency requires a relatively small start-up sum, but you will need to have sufficient money in reserve to pay your nurses in case clients pay their invoices late."
        },
        {
            "headline": "Apply for a private duty nursing license at the appropriate city or state department.",
            "description": "You will also need to apply for separate license from your state to supply skilled nursing or CNA staff."
        },
        {
            "headline": "Choose a location for your office that is accessible to clients and nurses.",
            "description": "In today's digital world, you can have a virtual office. Google apps for instance makes it very easy to work from anywhere. Of much more importance is the ability to contact people easily so ensure good telecommunications is more important than physical proximity."
        },
        {
            "headline": "Obtain client and employee contracts.",
            "description": "The best way to do this is by having a local lawyer draw them up in compliance with all local and national laws. As a new agency, you might need to use local healthcare facilities for new clients and advertise in local magazines for new nurses and CNAs. Most hospitals and nursing homes consume a lot of CNAs than agency nurses which is a good way to start. You can utilize staff engagement services to help you engage your new nurses once you receive work requests. This cuts down on costs of hiring a scheduler. Hospitals and nursing homes loves fast turn around. You can use services Make sure you understand every clause to avoid problems later."
        },
        {
            "headline": "Purchase liability insurance for your nursing agency.",
            "description": "Ensure that you understand your reporting duties and in particular whether your liability is on a 'claims arising' or 'claims notified' basis."
        },
        {
            "headline": "Buy payroll software that allows for frequent payments for your employees.",
            "description": "You can also utilize online Software as Service companies (Saas). You pay a small monthly fee. If you do use an external payroll provider be sure that they are tied into your complaints and quality checking for care - people complain quicker about paying for poor care than they do about the care itself."
        },
        {
            "headline": "Interview candidates for nursing positions and run a background check on those you plan to employ.",
            "description": "Make sure their nursing licenses are current and their records are clean. Pay attention to sudden recent changes in employment - staff may leave a place hoping to avoid disciplinary and/or criminal pursuit."
        },
        {
            "headline": "Market your nursing agency to clients by advertising at local hospitals and doctor's offices, as well as in the media.",
            "description": ""
        },
        {
            "headline": "Meet with clients who are interested in your services to determine what their needs are, which nurses would be a good match, and what the nurse's duties are in accordance with each patient's treatment plan.",
            "description": "Once all of the details have been agreed upon, sign the contracts and send out your nurses to the appropriate clients."
        }
    ],
    "tyn": [
        "Nurse's license",
        "Business plan",
        "Investment capital",
        "Office space",
        "Client and employee contracts"
    ],
    "text": " Obtain your nurse's license through an accredited nursing training program at your local hospital or at a nursing school. Though as the owner of a nursing agency you don't have to be a licensed nurse, it will give you a better understanding of customers' and employees' situations. Some places will require qualifications as part of registration requirements (see fit person tests). Research the health and safety code in your jurisdiction that pertains to nursing agencies to find out what the legal requirements and obligations of a nursing agency are. Often this will be available from the registration authority. Create a business plan. Include your start-up costs, initial payroll costs, market, operating strategy, taxes, and advertisement campaign. It's advisable to have an accountant review your business plan for any omissions or mistakes. Raise the investment capital to start a nursing agency with a business loan or from private investors. Starting a nursing agency requires a relatively small start-up sum, but you will need to have sufficient money in reserve to pay your nurses in case clients pay their invoices late. Apply for a private duty nursing license at the appropriate city or state department. You will also need to apply for separate license from your state to supply skilled nursing or CNA staff. Choose a location for your office that is accessible to clients and nurses. In today's digital world, you can have a virtual office. Google apps for instance makes it very easy to work from anywhere. Of much more importance is the ability to contact people easily so ensure good telecommunications is more important than physical proximity. Obtain client and employee contracts. The best way to do this is by having a local lawyer draw them up in compliance with all local and national laws. As a new agency, you might need to use local healthcare facilities for new clients and advertise in local magazines for new nurses and CNAs. Most hospitals and nursing homes consume a lot of CNAs than agency nurses which is a good way to start. You can utilize staff engagement services to help you engage your new nurses once you receive work requests. This cuts down on costs of hiring a scheduler. Hospitals and nursing homes loves fast turn around. You can use services Make sure you understand every clause to avoid problems later. Purchase liability insurance for your nursing agency. Ensure that you understand your reporting duties and in particular whether your liability is on a 'claims arising' or 'claims notified' basis. Buy payroll software that allows for frequent payments for your employees. You can also utilize online Software as Service companies (Saas). You pay a small monthly fee. If you do use an external payroll provider be sure that they are tied into your complaints and quality checking for care - people complain quicker about paying for poor care than they do about the care itself. Interview candidates for nursing positions and run a background check on those you plan to employ. Make sure their nursing licenses are current and their records are clean. Pay attention to sudden recent changes in employment - staff may leave a place hoping to avoid disciplinary and/or criminal pursuit. Market your nursing agency to clients by advertising at local hospitals and doctor's offices, as well as in the media.  Meet with clients who are interested in your services to determine what their needs are, which nurses would be a good match, and what the nurse's duties are in accordance with each patient's treatment plan. Once all of the details have been agreed upon, sign the contracts and send out your nurses to the appropriate clients.",
    "sentences": [
        " Obtain your nurse's license through an accredited nursing training program at your local hospital or at a nursing school.",
        "Though as the owner of a nursing agency you don't have to be a licensed nurse, it will give you a better understanding of customers' and employees' situations.",
        "Some places will require qualifications as part of registration requirements (see fit person tests).",
        "Research the health and safety code in your jurisdiction that pertains to nursing agencies to find out what the legal requirements and obligations of a nursing agency are.",
        "Often this will be available from the registration authority.",
        "Create a business plan.",
        "Include your start-up costs, initial payroll costs, market, operating strategy, taxes, and advertisement campaign.",
        "It's advisable to have an accountant review your business plan for any omissions or mistakes.",
        "Raise the investment capital to start a nursing agency with a business loan or from private investors.",
        "Starting a nursing agency requires a relatively small start-up sum, but you will need to have sufficient money in reserve to pay your nurses in case clients pay their invoices late.",
        "Apply for a private duty nursing license at the appropriate city or state department.",
        "You will also need to apply for separate license from your state to supply skilled nursing or CNA staff.",
        "Choose a location for your office that is accessible to clients and nurses.",
        "In today's digital world, you can have a virtual office.",
        "Google apps for instance makes it very easy to work from anywhere.",
        "Of much more importance is the ability to contact people easily so ensure good telecommunications is more important than physical proximity.",
        "Obtain client and employee contracts.",
        "The best way to do this is by having a local lawyer draw them up in compliance with all local and national laws.",
        "As a new agency, you might need to use local healthcare facilities for new clients and advertise in local magazines for new nurses and CNAs.",
        "Most hospitals and nursing homes consume a lot of CNAs than agency nurses which is a good way to start.",
        "You can utilize staff engagement services to help you engage your new nurses once you receive work requests.",
        "This cuts down on costs of hiring a scheduler.",
        "Hospitals and nursing homes loves fast turn around.",
        "You can use services Make sure you understand every clause to avoid problems later.",
        "Purchase liability insurance for your nursing agency.",
        "Ensure that you understand your reporting duties and in particular whether your liability is on a 'claims arising' or 'claims notified' basis.",
        "Buy payroll software that allows for frequent payments for your employees.",
        "You can also utilize online Software as Service companies (Saas).",
        "You pay a small monthly fee.",
        "If you do use an external payroll provider be sure that they are tied into your complaints and quality checking for care - people complain quicker about paying for poor care than they do about the care itself.",
        "Interview candidates for nursing positions and run a background check on those you plan to employ.",
        "Make sure their nursing licenses are current and their records are clean.",
        "Pay attention to sudden recent changes in employment - staff may leave a place hoping to avoid disciplinary and/or criminal pursuit.",
        "Market your nursing agency to clients by advertising at local hospitals and doctor's offices, as well as in the media.",
        "Meet with clients who are interested in your services to determine what their needs are, which nurses would be a good match, and what the nurse's duties are in accordance with each patient's treatment plan.",
        "Once all of the details have been agreed upon, sign the contracts and send out your nurses to the appropriate clients."
    ]
}