{
    "title": "How to Keep RFID Credit Cards Safe",
    "url": "https://www.wikihow.com/Keep-RFID-Credit-Cards-Safe",
    "category_hierarchy": [
        "Finance and Business",
        "Banks and Financial Institutions"
    ],
    "methods": [
        {
            "name": "Being Careful and Changing Habits",
            "steps": [
                {
                    "headline": "Place your RFID cards next to each other in your wallet.",
                    "description": "This can make it more difficult for thieves to read a particular card, but the protection is limited."
                },
                {
                    "headline": "Carry your RFID cards in a front pocket.",
                    "description": "If you usually carry your credit cards in a wallet in your back pocket, you are potentially more vulnerable to thieves who could step up behind you with a scanning device. If you switch the cards to a front pocket, you will tend to be more observant of people in front of you and are less likely to become a victim."
                },
                {
                    "headline": "Be aware of other people around you when using your credit cards.",
                    "description": "Some of the newest RFID technology limits the opportunity of thieves to scan your cards to short distances and only at the time of the sale. Before using your card in a store, check around you to make sure that nobody is standing within a few feet of you, and your transaction should be safe."
                },
                {
                    "headline": "Use your RFID cards at home for online purchases only.",
                    "description": "If you are really concerned by the RFID technology, this is a possible way to go, and you can then use other credit cards or cash to purchase things outside your home. However, identity theft through online computer use is probably a greater risk than using the RFID technology in a store."
                },
                {
                    "headline": "Monitor your credit card statements for usual activity or errors.",
                    "description": "This may not actually prevent thieves from stealing information from your card, but monitoring your statements regularly will help you and the credit card company identify any unauthorized purchases and can limit your potential losses.Some sources say that regular monitoring of your credit card statements is actually the “best” protection against identity theft."
                }
            ]
        },
        {
            "name": "Making and Using Shields",
            "steps": [
                {
                    "headline": "Purchase an RFID shield wallet or sleeve for credit cards.",
                    "description": "There are several commercial products available that claim to block RFID scanners from obtaining your personal information. These may be individual sleeves for your RFID cards or wallets that are lined with material to block scanners."
                },
                {
                    "headline": "Purchase an RFID jamming card or device.",
                    "description": "Some companies have developed a device about the size of a credit card that sends out its own RFID signal that will disrupt scanners trying to get your credit card information."
                },
                {
                    "headline": "Make a foil shield.",
                    "description": "This is the “low-tech” way to go, but it’s cheap and easy. Cut two pieces of paper or cardboard into the size of a credit card, wrap each piece with aluminum foil, and carry them in your wallet around your credit cards. The aluminum will disrupt most electronic signals."
                },
                {
                    "headline": "You can also wrap each credit card in aluminum foil and place the wrapped cards in your wallet.",
                    "description": "The foil shields the card from scanners."
                }
            ]
        },
        {
            "name": "Keeping Credit Cards Safe for Online Purchases",
            "steps": [
                {
                    "headline": "Verify that vendors you use online are legitimate.",
                    "description": "Stick to vendors that you have used before and that you know and trust. If you have concerns, you can check with the Better Business Bureau online at http://www.bbb.org/ or in the local area where the company has its business."
                },
                {
                    "headline": "Look for signs of a \"secure\" website.",
                    "description": "Truly secure websites use extra protection called a Secure Sockets Layer, or SSL, and the website address will begin with \"https\" instead of the usual \"http.\" Additionally, a secure site will show a closed lock icon in the status bar at the bottom of the page. If you don't see the \"https\" address or the padlock at the bottom, you should consider using another website for your purchase."
                },
                {
                    "headline": "Maintain your own computer.",
                    "description": "For safer online shopping, keep your own computer free of viruses or spyware. There are software products you can purchase or download online for free that will help you keep your computer clean."
                },
                {
                    "headline": "Limit Wi-Fi purchasing.",
                    "description": "Because anything wireless is potentially subject to hackers who find a way to intercept the radio signal, your safest method for online shopping is to use a hardwired Internet connection."
                },
                {
                    "headline": "Use a temporary credit card for online shopping.",
                    "description": "Many banks and credit companies will offer this service for no fee. You can get a card number that is separate from your actual account, but the bank links it to your account for your bona fide purchases."
                }
            ]
        }
    ],
    "tyn": [
        "Aluminum foil",
        "Cardboard",
        "Scissors"
    ],
    "text": " Being Careful and Changing Habits Place your RFID cards next to each other in your wallet. This can make it more difficult for thieves to read a particular card, but the protection is limited. Carry your RFID cards in a front pocket. If you usually carry your credit cards in a wallet in your back pocket, you are potentially more vulnerable to thieves who could step up behind you with a scanning device. If you switch the cards to a front pocket, you will tend to be more observant of people in front of you and are less likely to become a victim. Be aware of other people around you when using your credit cards. Some of the newest RFID technology limits the opportunity of thieves to scan your cards to short distances and only at the time of the sale. Before using your card in a store, check around you to make sure that nobody is standing within a few feet of you, and your transaction should be safe. Use your RFID cards at home for online purchases only. If you are really concerned by the RFID technology, this is a possible way to go, and you can then use other credit cards or cash to purchase things outside your home. However, identity theft through online computer use is probably a greater risk than using the RFID technology in a store. Monitor your credit card statements for usual activity or errors. This may not actually prevent thieves from stealing information from your card, but monitoring your statements regularly will help you and the credit card company identify any unauthorized purchases and can limit your potential losses.Some sources say that regular monitoring of your credit card statements is actually the “best” protection against identity theft. Making and Using Shields Purchase an RFID shield wallet or sleeve for credit cards. There are several commercial products available that claim to block RFID scanners from obtaining your personal information. These may be individual sleeves for your RFID cards or wallets that are lined with material to block scanners. Purchase an RFID jamming card or device. Some companies have developed a device about the size of a credit card that sends out its own RFID signal that will disrupt scanners trying to get your credit card information. Make a foil shield. This is the “low-tech” way to go, but it’s cheap and easy. Cut two pieces of paper or cardboard into the size of a credit card, wrap each piece with aluminum foil, and carry them in your wallet around your credit cards. The aluminum will disrupt most electronic signals. You can also wrap each credit card in aluminum foil and place the wrapped cards in your wallet. The foil shields the card from scanners. Keeping Credit Cards Safe for Online Purchases Verify that vendors you use online are legitimate. Stick to vendors that you have used before and that you know and trust. If you have concerns, you can check with the Better Business Bureau online at http://www.bbb.org/ or in the local area where the company has its business. Look for signs of a \"secure\" website. Truly secure websites use extra protection called a Secure Sockets Layer, or SSL, and the website address will begin with \"https\" instead of the usual \"http.\" Additionally, a secure site will show a closed lock icon in the status bar at the bottom of the page. If you don't see the \"https\" address or the padlock at the bottom, you should consider using another website for your purchase. Maintain your own computer. For safer online shopping, keep your own computer free of viruses or spyware. There are software products you can purchase or download online for free that will help you keep your computer clean. Limit Wi-Fi purchasing. Because anything wireless is potentially subject to hackers who find a way to intercept the radio signal, your safest method for online shopping is to use a hardwired Internet connection. Use a temporary credit card for online shopping. Many banks and credit companies will offer this service for no fee. You can get a card number that is separate from your actual account, but the bank links it to your account for your bona fide purchases.",
    "sentences": [
        " Being Careful and Changing Habits Place your RFID cards next to each other in your wallet.",
        "This can make it more difficult for thieves to read a particular card, but the protection is limited.",
        "Carry your RFID cards in a front pocket.",
        "If you usually carry your credit cards in a wallet in your back pocket, you are potentially more vulnerable to thieves who could step up behind you with a scanning device.",
        "If you switch the cards to a front pocket, you will tend to be more observant of people in front of you and are less likely to become a victim.",
        "Be aware of other people around you when using your credit cards.",
        "Some of the newest RFID technology limits the opportunity of thieves to scan your cards to short distances and only at the time of the sale.",
        "Before using your card in a store, check around you to make sure that nobody is standing within a few feet of you, and your transaction should be safe.",
        "Use your RFID cards at home for online purchases only.",
        "If you are really concerned by the RFID technology, this is a possible way to go, and you can then use other credit cards or cash to purchase things outside your home.",
        "However, identity theft through online computer use is probably a greater risk than using the RFID technology in a store.",
        "Monitor your credit card statements for usual activity or errors.",
        "This may not actually prevent thieves from stealing information from your card, but monitoring your statements regularly will help you and the credit card company identify any unauthorized purchases and can limit your potential losses.Some sources say that regular monitoring of your credit card statements is actually the “best” protection against identity theft.",
        "Making and Using Shields Purchase an RFID shield wallet or sleeve for credit cards.",
        "There are several commercial products available that claim to block RFID scanners from obtaining your personal information.",
        "These may be individual sleeves for your RFID cards or wallets that are lined with material to block scanners.",
        "Purchase an RFID jamming card or device.",
        "Some companies have developed a device about the size of a credit card that sends out its own RFID signal that will disrupt scanners trying to get your credit card information.",
        "Make a foil shield.",
        "This is the “low-tech” way to go, but it’s cheap and easy.",
        "Cut two pieces of paper or cardboard into the size of a credit card, wrap each piece with aluminum foil, and carry them in your wallet around your credit cards.",
        "The aluminum will disrupt most electronic signals.",
        "You can also wrap each credit card in aluminum foil and place the wrapped cards in your wallet.",
        "The foil shields the card from scanners.",
        "Keeping Credit Cards Safe for Online Purchases Verify that vendors you use online are legitimate.",
        "Stick to vendors that you have used before and that you know and trust.",
        "If you have concerns, you can check with the Better Business Bureau online at http://www.bbb.org/ or in the local area where the company has its business.",
        "Look for signs of a \"secure\" website.",
        "Truly secure websites use extra protection called a Secure Sockets Layer, or SSL, and the website address will begin with \"https\" instead of the usual \"http.\"",
        "Additionally, a secure site will show a closed lock icon in the status bar at the bottom of the page.",
        "If you don't see the \"https\" address or the padlock at the bottom, you should consider using another website for your purchase.",
        "Maintain your own computer.",
        "For safer online shopping, keep your own computer free of viruses or spyware.",
        "There are software products you can purchase or download online for free that will help you keep your computer clean.",
        "Limit Wi-Fi purchasing.",
        "Because anything wireless is potentially subject to hackers who find a way to intercept the radio signal, your safest method for online shopping is to use a hardwired Internet connection.",
        "Use a temporary credit card for online shopping.",
        "Many banks and credit companies will offer this service for no fee.",
        "You can get a card number that is separate from your actual account, but the bank links it to your account for your bona fide purchases."
    ]
}