{
    "title": "How to Replace a Miata Fuel Filter",
    "url": "https://www.wikihow.com/Replace-a-Miata-Fuel-Filter",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Cars",
        "Car Makes",
        "Mazda Vehicles"
    ],
    "steps": [
        {
            "headline": "Drive the rear of the Miata onto ramps.",
            "description": "Place chocks under the front wheels in both directions to prevent the car from moving."
        },
        {
            "headline": "Remove the fuel cap to remove pressure from the fuel line.",
            "description": "Start the engine and remove the cover from the steering column. Remove the fuel pump relay fuse under the dash near the steering column. The female clip of the relay is yellow, but the rest of the relay is dark. The engine will stall and depressurize the fuel line to prevent gasoline from spraying when you disconnect the filter."
        },
        {
            "headline": "Disconnect the negative terminal of your battery.",
            "description": "The negative terminal is black, printed with the letters \"NEG\" and marked by a minus (-) sign."
        },
        {
            "headline": "Situate yourself under the rear bumper.",
            "description": "Locate the fuel filter toward the middle, in front of the rear passenger-side wheel, toward the center of the car."
        },
        {
            "headline": "Remove the Miata fuel filter cover, which is attached with 5 plastic screw clamps.",
            "description": "Use a cross-tip screwdriver to remove them part way, then gently pull them out. Note the position of the cover so you can easily reattach it. Place a pan under the filter to catch fuel."
        },
        {
            "headline": "Use a 10 mm (13/32-inch) socket to remove the bolt that secures the clamp holding the fuel filter to the car.",
            "description": ""
        },
        {
            "headline": "Use pliers to loosen the hose clamps attached to the fuel filter.",
            "description": "Use a screwdriver to slide the fuel lines off. Clamp the rubber fuel lines with vise grips to prevent fuel from leaking before you slide the lines off the filter. Don't clamp the metal parts of the lines to avoid damage. Alternatively, plug the line with a pen or golf tee after you remove the rubber hoses."
        },
        {
            "headline": "Place the new fuel filter in the bracket and connect both ends of the filter to the rubber fuel-line hoses.",
            "description": ""
        },
        {
            "headline": "Use pliers to tighten the hose clamps.",
            "description": ""
        },
        {
            "headline": "Tighten the bolt on the clamp holding the fuel filter.",
            "description": ""
        },
        {
            "headline": "Plug in the fuel-pump relay fuse and reattach the plastic cover on the steering column.",
            "description": "Reattach the battery terminal."
        },
        {
            "headline": "Re-establish pressure in the fuel system by bridging the fuel pump (F/P) terminal to the ground terminal in the diagnostic connector under the hood.",
            "description": "Put the ignition key in the on position, but don't start the car. This will allow the fuel pump to work without turning on the car, and the fuel line will repressurize. Turn off the key after 15 seconds and pull the wire from the diagnostic connector."
        },
        {
            "headline": "Start the car and check the fuel filter for leaks.",
            "description": "Look on the ground underneath the car for fuel. If you see gas, you have a leak. Review to ensure the filter is correctly installed."
        },
        {
            "headline": "Replace the fuel filter cover.",
            "description": "Tighten the gas cap."
        }
    ],
    "tyn": [
        "Mazda Miata fuel filter",
        "Pan to catch fuel",
        "Rag",
        "Pliers",
        "Screwdriver",
        "10 mm socket wrench",
        "Ramp to lift car",
        "Four chocks",
        "Safety goggles",
        "Vise grips"
    ],
    "text": " Drive the rear of the Miata onto ramps. Place chocks under the front wheels in both directions to prevent the car from moving. Remove the fuel cap to remove pressure from the fuel line. Start the engine and remove the cover from the steering column. Remove the fuel pump relay fuse under the dash near the steering column. The female clip of the relay is yellow, but the rest of the relay is dark. The engine will stall and depressurize the fuel line to prevent gasoline from spraying when you disconnect the filter. Disconnect the negative terminal of your battery. The negative terminal is black, printed with the letters \"NEG\" and marked by a minus (-) sign. Situate yourself under the rear bumper. Locate the fuel filter toward the middle, in front of the rear passenger-side wheel, toward the center of the car. Remove the Miata fuel filter cover, which is attached with 5 plastic screw clamps. Use a cross-tip screwdriver to remove them part way, then gently pull them out. Note the position of the cover so you can easily reattach it. Place a pan under the filter to catch fuel. Use a 10 mm (13/32-inch) socket to remove the bolt that secures the clamp holding the fuel filter to the car.  Use pliers to loosen the hose clamps attached to the fuel filter. Use a screwdriver to slide the fuel lines off. Clamp the rubber fuel lines with vise grips to prevent fuel from leaking before you slide the lines off the filter. Don't clamp the metal parts of the lines to avoid damage. Alternatively, plug the line with a pen or golf tee after you remove the rubber hoses. Place the new fuel filter in the bracket and connect both ends of the filter to the rubber fuel-line hoses.  Use pliers to tighten the hose clamps.  Tighten the bolt on the clamp holding the fuel filter.  Plug in the fuel-pump relay fuse and reattach the plastic cover on the steering column. Reattach the battery terminal. Re-establish pressure in the fuel system by bridging the fuel pump (F/P) terminal to the ground terminal in the diagnostic connector under the hood. Put the ignition key in the on position, but don't start the car. This will allow the fuel pump to work without turning on the car, and the fuel line will repressurize. Turn off the key after 15 seconds and pull the wire from the diagnostic connector. Start the car and check the fuel filter for leaks. Look on the ground underneath the car for fuel. If you see gas, you have a leak. Review to ensure the filter is correctly installed. Replace the fuel filter cover. Tighten the gas cap.",
    "sentences": [
        " Drive the rear of the Miata onto ramps.",
        "Place chocks under the front wheels in both directions to prevent the car from moving.",
        "Remove the fuel cap to remove pressure from the fuel line.",
        "Start the engine and remove the cover from the steering column.",
        "Remove the fuel pump relay fuse under the dash near the steering column.",
        "The female clip of the relay is yellow, but the rest of the relay is dark.",
        "The engine will stall and depressurize the fuel line to prevent gasoline from spraying when you disconnect the filter.",
        "Disconnect the negative terminal of your battery.",
        "The negative terminal is black, printed with the letters \"NEG\" and marked by a minus (-) sign.",
        "Situate yourself under the rear bumper.",
        "Locate the fuel filter toward the middle, in front of the rear passenger-side wheel, toward the center of the car.",
        "Remove the Miata fuel filter cover, which is attached with 5 plastic screw clamps.",
        "Use a cross-tip screwdriver to remove them part way, then gently pull them out.",
        "Note the position of the cover so you can easily reattach it.",
        "Place a pan under the filter to catch fuel.",
        "Use a 10 mm (13/32-inch) socket to remove the bolt that secures the clamp holding the fuel filter to the car.",
        "Use pliers to loosen the hose clamps attached to the fuel filter.",
        "Use a screwdriver to slide the fuel lines off.",
        "Clamp the rubber fuel lines with vise grips to prevent fuel from leaking before you slide the lines off the filter.",
        "Don't clamp the metal parts of the lines to avoid damage.",
        "Alternatively, plug the line with a pen or golf tee after you remove the rubber hoses.",
        "Place the new fuel filter in the bracket and connect both ends of the filter to the rubber fuel-line hoses.",
        "Use pliers to tighten the hose clamps.",
        "Tighten the bolt on the clamp holding the fuel filter.",
        "Plug in the fuel-pump relay fuse and reattach the plastic cover on the steering column.",
        "Reattach the battery terminal.",
        "Re-establish pressure in the fuel system by bridging the fuel pump (F/P) terminal to the ground terminal in the diagnostic connector under the hood.",
        "Put the ignition key in the on position, but don't start the car.",
        "This will allow the fuel pump to work without turning on the car, and the fuel line will repressurize.",
        "Turn off the key after 15 seconds and pull the wire from the diagnostic connector.",
        "Start the car and check the fuel filter for leaks.",
        "Look on the ground underneath the car for fuel.",
        "If you see gas, you have a leak.",
        "Review to ensure the filter is correctly installed.",
        "Replace the fuel filter cover.",
        "Tighten the gas cap."
    ]
}