{
    "title": "How to Replace Spa Jets",
    "url": "https://www.wikihow.com/Replace-Spa-Jets",
    "category_hierarchy": [
        "Home and Garden",
        "Swimming Pools",
        "Hot Tubs",
        "Hot Tub Care and Repair"
    ],
    "parts": [
        {
            "name": "Beginning the Replacement",
            "steps": [
                {
                    "headline": "Drain the water from your spa.",
                    "description": "It is not safe to replace the jets while water is still in the tub. Drain all water out of the tub before working on your jets. To drain your tub, first turn off the spa’s circuit breaker. Then, remove the front panel of your tub and find the hose spigot. Attach a garden hose to the spigot and drain the water out of the tub. It’s not safe to replace jets with water in the tub because it could lead to electrocution, especially if the spa’s circuit breaker hasn’t been turned off. You can remove any remaining water with a mop or wet/dry vac. Draining not be necessary if your jets are in a bathtub because bathtubs are usually drained of water after each use."
                },
                {
                    "headline": "Read your owner’s manual.",
                    "description": "There are several different types of home spas and many different brands. Your brand may require a slightly different replacement process than another brand or type. Read your owner’s manual for exact instructions to remove and replace jets. If you’ve lost your owner’s manual, look for the manual on the internet, or call the manufacturer to request another one."
                },
                {
                    "headline": "Remove the existing jets.",
                    "description": "For removal, you may just need to rotate the jet counterclockwise until it pops out of the jet well. If you can’t easily remove it by hand, use a wrench. Tighten the wrench on your jet to get a good grip. Turn the wrench counterclockwise to loosen your jet until it becomes loose enough to pull out of the tub. Your manual may have specific instructions for removing jets. Read the manual before removing the jets."
                },
                {
                    "headline": "Measure the jets.",
                    "description": "If you do not have your replacement jets yet, you can get an idea about what kind of jets you need to purchase by measuring an old jet. Wait to remove all of the jets from the tub. Then, lay a jet out on a flat surface. Use a ruler or tape measure to measure the length and diameter of the jet."
                },
                {
                    "headline": "Purchase new jets.",
                    "description": "Along with the measurement, consider the brand, model, color, and style you want for your replacement jets. You may be able to buy new jets from the company you purchased the tub from. If not, go to your local home improvement store or order the jets online. You could choose jets that release water in a smooth or textured style—like swirl, eclipse, or spoke style. Smooth style indicates a smooth finish across the face of the jet. Textured indicates a textured finish."
                }
            ]
        },
        {
            "name": "Installing the Jets",
            "steps": [
                {
                    "headline": "Insert the new jet into the jet well.",
                    "description": "Place the new jet into the same place where you removed the old jet. Push the jet into the jet well until the back of it is flush against the tub."
                },
                {
                    "headline": "Rotate the jet clockwise.",
                    "description": "Begin to turn the jet clockwise. If you have trouble turning it, you can use a wrench. You may hear a click when it has been fully installed. Read the instructions that came with your new jets before fully installing them."
                },
                {
                    "headline": "Check to see if the new jets work.",
                    "description": "Refill the water in your home spa or turn on your bathtub. Turn on your new jets. If they do not work properly, try the installation process again. There may be a problem with the home spa if the jets still do not work properly after inspection and re-installation."
                }
            ]
        },
        {
            "name": "Troubleshooting the Jets",
            "steps": [
                {
                    "headline": "Check the pumps if the jets aren’t working properly.",
                    "description": "Your pumps may be malfunctioning if you can’t find a problem with your jets. No water coming out of the jets is one sign of problematic pumps. Other signs are if water is leaking out of the pump shaft or if the water isn’t hot. It will cost about $200 to $500 USD to fix pumps. It is best to call in a professional to fix your pumps."
                },
                {
                    "headline": "Look for a broken tab if a jet pops off.",
                    "description": "Some spas have tabs that hold the jets into place. If you find a jet floating in the water, check to see if any of the tabs have popped off. You may just need to screw the jet in tighter if you don’t see a broken tab. If the tab is broken, it is best to replace the jet. You can try to glue it back with a strong adhesive, like super glue, if necessary, though."
                },
                {
                    "headline": "Check the jet housing to detect a leak.",
                    "description": "A leak may come from a crack in the jet housing. If this is the case, you can add silicone to the outer edge of the housing to fix the leak. The leak may stem from the jet gasket or glue joint, which is located behind the jet, if there isn’t a crack in the jet housing. Call in a professional if you can’t fix the broken pumps."
                },
                {
                    "headline": "Clean your jets once or twice a year to prevent clogging.",
                    "description": "Clogging can prevent your jets from functioning properly. Remove your jets once or twice a year. Soak them overnight in a solution of white vinegar and water. Then, dry them off and re-install them. You can also purchase a commercial cleaner for the jets."
                }
            ]
        }
    ],
    "tyn": [
        "Owner's manual",
        "New spa jet assembly",
        "Adjustable wrench",
        "Silicone sealant",
        "White vinegar",
        "Safety glasses and gloves"
    ],
    "text": " Beginning the Replacement Drain the water from your spa. It is not safe to replace the jets while water is still in the tub. Drain all water out of the tub before working on your jets. To drain your tub, first turn off the spa’s circuit breaker. Then, remove the front panel of your tub and find the hose spigot. Attach a garden hose to the spigot and drain the water out of the tub. It’s not safe to replace jets with water in the tub because it could lead to electrocution, especially if the spa’s circuit breaker hasn’t been turned off. You can remove any remaining water with a mop or wet/dry vac. Draining not be necessary if your jets are in a bathtub because bathtubs are usually drained of water after each use. Read your owner’s manual. There are several different types of home spas and many different brands. Your brand may require a slightly different replacement process than another brand or type. Read your owner’s manual for exact instructions to remove and replace jets. If you’ve lost your owner’s manual, look for the manual on the internet, or call the manufacturer to request another one. Remove the existing jets. For removal, you may just need to rotate the jet counterclockwise until it pops out of the jet well. If you can’t easily remove it by hand, use a wrench. Tighten the wrench on your jet to get a good grip. Turn the wrench counterclockwise to loosen your jet until it becomes loose enough to pull out of the tub. Your manual may have specific instructions for removing jets. Read the manual before removing the jets. Measure the jets. If you do not have your replacement jets yet, you can get an idea about what kind of jets you need to purchase by measuring an old jet. Wait to remove all of the jets from the tub. Then, lay a jet out on a flat surface. Use a ruler or tape measure to measure the length and diameter of the jet. Purchase new jets. Along with the measurement, consider the brand, model, color, and style you want for your replacement jets. You may be able to buy new jets from the company you purchased the tub from. If not, go to your local home improvement store or order the jets online. You could choose jets that release water in a smooth or textured style—like swirl, eclipse, or spoke style. Smooth style indicates a smooth finish across the face of the jet. Textured indicates a textured finish. Installing the Jets Insert the new jet into the jet well. Place the new jet into the same place where you removed the old jet. Push the jet into the jet well until the back of it is flush against the tub. Rotate the jet clockwise. Begin to turn the jet clockwise. If you have trouble turning it, you can use a wrench. You may hear a click when it has been fully installed. Read the instructions that came with your new jets before fully installing them. Check to see if the new jets work. Refill the water in your home spa or turn on your bathtub. Turn on your new jets. If they do not work properly, try the installation process again. There may be a problem with the home spa if the jets still do not work properly after inspection and re-installation. Troubleshooting the Jets Check the pumps if the jets aren’t working properly. Your pumps may be malfunctioning if you can’t find a problem with your jets. No water coming out of the jets is one sign of problematic pumps. Other signs are if water is leaking out of the pump shaft or if the water isn’t hot. It will cost about $200 to $500 USD to fix pumps. It is best to call in a professional to fix your pumps. Look for a broken tab if a jet pops off. Some spas have tabs that hold the jets into place. If you find a jet floating in the water, check to see if any of the tabs have popped off. You may just need to screw the jet in tighter if you don’t see a broken tab. If the tab is broken, it is best to replace the jet. You can try to glue it back with a strong adhesive, like super glue, if necessary, though. Check the jet housing to detect a leak. A leak may come from a crack in the jet housing. If this is the case, you can add silicone to the outer edge of the housing to fix the leak. The leak may stem from the jet gasket or glue joint, which is located behind the jet, if there isn’t a crack in the jet housing. Call in a professional if you can’t fix the broken pumps. Clean your jets once or twice a year to prevent clogging. Clogging can prevent your jets from functioning properly. Remove your jets once or twice a year. Soak them overnight in a solution of white vinegar and water. Then, dry them off and re-install them. You can also purchase a commercial cleaner for the jets.",
    "sentences": [
        " Beginning the Replacement Drain the water from your spa.",
        "It is not safe to replace the jets while water is still in the tub.",
        "Drain all water out of the tub before working on your jets.",
        "To drain your tub, first turn off the spa’s circuit breaker.",
        "Then, remove the front panel of your tub and find the hose spigot.",
        "Attach a garden hose to the spigot and drain the water out of the tub.",
        "It’s not safe to replace jets with water in the tub because it could lead to electrocution, especially if the spa’s circuit breaker hasn’t been turned off.",
        "You can remove any remaining water with a mop or wet/dry vac.",
        "Draining not be necessary if your jets are in a bathtub because bathtubs are usually drained of water after each use.",
        "Read your owner’s manual.",
        "There are several different types of home spas and many different brands.",
        "Your brand may require a slightly different replacement process than another brand or type.",
        "Read your owner’s manual for exact instructions to remove and replace jets.",
        "If you’ve lost your owner’s manual, look for the manual on the internet, or call the manufacturer to request another one.",
        "Remove the existing jets.",
        "For removal, you may just need to rotate the jet counterclockwise until it pops out of the jet well.",
        "If you can’t easily remove it by hand, use a wrench.",
        "Tighten the wrench on your jet to get a good grip.",
        "Turn the wrench counterclockwise to loosen your jet until it becomes loose enough to pull out of the tub.",
        "Your manual may have specific instructions for removing jets.",
        "Read the manual before removing the jets.",
        "Measure the jets.",
        "If you do not have your replacement jets yet, you can get an idea about what kind of jets you need to purchase by measuring an old jet.",
        "Wait to remove all of the jets from the tub.",
        "Then, lay a jet out on a flat surface.",
        "Use a ruler or tape measure to measure the length and diameter of the jet.",
        "Purchase new jets.",
        "Along with the measurement, consider the brand, model, color, and style you want for your replacement jets.",
        "You may be able to buy new jets from the company you purchased the tub from.",
        "If not, go to your local home improvement store or order the jets online.",
        "You could choose jets that release water in a smooth or textured style—like swirl, eclipse, or spoke style.",
        "Smooth style indicates a smooth finish across the face of the jet.",
        "Textured indicates a textured finish.",
        "Installing the Jets Insert the new jet into the jet well.",
        "Place the new jet into the same place where you removed the old jet.",
        "Push the jet into the jet well until the back of it is flush against the tub.",
        "Rotate the jet clockwise.",
        "Begin to turn the jet clockwise.",
        "If you have trouble turning it, you can use a wrench.",
        "You may hear a click when it has been fully installed.",
        "Read the instructions that came with your new jets before fully installing them.",
        "Check to see if the new jets work.",
        "Refill the water in your home spa or turn on your bathtub.",
        "Turn on your new jets.",
        "If they do not work properly, try the installation process again.",
        "There may be a problem with the home spa if the jets still do not work properly after inspection and re-installation.",
        "Troubleshooting the Jets Check the pumps if the jets aren’t working properly.",
        "Your pumps may be malfunctioning if you can’t find a problem with your jets.",
        "No water coming out of the jets is one sign of problematic pumps.",
        "Other signs are if water is leaking out of the pump shaft or if the water isn’t hot.",
        "It will cost about $200 to $500 USD to fix pumps.",
        "It is best to call in a professional to fix your pumps.",
        "Look for a broken tab if a jet pops off.",
        "Some spas have tabs that hold the jets into place.",
        "If you find a jet floating in the water, check to see if any of the tabs have popped off.",
        "You may just need to screw the jet in tighter if you don’t see a broken tab.",
        "If the tab is broken, it is best to replace the jet.",
        "You can try to glue it back with a strong adhesive, like super glue, if necessary, though.",
        "Check the jet housing to detect a leak.",
        "A leak may come from a crack in the jet housing.",
        "If this is the case, you can add silicone to the outer edge of the housing to fix the leak.",
        "The leak may stem from the jet gasket or glue joint, which is located behind the jet, if there isn’t a crack in the jet housing.",
        "Call in a professional if you can’t fix the broken pumps.",
        "Clean your jets once or twice a year to prevent clogging.",
        "Clogging can prevent your jets from functioning properly.",
        "Remove your jets once or twice a year.",
        "Soak them overnight in a solution of white vinegar and water.",
        "Then, dry them off and re-install them.",
        "You can also purchase a commercial cleaner for the jets."
    ]
}