{
    "title": "How to Take Body Measurements",
    "url": "https://www.wikihow.com/Take-Body-Measurements",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Body Type and Fashion"
    ],
    "methods": [
        {
            "name": "Using a Tape Measure",
            "steps": [
                {
                    "headline": "Use the correct type of tape measure.",
                    "description": "When taking body measurements, you need to use the correct type of tape measure. You will want to use a soft cloth or flexible plastic/rubber tape measure, such as is used in sewing. Do not use a metal measuring tape such as is used in construction (it will be inaccurate)."
                },
                {
                    "headline": "Stand correctly.",
                    "description": "Stand straight, tall, and breathe normally when taking measurements. Some measurements may be taken better when exhaling, some when inhaling (it will depend on the purpose of the measurement). This may be difficult to do yourself, so get a friend to help you."
                },
                {
                    "headline": "Measure correctly.",
                    "description": "You want to be sure that when you measure, the tape is straight and in line with the appropriate body part. For example, for most circumference measurements the tape will need to be parallel to the floor while while lengths will need to be either parallel or perpendicular (based on the line orientation of the body part being measured)."
                },
                {
                    "headline": "Wear appropriate clothing.",
                    "description": "You can’t get a very accurate measurement when wearing baggy or thick clothing, so try to wear clothes which fit closely or wear nothing at all. Similarly, breast measurements for women will be most accurate when wearing a well-fitting, unpadded bra. If measuring for clothes tailoring, some measurements will need to be taken with clothing on, such as pants measurements and shoulder measurements."
                },
                {
                    "headline": "Know when to measure circumference vs length.",
                    "description": "Different measurements will need to be either circumference measurements (the measurement around something) or length measurements (the measurement between two straight points). Which is necessary should be obvious but all will be indicated in the instructions below."
                },
                {
                    "headline": "Write down your measurements.",
                    "description": "Make sure that you write down the measurements as you take them, so that you do not forget them and need to take them again."
                }
            ]
        },
        {
            "name": "Monitoring Weight",
            "steps": [
                {
                    "headline": "Measure your upper arm.",
                    "description": "Measure the circumference around the thickest part of your upper arm, usually at the bicep."
                },
                {
                    "headline": "Measure your chest.",
                    "description": "Measure the circumference around your chest at its widest point. For most men this will be at the armpits, for most women this will be at the nipple line."
                },
                {
                    "headline": "Measure your waist.",
                    "description": "Measure the circumference around your natural waist and your lower waist (two separate measurements). The natural waist is the smallest point of your waist (unlike where clothes’ waistlines are located these days) and is usually an inch or two above your bellybutton. Your lower waist is the widest part of your waist, usually at the bellybutton or just below, where weight is generally gained first."
                },
                {
                    "headline": "Measure your hips.",
                    "description": "Measure the circumference around your hips at the widest point. This will usually be roughly just above the crotch line."
                },
                {
                    "headline": "Measure your upper thigh.",
                    "description": "Measure the circumference around your upper thigh at its widest point. This is usually ½ to 3/4’s of the way up your thigh, from the knee."
                },
                {
                    "headline": "Measure your calves.",
                    "description": "Measure the circumference around your calf at its widest point, usually roughly ¾ of the way up from the ankle."
                },
                {
                    "headline": "Measure your weight.",
                    "description": "For weight monitoring, you may include your body weight as a body measurement. This measurement will need to be taken with a scale, either electronic or manual. You can find scales for sale at many stores, or for use at gyms and doctor’s offices."
                },
                {
                    "headline": "Measure your height.",
                    "description": "The easiest way to measure your height is to stand straight with no shoes on and place your back against a wall. Using a pencil, place the pencil flat against the top of your head with the writing end against the wall. Carefully mark your height against the wall. Step away and measure from the mark down to the floor using any measuring tape."
                },
                {
                    "headline": "Calculate your body fat or BMI.",
                    "description": "You may wish to use the above measurements to calculate your body fat or BMI if you are intending to monitor your weight loss. Be aware that body fat calculations are frequently inaccurate or unreliable, though BMI is a fairly accurate way of measuring your weight (unless you are a fit athlete, in which case better not)."
                }
            ]
        },
        {
            "name": "Tailoring or Making Clothing",
            "steps": [
                {
                    "headline": "Take the measurements listed above.",
                    "description": "You will need many of the measurements listed above for tailoring and creating various items of clothing. Read above if your pattern or instructions call for those measurements."
                },
                {
                    "headline": "Measure your shoulders.",
                    "description": "Measure the distance between the shoulder seams on an appropriately fitting shirt or jacket or the area you wish the shoulder seam to be. This measurement should be taken across the top of the back and be parallel with the floor."
                },
                {
                    "headline": "Measure your shoulder seam.",
                    "description": "Measure the distance between the seam or desired seam of your collar and your shoulder."
                },
                {
                    "headline": "Measure your sleeve length.",
                    "description": "Measure the distance between your shoulder seam and your desired sleeve cuff. This measurement should be taken in a straight line along the outside or top of the arm with the arm held up (parallel with the floor). This will help account for the fact that the cuff will move up the arm when the arm is extended, ensuring that your sleeve measurement is not too short."
                },
                {
                    "headline": "Measure your jacket length.",
                    "description": "Measure the distance between the middle of the upper shoulder seam and the bottom hem or desired hem of the jacket. It may also be necessary to take a measurement from the back center of the collar seam down to the hem, if the collar seam is particularly high."
                },
                {
                    "headline": "Measure your shoulder to waist length.",
                    "description": "Measure the distance between your shoulder seam where it meets with your collar and your natural waist, as described in the above section. This should align with the fullest part of your chest."
                },
                {
                    "headline": "Measure your shoulder to nipple length.",
                    "description": "Measure the distance between your shoulder seam where it meets with your collar and your nipple line. This should align with the fullest part of your chest."
                },
                {
                    "headline": "Measure your upper bust.",
                    "description": "Measure the circumference around your upper bust by aligning the measure at the middle of your back, just below the bust line (it should at this point be parallel with the floor), and then closing the tape over the top of your breast. This should help measure breast fullness and rise."
                },
                {
                    "headline": "Measure your your under bust.",
                    "description": "Measure the circumference around your under bust by aligning the measure at the middle of your back, just below the bust line (it should at this point be parallel with the floor), and closing the tap just under your breast. This should help measure your rib cage width."
                },
                {
                    "headline": "Measure your pants length.",
                    "description": "Measure the distance between the waist and the hem or desired hem of the pant. This should be taken in a straight line down the front center of the leg."
                },
                {
                    "headline": "Measure your inseam.",
                    "description": "Measure the distance between the crotch seam or desired crotch seam and the cuff or desired cuff of the pants, along the inside seam. This is considered a very personal measurement and tailors should generally respect your personal space and not get too close. If you are uncomfortable, tell them."
                },
                {
                    "headline": "Measure your cuff.",
                    "description": "Measure the circumference around your ankle  and account for how loose you would prefer the cuff or alternatively measure the cuff of an existing pair of pants by taking the length from side seam to side seam along the hem."
                },
                {
                    "headline": "Measure your front rise.",
                    "description": "Measure the distance between the front center of the waist hem and the crotch seam. This is considered a very personal measurement and tailors should generally respect your personal space and not get too handsy. If you are uncomfortable, tell them."
                },
                {
                    "headline": "Measure your back rise.",
                    "description": "Measure the distance between the back center of the waist hem and the crotch seam. This is considered a very personal measurement and tailors should generally respect your personal space and not get too handsy. If you are uncomfortable, tell them."
                }
            ]
        },
        {
            "name": "Fitting Bras",
            "steps": [
                {
                    "headline": "Understand that there are many methods.",
                    "description": "Each company will use a slightly different method to calculate bra size. If you can find a measurement guide or sizing chart for your preferred bra manufacturer, use that. You can alternatively receive a free fitting, over your clothes, at most department and lingerie stores. The method described below is a good starting point for figuring out your bra size but you may need to experiment to find the best fit. Keep in mind that bras may fit differently depending on their type. You may need a larger cup than normal, for example, with push-up bras. As with any clothing, it is also possible for bra sizes to run small or large as well."
                },
                {
                    "headline": "Measure your under bust.",
                    "description": "Measure your under bust using the method described in the clothing measurement section above. Add three inches to this measurement. If it is an even number then this is your band size. If it is an odd number, round down to the next even number to get your band size."
                },
                {
                    "headline": "Measure your bust size.",
                    "description": "Measure your bust at the nipple line as described in the monitoring weight section. The tape measure should just gentle touch you, not be pushing your breasts inward, and be parallel with the floor. If the resulting measurement is not a whole number, round up to the nearest full inch."
                },
                {
                    "headline": "Subtract your band size from your bust size.",
                    "description": "This should give you a much smaller number (usually between 2-4). This number is used to calculate your cup size. Here is how the numbers correspond:\n0-1/2 = AA\n1/2-1 = A\n2 = B\n3 = C\n4 = D\n5 = DD\nThis measurement system tends to be inaccurate for larger cup sizes and the system for your preferred brand should be followed."
                }
            ]
        }
    ],
    "tyn": [
        "Cloth measuring tape",
        "Measurement log",
        "Pencil",
        "Mirror"
    ],
    "text": " Using a Tape Measure Use the correct type of tape measure. When taking body measurements, you need to use the correct type of tape measure. You will want to use a soft cloth or flexible plastic/rubber tape measure, such as is used in sewing. Do not use a metal measuring tape such as is used in construction (it will be inaccurate). Stand correctly. Stand straight, tall, and breathe normally when taking measurements. Some measurements may be taken better when exhaling, some when inhaling (it will depend on the purpose of the measurement). This may be difficult to do yourself, so get a friend to help you. Measure correctly. You want to be sure that when you measure, the tape is straight and in line with the appropriate body part. For example, for most circumference measurements the tape will need to be parallel to the floor while while lengths will need to be either parallel or perpendicular (based on the line orientation of the body part being measured). Wear appropriate clothing. You can’t get a very accurate measurement when wearing baggy or thick clothing, so try to wear clothes which fit closely or wear nothing at all. Similarly, breast measurements for women will be most accurate when wearing a well-fitting, unpadded bra. If measuring for clothes tailoring, some measurements will need to be taken with clothing on, such as pants measurements and shoulder measurements. Know when to measure circumference vs length. Different measurements will need to be either circumference measurements (the measurement around something) or length measurements (the measurement between two straight points). Which is necessary should be obvious but all will be indicated in the instructions below. Write down your measurements. Make sure that you write down the measurements as you take them, so that you do not forget them and need to take them again. Monitoring Weight Measure your upper arm. Measure the circumference around the thickest part of your upper arm, usually at the bicep. Measure your chest. Measure the circumference around your chest at its widest point. For most men this will be at the armpits, for most women this will be at the nipple line. Measure your waist. Measure the circumference around your natural waist and your lower waist (two separate measurements). The natural waist is the smallest point of your waist (unlike where clothes’ waistlines are located these days) and is usually an inch or two above your bellybutton. Your lower waist is the widest part of your waist, usually at the bellybutton or just below, where weight is generally gained first. Measure your hips. Measure the circumference around your hips at the widest point. This will usually be roughly just above the crotch line. Measure your upper thigh. Measure the circumference around your upper thigh at its widest point. This is usually ½ to 3/4’s of the way up your thigh, from the knee. Measure your calves. Measure the circumference around your calf at its widest point, usually roughly ¾ of the way up from the ankle. Measure your weight. For weight monitoring, you may include your body weight as a body measurement. This measurement will need to be taken with a scale, either electronic or manual. You can find scales for sale at many stores, or for use at gyms and doctor’s offices. Measure your height. The easiest way to measure your height is to stand straight with no shoes on and place your back against a wall. Using a pencil, place the pencil flat against the top of your head with the writing end against the wall. Carefully mark your height against the wall. Step away and measure from the mark down to the floor using any measuring tape. Calculate your body fat or BMI. You may wish to use the above measurements to calculate your body fat or BMI if you are intending to monitor your weight loss. Be aware that body fat calculations are frequently inaccurate or unreliable, though BMI is a fairly accurate way of measuring your weight (unless you are a fit athlete, in which case better not). Tailoring or Making Clothing Take the measurements listed above. You will need many of the measurements listed above for tailoring and creating various items of clothing. Read above if your pattern or instructions call for those measurements. Measure your shoulders. Measure the distance between the shoulder seams on an appropriately fitting shirt or jacket or the area you wish the shoulder seam to be. This measurement should be taken across the top of the back and be parallel with the floor. Measure your shoulder seam. Measure the distance between the seam or desired seam of your collar and your shoulder. Measure your sleeve length. Measure the distance between your shoulder seam and your desired sleeve cuff. This measurement should be taken in a straight line along the outside or top of the arm with the arm held up (parallel with the floor). This will help account for the fact that the cuff will move up the arm when the arm is extended, ensuring that your sleeve measurement is not too short. Measure your jacket length. Measure the distance between the middle of the upper shoulder seam and the bottom hem or desired hem of the jacket. It may also be necessary to take a measurement from the back center of the collar seam down to the hem, if the collar seam is particularly high. Measure your shoulder to waist length. Measure the distance between your shoulder seam where it meets with your collar and your natural waist, as described in the above section. This should align with the fullest part of your chest. Measure your shoulder to nipple length. Measure the distance between your shoulder seam where it meets with your collar and your nipple line. This should align with the fullest part of your chest. Measure your upper bust. Measure the circumference around your upper bust by aligning the measure at the middle of your back, just below the bust line (it should at this point be parallel with the floor), and then closing the tape over the top of your breast. This should help measure breast fullness and rise. Measure your your under bust. Measure the circumference around your under bust by aligning the measure at the middle of your back, just below the bust line (it should at this point be parallel with the floor), and closing the tap just under your breast. This should help measure your rib cage width. Measure your pants length. Measure the distance between the waist and the hem or desired hem of the pant. This should be taken in a straight line down the front center of the leg. Measure your inseam. Measure the distance between the crotch seam or desired crotch seam and the cuff or desired cuff of the pants, along the inside seam. This is considered a very personal measurement and tailors should generally respect your personal space and not get too close. If you are uncomfortable, tell them. Measure your cuff. Measure the circumference around your ankle  and account for how loose you would prefer the cuff or alternatively measure the cuff of an existing pair of pants by taking the length from side seam to side seam along the hem. Measure your front rise. Measure the distance between the front center of the waist hem and the crotch seam. This is considered a very personal measurement and tailors should generally respect your personal space and not get too handsy. If you are uncomfortable, tell them. Measure your back rise. Measure the distance between the back center of the waist hem and the crotch seam. This is considered a very personal measurement and tailors should generally respect your personal space and not get too handsy. If you are uncomfortable, tell them. Fitting Bras Understand that there are many methods. Each company will use a slightly different method to calculate bra size. If you can find a measurement guide or sizing chart for your preferred bra manufacturer, use that. You can alternatively receive a free fitting, over your clothes, at most department and lingerie stores. The method described below is a good starting point for figuring out your bra size but you may need to experiment to find the best fit. Keep in mind that bras may fit differently depending on their type. You may need a larger cup than normal, for example, with push-up bras. As with any clothing, it is also possible for bra sizes to run small or large as well. Measure your under bust. Measure your under bust using the method described in the clothing measurement section above. Add three inches to this measurement. If it is an even number then this is your band size. If it is an odd number, round down to the next even number to get your band size. Measure your bust size. Measure your bust at the nipple line as described in the monitoring weight section. The tape measure should just gentle touch you, not be pushing your breasts inward, and be parallel with the floor. If the resulting measurement is not a whole number, round up to the nearest full inch. Subtract your band size from your bust size. This should give you a much smaller number (usually between 2-4). This number is used to calculate your cup size. Here is how the numbers correspond:\n0-1/2 = AA\n1/2-1 = A\n2 = B\n3 = C\n4 = D\n5 = DD\nThis measurement system tends to be inaccurate for larger cup sizes and the system for your preferred brand should be followed.",
    "sentences": [
        " Using a Tape Measure Use the correct type of tape measure.",
        "When taking body measurements, you need to use the correct type of tape measure.",
        "You will want to use a soft cloth or flexible plastic/rubber tape measure, such as is used in sewing.",
        "Do not use a metal measuring tape such as is used in construction (it will be inaccurate).",
        "Stand correctly.",
        "Stand straight, tall, and breathe normally when taking measurements.",
        "Some measurements may be taken better when exhaling, some when inhaling (it will depend on the purpose of the measurement).",
        "This may be difficult to do yourself, so get a friend to help you.",
        "Measure correctly.",
        "You want to be sure that when you measure, the tape is straight and in line with the appropriate body part.",
        "For example, for most circumference measurements the tape will need to be parallel to the floor while while lengths will need to be either parallel or perpendicular (based on the line orientation of the body part being measured).",
        "Wear appropriate clothing.",
        "You can’t get a very accurate measurement when wearing baggy or thick clothing, so try to wear clothes which fit closely or wear nothing at all.",
        "Similarly, breast measurements for women will be most accurate when wearing a well-fitting, unpadded bra.",
        "If measuring for clothes tailoring, some measurements will need to be taken with clothing on, such as pants measurements and shoulder measurements.",
        "Know when to measure circumference vs length.",
        "Different measurements will need to be either circumference measurements (the measurement around something) or length measurements (the measurement between two straight points).",
        "Which is necessary should be obvious but all will be indicated in the instructions below.",
        "Write down your measurements.",
        "Make sure that you write down the measurements as you take them, so that you do not forget them and need to take them again.",
        "Monitoring Weight Measure your upper arm.",
        "Measure the circumference around the thickest part of your upper arm, usually at the bicep.",
        "Measure your chest.",
        "Measure the circumference around your chest at its widest point.",
        "For most men this will be at the armpits, for most women this will be at the nipple line.",
        "Measure your waist.",
        "Measure the circumference around your natural waist and your lower waist (two separate measurements).",
        "The natural waist is the smallest point of your waist (unlike where clothes’ waistlines are located these days) and is usually an inch or two above your bellybutton.",
        "Your lower waist is the widest part of your waist, usually at the bellybutton or just below, where weight is generally gained first.",
        "Measure your hips.",
        "Measure the circumference around your hips at the widest point.",
        "This will usually be roughly just above the crotch line.",
        "Measure your upper thigh.",
        "Measure the circumference around your upper thigh at its widest point.",
        "This is usually ½ to 3/4’s of the way up your thigh, from the knee.",
        "Measure your calves.",
        "Measure the circumference around your calf at its widest point, usually roughly ¾ of the way up from the ankle.",
        "Measure your weight.",
        "For weight monitoring, you may include your body weight as a body measurement.",
        "This measurement will need to be taken with a scale, either electronic or manual.",
        "You can find scales for sale at many stores, or for use at gyms and doctor’s offices.",
        "Measure your height.",
        "The easiest way to measure your height is to stand straight with no shoes on and place your back against a wall.",
        "Using a pencil, place the pencil flat against the top of your head with the writing end against the wall.",
        "Carefully mark your height against the wall.",
        "Step away and measure from the mark down to the floor using any measuring tape.",
        "Calculate your body fat or BMI.",
        "You may wish to use the above measurements to calculate your body fat or BMI if you are intending to monitor your weight loss.",
        "Be aware that body fat calculations are frequently inaccurate or unreliable, though BMI is a fairly accurate way of measuring your weight (unless you are a fit athlete, in which case better not).",
        "Tailoring or Making Clothing Take the measurements listed above.",
        "You will need many of the measurements listed above for tailoring and creating various items of clothing.",
        "Read above if your pattern or instructions call for those measurements.",
        "Measure your shoulders.",
        "Measure the distance between the shoulder seams on an appropriately fitting shirt or jacket or the area you wish the shoulder seam to be.",
        "This measurement should be taken across the top of the back and be parallel with the floor.",
        "Measure your shoulder seam.",
        "Measure the distance between the seam or desired seam of your collar and your shoulder.",
        "Measure your sleeve length.",
        "Measure the distance between your shoulder seam and your desired sleeve cuff.",
        "This measurement should be taken in a straight line along the outside or top of the arm with the arm held up (parallel with the floor).",
        "This will help account for the fact that the cuff will move up the arm when the arm is extended, ensuring that your sleeve measurement is not too short.",
        "Measure your jacket length.",
        "Measure the distance between the middle of the upper shoulder seam and the bottom hem or desired hem of the jacket.",
        "It may also be necessary to take a measurement from the back center of the collar seam down to the hem, if the collar seam is particularly high.",
        "Measure your shoulder to waist length.",
        "Measure the distance between your shoulder seam where it meets with your collar and your natural waist, as described in the above section.",
        "This should align with the fullest part of your chest.",
        "Measure your shoulder to nipple length.",
        "Measure the distance between your shoulder seam where it meets with your collar and your nipple line.",
        "This should align with the fullest part of your chest.",
        "Measure your upper bust.",
        "Measure the circumference around your upper bust by aligning the measure at the middle of your back, just below the bust line (it should at this point be parallel with the floor), and then closing the tape over the top of your breast.",
        "This should help measure breast fullness and rise.",
        "Measure your your under bust.",
        "Measure the circumference around your under bust by aligning the measure at the middle of your back, just below the bust line (it should at this point be parallel with the floor), and closing the tap just under your breast.",
        "This should help measure your rib cage width.",
        "Measure your pants length.",
        "Measure the distance between the waist and the hem or desired hem of the pant.",
        "This should be taken in a straight line down the front center of the leg.",
        "Measure your inseam.",
        "Measure the distance between the crotch seam or desired crotch seam and the cuff or desired cuff of the pants, along the inside seam.",
        "This is considered a very personal measurement and tailors should generally respect your personal space and not get too close.",
        "If you are uncomfortable, tell them.",
        "Measure your cuff.",
        "Measure the circumference around your ankle  and account for how loose you would prefer the cuff or alternatively measure the cuff of an existing pair of pants by taking the length from side seam to side seam along the hem.",
        "Measure your front rise.",
        "Measure the distance between the front center of the waist hem and the crotch seam.",
        "This is considered a very personal measurement and tailors should generally respect your personal space and not get too handsy.",
        "If you are uncomfortable, tell them.",
        "Measure your back rise.",
        "Measure the distance between the back center of the waist hem and the crotch seam.",
        "This is considered a very personal measurement and tailors should generally respect your personal space and not get too handsy.",
        "If you are uncomfortable, tell them.",
        "Fitting Bras Understand that there are many methods.",
        "Each company will use a slightly different method to calculate bra size.",
        "If you can find a measurement guide or sizing chart for your preferred bra manufacturer, use that.",
        "You can alternatively receive a free fitting, over your clothes, at most department and lingerie stores.",
        "The method described below is a good starting point for figuring out your bra size but you may need to experiment to find the best fit.",
        "Keep in mind that bras may fit differently depending on their type.",
        "You may need a larger cup than normal, for example, with push-up bras.",
        "As with any clothing, it is also possible for bra sizes to run small or large as well.",
        "Measure your under bust.",
        "Measure your under bust using the method described in the clothing measurement section above.",
        "Add three inches to this measurement.",
        "If it is an even number then this is your band size.",
        "If it is an odd number, round down to the next even number to get your band size.",
        "Measure your bust size.",
        "Measure your bust at the nipple line as described in the monitoring weight section.",
        "The tape measure should just gentle touch you, not be pushing your breasts inward, and be parallel with the floor.",
        "If the resulting measurement is not a whole number, round up to the nearest full inch.",
        "Subtract your band size from your bust size.",
        "This should give you a much smaller number (usually between 2-4).",
        "This number is used to calculate your cup size.",
        "Here is how the numbers correspond:\n0-1/2 = AA\n1/2-1 = A\n2 = B\n3 = C\n4 = D\n5 = DD\nThis measurement system tends to be inaccurate for larger cup sizes and the system for your preferred brand should be followed."
    ]
}