{
    "title": "How to Paint a Motorcycle Tank",
    "url": "https://www.wikihow.com/Paint-a-Motorcycle-Tank",
    "category_hierarchy": [
        "Cars & Other Vehicles",
        "Motorcycles",
        "Modifying Motorcycles"
    ],
    "steps": [
        {
            "headline": "Remove all of the existing paint.",
            "description": "Use a sandblaster to sand the tank down to bare metal. Sandblasting might leave some cracks and holes, so use a metal filler to fill in cracks and a body filler to fill in holes. Use a piece of 180-grit sandpaper over the surface repeatedly until it is smooth to the touch."
        },
        {
            "headline": "Cover all openings with duct tape, and use a utility knife to trim the tape before you paint a motorcycle tank.",
            "description": "Cover any areas where the rubber gaskets contact the gas tank as this will prevent the paint from getting inside the gas tank. This would include areas in the filler neck area, the petcock assembly, and where the fuel gauge mounts to the tank."
        },
        {
            "headline": "Apply a minimum of 5 coats of primer.",
            "description": "Allow each coat to dry. After each coat is dry, sand it and apply another coat until you have 5 layers."
        },
        {
            "headline": "Apply several coats of base paint, and sand with 380-grit sandpaper in between coats.",
            "description": "Allow each coat to dry before proceeding to the next coat."
        },
        {
            "headline": "Air brush and add designs, if desired.",
            "description": ""
        },
        {
            "headline": "Apply 3 to 4 coats of clear coat polymer.",
            "description": "Allow to dry. This will protect your tank in case you drip gasoline on it while using a gasoline pump."
        }
    ],
    "tyn": [
        "Sandblaster",
        "Metal filler",
        "Body filler",
        "Sandpaper, 180- and 380-grit",
        "Duct tape",
        "Utility knife",
        "Primer",
        "Paintbrushes",
        "Paint colors of your choice",
        "Clear coat polymer paint",
        "Camera (optional)",
        "Spray Gun"
    ],
    "text": " Remove all of the existing paint. Use a sandblaster to sand the tank down to bare metal. Sandblasting might leave some cracks and holes, so use a metal filler to fill in cracks and a body filler to fill in holes. Use a piece of 180-grit sandpaper over the surface repeatedly until it is smooth to the touch. Cover all openings with duct tape, and use a utility knife to trim the tape before you paint a motorcycle tank. Cover any areas where the rubber gaskets contact the gas tank as this will prevent the paint from getting inside the gas tank. This would include areas in the filler neck area, the petcock assembly, and where the fuel gauge mounts to the tank. Apply a minimum of 5 coats of primer. Allow each coat to dry. After each coat is dry, sand it and apply another coat until you have 5 layers. Apply several coats of base paint, and sand with 380-grit sandpaper in between coats. Allow each coat to dry before proceeding to the next coat. Air brush and add designs, if desired.  Apply 3 to 4 coats of clear coat polymer. Allow to dry. This will protect your tank in case you drip gasoline on it while using a gasoline pump.",
    "sentences": [
        " Remove all of the existing paint.",
        "Use a sandblaster to sand the tank down to bare metal.",
        "Sandblasting might leave some cracks and holes, so use a metal filler to fill in cracks and a body filler to fill in holes.",
        "Use a piece of 180-grit sandpaper over the surface repeatedly until it is smooth to the touch.",
        "Cover all openings with duct tape, and use a utility knife to trim the tape before you paint a motorcycle tank.",
        "Cover any areas where the rubber gaskets contact the gas tank as this will prevent the paint from getting inside the gas tank.",
        "This would include areas in the filler neck area, the petcock assembly, and where the fuel gauge mounts to the tank.",
        "Apply a minimum of 5 coats of primer.",
        "Allow each coat to dry.",
        "After each coat is dry, sand it and apply another coat until you have 5 layers.",
        "Apply several coats of base paint, and sand with 380-grit sandpaper in between coats.",
        "Allow each coat to dry before proceeding to the next coat.",
        "Air brush and add designs, if desired.",
        "Apply 3 to 4 coats of clear coat polymer.",
        "Allow to dry.",
        "This will protect your tank in case you drip gasoline on it while using a gasoline pump."
    ]
}