{
    "title": "How to Remove the Smell of Bleach from Your Hands",
    "url": "https://www.wikihow.com/Remove-the-Smell-of-Bleach-from-Your-Hands",
    "category_hierarchy": [
        "Health",
        "Musculoskeletal System Health",
        "Arm and Hand Health"
    ],
    "methods": [
        {
            "name": "Eliminating the Smell",
            "steps": [
                {
                    "headline": "Neutralize the bleach with household acids.",
                    "description": "Neutralize bleach's base chemical make-up with foods high in natural acids. Combining an edible liquid acid with bleach is a great way to even out the overall pH and eliminate that unpleasant odor. Use any one of the following foods to neutralize the bleach:\nLemon, lime, orange, or grapefruit juice (also lime – any citrus fruit, really)\nTomatoes (tomato sauce, puree, or paste work as well)"
                },
                {
                    "headline": "Coat your hands with juice or vinegar.",
                    "description": "Rub it in well. It's best to do this for at least a minute as it gives you time to make sure you've covered everything. This also allows the liquid to soak in and neutralize the bleach."
                },
                {
                    "headline": "Rinse your hands with cool water.",
                    "description": "Voila! The smell will hopefully be gone."
                },
                {
                    "headline": "Soak your hands if the smell remains.",
                    "description": "If washing your hands doesn't work, or you don't wish to use straight liquid on your hands, dilute these acidic foods 1:1 with water. Then let your hands soak in this mixture for 2-3 minutes."
                },
                {
                    "headline": "Create an exfoliant scrub from household products.",
                    "description": "Combining a food that is both dry and high in acid content with bleach is a great way to even out the overall pH and eliminate that unpleasant odor as well. Use one of these dry acids as a rub to neutralize the base:\nBaking soda\nCoffee grounds"
                },
                {
                    "headline": "Choose your rub.",
                    "description": "Take the rub of your choice and do just that: rub it all over your hands. Take your time and rub it in well, much like an exfoliant scrub. Do this for one minute. Wipe off the excess into a trashcan and rinse with hot water. This will allow the rub to penetrate deeply into your pores. If you don't like the smell of coffee, of course, opt for using baking soda."
                }
            ]
        },
        {
            "name": "Moisturizing While Deodorizing",
            "steps": [
                {
                    "headline": "Use select natural oils, lotions, and soaps.",
                    "description": "Often times natural food, and plant-based oils have a wonderful aroma. They also have the added benefit of moisturizing your skin. Since bleach dries out the skin, it is a win-win: no more dry skin, no more chlorine stink. Some suggestions include:\nCoconut oil\nAlmond Oil\nOlive oil\nAloe Vera lotion: make sure the lotion is high in Aloe Vera as that will make a huge difference in its effectiveness\nTea tree oil lotion: like Aloe Vera, a higher concentrate will do a better job\nCitrus based lotions\nCitrus based soaps: there are some all-natural soaps that provide both the cleaning power of soap and the moisturizing effects of lotion. Check your local health food store to see if they have any that fit your needs and budget."
                },
                {
                    "headline": "Apply a little at a time.",
                    "description": "When using oils you don't want to overdo it. You could wind up over-oiling yourself, thus adding another step (namely, removing all that excess oil! )."
                },
                {
                    "headline": "Apply a few dollops.",
                    "description": "If you're using lotion, this should be enough to coat your entire hand and give you a good idea if you need more and if the lotion you've chosen is doing the job."
                },
                {
                    "headline": "Lather up.",
                    "description": "If you use a citrus based soap, lather up then use hot water. This helps the soap latch onto those base bleach molecules and lift them out."
                }
            ]
        },
        {
            "name": "Using Flowers, Plants and Herbs",
            "steps": [
                {
                    "headline": "Choose essential oils.",
                    "description": "These give you the ability to choose from a wide variety of oils to find the one you like the best. Make sure to never apply essential oils directly to the skin as they are, in general, too strong for direct contact. Dilute the essential oil in what is known as a carrier oil and apply as needed. Essential oil examples are:\nLemon\nEucalyptus\nLavendar\nPeppermint\nChamomile\nMarjoram"
                },
                {
                    "headline": "Choose your carrier oil.",
                    "description": "Some examples are:\nSweet almond oil\nHempseed oil\nFractionated coconut oil\nOlive oil\nSunflower oil"
                },
                {
                    "headline": "Follow the directions on the essential oil bottle for diluting it in your carrier oil.",
                    "description": "A good rule of them is a 2-percent solution. This means approximately one drop of essential oil per ounce of carrier oil."
                },
                {
                    "headline": "Pick petals from your garden.",
                    "description": "Find the most fragrant flowers or herbs in your yard or purchase them at the store. Then rub the petals or leaves in your fingers and hands to release the fragrant oils within them. Choose such fragrances as:\nRoses\nGeraniums\nLavendar\nRosemary\nPeppermint\nSpearmint"
                }
            ]
        }
    ],
    "tyn": [
        "Lemon/lime/orange/grapefruit juice",
        "Baking soda",
        "Coffee grounds",
        "Natural oil, lotion, or soap",
        "Essential oil",
        "Carrier oil",
        "Fragrant flowers or herbs from your yard or the store",
        "Rinsing area with running water"
    ],
    "text": " Eliminating the Smell Neutralize the bleach with household acids. Neutralize bleach's base chemical make-up with foods high in natural acids. Combining an edible liquid acid with bleach is a great way to even out the overall pH and eliminate that unpleasant odor. Use any one of the following foods to neutralize the bleach:\nLemon, lime, orange, or grapefruit juice (also lime – any citrus fruit, really)\nTomatoes (tomato sauce, puree, or paste work as well) Coat your hands with juice or vinegar. Rub it in well. It's best to do this for at least a minute as it gives you time to make sure you've covered everything. This also allows the liquid to soak in and neutralize the bleach. Rinse your hands with cool water. Voila! The smell will hopefully be gone. Soak your hands if the smell remains. If washing your hands doesn't work, or you don't wish to use straight liquid on your hands, dilute these acidic foods 1:1 with water. Then let your hands soak in this mixture for 2-3 minutes. Create an exfoliant scrub from household products. Combining a food that is both dry and high in acid content with bleach is a great way to even out the overall pH and eliminate that unpleasant odor as well. Use one of these dry acids as a rub to neutralize the base:\nBaking soda\nCoffee grounds Choose your rub. Take the rub of your choice and do just that: rub it all over your hands. Take your time and rub it in well, much like an exfoliant scrub. Do this for one minute. Wipe off the excess into a trashcan and rinse with hot water. This will allow the rub to penetrate deeply into your pores. If you don't like the smell of coffee, of course, opt for using baking soda. Moisturizing While Deodorizing Use select natural oils, lotions, and soaps. Often times natural food, and plant-based oils have a wonderful aroma. They also have the added benefit of moisturizing your skin. Since bleach dries out the skin, it is a win-win: no more dry skin, no more chlorine stink. Some suggestions include:\nCoconut oil\nAlmond Oil\nOlive oil\nAloe Vera lotion: make sure the lotion is high in Aloe Vera as that will make a huge difference in its effectiveness\nTea tree oil lotion: like Aloe Vera, a higher concentrate will do a better job\nCitrus based lotions\nCitrus based soaps: there are some all-natural soaps that provide both the cleaning power of soap and the moisturizing effects of lotion. Check your local health food store to see if they have any that fit your needs and budget. Apply a little at a time. When using oils you don't want to overdo it. You could wind up over-oiling yourself, thus adding another step (namely, removing all that excess oil! ). Apply a few dollops. If you're using lotion, this should be enough to coat your entire hand and give you a good idea if you need more and if the lotion you've chosen is doing the job. Lather up. If you use a citrus based soap, lather up then use hot water. This helps the soap latch onto those base bleach molecules and lift them out. Using Flowers, Plants and Herbs Choose essential oils. These give you the ability to choose from a wide variety of oils to find the one you like the best. Make sure to never apply essential oils directly to the skin as they are, in general, too strong for direct contact. Dilute the essential oil in what is known as a carrier oil and apply as needed. Essential oil examples are:\nLemon\nEucalyptus\nLavendar\nPeppermint\nChamomile\nMarjoram Choose your carrier oil. Some examples are:\nSweet almond oil\nHempseed oil\nFractionated coconut oil\nOlive oil\nSunflower oil Follow the directions on the essential oil bottle for diluting it in your carrier oil. A good rule of them is a 2-percent solution. This means approximately one drop of essential oil per ounce of carrier oil. Pick petals from your garden. Find the most fragrant flowers or herbs in your yard or purchase them at the store. Then rub the petals or leaves in your fingers and hands to release the fragrant oils within them. Choose such fragrances as:\nRoses\nGeraniums\nLavendar\nRosemary\nPeppermint\nSpearmint",
    "sentences": [
        " Eliminating the Smell Neutralize the bleach with household acids.",
        "Neutralize bleach's base chemical make-up with foods high in natural acids.",
        "Combining an edible liquid acid with bleach is a great way to even out the overall pH and eliminate that unpleasant odor.",
        "Use any one of the following foods to neutralize the bleach:\nLemon, lime, orange, or grapefruit juice (also lime – any citrus fruit, really)\nTomatoes (tomato sauce, puree, or paste work as well) Coat your hands with juice or vinegar.",
        "Rub it in well.",
        "It's best to do this for at least a minute as it gives you time to make sure you've covered everything.",
        "This also allows the liquid to soak in and neutralize the bleach.",
        "Rinse your hands with cool water.",
        "Voila!",
        "The smell will hopefully be gone.",
        "Soak your hands if the smell remains.",
        "If washing your hands doesn't work, or you don't wish to use straight liquid on your hands, dilute these acidic foods 1:1 with water.",
        "Then let your hands soak in this mixture for 2-3 minutes.",
        "Create an exfoliant scrub from household products.",
        "Combining a food that is both dry and high in acid content with bleach is a great way to even out the overall pH and eliminate that unpleasant odor as well.",
        "Use one of these dry acids as a rub to neutralize the base:\nBaking soda\nCoffee grounds Choose your rub.",
        "Take the rub of your choice and do just that: rub it all over your hands.",
        "Take your time and rub it in well, much like an exfoliant scrub.",
        "Do this for one minute.",
        "Wipe off the excess into a trashcan and rinse with hot water.",
        "This will allow the rub to penetrate deeply into your pores.",
        "If you don't like the smell of coffee, of course, opt for using baking soda.",
        "Moisturizing While Deodorizing Use select natural oils, lotions, and soaps.",
        "Often times natural food, and plant-based oils have a wonderful aroma.",
        "They also have the added benefit of moisturizing your skin.",
        "Since bleach dries out the skin, it is a win-win: no more dry skin, no more chlorine stink.",
        "Some suggestions include:\nCoconut oil\nAlmond Oil\nOlive oil\nAloe Vera lotion: make sure the lotion is high in Aloe Vera as that will make a huge difference in its effectiveness\nTea tree oil lotion: like Aloe Vera, a higher concentrate will do a better job\nCitrus based lotions\nCitrus based soaps: there are some all-natural soaps that provide both the cleaning power of soap and the moisturizing effects of lotion.",
        "Check your local health food store to see if they have any that fit your needs and budget.",
        "Apply a little at a time.",
        "When using oils you don't want to overdo it.",
        "You could wind up over-oiling yourself, thus adding another step (namely, removing all that excess oil!",
        ").",
        "Apply a few dollops.",
        "If you're using lotion, this should be enough to coat your entire hand and give you a good idea if you need more and if the lotion you've chosen is doing the job.",
        "Lather up.",
        "If you use a citrus based soap, lather up then use hot water.",
        "This helps the soap latch onto those base bleach molecules and lift them out.",
        "Using Flowers, Plants and Herbs Choose essential oils.",
        "These give you the ability to choose from a wide variety of oils to find the one you like the best.",
        "Make sure to never apply essential oils directly to the skin as they are, in general, too strong for direct contact.",
        "Dilute the essential oil in what is known as a carrier oil and apply as needed.",
        "Essential oil examples are:\nLemon\nEucalyptus\nLavendar\nPeppermint\nChamomile\nMarjoram Choose your carrier oil.",
        "Some examples are:\nSweet almond oil\nHempseed oil\nFractionated coconut oil\nOlive oil\nSunflower oil Follow the directions on the essential oil bottle for diluting it in your carrier oil.",
        "A good rule of them is a 2-percent solution.",
        "This means approximately one drop of essential oil per ounce of carrier oil.",
        "Pick petals from your garden.",
        "Find the most fragrant flowers or herbs in your yard or purchase them at the store.",
        "Then rub the petals or leaves in your fingers and hands to release the fragrant oils within them.",
        "Choose such fragrances as:\nRoses\nGeraniums\nLavendar\nRosemary\nPeppermint\nSpearmint"
    ]
}