{
    "title": "How to Work Out for Snowboarding",
    "url": "https://www.wikihow.com/Work-Out-for-Snowboarding",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Snowboarding"
    ],
    "methods": [
        {
            "name": "Strengthening Your Core",
            "steps": [
                {
                    "headline": "Aim to work your core at least 2-3 days per week.",
                    "description": "Make your workout last between 45-60 minutes each session. Take at least 1 rest day in between core workouts so your muscles don’t get strained. Practice different exercises each time you work your core so you don’t fall into too much of a routine. You use your core to help turn your snowboard and to lift yourself off the ground if you fall."
                },
                {
                    "headline": "Hold your body in a plank position to strengthen your abs.",
                    "description": "Start on the floor on your hands and knees. Extend your legs and hold your body off the floor with your toes. Put your forearms on the ground so your elbows are at a 90-degree angle and directly below your shoulders. Keep your back straight to form a line with your body. Try to hold the position for 2 minutes. When you feel comfortable holding a plank position, try lifting one of your arms or legs into the air to activate your core even more."
                },
                {
                    "headline": "Do push-ups to work out your chest.",
                    "description": "Get on your hands and knees on the floor. Straighten your legs until you’re supporting your weight on your hands and toes. Keep your hands directly below your shoulders and your arms straight. Lower your body until your elbows are at a 90-degree angle. Hold the position for 1 count before pushing yourself up to the starting position. Push-ups prepare you for picking yourself up out of the snow when you’re on a snowboard. Start by doing 3 sets of 10 push-ups and increase the rep count when you feel comfortable. Keep your knees on the ground if you want to make the push-ups easier. To make the push-ups more difficult, elevate your feet on an exercise ball."
                },
                {
                    "headline": "Perform bicycle kicks to tighten your abs and obliques.",
                    "description": "Lay on your back with your legs fully extended and put your hands behind your head. Lift your shoulders so they’re just off the ground, being careful not to force your neck forward with your hands. Bring one of your knees so it’s above your chest while keeping the other leg extended. Twist your body so the elbow on your opposite side touches your knee. Then bring the opposite knee to your chest, twisting so your other elbow touches it. Do bicycle kicks in 30-60 second increments for 3 sets. Bicycles works the same muscles that help you stand on your snowboard from a sitting position."
                },
                {
                    "headline": "Work on leg raises if you have access to a pull-up bar.",
                    "description": "Hang from a pull-up bar so your arms are straight and your hands are slightly wider than your shoulders. Keep your legs straight and lift them so they’re parallel to the ground. Hold the position for 1 or 2 counts before slowly lowering your legs again. Repeat the leg raises for 15 reps. Your core will help you keep your balance on your board."
                },
                {
                    "headline": "Try Russian twists to work on your obliques.",
                    "description": "Lie on the ground so your back is straight, knees are bent at a 45-degree angle, and your feet are flat on the floor. Lift your upper body so it makes a V-shape with your thighs. Twist your torso to one side until you feel your muscles contract. Hold the pose for 1 count before twisting to the other side. Do 3 sets of 10 reps on each side. For a more difficult Russian twist, hold a weight plate in front of your chest while you perform the exercise."
                }
            ]
        },
        {
            "name": "Building Your Leg Muscles",
            "steps": [
                {
                    "headline": "Work out your legs at least twice a week.",
                    "description": "Aim to work your legs at least 30-60 minutes during each session. Spread the days you exercise your legs throughout the week so you don’t get fatigued or cramped."
                },
                {
                    "headline": "Practice lunges for a simple leg workout.",
                    "description": "Stand straight up and take a step forward with one leg so your knee forms a 90-degree angle. Lower your body so your opposite knee almost touches the ground. Keep your back and neck straight while performing the lunge. Return to the starting position after holding the lunge for 1 count. Repeat the lunge on the other side. Do 3 sets of 20 lunges on each side. The muscles you use during a lunge are the same ones you’ll use to walk up hills."
                },
                {
                    "headline": "Strengthen your hips with bridges.",
                    "description": "Lie on your back with your hands at your side. Bend your knees so your feet are underneath them and flat against the ground. Tighten your glutes and thighs to raise your hips off the ground until they form a straight line with your torso. Slowly lower your hips back onto the floor. Do 3 sets of 15-20 reps. Your hip muscles help you while you toe slide and toe turn while you’re snowboarding."
                },
                {
                    "headline": "Do squats to work your quads and glutes.",
                    "description": "Stand with your legs shoulder-width apart. Bend your knees until your legs form a 90-degree angle. As you lower your body, keep your back and neck straight and extend your arms forward so they’re parallel to the ground. Straighten your legs back into the starting position. Do 2 or 3 sets of 15-20 reps.\nYou’ll be squatting most of the time you spend on a snowboard, especially during heel turns and slides. To make your squats more difficult, hold a kettlebell or medicine ball in your hands. This will help work your arm muscles as well as your legs."
                },
                {
                    "headline": "Perform calf raises to exercise your lower legs.",
                    "description": "Start with your knees slightly bent and your arms out in front of you. Keep your feet flat on the ground and your back straight. Lift your heels and balance on your toes, and hold the calf raise for 1 or 2 counts before putting your feet back down. Perform 3 sets of 15 calf raises. Calf raises can also be done on the edge of a slightly elevated surface, such as a stair, to get a full range of calf motion. Calf raises help perfect your balance."
                },
                {
                    "headline": "Try jump turns to work your core at the same time.",
                    "description": "Start with your legs bent at a 90-degree angle, back straight, and your arms in front of you. Straighten your legs and jump straight in the air. When you’re in midair, turn your body 180 degrees so you’re facing the opposite direction. Go back down into the starting position when you land and jump again immediately, turning back towards the way you were originally facing. Repeat the workout for 3 sets of 20 jumps. To make the jump turn easier, rotate your body 90-degrees instead of 180. This exercise helps strengthen your legs and keeps your core flexible."
                }
            ]
        },
        {
            "name": "Increasing Cardio Endurance",
            "steps": [
                {
                    "headline": "Practice cardio 2-3 days each week to stay in shape for snowboarding.",
                    "description": "Aim to get your heart rate between 120-150 beats per minute for a healthy cardio workout. Try to make your cardio routine last 45-50 minutes each day to keep your endurance up. Cardio helps keep you from getting fatigued while you’re snowboarding. You can do cardio and another workout of your choice on the same day."
                },
                {
                    "headline": "Go for a 20 minute run or jogoutside or on a treadmill.",
                    "description": "Start at a comfortable pace that you can maintain for the full 20 minutes. When the run feels easy at that speed, increase the speed or distance to increase your endurance. Running can also be done on an elliptical machine if you have access to one. Use a run-tracking app like Runkeeper or Strava to track your distance and time."
                },
                {
                    "headline": "Ride a bike for 5 miles (8 km) if you can.",
                    "description": "Either mountain or road biking will work for your cardio exercise. Try to maintain a constant speed to get the full benefits of the workout. When you feel comfortable at a certain speed, increase the speed or distance you bike. Make sure to wear a helmet when you’re biking outdoors. You can use a stationary bike if you have access to one. Biking will help you strengthen your legs as well as your cardio."
                },
                {
                    "headline": "Jump rope to improve your coordination.",
                    "description": "Use a beaded or wire jump rope to get the most effective use from it. Only jump 1–2 inches (2.5–5.1 cm) off the ground as the rope passes underneath you. Spend about 15 minutes jump roping to get your heart rate up and develop endurance. Jump roping will help boost the strength in your legs as well as your cardio. Move your feet side to side as you jump to add variety to your workout."
                },
                {
                    "headline": "Do stair climbers for a full-body exercise.",
                    "description": "Keep your back and neck straight as you go up and down the stairs. Plant a foot on each step as you ascend and descend the staircase so you don’t trip and fall. Practice climbing stairs for 15-20 minutes at various speeds to stay active. Even taking the stairs instead of an elevator can help increase your endurance. Never run down the stairs since this causes stress to your ankles and knees."
                }
            ]
        }
    ],
    "tyn": [
        "Tennis shoes",
        "Free weights",
        "Kettlebell or medicine ball",
        "Bike",
        "Jump rope",
        "Stairs"
    ],
    "text": " Strengthening Your Core Aim to work your core at least 2-3 days per week. Make your workout last between 45-60 minutes each session. Take at least 1 rest day in between core workouts so your muscles don’t get strained. Practice different exercises each time you work your core so you don’t fall into too much of a routine. You use your core to help turn your snowboard and to lift yourself off the ground if you fall. Hold your body in a plank position to strengthen your abs. Start on the floor on your hands and knees. Extend your legs and hold your body off the floor with your toes. Put your forearms on the ground so your elbows are at a 90-degree angle and directly below your shoulders. Keep your back straight to form a line with your body. Try to hold the position for 2 minutes. When you feel comfortable holding a plank position, try lifting one of your arms or legs into the air to activate your core even more. Do push-ups to work out your chest. Get on your hands and knees on the floor. Straighten your legs until you’re supporting your weight on your hands and toes. Keep your hands directly below your shoulders and your arms straight. Lower your body until your elbows are at a 90-degree angle. Hold the position for 1 count before pushing yourself up to the starting position. Push-ups prepare you for picking yourself up out of the snow when you’re on a snowboard. Start by doing 3 sets of 10 push-ups and increase the rep count when you feel comfortable. Keep your knees on the ground if you want to make the push-ups easier. To make the push-ups more difficult, elevate your feet on an exercise ball. Perform bicycle kicks to tighten your abs and obliques. Lay on your back with your legs fully extended and put your hands behind your head. Lift your shoulders so they’re just off the ground, being careful not to force your neck forward with your hands. Bring one of your knees so it’s above your chest while keeping the other leg extended. Twist your body so the elbow on your opposite side touches your knee. Then bring the opposite knee to your chest, twisting so your other elbow touches it. Do bicycle kicks in 30-60 second increments for 3 sets. Bicycles works the same muscles that help you stand on your snowboard from a sitting position. Work on leg raises if you have access to a pull-up bar. Hang from a pull-up bar so your arms are straight and your hands are slightly wider than your shoulders. Keep your legs straight and lift them so they’re parallel to the ground. Hold the position for 1 or 2 counts before slowly lowering your legs again. Repeat the leg raises for 15 reps. Your core will help you keep your balance on your board. Try Russian twists to work on your obliques. Lie on the ground so your back is straight, knees are bent at a 45-degree angle, and your feet are flat on the floor. Lift your upper body so it makes a V-shape with your thighs. Twist your torso to one side until you feel your muscles contract. Hold the pose for 1 count before twisting to the other side. Do 3 sets of 10 reps on each side. For a more difficult Russian twist, hold a weight plate in front of your chest while you perform the exercise. Building Your Leg Muscles Work out your legs at least twice a week. Aim to work your legs at least 30-60 minutes during each session. Spread the days you exercise your legs throughout the week so you don’t get fatigued or cramped. Practice lunges for a simple leg workout. Stand straight up and take a step forward with one leg so your knee forms a 90-degree angle. Lower your body so your opposite knee almost touches the ground. Keep your back and neck straight while performing the lunge. Return to the starting position after holding the lunge for 1 count. Repeat the lunge on the other side. Do 3 sets of 20 lunges on each side. The muscles you use during a lunge are the same ones you’ll use to walk up hills. Strengthen your hips with bridges. Lie on your back with your hands at your side. Bend your knees so your feet are underneath them and flat against the ground. Tighten your glutes and thighs to raise your hips off the ground until they form a straight line with your torso. Slowly lower your hips back onto the floor. Do 3 sets of 15-20 reps. Your hip muscles help you while you toe slide and toe turn while you’re snowboarding. Do squats to work your quads and glutes. Stand with your legs shoulder-width apart. Bend your knees until your legs form a 90-degree angle. As you lower your body, keep your back and neck straight and extend your arms forward so they’re parallel to the ground. Straighten your legs back into the starting position. Do 2 or 3 sets of 15-20 reps.\nYou’ll be squatting most of the time you spend on a snowboard, especially during heel turns and slides. To make your squats more difficult, hold a kettlebell or medicine ball in your hands. This will help work your arm muscles as well as your legs. Perform calf raises to exercise your lower legs. Start with your knees slightly bent and your arms out in front of you. Keep your feet flat on the ground and your back straight. Lift your heels and balance on your toes, and hold the calf raise for 1 or 2 counts before putting your feet back down. Perform 3 sets of 15 calf raises. Calf raises can also be done on the edge of a slightly elevated surface, such as a stair, to get a full range of calf motion. Calf raises help perfect your balance. Try jump turns to work your core at the same time. Start with your legs bent at a 90-degree angle, back straight, and your arms in front of you. Straighten your legs and jump straight in the air. When you’re in midair, turn your body 180 degrees so you’re facing the opposite direction. Go back down into the starting position when you land and jump again immediately, turning back towards the way you were originally facing. Repeat the workout for 3 sets of 20 jumps. To make the jump turn easier, rotate your body 90-degrees instead of 180. This exercise helps strengthen your legs and keeps your core flexible. Increasing Cardio Endurance Practice cardio 2-3 days each week to stay in shape for snowboarding. Aim to get your heart rate between 120-150 beats per minute for a healthy cardio workout. Try to make your cardio routine last 45-50 minutes each day to keep your endurance up. Cardio helps keep you from getting fatigued while you’re snowboarding. You can do cardio and another workout of your choice on the same day. Go for a 20 minute run or jogoutside or on a treadmill. Start at a comfortable pace that you can maintain for the full 20 minutes. When the run feels easy at that speed, increase the speed or distance to increase your endurance. Running can also be done on an elliptical machine if you have access to one. Use a run-tracking app like Runkeeper or Strava to track your distance and time. Ride a bike for 5 miles (8 km) if you can. Either mountain or road biking will work for your cardio exercise. Try to maintain a constant speed to get the full benefits of the workout. When you feel comfortable at a certain speed, increase the speed or distance you bike. Make sure to wear a helmet when you’re biking outdoors. You can use a stationary bike if you have access to one. Biking will help you strengthen your legs as well as your cardio. Jump rope to improve your coordination. Use a beaded or wire jump rope to get the most effective use from it. Only jump 1–2 inches (2.5–5.1 cm) off the ground as the rope passes underneath you. Spend about 15 minutes jump roping to get your heart rate up and develop endurance. Jump roping will help boost the strength in your legs as well as your cardio. Move your feet side to side as you jump to add variety to your workout. Do stair climbers for a full-body exercise. Keep your back and neck straight as you go up and down the stairs. Plant a foot on each step as you ascend and descend the staircase so you don’t trip and fall. Practice climbing stairs for 15-20 minutes at various speeds to stay active. Even taking the stairs instead of an elevator can help increase your endurance. Never run down the stairs since this causes stress to your ankles and knees.",
    "sentences": [
        " Strengthening Your Core Aim to work your core at least 2-3 days per week.",
        "Make your workout last between 45-60 minutes each session.",
        "Take at least 1 rest day in between core workouts so your muscles don’t get strained.",
        "Practice different exercises each time you work your core so you don’t fall into too much of a routine.",
        "You use your core to help turn your snowboard and to lift yourself off the ground if you fall.",
        "Hold your body in a plank position to strengthen your abs.",
        "Start on the floor on your hands and knees.",
        "Extend your legs and hold your body off the floor with your toes.",
        "Put your forearms on the ground so your elbows are at a 90-degree angle and directly below your shoulders.",
        "Keep your back straight to form a line with your body.",
        "Try to hold the position for 2 minutes.",
        "When you feel comfortable holding a plank position, try lifting one of your arms or legs into the air to activate your core even more.",
        "Do push-ups to work out your chest.",
        "Get on your hands and knees on the floor.",
        "Straighten your legs until you’re supporting your weight on your hands and toes.",
        "Keep your hands directly below your shoulders and your arms straight.",
        "Lower your body until your elbows are at a 90-degree angle.",
        "Hold the position for 1 count before pushing yourself up to the starting position.",
        "Push-ups prepare you for picking yourself up out of the snow when you’re on a snowboard.",
        "Start by doing 3 sets of 10 push-ups and increase the rep count when you feel comfortable.",
        "Keep your knees on the ground if you want to make the push-ups easier.",
        "To make the push-ups more difficult, elevate your feet on an exercise ball.",
        "Perform bicycle kicks to tighten your abs and obliques.",
        "Lay on your back with your legs fully extended and put your hands behind your head.",
        "Lift your shoulders so they’re just off the ground, being careful not to force your neck forward with your hands.",
        "Bring one of your knees so it’s above your chest while keeping the other leg extended.",
        "Twist your body so the elbow on your opposite side touches your knee.",
        "Then bring the opposite knee to your chest, twisting so your other elbow touches it.",
        "Do bicycle kicks in 30-60 second increments for 3 sets.",
        "Bicycles works the same muscles that help you stand on your snowboard from a sitting position.",
        "Work on leg raises if you have access to a pull-up bar.",
        "Hang from a pull-up bar so your arms are straight and your hands are slightly wider than your shoulders.",
        "Keep your legs straight and lift them so they’re parallel to the ground.",
        "Hold the position for 1 or 2 counts before slowly lowering your legs again.",
        "Repeat the leg raises for 15 reps.",
        "Your core will help you keep your balance on your board.",
        "Try Russian twists to work on your obliques.",
        "Lie on the ground so your back is straight, knees are bent at a 45-degree angle, and your feet are flat on the floor.",
        "Lift your upper body so it makes a V-shape with your thighs.",
        "Twist your torso to one side until you feel your muscles contract.",
        "Hold the pose for 1 count before twisting to the other side.",
        "Do 3 sets of 10 reps on each side.",
        "For a more difficult Russian twist, hold a weight plate in front of your chest while you perform the exercise.",
        "Building Your Leg Muscles Work out your legs at least twice a week.",
        "Aim to work your legs at least 30-60 minutes during each session.",
        "Spread the days you exercise your legs throughout the week so you don’t get fatigued or cramped.",
        "Practice lunges for a simple leg workout.",
        "Stand straight up and take a step forward with one leg so your knee forms a 90-degree angle.",
        "Lower your body so your opposite knee almost touches the ground.",
        "Keep your back and neck straight while performing the lunge.",
        "Return to the starting position after holding the lunge for 1 count.",
        "Repeat the lunge on the other side.",
        "Do 3 sets of 20 lunges on each side.",
        "The muscles you use during a lunge are the same ones you’ll use to walk up hills.",
        "Strengthen your hips with bridges.",
        "Lie on your back with your hands at your side.",
        "Bend your knees so your feet are underneath them and flat against the ground.",
        "Tighten your glutes and thighs to raise your hips off the ground until they form a straight line with your torso.",
        "Slowly lower your hips back onto the floor.",
        "Do 3 sets of 15-20 reps.",
        "Your hip muscles help you while you toe slide and toe turn while you’re snowboarding.",
        "Do squats to work your quads and glutes.",
        "Stand with your legs shoulder-width apart.",
        "Bend your knees until your legs form a 90-degree angle.",
        "As you lower your body, keep your back and neck straight and extend your arms forward so they’re parallel to the ground.",
        "Straighten your legs back into the starting position.",
        "Do 2 or 3 sets of 15-20 reps.\nYou’ll be squatting most of the time you spend on a snowboard, especially during heel turns and slides.",
        "To make your squats more difficult, hold a kettlebell or medicine ball in your hands.",
        "This will help work your arm muscles as well as your legs.",
        "Perform calf raises to exercise your lower legs.",
        "Start with your knees slightly bent and your arms out in front of you.",
        "Keep your feet flat on the ground and your back straight.",
        "Lift your heels and balance on your toes, and hold the calf raise for 1 or 2 counts before putting your feet back down.",
        "Perform 3 sets of 15 calf raises.",
        "Calf raises can also be done on the edge of a slightly elevated surface, such as a stair, to get a full range of calf motion.",
        "Calf raises help perfect your balance.",
        "Try jump turns to work your core at the same time.",
        "Start with your legs bent at a 90-degree angle, back straight, and your arms in front of you.",
        "Straighten your legs and jump straight in the air.",
        "When you’re in midair, turn your body 180 degrees so you’re facing the opposite direction.",
        "Go back down into the starting position when you land and jump again immediately, turning back towards the way you were originally facing.",
        "Repeat the workout for 3 sets of 20 jumps.",
        "To make the jump turn easier, rotate your body 90-degrees instead of 180.",
        "This exercise helps strengthen your legs and keeps your core flexible.",
        "Increasing Cardio Endurance Practice cardio 2-3 days each week to stay in shape for snowboarding.",
        "Aim to get your heart rate between 120-150 beats per minute for a healthy cardio workout.",
        "Try to make your cardio routine last 45-50 minutes each day to keep your endurance up.",
        "Cardio helps keep you from getting fatigued while you’re snowboarding.",
        "You can do cardio and another workout of your choice on the same day.",
        "Go for a 20 minute run or jogoutside or on a treadmill.",
        "Start at a comfortable pace that you can maintain for the full 20 minutes.",
        "When the run feels easy at that speed, increase the speed or distance to increase your endurance.",
        "Running can also be done on an elliptical machine if you have access to one.",
        "Use a run-tracking app like Runkeeper or Strava to track your distance and time.",
        "Ride a bike for 5 miles (8 km) if you can.",
        "Either mountain or road biking will work for your cardio exercise.",
        "Try to maintain a constant speed to get the full benefits of the workout.",
        "When you feel comfortable at a certain speed, increase the speed or distance you bike.",
        "Make sure to wear a helmet when you’re biking outdoors.",
        "You can use a stationary bike if you have access to one.",
        "Biking will help you strengthen your legs as well as your cardio.",
        "Jump rope to improve your coordination.",
        "Use a beaded or wire jump rope to get the most effective use from it.",
        "Only jump 1–2 inches (2.5–5.1 cm) off the ground as the rope passes underneath you.",
        "Spend about 15 minutes jump roping to get your heart rate up and develop endurance.",
        "Jump roping will help boost the strength in your legs as well as your cardio.",
        "Move your feet side to side as you jump to add variety to your workout.",
        "Do stair climbers for a full-body exercise.",
        "Keep your back and neck straight as you go up and down the stairs.",
        "Plant a foot on each step as you ascend and descend the staircase so you don’t trip and fall.",
        "Practice climbing stairs for 15-20 minutes at various speeds to stay active.",
        "Even taking the stairs instead of an elevator can help increase your endurance.",
        "Never run down the stairs since this causes stress to your ankles and knees."
    ]
}