{
    "title": "How to Measure the Density of Metals",
    "url": "https://www.wikihow.com/Measure-the-Density-of-Metals",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Physics"
    ],
    "methods": [
        {
            "name": "Measuring Density Directly",
            "steps": [
                {
                    "headline": "Determine the mass of the object.",
                    "description": "Mass is the amount of matter in an object and its unit is grams. It is measured by weighing the object directly. Place the object on an accurate scale and record the mass in your notebook. Alternatively, you can measure mass by using a balance. Place your object on one side and place weights of known mass on the other side until both sides are balanced. The total mass of the balance weights is equal to the mass of your object. Make sure object is dry so that absorbed water does not affect the accuracy of the weighing."
                },
                {
                    "headline": "Calculate the volume of the object through direct measurement.",
                    "description": "If the object is regularly shaped and uniform—such as a cylinder or rectangular prism—you can measure its dimensions with a ruler and calculate the volume with a simple equation. Measure the length and radius if it is a cylinder or length, width, and depth if it is a rectangle. Record your dimensions in millimeters or centimeters. Calculate volume using the formula for the shape of your object. For example, volume of a cylinder is length times pi times radius squared, while the volume of a rectangle is the product of length width and depth. Units of volume are centimeters cubed."
                },
                {
                    "headline": "Calculate the volume of the object using displacement.",
                    "description": "Measuring dimensions of objects that are irregularly shaped can be difficult and lead to inaccurate measurements and calculations of density. By measuring the amount of water displaced by an object, you can easily determine its volume without complex formulas. Fill a graduated cylinder with enough water to completely submerge the object, but not overflow. Record the water level of the beaker. Gently place the object in the beaker ensuring that it is fully submerged. Record the new water level of the beaker. Subtract the new water level from the starting water level. This is the volume of the object in cubic centimeters. Liquids are generally measured in milliliters however one milliliter is equal to one cubic centimeter."
                },
                {
                    "headline": "Calculate the density.",
                    "description": "Density is defined as mass divided by volume. To finish your measurement of density, divide the mass you measured by the volume you calculated. The result is the density of the metal measured in g/cm cubed. Density=Mass/Volume{\\displaystyle Density=Mass/Volume}"
                }
            ]
        },
        {
            "name": "Estimating Density with Archimedes’ Principle",
            "steps": [
                {
                    "headline": "Fill containers with liquids of known density.",
                    "description": "Choose liquids of various high and low densities. Your estimate will be more accurate if you have a number of liquids of various densities. Place your object in the different liquids to see if it sinks or floats."
                },
                {
                    "headline": "Test the object in the liquids.",
                    "description": "An object immersed in a fluid of similar density will float within the fluid. If it is less dense, it will float, but if it is more dense, it will sink. Drop your object in a fluid of known density. If it sinks, try putting it in a different fluid that is more dense. If it floats, put it in a fluid that is less dense."
                },
                {
                    "headline": "Estimate the density of your object.",
                    "description": "Archimedes’ principle states that an object submerged in a fluid will produce a buoyant force equal to the weight of fluid displaced. When your object floats within the fluid, you have found the approximate density of the object."
                }
            ]
        }
    ],
    "tyn": [
        "Scale or balance",
        "Ruler",
        "Graduate cylinder",
        "Water",
        "Calculator"
    ],
    "text": " Measuring Density Directly Determine the mass of the object. Mass is the amount of matter in an object and its unit is grams. It is measured by weighing the object directly. Place the object on an accurate scale and record the mass in your notebook. Alternatively, you can measure mass by using a balance. Place your object on one side and place weights of known mass on the other side until both sides are balanced. The total mass of the balance weights is equal to the mass of your object. Make sure object is dry so that absorbed water does not affect the accuracy of the weighing. Calculate the volume of the object through direct measurement. If the object is regularly shaped and uniform—such as a cylinder or rectangular prism—you can measure its dimensions with a ruler and calculate the volume with a simple equation. Measure the length and radius if it is a cylinder or length, width, and depth if it is a rectangle. Record your dimensions in millimeters or centimeters. Calculate volume using the formula for the shape of your object. For example, volume of a cylinder is length times pi times radius squared, while the volume of a rectangle is the product of length width and depth. Units of volume are centimeters cubed. Calculate the volume of the object using displacement. Measuring dimensions of objects that are irregularly shaped can be difficult and lead to inaccurate measurements and calculations of density. By measuring the amount of water displaced by an object, you can easily determine its volume without complex formulas. Fill a graduated cylinder with enough water to completely submerge the object, but not overflow. Record the water level of the beaker. Gently place the object in the beaker ensuring that it is fully submerged. Record the new water level of the beaker. Subtract the new water level from the starting water level. This is the volume of the object in cubic centimeters. Liquids are generally measured in milliliters however one milliliter is equal to one cubic centimeter. Calculate the density. Density is defined as mass divided by volume. To finish your measurement of density, divide the mass you measured by the volume you calculated. The result is the density of the metal measured in g/cm cubed. Density=Mass/Volume{\\displaystyle Density=Mass/Volume} Estimating Density with Archimedes’ Principle Fill containers with liquids of known density. Choose liquids of various high and low densities. Your estimate will be more accurate if you have a number of liquids of various densities. Place your object in the different liquids to see if it sinks or floats. Test the object in the liquids. An object immersed in a fluid of similar density will float within the fluid. If it is less dense, it will float, but if it is more dense, it will sink. Drop your object in a fluid of known density. If it sinks, try putting it in a different fluid that is more dense. If it floats, put it in a fluid that is less dense. Estimate the density of your object. Archimedes’ principle states that an object submerged in a fluid will produce a buoyant force equal to the weight of fluid displaced. When your object floats within the fluid, you have found the approximate density of the object.",
    "sentences": [
        " Measuring Density Directly Determine the mass of the object.",
        "Mass is the amount of matter in an object and its unit is grams.",
        "It is measured by weighing the object directly.",
        "Place the object on an accurate scale and record the mass in your notebook.",
        "Alternatively, you can measure mass by using a balance.",
        "Place your object on one side and place weights of known mass on the other side until both sides are balanced.",
        "The total mass of the balance weights is equal to the mass of your object.",
        "Make sure object is dry so that absorbed water does not affect the accuracy of the weighing.",
        "Calculate the volume of the object through direct measurement.",
        "If the object is regularly shaped and uniform—such as a cylinder or rectangular prism—you can measure its dimensions with a ruler and calculate the volume with a simple equation.",
        "Measure the length and radius if it is a cylinder or length, width, and depth if it is a rectangle.",
        "Record your dimensions in millimeters or centimeters.",
        "Calculate volume using the formula for the shape of your object.",
        "For example, volume of a cylinder is length times pi times radius squared, while the volume of a rectangle is the product of length width and depth.",
        "Units of volume are centimeters cubed.",
        "Calculate the volume of the object using displacement.",
        "Measuring dimensions of objects that are irregularly shaped can be difficult and lead to inaccurate measurements and calculations of density.",
        "By measuring the amount of water displaced by an object, you can easily determine its volume without complex formulas.",
        "Fill a graduated cylinder with enough water to completely submerge the object, but not overflow.",
        "Record the water level of the beaker.",
        "Gently place the object in the beaker ensuring that it is fully submerged.",
        "Record the new water level of the beaker.",
        "Subtract the new water level from the starting water level.",
        "This is the volume of the object in cubic centimeters.",
        "Liquids are generally measured in milliliters however one milliliter is equal to one cubic centimeter.",
        "Calculate the density.",
        "Density is defined as mass divided by volume.",
        "To finish your measurement of density, divide the mass you measured by the volume you calculated.",
        "The result is the density of the metal measured in g/cm cubed.",
        "Density=Mass/Volume{\\displaystyle Density=Mass/Volume} Estimating Density with Archimedes’ Principle Fill containers with liquids of known density.",
        "Choose liquids of various high and low densities.",
        "Your estimate will be more accurate if you have a number of liquids of various densities.",
        "Place your object in the different liquids to see if it sinks or floats.",
        "Test the object in the liquids.",
        "An object immersed in a fluid of similar density will float within the fluid.",
        "If it is less dense, it will float, but if it is more dense, it will sink.",
        "Drop your object in a fluid of known density.",
        "If it sinks, try putting it in a different fluid that is more dense.",
        "If it floats, put it in a fluid that is less dense.",
        "Estimate the density of your object.",
        "Archimedes’ principle states that an object submerged in a fluid will produce a buoyant force equal to the weight of fluid displaced.",
        "When your object floats within the fluid, you have found the approximate density of the object."
    ]
}