{
    "title": "How to Install Formica",
    "url": "https://www.wikihow.com/Install-Formica",
    "category_hierarchy": [
        "Home and Garden",
        "Furniture"
    ],
    "methods": [
        {
            "name": "Preparing the Formica",
            "steps": [
                {
                    "headline": "Select the correct Formica or other laminate for your project.",
                    "description": "Most places that sell laminate will provide sample chips for you to take home and compare to the house's color scheme. Take several of these home and test for additional properties to help you decide. Also keep in mind that you can purchase formed laminate to fit your counter if you do not wish to do the sawing yourself. A matte finish will hide wear and tear better than a glossy laminate, which is easily scratched, but may require more cleaning. Laminates come in a whole spectrum from the most glossy to the most matte, so consider each chip by its appearance, and not its marketing. Test how well the laminate stands up to wear and tear by scratching it with a steak knife. If you're applying a thin laminate sheet, use 1/16\" (0.16 cm) thick laminate for flat work surfaces and 1/32\" (0.3 cm) sheets for vertical surfaces."
                },
                {
                    "headline": "Lightly sand the surface on which you will install the Formica.",
                    "description": "Sand the surface to create a rough surface for solid adherence, and wipe away sawdust with a tack cloth or damp rag. If the surface is covered by paint or varnish, you should sand thoroughly to remove it using coarse or medium coarse sandpaper."
                },
                {
                    "headline": "Measure the length and width of the areas where you will install Formica.",
                    "description": "Use a tape measure to get an accurate measurement of each dimension of the area. If you are installing a full countertop and your walls are not at perfect right angles, you should scribe the Formica first. See Troubleshooting for more information."
                },
                {
                    "headline": "Place the Formica on a flat, stable surface.",
                    "description": "This should be large enough to keep the Formica steady while cutting. Use scrap plywood or similar material that you don't mind damaging with the saw. Don't cut on concrete or another surface that will damage the saw blade."
                },
                {
                    "headline": "Mark the measurements on the back of the Formica sheet, adding 1 inch (2.5 cm) to each measurement.",
                    "description": "Draw your cut lines onto the laminate at the increased measurement, which ensures you don't waste a large piece of laminate due to cutting too small a piece."
                },
                {
                    "headline": "Apply masking tape along the lines.",
                    "description": "This makes it easier to see where to cut, while also reducing the risk of chips. You can also apply additional tape to the surface beneath the formica to protect it, but you shouldn't cut over a surface you want to keep presentable."
                },
                {
                    "headline": "Cut the Formica along straight lines.",
                    "description": "Ideally, you should use a circular saw, saber saw, back saw, table saw, or laminate shears. A handsaw with at least 10 teeth per inch (4 per cm) will also work, but may be tedious for larger jobs. Use a metal straightedge to ensure a straight cut. If you don't have a saw, use a craft utility knife with a laminate cutting blade to score the laminate sheet, and then snap it on the scoring by lifting the smaller piece until it snaps. Use a straightedge to keep your score straight. Lift carefully and keep an eye on the score to make sure the laminate bends at the desired break point. Do not use these tools to make circular cuts. Cut out the laminate piece in straight lines, taking care not to cut into the marked area."
                },
                {
                    "headline": "Use a different tool to make curved adjustments (if applicable).",
                    "description": "If your installation place is curved, you'll need to use a jigsaw or laminate router to make these finer adjustments. The cutting tool you used earlier will have trouble turning along a curve, resulting in laminate that won't fit."
                }
            ]
        },
        {
            "name": "Installing the Formica",
            "steps": [
                {
                    "headline": "Apply contact cement to the edge strip and the surface it will attach to (if applicable).",
                    "description": "If you are installing laminate on a countertop or other surface with edges, begin with the edge pieces. If you cut them from the laminate yourself, apply the contact cement with a brush or roller to both surfaces. Allow it to set until it feels tacky, according to the manufacturer's directions. If you are using pre-glued end caps, all you need to do is heat a clothes iron, place the laminate against the edge, and iron back and forth. Let sit for one minute and gently tap it along its length with a rubber mallet or shoe heel. You can now skip to Trim the edge strip."
                },
                {
                    "headline": "Align the edge strip to the surface carefully.",
                    "description": "When you are sure you have it placed properly, press it to the surface. Once the two surfaces come into contact, the contact cement is already bonded to 50% or more of its final strength."
                },
                {
                    "headline": "Press the Formica with a roller.",
                    "description": "Push a dry roller back and forth across the laminate to adhere it completely and to remove air from between the laminate and the surface."
                },
                {
                    "headline": "Trim the edge strip (if applicable).",
                    "description": "Use a fine file to remove the excess material, applying pressure only on the up strokes. You may use a laminate trimmer or router instead, but if you do you should lubricate the edge with petroleum jelly (Vaseline) first. This minimizes the chance of breakage. Use a carbide drill bit when trimming laminate."
                },
                {
                    "headline": "Cover the trimmed edges with painter's tape.",
                    "description": "Before continuing, protect your finished edges while you install the remainder of the laminate sheet."
                },
                {
                    "headline": "Spread contact cement on the surface and the Formica with a paintbrush or roller.",
                    "description": "Allow it to set according to manufacturer's instructions. As a general rule, the contact cement should be left until it becomes tacky and dry to the touch, but no longer. 'Note: If your Formica came with an adhesive already attached, follow the manufacturer's instructions to activate it before installing. Often, these adhesives activate when moistened with water."
                },
                {
                    "headline": "Align the surface carefully using dowels.",
                    "description": "Place lengths of 1/4-inch thick (.64 cm) or larger dowels every 10 to 12 inches (25 to 30 cm) apart across the surface to prevent accidental misalignment. These should lay flat across the full width of the surface to hold the laminate up until it is aligned. When applying laminate to vertical surfaces, you will need to position them by hand."
                },
                {
                    "headline": "Position the laminate sheet and press it one area at a time.",
                    "description": "Align the laminate as accurately as you can, then continue to adjust it as you move from one end of the surface to the other. Shift the dowels out of the way once you've aligned each section, then press it down to adhere it to the surface."
                },
                {
                    "headline": "Roll over the installed laminate.",
                    "description": "Push a roller across the sheet to eliminate air pockets and strengthen the contact bond."
                },
                {
                    "headline": "Trim and shape the edges with a laminate trimmer or other router.",
                    "description": "Use a flush trim carbide drill bit. Stop frequently to allow the router to cool, as the laminate will melt if exposed to high heat."
                },
                {
                    "headline": "File down the sharp edge.",
                    "description": "Use a fine wood file to methodically file down the sharp edge of the laminate. File downward at an angle along the entire edge."
                }
            ]
        },
        {
            "name": "Troubleshooting and Additional Installations",
            "steps": [
                {
                    "headline": "Before installing, scribe your countertop to adjust it if it won't fit.",
                    "description": "If your walls are not at right angles, place your countertop against the wall as closely as you can, then use a compass and sander to adjust the shape:\nCheck that the countertop is level using a plumb bob or level. Slide shims or wedges beneath the countertop to make it level if necessary. Hold the non-pencil end of the compass against the wall at the widest gap, and touch the pencil end against the countertop. Move the compass along the length of the wall to draw a line on your counter. Clamp the countertop onto a sawhorse or other secure position, then use a sander or block plane to level the countertop up to the pencil line. Your countertop should now fit snugly against the wall."
                },
                {
                    "headline": "Install angled edges of Formica using miter bolts and sealant.",
                    "description": "For L-shaped countertops, Formica typically comes precut with angles of either 45º or 22.5º. Attach these diagonal pieces together with miter bolts after aligning their front edge. Apply a bead of sealant or laminate caulk to ensure a waterproof corner. Do not over tighten the miter bolts. Only tighten enough to keep the pieces in place. Tap down one piece of laminate with a rubber mallet or shoe heel if the surface is not level across the diagonal."
                },
                {
                    "headline": "Consider whether to install a laminate backsplash.",
                    "description": "A backsplash is a vertical section of material above the countertop, which protects the wall from stains and other kitchen accidents. If your wall is drywall, you'll need to attach a particle board base before adhering the laminate. You could also consider installing a tile backsplash over your laminate counter."
                },
                {
                    "headline": "Apply a laminate backsplash the same way you applied your counter.",
                    "description": "Once it's aligned against the wall with contact cement, roll it flat and trim excess or uneven edges with a router."
                },
                {
                    "headline": "Cut holes for appliances.",
                    "description": "Always follow the appliance manufacturer's instructions to determine safe placement on your countertop. Use a jigsaw to cut out the hole, and file down the sharp edges afterward. Cover the edges of a rangetop cutout with two layers of heat-conductive aluminum tape to prevent the Formica from melting."
                },
                {
                    "headline": "Learn how to treat your Formica.",
                    "description": "Avoid placing hot objects onto the Formica or other laminate, as the material can melt. Use a cutting board rather than cutting directly onto it. Clean with a damp cloth and a mild household cleaner."
                },
                {
                    "headline": "Remove Formica carefully by prying it off the base.",
                    "description": "Always wear eye protection and ear plugs, as removing Formica is a loud, time consuming process that creates dust and sharp particles. Use the sharp end of a hammer or other prying tool to pull the Formica off the countertop in pieces. Use gloves when handling the sharp, broken Formica. Be careful not to dent the plywood or particle board base beneath the Formica if you wish to install a new countertop on top of it."
                }
            ]
        }
    ],
    "tyn": [
        "Sandpaper",
        "Tack cloth or damp rag",
        "Formica or other laminate product",
        "Tape measure",
        "Pencil",
        "Painter's tape or masking tape",
        "Metal ruler or straightedge",
        "Saw or utility knife (see instructions for ideal saw types)",
        "Contact cement",
        "Small brush or paint roller (depending on amount of laminate)",
        "J-Roller",
        "Dowels",
        "Wood file",
        "Laminate trimmer or router with carbide drill bit"
    ],
    "text": " Preparing the Formica Select the correct Formica or other laminate for your project. Most places that sell laminate will provide sample chips for you to take home and compare to the house's color scheme. Take several of these home and test for additional properties to help you decide. Also keep in mind that you can purchase formed laminate to fit your counter if you do not wish to do the sawing yourself. A matte finish will hide wear and tear better than a glossy laminate, which is easily scratched, but may require more cleaning. Laminates come in a whole spectrum from the most glossy to the most matte, so consider each chip by its appearance, and not its marketing. Test how well the laminate stands up to wear and tear by scratching it with a steak knife. If you're applying a thin laminate sheet, use 1/16\" (0.16 cm) thick laminate for flat work surfaces and 1/32\" (0.3 cm) sheets for vertical surfaces. Lightly sand the surface on which you will install the Formica. Sand the surface to create a rough surface for solid adherence, and wipe away sawdust with a tack cloth or damp rag. If the surface is covered by paint or varnish, you should sand thoroughly to remove it using coarse or medium coarse sandpaper. Measure the length and width of the areas where you will install Formica. Use a tape measure to get an accurate measurement of each dimension of the area. If you are installing a full countertop and your walls are not at perfect right angles, you should scribe the Formica first. See Troubleshooting for more information. Place the Formica on a flat, stable surface. This should be large enough to keep the Formica steady while cutting. Use scrap plywood or similar material that you don't mind damaging with the saw. Don't cut on concrete or another surface that will damage the saw blade. Mark the measurements on the back of the Formica sheet, adding 1 inch (2.5 cm) to each measurement. Draw your cut lines onto the laminate at the increased measurement, which ensures you don't waste a large piece of laminate due to cutting too small a piece. Apply masking tape along the lines. This makes it easier to see where to cut, while also reducing the risk of chips. You can also apply additional tape to the surface beneath the formica to protect it, but you shouldn't cut over a surface you want to keep presentable. Cut the Formica along straight lines. Ideally, you should use a circular saw, saber saw, back saw, table saw, or laminate shears. A handsaw with at least 10 teeth per inch (4 per cm) will also work, but may be tedious for larger jobs. Use a metal straightedge to ensure a straight cut. If you don't have a saw, use a craft utility knife with a laminate cutting blade to score the laminate sheet, and then snap it on the scoring by lifting the smaller piece until it snaps. Use a straightedge to keep your score straight. Lift carefully and keep an eye on the score to make sure the laminate bends at the desired break point. Do not use these tools to make circular cuts. Cut out the laminate piece in straight lines, taking care not to cut into the marked area. Use a different tool to make curved adjustments (if applicable). If your installation place is curved, you'll need to use a jigsaw or laminate router to make these finer adjustments. The cutting tool you used earlier will have trouble turning along a curve, resulting in laminate that won't fit. Installing the Formica Apply contact cement to the edge strip and the surface it will attach to (if applicable). If you are installing laminate on a countertop or other surface with edges, begin with the edge pieces. If you cut them from the laminate yourself, apply the contact cement with a brush or roller to both surfaces. Allow it to set until it feels tacky, according to the manufacturer's directions. If you are using pre-glued end caps, all you need to do is heat a clothes iron, place the laminate against the edge, and iron back and forth. Let sit for one minute and gently tap it along its length with a rubber mallet or shoe heel. You can now skip to Trim the edge strip. Align the edge strip to the surface carefully. When you are sure you have it placed properly, press it to the surface. Once the two surfaces come into contact, the contact cement is already bonded to 50% or more of its final strength. Press the Formica with a roller. Push a dry roller back and forth across the laminate to adhere it completely and to remove air from between the laminate and the surface. Trim the edge strip (if applicable). Use a fine file to remove the excess material, applying pressure only on the up strokes. You may use a laminate trimmer or router instead, but if you do you should lubricate the edge with petroleum jelly (Vaseline) first. This minimizes the chance of breakage. Use a carbide drill bit when trimming laminate. Cover the trimmed edges with painter's tape. Before continuing, protect your finished edges while you install the remainder of the laminate sheet. Spread contact cement on the surface and the Formica with a paintbrush or roller. Allow it to set according to manufacturer's instructions. As a general rule, the contact cement should be left until it becomes tacky and dry to the touch, but no longer. 'Note: If your Formica came with an adhesive already attached, follow the manufacturer's instructions to activate it before installing. Often, these adhesives activate when moistened with water. Align the surface carefully using dowels. Place lengths of 1/4-inch thick (.64 cm) or larger dowels every 10 to 12 inches (25 to 30 cm) apart across the surface to prevent accidental misalignment. These should lay flat across the full width of the surface to hold the laminate up until it is aligned. When applying laminate to vertical surfaces, you will need to position them by hand. Position the laminate sheet and press it one area at a time. Align the laminate as accurately as you can, then continue to adjust it as you move from one end of the surface to the other. Shift the dowels out of the way once you've aligned each section, then press it down to adhere it to the surface. Roll over the installed laminate. Push a roller across the sheet to eliminate air pockets and strengthen the contact bond. Trim and shape the edges with a laminate trimmer or other router. Use a flush trim carbide drill bit. Stop frequently to allow the router to cool, as the laminate will melt if exposed to high heat. File down the sharp edge. Use a fine wood file to methodically file down the sharp edge of the laminate. File downward at an angle along the entire edge. Troubleshooting and Additional Installations Before installing, scribe your countertop to adjust it if it won't fit. If your walls are not at right angles, place your countertop against the wall as closely as you can, then use a compass and sander to adjust the shape:\nCheck that the countertop is level using a plumb bob or level. Slide shims or wedges beneath the countertop to make it level if necessary. Hold the non-pencil end of the compass against the wall at the widest gap, and touch the pencil end against the countertop. Move the compass along the length of the wall to draw a line on your counter. Clamp the countertop onto a sawhorse or other secure position, then use a sander or block plane to level the countertop up to the pencil line. Your countertop should now fit snugly against the wall. Install angled edges of Formica using miter bolts and sealant. For L-shaped countertops, Formica typically comes precut with angles of either 45º or 22.5º. Attach these diagonal pieces together with miter bolts after aligning their front edge. Apply a bead of sealant or laminate caulk to ensure a waterproof corner. Do not over tighten the miter bolts. Only tighten enough to keep the pieces in place. Tap down one piece of laminate with a rubber mallet or shoe heel if the surface is not level across the diagonal. Consider whether to install a laminate backsplash. A backsplash is a vertical section of material above the countertop, which protects the wall from stains and other kitchen accidents. If your wall is drywall, you'll need to attach a particle board base before adhering the laminate. You could also consider installing a tile backsplash over your laminate counter. Apply a laminate backsplash the same way you applied your counter. Once it's aligned against the wall with contact cement, roll it flat and trim excess or uneven edges with a router. Cut holes for appliances. Always follow the appliance manufacturer's instructions to determine safe placement on your countertop. Use a jigsaw to cut out the hole, and file down the sharp edges afterward. Cover the edges of a rangetop cutout with two layers of heat-conductive aluminum tape to prevent the Formica from melting. Learn how to treat your Formica. Avoid placing hot objects onto the Formica or other laminate, as the material can melt. Use a cutting board rather than cutting directly onto it. Clean with a damp cloth and a mild household cleaner. Remove Formica carefully by prying it off the base. Always wear eye protection and ear plugs, as removing Formica is a loud, time consuming process that creates dust and sharp particles. Use the sharp end of a hammer or other prying tool to pull the Formica off the countertop in pieces. Use gloves when handling the sharp, broken Formica. Be careful not to dent the plywood or particle board base beneath the Formica if you wish to install a new countertop on top of it.",
    "sentences": [
        " Preparing the Formica Select the correct Formica or other laminate for your project.",
        "Most places that sell laminate will provide sample chips for you to take home and compare to the house's color scheme.",
        "Take several of these home and test for additional properties to help you decide.",
        "Also keep in mind that you can purchase formed laminate to fit your counter if you do not wish to do the sawing yourself.",
        "A matte finish will hide wear and tear better than a glossy laminate, which is easily scratched, but may require more cleaning.",
        "Laminates come in a whole spectrum from the most glossy to the most matte, so consider each chip by its appearance, and not its marketing.",
        "Test how well the laminate stands up to wear and tear by scratching it with a steak knife.",
        "If you're applying a thin laminate sheet, use 1/16\" (0.16 cm) thick laminate for flat work surfaces and 1/32\" (0.3 cm) sheets for vertical surfaces.",
        "Lightly sand the surface on which you will install the Formica.",
        "Sand the surface to create a rough surface for solid adherence, and wipe away sawdust with a tack cloth or damp rag.",
        "If the surface is covered by paint or varnish, you should sand thoroughly to remove it using coarse or medium coarse sandpaper.",
        "Measure the length and width of the areas where you will install Formica.",
        "Use a tape measure to get an accurate measurement of each dimension of the area.",
        "If you are installing a full countertop and your walls are not at perfect right angles, you should scribe the Formica first.",
        "See Troubleshooting for more information.",
        "Place the Formica on a flat, stable surface.",
        "This should be large enough to keep the Formica steady while cutting.",
        "Use scrap plywood or similar material that you don't mind damaging with the saw.",
        "Don't cut on concrete or another surface that will damage the saw blade.",
        "Mark the measurements on the back of the Formica sheet, adding 1 inch (2.5 cm) to each measurement.",
        "Draw your cut lines onto the laminate at the increased measurement, which ensures you don't waste a large piece of laminate due to cutting too small a piece.",
        "Apply masking tape along the lines.",
        "This makes it easier to see where to cut, while also reducing the risk of chips.",
        "You can also apply additional tape to the surface beneath the formica to protect it, but you shouldn't cut over a surface you want to keep presentable.",
        "Cut the Formica along straight lines.",
        "Ideally, you should use a circular saw, saber saw, back saw, table saw, or laminate shears.",
        "A handsaw with at least 10 teeth per inch (4 per cm) will also work, but may be tedious for larger jobs.",
        "Use a metal straightedge to ensure a straight cut.",
        "If you don't have a saw, use a craft utility knife with a laminate cutting blade to score the laminate sheet, and then snap it on the scoring by lifting the smaller piece until it snaps.",
        "Use a straightedge to keep your score straight.",
        "Lift carefully and keep an eye on the score to make sure the laminate bends at the desired break point.",
        "Do not use these tools to make circular cuts.",
        "Cut out the laminate piece in straight lines, taking care not to cut into the marked area.",
        "Use a different tool to make curved adjustments (if applicable).",
        "If your installation place is curved, you'll need to use a jigsaw or laminate router to make these finer adjustments.",
        "The cutting tool you used earlier will have trouble turning along a curve, resulting in laminate that won't fit.",
        "Installing the Formica Apply contact cement to the edge strip and the surface it will attach to (if applicable).",
        "If you are installing laminate on a countertop or other surface with edges, begin with the edge pieces.",
        "If you cut them from the laminate yourself, apply the contact cement with a brush or roller to both surfaces.",
        "Allow it to set until it feels tacky, according to the manufacturer's directions.",
        "If you are using pre-glued end caps, all you need to do is heat a clothes iron, place the laminate against the edge, and iron back and forth.",
        "Let sit for one minute and gently tap it along its length with a rubber mallet or shoe heel.",
        "You can now skip to Trim the edge strip.",
        "Align the edge strip to the surface carefully.",
        "When you are sure you have it placed properly, press it to the surface.",
        "Once the two surfaces come into contact, the contact cement is already bonded to 50% or more of its final strength.",
        "Press the Formica with a roller.",
        "Push a dry roller back and forth across the laminate to adhere it completely and to remove air from between the laminate and the surface.",
        "Trim the edge strip (if applicable).",
        "Use a fine file to remove the excess material, applying pressure only on the up strokes.",
        "You may use a laminate trimmer or router instead, but if you do you should lubricate the edge with petroleum jelly (Vaseline) first.",
        "This minimizes the chance of breakage.",
        "Use a carbide drill bit when trimming laminate.",
        "Cover the trimmed edges with painter's tape.",
        "Before continuing, protect your finished edges while you install the remainder of the laminate sheet.",
        "Spread contact cement on the surface and the Formica with a paintbrush or roller.",
        "Allow it to set according to manufacturer's instructions.",
        "As a general rule, the contact cement should be left until it becomes tacky and dry to the touch, but no longer.",
        "'Note: If your Formica came with an adhesive already attached, follow the manufacturer's instructions to activate it before installing.",
        "Often, these adhesives activate when moistened with water.",
        "Align the surface carefully using dowels.",
        "Place lengths of 1/4-inch thick (.64 cm) or larger dowels every 10 to 12 inches (25 to 30 cm) apart across the surface to prevent accidental misalignment.",
        "These should lay flat across the full width of the surface to hold the laminate up until it is aligned.",
        "When applying laminate to vertical surfaces, you will need to position them by hand.",
        "Position the laminate sheet and press it one area at a time.",
        "Align the laminate as accurately as you can, then continue to adjust it as you move from one end of the surface to the other.",
        "Shift the dowels out of the way once you've aligned each section, then press it down to adhere it to the surface.",
        "Roll over the installed laminate.",
        "Push a roller across the sheet to eliminate air pockets and strengthen the contact bond.",
        "Trim and shape the edges with a laminate trimmer or other router.",
        "Use a flush trim carbide drill bit.",
        "Stop frequently to allow the router to cool, as the laminate will melt if exposed to high heat.",
        "File down the sharp edge.",
        "Use a fine wood file to methodically file down the sharp edge of the laminate.",
        "File downward at an angle along the entire edge.",
        "Troubleshooting and Additional Installations Before installing, scribe your countertop to adjust it if it won't fit.",
        "If your walls are not at right angles, place your countertop against the wall as closely as you can, then use a compass and sander to adjust the shape:\nCheck that the countertop is level using a plumb bob or level.",
        "Slide shims or wedges beneath the countertop to make it level if necessary.",
        "Hold the non-pencil end of the compass against the wall at the widest gap, and touch the pencil end against the countertop.",
        "Move the compass along the length of the wall to draw a line on your counter.",
        "Clamp the countertop onto a sawhorse or other secure position, then use a sander or block plane to level the countertop up to the pencil line.",
        "Your countertop should now fit snugly against the wall.",
        "Install angled edges of Formica using miter bolts and sealant.",
        "For L-shaped countertops, Formica typically comes precut with angles of either 45º or 22.5º.",
        "Attach these diagonal pieces together with miter bolts after aligning their front edge.",
        "Apply a bead of sealant or laminate caulk to ensure a waterproof corner.",
        "Do not over tighten the miter bolts.",
        "Only tighten enough to keep the pieces in place.",
        "Tap down one piece of laminate with a rubber mallet or shoe heel if the surface is not level across the diagonal.",
        "Consider whether to install a laminate backsplash.",
        "A backsplash is a vertical section of material above the countertop, which protects the wall from stains and other kitchen accidents.",
        "If your wall is drywall, you'll need to attach a particle board base before adhering the laminate.",
        "You could also consider installing a tile backsplash over your laminate counter.",
        "Apply a laminate backsplash the same way you applied your counter.",
        "Once it's aligned against the wall with contact cement, roll it flat and trim excess or uneven edges with a router.",
        "Cut holes for appliances.",
        "Always follow the appliance manufacturer's instructions to determine safe placement on your countertop.",
        "Use a jigsaw to cut out the hole, and file down the sharp edges afterward.",
        "Cover the edges of a rangetop cutout with two layers of heat-conductive aluminum tape to prevent the Formica from melting.",
        "Learn how to treat your Formica.",
        "Avoid placing hot objects onto the Formica or other laminate, as the material can melt.",
        "Use a cutting board rather than cutting directly onto it.",
        "Clean with a damp cloth and a mild household cleaner.",
        "Remove Formica carefully by prying it off the base.",
        "Always wear eye protection and ear plugs, as removing Formica is a loud, time consuming process that creates dust and sharp particles.",
        "Use the sharp end of a hammer or other prying tool to pull the Formica off the countertop in pieces.",
        "Use gloves when handling the sharp, broken Formica.",
        "Be careful not to dent the plywood or particle board base beneath the Formica if you wish to install a new countertop on top of it."
    ]
}