{
    "title": "How to Play Bumper Pool",
    "url": "https://www.wikihow.com/Play-Bumper-Pool",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Cue Sports"
    ],
    "methods": [
        {
            "name": "Play Bumper Pool",
            "steps": [
                {
                    "headline": "Prepare for play.",
                    "description": "The game is played with 2 players. There are 2 pockets on opposing sides of the bumper pool table. Each player shoots at the pocket opposite his staring position on the table."
                },
                {
                    "headline": "Set up the table.",
                    "description": "Each player gets 5 balls. One set of balls is white and the other set of balls is red. There are rows of 5 starting spots on the table. Each player places her balls on the spots on her own side of the table. Note that 1 red ball has a white dot on it and 1 white ball has a red dot on it. These spotted balls are to be placed on the middle starting spot of each player's respective starting rows. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/ef\\/Play-Bumper-Pool-Step-2Bullet1.jpg\\/v4-460px-Play-Bumper-Pool-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/ef\\/Play-Bumper-Pool-Step-2Bullet1.jpg\\/v4-760px-Play-Bumper-Pool-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":322,\"bigWidth\":760,\"bigHeight\":532.4175824175824,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Begin play.",
                    "description": "At an agreed upon count, the players simultaneously strike their spotted balls and attempt to get them into the object pocket on the other side of the table. The presence of bumpers in a cluster in the middle of the table makes a straight shot impossible, so the players must bank their balls off of the side rails of the table. To avoid having the first shots interfere with each other, both players must make their opening shots towards the table rail to the players' right."
                },
                {
                    "headline": "Determine play order.",
                    "description": "The player that placed his ball closer to the object pocket will shoot first. If both players pocketed the opening shot, they must perform another opening shot using the leftmost ball in the starting line up of balls."
                },
                {
                    "headline": "Play the game.",
                    "description": "Each player continues to shoot for as long as he can continue to pocket balls. Failure to pocket a ball on a shot passes play over to the other player. Pocket balls in the proper order. The spotted ball must be pocketed first. After pocketing the spotted ball, the other 4 balls may be pocketed in any order. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/34\\/Play-Bumper-Pool-Step-5Bullet1.jpg\\/v4-460px-Play-Bumper-Pool-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/34\\/Play-Bumper-Pool-Step-5Bullet1.jpg\\/v4-760px-Play-Bumper-Pool-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":322,\"bigWidth\":760,\"bigHeight\":532.4175824175824,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nDetermine a winner. When a player has pocketed her last ball, that player wins the game. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5f\\/Play-Bumper-Pool-Step-5Bullet2.jpg\\/v4-460px-Play-Bumper-Pool-Step-5Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5f\\/Play-Bumper-Pool-Step-5Bullet2.jpg\\/v4-760px-Play-Bumper-Pool-Step-5Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":322,\"bigWidth\":760,\"bigHeight\":532.4175824175824,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                }
            ]
        },
        {
            "name": "Assess Penalties for Improper Play",
            "steps": [
                {
                    "headline": "Pocket the spotted ball first.",
                    "description": "Playing any of the other balls before the spotted ball has been pocketed must be corrected by replacing all balls as they were before the shot. Pocketing any of the other balls before the spotted ball allows the opponent to choose any 2 of his own balls and pocket them by hand into his object pocket. Play passes to the other player."
                },
                {
                    "headline": "Keep the balls on the table.",
                    "description": "If you knock a ball off of the table, replace it in the dead center of the table, where it will be surrounded by bumpers. Play passes to the other player."
                },
                {
                    "headline": "Avoid knocking you opponent's balls off of the table.",
                    "description": "If you knock an opponent's ball off of the table, replace it in the position it was before the shot and place 1 of your own balls in the dead center of the table. Play passes to your opponent."
                },
                {
                    "headline": "Pocket your own balls rather than the opponents balls.",
                    "description": "If a player pockets an opponent's ball, it will count as a ball pocketed by the opponent."
                },
                {
                    "headline": "Pocket your balls in your own target pocket.",
                    "description": "If a player pockets a ball in the object pocket of the opponent, the opponent chooses 2 of her own balls and pockets them by hand into her own object pocket. If a player scores the last ball into the object pocket of the opponent, the player loses the game."
                }
            ]
        }
    ],
    "tyn": [
        "Bumper pool table",
        "Bumper pool balls",
        "Bumper cue sticks"
    ],
    "text": " Play Bumper Pool Prepare for play. The game is played with 2 players. There are 2 pockets on opposing sides of the bumper pool table. Each player shoots at the pocket opposite his staring position on the table. Set up the table. Each player gets 5 balls. One set of balls is white and the other set of balls is red. There are rows of 5 starting spots on the table. Each player places her balls on the spots on her own side of the table. Note that 1 red ball has a white dot on it and 1 white ball has a red dot on it. These spotted balls are to be placed on the middle starting spot of each player's respective starting rows. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/ef\\/Play-Bumper-Pool-Step-2Bullet1.jpg\\/v4-460px-Play-Bumper-Pool-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/ef\\/Play-Bumper-Pool-Step-2Bullet1.jpg\\/v4-760px-Play-Bumper-Pool-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":322,\"bigWidth\":760,\"bigHeight\":532.4175824175824,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Begin play. At an agreed upon count, the players simultaneously strike their spotted balls and attempt to get them into the object pocket on the other side of the table. The presence of bumpers in a cluster in the middle of the table makes a straight shot impossible, so the players must bank their balls off of the side rails of the table. To avoid having the first shots interfere with each other, both players must make their opening shots towards the table rail to the players' right. Determine play order. The player that placed his ball closer to the object pocket will shoot first. If both players pocketed the opening shot, they must perform another opening shot using the leftmost ball in the starting line up of balls. Play the game. Each player continues to shoot for as long as he can continue to pocket balls. Failure to pocket a ball on a shot passes play over to the other player. Pocket balls in the proper order. The spotted ball must be pocketed first. After pocketing the spotted ball, the other 4 balls may be pocketed in any order. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/34\\/Play-Bumper-Pool-Step-5Bullet1.jpg\\/v4-460px-Play-Bumper-Pool-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/34\\/Play-Bumper-Pool-Step-5Bullet1.jpg\\/v4-760px-Play-Bumper-Pool-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":322,\"bigWidth\":760,\"bigHeight\":532.4175824175824,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nDetermine a winner. When a player has pocketed her last ball, that player wins the game. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5f\\/Play-Bumper-Pool-Step-5Bullet2.jpg\\/v4-460px-Play-Bumper-Pool-Step-5Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5f\\/Play-Bumper-Pool-Step-5Bullet2.jpg\\/v4-760px-Play-Bumper-Pool-Step-5Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":322,\"bigWidth\":760,\"bigHeight\":532.4175824175824,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Assess Penalties for Improper Play Pocket the spotted ball first. Playing any of the other balls before the spotted ball has been pocketed must be corrected by replacing all balls as they were before the shot. Pocketing any of the other balls before the spotted ball allows the opponent to choose any 2 of his own balls and pocket them by hand into his object pocket. Play passes to the other player. Keep the balls on the table. If you knock a ball off of the table, replace it in the dead center of the table, where it will be surrounded by bumpers. Play passes to the other player. Avoid knocking you opponent's balls off of the table. If you knock an opponent's ball off of the table, replace it in the position it was before the shot and place 1 of your own balls in the dead center of the table. Play passes to your opponent. Pocket your own balls rather than the opponents balls. If a player pockets an opponent's ball, it will count as a ball pocketed by the opponent. Pocket your balls in your own target pocket. If a player pockets a ball in the object pocket of the opponent, the opponent chooses 2 of her own balls and pockets them by hand into her own object pocket. If a player scores the last ball into the object pocket of the opponent, the player loses the game.",
    "sentences": [
        " Play Bumper Pool Prepare for play.",
        "The game is played with 2 players.",
        "There are 2 pockets on opposing sides of the bumper pool table.",
        "Each player shoots at the pocket opposite his staring position on the table.",
        "Set up the table.",
        "Each player gets 5 balls.",
        "One set of balls is white and the other set of balls is red.",
        "There are rows of 5 starting spots on the table.",
        "Each player places her balls on the spots on her own side of the table.",
        "Note that 1 red ball has a white dot on it and 1 white ball has a red dot on it.",
        "These spotted balls are to be placed on the middle starting spot of each player's respective starting rows.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/ef\\/Play-Bumper-Pool-Step-2Bullet1.jpg\\/v4-460px-Play-Bumper-Pool-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/ef\\/Play-Bumper-Pool-Step-2Bullet1.jpg\\/v4-760px-Play-Bumper-Pool-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":322,\"bigWidth\":760,\"bigHeight\":532.4175824175824,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Begin play.",
        "At an agreed upon count, the players simultaneously strike their spotted balls and attempt to get them into the object pocket on the other side of the table.",
        "The presence of bumpers in a cluster in the middle of the table makes a straight shot impossible, so the players must bank their balls off of the side rails of the table.",
        "To avoid having the first shots interfere with each other, both players must make their opening shots towards the table rail to the players' right.",
        "Determine play order.",
        "The player that placed his ball closer to the object pocket will shoot first.",
        "If both players pocketed the opening shot, they must perform another opening shot using the leftmost ball in the starting line up of balls.",
        "Play the game.",
        "Each player continues to shoot for as long as he can continue to pocket balls.",
        "Failure to pocket a ball on a shot passes play over to the other player.",
        "Pocket balls in the proper order.",
        "The spotted ball must be pocketed first.",
        "After pocketing the spotted ball, the other 4 balls may be pocketed in any order.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/34\\/Play-Bumper-Pool-Step-5Bullet1.jpg\\/v4-460px-Play-Bumper-Pool-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/34\\/Play-Bumper-Pool-Step-5Bullet1.jpg\\/v4-760px-Play-Bumper-Pool-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":322,\"bigWidth\":760,\"bigHeight\":532.4175824175824,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nDetermine a winner.",
        "When a player has pocketed her last ball, that player wins the game.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5f\\/Play-Bumper-Pool-Step-5Bullet2.jpg\\/v4-460px-Play-Bumper-Pool-Step-5Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5f\\/Play-Bumper-Pool-Step-5Bullet2.jpg\\/v4-760px-Play-Bumper-Pool-Step-5Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":322,\"bigWidth\":760,\"bigHeight\":532.4175824175824,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Assess Penalties for Improper Play Pocket the spotted ball first.",
        "Playing any of the other balls before the spotted ball has been pocketed must be corrected by replacing all balls as they were before the shot.",
        "Pocketing any of the other balls before the spotted ball allows the opponent to choose any 2 of his own balls and pocket them by hand into his object pocket.",
        "Play passes to the other player.",
        "Keep the balls on the table.",
        "If you knock a ball off of the table, replace it in the dead center of the table, where it will be surrounded by bumpers.",
        "Play passes to the other player.",
        "Avoid knocking you opponent's balls off of the table.",
        "If you knock an opponent's ball off of the table, replace it in the position it was before the shot and place 1 of your own balls in the dead center of the table.",
        "Play passes to your opponent.",
        "Pocket your own balls rather than the opponents balls.",
        "If a player pockets an opponent's ball, it will count as a ball pocketed by the opponent.",
        "Pocket your balls in your own target pocket.",
        "If a player pockets a ball in the object pocket of the opponent, the opponent chooses 2 of her own balls and pockets them by hand into her own object pocket.",
        "If a player scores the last ball into the object pocket of the opponent, the player loses the game."
    ]
}