{
    "title": "How to Check a Crochet Gauge",
    "url": "https://www.wikihow.com/Check-a-Crochet-Gauge",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet",
        "Crochet",
        "Crochet Stitches"
    ],
    "parts": [
        {
            "name": "Getting Started",
            "steps": [
                {
                    "headline": "Read the project instructions and select the correct yarn weight and hook size.",
                    "description": "Some instructions will specify a brand name and material for the yarn, but you can choose something else as long as it's the same weight. The weights are typically listed as bulky, worsted, sport, etc. Most yarns will have this written on the label, but sometimes they might have a number that correlates to the weight instead. For example:\n0: Lace\n1: Superfine or Fingering\n2: Fine or Sport\n3: Light or DK"
                },
                {
                    "headline": "Find the gauge information on the pattern.",
                    "description": "You can find this near the top of the pattern, often just below the yarn and hook recommendations. It will tell you how many rows and stitches there should be within a set of inches/centimeters. It will typically be written as:\nGauge: # stitches and # rows = 4 inches ( 10.16 centimeters)\n# stitches and # rows in single crochet = 4 inches ( 10.16 centimeters)"
                },
                {
                    "headline": "Make a foundation chain about an inch or so longer than the recommended gauge swatch.",
                    "description": "Making your square larger will help make measuring more accurate later on. For example, if the pattern calls for a 4 by 4-inch ( 10.16 centimeters) gauge swatch, your starter chain should be 5 to 6 inches (12.7 to 15.24 centimeters)."
                },
                {
                    "headline": "Crochet a square using the pattern's recommended stitch.",
                    "description": "The pattern will tell you what stitch to use for the gauge. In most cases, this will be the single crochet stitch, often written as \"scs.\" If the pattern calls for something different, such as double crochet, then you should use that instead. Again, make sure that your square is a little bit larger than what the pattern recommends."
                },
                {
                    "headline": "Block the square, if necessary.",
                    "description": "Some crochet patterns recommend that you steam or block the finished piece. You should treat the gauge piece the same way as you would the finished work. If the pattern says to steam of block the finished project, then you should do the same to the gauge piece. A simple way to block is to place a towel over your swatch, and then iron it using lots of steam. Remove the towel and let the piece cool before moving on."
                }
            ]
        },
        {
            "name": "Checking the Gauge",
            "steps": [
                {
                    "headline": "Lay your swatch down on a flat surface in a well lit area.",
                    "description": "Make sure that you can see your stitches and rows clearly. Also, make sure that the swatch lays smoothly; there should be no bumps or ripples."
                },
                {
                    "headline": "Mark out a square on your swatch using sewing pins and a tape measure.",
                    "description": "Make sure that the square inside your swatch is the same size as the gauge. For example, if the gauge is 4 by 4 inches ( 10.16 centimeters), then your square should be 4 by 4 inches (10.16 centimeters). You will count your stitches within this square."
                },
                {
                    "headline": "Count the number of stitches and rows in your swatch.",
                    "description": "If your stitches are very small, you might find it easier to count them with a pencil or knitting needle. This way, you won't accidentally count two small stitches as one stitch. Consider writing down the number of stitches and rows on a scrap of paper."
                },
                {
                    "headline": "Compare them to the pattern.",
                    "description": "In order for the gauge to be correct, the number of stitches and rows within that square must match up to the pattern's gauge. If you have too many or too few stitches/rows, then you will need to make some adjustments, and make another square."
                }
            ]
        },
        {
            "name": "Making Adjustments",
            "steps": [
                {
                    "headline": "Change the hook size if the gauge is off.",
                    "description": "Sometimes, the gauge will be off, even with the correct hook size. This is usually due to working too tightly or too loosely. A quick fix is to simply use a different sized hook. Keep making swatches and changing hook sizes until your gauge matches up with the pattern's. If your swatch has too many stitches and rows, you are crocheting too tightly. Go up a hook size. If your swatch has not enough stitches and rows, you are crocheting too loosely. Go down a hook size."
                },
                {
                    "headline": "Try making your stitches a little looser if you can't get another hook.",
                    "description": "If you are crocheting too tightly, then avoid tugging as much. This will help loosen your stitches. If you are crocheting too loosely, then work tighter by giving the yarn a slight tug after each stitch."
                },
                {
                    "headline": "Try a different yarn.",
                    "description": "Some yarns are just thinner than others, despite being the same weight. Other yarns are easier to work with, or \"stretch\" better. Try to use a yarn that is similar to the one in the pattern."
                },
                {
                    "headline": "Create another square and measure again.",
                    "description": "Keep making adjustments and squares until your gauge matches the pattern's gauge."
                }
            ]
        }
    ],
    "tyn": [
        "Yarn",
        "Crochet hook",
        "Project instructions",
        "Measuring tape or clear ruler",
        "Sewing pins",
        "Iron and towel (optional)"
    ],
    "text": " Getting Started Read the project instructions and select the correct yarn weight and hook size. Some instructions will specify a brand name and material for the yarn, but you can choose something else as long as it's the same weight. The weights are typically listed as bulky, worsted, sport, etc. Most yarns will have this written on the label, but sometimes they might have a number that correlates to the weight instead. For example:\n0: Lace\n1: Superfine or Fingering\n2: Fine or Sport\n3: Light or DK Find the gauge information on the pattern. You can find this near the top of the pattern, often just below the yarn and hook recommendations. It will tell you how many rows and stitches there should be within a set of inches/centimeters. It will typically be written as:\nGauge: # stitches and # rows = 4 inches ( 10.16 centimeters)\n# stitches and # rows in single crochet = 4 inches ( 10.16 centimeters) Make a foundation chain about an inch or so longer than the recommended gauge swatch. Making your square larger will help make measuring more accurate later on. For example, if the pattern calls for a 4 by 4-inch ( 10.16 centimeters) gauge swatch, your starter chain should be 5 to 6 inches (12.7 to 15.24 centimeters). Crochet a square using the pattern's recommended stitch. The pattern will tell you what stitch to use for the gauge. In most cases, this will be the single crochet stitch, often written as \"scs.\" If the pattern calls for something different, such as double crochet, then you should use that instead. Again, make sure that your square is a little bit larger than what the pattern recommends. Block the square, if necessary. Some crochet patterns recommend that you steam or block the finished piece. You should treat the gauge piece the same way as you would the finished work. If the pattern says to steam of block the finished project, then you should do the same to the gauge piece. A simple way to block is to place a towel over your swatch, and then iron it using lots of steam. Remove the towel and let the piece cool before moving on. Checking the Gauge Lay your swatch down on a flat surface in a well lit area. Make sure that you can see your stitches and rows clearly. Also, make sure that the swatch lays smoothly; there should be no bumps or ripples. Mark out a square on your swatch using sewing pins and a tape measure. Make sure that the square inside your swatch is the same size as the gauge. For example, if the gauge is 4 by 4 inches ( 10.16 centimeters), then your square should be 4 by 4 inches (10.16 centimeters). You will count your stitches within this square. Count the number of stitches and rows in your swatch. If your stitches are very small, you might find it easier to count them with a pencil or knitting needle. This way, you won't accidentally count two small stitches as one stitch. Consider writing down the number of stitches and rows on a scrap of paper. Compare them to the pattern. In order for the gauge to be correct, the number of stitches and rows within that square must match up to the pattern's gauge. If you have too many or too few stitches/rows, then you will need to make some adjustments, and make another square. Making Adjustments Change the hook size if the gauge is off. Sometimes, the gauge will be off, even with the correct hook size. This is usually due to working too tightly or too loosely. A quick fix is to simply use a different sized hook. Keep making swatches and changing hook sizes until your gauge matches up with the pattern's. If your swatch has too many stitches and rows, you are crocheting too tightly. Go up a hook size. If your swatch has not enough stitches and rows, you are crocheting too loosely. Go down a hook size. Try making your stitches a little looser if you can't get another hook. If you are crocheting too tightly, then avoid tugging as much. This will help loosen your stitches. If you are crocheting too loosely, then work tighter by giving the yarn a slight tug after each stitch. Try a different yarn. Some yarns are just thinner than others, despite being the same weight. Other yarns are easier to work with, or \"stretch\" better. Try to use a yarn that is similar to the one in the pattern. Create another square and measure again. Keep making adjustments and squares until your gauge matches the pattern's gauge.",
    "sentences": [
        " Getting Started Read the project instructions and select the correct yarn weight and hook size.",
        "Some instructions will specify a brand name and material for the yarn, but you can choose something else as long as it's the same weight.",
        "The weights are typically listed as bulky, worsted, sport, etc.",
        "Most yarns will have this written on the label, but sometimes they might have a number that correlates to the weight instead.",
        "For example:\n0: Lace\n1: Superfine or Fingering\n2: Fine or Sport\n3: Light or DK Find the gauge information on the pattern.",
        "You can find this near the top of the pattern, often just below the yarn and hook recommendations.",
        "It will tell you how many rows and stitches there should be within a set of inches/centimeters.",
        "It will typically be written as:\nGauge: # stitches and # rows = 4 inches ( 10.16 centimeters)\n# stitches and # rows in single crochet = 4 inches ( 10.16 centimeters) Make a foundation chain about an inch or so longer than the recommended gauge swatch.",
        "Making your square larger will help make measuring more accurate later on.",
        "For example, if the pattern calls for a 4 by 4-inch ( 10.16 centimeters) gauge swatch, your starter chain should be 5 to 6 inches (12.7 to 15.24 centimeters).",
        "Crochet a square using the pattern's recommended stitch.",
        "The pattern will tell you what stitch to use for the gauge.",
        "In most cases, this will be the single crochet stitch, often written as \"scs.\"",
        "If the pattern calls for something different, such as double crochet, then you should use that instead.",
        "Again, make sure that your square is a little bit larger than what the pattern recommends.",
        "Block the square, if necessary.",
        "Some crochet patterns recommend that you steam or block the finished piece.",
        "You should treat the gauge piece the same way as you would the finished work.",
        "If the pattern says to steam of block the finished project, then you should do the same to the gauge piece.",
        "A simple way to block is to place a towel over your swatch, and then iron it using lots of steam.",
        "Remove the towel and let the piece cool before moving on.",
        "Checking the Gauge Lay your swatch down on a flat surface in a well lit area.",
        "Make sure that you can see your stitches and rows clearly.",
        "Also, make sure that the swatch lays smoothly; there should be no bumps or ripples.",
        "Mark out a square on your swatch using sewing pins and a tape measure.",
        "Make sure that the square inside your swatch is the same size as the gauge.",
        "For example, if the gauge is 4 by 4 inches ( 10.16 centimeters), then your square should be 4 by 4 inches (10.16 centimeters).",
        "You will count your stitches within this square.",
        "Count the number of stitches and rows in your swatch.",
        "If your stitches are very small, you might find it easier to count them with a pencil or knitting needle.",
        "This way, you won't accidentally count two small stitches as one stitch.",
        "Consider writing down the number of stitches and rows on a scrap of paper.",
        "Compare them to the pattern.",
        "In order for the gauge to be correct, the number of stitches and rows within that square must match up to the pattern's gauge.",
        "If you have too many or too few stitches/rows, then you will need to make some adjustments, and make another square.",
        "Making Adjustments Change the hook size if the gauge is off.",
        "Sometimes, the gauge will be off, even with the correct hook size.",
        "This is usually due to working too tightly or too loosely.",
        "A quick fix is to simply use a different sized hook.",
        "Keep making swatches and changing hook sizes until your gauge matches up with the pattern's.",
        "If your swatch has too many stitches and rows, you are crocheting too tightly.",
        "Go up a hook size.",
        "If your swatch has not enough stitches and rows, you are crocheting too loosely.",
        "Go down a hook size.",
        "Try making your stitches a little looser if you can't get another hook.",
        "If you are crocheting too tightly, then avoid tugging as much.",
        "This will help loosen your stitches.",
        "If you are crocheting too loosely, then work tighter by giving the yarn a slight tug after each stitch.",
        "Try a different yarn.",
        "Some yarns are just thinner than others, despite being the same weight.",
        "Other yarns are easier to work with, or \"stretch\" better.",
        "Try to use a yarn that is similar to the one in the pattern.",
        "Create another square and measure again.",
        "Keep making adjustments and squares until your gauge matches the pattern's gauge."
    ]
}