{
    "title": "How to Grow Apricots",
    "url": "https://www.wikihow.com/Grow-Apricots",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Planting and Growing",
        "Growing Fruit"
    ],
    "parts": [
        {
            "name": "Preparing Seeds or a Sapling",
            "steps": [
                {
                    "headline": "Extract the pit from fully-ripe fruits.",
                    "description": "Scrub off any fruit matter with a brush and allow the surface to dry. Crack open the seed by exerting pressure on the seams with a flat tool like a board, nutcracker, or knife. Take out the almond-shaped seeds, and stratify the seed (prepare it for germination) by soaking it overnight in a container of warm water. Harvest seeds from mid- to late-season apricots. Make sure the seed comes from a fruit that is far from trees of the same genus to prevent in-breeding during pollination. You may wish to prepare several seeds, in case some of them don’t germinate."
                },
                {
                    "headline": "Germinate the seeds in a refrigerator.",
                    "description": "Squeeze damp peat moss to remove excess water, place a handful of it in a jar or plastic baggie, add the seeds, and seal the jar or bag. Place the jar in a refrigerator that is between 32 and 45 degrees Fahrenheit. Monitor daily for sprouts; when you see those, it’s time to plant the seed! It can take 4 to 6 weeks for a seed to sprout. Keep the seedlings on a sunny windowsill or under grow-lights until you are ready to pot or plant them in a garden."
                },
                {
                    "headline": "Buy a store-bought sapling (if you are not using a seed).",
                    "description": "Buy dormant, bare-root, 1-year-old trees if possible. Take the tree out of the plastic container. If the sapling comes in a burlap bag, carefully remove the bag before planting the tree. Consider using a genetic dwarf species if you have limited space in your garden. Great dwarf species include “Stark Golden Glo” and “Garden Annie.” Dwarf species will produce 1-2 bushels of fruit per year, while full-size species will produce 3-4 bushels."
                }
            ]
        },
        {
            "name": "Planting the Seed or Sapling",
            "steps": [
                {
                    "headline": "Select a location with full sun and good soil.",
                    "description": "The soil should drain well but hold on to moisture. Apricots prefer a slightly alkaline soil in the pH range of 6.5-8.0. Ensure that the area has no weeds, and does not have light or sandy soil. Avoid anywhere that has had eggplant, tomatoes, peppers, potatoes, raspberries, or strawberries growing in or near it. These crops can be a source of verticillium wilt."
                },
                {
                    "headline": "Dig a deep hole.",
                    "description": "Dig a 6 in (15 cm) hole for a germinated seedling. For saplings, the depth will vary based on the sapling’s size, but make sure it’s deep enough to at least cover the roots up to where they were covered in the container. Fill the hole with well-rotted compost and mix it thoroughly with the soil."
                },
                {
                    "headline": "Place the seed or sapling in the hole and soak thoroughly.",
                    "description": "If you are using a germinated seed, cover the seed with soil and secure a layer of screen over the area to prevent animals from digging up the seeds. If you are using a sapling, carefully spread the roots in every direction in the hole, making sure that there is no potential for root breakage. Cover it with soil up to where it was while in its container."
                },
                {
                    "headline": "Water the area often.",
                    "description": "Water once a week if you live in a cool climate, and 3 times per week if you live in a hot one."
                }
            ]
        },
        {
            "name": "Tending to Your Tree",
            "steps": [
                {
                    "headline": "Remove the screen when you see a little tree popping up.",
                    "description": "You don’t want your new tree to be stifled by its protective layer, so remove the screen when they're just starting to break through the top layer of soil. You may want to build a wire or wooden fence around your tree to help protect it from hungry animals as it grows."
                },
                {
                    "headline": "Stake the tree within its first year of life.",
                    "description": "Place a metal stake into the ground 1.5 feet (0.46 m) away on either side of the tree, and tie the center of the tree to the stakes with a soft material such as canvas straps. Metal and wire can damage the trunk. Staking when you live in a climate that is not very windy can cause fewer roots to grow. Only stake the tree if your area is prone to strong winds or if you see the tree leaning."
                },
                {
                    "headline": "Apply pesticides if insects appear.",
                    "description": "Control brown rot (fungal disease) with a Chlorothalonil spray on the branches just before bloom and after each rain during bloom, or choose the “Harglow” apricot species, which is resistant to brown rot. Use an all-purpose fruit spray on the trunk to control rose chafer, oriental fruit moths, and peach tree borers. Pollinating insects are necessary for fruit to form. You don’t want your pesticide to drive away your little helpers, so use pesticides only when insects are causing major damage to the tree. If your tree has fruit, be careful to not spray any pesticide on the fruits. Do not use sulfur-based pesticides on apricot trees. Consult your local nursery for pesticide recommendations based on your location."
                },
                {
                    "headline": "Fertilize in winter.",
                    "description": "Fertilizer (low-nitrogen, complete fertilizer) can be applied in later winter, and then once again during the fruiting period to help it cope with the added requirements of producing fruit. You don’t need fertilizer when you plant the tree, as compost does the trick during that stage of the tree’s life."
                },
                {
                    "headline": "Expect fruit in 3-4 years.",
                    "description": "Apricot blossoms are very susceptible to frost damage and may need to be protected in a garage or greenhouse during the winter."
                },
                {
                    "headline": "Thin the fruit.",
                    "description": "If you see clusters of 3 or more fruits growing close together, remove the ones that are misshapen, brown, or damaged while they are still green. Allowing the fruits enough air and light will also prevent fungal disease from spreading."
                },
                {
                    "headline": "Prune any branches or leaves that show signs of disease.",
                    "description": "“Sick” trees will have wilted blossoms, brown, hanging leaves, and fruit that is shriveled and dark (“mummified”). It may be necessary to use anti-fungal spray on the tree to prevent the spread of an infection. Also prune whenever the top of the tree looks full and green, but the bottom looks wilted and thin. This means that the tree is not getting enough sun on the bottom because the top layers are blocking it. Prune any branches that are no longer producing fruits or ones that are over 6 years old."
                },
                {
                    "headline": "Harvest your apricots.",
                    "description": "Apricots are usually ready for harvesting from midsummer through  early autumn. You’ll know when they’re ready if they’re soft, fuzzy, and fully orange."
                }
            ]
        }
    ],
    "tyn": [
        "Digging tools",
        "Compost",
        "Fertilizer",
        "Apricot bare-root tree or seeds",
        "Watering tools, such as a hose or watering can"
    ],
    "text": " Preparing Seeds or a Sapling Extract the pit from fully-ripe fruits. Scrub off any fruit matter with a brush and allow the surface to dry. Crack open the seed by exerting pressure on the seams with a flat tool like a board, nutcracker, or knife. Take out the almond-shaped seeds, and stratify the seed (prepare it for germination) by soaking it overnight in a container of warm water. Harvest seeds from mid- to late-season apricots. Make sure the seed comes from a fruit that is far from trees of the same genus to prevent in-breeding during pollination. You may wish to prepare several seeds, in case some of them don’t germinate. Germinate the seeds in a refrigerator. Squeeze damp peat moss to remove excess water, place a handful of it in a jar or plastic baggie, add the seeds, and seal the jar or bag. Place the jar in a refrigerator that is between 32 and 45 degrees Fahrenheit. Monitor daily for sprouts; when you see those, it’s time to plant the seed! It can take 4 to 6 weeks for a seed to sprout. Keep the seedlings on a sunny windowsill or under grow-lights until you are ready to pot or plant them in a garden. Buy a store-bought sapling (if you are not using a seed). Buy dormant, bare-root, 1-year-old trees if possible. Take the tree out of the plastic container. If the sapling comes in a burlap bag, carefully remove the bag before planting the tree. Consider using a genetic dwarf species if you have limited space in your garden. Great dwarf species include “Stark Golden Glo” and “Garden Annie.” Dwarf species will produce 1-2 bushels of fruit per year, while full-size species will produce 3-4 bushels. Planting the Seed or Sapling Select a location with full sun and good soil. The soil should drain well but hold on to moisture. Apricots prefer a slightly alkaline soil in the pH range of 6.5-8.0. Ensure that the area has no weeds, and does not have light or sandy soil. Avoid anywhere that has had eggplant, tomatoes, peppers, potatoes, raspberries, or strawberries growing in or near it. These crops can be a source of verticillium wilt. Dig a deep hole. Dig a 6 in (15 cm) hole for a germinated seedling. For saplings, the depth will vary based on the sapling’s size, but make sure it’s deep enough to at least cover the roots up to where they were covered in the container. Fill the hole with well-rotted compost and mix it thoroughly with the soil. Place the seed or sapling in the hole and soak thoroughly. If you are using a germinated seed, cover the seed with soil and secure a layer of screen over the area to prevent animals from digging up the seeds. If you are using a sapling, carefully spread the roots in every direction in the hole, making sure that there is no potential for root breakage. Cover it with soil up to where it was while in its container. Water the area often. Water once a week if you live in a cool climate, and 3 times per week if you live in a hot one. Tending to Your Tree Remove the screen when you see a little tree popping up. You don’t want your new tree to be stifled by its protective layer, so remove the screen when they're just starting to break through the top layer of soil. You may want to build a wire or wooden fence around your tree to help protect it from hungry animals as it grows. Stake the tree within its first year of life. Place a metal stake into the ground 1.5 feet (0.46 m) away on either side of the tree, and tie the center of the tree to the stakes with a soft material such as canvas straps. Metal and wire can damage the trunk. Staking when you live in a climate that is not very windy can cause fewer roots to grow. Only stake the tree if your area is prone to strong winds or if you see the tree leaning. Apply pesticides if insects appear. Control brown rot (fungal disease) with a Chlorothalonil spray on the branches just before bloom and after each rain during bloom, or choose the “Harglow” apricot species, which is resistant to brown rot. Use an all-purpose fruit spray on the trunk to control rose chafer, oriental fruit moths, and peach tree borers. Pollinating insects are necessary for fruit to form. You don’t want your pesticide to drive away your little helpers, so use pesticides only when insects are causing major damage to the tree. If your tree has fruit, be careful to not spray any pesticide on the fruits. Do not use sulfur-based pesticides on apricot trees. Consult your local nursery for pesticide recommendations based on your location. Fertilize in winter. Fertilizer (low-nitrogen, complete fertilizer) can be applied in later winter, and then once again during the fruiting period to help it cope with the added requirements of producing fruit. You don’t need fertilizer when you plant the tree, as compost does the trick during that stage of the tree’s life. Expect fruit in 3-4 years. Apricot blossoms are very susceptible to frost damage and may need to be protected in a garage or greenhouse during the winter. Thin the fruit. If you see clusters of 3 or more fruits growing close together, remove the ones that are misshapen, brown, or damaged while they are still green. Allowing the fruits enough air and light will also prevent fungal disease from spreading. Prune any branches or leaves that show signs of disease. “Sick” trees will have wilted blossoms, brown, hanging leaves, and fruit that is shriveled and dark (“mummified”). It may be necessary to use anti-fungal spray on the tree to prevent the spread of an infection. Also prune whenever the top of the tree looks full and green, but the bottom looks wilted and thin. This means that the tree is not getting enough sun on the bottom because the top layers are blocking it. Prune any branches that are no longer producing fruits or ones that are over 6 years old. Harvest your apricots. Apricots are usually ready for harvesting from midsummer through  early autumn. You’ll know when they’re ready if they’re soft, fuzzy, and fully orange.",
    "sentences": [
        " Preparing Seeds or a Sapling Extract the pit from fully-ripe fruits.",
        "Scrub off any fruit matter with a brush and allow the surface to dry.",
        "Crack open the seed by exerting pressure on the seams with a flat tool like a board, nutcracker, or knife.",
        "Take out the almond-shaped seeds, and stratify the seed (prepare it for germination) by soaking it overnight in a container of warm water.",
        "Harvest seeds from mid- to late-season apricots.",
        "Make sure the seed comes from a fruit that is far from trees of the same genus to prevent in-breeding during pollination.",
        "You may wish to prepare several seeds, in case some of them don’t germinate.",
        "Germinate the seeds in a refrigerator.",
        "Squeeze damp peat moss to remove excess water, place a handful of it in a jar or plastic baggie, add the seeds, and seal the jar or bag.",
        "Place the jar in a refrigerator that is between 32 and 45 degrees Fahrenheit.",
        "Monitor daily for sprouts; when you see those, it’s time to plant the seed!",
        "It can take 4 to 6 weeks for a seed to sprout.",
        "Keep the seedlings on a sunny windowsill or under grow-lights until you are ready to pot or plant them in a garden.",
        "Buy a store-bought sapling (if you are not using a seed).",
        "Buy dormant, bare-root, 1-year-old trees if possible.",
        "Take the tree out of the plastic container.",
        "If the sapling comes in a burlap bag, carefully remove the bag before planting the tree.",
        "Consider using a genetic dwarf species if you have limited space in your garden.",
        "Great dwarf species include “Stark Golden Glo” and “Garden Annie.” Dwarf species will produce 1-2 bushels of fruit per year, while full-size species will produce 3-4 bushels.",
        "Planting the Seed or Sapling Select a location with full sun and good soil.",
        "The soil should drain well but hold on to moisture.",
        "Apricots prefer a slightly alkaline soil in the pH range of 6.5-8.0.",
        "Ensure that the area has no weeds, and does not have light or sandy soil.",
        "Avoid anywhere that has had eggplant, tomatoes, peppers, potatoes, raspberries, or strawberries growing in or near it.",
        "These crops can be a source of verticillium wilt.",
        "Dig a deep hole.",
        "Dig a 6 in (15 cm) hole for a germinated seedling.",
        "For saplings, the depth will vary based on the sapling’s size, but make sure it’s deep enough to at least cover the roots up to where they were covered in the container.",
        "Fill the hole with well-rotted compost and mix it thoroughly with the soil.",
        "Place the seed or sapling in the hole and soak thoroughly.",
        "If you are using a germinated seed, cover the seed with soil and secure a layer of screen over the area to prevent animals from digging up the seeds.",
        "If you are using a sapling, carefully spread the roots in every direction in the hole, making sure that there is no potential for root breakage.",
        "Cover it with soil up to where it was while in its container.",
        "Water the area often.",
        "Water once a week if you live in a cool climate, and 3 times per week if you live in a hot one.",
        "Tending to Your Tree Remove the screen when you see a little tree popping up.",
        "You don’t want your new tree to be stifled by its protective layer, so remove the screen when they're just starting to break through the top layer of soil.",
        "You may want to build a wire or wooden fence around your tree to help protect it from hungry animals as it grows.",
        "Stake the tree within its first year of life.",
        "Place a metal stake into the ground 1.5 feet (0.46 m) away on either side of the tree, and tie the center of the tree to the stakes with a soft material such as canvas straps.",
        "Metal and wire can damage the trunk.",
        "Staking when you live in a climate that is not very windy can cause fewer roots to grow.",
        "Only stake the tree if your area is prone to strong winds or if you see the tree leaning.",
        "Apply pesticides if insects appear.",
        "Control brown rot (fungal disease) with a Chlorothalonil spray on the branches just before bloom and after each rain during bloom, or choose the “Harglow” apricot species, which is resistant to brown rot.",
        "Use an all-purpose fruit spray on the trunk to control rose chafer, oriental fruit moths, and peach tree borers.",
        "Pollinating insects are necessary for fruit to form.",
        "You don’t want your pesticide to drive away your little helpers, so use pesticides only when insects are causing major damage to the tree.",
        "If your tree has fruit, be careful to not spray any pesticide on the fruits.",
        "Do not use sulfur-based pesticides on apricot trees.",
        "Consult your local nursery for pesticide recommendations based on your location.",
        "Fertilize in winter.",
        "Fertilizer (low-nitrogen, complete fertilizer) can be applied in later winter, and then once again during the fruiting period to help it cope with the added requirements of producing fruit.",
        "You don’t need fertilizer when you plant the tree, as compost does the trick during that stage of the tree’s life.",
        "Expect fruit in 3-4 years.",
        "Apricot blossoms are very susceptible to frost damage and may need to be protected in a garage or greenhouse during the winter.",
        "Thin the fruit.",
        "If you see clusters of 3 or more fruits growing close together, remove the ones that are misshapen, brown, or damaged while they are still green.",
        "Allowing the fruits enough air and light will also prevent fungal disease from spreading.",
        "Prune any branches or leaves that show signs of disease.",
        "“Sick” trees will have wilted blossoms, brown, hanging leaves, and fruit that is shriveled and dark (“mummified”).",
        "It may be necessary to use anti-fungal spray on the tree to prevent the spread of an infection.",
        "Also prune whenever the top of the tree looks full and green, but the bottom looks wilted and thin.",
        "This means that the tree is not getting enough sun on the bottom because the top layers are blocking it.",
        "Prune any branches that are no longer producing fruits or ones that are over 6 years old.",
        "Harvest your apricots.",
        "Apricots are usually ready for harvesting from midsummer through  early autumn.",
        "You’ll know when they’re ready if they’re soft, fuzzy, and fully orange."
    ]
}