{
    "title": "How to Become an Author As a Teen",
    "url": "https://www.wikihow.com/Become-an-Author-As-a-Teen",
    "category_hierarchy": [
        "Education and Communications",
        "Writing",
        "Publishing"
    ],
    "steps": [
        {
            "headline": "Get an idea.",
            "description": "Any idea you get, jot it down quickly on some paper. It is good to consider keeping a small agenda that you can take everywhere with you, in case you get an idea. You never know when or how you will be inspired. It can be at the mall as well as at a school dance."
        },
        {
            "headline": "Try making a plot out of it.",
            "description": "Just a basic, general view of the story. If you get several ideas and want them to happen in a certain order in your book, write it down in your agenda."
        },
        {
            "headline": "Come up with your characters and their identity: full name and profession.",
            "description": "You might add them a physical description or not but it is better if you do. Not a too detailed description though, otherwise the reader won't have much to imagine."
        },
        {
            "headline": "Sit down on your computer, in a reasonably calm environment otherwise you won't be able to concentrate and will get distracted easily.",
            "description": "Open a fresh page and let the words come to you. Now that you have your plot, let your characters come to life."
        },
        {
            "headline": "Try writing at least 1000 words everyday.",
            "description": "If you are blocked try to get inspiration or just do a brainstorm on a paper. That usually helps me a lot. Write with no worries of the amount of words or the grammar. Just focus on writing."
        },
        {
            "headline": "Edit.",
            "description": "Once your story is finished are you are satisfied with the plot (this usually takes months, sometimes years depending on the length of your story), edit. Correct all spelling and grammar mistakes, using the option you have for this on your word processor. However, don't fall into the mistakes these programs  often make. Then read your story, changing all the sentences that you don't like. Polish your story over and over and over until you can no longer make it better."
        },
        {
            "headline": "You may stop at step 6 if you were writing for fun or as a hobby.",
            "description": "If you want to publish your story, you must make sure first, that your story is as perfect as it can be. The publisher won't take interest in your story if it isn't as good as it can be. Remember that age had nothing to do with your chances of getting published. If your story is good, then you have more chance than an adult who's story isn't as well written as yours. Of course you'll need your parent/guardian to accept your story getting published."
        },
        {
            "headline": "Either find a literary agent or send your story directly to the publisher.",
            "description": "Find out first what the publisher wants. Some only want a synopsis, others the first few chapters... Publishers won't look at your story if it isn't presented the way they want it to be. Remember that they get thousands of works everyday from people just like you. It is better to have a literary agent, because they know what they are doing as it is their job to find a publisher that will accept your story and help you improve it. If you decide to go with a regular publisher, accept that you won't earn as much money. However, the benefit of this option is more marketing. Be sure you don't submit your book to scams. Research, research, research! Get your book on Amazon. This is essential. Just being able to say \"search my book up on Amazon\" is easier than sharing the name of the publisher, their website, AND your book's name."
        },
        {
            "headline": "If a publisher doesn't accept your story, don't give up.",
            "description": "Send your story to many publishers and try improving your story as much as you can. And no matter how many rejection letters you get, don't give up. Even the best books get rejected dozens of times before publication."
        }
    ],
    "tyn": [
        "A small notebook (optional)",
        "A quiet room to think in",
        "Computer or Typewriter"
    ],
    "text": " Get an idea. Any idea you get, jot it down quickly on some paper. It is good to consider keeping a small agenda that you can take everywhere with you, in case you get an idea. You never know when or how you will be inspired. It can be at the mall as well as at a school dance. Try making a plot out of it. Just a basic, general view of the story. If you get several ideas and want them to happen in a certain order in your book, write it down in your agenda. Come up with your characters and their identity: full name and profession. You might add them a physical description or not but it is better if you do. Not a too detailed description though, otherwise the reader won't have much to imagine. Sit down on your computer, in a reasonably calm environment otherwise you won't be able to concentrate and will get distracted easily. Open a fresh page and let the words come to you. Now that you have your plot, let your characters come to life. Try writing at least 1000 words everyday. If you are blocked try to get inspiration or just do a brainstorm on a paper. That usually helps me a lot. Write with no worries of the amount of words or the grammar. Just focus on writing. Edit. Once your story is finished are you are satisfied with the plot (this usually takes months, sometimes years depending on the length of your story), edit. Correct all spelling and grammar mistakes, using the option you have for this on your word processor. However, don't fall into the mistakes these programs  often make. Then read your story, changing all the sentences that you don't like. Polish your story over and over and over until you can no longer make it better. You may stop at step 6 if you were writing for fun or as a hobby. If you want to publish your story, you must make sure first, that your story is as perfect as it can be. The publisher won't take interest in your story if it isn't as good as it can be. Remember that age had nothing to do with your chances of getting published. If your story is good, then you have more chance than an adult who's story isn't as well written as yours. Of course you'll need your parent/guardian to accept your story getting published. Either find a literary agent or send your story directly to the publisher. Find out first what the publisher wants. Some only want a synopsis, others the first few chapters... Publishers won't look at your story if it isn't presented the way they want it to be. Remember that they get thousands of works everyday from people just like you. It is better to have a literary agent, because they know what they are doing as it is their job to find a publisher that will accept your story and help you improve it. If you decide to go with a regular publisher, accept that you won't earn as much money. However, the benefit of this option is more marketing. Be sure you don't submit your book to scams. Research, research, research! Get your book on Amazon. This is essential. Just being able to say \"search my book up on Amazon\" is easier than sharing the name of the publisher, their website, AND your book's name. If a publisher doesn't accept your story, don't give up. Send your story to many publishers and try improving your story as much as you can. And no matter how many rejection letters you get, don't give up. Even the best books get rejected dozens of times before publication.",
    "sentences": [
        " Get an idea.",
        "Any idea you get, jot it down quickly on some paper.",
        "It is good to consider keeping a small agenda that you can take everywhere with you, in case you get an idea.",
        "You never know when or how you will be inspired.",
        "It can be at the mall as well as at a school dance.",
        "Try making a plot out of it.",
        "Just a basic, general view of the story.",
        "If you get several ideas and want them to happen in a certain order in your book, write it down in your agenda.",
        "Come up with your characters and their identity: full name and profession.",
        "You might add them a physical description or not but it is better if you do.",
        "Not a too detailed description though, otherwise the reader won't have much to imagine.",
        "Sit down on your computer, in a reasonably calm environment otherwise you won't be able to concentrate and will get distracted easily.",
        "Open a fresh page and let the words come to you.",
        "Now that you have your plot, let your characters come to life.",
        "Try writing at least 1000 words everyday.",
        "If you are blocked try to get inspiration or just do a brainstorm on a paper.",
        "That usually helps me a lot.",
        "Write with no worries of the amount of words or the grammar.",
        "Just focus on writing.",
        "Edit.",
        "Once your story is finished are you are satisfied with the plot (this usually takes months, sometimes years depending on the length of your story), edit.",
        "Correct all spelling and grammar mistakes, using the option you have for this on your word processor.",
        "However, don't fall into the mistakes these programs  often make.",
        "Then read your story, changing all the sentences that you don't like.",
        "Polish your story over and over and over until you can no longer make it better.",
        "You may stop at step 6 if you were writing for fun or as a hobby.",
        "If you want to publish your story, you must make sure first, that your story is as perfect as it can be.",
        "The publisher won't take interest in your story if it isn't as good as it can be.",
        "Remember that age had nothing to do with your chances of getting published.",
        "If your story is good, then you have more chance than an adult who's story isn't as well written as yours.",
        "Of course you'll need your parent/guardian to accept your story getting published.",
        "Either find a literary agent or send your story directly to the publisher.",
        "Find out first what the publisher wants.",
        "Some only want a synopsis, others the first few chapters... Publishers won't look at your story if it isn't presented the way they want it to be.",
        "Remember that they get thousands of works everyday from people just like you.",
        "It is better to have a literary agent, because they know what they are doing as it is their job to find a publisher that will accept your story and help you improve it.",
        "If you decide to go with a regular publisher, accept that you won't earn as much money.",
        "However, the benefit of this option is more marketing.",
        "Be sure you don't submit your book to scams.",
        "Research, research, research!",
        "Get your book on Amazon.",
        "This is essential.",
        "Just being able to say \"search my book up on Amazon\" is easier than sharing the name of the publisher, their website, AND your book's name.",
        "If a publisher doesn't accept your story, don't give up.",
        "Send your story to many publishers and try improving your story as much as you can.",
        "And no matter how many rejection letters you get, don't give up.",
        "Even the best books get rejected dozens of times before publication."
    ]
}