{
    "title": "How to Install Bed Bolts",
    "url": "https://www.wikihow.com/Install-Bed-Bolts",
    "category_hierarchy": [
        "Home and Garden",
        "Furniture",
        "Ready to Assemble Furniture"
    ],
    "methods": [
        {
            "name": "Installing Bolts with Barrel Nuts",
            "steps": [
                {
                    "headline": "Align the bedposts so the bolt holes line up.",
                    "description": "Stand the end post of your bed frame up and find the side rail that attaches to it. Many bed frames have a wooden joint or dowels on the side rail so you can easily attach the different pieces. Push the wooden joint or dowels into the end post so the pieces are loosely held together. Look at the frame’s instruction manual if you have one to check which pieces attach to one another. Try sliding the bolt through the hole on the bedpost so you can use it as a guide for attaching the side rail. Then remove it so you can put the barrel nut in place before reinserting the bolt."
                },
                {
                    "headline": "Put a barrel nut in the hole on the side rail.",
                    "description": "A barrel nut is a cylindrical fastener that has a threaded hole going through the middle of it. Look for a circular hole in the side rail near the end post and slide the nut into place. Rotate the barrel nut with a screwdriver so the hole through the middle of it lines up with the bolt hole on the end post. Barrel nuts are usually used for wooden bed frames. Most bed frames have the barrel nut inserted on the side rail, but some may have slots for them on the end post. Look at the manual for your bed frame to determine where to place the nut."
                },
                {
                    "headline": "Slide the bolt through the hole and screw it into the nut.",
                    "description": "Feed the threaded end of the bolt through the end post of your bed until it hits the barrel nut. Start screwing the bolt clockwise so it goes into the nut’s threading. Keep turning the bolt by hand until it’s tight. Don’t be forceful when inserting the bolts since you could strip the barrel nut and make the bolts loose. If the bolt doesn’t go into the nut right away, try rotating the nut so the holes are perfectly lined up."
                },
                {
                    "headline": "Turn the bolt clockwise until it’s fully tightened.",
                    "description": "Place a hex wrench on the end of your bolt and hold the nut in place with a screwdriver. Rotate the hex wrench clockwise so the bolt tightens further into the nut. Make sure the barrel nut doesn't rotate or move while you're screwing the bolt in. The barrel nut will tighten against the bed frame and hold the bolt securely in place.Tip: If you want to hide the bolt hole, buy a bed bolt cover from your local hardware store. You can find many decorative styles to match the frame."
                }
            ]
        },
        {
            "name": "Securing Bolts with Washers and Nuts",
            "steps": [
                {
                    "headline": "Line up the bolt holes on the frame pieces.",
                    "description": "Hold the end post of the bed upright with your nondominant hand while guiding the side rail with your other hand. Line up the premade holes in the side rail and the end post with one another so you can easily feed the bolt through them. Have a helper hold the other end of the side rail straight so you can easily line up the holes. Some bed frames may have a metal bracket with holes while others may have a hole through the end of the side rail. Check the frame’s manual to see where the bolts are fed into."
                },
                {
                    "headline": "Slide the bolt through the holes.",
                    "description": "Once the holes are lined up, guide the bolt through the hole in your end post and push it through to the other side. If the bolt doesn’t go all the way through, try readjusting the side rail since the holes may be misaligned. Keep holding onto the end post once the bolt is in place so it doesn’t accidentally slide out."
                },
                {
                    "headline": "Put a washer and nut on the threaded side of the bolt.",
                    "description": "Slide a washer onto the threaded end of the bolt and push it up against the frame. Then put a nut on the threaded end of the bolt next to the washer and rotate it clockwise. Keep rotating the nut until it’s touching the washer so your bolt is held securely in place. Washers and nuts work best on metal bed frames or wooden frames where a barrel nut won’t fit.Tip: If the end of the bolt is in a small area and you can’t guide the nut onto the threading easily, hold a small straightedge or ruler against the side of the nut to keep it flat so it’s easier to screw on."
                },
                {
                    "headline": "Tighten the bolt and the nut with a screwdriver and pliers.",
                    "description": "Hold the nut securely in place with a pair of pliers so it doesn’t move or rotate. Then use a screwdriver with your other hand to spin the bolt clockwise. The nut will move up the threading as you screw in the bolt and make the connection secure. Keep screwing in the bolt until you can’t turn it easily anymore. Buy a bed bolt cover if you want to hide the hole where the bolt is inserted. Bed bolt covers come in many different styles, so choose one that works best for your space."
                }
            ]
        }
    ],
    "tyn": [
        "Installing Bolts with Barrel Nuts",
        "Bed bolts",
        "Barrel nuts",
        "Screwdriver",
        "Hex wrench",
        "Securing Bolts with Washers and Nuts",
        "Washers",
        "Nuts",
        "Pliers"
    ],
    "text": " Installing Bolts with Barrel Nuts Align the bedposts so the bolt holes line up. Stand the end post of your bed frame up and find the side rail that attaches to it. Many bed frames have a wooden joint or dowels on the side rail so you can easily attach the different pieces. Push the wooden joint or dowels into the end post so the pieces are loosely held together. Look at the frame’s instruction manual if you have one to check which pieces attach to one another. Try sliding the bolt through the hole on the bedpost so you can use it as a guide for attaching the side rail. Then remove it so you can put the barrel nut in place before reinserting the bolt. Put a barrel nut in the hole on the side rail. A barrel nut is a cylindrical fastener that has a threaded hole going through the middle of it. Look for a circular hole in the side rail near the end post and slide the nut into place. Rotate the barrel nut with a screwdriver so the hole through the middle of it lines up with the bolt hole on the end post. Barrel nuts are usually used for wooden bed frames. Most bed frames have the barrel nut inserted on the side rail, but some may have slots for them on the end post. Look at the manual for your bed frame to determine where to place the nut. Slide the bolt through the hole and screw it into the nut. Feed the threaded end of the bolt through the end post of your bed until it hits the barrel nut. Start screwing the bolt clockwise so it goes into the nut’s threading. Keep turning the bolt by hand until it’s tight. Don’t be forceful when inserting the bolts since you could strip the barrel nut and make the bolts loose. If the bolt doesn’t go into the nut right away, try rotating the nut so the holes are perfectly lined up. Turn the bolt clockwise until it’s fully tightened. Place a hex wrench on the end of your bolt and hold the nut in place with a screwdriver. Rotate the hex wrench clockwise so the bolt tightens further into the nut. Make sure the barrel nut doesn't rotate or move while you're screwing the bolt in. The barrel nut will tighten against the bed frame and hold the bolt securely in place.Tip: If you want to hide the bolt hole, buy a bed bolt cover from your local hardware store. You can find many decorative styles to match the frame. Securing Bolts with Washers and Nuts Line up the bolt holes on the frame pieces. Hold the end post of the bed upright with your nondominant hand while guiding the side rail with your other hand. Line up the premade holes in the side rail and the end post with one another so you can easily feed the bolt through them. Have a helper hold the other end of the side rail straight so you can easily line up the holes. Some bed frames may have a metal bracket with holes while others may have a hole through the end of the side rail. Check the frame’s manual to see where the bolts are fed into. Slide the bolt through the holes. Once the holes are lined up, guide the bolt through the hole in your end post and push it through to the other side. If the bolt doesn’t go all the way through, try readjusting the side rail since the holes may be misaligned. Keep holding onto the end post once the bolt is in place so it doesn’t accidentally slide out. Put a washer and nut on the threaded side of the bolt. Slide a washer onto the threaded end of the bolt and push it up against the frame. Then put a nut on the threaded end of the bolt next to the washer and rotate it clockwise. Keep rotating the nut until it’s touching the washer so your bolt is held securely in place. Washers and nuts work best on metal bed frames or wooden frames where a barrel nut won’t fit.Tip: If the end of the bolt is in a small area and you can’t guide the nut onto the threading easily, hold a small straightedge or ruler against the side of the nut to keep it flat so it’s easier to screw on. Tighten the bolt and the nut with a screwdriver and pliers. Hold the nut securely in place with a pair of pliers so it doesn’t move or rotate. Then use a screwdriver with your other hand to spin the bolt clockwise. The nut will move up the threading as you screw in the bolt and make the connection secure. Keep screwing in the bolt until you can’t turn it easily anymore. Buy a bed bolt cover if you want to hide the hole where the bolt is inserted. Bed bolt covers come in many different styles, so choose one that works best for your space.",
    "sentences": [
        " Installing Bolts with Barrel Nuts Align the bedposts so the bolt holes line up.",
        "Stand the end post of your bed frame up and find the side rail that attaches to it.",
        "Many bed frames have a wooden joint or dowels on the side rail so you can easily attach the different pieces.",
        "Push the wooden joint or dowels into the end post so the pieces are loosely held together.",
        "Look at the frame’s instruction manual if you have one to check which pieces attach to one another.",
        "Try sliding the bolt through the hole on the bedpost so you can use it as a guide for attaching the side rail.",
        "Then remove it so you can put the barrel nut in place before reinserting the bolt.",
        "Put a barrel nut in the hole on the side rail.",
        "A barrel nut is a cylindrical fastener that has a threaded hole going through the middle of it.",
        "Look for a circular hole in the side rail near the end post and slide the nut into place.",
        "Rotate the barrel nut with a screwdriver so the hole through the middle of it lines up with the bolt hole on the end post.",
        "Barrel nuts are usually used for wooden bed frames.",
        "Most bed frames have the barrel nut inserted on the side rail, but some may have slots for them on the end post.",
        "Look at the manual for your bed frame to determine where to place the nut.",
        "Slide the bolt through the hole and screw it into the nut.",
        "Feed the threaded end of the bolt through the end post of your bed until it hits the barrel nut.",
        "Start screwing the bolt clockwise so it goes into the nut’s threading.",
        "Keep turning the bolt by hand until it’s tight.",
        "Don’t be forceful when inserting the bolts since you could strip the barrel nut and make the bolts loose.",
        "If the bolt doesn’t go into the nut right away, try rotating the nut so the holes are perfectly lined up.",
        "Turn the bolt clockwise until it’s fully tightened.",
        "Place a hex wrench on the end of your bolt and hold the nut in place with a screwdriver.",
        "Rotate the hex wrench clockwise so the bolt tightens further into the nut.",
        "Make sure the barrel nut doesn't rotate or move while you're screwing the bolt in.",
        "The barrel nut will tighten against the bed frame and hold the bolt securely in place.Tip: If you want to hide the bolt hole, buy a bed bolt cover from your local hardware store.",
        "You can find many decorative styles to match the frame.",
        "Securing Bolts with Washers and Nuts Line up the bolt holes on the frame pieces.",
        "Hold the end post of the bed upright with your nondominant hand while guiding the side rail with your other hand.",
        "Line up the premade holes in the side rail and the end post with one another so you can easily feed the bolt through them.",
        "Have a helper hold the other end of the side rail straight so you can easily line up the holes.",
        "Some bed frames may have a metal bracket with holes while others may have a hole through the end of the side rail.",
        "Check the frame’s manual to see where the bolts are fed into.",
        "Slide the bolt through the holes.",
        "Once the holes are lined up, guide the bolt through the hole in your end post and push it through to the other side.",
        "If the bolt doesn’t go all the way through, try readjusting the side rail since the holes may be misaligned.",
        "Keep holding onto the end post once the bolt is in place so it doesn’t accidentally slide out.",
        "Put a washer and nut on the threaded side of the bolt.",
        "Slide a washer onto the threaded end of the bolt and push it up against the frame.",
        "Then put a nut on the threaded end of the bolt next to the washer and rotate it clockwise.",
        "Keep rotating the nut until it’s touching the washer so your bolt is held securely in place.",
        "Washers and nuts work best on metal bed frames or wooden frames where a barrel nut won’t fit.Tip: If the end of the bolt is in a small area and you can’t guide the nut onto the threading easily, hold a small straightedge or ruler against the side of the nut to keep it flat so it’s easier to screw on.",
        "Tighten the bolt and the nut with a screwdriver and pliers.",
        "Hold the nut securely in place with a pair of pliers so it doesn’t move or rotate.",
        "Then use a screwdriver with your other hand to spin the bolt clockwise.",
        "The nut will move up the threading as you screw in the bolt and make the connection secure.",
        "Keep screwing in the bolt until you can’t turn it easily anymore.",
        "Buy a bed bolt cover if you want to hide the hole where the bolt is inserted.",
        "Bed bolt covers come in many different styles, so choose one that works best for your space."
    ]
}