{
    "title": "How to Draw a Tree",
    "url": "https://www.wikihow.com/Draw-a-Tree",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Drawing",
        "Drawing Geography and Nature"
    ],
    "methods": [
        {
            "name": "Drawing a Simple Tree",
            "steps": [
                {
                    "headline": "Draw a long horizontal line and the trunk of the tree first.",
                    "description": "The horizontal line will be the ground line, or the ground that your tree is growing out of. To draw the trunk, sketch 2 vertical lines coming up out of the ground line. The height and width of the trunk is up to you, but don’t make it too tall or wide or it may not look realistic."
                },
                {
                    "headline": "Add some thin branches coming out of the top of the trunk.",
                    "description": "Spread the branches out and have them going in different directions so it looks like branches on a real tree. Make sure the branches are thinner than the trunk of the tree. Don’t worry about making the branches perfect. Some of them will get covered up later when you add the leaves to your drawing."
                },
                {
                    "headline": "Draw a large circle around the branches.",
                    "description": "This will be the outline for the crown (leafy top) of your tree. The top of the circle should extend past the tips of the branches, and the bottom of the circle should line up with the top of the trunk. This circle is just an outline, so it doesn’t need to be perfect!"
                },
                {
                    "headline": "Use wavy lines to add leaves to the crown of the tree.",
                    "description": "Start by following along the circle you drew and making random, wavy lines. Then, add some wavy lines inside of the circle to give the tree dimension. Try to draw the lines in random places inside of the circle so the leaves on the tree look more realistic."
                },
                {
                    "headline": "Shade in the tree to finish your drawing.",
                    "description": "Start by shading in the trunk so that one side is darker than the other. Then, shade in the branches and the leaves, making the bottom of crown darker than the top. You can also shade around the ground line to make it look like your tree is casting a shadow. Once you finish shading your drawing, you’re finished!"
                }
            ]
        },
        {
            "name": "Sketching a Winter Tree",
            "steps": [
                {
                    "headline": "Draw a trunk with 3 large circles on top of it.",
                    "description": "To make the trunk, draw 2 vertical lines next to each other that taper in toward the top. When you draw the 3 circles, put 2 on the bottom 1 on the top. Try to make the circles around the same size, but they don’t need to be perfect. You’ll just be using them as a guide when you add the branches to the tree later on."
                },
                {
                    "headline": "Add 2-3 large branches coming up off the trunk.",
                    "description": "These will be the big, supporting branches of the tree. To draw a branch, draw 2 parallel lines coming up off the top of the trunk and have them taper in at the end so they meet at a point. Make sure the branches are inside of the circles you drew earlier. Have the branches go in different directions so your tree looks more realistic."
                },
                {
                    "headline": "Draw small branches coming off of the large branches.",
                    "description": "To make these branches, you can just draw thin lines coming off of the large branches of the tree. Extend these branches so they hit the edges of the circles you drew on top the trunk. The branches at the bottom of the tree should extend further than the branches at the top. Draw wavy, irregular lines to make the branches since perfectly straight lines won’t look realistic."
                },
                {
                    "headline": "Erase the 3 circles you drew earlier.",
                    "description": "Now that you’ve added the branches, you don’t need the circles as a guide anymore. Be careful erasing so you don’t accidentally erase the branches you drew!"
                },
                {
                    "headline": "Finish your drawing by shading in the trunk and branches.",
                    "description": "Shade the tree so that one side of the trunk and branches is lighter than the other. That way it will look like the sun is shining on the tree. You can also add the ground that the tree is growing out of by shading in the area underneath the tree."
                }
            ]
        },
        {
            "name": "Making a Pine Tree",
            "steps": [
                {
                    "headline": "Draw a large, tall triangle.",
                    "description": "This triangle will be the outline for your pine tree. The exact dimensions don’t matter, but make sure it’s not too short or it won’t look like a real pine tree. If you want your tree to be symmetrical, draw the triangle using a ruler."
                },
                {
                    "headline": "Make a line through the middle of the triangle and add a small stem.",
                    "description": "The line should run from the bottom of the triangle to the point at the top. To make the stem, draw a small, four-sided shape at the bottom of the triangle that tapers in at the top. You’ll be erasing the line later, so don’t worry about making it perfectly straight!"
                },
                {
                    "headline": "Add curved spikes on both sides of the line to make the branches.",
                    "description": "Draw the spikes so they start at the line in the center of the triangle and extend just past the side of the triangle. Make sure the spikes are curved upward since that’s how the branches on pine trees look. Try to draw an equal number of curved spikes on both sides of the triangle."
                },
                {
                    "headline": "Draw wavy lines over the spikes to make the branches more realistic.",
                    "description": "Follow along the outline of the spikes and add the wavy lines as you go. Make the waves small so they look like individual pine needles on the branches of the tree. The wavy lines don’t need to be the same on each branch. Drawing them randomly will make your tree look real!"
                },
                {
                    "headline": "Erase all of the unnecessary lines to finish your drawing.",
                    "description": "Once you’ve finished the branches, you can go back in and erase the original triangle you drew. You can also erase the line down the middle of the tree. Be careful when you’re erasing the lines so you don’t accidentally erase the branches on the tree."
                }
            ]
        }
    ],
    "tyn": [
        "Paper",
        "Pencil",
        "Eraser",
        "Sharpener"
    ],
    "text": " Drawing a Simple Tree Draw a long horizontal line and the trunk of the tree first. The horizontal line will be the ground line, or the ground that your tree is growing out of. To draw the trunk, sketch 2 vertical lines coming up out of the ground line. The height and width of the trunk is up to you, but don’t make it too tall or wide or it may not look realistic. Add some thin branches coming out of the top of the trunk. Spread the branches out and have them going in different directions so it looks like branches on a real tree. Make sure the branches are thinner than the trunk of the tree. Don’t worry about making the branches perfect. Some of them will get covered up later when you add the leaves to your drawing. Draw a large circle around the branches. This will be the outline for the crown (leafy top) of your tree. The top of the circle should extend past the tips of the branches, and the bottom of the circle should line up with the top of the trunk. This circle is just an outline, so it doesn’t need to be perfect! Use wavy lines to add leaves to the crown of the tree. Start by following along the circle you drew and making random, wavy lines. Then, add some wavy lines inside of the circle to give the tree dimension. Try to draw the lines in random places inside of the circle so the leaves on the tree look more realistic. Shade in the tree to finish your drawing. Start by shading in the trunk so that one side is darker than the other. Then, shade in the branches and the leaves, making the bottom of crown darker than the top. You can also shade around the ground line to make it look like your tree is casting a shadow. Once you finish shading your drawing, you’re finished! Sketching a Winter Tree Draw a trunk with 3 large circles on top of it. To make the trunk, draw 2 vertical lines next to each other that taper in toward the top. When you draw the 3 circles, put 2 on the bottom 1 on the top. Try to make the circles around the same size, but they don’t need to be perfect. You’ll just be using them as a guide when you add the branches to the tree later on. Add 2-3 large branches coming up off the trunk. These will be the big, supporting branches of the tree. To draw a branch, draw 2 parallel lines coming up off the top of the trunk and have them taper in at the end so they meet at a point. Make sure the branches are inside of the circles you drew earlier. Have the branches go in different directions so your tree looks more realistic. Draw small branches coming off of the large branches. To make these branches, you can just draw thin lines coming off of the large branches of the tree. Extend these branches so they hit the edges of the circles you drew on top the trunk. The branches at the bottom of the tree should extend further than the branches at the top. Draw wavy, irregular lines to make the branches since perfectly straight lines won’t look realistic. Erase the 3 circles you drew earlier. Now that you’ve added the branches, you don’t need the circles as a guide anymore. Be careful erasing so you don’t accidentally erase the branches you drew! Finish your drawing by shading in the trunk and branches. Shade the tree so that one side of the trunk and branches is lighter than the other. That way it will look like the sun is shining on the tree. You can also add the ground that the tree is growing out of by shading in the area underneath the tree. Making a Pine Tree Draw a large, tall triangle. This triangle will be the outline for your pine tree. The exact dimensions don’t matter, but make sure it’s not too short or it won’t look like a real pine tree. If you want your tree to be symmetrical, draw the triangle using a ruler. Make a line through the middle of the triangle and add a small stem. The line should run from the bottom of the triangle to the point at the top. To make the stem, draw a small, four-sided shape at the bottom of the triangle that tapers in at the top. You’ll be erasing the line later, so don’t worry about making it perfectly straight! Add curved spikes on both sides of the line to make the branches. Draw the spikes so they start at the line in the center of the triangle and extend just past the side of the triangle. Make sure the spikes are curved upward since that’s how the branches on pine trees look. Try to draw an equal number of curved spikes on both sides of the triangle. Draw wavy lines over the spikes to make the branches more realistic. Follow along the outline of the spikes and add the wavy lines as you go. Make the waves small so they look like individual pine needles on the branches of the tree. The wavy lines don’t need to be the same on each branch. Drawing them randomly will make your tree look real! Erase all of the unnecessary lines to finish your drawing. Once you’ve finished the branches, you can go back in and erase the original triangle you drew. You can also erase the line down the middle of the tree. Be careful when you’re erasing the lines so you don’t accidentally erase the branches on the tree.",
    "sentences": [
        " Drawing a Simple Tree Draw a long horizontal line and the trunk of the tree first.",
        "The horizontal line will be the ground line, or the ground that your tree is growing out of.",
        "To draw the trunk, sketch 2 vertical lines coming up out of the ground line.",
        "The height and width of the trunk is up to you, but don’t make it too tall or wide or it may not look realistic.",
        "Add some thin branches coming out of the top of the trunk.",
        "Spread the branches out and have them going in different directions so it looks like branches on a real tree.",
        "Make sure the branches are thinner than the trunk of the tree.",
        "Don’t worry about making the branches perfect.",
        "Some of them will get covered up later when you add the leaves to your drawing.",
        "Draw a large circle around the branches.",
        "This will be the outline for the crown (leafy top) of your tree.",
        "The top of the circle should extend past the tips of the branches, and the bottom of the circle should line up with the top of the trunk.",
        "This circle is just an outline, so it doesn’t need to be perfect!",
        "Use wavy lines to add leaves to the crown of the tree.",
        "Start by following along the circle you drew and making random, wavy lines.",
        "Then, add some wavy lines inside of the circle to give the tree dimension.",
        "Try to draw the lines in random places inside of the circle so the leaves on the tree look more realistic.",
        "Shade in the tree to finish your drawing.",
        "Start by shading in the trunk so that one side is darker than the other.",
        "Then, shade in the branches and the leaves, making the bottom of crown darker than the top.",
        "You can also shade around the ground line to make it look like your tree is casting a shadow.",
        "Once you finish shading your drawing, you’re finished!",
        "Sketching a Winter Tree Draw a trunk with 3 large circles on top of it.",
        "To make the trunk, draw 2 vertical lines next to each other that taper in toward the top.",
        "When you draw the 3 circles, put 2 on the bottom 1 on the top.",
        "Try to make the circles around the same size, but they don’t need to be perfect.",
        "You’ll just be using them as a guide when you add the branches to the tree later on.",
        "Add 2-3 large branches coming up off the trunk.",
        "These will be the big, supporting branches of the tree.",
        "To draw a branch, draw 2 parallel lines coming up off the top of the trunk and have them taper in at the end so they meet at a point.",
        "Make sure the branches are inside of the circles you drew earlier.",
        "Have the branches go in different directions so your tree looks more realistic.",
        "Draw small branches coming off of the large branches.",
        "To make these branches, you can just draw thin lines coming off of the large branches of the tree.",
        "Extend these branches so they hit the edges of the circles you drew on top the trunk.",
        "The branches at the bottom of the tree should extend further than the branches at the top.",
        "Draw wavy, irregular lines to make the branches since perfectly straight lines won’t look realistic.",
        "Erase the 3 circles you drew earlier.",
        "Now that you’ve added the branches, you don’t need the circles as a guide anymore.",
        "Be careful erasing so you don’t accidentally erase the branches you drew!",
        "Finish your drawing by shading in the trunk and branches.",
        "Shade the tree so that one side of the trunk and branches is lighter than the other.",
        "That way it will look like the sun is shining on the tree.",
        "You can also add the ground that the tree is growing out of by shading in the area underneath the tree.",
        "Making a Pine Tree Draw a large, tall triangle.",
        "This triangle will be the outline for your pine tree.",
        "The exact dimensions don’t matter, but make sure it’s not too short or it won’t look like a real pine tree.",
        "If you want your tree to be symmetrical, draw the triangle using a ruler.",
        "Make a line through the middle of the triangle and add a small stem.",
        "The line should run from the bottom of the triangle to the point at the top.",
        "To make the stem, draw a small, four-sided shape at the bottom of the triangle that tapers in at the top.",
        "You’ll be erasing the line later, so don’t worry about making it perfectly straight!",
        "Add curved spikes on both sides of the line to make the branches.",
        "Draw the spikes so they start at the line in the center of the triangle and extend just past the side of the triangle.",
        "Make sure the spikes are curved upward since that’s how the branches on pine trees look.",
        "Try to draw an equal number of curved spikes on both sides of the triangle.",
        "Draw wavy lines over the spikes to make the branches more realistic.",
        "Follow along the outline of the spikes and add the wavy lines as you go.",
        "Make the waves small so they look like individual pine needles on the branches of the tree.",
        "The wavy lines don’t need to be the same on each branch.",
        "Drawing them randomly will make your tree look real!",
        "Erase all of the unnecessary lines to finish your drawing.",
        "Once you’ve finished the branches, you can go back in and erase the original triangle you drew.",
        "You can also erase the line down the middle of the tree.",
        "Be careful when you’re erasing the lines so you don’t accidentally erase the branches on the tree."
    ]
}