{
    "title": "How to Work out Your Fitness Age",
    "url": "https://www.wikihow.com/Work-out-Your-Fitness-Age",
    "category_hierarchy": [
        "Sports and Fitness",
        "Personal Fitness"
    ],
    "methods": [
        {
            "name": "Steps",
            "steps": [
                {
                    "headline": "Warm up with a short walk or run before doing the tests.",
                    "description": "This will make your muscles looser and the tests more accurate. You are also less likely to injure yourself if you have warmed up."
                },
                {
                    "headline": "Place a 12 inch-high (30.4 cm) box (or something with similar measurements) at your feet with a wall behind you.",
                    "description": "You are preparing for a Sit-and-Reach test."
                },
                {
                    "headline": "Sit on the ground with your back against the wall and feet hip-width apart in front of you.",
                    "description": "Have your friend move the box so that its side is against the bottom of your feet."
                },
                {
                    "headline": "Sit up straight, place your arms out in front of you and stack your hands, 1 on top of the other.",
                    "description": "The wall can help you to sit up very straight if it is an uncomfortable position. Place the beginning of the yardstick at the tip of your outstretched hands. Have a friend tape the yardstick into place at this neutral starting position."
                },
                {
                    "headline": "Bend forward and gently reach your hands toward the yardstick.",
                    "description": "Do not use a lot of force as this could be harmful."
                },
                {
                    "headline": "Measure the tips of your fingers when you reach forward.",
                    "description": "Reach 3 times and record 3 measurements. Take the farthest reach as your flexibility measurement."
                }
            ]
        },
        {
            "name": "Cardiorespiratory Test",
            "steps": [
                {
                    "headline": "Place a 10 inch-high (25.4 cm) step in front of you.",
                    "description": "Aerobic steps are available at gym or for purchase at fitness stores or online. They are traditionally made of hard plastic. You will be doing a step aerobic activity in order to judge your heart rate."
                },
                {
                    "headline": "Prepare to step 22 times per minute if you are a woman or 24 times per minute if you are a man.",
                    "description": "Set a timer for 3 minutes and step at this rate during the allotted time. Stop if you feel dizzy at any point."
                },
                {
                    "headline": "Rest for 5 seconds after the 3 minutes of stepping.",
                    "description": ""
                },
                {
                    "headline": "Take your pulse for 15 seconds.",
                    "description": "You can take your pulse by placing your index finger over the inner wrist of the opposite hand. Count the times the blood pulses through your wrist veins in 15 seconds."
                }
            ]
        },
        {
            "name": "Body Measurement Test",
            "steps": [
                {
                    "headline": "Have a friend use a tailor's measuring tape to measure your body.",
                    "description": "The measuring tape should be soft so that it can fit around curves. You can do this yourself but it will be more accurate if someone else takes the measurements. Measure your neck and waist first."
                },
                {
                    "headline": "Measure the circumference of your hips if you are a woman.",
                    "description": "If you are a man, measure the circumference around your navel area instead."
                }
            ]
        },
        {
            "name": "Strength Test",
            "steps": [
                {
                    "headline": "Get into a comfortable position for pushups.",
                    "description": "Use a mat if possible. Women will bend their knees during this test and may want to use a towel to cushion their knees."
                },
                {
                    "headline": "Get on all fours and place your arms directly under your shoulders.",
                    "description": "You need to place your feet behind them in a standard push-up position."
                },
                {
                    "headline": "Do as many push-ups as you can without stopping.",
                    "description": "Record that number."
                }
            ]
        },
        {
            "name": "Calculate your Fitness Age",
            "steps": [
                {
                    "headline": "Search on the Internet to find a site that will measure fitness age according to the data above and your height, weight and actual age.",
                    "description": "It does take a computer to process the measurements in the way a personal trainer or gym would. There are many free programs and some that offer results for a fee. Wii Fit programs and gyms may offer this service with their fitness age programs as well."
                },
                {
                    "headline": "Use your newly calculated fitness age as a starting point for your fitness regimen.",
                    "description": "Repeat the steps after a month and see if you have improved on your scores. If you have, your fitness age will be lower."
                }
            ]
        }
    ],
    "tyn": [
        "Tape measure",
        "Mat",
        "10 inch-high (25.4 cm) step/box",
        "12 inch-high (30.4 cm) tall step/box",
        "Friend or helper to record measurements",
        "Yardstick"
    ],
    "text": " Steps Warm up with a short walk or run before doing the tests. This will make your muscles looser and the tests more accurate. You are also less likely to injure yourself if you have warmed up. Place a 12 inch-high (30.4 cm) box (or something with similar measurements) at your feet with a wall behind you. You are preparing for a Sit-and-Reach test. Sit on the ground with your back against the wall and feet hip-width apart in front of you. Have your friend move the box so that its side is against the bottom of your feet. Sit up straight, place your arms out in front of you and stack your hands, 1 on top of the other. The wall can help you to sit up very straight if it is an uncomfortable position. Place the beginning of the yardstick at the tip of your outstretched hands. Have a friend tape the yardstick into place at this neutral starting position. Bend forward and gently reach your hands toward the yardstick. Do not use a lot of force as this could be harmful. Measure the tips of your fingers when you reach forward. Reach 3 times and record 3 measurements. Take the farthest reach as your flexibility measurement. Cardiorespiratory Test Place a 10 inch-high (25.4 cm) step in front of you. Aerobic steps are available at gym or for purchase at fitness stores or online. They are traditionally made of hard plastic. You will be doing a step aerobic activity in order to judge your heart rate. Prepare to step 22 times per minute if you are a woman or 24 times per minute if you are a man. Set a timer for 3 minutes and step at this rate during the allotted time. Stop if you feel dizzy at any point. Rest for 5 seconds after the 3 minutes of stepping.  Take your pulse for 15 seconds. You can take your pulse by placing your index finger over the inner wrist of the opposite hand. Count the times the blood pulses through your wrist veins in 15 seconds. Body Measurement Test Have a friend use a tailor's measuring tape to measure your body. The measuring tape should be soft so that it can fit around curves. You can do this yourself but it will be more accurate if someone else takes the measurements. Measure your neck and waist first. Measure the circumference of your hips if you are a woman. If you are a man, measure the circumference around your navel area instead. Strength Test Get into a comfortable position for pushups. Use a mat if possible. Women will bend their knees during this test and may want to use a towel to cushion their knees. Get on all fours and place your arms directly under your shoulders. You need to place your feet behind them in a standard push-up position. Do as many push-ups as you can without stopping. Record that number. Calculate your Fitness Age Search on the Internet to find a site that will measure fitness age according to the data above and your height, weight and actual age. It does take a computer to process the measurements in the way a personal trainer or gym would. There are many free programs and some that offer results for a fee. Wii Fit programs and gyms may offer this service with their fitness age programs as well. Use your newly calculated fitness age as a starting point for your fitness regimen. Repeat the steps after a month and see if you have improved on your scores. If you have, your fitness age will be lower.",
    "sentences": [
        " Steps Warm up with a short walk or run before doing the tests.",
        "This will make your muscles looser and the tests more accurate.",
        "You are also less likely to injure yourself if you have warmed up.",
        "Place a 12 inch-high (30.4 cm) box (or something with similar measurements) at your feet with a wall behind you.",
        "You are preparing for a Sit-and-Reach test.",
        "Sit on the ground with your back against the wall and feet hip-width apart in front of you.",
        "Have your friend move the box so that its side is against the bottom of your feet.",
        "Sit up straight, place your arms out in front of you and stack your hands, 1 on top of the other.",
        "The wall can help you to sit up very straight if it is an uncomfortable position.",
        "Place the beginning of the yardstick at the tip of your outstretched hands.",
        "Have a friend tape the yardstick into place at this neutral starting position.",
        "Bend forward and gently reach your hands toward the yardstick.",
        "Do not use a lot of force as this could be harmful.",
        "Measure the tips of your fingers when you reach forward.",
        "Reach 3 times and record 3 measurements.",
        "Take the farthest reach as your flexibility measurement.",
        "Cardiorespiratory Test Place a 10 inch-high (25.4 cm) step in front of you.",
        "Aerobic steps are available at gym or for purchase at fitness stores or online.",
        "They are traditionally made of hard plastic.",
        "You will be doing a step aerobic activity in order to judge your heart rate.",
        "Prepare to step 22 times per minute if you are a woman or 24 times per minute if you are a man.",
        "Set a timer for 3 minutes and step at this rate during the allotted time.",
        "Stop if you feel dizzy at any point.",
        "Rest for 5 seconds after the 3 minutes of stepping.",
        "Take your pulse for 15 seconds.",
        "You can take your pulse by placing your index finger over the inner wrist of the opposite hand.",
        "Count the times the blood pulses through your wrist veins in 15 seconds.",
        "Body Measurement Test Have a friend use a tailor's measuring tape to measure your body.",
        "The measuring tape should be soft so that it can fit around curves.",
        "You can do this yourself but it will be more accurate if someone else takes the measurements.",
        "Measure your neck and waist first.",
        "Measure the circumference of your hips if you are a woman.",
        "If you are a man, measure the circumference around your navel area instead.",
        "Strength Test Get into a comfortable position for pushups.",
        "Use a mat if possible.",
        "Women will bend their knees during this test and may want to use a towel to cushion their knees.",
        "Get on all fours and place your arms directly under your shoulders.",
        "You need to place your feet behind them in a standard push-up position.",
        "Do as many push-ups as you can without stopping.",
        "Record that number.",
        "Calculate your Fitness Age Search on the Internet to find a site that will measure fitness age according to the data above and your height, weight and actual age.",
        "It does take a computer to process the measurements in the way a personal trainer or gym would.",
        "There are many free programs and some that offer results for a fee.",
        "Wii Fit programs and gyms may offer this service with their fitness age programs as well.",
        "Use your newly calculated fitness age as a starting point for your fitness regimen.",
        "Repeat the steps after a month and see if you have improved on your scores.",
        "If you have, your fitness age will be lower."
    ]
}