{
    "title": "How to Sight a Bow In",
    "url": "https://www.wikihow.com/Sight-a-Bow-In",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Archery"
    ],
    "methods": [
        {
            "name": "Preparing the Bow and Range",
            "steps": [
                {
                    "headline": "Set aside a few days.",
                    "description": "You will want to spread your sighting in over a few sessions. This is because fatigue will affect your accuracy and power, and your form will most likely shift. Spreading out the sighting over a few days will result in greater overall accuracy."
                },
                {
                    "headline": "Buy the sight.",
                    "description": "Bow sights come in many styles and should be chosen to meet the preferences of the archer. Bow sights are available at sporting good stores and specialized archery supply outlets. If you're just planning on hunting with the bow, you can use a simple sight that should only set you back around $40. Competition sights can cost 5 times this or more. This guide is for sighting in a fixed-pin sight. It is the most common sight and is recommended for hunting and recreation."
                },
                {
                    "headline": "Mount the sight to the bow.",
                    "description": "Follow the instructions provided with the sight for proper installation. Most sights are attached to the riser and are secured by a couple of screws. Most bows have pre-drilled holes for attaching sights. Do not overtighten the screws, as you could damage the bow. The sighting pins of the sight should be lined up vertically with the bow string. The bow sight should be at a right angle to the bow. After installing the sight, let it settle overnight. You may have to tighten it further after it settles."
                },
                {
                    "headline": "Set all sighting pin adjustments to the mid-point.",
                    "description": "This will give you maximum room for adjustment in either direction as needed. An Allen wrench, available at hardware stores, will be needed to adjust the sighting pins."
                },
                {
                    "headline": "Set up the target and mark your ranges.",
                    "description": "Ideally you will want to be able to mark off every 10 yards (9.1 m) from the target, at least up to 40 yards (36.6 m). Use a range finder if possible for accuracy. Range finders are available from hunting and outdoor supply stores. Try to use a durable target that can take a lot of arrows, as sighting in the bow can take some time and a lot of repetition."
                }
            ]
        },
        {
            "name": "Sighting It In",
            "steps": [
                {
                    "headline": "Set your 20 yard (first) pin.",
                    "description": "Move to the closest distance to the target, which is usually the 10 yard (9.1 m) mark. Stand so that your body is perpendicular to the target, and draw an arrow back with your bow. Look down the sight at the top pin and shoot your arrow at the target. Repeat with a few more arrows. Take note of where the arrows hit compared to the site. If the arrows went above what the pin was indicating, move the sight box up on the bow. Repeat this step until the arrow is not shooting above the top pin. Step back to 20 yards (18.3 m). Repeat the sighting process, raising the sight box if necessary. Once the arrows are not hitting above the top pin, you can make adjustments for arrows going too far left or right by moving the sight left and right respectively. Don't worry about perfect accuracy yet, this pin will most likely change."
                },
                {
                    "headline": "Set Your 30 yard (second) pin.",
                    "description": "Once you deem your 20 yard (18.3 m) top pin suitably accurate, you can move back to the 30 yard (27.4 m) mark on your range. Aim down the sight using the second pin and fire off a few arrows at the target. Start making the same adjustments that you made while sighting in at 20 yards (18.3 m). Remember to move the entire sight box when making adjustments at this stage. Take the time to make the 30 yard (27.4 m) pin as accurate as possible, because it will not be changing. This will be the anchor of your sight."
                },
                {
                    "headline": "Move back to 40 yards (36.6 m).",
                    "description": "Shoot arrows at the target while looking at your 40 yard (third) pin in the sight. When you make you adjustments this time, move the pin itself instead of the entire sight box. You won't be moving left and right with the sight box anymore; instead focus on making the 40 yard (36.6 m) arrow go to exactly where the pin is pointing. The distance between the 30 and 40 yard pins will be greater than the distance between the 20 and 30 yard pins. If you need to readjust your left and right sight placement, return to the 30 yard (27.4 m) marker on the range and make your adjustments there."
                },
                {
                    "headline": "Check your 20 yard (18.3 m) shot again.",
                    "description": "Once you've set the 30 yard (27.4 m) pin and made adjustments to your 40 yard (36.6 m) pin, go back and shoot at 20 yards (18.3 m) again. This time, make adjustments to the pin itself instead of the whole sight."
                },
                {
                    "headline": "Move back and sight any additional pins.",
                    "description": "Depending on your sight, you may have additional pins for 50 yards (45.7 m), 60 yards (54.9 m), and more. Move back from the target and repeat the previous steps, moving the pin to make adjustments."
                }
            ]
        }
    ],
    "tyn": [
        "Bow",
        "Bow sight",
        "Arrows",
        "Arrow target firing range",
        "Range finder or distance measuring tool",
        "Allen wrench"
    ],
    "text": " Preparing the Bow and Range Set aside a few days. You will want to spread your sighting in over a few sessions. This is because fatigue will affect your accuracy and power, and your form will most likely shift. Spreading out the sighting over a few days will result in greater overall accuracy. Buy the sight. Bow sights come in many styles and should be chosen to meet the preferences of the archer. Bow sights are available at sporting good stores and specialized archery supply outlets. If you're just planning on hunting with the bow, you can use a simple sight that should only set you back around $40. Competition sights can cost 5 times this or more. This guide is for sighting in a fixed-pin sight. It is the most common sight and is recommended for hunting and recreation. Mount the sight to the bow. Follow the instructions provided with the sight for proper installation. Most sights are attached to the riser and are secured by a couple of screws. Most bows have pre-drilled holes for attaching sights. Do not overtighten the screws, as you could damage the bow. The sighting pins of the sight should be lined up vertically with the bow string. The bow sight should be at a right angle to the bow. After installing the sight, let it settle overnight. You may have to tighten it further after it settles. Set all sighting pin adjustments to the mid-point. This will give you maximum room for adjustment in either direction as needed. An Allen wrench, available at hardware stores, will be needed to adjust the sighting pins. Set up the target and mark your ranges. Ideally you will want to be able to mark off every 10 yards (9.1 m) from the target, at least up to 40 yards (36.6 m). Use a range finder if possible for accuracy. Range finders are available from hunting and outdoor supply stores. Try to use a durable target that can take a lot of arrows, as sighting in the bow can take some time and a lot of repetition. Sighting It In Set your 20 yard (first) pin. Move to the closest distance to the target, which is usually the 10 yard (9.1 m) mark. Stand so that your body is perpendicular to the target, and draw an arrow back with your bow. Look down the sight at the top pin and shoot your arrow at the target. Repeat with a few more arrows. Take note of where the arrows hit compared to the site. If the arrows went above what the pin was indicating, move the sight box up on the bow. Repeat this step until the arrow is not shooting above the top pin. Step back to 20 yards (18.3 m). Repeat the sighting process, raising the sight box if necessary. Once the arrows are not hitting above the top pin, you can make adjustments for arrows going too far left or right by moving the sight left and right respectively. Don't worry about perfect accuracy yet, this pin will most likely change. Set Your 30 yard (second) pin. Once you deem your 20 yard (18.3 m) top pin suitably accurate, you can move back to the 30 yard (27.4 m) mark on your range. Aim down the sight using the second pin and fire off a few arrows at the target. Start making the same adjustments that you made while sighting in at 20 yards (18.3 m). Remember to move the entire sight box when making adjustments at this stage. Take the time to make the 30 yard (27.4 m) pin as accurate as possible, because it will not be changing. This will be the anchor of your sight. Move back to 40 yards (36.6 m). Shoot arrows at the target while looking at your 40 yard (third) pin in the sight. When you make you adjustments this time, move the pin itself instead of the entire sight box. You won't be moving left and right with the sight box anymore; instead focus on making the 40 yard (36.6 m) arrow go to exactly where the pin is pointing. The distance between the 30 and 40 yard pins will be greater than the distance between the 20 and 30 yard pins. If you need to readjust your left and right sight placement, return to the 30 yard (27.4 m) marker on the range and make your adjustments there. Check your 20 yard (18.3 m) shot again. Once you've set the 30 yard (27.4 m) pin and made adjustments to your 40 yard (36.6 m) pin, go back and shoot at 20 yards (18.3 m) again. This time, make adjustments to the pin itself instead of the whole sight. Move back and sight any additional pins. Depending on your sight, you may have additional pins for 50 yards (45.7 m), 60 yards (54.9 m), and more. Move back from the target and repeat the previous steps, moving the pin to make adjustments.",
    "sentences": [
        " Preparing the Bow and Range Set aside a few days.",
        "You will want to spread your sighting in over a few sessions.",
        "This is because fatigue will affect your accuracy and power, and your form will most likely shift.",
        "Spreading out the sighting over a few days will result in greater overall accuracy.",
        "Buy the sight.",
        "Bow sights come in many styles and should be chosen to meet the preferences of the archer.",
        "Bow sights are available at sporting good stores and specialized archery supply outlets.",
        "If you're just planning on hunting with the bow, you can use a simple sight that should only set you back around $40.",
        "Competition sights can cost 5 times this or more.",
        "This guide is for sighting in a fixed-pin sight.",
        "It is the most common sight and is recommended for hunting and recreation.",
        "Mount the sight to the bow.",
        "Follow the instructions provided with the sight for proper installation.",
        "Most sights are attached to the riser and are secured by a couple of screws.",
        "Most bows have pre-drilled holes for attaching sights.",
        "Do not overtighten the screws, as you could damage the bow.",
        "The sighting pins of the sight should be lined up vertically with the bow string.",
        "The bow sight should be at a right angle to the bow.",
        "After installing the sight, let it settle overnight.",
        "You may have to tighten it further after it settles.",
        "Set all sighting pin adjustments to the mid-point.",
        "This will give you maximum room for adjustment in either direction as needed.",
        "An Allen wrench, available at hardware stores, will be needed to adjust the sighting pins.",
        "Set up the target and mark your ranges.",
        "Ideally you will want to be able to mark off every 10 yards (9.1 m) from the target, at least up to 40 yards (36.6 m).",
        "Use a range finder if possible for accuracy.",
        "Range finders are available from hunting and outdoor supply stores.",
        "Try to use a durable target that can take a lot of arrows, as sighting in the bow can take some time and a lot of repetition.",
        "Sighting It In Set your 20 yard (first) pin.",
        "Move to the closest distance to the target, which is usually the 10 yard (9.1 m) mark.",
        "Stand so that your body is perpendicular to the target, and draw an arrow back with your bow.",
        "Look down the sight at the top pin and shoot your arrow at the target.",
        "Repeat with a few more arrows.",
        "Take note of where the arrows hit compared to the site.",
        "If the arrows went above what the pin was indicating, move the sight box up on the bow.",
        "Repeat this step until the arrow is not shooting above the top pin.",
        "Step back to 20 yards (18.3 m).",
        "Repeat the sighting process, raising the sight box if necessary.",
        "Once the arrows are not hitting above the top pin, you can make adjustments for arrows going too far left or right by moving the sight left and right respectively.",
        "Don't worry about perfect accuracy yet, this pin will most likely change.",
        "Set Your 30 yard (second) pin.",
        "Once you deem your 20 yard (18.3 m) top pin suitably accurate, you can move back to the 30 yard (27.4 m) mark on your range.",
        "Aim down the sight using the second pin and fire off a few arrows at the target.",
        "Start making the same adjustments that you made while sighting in at 20 yards (18.3 m).",
        "Remember to move the entire sight box when making adjustments at this stage.",
        "Take the time to make the 30 yard (27.4 m) pin as accurate as possible, because it will not be changing.",
        "This will be the anchor of your sight.",
        "Move back to 40 yards (36.6 m).",
        "Shoot arrows at the target while looking at your 40 yard (third) pin in the sight.",
        "When you make you adjustments this time, move the pin itself instead of the entire sight box.",
        "You won't be moving left and right with the sight box anymore; instead focus on making the 40 yard (36.6 m) arrow go to exactly where the pin is pointing.",
        "The distance between the 30 and 40 yard pins will be greater than the distance between the 20 and 30 yard pins.",
        "If you need to readjust your left and right sight placement, return to the 30 yard (27.4 m) marker on the range and make your adjustments there.",
        "Check your 20 yard (18.3 m) shot again.",
        "Once you've set the 30 yard (27.4 m) pin and made adjustments to your 40 yard (36.6 m) pin, go back and shoot at 20 yards (18.3 m) again.",
        "This time, make adjustments to the pin itself instead of the whole sight.",
        "Move back and sight any additional pins.",
        "Depending on your sight, you may have additional pins for 50 yards (45.7 m), 60 yards (54.9 m), and more.",
        "Move back from the target and repeat the previous steps, moving the pin to make adjustments."
    ]
}