{
    "title": "How to Make Scented Pine Cones",
    "url": "https://www.wikihow.com/Make-Scented-Pine-Cones",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Nature Crafts",
        "Pine Cone Crafts"
    ],
    "methods": [
        {
            "name": "Spray Adhesive Method",
            "steps": [
                {
                    "headline": "Place cloves, cinnamon and pickling spice in a dish and mix thoroughly.",
                    "description": "Sprinkle the pine cone spice mixture with essential oils of patchouli, orange, sandalwood, cinnamon or balsam if you want to add a more pungent aroma. Mix the spices and oils thoroughly."
                },
                {
                    "headline": "Select enough pine cones to make a rounded heap in a pie pan.",
                    "description": ""
                },
                {
                    "headline": "Spread the pine cones in a single layer on the bottom of a large plastic bag.",
                    "description": ""
                },
                {
                    "headline": "Spray the pine cones with spray adhesive.",
                    "description": "Be careful not to breathe in the adhesive. Spray outside if your house isn't well-ventilated."
                },
                {
                    "headline": "Close the bag and shake thoroughly until the pine cones turn over and settle again in one layer on the bottom of the bag.",
                    "description": ""
                },
                {
                    "headline": "Open the bag and spray the pine cones with the adhesive again.",
                    "description": ""
                },
                {
                    "headline": "Sprinkle the pine cones with the spice mix and shake the bag.",
                    "description": ""
                },
                {
                    "headline": "Place the pine cones in a container or pie dish and allow them to dry.",
                    "description": ""
                },
                {
                    "headline": "Put the pine cones in a mesh bag or onion bag, then shake the bag thoroughly to remove excess spices.",
                    "description": "This step is messy and should be done outside."
                },
                {
                    "headline": "Package the mesh bag of fragrant pine cones inside a plastic bag, then tie it closed with a ribbon.",
                    "description": "Alternatively, place the spiced pine cones in a basket. Cover the basket with cellophane, then decorate it with a bow."
                }
            ]
        },
        {
            "name": "Brush-on Glue Method",
            "steps": [
                {
                    "headline": "Mix equal parts nutmeg, ginger, and cinnamon in a plastic bag.",
                    "description": ""
                },
                {
                    "headline": "Set the pine cones on newspaper or a plastic sheet.",
                    "description": "Use a foam brush to apply glue to the cones."
                },
                {
                    "headline": "Place the pine cones with glue on them in the plastic bag.",
                    "description": "Shake the bag to cover the cones with the spices."
                },
                {
                    "headline": "Place the pine cones on newspaper and allow the cones to dry overnight.",
                    "description": "Give the pine cones as gifts in baskets or hang them on your Christmas tree."
                }
            ]
        },
        {
            "name": "Scenting Pine Cones Without Glue",
            "steps": [
                {
                    "headline": "Mix Christmas blend essential oil in a spray bottle with some water.",
                    "description": "If you prefer, you can also use cinnamon or clove oil."
                },
                {
                    "headline": "Spray the pine cones with the scented water and seal the cones in a plastic bag.",
                    "description": ""
                },
                {
                    "headline": "Remove the pine cones after 24 hours.",
                    "description": "The scented cones are ready to decorate your house or to give as gifts. Alternatively, put pine cones in a plastic bag with several drops of cinnamon or clove oil or Christmas essential oil. Seal the pine cones in the bag for 2 to 7 days, after which the cones will be ready."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Pine cones of various sizes",
        "Spray adhesive or glue",
        "Foam brush",
        "1/8 cup ground cloves or 1/4 cup whole cloves",
        "1/4 cup cinnamon powder",
        "1/4 cup pickling spice",
        "Ground nutmeg",
        "Ground ginger",
        "Essential oils",
        "Plastic bag",
        "Mesh bag",
        "Spray bottle",
        "Cookie sheet"
    ],
    "text": " Spray Adhesive Method Place cloves, cinnamon and pickling spice in a dish and mix thoroughly. Sprinkle the pine cone spice mixture with essential oils of patchouli, orange, sandalwood, cinnamon or balsam if you want to add a more pungent aroma. Mix the spices and oils thoroughly. Select enough pine cones to make a rounded heap in a pie pan.  Spread the pine cones in a single layer on the bottom of a large plastic bag.  Spray the pine cones with spray adhesive. Be careful not to breathe in the adhesive. Spray outside if your house isn't well-ventilated. Close the bag and shake thoroughly until the pine cones turn over and settle again in one layer on the bottom of the bag.  Open the bag and spray the pine cones with the adhesive again.  Sprinkle the pine cones with the spice mix and shake the bag.  Place the pine cones in a container or pie dish and allow them to dry.  Put the pine cones in a mesh bag or onion bag, then shake the bag thoroughly to remove excess spices. This step is messy and should be done outside. Package the mesh bag of fragrant pine cones inside a plastic bag, then tie it closed with a ribbon. Alternatively, place the spiced pine cones in a basket. Cover the basket with cellophane, then decorate it with a bow. Brush-on Glue Method Mix equal parts nutmeg, ginger, and cinnamon in a plastic bag.  Set the pine cones on newspaper or a plastic sheet. Use a foam brush to apply glue to the cones. Place the pine cones with glue on them in the plastic bag. Shake the bag to cover the cones with the spices. Place the pine cones on newspaper and allow the cones to dry overnight. Give the pine cones as gifts in baskets or hang them on your Christmas tree. Scenting Pine Cones Without Glue Mix Christmas blend essential oil in a spray bottle with some water. If you prefer, you can also use cinnamon or clove oil. Spray the pine cones with the scented water and seal the cones in a plastic bag.  Remove the pine cones after 24 hours. The scented cones are ready to decorate your house or to give as gifts. Alternatively, put pine cones in a plastic bag with several drops of cinnamon or clove oil or Christmas essential oil. Seal the pine cones in the bag for 2 to 7 days, after which the cones will be ready. Finished. ",
    "sentences": [
        " Spray Adhesive Method Place cloves, cinnamon and pickling spice in a dish and mix thoroughly.",
        "Sprinkle the pine cone spice mixture with essential oils of patchouli, orange, sandalwood, cinnamon or balsam if you want to add a more pungent aroma.",
        "Mix the spices and oils thoroughly.",
        "Select enough pine cones to make a rounded heap in a pie pan.",
        "Spread the pine cones in a single layer on the bottom of a large plastic bag.",
        "Spray the pine cones with spray adhesive.",
        "Be careful not to breathe in the adhesive.",
        "Spray outside if your house isn't well-ventilated.",
        "Close the bag and shake thoroughly until the pine cones turn over and settle again in one layer on the bottom of the bag.",
        "Open the bag and spray the pine cones with the adhesive again.",
        "Sprinkle the pine cones with the spice mix and shake the bag.",
        "Place the pine cones in a container or pie dish and allow them to dry.",
        "Put the pine cones in a mesh bag or onion bag, then shake the bag thoroughly to remove excess spices.",
        "This step is messy and should be done outside.",
        "Package the mesh bag of fragrant pine cones inside a plastic bag, then tie it closed with a ribbon.",
        "Alternatively, place the spiced pine cones in a basket.",
        "Cover the basket with cellophane, then decorate it with a bow.",
        "Brush-on Glue Method Mix equal parts nutmeg, ginger, and cinnamon in a plastic bag.",
        "Set the pine cones on newspaper or a plastic sheet.",
        "Use a foam brush to apply glue to the cones.",
        "Place the pine cones with glue on them in the plastic bag.",
        "Shake the bag to cover the cones with the spices.",
        "Place the pine cones on newspaper and allow the cones to dry overnight.",
        "Give the pine cones as gifts in baskets or hang them on your Christmas tree.",
        "Scenting Pine Cones Without Glue Mix Christmas blend essential oil in a spray bottle with some water.",
        "If you prefer, you can also use cinnamon or clove oil.",
        "Spray the pine cones with the scented water and seal the cones in a plastic bag.",
        "Remove the pine cones after 24 hours.",
        "The scented cones are ready to decorate your house or to give as gifts.",
        "Alternatively, put pine cones in a plastic bag with several drops of cinnamon or clove oil or Christmas essential oil.",
        "Seal the pine cones in the bag for 2 to 7 days, after which the cones will be ready.",
        "Finished."
    ]
}