{
    "title": "How to Gain Weight As a Vegetarian",
    "url": "https://www.wikihow.com/Gain-Weight-As-a-Vegetarian",
    "category_hierarchy": [
        "Health",
        "Nutrition and Food Health",
        "Vegetarian Health"
    ],
    "methods": [
        {
            "name": "Gaining Weight on a Vegan Diet",
            "steps": [
                {
                    "headline": "Understand the difference between vegetarianism and vegan.",
                    "description": "Vegans are all vegetarians, but not all vegetarians are vegans. A vegetarian diet cuts out all meat products — beef, poultry, sometimes fish, and so on — but a vegan diet eliminates all animal and animal-based food products. This means vegans do not eat dairy products (such as milk, yogurt, butter, cheese) and eggs. Vegans therefore base their diets around nutrient-rich plants. The diet of a vegan is more restrictive, and therefore more of a challenge to get complete nutrition (although of course, it is possible), and for underweight individuals, may make it a bit more difficult to gain weight."
                },
                {
                    "headline": "Calculate your calorie needs.",
                    "description": "A calorie is a unit of energy in food that, when consumed, is either used to fuel the body's activities or is stored as fat. When trying to lose weight, you want a calorie deficit, meaning you burn more calories through activity than you take in through food. To gain weight, you do the opposite: eat more calories than you burn in the course of a day. A vegetarian diet offers many calorie-rich options that will help you increase caloric intake without having to cut down on the exercise or activity that keeps you healthy. One pound of fat is equal to 3,500 calories. For every 3,500 calories you take in without burning them off, you will gain one pound of weight. Your calorie needs will depend on your age, sex, and height. Use an online calorie calculator to find out how many calories you should be consuming on a daily basis. Since you are trying to gain weight, eat slightly more than that amount every day — but don't go crazy! Eat about 500 extra calories per day to add up to 3,500 calories by the end of the week. At this rate, you will gain one pound per week."
                },
                {
                    "headline": "Continue eating healthy calories.",
                    "description": "The most obvious way to gain weight is to eat unhealthy, fatty vegan options like French fries or sugary pastries. But this is typically not what a person who is underweight actually needs. While there is plenty of fat and  calories, these foods are lacking in nutrients such as protein, calcium, fiber, and other important needs for a healthy body. Snack throughout the day on foods that have “good fats,” like avocados, beans, nuts, seeds, peanut or almond butter, and hummus. Drink your calories! Instead of drinking only water, drink juices, protein drinks, and smoothies that will bring in calories without filling you up. Add easy calories through garnishes. For example, add olive oil, nuts, seeds, and fruits, to salads."
                },
                {
                    "headline": "Eat protein-rich food to build muscle mass.",
                    "description": "A lack of protein is typically the main issue seen with vegan and vegetarian diets. Those following these diets should consistently watch for complete protein. Complete proteins are necessary due to their complete panel of amino acids. However, vegans and vegetarians can consume various protein options that complement one another (called complementary proteins) to form a complete protein that has all 9 essential amino acids. They can also simply consume complete proteins such as garbanzo beans, spirulina, and flax seeds. An example of combined protein would be brown rice and beans. Beans are a go-to meatless protein, and also a great source for calories! Ideally, you should eat at least 3 cups of garbanzo beans every week, though you can eat more than that without fear of health repercussions. Nuts and seeds are protein-rich, but some varieties can add too much cholesterol to your diet. Look for pumpkin seeds, almonds, pistachios, and walnuts, but avoid macadamia nuts and Brazil nuts."
                },
                {
                    "headline": "Explore soy alternatives.",
                    "description": "Soy protein is the vegan's best friend, and is even thought to lower “bad” (LDL) cholesterol levels. Tofu and tempeh don't have much flavor on their own, but they take on the flavor of whatever they're cooked with while increasing your protein intake. Some people object to tofu's smooth texture, so you might add TVP (textured vegetable protein) to dishes that need protein that feels like ground meat — tacos, pasta sauces, etc. Add calories to meals through soy garnishes, as well. You can find soy cheese, soy milk, or soy sour cream at your grocery store. Use these products to add calories to salads, baked potatoes, tacos, or granola without filling yourself up."
                },
                {
                    "headline": "Increase your carbohydrate intake.",
                    "description": "You may have heard that people trying to lose weight often cut carbohydrates out of their diet entirely. Research suggests, though, that low-carb diets are effective largely because they result in lower calorie consumption. Foods rich in carbohydrates can give you a calorie boost without filling you up as much as an equivalent amount of vegetables or beans. To gain weight, include carbohydrates like rice, pasta, quinoa, and whole-wheat breads in your diet."
                },
                {
                    "headline": "Eat six mini-meals throughout the day.",
                    "description": "If you get full quickly, you might have trouble getting enough calories through three square vegan meals. In that case, eat six smaller meals spread evenly throughout the day. You don't have to eat to the point of feeling stuffed, but small, frequent meals will result in higher calorie consumption throughout the day."
                },
                {
                    "headline": "Snack often.",
                    "description": "Even between your small meals, you can take in calories by eating small, nutrient-rich snacks designed to fuel the body. A spoonful of peanut butter, a protein bar, a cup of granola, or a handful of kale chips won't fill you up, but they'll help you gain weight."
                }
            ]
        },
        {
            "name": "Gaining Weight with Dairy and Eggs",
            "steps": [
                {
                    "headline": "Begin with the vegan guidelines for weight gain.",
                    "description": "The vegan and vegetarian diets are quite similar, though the vegetarian diet allows a little more flexibility. As such, a vegetarian should follow all the advice given for vegans attempting to gain weight, alongside suggestions that incorporate dairy into the diet. Try to consume 3,500 calories more than needed to maintain your weight every week. This will result in a weight gain of about 1 pound per week. Eat calorie and protein-rich foods like beans, nuts, peanut and almond butters, soy products, and so on to replace the role of meat in your diet. Eat multiple smaller meals to help you consume enough calories to gain weight, and snack often."
                },
                {
                    "headline": "Increase the amount of egg protein in your diet.",
                    "description": "If your diet allows dairy and eggs, you should take advantage of the calories and protein available in these products. While eggs are quite rich in protein, eating too much yolk can cause your cholesterol to rise to dangerous levels. Yolks are healthy in moderation, but you shouldn't eat more than one per day. Egg whites, on the other hand, are healthy and protein-rich in any amount. Simply remove the egg yolks or buy liquid egg whites from the grocery store to make egg dishes dense with protein, calories, and nutrients. For example, stuff an egg-white omelet with beans, cheese, chopped tomatoes, onions, and bell peppers, then top it with sour cream, salsa, and avocados."
                },
                {
                    "headline": "Garnish meals with dairy products.",
                    "description": "Just as with a vegan diet, you can add calories to your meals by adding nuts, fruits, and other calorie-rich garnishes to your salads and other meals. However, if your diet allows dairy products, you can opt for regular sour cream and cheese instead of the soy substitutes used by vegans. Cheese, sour cream, butter, and other dairy products are high in saturated fats, so they should be consumed only in moderation. Too much of these foods can lead to heart problems down the line. However, just one ounce of shredded cheese might add 100 calories to a baked potato, omelet, or salad! Two tablespoons of sour cream will add 60 calories to your cup of vegetarian chili. Spreading a pat of butter over your toast in the morning can add 36 calories. Garnishing your meals with dairy will help you reach your daily 500-calorie surplus without stuffing yourself."
                },
                {
                    "headline": "Snack on dairy products.",
                    "description": "Cheese should be approached with some wariness. While cheese is linked with obesity and heart disease, it's also a key component of the  incredibly healthy Mediterranean diet. The key to gaining weight the right way with cheese is to choose the right types of cheese. Avoid unhealthier cheese like cheddar and Swiss, and look for healthier cheeses like goat cheese, feta, and mozzarella are lower in calories, and can be eaten as a light snack for a calorie boost. Cottage cheese is a popular snack that adds a good deal of protein to your diet without posing a potential health risk. Yogurts are also a popular snack option, but avoid yogurts that add a lot of sugar through flavoring. Instead, choose a plain or Greek yogurt and flavor it with fresh fruits."
                },
                {
                    "headline": "Consider including fish in your diet.",
                    "description": "Many vegetarians who choose not to eat meat products still include fish in their diets. This is called “pescetarianism,” and can be a good option for those trying to gain weight. Like chicken, fish is a lean meat that adds calories and protein to your meals. Human bodies can't produce the omega-3 fatty acids found in fish, but these acids help build muscle mass, increasing weight without adding flab. The American Heart Association recommends eating fish at least twice a week, and emphasizes the following fish:\nMackerel\nLake trout\nHerring\nSardines\nAlbacore tuna\nSalmon"
                }
            ]
        }
    ],
    "tyn": [
        "Nuts such as Almond and Walnuts",
        "Beans",
        "Yogurt (optional)",
        "Greens",
        "Soy milk or other non-dairy milk",
        "Nut butter",
        "Fruit such as berries",
        "Olive or other vegetable oil",
        "Grain products such as rice, oatmeal, or bread",
        "Avocados",
        "Seeds, such as flax seeds or sunflower seeds",
        "Raisins"
    ],
    "text": " Gaining Weight on a Vegan Diet Understand the difference between vegetarianism and vegan. Vegans are all vegetarians, but not all vegetarians are vegans. A vegetarian diet cuts out all meat products — beef, poultry, sometimes fish, and so on — but a vegan diet eliminates all animal and animal-based food products. This means vegans do not eat dairy products (such as milk, yogurt, butter, cheese) and eggs. Vegans therefore base their diets around nutrient-rich plants. The diet of a vegan is more restrictive, and therefore more of a challenge to get complete nutrition (although of course, it is possible), and for underweight individuals, may make it a bit more difficult to gain weight. Calculate your calorie needs. A calorie is a unit of energy in food that, when consumed, is either used to fuel the body's activities or is stored as fat. When trying to lose weight, you want a calorie deficit, meaning you burn more calories through activity than you take in through food. To gain weight, you do the opposite: eat more calories than you burn in the course of a day. A vegetarian diet offers many calorie-rich options that will help you increase caloric intake without having to cut down on the exercise or activity that keeps you healthy. One pound of fat is equal to 3,500 calories. For every 3,500 calories you take in without burning them off, you will gain one pound of weight. Your calorie needs will depend on your age, sex, and height. Use an online calorie calculator to find out how many calories you should be consuming on a daily basis. Since you are trying to gain weight, eat slightly more than that amount every day — but don't go crazy! Eat about 500 extra calories per day to add up to 3,500 calories by the end of the week. At this rate, you will gain one pound per week. Continue eating healthy calories. The most obvious way to gain weight is to eat unhealthy, fatty vegan options like French fries or sugary pastries. But this is typically not what a person who is underweight actually needs. While there is plenty of fat and  calories, these foods are lacking in nutrients such as protein, calcium, fiber, and other important needs for a healthy body. Snack throughout the day on foods that have “good fats,” like avocados, beans, nuts, seeds, peanut or almond butter, and hummus. Drink your calories! Instead of drinking only water, drink juices, protein drinks, and smoothies that will bring in calories without filling you up. Add easy calories through garnishes. For example, add olive oil, nuts, seeds, and fruits, to salads. Eat protein-rich food to build muscle mass. A lack of protein is typically the main issue seen with vegan and vegetarian diets. Those following these diets should consistently watch for complete protein. Complete proteins are necessary due to their complete panel of amino acids. However, vegans and vegetarians can consume various protein options that complement one another (called complementary proteins) to form a complete protein that has all 9 essential amino acids. They can also simply consume complete proteins such as garbanzo beans, spirulina, and flax seeds. An example of combined protein would be brown rice and beans. Beans are a go-to meatless protein, and also a great source for calories! Ideally, you should eat at least 3 cups of garbanzo beans every week, though you can eat more than that without fear of health repercussions. Nuts and seeds are protein-rich, but some varieties can add too much cholesterol to your diet. Look for pumpkin seeds, almonds, pistachios, and walnuts, but avoid macadamia nuts and Brazil nuts. Explore soy alternatives. Soy protein is the vegan's best friend, and is even thought to lower “bad” (LDL) cholesterol levels. Tofu and tempeh don't have much flavor on their own, but they take on the flavor of whatever they're cooked with while increasing your protein intake. Some people object to tofu's smooth texture, so you might add TVP (textured vegetable protein) to dishes that need protein that feels like ground meat — tacos, pasta sauces, etc. Add calories to meals through soy garnishes, as well. You can find soy cheese, soy milk, or soy sour cream at your grocery store. Use these products to add calories to salads, baked potatoes, tacos, or granola without filling yourself up. Increase your carbohydrate intake. You may have heard that people trying to lose weight often cut carbohydrates out of their diet entirely. Research suggests, though, that low-carb diets are effective largely because they result in lower calorie consumption. Foods rich in carbohydrates can give you a calorie boost without filling you up as much as an equivalent amount of vegetables or beans. To gain weight, include carbohydrates like rice, pasta, quinoa, and whole-wheat breads in your diet. Eat six mini-meals throughout the day. If you get full quickly, you might have trouble getting enough calories through three square vegan meals. In that case, eat six smaller meals spread evenly throughout the day. You don't have to eat to the point of feeling stuffed, but small, frequent meals will result in higher calorie consumption throughout the day. Snack often. Even between your small meals, you can take in calories by eating small, nutrient-rich snacks designed to fuel the body. A spoonful of peanut butter, a protein bar, a cup of granola, or a handful of kale chips won't fill you up, but they'll help you gain weight. Gaining Weight with Dairy and Eggs Begin with the vegan guidelines for weight gain. The vegan and vegetarian diets are quite similar, though the vegetarian diet allows a little more flexibility. As such, a vegetarian should follow all the advice given for vegans attempting to gain weight, alongside suggestions that incorporate dairy into the diet. Try to consume 3,500 calories more than needed to maintain your weight every week. This will result in a weight gain of about 1 pound per week. Eat calorie and protein-rich foods like beans, nuts, peanut and almond butters, soy products, and so on to replace the role of meat in your diet. Eat multiple smaller meals to help you consume enough calories to gain weight, and snack often. Increase the amount of egg protein in your diet. If your diet allows dairy and eggs, you should take advantage of the calories and protein available in these products. While eggs are quite rich in protein, eating too much yolk can cause your cholesterol to rise to dangerous levels. Yolks are healthy in moderation, but you shouldn't eat more than one per day. Egg whites, on the other hand, are healthy and protein-rich in any amount. Simply remove the egg yolks or buy liquid egg whites from the grocery store to make egg dishes dense with protein, calories, and nutrients. For example, stuff an egg-white omelet with beans, cheese, chopped tomatoes, onions, and bell peppers, then top it with sour cream, salsa, and avocados. Garnish meals with dairy products. Just as with a vegan diet, you can add calories to your meals by adding nuts, fruits, and other calorie-rich garnishes to your salads and other meals. However, if your diet allows dairy products, you can opt for regular sour cream and cheese instead of the soy substitutes used by vegans. Cheese, sour cream, butter, and other dairy products are high in saturated fats, so they should be consumed only in moderation. Too much of these foods can lead to heart problems down the line. However, just one ounce of shredded cheese might add 100 calories to a baked potato, omelet, or salad! Two tablespoons of sour cream will add 60 calories to your cup of vegetarian chili. Spreading a pat of butter over your toast in the morning can add 36 calories. Garnishing your meals with dairy will help you reach your daily 500-calorie surplus without stuffing yourself. Snack on dairy products. Cheese should be approached with some wariness. While cheese is linked with obesity and heart disease, it's also a key component of the  incredibly healthy Mediterranean diet. The key to gaining weight the right way with cheese is to choose the right types of cheese. Avoid unhealthier cheese like cheddar and Swiss, and look for healthier cheeses like goat cheese, feta, and mozzarella are lower in calories, and can be eaten as a light snack for a calorie boost. Cottage cheese is a popular snack that adds a good deal of protein to your diet without posing a potential health risk. Yogurts are also a popular snack option, but avoid yogurts that add a lot of sugar through flavoring. Instead, choose a plain or Greek yogurt and flavor it with fresh fruits. Consider including fish in your diet. Many vegetarians who choose not to eat meat products still include fish in their diets. This is called “pescetarianism,” and can be a good option for those trying to gain weight. Like chicken, fish is a lean meat that adds calories and protein to your meals. Human bodies can't produce the omega-3 fatty acids found in fish, but these acids help build muscle mass, increasing weight without adding flab. The American Heart Association recommends eating fish at least twice a week, and emphasizes the following fish:\nMackerel\nLake trout\nHerring\nSardines\nAlbacore tuna\nSalmon",
    "sentences": [
        " Gaining Weight on a Vegan Diet Understand the difference between vegetarianism and vegan.",
        "Vegans are all vegetarians, but not all vegetarians are vegans.",
        "A vegetarian diet cuts out all meat products — beef, poultry, sometimes fish, and so on — but a vegan diet eliminates all animal and animal-based food products.",
        "This means vegans do not eat dairy products (such as milk, yogurt, butter, cheese) and eggs.",
        "Vegans therefore base their diets around nutrient-rich plants.",
        "The diet of a vegan is more restrictive, and therefore more of a challenge to get complete nutrition (although of course, it is possible), and for underweight individuals, may make it a bit more difficult to gain weight.",
        "Calculate your calorie needs.",
        "A calorie is a unit of energy in food that, when consumed, is either used to fuel the body's activities or is stored as fat.",
        "When trying to lose weight, you want a calorie deficit, meaning you burn more calories through activity than you take in through food.",
        "To gain weight, you do the opposite: eat more calories than you burn in the course of a day.",
        "A vegetarian diet offers many calorie-rich options that will help you increase caloric intake without having to cut down on the exercise or activity that keeps you healthy.",
        "One pound of fat is equal to 3,500 calories.",
        "For every 3,500 calories you take in without burning them off, you will gain one pound of weight.",
        "Your calorie needs will depend on your age, sex, and height.",
        "Use an online calorie calculator to find out how many calories you should be consuming on a daily basis.",
        "Since you are trying to gain weight, eat slightly more than that amount every day — but don't go crazy!",
        "Eat about 500 extra calories per day to add up to 3,500 calories by the end of the week.",
        "At this rate, you will gain one pound per week.",
        "Continue eating healthy calories.",
        "The most obvious way to gain weight is to eat unhealthy, fatty vegan options like French fries or sugary pastries.",
        "But this is typically not what a person who is underweight actually needs.",
        "While there is plenty of fat and  calories, these foods are lacking in nutrients such as protein, calcium, fiber, and other important needs for a healthy body.",
        "Snack throughout the day on foods that have “good fats,” like avocados, beans, nuts, seeds, peanut or almond butter, and hummus.",
        "Drink your calories!",
        "Instead of drinking only water, drink juices, protein drinks, and smoothies that will bring in calories without filling you up.",
        "Add easy calories through garnishes.",
        "For example, add olive oil, nuts, seeds, and fruits, to salads.",
        "Eat protein-rich food to build muscle mass.",
        "A lack of protein is typically the main issue seen with vegan and vegetarian diets.",
        "Those following these diets should consistently watch for complete protein.",
        "Complete proteins are necessary due to their complete panel of amino acids.",
        "However, vegans and vegetarians can consume various protein options that complement one another (called complementary proteins) to form a complete protein that has all 9 essential amino acids.",
        "They can also simply consume complete proteins such as garbanzo beans, spirulina, and flax seeds.",
        "An example of combined protein would be brown rice and beans.",
        "Beans are a go-to meatless protein, and also a great source for calories!",
        "Ideally, you should eat at least 3 cups of garbanzo beans every week, though you can eat more than that without fear of health repercussions.",
        "Nuts and seeds are protein-rich, but some varieties can add too much cholesterol to your diet.",
        "Look for pumpkin seeds, almonds, pistachios, and walnuts, but avoid macadamia nuts and Brazil nuts.",
        "Explore soy alternatives.",
        "Soy protein is the vegan's best friend, and is even thought to lower “bad” (LDL) cholesterol levels.",
        "Tofu and tempeh don't have much flavor on their own, but they take on the flavor of whatever they're cooked with while increasing your protein intake.",
        "Some people object to tofu's smooth texture, so you might add TVP (textured vegetable protein) to dishes that need protein that feels like ground meat — tacos, pasta sauces, etc.",
        "Add calories to meals through soy garnishes, as well.",
        "You can find soy cheese, soy milk, or soy sour cream at your grocery store.",
        "Use these products to add calories to salads, baked potatoes, tacos, or granola without filling yourself up.",
        "Increase your carbohydrate intake.",
        "You may have heard that people trying to lose weight often cut carbohydrates out of their diet entirely.",
        "Research suggests, though, that low-carb diets are effective largely because they result in lower calorie consumption.",
        "Foods rich in carbohydrates can give you a calorie boost without filling you up as much as an equivalent amount of vegetables or beans.",
        "To gain weight, include carbohydrates like rice, pasta, quinoa, and whole-wheat breads in your diet.",
        "Eat six mini-meals throughout the day.",
        "If you get full quickly, you might have trouble getting enough calories through three square vegan meals.",
        "In that case, eat six smaller meals spread evenly throughout the day.",
        "You don't have to eat to the point of feeling stuffed, but small, frequent meals will result in higher calorie consumption throughout the day.",
        "Snack often.",
        "Even between your small meals, you can take in calories by eating small, nutrient-rich snacks designed to fuel the body.",
        "A spoonful of peanut butter, a protein bar, a cup of granola, or a handful of kale chips won't fill you up, but they'll help you gain weight.",
        "Gaining Weight with Dairy and Eggs Begin with the vegan guidelines for weight gain.",
        "The vegan and vegetarian diets are quite similar, though the vegetarian diet allows a little more flexibility.",
        "As such, a vegetarian should follow all the advice given for vegans attempting to gain weight, alongside suggestions that incorporate dairy into the diet.",
        "Try to consume 3,500 calories more than needed to maintain your weight every week.",
        "This will result in a weight gain of about 1 pound per week.",
        "Eat calorie and protein-rich foods like beans, nuts, peanut and almond butters, soy products, and so on to replace the role of meat in your diet.",
        "Eat multiple smaller meals to help you consume enough calories to gain weight, and snack often.",
        "Increase the amount of egg protein in your diet.",
        "If your diet allows dairy and eggs, you should take advantage of the calories and protein available in these products.",
        "While eggs are quite rich in protein, eating too much yolk can cause your cholesterol to rise to dangerous levels.",
        "Yolks are healthy in moderation, but you shouldn't eat more than one per day.",
        "Egg whites, on the other hand, are healthy and protein-rich in any amount.",
        "Simply remove the egg yolks or buy liquid egg whites from the grocery store to make egg dishes dense with protein, calories, and nutrients.",
        "For example, stuff an egg-white omelet with beans, cheese, chopped tomatoes, onions, and bell peppers, then top it with sour cream, salsa, and avocados.",
        "Garnish meals with dairy products.",
        "Just as with a vegan diet, you can add calories to your meals by adding nuts, fruits, and other calorie-rich garnishes to your salads and other meals.",
        "However, if your diet allows dairy products, you can opt for regular sour cream and cheese instead of the soy substitutes used by vegans.",
        "Cheese, sour cream, butter, and other dairy products are high in saturated fats, so they should be consumed only in moderation.",
        "Too much of these foods can lead to heart problems down the line.",
        "However, just one ounce of shredded cheese might add 100 calories to a baked potato, omelet, or salad!",
        "Two tablespoons of sour cream will add 60 calories to your cup of vegetarian chili.",
        "Spreading a pat of butter over your toast in the morning can add 36 calories.",
        "Garnishing your meals with dairy will help you reach your daily 500-calorie surplus without stuffing yourself.",
        "Snack on dairy products.",
        "Cheese should be approached with some wariness.",
        "While cheese is linked with obesity and heart disease, it's also a key component of the  incredibly healthy Mediterranean diet.",
        "The key to gaining weight the right way with cheese is to choose the right types of cheese.",
        "Avoid unhealthier cheese like cheddar and Swiss, and look for healthier cheeses like goat cheese, feta, and mozzarella are lower in calories, and can be eaten as a light snack for a calorie boost.",
        "Cottage cheese is a popular snack that adds a good deal of protein to your diet without posing a potential health risk.",
        "Yogurts are also a popular snack option, but avoid yogurts that add a lot of sugar through flavoring.",
        "Instead, choose a plain or Greek yogurt and flavor it with fresh fruits.",
        "Consider including fish in your diet.",
        "Many vegetarians who choose not to eat meat products still include fish in their diets.",
        "This is called “pescetarianism,” and can be a good option for those trying to gain weight.",
        "Like chicken, fish is a lean meat that adds calories and protein to your meals.",
        "Human bodies can't produce the omega-3 fatty acids found in fish, but these acids help build muscle mass, increasing weight without adding flab.",
        "The American Heart Association recommends eating fish at least twice a week, and emphasizes the following fish:\nMackerel\nLake trout\nHerring\nSardines\nAlbacore tuna\nSalmon"
    ]
}