{
    "title": "How to Look Fab, Fresh and Pretty",
    "url": "https://www.wikihow.com/Look-Fab,-Fresh-and-Pretty",
    "category_hierarchy": [
        "Personal Care and Style",
        "Looking Good",
        "Looking Pretty"
    ],
    "methods": [
        {
            "name": "Steps",
            "steps": [
                {
                    "headline": "Start with hygiene",
                    "description": "Have a shower or bath once a day. If your hair is greasy wash it everyday with a shampoo and conditioner. If your hair is nice wash it every two days. Wash your body with a refreshing body wash! After you out of the shower/tub moisturize. Rub lotion in appropriate areas. Wash your face. First with a scrub then a cleanser and finally a moisturizer. Brush your teeth and floss at least twice a day for two minutes each! Try to brush your teeth after each meal if possible but at least  floss."
                },
                {
                    "headline": "Get your hair trimmed every once in a while.",
                    "description": ""
                },
                {
                    "headline": "When wearing make-up go for a natural glowing look!",
                    "description": ""
                },
                {
                    "headline": "Apply sunscreen year round",
                    "description": ""
                },
                {
                    "headline": "Health!",
                    "description": "Eat fresh fruits and vegetables, and whole grain\nTake vitamins\nDrink plenty of water! Exercise for an hour everyday on, cardio,legs,abs,butt and even arms!"
                },
                {
                    "headline": "Treat yourself:",
                    "description": ""
                },
                {
                    "headline": "Give yourself a pedicure and manicure every so often!",
                    "description": ""
                },
                {
                    "headline": "Give yourself a facial!",
                    "description": ""
                }
            ]
        },
        {
            "name": "Clothes",
            "steps": [
                {
                    "headline": "Dress your age!",
                    "description": "Don't wear belly tops, WAY too short shorts, fishnets(unless they are in a costume), or anything that a hooker would wear."
                },
                {
                    "headline": "Don't wear baggy,too tight,low or dirty clothes.",
                    "description": "Wear clothes that hug you, but not too tight."
                },
                {
                    "headline": "Wear clothes that compliment your skin tone",
                    "description": ""
                },
                {
                    "headline": "Always smile, not a cheesy fake smile, think of anything that makes you happy for a natural attractive smile.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Body wash and moisturizer/lotion",
        "Shampoo and conditioner",
        "Face scrub,cleanser and moisturizer",
        "Natural looking make-up",
        "Great looking clothes",
        "Mouth hygiene products",
        "Sunscreen",
        "Healthy diet, vitamins and lifestyle"
    ],
    "text": " Steps Start with hygiene Have a shower or bath once a day. If your hair is greasy wash it everyday with a shampoo and conditioner. If your hair is nice wash it every two days. Wash your body with a refreshing body wash! After you out of the shower/tub moisturize. Rub lotion in appropriate areas. Wash your face. First with a scrub then a cleanser and finally a moisturizer. Brush your teeth and floss at least twice a day for two minutes each! Try to brush your teeth after each meal if possible but at least  floss. Get your hair trimmed every once in a while.  When wearing make-up go for a natural glowing look!  Apply sunscreen year round  Health! Eat fresh fruits and vegetables, and whole grain\nTake vitamins\nDrink plenty of water! Exercise for an hour everyday on, cardio,legs,abs,butt and even arms! Treat yourself:  Give yourself a pedicure and manicure every so often!  Give yourself a facial!  Clothes Dress your age! Don't wear belly tops, WAY too short shorts, fishnets(unless they are in a costume), or anything that a hooker would wear. Don't wear baggy,too tight,low or dirty clothes. Wear clothes that hug you, but not too tight. Wear clothes that compliment your skin tone  Always smile, not a cheesy fake smile, think of anything that makes you happy for a natural attractive smile. ",
    "sentences": [
        " Steps Start with hygiene Have a shower or bath once a day.",
        "If your hair is greasy wash it everyday with a shampoo and conditioner.",
        "If your hair is nice wash it every two days.",
        "Wash your body with a refreshing body wash!",
        "After you out of the shower/tub moisturize.",
        "Rub lotion in appropriate areas.",
        "Wash your face.",
        "First with a scrub then a cleanser and finally a moisturizer.",
        "Brush your teeth and floss at least twice a day for two minutes each!",
        "Try to brush your teeth after each meal if possible but at least  floss.",
        "Get your hair trimmed every once in a while.",
        "When wearing make-up go for a natural glowing look!",
        "Apply sunscreen year round  Health!",
        "Eat fresh fruits and vegetables, and whole grain\nTake vitamins\nDrink plenty of water!",
        "Exercise for an hour everyday on, cardio,legs,abs,butt and even arms!",
        "Treat yourself:  Give yourself a pedicure and manicure every so often!",
        "Give yourself a facial!",
        "Clothes Dress your age!",
        "Don't wear belly tops, WAY too short shorts, fishnets(unless they are in a costume), or anything that a hooker would wear.",
        "Don't wear baggy,too tight,low or dirty clothes.",
        "Wear clothes that hug you, but not too tight.",
        "Wear clothes that compliment your skin tone  Always smile, not a cheesy fake smile, think of anything that makes you happy for a natural attractive smile."
    ]
}