{
    "title": "How to Recycle Your Socks",
    "url": "https://www.wikihow.com/Recycle-Your-Socks",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Creating a Dust Rag",
            "steps": [
                {
                    "headline": "Pull the sock over your hand.",
                    "description": "Fuzzy socks work best because the texture picks up dust and hair better than smooth socks. Simply stick your hand inside the sock."
                },
                {
                    "headline": "Dampen the sock.",
                    "description": "While fuzzy socks can pick up a lot when dry, other socks cannot. Run the sock under the faucet or add furniture polish. You don’t need a lot, only enough to cover the outside of the sock."
                },
                {
                    "headline": "Wipe dust off your surfaces.",
                    "description": "The sock is ready to be used. Go and wipe it over any surface where dust has collected. When it looks like the sock is too full of hair and dust to pick up more, brush it off over a trash can or turn it inside-out to continue dusting."
                },
                {
                    "headline": "Wash the sock.",
                    "description": "Throw the sock in the washer and dryer cycle with the rest of your laundry. Your sock will come out fresh and ready to use again."
                }
            ]
        },
        {
            "name": "Making a Muscle-Relaxant Pack",
            "steps": [
                {
                    "headline": "Fill the sock with rice.",
                    "description": "The best socks for heat packs are long ones without holes. Add four cups (946.4 mL) of non-instant white rice or other heatable food, including dried corn kernels and flaxseed, to the sock. The amount of filler you use can be adjusted. Less for example makes the heat pack softer and able to be used to focus on smaller areas on your body."
                },
                {
                    "headline": "Tie a knot at the top of the sock.",
                    "description": "Wrap the end of the sock so that you can twist it into the knot. This keeps the filler from spilling out and giving away heat."
                },
                {
                    "headline": "Microwave the sock.",
                    "description": "Limit the amount of time microwaving to one minute at a time and no more than three minutes. The sock can get too hot and the filler can burn. The sock should feel warm to the touch but not painful. Keeping a cup of water in the microwave next to the sock will slow down the heating process."
                },
                {
                    "headline": "Place the sock on your body.",
                    "description": "Now that the sock is warm, it is useful for treating cold, sore, or painful spots. Drape the sock on the painful muscle or area or press it against the area you wish to treat."
                }
            ]
        },
        {
            "name": "Turning a Sock into a Drink Cozy",
            "steps": [
                {
                    "headline": "Measure the length of sock you need.",
                    "description": "If you have a specific size you need, such as for your favorite coffee container, break out the tape measure. Hold it up to the cup. Measure only the part you want covered by the cozy, then add an inch (2.54 cm). Measure up from the toe of the sock. If you want the cozy to bunch up a little, add extra length to your calculation."
                },
                {
                    "headline": "Cut off the top of the sock.",
                    "description": "When you get to the end of the length of sock you need, remove anything above it by cutting across with scissors. At this point, you may be able to use the sock as an undecorated cozy."
                },
                {
                    "headline": "Turn the sock inside-out.",
                    "description": "Reverse the sock. Working with the less attractive inside of the sock will leave you with a better-looking cozy later."
                },
                {
                    "headline": "Fold the sock downwards.",
                    "description": "Find the end that’s going to be the top of your cozy. Take the top and fold it downwards about one inch (2.54 cm)."
                },
                {
                    "headline": "Sew the hem.",
                    "description": "Use a sewing needle to secure the bottom of the folded part to the rest of the sock underneath it. If you don’t want to sew, you can also place bonding tape between the parts of the sock and iron them together or use fabric glue. Fabric glue requires you to place a heavy object, such as a book, on top of the sock and let the glue sit for an hour."
                },
                {
                    "headline": "Turn the sock inside out.",
                    "description": "Reverse the sock again. This time the sewing marks or other adhesive will be on the inside of the cozy where you can no longer see it. For most drink containers, the cozy will be ready for use."
                },
                {
                    "headline": "Cut out a handle.",
                    "description": "In case you are making a cozy for a coffee mug, find the side you want to use for a handle. With scissors, cut a vertical slit in the middle of the sock. Also remove any frayed ends. It is a good idea to apply a little bit of fabric glue around the edges of the hole to protect the threads from fraying."
                }
            ]
        },
        {
            "name": "Crafting a Draft Protector",
            "steps": [
                {
                    "headline": "Add corn kernels to a sock.",
                    "description": "Pour the cup (236.6 mL) of dry kernels or other heat-absorbent foodstuff, such as dried beans or peas, into the sock. Let it settle at the bottom."
                },
                {
                    "headline": "Place quilt batting in the sock.",
                    "description": "Add an equal amount of fluffy stuffing as you did foodstuff. Quilt batting is a heat-absorbent stuffing found at craft stores. You can substitute in another stuffing, such as that from an old pillow."
                },
                {
                    "headline": "Alternate layers.",
                    "description": "Next, add another cup of your corn kernels, then follow it with another cup of quilt batting. Alternate these layers until the sock is stuffed all the way to the top."
                },
                {
                    "headline": "Stuff another sock.",
                    "description": "This is optional but can be done to cover a large crack, such as the underside of a doorway. You may need to create one or two more draft protectors, depending on the length of sock. Repeat the steps to fill these socks with half corn kernels, half stuffing."
                },
                {
                    "headline": "Pull the sock ends over one another.",
                    "description": "Place the open end of one of your socks next to the bottom end of another one, if combining them into a larger draft protector. Pull the open end over the bottom of the next sock. Repeat this with other socks you wish to add."
                },
                {
                    "headline": "Sew the socks together.",
                    "description": "Where the socks meet, take needle and thread. Sew the hem of the outer sock to the one it covers. Alternatively, apply fabric glue and let it rest for an hour. Decorate the socks as you please, such as by sewing on eyes and a tongue to form a snake."
                }
            ]
        },
        {
            "name": "Creating a Dog Toy",
            "steps": [
                {
                    "headline": "Place a tennis ball inside the sock.",
                    "description": "Push the dog’s ball down to the toe of the sock. Other objects that can be put inside the sock instead of a ball include treats or an empty plastic water bottle. The dog will enjoy any of these objects but the sock will cause them to last longer than store-bought toys."
                },
                {
                    "headline": "Tie a knot above the ball.",
                    "description": "Wrap the sock around itself to form a knot. Do this above the ball so the dog has an easier time picking up the toy and won’t chew the ends off immediately. If you want the dog to get the object out right away, such as with a treat, don’t tie the sock. Bunch the sock into a ball."
                },
                {
                    "headline": "Test out the toy with your dog.",
                    "description": "Throw the toy. The dog will likely see that the toy is in the shape of a ball, smell the treat, or hear the water bottle. As long as they’ve seen the object inside the sock, they won’t use your good socks as chew toys."
                },
                {
                    "headline": "Monitor the toy for damage.",
                    "description": "After use, the sock will eventually begin to wear down. Trim off any frayed threads while the sock is in use and pick up torn pieces. When the sock is too damaged, replace the toy. Some dogs may consume pieces of the sock, which can lead to bowel blockage, so be careful and opt for smoother socks."
                }
            ]
        }
    ],
    "tyn": [
        "Water or furniture polish",
        "Dry white rice or other filler",
        "Microwave",
        "Measuring tape or ruler",
        "Cup or bottle",
        "Scissors",
        "Sewing thread or fabric glue",
        "Dry corn kernels or other filler",
        "Quilt batting",
        "Ball, treat, or plastic bottle"
    ],
    "text": " Creating a Dust Rag Pull the sock over your hand. Fuzzy socks work best because the texture picks up dust and hair better than smooth socks. Simply stick your hand inside the sock. Dampen the sock. While fuzzy socks can pick up a lot when dry, other socks cannot. Run the sock under the faucet or add furniture polish. You don’t need a lot, only enough to cover the outside of the sock. Wipe dust off your surfaces. The sock is ready to be used. Go and wipe it over any surface where dust has collected. When it looks like the sock is too full of hair and dust to pick up more, brush it off over a trash can or turn it inside-out to continue dusting. Wash the sock. Throw the sock in the washer and dryer cycle with the rest of your laundry. Your sock will come out fresh and ready to use again. Making a Muscle-Relaxant Pack Fill the sock with rice. The best socks for heat packs are long ones without holes. Add four cups (946.4 mL) of non-instant white rice or other heatable food, including dried corn kernels and flaxseed, to the sock. The amount of filler you use can be adjusted. Less for example makes the heat pack softer and able to be used to focus on smaller areas on your body. Tie a knot at the top of the sock. Wrap the end of the sock so that you can twist it into the knot. This keeps the filler from spilling out and giving away heat. Microwave the sock. Limit the amount of time microwaving to one minute at a time and no more than three minutes. The sock can get too hot and the filler can burn. The sock should feel warm to the touch but not painful. Keeping a cup of water in the microwave next to the sock will slow down the heating process. Place the sock on your body. Now that the sock is warm, it is useful for treating cold, sore, or painful spots. Drape the sock on the painful muscle or area or press it against the area you wish to treat. Turning a Sock into a Drink Cozy Measure the length of sock you need. If you have a specific size you need, such as for your favorite coffee container, break out the tape measure. Hold it up to the cup. Measure only the part you want covered by the cozy, then add an inch (2.54 cm). Measure up from the toe of the sock. If you want the cozy to bunch up a little, add extra length to your calculation. Cut off the top of the sock. When you get to the end of the length of sock you need, remove anything above it by cutting across with scissors. At this point, you may be able to use the sock as an undecorated cozy. Turn the sock inside-out. Reverse the sock. Working with the less attractive inside of the sock will leave you with a better-looking cozy later. Fold the sock downwards. Find the end that’s going to be the top of your cozy. Take the top and fold it downwards about one inch (2.54 cm). Sew the hem. Use a sewing needle to secure the bottom of the folded part to the rest of the sock underneath it. If you don’t want to sew, you can also place bonding tape between the parts of the sock and iron them together or use fabric glue. Fabric glue requires you to place a heavy object, such as a book, on top of the sock and let the glue sit for an hour. Turn the sock inside out. Reverse the sock again. This time the sewing marks or other adhesive will be on the inside of the cozy where you can no longer see it. For most drink containers, the cozy will be ready for use. Cut out a handle. In case you are making a cozy for a coffee mug, find the side you want to use for a handle. With scissors, cut a vertical slit in the middle of the sock. Also remove any frayed ends. It is a good idea to apply a little bit of fabric glue around the edges of the hole to protect the threads from fraying. Crafting a Draft Protector Add corn kernels to a sock. Pour the cup (236.6 mL) of dry kernels or other heat-absorbent foodstuff, such as dried beans or peas, into the sock. Let it settle at the bottom. Place quilt batting in the sock. Add an equal amount of fluffy stuffing as you did foodstuff. Quilt batting is a heat-absorbent stuffing found at craft stores. You can substitute in another stuffing, such as that from an old pillow. Alternate layers. Next, add another cup of your corn kernels, then follow it with another cup of quilt batting. Alternate these layers until the sock is stuffed all the way to the top. Stuff another sock. This is optional but can be done to cover a large crack, such as the underside of a doorway. You may need to create one or two more draft protectors, depending on the length of sock. Repeat the steps to fill these socks with half corn kernels, half stuffing. Pull the sock ends over one another. Place the open end of one of your socks next to the bottom end of another one, if combining them into a larger draft protector. Pull the open end over the bottom of the next sock. Repeat this with other socks you wish to add. Sew the socks together. Where the socks meet, take needle and thread. Sew the hem of the outer sock to the one it covers. Alternatively, apply fabric glue and let it rest for an hour. Decorate the socks as you please, such as by sewing on eyes and a tongue to form a snake. Creating a Dog Toy Place a tennis ball inside the sock. Push the dog’s ball down to the toe of the sock. Other objects that can be put inside the sock instead of a ball include treats or an empty plastic water bottle. The dog will enjoy any of these objects but the sock will cause them to last longer than store-bought toys. Tie a knot above the ball. Wrap the sock around itself to form a knot. Do this above the ball so the dog has an easier time picking up the toy and won’t chew the ends off immediately. If you want the dog to get the object out right away, such as with a treat, don’t tie the sock. Bunch the sock into a ball. Test out the toy with your dog. Throw the toy. The dog will likely see that the toy is in the shape of a ball, smell the treat, or hear the water bottle. As long as they’ve seen the object inside the sock, they won’t use your good socks as chew toys. Monitor the toy for damage. After use, the sock will eventually begin to wear down. Trim off any frayed threads while the sock is in use and pick up torn pieces. When the sock is too damaged, replace the toy. Some dogs may consume pieces of the sock, which can lead to bowel blockage, so be careful and opt for smoother socks.",
    "sentences": [
        " Creating a Dust Rag Pull the sock over your hand.",
        "Fuzzy socks work best because the texture picks up dust and hair better than smooth socks.",
        "Simply stick your hand inside the sock.",
        "Dampen the sock.",
        "While fuzzy socks can pick up a lot when dry, other socks cannot.",
        "Run the sock under the faucet or add furniture polish.",
        "You don’t need a lot, only enough to cover the outside of the sock.",
        "Wipe dust off your surfaces.",
        "The sock is ready to be used.",
        "Go and wipe it over any surface where dust has collected.",
        "When it looks like the sock is too full of hair and dust to pick up more, brush it off over a trash can or turn it inside-out to continue dusting.",
        "Wash the sock.",
        "Throw the sock in the washer and dryer cycle with the rest of your laundry.",
        "Your sock will come out fresh and ready to use again.",
        "Making a Muscle-Relaxant Pack Fill the sock with rice.",
        "The best socks for heat packs are long ones without holes.",
        "Add four cups (946.4 mL) of non-instant white rice or other heatable food, including dried corn kernels and flaxseed, to the sock.",
        "The amount of filler you use can be adjusted.",
        "Less for example makes the heat pack softer and able to be used to focus on smaller areas on your body.",
        "Tie a knot at the top of the sock.",
        "Wrap the end of the sock so that you can twist it into the knot.",
        "This keeps the filler from spilling out and giving away heat.",
        "Microwave the sock.",
        "Limit the amount of time microwaving to one minute at a time and no more than three minutes.",
        "The sock can get too hot and the filler can burn.",
        "The sock should feel warm to the touch but not painful.",
        "Keeping a cup of water in the microwave next to the sock will slow down the heating process.",
        "Place the sock on your body.",
        "Now that the sock is warm, it is useful for treating cold, sore, or painful spots.",
        "Drape the sock on the painful muscle or area or press it against the area you wish to treat.",
        "Turning a Sock into a Drink Cozy Measure the length of sock you need.",
        "If you have a specific size you need, such as for your favorite coffee container, break out the tape measure.",
        "Hold it up to the cup.",
        "Measure only the part you want covered by the cozy, then add an inch (2.54 cm).",
        "Measure up from the toe of the sock.",
        "If you want the cozy to bunch up a little, add extra length to your calculation.",
        "Cut off the top of the sock.",
        "When you get to the end of the length of sock you need, remove anything above it by cutting across with scissors.",
        "At this point, you may be able to use the sock as an undecorated cozy.",
        "Turn the sock inside-out.",
        "Reverse the sock.",
        "Working with the less attractive inside of the sock will leave you with a better-looking cozy later.",
        "Fold the sock downwards.",
        "Find the end that’s going to be the top of your cozy.",
        "Take the top and fold it downwards about one inch (2.54 cm).",
        "Sew the hem.",
        "Use a sewing needle to secure the bottom of the folded part to the rest of the sock underneath it.",
        "If you don’t want to sew, you can also place bonding tape between the parts of the sock and iron them together or use fabric glue.",
        "Fabric glue requires you to place a heavy object, such as a book, on top of the sock and let the glue sit for an hour.",
        "Turn the sock inside out.",
        "Reverse the sock again.",
        "This time the sewing marks or other adhesive will be on the inside of the cozy where you can no longer see it.",
        "For most drink containers, the cozy will be ready for use.",
        "Cut out a handle.",
        "In case you are making a cozy for a coffee mug, find the side you want to use for a handle.",
        "With scissors, cut a vertical slit in the middle of the sock.",
        "Also remove any frayed ends.",
        "It is a good idea to apply a little bit of fabric glue around the edges of the hole to protect the threads from fraying.",
        "Crafting a Draft Protector Add corn kernels to a sock.",
        "Pour the cup (236.6 mL) of dry kernels or other heat-absorbent foodstuff, such as dried beans or peas, into the sock.",
        "Let it settle at the bottom.",
        "Place quilt batting in the sock.",
        "Add an equal amount of fluffy stuffing as you did foodstuff.",
        "Quilt batting is a heat-absorbent stuffing found at craft stores.",
        "You can substitute in another stuffing, such as that from an old pillow.",
        "Alternate layers.",
        "Next, add another cup of your corn kernels, then follow it with another cup of quilt batting.",
        "Alternate these layers until the sock is stuffed all the way to the top.",
        "Stuff another sock.",
        "This is optional but can be done to cover a large crack, such as the underside of a doorway.",
        "You may need to create one or two more draft protectors, depending on the length of sock.",
        "Repeat the steps to fill these socks with half corn kernels, half stuffing.",
        "Pull the sock ends over one another.",
        "Place the open end of one of your socks next to the bottom end of another one, if combining them into a larger draft protector.",
        "Pull the open end over the bottom of the next sock.",
        "Repeat this with other socks you wish to add.",
        "Sew the socks together.",
        "Where the socks meet, take needle and thread.",
        "Sew the hem of the outer sock to the one it covers.",
        "Alternatively, apply fabric glue and let it rest for an hour.",
        "Decorate the socks as you please, such as by sewing on eyes and a tongue to form a snake.",
        "Creating a Dog Toy Place a tennis ball inside the sock.",
        "Push the dog’s ball down to the toe of the sock.",
        "Other objects that can be put inside the sock instead of a ball include treats or an empty plastic water bottle.",
        "The dog will enjoy any of these objects but the sock will cause them to last longer than store-bought toys.",
        "Tie a knot above the ball.",
        "Wrap the sock around itself to form a knot.",
        "Do this above the ball so the dog has an easier time picking up the toy and won’t chew the ends off immediately.",
        "If you want the dog to get the object out right away, such as with a treat, don’t tie the sock.",
        "Bunch the sock into a ball.",
        "Test out the toy with your dog.",
        "Throw the toy.",
        "The dog will likely see that the toy is in the shape of a ball, smell the treat, or hear the water bottle.",
        "As long as they’ve seen the object inside the sock, they won’t use your good socks as chew toys.",
        "Monitor the toy for damage.",
        "After use, the sock will eventually begin to wear down.",
        "Trim off any frayed threads while the sock is in use and pick up torn pieces.",
        "When the sock is too damaged, replace the toy.",
        "Some dogs may consume pieces of the sock, which can lead to bowel blockage, so be careful and opt for smoother socks."
    ]
}