{
    "title": "How to Clean a Concrete Pool",
    "url": "https://www.wikihow.com/Clean-a-Concrete-Pool",
    "category_hierarchy": [
        "Home and Garden",
        "Housekeeping",
        "Cleaning"
    ],
    "steps": [
        {
            "headline": "Drain pool and periodically spray sides of pool to loosen dirt and grime.",
            "description": ""
        },
        {
            "headline": "Once empty, physically remove debris with shovels and brooms, using hose with power nozzle to wash dirt to the puddle.",
            "description": "A 5 gallon (18.9 L) bucket works well for carrying the debris up and out of the pool. Small pails can bail the remaining water into the 5 gallon (18.9 L) bucket for removal."
        },
        {
            "headline": "Cleaning solution: In a clean 2 gallon (7.6 L) bucket, mix 1/4 cup TSP (TriSodium Phosphate powder, available in paint dept.",
            "description": "of home improvement center), 1/2 cup laundry powder, 1 US-quart (950 ml) laundry bleach, 3 US quarts (3,000 ml) warm water. Makes 1 gallon (3.8 L)."
        },
        {
            "headline": "Wear protective gloves and long pants for the following:  Wet the pool with hose, then apply cleaning solution with a long handle brush to the walls and bottom of the pool.",
            "description": ""
        },
        {
            "headline": "Let stand 30 minutes, then brush from top to bottom, using additional solution as needed.",
            "description": "Time is the magic ingredient."
        },
        {
            "headline": "Rinse with clear water, and repeat as needed.",
            "description": "Do not let the solution stay on the surface too long."
        }
    ],
    "tyn": [
        "Stiff scrub brush with a long handle.",
        "Flat shovel.",
        "Broom.",
        "Some 2 and 5 gallon buckets (empty pool chemical buckets are fine).",
        "Garden water hose with power nozzle.",
        "1/4 cup TSP (TriSodium Phosphate powder, available in paint dept. of home improvement center - 1 lb. box is enough).",
        "1/2 cup laundry powder.",
        "1 quart laundry bleach.",
        "3 quarts warm water."
    ],
    "text": " Drain pool and periodically spray sides of pool to loosen dirt and grime.  Once empty, physically remove debris with shovels and brooms, using hose with power nozzle to wash dirt to the puddle. A 5 gallon (18.9 L) bucket works well for carrying the debris up and out of the pool. Small pails can bail the remaining water into the 5 gallon (18.9 L) bucket for removal. Cleaning solution: In a clean 2 gallon (7.6 L) bucket, mix 1/4 cup TSP (TriSodium Phosphate powder, available in paint dept. of home improvement center), 1/2 cup laundry powder, 1 US-quart (950 ml) laundry bleach, 3 US quarts (3,000 ml) warm water. Makes 1 gallon (3.8 L). Wear protective gloves and long pants for the following:  Wet the pool with hose, then apply cleaning solution with a long handle brush to the walls and bottom of the pool.  Let stand 30 minutes, then brush from top to bottom, using additional solution as needed. Time is the magic ingredient. Rinse with clear water, and repeat as needed. Do not let the solution stay on the surface too long.",
    "sentences": [
        " Drain pool and periodically spray sides of pool to loosen dirt and grime.",
        "Once empty, physically remove debris with shovels and brooms, using hose with power nozzle to wash dirt to the puddle.",
        "A 5 gallon (18.9 L) bucket works well for carrying the debris up and out of the pool.",
        "Small pails can bail the remaining water into the 5 gallon (18.9 L) bucket for removal.",
        "Cleaning solution: In a clean 2 gallon (7.6 L) bucket, mix 1/4 cup TSP (TriSodium Phosphate powder, available in paint dept.",
        "of home improvement center), 1/2 cup laundry powder, 1 US-quart (950 ml) laundry bleach, 3 US quarts (3,000 ml) warm water.",
        "Makes 1 gallon (3.8 L).",
        "Wear protective gloves and long pants for the following:  Wet the pool with hose, then apply cleaning solution with a long handle brush to the walls and bottom of the pool.",
        "Let stand 30 minutes, then brush from top to bottom, using additional solution as needed.",
        "Time is the magic ingredient.",
        "Rinse with clear water, and repeat as needed.",
        "Do not let the solution stay on the surface too long."
    ]
}