{
    "title": "How to Fly Domestically With Your Dog",
    "url": "https://www.wikihow.com/Fly-Domestically-With-Your-Dog",
    "category_hierarchy": [
        "Pets and Animals",
        "Dogs"
    ],
    "parts": [
        {
            "name": "Making Advance Preparations",
            "steps": [
                {
                    "headline": "Add your dog to your flight when you book your ticket.",
                    "description": "When booking your own flight, you should see an option to add a pet to your ticket. Carry-on pets are more expensive to pay for than checked pets, but on average, you should expect to pay at least $100 to bring your dog with you on the plane. Almost all major airlines will allow pets, but call in advance for smaller companies and private flights for their specific regulations. Service animals and therapy animals are treated differently from airline to airline — most will accept a service dog in the cabin at no cost, but be sure to check in advance to learn your airline's specific considerations for service animals. Make sure you bring proof that your dog is a service animal just in case it's requested."
                },
                {
                    "headline": "Obtain a health certificate from your dog's veterinarian within 30 days of the flight.",
                    "description": "Your dog must be at least 8 weeks old and in good health to be allowed to fly on most airlines. Make sure your dog's vaccinations are up-to-date, specifically its rabies vaccination. You should receive a health certificate confirming your dog's fitness to travel dated within 30 days of when you plan to travel the flight, and within 60 days of the return flight for round trips. If the plane will be landing in a place with temperatures below 45 °F (7 °C) or above 85 °F (29 °C) you will need to get a veterinarian's note that says your dog is fit for extreme weather conditions."
                },
                {
                    "headline": "Choose a large carrier to check in or a small carrier to store in the cabin.",
                    "description": "A carrier can only be brought into the cabin of a flight if it fits under the chair in front of you — if it's the same size as a carry-on bag, it is fine to bring into the cabin. A large carrier must be checked in and stored with baggage in the plane. It is recommended for dogs with breathing problems, such as pugs and other snub nose breeds, to travel in the cabin. Ensure there are plenty of ventilation holes in the carrier so air can circulate correctly."
                },
                {
                    "headline": "Introduce your dog to its carrier many times every day for a month before the trip.",
                    "description": "Once you have bought a carrier, put your dog inside it for a few minutes every day to get it used to being in there. As you get closer to the date of the flight, keep it in the carrier for longer and longer — keep your dog in the carrier overnight 2 or 3 days before the flight to get it used to being in the kennel for hours at a time. Be sure to give your dog a treat when it begins to get used to the carrier. Consider giving your dog its food and water in the carrier in the weeks leading up to the plane trip. This will get it used to the container and will reduce its anxiety during the flight."
                },
                {
                    "headline": "Attach identification tags to your dog's carrier and write 'Live Animal' on top.",
                    "description": "Write your dog's name, its breed, your name, your phone number, and your address on a tag and attach it to the carrier.Then, either with a large permanent marker or pre-made stickers, write 'live animal' on the top of the carrier, so airline staff are aware that it is not empty. It's a good idea to ID chip your dog. That way, it can easily be identified as your dog if it somehow escapes its carrier."
                },
                {
                    "headline": "Call a day in advance to make sure the airline knows that you will be bringing a dog.",
                    "description": "Through bureaucratic errors, airlines can sometimes forget that you will be bringing your dog with you on a flight. Call a day or two ahead of time to make sure they are still aware of your dog's reservation and your plans to check it in or bring it in the cabin."
                }
            ]
        },
        {
            "name": "Preparing for the Flight",
            "steps": [
                {
                    "headline": "Feed your dog exactly 4 hours before getting on the plane.",
                    "description": "Your dog needs to be fed before the flight, but if you feed it too close to takeoff and it could have an upset stomach in the air. Feed your dog no sooner than 4 hours before the flight, as this allows your dog time to digest its food. If your dog ends up relieving itself before the flight, be sure to clean it up in the carrier — it isn't very nice to make the airport staff deal with it, and if it ends up not being cleaned, it could fly around the carrier in the air. If your dog is particularly prone to stomach issues, it is recommended to feed your dog in the morning before you leave and avoid giving your dog food at the airport altogether."
                },
                {
                    "headline": "Take your dog for a walk around the airport to reduce its stress.",
                    "description": "Air travel is very stressful for dogs — take it for a walk around the airport before you check in to relieve some of your dog's energy and anxiety. Many airports have a dog park, so check in advance to see if you can bring your dog there. If the airport does not have a dog park, bring your dog for a walk around the parking lot, or take it for a long walk in the morning before you leave home. Do your best to give your dog a chance to relieve itself just before you put it in the carrier. If you are in a rush and don't have time to walk your dog, try to comfort it as best as you can in the carrier while waiting to take off, but be careful not to over-excite it."
                },
                {
                    "headline": "Lay puppy pads or another absorbent material on the bottom of the carrier.",
                    "description": "Your dog will likely need to relieve itself at some point during the flight. Lay a few puppy pads on the bottom of the carrier, or use an absorbent material such as an old blanket you don't mind being soiled. Other good choices for absorbent materials include old clothes and old blankets you don't mind getting a little dirty."
                },
                {
                    "headline": "Give your dog water as you normally would until you check it in or begin boarding.",
                    "description": "Give your dog water in a bowl up until you part ways for the flight. Empty the bowl before you board so water doesn't spill during takeoff. If your dog will be in the cabin with you, only give it water once the seatbelt sign has turned off. Consider freezing water in a specialty water dripper in the carrier so your dog is hydrated in the air if your dog will be checked in with baggage."
                },
                {
                    "headline": "Check your dog in at the designated location.",
                    "description": "Airlines will have different locations for checking in an animal, but generally, pets are checked in either at the passenger terminal or at air baggage. If you will be bringing your dog in the cabin with you, check it in at the ticket counter at the terminal. Call in advance or check your airline's website to find out its guidelines for checking in a dog. Every airline has slightly different check-in procedures for dogs."
                }
            ]
        },
        {
            "name": "Checking in with Your Dog upon Landing",
            "steps": [
                {
                    "headline": "Pick up your dog at the cargo terminal upon landing if you checked it in.",
                    "description": "You should be able to find your pet at the regular baggage pick-up location, but check in advance to see if your airline follows a different procedure. The attendant who picked up your dog at the time of departure will let you know where to pick up your dog. For some flights, there may be a special baggage terminal for animal companions. Check there first, then check the regular baggage location. If all else fails, talk to the airline's claims or information attendants to find out what happened to your dog and where to pick it up at."
                },
                {
                    "headline": "Examine your dog closely to see if there is anything wrong with it.",
                    "description": "Once you have landed and picked up your dog, check it closely to see if anything happened to it in flight. Dogs may be thrown by sudden turbulence, may be nauseous from the flight, or in some cases may have been mistreated by airline staff. If there is any damage to your dog, take pictures, and contact the airline and your insurance company directly. Take pictures of your dog before you leave for the flight to show your insurance company or the airline that your dog was healthy before departure and compare your dog's health before and after. Take down the numbers of local vets at the place you land at to be able to quickly treat your dog if it was hurt in the flight."
                },
                {
                    "headline": "Take your dog for a walk and play with it when you land.",
                    "description": "Your dog will likely be stressed from being in an enclosed space in a harsh environment away from you. Take your dog for a good walk and play with it outside of the carrier until you are sure that it is a little more relaxed and recovered from the experience. Bring some of its favorite toys to play with, as these will be a reminder of something familiar that will help to bring your dog back to earth, so to say."
                },
                {
                    "headline": "Change out the puppy pads, feed your dog, and re-fill the water in the carrier.",
                    "description": "Before you leave for your destination after landing, be sure to change out any soiled absorbent padding, re-fill your dog's water bottle, and give it a little food to settle its stomach. Don't feed it too much, as it may still be a little uneasy after the flight."
                }
            ]
        }
    ],
    "tyn": [
        "Collar",
        "Tags",
        "Any medication (if the dog takes any)",
        "Bottled water",
        "Favorite food/ treats",
        "Bowls",
        "Contact info for veterinarians and emergency clinics at destination",
        "Favorite toys"
    ],
    "text": " Making Advance Preparations Add your dog to your flight when you book your ticket. When booking your own flight, you should see an option to add a pet to your ticket. Carry-on pets are more expensive to pay for than checked pets, but on average, you should expect to pay at least $100 to bring your dog with you on the plane. Almost all major airlines will allow pets, but call in advance for smaller companies and private flights for their specific regulations. Service animals and therapy animals are treated differently from airline to airline — most will accept a service dog in the cabin at no cost, but be sure to check in advance to learn your airline's specific considerations for service animals. Make sure you bring proof that your dog is a service animal just in case it's requested. Obtain a health certificate from your dog's veterinarian within 30 days of the flight. Your dog must be at least 8 weeks old and in good health to be allowed to fly on most airlines. Make sure your dog's vaccinations are up-to-date, specifically its rabies vaccination. You should receive a health certificate confirming your dog's fitness to travel dated within 30 days of when you plan to travel the flight, and within 60 days of the return flight for round trips. If the plane will be landing in a place with temperatures below 45 °F (7 °C) or above 85 °F (29 °C) you will need to get a veterinarian's note that says your dog is fit for extreme weather conditions. Choose a large carrier to check in or a small carrier to store in the cabin. A carrier can only be brought into the cabin of a flight if it fits under the chair in front of you — if it's the same size as a carry-on bag, it is fine to bring into the cabin. A large carrier must be checked in and stored with baggage in the plane. It is recommended for dogs with breathing problems, such as pugs and other snub nose breeds, to travel in the cabin. Ensure there are plenty of ventilation holes in the carrier so air can circulate correctly. Introduce your dog to its carrier many times every day for a month before the trip. Once you have bought a carrier, put your dog inside it for a few minutes every day to get it used to being in there. As you get closer to the date of the flight, keep it in the carrier for longer and longer — keep your dog in the carrier overnight 2 or 3 days before the flight to get it used to being in the kennel for hours at a time. Be sure to give your dog a treat when it begins to get used to the carrier. Consider giving your dog its food and water in the carrier in the weeks leading up to the plane trip. This will get it used to the container and will reduce its anxiety during the flight. Attach identification tags to your dog's carrier and write 'Live Animal' on top. Write your dog's name, its breed, your name, your phone number, and your address on a tag and attach it to the carrier.Then, either with a large permanent marker or pre-made stickers, write 'live animal' on the top of the carrier, so airline staff are aware that it is not empty. It's a good idea to ID chip your dog. That way, it can easily be identified as your dog if it somehow escapes its carrier. Call a day in advance to make sure the airline knows that you will be bringing a dog. Through bureaucratic errors, airlines can sometimes forget that you will be bringing your dog with you on a flight. Call a day or two ahead of time to make sure they are still aware of your dog's reservation and your plans to check it in or bring it in the cabin. Preparing for the Flight Feed your dog exactly 4 hours before getting on the plane. Your dog needs to be fed before the flight, but if you feed it too close to takeoff and it could have an upset stomach in the air. Feed your dog no sooner than 4 hours before the flight, as this allows your dog time to digest its food. If your dog ends up relieving itself before the flight, be sure to clean it up in the carrier — it isn't very nice to make the airport staff deal with it, and if it ends up not being cleaned, it could fly around the carrier in the air. If your dog is particularly prone to stomach issues, it is recommended to feed your dog in the morning before you leave and avoid giving your dog food at the airport altogether. Take your dog for a walk around the airport to reduce its stress. Air travel is very stressful for dogs — take it for a walk around the airport before you check in to relieve some of your dog's energy and anxiety. Many airports have a dog park, so check in advance to see if you can bring your dog there. If the airport does not have a dog park, bring your dog for a walk around the parking lot, or take it for a long walk in the morning before you leave home. Do your best to give your dog a chance to relieve itself just before you put it in the carrier. If you are in a rush and don't have time to walk your dog, try to comfort it as best as you can in the carrier while waiting to take off, but be careful not to over-excite it. Lay puppy pads or another absorbent material on the bottom of the carrier. Your dog will likely need to relieve itself at some point during the flight. Lay a few puppy pads on the bottom of the carrier, or use an absorbent material such as an old blanket you don't mind being soiled. Other good choices for absorbent materials include old clothes and old blankets you don't mind getting a little dirty. Give your dog water as you normally would until you check it in or begin boarding. Give your dog water in a bowl up until you part ways for the flight. Empty the bowl before you board so water doesn't spill during takeoff. If your dog will be in the cabin with you, only give it water once the seatbelt sign has turned off. Consider freezing water in a specialty water dripper in the carrier so your dog is hydrated in the air if your dog will be checked in with baggage. Check your dog in at the designated location. Airlines will have different locations for checking in an animal, but generally, pets are checked in either at the passenger terminal or at air baggage. If you will be bringing your dog in the cabin with you, check it in at the ticket counter at the terminal. Call in advance or check your airline's website to find out its guidelines for checking in a dog. Every airline has slightly different check-in procedures for dogs. Checking in with Your Dog upon Landing Pick up your dog at the cargo terminal upon landing if you checked it in. You should be able to find your pet at the regular baggage pick-up location, but check in advance to see if your airline follows a different procedure. The attendant who picked up your dog at the time of departure will let you know where to pick up your dog. For some flights, there may be a special baggage terminal for animal companions. Check there first, then check the regular baggage location. If all else fails, talk to the airline's claims or information attendants to find out what happened to your dog and where to pick it up at. Examine your dog closely to see if there is anything wrong with it. Once you have landed and picked up your dog, check it closely to see if anything happened to it in flight. Dogs may be thrown by sudden turbulence, may be nauseous from the flight, or in some cases may have been mistreated by airline staff. If there is any damage to your dog, take pictures, and contact the airline and your insurance company directly. Take pictures of your dog before you leave for the flight to show your insurance company or the airline that your dog was healthy before departure and compare your dog's health before and after. Take down the numbers of local vets at the place you land at to be able to quickly treat your dog if it was hurt in the flight. Take your dog for a walk and play with it when you land. Your dog will likely be stressed from being in an enclosed space in a harsh environment away from you. Take your dog for a good walk and play with it outside of the carrier until you are sure that it is a little more relaxed and recovered from the experience. Bring some of its favorite toys to play with, as these will be a reminder of something familiar that will help to bring your dog back to earth, so to say. Change out the puppy pads, feed your dog, and re-fill the water in the carrier. Before you leave for your destination after landing, be sure to change out any soiled absorbent padding, re-fill your dog's water bottle, and give it a little food to settle its stomach. Don't feed it too much, as it may still be a little uneasy after the flight.",
    "sentences": [
        " Making Advance Preparations Add your dog to your flight when you book your ticket.",
        "When booking your own flight, you should see an option to add a pet to your ticket.",
        "Carry-on pets are more expensive to pay for than checked pets, but on average, you should expect to pay at least $100 to bring your dog with you on the plane.",
        "Almost all major airlines will allow pets, but call in advance for smaller companies and private flights for their specific regulations.",
        "Service animals and therapy animals are treated differently from airline to airline — most will accept a service dog in the cabin at no cost, but be sure to check in advance to learn your airline's specific considerations for service animals.",
        "Make sure you bring proof that your dog is a service animal just in case it's requested.",
        "Obtain a health certificate from your dog's veterinarian within 30 days of the flight.",
        "Your dog must be at least 8 weeks old and in good health to be allowed to fly on most airlines.",
        "Make sure your dog's vaccinations are up-to-date, specifically its rabies vaccination.",
        "You should receive a health certificate confirming your dog's fitness to travel dated within 30 days of when you plan to travel the flight, and within 60 days of the return flight for round trips.",
        "If the plane will be landing in a place with temperatures below 45 °F (7 °C) or above 85 °F (29 °C) you will need to get a veterinarian's note that says your dog is fit for extreme weather conditions.",
        "Choose a large carrier to check in or a small carrier to store in the cabin.",
        "A carrier can only be brought into the cabin of a flight if it fits under the chair in front of you — if it's the same size as a carry-on bag, it is fine to bring into the cabin.",
        "A large carrier must be checked in and stored with baggage in the plane.",
        "It is recommended for dogs with breathing problems, such as pugs and other snub nose breeds, to travel in the cabin.",
        "Ensure there are plenty of ventilation holes in the carrier so air can circulate correctly.",
        "Introduce your dog to its carrier many times every day for a month before the trip.",
        "Once you have bought a carrier, put your dog inside it for a few minutes every day to get it used to being in there.",
        "As you get closer to the date of the flight, keep it in the carrier for longer and longer — keep your dog in the carrier overnight 2 or 3 days before the flight to get it used to being in the kennel for hours at a time.",
        "Be sure to give your dog a treat when it begins to get used to the carrier.",
        "Consider giving your dog its food and water in the carrier in the weeks leading up to the plane trip.",
        "This will get it used to the container and will reduce its anxiety during the flight.",
        "Attach identification tags to your dog's carrier and write 'Live Animal' on top.",
        "Write your dog's name, its breed, your name, your phone number, and your address on a tag and attach it to the carrier.Then, either with a large permanent marker or pre-made stickers, write 'live animal' on the top of the carrier, so airline staff are aware that it is not empty.",
        "It's a good idea to ID chip your dog.",
        "That way, it can easily be identified as your dog if it somehow escapes its carrier.",
        "Call a day in advance to make sure the airline knows that you will be bringing a dog.",
        "Through bureaucratic errors, airlines can sometimes forget that you will be bringing your dog with you on a flight.",
        "Call a day or two ahead of time to make sure they are still aware of your dog's reservation and your plans to check it in or bring it in the cabin.",
        "Preparing for the Flight Feed your dog exactly 4 hours before getting on the plane.",
        "Your dog needs to be fed before the flight, but if you feed it too close to takeoff and it could have an upset stomach in the air.",
        "Feed your dog no sooner than 4 hours before the flight, as this allows your dog time to digest its food.",
        "If your dog ends up relieving itself before the flight, be sure to clean it up in the carrier — it isn't very nice to make the airport staff deal with it, and if it ends up not being cleaned, it could fly around the carrier in the air.",
        "If your dog is particularly prone to stomach issues, it is recommended to feed your dog in the morning before you leave and avoid giving your dog food at the airport altogether.",
        "Take your dog for a walk around the airport to reduce its stress.",
        "Air travel is very stressful for dogs — take it for a walk around the airport before you check in to relieve some of your dog's energy and anxiety.",
        "Many airports have a dog park, so check in advance to see if you can bring your dog there.",
        "If the airport does not have a dog park, bring your dog for a walk around the parking lot, or take it for a long walk in the morning before you leave home.",
        "Do your best to give your dog a chance to relieve itself just before you put it in the carrier.",
        "If you are in a rush and don't have time to walk your dog, try to comfort it as best as you can in the carrier while waiting to take off, but be careful not to over-excite it.",
        "Lay puppy pads or another absorbent material on the bottom of the carrier.",
        "Your dog will likely need to relieve itself at some point during the flight.",
        "Lay a few puppy pads on the bottom of the carrier, or use an absorbent material such as an old blanket you don't mind being soiled.",
        "Other good choices for absorbent materials include old clothes and old blankets you don't mind getting a little dirty.",
        "Give your dog water as you normally would until you check it in or begin boarding.",
        "Give your dog water in a bowl up until you part ways for the flight.",
        "Empty the bowl before you board so water doesn't spill during takeoff.",
        "If your dog will be in the cabin with you, only give it water once the seatbelt sign has turned off.",
        "Consider freezing water in a specialty water dripper in the carrier so your dog is hydrated in the air if your dog will be checked in with baggage.",
        "Check your dog in at the designated location.",
        "Airlines will have different locations for checking in an animal, but generally, pets are checked in either at the passenger terminal or at air baggage.",
        "If you will be bringing your dog in the cabin with you, check it in at the ticket counter at the terminal.",
        "Call in advance or check your airline's website to find out its guidelines for checking in a dog.",
        "Every airline has slightly different check-in procedures for dogs.",
        "Checking in with Your Dog upon Landing Pick up your dog at the cargo terminal upon landing if you checked it in.",
        "You should be able to find your pet at the regular baggage pick-up location, but check in advance to see if your airline follows a different procedure.",
        "The attendant who picked up your dog at the time of departure will let you know where to pick up your dog.",
        "For some flights, there may be a special baggage terminal for animal companions.",
        "Check there first, then check the regular baggage location.",
        "If all else fails, talk to the airline's claims or information attendants to find out what happened to your dog and where to pick it up at.",
        "Examine your dog closely to see if there is anything wrong with it.",
        "Once you have landed and picked up your dog, check it closely to see if anything happened to it in flight.",
        "Dogs may be thrown by sudden turbulence, may be nauseous from the flight, or in some cases may have been mistreated by airline staff.",
        "If there is any damage to your dog, take pictures, and contact the airline and your insurance company directly.",
        "Take pictures of your dog before you leave for the flight to show your insurance company or the airline that your dog was healthy before departure and compare your dog's health before and after.",
        "Take down the numbers of local vets at the place you land at to be able to quickly treat your dog if it was hurt in the flight.",
        "Take your dog for a walk and play with it when you land.",
        "Your dog will likely be stressed from being in an enclosed space in a harsh environment away from you.",
        "Take your dog for a good walk and play with it outside of the carrier until you are sure that it is a little more relaxed and recovered from the experience.",
        "Bring some of its favorite toys to play with, as these will be a reminder of something familiar that will help to bring your dog back to earth, so to say.",
        "Change out the puppy pads, feed your dog, and re-fill the water in the carrier.",
        "Before you leave for your destination after landing, be sure to change out any soiled absorbent padding, re-fill your dog's water bottle, and give it a little food to settle its stomach.",
        "Don't feed it too much, as it may still be a little uneasy after the flight."
    ]
}