{
    "title": "How to Press Crumbled Eyeshadow",
    "url": "https://www.wikihow.com/Press-Crumbled-Eyeshadow",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Makeup",
        "Makeup Accessories",
        "Care of Makeup",
        "Makeup Repairs"
    ],
    "steps": [
        {
            "headline": "Get a small pot or container and a stick or spatula of your choice.",
            "description": ""
        },
        {
            "headline": "Taking the stick, remove all the eyeshadow from the pot, before moving it into your container.",
            "description": ""
        },
        {
            "headline": "Using a small brush, remove all the tiny bits and pieces left behind, and add them to your container.",
            "description": "It may seem silly, but you'd be surprised at how much this adds up."
        },
        {
            "headline": "Clean the eyeshadow pot thoroughly.",
            "description": ""
        },
        {
            "headline": "Break up the eye shadow so that there are no more lumps left behind.",
            "description": "You should have a fairly fine powder."
        },
        {
            "headline": "Taking any alcohol you have (like vodka), mix a little into the eyeshadow to form a paste.",
            "description": "If need be, add a little more."
        },
        {
            "headline": "Taking your stick or spatula, move the paste into the eyeshadow pot.",
            "description": "You can also use your fingers for this step."
        },
        {
            "headline": "Take a small dish and fill it with alcohol (not too much, though!).",
            "description": "Wrap a small coin (about the size of your eyeshadow pot) in a piece of cloth and dip it into the alcohol, so that the cloth it totally wet."
        },
        {
            "headline": "Taking the coin, press it down onto your eyeshadow pot.",
            "description": "This will help smooth out your eye makeup."
        },
        {
            "headline": "Clean up around the edges and that's it, you're done!",
            "description": ""
        }
    ],
    "tyn": [
        "Broken eyeshadow",
        "Small container",
        "Small dish",
        "Small paintbrush",
        "Stick/Spatula",
        "Coin/Something small and rounded",
        "Cloth"
    ],
    "text": " Get a small pot or container and a stick or spatula of your choice.  Taking the stick, remove all the eyeshadow from the pot, before moving it into your container.  Using a small brush, remove all the tiny bits and pieces left behind, and add them to your container. It may seem silly, but you'd be surprised at how much this adds up. Clean the eyeshadow pot thoroughly.  Break up the eye shadow so that there are no more lumps left behind. You should have a fairly fine powder. Taking any alcohol you have (like vodka), mix a little into the eyeshadow to form a paste. If need be, add a little more. Taking your stick or spatula, move the paste into the eyeshadow pot. You can also use your fingers for this step. Take a small dish and fill it with alcohol (not too much, though!). Wrap a small coin (about the size of your eyeshadow pot) in a piece of cloth and dip it into the alcohol, so that the cloth it totally wet. Taking the coin, press it down onto your eyeshadow pot. This will help smooth out your eye makeup. Clean up around the edges and that's it, you're done! ",
    "sentences": [
        " Get a small pot or container and a stick or spatula of your choice.",
        "Taking the stick, remove all the eyeshadow from the pot, before moving it into your container.",
        "Using a small brush, remove all the tiny bits and pieces left behind, and add them to your container.",
        "It may seem silly, but you'd be surprised at how much this adds up.",
        "Clean the eyeshadow pot thoroughly.",
        "Break up the eye shadow so that there are no more lumps left behind.",
        "You should have a fairly fine powder.",
        "Taking any alcohol you have (like vodka), mix a little into the eyeshadow to form a paste.",
        "If need be, add a little more.",
        "Taking your stick or spatula, move the paste into the eyeshadow pot.",
        "You can also use your fingers for this step.",
        "Take a small dish and fill it with alcohol (not too much, though!).",
        "Wrap a small coin (about the size of your eyeshadow pot) in a piece of cloth and dip it into the alcohol, so that the cloth it totally wet.",
        "Taking the coin, press it down onto your eyeshadow pot.",
        "This will help smooth out your eye makeup.",
        "Clean up around the edges and that's it, you're done!"
    ]
}