{
    "title": "How to Stop Bike Brakes from Screeching",
    "url": "https://www.wikihow.com/Stop-Bike-Brakes-from-Screeching",
    "category_hierarchy": [
        "Cars & Other Vehicles"
    ],
    "methods": [
        {
            "name": "Fixing Squeaky Disc Brakes",
            "steps": [
                {
                    "headline": "Remove the wheel.",
                    "description": "Most mountain bikes and some other bikes use disc brakes, located at the hub. To get full access to its parts, remove the wheel. In most cases, this is as simple as turning the quick release handle outward and lifting the wheel away. Never activate the brakes while the wheel is removed. The brake pads will move inward and make it very difficult to reinsert the wheel."
                },
                {
                    "headline": "Remove the pads.",
                    "description": "These parts are usually held in the calipers by a screw or cotter pin, which you can unbend with needle-nose pliers. There may be additional clips holding in the pads. Disc brake designs vary. If you can't figure out how to disassemble yours, track down a user manual. Try not to touch the braking surface of the pads or rotors with your hands, especially after cleaning them."
                },
                {
                    "headline": "Inspect the pads for wear and replace them if necessary.",
                    "description": "Disc brake pads usually need replacement once they've worn down to 1 mm thick, but you may want to confirm that with the manufacturer instructions. If your pads aren't worn enough to require replacement, try the solutions below instead. If you replace the pads, it's best to replace the rotors as well."
                },
                {
                    "headline": "Clean the pads and rotors with rubbing alcohol.",
                    "description": "Grease on the brakes is one of the most common causes of squeaking. Wipe the braking surface of the pads and rotors with rubbing alcohol to dissolve dirt and grease. Avoid using water to clean the brake pads or rotors as it can cause rusting."
                },
                {
                    "headline": "Sand old pads and rotors.",
                    "description": "Older brake pads are usually glossy from the heat of braking. Lightly scuff the surface of the pads and rotors with sandpaper."
                },
                {
                    "headline": "Reassemble the bike.",
                    "description": "Place the pads back in the disc brakes. Fasten the wheel back onto the bike. Double check that all bolts are tight, as loose attachments are another cause of squeaking and poor braking. Wet brake pads may screech. Let the alcohol evaporate before reassembly."
                },
                {
                    "headline": "Bed-in the brakes if you replaced them.",
                    "description": "New pads and rotors need to undergo a procedure called \"bed-in\" before you ride your bike. Find a safe area with low traffic, like an empty parking lot, to bed-in your brakes. Begin riding your bike and work up to a moderate speed. Apply the brakes evenly in a controlled manner to reduce your speed. Before you come to a complete stop, release the brakes. Repeat the procedure about 20 times.Then, work up to a faster speed and apply the brakes until you reach a walking speed. Release the brakes and repeat the process 10 times to bed-in your breaks and ensure they will operate consistently. Be sure to remain seated at all times and avoid locking up the wheels at any point! Let the brakes cool completely before you ride your bike again. If you are not familiar with the operation and power of the bike and brakes, have a certified bike mechanic perform this procedure for you, as you must perform some heavy braking. This could lead to injury if you are not an experienced rider that is familiar with the bike at hand."
                }
            ]
        },
        {
            "name": "Silencing Rim Brakes",
            "steps": [
                {
                    "headline": "Wipe the rim with a dry cloth.",
                    "description": "V-brakes or center pull brakes press directly on the rim to stop the bike. Dirt or grease on the rims can interfere with the brake friction and cause squealing. Wipe off obvious dirt with a clean cloth."
                },
                {
                    "headline": "Clean off grime.",
                    "description": "Rubbing alcohol, acetone, or another oil-free solvent are ideal for removing grease. Wet a cloth in one of these substances, then scrub away grease on the rims."
                },
                {
                    "headline": "Dry the rims.",
                    "description": "A wet surface has less friction, so dry it with a clean cloth or paper towel. Handle the wheel by the spokes, not the rims, to avoid transferring oil from your hands. (This is a good tip to follow in daily use as well.)"
                },
                {
                    "headline": "Check the brake pads for damage.",
                    "description": "Occasionally, a sharp object or a fragment of metal embeds itself in a rim brake pad. Inspect the pads carefully and pick out any foreign objects with an awl or other sharp tool. If the brake pads are worn thin, you may need to replace them. Typically, there should be at least ⁄8 inch (3.2 mm) of rubber between the clamp and the tire when the caliper is engaged to brake the bike. You can use a brake pad gauge to measure this precisely."
                },
                {
                    "headline": "Sand the brake pads or rims.",
                    "description": "New brake pads have a hard surface that needs to be worn in. This will happen naturally over time, but you can shortcut it with a light sanding. If your rims are especially smooth and shiny, scuff them up a little as well."
                },
                {
                    "headline": "Toe in the brake pads.",
                    "description": "You'll have less noise and better braking ability if the pads are angled inward. Looking down from above the wheel, the front of the brake pads should be slightly closer to the rim. Most rim brakes allow you to adjust the angle by tightening or loosening nuts, and/or rotating washers. Never bend the arms of the brake pads to adjust the angle. This will weaken the metal. If your bike doesn't allow for this adjustment, consider replacing the brakes."
                }
            ]
        },
        {
            "name": "Troubleshooting",
            "steps": [
                {
                    "headline": "Test the wheel.",
                    "description": "Spin the wheel. If it wobbles or fails to spin freely, you may need to true the wheel. This can be difficult if you haven't done it before, but a bike shop will usually true your wheels for cheap."
                },
                {
                    "headline": "Check the cables.",
                    "description": "Squeeze the brake handles and make sure the cable moves. If it does not, your cable may be stuck in the cable housing, or the clamp in the handle may be loose."
                },
                {
                    "headline": "Make sure the caliper moves when the cable pulls on it.",
                    "description": "If you have caliper brakes, have a friend operate the brakes while you watch the caliper. If the brake cable moves but the end of the caliper does not, the cable may be broken inside the cable housing. The whole cable assembly will have to be replaced."
                }
            ]
        }
    ],
    "tyn": [
        "Kitchen or butter knife"
    ],
    "text": " Fixing Squeaky Disc Brakes Remove the wheel. Most mountain bikes and some other bikes use disc brakes, located at the hub. To get full access to its parts, remove the wheel. In most cases, this is as simple as turning the quick release handle outward and lifting the wheel away. Never activate the brakes while the wheel is removed. The brake pads will move inward and make it very difficult to reinsert the wheel. Remove the pads. These parts are usually held in the calipers by a screw or cotter pin, which you can unbend with needle-nose pliers. There may be additional clips holding in the pads. Disc brake designs vary. If you can't figure out how to disassemble yours, track down a user manual. Try not to touch the braking surface of the pads or rotors with your hands, especially after cleaning them. Inspect the pads for wear and replace them if necessary. Disc brake pads usually need replacement once they've worn down to 1 mm thick, but you may want to confirm that with the manufacturer instructions. If your pads aren't worn enough to require replacement, try the solutions below instead. If you replace the pads, it's best to replace the rotors as well. Clean the pads and rotors with rubbing alcohol. Grease on the brakes is one of the most common causes of squeaking. Wipe the braking surface of the pads and rotors with rubbing alcohol to dissolve dirt and grease. Avoid using water to clean the brake pads or rotors as it can cause rusting. Sand old pads and rotors. Older brake pads are usually glossy from the heat of braking. Lightly scuff the surface of the pads and rotors with sandpaper. Reassemble the bike. Place the pads back in the disc brakes. Fasten the wheel back onto the bike. Double check that all bolts are tight, as loose attachments are another cause of squeaking and poor braking. Wet brake pads may screech. Let the alcohol evaporate before reassembly. Bed-in the brakes if you replaced them. New pads and rotors need to undergo a procedure called \"bed-in\" before you ride your bike. Find a safe area with low traffic, like an empty parking lot, to bed-in your brakes. Begin riding your bike and work up to a moderate speed. Apply the brakes evenly in a controlled manner to reduce your speed. Before you come to a complete stop, release the brakes. Repeat the procedure about 20 times.Then, work up to a faster speed and apply the brakes until you reach a walking speed. Release the brakes and repeat the process 10 times to bed-in your breaks and ensure they will operate consistently. Be sure to remain seated at all times and avoid locking up the wheels at any point! Let the brakes cool completely before you ride your bike again. If you are not familiar with the operation and power of the bike and brakes, have a certified bike mechanic perform this procedure for you, as you must perform some heavy braking. This could lead to injury if you are not an experienced rider that is familiar with the bike at hand. Silencing Rim Brakes Wipe the rim with a dry cloth. V-brakes or center pull brakes press directly on the rim to stop the bike. Dirt or grease on the rims can interfere with the brake friction and cause squealing. Wipe off obvious dirt with a clean cloth. Clean off grime. Rubbing alcohol, acetone, or another oil-free solvent are ideal for removing grease. Wet a cloth in one of these substances, then scrub away grease on the rims. Dry the rims. A wet surface has less friction, so dry it with a clean cloth or paper towel. Handle the wheel by the spokes, not the rims, to avoid transferring oil from your hands. (This is a good tip to follow in daily use as well.) Check the brake pads for damage. Occasionally, a sharp object or a fragment of metal embeds itself in a rim brake pad. Inspect the pads carefully and pick out any foreign objects with an awl or other sharp tool. If the brake pads are worn thin, you may need to replace them. Typically, there should be at least ⁄8 inch (3.2 mm) of rubber between the clamp and the tire when the caliper is engaged to brake the bike. You can use a brake pad gauge to measure this precisely. Sand the brake pads or rims. New brake pads have a hard surface that needs to be worn in. This will happen naturally over time, but you can shortcut it with a light sanding. If your rims are especially smooth and shiny, scuff them up a little as well. Toe in the brake pads. You'll have less noise and better braking ability if the pads are angled inward. Looking down from above the wheel, the front of the brake pads should be slightly closer to the rim. Most rim brakes allow you to adjust the angle by tightening or loosening nuts, and/or rotating washers. Never bend the arms of the brake pads to adjust the angle. This will weaken the metal. If your bike doesn't allow for this adjustment, consider replacing the brakes. Troubleshooting Test the wheel. Spin the wheel. If it wobbles or fails to spin freely, you may need to true the wheel. This can be difficult if you haven't done it before, but a bike shop will usually true your wheels for cheap. Check the cables. Squeeze the brake handles and make sure the cable moves. If it does not, your cable may be stuck in the cable housing, or the clamp in the handle may be loose. Make sure the caliper moves when the cable pulls on it. If you have caliper brakes, have a friend operate the brakes while you watch the caliper. If the brake cable moves but the end of the caliper does not, the cable may be broken inside the cable housing. The whole cable assembly will have to be replaced.",
    "sentences": [
        " Fixing Squeaky Disc Brakes Remove the wheel.",
        "Most mountain bikes and some other bikes use disc brakes, located at the hub.",
        "To get full access to its parts, remove the wheel.",
        "In most cases, this is as simple as turning the quick release handle outward and lifting the wheel away.",
        "Never activate the brakes while the wheel is removed.",
        "The brake pads will move inward and make it very difficult to reinsert the wheel.",
        "Remove the pads.",
        "These parts are usually held in the calipers by a screw or cotter pin, which you can unbend with needle-nose pliers.",
        "There may be additional clips holding in the pads.",
        "Disc brake designs vary.",
        "If you can't figure out how to disassemble yours, track down a user manual.",
        "Try not to touch the braking surface of the pads or rotors with your hands, especially after cleaning them.",
        "Inspect the pads for wear and replace them if necessary.",
        "Disc brake pads usually need replacement once they've worn down to 1 mm thick, but you may want to confirm that with the manufacturer instructions.",
        "If your pads aren't worn enough to require replacement, try the solutions below instead.",
        "If you replace the pads, it's best to replace the rotors as well.",
        "Clean the pads and rotors with rubbing alcohol.",
        "Grease on the brakes is one of the most common causes of squeaking.",
        "Wipe the braking surface of the pads and rotors with rubbing alcohol to dissolve dirt and grease.",
        "Avoid using water to clean the brake pads or rotors as it can cause rusting.",
        "Sand old pads and rotors.",
        "Older brake pads are usually glossy from the heat of braking.",
        "Lightly scuff the surface of the pads and rotors with sandpaper.",
        "Reassemble the bike.",
        "Place the pads back in the disc brakes.",
        "Fasten the wheel back onto the bike.",
        "Double check that all bolts are tight, as loose attachments are another cause of squeaking and poor braking.",
        "Wet brake pads may screech.",
        "Let the alcohol evaporate before reassembly.",
        "Bed-in the brakes if you replaced them.",
        "New pads and rotors need to undergo a procedure called \"bed-in\" before you ride your bike.",
        "Find a safe area with low traffic, like an empty parking lot, to bed-in your brakes.",
        "Begin riding your bike and work up to a moderate speed.",
        "Apply the brakes evenly in a controlled manner to reduce your speed.",
        "Before you come to a complete stop, release the brakes.",
        "Repeat the procedure about 20 times.Then, work up to a faster speed and apply the brakes until you reach a walking speed.",
        "Release the brakes and repeat the process 10 times to bed-in your breaks and ensure they will operate consistently.",
        "Be sure to remain seated at all times and avoid locking up the wheels at any point!",
        "Let the brakes cool completely before you ride your bike again.",
        "If you are not familiar with the operation and power of the bike and brakes, have a certified bike mechanic perform this procedure for you, as you must perform some heavy braking.",
        "This could lead to injury if you are not an experienced rider that is familiar with the bike at hand.",
        "Silencing Rim Brakes Wipe the rim with a dry cloth.",
        "V-brakes or center pull brakes press directly on the rim to stop the bike.",
        "Dirt or grease on the rims can interfere with the brake friction and cause squealing.",
        "Wipe off obvious dirt with a clean cloth.",
        "Clean off grime.",
        "Rubbing alcohol, acetone, or another oil-free solvent are ideal for removing grease.",
        "Wet a cloth in one of these substances, then scrub away grease on the rims.",
        "Dry the rims.",
        "A wet surface has less friction, so dry it with a clean cloth or paper towel.",
        "Handle the wheel by the spokes, not the rims, to avoid transferring oil from your hands.",
        "(This is a good tip to follow in daily use as well.)",
        "Check the brake pads for damage.",
        "Occasionally, a sharp object or a fragment of metal embeds itself in a rim brake pad.",
        "Inspect the pads carefully and pick out any foreign objects with an awl or other sharp tool.",
        "If the brake pads are worn thin, you may need to replace them.",
        "Typically, there should be at least ⁄8 inch (3.2 mm) of rubber between the clamp and the tire when the caliper is engaged to brake the bike.",
        "You can use a brake pad gauge to measure this precisely.",
        "Sand the brake pads or rims.",
        "New brake pads have a hard surface that needs to be worn in.",
        "This will happen naturally over time, but you can shortcut it with a light sanding.",
        "If your rims are especially smooth and shiny, scuff them up a little as well.",
        "Toe in the brake pads.",
        "You'll have less noise and better braking ability if the pads are angled inward.",
        "Looking down from above the wheel, the front of the brake pads should be slightly closer to the rim.",
        "Most rim brakes allow you to adjust the angle by tightening or loosening nuts, and/or rotating washers.",
        "Never bend the arms of the brake pads to adjust the angle.",
        "This will weaken the metal.",
        "If your bike doesn't allow for this adjustment, consider replacing the brakes.",
        "Troubleshooting Test the wheel.",
        "Spin the wheel.",
        "If it wobbles or fails to spin freely, you may need to true the wheel.",
        "This can be difficult if you haven't done it before, but a bike shop will usually true your wheels for cheap.",
        "Check the cables.",
        "Squeeze the brake handles and make sure the cable moves.",
        "If it does not, your cable may be stuck in the cable housing, or the clamp in the handle may be loose.",
        "Make sure the caliper moves when the cable pulls on it.",
        "If you have caliper brakes, have a friend operate the brakes while you watch the caliper.",
        "If the brake cable moves but the end of the caliper does not, the cable may be broken inside the cable housing.",
        "The whole cable assembly will have to be replaced."
    ]
}