{
    "title": "How to Make Crab Apple Jelly",
    "url": "https://www.wikihow.com/Make-Crab-Apple-Jelly",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Jams and Jellies"
    ],
    "steps": [
        {
            "headline": "Pick the crab apples.",
            "description": "Crab apples aren't normally available commercially, so you'll probably have to find a crab apple tree and pick them yourself. However, don't hesitate to try the local farmer's market as someone might be selling them or can get some for you."
        },
        {
            "headline": "Wash the crab apples.",
            "description": "Remove the stalks and cut off the bottom and any bad parts."
        },
        {
            "headline": "Put the crab apples in a saucepan and cover with water.",
            "description": "Bring to the boil and simmer for approximately half an hour."
        },
        {
            "headline": "Strain the pulp.",
            "description": "Crab apple jelly is normally strained through muslin, which results in a clear jelly, but if you don't have any and don't mind the jelly being cloudy, you can use a fine sieve. If straining through muslin you will need to leave the pulp to strain in its own time (if in doubt, leave it overnight), as squeezing it to speed up the process will result in a cloudy jelly."
        },
        {
            "headline": "Measure the juice and add the sugar.",
            "description": "You will need approximately 7 parts sugar to 10 parts juice."
        },
        {
            "headline": "Squeeze the lemon and add to the juice and sugar.",
            "description": ""
        },
        {
            "headline": "Boil the jelly.",
            "description": "Skim off any white froth that forms on the surface – this is the stuff that makes the jelly cloudy – so the more you can get rid of, the clearer your jelly will be. Once the jelly starts the thicken, test it every couple of minutes on the back of a cold spoon. If it sets, it's ready. If you have a thermometer, the jelly should set at around 105ºC, 221ºF."
        },
        {
            "headline": "Pour into sterilised jars and seal.",
            "description": "Tightly seal while still slightly warm. Store in a cool, dark and dry place."
        }
    ],
    "tyn": [
        "Knife",
        "Saucepan",
        "Sieve",
        "Spoons (put a couple of these in the fridge before you start, to use to test the jelly)",
        "Muslin",
        "Measuring jug",
        "Lemon juicer",
        "Sterilized jars"
    ],
    "text": " Pick the crab apples. Crab apples aren't normally available commercially, so you'll probably have to find a crab apple tree and pick them yourself. However, don't hesitate to try the local farmer's market as someone might be selling them or can get some for you. Wash the crab apples. Remove the stalks and cut off the bottom and any bad parts. Put the crab apples in a saucepan and cover with water. Bring to the boil and simmer for approximately half an hour. Strain the pulp. Crab apple jelly is normally strained through muslin, which results in a clear jelly, but if you don't have any and don't mind the jelly being cloudy, you can use a fine sieve. If straining through muslin you will need to leave the pulp to strain in its own time (if in doubt, leave it overnight), as squeezing it to speed up the process will result in a cloudy jelly. Measure the juice and add the sugar. You will need approximately 7 parts sugar to 10 parts juice. Squeeze the lemon and add to the juice and sugar.  Boil the jelly. Skim off any white froth that forms on the surface – this is the stuff that makes the jelly cloudy – so the more you can get rid of, the clearer your jelly will be. Once the jelly starts the thicken, test it every couple of minutes on the back of a cold spoon. If it sets, it's ready. If you have a thermometer, the jelly should set at around 105ºC, 221ºF. Pour into sterilised jars and seal. Tightly seal while still slightly warm. Store in a cool, dark and dry place.",
    "sentences": [
        " Pick the crab apples.",
        "Crab apples aren't normally available commercially, so you'll probably have to find a crab apple tree and pick them yourself.",
        "However, don't hesitate to try the local farmer's market as someone might be selling them or can get some for you.",
        "Wash the crab apples.",
        "Remove the stalks and cut off the bottom and any bad parts.",
        "Put the crab apples in a saucepan and cover with water.",
        "Bring to the boil and simmer for approximately half an hour.",
        "Strain the pulp.",
        "Crab apple jelly is normally strained through muslin, which results in a clear jelly, but if you don't have any and don't mind the jelly being cloudy, you can use a fine sieve.",
        "If straining through muslin you will need to leave the pulp to strain in its own time (if in doubt, leave it overnight), as squeezing it to speed up the process will result in a cloudy jelly.",
        "Measure the juice and add the sugar.",
        "You will need approximately 7 parts sugar to 10 parts juice.",
        "Squeeze the lemon and add to the juice and sugar.",
        "Boil the jelly.",
        "Skim off any white froth that forms on the surface – this is the stuff that makes the jelly cloudy – so the more you can get rid of, the clearer your jelly will be.",
        "Once the jelly starts the thicken, test it every couple of minutes on the back of a cold spoon.",
        "If it sets, it's ready.",
        "If you have a thermometer, the jelly should set at around 105ºC, 221ºF.",
        "Pour into sterilised jars and seal.",
        "Tightly seal while still slightly warm.",
        "Store in a cool, dark and dry place."
    ]
}