{
    "title": "How to Make Raspberry Vinegar",
    "url": "https://www.wikihow.com/Make-Raspberry-Vinegar",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Flavored Vinegars"
    ],
    "methods": [
        {
            "name": "Raspberry vinegar #1",
            "steps": [
                {
                    "headline": "Put the raspberries into the mixing bowl.",
                    "description": "Gently pour the vinegar over top of the raspberries."
                },
                {
                    "headline": "Cover the bowl and set aside in a cool, dark and dry spot.",
                    "description": "Allow to stand for 1 week. Stir it occasionally and make sure that the raspberries are completely covered by the vinegar."
                },
                {
                    "headline": "Strain the liquid and discard the raspberries.",
                    "description": ""
                },
                {
                    "headline": "Pour the infused vinegar into the saucepan.",
                    "description": "Add the sugar."
                },
                {
                    "headline": "Bring to the boil.",
                    "description": "Then reduce the heat and simmer for 10 minutes, stirring frequently to help the sugar dissolve."
                },
                {
                    "headline": "Remove the pan from the heat.",
                    "description": "Allow to cool."
                },
                {
                    "headline": "Pour into the sterilised bottles and seal.",
                    "description": "Store in a dark, cool and dry place for up to 6 months."
                }
            ]
        },
        {
            "name": "Raspberry vinegar #2",
            "steps": [
                {
                    "headline": "Use the back of a wooden spoon to press down on the raspberries.",
                    "description": "Do this gently but enough to bruise them."
                },
                {
                    "headline": "Pour the vinegar over the bruised raspberries.",
                    "description": "Stir well."
                },
                {
                    "headline": "Cover and set aside for 4 to 5 days.",
                    "description": "Stir daily."
                },
                {
                    "headline": "Strain the vinegar.",
                    "description": "It can be pushed through a jelly bag, a sieve, cheesecloth or other filter."
                },
                {
                    "headline": "Pour the strained vinegar into the saucepan.",
                    "description": "For every 300ml/ 1.2 pint of liquid, add 150mg of sugar."
                },
                {
                    "headline": "Heat the vinegar.",
                    "description": "Simmer just below boiling for 10 to 15 minutes. Boiling doesn't destroy the taste but it will remove the lovely red raspberry color."
                },
                {
                    "headline": "Pour into sterilized bottles.",
                    "description": "Store in a cool and dry place for up to 12 months."
                },
                {
                    "headline": "Serve.",
                    "description": "Add to salad dressings, vinaigrette, drinks and marinades."
                }
            ]
        },
        {
            "name": "Raspberry vinegar #3",
            "steps": [
                {
                    "headline": "Warm the vinegar.",
                    "description": "Use either a microwave of warm over low heat. The warming is important as it enables the vinegar to draw out the raspberries a lot faster."
                },
                {
                    "headline": "Add the raspberries to the warm vinegar.",
                    "description": "The vinegar should feel warm if you touch it."
                },
                {
                    "headline": "Mash the raspberries in the bowl.",
                    "description": "Use a whisk, masher or fork to do this. Stir through vigorously."
                },
                {
                    "headline": "Place a coffee filter over the mouth of a large jar.",
                    "description": "Hold in place with a rubber band."
                },
                {
                    "headline": "Pour the vinegar through the filter into the jar.",
                    "description": "The filter will catch the mashed raspberries."
                },
                {
                    "headline": "Drop some fresh raspberries into the vinegar serving container.",
                    "description": "Pour the filtered raspberry vinegar over the top."
                },
                {
                    "headline": "Serve.",
                    "description": "The raspberry vinegar is ready to use on salads or as needed."
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Method 1",
        "Mixing bowl",
        "Strainer, sieve, chinois",
        "Saucepan",
        "Sterilised bottles for storing, with seals",
        "Method 2",
        "Large bowl with lid",
        "Stirring spoon",
        "Heavy-based saucepan",
        "Cheesecloth, sieve, jelly bag, etc. to serve as a filter",
        "Sterilized bottles for storing, with lids or seals",
        "Method 3",
        "Saucepan or microwave bowl",
        "Large glass bowl",
        "Masher, whisk or fork",
        "Coffee filter",
        "Rubber band",
        "Large jar"
    ],
    "text": " Raspberry vinegar #1 Put the raspberries into the mixing bowl. Gently pour the vinegar over top of the raspberries. Cover the bowl and set aside in a cool, dark and dry spot. Allow to stand for 1 week. Stir it occasionally and make sure that the raspberries are completely covered by the vinegar. Strain the liquid and discard the raspberries.  Pour the infused vinegar into the saucepan. Add the sugar. Bring to the boil. Then reduce the heat and simmer for 10 minutes, stirring frequently to help the sugar dissolve. Remove the pan from the heat. Allow to cool. Pour into the sterilised bottles and seal. Store in a dark, cool and dry place for up to 6 months. Raspberry vinegar #2 Use the back of a wooden spoon to press down on the raspberries. Do this gently but enough to bruise them. Pour the vinegar over the bruised raspberries. Stir well. Cover and set aside for 4 to 5 days. Stir daily. Strain the vinegar. It can be pushed through a jelly bag, a sieve, cheesecloth or other filter. Pour the strained vinegar into the saucepan. For every 300ml/ 1.2 pint of liquid, add 150mg of sugar. Heat the vinegar. Simmer just below boiling for 10 to 15 minutes. Boiling doesn't destroy the taste but it will remove the lovely red raspberry color. Pour into sterilized bottles. Store in a cool and dry place for up to 12 months. Serve. Add to salad dressings, vinaigrette, drinks and marinades. Raspberry vinegar #3 Warm the vinegar. Use either a microwave of warm over low heat. The warming is important as it enables the vinegar to draw out the raspberries a lot faster. Add the raspberries to the warm vinegar. The vinegar should feel warm if you touch it. Mash the raspberries in the bowl. Use a whisk, masher or fork to do this. Stir through vigorously. Place a coffee filter over the mouth of a large jar. Hold in place with a rubber band. Pour the vinegar through the filter into the jar. The filter will catch the mashed raspberries. Drop some fresh raspberries into the vinegar serving container. Pour the filtered raspberry vinegar over the top. Serve. The raspberry vinegar is ready to use on salads or as needed. Finished. ",
    "sentences": [
        " Raspberry vinegar #1 Put the raspberries into the mixing bowl.",
        "Gently pour the vinegar over top of the raspberries.",
        "Cover the bowl and set aside in a cool, dark and dry spot.",
        "Allow to stand for 1 week.",
        "Stir it occasionally and make sure that the raspberries are completely covered by the vinegar.",
        "Strain the liquid and discard the raspberries.",
        "Pour the infused vinegar into the saucepan.",
        "Add the sugar.",
        "Bring to the boil.",
        "Then reduce the heat and simmer for 10 minutes, stirring frequently to help the sugar dissolve.",
        "Remove the pan from the heat.",
        "Allow to cool.",
        "Pour into the sterilised bottles and seal.",
        "Store in a dark, cool and dry place for up to 6 months.",
        "Raspberry vinegar #2 Use the back of a wooden spoon to press down on the raspberries.",
        "Do this gently but enough to bruise them.",
        "Pour the vinegar over the bruised raspberries.",
        "Stir well.",
        "Cover and set aside for 4 to 5 days.",
        "Stir daily.",
        "Strain the vinegar.",
        "It can be pushed through a jelly bag, a sieve, cheesecloth or other filter.",
        "Pour the strained vinegar into the saucepan.",
        "For every 300ml/ 1.2 pint of liquid, add 150mg of sugar.",
        "Heat the vinegar.",
        "Simmer just below boiling for 10 to 15 minutes.",
        "Boiling doesn't destroy the taste but it will remove the lovely red raspberry color.",
        "Pour into sterilized bottles.",
        "Store in a cool and dry place for up to 12 months.",
        "Serve.",
        "Add to salad dressings, vinaigrette, drinks and marinades.",
        "Raspberry vinegar #3 Warm the vinegar.",
        "Use either a microwave of warm over low heat.",
        "The warming is important as it enables the vinegar to draw out the raspberries a lot faster.",
        "Add the raspberries to the warm vinegar.",
        "The vinegar should feel warm if you touch it.",
        "Mash the raspberries in the bowl.",
        "Use a whisk, masher or fork to do this.",
        "Stir through vigorously.",
        "Place a coffee filter over the mouth of a large jar.",
        "Hold in place with a rubber band.",
        "Pour the vinegar through the filter into the jar.",
        "The filter will catch the mashed raspberries.",
        "Drop some fresh raspberries into the vinegar serving container.",
        "Pour the filtered raspberry vinegar over the top.",
        "Serve.",
        "The raspberry vinegar is ready to use on salads or as needed.",
        "Finished."
    ]
}