{
    "title": "How to Vote on User's Reviews on Yelp",
    "url": "https://www.wikihow.com/Vote-on-User%27s-Reviews-on-Yelp",
    "category_hierarchy": [
        "Computers and Electronics",
        "Internet",
        "Social Media",
        "Social Bookmarking",
        "Yelp"
    ],
    "methods": [
        {
            "name": "Via the Website",
            "steps": [
                {
                    "headline": "Visit the Yelp web page in your web browser.",
                    "description": ""
                },
                {
                    "headline": "Search for any company.",
                    "description": ""
                },
                {
                    "headline": "Click the button that corresponds to the right information on the businesses review page (businesses own home page on Yelp).",
                    "description": "You'll have choices for the review being useful, funny or cool. The system will auto-save this clicked vote information for you, and update all pre-existing vote totals. You may vote for as many as you like, but only one vote for each button per account will count."
                }
            ]
        },
        {
            "name": "Via the iPhone App",
            "steps": [
                {
                    "headline": "Power on and unlock your iPhone.",
                    "description": "Type in your 4-digit pin (if you have one installed)."
                },
                {
                    "headline": "Download and install Yelp for iPhone app from the Apple AppStore (if you haven't done so already).",
                    "description": ""
                },
                {
                    "headline": "Open the Yelp for iPhone app.",
                    "description": ""
                },
                {
                    "headline": "Login to the Yelp for iPhone app, with your Yelp credentials, if you haven't done so already.",
                    "description": "Unlike when voting on a PC, you must be logged in to your account to vote."
                },
                {
                    "headline": "Search for the business you'd like to vote on, via the search bar at the top portion of the app.",
                    "description": ""
                },
                {
                    "headline": "Tap the business you'd like to vote on/with.",
                    "description": ""
                },
                {
                    "headline": "Scroll down until you get to the section entitled \"Reviews\"",
                    "description": ""
                },
                {
                    "headline": "Tap a review, or if there are more reviews than just the top 4, click the button slightly under the top 4 labelled \"(x) more Reviews\" (where x designates how many additional reviews are present).",
                    "description": ""
                },
                {
                    "headline": "Read the review from the very top to the very last word.",
                    "description": ""
                },
                {
                    "headline": "Scroll down until 3 buttons appear.",
                    "description": "The three buttons are called \"Useful\", \"Funny\" and \"Cool\"."
                },
                {
                    "headline": "Tap each selection that best defines the review.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Internet access",
        "understanding of the Yelp system (you don't need an account, but it's nice to have one to backtrack if you have a potential problem)",
        "several others' business reviews on Yelp"
    ],
    "text": " Via the Website Visit the Yelp web page in your web browser.  Search for any company.  Click the button that corresponds to the right information on the businesses review page (businesses own home page on Yelp). You'll have choices for the review being useful, funny or cool. The system will auto-save this clicked vote information for you, and update all pre-existing vote totals. You may vote for as many as you like, but only one vote for each button per account will count. Via the iPhone App Power on and unlock your iPhone. Type in your 4-digit pin (if you have one installed). Download and install Yelp for iPhone app from the Apple AppStore (if you haven't done so already).  Open the Yelp for iPhone app.  Login to the Yelp for iPhone app, with your Yelp credentials, if you haven't done so already. Unlike when voting on a PC, you must be logged in to your account to vote. Search for the business you'd like to vote on, via the search bar at the top portion of the app.  Tap the business you'd like to vote on/with.  Scroll down until you get to the section entitled \"Reviews\"  Tap a review, or if there are more reviews than just the top 4, click the button slightly under the top 4 labelled \"(x) more Reviews\" (where x designates how many additional reviews are present).  Read the review from the very top to the very last word.  Scroll down until 3 buttons appear. The three buttons are called \"Useful\", \"Funny\" and \"Cool\". Tap each selection that best defines the review. ",
    "sentences": [
        " Via the Website Visit the Yelp web page in your web browser.",
        "Search for any company.",
        "Click the button that corresponds to the right information on the businesses review page (businesses own home page on Yelp).",
        "You'll have choices for the review being useful, funny or cool.",
        "The system will auto-save this clicked vote information for you, and update all pre-existing vote totals.",
        "You may vote for as many as you like, but only one vote for each button per account will count.",
        "Via the iPhone App Power on and unlock your iPhone.",
        "Type in your 4-digit pin (if you have one installed).",
        "Download and install Yelp for iPhone app from the Apple AppStore (if you haven't done so already).",
        "Open the Yelp for iPhone app.",
        "Login to the Yelp for iPhone app, with your Yelp credentials, if you haven't done so already.",
        "Unlike when voting on a PC, you must be logged in to your account to vote.",
        "Search for the business you'd like to vote on, via the search bar at the top portion of the app.",
        "Tap the business you'd like to vote on/with.",
        "Scroll down until you get to the section entitled \"Reviews\"  Tap a review, or if there are more reviews than just the top 4, click the button slightly under the top 4 labelled \"(x) more Reviews\" (where x designates how many additional reviews are present).",
        "Read the review from the very top to the very last word.",
        "Scroll down until 3 buttons appear.",
        "The three buttons are called \"Useful\", \"Funny\" and \"Cool\".",
        "Tap each selection that best defines the review."
    ]
}