{
    "title": "How to Make Peach Tea",
    "url": "https://www.wikihow.com/Make-Peach-Tea",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Tea",
        "Fruit Tea"
    ],
    "methods": [
        {
            "name": "Making Tea with Flavored Simple Syrup",
            "steps": [
                {
                    "headline": "Make a peach-flavored simple syrup.",
                    "description": "Cut your peaches into thin slices and place those into a saucepan on the stovetop. Add the sugar and the two cups of water (16.65 fl oz. ), bring the mixture to a boil, then lower the heat to simmer. Use a spoon to press and squash the peaches to release more juices. Stir until the sugar has dissolved. Then cover the pan and allow the syrup to steep for a half-hour."
                },
                {
                    "headline": "Brew some tea.",
                    "description": "Pour the other 16 cups of water (133.23 fl oz) into a pot. Bring it to a boil. Add your tea bags or loose tea. Steep your tea for four to five minutes. If using loose tea, pour the tea through a strainer into a pitcher. Otherwise, throw out the tea bags and pour the tea directly into a pitcher. If making iced tea, place the pitcher in the refrigerator to start cooling it down until the simple syrup has finished steeping."
                },
                {
                    "headline": "Strain your syrup.",
                    "description": "Once your syrup has steeped for 30 minutes, set a container on the counter. If the opening is narrow, set it in the sink in case you spill any syrup as you pour. Pour the syrup through a strainer into the container. The sliced peaches can either be discarded or used as a topping for oatmeal, pancakes, ice cream, yogurt, or whatever you like."
                },
                {
                    "headline": "Serve your tea.",
                    "description": "Pour the simple syrup into your pitcher of tea and stir to combine. Alternately, serve the tea by itself to guests, with the simple syrup on the side. Allow each to add as much syrup as they like. Also consider slicing additional peaches to add to each glass for more flavor. To serve cold, add ice and/or allow the tea to refrigerate for a while after brewing."
                }
            ]
        },
        {
            "name": "Making a Puree-Based Tea",
            "steps": [
                {
                    "headline": "Make a standard simple syrup.",
                    "description": "Pour 3 cups of water (24.98 fl oz) into a saucepan on the stovetop. Add the sugar. Turn the heat to high. Stir the sugar as the water comes to a boil. Keep stirring until the sugar has thoroughly dissolved. Then remove from heat. For iced tea, allow the syrup time to cool down before adding it to your tea."
                },
                {
                    "headline": "Brew your tea.",
                    "description": "Pour remaining water into a large pot on the stovetop. Turn the heat to high until the water boils. Switch the heat off and add your tea bags or leaves. Allow them to steep for five minutes. If using loose tea, strain the leaves out once they have steeped."
                },
                {
                    "headline": "Make your puree.",
                    "description": "Peel and slice your peaches. Discard all the pits. Place the sliced peaches in a blender, cover, and blend until they form a puree. If you like a lot of pulp, transfer the puree directly to a pitcher. If not, mush the puree through a strainer so the larger bits stay behind."
                },
                {
                    "headline": "Combine and serve.",
                    "description": "Pour your simple syrup into the puree, along with the lemon juice. Stir to combine. Then pour your tea in and stir until all the ingredients have mixed evenly. If desired, slice additional peaches to add to each glass before serving. For ice, allow the tea to cool off and/or refrigerate after brewing and then serve over ice."
                }
            ]
        },
        {
            "name": "Using Peach Nectar",
            "steps": [
                {
                    "headline": "Brew your tea.",
                    "description": "Pour your water into a pot on the stovetop. Turn the heat to high. Once the water boils, shut off the heat. Place your tea bags or loose leaf tea into the water. Allow them to steep for five minutes. If making iced tea, only boil 4 cups of your water (33.31 fl oz.). Add the rest later so it takes less time to cool down."
                },
                {
                    "headline": "Flavor your tea.",
                    "description": "Discard your tea bags. If using loose leaf, strain your tea into a pitcher. Then stir your sugar into the tea. Once it dissolves, pour in the peach nectar, baking soda, and lemon juice. Stir to combine."
                },
                {
                    "headline": "Serve your tea.",
                    "description": "If you haven’t already, transfer your tea into a pitcher. If you are making iced tea, add the remaining 10 cups of cold water (83.27 fl oz.). Slice your peaches and add them to each glass. Pour the tea over the peaches and enjoy. To serve cold, let the tea cool off and/or refrigerate it after brewing. Then serve over ice."
                }
            ]
        }
    ],
    "tyn": [
        "Tea with Flavored Simple Syrup",
        "Cutting board",
        "Knife",
        "Stove",
        "Small saucepan",
        "Wooden spoon",
        "Large pot",
        "Strainer",
        "Pitcher",
        "Container with lid",
        "Tea with a Puree Base",
        "Medium saucepan",
        "Peeler",
        "Blender",
        "Strainer (optional)",
        "Tea with Peach Nectar",
        "Medium to large pot"
    ],
    "text": " Making Tea with Flavored Simple Syrup Make a peach-flavored simple syrup. Cut your peaches into thin slices and place those into a saucepan on the stovetop. Add the sugar and the two cups of water (16.65 fl oz. ), bring the mixture to a boil, then lower the heat to simmer. Use a spoon to press and squash the peaches to release more juices. Stir until the sugar has dissolved. Then cover the pan and allow the syrup to steep for a half-hour. Brew some tea. Pour the other 16 cups of water (133.23 fl oz) into a pot. Bring it to a boil. Add your tea bags or loose tea. Steep your tea for four to five minutes. If using loose tea, pour the tea through a strainer into a pitcher. Otherwise, throw out the tea bags and pour the tea directly into a pitcher. If making iced tea, place the pitcher in the refrigerator to start cooling it down until the simple syrup has finished steeping. Strain your syrup. Once your syrup has steeped for 30 minutes, set a container on the counter. If the opening is narrow, set it in the sink in case you spill any syrup as you pour. Pour the syrup through a strainer into the container. The sliced peaches can either be discarded or used as a topping for oatmeal, pancakes, ice cream, yogurt, or whatever you like. Serve your tea. Pour the simple syrup into your pitcher of tea and stir to combine. Alternately, serve the tea by itself to guests, with the simple syrup on the side. Allow each to add as much syrup as they like. Also consider slicing additional peaches to add to each glass for more flavor. To serve cold, add ice and/or allow the tea to refrigerate for a while after brewing. Making a Puree-Based Tea Make a standard simple syrup. Pour 3 cups of water (24.98 fl oz) into a saucepan on the stovetop. Add the sugar. Turn the heat to high. Stir the sugar as the water comes to a boil. Keep stirring until the sugar has thoroughly dissolved. Then remove from heat. For iced tea, allow the syrup time to cool down before adding it to your tea. Brew your tea. Pour remaining water into a large pot on the stovetop. Turn the heat to high until the water boils. Switch the heat off and add your tea bags or leaves. Allow them to steep for five minutes. If using loose tea, strain the leaves out once they have steeped. Make your puree. Peel and slice your peaches. Discard all the pits. Place the sliced peaches in a blender, cover, and blend until they form a puree. If you like a lot of pulp, transfer the puree directly to a pitcher. If not, mush the puree through a strainer so the larger bits stay behind. Combine and serve. Pour your simple syrup into the puree, along with the lemon juice. Stir to combine. Then pour your tea in and stir until all the ingredients have mixed evenly. If desired, slice additional peaches to add to each glass before serving. For ice, allow the tea to cool off and/or refrigerate after brewing and then serve over ice. Using Peach Nectar Brew your tea. Pour your water into a pot on the stovetop. Turn the heat to high. Once the water boils, shut off the heat. Place your tea bags or loose leaf tea into the water. Allow them to steep for five minutes. If making iced tea, only boil 4 cups of your water (33.31 fl oz.). Add the rest later so it takes less time to cool down. Flavor your tea. Discard your tea bags. If using loose leaf, strain your tea into a pitcher. Then stir your sugar into the tea. Once it dissolves, pour in the peach nectar, baking soda, and lemon juice. Stir to combine. Serve your tea. If you haven’t already, transfer your tea into a pitcher. If you are making iced tea, add the remaining 10 cups of cold water (83.27 fl oz.). Slice your peaches and add them to each glass. Pour the tea over the peaches and enjoy. To serve cold, let the tea cool off and/or refrigerate it after brewing. Then serve over ice.",
    "sentences": [
        " Making Tea with Flavored Simple Syrup Make a peach-flavored simple syrup.",
        "Cut your peaches into thin slices and place those into a saucepan on the stovetop.",
        "Add the sugar and the two cups of water (16.65 fl oz.",
        "), bring the mixture to a boil, then lower the heat to simmer.",
        "Use a spoon to press and squash the peaches to release more juices.",
        "Stir until the sugar has dissolved.",
        "Then cover the pan and allow the syrup to steep for a half-hour.",
        "Brew some tea.",
        "Pour the other 16 cups of water (133.23 fl oz) into a pot.",
        "Bring it to a boil.",
        "Add your tea bags or loose tea.",
        "Steep your tea for four to five minutes.",
        "If using loose tea, pour the tea through a strainer into a pitcher.",
        "Otherwise, throw out the tea bags and pour the tea directly into a pitcher.",
        "If making iced tea, place the pitcher in the refrigerator to start cooling it down until the simple syrup has finished steeping.",
        "Strain your syrup.",
        "Once your syrup has steeped for 30 minutes, set a container on the counter.",
        "If the opening is narrow, set it in the sink in case you spill any syrup as you pour.",
        "Pour the syrup through a strainer into the container.",
        "The sliced peaches can either be discarded or used as a topping for oatmeal, pancakes, ice cream, yogurt, or whatever you like.",
        "Serve your tea.",
        "Pour the simple syrup into your pitcher of tea and stir to combine.",
        "Alternately, serve the tea by itself to guests, with the simple syrup on the side.",
        "Allow each to add as much syrup as they like.",
        "Also consider slicing additional peaches to add to each glass for more flavor.",
        "To serve cold, add ice and/or allow the tea to refrigerate for a while after brewing.",
        "Making a Puree-Based Tea Make a standard simple syrup.",
        "Pour 3 cups of water (24.98 fl oz) into a saucepan on the stovetop.",
        "Add the sugar.",
        "Turn the heat to high.",
        "Stir the sugar as the water comes to a boil.",
        "Keep stirring until the sugar has thoroughly dissolved.",
        "Then remove from heat.",
        "For iced tea, allow the syrup time to cool down before adding it to your tea.",
        "Brew your tea.",
        "Pour remaining water into a large pot on the stovetop.",
        "Turn the heat to high until the water boils.",
        "Switch the heat off and add your tea bags or leaves.",
        "Allow them to steep for five minutes.",
        "If using loose tea, strain the leaves out once they have steeped.",
        "Make your puree.",
        "Peel and slice your peaches.",
        "Discard all the pits.",
        "Place the sliced peaches in a blender, cover, and blend until they form a puree.",
        "If you like a lot of pulp, transfer the puree directly to a pitcher.",
        "If not, mush the puree through a strainer so the larger bits stay behind.",
        "Combine and serve.",
        "Pour your simple syrup into the puree, along with the lemon juice.",
        "Stir to combine.",
        "Then pour your tea in and stir until all the ingredients have mixed evenly.",
        "If desired, slice additional peaches to add to each glass before serving.",
        "For ice, allow the tea to cool off and/or refrigerate after brewing and then serve over ice.",
        "Using Peach Nectar Brew your tea.",
        "Pour your water into a pot on the stovetop.",
        "Turn the heat to high.",
        "Once the water boils, shut off the heat.",
        "Place your tea bags or loose leaf tea into the water.",
        "Allow them to steep for five minutes.",
        "If making iced tea, only boil 4 cups of your water (33.31 fl oz.).",
        "Add the rest later so it takes less time to cool down.",
        "Flavor your tea.",
        "Discard your tea bags.",
        "If using loose leaf, strain your tea into a pitcher.",
        "Then stir your sugar into the tea.",
        "Once it dissolves, pour in the peach nectar, baking soda, and lemon juice.",
        "Stir to combine.",
        "Serve your tea.",
        "If you haven’t already, transfer your tea into a pitcher.",
        "If you are making iced tea, add the remaining 10 cups of cold water (83.27 fl oz.).",
        "Slice your peaches and add them to each glass.",
        "Pour the tea over the peaches and enjoy.",
        "To serve cold, let the tea cool off and/or refrigerate it after brewing.",
        "Then serve over ice."
    ]
}