{
    "title": "How to Photograph Christmas Lights",
    "url": "https://www.wikihow.com/Photograph-Christmas-Lights",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Christmas"
    ],
    "methods": [
        {
            "name": "Setting up the Camera in a Good Location",
            "steps": [
                {
                    "headline": "Aim to begin shooting at dusk.",
                    "description": "This is the perfect time to photograph the lights, as it’s not too light and not too dark yet. Try to get to the location early, roughly 15-20 minutes before dusk, so you’re sure not to miss the ideal photographing time. Check to see when the sun is going to set so you can make a plan to arrive before dusk. If you take the pictures earlier, the lights won’t look lit in the photos, and if you take the pictures after the sun has set, then you won’t be able to see the background. When the Christmas lights look like they’re shining brighter against the darkening sky, it’s time to start taking pictures. Continue taking pictures of the lights until you’re satisfied with your collection or the sun completely sets."
                },
                {
                    "headline": "Bring a tripod to keep your shots stable.",
                    "description": "Since you’re using a slower shutter speed, your photos are going to be more affected by any wobbliness or movement. A tripod is necessary to keep your photographs stable and not blurry. Set the tripod up on stable ground before dusk so that you have time to make any adjustments. If you don’t have a tripod, try balancing your camera on the hood of a car or another stable surface. If you're using your phone, consider investing in a portable tripod made for your specific type of cellphone."
                },
                {
                    "headline": "Choose how close or far away you'll be from the lights.",
                    "description": "Your camera will require different settings depending on how close or far you are from the Christmas tree lights. Decide exactly what you want to capture in your photo, such as the details of the ornaments on the tree, or a decorated house with lots and lots of lights that is best seen from far away. For example, a picture of a close-up of a Christmas tree will likely require less lighting than a picture of a house lit up when the sun has set."
                },
                {
                    "headline": "Find the right lighting if you're shooting indoors.",
                    "description": "If you're taking pictures of your Christmas tree inside during the daylight, make sure you take it from the right angle. Avoid backlighting to ensure your picture doesn't come out super dark and be aware of how the windows will impact the lighting. If you're taking the picture indoors at night, try to dim the lights in your house so that the Christmas tree stands out but can still be seen. Take pictures from several different angles with different levels of lighting to see which one looks best."
                }
            ]
        },
        {
            "name": "Adjusting the Camera Settings",
            "steps": [
                {
                    "headline": "Use a manual camera so you can adjust your settings.",
                    "description": "Being able to adjust your camera settings is super important so that you get a great shot. This includes settings like the ISO, aperture, and shutter speed. If you already have a manual camera, great! If not, see if you can borrow one from a friend or family member. The best cameras for taking pictures of Christmas lights are DSLRs or mirrorless cameras. While it’s possible to take a good photo of Christmas lights using the camera on your phone, photos taken from a manual camera will turn out much better. If you do choose to use your phone, locate your phone's manual camera controls. These are likely only found on newer versions of phones."
                },
                {
                    "headline": "Find a macro or all-purpose wide angle lens.",
                    "description": "A macro lens is great for capturing a specific ornament or decoration on the Christmas tree, meaning it’s perfect for details. A wide angle lens is good for fitting an entire house or grouping of trees into the picture. Choose a lens that's appropriate for what you'll be photographing, whether it's a Christmas tree full of details or a large scene with many trees. Purchase a wide angle lens for your cellphone that comes as an attachment, if desired."
                },
                {
                    "headline": "Avoid using your camera’s flash.",
                    "description": "While it may seem like this would light up the background so it’s seen against the lights, this actually just dulls the brightness of the Christmas lights. If possible, try not to use the flash on your camera to achieve the best results. Even if you’re outside and it’s getting dark, keep the flash switched off."
                },
                {
                    "headline": "Keep the ISO around 400 to make up for the dark lighting.",
                    "description": "ISO measures the image sensor’s sensitivity to light. Go to your camera’s ISO settings and try to keep it between 400 and 800, with the lower the setting, the better. Test out different values until you find the best one for your lighting situation. Your pictures will become grainier the higher you set the ISO, which is why it’s not recommended to set it above 800. Consider downloading an app that extends your ISO range if you're taking the photos on your phone."
                },
                {
                    "headline": "Set the aperture to a low setting according to the light.",
                    "description": "The aperture is the hole that lets light pass through in the camera. For the best Christmas pictures, you want your aperture set to a low setting, likely between f/2.8 and f/8. Test out different settings within this range to find out which one works with the light around you. When you increase the aperture, you’re decreasing the amount of light that comes into the photo. This is why it’s important to keep it at a low setting—you need as much natural light as possible."
                },
                {
                    "headline": "Change the shutter speed to a slower setting.",
                    "description": "A slower shutter speed gives your camera more time to allow light into the photo, which is perfect for low-light settings like Christmas lights. Change your shutter speed to a low number, such as ⅛ of a second. The more time you give for exposure, the less grainy your picture will be. Keep your shutter speed between ⅛ of a second and ⅖ of a second. Be aware that low shutter speeds means the camera will be more susceptible to movement. Use an app like Camera+ 2 to slow down the shutter speed on your phone."
                },
                {
                    "headline": "Switch to the right white balance.",
                    "description": "The white balance setting on your camera helps fix the coloring in your photos, making sure they capture the true tones and light of the subject. Try setting the white balance to Daylight or Tungsten for the best results. These settings will make the lights look their clearest and most accurately colored. If you're using your phone, use the manual white balance settings, or download an app like the VSCO Cam."
                }
            ]
        }
    ],
    "tyn": [
        "Manual camera",
        "Tripod",
        "Macro or all-purpose wide angle lens"
    ],
    "text": " Setting up the Camera in a Good Location Aim to begin shooting at dusk. This is the perfect time to photograph the lights, as it’s not too light and not too dark yet. Try to get to the location early, roughly 15-20 minutes before dusk, so you’re sure not to miss the ideal photographing time. Check to see when the sun is going to set so you can make a plan to arrive before dusk. If you take the pictures earlier, the lights won’t look lit in the photos, and if you take the pictures after the sun has set, then you won’t be able to see the background. When the Christmas lights look like they’re shining brighter against the darkening sky, it’s time to start taking pictures. Continue taking pictures of the lights until you’re satisfied with your collection or the sun completely sets. Bring a tripod to keep your shots stable. Since you’re using a slower shutter speed, your photos are going to be more affected by any wobbliness or movement. A tripod is necessary to keep your photographs stable and not blurry. Set the tripod up on stable ground before dusk so that you have time to make any adjustments. If you don’t have a tripod, try balancing your camera on the hood of a car or another stable surface. If you're using your phone, consider investing in a portable tripod made for your specific type of cellphone. Choose how close or far away you'll be from the lights. Your camera will require different settings depending on how close or far you are from the Christmas tree lights. Decide exactly what you want to capture in your photo, such as the details of the ornaments on the tree, or a decorated house with lots and lots of lights that is best seen from far away. For example, a picture of a close-up of a Christmas tree will likely require less lighting than a picture of a house lit up when the sun has set. Find the right lighting if you're shooting indoors. If you're taking pictures of your Christmas tree inside during the daylight, make sure you take it from the right angle. Avoid backlighting to ensure your picture doesn't come out super dark and be aware of how the windows will impact the lighting. If you're taking the picture indoors at night, try to dim the lights in your house so that the Christmas tree stands out but can still be seen. Take pictures from several different angles with different levels of lighting to see which one looks best. Adjusting the Camera Settings Use a manual camera so you can adjust your settings. Being able to adjust your camera settings is super important so that you get a great shot. This includes settings like the ISO, aperture, and shutter speed. If you already have a manual camera, great! If not, see if you can borrow one from a friend or family member. The best cameras for taking pictures of Christmas lights are DSLRs or mirrorless cameras. While it’s possible to take a good photo of Christmas lights using the camera on your phone, photos taken from a manual camera will turn out much better. If you do choose to use your phone, locate your phone's manual camera controls. These are likely only found on newer versions of phones. Find a macro or all-purpose wide angle lens. A macro lens is great for capturing a specific ornament or decoration on the Christmas tree, meaning it’s perfect for details. A wide angle lens is good for fitting an entire house or grouping of trees into the picture. Choose a lens that's appropriate for what you'll be photographing, whether it's a Christmas tree full of details or a large scene with many trees. Purchase a wide angle lens for your cellphone that comes as an attachment, if desired. Avoid using your camera’s flash. While it may seem like this would light up the background so it’s seen against the lights, this actually just dulls the brightness of the Christmas lights. If possible, try not to use the flash on your camera to achieve the best results. Even if you’re outside and it’s getting dark, keep the flash switched off. Keep the ISO around 400 to make up for the dark lighting. ISO measures the image sensor’s sensitivity to light. Go to your camera’s ISO settings and try to keep it between 400 and 800, with the lower the setting, the better. Test out different values until you find the best one for your lighting situation. Your pictures will become grainier the higher you set the ISO, which is why it’s not recommended to set it above 800. Consider downloading an app that extends your ISO range if you're taking the photos on your phone. Set the aperture to a low setting according to the light. The aperture is the hole that lets light pass through in the camera. For the best Christmas pictures, you want your aperture set to a low setting, likely between f/2.8 and f/8. Test out different settings within this range to find out which one works with the light around you. When you increase the aperture, you’re decreasing the amount of light that comes into the photo. This is why it’s important to keep it at a low setting—you need as much natural light as possible. Change the shutter speed to a slower setting. A slower shutter speed gives your camera more time to allow light into the photo, which is perfect for low-light settings like Christmas lights. Change your shutter speed to a low number, such as ⅛ of a second. The more time you give for exposure, the less grainy your picture will be. Keep your shutter speed between ⅛ of a second and ⅖ of a second. Be aware that low shutter speeds means the camera will be more susceptible to movement. Use an app like Camera+ 2 to slow down the shutter speed on your phone. Switch to the right white balance. The white balance setting on your camera helps fix the coloring in your photos, making sure they capture the true tones and light of the subject. Try setting the white balance to Daylight or Tungsten for the best results. These settings will make the lights look their clearest and most accurately colored. If you're using your phone, use the manual white balance settings, or download an app like the VSCO Cam.",
    "sentences": [
        " Setting up the Camera in a Good Location Aim to begin shooting at dusk.",
        "This is the perfect time to photograph the lights, as it’s not too light and not too dark yet.",
        "Try to get to the location early, roughly 15-20 minutes before dusk, so you’re sure not to miss the ideal photographing time.",
        "Check to see when the sun is going to set so you can make a plan to arrive before dusk.",
        "If you take the pictures earlier, the lights won’t look lit in the photos, and if you take the pictures after the sun has set, then you won’t be able to see the background.",
        "When the Christmas lights look like they’re shining brighter against the darkening sky, it’s time to start taking pictures.",
        "Continue taking pictures of the lights until you’re satisfied with your collection or the sun completely sets.",
        "Bring a tripod to keep your shots stable.",
        "Since you’re using a slower shutter speed, your photos are going to be more affected by any wobbliness or movement.",
        "A tripod is necessary to keep your photographs stable and not blurry.",
        "Set the tripod up on stable ground before dusk so that you have time to make any adjustments.",
        "If you don’t have a tripod, try balancing your camera on the hood of a car or another stable surface.",
        "If you're using your phone, consider investing in a portable tripod made for your specific type of cellphone.",
        "Choose how close or far away you'll be from the lights.",
        "Your camera will require different settings depending on how close or far you are from the Christmas tree lights.",
        "Decide exactly what you want to capture in your photo, such as the details of the ornaments on the tree, or a decorated house with lots and lots of lights that is best seen from far away.",
        "For example, a picture of a close-up of a Christmas tree will likely require less lighting than a picture of a house lit up when the sun has set.",
        "Find the right lighting if you're shooting indoors.",
        "If you're taking pictures of your Christmas tree inside during the daylight, make sure you take it from the right angle.",
        "Avoid backlighting to ensure your picture doesn't come out super dark and be aware of how the windows will impact the lighting.",
        "If you're taking the picture indoors at night, try to dim the lights in your house so that the Christmas tree stands out but can still be seen.",
        "Take pictures from several different angles with different levels of lighting to see which one looks best.",
        "Adjusting the Camera Settings Use a manual camera so you can adjust your settings.",
        "Being able to adjust your camera settings is super important so that you get a great shot.",
        "This includes settings like the ISO, aperture, and shutter speed.",
        "If you already have a manual camera, great!",
        "If not, see if you can borrow one from a friend or family member.",
        "The best cameras for taking pictures of Christmas lights are DSLRs or mirrorless cameras.",
        "While it’s possible to take a good photo of Christmas lights using the camera on your phone, photos taken from a manual camera will turn out much better.",
        "If you do choose to use your phone, locate your phone's manual camera controls.",
        "These are likely only found on newer versions of phones.",
        "Find a macro or all-purpose wide angle lens.",
        "A macro lens is great for capturing a specific ornament or decoration on the Christmas tree, meaning it’s perfect for details.",
        "A wide angle lens is good for fitting an entire house or grouping of trees into the picture.",
        "Choose a lens that's appropriate for what you'll be photographing, whether it's a Christmas tree full of details or a large scene with many trees.",
        "Purchase a wide angle lens for your cellphone that comes as an attachment, if desired.",
        "Avoid using your camera’s flash.",
        "While it may seem like this would light up the background so it’s seen against the lights, this actually just dulls the brightness of the Christmas lights.",
        "If possible, try not to use the flash on your camera to achieve the best results.",
        "Even if you’re outside and it’s getting dark, keep the flash switched off.",
        "Keep the ISO around 400 to make up for the dark lighting.",
        "ISO measures the image sensor’s sensitivity to light.",
        "Go to your camera’s ISO settings and try to keep it between 400 and 800, with the lower the setting, the better.",
        "Test out different values until you find the best one for your lighting situation.",
        "Your pictures will become grainier the higher you set the ISO, which is why it’s not recommended to set it above 800.",
        "Consider downloading an app that extends your ISO range if you're taking the photos on your phone.",
        "Set the aperture to a low setting according to the light.",
        "The aperture is the hole that lets light pass through in the camera.",
        "For the best Christmas pictures, you want your aperture set to a low setting, likely between f/2.8 and f/8.",
        "Test out different settings within this range to find out which one works with the light around you.",
        "When you increase the aperture, you’re decreasing the amount of light that comes into the photo.",
        "This is why it’s important to keep it at a low setting—you need as much natural light as possible.",
        "Change the shutter speed to a slower setting.",
        "A slower shutter speed gives your camera more time to allow light into the photo, which is perfect for low-light settings like Christmas lights.",
        "Change your shutter speed to a low number, such as ⅛ of a second.",
        "The more time you give for exposure, the less grainy your picture will be.",
        "Keep your shutter speed between ⅛ of a second and ⅖ of a second.",
        "Be aware that low shutter speeds means the camera will be more susceptible to movement.",
        "Use an app like Camera+ 2 to slow down the shutter speed on your phone.",
        "Switch to the right white balance.",
        "The white balance setting on your camera helps fix the coloring in your photos, making sure they capture the true tones and light of the subject.",
        "Try setting the white balance to Daylight or Tungsten for the best results.",
        "These settings will make the lights look their clearest and most accurately colored.",
        "If you're using your phone, use the manual white balance settings, or download an app like the VSCO Cam."
    ]
}