{
    "title": "How to Draw the Powerpuff Girls",
    "url": "https://www.wikihow.com/Draw-the-Powerpuff-Girls",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Movies",
        "Filmmaking",
        "Animation"
    ],
    "methods": [
        {
            "name": "Blossom",
            "steps": [
                {
                    "headline": "Start by drawing an oval shape.",
                    "description": ""
                },
                {
                    "headline": "Draw the body with a small rectangle shape.",
                    "description": ""
                },
                {
                    "headline": "Draw the hands and the legs.",
                    "description": "Just draw bean shapes for the hands and short oval shapes attached to the body for the legs."
                },
                {
                    "headline": "Draw the bangs.",
                    "description": "Start with drawing a horizontal line across the forehead and add 3 triangles on the top of the line."
                },
                {
                    "headline": "Draw large circular eyes.",
                    "description": "Draw three more circles within the big circle for the pupils, each one should be smaller than the first. Add a \"U\" shape for a smiling mouth."
                },
                {
                    "headline": "Draw the ribbon on top of the head and long hair at the back.",
                    "description": ""
                },
                {
                    "headline": "Add two horizontal line on the body for her dress.",
                    "description": "Sketch a horizontal line on the feet with a semicircle in the middle for the shoes."
                },
                {
                    "headline": "Finalize your drawing and erase unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Colour your drawing.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Bubbles",
            "steps": [
                {
                    "headline": "Draw an oval shape.",
                    "description": ""
                },
                {
                    "headline": "Draw the body with a rectangle shape, bend it at will based on the body position you are planning to draw.",
                    "description": ""
                },
                {
                    "headline": "Draw two long ovals for the hands and long curves for the feet.",
                    "description": ""
                },
                {
                    "headline": "Draw the bangs with two curved lines connected at the center of the forehead.",
                    "description": ""
                },
                {
                    "headline": "Draw large circular eyes.",
                    "description": "Draw three more circles within the big circle for the pupils, each one should be smaller than the first. Add a curved line for the mouth."
                },
                {
                    "headline": "Add two teardrop shapes at each side of the head for the twin tail hairstyle.",
                    "description": ""
                },
                {
                    "headline": "Add two horizontal line on the body for the pattern on her dress.",
                    "description": "Sketch a line across the feet and a curved line attached to it for her shoes."
                },
                {
                    "headline": "Finalize your drawing and erase unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Colour your drawing.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Buttercup",
            "steps": [
                {
                    "headline": "Draw an oval shape for the head.",
                    "description": ""
                },
                {
                    "headline": "Draw the body with a rectangle shape, bend it at will based on the body position you're planning to draw.",
                    "description": ""
                },
                {
                    "headline": "Attached to the head, draw the hands with curved shapes.",
                    "description": "For the legs, draw one oblong and one \"U\" shape attached to the torso."
                },
                {
                    "headline": "Draw a horizontal line across the forehead and one triangle in the middle for her bangs.",
                    "description": ""
                },
                {
                    "headline": "Draw two \"check\" lines one inverted for the eyebrows, this will indicate anger facial expression.",
                    "description": "Add large circular eyes. Draw three more circles within the big circle for the pupils, each one should be smaller than the first. Add an inverted curved line for the mouth."
                },
                {
                    "headline": "Add two horn-like shapes at each side of the head for Buttercup's hairstyle.",
                    "description": ""
                },
                {
                    "headline": "Add two horizontal line on the body for the pattern in her dress.",
                    "description": "Draw a line across each of her feet and a semicircle attached to it for her shoes."
                },
                {
                    "headline": "Finalize your drawing and erase unnecessary lines.",
                    "description": ""
                },
                {
                    "headline": "Colour your drawing.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Paper",
        "Pencil",
        "Pencil sharpener",
        "Eraser",
        "Colored pencils, crayons, markers or watercolors"
    ],
    "text": " Blossom Start by drawing an oval shape.  Draw the body with a small rectangle shape.  Draw the hands and the legs. Just draw bean shapes for the hands and short oval shapes attached to the body for the legs. Draw the bangs. Start with drawing a horizontal line across the forehead and add 3 triangles on the top of the line. Draw large circular eyes. Draw three more circles within the big circle for the pupils, each one should be smaller than the first. Add a \"U\" shape for a smiling mouth. Draw the ribbon on top of the head and long hair at the back.  Add two horizontal line on the body for her dress. Sketch a horizontal line on the feet with a semicircle in the middle for the shoes. Finalize your drawing and erase unnecessary lines.  Colour your drawing.  Bubbles Draw an oval shape.  Draw the body with a rectangle shape, bend it at will based on the body position you are planning to draw.  Draw two long ovals for the hands and long curves for the feet.  Draw the bangs with two curved lines connected at the center of the forehead.  Draw large circular eyes. Draw three more circles within the big circle for the pupils, each one should be smaller than the first. Add a curved line for the mouth. Add two teardrop shapes at each side of the head for the twin tail hairstyle.  Add two horizontal line on the body for the pattern on her dress. Sketch a line across the feet and a curved line attached to it for her shoes. Finalize your drawing and erase unnecessary lines.  Colour your drawing.  Buttercup Draw an oval shape for the head.  Draw the body with a rectangle shape, bend it at will based on the body position you're planning to draw.  Attached to the head, draw the hands with curved shapes. For the legs, draw one oblong and one \"U\" shape attached to the torso. Draw a horizontal line across the forehead and one triangle in the middle for her bangs.  Draw two \"check\" lines one inverted for the eyebrows, this will indicate anger facial expression. Add large circular eyes. Draw three more circles within the big circle for the pupils, each one should be smaller than the first. Add an inverted curved line for the mouth. Add two horn-like shapes at each side of the head for Buttercup's hairstyle.  Add two horizontal line on the body for the pattern in her dress. Draw a line across each of her feet and a semicircle attached to it for her shoes. Finalize your drawing and erase unnecessary lines.  Colour your drawing. ",
    "sentences": [
        " Blossom Start by drawing an oval shape.",
        "Draw the body with a small rectangle shape.",
        "Draw the hands and the legs.",
        "Just draw bean shapes for the hands and short oval shapes attached to the body for the legs.",
        "Draw the bangs.",
        "Start with drawing a horizontal line across the forehead and add 3 triangles on the top of the line.",
        "Draw large circular eyes.",
        "Draw three more circles within the big circle for the pupils, each one should be smaller than the first.",
        "Add a \"U\" shape for a smiling mouth.",
        "Draw the ribbon on top of the head and long hair at the back.",
        "Add two horizontal line on the body for her dress.",
        "Sketch a horizontal line on the feet with a semicircle in the middle for the shoes.",
        "Finalize your drawing and erase unnecessary lines.",
        "Colour your drawing.",
        "Bubbles Draw an oval shape.",
        "Draw the body with a rectangle shape, bend it at will based on the body position you are planning to draw.",
        "Draw two long ovals for the hands and long curves for the feet.",
        "Draw the bangs with two curved lines connected at the center of the forehead.",
        "Draw large circular eyes.",
        "Draw three more circles within the big circle for the pupils, each one should be smaller than the first.",
        "Add a curved line for the mouth.",
        "Add two teardrop shapes at each side of the head for the twin tail hairstyle.",
        "Add two horizontal line on the body for the pattern on her dress.",
        "Sketch a line across the feet and a curved line attached to it for her shoes.",
        "Finalize your drawing and erase unnecessary lines.",
        "Colour your drawing.",
        "Buttercup Draw an oval shape for the head.",
        "Draw the body with a rectangle shape, bend it at will based on the body position you're planning to draw.",
        "Attached to the head, draw the hands with curved shapes.",
        "For the legs, draw one oblong and one \"U\" shape attached to the torso.",
        "Draw a horizontal line across the forehead and one triangle in the middle for her bangs.",
        "Draw two \"check\" lines one inverted for the eyebrows, this will indicate anger facial expression.",
        "Add large circular eyes.",
        "Draw three more circles within the big circle for the pupils, each one should be smaller than the first.",
        "Add an inverted curved line for the mouth.",
        "Add two horn-like shapes at each side of the head for Buttercup's hairstyle.",
        "Add two horizontal line on the body for the pattern in her dress.",
        "Draw a line across each of her feet and a semicircle attached to it for her shoes.",
        "Finalize your drawing and erase unnecessary lines.",
        "Colour your drawing."
    ]
}