{
    "title": "How to Make Potato Croquettes",
    "url": "https://www.wikihow.com/Make-Potato-Croquettes",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Fruits and Vegetables",
        "Potato Dishes"
    ],
    "methods": [
        {
            "name": "Making Basic Potato Croquettes",
            "steps": [
                {
                    "headline": "Boil the potatoes until they turn tender, about 15 minutes.",
                    "description": "Put the peeled and cut potatoes into a large pot, and cover them with salted water. Boil them for 15 to 20 minutes, or until they turn tender."
                },
                {
                    "headline": "Drain the potatoes, then let them chill for about 45 minutes.",
                    "description": "This not only helps dry the potatoes, but also firms them up a little."
                },
                {
                    "headline": "Mash the potatoes using a fork or potato masher.",
                    "description": "Don't worry about making them perfectly smooth. You actually want there to be some lumps and clumps."
                },
                {
                    "headline": "Mix in the cheeses, onion salt, parsley, pepper, and salt using a wooden spoon or rubber spatula.",
                    "description": "Keep mixing until everything is evenly combined. Remember to go easy on the salt because the onion salt will already have added some saltiness."
                },
                {
                    "headline": "Beat one egg in a small bowl lightly, then stir it into the potato mixture.",
                    "description": "Do not add the other two eggs; you will be using them for coating the croquettes."
                },
                {
                    "headline": "Roll the potato mixture into 24 croquettes.",
                    "description": "You will need about ¼ cup (80 grams) for each croquette. Roll the croquettes into oval-shaped balls first, then lightly flatten them with your palm. You don't want them to be completely flat. They should be plump, but flat enough so that they don't roll around."
                },
                {
                    "headline": "Chill the croquettes in the fridge for 15 to 30 minutes.",
                    "description": "Place the croquettes onto a baking sheet lined with wax paper or parchment paper, then transfer them to the fridge. This will help firm the potato mixture up and prevent it from falling apart while frying."
                },
                {
                    "headline": "Lightly beat the remaining two eggs in a shallow dish using a fork or mini whisk.",
                    "description": ""
                },
                {
                    "headline": "Put the breadcrumbs into another shallow dish.",
                    "description": ""
                },
                {
                    "headline": "Dip each croquette into the egg mixture, the dredge it through the breadcrumbs.",
                    "description": "Make sure that you coat both sides of each croquette evenly, and that you let any excess egg mixture drip off before you move onto the breadcrumbs."
                },
                {
                    "headline": "Heat the oil in a skillet over medium-high heat.",
                    "description": "Fill the bottom of a 12-inch (30.48 centimeters) skillet with ½ inch (1.27 centimeters) of oil. Place the skillet onto the stove, and turn the heat up to medium-high. Let the oil heat up until it starts to simmer."
                },
                {
                    "headline": "Fry the croquettes in the skillet until they turn golden brown, about 4 to 5 minutes per side.",
                    "description": "Do not fry all of the croquettes all at once. Instead, work in small batches so that you have about 2 inches (5.08 centimeters) of space between the croquettes; this will allow them to cook evenly and prevent them from crumbling. After 4 to 5 minutes, flip the croquettes over using a spatula, and cook them for 4 to 5 minutes more. Add more oil as needed."
                },
                {
                    "headline": "Let the croquettes drain on some folded paper towels before serving them.",
                    "description": "These croquettes are great with sauce or ketchup."
                }
            ]
        },
        {
            "name": "Making Korokke or Japanese Potato Croquettes",
            "steps": [
                {
                    "headline": "Boil the potatoes in a large pot of water.",
                    "description": "Place the potatoes (peeled and cut) into a large pot, and fill it with enough water to cover the potatoes. Bring the water to a boil, then cook the potatoes until they become tender, about 15 to 20 minutes."
                },
                {
                    "headline": "Drain the water from the potatoes, then let them sit in the pot over low heat until the moisture evaporates.",
                    "description": "Don't let the potatoes burn. Letting the water evaporate will keep the potatoes from getting too soggy."
                },
                {
                    "headline": "Mash the potatoes roughly using a fork or potato masher.",
                    "description": "Don't worry about making them perfectly smooth. You actually want there to be some clumps. Set the potatoes aside when you are done."
                },
                {
                    "headline": "Sauté the onion over medium-high heat.",
                    "description": "Place a large skillet on the stove and add 1 tablespoon of oil. Turn the heat up to high and dice the onion. Add the onion once the oil gets hot, then cook it until it turns soft, about 4 to 5 minutes."
                },
                {
                    "headline": "Consider adding some carrots, shiitake mushrooms, and frozen peas for extra flavor.",
                    "description": "You can add just one or two of these, or even all three. Cook your optional ingredients with the onions until they turn soft."
                },
                {
                    "headline": "Add the ground beef, and cook it until it browns, then season it with some salt and pepper.",
                    "description": "Use a wooden spoon to help break the meat up and mix it in with the onion. For even more flavor:\nIn a small bowl, whisk together: 1 teaspoon fish stock, 2 teaspoons sugar, 1 tablespoon sake, 1 tablespoon Mirin (or sweet rice wine), and 4 tablespoons of soy sauce. Stir the sauce into your beef and onion mixture. Let it simmer for 5 minutes."
                },
                {
                    "headline": "Stir the meat mixture into the mashed potatoes, but leave the liquid behind.",
                    "description": "You just want the dry, beef-and-onion mixture. It might be a good idea to put the beef-and-onion mixture into a strainer to drain out any liquid before adding it to the mashed potatoes."
                },
                {
                    "headline": "Add a lightly beaten egg to the potato mixture, and still again until well-combined.",
                    "description": "Beat the egg in a small bowl using a fork or mini whisk, then pour it into the mashed potato mixture. Stir everything together using a wooden spoon or rubber spatula."
                },
                {
                    "headline": "Let the mixture cool down enough to handle, then form it into \"korokke\" balls.",
                    "description": "Roll the mixture into oval-shaped balls, then flatten them slightly with your palm. You want them to still be thick and \"plump,\" but flat enough so that they don't roll around. You can also make round ones that are 3 inches (7.62 centimeters) wide and ¾-inch (1.91 centimeters) thick."
                },
                {
                    "headline": "Let the korokke balls chill in the fridge for 15 to 30 minutes.",
                    "description": "This will help the mixture set up, and prevent it from falling apart in the pan."
                },
                {
                    "headline": "Dredge the balls in flour, egg, and Panko, in that order.",
                    "description": "Make sure that you coat each ball evenly with each ingredient. To make things easier, put the flour, eggs, and Panko into shallow dishes, and arrange them in a row. This way, you can just move the balls from one bowl to the next without making a big mess."
                },
                {
                    "headline": "Fry the korokke balls in hot oil over medium heat until they turn golden brown, about 3 minutes per side.",
                    "description": "Heat some oil in a wok or large frying pan over medium heat. When the oil reaches 350°F (180°C), add the korokke balls. Fry the korokke balls for 3 minutes on each side, or until they turn golden-brown. You will need 2 tablespoons for every 6 korokke. Add more oil as needed. You can also bake the korokke in the oven at 400°F(200°C) for 10 to 15 minutes. Bake them on a baking sheet lined with parchment paper."
                },
                {
                    "headline": "Drain the korokke.",
                    "description": "As you finish frying the korokke, place them onto several folded paper towels so that the excess oil can drain."
                },
                {
                    "headline": "Serve the korokke.",
                    "description": "They taste great with tonkatsu sauce, but you can also use ketchup instead. They also taste great alongside any beef dish or salad leaves."
                }
            ]
        }
    ],
    "tyn": [
        "Making Basic Potato Croquettes",
        "Large pot",
        "Large mixing bowl",
        "Wooden spoon or rubber spatula",
        "Fork or mini whisk",
        "2 shallow dishes",
        "12-inch (30.48 centimeters) skillet",
        "Spatula",
        "Paper towels",
        "Making Korokke or Japanese Potato Croquettes",
        "Fork or potato masher",
        "Large skillet",
        "Wooden spoon",
        "Small bowl",
        "Wok or large skillet",
        "Measuring cups and spoons",
        "3 shallow dishes"
    ],
    "text": " Making Basic Potato Croquettes Boil the potatoes until they turn tender, about 15 minutes. Put the peeled and cut potatoes into a large pot, and cover them with salted water. Boil them for 15 to 20 minutes, or until they turn tender. Drain the potatoes, then let them chill for about 45 minutes. This not only helps dry the potatoes, but also firms them up a little. Mash the potatoes using a fork or potato masher. Don't worry about making them perfectly smooth. You actually want there to be some lumps and clumps. Mix in the cheeses, onion salt, parsley, pepper, and salt using a wooden spoon or rubber spatula. Keep mixing until everything is evenly combined. Remember to go easy on the salt because the onion salt will already have added some saltiness. Beat one egg in a small bowl lightly, then stir it into the potato mixture. Do not add the other two eggs; you will be using them for coating the croquettes. Roll the potato mixture into 24 croquettes. You will need about ¼ cup (80 grams) for each croquette. Roll the croquettes into oval-shaped balls first, then lightly flatten them with your palm. You don't want them to be completely flat. They should be plump, but flat enough so that they don't roll around. Chill the croquettes in the fridge for 15 to 30 minutes. Place the croquettes onto a baking sheet lined with wax paper or parchment paper, then transfer them to the fridge. This will help firm the potato mixture up and prevent it from falling apart while frying. Lightly beat the remaining two eggs in a shallow dish using a fork or mini whisk.  Put the breadcrumbs into another shallow dish.  Dip each croquette into the egg mixture, the dredge it through the breadcrumbs. Make sure that you coat both sides of each croquette evenly, and that you let any excess egg mixture drip off before you move onto the breadcrumbs. Heat the oil in a skillet over medium-high heat. Fill the bottom of a 12-inch (30.48 centimeters) skillet with ½ inch (1.27 centimeters) of oil. Place the skillet onto the stove, and turn the heat up to medium-high. Let the oil heat up until it starts to simmer. Fry the croquettes in the skillet until they turn golden brown, about 4 to 5 minutes per side. Do not fry all of the croquettes all at once. Instead, work in small batches so that you have about 2 inches (5.08 centimeters) of space between the croquettes; this will allow them to cook evenly and prevent them from crumbling. After 4 to 5 minutes, flip the croquettes over using a spatula, and cook them for 4 to 5 minutes more. Add more oil as needed. Let the croquettes drain on some folded paper towels before serving them. These croquettes are great with sauce or ketchup. Making Korokke or Japanese Potato Croquettes Boil the potatoes in a large pot of water. Place the potatoes (peeled and cut) into a large pot, and fill it with enough water to cover the potatoes. Bring the water to a boil, then cook the potatoes until they become tender, about 15 to 20 minutes. Drain the water from the potatoes, then let them sit in the pot over low heat until the moisture evaporates. Don't let the potatoes burn. Letting the water evaporate will keep the potatoes from getting too soggy. Mash the potatoes roughly using a fork or potato masher. Don't worry about making them perfectly smooth. You actually want there to be some clumps. Set the potatoes aside when you are done. Sauté the onion over medium-high heat. Place a large skillet on the stove and add 1 tablespoon of oil. Turn the heat up to high and dice the onion. Add the onion once the oil gets hot, then cook it until it turns soft, about 4 to 5 minutes. Consider adding some carrots, shiitake mushrooms, and frozen peas for extra flavor. You can add just one or two of these, or even all three. Cook your optional ingredients with the onions until they turn soft. Add the ground beef, and cook it until it browns, then season it with some salt and pepper. Use a wooden spoon to help break the meat up and mix it in with the onion. For even more flavor:\nIn a small bowl, whisk together: 1 teaspoon fish stock, 2 teaspoons sugar, 1 tablespoon sake, 1 tablespoon Mirin (or sweet rice wine), and 4 tablespoons of soy sauce. Stir the sauce into your beef and onion mixture. Let it simmer for 5 minutes. Stir the meat mixture into the mashed potatoes, but leave the liquid behind. You just want the dry, beef-and-onion mixture. It might be a good idea to put the beef-and-onion mixture into a strainer to drain out any liquid before adding it to the mashed potatoes. Add a lightly beaten egg to the potato mixture, and still again until well-combined. Beat the egg in a small bowl using a fork or mini whisk, then pour it into the mashed potato mixture. Stir everything together using a wooden spoon or rubber spatula. Let the mixture cool down enough to handle, then form it into \"korokke\" balls. Roll the mixture into oval-shaped balls, then flatten them slightly with your palm. You want them to still be thick and \"plump,\" but flat enough so that they don't roll around. You can also make round ones that are 3 inches (7.62 centimeters) wide and ¾-inch (1.91 centimeters) thick. Let the korokke balls chill in the fridge for 15 to 30 minutes. This will help the mixture set up, and prevent it from falling apart in the pan. Dredge the balls in flour, egg, and Panko, in that order. Make sure that you coat each ball evenly with each ingredient. To make things easier, put the flour, eggs, and Panko into shallow dishes, and arrange them in a row. This way, you can just move the balls from one bowl to the next without making a big mess. Fry the korokke balls in hot oil over medium heat until they turn golden brown, about 3 minutes per side. Heat some oil in a wok or large frying pan over medium heat. When the oil reaches 350°F (180°C), add the korokke balls. Fry the korokke balls for 3 minutes on each side, or until they turn golden-brown. You will need 2 tablespoons for every 6 korokke. Add more oil as needed. You can also bake the korokke in the oven at 400°F(200°C) for 10 to 15 minutes. Bake them on a baking sheet lined with parchment paper. Drain the korokke. As you finish frying the korokke, place them onto several folded paper towels so that the excess oil can drain. Serve the korokke. They taste great with tonkatsu sauce, but you can also use ketchup instead. They also taste great alongside any beef dish or salad leaves.",
    "sentences": [
        " Making Basic Potato Croquettes Boil the potatoes until they turn tender, about 15 minutes.",
        "Put the peeled and cut potatoes into a large pot, and cover them with salted water.",
        "Boil them for 15 to 20 minutes, or until they turn tender.",
        "Drain the potatoes, then let them chill for about 45 minutes.",
        "This not only helps dry the potatoes, but also firms them up a little.",
        "Mash the potatoes using a fork or potato masher.",
        "Don't worry about making them perfectly smooth.",
        "You actually want there to be some lumps and clumps.",
        "Mix in the cheeses, onion salt, parsley, pepper, and salt using a wooden spoon or rubber spatula.",
        "Keep mixing until everything is evenly combined.",
        "Remember to go easy on the salt because the onion salt will already have added some saltiness.",
        "Beat one egg in a small bowl lightly, then stir it into the potato mixture.",
        "Do not add the other two eggs; you will be using them for coating the croquettes.",
        "Roll the potato mixture into 24 croquettes.",
        "You will need about ¼ cup (80 grams) for each croquette.",
        "Roll the croquettes into oval-shaped balls first, then lightly flatten them with your palm.",
        "You don't want them to be completely flat.",
        "They should be plump, but flat enough so that they don't roll around.",
        "Chill the croquettes in the fridge for 15 to 30 minutes.",
        "Place the croquettes onto a baking sheet lined with wax paper or parchment paper, then transfer them to the fridge.",
        "This will help firm the potato mixture up and prevent it from falling apart while frying.",
        "Lightly beat the remaining two eggs in a shallow dish using a fork or mini whisk.",
        "Put the breadcrumbs into another shallow dish.",
        "Dip each croquette into the egg mixture, the dredge it through the breadcrumbs.",
        "Make sure that you coat both sides of each croquette evenly, and that you let any excess egg mixture drip off before you move onto the breadcrumbs.",
        "Heat the oil in a skillet over medium-high heat.",
        "Fill the bottom of a 12-inch (30.48 centimeters) skillet with ½ inch (1.27 centimeters) of oil.",
        "Place the skillet onto the stove, and turn the heat up to medium-high.",
        "Let the oil heat up until it starts to simmer.",
        "Fry the croquettes in the skillet until they turn golden brown, about 4 to 5 minutes per side.",
        "Do not fry all of the croquettes all at once.",
        "Instead, work in small batches so that you have about 2 inches (5.08 centimeters) of space between the croquettes; this will allow them to cook evenly and prevent them from crumbling.",
        "After 4 to 5 minutes, flip the croquettes over using a spatula, and cook them for 4 to 5 minutes more.",
        "Add more oil as needed.",
        "Let the croquettes drain on some folded paper towels before serving them.",
        "These croquettes are great with sauce or ketchup.",
        "Making Korokke or Japanese Potato Croquettes Boil the potatoes in a large pot of water.",
        "Place the potatoes (peeled and cut) into a large pot, and fill it with enough water to cover the potatoes.",
        "Bring the water to a boil, then cook the potatoes until they become tender, about 15 to 20 minutes.",
        "Drain the water from the potatoes, then let them sit in the pot over low heat until the moisture evaporates.",
        "Don't let the potatoes burn.",
        "Letting the water evaporate will keep the potatoes from getting too soggy.",
        "Mash the potatoes roughly using a fork or potato masher.",
        "Don't worry about making them perfectly smooth.",
        "You actually want there to be some clumps.",
        "Set the potatoes aside when you are done.",
        "Sauté the onion over medium-high heat.",
        "Place a large skillet on the stove and add 1 tablespoon of oil.",
        "Turn the heat up to high and dice the onion.",
        "Add the onion once the oil gets hot, then cook it until it turns soft, about 4 to 5 minutes.",
        "Consider adding some carrots, shiitake mushrooms, and frozen peas for extra flavor.",
        "You can add just one or two of these, or even all three.",
        "Cook your optional ingredients with the onions until they turn soft.",
        "Add the ground beef, and cook it until it browns, then season it with some salt and pepper.",
        "Use a wooden spoon to help break the meat up and mix it in with the onion.",
        "For even more flavor:\nIn a small bowl, whisk together: 1 teaspoon fish stock, 2 teaspoons sugar, 1 tablespoon sake, 1 tablespoon Mirin (or sweet rice wine), and 4 tablespoons of soy sauce.",
        "Stir the sauce into your beef and onion mixture.",
        "Let it simmer for 5 minutes.",
        "Stir the meat mixture into the mashed potatoes, but leave the liquid behind.",
        "You just want the dry, beef-and-onion mixture.",
        "It might be a good idea to put the beef-and-onion mixture into a strainer to drain out any liquid before adding it to the mashed potatoes.",
        "Add a lightly beaten egg to the potato mixture, and still again until well-combined.",
        "Beat the egg in a small bowl using a fork or mini whisk, then pour it into the mashed potato mixture.",
        "Stir everything together using a wooden spoon or rubber spatula.",
        "Let the mixture cool down enough to handle, then form it into \"korokke\" balls.",
        "Roll the mixture into oval-shaped balls, then flatten them slightly with your palm.",
        "You want them to still be thick and \"plump,\" but flat enough so that they don't roll around.",
        "You can also make round ones that are 3 inches (7.62 centimeters) wide and ¾-inch (1.91 centimeters) thick.",
        "Let the korokke balls chill in the fridge for 15 to 30 minutes.",
        "This will help the mixture set up, and prevent it from falling apart in the pan.",
        "Dredge the balls in flour, egg, and Panko, in that order.",
        "Make sure that you coat each ball evenly with each ingredient.",
        "To make things easier, put the flour, eggs, and Panko into shallow dishes, and arrange them in a row.",
        "This way, you can just move the balls from one bowl to the next without making a big mess.",
        "Fry the korokke balls in hot oil over medium heat until they turn golden brown, about 3 minutes per side.",
        "Heat some oil in a wok or large frying pan over medium heat.",
        "When the oil reaches 350°F (180°C), add the korokke balls.",
        "Fry the korokke balls for 3 minutes on each side, or until they turn golden-brown.",
        "You will need 2 tablespoons for every 6 korokke.",
        "Add more oil as needed.",
        "You can also bake the korokke in the oven at 400°F(200°C) for 10 to 15 minutes.",
        "Bake them on a baking sheet lined with parchment paper.",
        "Drain the korokke.",
        "As you finish frying the korokke, place them onto several folded paper towels so that the excess oil can drain.",
        "Serve the korokke.",
        "They taste great with tonkatsu sauce, but you can also use ketchup instead.",
        "They also taste great alongside any beef dish or salad leaves."
    ]
}