{
    "title": "How to Keep an RV Water Hose from Freezing",
    "url": "https://www.wikihow.com/Keep-an-RV-Water-Hose-from-Freezing",
    "category_hierarchy": [
        "Home and Garden",
        "Heating and Cooling"
    ],
    "methods": [
        {
            "name": "Wrapping the Hose",
            "steps": [
                {
                    "headline": "Measure the length of the hose so you know how much insulation to get.",
                    "description": "Lay out your water hose on a flat surface and try to make it as straight as possible. Use a tape measure to find the length of the hose from one end to the other. Write down the length of the hose so you can easily remember it later. If you're using a new hose for your RV, look on the packaging to determine how long it is. You only need to measure the length of the hose that connects to your water supply."
                },
                {
                    "headline": "Tape heat cable every 1 ft (30 cm) along the hose.",
                    "description": "Heat cable detects the temperature of the hose and heats it up if it gets too cold. Get a heat cable that matches the length of your hose and secure the sensor with electrical tape so it's pressed against the hose. Run the cable parallel with the hose and wrap electrical tape around it every 1 foot (30 cm) so it stays in place. You can buy heat cables from hardware stores or specialty camping stores. Use heat cables whenever you stay in an area that is colder than 32 °F (0 °C). Most RV sites in colder climates already have insulation around the supply lines. If the water supply line at your campsite doesn't already have insulation, you may need to wrap heat cable around it as well.Warning: Avoid coiling the heat cable around the hose since it could make areas too hot and cause damage to the hose."
                },
                {
                    "headline": "Cover the hose and heat cable with foam insulation tubes.",
                    "description": "Once the heat tube is secured, get enough foam insulation tubes to match the length of your hose. Pull the side of the foam tubing apart so you can put your hose inside of it. Press the opening in the side of the tubing together so the hose isn't exposed and use duct tape every 1–2 feet (0.30–0.61 m) to hold it in place. You can buy foam tube insulation from hardware stores. Foam insulation also comes in pieces at 90-degree angles so you can insulate the port where your water hose connects to the RV. Some foam tubes are self-adhesive so you don't need to use tape."
                },
                {
                    "headline": "Wrap the outside of the foam with pipe insulation tape.",
                    "description": "Pipe insulation tape has a foil-like exterior and adheres to itself to prevent heat from escaping. Start wrapping near the end of the hose, overlapping the tape by about ⁄2 inch (1.3 cm) with each coil. Continue wrapping the tape around the foam tubing until you reach the other end of the hose. You can buy insulation tape from your local hardware store. If you don't have insulation tape, you can also wrap aluminum foil around the tubing and duct tape it every 1 foot (30 cm) to hold it in place."
                },
                {
                    "headline": "Plug the heat cable into the power supply to keep the hose warm.",
                    "description": "Heat cable needs to have a power source in order to work, so run the plug either to the campsites power supply or an outlet on your RV. Once the heat cable is plugged in, it will detect low temperatures and turn on whenever it gets too cold for your hose."
                },
                {
                    "headline": "Connect the hose to the water supply and your RV's pump.",
                    "description": "Attach the end of the hose to the port in the side of your RV that leads to the water tanks. Then connect the other end of the pipe to the water supply pump on your campsite. Open the valves by turning them clockwise so fresh water can run into your RV. If you're still worried about your hose freezing, you can use it to fill your fresh water tank and then disconnect the hose so it's not outside."
                }
            ]
        },
        {
            "name": "Insulating the Water Valves",
            "steps": [
                {
                    "headline": "Put a skirt around the base of your RV to keep water lines from freezing.",
                    "description": "A skirt shields the area underneath your RV from the elements to protect any exterior water lines or valves. Use insulating foam boards around the perimeter of your RV so it doesn't get cold underneath. Make sure the foam boards fit snugly under your RV or else they won't be as effective. You can buy insulating foam boards from your local hardware store. Some specialty RV stores may sell skirts that you can easily attach and store away when you're not using it. Check online for RV skirts to see what's available for your vehicle's model. You need to insulate the water valves as well as the supply hose you're using."
                },
                {
                    "headline": "Keep a heat lamp in the water compartment to melt any ice.",
                    "description": "The water valves are usually located in an exterior compartment on the RV. While some of these compartments may be heated when you run your RV, they may still freeze if it gets too cold. Plug in a small space heater or heat lamp in the compartment to keep it warm or else your valves could freeze and prevent water from running through them. Make sure the heater or lamp is unplugged when you aren't using it. If your tanks are outside or exposed, you may not be able to use a heater or lamp to keep them thawed.Tip: If the valves do freeze, try pouring a small amount of hot water on them or using a heat gun to melt anything that's frozen."
                },
                {
                    "headline": "Avoid dumping the water tanks until they're full.",
                    "description": "Empty water tanks are more likely to freeze and could plug the valves and hoses with ice. Close the valves on your water tanks by turning them counterclockwise so the liquid stays inside. When your tanks are filled, dump them so they are only ¼ of the way filled so they don't freeze."
                },
                {
                    "headline": "Use a holding tank heater if there's any risk of them freezing.",
                    "description": "Holding tank heaters are like electric blankets that keep your tanks from freezing. Plug the tank heater into your RV and drape it around the water holding tanks. Keep the heater on whenever the temperatures dip below freezing so the water doesn't solidify. You can buy holding tank heaters online or at specialty camping stores."
                }
            ]
        },
        {
            "name": "Thawing Frozen Hoses",
            "steps": [
                {
                    "headline": "Use a heat gun on the hose connections.",
                    "description": "Point the heat gun at the end of the hose that connects to your RV and heat it for about 5-10 minutes. Move the nozzle of the heat gun all around the hose so the ice melts. Once one end of the hose is thawed, heat the other end of your hose to melt the ice inside. You can buy a heat gun from your local hardware store. If you don't have a heat gun, you can also use a hair dryer but it may take longer to thaw."
                },
                {
                    "headline": "Unscrew the hose from the ports on your RV and water supply.",
                    "description": "Rotate the end of your hose counterclockwise to loosen it from the port. Pull the end of the hose carefully away from the port so you don't cause any damage to them. If the hose is still difficult to disconnect, heat it up for 5 more minutes with your heat gun to thaw it out. Be careful not to bend or deform the hose too much since you could cause damage to it."
                },
                {
                    "headline": "Bring the hose inside your RV to warm it up.",
                    "description": "Once the hose is completely disconnected from the water supply, hold the ends so they're pointing up or else water could spill out. Drape the hose inside your RV's shower so the water melts and goes into the drain. Turn on the RV's heater and let all of the ice inside the hose melt so the hose is empty. The water from the melted ice will exit the hose and fall into the drain."
                },
                {
                    "headline": "Check the hose for damage before reattaching it.",
                    "description": "Since water expands when it freezes, it could cause the hose to stretch or burst in areas. Inspect the hose for any areas that are cracked, split, or weak to make sure it's still safe to use. If you don't find any damage, attach the hose back onto the water lines when you need more. If there is damage, you'll need to get a different hose for your water supply.Tip: Keep a spare water hose in your RV storage compartments in case your primary hose is damaged."
                }
            ]
        }
    ],
    "tyn": [
        "Wrapping the Hose",
        "Tape measure",
        "Heat cable",
        "Electrical tape",
        "Foam insulation tubing",
        "Duct tape",
        "Pipe insulation tape",
        "Insulating the Water Valves",
        "RV skirt",
        "Heat lamp",
        "Holding tank heater",
        "Thawing Frozen Hoses",
        "Heat gun"
    ],
    "text": " Wrapping the Hose Measure the length of the hose so you know how much insulation to get. Lay out your water hose on a flat surface and try to make it as straight as possible. Use a tape measure to find the length of the hose from one end to the other. Write down the length of the hose so you can easily remember it later. If you're using a new hose for your RV, look on the packaging to determine how long it is. You only need to measure the length of the hose that connects to your water supply. Tape heat cable every 1 ft (30 cm) along the hose. Heat cable detects the temperature of the hose and heats it up if it gets too cold. Get a heat cable that matches the length of your hose and secure the sensor with electrical tape so it's pressed against the hose. Run the cable parallel with the hose and wrap electrical tape around it every 1 foot (30 cm) so it stays in place. You can buy heat cables from hardware stores or specialty camping stores. Use heat cables whenever you stay in an area that is colder than 32 °F (0 °C). Most RV sites in colder climates already have insulation around the supply lines. If the water supply line at your campsite doesn't already have insulation, you may need to wrap heat cable around it as well.Warning: Avoid coiling the heat cable around the hose since it could make areas too hot and cause damage to the hose. Cover the hose and heat cable with foam insulation tubes. Once the heat tube is secured, get enough foam insulation tubes to match the length of your hose. Pull the side of the foam tubing apart so you can put your hose inside of it. Press the opening in the side of the tubing together so the hose isn't exposed and use duct tape every 1–2 feet (0.30–0.61 m) to hold it in place. You can buy foam tube insulation from hardware stores. Foam insulation also comes in pieces at 90-degree angles so you can insulate the port where your water hose connects to the RV. Some foam tubes are self-adhesive so you don't need to use tape. Wrap the outside of the foam with pipe insulation tape. Pipe insulation tape has a foil-like exterior and adheres to itself to prevent heat from escaping. Start wrapping near the end of the hose, overlapping the tape by about ⁄2 inch (1.3 cm) with each coil. Continue wrapping the tape around the foam tubing until you reach the other end of the hose. You can buy insulation tape from your local hardware store. If you don't have insulation tape, you can also wrap aluminum foil around the tubing and duct tape it every 1 foot (30 cm) to hold it in place. Plug the heat cable into the power supply to keep the hose warm. Heat cable needs to have a power source in order to work, so run the plug either to the campsites power supply or an outlet on your RV. Once the heat cable is plugged in, it will detect low temperatures and turn on whenever it gets too cold for your hose. Connect the hose to the water supply and your RV's pump. Attach the end of the hose to the port in the side of your RV that leads to the water tanks. Then connect the other end of the pipe to the water supply pump on your campsite. Open the valves by turning them clockwise so fresh water can run into your RV. If you're still worried about your hose freezing, you can use it to fill your fresh water tank and then disconnect the hose so it's not outside. Insulating the Water Valves Put a skirt around the base of your RV to keep water lines from freezing. A skirt shields the area underneath your RV from the elements to protect any exterior water lines or valves. Use insulating foam boards around the perimeter of your RV so it doesn't get cold underneath. Make sure the foam boards fit snugly under your RV or else they won't be as effective. You can buy insulating foam boards from your local hardware store. Some specialty RV stores may sell skirts that you can easily attach and store away when you're not using it. Check online for RV skirts to see what's available for your vehicle's model. You need to insulate the water valves as well as the supply hose you're using. Keep a heat lamp in the water compartment to melt any ice. The water valves are usually located in an exterior compartment on the RV. While some of these compartments may be heated when you run your RV, they may still freeze if it gets too cold. Plug in a small space heater or heat lamp in the compartment to keep it warm or else your valves could freeze and prevent water from running through them. Make sure the heater or lamp is unplugged when you aren't using it. If your tanks are outside or exposed, you may not be able to use a heater or lamp to keep them thawed.Tip: If the valves do freeze, try pouring a small amount of hot water on them or using a heat gun to melt anything that's frozen. Avoid dumping the water tanks until they're full. Empty water tanks are more likely to freeze and could plug the valves and hoses with ice. Close the valves on your water tanks by turning them counterclockwise so the liquid stays inside. When your tanks are filled, dump them so they are only ¼ of the way filled so they don't freeze. Use a holding tank heater if there's any risk of them freezing. Holding tank heaters are like electric blankets that keep your tanks from freezing. Plug the tank heater into your RV and drape it around the water holding tanks. Keep the heater on whenever the temperatures dip below freezing so the water doesn't solidify. You can buy holding tank heaters online or at specialty camping stores. Thawing Frozen Hoses Use a heat gun on the hose connections. Point the heat gun at the end of the hose that connects to your RV and heat it for about 5-10 minutes. Move the nozzle of the heat gun all around the hose so the ice melts. Once one end of the hose is thawed, heat the other end of your hose to melt the ice inside. You can buy a heat gun from your local hardware store. If you don't have a heat gun, you can also use a hair dryer but it may take longer to thaw. Unscrew the hose from the ports on your RV and water supply. Rotate the end of your hose counterclockwise to loosen it from the port. Pull the end of the hose carefully away from the port so you don't cause any damage to them. If the hose is still difficult to disconnect, heat it up for 5 more minutes with your heat gun to thaw it out. Be careful not to bend or deform the hose too much since you could cause damage to it. Bring the hose inside your RV to warm it up. Once the hose is completely disconnected from the water supply, hold the ends so they're pointing up or else water could spill out. Drape the hose inside your RV's shower so the water melts and goes into the drain. Turn on the RV's heater and let all of the ice inside the hose melt so the hose is empty. The water from the melted ice will exit the hose and fall into the drain. Check the hose for damage before reattaching it. Since water expands when it freezes, it could cause the hose to stretch or burst in areas. Inspect the hose for any areas that are cracked, split, or weak to make sure it's still safe to use. If you don't find any damage, attach the hose back onto the water lines when you need more. If there is damage, you'll need to get a different hose for your water supply.Tip: Keep a spare water hose in your RV storage compartments in case your primary hose is damaged.",
    "sentences": [
        " Wrapping the Hose Measure the length of the hose so you know how much insulation to get.",
        "Lay out your water hose on a flat surface and try to make it as straight as possible.",
        "Use a tape measure to find the length of the hose from one end to the other.",
        "Write down the length of the hose so you can easily remember it later.",
        "If you're using a new hose for your RV, look on the packaging to determine how long it is.",
        "You only need to measure the length of the hose that connects to your water supply.",
        "Tape heat cable every 1 ft (30 cm) along the hose.",
        "Heat cable detects the temperature of the hose and heats it up if it gets too cold.",
        "Get a heat cable that matches the length of your hose and secure the sensor with electrical tape so it's pressed against the hose.",
        "Run the cable parallel with the hose and wrap electrical tape around it every 1 foot (30 cm) so it stays in place.",
        "You can buy heat cables from hardware stores or specialty camping stores.",
        "Use heat cables whenever you stay in an area that is colder than 32 °F (0 °C).",
        "Most RV sites in colder climates already have insulation around the supply lines.",
        "If the water supply line at your campsite doesn't already have insulation, you may need to wrap heat cable around it as well.Warning: Avoid coiling the heat cable around the hose since it could make areas too hot and cause damage to the hose.",
        "Cover the hose and heat cable with foam insulation tubes.",
        "Once the heat tube is secured, get enough foam insulation tubes to match the length of your hose.",
        "Pull the side of the foam tubing apart so you can put your hose inside of it.",
        "Press the opening in the side of the tubing together so the hose isn't exposed and use duct tape every 1–2 feet (0.30–0.61 m) to hold it in place.",
        "You can buy foam tube insulation from hardware stores.",
        "Foam insulation also comes in pieces at 90-degree angles so you can insulate the port where your water hose connects to the RV.",
        "Some foam tubes are self-adhesive so you don't need to use tape.",
        "Wrap the outside of the foam with pipe insulation tape.",
        "Pipe insulation tape has a foil-like exterior and adheres to itself to prevent heat from escaping.",
        "Start wrapping near the end of the hose, overlapping the tape by about ⁄2 inch (1.3 cm) with each coil.",
        "Continue wrapping the tape around the foam tubing until you reach the other end of the hose.",
        "You can buy insulation tape from your local hardware store.",
        "If you don't have insulation tape, you can also wrap aluminum foil around the tubing and duct tape it every 1 foot (30 cm) to hold it in place.",
        "Plug the heat cable into the power supply to keep the hose warm.",
        "Heat cable needs to have a power source in order to work, so run the plug either to the campsites power supply or an outlet on your RV.",
        "Once the heat cable is plugged in, it will detect low temperatures and turn on whenever it gets too cold for your hose.",
        "Connect the hose to the water supply and your RV's pump.",
        "Attach the end of the hose to the port in the side of your RV that leads to the water tanks.",
        "Then connect the other end of the pipe to the water supply pump on your campsite.",
        "Open the valves by turning them clockwise so fresh water can run into your RV.",
        "If you're still worried about your hose freezing, you can use it to fill your fresh water tank and then disconnect the hose so it's not outside.",
        "Insulating the Water Valves Put a skirt around the base of your RV to keep water lines from freezing.",
        "A skirt shields the area underneath your RV from the elements to protect any exterior water lines or valves.",
        "Use insulating foam boards around the perimeter of your RV so it doesn't get cold underneath.",
        "Make sure the foam boards fit snugly under your RV or else they won't be as effective.",
        "You can buy insulating foam boards from your local hardware store.",
        "Some specialty RV stores may sell skirts that you can easily attach and store away when you're not using it.",
        "Check online for RV skirts to see what's available for your vehicle's model.",
        "You need to insulate the water valves as well as the supply hose you're using.",
        "Keep a heat lamp in the water compartment to melt any ice.",
        "The water valves are usually located in an exterior compartment on the RV.",
        "While some of these compartments may be heated when you run your RV, they may still freeze if it gets too cold.",
        "Plug in a small space heater or heat lamp in the compartment to keep it warm or else your valves could freeze and prevent water from running through them.",
        "Make sure the heater or lamp is unplugged when you aren't using it.",
        "If your tanks are outside or exposed, you may not be able to use a heater or lamp to keep them thawed.Tip: If the valves do freeze, try pouring a small amount of hot water on them or using a heat gun to melt anything that's frozen.",
        "Avoid dumping the water tanks until they're full.",
        "Empty water tanks are more likely to freeze and could plug the valves and hoses with ice.",
        "Close the valves on your water tanks by turning them counterclockwise so the liquid stays inside.",
        "When your tanks are filled, dump them so they are only ¼ of the way filled so they don't freeze.",
        "Use a holding tank heater if there's any risk of them freezing.",
        "Holding tank heaters are like electric blankets that keep your tanks from freezing.",
        "Plug the tank heater into your RV and drape it around the water holding tanks.",
        "Keep the heater on whenever the temperatures dip below freezing so the water doesn't solidify.",
        "You can buy holding tank heaters online or at specialty camping stores.",
        "Thawing Frozen Hoses Use a heat gun on the hose connections.",
        "Point the heat gun at the end of the hose that connects to your RV and heat it for about 5-10 minutes.",
        "Move the nozzle of the heat gun all around the hose so the ice melts.",
        "Once one end of the hose is thawed, heat the other end of your hose to melt the ice inside.",
        "You can buy a heat gun from your local hardware store.",
        "If you don't have a heat gun, you can also use a hair dryer but it may take longer to thaw.",
        "Unscrew the hose from the ports on your RV and water supply.",
        "Rotate the end of your hose counterclockwise to loosen it from the port.",
        "Pull the end of the hose carefully away from the port so you don't cause any damage to them.",
        "If the hose is still difficult to disconnect, heat it up for 5 more minutes with your heat gun to thaw it out.",
        "Be careful not to bend or deform the hose too much since you could cause damage to it.",
        "Bring the hose inside your RV to warm it up.",
        "Once the hose is completely disconnected from the water supply, hold the ends so they're pointing up or else water could spill out.",
        "Drape the hose inside your RV's shower so the water melts and goes into the drain.",
        "Turn on the RV's heater and let all of the ice inside the hose melt so the hose is empty.",
        "The water from the melted ice will exit the hose and fall into the drain.",
        "Check the hose for damage before reattaching it.",
        "Since water expands when it freezes, it could cause the hose to stretch or burst in areas.",
        "Inspect the hose for any areas that are cracked, split, or weak to make sure it's still safe to use.",
        "If you don't find any damage, attach the hose back onto the water lines when you need more.",
        "If there is damage, you'll need to get a different hose for your water supply.Tip: Keep a spare water hose in your RV storage compartments in case your primary hose is damaged."
    ]
}