{
    "title": "How to Make a Car Air Freshener",
    "url": "https://www.wikihow.com/Make-a-Car-Air-Freshener",
    "category_hierarchy": [
        "Health",
        "Environmental Health",
        "Air Quality and Health"
    ],
    "steps": [
        {
            "headline": "Assemble the items needed for this project.",
            "description": "These are listed below under \"Things You'll Need\". In particular, use recyclable items to make this as sustainable a project as possible."
        },
        {
            "headline": "Design the template for the air freshener.",
            "description": "Typical designs include tree shapes or state, province or country shapes, food shapes, etc. but any design you'd like to make is fine. You might even consider a special word that means something special for you, such as \"Love\" or \"Joy\"."
        },
        {
            "headline": "Cut out the template.",
            "description": ""
        },
        {
            "headline": "Place the template over the fabric.",
            "description": "Cut out two pieces of fabric."
        },
        {
            "headline": "Place the template over the cardboard.",
            "description": "Cut out one piece of cardboard."
        },
        {
            "headline": "Glue the fabric to each side of the cardboard.",
            "description": "Allow to dry."
        },
        {
            "headline": "Carefully drip 10 to 20 drops of the chosen oil over each side of the air freshener.",
            "description": ""
        },
        {
            "headline": "Allow to dry.",
            "description": ""
        },
        {
            "headline": "Punch a hole in the top of the air freshener.",
            "description": "Thread the ribbon, twine or hanging item. Leave unknotted."
        },
        {
            "headline": "Hang the air freshener from the rear vision mirror in the car.",
            "description": "Knot into place over the mirror handle; as you're doing so, adjust so that it doesn't interfere with your view."
        },
        {
            "headline": "Refresh the air freshener regularly.",
            "description": "Simply dab or drop more oil drops onto the air freshener when it starts to lose its aroma."
        }
    ],
    "tyn": [
        "Fabric Air Freshener",
        "Cardboard",
        "Craft fabric",
        "Non-toxic fabric glue",
        "Scissors",
        "Pencil",
        "Hole punch or a similar tool",
        "Ribbon, twine or yarn",
        "Essential oil",
        "Wooden Clothespin Air Freshener",
        "Wood clothespin",
        "Resealable plastic bag",
        "Herbs (optional)",
        "Glass Jar Air Freshener",
        "Mason jar",
        "Thumbtack or an alternative tool",
        "Baking soda"
    ],
    "text": " Assemble the items needed for this project. These are listed below under \"Things You'll Need\". In particular, use recyclable items to make this as sustainable a project as possible. Design the template for the air freshener. Typical designs include tree shapes or state, province or country shapes, food shapes, etc. but any design you'd like to make is fine. You might even consider a special word that means something special for you, such as \"Love\" or \"Joy\". Cut out the template.  Place the template over the fabric. Cut out two pieces of fabric. Place the template over the cardboard. Cut out one piece of cardboard. Glue the fabric to each side of the cardboard. Allow to dry. Carefully drip 10 to 20 drops of the chosen oil over each side of the air freshener.  Allow to dry.  Punch a hole in the top of the air freshener. Thread the ribbon, twine or hanging item. Leave unknotted. Hang the air freshener from the rear vision mirror in the car. Knot into place over the mirror handle; as you're doing so, adjust so that it doesn't interfere with your view. Refresh the air freshener regularly. Simply dab or drop more oil drops onto the air freshener when it starts to lose its aroma.",
    "sentences": [
        " Assemble the items needed for this project.",
        "These are listed below under \"Things You'll Need\".",
        "In particular, use recyclable items to make this as sustainable a project as possible.",
        "Design the template for the air freshener.",
        "Typical designs include tree shapes or state, province or country shapes, food shapes, etc.",
        "but any design you'd like to make is fine.",
        "You might even consider a special word that means something special for you, such as \"Love\" or \"Joy\".",
        "Cut out the template.",
        "Place the template over the fabric.",
        "Cut out two pieces of fabric.",
        "Place the template over the cardboard.",
        "Cut out one piece of cardboard.",
        "Glue the fabric to each side of the cardboard.",
        "Allow to dry.",
        "Carefully drip 10 to 20 drops of the chosen oil over each side of the air freshener.",
        "Allow to dry.",
        "Punch a hole in the top of the air freshener.",
        "Thread the ribbon, twine or hanging item.",
        "Leave unknotted.",
        "Hang the air freshener from the rear vision mirror in the car.",
        "Knot into place over the mirror handle; as you're doing so, adjust so that it doesn't interfere with your view.",
        "Refresh the air freshener regularly.",
        "Simply dab or drop more oil drops onto the air freshener when it starts to lose its aroma."
    ]
}