{
    "title": "How to Make a Disney's Pocahontas Costume",
    "url": "https://www.wikihow.com/Make-a-Disney%27s-Pocahontas-Costume",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Costumes",
        "Fantasy Costumes"
    ],
    "parts": [
        {
            "name": "Making a Simple Pocahontas Dress",
            "steps": [
                {
                    "headline": "Begin with a short-sleeve, tan t-shirt.",
                    "description": "You’ll want to use a very large t-shirt, probably from the men’s section. The t-shirt should come down to your mid to lower thighs, and it should be long enough to wear as a dress. You can find inexpensive, plain cotton t-shirts in a variety of colors at stores like Target or Walmart. Before you begin to work with your shirt, you’ll want to make sure it is ironed and completely wrinkle-free."
                },
                {
                    "headline": "Sketch a line along the top of your dress where you will cut it.",
                    "description": "You want to cut one entire sleeve and the neckline off at an angle. Use a fabric pen or water soluble pencil to mark your t-shirt. If you want, you can use a ruler or yardstick to help you make a straight diagonal line from the bottom of one sleeve to the opposite side of the neck hole. With the sleeve that remains intact, you want to mark it so that, when cut, it will become a sleeveless style. You’ll want to mark this part to be at least three inches wide, so it doesn’t break over time, and so you will be able to glue on your fringe."
                },
                {
                    "headline": "Outline a triangular point at the bottom of the t-shirt.",
                    "description": "In the movie, this is the shape of Pocahontas’s dress. Make sure not to cut this point too high on the sides so that the t-shirt still remains a dress-length that you are comfortable with. To make sure you don’t cut your shirt too high: put on a pair of shorts or a skirt you like the length of, put on your t-shirt overtop, and make small marks on each side of the oversized t-shirt at the bottoms of your shorts. Don’t cut past this mark."
                },
                {
                    "headline": "Cut your dress along the lines you drew.",
                    "description": "You’ll want to use sharp fabric scissors. As you cut, make sure that you are getting rid of the marker lines from your finished dress by cut on the edge of your line. It’s fine if the edges are frayed because Pocahontas has a more rustic, natural look."
                },
                {
                    "headline": "Measure the fringe for the dress.",
                    "description": "You should use a slightly lighter tan material than the color of your t-shirt. Suede fabric looks great, but feel free to use any kind of fabric you want. You can find fabric at local hobby stores or repurpose an old blanket or shirt. The size of your dress will determine the amount of fabric you need. Measure the bottom and top perimeters of your dress, where you want to attach your fringe. This is how long you need your strips to be. Most dress won’t need more than half a yard of your fabric of choice. You can cut your strips in multiple sections to get more out of your material. The strip should measure about 4 inches wide."
                },
                {
                    "headline": "Cut your fringe.",
                    "description": "First, cut out the fringe strips by length and width according to your measurements. After you have cut out your strips, make them into fringe. To do this, simply cut in vertical lines upward from the bottom of the strip, spacing the cuts about half an inch apart. You also want to leave about half an inch uncut at the top of each strip."
                },
                {
                    "headline": "Attach your strips of fringe to your t-shirt dress.",
                    "description": "The fastest way to do this is with hot glue or super glue. Line up your fringe against your shirt. Then, make a line of hot glue around the top of each strip, and press it onto your t-shirt dress. Alternatives to hot glue or super glue are fabric glue, which will take longer to dry, or sewing the fringe on in a straight line with a sewing machine, if you have the experience."
                },
                {
                    "headline": "Cut out a belt strip.",
                    "description": "You can use the same fabric you used for the fringe as your belt. Make the belt as thin or wide as you like. Measure your waist. The belt should be about 8 inches longer than your waist, so you have room to tie it. Or, you can make it 8 or so inches more than twice your waist, so you can double wrap it. This will cinch your t-shirt dress, and make it look more flattering. The belt takes your costume from an oversized t-shirt to a dress. If you want a more intricate belt, braid three thin strips of your fabric together, and knot each of the ends to keep the braid together."
                }
            ]
        },
        {
            "name": "Making the Blue Pocahontas Necklace",
            "steps": [
                {
                    "headline": "Make a template of the necklace shape.",
                    "description": "Use a plain piece of paper. You can do this freehand while looking at a picture of the necklace, or just print out a screenshot picture of Pocahontas from the movie, and use this necklace as your template."
                },
                {
                    "headline": "Cut out your template.",
                    "description": "You want your lines to be clean. If you are using a printed picture, just cut out the necklace portion of the picture. On each side of the necklace above the pendant, you only need about three-quarters of the necklace because you will tie it in the back with string."
                },
                {
                    "headline": "Trace your necklace shape onto a piece of thin cardboard or cardstock.",
                    "description": "Use your template, and trace around it with pencil. Feel free to use material you have on hand, like an old cereal box."
                },
                {
                    "headline": "Cut out the necklace.",
                    "description": "Using sharp office scissors, cut out your necklace along the lines you traced. It’s fine if some of these lines still show, as you will paint the necklace."
                },
                {
                    "headline": "Paint your necklace.",
                    "description": "Using a movie screenshot for reference, paint the sides of the necklaces a turquoise blue and the center pendant white or cream. Acrylic paints works well. If you want the necklace to have a glossy finish, go over the top of your dried paint with glossy Mod Podge or clear glue."
                },
                {
                    "headline": "Punch a hole in each end of your necklace.",
                    "description": "You can use a single-hole punch or the tip of a pen or knife. You want the hole to be at least half an inch from the edge of the necklace so the string doesn’t break through the cardboard."
                },
                {
                    "headline": "Tie a piece of string in each of the holes.You want the strings to be long enough that you’ll be able to tie the necklace around your neck.",
                    "description": "You can cut the strings too long, and then tie your necklace around your neck and cut off the excess while you are wearing it. Use a brown hemp string for a rustic look. You can find this at any craft store or craft section. If your finished necklace doesn’t have enough weight to stay flat against your neck, hot glue a penny to the back of the pendant portion of your cardboard necklace."
                }
            ]
        },
        {
            "name": "Adding More Pocahontas Accessories",
            "steps": [
                {
                    "headline": "Consider getting a wig.",
                    "description": "If you don’t already have long, dark hair, you might want to find a wig to complete your look. You can find wigs at wig shops or party supply stores. You want to make sure you get a wig that will stay secure on your head."
                },
                {
                    "headline": "Draw on Pocahontas’s arm tattoo.",
                    "description": "Her tattoo is a dark orange-red circle around her upper arm that comes down in drips. To draw this on your arm, you can use face paint or an inexpensive, colored eyeliner pencil. Create the outline first, and then fill it in."
                },
                {
                    "headline": "Give yourself a Disney's Pocahontas makeup look.",
                    "description": "You want to create a natural look that is still dramatic. Use bronzer instead of blush, fill in your brows darkly, and wear a brown-toned lipstick. Wear brown eyeliner, and keep your mascara natural."
                },
                {
                    "headline": "Pick out your Pocahontas shoes.",
                    "description": "No matter what type of shoes you choose, they should be brown. If you have moccasins or boots with fringe, wear those. You could also wear a strappy Gladiator-style sandal. If you don’t have either of those choices, brown flats are a nice, simple option that will put the focus on your costume."
                }
            ]
        }
    ],
    "tyn": [
        "Tan oversized t-shirt",
        "Suede tan fabric for fringe",
        "Sharp scissors",
        "Hot glue or fabric glue",
        "Cardstock or cardboard",
        "Blue and white acrylic paint",
        "Glossy Mod Podge (optional)",
        "A single hole punch",
        "Hemp string",
        "A black wig (optional)",
        "Fringed shoes (optional)",
        "Makeup (optional)"
    ],
    "text": " Making a Simple Pocahontas Dress Begin with a short-sleeve, tan t-shirt. You’ll want to use a very large t-shirt, probably from the men’s section. The t-shirt should come down to your mid to lower thighs, and it should be long enough to wear as a dress. You can find inexpensive, plain cotton t-shirts in a variety of colors at stores like Target or Walmart. Before you begin to work with your shirt, you’ll want to make sure it is ironed and completely wrinkle-free. Sketch a line along the top of your dress where you will cut it. You want to cut one entire sleeve and the neckline off at an angle. Use a fabric pen or water soluble pencil to mark your t-shirt. If you want, you can use a ruler or yardstick to help you make a straight diagonal line from the bottom of one sleeve to the opposite side of the neck hole. With the sleeve that remains intact, you want to mark it so that, when cut, it will become a sleeveless style. You’ll want to mark this part to be at least three inches wide, so it doesn’t break over time, and so you will be able to glue on your fringe. Outline a triangular point at the bottom of the t-shirt. In the movie, this is the shape of Pocahontas’s dress. Make sure not to cut this point too high on the sides so that the t-shirt still remains a dress-length that you are comfortable with. To make sure you don’t cut your shirt too high: put on a pair of shorts or a skirt you like the length of, put on your t-shirt overtop, and make small marks on each side of the oversized t-shirt at the bottoms of your shorts. Don’t cut past this mark. Cut your dress along the lines you drew. You’ll want to use sharp fabric scissors. As you cut, make sure that you are getting rid of the marker lines from your finished dress by cut on the edge of your line. It’s fine if the edges are frayed because Pocahontas has a more rustic, natural look. Measure the fringe for the dress. You should use a slightly lighter tan material than the color of your t-shirt. Suede fabric looks great, but feel free to use any kind of fabric you want. You can find fabric at local hobby stores or repurpose an old blanket or shirt. The size of your dress will determine the amount of fabric you need. Measure the bottom and top perimeters of your dress, where you want to attach your fringe. This is how long you need your strips to be. Most dress won’t need more than half a yard of your fabric of choice. You can cut your strips in multiple sections to get more out of your material. The strip should measure about 4 inches wide. Cut your fringe. First, cut out the fringe strips by length and width according to your measurements. After you have cut out your strips, make them into fringe. To do this, simply cut in vertical lines upward from the bottom of the strip, spacing the cuts about half an inch apart. You also want to leave about half an inch uncut at the top of each strip. Attach your strips of fringe to your t-shirt dress. The fastest way to do this is with hot glue or super glue. Line up your fringe against your shirt. Then, make a line of hot glue around the top of each strip, and press it onto your t-shirt dress. Alternatives to hot glue or super glue are fabric glue, which will take longer to dry, or sewing the fringe on in a straight line with a sewing machine, if you have the experience. Cut out a belt strip. You can use the same fabric you used for the fringe as your belt. Make the belt as thin or wide as you like. Measure your waist. The belt should be about 8 inches longer than your waist, so you have room to tie it. Or, you can make it 8 or so inches more than twice your waist, so you can double wrap it. This will cinch your t-shirt dress, and make it look more flattering. The belt takes your costume from an oversized t-shirt to a dress. If you want a more intricate belt, braid three thin strips of your fabric together, and knot each of the ends to keep the braid together. Making the Blue Pocahontas Necklace Make a template of the necklace shape. Use a plain piece of paper. You can do this freehand while looking at a picture of the necklace, or just print out a screenshot picture of Pocahontas from the movie, and use this necklace as your template. Cut out your template. You want your lines to be clean. If you are using a printed picture, just cut out the necklace portion of the picture. On each side of the necklace above the pendant, you only need about three-quarters of the necklace because you will tie it in the back with string. Trace your necklace shape onto a piece of thin cardboard or cardstock. Use your template, and trace around it with pencil. Feel free to use material you have on hand, like an old cereal box. Cut out the necklace. Using sharp office scissors, cut out your necklace along the lines you traced. It’s fine if some of these lines still show, as you will paint the necklace. Paint your necklace. Using a movie screenshot for reference, paint the sides of the necklaces a turquoise blue and the center pendant white or cream. Acrylic paints works well. If you want the necklace to have a glossy finish, go over the top of your dried paint with glossy Mod Podge or clear glue. Punch a hole in each end of your necklace. You can use a single-hole punch or the tip of a pen or knife. You want the hole to be at least half an inch from the edge of the necklace so the string doesn’t break through the cardboard. Tie a piece of string in each of the holes.You want the strings to be long enough that you’ll be able to tie the necklace around your neck. You can cut the strings too long, and then tie your necklace around your neck and cut off the excess while you are wearing it. Use a brown hemp string for a rustic look. You can find this at any craft store or craft section. If your finished necklace doesn’t have enough weight to stay flat against your neck, hot glue a penny to the back of the pendant portion of your cardboard necklace. Adding More Pocahontas Accessories Consider getting a wig. If you don’t already have long, dark hair, you might want to find a wig to complete your look. You can find wigs at wig shops or party supply stores. You want to make sure you get a wig that will stay secure on your head. Draw on Pocahontas’s arm tattoo. Her tattoo is a dark orange-red circle around her upper arm that comes down in drips. To draw this on your arm, you can use face paint or an inexpensive, colored eyeliner pencil. Create the outline first, and then fill it in. Give yourself a Disney's Pocahontas makeup look. You want to create a natural look that is still dramatic. Use bronzer instead of blush, fill in your brows darkly, and wear a brown-toned lipstick. Wear brown eyeliner, and keep your mascara natural. Pick out your Pocahontas shoes. No matter what type of shoes you choose, they should be brown. If you have moccasins or boots with fringe, wear those. You could also wear a strappy Gladiator-style sandal. If you don’t have either of those choices, brown flats are a nice, simple option that will put the focus on your costume.",
    "sentences": [
        " Making a Simple Pocahontas Dress Begin with a short-sleeve, tan t-shirt.",
        "You’ll want to use a very large t-shirt, probably from the men’s section.",
        "The t-shirt should come down to your mid to lower thighs, and it should be long enough to wear as a dress.",
        "You can find inexpensive, plain cotton t-shirts in a variety of colors at stores like Target or Walmart.",
        "Before you begin to work with your shirt, you’ll want to make sure it is ironed and completely wrinkle-free.",
        "Sketch a line along the top of your dress where you will cut it.",
        "You want to cut one entire sleeve and the neckline off at an angle.",
        "Use a fabric pen or water soluble pencil to mark your t-shirt.",
        "If you want, you can use a ruler or yardstick to help you make a straight diagonal line from the bottom of one sleeve to the opposite side of the neck hole.",
        "With the sleeve that remains intact, you want to mark it so that, when cut, it will become a sleeveless style.",
        "You’ll want to mark this part to be at least three inches wide, so it doesn’t break over time, and so you will be able to glue on your fringe.",
        "Outline a triangular point at the bottom of the t-shirt.",
        "In the movie, this is the shape of Pocahontas’s dress.",
        "Make sure not to cut this point too high on the sides so that the t-shirt still remains a dress-length that you are comfortable with.",
        "To make sure you don’t cut your shirt too high: put on a pair of shorts or a skirt you like the length of, put on your t-shirt overtop, and make small marks on each side of the oversized t-shirt at the bottoms of your shorts.",
        "Don’t cut past this mark.",
        "Cut your dress along the lines you drew.",
        "You’ll want to use sharp fabric scissors.",
        "As you cut, make sure that you are getting rid of the marker lines from your finished dress by cut on the edge of your line.",
        "It’s fine if the edges are frayed because Pocahontas has a more rustic, natural look.",
        "Measure the fringe for the dress.",
        "You should use a slightly lighter tan material than the color of your t-shirt.",
        "Suede fabric looks great, but feel free to use any kind of fabric you want.",
        "You can find fabric at local hobby stores or repurpose an old blanket or shirt.",
        "The size of your dress will determine the amount of fabric you need.",
        "Measure the bottom and top perimeters of your dress, where you want to attach your fringe.",
        "This is how long you need your strips to be.",
        "Most dress won’t need more than half a yard of your fabric of choice.",
        "You can cut your strips in multiple sections to get more out of your material.",
        "The strip should measure about 4 inches wide.",
        "Cut your fringe.",
        "First, cut out the fringe strips by length and width according to your measurements.",
        "After you have cut out your strips, make them into fringe.",
        "To do this, simply cut in vertical lines upward from the bottom of the strip, spacing the cuts about half an inch apart.",
        "You also want to leave about half an inch uncut at the top of each strip.",
        "Attach your strips of fringe to your t-shirt dress.",
        "The fastest way to do this is with hot glue or super glue.",
        "Line up your fringe against your shirt.",
        "Then, make a line of hot glue around the top of each strip, and press it onto your t-shirt dress.",
        "Alternatives to hot glue or super glue are fabric glue, which will take longer to dry, or sewing the fringe on in a straight line with a sewing machine, if you have the experience.",
        "Cut out a belt strip.",
        "You can use the same fabric you used for the fringe as your belt.",
        "Make the belt as thin or wide as you like.",
        "Measure your waist.",
        "The belt should be about 8 inches longer than your waist, so you have room to tie it.",
        "Or, you can make it 8 or so inches more than twice your waist, so you can double wrap it.",
        "This will cinch your t-shirt dress, and make it look more flattering.",
        "The belt takes your costume from an oversized t-shirt to a dress.",
        "If you want a more intricate belt, braid three thin strips of your fabric together, and knot each of the ends to keep the braid together.",
        "Making the Blue Pocahontas Necklace Make a template of the necklace shape.",
        "Use a plain piece of paper.",
        "You can do this freehand while looking at a picture of the necklace, or just print out a screenshot picture of Pocahontas from the movie, and use this necklace as your template.",
        "Cut out your template.",
        "You want your lines to be clean.",
        "If you are using a printed picture, just cut out the necklace portion of the picture.",
        "On each side of the necklace above the pendant, you only need about three-quarters of the necklace because you will tie it in the back with string.",
        "Trace your necklace shape onto a piece of thin cardboard or cardstock.",
        "Use your template, and trace around it with pencil.",
        "Feel free to use material you have on hand, like an old cereal box.",
        "Cut out the necklace.",
        "Using sharp office scissors, cut out your necklace along the lines you traced.",
        "It’s fine if some of these lines still show, as you will paint the necklace.",
        "Paint your necklace.",
        "Using a movie screenshot for reference, paint the sides of the necklaces a turquoise blue and the center pendant white or cream.",
        "Acrylic paints works well.",
        "If you want the necklace to have a glossy finish, go over the top of your dried paint with glossy Mod Podge or clear glue.",
        "Punch a hole in each end of your necklace.",
        "You can use a single-hole punch or the tip of a pen or knife.",
        "You want the hole to be at least half an inch from the edge of the necklace so the string doesn’t break through the cardboard.",
        "Tie a piece of string in each of the holes.You want the strings to be long enough that you’ll be able to tie the necklace around your neck.",
        "You can cut the strings too long, and then tie your necklace around your neck and cut off the excess while you are wearing it.",
        "Use a brown hemp string for a rustic look.",
        "You can find this at any craft store or craft section.",
        "If your finished necklace doesn’t have enough weight to stay flat against your neck, hot glue a penny to the back of the pendant portion of your cardboard necklace.",
        "Adding More Pocahontas Accessories Consider getting a wig.",
        "If you don’t already have long, dark hair, you might want to find a wig to complete your look.",
        "You can find wigs at wig shops or party supply stores.",
        "You want to make sure you get a wig that will stay secure on your head.",
        "Draw on Pocahontas’s arm tattoo.",
        "Her tattoo is a dark orange-red circle around her upper arm that comes down in drips.",
        "To draw this on your arm, you can use face paint or an inexpensive, colored eyeliner pencil.",
        "Create the outline first, and then fill it in.",
        "Give yourself a Disney's Pocahontas makeup look.",
        "You want to create a natural look that is still dramatic.",
        "Use bronzer instead of blush, fill in your brows darkly, and wear a brown-toned lipstick.",
        "Wear brown eyeliner, and keep your mascara natural.",
        "Pick out your Pocahontas shoes.",
        "No matter what type of shoes you choose, they should be brown.",
        "If you have moccasins or boots with fringe, wear those.",
        "You could also wear a strappy Gladiator-style sandal.",
        "If you don’t have either of those choices, brown flats are a nice, simple option that will put the focus on your costume."
    ]
}