{
    "title": "How to Remove Ink Stains from Linen",
    "url": "https://www.wikihow.com/Remove-Ink-Stains-from-Linen",
    "category_hierarchy": [
        "Education and Communications",
        "Stationery",
        "Ink"
    ],
    "methods": [
        {
            "name": "Removing Stains with Hairspray",
            "steps": [
                {
                    "headline": "Apply a light coating of hairspray to the ink stain.",
                    "description": "An alcohol-based hairspray is best. Aerosol cans typically spray more evenly than pump hairspray, so you may want to choose an aerosol brand, but either kind will work. The hairspray will help loosen the ink from the linen fibers. This method can be used for clothing or other linen items, such as couches."
                },
                {
                    "headline": "Let it sit.",
                    "description": "You want to give the hairspray time to work, so don’t spray the stain and then start blotting immediately. Wait up to 10 minutes to allow the ingredients in the hairspray to react with the ink."
                },
                {
                    "headline": "Blot the stain with a damp cloth.",
                    "description": "You should be able to see the ink coming to the surface of the fabric. Gently blot the ink away. Don’t rub, or you risk spreading the ink stain and further damaging the fabric."
                },
                {
                    "headline": "Launder the garment.",
                    "description": "Be sure all the ink has been removed before washing. Linen can be washed regularly, in your washing machine. Just be sure to separate your “lights” from “darks” to ensure dye doesn’t bleed onto your light-colored clothing."
                },
                {
                    "headline": "Air-dry the fabric.",
                    "description": "Hang your garment or lay it flat. Using a clothes dryer will not only shrink your linen but could set the stain if you did not remove it completely."
                }
            ]
        },
        {
            "name": "Trying Dish Detergent and Vinegar",
            "steps": [
                {
                    "headline": "Create a cleaning solution.",
                    "description": "Fill a bowl or basin with 1 US quart (950 mL) of warm water. Add ⁄2 teaspoon (2.5 mL) of dishwashing detergent and 1 tablespoon (15 mL) of white vinegar to the water. Mix until well combined. This method may be best for larger stains, as you will soak the entire garment."
                },
                {
                    "headline": "Soak the garment.",
                    "description": "Submerge the linen into the solution. Let it soak for approximately 30 minutes. This will allow time for the chemicals to react with the stain. You may want to gently stir the solution from time to time."
                },
                {
                    "headline": "Remove and rinse.",
                    "description": "Take the linen out of the soaking solution and rinse it with cold water. Pay special attention to the stained part of the garment. Don’t use hot water, as it can permanently set the stain."
                },
                {
                    "headline": "Air-dry the linen.",
                    "description": "Squeeze out excess moisture without wringing  the fabric. Squeezing the liquid out instead of twisting it will help keep the shape of the garment intact. Set it out to dry on a flat surface or hang it on a clothesline."
                },
                {
                    "headline": "Repeat the process if needed.",
                    "description": "If traces of the stain remain, repeat the process by mixing up a fresh soaking solution. You may also want to try another method, such as rubbing alcohol, if the stain is particularly stubborn."
                }
            ]
        },
        {
            "name": "Using Rubbing Alcohol",
            "steps": [
                {
                    "headline": "Apply rubbing alcohol directly to the stain.",
                    "description": "Alcohol works because it dissolves the pigments in the ink. Be sure to get all parts and edges of the stain. You may want to put cardboard or another material beneath the fabric to ensure it doesn’t bleed through. Cover it with something absorbent like a cotton pad or a thin stack of paper towels. This method may be best for smaller stains, as you only apply the product to the stained area."
                },
                {
                    "headline": "Place a heavy item on top.",
                    "description": "Putting a book or pan on top of the cotton or paper will help it better absorb the stain. Let this sit for up to thirty minutes to allow the alcohol to dissolve the pigments in the ink."
                },
                {
                    "headline": "Blot the stain.",
                    "description": "Don’t rub, or the ink could spread, making a bigger stain. Just gently press down on the stain with a rag or paper towels. Be sure to use a new section after every few blots, or you will end up putting the ink back into your clothing."
                },
                {
                    "headline": "Flush the spot with alcohol.",
                    "description": "This will ensure the ink is completely dissolved. You can blot the area again if you see remnants of the ink."
                },
                {
                    "headline": "Rinse the fabric in cold water.",
                    "description": "Pay special attention to the edges of the stain. Cold water helps remove the stain as well as the alcohol. Don’t use hot water, as this may set the stain."
                },
                {
                    "headline": "Air-dry your garment.",
                    "description": "You can lay it flat or hang it on a clothesline. Avoid using the clothes dryer, as this could set the stain if it isn’t completely removed as well as damage or shrink the linen."
                }
            ]
        }
    ],
    "tyn": [
        "Bucket or bowl",
        "Hairspray",
        "Warm water",
        "Dishwashing detergent",
        "White vinegar",
        "Rubbing alcohol",
        "Cotton pad or paper towels",
        "Book or pan"
    ],
    "text": " Removing Stains with Hairspray Apply a light coating of hairspray to the ink stain. An alcohol-based hairspray is best. Aerosol cans typically spray more evenly than pump hairspray, so you may want to choose an aerosol brand, but either kind will work. The hairspray will help loosen the ink from the linen fibers. This method can be used for clothing or other linen items, such as couches. Let it sit. You want to give the hairspray time to work, so don’t spray the stain and then start blotting immediately. Wait up to 10 minutes to allow the ingredients in the hairspray to react with the ink. Blot the stain with a damp cloth. You should be able to see the ink coming to the surface of the fabric. Gently blot the ink away. Don’t rub, or you risk spreading the ink stain and further damaging the fabric. Launder the garment. Be sure all the ink has been removed before washing. Linen can be washed regularly, in your washing machine. Just be sure to separate your “lights” from “darks” to ensure dye doesn’t bleed onto your light-colored clothing. Air-dry the fabric. Hang your garment or lay it flat. Using a clothes dryer will not only shrink your linen but could set the stain if you did not remove it completely. Trying Dish Detergent and Vinegar Create a cleaning solution. Fill a bowl or basin with 1 US quart (950 mL) of warm water. Add ⁄2 teaspoon (2.5 mL) of dishwashing detergent and 1 tablespoon (15 mL) of white vinegar to the water. Mix until well combined. This method may be best for larger stains, as you will soak the entire garment. Soak the garment. Submerge the linen into the solution. Let it soak for approximately 30 minutes. This will allow time for the chemicals to react with the stain. You may want to gently stir the solution from time to time. Remove and rinse. Take the linen out of the soaking solution and rinse it with cold water. Pay special attention to the stained part of the garment. Don’t use hot water, as it can permanently set the stain. Air-dry the linen. Squeeze out excess moisture without wringing  the fabric. Squeezing the liquid out instead of twisting it will help keep the shape of the garment intact. Set it out to dry on a flat surface or hang it on a clothesline. Repeat the process if needed. If traces of the stain remain, repeat the process by mixing up a fresh soaking solution. You may also want to try another method, such as rubbing alcohol, if the stain is particularly stubborn. Using Rubbing Alcohol Apply rubbing alcohol directly to the stain. Alcohol works because it dissolves the pigments in the ink. Be sure to get all parts and edges of the stain. You may want to put cardboard or another material beneath the fabric to ensure it doesn’t bleed through. Cover it with something absorbent like a cotton pad or a thin stack of paper towels. This method may be best for smaller stains, as you only apply the product to the stained area. Place a heavy item on top. Putting a book or pan on top of the cotton or paper will help it better absorb the stain. Let this sit for up to thirty minutes to allow the alcohol to dissolve the pigments in the ink. Blot the stain. Don’t rub, or the ink could spread, making a bigger stain. Just gently press down on the stain with a rag or paper towels. Be sure to use a new section after every few blots, or you will end up putting the ink back into your clothing. Flush the spot with alcohol. This will ensure the ink is completely dissolved. You can blot the area again if you see remnants of the ink. Rinse the fabric in cold water. Pay special attention to the edges of the stain. Cold water helps remove the stain as well as the alcohol. Don’t use hot water, as this may set the stain. Air-dry your garment. You can lay it flat or hang it on a clothesline. Avoid using the clothes dryer, as this could set the stain if it isn’t completely removed as well as damage or shrink the linen.",
    "sentences": [
        " Removing Stains with Hairspray Apply a light coating of hairspray to the ink stain.",
        "An alcohol-based hairspray is best.",
        "Aerosol cans typically spray more evenly than pump hairspray, so you may want to choose an aerosol brand, but either kind will work.",
        "The hairspray will help loosen the ink from the linen fibers.",
        "This method can be used for clothing or other linen items, such as couches.",
        "Let it sit.",
        "You want to give the hairspray time to work, so don’t spray the stain and then start blotting immediately.",
        "Wait up to 10 minutes to allow the ingredients in the hairspray to react with the ink.",
        "Blot the stain with a damp cloth.",
        "You should be able to see the ink coming to the surface of the fabric.",
        "Gently blot the ink away.",
        "Don’t rub, or you risk spreading the ink stain and further damaging the fabric.",
        "Launder the garment.",
        "Be sure all the ink has been removed before washing.",
        "Linen can be washed regularly, in your washing machine.",
        "Just be sure to separate your “lights” from “darks” to ensure dye doesn’t bleed onto your light-colored clothing.",
        "Air-dry the fabric.",
        "Hang your garment or lay it flat.",
        "Using a clothes dryer will not only shrink your linen but could set the stain if you did not remove it completely.",
        "Trying Dish Detergent and Vinegar Create a cleaning solution.",
        "Fill a bowl or basin with 1 US quart (950 mL) of warm water.",
        "Add ⁄2 teaspoon (2.5 mL) of dishwashing detergent and 1 tablespoon (15 mL) of white vinegar to the water.",
        "Mix until well combined.",
        "This method may be best for larger stains, as you will soak the entire garment.",
        "Soak the garment.",
        "Submerge the linen into the solution.",
        "Let it soak for approximately 30 minutes.",
        "This will allow time for the chemicals to react with the stain.",
        "You may want to gently stir the solution from time to time.",
        "Remove and rinse.",
        "Take the linen out of the soaking solution and rinse it with cold water.",
        "Pay special attention to the stained part of the garment.",
        "Don’t use hot water, as it can permanently set the stain.",
        "Air-dry the linen.",
        "Squeeze out excess moisture without wringing  the fabric.",
        "Squeezing the liquid out instead of twisting it will help keep the shape of the garment intact.",
        "Set it out to dry on a flat surface or hang it on a clothesline.",
        "Repeat the process if needed.",
        "If traces of the stain remain, repeat the process by mixing up a fresh soaking solution.",
        "You may also want to try another method, such as rubbing alcohol, if the stain is particularly stubborn.",
        "Using Rubbing Alcohol Apply rubbing alcohol directly to the stain.",
        "Alcohol works because it dissolves the pigments in the ink.",
        "Be sure to get all parts and edges of the stain.",
        "You may want to put cardboard or another material beneath the fabric to ensure it doesn’t bleed through.",
        "Cover it with something absorbent like a cotton pad or a thin stack of paper towels.",
        "This method may be best for smaller stains, as you only apply the product to the stained area.",
        "Place a heavy item on top.",
        "Putting a book or pan on top of the cotton or paper will help it better absorb the stain.",
        "Let this sit for up to thirty minutes to allow the alcohol to dissolve the pigments in the ink.",
        "Blot the stain.",
        "Don’t rub, or the ink could spread, making a bigger stain.",
        "Just gently press down on the stain with a rag or paper towels.",
        "Be sure to use a new section after every few blots, or you will end up putting the ink back into your clothing.",
        "Flush the spot with alcohol.",
        "This will ensure the ink is completely dissolved.",
        "You can blot the area again if you see remnants of the ink.",
        "Rinse the fabric in cold water.",
        "Pay special attention to the edges of the stain.",
        "Cold water helps remove the stain as well as the alcohol.",
        "Don’t use hot water, as this may set the stain.",
        "Air-dry your garment.",
        "You can lay it flat or hang it on a clothesline.",
        "Avoid using the clothes dryer, as this could set the stain if it isn’t completely removed as well as damage or shrink the linen."
    ]
}