{
    "title": "How to Remove Ink Stains from a Purse Lining",
    "url": "https://www.wikihow.com/Remove-Ink-Stains-from-a-Purse-Lining",
    "category_hierarchy": [
        "Education and Communications",
        "Stationery",
        "Ink"
    ],
    "methods": [
        {
            "name": "Using Dishwashing Soap",
            "steps": [
                {
                    "headline": "Line your surface with paper towels or a cloth.",
                    "description": "Dishwashing soap is thick, and might bleed through your purse lining. Put down some paper towels or a cloth to protect whatever surface you will be working on, like a countertop or table. If you get dishwashing soap on any surfaces, just use a wet towel to wipe it up before it dries."
                },
                {
                    "headline": "Dab a small amount of the dishwashing soap onto the ink stain.",
                    "description": "Use a mild dishwashing liquid so that it doesn’t damage your purse lining. Dab the dishwashing liquid directly onto the ink stain so that it covers it completely. If the soap touches a part of the lining without an ink stain, that is okay. It will simply clean that part of your purse lining."
                },
                {
                    "headline": "Rub the dishwashing soap in with a damp cloth.",
                    "description": "Get a clean cloth slightly damp with cool water. Use the damp cloth to rub the dishwashing soap into the fabric of your lining."
                },
                {
                    "headline": "Blot the spot with a clean cloth dipped in water.",
                    "description": "Use a damp, clean rag to gently blot out the soap from the ink stain. Don’t rub the spot, or you could push the ink further into the fabric of your purse lining."
                },
                {
                    "headline": "Repeat the process until the ink stain disappears.",
                    "description": "It may take a couple of tries before you remove all of the ink, especially if the stain is old. Keep adding soap and washing it off until the ink is gone. If the ink stain is stubborn, try using different tools to blot it with - Q-tips, cotton pads, and paper towels are all viable options to try."
                }
            ]
        },
        {
            "name": "Using Hairspray",
            "steps": [
                {
                    "headline": "Place several layers of paper towels on a flat surface.",
                    "description": "You will be working with hairspray, which can soak through fabrics and make things sticky. Line a table or countertop with paper towels to catch any spills that might happen.Tip: You can also use newspaper or a clean rag to line your area if you don’t have paper towels."
                },
                {
                    "headline": "Pull the lining out of your purse as much as you can.",
                    "description": "Separate the lining of your purse from the purse itself so that you don’t get hairspray on the outside and damage it. Empty your purse of all its contents and carefully pull the lining out as much as it will go. If the lining of your purse won’t come out, you can leave it in your purse. Be sure to use extra caution when applying the hairspray."
                },
                {
                    "headline": "Spray a small amount of hairspray directly onto the ink spot.",
                    "description": "Use any type of hairspray that has alcohol in it. Hold the nozzle close to your purse lining and spray the hairspray for about 2 seconds directly onto the ink spot. If hairspray gets onto the part of the lining that doesn’t have any ink on it, that’s okay. If the lining does not pull out of the purse much, or if you are concerned about getting hairspray on other parts of the purse, you can spray the hairspray on a Q-tip and rub the stain with it."
                },
                {
                    "headline": "Blot the treated spot with a dry cloth or paper towel.",
                    "description": "Quickly blot the area with a dry paper towel or cloth until it picks up most of the hairspray. You will see the ink stain fade almost immediately. Do not rub or wipe the spot. This could rub the ink further into the lining and make the stain worse."
                },
                {
                    "headline": "Repeat the spraying and blotting until the ink stain disappears.",
                    "description": "Depending on how old it is, you may have to do this process several times in order to get the stain off completely. Keep spraying hairspray and blotting it off with a towel until the ink is gone."
                },
                {
                    "headline": "Dab at the spot with a Q-tip or cloth dipped in water.",
                    "description": "Once the ink is removed, you can blot the hairspray off with a Q-tip or a cloth and cool water. Make sure that your purse lining isn’t sticky, or it will dry crusty. Try not to rub the hairspray to get it off. This could push the hairspray further into the fabric of the lining."
                },
                {
                    "headline": "Let the purse lining air dry before you use it.",
                    "description": "Keep the lining pulled out of your purse and set it in a cool, dry place to air dry. Pull the lining back into your purse and use it like normal."
                }
            ]
        },
        {
            "name": "Removing Stains with Rubbing Alcohol",
            "steps": [
                {
                    "headline": "Dip a cotton ball in rubbing alcohol until it is saturated.",
                    "description": "Use a medium or large cotton ball and dip it in some rubbing alcohol. Make sure the cotton is almost fully saturated.Tip: For small stains, use a Q-tip instead of a cotton ball."
                },
                {
                    "headline": "Rub the cotton ball onto the ink stain.",
                    "description": "Gently dab and then rub the cotton ball onto the ink stains so that it is covered completely. You will be able to see the stain fade right away. If the ink stain is large or more stubborn, you can also soak it directly in alcohol for 15 minutes."
                },
                {
                    "headline": "Keep rubbing alcohol on the spot until the ink stain disappears.",
                    "description": "The rubbing alcohol will continue to soak up ink as you add more. Use your cotton pads to soak up any alcohol that has ink in it, and add more rubbing alcohol until the stain is gone."
                },
                {
                    "headline": "Blot the spot with water on a paper towel or cloth.",
                    "description": "Gently remove the alcohol and left over ink with cool water on a cloth or paper towel. Don’t rub the water in, or you could push the ink back into the fabric of the lining."
                },
                {
                    "headline": "Let the purse lining air dry before you use it.",
                    "description": "Keep the lining pulled out of your purse and set it on a towel to air dry. Then, use it like you normally would. Your purse might smell like alcohol for a few hours, but it will go away as it dries out."
                }
            ]
        }
    ],
    "tyn": [
        "Hairspray or nail polish remover",
        "Rubbing alcohol",
        "Dish washing liquid or laundry detergent",
        "Clean cloth or paper towels",
        "Sponge",
        "Cotton balls"
    ],
    "text": " Using Dishwashing Soap Line your surface with paper towels or a cloth. Dishwashing soap is thick, and might bleed through your purse lining. Put down some paper towels or a cloth to protect whatever surface you will be working on, like a countertop or table. If you get dishwashing soap on any surfaces, just use a wet towel to wipe it up before it dries. Dab a small amount of the dishwashing soap onto the ink stain. Use a mild dishwashing liquid so that it doesn’t damage your purse lining. Dab the dishwashing liquid directly onto the ink stain so that it covers it completely. If the soap touches a part of the lining without an ink stain, that is okay. It will simply clean that part of your purse lining. Rub the dishwashing soap in with a damp cloth. Get a clean cloth slightly damp with cool water. Use the damp cloth to rub the dishwashing soap into the fabric of your lining. Blot the spot with a clean cloth dipped in water. Use a damp, clean rag to gently blot out the soap from the ink stain. Don’t rub the spot, or you could push the ink further into the fabric of your purse lining. Repeat the process until the ink stain disappears. It may take a couple of tries before you remove all of the ink, especially if the stain is old. Keep adding soap and washing it off until the ink is gone. If the ink stain is stubborn, try using different tools to blot it with - Q-tips, cotton pads, and paper towels are all viable options to try. Using Hairspray Place several layers of paper towels on a flat surface. You will be working with hairspray, which can soak through fabrics and make things sticky. Line a table or countertop with paper towels to catch any spills that might happen.Tip: You can also use newspaper or a clean rag to line your area if you don’t have paper towels. Pull the lining out of your purse as much as you can. Separate the lining of your purse from the purse itself so that you don’t get hairspray on the outside and damage it. Empty your purse of all its contents and carefully pull the lining out as much as it will go. If the lining of your purse won’t come out, you can leave it in your purse. Be sure to use extra caution when applying the hairspray. Spray a small amount of hairspray directly onto the ink spot. Use any type of hairspray that has alcohol in it. Hold the nozzle close to your purse lining and spray the hairspray for about 2 seconds directly onto the ink spot. If hairspray gets onto the part of the lining that doesn’t have any ink on it, that’s okay. If the lining does not pull out of the purse much, or if you are concerned about getting hairspray on other parts of the purse, you can spray the hairspray on a Q-tip and rub the stain with it. Blot the treated spot with a dry cloth or paper towel. Quickly blot the area with a dry paper towel or cloth until it picks up most of the hairspray. You will see the ink stain fade almost immediately. Do not rub or wipe the spot. This could rub the ink further into the lining and make the stain worse. Repeat the spraying and blotting until the ink stain disappears. Depending on how old it is, you may have to do this process several times in order to get the stain off completely. Keep spraying hairspray and blotting it off with a towel until the ink is gone. Dab at the spot with a Q-tip or cloth dipped in water. Once the ink is removed, you can blot the hairspray off with a Q-tip or a cloth and cool water. Make sure that your purse lining isn’t sticky, or it will dry crusty. Try not to rub the hairspray to get it off. This could push the hairspray further into the fabric of the lining. Let the purse lining air dry before you use it. Keep the lining pulled out of your purse and set it in a cool, dry place to air dry. Pull the lining back into your purse and use it like normal. Removing Stains with Rubbing Alcohol Dip a cotton ball in rubbing alcohol until it is saturated. Use a medium or large cotton ball and dip it in some rubbing alcohol. Make sure the cotton is almost fully saturated.Tip: For small stains, use a Q-tip instead of a cotton ball. Rub the cotton ball onto the ink stain. Gently dab and then rub the cotton ball onto the ink stains so that it is covered completely. You will be able to see the stain fade right away. If the ink stain is large or more stubborn, you can also soak it directly in alcohol for 15 minutes. Keep rubbing alcohol on the spot until the ink stain disappears. The rubbing alcohol will continue to soak up ink as you add more. Use your cotton pads to soak up any alcohol that has ink in it, and add more rubbing alcohol until the stain is gone. Blot the spot with water on a paper towel or cloth. Gently remove the alcohol and left over ink with cool water on a cloth or paper towel. Don’t rub the water in, or you could push the ink back into the fabric of the lining. Let the purse lining air dry before you use it. Keep the lining pulled out of your purse and set it on a towel to air dry. Then, use it like you normally would. Your purse might smell like alcohol for a few hours, but it will go away as it dries out.",
    "sentences": [
        " Using Dishwashing Soap Line your surface with paper towels or a cloth.",
        "Dishwashing soap is thick, and might bleed through your purse lining.",
        "Put down some paper towels or a cloth to protect whatever surface you will be working on, like a countertop or table.",
        "If you get dishwashing soap on any surfaces, just use a wet towel to wipe it up before it dries.",
        "Dab a small amount of the dishwashing soap onto the ink stain.",
        "Use a mild dishwashing liquid so that it doesn’t damage your purse lining.",
        "Dab the dishwashing liquid directly onto the ink stain so that it covers it completely.",
        "If the soap touches a part of the lining without an ink stain, that is okay.",
        "It will simply clean that part of your purse lining.",
        "Rub the dishwashing soap in with a damp cloth.",
        "Get a clean cloth slightly damp with cool water.",
        "Use the damp cloth to rub the dishwashing soap into the fabric of your lining.",
        "Blot the spot with a clean cloth dipped in water.",
        "Use a damp, clean rag to gently blot out the soap from the ink stain.",
        "Don’t rub the spot, or you could push the ink further into the fabric of your purse lining.",
        "Repeat the process until the ink stain disappears.",
        "It may take a couple of tries before you remove all of the ink, especially if the stain is old.",
        "Keep adding soap and washing it off until the ink is gone.",
        "If the ink stain is stubborn, try using different tools to blot it with - Q-tips, cotton pads, and paper towels are all viable options to try.",
        "Using Hairspray Place several layers of paper towels on a flat surface.",
        "You will be working with hairspray, which can soak through fabrics and make things sticky.",
        "Line a table or countertop with paper towels to catch any spills that might happen.Tip: You can also use newspaper or a clean rag to line your area if you don’t have paper towels.",
        "Pull the lining out of your purse as much as you can.",
        "Separate the lining of your purse from the purse itself so that you don’t get hairspray on the outside and damage it.",
        "Empty your purse of all its contents and carefully pull the lining out as much as it will go.",
        "If the lining of your purse won’t come out, you can leave it in your purse.",
        "Be sure to use extra caution when applying the hairspray.",
        "Spray a small amount of hairspray directly onto the ink spot.",
        "Use any type of hairspray that has alcohol in it.",
        "Hold the nozzle close to your purse lining and spray the hairspray for about 2 seconds directly onto the ink spot.",
        "If hairspray gets onto the part of the lining that doesn’t have any ink on it, that’s okay.",
        "If the lining does not pull out of the purse much, or if you are concerned about getting hairspray on other parts of the purse, you can spray the hairspray on a Q-tip and rub the stain with it.",
        "Blot the treated spot with a dry cloth or paper towel.",
        "Quickly blot the area with a dry paper towel or cloth until it picks up most of the hairspray.",
        "You will see the ink stain fade almost immediately.",
        "Do not rub or wipe the spot.",
        "This could rub the ink further into the lining and make the stain worse.",
        "Repeat the spraying and blotting until the ink stain disappears.",
        "Depending on how old it is, you may have to do this process several times in order to get the stain off completely.",
        "Keep spraying hairspray and blotting it off with a towel until the ink is gone.",
        "Dab at the spot with a Q-tip or cloth dipped in water.",
        "Once the ink is removed, you can blot the hairspray off with a Q-tip or a cloth and cool water.",
        "Make sure that your purse lining isn’t sticky, or it will dry crusty.",
        "Try not to rub the hairspray to get it off.",
        "This could push the hairspray further into the fabric of the lining.",
        "Let the purse lining air dry before you use it.",
        "Keep the lining pulled out of your purse and set it in a cool, dry place to air dry.",
        "Pull the lining back into your purse and use it like normal.",
        "Removing Stains with Rubbing Alcohol Dip a cotton ball in rubbing alcohol until it is saturated.",
        "Use a medium or large cotton ball and dip it in some rubbing alcohol.",
        "Make sure the cotton is almost fully saturated.Tip: For small stains, use a Q-tip instead of a cotton ball.",
        "Rub the cotton ball onto the ink stain.",
        "Gently dab and then rub the cotton ball onto the ink stains so that it is covered completely.",
        "You will be able to see the stain fade right away.",
        "If the ink stain is large or more stubborn, you can also soak it directly in alcohol for 15 minutes.",
        "Keep rubbing alcohol on the spot until the ink stain disappears.",
        "The rubbing alcohol will continue to soak up ink as you add more.",
        "Use your cotton pads to soak up any alcohol that has ink in it, and add more rubbing alcohol until the stain is gone.",
        "Blot the spot with water on a paper towel or cloth.",
        "Gently remove the alcohol and left over ink with cool water on a cloth or paper towel.",
        "Don’t rub the water in, or you could push the ink back into the fabric of the lining.",
        "Let the purse lining air dry before you use it.",
        "Keep the lining pulled out of your purse and set it on a towel to air dry.",
        "Then, use it like you normally would.",
        "Your purse might smell like alcohol for a few hours, but it will go away as it dries out."
    ]
}