{
    "title": "How to Maintain Your Computer",
    "url": "https://www.wikihow.com/Maintain-Your-Computer",
    "category_hierarchy": [
        "Computers and Electronics",
        "Computers",
        "Computer Maintenance"
    ],
    "methods": [
        {
            "name": "Software\\/Hard Drive",
            "steps": [
                {
                    "headline": "Clean out all the junk left behind by browsers.",
                    "description": "To do this, you can use the Disk Cleanup utility included on Windows, or you can download a freeware program such as CCleaner to do it for you. In Linux you can use Kleansweep or Bleachbit. Cookies and cache left behind by browsers can add up to gigabytes of wasted space, so it is imperative they're deleted."
                },
                {
                    "headline": "Search for and destroy spyware and/or viruses on your PC.",
                    "description": "There is a myriad of tools available to do this. Avast is a good one to use."
                },
                {
                    "headline": "Defrag your hard drive to keep your computer running smoothly.",
                    "description": "Windows XP and up includes a utility to do this, and Windows Vista and up will automatically defrag your hard drive once a week."
                },
                {
                    "headline": "Uninstall programs you no longer use, and delete music you no longer listen to.",
                    "description": "You'll be surprised how much space you'll free up."
                },
                {
                    "headline": "Control what programs are allowed to run at startup.",
                    "description": "This can greatly reduce your startup times. In Windows 8 and 10, open the task manager, then select the Startup tab. On Windows XP, Vista, and 7, open command prompt, then type \"msconfig\". Once msconfig opens, then select the Startup tab. CCleaner also has a feature that allows you to do the same thing (Tools--->Startup)"
                },
                {
                    "headline": "Use your computer's disk management systems.",
                    "description": "For Windows, select Performance and Maintenance and then choose \"Rearrange items on your hard disk...\" and \"Free up space on your hard disk.\" For Mac, go to the Applications Folder, select Utilities Folder then launch Disk Utility."
                }
            ]
        },
        {
            "name": "Hardware\\/CPU",
            "steps": [
                {
                    "headline": "Always run your computer on a UPS as this will help protect it from electric surges.",
                    "description": "Phone lines for modems and cat 5 or cat 6 network lines also need surge suppression as they can and will take out your network card or modem in an electric storm."
                },
                {
                    "headline": "Clean your computer.",
                    "description": "Your computer can grow dusty in less than a year, depending on where it is stored. Open it up depending on how dusty your house is. If it's not too dusty, then check every few months, but if it's super dusty (your house), then be much more proactive about it. Remove the dust on the bottom with a vacuum (or cloth), then spray with compressed canned air. Pay special attention to the CPU heat sink and CPU fan. Hold the fan still while spraying it as you can cause it to spin out and on reboot it may have more noise. Spray the intakes to the Power supply fan also. Since you have the cover off reboot and listen for noisy fans make sure all fans are working. Replace the fan if it stops spinning or starts making unnatural sound or you can try to lubricate the bearing, this might help."
                },
                {
                    "headline": "Be careful when plugging in USB, Ethernet, speakers, printer etc.",
                    "description": "into your computer. Ports such as USB and Ethernet can easily be damaged from careless placement. These repairs can be costly, and these ports are a necessity."
                }
            ]
        }
    ],
    "tyn": [
        "Anti-virus software.",
        "Third-party disk utility software [MAC ONLY].",
        "A grounding strip is optional when dealing with hardware, but highly recommended."
    ],
    "text": " Software\\/Hard Drive Clean out all the junk left behind by browsers. To do this, you can use the Disk Cleanup utility included on Windows, or you can download a freeware program such as CCleaner to do it for you. In Linux you can use Kleansweep or Bleachbit. Cookies and cache left behind by browsers can add up to gigabytes of wasted space, so it is imperative they're deleted. Search for and destroy spyware and/or viruses on your PC. There is a myriad of tools available to do this. Avast is a good one to use. Defrag your hard drive to keep your computer running smoothly. Windows XP and up includes a utility to do this, and Windows Vista and up will automatically defrag your hard drive once a week. Uninstall programs you no longer use, and delete music you no longer listen to. You'll be surprised how much space you'll free up. Control what programs are allowed to run at startup. This can greatly reduce your startup times. In Windows 8 and 10, open the task manager, then select the Startup tab. On Windows XP, Vista, and 7, open command prompt, then type \"msconfig\". Once msconfig opens, then select the Startup tab. CCleaner also has a feature that allows you to do the same thing (Tools--->Startup) Use your computer's disk management systems. For Windows, select Performance and Maintenance and then choose \"Rearrange items on your hard disk...\" and \"Free up space on your hard disk.\" For Mac, go to the Applications Folder, select Utilities Folder then launch Disk Utility. Hardware\\/CPU Always run your computer on a UPS as this will help protect it from electric surges. Phone lines for modems and cat 5 or cat 6 network lines also need surge suppression as they can and will take out your network card or modem in an electric storm. Clean your computer. Your computer can grow dusty in less than a year, depending on where it is stored. Open it up depending on how dusty your house is. If it's not too dusty, then check every few months, but if it's super dusty (your house), then be much more proactive about it. Remove the dust on the bottom with a vacuum (or cloth), then spray with compressed canned air. Pay special attention to the CPU heat sink and CPU fan. Hold the fan still while spraying it as you can cause it to spin out and on reboot it may have more noise. Spray the intakes to the Power supply fan also. Since you have the cover off reboot and listen for noisy fans make sure all fans are working. Replace the fan if it stops spinning or starts making unnatural sound or you can try to lubricate the bearing, this might help. Be careful when plugging in USB, Ethernet, speakers, printer etc. into your computer. Ports such as USB and Ethernet can easily be damaged from careless placement. These repairs can be costly, and these ports are a necessity.",
    "sentences": [
        " Software\\/Hard Drive Clean out all the junk left behind by browsers.",
        "To do this, you can use the Disk Cleanup utility included on Windows, or you can download a freeware program such as CCleaner to do it for you.",
        "In Linux you can use Kleansweep or Bleachbit.",
        "Cookies and cache left behind by browsers can add up to gigabytes of wasted space, so it is imperative they're deleted.",
        "Search for and destroy spyware and/or viruses on your PC.",
        "There is a myriad of tools available to do this.",
        "Avast is a good one to use.",
        "Defrag your hard drive to keep your computer running smoothly.",
        "Windows XP and up includes a utility to do this, and Windows Vista and up will automatically defrag your hard drive once a week.",
        "Uninstall programs you no longer use, and delete music you no longer listen to.",
        "You'll be surprised how much space you'll free up.",
        "Control what programs are allowed to run at startup.",
        "This can greatly reduce your startup times.",
        "In Windows 8 and 10, open the task manager, then select the Startup tab.",
        "On Windows XP, Vista, and 7, open command prompt, then type \"msconfig\".",
        "Once msconfig opens, then select the Startup tab.",
        "CCleaner also has a feature that allows you to do the same thing (Tools--->Startup) Use your computer's disk management systems.",
        "For Windows, select Performance and Maintenance and then choose \"Rearrange items on your hard disk...\" and \"Free up space on your hard disk.\"",
        "For Mac, go to the Applications Folder, select Utilities Folder then launch Disk Utility.",
        "Hardware\\/CPU Always run your computer on a UPS as this will help protect it from electric surges.",
        "Phone lines for modems and cat 5 or cat 6 network lines also need surge suppression as they can and will take out your network card or modem in an electric storm.",
        "Clean your computer.",
        "Your computer can grow dusty in less than a year, depending on where it is stored.",
        "Open it up depending on how dusty your house is.",
        "If it's not too dusty, then check every few months, but if it's super dusty (your house), then be much more proactive about it.",
        "Remove the dust on the bottom with a vacuum (or cloth), then spray with compressed canned air.",
        "Pay special attention to the CPU heat sink and CPU fan.",
        "Hold the fan still while spraying it as you can cause it to spin out and on reboot it may have more noise.",
        "Spray the intakes to the Power supply fan also.",
        "Since you have the cover off reboot and listen for noisy fans make sure all fans are working.",
        "Replace the fan if it stops spinning or starts making unnatural sound or you can try to lubricate the bearing, this might help.",
        "Be careful when plugging in USB, Ethernet, speakers, printer etc.",
        "into your computer.",
        "Ports such as USB and Ethernet can easily be damaged from careless placement.",
        "These repairs can be costly, and these ports are a necessity."
    ]
}