{
    "title": "How to Bridge an Internet Connection",
    "url": "https://www.wikihow.com/Bridge-an-Internet-Connection",
    "category_hierarchy": [
        "Education and Communications",
        "Teaching",
        "Teacher Resources",
        "Information Technology in the Classroom"
    ],
    "steps": [
        {
            "headline": "Make sure the relevant machines and crossover cable are working.",
            "description": "To see if the cable is working, plug it into both machines. If the port lights up, then you know that it works. If it does not light up, the cord is not in working order."
        },
        {
            "headline": "Get started.",
            "description": "On both machines, go to the start menu, open the control panel and go to \"Network and Internet\". The Local Area Connection (LAN) should show up with no internet access in the window."
        },
        {
            "headline": "Create the bridge on the host machine.",
            "description": "Go to \"Change adapter settings\" on the left pane on the host machine. Two or more connections should show up. Highlight both Local Area Connection and Wireless Network Connection. Right click one of the icons you highlighted and an options menu should come up with only \"Bridge Connection\". Click it and it should take a second to set up the connection. Bridge already working? Some machines cards will automatically assign the needed network information for you. If it does, an icon on the client machine's task bar will show up with a monitor and a fork like plug showing beside it. If the icon has a caution sign, it means that the information needs to be assigned manually."
        },
        {
            "headline": "Do error checking.",
            "description": "A new icon should show up in the window called \"Network Bridge\" and it should display the name of the wireless network you are connected to below \"Network Bridge\". If not, repeat step 3 to remove the bridge and restart the process."
        },
        {
            "headline": "Access the command line.",
            "description": "Still on the host machine, open the start menu and in the search bar type \"CMD\". Open Notepad and be prepared to write down your network information."
        },
        {
            "headline": "Get the machine's network information.",
            "description": "In the CMD window, type \"ipconfig /all\". A large list of information should show up. Scroll to the top and look for \"Ethernet adapter Network Bridge:\", copy the IPv4 Address, Subnet Mask, Default Gateway, and the DNS Servers."
        },
        {
            "headline": "Perform a client machine setup.",
            "description": "On the client machine, click on \"Local Area Connection\". A window should pop up called \"Local Area Connection Status\"; select Properties, and in that window double click \"Internet Protocol Version 4 (TCP/IPv4)\"."
        },
        {
            "headline": "Enter the IP information.",
            "description": "To enter the network information, select \"Use the following IP Address\". Now the three bars should be lit up. In the IP address row, enter the IPv4 address from the host machine, and for the last section of numbers increase it by 1. Example: 192.168.1.179 becomes 192.168.1.180. The Subnet Mask is the same as what was copied as with the Default Gateway."
        },
        {
            "headline": "Check the DNS servers.",
            "description": "The DNS servers will also be changed to what was copied down from the host machine's network information. For the first row, enter the information as it was from the Host, and in the second row put in the same number but increase the last number by 1. Example: 192.168.1.1 and 192.168.1.2."
        },
        {
            "headline": "Finalize the connection.",
            "description": "Click the box about Validating Settings upon exit and click OK. It will take a second to validate but the connection should start working a few seconds after clicking OK. Your new connection should be working now."
        }
    ],
    "tyn": [
        "A laptop with one Ethernet port (RJ45 specifically), and an active wireless connection",
        "A desktop (or laptop) with a working Ethernet port",
        "A crossover cable to connect the two machines. To check if your cable is a crossover cable, check the connector and look at the pin colours; if the two sides have the colours in different positions, you have a crossover cable",
        "Alternatively, rather than a crossover cable, at least one of the PCs must have an automatically switching network interface card."
    ],
    "text": " Make sure the relevant machines and crossover cable are working. To see if the cable is working, plug it into both machines. If the port lights up, then you know that it works. If it does not light up, the cord is not in working order. Get started. On both machines, go to the start menu, open the control panel and go to \"Network and Internet\". The Local Area Connection (LAN) should show up with no internet access in the window. Create the bridge on the host machine. Go to \"Change adapter settings\" on the left pane on the host machine. Two or more connections should show up. Highlight both Local Area Connection and Wireless Network Connection. Right click one of the icons you highlighted and an options menu should come up with only \"Bridge Connection\". Click it and it should take a second to set up the connection. Bridge already working? Some machines cards will automatically assign the needed network information for you. If it does, an icon on the client machine's task bar will show up with a monitor and a fork like plug showing beside it. If the icon has a caution sign, it means that the information needs to be assigned manually. Do error checking. A new icon should show up in the window called \"Network Bridge\" and it should display the name of the wireless network you are connected to below \"Network Bridge\". If not, repeat step 3 to remove the bridge and restart the process. Access the command line. Still on the host machine, open the start menu and in the search bar type \"CMD\". Open Notepad and be prepared to write down your network information. Get the machine's network information. In the CMD window, type \"ipconfig /all\". A large list of information should show up. Scroll to the top and look for \"Ethernet adapter Network Bridge:\", copy the IPv4 Address, Subnet Mask, Default Gateway, and the DNS Servers. Perform a client machine setup. On the client machine, click on \"Local Area Connection\". A window should pop up called \"Local Area Connection Status\"; select Properties, and in that window double click \"Internet Protocol Version 4 (TCP/IPv4)\". Enter the IP information. To enter the network information, select \"Use the following IP Address\". Now the three bars should be lit up. In the IP address row, enter the IPv4 address from the host machine, and for the last section of numbers increase it by 1. Example: 192.168.1.179 becomes 192.168.1.180. The Subnet Mask is the same as what was copied as with the Default Gateway. Check the DNS servers. The DNS servers will also be changed to what was copied down from the host machine's network information. For the first row, enter the information as it was from the Host, and in the second row put in the same number but increase the last number by 1. Example: 192.168.1.1 and 192.168.1.2. Finalize the connection. Click the box about Validating Settings upon exit and click OK. It will take a second to validate but the connection should start working a few seconds after clicking OK. Your new connection should be working now.",
    "sentences": [
        " Make sure the relevant machines and crossover cable are working.",
        "To see if the cable is working, plug it into both machines.",
        "If the port lights up, then you know that it works.",
        "If it does not light up, the cord is not in working order.",
        "Get started.",
        "On both machines, go to the start menu, open the control panel and go to \"Network and Internet\".",
        "The Local Area Connection (LAN) should show up with no internet access in the window.",
        "Create the bridge on the host machine.",
        "Go to \"Change adapter settings\" on the left pane on the host machine.",
        "Two or more connections should show up.",
        "Highlight both Local Area Connection and Wireless Network Connection.",
        "Right click one of the icons you highlighted and an options menu should come up with only \"Bridge Connection\".",
        "Click it and it should take a second to set up the connection.",
        "Bridge already working?",
        "Some machines cards will automatically assign the needed network information for you.",
        "If it does, an icon on the client machine's task bar will show up with a monitor and a fork like plug showing beside it.",
        "If the icon has a caution sign, it means that the information needs to be assigned manually.",
        "Do error checking.",
        "A new icon should show up in the window called \"Network Bridge\" and it should display the name of the wireless network you are connected to below \"Network Bridge\".",
        "If not, repeat step 3 to remove the bridge and restart the process.",
        "Access the command line.",
        "Still on the host machine, open the start menu and in the search bar type \"CMD\".",
        "Open Notepad and be prepared to write down your network information.",
        "Get the machine's network information.",
        "In the CMD window, type \"ipconfig /all\".",
        "A large list of information should show up.",
        "Scroll to the top and look for \"Ethernet adapter Network Bridge:\", copy the IPv4 Address, Subnet Mask, Default Gateway, and the DNS Servers.",
        "Perform a client machine setup.",
        "On the client machine, click on \"Local Area Connection\".",
        "A window should pop up called \"Local Area Connection Status\"; select Properties, and in that window double click \"Internet Protocol Version 4 (TCP/IPv4)\".",
        "Enter the IP information.",
        "To enter the network information, select \"Use the following IP Address\".",
        "Now the three bars should be lit up.",
        "In the IP address row, enter the IPv4 address from the host machine, and for the last section of numbers increase it by 1.",
        "Example: 192.168.1.179 becomes 192.168.1.180.",
        "The Subnet Mask is the same as what was copied as with the Default Gateway.",
        "Check the DNS servers.",
        "The DNS servers will also be changed to what was copied down from the host machine's network information.",
        "For the first row, enter the information as it was from the Host, and in the second row put in the same number but increase the last number by 1.",
        "Example: 192.168.1.1 and 192.168.1.2.",
        "Finalize the connection.",
        "Click the box about Validating Settings upon exit and click OK.",
        "It will take a second to validate but the connection should start working a few seconds after clicking OK.",
        "Your new connection should be working now."
    ]
}