{
    "title": "How to Remove an Ink Stain from a Shirt Pocket",
    "url": "https://www.wikihow.com/Remove-an-Ink-Stain-from-a-Shirt-Pocket",
    "category_hierarchy": [
        "Education and Communications",
        "Stationery",
        "Ink"
    ],
    "methods": [
        {
            "name": "Water-based Ink Stain",
            "steps": [
                {
                    "headline": "Lay your shirt on white paper towels.",
                    "description": ""
                },
                {
                    "headline": "Spray a little amount of water on the stained area.",
                    "description": "Let it sit for 5 minutes."
                },
                {
                    "headline": "Blot the stain with a clean white cloth to absorb the ink.",
                    "description": "Repeat the spraying and blotting process until the cloth is not getting any more of the ink. Replace the cloth and the paper towels under the shirt as needed."
                },
                {
                    "headline": "Combine 1 tablespoon of dish-washing detergent, 2 teaspoons of white vinegar and a cup of water in a small bowl.",
                    "description": ""
                },
                {
                    "headline": "Soak a clean, white cloth with the solution and apply it to the stained area.",
                    "description": "Let it sit for about 20 minutes."
                },
                {
                    "headline": "Rub the shirt together with your fingers to help the solution lift the ink stain.",
                    "description": ""
                },
                {
                    "headline": "Wash your shirt in the warmest water temperature safe for the fabric.",
                    "description": "If the ink stain is still visible, try using the other methods under \"Non Water-based Ink stain\" to completely remove the stain."
                }
            ]
        },
        {
            "name": "Non Water-based Ink Stain",
            "steps": [
                {
                    "headline": "Put the shirt on a firm surface or keep your palm on the inner side of the stain area to provide support.",
                    "description": ""
                },
                {
                    "headline": "Dab a small quantity of nail polish remover on a cotton or soft cloth, and rub it gently to the stain area.",
                    "description": "Gradually the ink stain will start lifting off."
                },
                {
                    "headline": "Run the shirt under tap water.",
                    "description": ""
                },
                {
                    "headline": "Hang the shirt out to dry.",
                    "description": ""
                },
                {
                    "headline": "Lay your shirt faced down on white paper towels.",
                    "description": ""
                },
                {
                    "headline": "Apply a small amount of rubbing alcohol directly on the stained area.",
                    "description": "Make sure you don't put too much alcohol as this might spread the stain."
                },
                {
                    "headline": "Blot the ink stain with a clean cloth to absorb the ink.",
                    "description": "Do not rub or wipe. Rubbing will cause the stain to spread. Repeat the applying and blotting process until the cloth is not absorbing any more ink. Make sure to change the cloth when it is saturated with ink."
                },
                {
                    "headline": "Rinse the shirt with cold water.",
                    "description": ""
                },
                {
                    "headline": "Wash your shirt in the warmest water temperature safe for the fabric.",
                    "description": "Let it air dry."
                },
                {
                    "headline": "Lay your shirt on a flat surface.",
                    "description": ""
                },
                {
                    "headline": "Soak one pad of cotton wool in methylated spirits and place it under the stained area.",
                    "description": ""
                },
                {
                    "headline": "Put a clean cotton wool pad on top of the stained area to absorb the ink.",
                    "description": "Repeat the blotting process until the top cotton pad is not getting any more of the ink. Make sure to change the cotton pads as needed."
                },
                {
                    "headline": "Rinse the shirt with cold water.",
                    "description": ""
                },
                {
                    "headline": "Wash your shirt in the warmest water temperature safe for the fabric.",
                    "description": "Let it air dry."
                },
                {
                    "headline": "Lay your shirt on a flat surface.",
                    "description": ""
                },
                {
                    "headline": "Mix 1 tablespoon of dish-washing detergent and 1 cup water in a small bowl to make a solution.",
                    "description": ""
                },
                {
                    "headline": "Apply the solution to the stain using a clean cloth.",
                    "description": ""
                },
                {
                    "headline": "Add a few drops of white vinegar to the stained area.",
                    "description": "Let it sit for 15 minutes."
                },
                {
                    "headline": "Blot the stain with a clean cloth to absorb the ink.",
                    "description": "Change the cloth when needed. Repeat the applying and blotting process."
                },
                {
                    "headline": "Rinse the shirt with cold water.",
                    "description": ""
                },
                {
                    "headline": "Wash your shirt in the warmest water temperature safe for the fabric.",
                    "description": "Let it air dry."
                }
            ]
        }
    ],
    "tyn": [
        "Small bowl",
        "Spray bottle",
        "White paper towels",
        "White cloths",
        "Cotton wool",
        "Dish-washing detergent",
        "White vinegar",
        "Rubbing alcohol",
        "Methylated spirits"
    ],
    "text": " Water-based Ink Stain Lay your shirt on white paper towels.  Spray a little amount of water on the stained area. Let it sit for 5 minutes. Blot the stain with a clean white cloth to absorb the ink. Repeat the spraying and blotting process until the cloth is not getting any more of the ink. Replace the cloth and the paper towels under the shirt as needed. Combine 1 tablespoon of dish-washing detergent, 2 teaspoons of white vinegar and a cup of water in a small bowl.  Soak a clean, white cloth with the solution and apply it to the stained area. Let it sit for about 20 minutes. Rub the shirt together with your fingers to help the solution lift the ink stain.  Wash your shirt in the warmest water temperature safe for the fabric. If the ink stain is still visible, try using the other methods under \"Non Water-based Ink stain\" to completely remove the stain. Non Water-based Ink Stain Put the shirt on a firm surface or keep your palm on the inner side of the stain area to provide support.  Dab a small quantity of nail polish remover on a cotton or soft cloth, and rub it gently to the stain area. Gradually the ink stain will start lifting off. Run the shirt under tap water.  Hang the shirt out to dry.  Lay your shirt faced down on white paper towels.  Apply a small amount of rubbing alcohol directly on the stained area. Make sure you don't put too much alcohol as this might spread the stain. Blot the ink stain with a clean cloth to absorb the ink. Do not rub or wipe. Rubbing will cause the stain to spread. Repeat the applying and blotting process until the cloth is not absorbing any more ink. Make sure to change the cloth when it is saturated with ink. Rinse the shirt with cold water.  Wash your shirt in the warmest water temperature safe for the fabric. Let it air dry. Lay your shirt on a flat surface.  Soak one pad of cotton wool in methylated spirits and place it under the stained area.  Put a clean cotton wool pad on top of the stained area to absorb the ink. Repeat the blotting process until the top cotton pad is not getting any more of the ink. Make sure to change the cotton pads as needed. Rinse the shirt with cold water.  Wash your shirt in the warmest water temperature safe for the fabric. Let it air dry. Lay your shirt on a flat surface.  Mix 1 tablespoon of dish-washing detergent and 1 cup water in a small bowl to make a solution.  Apply the solution to the stain using a clean cloth.  Add a few drops of white vinegar to the stained area. Let it sit for 15 minutes. Blot the stain with a clean cloth to absorb the ink. Change the cloth when needed. Repeat the applying and blotting process. Rinse the shirt with cold water.  Wash your shirt in the warmest water temperature safe for the fabric. Let it air dry.",
    "sentences": [
        " Water-based Ink Stain Lay your shirt on white paper towels.",
        "Spray a little amount of water on the stained area.",
        "Let it sit for 5 minutes.",
        "Blot the stain with a clean white cloth to absorb the ink.",
        "Repeat the spraying and blotting process until the cloth is not getting any more of the ink.",
        "Replace the cloth and the paper towels under the shirt as needed.",
        "Combine 1 tablespoon of dish-washing detergent, 2 teaspoons of white vinegar and a cup of water in a small bowl.",
        "Soak a clean, white cloth with the solution and apply it to the stained area.",
        "Let it sit for about 20 minutes.",
        "Rub the shirt together with your fingers to help the solution lift the ink stain.",
        "Wash your shirt in the warmest water temperature safe for the fabric.",
        "If the ink stain is still visible, try using the other methods under \"Non Water-based Ink stain\" to completely remove the stain.",
        "Non Water-based Ink Stain Put the shirt on a firm surface or keep your palm on the inner side of the stain area to provide support.",
        "Dab a small quantity of nail polish remover on a cotton or soft cloth, and rub it gently to the stain area.",
        "Gradually the ink stain will start lifting off.",
        "Run the shirt under tap water.",
        "Hang the shirt out to dry.",
        "Lay your shirt faced down on white paper towels.",
        "Apply a small amount of rubbing alcohol directly on the stained area.",
        "Make sure you don't put too much alcohol as this might spread the stain.",
        "Blot the ink stain with a clean cloth to absorb the ink.",
        "Do not rub or wipe.",
        "Rubbing will cause the stain to spread.",
        "Repeat the applying and blotting process until the cloth is not absorbing any more ink.",
        "Make sure to change the cloth when it is saturated with ink.",
        "Rinse the shirt with cold water.",
        "Wash your shirt in the warmest water temperature safe for the fabric.",
        "Let it air dry.",
        "Lay your shirt on a flat surface.",
        "Soak one pad of cotton wool in methylated spirits and place it under the stained area.",
        "Put a clean cotton wool pad on top of the stained area to absorb the ink.",
        "Repeat the blotting process until the top cotton pad is not getting any more of the ink.",
        "Make sure to change the cotton pads as needed.",
        "Rinse the shirt with cold water.",
        "Wash your shirt in the warmest water temperature safe for the fabric.",
        "Let it air dry.",
        "Lay your shirt on a flat surface.",
        "Mix 1 tablespoon of dish-washing detergent and 1 cup water in a small bowl to make a solution.",
        "Apply the solution to the stain using a clean cloth.",
        "Add a few drops of white vinegar to the stained area.",
        "Let it sit for 15 minutes.",
        "Blot the stain with a clean cloth to absorb the ink.",
        "Change the cloth when needed.",
        "Repeat the applying and blotting process.",
        "Rinse the shirt with cold water.",
        "Wash your shirt in the warmest water temperature safe for the fabric.",
        "Let it air dry."
    ]
}