{
    "title": "How to Change a Bathtub Faucet",
    "url": "https://www.wikihow.com/Change-a-Bathtub-Faucet",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "parts": [
        {
            "name": "Taking out the Old Faucet Handles and Stems",
            "steps": [
                {
                    "headline": "Turn off the water supply in your home.",
                    "description": "Since most bathtubs don’t have a separate shut-off valve, you need to turn off your entire home’s water supply. Locate the supply line in your home and turn the supply valve perpendicular to the pipes. This will stop any water from coming to your tub while you’re working on it. Your water supply line may be in your basement or outside your home. If you’re unsure how to turn off your home’s water supply, contact a plumber to help you. Other fixtures inside your home won’t be able to use water while it’s shut off."
                },
                {
                    "headline": "Open the faucet to drain any excess water.",
                    "description": "Turn on one of the handles in your bathtub so the water empties out of the spout. There will be a small amount of water leftover from your pipes that will drain. When the water stops coming out of the spout, turn the faucet off again."
                },
                {
                    "headline": "Pry the index from the stem with the end of a screwdriver.",
                    "description": "The index is in the middle of your handle and is usually a coin-sized plastic cover. Slide the end of a flathead screwdriver under the edge of the index and pry it out. The size of your index will vary depending on the handles you have.Tip: Cover the tub drain while you remove the index so it doesn’t accidentally fall in."
                },
                {
                    "headline": "Loosen the screw inside the handle to remove it.",
                    "description": "After you pop off the index cover, you should see a screw inside the opening. Turn the screw counterclockwise with a screwdriver to loosen the handle from the faucet stem. Keep the drain plugged so the screws can’t fall in. Set your screws aside so you can easily find them later."
                },
                {
                    "headline": "Use a socket wrench to unscrew the stem from your faucet.",
                    "description": "The stem is the thin pipe shape that extends out from the wall and controls the faucet. Slide a hollow socket wrench tool over the stem and push it over the hex nut. Grip the wrench with a pair of pliers and twist it counterclockwise to remove it. Once the stem is loose, pull it out from the wall. You can buy a socket wrench made for pipes and valves at your local hardware store. If the nut extends out past the wall, you can just loosen it with a pair of pliers. If your bathtub has multiple handles, repeat the process for each one."
                }
            ]
        },
        {
            "name": "Removing the Spout",
            "steps": [
                {
                    "headline": "Loosen the screw underneath the spout if there is one.",
                    "description": "Your spout may have a mounting screw holding it in place. Look underneath your spout to locate the screw and turn it counterclockwise with an Allen wrench. Once the screw is loose, the faucet should easily pull off the pipe. If your spout doesn’t have a screw, you can skip this step. Make sure you plug your drain so you don’t accidentally lose the screw."
                },
                {
                    "headline": "Turn the spout counterclockwise if it didn’t have a screw.",
                    "description": "Grab the spout with a pair of pliers and spin it counterclockwise. Once the spout is loose, finish unscrewing it from your wall by hand. Pull the spout away from the pipe.Tip: If you don’t want to scratch the old faucet, place a rag or cloth around it before using your pliers."
                },
                {
                    "headline": "Measure the length of the pipe extending from your wall.",
                    "description": "Use a tape measure to find the length of the pipe that was inside your faucet. Write the measurement down so you can remember it later on. When you buy a new spout, it will need to be longer than the pipe coming out of your wall."
                }
            ]
        },
        {
            "name": "Installing the New Handles and Stems",
            "steps": [
                {
                    "headline": "Buy a new stem and handle for your tub.",
                    "description": "Bring your old stems and handles with you when you look for a new faucet. Make sure to buy stems that are exactly the same as your old ones so they fit onto your pipes easily. Then select the handle that matches the rest of your bathroom. You can buy stems and handles in the plumbing section of your local home improvement store. Make sure to get handles that work for your system. For example, you can’t install a single handle if your old faucet had multiple. Some stores sell kits that come with stems and handles for easy installation."
                },
                {
                    "headline": "Screw the stem onto the faucet pipe.",
                    "description": "Once you bring the stem home, feed the threaded end into the hold where your old faucet was. Turn the stem clockwise to tighten it by hand and secure it to the pipes. When the stem is hand-tight, then use the socket wrench and your pliers to ensure the connection is sealed. If your tub has multiple handles, then make sure to screw in a new stem for each of them.Warning: Be careful not to over-tighten your stems or else you may damage your faucet pipes."
                },
                {
                    "headline": "Slide your new handle over the stem and screw it in place.",
                    "description": "Once the stem is secured in place, put your new handle over the stem and push it back so it touches the wall. Once the handle is on the stem, use your screwdriver to tighten the screw so it’s secured to the stem. Pop the index cover over the screw to finish the handle. Repeat the process for any additional handles you have in your tub. If your handles aren’t watertight, then you may need to caulk around them to prevent water from entering your walls."
                }
            ]
        },
        {
            "name": "Attaching the Spout",
            "steps": [
                {
                    "headline": "Buy a new spout that fits onto your pipe.",
                    "description": "Go to your local home improvement store and look at the spouts that are available. Look for something that matches the handle in your tub. Make sure the new spout is longer than the measurement you took on your pipe. Use a spout that’s attached the same way as your old one or else it may not stay secure. Bring your old spout with you so you can choose something similar in size. Look for kits that include handles and spouts if you want all your fixtures to match."
                },
                {
                    "headline": "Layer plumber’s tape over the pipe’s threading.",
                    "description": "Plumber’s tape helps prevent your tub spout from leaking back toward your wall. Wrap 1-2 layers of plumber’s tape on the threading on the pipe coming out of your wall. Cut the tape and seal the threading by pressing it down with your finger. You can purchase plumber’s tape from any home improvement store."
                },
                {
                    "headline": "Screw the new spout into place.",
                    "description": "Slide your new spout over the pipe and start spinning it clockwise. Only tighten the spout by hand so you don’t damage your pipes. Keep screwing in the faucet until it’s very difficult to turn. If the spout is pointing any other direction than down, rotate the spout counterclockwise until it does. If your pipe is too short and the spout doesn’t screw on, then you may need to get a spout adapter for your pipe. This piece acts as an extension to your pipe so you can screw in the faucet. Screw the adapter onto the pipe, and then screw the spout onto the end of the adapter. If your spout has a screw on the bottom of it, tighten it with an Allen wrench to secure it in place."
                }
            ]
        }
    ],
    "tyn": [
        "Taking out the Old Faucet Handles and Stems",
        "Screwdriver",
        "Socket wrench tool",
        "Pliers",
        "Removing the Spout",
        "Allen wrench",
        "Installing the New Handles and Stems",
        "Socket wrench",
        "Attaching the Spout",
        "Plumber’s tape"
    ],
    "text": " Taking out the Old Faucet Handles and Stems Turn off the water supply in your home. Since most bathtubs don’t have a separate shut-off valve, you need to turn off your entire home’s water supply. Locate the supply line in your home and turn the supply valve perpendicular to the pipes. This will stop any water from coming to your tub while you’re working on it. Your water supply line may be in your basement or outside your home. If you’re unsure how to turn off your home’s water supply, contact a plumber to help you. Other fixtures inside your home won’t be able to use water while it’s shut off. Open the faucet to drain any excess water. Turn on one of the handles in your bathtub so the water empties out of the spout. There will be a small amount of water leftover from your pipes that will drain. When the water stops coming out of the spout, turn the faucet off again. Pry the index from the stem with the end of a screwdriver. The index is in the middle of your handle and is usually a coin-sized plastic cover. Slide the end of a flathead screwdriver under the edge of the index and pry it out. The size of your index will vary depending on the handles you have.Tip: Cover the tub drain while you remove the index so it doesn’t accidentally fall in. Loosen the screw inside the handle to remove it. After you pop off the index cover, you should see a screw inside the opening. Turn the screw counterclockwise with a screwdriver to loosen the handle from the faucet stem. Keep the drain plugged so the screws can’t fall in. Set your screws aside so you can easily find them later. Use a socket wrench to unscrew the stem from your faucet. The stem is the thin pipe shape that extends out from the wall and controls the faucet. Slide a hollow socket wrench tool over the stem and push it over the hex nut. Grip the wrench with a pair of pliers and twist it counterclockwise to remove it. Once the stem is loose, pull it out from the wall. You can buy a socket wrench made for pipes and valves at your local hardware store. If the nut extends out past the wall, you can just loosen it with a pair of pliers. If your bathtub has multiple handles, repeat the process for each one. Removing the Spout Loosen the screw underneath the spout if there is one. Your spout may have a mounting screw holding it in place. Look underneath your spout to locate the screw and turn it counterclockwise with an Allen wrench. Once the screw is loose, the faucet should easily pull off the pipe. If your spout doesn’t have a screw, you can skip this step. Make sure you plug your drain so you don’t accidentally lose the screw. Turn the spout counterclockwise if it didn’t have a screw. Grab the spout with a pair of pliers and spin it counterclockwise. Once the spout is loose, finish unscrewing it from your wall by hand. Pull the spout away from the pipe.Tip: If you don’t want to scratch the old faucet, place a rag or cloth around it before using your pliers. Measure the length of the pipe extending from your wall. Use a tape measure to find the length of the pipe that was inside your faucet. Write the measurement down so you can remember it later on. When you buy a new spout, it will need to be longer than the pipe coming out of your wall. Installing the New Handles and Stems Buy a new stem and handle for your tub. Bring your old stems and handles with you when you look for a new faucet. Make sure to buy stems that are exactly the same as your old ones so they fit onto your pipes easily. Then select the handle that matches the rest of your bathroom. You can buy stems and handles in the plumbing section of your local home improvement store. Make sure to get handles that work for your system. For example, you can’t install a single handle if your old faucet had multiple. Some stores sell kits that come with stems and handles for easy installation. Screw the stem onto the faucet pipe. Once you bring the stem home, feed the threaded end into the hold where your old faucet was. Turn the stem clockwise to tighten it by hand and secure it to the pipes. When the stem is hand-tight, then use the socket wrench and your pliers to ensure the connection is sealed. If your tub has multiple handles, then make sure to screw in a new stem for each of them.Warning: Be careful not to over-tighten your stems or else you may damage your faucet pipes. Slide your new handle over the stem and screw it in place. Once the stem is secured in place, put your new handle over the stem and push it back so it touches the wall. Once the handle is on the stem, use your screwdriver to tighten the screw so it’s secured to the stem. Pop the index cover over the screw to finish the handle. Repeat the process for any additional handles you have in your tub. If your handles aren’t watertight, then you may need to caulk around them to prevent water from entering your walls. Attaching the Spout Buy a new spout that fits onto your pipe. Go to your local home improvement store and look at the spouts that are available. Look for something that matches the handle in your tub. Make sure the new spout is longer than the measurement you took on your pipe. Use a spout that’s attached the same way as your old one or else it may not stay secure. Bring your old spout with you so you can choose something similar in size. Look for kits that include handles and spouts if you want all your fixtures to match. Layer plumber’s tape over the pipe’s threading. Plumber’s tape helps prevent your tub spout from leaking back toward your wall. Wrap 1-2 layers of plumber’s tape on the threading on the pipe coming out of your wall. Cut the tape and seal the threading by pressing it down with your finger. You can purchase plumber’s tape from any home improvement store. Screw the new spout into place. Slide your new spout over the pipe and start spinning it clockwise. Only tighten the spout by hand so you don’t damage your pipes. Keep screwing in the faucet until it’s very difficult to turn. If the spout is pointing any other direction than down, rotate the spout counterclockwise until it does. If your pipe is too short and the spout doesn’t screw on, then you may need to get a spout adapter for your pipe. This piece acts as an extension to your pipe so you can screw in the faucet. Screw the adapter onto the pipe, and then screw the spout onto the end of the adapter. If your spout has a screw on the bottom of it, tighten it with an Allen wrench to secure it in place.",
    "sentences": [
        " Taking out the Old Faucet Handles and Stems Turn off the water supply in your home.",
        "Since most bathtubs don’t have a separate shut-off valve, you need to turn off your entire home’s water supply.",
        "Locate the supply line in your home and turn the supply valve perpendicular to the pipes.",
        "This will stop any water from coming to your tub while you’re working on it.",
        "Your water supply line may be in your basement or outside your home.",
        "If you’re unsure how to turn off your home’s water supply, contact a plumber to help you.",
        "Other fixtures inside your home won’t be able to use water while it’s shut off.",
        "Open the faucet to drain any excess water.",
        "Turn on one of the handles in your bathtub so the water empties out of the spout.",
        "There will be a small amount of water leftover from your pipes that will drain.",
        "When the water stops coming out of the spout, turn the faucet off again.",
        "Pry the index from the stem with the end of a screwdriver.",
        "The index is in the middle of your handle and is usually a coin-sized plastic cover.",
        "Slide the end of a flathead screwdriver under the edge of the index and pry it out.",
        "The size of your index will vary depending on the handles you have.Tip: Cover the tub drain while you remove the index so it doesn’t accidentally fall in.",
        "Loosen the screw inside the handle to remove it.",
        "After you pop off the index cover, you should see a screw inside the opening.",
        "Turn the screw counterclockwise with a screwdriver to loosen the handle from the faucet stem.",
        "Keep the drain plugged so the screws can’t fall in.",
        "Set your screws aside so you can easily find them later.",
        "Use a socket wrench to unscrew the stem from your faucet.",
        "The stem is the thin pipe shape that extends out from the wall and controls the faucet.",
        "Slide a hollow socket wrench tool over the stem and push it over the hex nut.",
        "Grip the wrench with a pair of pliers and twist it counterclockwise to remove it.",
        "Once the stem is loose, pull it out from the wall.",
        "You can buy a socket wrench made for pipes and valves at your local hardware store.",
        "If the nut extends out past the wall, you can just loosen it with a pair of pliers.",
        "If your bathtub has multiple handles, repeat the process for each one.",
        "Removing the Spout Loosen the screw underneath the spout if there is one.",
        "Your spout may have a mounting screw holding it in place.",
        "Look underneath your spout to locate the screw and turn it counterclockwise with an Allen wrench.",
        "Once the screw is loose, the faucet should easily pull off the pipe.",
        "If your spout doesn’t have a screw, you can skip this step.",
        "Make sure you plug your drain so you don’t accidentally lose the screw.",
        "Turn the spout counterclockwise if it didn’t have a screw.",
        "Grab the spout with a pair of pliers and spin it counterclockwise.",
        "Once the spout is loose, finish unscrewing it from your wall by hand.",
        "Pull the spout away from the pipe.Tip: If you don’t want to scratch the old faucet, place a rag or cloth around it before using your pliers.",
        "Measure the length of the pipe extending from your wall.",
        "Use a tape measure to find the length of the pipe that was inside your faucet.",
        "Write the measurement down so you can remember it later on.",
        "When you buy a new spout, it will need to be longer than the pipe coming out of your wall.",
        "Installing the New Handles and Stems Buy a new stem and handle for your tub.",
        "Bring your old stems and handles with you when you look for a new faucet.",
        "Make sure to buy stems that are exactly the same as your old ones so they fit onto your pipes easily.",
        "Then select the handle that matches the rest of your bathroom.",
        "You can buy stems and handles in the plumbing section of your local home improvement store.",
        "Make sure to get handles that work for your system.",
        "For example, you can’t install a single handle if your old faucet had multiple.",
        "Some stores sell kits that come with stems and handles for easy installation.",
        "Screw the stem onto the faucet pipe.",
        "Once you bring the stem home, feed the threaded end into the hold where your old faucet was.",
        "Turn the stem clockwise to tighten it by hand and secure it to the pipes.",
        "When the stem is hand-tight, then use the socket wrench and your pliers to ensure the connection is sealed.",
        "If your tub has multiple handles, then make sure to screw in a new stem for each of them.Warning: Be careful not to over-tighten your stems or else you may damage your faucet pipes.",
        "Slide your new handle over the stem and screw it in place.",
        "Once the stem is secured in place, put your new handle over the stem and push it back so it touches the wall.",
        "Once the handle is on the stem, use your screwdriver to tighten the screw so it’s secured to the stem.",
        "Pop the index cover over the screw to finish the handle.",
        "Repeat the process for any additional handles you have in your tub.",
        "If your handles aren’t watertight, then you may need to caulk around them to prevent water from entering your walls.",
        "Attaching the Spout Buy a new spout that fits onto your pipe.",
        "Go to your local home improvement store and look at the spouts that are available.",
        "Look for something that matches the handle in your tub.",
        "Make sure the new spout is longer than the measurement you took on your pipe.",
        "Use a spout that’s attached the same way as your old one or else it may not stay secure.",
        "Bring your old spout with you so you can choose something similar in size.",
        "Look for kits that include handles and spouts if you want all your fixtures to match.",
        "Layer plumber’s tape over the pipe’s threading.",
        "Plumber’s tape helps prevent your tub spout from leaking back toward your wall.",
        "Wrap 1-2 layers of plumber’s tape on the threading on the pipe coming out of your wall.",
        "Cut the tape and seal the threading by pressing it down with your finger.",
        "You can purchase plumber’s tape from any home improvement store.",
        "Screw the new spout into place.",
        "Slide your new spout over the pipe and start spinning it clockwise.",
        "Only tighten the spout by hand so you don’t damage your pipes.",
        "Keep screwing in the faucet until it’s very difficult to turn.",
        "If the spout is pointing any other direction than down, rotate the spout counterclockwise until it does.",
        "If your pipe is too short and the spout doesn’t screw on, then you may need to get a spout adapter for your pipe.",
        "This piece acts as an extension to your pipe so you can screw in the faucet.",
        "Screw the adapter onto the pipe, and then screw the spout onto the end of the adapter.",
        "If your spout has a screw on the bottom of it, tighten it with an Allen wrench to secure it in place."
    ]
}