{
    "title": "How to Grow Potted Plants",
    "url": "https://www.wikihow.com/Grow-Potted-Plants",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening",
        "Indoor and Patio Plants"
    ],
    "parts": [
        {
            "name": "Creating the Right Environment",
            "steps": [
                {
                    "headline": "Choose containers with drainage holes.",
                    "description": "Pots come in plenty of colors, shapes, and sizes, but the most important consideration is drainage. Make sure any container you purchase has small holes at the bottom so your plants’ roots won’t drown. If you can't live without a pot that doesn’t have drainage holes, purchase a slightly smaller plastic container that has drainage holes and fits inside the pot without holes. Grab the saucer that matches your pot. A saucer fits under the pot, collects drained water, and prevents messes."
                },
                {
                    "headline": "Select light-loving plants if you plan to put them in full sun.",
                    "description": "The best location where you’ll keep the pot depends on the type of plants you purchase. Keep plants with tags labelled “full-sun” in outdoor sun-soaked spots and indoor areas by windows. If you have a spot for the pot in mind, observe the area before purchasing your plants. Make sure it gets at least 6 hours of direct sunlight. If it doesn’t, go for a plant marked for shade or partial sun. Full-sun options include most flowering plants, such as petunias, geraniums, salvias, true lilies, canna lilies, and lilacs. Other sun-loving plants include those that bear fruits and vegetables, like tomatoes, peppers, and cucumbers. Most herbs, including basil, lavender, and thyme, also require lots of sun."
                },
                {
                    "headline": "Opt for shade plants to put in spots that don’t get much sunlight.",
                    "description": "When you’re at the nursery or home improvement store, check for plant tags marked “shade-tolerant” or “moderate sun.” This means the plants need around 3 hours of sunlight or less per day. Good flowering options include begonias, impatiens, crocuses, periwinkle, lilies of the valley, and some tulips. Ajuga and coleus are shade tolerant and produce attractive leaves in a range of colors. While they grow best with moderate sun, spider and snake plants tolerate low light levels. They're popular houseplants and require little maintenance."
                },
                {
                    "headline": "Use potting soil that has the right drainage requirements for your plants.",
                    "description": "Topsoil from your yard would dry out and clump, and store-bought garden soil is too dense to allow proper drainage. If you have a bag of garden soil and don’t want to splurge on potting soil, combine equal parts of garden soil, peat moss, and perlite. Store-bought potting soil is the best choice for most plants. However, some have specific requirements. If you’re planting orchids, you’ll need to get a growing medium that’s full of bark and other large chunks of organic matter. Fruits and vegetables prefer nutrient-rich clay or loam soils that retain moisture. Cacti and other succulents prefer well-drained, sandy soil. Go for a store-bought cactus mix or combine equal parts of sand and potting soil."
                },
                {
                    "headline": "Amend the soil if necessary to ensure it has the right pH.",
                    "description": "You can  test your soil's pH and amend it to suit your plants' preferences. Add sphagnum peat or sulfur to make it more acidic, and powdered limestone or wood ashes to make it less acidic. Some plants, such as banksias and grevilleas, are phosphorus-sensitive and need a low-acid, low-phosphorus soil. On the other hand, camellias and azaleas thrive in phosphorus-rich acidic soil. When shopping for potting mixes, match the soil's pH and phosphorus levels to the recommendations on your plants' tags."
                },
                {
                    "headline": "Provide the right amount of space for your plants.",
                    "description": "Shrubs, like hibiscus, fuchsia, and bougainvillea, and plants that bear fruits and vegetables typically need lots of room to grow. Go for containers that are at least 1 to 2 feet (30 to 61 cm) deep and hold at least 5 to 10 gallons (19 to 38 L) of soil. Plants like rubber trees, tomatoes, peppers, and carrots usually do best on their own. They have large root systems and consume lots of nutrients. Plants with more modest root systems, like pansies, dusty millers, daisies, ajugas, creeping Jenny, and succulents, do well with other plants. To allow room for growth, space them about 4 to 6 inches (10 to 15 cm) apart, or according to the instructions on their tags."
                }
            ]
        },
        {
            "name": "Preparing Your Planter",
            "steps": [
                {
                    "headline": "Fill the bottom third of the pot with rocks, broken pots, or foam peanuts.",
                    "description": "Unless you’re planting a small tree or shrub with an extensive root system, line the bottom of the container with rocks, shards of broken pots, foam packing peanuts, or crushed cans and milk jugs. Fill the container about 1/4 to 1/3 with your choice of material. Filler material will encourage drainage and reduce the amount of soil you’ll need, which can get expensive. Smaller objects, like rocks and pieces of broken pots, are great for drainage-loving succulents and herbs planted in small pots. Use larger objects, like cans and milk jugs, for larger containers. Limit the amount of drainage material you use for plants with extensive root systems, such as small citrus trees, hibiscus and other shrubs, tomatoes, and strawberries. A 1 to 2 inch (2.5 to 5.1 cm) layer of rocks or broken pot shards will provide drainage without smothering the roots."
                },
                {
                    "headline": "Add soil to within 2 inches (5.1 cm) of the container’s rim.",
                    "description": "Dump the bag of potting soil into a large container, or use a trowel to fill a small pot. Keep the soil loose, and shake the pot to even out mounds instead of packing it. Leaving about 2 inches (5.1 cm) between the top of the soil and the container’s rim will allow you to water the container without it spilling over the edge. The space between the soil and rim will also give you room to scoop out holes for the plants."
                },
                {
                    "headline": "Water your plants thoroughly, then knock them out of their plastic cup.",
                    "description": "Soak your plants to prepare them for transplant. Pick one up, and place your hand on top of the cup so the plant’s stem is between your fingers. Turn the cup upside down and carefully squeeze the sides of the cup to remove the roots and soil ball. Don’t pull the stem to remove the plant from the cup, and try to disturb the roots as little as possible. Knock the plants out of their cups one by one. Remove a plant from its cup, transplant it, then move on to the next."
                },
                {
                    "headline": "Massage the root ball gently to encourage growth.",
                    "description": "After removing the cup, lightly massage the roots with your fingertips to loosen them from the soil. Don’t unravel the root ball, rub hard, or work away all of the soil. You just want to loosen the roots a bit to encourage them to spread out in their new home."
                },
                {
                    "headline": "Dig a hole equal in size to the plant's root ball.",
                    "description": "Dig a hole in the center of the soil bed large enough to accommodate the root ball. It should be deep enough so the crown (where the roots meet the stem) will be level with the top of the soil. Place the root ball in the hole, then fill in soil to level the surface. If you’re just growing one plant in an individual pot, you don’t have to worry about planning the arrangement or spacing other plants."
                },
                {
                    "headline": "Place the tallest plants in the middle, if you’re using a variety of plants.",
                    "description": "Start by scooping a hole in the center for the tallest plant. Place the root system in the hole so the plant’s crown is level with the top of the soil, then fill in the hole so the surface is even. For example, if you have tall grass, spiky Dracena, or phormium, plant it in the center of the pot. Provided you have a deep enough pot, azaleas, hibiscus, and elephant ears work well as tall focal points."
                },
                {
                    "headline": "Add smaller plants closer to the container’s edges.",
                    "description": "When you're finished with the tallest plant, work your way toward the edges as you you plant flowers, vines, or other smaller specimens. Create a middle layer of flowering or brightly-colored plants, and place vines that will spill out over the sides of the pot about 2 inches (5.1 cm) from the edges. Great filler plants include coleus, ajugas, and hostas. Petunias, salvias, pansies, and geraniums are popular choices that add pops of color. Good spillers, or plants with foliage that trails over the pot's edges, include creeping Jenny, clematis, English ivy, and sedum. Space the plants about 4 to 6 inches (10 to 15 cm) apart from each other, or according to the instructions on their tags. Don’t worry if the container looks a bit sparse. Your plants need room to grow, and they’ll fill in empty spaces within a few weeks."
                },
                {
                    "headline": "Soak the soil when you finish planting.",
                    "description": "Thoroughly soaking the soil will help prevent transplant shock. Water the container until the pot starts to drain and the top of the soil is saturated. Depending on the container’s size, it could take several minutes to water it completely. Water will drain from the bottom of the container, so be sure to place the pot on a saucer. Stop watering when you see water leaking from the drainage holes at the bottom. Room temperature water is ideal, especially for tropical plants, like elephant ear, bougainvillea, and orchids. If water from your hose or faucet feels ice cold, fill a pitcher or watering can and allow it to warm to room temperature. Tap water is usually fine, as long as you don't use water softeners. Water treated with softeners can cause salt buildup. Distilled water is best for carnivorous plants, like pitcher plants and Venus fly traps. They prefer low-nutrient soil and don't like the minerals in tap water."
                }
            ]
        },
        {
            "name": "Caring for Your Plants",
            "steps": [
                {
                    "headline": "Keep a saucer under the pot to catch drained water.",
                    "description": "A saucer will prevent dirty water from pooling on your floor, windowsill or desk. Empty the saucer about an hour after watering to prevent root rot. If the container is too heavy to lift and you can’t remove the saucer, use a bulb baster to suck up the water."
                },
                {
                    "headline": "Water the pot when the soil is dry or according to the tag’s instructions.",
                    "description": "The right amount of water depends on your plants, the size of your container, and whether you keep the pot indoors or outdoors. As a general rule, stick your finger into the soil and water only when it’s dry. If the soil is moist and your finger can easily penetrate it, don't water the pot. If the soil feels dry and your finger can't easily penetrate it, your plant needs water. For most plants, watering thoroughly and letting the soil dry completely is better than keeping the soil damp. Most flowering plants, fruits, vegetables, and herbs need to be watered daily. Cacti and other succulents should only be watered every 2 to 4 days at most. When in doubt, check your plants’ tags and water them as directed."
                },
                {
                    "headline": "Add slow-release fertilizer beads monthly, or as the tag recommends.",
                    "description": "Nutrients leech from the soil every time you water, so you’ll need to fertilize your potted plant regularly. All-purpose fertilizer beads that release nutrients over time are good for most plants, but you should check plant tags for specific instructions. Use about 1/2 teaspoon of fertilizer beads for 1 gallon (3.8 L) of soil. Spread the granules over the soil, and use your fingers or a small trowel to work it about 2 inches (5.1 cm) deep. In general, flowering plants, fruits, and vegetables need more nutrients than herbs and succulents. During mid-season, or when they produce ripe fruit, fertilize plants like tomatoes and peppers every 1 to 2 weeks. Keep an eye out for yellow leaves, which could indicate you're over-fertilizing. You don't have to be fussy about fertilizing herbs, like basil, cilantro, lavender, and rosemary. They're prone to over-fertilization, so 1 application every 3 to 4 months is best. Cacti and other succulents only need to be fertilized once or twice a year."
                },
                {
                    "headline": "Prune your plants whenever you see dead leaves.",
                    "description": "Use clean pruning shears to cut dead flowers and leaves. Trim them at a 45 degree angle just below the brown or dead area. Clip new growth at a 45 degree angle about ⁄2 inch (1.3 cm) above the nodule to keep a rapidly growing plant in check. The nodule looks like a small bump or bud where new growth emerges. If you’re clipping herbs or pruning a rapid grower, avoid removing more than 30%  of the plant at a time. Clipping too much can shock and kill the plant. Pruning encourages new growth and will lead to fuller, more robust plants."
                },
                {
                    "headline": "Cut off any part of the plant that has rot or fungus.",
                    "description": "In addition to regular pruning, you’ll need to remove diseased leaves as soon as you spot them. Signs of disease include black or brown spots, yellowing, white patches, and foul odor. If the problem persists, purchase an antifungal spray labelled for plants. Look for a fungicide formulated for your specific plant at a gardening center. Read its instructions, and apply it as directed. Common plant diseases include black or white fungal and bacterial blights, fungal rusts (which are characterized by a rust-colored coating), and cankers, or areas of dead, oozing tissue on wood stems."
                },
                {
                    "headline": "Apply insecticide, if the plant becomes infested with pests.",
                    "description": "If you need to deal with pests, look for a plant insecticide at a garden center. If you keep your plant indoors, make sure the product is labelled for houseplants. Read your product’s instructions and use it as directed. Most plant insecticides are recommended for specific plants, which are listed on the label. Check labels for your plants or ask an employee at the garden center for help. Common pests include aphids, ants, gnats, spider mites, and whiteflies. While aphids, ants, and flies are visible, mites are tough to spot. Look for patches of fine webbing with tiny, barely visible specks. Signs of mite infestation include tiny light green spots on leaves and stems, yellow discoloration, and curled or dead leaves."
                }
            ]
        }
    ],
    "tyn": [
        "Pot with drainage holes",
        "Potting soil",
        "Plants",
        "Trowel",
        "Gardening gloves",
        "Filler, such as clay pot shards, rocks, cans, or milk jugs",
        "Pruning shears"
    ],
    "text": " Creating the Right Environment Choose containers with drainage holes. Pots come in plenty of colors, shapes, and sizes, but the most important consideration is drainage. Make sure any container you purchase has small holes at the bottom so your plants’ roots won’t drown. If you can't live without a pot that doesn’t have drainage holes, purchase a slightly smaller plastic container that has drainage holes and fits inside the pot without holes. Grab the saucer that matches your pot. A saucer fits under the pot, collects drained water, and prevents messes. Select light-loving plants if you plan to put them in full sun. The best location where you’ll keep the pot depends on the type of plants you purchase. Keep plants with tags labelled “full-sun” in outdoor sun-soaked spots and indoor areas by windows. If you have a spot for the pot in mind, observe the area before purchasing your plants. Make sure it gets at least 6 hours of direct sunlight. If it doesn’t, go for a plant marked for shade or partial sun. Full-sun options include most flowering plants, such as petunias, geraniums, salvias, true lilies, canna lilies, and lilacs. Other sun-loving plants include those that bear fruits and vegetables, like tomatoes, peppers, and cucumbers. Most herbs, including basil, lavender, and thyme, also require lots of sun. Opt for shade plants to put in spots that don’t get much sunlight. When you’re at the nursery or home improvement store, check for plant tags marked “shade-tolerant” or “moderate sun.” This means the plants need around 3 hours of sunlight or less per day. Good flowering options include begonias, impatiens, crocuses, periwinkle, lilies of the valley, and some tulips. Ajuga and coleus are shade tolerant and produce attractive leaves in a range of colors. While they grow best with moderate sun, spider and snake plants tolerate low light levels. They're popular houseplants and require little maintenance. Use potting soil that has the right drainage requirements for your plants. Topsoil from your yard would dry out and clump, and store-bought garden soil is too dense to allow proper drainage. If you have a bag of garden soil and don’t want to splurge on potting soil, combine equal parts of garden soil, peat moss, and perlite. Store-bought potting soil is the best choice for most plants. However, some have specific requirements. If you’re planting orchids, you’ll need to get a growing medium that’s full of bark and other large chunks of organic matter. Fruits and vegetables prefer nutrient-rich clay or loam soils that retain moisture. Cacti and other succulents prefer well-drained, sandy soil. Go for a store-bought cactus mix or combine equal parts of sand and potting soil. Amend the soil if necessary to ensure it has the right pH. You can  test your soil's pH and amend it to suit your plants' preferences. Add sphagnum peat or sulfur to make it more acidic, and powdered limestone or wood ashes to make it less acidic. Some plants, such as banksias and grevilleas, are phosphorus-sensitive and need a low-acid, low-phosphorus soil. On the other hand, camellias and azaleas thrive in phosphorus-rich acidic soil. When shopping for potting mixes, match the soil's pH and phosphorus levels to the recommendations on your plants' tags. Provide the right amount of space for your plants. Shrubs, like hibiscus, fuchsia, and bougainvillea, and plants that bear fruits and vegetables typically need lots of room to grow. Go for containers that are at least 1 to 2 feet (30 to 61 cm) deep and hold at least 5 to 10 gallons (19 to 38 L) of soil. Plants like rubber trees, tomatoes, peppers, and carrots usually do best on their own. They have large root systems and consume lots of nutrients. Plants with more modest root systems, like pansies, dusty millers, daisies, ajugas, creeping Jenny, and succulents, do well with other plants. To allow room for growth, space them about 4 to 6 inches (10 to 15 cm) apart, or according to the instructions on their tags. Preparing Your Planter Fill the bottom third of the pot with rocks, broken pots, or foam peanuts. Unless you’re planting a small tree or shrub with an extensive root system, line the bottom of the container with rocks, shards of broken pots, foam packing peanuts, or crushed cans and milk jugs. Fill the container about 1/4 to 1/3 with your choice of material. Filler material will encourage drainage and reduce the amount of soil you’ll need, which can get expensive. Smaller objects, like rocks and pieces of broken pots, are great for drainage-loving succulents and herbs planted in small pots. Use larger objects, like cans and milk jugs, for larger containers. Limit the amount of drainage material you use for plants with extensive root systems, such as small citrus trees, hibiscus and other shrubs, tomatoes, and strawberries. A 1 to 2 inch (2.5 to 5.1 cm) layer of rocks or broken pot shards will provide drainage without smothering the roots. Add soil to within 2 inches (5.1 cm) of the container’s rim. Dump the bag of potting soil into a large container, or use a trowel to fill a small pot. Keep the soil loose, and shake the pot to even out mounds instead of packing it. Leaving about 2 inches (5.1 cm) between the top of the soil and the container’s rim will allow you to water the container without it spilling over the edge. The space between the soil and rim will also give you room to scoop out holes for the plants. Water your plants thoroughly, then knock them out of their plastic cup. Soak your plants to prepare them for transplant. Pick one up, and place your hand on top of the cup so the plant’s stem is between your fingers. Turn the cup upside down and carefully squeeze the sides of the cup to remove the roots and soil ball. Don’t pull the stem to remove the plant from the cup, and try to disturb the roots as little as possible. Knock the plants out of their cups one by one. Remove a plant from its cup, transplant it, then move on to the next. Massage the root ball gently to encourage growth. After removing the cup, lightly massage the roots with your fingertips to loosen them from the soil. Don’t unravel the root ball, rub hard, or work away all of the soil. You just want to loosen the roots a bit to encourage them to spread out in their new home. Dig a hole equal in size to the plant's root ball. Dig a hole in the center of the soil bed large enough to accommodate the root ball. It should be deep enough so the crown (where the roots meet the stem) will be level with the top of the soil. Place the root ball in the hole, then fill in soil to level the surface. If you’re just growing one plant in an individual pot, you don’t have to worry about planning the arrangement or spacing other plants. Place the tallest plants in the middle, if you’re using a variety of plants. Start by scooping a hole in the center for the tallest plant. Place the root system in the hole so the plant’s crown is level with the top of the soil, then fill in the hole so the surface is even. For example, if you have tall grass, spiky Dracena, or phormium, plant it in the center of the pot. Provided you have a deep enough pot, azaleas, hibiscus, and elephant ears work well as tall focal points. Add smaller plants closer to the container’s edges. When you're finished with the tallest plant, work your way toward the edges as you you plant flowers, vines, or other smaller specimens. Create a middle layer of flowering or brightly-colored plants, and place vines that will spill out over the sides of the pot about 2 inches (5.1 cm) from the edges. Great filler plants include coleus, ajugas, and hostas. Petunias, salvias, pansies, and geraniums are popular choices that add pops of color. Good spillers, or plants with foliage that trails over the pot's edges, include creeping Jenny, clematis, English ivy, and sedum. Space the plants about 4 to 6 inches (10 to 15 cm) apart from each other, or according to the instructions on their tags. Don’t worry if the container looks a bit sparse. Your plants need room to grow, and they’ll fill in empty spaces within a few weeks. Soak the soil when you finish planting. Thoroughly soaking the soil will help prevent transplant shock. Water the container until the pot starts to drain and the top of the soil is saturated. Depending on the container’s size, it could take several minutes to water it completely. Water will drain from the bottom of the container, so be sure to place the pot on a saucer. Stop watering when you see water leaking from the drainage holes at the bottom. Room temperature water is ideal, especially for tropical plants, like elephant ear, bougainvillea, and orchids. If water from your hose or faucet feels ice cold, fill a pitcher or watering can and allow it to warm to room temperature. Tap water is usually fine, as long as you don't use water softeners. Water treated with softeners can cause salt buildup. Distilled water is best for carnivorous plants, like pitcher plants and Venus fly traps. They prefer low-nutrient soil and don't like the minerals in tap water. Caring for Your Plants Keep a saucer under the pot to catch drained water. A saucer will prevent dirty water from pooling on your floor, windowsill or desk. Empty the saucer about an hour after watering to prevent root rot. If the container is too heavy to lift and you can’t remove the saucer, use a bulb baster to suck up the water. Water the pot when the soil is dry or according to the tag’s instructions. The right amount of water depends on your plants, the size of your container, and whether you keep the pot indoors or outdoors. As a general rule, stick your finger into the soil and water only when it’s dry. If the soil is moist and your finger can easily penetrate it, don't water the pot. If the soil feels dry and your finger can't easily penetrate it, your plant needs water. For most plants, watering thoroughly and letting the soil dry completely is better than keeping the soil damp. Most flowering plants, fruits, vegetables, and herbs need to be watered daily. Cacti and other succulents should only be watered every 2 to 4 days at most. When in doubt, check your plants’ tags and water them as directed. Add slow-release fertilizer beads monthly, or as the tag recommends. Nutrients leech from the soil every time you water, so you’ll need to fertilize your potted plant regularly. All-purpose fertilizer beads that release nutrients over time are good for most plants, but you should check plant tags for specific instructions. Use about 1/2 teaspoon of fertilizer beads for 1 gallon (3.8 L) of soil. Spread the granules over the soil, and use your fingers or a small trowel to work it about 2 inches (5.1 cm) deep. In general, flowering plants, fruits, and vegetables need more nutrients than herbs and succulents. During mid-season, or when they produce ripe fruit, fertilize plants like tomatoes and peppers every 1 to 2 weeks. Keep an eye out for yellow leaves, which could indicate you're over-fertilizing. You don't have to be fussy about fertilizing herbs, like basil, cilantro, lavender, and rosemary. They're prone to over-fertilization, so 1 application every 3 to 4 months is best. Cacti and other succulents only need to be fertilized once or twice a year. Prune your plants whenever you see dead leaves. Use clean pruning shears to cut dead flowers and leaves. Trim them at a 45 degree angle just below the brown or dead area. Clip new growth at a 45 degree angle about ⁄2 inch (1.3 cm) above the nodule to keep a rapidly growing plant in check. The nodule looks like a small bump or bud where new growth emerges. If you’re clipping herbs or pruning a rapid grower, avoid removing more than 30%  of the plant at a time. Clipping too much can shock and kill the plant. Pruning encourages new growth and will lead to fuller, more robust plants. Cut off any part of the plant that has rot or fungus. In addition to regular pruning, you’ll need to remove diseased leaves as soon as you spot them. Signs of disease include black or brown spots, yellowing, white patches, and foul odor. If the problem persists, purchase an antifungal spray labelled for plants. Look for a fungicide formulated for your specific plant at a gardening center. Read its instructions, and apply it as directed. Common plant diseases include black or white fungal and bacterial blights, fungal rusts (which are characterized by a rust-colored coating), and cankers, or areas of dead, oozing tissue on wood stems. Apply insecticide, if the plant becomes infested with pests. If you need to deal with pests, look for a plant insecticide at a garden center. If you keep your plant indoors, make sure the product is labelled for houseplants. Read your product’s instructions and use it as directed. Most plant insecticides are recommended for specific plants, which are listed on the label. Check labels for your plants or ask an employee at the garden center for help. Common pests include aphids, ants, gnats, spider mites, and whiteflies. While aphids, ants, and flies are visible, mites are tough to spot. Look for patches of fine webbing with tiny, barely visible specks. Signs of mite infestation include tiny light green spots on leaves and stems, yellow discoloration, and curled or dead leaves.",
    "sentences": [
        " Creating the Right Environment Choose containers with drainage holes.",
        "Pots come in plenty of colors, shapes, and sizes, but the most important consideration is drainage.",
        "Make sure any container you purchase has small holes at the bottom so your plants’ roots won’t drown.",
        "If you can't live without a pot that doesn’t have drainage holes, purchase a slightly smaller plastic container that has drainage holes and fits inside the pot without holes.",
        "Grab the saucer that matches your pot.",
        "A saucer fits under the pot, collects drained water, and prevents messes.",
        "Select light-loving plants if you plan to put them in full sun.",
        "The best location where you’ll keep the pot depends on the type of plants you purchase.",
        "Keep plants with tags labelled “full-sun” in outdoor sun-soaked spots and indoor areas by windows.",
        "If you have a spot for the pot in mind, observe the area before purchasing your plants.",
        "Make sure it gets at least 6 hours of direct sunlight.",
        "If it doesn’t, go for a plant marked for shade or partial sun.",
        "Full-sun options include most flowering plants, such as petunias, geraniums, salvias, true lilies, canna lilies, and lilacs.",
        "Other sun-loving plants include those that bear fruits and vegetables, like tomatoes, peppers, and cucumbers.",
        "Most herbs, including basil, lavender, and thyme, also require lots of sun.",
        "Opt for shade plants to put in spots that don’t get much sunlight.",
        "When you’re at the nursery or home improvement store, check for plant tags marked “shade-tolerant” or “moderate sun.” This means the plants need around 3 hours of sunlight or less per day.",
        "Good flowering options include begonias, impatiens, crocuses, periwinkle, lilies of the valley, and some tulips.",
        "Ajuga and coleus are shade tolerant and produce attractive leaves in a range of colors.",
        "While they grow best with moderate sun, spider and snake plants tolerate low light levels.",
        "They're popular houseplants and require little maintenance.",
        "Use potting soil that has the right drainage requirements for your plants.",
        "Topsoil from your yard would dry out and clump, and store-bought garden soil is too dense to allow proper drainage.",
        "If you have a bag of garden soil and don’t want to splurge on potting soil, combine equal parts of garden soil, peat moss, and perlite.",
        "Store-bought potting soil is the best choice for most plants.",
        "However, some have specific requirements.",
        "If you’re planting orchids, you’ll need to get a growing medium that’s full of bark and other large chunks of organic matter.",
        "Fruits and vegetables prefer nutrient-rich clay or loam soils that retain moisture.",
        "Cacti and other succulents prefer well-drained, sandy soil.",
        "Go for a store-bought cactus mix or combine equal parts of sand and potting soil.",
        "Amend the soil if necessary to ensure it has the right pH.",
        "You can  test your soil's pH and amend it to suit your plants' preferences.",
        "Add sphagnum peat or sulfur to make it more acidic, and powdered limestone or wood ashes to make it less acidic.",
        "Some plants, such as banksias and grevilleas, are phosphorus-sensitive and need a low-acid, low-phosphorus soil.",
        "On the other hand, camellias and azaleas thrive in phosphorus-rich acidic soil.",
        "When shopping for potting mixes, match the soil's pH and phosphorus levels to the recommendations on your plants' tags.",
        "Provide the right amount of space for your plants.",
        "Shrubs, like hibiscus, fuchsia, and bougainvillea, and plants that bear fruits and vegetables typically need lots of room to grow.",
        "Go for containers that are at least 1 to 2 feet (30 to 61 cm) deep and hold at least 5 to 10 gallons (19 to 38 L) of soil.",
        "Plants like rubber trees, tomatoes, peppers, and carrots usually do best on their own.",
        "They have large root systems and consume lots of nutrients.",
        "Plants with more modest root systems, like pansies, dusty millers, daisies, ajugas, creeping Jenny, and succulents, do well with other plants.",
        "To allow room for growth, space them about 4 to 6 inches (10 to 15 cm) apart, or according to the instructions on their tags.",
        "Preparing Your Planter Fill the bottom third of the pot with rocks, broken pots, or foam peanuts.",
        "Unless you’re planting a small tree or shrub with an extensive root system, line the bottom of the container with rocks, shards of broken pots, foam packing peanuts, or crushed cans and milk jugs.",
        "Fill the container about 1/4 to 1/3 with your choice of material.",
        "Filler material will encourage drainage and reduce the amount of soil you’ll need, which can get expensive.",
        "Smaller objects, like rocks and pieces of broken pots, are great for drainage-loving succulents and herbs planted in small pots.",
        "Use larger objects, like cans and milk jugs, for larger containers.",
        "Limit the amount of drainage material you use for plants with extensive root systems, such as small citrus trees, hibiscus and other shrubs, tomatoes, and strawberries.",
        "A 1 to 2 inch (2.5 to 5.1 cm) layer of rocks or broken pot shards will provide drainage without smothering the roots.",
        "Add soil to within 2 inches (5.1 cm) of the container’s rim.",
        "Dump the bag of potting soil into a large container, or use a trowel to fill a small pot.",
        "Keep the soil loose, and shake the pot to even out mounds instead of packing it.",
        "Leaving about 2 inches (5.1 cm) between the top of the soil and the container’s rim will allow you to water the container without it spilling over the edge.",
        "The space between the soil and rim will also give you room to scoop out holes for the plants.",
        "Water your plants thoroughly, then knock them out of their plastic cup.",
        "Soak your plants to prepare them for transplant.",
        "Pick one up, and place your hand on top of the cup so the plant’s stem is between your fingers.",
        "Turn the cup upside down and carefully squeeze the sides of the cup to remove the roots and soil ball.",
        "Don’t pull the stem to remove the plant from the cup, and try to disturb the roots as little as possible.",
        "Knock the plants out of their cups one by one.",
        "Remove a plant from its cup, transplant it, then move on to the next.",
        "Massage the root ball gently to encourage growth.",
        "After removing the cup, lightly massage the roots with your fingertips to loosen them from the soil.",
        "Don’t unravel the root ball, rub hard, or work away all of the soil.",
        "You just want to loosen the roots a bit to encourage them to spread out in their new home.",
        "Dig a hole equal in size to the plant's root ball.",
        "Dig a hole in the center of the soil bed large enough to accommodate the root ball.",
        "It should be deep enough so the crown (where the roots meet the stem) will be level with the top of the soil.",
        "Place the root ball in the hole, then fill in soil to level the surface.",
        "If you’re just growing one plant in an individual pot, you don’t have to worry about planning the arrangement or spacing other plants.",
        "Place the tallest plants in the middle, if you’re using a variety of plants.",
        "Start by scooping a hole in the center for the tallest plant.",
        "Place the root system in the hole so the plant’s crown is level with the top of the soil, then fill in the hole so the surface is even.",
        "For example, if you have tall grass, spiky Dracena, or phormium, plant it in the center of the pot.",
        "Provided you have a deep enough pot, azaleas, hibiscus, and elephant ears work well as tall focal points.",
        "Add smaller plants closer to the container’s edges.",
        "When you're finished with the tallest plant, work your way toward the edges as you you plant flowers, vines, or other smaller specimens.",
        "Create a middle layer of flowering or brightly-colored plants, and place vines that will spill out over the sides of the pot about 2 inches (5.1 cm) from the edges.",
        "Great filler plants include coleus, ajugas, and hostas.",
        "Petunias, salvias, pansies, and geraniums are popular choices that add pops of color.",
        "Good spillers, or plants with foliage that trails over the pot's edges, include creeping Jenny, clematis, English ivy, and sedum.",
        "Space the plants about 4 to 6 inches (10 to 15 cm) apart from each other, or according to the instructions on their tags.",
        "Don’t worry if the container looks a bit sparse.",
        "Your plants need room to grow, and they’ll fill in empty spaces within a few weeks.",
        "Soak the soil when you finish planting.",
        "Thoroughly soaking the soil will help prevent transplant shock.",
        "Water the container until the pot starts to drain and the top of the soil is saturated.",
        "Depending on the container’s size, it could take several minutes to water it completely.",
        "Water will drain from the bottom of the container, so be sure to place the pot on a saucer.",
        "Stop watering when you see water leaking from the drainage holes at the bottom.",
        "Room temperature water is ideal, especially for tropical plants, like elephant ear, bougainvillea, and orchids.",
        "If water from your hose or faucet feels ice cold, fill a pitcher or watering can and allow it to warm to room temperature.",
        "Tap water is usually fine, as long as you don't use water softeners.",
        "Water treated with softeners can cause salt buildup.",
        "Distilled water is best for carnivorous plants, like pitcher plants and Venus fly traps.",
        "They prefer low-nutrient soil and don't like the minerals in tap water.",
        "Caring for Your Plants Keep a saucer under the pot to catch drained water.",
        "A saucer will prevent dirty water from pooling on your floor, windowsill or desk.",
        "Empty the saucer about an hour after watering to prevent root rot.",
        "If the container is too heavy to lift and you can’t remove the saucer, use a bulb baster to suck up the water.",
        "Water the pot when the soil is dry or according to the tag’s instructions.",
        "The right amount of water depends on your plants, the size of your container, and whether you keep the pot indoors or outdoors.",
        "As a general rule, stick your finger into the soil and water only when it’s dry.",
        "If the soil is moist and your finger can easily penetrate it, don't water the pot.",
        "If the soil feels dry and your finger can't easily penetrate it, your plant needs water.",
        "For most plants, watering thoroughly and letting the soil dry completely is better than keeping the soil damp.",
        "Most flowering plants, fruits, vegetables, and herbs need to be watered daily.",
        "Cacti and other succulents should only be watered every 2 to 4 days at most.",
        "When in doubt, check your plants’ tags and water them as directed.",
        "Add slow-release fertilizer beads monthly, or as the tag recommends.",
        "Nutrients leech from the soil every time you water, so you’ll need to fertilize your potted plant regularly.",
        "All-purpose fertilizer beads that release nutrients over time are good for most plants, but you should check plant tags for specific instructions.",
        "Use about 1/2 teaspoon of fertilizer beads for 1 gallon (3.8 L) of soil.",
        "Spread the granules over the soil, and use your fingers or a small trowel to work it about 2 inches (5.1 cm) deep.",
        "In general, flowering plants, fruits, and vegetables need more nutrients than herbs and succulents.",
        "During mid-season, or when they produce ripe fruit, fertilize plants like tomatoes and peppers every 1 to 2 weeks.",
        "Keep an eye out for yellow leaves, which could indicate you're over-fertilizing.",
        "You don't have to be fussy about fertilizing herbs, like basil, cilantro, lavender, and rosemary.",
        "They're prone to over-fertilization, so 1 application every 3 to 4 months is best.",
        "Cacti and other succulents only need to be fertilized once or twice a year.",
        "Prune your plants whenever you see dead leaves.",
        "Use clean pruning shears to cut dead flowers and leaves.",
        "Trim them at a 45 degree angle just below the brown or dead area.",
        "Clip new growth at a 45 degree angle about ⁄2 inch (1.3 cm) above the nodule to keep a rapidly growing plant in check.",
        "The nodule looks like a small bump or bud where new growth emerges.",
        "If you’re clipping herbs or pruning a rapid grower, avoid removing more than 30%  of the plant at a time.",
        "Clipping too much can shock and kill the plant.",
        "Pruning encourages new growth and will lead to fuller, more robust plants.",
        "Cut off any part of the plant that has rot or fungus.",
        "In addition to regular pruning, you’ll need to remove diseased leaves as soon as you spot them.",
        "Signs of disease include black or brown spots, yellowing, white patches, and foul odor.",
        "If the problem persists, purchase an antifungal spray labelled for plants.",
        "Look for a fungicide formulated for your specific plant at a gardening center.",
        "Read its instructions, and apply it as directed.",
        "Common plant diseases include black or white fungal and bacterial blights, fungal rusts (which are characterized by a rust-colored coating), and cankers, or areas of dead, oozing tissue on wood stems.",
        "Apply insecticide, if the plant becomes infested with pests.",
        "If you need to deal with pests, look for a plant insecticide at a garden center.",
        "If you keep your plant indoors, make sure the product is labelled for houseplants.",
        "Read your product’s instructions and use it as directed.",
        "Most plant insecticides are recommended for specific plants, which are listed on the label.",
        "Check labels for your plants or ask an employee at the garden center for help.",
        "Common pests include aphids, ants, gnats, spider mites, and whiteflies.",
        "While aphids, ants, and flies are visible, mites are tough to spot.",
        "Look for patches of fine webbing with tiny, barely visible specks.",
        "Signs of mite infestation include tiny light green spots on leaves and stems, yellow discoloration, and curled or dead leaves."
    ]
}