{
    "title": "How to Make an Easy Bowl for Smoking",
    "url": "https://www.wikihow.com/Make-an-Easy-Bowl-for-Smoking",
    "category_hierarchy": [
        "Health",
        "Medicines and Drugs",
        "Recreational Drugs",
        "Smoking"
    ],
    "methods": [
        {
            "name": "Carving a Piece of Fruit",
            "steps": [
                {
                    "headline": "Find a fresh piece of fruit with a skin.",
                    "description": "Almost any piece of fruit can function as a bowl if you take the proper steps. The classic choice is the apple, but you can use a pear, squash, melon, or other solid fruit. Keep in mind that the fruit that you choose to use will influence the flavor of your smoke. Any fruit that can be peeled by hand, like a banana or orange, won’t make for the best bowl. Their insides tend to be too soft to make a bowl. People gravitate towards using apples as pipes because they tend to have the lowest influence on the smoke flavor-wise and are easy to work with. You shouldn’t eat the fruit after you’re done smoking out of it because you may swallow smoke or butane residue. Swallowing burnt tobacco is also quite bad for your stomach."
                },
                {
                    "headline": "Use a skewer to poke a hole into the side of your fruit.",
                    "description": "If you’re using an apple, set it down with the stem pointing up. Place the skewer halfway up the fruit and puncture the fruit with the tip of the skewer. If you’re using a cucumber or long piece of fruit, poke the hole in the middle of one end, not the center. You can disassemble a pen and use the case after washing it if you don’t have a skewer. You may have leftover debris or juice coming out of your fruit once you puncture it. Put a paper towel or cloth down underneath it if you want to make the cleanup process easier."
                },
                {
                    "headline": "Stick the skewer directly through the middle of the fruit.",
                    "description": "Push the skewer into the center of the fruit. Stop as soon as you hit the middle of the fruit. This will be directly under the stem if you’re using an apple. This can be kind of hard to do since you can’t see inside of the fruit, but you can always come back and fix your first hole when you’re done."
                },
                {
                    "headline": "Poke the skewer through the top of the fruit to form a 90-degree tunnel.",
                    "description": "Place your skewer directly over the center of the fruit from the top. Brace the fruit with your nondominant hand and carefully puncture the fruit from above. Push the skewer through until you reach the first hole that you made. You can rub the skewer around in both holes if you want to clear the tunnel out and make it wider. If you’re using an apple, place the hole on the side of the stem or snip the stem with some scissors before puncturing the fruit. If you don’t feel the 2 tunnels connecting, go back to your first incision and continue hollowing it out until you see the skewer from the top of the fruit."
                },
                {
                    "headline": "Use a small knife or spoon to carve a bowl out of the top.",
                    "description": "You can either carve a 1–2 in (2.5–5.1 cm) cone into the top of the fruit or you can scoop out some fruit with a teaspoon. Place your bowl directly over the center of the vertical tunnel in the fruit. Discard any excess food waste.Tip: The thicker your tobacco is, the bigger you can make your bowl. If you have extremely fine shag, make your bowl smaller."
                },
                {
                    "headline": "Fill the top of your fruit with tobacco and inhale from the side.",
                    "description": "Place your tobacco in the bowl that you carved with your spoon or knife. Lift the fruit up and place your lips around the other hole on the side of your fruit. Use a lighter to ignite the tobacco on top while inhaling at the same time. Release your lighter 1-2 seconds before you’re done inhaling and enjoy your smoke! You may need to pat the tobacco down into the bowl a little bit to keep it from floating away if it’s windy out."
                }
            ]
        },
        {
            "name": "Making a Water Bottle Bowl",
            "steps": [
                {
                    "headline": "Get a 12–16  fl oz (0.35–0.47 L) plastic water bottle.",
                    "description": "If any liquid other than water was stored in your bottle, avoid using it. It’s dangerous to inhale sugar and there may still be residue on the inside of your bottle, even if you wash it. You can use a 2 L (68  fl oz) bottle if you don’t have access to a smaller bottle. The hit from a water bottle will be incredibly strong, so don’t overdo it if you smoke tobacco out of a water bottle. If your bottle has water in it, empty it out and then wait for it to dry out before constructing your bowl."
                },
                {
                    "headline": "Punch a hole in the side of the bottle near the bottom with the tip of a pen.",
                    "description": "Keep the cap on your water bottle. Use the tip of a ball point pen to puncture a hole in the side of your bottle. Place the hole near the bottom 2–4 in (5.1–10.2 cm) of the bottle. You can use a small knife to make the initial puncture if you want, but be careful to not make your hole bigger than the width of your pen. You’re going to use the case of the plastic pen as the stem for your bowl, so using the pen to puncture the bowl will ensure that the pen fits into the hole."
                },
                {
                    "headline": "Place a second hole 2–4 in (5.1–10.2 cm) on the side near your first hole.",
                    "description": "Use a small knife to puncture a small hole a few inches next to your first hole. This will be your carb hole. When smoking, you will cover this hole with your finger to fill the bottle with smoke. Then, you will lift your finger to introduce air and make it easy to inhale the smoke. You’re going to have a hard time inhaling if there isn’t some air flow in the bottle after the tobacco burns."
                },
                {
                    "headline": "Disassemble your pen and wash the case out.",
                    "description": "Remove the ball point by pulling it out and pop the bottom cap of the pen off by hand or with a small knife. Remove any coils or internal components. Wash the case of the pen under warm water to rinse off any residue or ink. If you use soap, you have to rinse the inside of the pen for 5-10 minutes and use a cotton swab to clear all soap residue from the inside of the case. A cheap ballpoint pen works best since they’re usually really easy to take apart by hand. You may need to remove the tip with pliers if it’s glued in. Once you make the hole for your stem, you don’t need it so don’t worry about breaking it."
                },
                {
                    "headline": "Slide the pen case into the first hole that you made.",
                    "description": "Push the case of the pen through the first hole that you made with the tip of your pen. The seal should be airtight since the pen was what you used to make the hole. Slide the pen case in at a downward angle to wedge it in the bottom corner of the bottle.Warning: If the seal isn’t air tight, hold a cotton ball around the hole where air is escaping when you’re smoking. You can’t use tape, since the adhesive is toxic when it is inhaled."
                },
                {
                    "headline": "Put a socket over the top of the pen to create your bowl.",
                    "description": "Get a 7/32 socket from a hardware store and rinse it under water for 3-4 seconds to get the dust off. The socket cannot be painted and must be entirely made out of stainless steel, brass, or titanium. Anything with a coating or paint on it cannot be used. Place the small opening on the socket on top of the exposed opening on your pen. This will function as your bowl. A 7/32 socket will fit perfectly over a standard pen. If you don’t have a clean, unfinished socket, you can use the metal tip of a pen by flipping it around upside down into the opening of your pen case."
                },
                {
                    "headline": "Fill the socket with tobacco and put a finger on the carb hole to smoke.",
                    "description": "Pack some tobacco into the socket. Pat it down a little and tilt the bottle up to your lips. Take the cap off of the bottle if you haven’t already and put your lips around it. Light the bowl with a lighter while your finger sits over the carb hole and inhale a little. Remove your finger from the carb hole after you’re done lighting the tobacco and inhale deeply to bring the smoke into your lungs. You can reuse the water bottle 2-3 times if you want, but the flavor of the tobacco will begin to taste  kind of funny after more than a few uses. You may have some tobacco fall through into the water bottle. This isn’t a big deal though, and it won’t really affect the smoking process."
                }
            ]
        }
    ],
    "tyn": [
        "Carving a Piece of Fruit",
        "Skewer",
        "Knife or spoon",
        "Making a Water Bottle Bowl",
        "Water bottle",
        "Pen",
        "7/32 socket",
        "Knife (optional)"
    ],
    "text": " Carving a Piece of Fruit Find a fresh piece of fruit with a skin. Almost any piece of fruit can function as a bowl if you take the proper steps. The classic choice is the apple, but you can use a pear, squash, melon, or other solid fruit. Keep in mind that the fruit that you choose to use will influence the flavor of your smoke. Any fruit that can be peeled by hand, like a banana or orange, won’t make for the best bowl. Their insides tend to be too soft to make a bowl. People gravitate towards using apples as pipes because they tend to have the lowest influence on the smoke flavor-wise and are easy to work with. You shouldn’t eat the fruit after you’re done smoking out of it because you may swallow smoke or butane residue. Swallowing burnt tobacco is also quite bad for your stomach. Use a skewer to poke a hole into the side of your fruit. If you’re using an apple, set it down with the stem pointing up. Place the skewer halfway up the fruit and puncture the fruit with the tip of the skewer. If you’re using a cucumber or long piece of fruit, poke the hole in the middle of one end, not the center. You can disassemble a pen and use the case after washing it if you don’t have a skewer. You may have leftover debris or juice coming out of your fruit once you puncture it. Put a paper towel or cloth down underneath it if you want to make the cleanup process easier. Stick the skewer directly through the middle of the fruit. Push the skewer into the center of the fruit. Stop as soon as you hit the middle of the fruit. This will be directly under the stem if you’re using an apple. This can be kind of hard to do since you can’t see inside of the fruit, but you can always come back and fix your first hole when you’re done. Poke the skewer through the top of the fruit to form a 90-degree tunnel. Place your skewer directly over the center of the fruit from the top. Brace the fruit with your nondominant hand and carefully puncture the fruit from above. Push the skewer through until you reach the first hole that you made. You can rub the skewer around in both holes if you want to clear the tunnel out and make it wider. If you’re using an apple, place the hole on the side of the stem or snip the stem with some scissors before puncturing the fruit. If you don’t feel the 2 tunnels connecting, go back to your first incision and continue hollowing it out until you see the skewer from the top of the fruit. Use a small knife or spoon to carve a bowl out of the top. You can either carve a 1–2 in (2.5–5.1 cm) cone into the top of the fruit or you can scoop out some fruit with a teaspoon. Place your bowl directly over the center of the vertical tunnel in the fruit. Discard any excess food waste.Tip: The thicker your tobacco is, the bigger you can make your bowl. If you have extremely fine shag, make your bowl smaller. Fill the top of your fruit with tobacco and inhale from the side. Place your tobacco in the bowl that you carved with your spoon or knife. Lift the fruit up and place your lips around the other hole on the side of your fruit. Use a lighter to ignite the tobacco on top while inhaling at the same time. Release your lighter 1-2 seconds before you’re done inhaling and enjoy your smoke! You may need to pat the tobacco down into the bowl a little bit to keep it from floating away if it’s windy out. Making a Water Bottle Bowl Get a 12–16  fl oz (0.35–0.47 L) plastic water bottle. If any liquid other than water was stored in your bottle, avoid using it. It’s dangerous to inhale sugar and there may still be residue on the inside of your bottle, even if you wash it. You can use a 2 L (68  fl oz) bottle if you don’t have access to a smaller bottle. The hit from a water bottle will be incredibly strong, so don’t overdo it if you smoke tobacco out of a water bottle. If your bottle has water in it, empty it out and then wait for it to dry out before constructing your bowl. Punch a hole in the side of the bottle near the bottom with the tip of a pen. Keep the cap on your water bottle. Use the tip of a ball point pen to puncture a hole in the side of your bottle. Place the hole near the bottom 2–4 in (5.1–10.2 cm) of the bottle. You can use a small knife to make the initial puncture if you want, but be careful to not make your hole bigger than the width of your pen. You’re going to use the case of the plastic pen as the stem for your bowl, so using the pen to puncture the bowl will ensure that the pen fits into the hole. Place a second hole 2–4 in (5.1–10.2 cm) on the side near your first hole. Use a small knife to puncture a small hole a few inches next to your first hole. This will be your carb hole. When smoking, you will cover this hole with your finger to fill the bottle with smoke. Then, you will lift your finger to introduce air and make it easy to inhale the smoke. You’re going to have a hard time inhaling if there isn’t some air flow in the bottle after the tobacco burns. Disassemble your pen and wash the case out. Remove the ball point by pulling it out and pop the bottom cap of the pen off by hand or with a small knife. Remove any coils or internal components. Wash the case of the pen under warm water to rinse off any residue or ink. If you use soap, you have to rinse the inside of the pen for 5-10 minutes and use a cotton swab to clear all soap residue from the inside of the case. A cheap ballpoint pen works best since they’re usually really easy to take apart by hand. You may need to remove the tip with pliers if it’s glued in. Once you make the hole for your stem, you don’t need it so don’t worry about breaking it. Slide the pen case into the first hole that you made. Push the case of the pen through the first hole that you made with the tip of your pen. The seal should be airtight since the pen was what you used to make the hole. Slide the pen case in at a downward angle to wedge it in the bottom corner of the bottle.Warning: If the seal isn’t air tight, hold a cotton ball around the hole where air is escaping when you’re smoking. You can’t use tape, since the adhesive is toxic when it is inhaled. Put a socket over the top of the pen to create your bowl. Get a 7/32 socket from a hardware store and rinse it under water for 3-4 seconds to get the dust off. The socket cannot be painted and must be entirely made out of stainless steel, brass, or titanium. Anything with a coating or paint on it cannot be used. Place the small opening on the socket on top of the exposed opening on your pen. This will function as your bowl. A 7/32 socket will fit perfectly over a standard pen. If you don’t have a clean, unfinished socket, you can use the metal tip of a pen by flipping it around upside down into the opening of your pen case. Fill the socket with tobacco and put a finger on the carb hole to smoke. Pack some tobacco into the socket. Pat it down a little and tilt the bottle up to your lips. Take the cap off of the bottle if you haven’t already and put your lips around it. Light the bowl with a lighter while your finger sits over the carb hole and inhale a little. Remove your finger from the carb hole after you’re done lighting the tobacco and inhale deeply to bring the smoke into your lungs. You can reuse the water bottle 2-3 times if you want, but the flavor of the tobacco will begin to taste  kind of funny after more than a few uses. You may have some tobacco fall through into the water bottle. This isn’t a big deal though, and it won’t really affect the smoking process.",
    "sentences": [
        " Carving a Piece of Fruit Find a fresh piece of fruit with a skin.",
        "Almost any piece of fruit can function as a bowl if you take the proper steps.",
        "The classic choice is the apple, but you can use a pear, squash, melon, or other solid fruit.",
        "Keep in mind that the fruit that you choose to use will influence the flavor of your smoke.",
        "Any fruit that can be peeled by hand, like a banana or orange, won’t make for the best bowl.",
        "Their insides tend to be too soft to make a bowl.",
        "People gravitate towards using apples as pipes because they tend to have the lowest influence on the smoke flavor-wise and are easy to work with.",
        "You shouldn’t eat the fruit after you’re done smoking out of it because you may swallow smoke or butane residue.",
        "Swallowing burnt tobacco is also quite bad for your stomach.",
        "Use a skewer to poke a hole into the side of your fruit.",
        "If you’re using an apple, set it down with the stem pointing up.",
        "Place the skewer halfway up the fruit and puncture the fruit with the tip of the skewer.",
        "If you’re using a cucumber or long piece of fruit, poke the hole in the middle of one end, not the center.",
        "You can disassemble a pen and use the case after washing it if you don’t have a skewer.",
        "You may have leftover debris or juice coming out of your fruit once you puncture it.",
        "Put a paper towel or cloth down underneath it if you want to make the cleanup process easier.",
        "Stick the skewer directly through the middle of the fruit.",
        "Push the skewer into the center of the fruit.",
        "Stop as soon as you hit the middle of the fruit.",
        "This will be directly under the stem if you’re using an apple.",
        "This can be kind of hard to do since you can’t see inside of the fruit, but you can always come back and fix your first hole when you’re done.",
        "Poke the skewer through the top of the fruit to form a 90-degree tunnel.",
        "Place your skewer directly over the center of the fruit from the top.",
        "Brace the fruit with your nondominant hand and carefully puncture the fruit from above.",
        "Push the skewer through until you reach the first hole that you made.",
        "You can rub the skewer around in both holes if you want to clear the tunnel out and make it wider.",
        "If you’re using an apple, place the hole on the side of the stem or snip the stem with some scissors before puncturing the fruit.",
        "If you don’t feel the 2 tunnels connecting, go back to your first incision and continue hollowing it out until you see the skewer from the top of the fruit.",
        "Use a small knife or spoon to carve a bowl out of the top.",
        "You can either carve a 1–2 in (2.5–5.1 cm) cone into the top of the fruit or you can scoop out some fruit with a teaspoon.",
        "Place your bowl directly over the center of the vertical tunnel in the fruit.",
        "Discard any excess food waste.Tip: The thicker your tobacco is, the bigger you can make your bowl.",
        "If you have extremely fine shag, make your bowl smaller.",
        "Fill the top of your fruit with tobacco and inhale from the side.",
        "Place your tobacco in the bowl that you carved with your spoon or knife.",
        "Lift the fruit up and place your lips around the other hole on the side of your fruit.",
        "Use a lighter to ignite the tobacco on top while inhaling at the same time.",
        "Release your lighter 1-2 seconds before you’re done inhaling and enjoy your smoke!",
        "You may need to pat the tobacco down into the bowl a little bit to keep it from floating away if it’s windy out.",
        "Making a Water Bottle Bowl Get a 12–16  fl oz (0.35–0.47 L) plastic water bottle.",
        "If any liquid other than water was stored in your bottle, avoid using it.",
        "It’s dangerous to inhale sugar and there may still be residue on the inside of your bottle, even if you wash it.",
        "You can use a 2 L (68  fl oz) bottle if you don’t have access to a smaller bottle.",
        "The hit from a water bottle will be incredibly strong, so don’t overdo it if you smoke tobacco out of a water bottle.",
        "If your bottle has water in it, empty it out and then wait for it to dry out before constructing your bowl.",
        "Punch a hole in the side of the bottle near the bottom with the tip of a pen.",
        "Keep the cap on your water bottle.",
        "Use the tip of a ball point pen to puncture a hole in the side of your bottle.",
        "Place the hole near the bottom 2–4 in (5.1–10.2 cm) of the bottle.",
        "You can use a small knife to make the initial puncture if you want, but be careful to not make your hole bigger than the width of your pen.",
        "You’re going to use the case of the plastic pen as the stem for your bowl, so using the pen to puncture the bowl will ensure that the pen fits into the hole.",
        "Place a second hole 2–4 in (5.1–10.2 cm) on the side near your first hole.",
        "Use a small knife to puncture a small hole a few inches next to your first hole.",
        "This will be your carb hole.",
        "When smoking, you will cover this hole with your finger to fill the bottle with smoke.",
        "Then, you will lift your finger to introduce air and make it easy to inhale the smoke.",
        "You’re going to have a hard time inhaling if there isn’t some air flow in the bottle after the tobacco burns.",
        "Disassemble your pen and wash the case out.",
        "Remove the ball point by pulling it out and pop the bottom cap of the pen off by hand or with a small knife.",
        "Remove any coils or internal components.",
        "Wash the case of the pen under warm water to rinse off any residue or ink.",
        "If you use soap, you have to rinse the inside of the pen for 5-10 minutes and use a cotton swab to clear all soap residue from the inside of the case.",
        "A cheap ballpoint pen works best since they’re usually really easy to take apart by hand.",
        "You may need to remove the tip with pliers if it’s glued in.",
        "Once you make the hole for your stem, you don’t need it so don’t worry about breaking it.",
        "Slide the pen case into the first hole that you made.",
        "Push the case of the pen through the first hole that you made with the tip of your pen.",
        "The seal should be airtight since the pen was what you used to make the hole.",
        "Slide the pen case in at a downward angle to wedge it in the bottom corner of the bottle.Warning: If the seal isn’t air tight, hold a cotton ball around the hole where air is escaping when you’re smoking.",
        "You can’t use tape, since the adhesive is toxic when it is inhaled.",
        "Put a socket over the top of the pen to create your bowl.",
        "Get a 7/32 socket from a hardware store and rinse it under water for 3-4 seconds to get the dust off.",
        "The socket cannot be painted and must be entirely made out of stainless steel, brass, or titanium.",
        "Anything with a coating or paint on it cannot be used.",
        "Place the small opening on the socket on top of the exposed opening on your pen.",
        "This will function as your bowl.",
        "A 7/32 socket will fit perfectly over a standard pen.",
        "If you don’t have a clean, unfinished socket, you can use the metal tip of a pen by flipping it around upside down into the opening of your pen case.",
        "Fill the socket with tobacco and put a finger on the carb hole to smoke.",
        "Pack some tobacco into the socket.",
        "Pat it down a little and tilt the bottle up to your lips.",
        "Take the cap off of the bottle if you haven’t already and put your lips around it.",
        "Light the bowl with a lighter while your finger sits over the carb hole and inhale a little.",
        "Remove your finger from the carb hole after you’re done lighting the tobacco and inhale deeply to bring the smoke into your lungs.",
        "You can reuse the water bottle 2-3 times if you want, but the flavor of the tobacco will begin to taste  kind of funny after more than a few uses.",
        "You may have some tobacco fall through into the water bottle.",
        "This isn’t a big deal though, and it won’t really affect the smoking process."
    ]
}