{
    "title": "How to Transfer a Document to an Amazon Kindle Device (Through a USB Cable)",
    "url": "https://www.wikihow.com/Transfer-a-Document-to-an-Amazon-Kindle-Device-(Through-a-USB-Cable)",
    "category_hierarchy": [
        "Finance and Business",
        "Shopping",
        "Shopping Online",
        "Amazon"
    ],
    "steps": [
        {
            "headline": "Turn on and login to your account on your computer.",
            "description": ""
        },
        {
            "headline": "Use the wire that is supplied with your Kindle, to connect your Kindle to your computer.",
            "description": "Along with the normal AutoStart options and driver-loading your PC will do, when it sees your device, it will load the top-level folder."
        },
        {
            "headline": "Locate your My Documents folder, or the storage place of the document you'd like to transfer.",
            "description": "Most PDFs along with TXT (Microsoft Word) documents will transfer easily and correctly without the need to convert to Kindle format (as long as you don't mind the inability to highlight and select single words to take notes or create highlights in the book/document). Open this folder as a separate process, in its own window on the screen, so you can later drag files between these two places."
        },
        {
            "headline": "Select the files you'd like to copy over to your Kindle device.",
            "description": ""
        },
        {
            "headline": "Copy or cut the files using the Copy (Ctrl+C) or Cut (Ctrl+X, to move) commands, to move these files between your computer and the device.",
            "description": ""
        },
        {
            "headline": "Click the window that represents your Kindle device's imaginary drive.",
            "description": ""
        },
        {
            "headline": "Right click anywhere on this window on your computer.",
            "description": ""
        },
        {
            "headline": "Click the \"Paste\" command from the list that is displayed.",
            "description": ""
        },
        {
            "headline": "Allow a few moments, for the folders to update, and to either move or copy the files between the selected storage locations.",
            "description": ""
        },
        {
            "headline": "Disconnect the Kindle's cord from the computer, when the computer tells you that the process has been completed, whether that be with its own message, or the fact that there is no longer a box in plain sight.",
            "description": ""
        }
    ],
    "tyn": [
        "Amazon Kindle",
        "Amazon Kindle transfer cable (USB)",
        "PC or Macintosh computer",
        "applicable files to transmit"
    ],
    "text": " Turn on and login to your account on your computer.  Use the wire that is supplied with your Kindle, to connect your Kindle to your computer. Along with the normal AutoStart options and driver-loading your PC will do, when it sees your device, it will load the top-level folder. Locate your My Documents folder, or the storage place of the document you'd like to transfer. Most PDFs along with TXT (Microsoft Word) documents will transfer easily and correctly without the need to convert to Kindle format (as long as you don't mind the inability to highlight and select single words to take notes or create highlights in the book/document). Open this folder as a separate process, in its own window on the screen, so you can later drag files between these two places. Select the files you'd like to copy over to your Kindle device.  Copy or cut the files using the Copy (Ctrl+C) or Cut (Ctrl+X, to move) commands, to move these files between your computer and the device.  Click the window that represents your Kindle device's imaginary drive.  Right click anywhere on this window on your computer.  Click the \"Paste\" command from the list that is displayed.  Allow a few moments, for the folders to update, and to either move or copy the files between the selected storage locations.  Disconnect the Kindle's cord from the computer, when the computer tells you that the process has been completed, whether that be with its own message, or the fact that there is no longer a box in plain sight. ",
    "sentences": [
        " Turn on and login to your account on your computer.",
        "Use the wire that is supplied with your Kindle, to connect your Kindle to your computer.",
        "Along with the normal AutoStart options and driver-loading your PC will do, when it sees your device, it will load the top-level folder.",
        "Locate your My Documents folder, or the storage place of the document you'd like to transfer.",
        "Most PDFs along with TXT (Microsoft Word) documents will transfer easily and correctly without the need to convert to Kindle format (as long as you don't mind the inability to highlight and select single words to take notes or create highlights in the book/document).",
        "Open this folder as a separate process, in its own window on the screen, so you can later drag files between these two places.",
        "Select the files you'd like to copy over to your Kindle device.",
        "Copy or cut the files using the Copy (Ctrl+C) or Cut (Ctrl+X, to move) commands, to move these files between your computer and the device.",
        "Click the window that represents your Kindle device's imaginary drive.",
        "Right click anywhere on this window on your computer.",
        "Click the \"Paste\" command from the list that is displayed.",
        "Allow a few moments, for the folders to update, and to either move or copy the files between the selected storage locations.",
        "Disconnect the Kindle's cord from the computer, when the computer tells you that the process has been completed, whether that be with its own message, or the fact that there is no longer a box in plain sight."
    ]
}