{
    "title": "How to Make Kahlua",
    "url": "https://www.wikihow.com/Make-Kahlua",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Alcoholic Drinks",
        "Spirits and Liqueurs"
    ],
    "methods": [
        {
            "name": "Using Instant Coffee",
            "steps": [
                {
                    "headline": "Create a sweetened coffee base.",
                    "description": "To start, bring 2 cups of water to a full boil. Remove the pan from the heat, add 1 cup of dry, instant coffee, 3 1/2 cups of white sugar, and stir until everything is completely dissolved. If your diet restricts you from consuming processed, white sugar, you can easily substitute brown sugar or your favorite type of refined sugar substitute. There are dozens of recipes out there and plenty use other varieties of sugar."
                },
                {
                    "headline": "Use a cooking thermometer to take the temperature of the water.",
                    "description": "While water boils at 212 degrees F (100 degrees C), alcohol boils at around 172 degrees F (78 degrees C). Wait for your temperature to drop below 172 degrees before adding rum or you will be very disappointed by your Kahlua. If you don't have a cooking thermometer, your best bet is to wait about 15 or 20 minutes for it to cool down. Always err on the safer, cooler side in this situation and wait longer if you're unsure (and it still seems hot)."
                },
                {
                    "headline": "Add 2 cups of rum and stir.",
                    "description": "What kind of rum? Well, that's up to you. Generally, it's safe to go middle-of-the-road on this part. You don't want to waste your top-shelf rum on making a Kahlua substitute, but you also don't want it to taste like mouthwash either. Any generic rum will do the trick. You'll notice that the next recipe contains vodka. If you're a bigger vodka fan, you could keep to this recipe if you'd like and switch out the rum for the vodka, no problem. And if you have time and the supplies, why not try both and see which you like better?"
                },
                {
                    "headline": "Pour your Kahlua into a 1-quart, sealable glass container.",
                    "description": "Add the vanilla bean to the container and store in the fridge for at least 30 days to age the flavor. You read that right – to make Kahlua that way your mouth pictures it, it has to be aged. That being said, recipe #3 on this guide is an instant Kahlua you can use right away, though it won't taste the same. The vanilla needs time to infuse in to give it that essential Kahlua flavor. Vanilla extract can be substituted, but do note that the Kahlua won't have the same rich, aged flavor."
                },
                {
                    "headline": "Label your container.",
                    "description": "Attach a label to the container identifying its contents and the date it was made. That way no one mistakes it for soda! What's more, you may not remember when the 30 days is up, and a note keeps you from guessing."
                }
            ]
        },
        {
            "name": "Using Brewed Coffee",
            "steps": [
                {
                    "headline": "Brew a pot of strong, good quality coffee.",
                    "description": "To get that rich Kahlua flavor, you'll want a good-quality base. And it should be strong, too – a weak coffee won't transport the flavors into the final product. Once brewed, prepare to use the coffee immediately. If you're not so great at brewing a decent pot of coffee (it is definitely harder than it looks), you may wish to have a coffee aficionado do this for you. It can make a world of difference."
                },
                {
                    "headline": "Add 4 cups of sugar to the fresh, hot coffee and stir until dissolved.",
                    "description": "Once the pot has seen its final drips, transport it over to a large bowl. Then, add in 4 cups of granulated sugar and mix in until the little granules are all dissolved. Again, you could use brown sugar or raw sugar if you like. Just know that each little change will affect the flavor and it may or may not be to your liking."
                },
                {
                    "headline": "Add the vodka once the coffee mixture has cooled to room temperature.",
                    "description": "Once the sugar has dissolved and the coffee isn't warm anymore, add the vodka, stirring to combine. Some bartenders believe in a combination of vodka and rum, or even different types of vodka or different types of rum within the same recipe to give it a fuller flavor. If you have the end of a few bottles laying around, try combining them – it may not hurt."
                },
                {
                    "headline": "Add the vanilla and pour the mixture into bottles.",
                    "description": "Three 12 oz bottles will work well, but one large bottle works, too. Cut the vanilla bean into thirds and drop one piece into each bottle. After that, put the cap on. Your Kahlua is made. At this point, you could also add in a cinnamon stick, cocoa nibs (about a tablespoon), or orange peel, if you like. This will give it a more signature, dynamic flavor."
                },
                {
                    "headline": "Store in a cool, dry place for 2-3 weeks.",
                    "description": "The vanilla needs this much time to infuse and the flavors need to settle into the coffee to give it that rich, liqueur flavor. Once the time is up, strain it beforehand and then rebottle. The basement or cellar is good for this stuff, but a closed box in a dark room (or under the bed) will work just as well. Just make sure it has a label on it in case you forget what that mysterious dark bottle is in six months' time."
                }
            ]
        },
        {
            "name": "Making Ready-to-Use Kahlua",
            "steps": [
                {
                    "headline": "In a large pot over medium heat, combine the water, sugar, and coffee crystals.",
                    "description": "Don't feel like scrolling up? That was 2 cups of water, 4 cups of sugar, and 3/4 cup instant coffee crystals. Keep stirring until everything dissolves and is one uniform, smooth consistency. If you're worried about your insta-Kahlua being a little lacking (generally the ones that take more time have a bit more flavor), you could consider adding a few cocoa nibs to give it a tang of chocolate to make the flavor more dynamic."
                },
                {
                    "headline": "Let it cool.",
                    "description": "Once everything has dissolved, take it off the heat and let the mixture cool to room temperature. This should take 15-20 minutes. A thermometer works well for this, but you could always take taste tests instead to find out!"
                },
                {
                    "headline": "Add the vodka and vanilla and stir well.",
                    "description": "When the concoction reaches room temperature, add 2 1/4 cups of vodka (average quality is best), 2 1/2 tsp of vanilla extract and stir well. Bingo – your homemade coffee liqueur is made and ready for consumption. If your guests aren't going to go hog wild over it at the pot, pour the mixture into bottles (three 12 oz. bottles works well) to keep for later. But do know that this recipe is supposed to be enjoyed immediately, so take advantage of not having to wait 2 weeks for infusion!"
                }
            ]
        }
    ],
    "tyn": [
        "1-quart seal-able glass container or 3 12 oz. bottles",
        "Cooking thermometer",
        "Pot",
        "Wooden spoon",
        "Measuring cups",
        "Labels (optional)"
    ],
    "text": " Using Instant Coffee Create a sweetened coffee base. To start, bring 2 cups of water to a full boil. Remove the pan from the heat, add 1 cup of dry, instant coffee, 3 1/2 cups of white sugar, and stir until everything is completely dissolved. If your diet restricts you from consuming processed, white sugar, you can easily substitute brown sugar or your favorite type of refined sugar substitute. There are dozens of recipes out there and plenty use other varieties of sugar. Use a cooking thermometer to take the temperature of the water. While water boils at 212 degrees F (100 degrees C), alcohol boils at around 172 degrees F (78 degrees C). Wait for your temperature to drop below 172 degrees before adding rum or you will be very disappointed by your Kahlua. If you don't have a cooking thermometer, your best bet is to wait about 15 or 20 minutes for it to cool down. Always err on the safer, cooler side in this situation and wait longer if you're unsure (and it still seems hot). Add 2 cups of rum and stir. What kind of rum? Well, that's up to you. Generally, it's safe to go middle-of-the-road on this part. You don't want to waste your top-shelf rum on making a Kahlua substitute, but you also don't want it to taste like mouthwash either. Any generic rum will do the trick. You'll notice that the next recipe contains vodka. If you're a bigger vodka fan, you could keep to this recipe if you'd like and switch out the rum for the vodka, no problem. And if you have time and the supplies, why not try both and see which you like better? Pour your Kahlua into a 1-quart, sealable glass container. Add the vanilla bean to the container and store in the fridge for at least 30 days to age the flavor. You read that right – to make Kahlua that way your mouth pictures it, it has to be aged. That being said, recipe #3 on this guide is an instant Kahlua you can use right away, though it won't taste the same. The vanilla needs time to infuse in to give it that essential Kahlua flavor. Vanilla extract can be substituted, but do note that the Kahlua won't have the same rich, aged flavor. Label your container. Attach a label to the container identifying its contents and the date it was made. That way no one mistakes it for soda! What's more, you may not remember when the 30 days is up, and a note keeps you from guessing. Using Brewed Coffee Brew a pot of strong, good quality coffee. To get that rich Kahlua flavor, you'll want a good-quality base. And it should be strong, too – a weak coffee won't transport the flavors into the final product. Once brewed, prepare to use the coffee immediately. If you're not so great at brewing a decent pot of coffee (it is definitely harder than it looks), you may wish to have a coffee aficionado do this for you. It can make a world of difference. Add 4 cups of sugar to the fresh, hot coffee and stir until dissolved. Once the pot has seen its final drips, transport it over to a large bowl. Then, add in 4 cups of granulated sugar and mix in until the little granules are all dissolved. Again, you could use brown sugar or raw sugar if you like. Just know that each little change will affect the flavor and it may or may not be to your liking. Add the vodka once the coffee mixture has cooled to room temperature. Once the sugar has dissolved and the coffee isn't warm anymore, add the vodka, stirring to combine. Some bartenders believe in a combination of vodka and rum, or even different types of vodka or different types of rum within the same recipe to give it a fuller flavor. If you have the end of a few bottles laying around, try combining them – it may not hurt. Add the vanilla and pour the mixture into bottles. Three 12 oz bottles will work well, but one large bottle works, too. Cut the vanilla bean into thirds and drop one piece into each bottle. After that, put the cap on. Your Kahlua is made. At this point, you could also add in a cinnamon stick, cocoa nibs (about a tablespoon), or orange peel, if you like. This will give it a more signature, dynamic flavor. Store in a cool, dry place for 2-3 weeks. The vanilla needs this much time to infuse and the flavors need to settle into the coffee to give it that rich, liqueur flavor. Once the time is up, strain it beforehand and then rebottle. The basement or cellar is good for this stuff, but a closed box in a dark room (or under the bed) will work just as well. Just make sure it has a label on it in case you forget what that mysterious dark bottle is in six months' time. Making Ready-to-Use Kahlua In a large pot over medium heat, combine the water, sugar, and coffee crystals. Don't feel like scrolling up? That was 2 cups of water, 4 cups of sugar, and 3/4 cup instant coffee crystals. Keep stirring until everything dissolves and is one uniform, smooth consistency. If you're worried about your insta-Kahlua being a little lacking (generally the ones that take more time have a bit more flavor), you could consider adding a few cocoa nibs to give it a tang of chocolate to make the flavor more dynamic. Let it cool. Once everything has dissolved, take it off the heat and let the mixture cool to room temperature. This should take 15-20 minutes. A thermometer works well for this, but you could always take taste tests instead to find out! Add the vodka and vanilla and stir well. When the concoction reaches room temperature, add 2 1/4 cups of vodka (average quality is best), 2 1/2 tsp of vanilla extract and stir well. Bingo – your homemade coffee liqueur is made and ready for consumption. If your guests aren't going to go hog wild over it at the pot, pour the mixture into bottles (three 12 oz. bottles works well) to keep for later. But do know that this recipe is supposed to be enjoyed immediately, so take advantage of not having to wait 2 weeks for infusion!",
    "sentences": [
        " Using Instant Coffee Create a sweetened coffee base.",
        "To start, bring 2 cups of water to a full boil.",
        "Remove the pan from the heat, add 1 cup of dry, instant coffee, 3 1/2 cups of white sugar, and stir until everything is completely dissolved.",
        "If your diet restricts you from consuming processed, white sugar, you can easily substitute brown sugar or your favorite type of refined sugar substitute.",
        "There are dozens of recipes out there and plenty use other varieties of sugar.",
        "Use a cooking thermometer to take the temperature of the water.",
        "While water boils at 212 degrees F (100 degrees C), alcohol boils at around 172 degrees F (78 degrees C).",
        "Wait for your temperature to drop below 172 degrees before adding rum or you will be very disappointed by your Kahlua.",
        "If you don't have a cooking thermometer, your best bet is to wait about 15 or 20 minutes for it to cool down.",
        "Always err on the safer, cooler side in this situation and wait longer if you're unsure (and it still seems hot).",
        "Add 2 cups of rum and stir.",
        "What kind of rum?",
        "Well, that's up to you.",
        "Generally, it's safe to go middle-of-the-road on this part.",
        "You don't want to waste your top-shelf rum on making a Kahlua substitute, but you also don't want it to taste like mouthwash either.",
        "Any generic rum will do the trick.",
        "You'll notice that the next recipe contains vodka.",
        "If you're a bigger vodka fan, you could keep to this recipe if you'd like and switch out the rum for the vodka, no problem.",
        "And if you have time and the supplies, why not try both and see which you like better?",
        "Pour your Kahlua into a 1-quart, sealable glass container.",
        "Add the vanilla bean to the container and store in the fridge for at least 30 days to age the flavor.",
        "You read that right – to make Kahlua that way your mouth pictures it, it has to be aged.",
        "That being said, recipe #3 on this guide is an instant Kahlua you can use right away, though it won't taste the same.",
        "The vanilla needs time to infuse in to give it that essential Kahlua flavor.",
        "Vanilla extract can be substituted, but do note that the Kahlua won't have the same rich, aged flavor.",
        "Label your container.",
        "Attach a label to the container identifying its contents and the date it was made.",
        "That way no one mistakes it for soda!",
        "What's more, you may not remember when the 30 days is up, and a note keeps you from guessing.",
        "Using Brewed Coffee Brew a pot of strong, good quality coffee.",
        "To get that rich Kahlua flavor, you'll want a good-quality base.",
        "And it should be strong, too – a weak coffee won't transport the flavors into the final product.",
        "Once brewed, prepare to use the coffee immediately.",
        "If you're not so great at brewing a decent pot of coffee (it is definitely harder than it looks), you may wish to have a coffee aficionado do this for you.",
        "It can make a world of difference.",
        "Add 4 cups of sugar to the fresh, hot coffee and stir until dissolved.",
        "Once the pot has seen its final drips, transport it over to a large bowl.",
        "Then, add in 4 cups of granulated sugar and mix in until the little granules are all dissolved.",
        "Again, you could use brown sugar or raw sugar if you like.",
        "Just know that each little change will affect the flavor and it may or may not be to your liking.",
        "Add the vodka once the coffee mixture has cooled to room temperature.",
        "Once the sugar has dissolved and the coffee isn't warm anymore, add the vodka, stirring to combine.",
        "Some bartenders believe in a combination of vodka and rum, or even different types of vodka or different types of rum within the same recipe to give it a fuller flavor.",
        "If you have the end of a few bottles laying around, try combining them – it may not hurt.",
        "Add the vanilla and pour the mixture into bottles.",
        "Three 12 oz bottles will work well, but one large bottle works, too.",
        "Cut the vanilla bean into thirds and drop one piece into each bottle.",
        "After that, put the cap on.",
        "Your Kahlua is made.",
        "At this point, you could also add in a cinnamon stick, cocoa nibs (about a tablespoon), or orange peel, if you like.",
        "This will give it a more signature, dynamic flavor.",
        "Store in a cool, dry place for 2-3 weeks.",
        "The vanilla needs this much time to infuse and the flavors need to settle into the coffee to give it that rich, liqueur flavor.",
        "Once the time is up, strain it beforehand and then rebottle.",
        "The basement or cellar is good for this stuff, but a closed box in a dark room (or under the bed) will work just as well.",
        "Just make sure it has a label on it in case you forget what that mysterious dark bottle is in six months' time.",
        "Making Ready-to-Use Kahlua In a large pot over medium heat, combine the water, sugar, and coffee crystals.",
        "Don't feel like scrolling up?",
        "That was 2 cups of water, 4 cups of sugar, and 3/4 cup instant coffee crystals.",
        "Keep stirring until everything dissolves and is one uniform, smooth consistency.",
        "If you're worried about your insta-Kahlua being a little lacking (generally the ones that take more time have a bit more flavor), you could consider adding a few cocoa nibs to give it a tang of chocolate to make the flavor more dynamic.",
        "Let it cool.",
        "Once everything has dissolved, take it off the heat and let the mixture cool to room temperature.",
        "This should take 15-20 minutes.",
        "A thermometer works well for this, but you could always take taste tests instead to find out!",
        "Add the vodka and vanilla and stir well.",
        "When the concoction reaches room temperature, add 2 1/4 cups of vodka (average quality is best), 2 1/2 tsp of vanilla extract and stir well.",
        "Bingo – your homemade coffee liqueur is made and ready for consumption.",
        "If your guests aren't going to go hog wild over it at the pot, pour the mixture into bottles (three 12 oz.",
        "bottles works well) to keep for later.",
        "But do know that this recipe is supposed to be enjoyed immediately, so take advantage of not having to wait 2 weeks for infusion!"
    ]
}