{
    "title": "How to Set up a Community Fish Tank",
    "url": "https://www.wikihow.com/Set-up-a-Community-Fish-Tank",
    "category_hierarchy": [
        "Pets and Animals",
        "Fish",
        "Community Fish Care"
    ],
    "steps": [
        {
            "headline": "Set up your tank.",
            "description": "Get a big tank, larger than 10 gallons (37.9 L) ideally. But that's just a preferable size, you can choose the size of your tank according to your own personal choice. When you do this make sure that you don't take a tank with thin glass. Check that the tank doesn't leak when you buy it from the shop."
        },
        {
            "headline": "Add your layers.",
            "description": "The flooring can be done in different layers but it's best to stick with one single layer. You can use gravel or substrate or sand. The finer the flooring materials the better. Make sure that it covers 1/20th of the tank's height."
        },
        {
            "headline": "Add in your decoration pieces.",
            "description": "Decorate using your imagination any way you like. Remember that the ornaments should not take up more than 40% of the tank space. Give some shade or hiding place for the fishes to rest when they get fatigued or want shelter."
        },
        {
            "headline": "Slowly add water, being careful not to disturb your setting.",
            "description": "Leave about 1/20th space at the top of the tank. Stop pouring water at that level."
        },
        {
            "headline": "Put in your power filter.",
            "description": "Turn it on to enable circulation and filtration of water. It is to be turned on the entire day; do not turn it off."
        },
        {
            "headline": "Add a heater and a thermometer.",
            "description": "These are a must as temperature control is crucial. For community tanks the average acceptable temperature is 22–27 °C (72–81 °F). Make sure that the temperature is within this range."
        },
        {
            "headline": "Wait for 3 days.",
            "description": "Keep the filter turned on for 3 days at least to enable helpful bacteria to develop as these will help keep the tank clean. You may add fishes and other aquatic animals after this period."
        },
        {
            "headline": "Introduce your fish slowly.",
            "description": "Do not just pour them in; put the plastic bag they came in in the aquarium water for 20 minutes before releasing them. If you're not sure what fish to get, some options include:\nGuppies\nZebra Fish\nNeon Tetras are also a good choice for beginners. Zebrafish and Neons are schooling fish so they will be fun to watch."
        },
        {
            "headline": "Feed your fish 2 times a day.",
            "description": "Do it once in the morning and once at night. Avoid overfeeding, as this will make water cloudy. The number of pellets you give should be double the number of your total fish if you have Guppies/Zebra/Molly/Platy/Neons; for other fish, follow any species-specific suggestions."
        },
        {
            "headline": "Keep the lights in your tank turned on for 8 hours a day.",
            "description": "No light in fish tanks can result in fishes getting de-colorized or worse-blind!"
        }
    ],
    "tyn": [
        "Tank (10 to 25 gallons minimum depending on what you stock it with)",
        "Washed substrate suitable for the livestock in your aquarium",
        "Gravel",
        "Filter",
        "Heater",
        "Rocks",
        "Livestock",
        "Food for your new pets",
        "Fine net",
        "Lighting"
    ],
    "text": " Set up your tank. Get a big tank, larger than 10 gallons (37.9 L) ideally. But that's just a preferable size, you can choose the size of your tank according to your own personal choice. When you do this make sure that you don't take a tank with thin glass. Check that the tank doesn't leak when you buy it from the shop. Add your layers. The flooring can be done in different layers but it's best to stick with one single layer. You can use gravel or substrate or sand. The finer the flooring materials the better. Make sure that it covers 1/20th of the tank's height. Add in your decoration pieces. Decorate using your imagination any way you like. Remember that the ornaments should not take up more than 40% of the tank space. Give some shade or hiding place for the fishes to rest when they get fatigued or want shelter. Slowly add water, being careful not to disturb your setting. Leave about 1/20th space at the top of the tank. Stop pouring water at that level. Put in your power filter. Turn it on to enable circulation and filtration of water. It is to be turned on the entire day; do not turn it off. Add a heater and a thermometer. These are a must as temperature control is crucial. For community tanks the average acceptable temperature is 22–27 °C (72–81 °F). Make sure that the temperature is within this range. Wait for 3 days. Keep the filter turned on for 3 days at least to enable helpful bacteria to develop as these will help keep the tank clean. You may add fishes and other aquatic animals after this period. Introduce your fish slowly. Do not just pour them in; put the plastic bag they came in in the aquarium water for 20 minutes before releasing them. If you're not sure what fish to get, some options include:\nGuppies\nZebra Fish\nNeon Tetras are also a good choice for beginners. Zebrafish and Neons are schooling fish so they will be fun to watch. Feed your fish 2 times a day. Do it once in the morning and once at night. Avoid overfeeding, as this will make water cloudy. The number of pellets you give should be double the number of your total fish if you have Guppies/Zebra/Molly/Platy/Neons; for other fish, follow any species-specific suggestions. Keep the lights in your tank turned on for 8 hours a day. No light in fish tanks can result in fishes getting de-colorized or worse-blind!",
    "sentences": [
        " Set up your tank.",
        "Get a big tank, larger than 10 gallons (37.9 L) ideally.",
        "But that's just a preferable size, you can choose the size of your tank according to your own personal choice.",
        "When you do this make sure that you don't take a tank with thin glass.",
        "Check that the tank doesn't leak when you buy it from the shop.",
        "Add your layers.",
        "The flooring can be done in different layers but it's best to stick with one single layer.",
        "You can use gravel or substrate or sand.",
        "The finer the flooring materials the better.",
        "Make sure that it covers 1/20th of the tank's height.",
        "Add in your decoration pieces.",
        "Decorate using your imagination any way you like.",
        "Remember that the ornaments should not take up more than 40% of the tank space.",
        "Give some shade or hiding place for the fishes to rest when they get fatigued or want shelter.",
        "Slowly add water, being careful not to disturb your setting.",
        "Leave about 1/20th space at the top of the tank.",
        "Stop pouring water at that level.",
        "Put in your power filter.",
        "Turn it on to enable circulation and filtration of water.",
        "It is to be turned on the entire day; do not turn it off.",
        "Add a heater and a thermometer.",
        "These are a must as temperature control is crucial.",
        "For community tanks the average acceptable temperature is 22–27 °C (72–81 °F).",
        "Make sure that the temperature is within this range.",
        "Wait for 3 days.",
        "Keep the filter turned on for 3 days at least to enable helpful bacteria to develop as these will help keep the tank clean.",
        "You may add fishes and other aquatic animals after this period.",
        "Introduce your fish slowly.",
        "Do not just pour them in; put the plastic bag they came in in the aquarium water for 20 minutes before releasing them.",
        "If you're not sure what fish to get, some options include:\nGuppies\nZebra Fish\nNeon Tetras are also a good choice for beginners.",
        "Zebrafish and Neons are schooling fish so they will be fun to watch.",
        "Feed your fish 2 times a day.",
        "Do it once in the morning and once at night.",
        "Avoid overfeeding, as this will make water cloudy.",
        "The number of pellets you give should be double the number of your total fish if you have Guppies/Zebra/Molly/Platy/Neons; for other fish, follow any species-specific suggestions.",
        "Keep the lights in your tank turned on for 8 hours a day.",
        "No light in fish tanks can result in fishes getting de-colorized or worse-blind!"
    ]
}