{
    "title": "How to Oven Broil",
    "url": "https://www.wikihow.com/Oven-Broil",
    "category_hierarchy": [
        "Food and Entertaining",
        "Food Preparation",
        "Basic Cooking Skills"
    ],
    "methods": [
        {
            "name": "Preparing to Broil",
            "steps": [
                {
                    "headline": "Locate your broiler.",
                    "description": "There are two options for where your broiler might be. In some gas ovens, there will be a drawer below your oven with your broiler inside. In most electric ovens and some gas ovens, there will be a broiling rod at the top of the oven. Take a peek inside your oven and determine the location of your broiler."
                },
                {
                    "headline": "Prepare your broiler pan.",
                    "description": "If your broiler sits inside of a drawer at the bottom of your oven, it may contain a two-tiered broiling pan. If your broiler is in the top of your oven--or if you've misplaced your two-tiered broiling pan--you will need to use something else. A rimmed cookie sheet is a good option. Cover the pan you will use with aluminum foil, and give it a light spritz with non-stick cooking spray. If you have a two-tiered broiling pan, cover both tiers with foil. Cut slits into foil on the top pan to allow any fat or grease to drain. Do not use glassware. Even reinforced glass--such as Pyrex--can be damaged under such high heat."
                },
                {
                    "headline": "Position your oven rack.",
                    "description": "If your broiler sits inside your oven, you will need to make sure that you have a rack in the best position. In general, you will place an oven rack in the highest possible slot, 2-4 inches (5.08 - 10.16 cm) away from the heat source. However, for some recipes (such as broiling certain vegetables or fruit), you may want the rack a bit farther away."
                },
                {
                    "headline": "Warm up your broiler.",
                    "description": "Your broiler is a direct heat source that warms up pretty quickly. Turn on your broiler and allow it to heat up for five minutes before you begin cooking your food."
                },
                {
                    "headline": "Use the \"high\" setting.",
                    "description": "Most broilers will have just an \"on\" or \"off\" option. But some may also have \"high\" or \"low\" settings. In general, keep your broiler set to high and ignore the low setting. If you are using the low setting, you are really just roasting your food, not broiling."
                }
            ]
        },
        {
            "name": "Broiling Meat",
            "steps": [
                {
                    "headline": "Season your meat.",
                    "description": "If your recipe calls for oil and/or spices, place these on your meat now. Be sure to season both sides of the meat. Using oils or herbs and spices is totally optional when using your broiler."
                },
                {
                    "headline": "Put your meat under the broiler.",
                    "description": "Once your meat has been brought to room temperature and seasoned, it is ready to go in the oven. Set the meat on the broiler pan of your choice, and place the pan in the oven directly beneath the broiler. If your broiler is in a drawer, slide the drawer out and place your broiler pan inside. If your broiler is in the top of your oven, place your pan on an oven rack in the highest position."
                },
                {
                    "headline": "Wait 7-15 minutes and then flip your meat.",
                    "description": "For thin to medium-sized cuts of meat, you will want to wait 7-10 minutes before flipping the meat. If you are using thicker cuts (or if you prefer your meat very well done) wait closer to 15 minutes, then flip."
                },
                {
                    "headline": "Broil for an additional 5-10 minutes.",
                    "description": "After your meat has been flipped, place it back under the broiler and close the door. Wait an additional 5-10 minutes for the meat to finish cooking."
                },
                {
                    "headline": "Use a meat thermometer.",
                    "description": "The safest and most accurate way to determine the doneness of your meat is to check the internal temperature with a meat thermometer. When your meat reaches the appropriate temperature, remove it from the broiler. Here are some guidelines:\nMedium rare meat = 145 degrees F (63 C)\nMedium = 160 degrees F (71 C)\nWell-done meat = 170 degrees F (77 C)"
                }
            ]
        },
        {
            "name": "Broiling Vegetables",
            "steps": [
                {
                    "headline": "Prep your veggies.",
                    "description": "If your recipe calls for it, season your vegetables with spices, oils or dressings. Then place your vegetables on the broiling pan of your choice. Make sure that your broiler has been heating for about five minutes."
                },
                {
                    "headline": "Place your pan in the oven.",
                    "description": "Set the broiler pan in the oven, directly beneath the broiler element. Now will you need to wait a bit for the veggies to cook. You may want to set a timer for 10 minutes. If you have a drawer-style broiler, slide it out and place your pan inside. If your have a broiler at the top of your oven, set an oven rack at the highest position and place your pan it."
                },
                {
                    "headline": "Wait 10 minutes, then turn the veggies.",
                    "description": "When your timer goes off, you will know that it is time to turn your vegetables. Carefully remove the broiling pan, turn the vegetables over, and return them to the oven."
                },
                {
                    "headline": "Broil for an additional 5 minutes (or less).",
                    "description": "After you return the pan to the oven, you will want to keep a close watch on your vegetables to make sure that they do not burn. Allow them to broil for up to five more minutes, or when they are cooked through."
                }
            ]
        }
    ],
    "tyn": [
        "Broiler pan",
        "Meat thermometer",
        "Foil",
        "Non-stick cooking spray",
        "Meat and/or vegetables",
        "Broiler"
    ],
    "text": " Preparing to Broil Locate your broiler. There are two options for where your broiler might be. In some gas ovens, there will be a drawer below your oven with your broiler inside. In most electric ovens and some gas ovens, there will be a broiling rod at the top of the oven. Take a peek inside your oven and determine the location of your broiler. Prepare your broiler pan. If your broiler sits inside of a drawer at the bottom of your oven, it may contain a two-tiered broiling pan. If your broiler is in the top of your oven--or if you've misplaced your two-tiered broiling pan--you will need to use something else. A rimmed cookie sheet is a good option. Cover the pan you will use with aluminum foil, and give it a light spritz with non-stick cooking spray. If you have a two-tiered broiling pan, cover both tiers with foil. Cut slits into foil on the top pan to allow any fat or grease to drain. Do not use glassware. Even reinforced glass--such as Pyrex--can be damaged under such high heat. Position your oven rack. If your broiler sits inside your oven, you will need to make sure that you have a rack in the best position. In general, you will place an oven rack in the highest possible slot, 2-4 inches (5.08 - 10.16 cm) away from the heat source. However, for some recipes (such as broiling certain vegetables or fruit), you may want the rack a bit farther away. Warm up your broiler. Your broiler is a direct heat source that warms up pretty quickly. Turn on your broiler and allow it to heat up for five minutes before you begin cooking your food. Use the \"high\" setting. Most broilers will have just an \"on\" or \"off\" option. But some may also have \"high\" or \"low\" settings. In general, keep your broiler set to high and ignore the low setting. If you are using the low setting, you are really just roasting your food, not broiling. Broiling Meat Season your meat. If your recipe calls for oil and/or spices, place these on your meat now. Be sure to season both sides of the meat. Using oils or herbs and spices is totally optional when using your broiler. Put your meat under the broiler. Once your meat has been brought to room temperature and seasoned, it is ready to go in the oven. Set the meat on the broiler pan of your choice, and place the pan in the oven directly beneath the broiler. If your broiler is in a drawer, slide the drawer out and place your broiler pan inside. If your broiler is in the top of your oven, place your pan on an oven rack in the highest position. Wait 7-15 minutes and then flip your meat. For thin to medium-sized cuts of meat, you will want to wait 7-10 minutes before flipping the meat. If you are using thicker cuts (or if you prefer your meat very well done) wait closer to 15 minutes, then flip. Broil for an additional 5-10 minutes. After your meat has been flipped, place it back under the broiler and close the door. Wait an additional 5-10 minutes for the meat to finish cooking. Use a meat thermometer. The safest and most accurate way to determine the doneness of your meat is to check the internal temperature with a meat thermometer. When your meat reaches the appropriate temperature, remove it from the broiler. Here are some guidelines:\nMedium rare meat = 145 degrees F (63 C)\nMedium = 160 degrees F (71 C)\nWell-done meat = 170 degrees F (77 C) Broiling Vegetables Prep your veggies. If your recipe calls for it, season your vegetables with spices, oils or dressings. Then place your vegetables on the broiling pan of your choice. Make sure that your broiler has been heating for about five minutes. Place your pan in the oven. Set the broiler pan in the oven, directly beneath the broiler element. Now will you need to wait a bit for the veggies to cook. You may want to set a timer for 10 minutes. If you have a drawer-style broiler, slide it out and place your pan inside. If your have a broiler at the top of your oven, set an oven rack at the highest position and place your pan it. Wait 10 minutes, then turn the veggies. When your timer goes off, you will know that it is time to turn your vegetables. Carefully remove the broiling pan, turn the vegetables over, and return them to the oven. Broil for an additional 5 minutes (or less). After you return the pan to the oven, you will want to keep a close watch on your vegetables to make sure that they do not burn. Allow them to broil for up to five more minutes, or when they are cooked through.",
    "sentences": [
        " Preparing to Broil Locate your broiler.",
        "There are two options for where your broiler might be.",
        "In some gas ovens, there will be a drawer below your oven with your broiler inside.",
        "In most electric ovens and some gas ovens, there will be a broiling rod at the top of the oven.",
        "Take a peek inside your oven and determine the location of your broiler.",
        "Prepare your broiler pan.",
        "If your broiler sits inside of a drawer at the bottom of your oven, it may contain a two-tiered broiling pan.",
        "If your broiler is in the top of your oven--or if you've misplaced your two-tiered broiling pan--you will need to use something else.",
        "A rimmed cookie sheet is a good option.",
        "Cover the pan you will use with aluminum foil, and give it a light spritz with non-stick cooking spray.",
        "If you have a two-tiered broiling pan, cover both tiers with foil.",
        "Cut slits into foil on the top pan to allow any fat or grease to drain.",
        "Do not use glassware.",
        "Even reinforced glass--such as Pyrex--can be damaged under such high heat.",
        "Position your oven rack.",
        "If your broiler sits inside your oven, you will need to make sure that you have a rack in the best position.",
        "In general, you will place an oven rack in the highest possible slot, 2-4 inches (5.08 - 10.16 cm) away from the heat source.",
        "However, for some recipes (such as broiling certain vegetables or fruit), you may want the rack a bit farther away.",
        "Warm up your broiler.",
        "Your broiler is a direct heat source that warms up pretty quickly.",
        "Turn on your broiler and allow it to heat up for five minutes before you begin cooking your food.",
        "Use the \"high\" setting.",
        "Most broilers will have just an \"on\" or \"off\" option.",
        "But some may also have \"high\" or \"low\" settings.",
        "In general, keep your broiler set to high and ignore the low setting.",
        "If you are using the low setting, you are really just roasting your food, not broiling.",
        "Broiling Meat Season your meat.",
        "If your recipe calls for oil and/or spices, place these on your meat now.",
        "Be sure to season both sides of the meat.",
        "Using oils or herbs and spices is totally optional when using your broiler.",
        "Put your meat under the broiler.",
        "Once your meat has been brought to room temperature and seasoned, it is ready to go in the oven.",
        "Set the meat on the broiler pan of your choice, and place the pan in the oven directly beneath the broiler.",
        "If your broiler is in a drawer, slide the drawer out and place your broiler pan inside.",
        "If your broiler is in the top of your oven, place your pan on an oven rack in the highest position.",
        "Wait 7-15 minutes and then flip your meat.",
        "For thin to medium-sized cuts of meat, you will want to wait 7-10 minutes before flipping the meat.",
        "If you are using thicker cuts (or if you prefer your meat very well done) wait closer to 15 minutes, then flip.",
        "Broil for an additional 5-10 minutes.",
        "After your meat has been flipped, place it back under the broiler and close the door.",
        "Wait an additional 5-10 minutes for the meat to finish cooking.",
        "Use a meat thermometer.",
        "The safest and most accurate way to determine the doneness of your meat is to check the internal temperature with a meat thermometer.",
        "When your meat reaches the appropriate temperature, remove it from the broiler.",
        "Here are some guidelines:\nMedium rare meat = 145 degrees F (63 C)\nMedium = 160 degrees F (71 C)\nWell-done meat = 170 degrees F (77 C) Broiling Vegetables Prep your veggies.",
        "If your recipe calls for it, season your vegetables with spices, oils or dressings.",
        "Then place your vegetables on the broiling pan of your choice.",
        "Make sure that your broiler has been heating for about five minutes.",
        "Place your pan in the oven.",
        "Set the broiler pan in the oven, directly beneath the broiler element.",
        "Now will you need to wait a bit for the veggies to cook.",
        "You may want to set a timer for 10 minutes.",
        "If you have a drawer-style broiler, slide it out and place your pan inside.",
        "If your have a broiler at the top of your oven, set an oven rack at the highest position and place your pan it.",
        "Wait 10 minutes, then turn the veggies.",
        "When your timer goes off, you will know that it is time to turn your vegetables.",
        "Carefully remove the broiling pan, turn the vegetables over, and return them to the oven.",
        "Broil for an additional 5 minutes (or less).",
        "After you return the pan to the oven, you will want to keep a close watch on your vegetables to make sure that they do not burn.",
        "Allow them to broil for up to five more minutes, or when they are cooked through."
    ]
}