{
    "title": "How to Run an Art Gallery",
    "url": "https://www.wikihow.com/Run-an-Art-Gallery",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Artwork"
    ],
    "parts": [
        {
            "name": "Starting an Art Gallery",
            "steps": [
                {
                    "headline": "Develop contacts in the art world.",
                    "description": "These contacts should be amongst art collectors, artists and art media in the town where your gallery will open, and beyond. This can take years (5 to 15) to cultivate through art school, art jobs and socializing in a gallery or museum setting."
                },
                {
                    "headline": "Be completely committed to art and your desire to start an art gallery.",
                    "description": "In the modern marketplace, many gallerists believe you must love what you do in order to be successful. Art sales are inconsistent, with some months providing almost no income and others providing a lot."
                },
                {
                    "headline": "Decide what type of art you want to sell and who your clientele will be.",
                    "description": "For example, contemporary, abstract, western, sculptors, prints, furniture or a mixture of different types. The gallery's art should be varied but have a driving theme behind your artistic decisions that attracts people to be repeat customers. You can choose to be a non-profit gallery and gather donations to run a charity. You can choose to form an artists' collective gallery, if you are an artist yourself. You can also choose to run a commercial art gallery that caters to low, middle or high price points. This should be decided before you start to look for artists or look for funding."
                },
                {
                    "headline": "Put together a detailed business plan.",
                    "description": "A business plan sets up the foundation of creating a successful, profitable business in 1 to 5 years, and it should include detailed steps on the artist plan, marketing plan and funding needed."
                },
                {
                    "headline": "Look for funding, if it is not already provided.",
                    "description": "Your business plan, financial statements and commitment from artists will serve as ways to convince banks or business partners that you have a profitable plan. If you take on business partners, try to choose ones that are likewise linked to the art world and can send collectors your way."
                },
                {
                    "headline": "Get commitments from artists.",
                    "description": "Look for your artists by getting advice from other dealers or museum curators, or you can put out an open call for submissions. Negotiate your percentage in writing, understanding that generally the newer the artist is to the art world, the higher a percentage of the sale you will be able to receive."
                },
                {
                    "headline": "Obtain a gallery space in a popular, or easy to find, location.",
                    "description": "Often this means that gallery space is expensive, so be ready to pay a high rent to stay where out-of-town visitors and collectors can easily find you. A well-situated space will also prove beneficial for marketing gallery show openings."
                },
                {
                    "headline": "Hire trusted employees.",
                    "description": "Gallery employees should have an art education, contacts in the art world and have sales, business or marketing experience. The ideal employee has an art history or art administration degree and is prepared to multi-task, especially at the beginning."
                },
                {
                    "headline": "Get good insurance and a security system for your gallery.",
                    "description": "This is essential so that you can be protected in case of theft or other damage. Artists will often require proof of insurance before agreeing to keep their work in your gallery."
                }
            ]
        },
        {
            "name": "Maintaining a Successful Art Gallery",
            "steps": [
                {
                    "headline": "Do not quit your job immediately.",
                    "description": "Many gallerists, especially in big cities, run their gallery along with other jobs until their gallery becomes profitable. Appoint a trusted, knowledgeable employee to oversee the gallery when you cannot be there, and work hard to move comfortably into working there full-time."
                },
                {
                    "headline": "Create an online presence.",
                    "description": "Today's galleries must have a website, social media accounts, blogs and an email list in order to be successful and get new clientele. Invest money in having an attractive website that lists your artists, some art, your location and contact information."
                },
                {
                    "headline": "Host regular art gallery shows, with well-promoted openings.",
                    "description": "Use your contacts in the art world to plan, market and execute shows that are attended by your clientele. Market using email blasts, art magazine ads, newspaper features, social media and printed invitations."
                },
                {
                    "headline": "Create a bookkeeping system to track sales, new acquisitions and artist percentages.",
                    "description": "You may be able to do this with software, if you are a small gallery, or you may need to hire a freelance or part-time accountant."
                },
                {
                    "headline": "Consider advertising in few local and nation-wide art magazines and buying booths at fine art fairs.",
                    "description": "Booths and ad space help to establish good relationships in the art world and they expose you to new clientele. Advertising in art magazines, although expensive, may allow you to ask for monthly or annual features on your gallery shows."
                },
                {
                    "headline": "Be prepared to cater to 2 or more kinds of clientele.",
                    "description": "Keep a list of frequent collectors who are given the first chance to buy new art or who can ask for special commissions. Also, market prints or less expensive art to visitors or younger collectors."
                },
                {
                    "headline": "Be approachable.",
                    "description": "You never know who is or is not a collector when they walk through your door. Make sure you are not snooty, and you give a good impression to all potential clients."
                }
            ]
        }
    ],
    "tyn": [
        "Art contacts",
        "Start-up capital",
        "Gallery space",
        "Insurance",
        "Employees",
        "Promotional materials, including a website",
        "Business registration with state/country",
        "Art",
        "Advertising"
    ],
    "text": " Starting an Art Gallery Develop contacts in the art world. These contacts should be amongst art collectors, artists and art media in the town where your gallery will open, and beyond. This can take years (5 to 15) to cultivate through art school, art jobs and socializing in a gallery or museum setting. Be completely committed to art and your desire to start an art gallery. In the modern marketplace, many gallerists believe you must love what you do in order to be successful. Art sales are inconsistent, with some months providing almost no income and others providing a lot. Decide what type of art you want to sell and who your clientele will be. For example, contemporary, abstract, western, sculptors, prints, furniture or a mixture of different types. The gallery's art should be varied but have a driving theme behind your artistic decisions that attracts people to be repeat customers. You can choose to be a non-profit gallery and gather donations to run a charity. You can choose to form an artists' collective gallery, if you are an artist yourself. You can also choose to run a commercial art gallery that caters to low, middle or high price points. This should be decided before you start to look for artists or look for funding. Put together a detailed business plan. A business plan sets up the foundation of creating a successful, profitable business in 1 to 5 years, and it should include detailed steps on the artist plan, marketing plan and funding needed. Look for funding, if it is not already provided. Your business plan, financial statements and commitment from artists will serve as ways to convince banks or business partners that you have a profitable plan. If you take on business partners, try to choose ones that are likewise linked to the art world and can send collectors your way. Get commitments from artists. Look for your artists by getting advice from other dealers or museum curators, or you can put out an open call for submissions. Negotiate your percentage in writing, understanding that generally the newer the artist is to the art world, the higher a percentage of the sale you will be able to receive. Obtain a gallery space in a popular, or easy to find, location. Often this means that gallery space is expensive, so be ready to pay a high rent to stay where out-of-town visitors and collectors can easily find you. A well-situated space will also prove beneficial for marketing gallery show openings. Hire trusted employees. Gallery employees should have an art education, contacts in the art world and have sales, business or marketing experience. The ideal employee has an art history or art administration degree and is prepared to multi-task, especially at the beginning. Get good insurance and a security system for your gallery. This is essential so that you can be protected in case of theft or other damage. Artists will often require proof of insurance before agreeing to keep their work in your gallery. Maintaining a Successful Art Gallery Do not quit your job immediately. Many gallerists, especially in big cities, run their gallery along with other jobs until their gallery becomes profitable. Appoint a trusted, knowledgeable employee to oversee the gallery when you cannot be there, and work hard to move comfortably into working there full-time. Create an online presence. Today's galleries must have a website, social media accounts, blogs and an email list in order to be successful and get new clientele. Invest money in having an attractive website that lists your artists, some art, your location and contact information. Host regular art gallery shows, with well-promoted openings. Use your contacts in the art world to plan, market and execute shows that are attended by your clientele. Market using email blasts, art magazine ads, newspaper features, social media and printed invitations. Create a bookkeeping system to track sales, new acquisitions and artist percentages. You may be able to do this with software, if you are a small gallery, or you may need to hire a freelance or part-time accountant. Consider advertising in few local and nation-wide art magazines and buying booths at fine art fairs. Booths and ad space help to establish good relationships in the art world and they expose you to new clientele. Advertising in art magazines, although expensive, may allow you to ask for monthly or annual features on your gallery shows. Be prepared to cater to 2 or more kinds of clientele. Keep a list of frequent collectors who are given the first chance to buy new art or who can ask for special commissions. Also, market prints or less expensive art to visitors or younger collectors. Be approachable. You never know who is or is not a collector when they walk through your door. Make sure you are not snooty, and you give a good impression to all potential clients.",
    "sentences": [
        " Starting an Art Gallery Develop contacts in the art world.",
        "These contacts should be amongst art collectors, artists and art media in the town where your gallery will open, and beyond.",
        "This can take years (5 to 15) to cultivate through art school, art jobs and socializing in a gallery or museum setting.",
        "Be completely committed to art and your desire to start an art gallery.",
        "In the modern marketplace, many gallerists believe you must love what you do in order to be successful.",
        "Art sales are inconsistent, with some months providing almost no income and others providing a lot.",
        "Decide what type of art you want to sell and who your clientele will be.",
        "For example, contemporary, abstract, western, sculptors, prints, furniture or a mixture of different types.",
        "The gallery's art should be varied but have a driving theme behind your artistic decisions that attracts people to be repeat customers.",
        "You can choose to be a non-profit gallery and gather donations to run a charity.",
        "You can choose to form an artists' collective gallery, if you are an artist yourself.",
        "You can also choose to run a commercial art gallery that caters to low, middle or high price points.",
        "This should be decided before you start to look for artists or look for funding.",
        "Put together a detailed business plan.",
        "A business plan sets up the foundation of creating a successful, profitable business in 1 to 5 years, and it should include detailed steps on the artist plan, marketing plan and funding needed.",
        "Look for funding, if it is not already provided.",
        "Your business plan, financial statements and commitment from artists will serve as ways to convince banks or business partners that you have a profitable plan.",
        "If you take on business partners, try to choose ones that are likewise linked to the art world and can send collectors your way.",
        "Get commitments from artists.",
        "Look for your artists by getting advice from other dealers or museum curators, or you can put out an open call for submissions.",
        "Negotiate your percentage in writing, understanding that generally the newer the artist is to the art world, the higher a percentage of the sale you will be able to receive.",
        "Obtain a gallery space in a popular, or easy to find, location.",
        "Often this means that gallery space is expensive, so be ready to pay a high rent to stay where out-of-town visitors and collectors can easily find you.",
        "A well-situated space will also prove beneficial for marketing gallery show openings.",
        "Hire trusted employees.",
        "Gallery employees should have an art education, contacts in the art world and have sales, business or marketing experience.",
        "The ideal employee has an art history or art administration degree and is prepared to multi-task, especially at the beginning.",
        "Get good insurance and a security system for your gallery.",
        "This is essential so that you can be protected in case of theft or other damage.",
        "Artists will often require proof of insurance before agreeing to keep their work in your gallery.",
        "Maintaining a Successful Art Gallery Do not quit your job immediately.",
        "Many gallerists, especially in big cities, run their gallery along with other jobs until their gallery becomes profitable.",
        "Appoint a trusted, knowledgeable employee to oversee the gallery when you cannot be there, and work hard to move comfortably into working there full-time.",
        "Create an online presence.",
        "Today's galleries must have a website, social media accounts, blogs and an email list in order to be successful and get new clientele.",
        "Invest money in having an attractive website that lists your artists, some art, your location and contact information.",
        "Host regular art gallery shows, with well-promoted openings.",
        "Use your contacts in the art world to plan, market and execute shows that are attended by your clientele.",
        "Market using email blasts, art magazine ads, newspaper features, social media and printed invitations.",
        "Create a bookkeeping system to track sales, new acquisitions and artist percentages.",
        "You may be able to do this with software, if you are a small gallery, or you may need to hire a freelance or part-time accountant.",
        "Consider advertising in few local and nation-wide art magazines and buying booths at fine art fairs.",
        "Booths and ad space help to establish good relationships in the art world and they expose you to new clientele.",
        "Advertising in art magazines, although expensive, may allow you to ask for monthly or annual features on your gallery shows.",
        "Be prepared to cater to 2 or more kinds of clientele.",
        "Keep a list of frequent collectors who are given the first chance to buy new art or who can ask for special commissions.",
        "Also, market prints or less expensive art to visitors or younger collectors.",
        "Be approachable.",
        "You never know who is or is not a collector when they walk through your door.",
        "Make sure you are not snooty, and you give a good impression to all potential clients."
    ]
}