{
    "title": "How to Do a Water Change in a Freshwater Aquarium",
    "url": "https://www.wikihow.com/Do-a-Water-Change-in-a-Freshwater-Aquarium",
    "category_hierarchy": [
        "Pets and Animals",
        "Fish",
        "Aquariums",
        "Aquarium Maintenance and Repair"
    ],
    "parts": [
        {
            "name": "Getting Your Tank Ready for a Water Change",
            "steps": [
                {
                    "headline": "Pretreat a bucket of tap water.",
                    "description": "Get out a clean bucket and fill it with water directly from the faucet. Follow the instructions on your water conditioner bottle and pre-treat the water prior to cleaning. The conditioner will make the water safe for your fish by removing dangerous chemicals and metal residue. Go ahead and keep two plastic buckets, specifically for your aquarium use. You may even want to write “fish” on the side. Some people prefer to refill their tank using water directly from the tap. This may be more convenient; however, you do risk exposing your fish to hazardous chemicals in the water. To lessen this possibility, let the tap run for 5 minutes or so before filling the bucket."
                },
                {
                    "headline": "Unplug the tank’s lighting and heating elements.",
                    "description": "Since you will be working with water around the exterior of the tank, it is best to minimize the presence of electricity. Go ahead and disconnect the tank lid and any attached lighting. Reach into the tank and unplug any exposed heating elements."
                },
                {
                    "headline": "Unplug and clean the filter.",
                    "description": "Many filters don’t do well without full water coverage, so it is a good idea to disconnect your filter as you start the cleaning process. You do not need to clean or replace your filter cartridge, sponge, or other media every time that you clean the tank. Instead, look at it, see how it is holding up, and then run it through cold water or fully replace it, if needed. Replacing your filter too often can have disastrous consequences for your tank by removing the accumulated good bacteria. To counterbalance a filter change, you might want to invest in gravel, or sand, with pre-added bacterial cultures."
                },
                {
                    "headline": "Remove any dirty artificial decorations and plants.",
                    "description": "It is also not necessary to clean your tank accessories as a part of every water change. Doing so can disrupt the good bacteria in your tank too. However, if the artificial items in your tank seem overly slimy or sludgy looking, then you’ll want to gently remove them to a bucket and allow them to soak in a plant cleaning solution. Never wash your plants and décor in soap. The chemical residue can be harmful to your fish, and it can also cause an outburst of algae in your tank. You can also soak your plants and décor in a chlorine bleach and water mixture. Add 1-2 tablespoons of bleach per water in a bucket."
                },
                {
                    "headline": "Scrub the walls of the tank.",
                    "description": "Every time that you do a water change take a quick look at your tank and see if it needs a scrub. Look for green or brown film on the sides of the tank. While the tank is still full, use an algae sponge or scraper to rub the tank’s side and remove the residue. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDoug Ludemann\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Aquarist\t\t\t\t\t\t\t\tDoug Ludemann is the owner and operator of Fish Geeks, LLC, an aquarium services company based in Minneapolis, Minnesota. Doug has worked in the aquarium and fish-care industry for over 20 years, including having worked as a professional aquarist for the Minnesota Zoo and Shedd Aquarium in Chicago. He received his Bachelor of Science in Ecology, Evolution, and Behavior from the University of Minnesota. Doug Ludemann\t\t\tProfessional Aquarist\t\t\t\tDid You Know? Adding lanthanum chloride to your tank can eliminate algae-causing phosphates. This is because lanthanum chloride turns phosphates into an insoluble compound, creating a cloudy substance in your water, which you can then easily filter out."
                }
            ]
        },
        {
            "name": "Performing the Water Change",
            "steps": [
                {
                    "headline": "Use an automatic water changer.",
                    "description": "This is the most efficient, and often preferred, way of performing a partial water change, especially in larger tanks. Attach the device directly to your faucet and then insert one of the connected hoses and siphon attachments into your tank. The device will automatically suck out water for you, until you switch it off. Then, flip the switch again and insert the faucet hose to refill the tank. This method is especially useful for those people unable to haul multiple buckets of water around in order to perform regular cleanings. It also minimizes the potential to create a watery mess. Just make sure that the new water that you are adding is close to the original temperature of the tank. Check this before starting the automatic suctioning process."
                },
                {
                    "headline": "Siphon out any substrate debris with a gravel siphon.",
                    "description": "If you don’t have an all-in-one system, then you will need to perform the water switch by hand. Start by placing the tube end of your siphon into a bucket. Then, place the siphon tip into the tank’s substrate, usually gravel or sand. Repeatedly insert the siphon deep into the sand at an angle, drawing out both debris and tank water. Don’t feel as if you have to perfectly clean all of the gravel during each change. In fact, it is better if you section off your tank and clean certain areas of the gravel each time. This lessens the impact of the change for your fish."
                },
                {
                    "headline": "Suck out water from the tank.",
                    "description": "As you move your siphon around, you will notice that your bucket begins to fill with dirty gravel and murky tank water, this is perfectly normal and what you want. However, don’t take it too far. Use your siphon to remove a maximum of 30% of the tank’s water. Going beyond this can irreparably alter your tank’s chemistry. For example, if you have a 10 gallon tank, it is a good idea to use a 3 gallon bucket for water changes. Then, when the bucket is full, you know that you’ve removed the right amount of water."
                },
                {
                    "headline": "Take a detailed look at your tank’s interior.",
                    "description": "Now that your tank is less full, spend a bit of time checking out the status of your tank from an inside view. If you don’t fully remove your decorations, then perhaps pick them up and look them over for any damage. Check to make sure that all of your heating and filtration systems seem okay in structure."
                },
                {
                    "headline": "Note the temperature of the remaining water.",
                    "description": "If you have a tank-side thermometer, make a quick note of the temperature of the water post-drain. Otherwise, it is a good idea to dip a thermometer into the water to get a reading. Then, test the temperature of the clean, treated water that you will add to the tank in a bit. Make sure that the two temperatures match. If not, you may need to give it a some more time before completing the change. Water temperature fluctuations can make fish more susceptible to illness. Make sure to take the tank’s temperature again after you’ve added in the fresh water."
                },
                {
                    "headline": "Re-fill the tank with pretreated water.",
                    "description": "At this point, you will want to move the pretreated water from the bucket into the tank. You can do this by pouring the water into a pitcher and then emptying the pitcher into the tank. Or, you can hold the bucket with both hands and empty it directly into the tank. Whichever method you choose, just make sure that the water doesn’t rush in super-fast and disturb the gravel and your decorations. Some people like to use their hand, or a plate, to lessen the direct flow of the water into the tank."
                },
                {
                    "headline": "Replace all decorations and plants.",
                    "description": "If you’ve taken out any of your artificial decorations, you can add them back in either immediately before, or directly after, refilling the tank. You can use this as an opportunity to move items around, or to leave items out entirely for a new look."
                },
                {
                    "headline": "Reconnect the filtration system, heater, and light.",
                    "description": "All of the functioning systems that you unplugged at the start of this process now need to be hooked up again. Make sure your hands are dry and carefully reinstall and restart all of these items. Some types of filers, such as the hang-on ones, will need 1-2 cups of water directly fed into the system before they will start working."
                },
                {
                    "headline": "Rinse off and store your equipment.",
                    "description": "Create a designated area where you keep all of your tank cleaning supplies. You will want to allow your buckets, scrubbers, and siphon to air dry before storing. Keeping up with regular storage procedures may keep you from having to buy replacements."
                }
            ]
        },
        {
            "name": "Keeping Your Tank Clean in the Long Term",
            "steps": [
                {
                    "headline": "Schedule weekly partial water changes.",
                    "description": "It is a good idea to complete a weekly, or bi-weekly, water change on a consistent basis. Again, you will not remove all of the water each time, only 25-30%. If you see the need, you can also do a deep cleaning of your tank on a monthly basis. You must balance out a desire to keep your tank clean with the health of your fish. Too frequent, or too few, cleanings can adversely impact their health."
                },
                {
                    "headline": "”Reset” your tank with water changes.",
                    "description": "Performing partial changes is also an excellent way to re-establish stability in your tank after an unusual event, such as a re-scaping or a chemical overdose. Don’t be afraid to do an unscheduled water change in these cases as the reward is worth it."
                },
                {
                    "headline": "Limit your light usage.",
                    "description": "If you run your aquarium lights all day and every day, you will likely see a quick, aggressive accumulation of algae and debris. This is because the light is helping the algae to feed off of your tank. Instead, try keeping your lights on for 10-14 hours for tanks with live plants or 6-10 hours otherwise."
                },
                {
                    "headline": "Avoid overfeeding.",
                    "description": "Much of the debris that you siphon out of the gravel will be leftover food. To avoid this issue, resist the desire to overfeed and instead stick with a once or twice daily schedule. And, adjust your feeding practices depending on how well your fish eat what is offered."
                }
            ]
        }
    ],
    "tyn": [
        "2-3 plastic buckets (2.5 gallons or 10 liters each)",
        "access to spigot",
        "automatic water changer (optional)",
        "algae scrubber",
        "water conditioner/de-chlorinator",
        "gravel siphon",
        "filter cartridges or replacement media (if absolutely needed)",
        "paper towels (optional)",
        "chopsticks (optional)",
        "water pitcher or plate (optional)"
    ],
    "text": " Getting Your Tank Ready for a Water Change Pretreat a bucket of tap water. Get out a clean bucket and fill it with water directly from the faucet. Follow the instructions on your water conditioner bottle and pre-treat the water prior to cleaning. The conditioner will make the water safe for your fish by removing dangerous chemicals and metal residue. Go ahead and keep two plastic buckets, specifically for your aquarium use. You may even want to write “fish” on the side. Some people prefer to refill their tank using water directly from the tap. This may be more convenient; however, you do risk exposing your fish to hazardous chemicals in the water. To lessen this possibility, let the tap run for 5 minutes or so before filling the bucket. Unplug the tank’s lighting and heating elements. Since you will be working with water around the exterior of the tank, it is best to minimize the presence of electricity. Go ahead and disconnect the tank lid and any attached lighting. Reach into the tank and unplug any exposed heating elements. Unplug and clean the filter. Many filters don’t do well without full water coverage, so it is a good idea to disconnect your filter as you start the cleaning process. You do not need to clean or replace your filter cartridge, sponge, or other media every time that you clean the tank. Instead, look at it, see how it is holding up, and then run it through cold water or fully replace it, if needed. Replacing your filter too often can have disastrous consequences for your tank by removing the accumulated good bacteria. To counterbalance a filter change, you might want to invest in gravel, or sand, with pre-added bacterial cultures. Remove any dirty artificial decorations and plants. It is also not necessary to clean your tank accessories as a part of every water change. Doing so can disrupt the good bacteria in your tank too. However, if the artificial items in your tank seem overly slimy or sludgy looking, then you’ll want to gently remove them to a bucket and allow them to soak in a plant cleaning solution. Never wash your plants and décor in soap. The chemical residue can be harmful to your fish, and it can also cause an outburst of algae in your tank. You can also soak your plants and décor in a chlorine bleach and water mixture. Add 1-2 tablespoons of bleach per water in a bucket. Scrub the walls of the tank. Every time that you do a water change take a quick look at your tank and see if it needs a scrub. Look for green or brown film on the sides of the tank. While the tank is still full, use an algae sponge or scraper to rub the tank’s side and remove the residue. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDoug Ludemann\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Aquarist\t\t\t\t\t\t\t\tDoug Ludemann is the owner and operator of Fish Geeks, LLC, an aquarium services company based in Minneapolis, Minnesota. Doug has worked in the aquarium and fish-care industry for over 20 years, including having worked as a professional aquarist for the Minnesota Zoo and Shedd Aquarium in Chicago. He received his Bachelor of Science in Ecology, Evolution, and Behavior from the University of Minnesota. Doug Ludemann\t\t\tProfessional Aquarist\t\t\t\tDid You Know? Adding lanthanum chloride to your tank can eliminate algae-causing phosphates. This is because lanthanum chloride turns phosphates into an insoluble compound, creating a cloudy substance in your water, which you can then easily filter out. Performing the Water Change Use an automatic water changer. This is the most efficient, and often preferred, way of performing a partial water change, especially in larger tanks. Attach the device directly to your faucet and then insert one of the connected hoses and siphon attachments into your tank. The device will automatically suck out water for you, until you switch it off. Then, flip the switch again and insert the faucet hose to refill the tank. This method is especially useful for those people unable to haul multiple buckets of water around in order to perform regular cleanings. It also minimizes the potential to create a watery mess. Just make sure that the new water that you are adding is close to the original temperature of the tank. Check this before starting the automatic suctioning process. Siphon out any substrate debris with a gravel siphon. If you don’t have an all-in-one system, then you will need to perform the water switch by hand. Start by placing the tube end of your siphon into a bucket. Then, place the siphon tip into the tank’s substrate, usually gravel or sand. Repeatedly insert the siphon deep into the sand at an angle, drawing out both debris and tank water. Don’t feel as if you have to perfectly clean all of the gravel during each change. In fact, it is better if you section off your tank and clean certain areas of the gravel each time. This lessens the impact of the change for your fish. Suck out water from the tank. As you move your siphon around, you will notice that your bucket begins to fill with dirty gravel and murky tank water, this is perfectly normal and what you want. However, don’t take it too far. Use your siphon to remove a maximum of 30% of the tank’s water. Going beyond this can irreparably alter your tank’s chemistry. For example, if you have a 10 gallon tank, it is a good idea to use a 3 gallon bucket for water changes. Then, when the bucket is full, you know that you’ve removed the right amount of water. Take a detailed look at your tank’s interior. Now that your tank is less full, spend a bit of time checking out the status of your tank from an inside view. If you don’t fully remove your decorations, then perhaps pick them up and look them over for any damage. Check to make sure that all of your heating and filtration systems seem okay in structure. Note the temperature of the remaining water. If you have a tank-side thermometer, make a quick note of the temperature of the water post-drain. Otherwise, it is a good idea to dip a thermometer into the water to get a reading. Then, test the temperature of the clean, treated water that you will add to the tank in a bit. Make sure that the two temperatures match. If not, you may need to give it a some more time before completing the change. Water temperature fluctuations can make fish more susceptible to illness. Make sure to take the tank’s temperature again after you’ve added in the fresh water. Re-fill the tank with pretreated water. At this point, you will want to move the pretreated water from the bucket into the tank. You can do this by pouring the water into a pitcher and then emptying the pitcher into the tank. Or, you can hold the bucket with both hands and empty it directly into the tank. Whichever method you choose, just make sure that the water doesn’t rush in super-fast and disturb the gravel and your decorations. Some people like to use their hand, or a plate, to lessen the direct flow of the water into the tank. Replace all decorations and plants. If you’ve taken out any of your artificial decorations, you can add them back in either immediately before, or directly after, refilling the tank. You can use this as an opportunity to move items around, or to leave items out entirely for a new look. Reconnect the filtration system, heater, and light. All of the functioning systems that you unplugged at the start of this process now need to be hooked up again. Make sure your hands are dry and carefully reinstall and restart all of these items. Some types of filers, such as the hang-on ones, will need 1-2 cups of water directly fed into the system before they will start working. Rinse off and store your equipment. Create a designated area where you keep all of your tank cleaning supplies. You will want to allow your buckets, scrubbers, and siphon to air dry before storing. Keeping up with regular storage procedures may keep you from having to buy replacements. Keeping Your Tank Clean in the Long Term Schedule weekly partial water changes. It is a good idea to complete a weekly, or bi-weekly, water change on a consistent basis. Again, you will not remove all of the water each time, only 25-30%. If you see the need, you can also do a deep cleaning of your tank on a monthly basis. You must balance out a desire to keep your tank clean with the health of your fish. Too frequent, or too few, cleanings can adversely impact their health. ”Reset” your tank with water changes. Performing partial changes is also an excellent way to re-establish stability in your tank after an unusual event, such as a re-scaping or a chemical overdose. Don’t be afraid to do an unscheduled water change in these cases as the reward is worth it. Limit your light usage. If you run your aquarium lights all day and every day, you will likely see a quick, aggressive accumulation of algae and debris. This is because the light is helping the algae to feed off of your tank. Instead, try keeping your lights on for 10-14 hours for tanks with live plants or 6-10 hours otherwise. Avoid overfeeding. Much of the debris that you siphon out of the gravel will be leftover food. To avoid this issue, resist the desire to overfeed and instead stick with a once or twice daily schedule. And, adjust your feeding practices depending on how well your fish eat what is offered.",
    "sentences": [
        " Getting Your Tank Ready for a Water Change Pretreat a bucket of tap water.",
        "Get out a clean bucket and fill it with water directly from the faucet.",
        "Follow the instructions on your water conditioner bottle and pre-treat the water prior to cleaning.",
        "The conditioner will make the water safe for your fish by removing dangerous chemicals and metal residue.",
        "Go ahead and keep two plastic buckets, specifically for your aquarium use.",
        "You may even want to write “fish” on the side.",
        "Some people prefer to refill their tank using water directly from the tap.",
        "This may be more convenient; however, you do risk exposing your fish to hazardous chemicals in the water.",
        "To lessen this possibility, let the tap run for 5 minutes or so before filling the bucket.",
        "Unplug the tank’s lighting and heating elements.",
        "Since you will be working with water around the exterior of the tank, it is best to minimize the presence of electricity.",
        "Go ahead and disconnect the tank lid and any attached lighting.",
        "Reach into the tank and unplug any exposed heating elements.",
        "Unplug and clean the filter.",
        "Many filters don’t do well without full water coverage, so it is a good idea to disconnect your filter as you start the cleaning process.",
        "You do not need to clean or replace your filter cartridge, sponge, or other media every time that you clean the tank.",
        "Instead, look at it, see how it is holding up, and then run it through cold water or fully replace it, if needed.",
        "Replacing your filter too often can have disastrous consequences for your tank by removing the accumulated good bacteria.",
        "To counterbalance a filter change, you might want to invest in gravel, or sand, with pre-added bacterial cultures.",
        "Remove any dirty artificial decorations and plants.",
        "It is also not necessary to clean your tank accessories as a part of every water change.",
        "Doing so can disrupt the good bacteria in your tank too.",
        "However, if the artificial items in your tank seem overly slimy or sludgy looking, then you’ll want to gently remove them to a bucket and allow them to soak in a plant cleaning solution.",
        "Never wash your plants and décor in soap.",
        "The chemical residue can be harmful to your fish, and it can also cause an outburst of algae in your tank.",
        "You can also soak your plants and décor in a chlorine bleach and water mixture.",
        "Add 1-2 tablespoons of bleach per water in a bucket.",
        "Scrub the walls of the tank.",
        "Every time that you do a water change take a quick look at your tank and see if it needs a scrub.",
        "Look for green or brown film on the sides of the tank.",
        "While the tank is still full, use an algae sponge or scraper to rub the tank’s side and remove the residue.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDoug Ludemann\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Aquarist\t\t\t\t\t\t\t\tDoug Ludemann is the owner and operator of Fish Geeks, LLC, an aquarium services company based in Minneapolis, Minnesota.",
        "Doug has worked in the aquarium and fish-care industry for over 20 years, including having worked as a professional aquarist for the Minnesota Zoo and Shedd Aquarium in Chicago.",
        "He received his Bachelor of Science in Ecology, Evolution, and Behavior from the University of Minnesota.",
        "Doug Ludemann\t\t\tProfessional Aquarist\t\t\t\tDid You Know?",
        "Adding lanthanum chloride to your tank can eliminate algae-causing phosphates.",
        "This is because lanthanum chloride turns phosphates into an insoluble compound, creating a cloudy substance in your water, which you can then easily filter out.",
        "Performing the Water Change Use an automatic water changer.",
        "This is the most efficient, and often preferred, way of performing a partial water change, especially in larger tanks.",
        "Attach the device directly to your faucet and then insert one of the connected hoses and siphon attachments into your tank.",
        "The device will automatically suck out water for you, until you switch it off.",
        "Then, flip the switch again and insert the faucet hose to refill the tank.",
        "This method is especially useful for those people unable to haul multiple buckets of water around in order to perform regular cleanings.",
        "It also minimizes the potential to create a watery mess.",
        "Just make sure that the new water that you are adding is close to the original temperature of the tank.",
        "Check this before starting the automatic suctioning process.",
        "Siphon out any substrate debris with a gravel siphon.",
        "If you don’t have an all-in-one system, then you will need to perform the water switch by hand.",
        "Start by placing the tube end of your siphon into a bucket.",
        "Then, place the siphon tip into the tank’s substrate, usually gravel or sand.",
        "Repeatedly insert the siphon deep into the sand at an angle, drawing out both debris and tank water.",
        "Don’t feel as if you have to perfectly clean all of the gravel during each change.",
        "In fact, it is better if you section off your tank and clean certain areas of the gravel each time.",
        "This lessens the impact of the change for your fish.",
        "Suck out water from the tank.",
        "As you move your siphon around, you will notice that your bucket begins to fill with dirty gravel and murky tank water, this is perfectly normal and what you want.",
        "However, don’t take it too far.",
        "Use your siphon to remove a maximum of 30% of the tank’s water.",
        "Going beyond this can irreparably alter your tank’s chemistry.",
        "For example, if you have a 10 gallon tank, it is a good idea to use a 3 gallon bucket for water changes.",
        "Then, when the bucket is full, you know that you’ve removed the right amount of water.",
        "Take a detailed look at your tank’s interior.",
        "Now that your tank is less full, spend a bit of time checking out the status of your tank from an inside view.",
        "If you don’t fully remove your decorations, then perhaps pick them up and look them over for any damage.",
        "Check to make sure that all of your heating and filtration systems seem okay in structure.",
        "Note the temperature of the remaining water.",
        "If you have a tank-side thermometer, make a quick note of the temperature of the water post-drain.",
        "Otherwise, it is a good idea to dip a thermometer into the water to get a reading.",
        "Then, test the temperature of the clean, treated water that you will add to the tank in a bit.",
        "Make sure that the two temperatures match.",
        "If not, you may need to give it a some more time before completing the change.",
        "Water temperature fluctuations can make fish more susceptible to illness.",
        "Make sure to take the tank’s temperature again after you’ve added in the fresh water.",
        "Re-fill the tank with pretreated water.",
        "At this point, you will want to move the pretreated water from the bucket into the tank.",
        "You can do this by pouring the water into a pitcher and then emptying the pitcher into the tank.",
        "Or, you can hold the bucket with both hands and empty it directly into the tank.",
        "Whichever method you choose, just make sure that the water doesn’t rush in super-fast and disturb the gravel and your decorations.",
        "Some people like to use their hand, or a plate, to lessen the direct flow of the water into the tank.",
        "Replace all decorations and plants.",
        "If you’ve taken out any of your artificial decorations, you can add them back in either immediately before, or directly after, refilling the tank.",
        "You can use this as an opportunity to move items around, or to leave items out entirely for a new look.",
        "Reconnect the filtration system, heater, and light.",
        "All of the functioning systems that you unplugged at the start of this process now need to be hooked up again.",
        "Make sure your hands are dry and carefully reinstall and restart all of these items.",
        "Some types of filers, such as the hang-on ones, will need 1-2 cups of water directly fed into the system before they will start working.",
        "Rinse off and store your equipment.",
        "Create a designated area where you keep all of your tank cleaning supplies.",
        "You will want to allow your buckets, scrubbers, and siphon to air dry before storing.",
        "Keeping up with regular storage procedures may keep you from having to buy replacements.",
        "Keeping Your Tank Clean in the Long Term Schedule weekly partial water changes.",
        "It is a good idea to complete a weekly, or bi-weekly, water change on a consistent basis.",
        "Again, you will not remove all of the water each time, only 25-30%.",
        "If you see the need, you can also do a deep cleaning of your tank on a monthly basis.",
        "You must balance out a desire to keep your tank clean with the health of your fish.",
        "Too frequent, or too few, cleanings can adversely impact their health.",
        "”Reset” your tank with water changes.",
        "Performing partial changes is also an excellent way to re-establish stability in your tank after an unusual event, such as a re-scaping or a chemical overdose.",
        "Don’t be afraid to do an unscheduled water change in these cases as the reward is worth it.",
        "Limit your light usage.",
        "If you run your aquarium lights all day and every day, you will likely see a quick, aggressive accumulation of algae and debris.",
        "This is because the light is helping the algae to feed off of your tank.",
        "Instead, try keeping your lights on for 10-14 hours for tanks with live plants or 6-10 hours otherwise.",
        "Avoid overfeeding.",
        "Much of the debris that you siphon out of the gravel will be leftover food.",
        "To avoid this issue, resist the desire to overfeed and instead stick with a once or twice daily schedule.",
        "And, adjust your feeding practices depending on how well your fish eat what is offered."
    ]
}