{
    "title": "How to Play a Cornet",
    "url": "https://www.wikihow.com/Play-a-Cornet",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Music",
        "Musical Instruments",
        "Brass Musical Instruments",
        "Trumpet and Cornet"
    ],
    "steps": [
        {
            "headline": "Remove the mouthpiece of your cornet.",
            "description": "It should come out with a simple tug. Place the mouthpiece on your lips, half on the upper, half on the lower. Some argue that it should be two-thirds on the lower, but that does not matter at this stage. With the mouthpiece on your lips, \"buzz\" your lips. It should sound something similar to a swarm of bees. You may not get it the first try, and if you don’t, keep trying until you get it."
        },
        {
            "headline": "Replace the mouthpiece on the cornet.",
            "description": "Put your right hand on the keys so your pointer finger is on the first key, the middle finger is on the second key, and the ring finger is on the third key. The pinky will go on the ring and the thumb should grasp the casing of the first valve. Your left hand will also grasp the valve casings, but the pinky will go in the third valve slide ring."
        },
        {
            "headline": "Now that you have a hold on your cornet, put it back to your lips with the mouthpiece half on the upper lip as it was before.",
            "description": "Buzz your lips with all valves up. Most likely, you just played the low C, which is one of the easiest notes to learn."
        },
        {
            "headline": "Press valves 1 and 3.",
            "description": "Buzz again, but this time, tighten your lips a bit. As you do this move you do this move your left ring finger to move the slide. That is a D."
        },
        {
            "headline": "Press valves 1 and 2 for an E. As before, tighten your lips even more for this note.",
            "description": "Press only valve 1 for F. For G, leave all valves up, but tighten your lips even more."
        },
        {
            "headline": "Now let's go back down.",
            "description": "Play G. Loosen your lips a little and play F. Loosen them some more and play E. Keep going to low C."
        },
        {
            "headline": "Once you're comfortable playing the notes, you need to know how to \"tongue\".",
            "description": "The basic idea is to tap your tongue on the roof of your mouth while you're playing. Play a low C and hold it. Now, tongue as described. If it helps say \"TA\" or \"DA\" while you tongue."
        },
        {
            "headline": "Now, perform steps 3-6 on the cornet again.",
            "description": "This time, however, tongue at the beginning of each note. Repeat until you are comfortable with it."
        }
    ],
    "tyn": [
        "Cornet pitched in B flat (This is the most common kind)"
    ],
    "text": " Remove the mouthpiece of your cornet. It should come out with a simple tug. Place the mouthpiece on your lips, half on the upper, half on the lower. Some argue that it should be two-thirds on the lower, but that does not matter at this stage. With the mouthpiece on your lips, \"buzz\" your lips. It should sound something similar to a swarm of bees. You may not get it the first try, and if you don’t, keep trying until you get it. Replace the mouthpiece on the cornet. Put your right hand on the keys so your pointer finger is on the first key, the middle finger is on the second key, and the ring finger is on the third key. The pinky will go on the ring and the thumb should grasp the casing of the first valve. Your left hand will also grasp the valve casings, but the pinky will go in the third valve slide ring. Now that you have a hold on your cornet, put it back to your lips with the mouthpiece half on the upper lip as it was before. Buzz your lips with all valves up. Most likely, you just played the low C, which is one of the easiest notes to learn. Press valves 1 and 3. Buzz again, but this time, tighten your lips a bit. As you do this move you do this move your left ring finger to move the slide. That is a D. Press valves 1 and 2 for an E. As before, tighten your lips even more for this note. Press only valve 1 for F. For G, leave all valves up, but tighten your lips even more. Now let's go back down. Play G. Loosen your lips a little and play F. Loosen them some more and play E. Keep going to low C. Once you're comfortable playing the notes, you need to know how to \"tongue\". The basic idea is to tap your tongue on the roof of your mouth while you're playing. Play a low C and hold it. Now, tongue as described. If it helps say \"TA\" or \"DA\" while you tongue. Now, perform steps 3-6 on the cornet again. This time, however, tongue at the beginning of each note. Repeat until you are comfortable with it.",
    "sentences": [
        " Remove the mouthpiece of your cornet.",
        "It should come out with a simple tug.",
        "Place the mouthpiece on your lips, half on the upper, half on the lower.",
        "Some argue that it should be two-thirds on the lower, but that does not matter at this stage.",
        "With the mouthpiece on your lips, \"buzz\" your lips.",
        "It should sound something similar to a swarm of bees.",
        "You may not get it the first try, and if you don’t, keep trying until you get it.",
        "Replace the mouthpiece on the cornet.",
        "Put your right hand on the keys so your pointer finger is on the first key, the middle finger is on the second key, and the ring finger is on the third key.",
        "The pinky will go on the ring and the thumb should grasp the casing of the first valve.",
        "Your left hand will also grasp the valve casings, but the pinky will go in the third valve slide ring.",
        "Now that you have a hold on your cornet, put it back to your lips with the mouthpiece half on the upper lip as it was before.",
        "Buzz your lips with all valves up.",
        "Most likely, you just played the low C, which is one of the easiest notes to learn.",
        "Press valves 1 and 3.",
        "Buzz again, but this time, tighten your lips a bit.",
        "As you do this move you do this move your left ring finger to move the slide.",
        "That is a D. Press valves 1 and 2 for an E. As before, tighten your lips even more for this note.",
        "Press only valve 1 for F. For G, leave all valves up, but tighten your lips even more.",
        "Now let's go back down.",
        "Play G. Loosen your lips a little and play F. Loosen them some more and play E. Keep going to low C. Once you're comfortable playing the notes, you need to know how to \"tongue\".",
        "The basic idea is to tap your tongue on the roof of your mouth while you're playing.",
        "Play a low C and hold it.",
        "Now, tongue as described.",
        "If it helps say \"TA\" or \"DA\" while you tongue.",
        "Now, perform steps 3-6 on the cornet again.",
        "This time, however, tongue at the beginning of each note.",
        "Repeat until you are comfortable with it."
    ]
}