{
    "title": "How to Make a Fairy Tiara",
    "url": "https://www.wikihow.com/Make-a-Fairy-Tiara",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "methods": [
        {
            "name": "Making a Pipe Cleaner Tiara",
            "steps": [
                {
                    "headline": "Wrap pipe cleaners around a thin, metal headband.",
                    "description": "Begin and finish wrapping the pipe cleaners 1 to 2 inches (2.54 to 5.08 centimeters) from the ends of the headband. You can use any color of pipe cleaner you want, but metallic colors, such as gold, silver, or even metallic green, are especially popular among fairies. If you don't have a headband, you can twist and loop pipe cleaners to make a ring big enough to set on your child's head. If you don't have any headbands or pipe cleaners handy, you can strips of tin foil, and twist it into a circlet big enough to fit over your child's head."
                },
                {
                    "headline": "Cut three pipe cleaners in half.",
                    "description": "Set a fourth pipe cleaner aside; leave that one whole. Try to use the same color of pipe cleaner as you did for the headband. If you don't have enough, try a matching color. Metallic green would look great with silver! If you don't have pipe cleaners, you can twist tin foil into 6-inch (15.24) long ropes for the short pieces. Twist a fourth one into a 12-inch (30.48-centimeter) rope for the long piece."
                },
                {
                    "headline": "Loop and twist the short pipe cleaners into V shapes.",
                    "description": "Wrap the middle of a short pipe cleaner around your finger, then twist it once or twice to form a loop. Slide the pipe cleaner off of your finger, then pry open the ends. You will have a shape that looks like an upside down V with a loop on the top. Repeat this step for all of the short pipe cleaners."
                },
                {
                    "headline": "Fold the fourth pipe cleaner into V with a heart at the tip.",
                    "description": "Fold the middle of the pipe cleaner into an m-like shape. Twist the legs together once or twice to complete the heart shape, then spread the tails open to make an upside down V."
                },
                {
                    "headline": "Twist the bottom ends of the heart-V piece onto the headband.",
                    "description": "Place the heart-V piece over the top-center of the headband. Twist the ends of the upside down V over the headband twice to lock it in place. Your headband will now have a triangle with a heart on it."
                },
                {
                    "headline": "Twist the remaining pieces onto the headband, three on each side of the heart-V.",
                    "description": "Twist the remaining pieces using the same technique as you did for the heart-V piece. You will need three on the left side of the heart, and three on the right. Make sure that the ends are all side-by-side and touching."
                },
                {
                    "headline": "Orient the headband horizontally and turn the spikes up.",
                    "description": "Set the headband flat on the table. Turn each of the spikes upwards, so that they are at 90-degree angles to the headband. You will now have something that looks like a tiara! If you want to make it even more tiara-like, you can hot glue plastic combs to the ends of the headband. Make sure that they are pointing downwards, away from the spikes."
                },
                {
                    "headline": "Decorate the tiara with rhinestones.",
                    "description": "Use hot glue to secure rhinestones over the headband and the spikes. You can place them wherever you want. Great places include the little o-shaped loops on top of the spikes, and the spots on the headband where the spikes connect. Don't want to use rhinestones? No problem! Try pearls, beads, fancy buttons, pompoms, sequins, or even tiny, fake flowers."
                }
            ]
        },
        {
            "name": "Making a Lace Crown",
            "steps": [
                {
                    "headline": "Roll poster paper into a tube, then cover it with plastic wrap.",
                    "description": "Roll a sheet of poster paper until it is big enough to fit your child's head. Use a few pieces of tape to hold it together. Next, wrap the poster paper tube with plastic wrap or wax paper. This will keep the paint from sticking. If you want to make a mini crown, you can use a cardstock instead."
                },
                {
                    "headline": "Wrap a piece of crocheted lace trim around the tube, then secure it with a pin.",
                    "description": "Choose some crocheted lace trim that you think would look nice as a crown. Something with peaks and points would work great. Wrap the lace around the tub with ½-inch (1.27-centimeter) overlap, then secure it with a pin."
                },
                {
                    "headline": "Spray the lace with clear, acrylic spray sealer.",
                    "description": "Head off to a well-ventilated area. Coat the lace with clear, acrylic spray. Let the spray dry before moving on. Make sure that the spray has a glossy finish. If you don't want to use spray sealer, you can paint on a layer of clear decoupage glue (ie: Mod Podge) or fabric stiffener instead."
                },
                {
                    "headline": "Spray the lace with your desired color of spray paint.",
                    "description": "Metallic colors, such as gold or silver, will work the best, but you can use any color of spray paint you want. Wait for the spray paint to dry, then add a final coat of clear, acrylic sealer, if desired. If you don't want to use spray paint, use acrylic paint instead. If you are happy with the color of your lace, skip this step."
                },
                {
                    "headline": "Remove the crown, flip it over, and repeat the process on the other side.",
                    "description": "Remove the pin and peel the crown off. Flip the crown over, wrap it back around the tube, and pin it in place. Spray it again with clear sealer, then let the sealer dry. Follow up with spray paint and a final coat of sealer. Skip the spray paint if you like the color of the lace."
                },
                {
                    "headline": "Let the crown dry, remove it, then let it finish drying.",
                    "description": "Once the crown feels dry to the touch, remove the pin and peel it off. Roll it back into shape, with the ends overlapping by ½ inch (1.27 centimeters), and secure it with a pin. Let the crown finish drying on a flat surface."
                },
                {
                    "headline": "Glue the ends of the lace together.",
                    "description": "Once the once is completely dry, remove the pin. Secure the ends with hot glue, fabric glue, or industrial-strength glue (ie: E6000). If you did a mini crown, you might want to tie a piece of clear elastic to each side so that you can strap it under the chin."
                },
                {
                    "headline": "Decorate the crown with rhinestones and other embellishments, if desired.",
                    "description": "Pick out some sparkly embellishments that match the fairy costume. Decorate the crown to your heart's content, but don't get too carried away, otherwise the crown will be too heavy. Here are some decorating ideas:\nOutline some of the shapes with glitter glue in a contrasting color. Glue a strip of rhinestone trim along the bottom edge of the crown. Glue tiny rhinestones to the points. Decorate the body of the crown with larger rhinestones, brooches, cabochons, etc."
                }
            ]
        },
        {
            "name": "Making a Floral Crown",
            "steps": [
                {
                    "headline": "Cut some grapevine wire to three times the length you need.",
                    "description": "Measure around your child's head first, then cut a piece of grapevine wire to that's three times that length. If you can't find grapevine wire, you can use paper-wrapped wire or plain florist's wire instead. Use a pair of sturdy wire cutters for this so that you don't ruin your scissors."
                },
                {
                    "headline": "Coil the wire into a twisted ring.",
                    "description": "Roll the wire into a ring big enough to fit your child's head. Wrap the excess wire around it to create a thick, twisted band. Fold the ends of the wire down, then cover them with hot glue. This will keep them from scratching and snagging. If you used plain florist's wire, wrap the entire crown with green florist's tape."
                },
                {
                    "headline": "Cut three lengths of ¼-inch (0.64-centimeter) of satin ribbon.",
                    "description": "Choose 1 to 3 colors of ribbon. Measure and cut the ribbon to three 36-inch (91.44-centimeter) pieces. For a nicer finish, cut the ends of the ribbon at an angle. For a more magical effect, switch out one of the strands for sheer, iridescent, or metallic ribbon instead. Keep the ribbon from fraying by holding the ends over a flame until the fibers melt."
                },
                {
                    "headline": "Secure the ribbons to the crown with a slip knot.",
                    "description": "Stack all of the ribbons together so that the ends and edges match up. Fold the stack in half, then tuck the folded end down through the crown by 1 inch (2.54 centimeters). Pull the tails over the top of the wire and down through the loop. Gently tug on the tails to tighten the knot."
                },
                {
                    "headline": "Choose flowers or leaves that match your fairy costume.",
                    "description": "If your costume already has flowers on it, try to get the same kind. Small and medium-sized flowers will work the best. It would also be a good idea to think about the season as well. For example:\nSpring: choose bulb flowers, such as daffodils, crocus, or tulips. Summer: choose bright and colorful flowers. Fall: get a packet of Fall (maple) leaves and some acorns. Winter: try holly leaves, or use any white-colored flowers and leaves."
                },
                {
                    "headline": "Pull the flowers off of their stems.",
                    "description": "This will allow you to hot glue the flowers right onto the crown. If you don't want to use a hot glue gun, cut the flowers down to 1 to 2 inches (2.54 to 5.08 centimeters). This will allow you to stick the flowers between the wires instead."
                },
                {
                    "headline": "Hot glue the flowers to your crown.",
                    "description": "Start with the larger flowers, then fill in the gaps with the medium and small flowers. You can glue on as many or as few flowers as you want. Make sure that you are only gluing them to the outside of the crown and not the inside. If you cut the flowers, slide the 1 to 2-inch (2.54 to 5.08-centimeter) stems between the wrapped wires."
                },
                {
                    "headline": "Add some character with embellishments, if desired.",
                    "description": "If you notice some gaps on your tiara, but don't want to add more flowers, you could add other items, such as: leaves, feathers, fake berries, or even fake butterflies. Be sure to use colors that go well with your tiara. If you are creating a Fall fairy, try some acorns or twigs. If you are creating a Winter fairy, get some fake snowflakes, silver rhinestones, or holly berries. If you are a woodland fairy, add some acorns and fake toadstools."
                }
            ]
        }
    ],
    "tyn": [
        "Making a Pipe Cleaner Tiara",
        "Thin, metal headband",
        "Pipe cleaners, preferably metallic",
        "Rhinestones",
        "Hot glue gun and hot glue sticks",
        "Plastic tiara combs (optional)",
        "Making a Lace Crown",
        "Poster paper",
        "Plastic wrap",
        "Tape",
        "Crocheted lace",
        "Sewing pin",
        "Clear, acrylic sealer",
        "Spray paint",
        "Glue",
        "Scissors",
        "Rhinestones, glitter glue, etc.",
        "Making a Floral Crown",
        "Wire cutters",
        "Brown grapevine wire",
        "Fake flowers",
        "¼-inch (0.64-centimeter) satin ribbon in various colors",
        "Butterfly picks (optional)",
        "Spanish moss (optional)",
        "Feathers (optional)",
        "Rhinestones (optional)",
        "1-inch (2.54-centimeter) burlap ribbon (optional)"
    ],
    "text": " Making a Pipe Cleaner Tiara Wrap pipe cleaners around a thin, metal headband. Begin and finish wrapping the pipe cleaners 1 to 2 inches (2.54 to 5.08 centimeters) from the ends of the headband. You can use any color of pipe cleaner you want, but metallic colors, such as gold, silver, or even metallic green, are especially popular among fairies. If you don't have a headband, you can twist and loop pipe cleaners to make a ring big enough to set on your child's head. If you don't have any headbands or pipe cleaners handy, you can strips of tin foil, and twist it into a circlet big enough to fit over your child's head. Cut three pipe cleaners in half. Set a fourth pipe cleaner aside; leave that one whole. Try to use the same color of pipe cleaner as you did for the headband. If you don't have enough, try a matching color. Metallic green would look great with silver! If you don't have pipe cleaners, you can twist tin foil into 6-inch (15.24) long ropes for the short pieces. Twist a fourth one into a 12-inch (30.48-centimeter) rope for the long piece. Loop and twist the short pipe cleaners into V shapes. Wrap the middle of a short pipe cleaner around your finger, then twist it once or twice to form a loop. Slide the pipe cleaner off of your finger, then pry open the ends. You will have a shape that looks like an upside down V with a loop on the top. Repeat this step for all of the short pipe cleaners. Fold the fourth pipe cleaner into V with a heart at the tip. Fold the middle of the pipe cleaner into an m-like shape. Twist the legs together once or twice to complete the heart shape, then spread the tails open to make an upside down V. Twist the bottom ends of the heart-V piece onto the headband. Place the heart-V piece over the top-center of the headband. Twist the ends of the upside down V over the headband twice to lock it in place. Your headband will now have a triangle with a heart on it. Twist the remaining pieces onto the headband, three on each side of the heart-V. Twist the remaining pieces using the same technique as you did for the heart-V piece. You will need three on the left side of the heart, and three on the right. Make sure that the ends are all side-by-side and touching. Orient the headband horizontally and turn the spikes up. Set the headband flat on the table. Turn each of the spikes upwards, so that they are at 90-degree angles to the headband. You will now have something that looks like a tiara! If you want to make it even more tiara-like, you can hot glue plastic combs to the ends of the headband. Make sure that they are pointing downwards, away from the spikes. Decorate the tiara with rhinestones. Use hot glue to secure rhinestones over the headband and the spikes. You can place them wherever you want. Great places include the little o-shaped loops on top of the spikes, and the spots on the headband where the spikes connect. Don't want to use rhinestones? No problem! Try pearls, beads, fancy buttons, pompoms, sequins, or even tiny, fake flowers. Making a Lace Crown Roll poster paper into a tube, then cover it with plastic wrap. Roll a sheet of poster paper until it is big enough to fit your child's head. Use a few pieces of tape to hold it together. Next, wrap the poster paper tube with plastic wrap or wax paper. This will keep the paint from sticking. If you want to make a mini crown, you can use a cardstock instead. Wrap a piece of crocheted lace trim around the tube, then secure it with a pin. Choose some crocheted lace trim that you think would look nice as a crown. Something with peaks and points would work great. Wrap the lace around the tub with ½-inch (1.27-centimeter) overlap, then secure it with a pin. Spray the lace with clear, acrylic spray sealer. Head off to a well-ventilated area. Coat the lace with clear, acrylic spray. Let the spray dry before moving on. Make sure that the spray has a glossy finish. If you don't want to use spray sealer, you can paint on a layer of clear decoupage glue (ie: Mod Podge) or fabric stiffener instead. Spray the lace with your desired color of spray paint. Metallic colors, such as gold or silver, will work the best, but you can use any color of spray paint you want. Wait for the spray paint to dry, then add a final coat of clear, acrylic sealer, if desired. If you don't want to use spray paint, use acrylic paint instead. If you are happy with the color of your lace, skip this step. Remove the crown, flip it over, and repeat the process on the other side. Remove the pin and peel the crown off. Flip the crown over, wrap it back around the tube, and pin it in place. Spray it again with clear sealer, then let the sealer dry. Follow up with spray paint and a final coat of sealer. Skip the spray paint if you like the color of the lace. Let the crown dry, remove it, then let it finish drying. Once the crown feels dry to the touch, remove the pin and peel it off. Roll it back into shape, with the ends overlapping by ½ inch (1.27 centimeters), and secure it with a pin. Let the crown finish drying on a flat surface. Glue the ends of the lace together. Once the once is completely dry, remove the pin. Secure the ends with hot glue, fabric glue, or industrial-strength glue (ie: E6000). If you did a mini crown, you might want to tie a piece of clear elastic to each side so that you can strap it under the chin. Decorate the crown with rhinestones and other embellishments, if desired. Pick out some sparkly embellishments that match the fairy costume. Decorate the crown to your heart's content, but don't get too carried away, otherwise the crown will be too heavy. Here are some decorating ideas:\nOutline some of the shapes with glitter glue in a contrasting color. Glue a strip of rhinestone trim along the bottom edge of the crown. Glue tiny rhinestones to the points. Decorate the body of the crown with larger rhinestones, brooches, cabochons, etc. Making a Floral Crown Cut some grapevine wire to three times the length you need. Measure around your child's head first, then cut a piece of grapevine wire to that's three times that length. If you can't find grapevine wire, you can use paper-wrapped wire or plain florist's wire instead. Use a pair of sturdy wire cutters for this so that you don't ruin your scissors. Coil the wire into a twisted ring. Roll the wire into a ring big enough to fit your child's head. Wrap the excess wire around it to create a thick, twisted band. Fold the ends of the wire down, then cover them with hot glue. This will keep them from scratching and snagging. If you used plain florist's wire, wrap the entire crown with green florist's tape. Cut three lengths of ¼-inch (0.64-centimeter) of satin ribbon. Choose 1 to 3 colors of ribbon. Measure and cut the ribbon to three 36-inch (91.44-centimeter) pieces. For a nicer finish, cut the ends of the ribbon at an angle. For a more magical effect, switch out one of the strands for sheer, iridescent, or metallic ribbon instead. Keep the ribbon from fraying by holding the ends over a flame until the fibers melt. Secure the ribbons to the crown with a slip knot. Stack all of the ribbons together so that the ends and edges match up. Fold the stack in half, then tuck the folded end down through the crown by 1 inch (2.54 centimeters). Pull the tails over the top of the wire and down through the loop. Gently tug on the tails to tighten the knot. Choose flowers or leaves that match your fairy costume. If your costume already has flowers on it, try to get the same kind. Small and medium-sized flowers will work the best. It would also be a good idea to think about the season as well. For example:\nSpring: choose bulb flowers, such as daffodils, crocus, or tulips. Summer: choose bright and colorful flowers. Fall: get a packet of Fall (maple) leaves and some acorns. Winter: try holly leaves, or use any white-colored flowers and leaves. Pull the flowers off of their stems. This will allow you to hot glue the flowers right onto the crown. If you don't want to use a hot glue gun, cut the flowers down to 1 to 2 inches (2.54 to 5.08 centimeters). This will allow you to stick the flowers between the wires instead. Hot glue the flowers to your crown. Start with the larger flowers, then fill in the gaps with the medium and small flowers. You can glue on as many or as few flowers as you want. Make sure that you are only gluing them to the outside of the crown and not the inside. If you cut the flowers, slide the 1 to 2-inch (2.54 to 5.08-centimeter) stems between the wrapped wires. Add some character with embellishments, if desired. If you notice some gaps on your tiara, but don't want to add more flowers, you could add other items, such as: leaves, feathers, fake berries, or even fake butterflies. Be sure to use colors that go well with your tiara. If you are creating a Fall fairy, try some acorns or twigs. If you are creating a Winter fairy, get some fake snowflakes, silver rhinestones, or holly berries. If you are a woodland fairy, add some acorns and fake toadstools.",
    "sentences": [
        " Making a Pipe Cleaner Tiara Wrap pipe cleaners around a thin, metal headband.",
        "Begin and finish wrapping the pipe cleaners 1 to 2 inches (2.54 to 5.08 centimeters) from the ends of the headband.",
        "You can use any color of pipe cleaner you want, but metallic colors, such as gold, silver, or even metallic green, are especially popular among fairies.",
        "If you don't have a headband, you can twist and loop pipe cleaners to make a ring big enough to set on your child's head.",
        "If you don't have any headbands or pipe cleaners handy, you can strips of tin foil, and twist it into a circlet big enough to fit over your child's head.",
        "Cut three pipe cleaners in half.",
        "Set a fourth pipe cleaner aside; leave that one whole.",
        "Try to use the same color of pipe cleaner as you did for the headband.",
        "If you don't have enough, try a matching color.",
        "Metallic green would look great with silver!",
        "If you don't have pipe cleaners, you can twist tin foil into 6-inch (15.24) long ropes for the short pieces.",
        "Twist a fourth one into a 12-inch (30.48-centimeter) rope for the long piece.",
        "Loop and twist the short pipe cleaners into V shapes.",
        "Wrap the middle of a short pipe cleaner around your finger, then twist it once or twice to form a loop.",
        "Slide the pipe cleaner off of your finger, then pry open the ends.",
        "You will have a shape that looks like an upside down V with a loop on the top.",
        "Repeat this step for all of the short pipe cleaners.",
        "Fold the fourth pipe cleaner into V with a heart at the tip.",
        "Fold the middle of the pipe cleaner into an m-like shape.",
        "Twist the legs together once or twice to complete the heart shape, then spread the tails open to make an upside down V. Twist the bottom ends of the heart-V piece onto the headband.",
        "Place the heart-V piece over the top-center of the headband.",
        "Twist the ends of the upside down V over the headband twice to lock it in place.",
        "Your headband will now have a triangle with a heart on it.",
        "Twist the remaining pieces onto the headband, three on each side of the heart-V.",
        "Twist the remaining pieces using the same technique as you did for the heart-V piece.",
        "You will need three on the left side of the heart, and three on the right.",
        "Make sure that the ends are all side-by-side and touching.",
        "Orient the headband horizontally and turn the spikes up.",
        "Set the headband flat on the table.",
        "Turn each of the spikes upwards, so that they are at 90-degree angles to the headband.",
        "You will now have something that looks like a tiara!",
        "If you want to make it even more tiara-like, you can hot glue plastic combs to the ends of the headband.",
        "Make sure that they are pointing downwards, away from the spikes.",
        "Decorate the tiara with rhinestones.",
        "Use hot glue to secure rhinestones over the headband and the spikes.",
        "You can place them wherever you want.",
        "Great places include the little o-shaped loops on top of the spikes, and the spots on the headband where the spikes connect.",
        "Don't want to use rhinestones?",
        "No problem!",
        "Try pearls, beads, fancy buttons, pompoms, sequins, or even tiny, fake flowers.",
        "Making a Lace Crown Roll poster paper into a tube, then cover it with plastic wrap.",
        "Roll a sheet of poster paper until it is big enough to fit your child's head.",
        "Use a few pieces of tape to hold it together.",
        "Next, wrap the poster paper tube with plastic wrap or wax paper.",
        "This will keep the paint from sticking.",
        "If you want to make a mini crown, you can use a cardstock instead.",
        "Wrap a piece of crocheted lace trim around the tube, then secure it with a pin.",
        "Choose some crocheted lace trim that you think would look nice as a crown.",
        "Something with peaks and points would work great.",
        "Wrap the lace around the tub with ½-inch (1.27-centimeter) overlap, then secure it with a pin.",
        "Spray the lace with clear, acrylic spray sealer.",
        "Head off to a well-ventilated area.",
        "Coat the lace with clear, acrylic spray.",
        "Let the spray dry before moving on.",
        "Make sure that the spray has a glossy finish.",
        "If you don't want to use spray sealer, you can paint on a layer of clear decoupage glue (ie: Mod Podge) or fabric stiffener instead.",
        "Spray the lace with your desired color of spray paint.",
        "Metallic colors, such as gold or silver, will work the best, but you can use any color of spray paint you want.",
        "Wait for the spray paint to dry, then add a final coat of clear, acrylic sealer, if desired.",
        "If you don't want to use spray paint, use acrylic paint instead.",
        "If you are happy with the color of your lace, skip this step.",
        "Remove the crown, flip it over, and repeat the process on the other side.",
        "Remove the pin and peel the crown off.",
        "Flip the crown over, wrap it back around the tube, and pin it in place.",
        "Spray it again with clear sealer, then let the sealer dry.",
        "Follow up with spray paint and a final coat of sealer.",
        "Skip the spray paint if you like the color of the lace.",
        "Let the crown dry, remove it, then let it finish drying.",
        "Once the crown feels dry to the touch, remove the pin and peel it off.",
        "Roll it back into shape, with the ends overlapping by ½ inch (1.27 centimeters), and secure it with a pin.",
        "Let the crown finish drying on a flat surface.",
        "Glue the ends of the lace together.",
        "Once the once is completely dry, remove the pin.",
        "Secure the ends with hot glue, fabric glue, or industrial-strength glue (ie: E6000).",
        "If you did a mini crown, you might want to tie a piece of clear elastic to each side so that you can strap it under the chin.",
        "Decorate the crown with rhinestones and other embellishments, if desired.",
        "Pick out some sparkly embellishments that match the fairy costume.",
        "Decorate the crown to your heart's content, but don't get too carried away, otherwise the crown will be too heavy.",
        "Here are some decorating ideas:\nOutline some of the shapes with glitter glue in a contrasting color.",
        "Glue a strip of rhinestone trim along the bottom edge of the crown.",
        "Glue tiny rhinestones to the points.",
        "Decorate the body of the crown with larger rhinestones, brooches, cabochons, etc.",
        "Making a Floral Crown Cut some grapevine wire to three times the length you need.",
        "Measure around your child's head first, then cut a piece of grapevine wire to that's three times that length.",
        "If you can't find grapevine wire, you can use paper-wrapped wire or plain florist's wire instead.",
        "Use a pair of sturdy wire cutters for this so that you don't ruin your scissors.",
        "Coil the wire into a twisted ring.",
        "Roll the wire into a ring big enough to fit your child's head.",
        "Wrap the excess wire around it to create a thick, twisted band.",
        "Fold the ends of the wire down, then cover them with hot glue.",
        "This will keep them from scratching and snagging.",
        "If you used plain florist's wire, wrap the entire crown with green florist's tape.",
        "Cut three lengths of ¼-inch (0.64-centimeter) of satin ribbon.",
        "Choose 1 to 3 colors of ribbon.",
        "Measure and cut the ribbon to three 36-inch (91.44-centimeter) pieces.",
        "For a nicer finish, cut the ends of the ribbon at an angle.",
        "For a more magical effect, switch out one of the strands for sheer, iridescent, or metallic ribbon instead.",
        "Keep the ribbon from fraying by holding the ends over a flame until the fibers melt.",
        "Secure the ribbons to the crown with a slip knot.",
        "Stack all of the ribbons together so that the ends and edges match up.",
        "Fold the stack in half, then tuck the folded end down through the crown by 1 inch (2.54 centimeters).",
        "Pull the tails over the top of the wire and down through the loop.",
        "Gently tug on the tails to tighten the knot.",
        "Choose flowers or leaves that match your fairy costume.",
        "If your costume already has flowers on it, try to get the same kind.",
        "Small and medium-sized flowers will work the best.",
        "It would also be a good idea to think about the season as well.",
        "For example:\nSpring: choose bulb flowers, such as daffodils, crocus, or tulips.",
        "Summer: choose bright and colorful flowers.",
        "Fall: get a packet of Fall (maple) leaves and some acorns.",
        "Winter: try holly leaves, or use any white-colored flowers and leaves.",
        "Pull the flowers off of their stems.",
        "This will allow you to hot glue the flowers right onto the crown.",
        "If you don't want to use a hot glue gun, cut the flowers down to 1 to 2 inches (2.54 to 5.08 centimeters).",
        "This will allow you to stick the flowers between the wires instead.",
        "Hot glue the flowers to your crown.",
        "Start with the larger flowers, then fill in the gaps with the medium and small flowers.",
        "You can glue on as many or as few flowers as you want.",
        "Make sure that you are only gluing them to the outside of the crown and not the inside.",
        "If you cut the flowers, slide the 1 to 2-inch (2.54 to 5.08-centimeter) stems between the wrapped wires.",
        "Add some character with embellishments, if desired.",
        "If you notice some gaps on your tiara, but don't want to add more flowers, you could add other items, such as: leaves, feathers, fake berries, or even fake butterflies.",
        "Be sure to use colors that go well with your tiara.",
        "If you are creating a Fall fairy, try some acorns or twigs.",
        "If you are creating a Winter fairy, get some fake snowflakes, silver rhinestones, or holly berries.",
        "If you are a woodland fairy, add some acorns and fake toadstools."
    ]
}