{
    "title": "How to Photograph Hummingbirds",
    "url": "https://www.wikihow.com/Photograph-Hummingbirds",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "parts": [
        {
            "name": "Setting up a Location",
            "steps": [
                {
                    "headline": "Set up a hummingbird feeder near your home.",
                    "description": "Hummingbirds are drawn to the brightly-colored feeders and sweet liquid inside, so if you hang one near your home in the warm summer months, you'll soon have a handful of birds coming by to eat every day. Position the feeder in a location where you can see it easily (e.g., in front of a kitchen window) so you'll know when the birds are coming by to eat. Then, grab your camera! If you happen to have more than 1 feeder already in place, take 1 down. You should only have 1 feeder hanging, so that all of the birds congregate in a single location."
                },
                {
                    "headline": "Sit or stand near the feeder so the birds acclimate to your presence.",
                    "description": "Hummingbirds are skittish and easily frightened off by humans walking around. In order to let the birds get used to you being nearby, sit or stand between 10–15 feet (3.0–4.6 m) away from the feeder. Photographing hummingbirds takes patience. Plan to sit still (though not completely motionless) for at least 15–30 minutes before the birds are comfortable enough to start feeding. If it's a sunny day and you don't have other plans, you could even take a lawn chair out to the hummingbird feeder! You may need to spend several hours around the feeder anyway, waiting for the birds to arrive and taking various photos before you get a great one."
                },
                {
                    "headline": "Remove the feeder's perches and tape shut all but 1 of the holes.",
                    "description": "Since you most likely want to photograph the hummingbirds in flight, take off the feeder's perches so the birds will have to hover while they're feeding. Then, tear off 3 or 4 strips of scotch tape and use them to cover the feeder's holes, leaving only 1 open. This will ensure that the birds all feed at the exact same location, making it easier to set up your camera to take high-quality photos. With the perches removed and most of the holes blocked, you know where the bird will be and it will be much easier to position your shot."
                }
            ]
        },
        {
            "name": "Positioning your Camera for Shooting",
            "steps": [
                {
                    "headline": "Set up your tripod about 11–12 ft (3.4–3.7 m) away from the feeder.",
                    "description": "This is a great distance from which to shoot hummingbirds. Being a little farther than 10 feet (3.0 m) from the birds will allow you to compose the shots as you like. The distance will also let you focus on the bird without the background of the photograph overwhelming the subject. If your particular setup doesn't allow you to situate the tripod this far from the feeder, don't worry. You can always zoom out more with your lens if you're closer, or crop out blank space around the bird if you're too far away."
                },
                {
                    "headline": "Use a telephoto lens if you're shooting from farther away.",
                    "description": "If you had to set up your tripod much farther than 12 feet (3.7 m) from the hummingbird feeder, you'll need to use a lens with a zoom capacity. Otherwise, if your tripod happens to be positioned closer to the feeder, using a regular 35 mm lens will be fine. If your camera doesn't already have a good-quality lens, you can purchase one at a photography store. Telephoto lenses also have another perk: in letting you shoot from farther away, they lower the likelihood that you'll spook the birds when you start snapping pictures. More experienced photographers may even choose to use a wide-angle or fisheye lens and position the tripod only about 10–12 inches (25–30 cm) away from the birds. Since this would put you extremely close to the birds, you'd need to trigger the camera shutter remotely."
                },
                {
                    "headline": "Set up 3–4 flashes around the birdfeeder to light the hummingbirds.",
                    "description": "Flashes are small electric bulbs that will provide a burst of light when you click the camera's shutter button. Position your flashes so they're only 1–3 feet (0.30–0.91 m) away from the birdfeeder, and set them to low power. You only want each flash to be at about 1/16 of its full strength so that the flashes don't over-expose the birds' colorful bodies. Depending on the height of your birdfeeder, you may need to set up the flashes on their own small tripods. Lighting the scene with flashes will ensure that you have consistently good lighting regardless of the time of day you're shooting at. In most cases, if you're shooting during the daylight hours, hummingbirds shouldn't be scared off by flashes. This step is technically optional. If you prefer to work without flashes, or if you're shooting in an area with bright, indirect sunlight, you may not need a flash at all."
                }
            ]
        },
        {
            "name": "Adjusting Your Camera Settings",
            "steps": [
                {
                    "headline": "Choose an ISO around 400 or 800 to get crisp, detailed photos.",
                    "description": "If you're using a digital SLR, simply adjust the ISO setting on your camera to 400 or 800. 400 is a relatively slow film speed, so make sure you're shooting in bright sunlight or else the pictures may come out underexposed. If you're shooting with film, you can purchase rolls of 400 or 800 ISO film at a photography outlet store. If you're shooting with a slow film speed in low-light conditions, you'll need to shoot with a flash to avoid taking dark photos."
                },
                {
                    "headline": "Turn on your lens's autofocus feature for quicker focus.",
                    "description": "Nearly all SLR digital and film cameras have an autofocus feature that continually focuses the lens on whatever object is in the center of the viewfinder. Hummingbirds will be flying much too fast for you to try to manually focus your lens on them, and using the autofocus will let you focus on timing and composing the shot. If you're using a cheaper non-SLR camera, you can typically engage the autofocus feature by pressing the shutter button halfway down."
                },
                {
                    "headline": "Set your shutter speed to at least 1/800 of a second.",
                    "description": "In order to freeze the lightning-quick wings of a hummingbird mid-flap, you'll need to use a very fast shutter speed. If you use too slow of a speed, you'll notice that the birds' wings are blurry and hard to see. In some cases, to avoid blurry wings on a fast-flying hummingbird, you'll need to use a shutter speed of at least 1/2500 of a second to freeze the birds in motion. Depending on the aesthetic of the photo you're trying to take, you may actually want the bird's wings to look blurry. In this case, use a slightly slower shutter speed to capture the wings' motion. Try a handful of different shutter speeds to see what works best. You could shoot 50 pictures at 1 shutter speed, then adjust it and shoot 50 more."
                },
                {
                    "headline": "Use a wide aperture around f/4 to adequately expose the photographs.",
                    "description": "Since you're using such a short shutter speed, you'll need to use a wide-open aperture setting to ensure that enough light gets into the camera. Manually set the aperture to f/1.4, f/4, or f/5 to prevent the shots from being dim and poorly lit. Using a fast shutter speed and a wide aperture means that you'll have a low depth of field, so the scenery behind the hummingbird will likely be out of focus. On some SLC cameras, the aperture is referred to as the f-stop. These terms mean the same thing."
                },
                {
                    "headline": "Snap 200–300 photos to ensure that you get a good one.",
                    "description": "The majority of the shots you take will, unfortunately, not be great. The bird will be out of focus or poorly exposed, the shot will be poorly composed, or the lighting will be off. To avoid ending the photo session empty-handed, take hundreds of photos of the birds. This will dramatically improve your chances of having 1 or 2 great photos you can be proud of. If you have a digital SLR camera, you could also try engaging the function that lets you take 3-5 photos in rapid succession. You could also try shooting a video of a hummingbird feeding and then select the best still video frame. If you're shooting with a digital camera, just make sure that you've cleared off enough memory on the device that you can fit hundreds of new photos. If you're shooting with film, be prepared to burn through 6–8 rolls."
                }
            ]
        }
    ],
    "tyn": [
        "Hummingbird feeder",
        "Scotch tape",
        "SLR camera",
        "Tripod",
        "35 mm lens",
        "3–4 flashes (optional)",
        "Telephoto lens (optional)",
        "Flash mounts (optional)"
    ],
    "text": " Setting up a Location Set up a hummingbird feeder near your home. Hummingbirds are drawn to the brightly-colored feeders and sweet liquid inside, so if you hang one near your home in the warm summer months, you'll soon have a handful of birds coming by to eat every day. Position the feeder in a location where you can see it easily (e.g., in front of a kitchen window) so you'll know when the birds are coming by to eat. Then, grab your camera! If you happen to have more than 1 feeder already in place, take 1 down. You should only have 1 feeder hanging, so that all of the birds congregate in a single location. Sit or stand near the feeder so the birds acclimate to your presence. Hummingbirds are skittish and easily frightened off by humans walking around. In order to let the birds get used to you being nearby, sit or stand between 10–15 feet (3.0–4.6 m) away from the feeder. Photographing hummingbirds takes patience. Plan to sit still (though not completely motionless) for at least 15–30 minutes before the birds are comfortable enough to start feeding. If it's a sunny day and you don't have other plans, you could even take a lawn chair out to the hummingbird feeder! You may need to spend several hours around the feeder anyway, waiting for the birds to arrive and taking various photos before you get a great one. Remove the feeder's perches and tape shut all but 1 of the holes. Since you most likely want to photograph the hummingbirds in flight, take off the feeder's perches so the birds will have to hover while they're feeding. Then, tear off 3 or 4 strips of scotch tape and use them to cover the feeder's holes, leaving only 1 open. This will ensure that the birds all feed at the exact same location, making it easier to set up your camera to take high-quality photos. With the perches removed and most of the holes blocked, you know where the bird will be and it will be much easier to position your shot. Positioning your Camera for Shooting Set up your tripod about 11–12 ft (3.4–3.7 m) away from the feeder. This is a great distance from which to shoot hummingbirds. Being a little farther than 10 feet (3.0 m) from the birds will allow you to compose the shots as you like. The distance will also let you focus on the bird without the background of the photograph overwhelming the subject. If your particular setup doesn't allow you to situate the tripod this far from the feeder, don't worry. You can always zoom out more with your lens if you're closer, or crop out blank space around the bird if you're too far away. Use a telephoto lens if you're shooting from farther away. If you had to set up your tripod much farther than 12 feet (3.7 m) from the hummingbird feeder, you'll need to use a lens with a zoom capacity. Otherwise, if your tripod happens to be positioned closer to the feeder, using a regular 35 mm lens will be fine. If your camera doesn't already have a good-quality lens, you can purchase one at a photography store. Telephoto lenses also have another perk: in letting you shoot from farther away, they lower the likelihood that you'll spook the birds when you start snapping pictures. More experienced photographers may even choose to use a wide-angle or fisheye lens and position the tripod only about 10–12 inches (25–30 cm) away from the birds. Since this would put you extremely close to the birds, you'd need to trigger the camera shutter remotely. Set up 3–4 flashes around the birdfeeder to light the hummingbirds. Flashes are small electric bulbs that will provide a burst of light when you click the camera's shutter button. Position your flashes so they're only 1–3 feet (0.30–0.91 m) away from the birdfeeder, and set them to low power. You only want each flash to be at about 1/16 of its full strength so that the flashes don't over-expose the birds' colorful bodies. Depending on the height of your birdfeeder, you may need to set up the flashes on their own small tripods. Lighting the scene with flashes will ensure that you have consistently good lighting regardless of the time of day you're shooting at. In most cases, if you're shooting during the daylight hours, hummingbirds shouldn't be scared off by flashes. This step is technically optional. If you prefer to work without flashes, or if you're shooting in an area with bright, indirect sunlight, you may not need a flash at all. Adjusting Your Camera Settings Choose an ISO around 400 or 800 to get crisp, detailed photos. If you're using a digital SLR, simply adjust the ISO setting on your camera to 400 or 800. 400 is a relatively slow film speed, so make sure you're shooting in bright sunlight or else the pictures may come out underexposed. If you're shooting with film, you can purchase rolls of 400 or 800 ISO film at a photography outlet store. If you're shooting with a slow film speed in low-light conditions, you'll need to shoot with a flash to avoid taking dark photos. Turn on your lens's autofocus feature for quicker focus. Nearly all SLR digital and film cameras have an autofocus feature that continually focuses the lens on whatever object is in the center of the viewfinder. Hummingbirds will be flying much too fast for you to try to manually focus your lens on them, and using the autofocus will let you focus on timing and composing the shot. If you're using a cheaper non-SLR camera, you can typically engage the autofocus feature by pressing the shutter button halfway down. Set your shutter speed to at least 1/800 of a second. In order to freeze the lightning-quick wings of a hummingbird mid-flap, you'll need to use a very fast shutter speed. If you use too slow of a speed, you'll notice that the birds' wings are blurry and hard to see. In some cases, to avoid blurry wings on a fast-flying hummingbird, you'll need to use a shutter speed of at least 1/2500 of a second to freeze the birds in motion. Depending on the aesthetic of the photo you're trying to take, you may actually want the bird's wings to look blurry. In this case, use a slightly slower shutter speed to capture the wings' motion. Try a handful of different shutter speeds to see what works best. You could shoot 50 pictures at 1 shutter speed, then adjust it and shoot 50 more. Use a wide aperture around f/4 to adequately expose the photographs. Since you're using such a short shutter speed, you'll need to use a wide-open aperture setting to ensure that enough light gets into the camera. Manually set the aperture to f/1.4, f/4, or f/5 to prevent the shots from being dim and poorly lit. Using a fast shutter speed and a wide aperture means that you'll have a low depth of field, so the scenery behind the hummingbird will likely be out of focus. On some SLC cameras, the aperture is referred to as the f-stop. These terms mean the same thing. Snap 200–300 photos to ensure that you get a good one. The majority of the shots you take will, unfortunately, not be great. The bird will be out of focus or poorly exposed, the shot will be poorly composed, or the lighting will be off. To avoid ending the photo session empty-handed, take hundreds of photos of the birds. This will dramatically improve your chances of having 1 or 2 great photos you can be proud of. If you have a digital SLR camera, you could also try engaging the function that lets you take 3-5 photos in rapid succession. You could also try shooting a video of a hummingbird feeding and then select the best still video frame. If you're shooting with a digital camera, just make sure that you've cleared off enough memory on the device that you can fit hundreds of new photos. If you're shooting with film, be prepared to burn through 6–8 rolls.",
    "sentences": [
        " Setting up a Location Set up a hummingbird feeder near your home.",
        "Hummingbirds are drawn to the brightly-colored feeders and sweet liquid inside, so if you hang one near your home in the warm summer months, you'll soon have a handful of birds coming by to eat every day.",
        "Position the feeder in a location where you can see it easily (e.g., in front of a kitchen window) so you'll know when the birds are coming by to eat.",
        "Then, grab your camera!",
        "If you happen to have more than 1 feeder already in place, take 1 down.",
        "You should only have 1 feeder hanging, so that all of the birds congregate in a single location.",
        "Sit or stand near the feeder so the birds acclimate to your presence.",
        "Hummingbirds are skittish and easily frightened off by humans walking around.",
        "In order to let the birds get used to you being nearby, sit or stand between 10–15 feet (3.0–4.6 m) away from the feeder.",
        "Photographing hummingbirds takes patience.",
        "Plan to sit still (though not completely motionless) for at least 15–30 minutes before the birds are comfortable enough to start feeding.",
        "If it's a sunny day and you don't have other plans, you could even take a lawn chair out to the hummingbird feeder!",
        "You may need to spend several hours around the feeder anyway, waiting for the birds to arrive and taking various photos before you get a great one.",
        "Remove the feeder's perches and tape shut all but 1 of the holes.",
        "Since you most likely want to photograph the hummingbirds in flight, take off the feeder's perches so the birds will have to hover while they're feeding.",
        "Then, tear off 3 or 4 strips of scotch tape and use them to cover the feeder's holes, leaving only 1 open.",
        "This will ensure that the birds all feed at the exact same location, making it easier to set up your camera to take high-quality photos.",
        "With the perches removed and most of the holes blocked, you know where the bird will be and it will be much easier to position your shot.",
        "Positioning your Camera for Shooting Set up your tripod about 11–12 ft (3.4–3.7 m) away from the feeder.",
        "This is a great distance from which to shoot hummingbirds.",
        "Being a little farther than 10 feet (3.0 m) from the birds will allow you to compose the shots as you like.",
        "The distance will also let you focus on the bird without the background of the photograph overwhelming the subject.",
        "If your particular setup doesn't allow you to situate the tripod this far from the feeder, don't worry.",
        "You can always zoom out more with your lens if you're closer, or crop out blank space around the bird if you're too far away.",
        "Use a telephoto lens if you're shooting from farther away.",
        "If you had to set up your tripod much farther than 12 feet (3.7 m) from the hummingbird feeder, you'll need to use a lens with a zoom capacity.",
        "Otherwise, if your tripod happens to be positioned closer to the feeder, using a regular 35 mm lens will be fine.",
        "If your camera doesn't already have a good-quality lens, you can purchase one at a photography store.",
        "Telephoto lenses also have another perk: in letting you shoot from farther away, they lower the likelihood that you'll spook the birds when you start snapping pictures.",
        "More experienced photographers may even choose to use a wide-angle or fisheye lens and position the tripod only about 10–12 inches (25–30 cm) away from the birds.",
        "Since this would put you extremely close to the birds, you'd need to trigger the camera shutter remotely.",
        "Set up 3–4 flashes around the birdfeeder to light the hummingbirds.",
        "Flashes are small electric bulbs that will provide a burst of light when you click the camera's shutter button.",
        "Position your flashes so they're only 1–3 feet (0.30–0.91 m) away from the birdfeeder, and set them to low power.",
        "You only want each flash to be at about 1/16 of its full strength so that the flashes don't over-expose the birds' colorful bodies.",
        "Depending on the height of your birdfeeder, you may need to set up the flashes on their own small tripods.",
        "Lighting the scene with flashes will ensure that you have consistently good lighting regardless of the time of day you're shooting at.",
        "In most cases, if you're shooting during the daylight hours, hummingbirds shouldn't be scared off by flashes.",
        "This step is technically optional.",
        "If you prefer to work without flashes, or if you're shooting in an area with bright, indirect sunlight, you may not need a flash at all.",
        "Adjusting Your Camera Settings Choose an ISO around 400 or 800 to get crisp, detailed photos.",
        "If you're using a digital SLR, simply adjust the ISO setting on your camera to 400 or 800.",
        "400 is a relatively slow film speed, so make sure you're shooting in bright sunlight or else the pictures may come out underexposed.",
        "If you're shooting with film, you can purchase rolls of 400 or 800 ISO film at a photography outlet store.",
        "If you're shooting with a slow film speed in low-light conditions, you'll need to shoot with a flash to avoid taking dark photos.",
        "Turn on your lens's autofocus feature for quicker focus.",
        "Nearly all SLR digital and film cameras have an autofocus feature that continually focuses the lens on whatever object is in the center of the viewfinder.",
        "Hummingbirds will be flying much too fast for you to try to manually focus your lens on them, and using the autofocus will let you focus on timing and composing the shot.",
        "If you're using a cheaper non-SLR camera, you can typically engage the autofocus feature by pressing the shutter button halfway down.",
        "Set your shutter speed to at least 1/800 of a second.",
        "In order to freeze the lightning-quick wings of a hummingbird mid-flap, you'll need to use a very fast shutter speed.",
        "If you use too slow of a speed, you'll notice that the birds' wings are blurry and hard to see.",
        "In some cases, to avoid blurry wings on a fast-flying hummingbird, you'll need to use a shutter speed of at least 1/2500 of a second to freeze the birds in motion.",
        "Depending on the aesthetic of the photo you're trying to take, you may actually want the bird's wings to look blurry.",
        "In this case, use a slightly slower shutter speed to capture the wings' motion.",
        "Try a handful of different shutter speeds to see what works best.",
        "You could shoot 50 pictures at 1 shutter speed, then adjust it and shoot 50 more.",
        "Use a wide aperture around f/4 to adequately expose the photographs.",
        "Since you're using such a short shutter speed, you'll need to use a wide-open aperture setting to ensure that enough light gets into the camera.",
        "Manually set the aperture to f/1.4, f/4, or f/5 to prevent the shots from being dim and poorly lit.",
        "Using a fast shutter speed and a wide aperture means that you'll have a low depth of field, so the scenery behind the hummingbird will likely be out of focus.",
        "On some SLC cameras, the aperture is referred to as the f-stop.",
        "These terms mean the same thing.",
        "Snap 200–300 photos to ensure that you get a good one.",
        "The majority of the shots you take will, unfortunately, not be great.",
        "The bird will be out of focus or poorly exposed, the shot will be poorly composed, or the lighting will be off.",
        "To avoid ending the photo session empty-handed, take hundreds of photos of the birds.",
        "This will dramatically improve your chances of having 1 or 2 great photos you can be proud of.",
        "If you have a digital SLR camera, you could also try engaging the function that lets you take 3-5 photos in rapid succession.",
        "You could also try shooting a video of a hummingbird feeding and then select the best still video frame.",
        "If you're shooting with a digital camera, just make sure that you've cleared off enough memory on the device that you can fit hundreds of new photos.",
        "If you're shooting with film, be prepared to burn through 6–8 rolls."
    ]
}