{
    "title": "How to Make a Chore Chart With Incentives",
    "url": "https://www.wikihow.com/Make-a-Chore-Chart-With-Incentives",
    "category_hierarchy": [
        "Family Life",
        "Parenting",
        "Teaching Children Skills",
        "Teaching Children to Do Chores"
    ],
    "parts": [
        {
            "name": "Deciding on Chores",
            "steps": [
                {
                    "headline": "Make a list of household chores.",
                    "description": "Chores in chore charts are generally things that need to be accomplished in the house daily or weekly. Think about your home’s needs and which chores you prioritize more than others. For example, you may suffer from allergies and need the house thoroughly dusted and vacuumed every week, but folding laundry isn’t a huge priority for you. Make sure your chore chart reflects your household’s necessities. Be realistic in your expectations. Your house will not always be spotless, not all chores will get down every week, and understand that others may have a different definition of “clean” than you do."
                },
                {
                    "headline": "Decide on daily and weekly chores.",
                    "description": "Consider which chores you would like people to do every day, and other chores you want done weekly. You could decide to make a chore chart for daily chores only, one for weekly chores only, or a combination of both. A few suggestions for daily chores include making the bed, taking out trash, putting away toys, or washing dishes. A few suggestions for weekly chores include dusting, vacuuming, mopping the floor, or cleaning the bathroom."
                },
                {
                    "headline": "Make sure chores are age-appropriate.",
                    "description": "Assign chores appropriate to the age and/or developmental level of the members of the household. You wouldn’t have a two-year-old iron, for example. But children of all ages can help with chores around the house. Here are some examples for different age groups:\nAges 2 to 3: Put away toys, put clothes in hamper, wipe up spills, feed pets\nAges 4 to 5: Make bed, empty waste baskets, wash plastic dishes at sink\nAges 6 to 7: Set the table, sweep floors, rake leaves\nAges 8 to 9: Put away groceries, make own snacks or breakfast, walk the dog\nAges 10 to 11: Fold laundry, clean bathroom, change bed sheets\nAges 12 and up: Watch younger siblings, mop floors, cook dinner"
                },
                {
                    "headline": "Assign chores to members of the group.",
                    "description": "Using age-appropriate guidelines, assign chores to each member of your household. Try to assign a similar amount of chores, keeping in mind age and/or ability. Consider the amount of time it takes to complete each chore as well. For example, cleaning the bathroom may take a longer amount of time than vacuuming the family room. Factor time commitments into your assignments. Consider switching up chores from week-to-week to add variety to a routine. For example, more detested chores could alternate amongst group members."
                },
                {
                    "headline": "Make sure everyone understands the tasks.",
                    "description": "Be clear in your expectations about what it means to “clean your room” or “clean the dining room table.” For younger kids, you may need to break down the task step-by-step. For example, let everyone know that when it says “Clean the family room” on the chore chart, this means picking up and putting away toys, dusting, and vacuuming. You may wish to indicate on the chore chart what each task entails."
                }
            ]
        },
        {
            "name": "Creating a Chore Chart",
            "steps": [
                {
                    "headline": "Figure out the best chart format for your family.",
                    "description": "Chore charts are usually organized by rows and columns. In your row and column headings, you can put your lists of chores, days of the week, or names of the people in your household. Look for examples of chore charts online, and decide what format will best fit your needs. There are many ideas out there! Your chart could have a column with the name of each chore, a column that lists rewards pertaining to the chores, and a blank space so people can write their names or initials when they've done the chores. You may decide to add columns for any additional needs, like a “deadline” column (the day by which the chore needs to be completed). Your chart could list the family member’s name in the first column. In subsequent columns, or underneath the name, you could list the chores the family member is responsible for. Next to the chore, you could put a box to check when the action is completed. Consider drawing pictures of the chores for pre-literate children or others who struggle with reading."
                },
                {
                    "headline": "Create your chart.",
                    "description": "Chart organization will vary by your household’s needs and members. Typically, a chart will have columns with days of the week, rows with individual chores, and blank spaces where members of the household can indicate they have completed the task. Design your chart the way that best fits your needs, or look for examples online. You may want to use a spreadsheet program to create a chart. Consider creating your own chart on a whiteboard. This will allow you to use the same chart week-to-week. Try typing “printable chore chart” into a search engine for online examples. You can use one of these templates to develop your own chart."
                },
                {
                    "headline": "Print out the chart.",
                    "description": "Feel free to decorate it with markers, colored pencils, and stickers. If you have children, let your kids help decorate it. This will help generate interest and excitement in the new system. If you have little kids, you might want to make the chart large to make it easier to read, as well as to give the kids more space to write on it. To make the chart reusable, laminate it and use dry-erase markers to mark off chores."
                },
                {
                    "headline": "Hang the chart up where everyone can see it.",
                    "description": "You may want to hang it on the refrigerator, or another central location where people are easily able to find it. Keep a pen (or a dry erase marker if you’re using a whiteboard) nearby so people can mark off the chores when they've done them. For children, hang the chart low enough where they are able to read and mark it."
                },
                {
                    "headline": "Make it fun.",
                    "description": "Think about whether a chore chart centered around a game, your child’s favorite cartoon character, or friendly competition, would be a good fit for your family. Search for different models of chore charts online using sites like Pinterest. For instance, the chart could be Disney princess-themed or Marvel superhero-themed."
                }
            ]
        },
        {
            "name": "Rewarding Completed Tasks",
            "steps": [
                {
                    "headline": "Check to see if the work is done.",
                    "description": "When a member of the household has announced they have finished their chore, double-check to make sure it is done to your satisfaction. When somebody has completed a chore, have them write their name on the appropriate place in the chart. Don’t hold younger kids to the same standard as you would an older child. For example, a four-year-old may have trouble cleaning their room as well as a ten-year-old. If you are working with a child or person unable to write their name, you could have them make an X or draw a picture in the space instead."
                },
                {
                    "headline": "Decide how you want to reward completed tasks.",
                    "description": "Think about what would work best for your household. You may decide to assign rewards by task or by family member. It may also depend on the structure of your chart. Keep in mind who these rewards are for, and what work they will be rewarding, and tailor them accordingly. Younger children might be content with a piece of candy, while older children may want to work toward video game/screen time. Rewards don't have to be anything big (nor should they be). They also shouldn’t always be food-based. Incentives could be things like getting to stay up later on the weekends, an extra story at bedtime, or playing a favorite game or doing a favorite activity together."
                },
                {
                    "headline": "Let others decide on their rewards.",
                    "description": "You may have more enthusiasm for the chore chart if members of your household get to decide for themselves what they’d like to work for. You could also ask them if they would rather earn smaller rewards for each completed task, or work toward a bigger reward. You could decide that rewarding each task is going to work better for your family. You could say, “If you make your bed every day this week, you will get a prize. What do you think would be a good prize? A new coloring book or a pack of gum?”\nSet limits on the value of the reward. You may decide that you don’t want to spend more than $5 a week on chore chart incentives, for example. You may also decide to reward the completed tasks with free activities, like playing a game or baking together. If you have decided to let others work toward a cumulative reward, set a monetary limit on the prize and let the person decide what they want to work toward."
                },
                {
                    "headline": "Indicate which rewards will be earned.",
                    "description": "Let household members know what incentives they will receive for doing the chore. You may wish to write the incentive next to the task on the chore chart, or it may work better to have them listed separately. The latter may work better if you are using a cumulative rewards system, such as a points system. If you are using a cumulative reward system, you could write something like, “Felipe is working to earn a new video game.”\nIf you are rewarding each completed task, you could indicate it on the chore chart. For example, next to “Wash and fold laundry,” it could say, “30 minutes of screen time.”"
                },
                {
                    "headline": "Create a points system.",
                    "description": "Designate a certain amount of points per task. Add up each household member’s points at the end of the week. The points can be redeemed for a reward. Designate levels of rewards. For example, you could decide that at 10 points, the participant could redeem their points for a movie night at home. For 20 points, they could redeem their points for a special lunch. The value of the reward would get higher as the accumulated points increase. This could help kids understand the idea of saving to achieve a goal. More disliked, difficult or time-consuming chores could have higher point values. If you have younger children, you can use visual markers to make the system more tangible, such as filling a jar with craft sticks or marbles."
                },
                {
                    "headline": "Avoid using money as a reward.",
                    "description": "Kids need to learn that household chores should not be tied to earning money. After all, no one is paying their parents to make dinner or do the laundry. Teach your children that everyone helps out to support a functioning household, and that working to make it better shouldn’t be achieved through self-serving means. You could give an allowance to your child independent of the chore chart. Let them learn the connection between earning money and work by doing additional jobs you consider to be beyond the scope of their day-to-day responsibilities."
                },
                {
                    "headline": "Give the reward.",
                    "description": "If you have decided to reward a member with an incentive upon completion of the chore, keep your end of the bargain. Deliver the reward promptly, or at a previously agreed-upon time. If it is a young child, remind them of what the reward is for when you give it to them. You could say, “We get to do this puzzle together because you picked up your toys!”\nIf you are using a points system to earn rewards, let the person know when they can redeem their reward. For example, “Since you earned enough points, we can get pizza for dinner on Tuesday!”"
                }
            ]
        }
    ],
    "tyn": [
        "Binder ring (optional)",
        "Card stock (optional)",
        "Dry erase board",
        "Dry erase markers",
        "Hole punch",
        "Notebook (optional)",
        "Paper (optional)",
        "Pen (optional)",
        "Stickers (optional)"
    ],
    "text": " Deciding on Chores Make a list of household chores. Chores in chore charts are generally things that need to be accomplished in the house daily or weekly. Think about your home’s needs and which chores you prioritize more than others. For example, you may suffer from allergies and need the house thoroughly dusted and vacuumed every week, but folding laundry isn’t a huge priority for you. Make sure your chore chart reflects your household’s necessities. Be realistic in your expectations. Your house will not always be spotless, not all chores will get down every week, and understand that others may have a different definition of “clean” than you do. Decide on daily and weekly chores. Consider which chores you would like people to do every day, and other chores you want done weekly. You could decide to make a chore chart for daily chores only, one for weekly chores only, or a combination of both. A few suggestions for daily chores include making the bed, taking out trash, putting away toys, or washing dishes. A few suggestions for weekly chores include dusting, vacuuming, mopping the floor, or cleaning the bathroom. Make sure chores are age-appropriate. Assign chores appropriate to the age and/or developmental level of the members of the household. You wouldn’t have a two-year-old iron, for example. But children of all ages can help with chores around the house. Here are some examples for different age groups:\nAges 2 to 3: Put away toys, put clothes in hamper, wipe up spills, feed pets\nAges 4 to 5: Make bed, empty waste baskets, wash plastic dishes at sink\nAges 6 to 7: Set the table, sweep floors, rake leaves\nAges 8 to 9: Put away groceries, make own snacks or breakfast, walk the dog\nAges 10 to 11: Fold laundry, clean bathroom, change bed sheets\nAges 12 and up: Watch younger siblings, mop floors, cook dinner Assign chores to members of the group. Using age-appropriate guidelines, assign chores to each member of your household. Try to assign a similar amount of chores, keeping in mind age and/or ability. Consider the amount of time it takes to complete each chore as well. For example, cleaning the bathroom may take a longer amount of time than vacuuming the family room. Factor time commitments into your assignments. Consider switching up chores from week-to-week to add variety to a routine. For example, more detested chores could alternate amongst group members. Make sure everyone understands the tasks. Be clear in your expectations about what it means to “clean your room” or “clean the dining room table.” For younger kids, you may need to break down the task step-by-step. For example, let everyone know that when it says “Clean the family room” on the chore chart, this means picking up and putting away toys, dusting, and vacuuming. You may wish to indicate on the chore chart what each task entails. Creating a Chore Chart Figure out the best chart format for your family. Chore charts are usually organized by rows and columns. In your row and column headings, you can put your lists of chores, days of the week, or names of the people in your household. Look for examples of chore charts online, and decide what format will best fit your needs. There are many ideas out there! Your chart could have a column with the name of each chore, a column that lists rewards pertaining to the chores, and a blank space so people can write their names or initials when they've done the chores. You may decide to add columns for any additional needs, like a “deadline” column (the day by which the chore needs to be completed). Your chart could list the family member’s name in the first column. In subsequent columns, or underneath the name, you could list the chores the family member is responsible for. Next to the chore, you could put a box to check when the action is completed. Consider drawing pictures of the chores for pre-literate children or others who struggle with reading. Create your chart. Chart organization will vary by your household’s needs and members. Typically, a chart will have columns with days of the week, rows with individual chores, and blank spaces where members of the household can indicate they have completed the task. Design your chart the way that best fits your needs, or look for examples online. You may want to use a spreadsheet program to create a chart. Consider creating your own chart on a whiteboard. This will allow you to use the same chart week-to-week. Try typing “printable chore chart” into a search engine for online examples. You can use one of these templates to develop your own chart. Print out the chart. Feel free to decorate it with markers, colored pencils, and stickers. If you have children, let your kids help decorate it. This will help generate interest and excitement in the new system. If you have little kids, you might want to make the chart large to make it easier to read, as well as to give the kids more space to write on it. To make the chart reusable, laminate it and use dry-erase markers to mark off chores. Hang the chart up where everyone can see it. You may want to hang it on the refrigerator, or another central location where people are easily able to find it. Keep a pen (or a dry erase marker if you’re using a whiteboard) nearby so people can mark off the chores when they've done them. For children, hang the chart low enough where they are able to read and mark it. Make it fun. Think about whether a chore chart centered around a game, your child’s favorite cartoon character, or friendly competition, would be a good fit for your family. Search for different models of chore charts online using sites like Pinterest. For instance, the chart could be Disney princess-themed or Marvel superhero-themed. Rewarding Completed Tasks Check to see if the work is done. When a member of the household has announced they have finished their chore, double-check to make sure it is done to your satisfaction. When somebody has completed a chore, have them write their name on the appropriate place in the chart. Don’t hold younger kids to the same standard as you would an older child. For example, a four-year-old may have trouble cleaning their room as well as a ten-year-old. If you are working with a child or person unable to write their name, you could have them make an X or draw a picture in the space instead. Decide how you want to reward completed tasks. Think about what would work best for your household. You may decide to assign rewards by task or by family member. It may also depend on the structure of your chart. Keep in mind who these rewards are for, and what work they will be rewarding, and tailor them accordingly. Younger children might be content with a piece of candy, while older children may want to work toward video game/screen time. Rewards don't have to be anything big (nor should they be). They also shouldn’t always be food-based. Incentives could be things like getting to stay up later on the weekends, an extra story at bedtime, or playing a favorite game or doing a favorite activity together. Let others decide on their rewards. You may have more enthusiasm for the chore chart if members of your household get to decide for themselves what they’d like to work for. You could also ask them if they would rather earn smaller rewards for each completed task, or work toward a bigger reward. You could decide that rewarding each task is going to work better for your family. You could say, “If you make your bed every day this week, you will get a prize. What do you think would be a good prize? A new coloring book or a pack of gum?”\nSet limits on the value of the reward. You may decide that you don’t want to spend more than $5 a week on chore chart incentives, for example. You may also decide to reward the completed tasks with free activities, like playing a game or baking together. If you have decided to let others work toward a cumulative reward, set a monetary limit on the prize and let the person decide what they want to work toward. Indicate which rewards will be earned. Let household members know what incentives they will receive for doing the chore. You may wish to write the incentive next to the task on the chore chart, or it may work better to have them listed separately. The latter may work better if you are using a cumulative rewards system, such as a points system. If you are using a cumulative reward system, you could write something like, “Felipe is working to earn a new video game.”\nIf you are rewarding each completed task, you could indicate it on the chore chart. For example, next to “Wash and fold laundry,” it could say, “30 minutes of screen time.” Create a points system. Designate a certain amount of points per task. Add up each household member’s points at the end of the week. The points can be redeemed for a reward. Designate levels of rewards. For example, you could decide that at 10 points, the participant could redeem their points for a movie night at home. For 20 points, they could redeem their points for a special lunch. The value of the reward would get higher as the accumulated points increase. This could help kids understand the idea of saving to achieve a goal. More disliked, difficult or time-consuming chores could have higher point values. If you have younger children, you can use visual markers to make the system more tangible, such as filling a jar with craft sticks or marbles. Avoid using money as a reward. Kids need to learn that household chores should not be tied to earning money. After all, no one is paying their parents to make dinner or do the laundry. Teach your children that everyone helps out to support a functioning household, and that working to make it better shouldn’t be achieved through self-serving means. You could give an allowance to your child independent of the chore chart. Let them learn the connection between earning money and work by doing additional jobs you consider to be beyond the scope of their day-to-day responsibilities. Give the reward. If you have decided to reward a member with an incentive upon completion of the chore, keep your end of the bargain. Deliver the reward promptly, or at a previously agreed-upon time. If it is a young child, remind them of what the reward is for when you give it to them. You could say, “We get to do this puzzle together because you picked up your toys!”\nIf you are using a points system to earn rewards, let the person know when they can redeem their reward. For example, “Since you earned enough points, we can get pizza for dinner on Tuesday!”",
    "sentences": [
        " Deciding on Chores Make a list of household chores.",
        "Chores in chore charts are generally things that need to be accomplished in the house daily or weekly.",
        "Think about your home’s needs and which chores you prioritize more than others.",
        "For example, you may suffer from allergies and need the house thoroughly dusted and vacuumed every week, but folding laundry isn’t a huge priority for you.",
        "Make sure your chore chart reflects your household’s necessities.",
        "Be realistic in your expectations.",
        "Your house will not always be spotless, not all chores will get down every week, and understand that others may have a different definition of “clean” than you do.",
        "Decide on daily and weekly chores.",
        "Consider which chores you would like people to do every day, and other chores you want done weekly.",
        "You could decide to make a chore chart for daily chores only, one for weekly chores only, or a combination of both.",
        "A few suggestions for daily chores include making the bed, taking out trash, putting away toys, or washing dishes.",
        "A few suggestions for weekly chores include dusting, vacuuming, mopping the floor, or cleaning the bathroom.",
        "Make sure chores are age-appropriate.",
        "Assign chores appropriate to the age and/or developmental level of the members of the household.",
        "You wouldn’t have a two-year-old iron, for example.",
        "But children of all ages can help with chores around the house.",
        "Here are some examples for different age groups:\nAges 2 to 3: Put away toys, put clothes in hamper, wipe up spills, feed pets\nAges 4 to 5: Make bed, empty waste baskets, wash plastic dishes at sink\nAges 6 to 7: Set the table, sweep floors, rake leaves\nAges 8 to 9: Put away groceries, make own snacks or breakfast, walk the dog\nAges 10 to 11: Fold laundry, clean bathroom, change bed sheets\nAges 12 and up: Watch younger siblings, mop floors, cook dinner Assign chores to members of the group.",
        "Using age-appropriate guidelines, assign chores to each member of your household.",
        "Try to assign a similar amount of chores, keeping in mind age and/or ability.",
        "Consider the amount of time it takes to complete each chore as well.",
        "For example, cleaning the bathroom may take a longer amount of time than vacuuming the family room.",
        "Factor time commitments into your assignments.",
        "Consider switching up chores from week-to-week to add variety to a routine.",
        "For example, more detested chores could alternate amongst group members.",
        "Make sure everyone understands the tasks.",
        "Be clear in your expectations about what it means to “clean your room” or “clean the dining room table.” For younger kids, you may need to break down the task step-by-step.",
        "For example, let everyone know that when it says “Clean the family room” on the chore chart, this means picking up and putting away toys, dusting, and vacuuming.",
        "You may wish to indicate on the chore chart what each task entails.",
        "Creating a Chore Chart Figure out the best chart format for your family.",
        "Chore charts are usually organized by rows and columns.",
        "In your row and column headings, you can put your lists of chores, days of the week, or names of the people in your household.",
        "Look for examples of chore charts online, and decide what format will best fit your needs.",
        "There are many ideas out there!",
        "Your chart could have a column with the name of each chore, a column that lists rewards pertaining to the chores, and a blank space so people can write their names or initials when they've done the chores.",
        "You may decide to add columns for any additional needs, like a “deadline” column (the day by which the chore needs to be completed).",
        "Your chart could list the family member’s name in the first column.",
        "In subsequent columns, or underneath the name, you could list the chores the family member is responsible for.",
        "Next to the chore, you could put a box to check when the action is completed.",
        "Consider drawing pictures of the chores for pre-literate children or others who struggle with reading.",
        "Create your chart.",
        "Chart organization will vary by your household’s needs and members.",
        "Typically, a chart will have columns with days of the week, rows with individual chores, and blank spaces where members of the household can indicate they have completed the task.",
        "Design your chart the way that best fits your needs, or look for examples online.",
        "You may want to use a spreadsheet program to create a chart.",
        "Consider creating your own chart on a whiteboard.",
        "This will allow you to use the same chart week-to-week.",
        "Try typing “printable chore chart” into a search engine for online examples.",
        "You can use one of these templates to develop your own chart.",
        "Print out the chart.",
        "Feel free to decorate it with markers, colored pencils, and stickers.",
        "If you have children, let your kids help decorate it.",
        "This will help generate interest and excitement in the new system.",
        "If you have little kids, you might want to make the chart large to make it easier to read, as well as to give the kids more space to write on it.",
        "To make the chart reusable, laminate it and use dry-erase markers to mark off chores.",
        "Hang the chart up where everyone can see it.",
        "You may want to hang it on the refrigerator, or another central location where people are easily able to find it.",
        "Keep a pen (or a dry erase marker if you’re using a whiteboard) nearby so people can mark off the chores when they've done them.",
        "For children, hang the chart low enough where they are able to read and mark it.",
        "Make it fun.",
        "Think about whether a chore chart centered around a game, your child’s favorite cartoon character, or friendly competition, would be a good fit for your family.",
        "Search for different models of chore charts online using sites like Pinterest.",
        "For instance, the chart could be Disney princess-themed or Marvel superhero-themed.",
        "Rewarding Completed Tasks Check to see if the work is done.",
        "When a member of the household has announced they have finished their chore, double-check to make sure it is done to your satisfaction.",
        "When somebody has completed a chore, have them write their name on the appropriate place in the chart.",
        "Don’t hold younger kids to the same standard as you would an older child.",
        "For example, a four-year-old may have trouble cleaning their room as well as a ten-year-old.",
        "If you are working with a child or person unable to write their name, you could have them make an X or draw a picture in the space instead.",
        "Decide how you want to reward completed tasks.",
        "Think about what would work best for your household.",
        "You may decide to assign rewards by task or by family member.",
        "It may also depend on the structure of your chart.",
        "Keep in mind who these rewards are for, and what work they will be rewarding, and tailor them accordingly.",
        "Younger children might be content with a piece of candy, while older children may want to work toward video game/screen time.",
        "Rewards don't have to be anything big (nor should they be).",
        "They also shouldn’t always be food-based.",
        "Incentives could be things like getting to stay up later on the weekends, an extra story at bedtime, or playing a favorite game or doing a favorite activity together.",
        "Let others decide on their rewards.",
        "You may have more enthusiasm for the chore chart if members of your household get to decide for themselves what they’d like to work for.",
        "You could also ask them if they would rather earn smaller rewards for each completed task, or work toward a bigger reward.",
        "You could decide that rewarding each task is going to work better for your family.",
        "You could say, “If you make your bed every day this week, you will get a prize.",
        "What do you think would be a good prize?",
        "A new coloring book or a pack of gum?”\nSet limits on the value of the reward.",
        "You may decide that you don’t want to spend more than $5 a week on chore chart incentives, for example.",
        "You may also decide to reward the completed tasks with free activities, like playing a game or baking together.",
        "If you have decided to let others work toward a cumulative reward, set a monetary limit on the prize and let the person decide what they want to work toward.",
        "Indicate which rewards will be earned.",
        "Let household members know what incentives they will receive for doing the chore.",
        "You may wish to write the incentive next to the task on the chore chart, or it may work better to have them listed separately.",
        "The latter may work better if you are using a cumulative rewards system, such as a points system.",
        "If you are using a cumulative reward system, you could write something like, “Felipe is working to earn a new video game.”\nIf you are rewarding each completed task, you could indicate it on the chore chart.",
        "For example, next to “Wash and fold laundry,” it could say, “30 minutes of screen time.” Create a points system.",
        "Designate a certain amount of points per task.",
        "Add up each household member’s points at the end of the week.",
        "The points can be redeemed for a reward.",
        "Designate levels of rewards.",
        "For example, you could decide that at 10 points, the participant could redeem their points for a movie night at home.",
        "For 20 points, they could redeem their points for a special lunch.",
        "The value of the reward would get higher as the accumulated points increase.",
        "This could help kids understand the idea of saving to achieve a goal.",
        "More disliked, difficult or time-consuming chores could have higher point values.",
        "If you have younger children, you can use visual markers to make the system more tangible, such as filling a jar with craft sticks or marbles.",
        "Avoid using money as a reward.",
        "Kids need to learn that household chores should not be tied to earning money.",
        "After all, no one is paying their parents to make dinner or do the laundry.",
        "Teach your children that everyone helps out to support a functioning household, and that working to make it better shouldn’t be achieved through self-serving means.",
        "You could give an allowance to your child independent of the chore chart.",
        "Let them learn the connection between earning money and work by doing additional jobs you consider to be beyond the scope of their day-to-day responsibilities.",
        "Give the reward.",
        "If you have decided to reward a member with an incentive upon completion of the chore, keep your end of the bargain.",
        "Deliver the reward promptly, or at a previously agreed-upon time.",
        "If it is a young child, remind them of what the reward is for when you give it to them.",
        "You could say, “We get to do this puzzle together because you picked up your toys!”\nIf you are using a points system to earn rewards, let the person know when they can redeem their reward.",
        "For example, “Since you earned enough points, we can get pizza for dinner on Tuesday!”"
    ]
}