{
    "title": "How to Prepare a Wall for Wallpaper Border",
    "url": "https://www.wikihow.com/Prepare-a-Wall-for-Wallpaper-Border",
    "category_hierarchy": [
        "Home and Garden",
        "Home Maintenance",
        "Walls and Ceilings",
        "Interior Walls",
        "Wallpaper"
    ],
    "methods": [
        {
            "name": "Cleaning and Repairing the Wall",
            "steps": [
                {
                    "headline": "Prepare a cleaning solution.",
                    "description": "If you have any mildew or dirt on the wall, wash it off with an all-purpose cleaner you bought or one you made. To make a simple cleaning solution, dilute a cup of bleach in a gallon of water. Wear gloves and eye protection when you are dealing with bleach to keep yourself safe. Usually mildew occurs in bathrooms, because of all the humidity from showers and baths."
                },
                {
                    "headline": "Wash the wall using the cleaning solution and a rag.",
                    "description": "Remember to wear gloves and pay special attention to the area where you plan to apply the border. Spray the solution on your rag or on the wall, and then wipe it down. Let the wall dry before moving on to further steps. If the wall doesn’t wipe off easily, use a stiff-bristled brush instead of a rag."
                },
                {
                    "headline": "Decide where you want the border to go.",
                    "description": "Wallpaper borders with fun designs can lend a playful touch to a children’s room. Many people also like to put wallpaper borders in the bathroom, to make an otherwise drab area more visually pleasing. Borders can go in the middle, top, or bottom of the wall. It’s best not to put a wallpaper border on top of an old one. If you already have one up, remove it. Some people like to use a wallpaper border to separate two different kinds of wallpaper."
                },
                {
                    "headline": "Mark where you want to apply the border.",
                    "description": "Remember to take into account the width of the border. Wallpaper borders are usually about 6 to 9 inches (15 to 23 cm), but you should check the specific measurements on your roll. Mark the desired height with a pencil. Use a ruler and a level to make sure your line is straight and even. Try to avoid outlets and light switches."
                },
                {
                    "headline": "Fill in holes in the section where the border goes with  spackle.",
                    "description": "Put a little spackle on a putty knife and smear it over the hole. Smooth out the spackle and scrape off any excess with the putty knife. If you bought powdered spackle, you’ll have to mix it with water first."
                },
                {
                    "headline": "Let the spackle dry for a few hours and apply a second coat.",
                    "description": "Check the spackle bottle for instructions on how long it should dry, though it’s usually a few hours. If you’re not sure if its dry, just touch it lightly with your finger to test. Apply a second coat, because spackle shrinks when it dries. Wipe the spackle on the wall the same way you did the first time. Let it dry completely again before you move on to sanding."
                }
            ]
        },
        {
            "name": "Sanding and Priming the Wall",
            "steps": [
                {
                    "headline": "Sand the part of the wall where you plan to apply the border.",
                    "description": "Rub a fine-grit sandpaper lightly over the surface of the wall to smooth out imperfections. Pay special attention to the parts that you spackled, rubbing them into they blend in with the rest of the wall. There’s no need to sand the whole wall, just the part where the border goes. Wipe off the dust with a damp rag. One way to check smoothness is to shine a flashlight sideways across the wall so that any bumps cast shadows. You can also degloss the wall with a liquid deglosser instead of sanding."
                },
                {
                    "headline": "Apply primer with a brush or roller.",
                    "description": "Pour the primer into a rolling tray and then roll or brush it onto the wall in the section you’ve marked off. The primer will form a hard, smooth surface, which the wallpaper adhesive can bind to. This will keep the border from forming bubbles, and will also help you remove the border later if you ever want to change things up. Be sure to use an interior primer. Use primer-sealer if you are painting bare wood."
                },
                {
                    "headline": "Let the primer dry according to the instructions.",
                    "description": "Primer usually takes 1-3 hours to dry, though if you live in a humid area, it will take even longer. It’s important to let the primer dry completely as it hardens into a smooth surface that the wallpaper adhesive can stick to. If you’re not sure if it’s dry, just check back in another half hour."
                }
            ]
        },
        {
            "name": "Hanging the Wallpaper Border",
            "steps": [
                {
                    "headline": "Measure the length of a wall and cut the border with a few extra inches.",
                    "description": "The extra inches will help you when you need to trim and overhang the paper later. Cut using a razor blade and a ruler to make sure your cut is straight."
                },
                {
                    "headline": "Soak prepasted paper according to the instructions.",
                    "description": "Usually, this involves soaking the border in lukewarm water for 2-3 minutes. When you remove it from the water, pull it out slowly to let the water drip off. You can also use a clear paste activator instead of water."
                },
                {
                    "headline": "Spread the border pattern-side down on a table if it’s unpasted.",
                    "description": "Apply the kind of adhesive specified on the directions. Paint on the paste with a brush or a paint roller, starting at one end and working your way to the other."
                },
                {
                    "headline": "Book the wallpaper and let it sit 5 minutes.",
                    "description": "Booking is when you gently fold the ends of the border toward the middle without creasing the folds. Let the adhesive sides rest against each other. While you let it sit for 5 minutes, the paper will relax and swell. If you don’t let the border book, it might create bubbles when you put it on the wall."
                },
                {
                    "headline": "Start in a corner and leave a ⁄2 inch (1.3 cm) overhang.",
                    "description": "If you simply stick the border whole into an inside corner, it might pull away from the wall as it dries. Instead, trim the strip of border so that it overlaps ⁄2 inch (1.3 cm) on the next wall. Start the new strip exactly at the corner, overlapping with the little bit from the old strip. Make sure to match the pattern as closely as you can when you overlap! Use a roller on the overlaps to make sure they stick."
                }
            ]
        }
    ],
    "tyn": [
        "Wallpaper border",
        "Measuring tape",
        "Ruler",
        "Level",
        "Pencil",
        "Sandpaper",
        "Interior primer",
        "Adhesive (if it’s not prepasted)",
        "Paint brush, rollers, and pan",
        "Razor blade"
    ],
    "text": " Cleaning and Repairing the Wall Prepare a cleaning solution. If you have any mildew or dirt on the wall, wash it off with an all-purpose cleaner you bought or one you made. To make a simple cleaning solution, dilute a cup of bleach in a gallon of water. Wear gloves and eye protection when you are dealing with bleach to keep yourself safe. Usually mildew occurs in bathrooms, because of all the humidity from showers and baths. Wash the wall using the cleaning solution and a rag. Remember to wear gloves and pay special attention to the area where you plan to apply the border. Spray the solution on your rag or on the wall, and then wipe it down. Let the wall dry before moving on to further steps. If the wall doesn’t wipe off easily, use a stiff-bristled brush instead of a rag. Decide where you want the border to go. Wallpaper borders with fun designs can lend a playful touch to a children’s room. Many people also like to put wallpaper borders in the bathroom, to make an otherwise drab area more visually pleasing. Borders can go in the middle, top, or bottom of the wall. It’s best not to put a wallpaper border on top of an old one. If you already have one up, remove it. Some people like to use a wallpaper border to separate two different kinds of wallpaper. Mark where you want to apply the border. Remember to take into account the width of the border. Wallpaper borders are usually about 6 to 9 inches (15 to 23 cm), but you should check the specific measurements on your roll. Mark the desired height with a pencil. Use a ruler and a level to make sure your line is straight and even. Try to avoid outlets and light switches. Fill in holes in the section where the border goes with  spackle. Put a little spackle on a putty knife and smear it over the hole. Smooth out the spackle and scrape off any excess with the putty knife. If you bought powdered spackle, you’ll have to mix it with water first. Let the spackle dry for a few hours and apply a second coat. Check the spackle bottle for instructions on how long it should dry, though it’s usually a few hours. If you’re not sure if its dry, just touch it lightly with your finger to test. Apply a second coat, because spackle shrinks when it dries. Wipe the spackle on the wall the same way you did the first time. Let it dry completely again before you move on to sanding. Sanding and Priming the Wall Sand the part of the wall where you plan to apply the border. Rub a fine-grit sandpaper lightly over the surface of the wall to smooth out imperfections. Pay special attention to the parts that you spackled, rubbing them into they blend in with the rest of the wall. There’s no need to sand the whole wall, just the part where the border goes. Wipe off the dust with a damp rag. One way to check smoothness is to shine a flashlight sideways across the wall so that any bumps cast shadows. You can also degloss the wall with a liquid deglosser instead of sanding. Apply primer with a brush or roller. Pour the primer into a rolling tray and then roll or brush it onto the wall in the section you’ve marked off. The primer will form a hard, smooth surface, which the wallpaper adhesive can bind to. This will keep the border from forming bubbles, and will also help you remove the border later if you ever want to change things up. Be sure to use an interior primer. Use primer-sealer if you are painting bare wood. Let the primer dry according to the instructions. Primer usually takes 1-3 hours to dry, though if you live in a humid area, it will take even longer. It’s important to let the primer dry completely as it hardens into a smooth surface that the wallpaper adhesive can stick to. If you’re not sure if it’s dry, just check back in another half hour. Hanging the Wallpaper Border Measure the length of a wall and cut the border with a few extra inches. The extra inches will help you when you need to trim and overhang the paper later. Cut using a razor blade and a ruler to make sure your cut is straight. Soak prepasted paper according to the instructions. Usually, this involves soaking the border in lukewarm water for 2-3 minutes. When you remove it from the water, pull it out slowly to let the water drip off. You can also use a clear paste activator instead of water. Spread the border pattern-side down on a table if it’s unpasted. Apply the kind of adhesive specified on the directions. Paint on the paste with a brush or a paint roller, starting at one end and working your way to the other. Book the wallpaper and let it sit 5 minutes. Booking is when you gently fold the ends of the border toward the middle without creasing the folds. Let the adhesive sides rest against each other. While you let it sit for 5 minutes, the paper will relax and swell. If you don’t let the border book, it might create bubbles when you put it on the wall. Start in a corner and leave a ⁄2 inch (1.3 cm) overhang. If you simply stick the border whole into an inside corner, it might pull away from the wall as it dries. Instead, trim the strip of border so that it overlaps ⁄2 inch (1.3 cm) on the next wall. Start the new strip exactly at the corner, overlapping with the little bit from the old strip. Make sure to match the pattern as closely as you can when you overlap! Use a roller on the overlaps to make sure they stick.",
    "sentences": [
        " Cleaning and Repairing the Wall Prepare a cleaning solution.",
        "If you have any mildew or dirt on the wall, wash it off with an all-purpose cleaner you bought or one you made.",
        "To make a simple cleaning solution, dilute a cup of bleach in a gallon of water.",
        "Wear gloves and eye protection when you are dealing with bleach to keep yourself safe.",
        "Usually mildew occurs in bathrooms, because of all the humidity from showers and baths.",
        "Wash the wall using the cleaning solution and a rag.",
        "Remember to wear gloves and pay special attention to the area where you plan to apply the border.",
        "Spray the solution on your rag or on the wall, and then wipe it down.",
        "Let the wall dry before moving on to further steps.",
        "If the wall doesn’t wipe off easily, use a stiff-bristled brush instead of a rag.",
        "Decide where you want the border to go.",
        "Wallpaper borders with fun designs can lend a playful touch to a children’s room.",
        "Many people also like to put wallpaper borders in the bathroom, to make an otherwise drab area more visually pleasing.",
        "Borders can go in the middle, top, or bottom of the wall.",
        "It’s best not to put a wallpaper border on top of an old one.",
        "If you already have one up, remove it.",
        "Some people like to use a wallpaper border to separate two different kinds of wallpaper.",
        "Mark where you want to apply the border.",
        "Remember to take into account the width of the border.",
        "Wallpaper borders are usually about 6 to 9 inches (15 to 23 cm), but you should check the specific measurements on your roll.",
        "Mark the desired height with a pencil.",
        "Use a ruler and a level to make sure your line is straight and even.",
        "Try to avoid outlets and light switches.",
        "Fill in holes in the section where the border goes with  spackle.",
        "Put a little spackle on a putty knife and smear it over the hole.",
        "Smooth out the spackle and scrape off any excess with the putty knife.",
        "If you bought powdered spackle, you’ll have to mix it with water first.",
        "Let the spackle dry for a few hours and apply a second coat.",
        "Check the spackle bottle for instructions on how long it should dry, though it’s usually a few hours.",
        "If you’re not sure if its dry, just touch it lightly with your finger to test.",
        "Apply a second coat, because spackle shrinks when it dries.",
        "Wipe the spackle on the wall the same way you did the first time.",
        "Let it dry completely again before you move on to sanding.",
        "Sanding and Priming the Wall Sand the part of the wall where you plan to apply the border.",
        "Rub a fine-grit sandpaper lightly over the surface of the wall to smooth out imperfections.",
        "Pay special attention to the parts that you spackled, rubbing them into they blend in with the rest of the wall.",
        "There’s no need to sand the whole wall, just the part where the border goes.",
        "Wipe off the dust with a damp rag.",
        "One way to check smoothness is to shine a flashlight sideways across the wall so that any bumps cast shadows.",
        "You can also degloss the wall with a liquid deglosser instead of sanding.",
        "Apply primer with a brush or roller.",
        "Pour the primer into a rolling tray and then roll or brush it onto the wall in the section you’ve marked off.",
        "The primer will form a hard, smooth surface, which the wallpaper adhesive can bind to.",
        "This will keep the border from forming bubbles, and will also help you remove the border later if you ever want to change things up.",
        "Be sure to use an interior primer.",
        "Use primer-sealer if you are painting bare wood.",
        "Let the primer dry according to the instructions.",
        "Primer usually takes 1-3 hours to dry, though if you live in a humid area, it will take even longer.",
        "It’s important to let the primer dry completely as it hardens into a smooth surface that the wallpaper adhesive can stick to.",
        "If you’re not sure if it’s dry, just check back in another half hour.",
        "Hanging the Wallpaper Border Measure the length of a wall and cut the border with a few extra inches.",
        "The extra inches will help you when you need to trim and overhang the paper later.",
        "Cut using a razor blade and a ruler to make sure your cut is straight.",
        "Soak prepasted paper according to the instructions.",
        "Usually, this involves soaking the border in lukewarm water for 2-3 minutes.",
        "When you remove it from the water, pull it out slowly to let the water drip off.",
        "You can also use a clear paste activator instead of water.",
        "Spread the border pattern-side down on a table if it’s unpasted.",
        "Apply the kind of adhesive specified on the directions.",
        "Paint on the paste with a brush or a paint roller, starting at one end and working your way to the other.",
        "Book the wallpaper and let it sit 5 minutes.",
        "Booking is when you gently fold the ends of the border toward the middle without creasing the folds.",
        "Let the adhesive sides rest against each other.",
        "While you let it sit for 5 minutes, the paper will relax and swell.",
        "If you don’t let the border book, it might create bubbles when you put it on the wall.",
        "Start in a corner and leave a ⁄2 inch (1.3 cm) overhang.",
        "If you simply stick the border whole into an inside corner, it might pull away from the wall as it dries.",
        "Instead, trim the strip of border so that it overlaps ⁄2 inch (1.3 cm) on the next wall.",
        "Start the new strip exactly at the corner, overlapping with the little bit from the old strip.",
        "Make sure to match the pattern as closely as you can when you overlap!",
        "Use a roller on the overlaps to make sure they stick."
    ]
}