{
    "title": "How to Make an Easter Egg",
    "url": "https://www.wikihow.com/Make-an-Easter-Egg",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Easter"
    ],
    "methods": [
        {
            "name": "Dyeing Eggs with Food Coloring",
            "steps": [
                {
                    "headline": "Mix boiled water, vinegar, and 10-20 drops of food coloring to make dye.",
                    "description": "Bring 2–3 cups (470–710 mL) of water to a boil, and pour about ⁄2 cup (120 mL) into individual cups. Pour 1 teaspoon (4.9 mL) of vinegar into the cup, then squeeze 10-20 drops of food coloring into the cup. Stir it up with a spoon to mix your color. Use different colors of food coloring to dye your eggs a variety of hues. You can use red, blue, green, purple, and yellow, for example. Only mix primary colors if you want to create secondary colors, like mixing yellow and blue to make green. If you mix non-primary colors, they can turn brown and look muddy."
                },
                {
                    "headline": "Use only water to make your dye if you want pastel-colored eggs.",
                    "description": "Avoid using vinegar if you want to create soft-toned Easter eggs. When using vinegar with food coloring or Easter egg dye kits, the colors turn out more vibrant."
                },
                {
                    "headline": "Follow the included instructions if you are using a Easter egg dye kit.",
                    "description": "Many dye kits come with colored dye tablets that you simply place in a cup of water and vinegar. If you are using an egg dye kit, review all of the directions before you get started. These often come with cups, stickers, wire egg holders, and punch-out egg stands. Add ⁄2 cup (120 mL) of vinegar if you want vibrant, saturated colors."
                },
                {
                    "headline": "Dip individual eggs in the dye and let them sit for at least 5 minutes.",
                    "description": "Use a slotted spoon, wire egg holder, or tongs to place your eggs into the cups. Put 1 egg into each cup at a time. Set a timer for about 5 minutes, then take your eggs out of the cup so they can dry."
                },
                {
                    "headline": "Submerge 1/2 of your egg at a time to create a 2-toned effect.",
                    "description": "Place your egg on a wire egg holder, and submerge the bottom half of the egg into the dye. After a few minutes, lift up on the egg holder, and flip your egg around. Then, dunk it into another color."
                },
                {
                    "headline": "Place your eggs in the carton and let them dry completely.",
                    "description": "Once you dye your eggs, you can place them on a flat surface so they can dry. You can use the egg carton your eggs came in. Your eggs will be dry in about 30-90 minutes. If you are using an egg dye kit, see if it comes with egg stands. Some of them have individual cardboard props for your eggs, while others have a flat surface with punch-outs to use."
                }
            ]
        },
        {
            "name": "Creating Natural Dyes",
            "steps": [
                {
                    "headline": "Use cabbage, onions, beets, turmeric, and tea to create your dyes.",
                    "description": "To make pink dye, use 1 cup (236.6 g) of shredded beets. To create orange dye, use 1 cup (236.6 g) of yellow onion skins. Use 2 tablespoons (29.6 g) of ground turmeric to create yellow dye. If you want blue dye, chop up 1 cup (236.6 g) of purple cabbage. Finally, to make lavender dye, you can use  either 1 cup (236.6 g) of red onion skins or 1 bag of Red Zinger tea. If you want to make 1 large batch of a particular color, double the organic material and water used."
                },
                {
                    "headline": "Bring your dye matter and 1  c (240 mL) of water to a boil.",
                    "description": "Place your dye matter inside a medium saucepan, and pour in your water. Using high heat, bring the water to a boil. Make each color individually so you don’t wind up with a brownish hue."
                },
                {
                    "headline": "Let your dye matter simmer on low heat for 15-30 minutes.",
                    "description": "Once your concoction starts to boil, turn down your heat to a low setting and cover your pot with a lid. Your dye is ready when it is a few shades darker than your desired color. When you reach your desired color, remove the pan from the flame, and let the dye cool until it reaches room temperature. You can drip a little of your liquid onto a white dish to check the color. Your dye should be cool in 20-40 minutes."
                },
                {
                    "headline": "Strain your dye using a fine-mesh strainer.",
                    "description": "Place a fine-mesh strainer on top of a bowl or another saucepan, and pour your dye over top. This way, you can strain out the organic materials and only use the liquid dye."
                },
                {
                    "headline": "Mix in 1 tablespoon (15 mL) of vinegar for every cup of strained liquid.",
                    "description": "Vinegar helps add vibrancy and saturation to your dye colors. Pour vinegar into your dye after you strain out the organic materials."
                },
                {
                    "headline": "Place your eggs in a baking dish and pour the dye over top.",
                    "description": "Place your eggs inside the dish in a single layer so they all color evenly. Pour dye until your eggs are totally submerged. This way, the eggs can absorb the color over time."
                },
                {
                    "headline": "Leave your eggs in the fridge until they reach your desired color.",
                    "description": "It takes a bit longer to color eggs with natural dye. Leave your eggs inside the baking dish in the fridge overnight, and check on them in the morning. If you want a darker color, let them sit for another 6-12 hours. When you reach the desired color, you can pour the dye down the sink or reuse it for more eggs."
                },
                {
                    "headline": "Place your eggs in a carton to dry and then rub oil on the surface.",
                    "description": "Place your eggs inside of an egg carton, and let them dry for 15-45 minutes. Then, massage a tiny bit of olive oil or coconut oil on each egg, and rub in the oil with a paper towel. This adds a bit of shine to your eggs. Then, store your eggs in the refrigerator. Use your eggs within 3-7 days for best results."
                }
            ]
        },
        {
            "name": "Decorating Easter Eggs",
            "steps": [
                {
                    "headline": "Use crayons before you dye the egg if you want to keep white spaces.",
                    "description": "Before you dye your eggs, draw on them with crayons. The crayon won’t come off when you dunk it, and the dye will not absorb onto the egg where you drew the crayon. This is great if you want to add small details or write secret messages. In addition, you can wrap your egg gently in rubber bands to create a similar effect. If you use rubber bands, take them off after your egg is dry."
                },
                {
                    "headline": "Place stickers on your egg after you dye it to add embellishment.",
                    "description": "Once your eggs are dry, peel off stickers and place them around your egg. Press them onto the outside with light pressure to avoid breaking the shell. You can use Easter-themed stickers, like bunnies, lambs, and flowers."
                },
                {
                    "headline": "Apply food coloring directly onto your eggs for a tie-dye effect.",
                    "description": "Instead of dunking your eggs into the dye, place a 2-3 eggs inside a colander, and drip 1-5 drops of food coloring inside. Shake the eggs gently back and forth in the colander to apply the color. Be careful not to crack the eggs. Rinse the eggs in cold water to remove excess food coloring. Then, add another color if you’d like. Let the eggs dry thoroughly when you are finished. This creates a colorful, swirl pattern. Be sure to wash your colander with soap and water after you’re finished."
                },
                {
                    "headline": "Draw with paint pens if you want to add pattern and design.",
                    "description": "Use white, gold, or silver paint pens. Press down on the tip of the pen to release the paint, then draw your lines onto your eggs. You can make swirls, polka dots, zig-zags, or stripes, for instance. Ensure your eggs are completely cooled down before you apply paint from a pen, or the color may run down the egg."
                },
                {
                    "headline": "Apply gold leaf to your eggs if you want to add some sparkle.",
                    "description": "Dip the tip of a foam brush into a container of Mod Podge, and apply it all over your egg. Let it dry for 30 minutes, then place your egg in the center of a sheet of gold foil. Cover your egg completely in the foil, and gently rub away any bumps with a cheesecloth. Then, apply another light, even coating of Mod Podge over top. The first layer of Mod Podge strengths your egg, so you can easily wrap it. This is a great idea if you want to add a golden egg motif to your Easter table spread."
                },
                {
                    "headline": "Glue small pom-poms onto your eggs to create a funky look.",
                    "description": "Squeeze a small bead of craft glue on the bottom of a pom-pom, and stick it onto your egg. Continue adding pom-poms around your eggs in sporadic patterns to create various looks. Sit your eggs in a carton for 30-60 minutes to let the glue dry. Use many colors of pom-poms. You can do this for either dyed eggs or plain eggs."
                },
                {
                    "headline": "Use Mod Podge and tissue paper to create a multi-colored Easter egg.",
                    "description": "Cover your egg in a light, even layer of Mod Podge using a flat-edge brush. While your Mod Podge is still wet, apply small pieces of tissue paper to the outside. If you’d like, you can use tissue confetti and roll the egg in the tissue pieces to apply them. Cover your egg in tissue paper, then apply another light, even coat of Mod Podge to seal it. Continue doing this for all of your eggs, and let them dry for 15-30 minutes. You can layer pieces of tissue paper on top of other pieces to play with different colors and opacities."
                }
            ]
        }
    ],
    "tyn": [
        "Hard boiled eggs",
        "Egg carton",
        "Food coloring",
        "Natural dye",
        "Vinegar",
        "Water",
        "Cups",
        "Spoon or tongs",
        "Crayons",
        "Stickers",
        "Paint pens",
        "Rubber bands",
        "Mod Podge",
        "Gold leaf",
        "Pom-poms",
        "Craft glue",
        "Tissue paper"
    ],
    "text": " Dyeing Eggs with Food Coloring Mix boiled water, vinegar, and 10-20 drops of food coloring to make dye. Bring 2–3 cups (470–710 mL) of water to a boil, and pour about ⁄2 cup (120 mL) into individual cups. Pour 1 teaspoon (4.9 mL) of vinegar into the cup, then squeeze 10-20 drops of food coloring into the cup. Stir it up with a spoon to mix your color. Use different colors of food coloring to dye your eggs a variety of hues. You can use red, blue, green, purple, and yellow, for example. Only mix primary colors if you want to create secondary colors, like mixing yellow and blue to make green. If you mix non-primary colors, they can turn brown and look muddy. Use only water to make your dye if you want pastel-colored eggs. Avoid using vinegar if you want to create soft-toned Easter eggs. When using vinegar with food coloring or Easter egg dye kits, the colors turn out more vibrant. Follow the included instructions if you are using a Easter egg dye kit. Many dye kits come with colored dye tablets that you simply place in a cup of water and vinegar. If you are using an egg dye kit, review all of the directions before you get started. These often come with cups, stickers, wire egg holders, and punch-out egg stands. Add ⁄2 cup (120 mL) of vinegar if you want vibrant, saturated colors. Dip individual eggs in the dye and let them sit for at least 5 minutes. Use a slotted spoon, wire egg holder, or tongs to place your eggs into the cups. Put 1 egg into each cup at a time. Set a timer for about 5 minutes, then take your eggs out of the cup so they can dry. Submerge 1/2 of your egg at a time to create a 2-toned effect. Place your egg on a wire egg holder, and submerge the bottom half of the egg into the dye. After a few minutes, lift up on the egg holder, and flip your egg around. Then, dunk it into another color. Place your eggs in the carton and let them dry completely. Once you dye your eggs, you can place them on a flat surface so they can dry. You can use the egg carton your eggs came in. Your eggs will be dry in about 30-90 minutes. If you are using an egg dye kit, see if it comes with egg stands. Some of them have individual cardboard props for your eggs, while others have a flat surface with punch-outs to use. Creating Natural Dyes Use cabbage, onions, beets, turmeric, and tea to create your dyes. To make pink dye, use 1 cup (236.6 g) of shredded beets. To create orange dye, use 1 cup (236.6 g) of yellow onion skins. Use 2 tablespoons (29.6 g) of ground turmeric to create yellow dye. If you want blue dye, chop up 1 cup (236.6 g) of purple cabbage. Finally, to make lavender dye, you can use  either 1 cup (236.6 g) of red onion skins or 1 bag of Red Zinger tea. If you want to make 1 large batch of a particular color, double the organic material and water used. Bring your dye matter and 1  c (240 mL) of water to a boil. Place your dye matter inside a medium saucepan, and pour in your water. Using high heat, bring the water to a boil. Make each color individually so you don’t wind up with a brownish hue. Let your dye matter simmer on low heat for 15-30 minutes. Once your concoction starts to boil, turn down your heat to a low setting and cover your pot with a lid. Your dye is ready when it is a few shades darker than your desired color. When you reach your desired color, remove the pan from the flame, and let the dye cool until it reaches room temperature. You can drip a little of your liquid onto a white dish to check the color. Your dye should be cool in 20-40 minutes. Strain your dye using a fine-mesh strainer. Place a fine-mesh strainer on top of a bowl or another saucepan, and pour your dye over top. This way, you can strain out the organic materials and only use the liquid dye. Mix in 1 tablespoon (15 mL) of vinegar for every cup of strained liquid. Vinegar helps add vibrancy and saturation to your dye colors. Pour vinegar into your dye after you strain out the organic materials. Place your eggs in a baking dish and pour the dye over top. Place your eggs inside the dish in a single layer so they all color evenly. Pour dye until your eggs are totally submerged. This way, the eggs can absorb the color over time. Leave your eggs in the fridge until they reach your desired color. It takes a bit longer to color eggs with natural dye. Leave your eggs inside the baking dish in the fridge overnight, and check on them in the morning. If you want a darker color, let them sit for another 6-12 hours. When you reach the desired color, you can pour the dye down the sink or reuse it for more eggs. Place your eggs in a carton to dry and then rub oil on the surface. Place your eggs inside of an egg carton, and let them dry for 15-45 minutes. Then, massage a tiny bit of olive oil or coconut oil on each egg, and rub in the oil with a paper towel. This adds a bit of shine to your eggs. Then, store your eggs in the refrigerator. Use your eggs within 3-7 days for best results. Decorating Easter Eggs Use crayons before you dye the egg if you want to keep white spaces. Before you dye your eggs, draw on them with crayons. The crayon won’t come off when you dunk it, and the dye will not absorb onto the egg where you drew the crayon. This is great if you want to add small details or write secret messages. In addition, you can wrap your egg gently in rubber bands to create a similar effect. If you use rubber bands, take them off after your egg is dry. Place stickers on your egg after you dye it to add embellishment. Once your eggs are dry, peel off stickers and place them around your egg. Press them onto the outside with light pressure to avoid breaking the shell. You can use Easter-themed stickers, like bunnies, lambs, and flowers. Apply food coloring directly onto your eggs for a tie-dye effect. Instead of dunking your eggs into the dye, place a 2-3 eggs inside a colander, and drip 1-5 drops of food coloring inside. Shake the eggs gently back and forth in the colander to apply the color. Be careful not to crack the eggs. Rinse the eggs in cold water to remove excess food coloring. Then, add another color if you’d like. Let the eggs dry thoroughly when you are finished. This creates a colorful, swirl pattern. Be sure to wash your colander with soap and water after you’re finished. Draw with paint pens if you want to add pattern and design. Use white, gold, or silver paint pens. Press down on the tip of the pen to release the paint, then draw your lines onto your eggs. You can make swirls, polka dots, zig-zags, or stripes, for instance. Ensure your eggs are completely cooled down before you apply paint from a pen, or the color may run down the egg. Apply gold leaf to your eggs if you want to add some sparkle. Dip the tip of a foam brush into a container of Mod Podge, and apply it all over your egg. Let it dry for 30 minutes, then place your egg in the center of a sheet of gold foil. Cover your egg completely in the foil, and gently rub away any bumps with a cheesecloth. Then, apply another light, even coating of Mod Podge over top. The first layer of Mod Podge strengths your egg, so you can easily wrap it. This is a great idea if you want to add a golden egg motif to your Easter table spread. Glue small pom-poms onto your eggs to create a funky look. Squeeze a small bead of craft glue on the bottom of a pom-pom, and stick it onto your egg. Continue adding pom-poms around your eggs in sporadic patterns to create various looks. Sit your eggs in a carton for 30-60 minutes to let the glue dry. Use many colors of pom-poms. You can do this for either dyed eggs or plain eggs. Use Mod Podge and tissue paper to create a multi-colored Easter egg. Cover your egg in a light, even layer of Mod Podge using a flat-edge brush. While your Mod Podge is still wet, apply small pieces of tissue paper to the outside. If you’d like, you can use tissue confetti and roll the egg in the tissue pieces to apply them. Cover your egg in tissue paper, then apply another light, even coat of Mod Podge to seal it. Continue doing this for all of your eggs, and let them dry for 15-30 minutes. You can layer pieces of tissue paper on top of other pieces to play with different colors and opacities.",
    "sentences": [
        " Dyeing Eggs with Food Coloring Mix boiled water, vinegar, and 10-20 drops of food coloring to make dye.",
        "Bring 2–3 cups (470–710 mL) of water to a boil, and pour about ⁄2 cup (120 mL) into individual cups.",
        "Pour 1 teaspoon (4.9 mL) of vinegar into the cup, then squeeze 10-20 drops of food coloring into the cup.",
        "Stir it up with a spoon to mix your color.",
        "Use different colors of food coloring to dye your eggs a variety of hues.",
        "You can use red, blue, green, purple, and yellow, for example.",
        "Only mix primary colors if you want to create secondary colors, like mixing yellow and blue to make green.",
        "If you mix non-primary colors, they can turn brown and look muddy.",
        "Use only water to make your dye if you want pastel-colored eggs.",
        "Avoid using vinegar if you want to create soft-toned Easter eggs.",
        "When using vinegar with food coloring or Easter egg dye kits, the colors turn out more vibrant.",
        "Follow the included instructions if you are using a Easter egg dye kit.",
        "Many dye kits come with colored dye tablets that you simply place in a cup of water and vinegar.",
        "If you are using an egg dye kit, review all of the directions before you get started.",
        "These often come with cups, stickers, wire egg holders, and punch-out egg stands.",
        "Add ⁄2 cup (120 mL) of vinegar if you want vibrant, saturated colors.",
        "Dip individual eggs in the dye and let them sit for at least 5 minutes.",
        "Use a slotted spoon, wire egg holder, or tongs to place your eggs into the cups.",
        "Put 1 egg into each cup at a time.",
        "Set a timer for about 5 minutes, then take your eggs out of the cup so they can dry.",
        "Submerge 1/2 of your egg at a time to create a 2-toned effect.",
        "Place your egg on a wire egg holder, and submerge the bottom half of the egg into the dye.",
        "After a few minutes, lift up on the egg holder, and flip your egg around.",
        "Then, dunk it into another color.",
        "Place your eggs in the carton and let them dry completely.",
        "Once you dye your eggs, you can place them on a flat surface so they can dry.",
        "You can use the egg carton your eggs came in.",
        "Your eggs will be dry in about 30-90 minutes.",
        "If you are using an egg dye kit, see if it comes with egg stands.",
        "Some of them have individual cardboard props for your eggs, while others have a flat surface with punch-outs to use.",
        "Creating Natural Dyes Use cabbage, onions, beets, turmeric, and tea to create your dyes.",
        "To make pink dye, use 1 cup (236.6 g) of shredded beets.",
        "To create orange dye, use 1 cup (236.6 g) of yellow onion skins.",
        "Use 2 tablespoons (29.6 g) of ground turmeric to create yellow dye.",
        "If you want blue dye, chop up 1 cup (236.6 g) of purple cabbage.",
        "Finally, to make lavender dye, you can use  either 1 cup (236.6 g) of red onion skins or 1 bag of Red Zinger tea.",
        "If you want to make 1 large batch of a particular color, double the organic material and water used.",
        "Bring your dye matter and 1  c (240 mL) of water to a boil.",
        "Place your dye matter inside a medium saucepan, and pour in your water.",
        "Using high heat, bring the water to a boil.",
        "Make each color individually so you don’t wind up with a brownish hue.",
        "Let your dye matter simmer on low heat for 15-30 minutes.",
        "Once your concoction starts to boil, turn down your heat to a low setting and cover your pot with a lid.",
        "Your dye is ready when it is a few shades darker than your desired color.",
        "When you reach your desired color, remove the pan from the flame, and let the dye cool until it reaches room temperature.",
        "You can drip a little of your liquid onto a white dish to check the color.",
        "Your dye should be cool in 20-40 minutes.",
        "Strain your dye using a fine-mesh strainer.",
        "Place a fine-mesh strainer on top of a bowl or another saucepan, and pour your dye over top.",
        "This way, you can strain out the organic materials and only use the liquid dye.",
        "Mix in 1 tablespoon (15 mL) of vinegar for every cup of strained liquid.",
        "Vinegar helps add vibrancy and saturation to your dye colors.",
        "Pour vinegar into your dye after you strain out the organic materials.",
        "Place your eggs in a baking dish and pour the dye over top.",
        "Place your eggs inside the dish in a single layer so they all color evenly.",
        "Pour dye until your eggs are totally submerged.",
        "This way, the eggs can absorb the color over time.",
        "Leave your eggs in the fridge until they reach your desired color.",
        "It takes a bit longer to color eggs with natural dye.",
        "Leave your eggs inside the baking dish in the fridge overnight, and check on them in the morning.",
        "If you want a darker color, let them sit for another 6-12 hours.",
        "When you reach the desired color, you can pour the dye down the sink or reuse it for more eggs.",
        "Place your eggs in a carton to dry and then rub oil on the surface.",
        "Place your eggs inside of an egg carton, and let them dry for 15-45 minutes.",
        "Then, massage a tiny bit of olive oil or coconut oil on each egg, and rub in the oil with a paper towel.",
        "This adds a bit of shine to your eggs.",
        "Then, store your eggs in the refrigerator.",
        "Use your eggs within 3-7 days for best results.",
        "Decorating Easter Eggs Use crayons before you dye the egg if you want to keep white spaces.",
        "Before you dye your eggs, draw on them with crayons.",
        "The crayon won’t come off when you dunk it, and the dye will not absorb onto the egg where you drew the crayon.",
        "This is great if you want to add small details or write secret messages.",
        "In addition, you can wrap your egg gently in rubber bands to create a similar effect.",
        "If you use rubber bands, take them off after your egg is dry.",
        "Place stickers on your egg after you dye it to add embellishment.",
        "Once your eggs are dry, peel off stickers and place them around your egg.",
        "Press them onto the outside with light pressure to avoid breaking the shell.",
        "You can use Easter-themed stickers, like bunnies, lambs, and flowers.",
        "Apply food coloring directly onto your eggs for a tie-dye effect.",
        "Instead of dunking your eggs into the dye, place a 2-3 eggs inside a colander, and drip 1-5 drops of food coloring inside.",
        "Shake the eggs gently back and forth in the colander to apply the color.",
        "Be careful not to crack the eggs.",
        "Rinse the eggs in cold water to remove excess food coloring.",
        "Then, add another color if you’d like.",
        "Let the eggs dry thoroughly when you are finished.",
        "This creates a colorful, swirl pattern.",
        "Be sure to wash your colander with soap and water after you’re finished.",
        "Draw with paint pens if you want to add pattern and design.",
        "Use white, gold, or silver paint pens.",
        "Press down on the tip of the pen to release the paint, then draw your lines onto your eggs.",
        "You can make swirls, polka dots, zig-zags, or stripes, for instance.",
        "Ensure your eggs are completely cooled down before you apply paint from a pen, or the color may run down the egg.",
        "Apply gold leaf to your eggs if you want to add some sparkle.",
        "Dip the tip of a foam brush into a container of Mod Podge, and apply it all over your egg.",
        "Let it dry for 30 minutes, then place your egg in the center of a sheet of gold foil.",
        "Cover your egg completely in the foil, and gently rub away any bumps with a cheesecloth.",
        "Then, apply another light, even coating of Mod Podge over top.",
        "The first layer of Mod Podge strengths your egg, so you can easily wrap it.",
        "This is a great idea if you want to add a golden egg motif to your Easter table spread.",
        "Glue small pom-poms onto your eggs to create a funky look.",
        "Squeeze a small bead of craft glue on the bottom of a pom-pom, and stick it onto your egg.",
        "Continue adding pom-poms around your eggs in sporadic patterns to create various looks.",
        "Sit your eggs in a carton for 30-60 minutes to let the glue dry.",
        "Use many colors of pom-poms.",
        "You can do this for either dyed eggs or plain eggs.",
        "Use Mod Podge and tissue paper to create a multi-colored Easter egg.",
        "Cover your egg in a light, even layer of Mod Podge using a flat-edge brush.",
        "While your Mod Podge is still wet, apply small pieces of tissue paper to the outside.",
        "If you’d like, you can use tissue confetti and roll the egg in the tissue pieces to apply them.",
        "Cover your egg in tissue paper, then apply another light, even coat of Mod Podge to seal it.",
        "Continue doing this for all of your eggs, and let them dry for 15-30 minutes.",
        "You can layer pieces of tissue paper on top of other pieces to play with different colors and opacities."
    ]
}