{
    "title": "How to Draw Blood from an Adult Fish",
    "url": "https://www.wikihow.com/Draw-Blood-from-an-Adult-Fish",
    "category_hierarchy": [
        "Pets and Animals",
        "Fish",
        "Fish Health"
    ],
    "parts": [
        {
            "name": "Anesthetizing the Fish",
            "steps": [
                {
                    "headline": "Place the fish in a holding tank.",
                    "description": "Place the fish you want to draw blood from in a holding tank with nothing but clean water in it. Make sure that the water is the same temperature and pH as the water the fish normally lives in. Anesthetizing a fish is appropriate for short procedures that need to be performed out of the water, such as drawing blood. The fish will temporarily lose all sensation including the ability to feel pain, and will become unresponsive so that you will be able to safely perform the procedure."
                },
                {
                    "headline": "Sprinkle an anesthetic agent into the holding tank water.",
                    "description": "Anesthetic agents for fish are absorbed through the gills. Common agents include tricaine methanesulfonate (MS-222) and eugenol. Tricaine is the most common anesthetic for fish and comes in a powder that you can weigh out into doses, or premixed in a solution to be added to a certain volume of water. In general, dosages range from 15-50 mg/L of water in the holding tank, but you should consult with a veterinarian to determine the proper dosage for the fish that you want to anesthetize. It is not recommended to attempt to anesthetize a fish if you do not know what dosage to give it, as an overdose could cause death."
                },
                {
                    "headline": "Wait for the fish to lose balance and become unresponsive.",
                    "description": "The fish will stop swimming and become unresponsive when it has inhaled enough of the anesthetic. Continue with the procedure when this occurs. Anesthesia is only suitable for procedures that can be performed in less than 5 minutes. An overdose of anesthesia can be used as a humane form of euthanasia. A blood sample can be drawn from either an anesthetized or freshly-euthanized fish."
                }
            ]
        },
        {
            "name": "Drawing the Blood",
            "steps": [
                {
                    "headline": "Remove the fish from the holding tank and hold it upside down.",
                    "description": "Have an assistant pick up the fish in both hands and hold it upside down for you. Keep the body of the fish straight and the tail facing towards you. Remember that you need to perform the whole procedure in under 5 minutes, so you should be ready to start as soon as the fish is out of the water."
                },
                {
                    "headline": "Insert a syringe under the skin of the ventral midline of the caudal peduncle.",
                    "description": "Use one hand to keep the tail straight. Gently push the needle under the skin of the fish at about a 45-degree angle away from you. The caudal peduncle is the narrow part of the fishes body where the tail is attached. The ventral midline of the caudal peduncle is the area of the skin right behind the anal fin. This is where you want to insert the needle; right behind the anal fin on the underside of the fish. You can use an insulin syringe with a 22-gauge needle to withdraw blood from a fish without causing the fish harm."
                },
                {
                    "headline": "Push the needle toward the vertebral column until it reaches the base.",
                    "description": "Gently slide the needle in until you feel it hit the base of the fishes spinal column. Pull it back towards you less than 1 mm so it is not against the base. Be careful to stop pushing the needle as soon as you feel it hit the vertebral column so you don’t pierce the spine of the fish."
                },
                {
                    "headline": "Pull the plunger of the syringe to draw the blood.",
                    "description": "Carefully extract a blood sample from the fish with the syringe. Pull the needle out of the fish slowly when you have the sample. Make sure your assistant is holding the fish very stable as you withdraw the blood. A good sample size to safely take from a fish is 1 mL of blood."
                },
                {
                    "headline": "Remove the needle from the syringe and throw it away in a safe disposal container.",
                    "description": "Take off the needle and place it in a sharps container or biohazard disposal container. Your blood sample is now ready for processing. Make sure to also disinfect the area where the fish was handled."
                },
                {
                    "headline": "Return the fish to its home tank to recover.",
                    "description": "Place the fish back into its regular tank or a recovery tank with clean water. Keep an eye on it to make sure it returns to normal. Your assistant can do this simultaneously while your are disposing of the needle and putting aside the blood sample for processing."
                }
            ]
        }
    ],
    "tyn": [
        "Holding tank",
        "Anesthesia",
        "Needle and syringe",
        "Assistant",
        "Home tank or recovery tank"
    ],
    "text": " Anesthetizing the Fish Place the fish in a holding tank. Place the fish you want to draw blood from in a holding tank with nothing but clean water in it. Make sure that the water is the same temperature and pH as the water the fish normally lives in. Anesthetizing a fish is appropriate for short procedures that need to be performed out of the water, such as drawing blood. The fish will temporarily lose all sensation including the ability to feel pain, and will become unresponsive so that you will be able to safely perform the procedure. Sprinkle an anesthetic agent into the holding tank water. Anesthetic agents for fish are absorbed through the gills. Common agents include tricaine methanesulfonate (MS-222) and eugenol. Tricaine is the most common anesthetic for fish and comes in a powder that you can weigh out into doses, or premixed in a solution to be added to a certain volume of water. In general, dosages range from 15-50 mg/L of water in the holding tank, but you should consult with a veterinarian to determine the proper dosage for the fish that you want to anesthetize. It is not recommended to attempt to anesthetize a fish if you do not know what dosage to give it, as an overdose could cause death. Wait for the fish to lose balance and become unresponsive. The fish will stop swimming and become unresponsive when it has inhaled enough of the anesthetic. Continue with the procedure when this occurs. Anesthesia is only suitable for procedures that can be performed in less than 5 minutes. An overdose of anesthesia can be used as a humane form of euthanasia. A blood sample can be drawn from either an anesthetized or freshly-euthanized fish. Drawing the Blood Remove the fish from the holding tank and hold it upside down. Have an assistant pick up the fish in both hands and hold it upside down for you. Keep the body of the fish straight and the tail facing towards you. Remember that you need to perform the whole procedure in under 5 minutes, so you should be ready to start as soon as the fish is out of the water. Insert a syringe under the skin of the ventral midline of the caudal peduncle. Use one hand to keep the tail straight. Gently push the needle under the skin of the fish at about a 45-degree angle away from you. The caudal peduncle is the narrow part of the fishes body where the tail is attached. The ventral midline of the caudal peduncle is the area of the skin right behind the anal fin. This is where you want to insert the needle; right behind the anal fin on the underside of the fish. You can use an insulin syringe with a 22-gauge needle to withdraw blood from a fish without causing the fish harm. Push the needle toward the vertebral column until it reaches the base. Gently slide the needle in until you feel it hit the base of the fishes spinal column. Pull it back towards you less than 1 mm so it is not against the base. Be careful to stop pushing the needle as soon as you feel it hit the vertebral column so you don’t pierce the spine of the fish. Pull the plunger of the syringe to draw the blood. Carefully extract a blood sample from the fish with the syringe. Pull the needle out of the fish slowly when you have the sample. Make sure your assistant is holding the fish very stable as you withdraw the blood. A good sample size to safely take from a fish is 1 mL of blood. Remove the needle from the syringe and throw it away in a safe disposal container. Take off the needle and place it in a sharps container or biohazard disposal container. Your blood sample is now ready for processing. Make sure to also disinfect the area where the fish was handled. Return the fish to its home tank to recover. Place the fish back into its regular tank or a recovery tank with clean water. Keep an eye on it to make sure it returns to normal. Your assistant can do this simultaneously while your are disposing of the needle and putting aside the blood sample for processing.",
    "sentences": [
        " Anesthetizing the Fish Place the fish in a holding tank.",
        "Place the fish you want to draw blood from in a holding tank with nothing but clean water in it.",
        "Make sure that the water is the same temperature and pH as the water the fish normally lives in.",
        "Anesthetizing a fish is appropriate for short procedures that need to be performed out of the water, such as drawing blood.",
        "The fish will temporarily lose all sensation including the ability to feel pain, and will become unresponsive so that you will be able to safely perform the procedure.",
        "Sprinkle an anesthetic agent into the holding tank water.",
        "Anesthetic agents for fish are absorbed through the gills.",
        "Common agents include tricaine methanesulfonate (MS-222) and eugenol.",
        "Tricaine is the most common anesthetic for fish and comes in a powder that you can weigh out into doses, or premixed in a solution to be added to a certain volume of water.",
        "In general, dosages range from 15-50 mg/L of water in the holding tank, but you should consult with a veterinarian to determine the proper dosage for the fish that you want to anesthetize.",
        "It is not recommended to attempt to anesthetize a fish if you do not know what dosage to give it, as an overdose could cause death.",
        "Wait for the fish to lose balance and become unresponsive.",
        "The fish will stop swimming and become unresponsive when it has inhaled enough of the anesthetic.",
        "Continue with the procedure when this occurs.",
        "Anesthesia is only suitable for procedures that can be performed in less than 5 minutes.",
        "An overdose of anesthesia can be used as a humane form of euthanasia.",
        "A blood sample can be drawn from either an anesthetized or freshly-euthanized fish.",
        "Drawing the Blood Remove the fish from the holding tank and hold it upside down.",
        "Have an assistant pick up the fish in both hands and hold it upside down for you.",
        "Keep the body of the fish straight and the tail facing towards you.",
        "Remember that you need to perform the whole procedure in under 5 minutes, so you should be ready to start as soon as the fish is out of the water.",
        "Insert a syringe under the skin of the ventral midline of the caudal peduncle.",
        "Use one hand to keep the tail straight.",
        "Gently push the needle under the skin of the fish at about a 45-degree angle away from you.",
        "The caudal peduncle is the narrow part of the fishes body where the tail is attached.",
        "The ventral midline of the caudal peduncle is the area of the skin right behind the anal fin.",
        "This is where you want to insert the needle; right behind the anal fin on the underside of the fish.",
        "You can use an insulin syringe with a 22-gauge needle to withdraw blood from a fish without causing the fish harm.",
        "Push the needle toward the vertebral column until it reaches the base.",
        "Gently slide the needle in until you feel it hit the base of the fishes spinal column.",
        "Pull it back towards you less than 1 mm so it is not against the base.",
        "Be careful to stop pushing the needle as soon as you feel it hit the vertebral column so you don’t pierce the spine of the fish.",
        "Pull the plunger of the syringe to draw the blood.",
        "Carefully extract a blood sample from the fish with the syringe.",
        "Pull the needle out of the fish slowly when you have the sample.",
        "Make sure your assistant is holding the fish very stable as you withdraw the blood.",
        "A good sample size to safely take from a fish is 1 mL of blood.",
        "Remove the needle from the syringe and throw it away in a safe disposal container.",
        "Take off the needle and place it in a sharps container or biohazard disposal container.",
        "Your blood sample is now ready for processing.",
        "Make sure to also disinfect the area where the fish was handled.",
        "Return the fish to its home tank to recover.",
        "Place the fish back into its regular tank or a recovery tank with clean water.",
        "Keep an eye on it to make sure it returns to normal.",
        "Your assistant can do this simultaneously while your are disposing of the needle and putting aside the blood sample for processing."
    ]
}