{
    "title": "How to Knit Buttonholes",
    "url": "https://www.wikihow.com/Knit-Buttonholes",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework",
        "Knitting and Crochet",
        "Knitting",
        "Knitting Techniques"
    ],
    "methods": [
        {
            "name": "Using One Row",
            "steps": [
                {
                    "headline": "Slip two stitches and bind off.",
                    "description": "To start your buttonhole, take two stitches and slip them onto the opposite needle. Then, loop the first stitch you slipped onto the needle over the second stitch you slipped onto the needle."
                },
                {
                    "headline": "Slip another stitch and bind off again.",
                    "description": "To continue binding off, you will need to slip another stitch over to the opposite needle. Then bind off the stitch by slipping the first stitch over the second stitch. Continue slipping off stitches and binding off if you are making a larger buttonhole. For small buttonholes, you may only need to bind off a couple of stitches. But for larger button holes, you will need to bind off more stitches. Keep going until the button hole is the length that you need it to be."
                },
                {
                    "headline": "Turn your work and cast on two or more stitches.",
                    "description": "When you finish binding off the stitches, you will need to turn your work around. Turn the work so that the opposite side is facing you. Then, begin to cast on stitches in the direction of the buttonhole. Cast on as many stitches as you bound off. For example, if you bound off four stitches, then cast on four stitches."
                },
                {
                    "headline": "Knit as usual.",
                    "description": "After you finish casting on, knit one stitch to connect the cast on stitches to the opposite side of the buttonhole. Then, turn the work around again and knit as usual. If you only needed one buttonhole, then knit to the end of the row. If you need more than one buttonhole, then knit until you reach the next space for placing a buttonhole and repeat the process again."
                }
            ]
        },
        {
            "name": "Using Two Rows",
            "steps": [
                {
                    "headline": "Knit two and pull the first stitch over the second.",
                    "description": "For the first row, you will be binding off the stitches to create one side of the buttonhole. Begin by knitting two and then pull the first stitch you knit over the second one to bind off the first stitch. Continue binding off by knitting one and pulling the first stitch over the second stitch. Continue to bind off as many stitches as you need to create your buttonhole."
                },
                {
                    "headline": "Resume knitting as before.",
                    "description": "When you finish binding off your required stitches for the buttonhole, resume knitting. Finish knitting to the end of the row or until you need to make another buttonhole."
                },
                {
                    "headline": "Bind off enough stitches to make the length of the buttonhole.",
                    "description": "When you come back around to the space where you started the buttonhole, you will need to cast on additional stitches to cover the length of the buttonhole. For example, if you bound off three stitches, then you will need to cast on three stitches."
                },
                {
                    "headline": "Continue knitting.",
                    "description": "After you cast on enough stitches to cover the area of the buttonhole, resume knitting as usual. On your next round, knit across the stitches you cast on in the same manner as the other stitches."
                }
            ]
        },
        {
            "name": "Creating Strong Buttonholes",
            "steps": [
                {
                    "headline": "Check the size of your buttons first.",
                    "description": "Don't make the buttonholes too large or too small for your buttons. Measure the buttons and try to make the buttonholes slightly smaller than the buttons. Try holding up the buttons against the buttonholes as you create them. This will help to ensure that you do not make them too large or too small."
                },
                {
                    "headline": "Identify where the buttonhole will be placed.",
                    "description": "It is important to know where you want each buttonhole to be. Measure the area and place stitch markers so you will know where to place each buttonhole as you go. You can also mark the placement spots with a small safety pin or paper clip."
                },
                {
                    "headline": "Maintain good tension to ensure tight buttonholes.",
                    "description": "As you bind off, cast on, and knit over the areas with buttonholes, it is important to keep good tension. This will help to ensure that your buttonholes will be secure. Hold the yarn taut as you create the buttonholes to ensure that your buttonholes will be tight."
                },
                {
                    "headline": "Reinforce or adjust the buttonholes if needed.",
                    "description": "If you do end up with buttonholes that are loose or too small, then you can use a knitting needle and some extra yarn to reinforce the buttonhole. Using a \"yarn needle\" and the same yarn that you are using to knit your item, stitch around the edges of the buttonhole, using the same \"buttonhole stitch\" that is used when sewing on fabric. This will reinforce the buttonhole. Or if your buttonhole is too long, stitch across one or both of the ends to make the buttonhole shorter."
                }
            ]
        }
    ],
    "tyn": [
        "Yarn",
        "Knitting needles, size according to instructions",
        "Stitch markers or small safety pins to mark areas for buttonholes",
        "Buttons"
    ],
    "text": " Using One Row Slip two stitches and bind off. To start your buttonhole, take two stitches and slip them onto the opposite needle. Then, loop the first stitch you slipped onto the needle over the second stitch you slipped onto the needle. Slip another stitch and bind off again. To continue binding off, you will need to slip another stitch over to the opposite needle. Then bind off the stitch by slipping the first stitch over the second stitch. Continue slipping off stitches and binding off if you are making a larger buttonhole. For small buttonholes, you may only need to bind off a couple of stitches. But for larger button holes, you will need to bind off more stitches. Keep going until the button hole is the length that you need it to be. Turn your work and cast on two or more stitches. When you finish binding off the stitches, you will need to turn your work around. Turn the work so that the opposite side is facing you. Then, begin to cast on stitches in the direction of the buttonhole. Cast on as many stitches as you bound off. For example, if you bound off four stitches, then cast on four stitches. Knit as usual. After you finish casting on, knit one stitch to connect the cast on stitches to the opposite side of the buttonhole. Then, turn the work around again and knit as usual. If you only needed one buttonhole, then knit to the end of the row. If you need more than one buttonhole, then knit until you reach the next space for placing a buttonhole and repeat the process again. Using Two Rows Knit two and pull the first stitch over the second. For the first row, you will be binding off the stitches to create one side of the buttonhole. Begin by knitting two and then pull the first stitch you knit over the second one to bind off the first stitch. Continue binding off by knitting one and pulling the first stitch over the second stitch. Continue to bind off as many stitches as you need to create your buttonhole. Resume knitting as before. When you finish binding off your required stitches for the buttonhole, resume knitting. Finish knitting to the end of the row or until you need to make another buttonhole. Bind off enough stitches to make the length of the buttonhole. When you come back around to the space where you started the buttonhole, you will need to cast on additional stitches to cover the length of the buttonhole. For example, if you bound off three stitches, then you will need to cast on three stitches. Continue knitting. After you cast on enough stitches to cover the area of the buttonhole, resume knitting as usual. On your next round, knit across the stitches you cast on in the same manner as the other stitches. Creating Strong Buttonholes Check the size of your buttons first. Don't make the buttonholes too large or too small for your buttons. Measure the buttons and try to make the buttonholes slightly smaller than the buttons. Try holding up the buttons against the buttonholes as you create them. This will help to ensure that you do not make them too large or too small. Identify where the buttonhole will be placed. It is important to know where you want each buttonhole to be. Measure the area and place stitch markers so you will know where to place each buttonhole as you go. You can also mark the placement spots with a small safety pin or paper clip. Maintain good tension to ensure tight buttonholes. As you bind off, cast on, and knit over the areas with buttonholes, it is important to keep good tension. This will help to ensure that your buttonholes will be secure. Hold the yarn taut as you create the buttonholes to ensure that your buttonholes will be tight. Reinforce or adjust the buttonholes if needed. If you do end up with buttonholes that are loose or too small, then you can use a knitting needle and some extra yarn to reinforce the buttonhole. Using a \"yarn needle\" and the same yarn that you are using to knit your item, stitch around the edges of the buttonhole, using the same \"buttonhole stitch\" that is used when sewing on fabric. This will reinforce the buttonhole. Or if your buttonhole is too long, stitch across one or both of the ends to make the buttonhole shorter.",
    "sentences": [
        " Using One Row Slip two stitches and bind off.",
        "To start your buttonhole, take two stitches and slip them onto the opposite needle.",
        "Then, loop the first stitch you slipped onto the needle over the second stitch you slipped onto the needle.",
        "Slip another stitch and bind off again.",
        "To continue binding off, you will need to slip another stitch over to the opposite needle.",
        "Then bind off the stitch by slipping the first stitch over the second stitch.",
        "Continue slipping off stitches and binding off if you are making a larger buttonhole.",
        "For small buttonholes, you may only need to bind off a couple of stitches.",
        "But for larger button holes, you will need to bind off more stitches.",
        "Keep going until the button hole is the length that you need it to be.",
        "Turn your work and cast on two or more stitches.",
        "When you finish binding off the stitches, you will need to turn your work around.",
        "Turn the work so that the opposite side is facing you.",
        "Then, begin to cast on stitches in the direction of the buttonhole.",
        "Cast on as many stitches as you bound off.",
        "For example, if you bound off four stitches, then cast on four stitches.",
        "Knit as usual.",
        "After you finish casting on, knit one stitch to connect the cast on stitches to the opposite side of the buttonhole.",
        "Then, turn the work around again and knit as usual.",
        "If you only needed one buttonhole, then knit to the end of the row.",
        "If you need more than one buttonhole, then knit until you reach the next space for placing a buttonhole and repeat the process again.",
        "Using Two Rows Knit two and pull the first stitch over the second.",
        "For the first row, you will be binding off the stitches to create one side of the buttonhole.",
        "Begin by knitting two and then pull the first stitch you knit over the second one to bind off the first stitch.",
        "Continue binding off by knitting one and pulling the first stitch over the second stitch.",
        "Continue to bind off as many stitches as you need to create your buttonhole.",
        "Resume knitting as before.",
        "When you finish binding off your required stitches for the buttonhole, resume knitting.",
        "Finish knitting to the end of the row or until you need to make another buttonhole.",
        "Bind off enough stitches to make the length of the buttonhole.",
        "When you come back around to the space where you started the buttonhole, you will need to cast on additional stitches to cover the length of the buttonhole.",
        "For example, if you bound off three stitches, then you will need to cast on three stitches.",
        "Continue knitting.",
        "After you cast on enough stitches to cover the area of the buttonhole, resume knitting as usual.",
        "On your next round, knit across the stitches you cast on in the same manner as the other stitches.",
        "Creating Strong Buttonholes Check the size of your buttons first.",
        "Don't make the buttonholes too large or too small for your buttons.",
        "Measure the buttons and try to make the buttonholes slightly smaller than the buttons.",
        "Try holding up the buttons against the buttonholes as you create them.",
        "This will help to ensure that you do not make them too large or too small.",
        "Identify where the buttonhole will be placed.",
        "It is important to know where you want each buttonhole to be.",
        "Measure the area and place stitch markers so you will know where to place each buttonhole as you go.",
        "You can also mark the placement spots with a small safety pin or paper clip.",
        "Maintain good tension to ensure tight buttonholes.",
        "As you bind off, cast on, and knit over the areas with buttonholes, it is important to keep good tension.",
        "This will help to ensure that your buttonholes will be secure.",
        "Hold the yarn taut as you create the buttonholes to ensure that your buttonholes will be tight.",
        "Reinforce or adjust the buttonholes if needed.",
        "If you do end up with buttonholes that are loose or too small, then you can use a knitting needle and some extra yarn to reinforce the buttonhole.",
        "Using a \"yarn needle\" and the same yarn that you are using to knit your item, stitch around the edges of the buttonhole, using the same \"buttonhole stitch\" that is used when sewing on fabric.",
        "This will reinforce the buttonhole.",
        "Or if your buttonhole is too long, stitch across one or both of the ends to make the buttonhole shorter."
    ]
}