{
    "title": "How to Accessorize a Silver Dress",
    "url": "https://www.wikihow.com/Accessorize-a-Silver-Dress",
    "category_hierarchy": [
        "Personal Care and Style",
        "Fashion",
        "Fashion Accessories"
    ],
    "methods": [
        {
            "name": "Deciding on a Color Scheme",
            "steps": [
                {
                    "headline": "Wear silver.",
                    "description": "An all-silver color scheme keeps things simple and elegant. It works best if your dress is a light, shimmering hue of silver. You should also try to match the hue of your accessories to the hue of your dress. Stick with delicate, dainty jewelry and simple silver heels with little adornment, emphasizing the simplicity of this option."
                },
                {
                    "headline": "Mix silver and gold.",
                    "description": "This creates another elegant, classy look, but one with more variety and visual interest. Look for two-toned jewelry that mixes gold and silver. Each piece should have a two-toned element for the sake of consistency."
                },
                {
                    "headline": "Add some black or gunmetal.",
                    "description": "These tones are a little less feminine and more masculine, so you can get away with bulkier jewelry and accessories if you go this route. You could even consider black leather bracelets and heavier black heels or boots to create the edgy look. This results in an overall bolder look."
                },
                {
                    "headline": "Stick with blue tones.",
                    "description": "Colors are a versatile option and can either look elegant or bold. Just stick with cool hues. Blues and blue-tinted shades of purple or turquoise work best. Avoid warm colors, since these are more likely to clash with the cold tone of a silver dress."
                }
            ]
        },
        {
            "name": "Choosing the Right Jewelry",
            "steps": [
                {
                    "headline": "Choose an unobtrusive necklace.",
                    "description": "A silver dress is already a bold fashion move, and adding a loud necklace will only make your outfit seem unnecessarily gaudy. Your necklace should not compete with your dress. If sticking with silver or silver and gold, a dainty chain with a simple pendant works nicely, depending on your dress’s neckline. For an appropriately bolder look, wear a necklace with chunky black or blue beads mixed with gunmetal. It can be a choker or a long loop that drapes across your torso."
                },
                {
                    "headline": "Pick out a simple bracelet.",
                    "description": "A delicate silver or two-toned chain bracelet adds a touch of class. Thin silver bangles are festive yet feminine. A thick, chunky bracelet in black, gunmetal, or deep blue adds contrast to your dress but avoids clashing or competing with it."
                },
                {
                    "headline": "Balance out the look with silver earrings.",
                    "description": "Earrings can add just enough sparkle by your face to help correct the potential imbalance caused by having too much silver concentrated on the middle of your body. Choose the right posts, hoops, or dangling earrings to match your color scheme."
                },
                {
                    "headline": "Add a touch of silver to your hair.",
                    "description": "Sparkly, decorative hair clips can either be playful or elegant, depending on the design. These, like earrings, can also help balance out the silver on your body."
                }
            ]
        },
        {
            "name": "Accessorizing with Diamonds",
            "steps": [
                {
                    "headline": "Mix and match your diamond accessories.",
                    "description": "Pair one or two key diamond pieces with non-diamond jewelry. For example, you could wear a diamond pendant or choker with thin silver bangle bracelets. Avoid matching diamond jewelry with black or gunmetal accessories. Diamonds look best when paired with other feminine pieces, and many black and gunmetal pieces are too masculine to coordinate well."
                },
                {
                    "headline": "Wear all diamonds, but keep it subtle.",
                    "description": "Match a simple diamond pendant with a dainty diamond bracelet and diamond stud earrings."
                },
                {
                    "headline": "Choose one strong diamond piece and pair it with a few less extravagant pieces.",
                    "description": "For instance, you could wear chandelier earrings with a simple diamond pendant, or a glamorous diamond tennis bracelet with diamond stud earrings."
                },
                {
                    "headline": "Keep the diamonds off the dress.",
                    "description": "Diamond jewelry may blend in with the silver fabric. For bracelets and earrings, this does not pose much problem. This can, however, make selecting a diamond necklace difficult. Avoid long necklaces that position the diamond element directly above the material of the dress. Also avoid extravagant diamond necklaces that throw too many diamonds directly above the dress’s neckline."
                }
            ]
        },
        {
            "name": "Picking Your Shoes",
            "steps": [
                {
                    "headline": "Stick with heels for elegance and class.",
                    "description": "Try a silver sandal with thin straps, an open toe, and a narrow stiletto heel to create a very feminine look. Gold-tone accents can provide some contrast without taking away from the elegance of the look. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c2\\/Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\\/v4-460px-Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c2\\/Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\\/v4-760px-Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nBlack heels do not need to be as delicate as silver heels when matched with a silver dress, but you should still avoid shoes with a chunky platform heel. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/82\\/Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\\/v4-460px-Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/82\\/Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\\/v4-760px-Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nColored shoes can look tacky if done incorrectly. Choose a deep blue-tone if going with a solid color shoe. Otherwise, pick out a silver, black, or gunmetal heel with colored stones or other accents. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fe\\/Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\\/v4-460px-Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fe\\/Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\\/v4-760px-Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
                },
                {
                    "headline": "Consider a metallic or patent leather flat.",
                    "description": "Flats are a casual style of shoe, and most will not work well with a silver dress, which is naturally formal. Some metallic flats or shiny patent leather flats are dressy enough, however, to match with simple matte silver dresses."
                }
            ]
        },
        {
            "name": "Carrying a Handbag",
            "steps": [
                {
                    "headline": "Carry a small clutch.",
                    "description": "Clutch handbags are feminine and classy. Select a simple, solid print clutch decorated with a few gemstones or another similar touch of sparkle."
                },
                {
                    "headline": "Wear a large shoulder bag.",
                    "description": "If going for a slightly bolder look, choose a large silver or gunmetal shoulder bag. A black or dark blue bag may also work, but could appear too casual to match well with your dress. If you want to include black or color on your bag, it is best to do so by selecting a bag with colored accents instead of a solid color print."
                }
            ]
        },
        {
            "name": "Applying Make-Up",
            "steps": [
                {
                    "headline": "Apply a foundation that matches your natural skin tone.",
                    "description": ""
                },
                {
                    "headline": "Layer on a bronze-tinted blush, but don't overdo it.",
                    "description": "Keep your cheek color light. Consider a pink blush if you have fair skin. Choose a peach blush if your skin is medium tone. Try a plum shade if you have darker toned skin."
                },
                {
                    "headline": "Don't hold back on your eyeshadow color.",
                    "description": "Apply dark, shimmering metallic shades to make your eyes stand out. Avoid light silvers or grays, even if you opted for all-silver accessories. If you want to keep the all-silver look, opt for medium to darker shades of gray. Go with either dark bronzes or coal grays if you accessorized with silver and gold accessories. Try adding some variety into your look with a color eye shadow. Stick with blue tones. Think dark blues, eggplant violets, and deep turquoises."
                },
                {
                    "headline": "Apply black eyeliner to your eyes.",
                    "description": "You may add liquid glitter liner over the black liner to give your eyes a bit more sparkle."
                },
                {
                    "headline": "Finish your eyes with black mascara, if desired.",
                    "description": ""
                },
                {
                    "headline": "Stay away from bright red lipsticks.",
                    "description": "Instead, use violet-red colors like mauve or pink tones."
                }
            ]
        }
    ],
    "tyn": [
        "Silver dress",
        "Various pieces of jewelry",
        "Shoes",
        "Handbag"
    ],
    "text": " Deciding on a Color Scheme Wear silver. An all-silver color scheme keeps things simple and elegant. It works best if your dress is a light, shimmering hue of silver. You should also try to match the hue of your accessories to the hue of your dress. Stick with delicate, dainty jewelry and simple silver heels with little adornment, emphasizing the simplicity of this option. Mix silver and gold. This creates another elegant, classy look, but one with more variety and visual interest. Look for two-toned jewelry that mixes gold and silver. Each piece should have a two-toned element for the sake of consistency. Add some black or gunmetal. These tones are a little less feminine and more masculine, so you can get away with bulkier jewelry and accessories if you go this route. You could even consider black leather bracelets and heavier black heels or boots to create the edgy look. This results in an overall bolder look. Stick with blue tones. Colors are a versatile option and can either look elegant or bold. Just stick with cool hues. Blues and blue-tinted shades of purple or turquoise work best. Avoid warm colors, since these are more likely to clash with the cold tone of a silver dress. Choosing the Right Jewelry Choose an unobtrusive necklace. A silver dress is already a bold fashion move, and adding a loud necklace will only make your outfit seem unnecessarily gaudy. Your necklace should not compete with your dress. If sticking with silver or silver and gold, a dainty chain with a simple pendant works nicely, depending on your dress’s neckline. For an appropriately bolder look, wear a necklace with chunky black or blue beads mixed with gunmetal. It can be a choker or a long loop that drapes across your torso. Pick out a simple bracelet. A delicate silver or two-toned chain bracelet adds a touch of class. Thin silver bangles are festive yet feminine. A thick, chunky bracelet in black, gunmetal, or deep blue adds contrast to your dress but avoids clashing or competing with it. Balance out the look with silver earrings. Earrings can add just enough sparkle by your face to help correct the potential imbalance caused by having too much silver concentrated on the middle of your body. Choose the right posts, hoops, or dangling earrings to match your color scheme. Add a touch of silver to your hair. Sparkly, decorative hair clips can either be playful or elegant, depending on the design. These, like earrings, can also help balance out the silver on your body. Accessorizing with Diamonds Mix and match your diamond accessories. Pair one or two key diamond pieces with non-diamond jewelry. For example, you could wear a diamond pendant or choker with thin silver bangle bracelets. Avoid matching diamond jewelry with black or gunmetal accessories. Diamonds look best when paired with other feminine pieces, and many black and gunmetal pieces are too masculine to coordinate well. Wear all diamonds, but keep it subtle. Match a simple diamond pendant with a dainty diamond bracelet and diamond stud earrings. Choose one strong diamond piece and pair it with a few less extravagant pieces. For instance, you could wear chandelier earrings with a simple diamond pendant, or a glamorous diamond tennis bracelet with diamond stud earrings. Keep the diamonds off the dress. Diamond jewelry may blend in with the silver fabric. For bracelets and earrings, this does not pose much problem. This can, however, make selecting a diamond necklace difficult. Avoid long necklaces that position the diamond element directly above the material of the dress. Also avoid extravagant diamond necklaces that throw too many diamonds directly above the dress’s neckline. Picking Your Shoes Stick with heels for elegance and class. Try a silver sandal with thin straps, an open toe, and a narrow stiletto heel to create a very feminine look. Gold-tone accents can provide some contrast without taking away from the elegance of the look. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c2\\/Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\\/v4-460px-Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c2\\/Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\\/v4-760px-Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nBlack heels do not need to be as delicate as silver heels when matched with a silver dress, but you should still avoid shoes with a chunky platform heel. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/82\\/Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\\/v4-460px-Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/82\\/Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\\/v4-760px-Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nColored shoes can look tacky if done incorrectly. Choose a deep blue-tone if going with a solid color shoe. Otherwise, pick out a silver, black, or gunmetal heel with colored stones or other accents. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fe\\/Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\\/v4-460px-Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fe\\/Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\\/v4-760px-Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Consider a metallic or patent leather flat. Flats are a casual style of shoe, and most will not work well with a silver dress, which is naturally formal. Some metallic flats or shiny patent leather flats are dressy enough, however, to match with simple matte silver dresses. Carrying a Handbag Carry a small clutch. Clutch handbags are feminine and classy. Select a simple, solid print clutch decorated with a few gemstones or another similar touch of sparkle. Wear a large shoulder bag. If going for a slightly bolder look, choose a large silver or gunmetal shoulder bag. A black or dark blue bag may also work, but could appear too casual to match well with your dress. If you want to include black or color on your bag, it is best to do so by selecting a bag with colored accents instead of a solid color print. Applying Make-Up Apply a foundation that matches your natural skin tone.  Layer on a bronze-tinted blush, but don't overdo it. Keep your cheek color light. Consider a pink blush if you have fair skin. Choose a peach blush if your skin is medium tone. Try a plum shade if you have darker toned skin. Don't hold back on your eyeshadow color. Apply dark, shimmering metallic shades to make your eyes stand out. Avoid light silvers or grays, even if you opted for all-silver accessories. If you want to keep the all-silver look, opt for medium to darker shades of gray. Go with either dark bronzes or coal grays if you accessorized with silver and gold accessories. Try adding some variety into your look with a color eye shadow. Stick with blue tones. Think dark blues, eggplant violets, and deep turquoises. Apply black eyeliner to your eyes. You may add liquid glitter liner over the black liner to give your eyes a bit more sparkle. Finish your eyes with black mascara, if desired.  Stay away from bright red lipsticks. Instead, use violet-red colors like mauve or pink tones.",
    "sentences": [
        " Deciding on a Color Scheme Wear silver.",
        "An all-silver color scheme keeps things simple and elegant.",
        "It works best if your dress is a light, shimmering hue of silver.",
        "You should also try to match the hue of your accessories to the hue of your dress.",
        "Stick with delicate, dainty jewelry and simple silver heels with little adornment, emphasizing the simplicity of this option.",
        "Mix silver and gold.",
        "This creates another elegant, classy look, but one with more variety and visual interest.",
        "Look for two-toned jewelry that mixes gold and silver.",
        "Each piece should have a two-toned element for the sake of consistency.",
        "Add some black or gunmetal.",
        "These tones are a little less feminine and more masculine, so you can get away with bulkier jewelry and accessories if you go this route.",
        "You could even consider black leather bracelets and heavier black heels or boots to create the edgy look.",
        "This results in an overall bolder look.",
        "Stick with blue tones.",
        "Colors are a versatile option and can either look elegant or bold.",
        "Just stick with cool hues.",
        "Blues and blue-tinted shades of purple or turquoise work best.",
        "Avoid warm colors, since these are more likely to clash with the cold tone of a silver dress.",
        "Choosing the Right Jewelry Choose an unobtrusive necklace.",
        "A silver dress is already a bold fashion move, and adding a loud necklace will only make your outfit seem unnecessarily gaudy.",
        "Your necklace should not compete with your dress.",
        "If sticking with silver or silver and gold, a dainty chain with a simple pendant works nicely, depending on your dress’s neckline.",
        "For an appropriately bolder look, wear a necklace with chunky black or blue beads mixed with gunmetal.",
        "It can be a choker or a long loop that drapes across your torso.",
        "Pick out a simple bracelet.",
        "A delicate silver or two-toned chain bracelet adds a touch of class.",
        "Thin silver bangles are festive yet feminine.",
        "A thick, chunky bracelet in black, gunmetal, or deep blue adds contrast to your dress but avoids clashing or competing with it.",
        "Balance out the look with silver earrings.",
        "Earrings can add just enough sparkle by your face to help correct the potential imbalance caused by having too much silver concentrated on the middle of your body.",
        "Choose the right posts, hoops, or dangling earrings to match your color scheme.",
        "Add a touch of silver to your hair.",
        "Sparkly, decorative hair clips can either be playful or elegant, depending on the design.",
        "These, like earrings, can also help balance out the silver on your body.",
        "Accessorizing with Diamonds Mix and match your diamond accessories.",
        "Pair one or two key diamond pieces with non-diamond jewelry.",
        "For example, you could wear a diamond pendant or choker with thin silver bangle bracelets.",
        "Avoid matching diamond jewelry with black or gunmetal accessories.",
        "Diamonds look best when paired with other feminine pieces, and many black and gunmetal pieces are too masculine to coordinate well.",
        "Wear all diamonds, but keep it subtle.",
        "Match a simple diamond pendant with a dainty diamond bracelet and diamond stud earrings.",
        "Choose one strong diamond piece and pair it with a few less extravagant pieces.",
        "For instance, you could wear chandelier earrings with a simple diamond pendant, or a glamorous diamond tennis bracelet with diamond stud earrings.",
        "Keep the diamonds off the dress.",
        "Diamond jewelry may blend in with the silver fabric.",
        "For bracelets and earrings, this does not pose much problem.",
        "This can, however, make selecting a diamond necklace difficult.",
        "Avoid long necklaces that position the diamond element directly above the material of the dress.",
        "Also avoid extravagant diamond necklaces that throw too many diamonds directly above the dress’s neckline.",
        "Picking Your Shoes Stick with heels for elegance and class.",
        "Try a silver sandal with thin straps, an open toe, and a narrow stiletto heel to create a very feminine look.",
        "Gold-tone accents can provide some contrast without taking away from the elegance of the look.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c2\\/Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\\/v4-460px-Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c2\\/Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\\/v4-760px-Accessorize-a-Silver-Dress-Step-13Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nBlack heels do not need to be as delicate as silver heels when matched with a silver dress, but you should still avoid shoes with a chunky platform heel.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/82\\/Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\\/v4-460px-Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/82\\/Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\\/v4-760px-Accessorize-a-Silver-Dress-Step-13Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nColored shoes can look tacky if done incorrectly.",
        "Choose a deep blue-tone if going with a solid color shoe.",
        "Otherwise, pick out a silver, black, or gunmetal heel with colored stones or other accents.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fe\\/Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\\/v4-460px-Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fe\\/Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\\/v4-760px-Accessorize-a-Silver-Dress-Step-13Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Consider a metallic or patent leather flat.",
        "Flats are a casual style of shoe, and most will not work well with a silver dress, which is naturally formal.",
        "Some metallic flats or shiny patent leather flats are dressy enough, however, to match with simple matte silver dresses.",
        "Carrying a Handbag Carry a small clutch.",
        "Clutch handbags are feminine and classy.",
        "Select a simple, solid print clutch decorated with a few gemstones or another similar touch of sparkle.",
        "Wear a large shoulder bag.",
        "If going for a slightly bolder look, choose a large silver or gunmetal shoulder bag.",
        "A black or dark blue bag may also work, but could appear too casual to match well with your dress.",
        "If you want to include black or color on your bag, it is best to do so by selecting a bag with colored accents instead of a solid color print.",
        "Applying Make-Up Apply a foundation that matches your natural skin tone.",
        "Layer on a bronze-tinted blush, but don't overdo it.",
        "Keep your cheek color light.",
        "Consider a pink blush if you have fair skin.",
        "Choose a peach blush if your skin is medium tone.",
        "Try a plum shade if you have darker toned skin.",
        "Don't hold back on your eyeshadow color.",
        "Apply dark, shimmering metallic shades to make your eyes stand out.",
        "Avoid light silvers or grays, even if you opted for all-silver accessories.",
        "If you want to keep the all-silver look, opt for medium to darker shades of gray.",
        "Go with either dark bronzes or coal grays if you accessorized with silver and gold accessories.",
        "Try adding some variety into your look with a color eye shadow.",
        "Stick with blue tones.",
        "Think dark blues, eggplant violets, and deep turquoises.",
        "Apply black eyeliner to your eyes.",
        "You may add liquid glitter liner over the black liner to give your eyes a bit more sparkle.",
        "Finish your eyes with black mascara, if desired.",
        "Stay away from bright red lipsticks.",
        "Instead, use violet-red colors like mauve or pink tones."
    ]
}