{
    "title": "How to See Infrared Light",
    "url": "https://www.wikihow.com/See-Infrared-Light",
    "category_hierarchy": [
        "Education and Communications",
        "Studying",
        "Subjects",
        "Science",
        "Science Experiments"
    ],
    "methods": [
        {
            "name": "Detecting Infrared Light in Remote Controls",
            "steps": [
                {
                    "headline": "Gather the materials to detect infrared light at home.",
                    "description": "To detect infrared light on your own, gather a remote control and a device that records video. Depending on your preferences, you can use a smartphone, camera, and video recorder. Choose a remote control that has a small light bulb at the top, which emits infrared light when you press a button. Smartphones are generally the easiest way to detect infrared light."
                },
                {
                    "headline": "Test your remote control to make sure it works.",
                    "description": "You will need a working remote control to detect infrared light. Test your remote control by pressing a button to make sure it responds correctly. If it doesn't, try changing the batteries or using a different remote control. If you're not sure whether your remote control's batteries are dead or it doesn't work, replace the batteries first before discarding the remote altogether."
                },
                {
                    "headline": "Press any button on your remote control.",
                    "description": "The specific button doesn't matter, so long as your remote control is on and working. Even if you're in a different room from the device it controls, your remote control will still emit infrared light when you press the buttons."
                },
                {
                    "headline": "Watch the remote control through the device, focusing on the top light bulb.",
                    "description": "Turn on your video recording device and, while looking at the remote control's top light bulb through the camera, press any button on the remote control. The small flash of light you see is infrared light emitting from your remote control as it sends signals to the device it controls. If you don't see a small flash of light, check your remote control's batteries or test it again, as it may be broken."
                }
            ]
        },
        {
            "name": "Making Infrared Goggles",
            "steps": [
                {
                    "headline": "Use welding goggles with removable lenses to make infrared goggles.",
                    "description": "Infrared goggles filter out most of the visible light spectrum, allowing your eyes to absorb more infrared light. Purchase welding goggles online or from a home improvement store that have removable lenses to form the base of your goggles. Make sure the lenses are removable before purchasing the welding goggles."
                },
                {
                    "headline": "Purchase 2 sheets each of blue and red stage lighting gels.",
                    "description": "Blue and red stage lighting gels block out most visible light so you can see more infrared light. You can buy stage lighting gels online or from most theater supply stores. How many stage lighting gel sheets you need depends on how large the welding lenses are. If you run out, you can always buy more as needed."
                },
                {
                    "headline": "Remove the original lenses from the welding goggles.",
                    "description": "Depending on the goggles, you may be able to pop them out, or you may need to unscrew them. If you have trouble removing the lenses, contact the manufacturer for instructions on removing the lenses. For some models, it may not be possible. Do not throw away the original lenses, as you'll need them as a pattern for the homemade lenses."
                },
                {
                    "headline": "Cut 8 lenses each from the gels, using the original lenses as a guide.",
                    "description": "To make the goggles, you will need to insert 4 lenses of the red and blue stage lighting gel in each lens. Use a marker to trace the original welding lenses 4 times each on the red and blue sheets. Then, cut the gel to match the shape of the lenses. Handle the gels carefully while cutting, as even small grazes across the lens can damage them."
                },
                {
                    "headline": "Insert the lenses into the welding goggles.",
                    "description": "After cutting the gel lenses, insert 4 of each color into the welding goggles. Place 2 red lenses in between 2 blue lenses on one side and 2 blue lenses between 2 red lenses on the other side. If the lenses don't fit, they may be too large or small for the goggles. Compare them to the initial welding lenses and either cut them to size or discard it and make a replacement lens."
                },
                {
                    "headline": "Test your goggles in bright light.",
                    "description": "Once you've finished your goggles, put them on and go somewhere bright and preferably outdoors. If the sky looks darker and objects look like shades of pink and violet, your goggles are successfully filtering out visible light and allowing you to see infrared light. Do not look directly into the sun with your goggles on. Just like when you're not wearing goggles, looking at the sun can seriously damage your eyes."
                }
            ]
        }
    ],
    "tyn": [
        "Detecting Infrared Light in Remote Controls",
        "Remote control",
        "Video recording device",
        "Making Infrared Goggles",
        "Welding goggles",
        "2 sheets each of red and blue stage lighting gels",
        "Marker",
        "Scissors"
    ],
    "text": " Detecting Infrared Light in Remote Controls Gather the materials to detect infrared light at home. To detect infrared light on your own, gather a remote control and a device that records video. Depending on your preferences, you can use a smartphone, camera, and video recorder. Choose a remote control that has a small light bulb at the top, which emits infrared light when you press a button. Smartphones are generally the easiest way to detect infrared light. Test your remote control to make sure it works. You will need a working remote control to detect infrared light. Test your remote control by pressing a button to make sure it responds correctly. If it doesn't, try changing the batteries or using a different remote control. If you're not sure whether your remote control's batteries are dead or it doesn't work, replace the batteries first before discarding the remote altogether. Press any button on your remote control. The specific button doesn't matter, so long as your remote control is on and working. Even if you're in a different room from the device it controls, your remote control will still emit infrared light when you press the buttons. Watch the remote control through the device, focusing on the top light bulb. Turn on your video recording device and, while looking at the remote control's top light bulb through the camera, press any button on the remote control. The small flash of light you see is infrared light emitting from your remote control as it sends signals to the device it controls. If you don't see a small flash of light, check your remote control's batteries or test it again, as it may be broken. Making Infrared Goggles Use welding goggles with removable lenses to make infrared goggles. Infrared goggles filter out most of the visible light spectrum, allowing your eyes to absorb more infrared light. Purchase welding goggles online or from a home improvement store that have removable lenses to form the base of your goggles. Make sure the lenses are removable before purchasing the welding goggles. Purchase 2 sheets each of blue and red stage lighting gels. Blue and red stage lighting gels block out most visible light so you can see more infrared light. You can buy stage lighting gels online or from most theater supply stores. How many stage lighting gel sheets you need depends on how large the welding lenses are. If you run out, you can always buy more as needed. Remove the original lenses from the welding goggles. Depending on the goggles, you may be able to pop them out, or you may need to unscrew them. If you have trouble removing the lenses, contact the manufacturer for instructions on removing the lenses. For some models, it may not be possible. Do not throw away the original lenses, as you'll need them as a pattern for the homemade lenses. Cut 8 lenses each from the gels, using the original lenses as a guide. To make the goggles, you will need to insert 4 lenses of the red and blue stage lighting gel in each lens. Use a marker to trace the original welding lenses 4 times each on the red and blue sheets. Then, cut the gel to match the shape of the lenses. Handle the gels carefully while cutting, as even small grazes across the lens can damage them. Insert the lenses into the welding goggles. After cutting the gel lenses, insert 4 of each color into the welding goggles. Place 2 red lenses in between 2 blue lenses on one side and 2 blue lenses between 2 red lenses on the other side. If the lenses don't fit, they may be too large or small for the goggles. Compare them to the initial welding lenses and either cut them to size or discard it and make a replacement lens. Test your goggles in bright light. Once you've finished your goggles, put them on and go somewhere bright and preferably outdoors. If the sky looks darker and objects look like shades of pink and violet, your goggles are successfully filtering out visible light and allowing you to see infrared light. Do not look directly into the sun with your goggles on. Just like when you're not wearing goggles, looking at the sun can seriously damage your eyes.",
    "sentences": [
        " Detecting Infrared Light in Remote Controls Gather the materials to detect infrared light at home.",
        "To detect infrared light on your own, gather a remote control and a device that records video.",
        "Depending on your preferences, you can use a smartphone, camera, and video recorder.",
        "Choose a remote control that has a small light bulb at the top, which emits infrared light when you press a button.",
        "Smartphones are generally the easiest way to detect infrared light.",
        "Test your remote control to make sure it works.",
        "You will need a working remote control to detect infrared light.",
        "Test your remote control by pressing a button to make sure it responds correctly.",
        "If it doesn't, try changing the batteries or using a different remote control.",
        "If you're not sure whether your remote control's batteries are dead or it doesn't work, replace the batteries first before discarding the remote altogether.",
        "Press any button on your remote control.",
        "The specific button doesn't matter, so long as your remote control is on and working.",
        "Even if you're in a different room from the device it controls, your remote control will still emit infrared light when you press the buttons.",
        "Watch the remote control through the device, focusing on the top light bulb.",
        "Turn on your video recording device and, while looking at the remote control's top light bulb through the camera, press any button on the remote control.",
        "The small flash of light you see is infrared light emitting from your remote control as it sends signals to the device it controls.",
        "If you don't see a small flash of light, check your remote control's batteries or test it again, as it may be broken.",
        "Making Infrared Goggles Use welding goggles with removable lenses to make infrared goggles.",
        "Infrared goggles filter out most of the visible light spectrum, allowing your eyes to absorb more infrared light.",
        "Purchase welding goggles online or from a home improvement store that have removable lenses to form the base of your goggles.",
        "Make sure the lenses are removable before purchasing the welding goggles.",
        "Purchase 2 sheets each of blue and red stage lighting gels.",
        "Blue and red stage lighting gels block out most visible light so you can see more infrared light.",
        "You can buy stage lighting gels online or from most theater supply stores.",
        "How many stage lighting gel sheets you need depends on how large the welding lenses are.",
        "If you run out, you can always buy more as needed.",
        "Remove the original lenses from the welding goggles.",
        "Depending on the goggles, you may be able to pop them out, or you may need to unscrew them.",
        "If you have trouble removing the lenses, contact the manufacturer for instructions on removing the lenses.",
        "For some models, it may not be possible.",
        "Do not throw away the original lenses, as you'll need them as a pattern for the homemade lenses.",
        "Cut 8 lenses each from the gels, using the original lenses as a guide.",
        "To make the goggles, you will need to insert 4 lenses of the red and blue stage lighting gel in each lens.",
        "Use a marker to trace the original welding lenses 4 times each on the red and blue sheets.",
        "Then, cut the gel to match the shape of the lenses.",
        "Handle the gels carefully while cutting, as even small grazes across the lens can damage them.",
        "Insert the lenses into the welding goggles.",
        "After cutting the gel lenses, insert 4 of each color into the welding goggles.",
        "Place 2 red lenses in between 2 blue lenses on one side and 2 blue lenses between 2 red lenses on the other side.",
        "If the lenses don't fit, they may be too large or small for the goggles.",
        "Compare them to the initial welding lenses and either cut them to size or discard it and make a replacement lens.",
        "Test your goggles in bright light.",
        "Once you've finished your goggles, put them on and go somewhere bright and preferably outdoors.",
        "If the sky looks darker and objects look like shades of pink and violet, your goggles are successfully filtering out visible light and allowing you to see infrared light.",
        "Do not look directly into the sun with your goggles on.",
        "Just like when you're not wearing goggles, looking at the sun can seriously damage your eyes."
    ]
}