{
    "title": "How to Set Up a Fishing Pole for Fly and Bubble Fishing",
    "url": "https://www.wikihow.com/Set-Up-a-Fishing-Pole-for-Fly-and-Bubble-Fishing",
    "category_hierarchy": [
        "Sports and Fitness",
        "Outdoor Recreation",
        "Fishing",
        "Fly Fishing"
    ],
    "methods": [
        {
            "name": "Choosing the Right Equipment",
            "steps": [
                {
                    "headline": "Choose the right rod for the technique and you.",
                    "description": "Most anglers use the fly and bubble technique with an ultralight spinning rod, as spinning tackle is best suited to the light lines used for fly and bubble fishing. Some anglers favor rods as short as 5 feet (1.5 m) when fishing streams whose banks are overgrown with weeds and brush and as long as 8 feet (2.4 m) (2.4 m) in wider rivers and in lakes, while other anglers favor lengths from 6 to 7 feet (1.8 to 2.1 m). The rod should have a fast action tip. Longer rods allow for more distance when casting and can better simulate the action of a fly rod; however, shorter rods can be packed and carried more easily when fishing in remote areas."
                },
                {
                    "headline": "Choose a good quality reel.",
                    "description": "As noted above, a spinning reel is the preferred reel for fly and bubble fishing. The reel should have a smooth-functioning bail and retrieving action and a good quality drag to handle the light lines the fly and bubble technique calls for."
                },
                {
                    "headline": "Choose the right weight of line.",
                    "description": "Fly and bubble fishing calls for light lines of from 4 to 6 pound test (2 to 3 kg class). Many anglers like to go even lighter with the leader the fly is attached to, choosing 2 to 4-pound test (1 to 2 kg class) line."
                },
                {
                    "headline": "Choose a plastic bubble to thread onto the line.",
                    "description": "The most common shape for plastic bubbles used in fly and bubble fishing is a teardrop-shape, with the thicker end facing the rod and the narrower end facing the lure. Some anglers prefer a more tapered bubble that is at its thickest in the center and equally narrow on either end, while others prefer spherical bubbles. Bubbles can be held in place with built-in clips, although some anglers favor bubbles that use rubber or plastic tubing to keep them in place. Most bubbles feature a stopper you can push in to fill the bubble with as much water as necessary to provide casting weight without hampering the flies action. Generally, for fishing dry flies, which are designed to fish on the surface, you should fill the bubble about half-full so that it will still float on the water after being cast, while for wet flies, which are designed to be fished underwater, you should fill the bubble completely. (Some anglers even add a couple of small split shot to the line to increase the flies running depth.)"
                },
                {
                    "headline": "Choose the right leader length.",
                    "description": "Some anglers favor a length of 6 feet (1.8 m) for wet flies and 9 feet (2.7 m) (2.7 m) for dry flies, while others prefer a length of 5 to 7 feet (1.5 to 2.1 m) (1.5 to 2.1 m) regardless of the type of fly being fished. You may want to experiment with varying lengths according to weather and water conditions and your own preferences. After threading the plastic bubble onto your line, you attach the leader to a small swivel, which you tie onto your line to keep the bubble from sliding down to the fly. Some anglers prefer using the same kind of tapered leader that fly fishermen use, while others prefer to use ordinary monofilament."
                },
                {
                    "headline": "Choose a selection of flies to cover most of your fishing needs.",
                    "description": "Fly and bubble fishing works with most kinds of flies, but you only need a modest selection. While fishing for trout often requires you to \"match the hatch\" with the kind of fly the trout are feeding on, panfish and bass are much less finicky about the type of fly they'll hit. A suggested selection of flies is given below:\nDry flies: Adams Irresistible, Black Gnat, California Mosquito, El Capitan, Ginger Quill, Gray Wulff, Red Ant, Renegade, Royal Coachman. Some dry flies can be fished wet to simulate a drowning insect. Wet flies: Adams Wet, Muddler Minnow, Wooly Bugger (in black, brown, olive, or black and olive combination), Wooly Worm (in brown or olive)."
                },
                {
                    "headline": "Nymphs: Beadhead Prince, Beadhead Flashback Pheasant Tail, Beadhead Hare's Ear, Beadhead Zug Bug, and Copper John (in red and copper).",
                    "description": "(Beadhead streamers have lightly weighted heads to help them sink.) When fishing for trout, you may want to include nymphs that match the kinds of flies the trout are feeding on."
                }
            ]
        },
        {
            "name": "Casting and Presenting Flies With This Technique",
            "steps": [
                {
                    "headline": "Cast sidearm.",
                    "description": "In addition to preventing your leader from casting on overhead branches or otherwise snapping, casting sidearm will permit the bubble to lead the fly during the cast (much like weighted lines lead the leader in fly casting) and let the fly land naturally."
                },
                {
                    "headline": "Count down the fly if fishing it underwater.",
                    "description": "Submerged flies should be let fall to a depth of 5 to 10 feet (1.5 to 3 m) before you begin your retrieve. You can test the rate of fall by dropping the fly and bubble in the water and note how long it takes to fall to a particular depth. When you cast the fly, you can count down to this same depth before starting your retrieve."
                },
                {
                    "headline": "Retrieve slowly.",
                    "description": "Flies fished on or near the surface should be presented as though they're drifting with the current toward shore, with occasional twitches to mimic struggling. Submerged flies should be fished with a stop-and-go action or with slow pulls to simulate a swimming minnow or crustacean. Your bubble should cause a slight wake in calm water to provide sufficient resistance to the line to help you distinguish between when a fish hits the fly and when the fly hits something else."
                },
                {
                    "headline": "Watch the bubble.",
                    "description": "As with the more familiar, colored, clip-on bobbers, if the bubble suddenly dips or bobs sharply, a fish has taken the fly."
                },
                {
                    "headline": "Set the hook with a short, sharp motion.",
                    "description": "This will help drive the hook home. If you fail to set the hook, return to the same slow retrieve you were using. The fish may think it only injured the fly and want to move in for the kill."
                }
            ]
        }
    ],
    "tyn": [
        "Ultralight spinning rod, 5 to 8 feet (1.5 to 2.4 m)",
        "Ultralight spinning reel with good quality drag",
        "4 to 6 pound test (2 to 3 kg class) line",
        "Leader of 2 to 6 pound test (1 to 3 kg class), length of 5 to 9 feet (1.5 to 2.7 m)",
        "Plastic bubble bobber that can be filled with water",
        "Split shot (optional)",
        "Dry flies, wet flies, nymphs, or streamers",
        "Landing net (optional)"
    ],
    "text": " Choosing the Right Equipment Choose the right rod for the technique and you. Most anglers use the fly and bubble technique with an ultralight spinning rod, as spinning tackle is best suited to the light lines used for fly and bubble fishing. Some anglers favor rods as short as 5 feet (1.5 m) when fishing streams whose banks are overgrown with weeds and brush and as long as 8 feet (2.4 m) (2.4 m) in wider rivers and in lakes, while other anglers favor lengths from 6 to 7 feet (1.8 to 2.1 m). The rod should have a fast action tip. Longer rods allow for more distance when casting and can better simulate the action of a fly rod; however, shorter rods can be packed and carried more easily when fishing in remote areas. Choose a good quality reel. As noted above, a spinning reel is the preferred reel for fly and bubble fishing. The reel should have a smooth-functioning bail and retrieving action and a good quality drag to handle the light lines the fly and bubble technique calls for. Choose the right weight of line. Fly and bubble fishing calls for light lines of from 4 to 6 pound test (2 to 3 kg class). Many anglers like to go even lighter with the leader the fly is attached to, choosing 2 to 4-pound test (1 to 2 kg class) line. Choose a plastic bubble to thread onto the line. The most common shape for plastic bubbles used in fly and bubble fishing is a teardrop-shape, with the thicker end facing the rod and the narrower end facing the lure. Some anglers prefer a more tapered bubble that is at its thickest in the center and equally narrow on either end, while others prefer spherical bubbles. Bubbles can be held in place with built-in clips, although some anglers favor bubbles that use rubber or plastic tubing to keep them in place. Most bubbles feature a stopper you can push in to fill the bubble with as much water as necessary to provide casting weight without hampering the flies action. Generally, for fishing dry flies, which are designed to fish on the surface, you should fill the bubble about half-full so that it will still float on the water after being cast, while for wet flies, which are designed to be fished underwater, you should fill the bubble completely. (Some anglers even add a couple of small split shot to the line to increase the flies running depth.) Choose the right leader length. Some anglers favor a length of 6 feet (1.8 m) for wet flies and 9 feet (2.7 m) (2.7 m) for dry flies, while others prefer a length of 5 to 7 feet (1.5 to 2.1 m) (1.5 to 2.1 m) regardless of the type of fly being fished. You may want to experiment with varying lengths according to weather and water conditions and your own preferences. After threading the plastic bubble onto your line, you attach the leader to a small swivel, which you tie onto your line to keep the bubble from sliding down to the fly. Some anglers prefer using the same kind of tapered leader that fly fishermen use, while others prefer to use ordinary monofilament. Choose a selection of flies to cover most of your fishing needs. Fly and bubble fishing works with most kinds of flies, but you only need a modest selection. While fishing for trout often requires you to \"match the hatch\" with the kind of fly the trout are feeding on, panfish and bass are much less finicky about the type of fly they'll hit. A suggested selection of flies is given below:\nDry flies: Adams Irresistible, Black Gnat, California Mosquito, El Capitan, Ginger Quill, Gray Wulff, Red Ant, Renegade, Royal Coachman. Some dry flies can be fished wet to simulate a drowning insect. Wet flies: Adams Wet, Muddler Minnow, Wooly Bugger (in black, brown, olive, or black and olive combination), Wooly Worm (in brown or olive). Nymphs: Beadhead Prince, Beadhead Flashback Pheasant Tail, Beadhead Hare's Ear, Beadhead Zug Bug, and Copper John (in red and copper). (Beadhead streamers have lightly weighted heads to help them sink.) When fishing for trout, you may want to include nymphs that match the kinds of flies the trout are feeding on. Casting and Presenting Flies With This Technique Cast sidearm. In addition to preventing your leader from casting on overhead branches or otherwise snapping, casting sidearm will permit the bubble to lead the fly during the cast (much like weighted lines lead the leader in fly casting) and let the fly land naturally. Count down the fly if fishing it underwater. Submerged flies should be let fall to a depth of 5 to 10 feet (1.5 to 3 m) before you begin your retrieve. You can test the rate of fall by dropping the fly and bubble in the water and note how long it takes to fall to a particular depth. When you cast the fly, you can count down to this same depth before starting your retrieve. Retrieve slowly. Flies fished on or near the surface should be presented as though they're drifting with the current toward shore, with occasional twitches to mimic struggling. Submerged flies should be fished with a stop-and-go action or with slow pulls to simulate a swimming minnow or crustacean. Your bubble should cause a slight wake in calm water to provide sufficient resistance to the line to help you distinguish between when a fish hits the fly and when the fly hits something else. Watch the bubble. As with the more familiar, colored, clip-on bobbers, if the bubble suddenly dips or bobs sharply, a fish has taken the fly. Set the hook with a short, sharp motion. This will help drive the hook home. If you fail to set the hook, return to the same slow retrieve you were using. The fish may think it only injured the fly and want to move in for the kill.",
    "sentences": [
        " Choosing the Right Equipment Choose the right rod for the technique and you.",
        "Most anglers use the fly and bubble technique with an ultralight spinning rod, as spinning tackle is best suited to the light lines used for fly and bubble fishing.",
        "Some anglers favor rods as short as 5 feet (1.5 m) when fishing streams whose banks are overgrown with weeds and brush and as long as 8 feet (2.4 m) (2.4 m) in wider rivers and in lakes, while other anglers favor lengths from 6 to 7 feet (1.8 to 2.1 m).",
        "The rod should have a fast action tip.",
        "Longer rods allow for more distance when casting and can better simulate the action of a fly rod; however, shorter rods can be packed and carried more easily when fishing in remote areas.",
        "Choose a good quality reel.",
        "As noted above, a spinning reel is the preferred reel for fly and bubble fishing.",
        "The reel should have a smooth-functioning bail and retrieving action and a good quality drag to handle the light lines the fly and bubble technique calls for.",
        "Choose the right weight of line.",
        "Fly and bubble fishing calls for light lines of from 4 to 6 pound test (2 to 3 kg class).",
        "Many anglers like to go even lighter with the leader the fly is attached to, choosing 2 to 4-pound test (1 to 2 kg class) line.",
        "Choose a plastic bubble to thread onto the line.",
        "The most common shape for plastic bubbles used in fly and bubble fishing is a teardrop-shape, with the thicker end facing the rod and the narrower end facing the lure.",
        "Some anglers prefer a more tapered bubble that is at its thickest in the center and equally narrow on either end, while others prefer spherical bubbles.",
        "Bubbles can be held in place with built-in clips, although some anglers favor bubbles that use rubber or plastic tubing to keep them in place.",
        "Most bubbles feature a stopper you can push in to fill the bubble with as much water as necessary to provide casting weight without hampering the flies action.",
        "Generally, for fishing dry flies, which are designed to fish on the surface, you should fill the bubble about half-full so that it will still float on the water after being cast, while for wet flies, which are designed to be fished underwater, you should fill the bubble completely.",
        "(Some anglers even add a couple of small split shot to the line to increase the flies running depth.)",
        "Choose the right leader length.",
        "Some anglers favor a length of 6 feet (1.8 m) for wet flies and 9 feet (2.7 m) (2.7 m) for dry flies, while others prefer a length of 5 to 7 feet (1.5 to 2.1 m) (1.5 to 2.1 m) regardless of the type of fly being fished.",
        "You may want to experiment with varying lengths according to weather and water conditions and your own preferences.",
        "After threading the plastic bubble onto your line, you attach the leader to a small swivel, which you tie onto your line to keep the bubble from sliding down to the fly.",
        "Some anglers prefer using the same kind of tapered leader that fly fishermen use, while others prefer to use ordinary monofilament.",
        "Choose a selection of flies to cover most of your fishing needs.",
        "Fly and bubble fishing works with most kinds of flies, but you only need a modest selection.",
        "While fishing for trout often requires you to \"match the hatch\" with the kind of fly the trout are feeding on, panfish and bass are much less finicky about the type of fly they'll hit.",
        "A suggested selection of flies is given below:\nDry flies: Adams Irresistible, Black Gnat, California Mosquito, El Capitan, Ginger Quill, Gray Wulff, Red Ant, Renegade, Royal Coachman.",
        "Some dry flies can be fished wet to simulate a drowning insect.",
        "Wet flies: Adams Wet, Muddler Minnow, Wooly Bugger (in black, brown, olive, or black and olive combination), Wooly Worm (in brown or olive).",
        "Nymphs: Beadhead Prince, Beadhead Flashback Pheasant Tail, Beadhead Hare's Ear, Beadhead Zug Bug, and Copper John (in red and copper).",
        "(Beadhead streamers have lightly weighted heads to help them sink.)",
        "When fishing for trout, you may want to include nymphs that match the kinds of flies the trout are feeding on.",
        "Casting and Presenting Flies With This Technique Cast sidearm.",
        "In addition to preventing your leader from casting on overhead branches or otherwise snapping, casting sidearm will permit the bubble to lead the fly during the cast (much like weighted lines lead the leader in fly casting) and let the fly land naturally.",
        "Count down the fly if fishing it underwater.",
        "Submerged flies should be let fall to a depth of 5 to 10 feet (1.5 to 3 m) before you begin your retrieve.",
        "You can test the rate of fall by dropping the fly and bubble in the water and note how long it takes to fall to a particular depth.",
        "When you cast the fly, you can count down to this same depth before starting your retrieve.",
        "Retrieve slowly.",
        "Flies fished on or near the surface should be presented as though they're drifting with the current toward shore, with occasional twitches to mimic struggling.",
        "Submerged flies should be fished with a stop-and-go action or with slow pulls to simulate a swimming minnow or crustacean.",
        "Your bubble should cause a slight wake in calm water to provide sufficient resistance to the line to help you distinguish between when a fish hits the fly and when the fly hits something else.",
        "Watch the bubble.",
        "As with the more familiar, colored, clip-on bobbers, if the bubble suddenly dips or bobs sharply, a fish has taken the fly.",
        "Set the hook with a short, sharp motion.",
        "This will help drive the hook home.",
        "If you fail to set the hook, return to the same slow retrieve you were using.",
        "The fish may think it only injured the fly and want to move in for the kill."
    ]
}