{
    "title": "How to Remake Glycerine Soap Pieces into New Soap (Melt and Pour)",
    "url": "https://www.wikihow.com/Remake-Glycerine-Soap-Pieces-into-New-Soap-(Melt-and-Pour)",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts"
    ],
    "parts": [
        {
            "name": "Melting the soap",
            "steps": [
                {
                    "headline": "Set up the soap molds in readiness for pouring before starting.",
                    "description": "You may wish to place newspaper underneath, to catch any spills."
                },
                {
                    "headline": "Gather the glycerine soap pieces.",
                    "description": "If you've been storing used pieces for a while, use these. If not, you'll need to cut up block glycerine soaps into inch-sized cubes."
                },
                {
                    "headline": "Place the glycerine soap pieces or cubes into a microwave-proof bowl.",
                    "description": "If you don't have a microwave oven, place in a double boiler for melting over the stove top."
                },
                {
                    "headline": "Place the bowl of glycerine soap pieces into the microwave.",
                    "description": "Microwave on high for 30 seconds, at 10 second intervals. Check each time to see how much it has melted. When fully melted, remove from the microwave oven."
                },
                {
                    "headline": "Add colorant and fragrance oil to the melted soap.",
                    "description": "Put a few drops of each into the melted solution and stir to combine."
                }
            ]
        },
        {
            "name": "Pouring the soap",
            "steps": [
                {
                    "headline": "Pour the melted glycerine soap solution into the soap molds.",
                    "description": ""
                },
                {
                    "headline": "Spray with rubbing alcohol to break any surface bubbles.",
                    "description": ""
                },
                {
                    "headline": "Set aside and let cool for 30 minutes to one hour.",
                    "description": "The soap will form in the mold shape as it cools."
                },
                {
                    "headline": "Pour the first layer of melted soap into the  molds, not all the way, though.",
                    "description": "Spritz with rubbing alcohol to prevent the formation of surface bubbles. Set aside to cool for 3 to 5 minutes."
                },
                {
                    "headline": "Pour a second layer of melted, colored, (and scented if wished) soap onto the first layer of soap.",
                    "description": "This should be cool enough (below 130ºC) to not melt the first layer. Spray with rubbing alcohol."
                },
                {
                    "headline": "Repeat until you form the final layer.",
                    "description": "Two layers is just fine, or you could perhaps make three."
                },
                {
                    "headline": "Choose a suitable item for embedding.",
                    "description": "It must be non-toxic and small. For example, a child-safe soft toy or a sponge shape. Special soap designs are made for this purpose, inquire at the craft store."
                },
                {
                    "headline": "Pour melted blue-tinted clear glycerine into a mold.",
                    "description": "Spray with rubbing alcohol. Set aside to cool for 30 seconds."
                },
                {
                    "headline": "Place face down either a soap design or a soft child-safe toy.",
                    "description": "Once again, spray with rubbing alcohol."
                },
                {
                    "headline": "Set aside to cool for 3 to 5 minutes.",
                    "description": "Add a colored background or leave it clear. Once cooled down, it's done."
                }
            ]
        }
    ],
    "tyn": [
        "Glycerine soap pieces",
        "Colorant",
        "Fragrance oil",
        "Microwave-proof bowl",
        "Microwave oven",
        "Soap molds",
        "Thermometer (if layering)",
        "Rubbing alcohol in a spray bottle",
        "Blue-tinted clear glycerine for embedded method",
        "Soft toy or soap design for embedded method"
    ],
    "text": " Melting the soap Set up the soap molds in readiness for pouring before starting. You may wish to place newspaper underneath, to catch any spills. Gather the glycerine soap pieces. If you've been storing used pieces for a while, use these. If not, you'll need to cut up block glycerine soaps into inch-sized cubes. Place the glycerine soap pieces or cubes into a microwave-proof bowl. If you don't have a microwave oven, place in a double boiler for melting over the stove top. Place the bowl of glycerine soap pieces into the microwave. Microwave on high for 30 seconds, at 10 second intervals. Check each time to see how much it has melted. When fully melted, remove from the microwave oven. Add colorant and fragrance oil to the melted soap. Put a few drops of each into the melted solution and stir to combine. Pouring the soap Pour the melted glycerine soap solution into the soap molds.  Spray with rubbing alcohol to break any surface bubbles.  Set aside and let cool for 30 minutes to one hour. The soap will form in the mold shape as it cools. Pour the first layer of melted soap into the  molds, not all the way, though. Spritz with rubbing alcohol to prevent the formation of surface bubbles. Set aside to cool for 3 to 5 minutes. Pour a second layer of melted, colored, (and scented if wished) soap onto the first layer of soap. This should be cool enough (below 130ºC) to not melt the first layer. Spray with rubbing alcohol. Repeat until you form the final layer. Two layers is just fine, or you could perhaps make three. Choose a suitable item for embedding. It must be non-toxic and small. For example, a child-safe soft toy or a sponge shape. Special soap designs are made for this purpose, inquire at the craft store. Pour melted blue-tinted clear glycerine into a mold. Spray with rubbing alcohol. Set aside to cool for 30 seconds. Place face down either a soap design or a soft child-safe toy. Once again, spray with rubbing alcohol. Set aside to cool for 3 to 5 minutes. Add a colored background or leave it clear. Once cooled down, it's done.",
    "sentences": [
        " Melting the soap Set up the soap molds in readiness for pouring before starting.",
        "You may wish to place newspaper underneath, to catch any spills.",
        "Gather the glycerine soap pieces.",
        "If you've been storing used pieces for a while, use these.",
        "If not, you'll need to cut up block glycerine soaps into inch-sized cubes.",
        "Place the glycerine soap pieces or cubes into a microwave-proof bowl.",
        "If you don't have a microwave oven, place in a double boiler for melting over the stove top.",
        "Place the bowl of glycerine soap pieces into the microwave.",
        "Microwave on high for 30 seconds, at 10 second intervals.",
        "Check each time to see how much it has melted.",
        "When fully melted, remove from the microwave oven.",
        "Add colorant and fragrance oil to the melted soap.",
        "Put a few drops of each into the melted solution and stir to combine.",
        "Pouring the soap Pour the melted glycerine soap solution into the soap molds.",
        "Spray with rubbing alcohol to break any surface bubbles.",
        "Set aside and let cool for 30 minutes to one hour.",
        "The soap will form in the mold shape as it cools.",
        "Pour the first layer of melted soap into the  molds, not all the way, though.",
        "Spritz with rubbing alcohol to prevent the formation of surface bubbles.",
        "Set aside to cool for 3 to 5 minutes.",
        "Pour a second layer of melted, colored, (and scented if wished) soap onto the first layer of soap.",
        "This should be cool enough (below 130ºC) to not melt the first layer.",
        "Spray with rubbing alcohol.",
        "Repeat until you form the final layer.",
        "Two layers is just fine, or you could perhaps make three.",
        "Choose a suitable item for embedding.",
        "It must be non-toxic and small.",
        "For example, a child-safe soft toy or a sponge shape.",
        "Special soap designs are made for this purpose, inquire at the craft store.",
        "Pour melted blue-tinted clear glycerine into a mold.",
        "Spray with rubbing alcohol.",
        "Set aside to cool for 30 seconds.",
        "Place face down either a soap design or a soft child-safe toy.",
        "Once again, spray with rubbing alcohol.",
        "Set aside to cool for 3 to 5 minutes.",
        "Add a colored background or leave it clear.",
        "Once cooled down, it's done."
    ]
}