{
    "title": "How to Make Hand Lotion",
    "url": "https://www.wikihow.com/Make-Hand-Lotion",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Handmade Cosmetics"
    ],
    "methods": [
        {
            "name": "Making a Water-Based Hand Lotion",
            "steps": [
                {
                    "headline": "Stir together ¼ cup (60 milliliters) of olive oil and ¼ cup (28 grams) of emulsifying wax.",
                    "description": "Pour the oil into a glass measuring cup, then add the wax. Stir the two ingredients together until just combined."
                },
                {
                    "headline": "Heat the oil mixture until the wax melts.",
                    "description": "You can do this in a pot filled with water over medium heat. You can also heat the mixture in the microwave for about 1 minute."
                },
                {
                    "headline": "Stir 24 to 36 drops of essential oil into the oil mixture, if desired.",
                    "description": "You can use any scent you like; rose and lavender are especially popular in hand lotions. You can even use a combination of scents, such as rosemary-lavender or eucalyptus-mint. If you wish to have unscented hand lotion, you can skip this step."
                },
                {
                    "headline": "Heat 1¼ to 1½ cup (300 to 350 milliliters) of water in the microwave for 1 minute.",
                    "description": "For a twist, you can use rose water instead. This will have a nice, subtle fragrance to the lotion."
                },
                {
                    "headline": "Pour the water into the oil mixture.",
                    "description": "The mixture will be milky-white and liquid-y. Don't worry, however, it will thicken up once it starts to cool down. You should not have to stir the mixture, but if the ingredients aren't coming together, give the mixture a quick stir."
                },
                {
                    "headline": "Pour the mixture into a mason jar, cover it tightly with a lid, and let it sit overnight.",
                    "description": "To make the lotion easier to use, consider pouring it into smaller mason jars instead. A great size to work with is 4 ounces (120 milliliters). You can also pour it into a glass soap dispenser so that you can pump it out instead."
                },
                {
                    "headline": "Use the lotion within 3 to 4 weeks.",
                    "description": "Because this lotion contains water, it is perishable. Keep it in the fridge, and inspect it for mould or bubbling regularly. It should last about 4 weeks, but it may expire sooner than that."
                }
            ]
        },
        {
            "name": "Making an Oil-Based Hand Lotion",
            "steps": [
                {
                    "headline": "Set up a double boiler.",
                    "description": "Fill a saucepan with 2 inches (5.08 centimeters) of water, and place a heat-safe bowl on top. Make sure that the bottom of the bowl does not touch the water. If it does, pour some of the water out."
                },
                {
                    "headline": "Fill the bowl with ½ cup (120 milliliters) of olive oil and ½ cup (120 milliliters) of coconut oil.",
                    "description": "This will great the base for your hand lotion. If you do not like olive oil, don't own any, or simply want something more special, try almond oil, grapeseed oil, or jojoba oil instead."
                },
                {
                    "headline": "Add ¼ cup (36 grams) of beeswax pellets.",
                    "description": "This will give your lotion that thick consistency. It is also a natural humectant, so it may help keep your skin moisturized."
                },
                {
                    "headline": "Add 1 teaspoon of vitamin E oil and 1 to 2 tablespoons (15 to 30 grams) of shea butter.",
                    "description": "The vitamin E oil will help nourish your skin as well as act as a preservative. The shea butter will help lock in moisture and nourish your skin."
                },
                {
                    "headline": "Melt the ingredients together over medium heat.",
                    "description": "Stir them occasionally with a spoon as they melt; this helps them melt more evenly. It may take up to 20 minutes for the ingredients to melt."
                },
                {
                    "headline": "Take the bowl off the saucepan, let the lotion cool for a few minutes, then stir in some essential oil, if desired.",
                    "description": "Start with 10 drops, then add more as desired. Plan on using between 10 and 20 drops of essential oil. You can use one fragrance, such as lavender, or you can use a combination of 2 to 3 fragrances, such as lemon-mint-eucalyptus. If you want a natural-scented lotion (coconut oil and shea butter), you can skip this step."
                },
                {
                    "headline": "Pour the lotion into small mason jars.",
                    "description": "A great size to work with is 4 ounces (120 milliliters). This will make the lotion easier to scoop out. Alternatively, you can pour the lotion into a glass soap dispenser instead."
                },
                {
                    "headline": "Let the lotion set overnight, then use it.",
                    "description": "Because the lotion does not contain water, it should last about 6 months. It does not need to be refrigerated, but if it is very hot in your home, you might want to store it in the fridge."
                }
            ]
        },
        {
            "name": "Making a Whipped Hand Lotion",
            "steps": [
                {
                    "headline": "Assemble a double boiler.",
                    "description": "Fill a saucepan with 2 inches (5.08 centimeters) of water, and place a heat-safe bowl on top. Make sure that the bottom of the bowl is not touching the surface of the water. If it is, pour some of the water out."
                },
                {
                    "headline": "Put ½ cup (120 milliliters) of coconut oil and ½ cup (115 grams) of shea butter into the bowl.",
                    "description": "This will create the base for your lotion. Both coconut oil and shea butter are wonderful for the skin because of how moisturizing and nourishing they are."
                },
                {
                    "headline": "Add 3 tablespoons (67.5 grams) of honey.",
                    "description": "Don't add the essential oils just yet; you'll add those in at the very end. Honey is a natural humectant, so it will help attract moisture to your skin. It is also non-perishable, so you don't have to worry about your lotion going bad."
                },
                {
                    "headline": "Melt the ingredients together over medium heat.",
                    "description": "Stir the ingredients together from time to time to help them melt. It may take 10 to 20 minutes for everything to melt completely."
                },
                {
                    "headline": "Take the bowl off the heat and let it cool for 1 to 2 hours in the fridge.",
                    "description": "The mixture will turn solid as it cools. Don't worry if it looks too thick, however; you will be beating the mixture to give it a light, fluffy texture."
                },
                {
                    "headline": "Scrape the mixture from the sides of the bowl using a rubber spatula.",
                    "description": "Keep the mixture in the bowl. You are simply doing this to make it easier to mix later on."
                },
                {
                    "headline": "Add 20 to 30 drops of essential oil, if desired.",
                    "description": "Start with just 20 drops, then add more as needed. You can use any type of essential oil you like. It can be one fragrance, such as chamomile or lavender, or a combination of fragrances, such as lavender-rose."
                },
                {
                    "headline": "Beat the mixture together using a hand-held beater.",
                    "description": "If you don't have one, you can use an electric mixer or even a food processor. Keep beating the mixture until it turns light and fluffy."
                },
                {
                    "headline": "Scoop the mixture into a glass jar.",
                    "description": "If you'd like, you can scoop it into 4-ounce (120-milliliter) mason jars; this will make it easier to scoop out. Because of its light and fluffy texture, this lotion is not recommended for dispenser-type bottles."
                },
                {
                    "headline": "Use the hand lotion.",
                    "description": "Because it does not contain any water, it is non-perishable. Nonetheless, try to use it within 6 months. If it gets too soft or starts to melt, store it in the fridge."
                }
            ]
        }
    ],
    "tyn": [
        "Making a Water-Based Hand Lotion",
        "1¼ to 1½ cups (300 to 350 milliliters) hot water",
        "¼ cup (28 grams) emulsifying wax (not beeswax)",
        "¼ cup (60 milliliters) olive oil",
        "24 to 36 drops essential oil",
        "Glass measuring cup",
        "Small mason jars",
        "Making an Oil-Based Hand Lotion",
        "½ cup (120 milliliters) olive oil (or almond, grapeseed, or jojoba oil)",
        "½ cup (120 milliliters) coconut oil",
        "¼ cup (36 grams) beeswax pellets",
        "1 teaspoon vitamin E oil",
        "1 to 2 tablespoons (15 to 30 grams) shea butter",
        "10 to 20 drops essential oil",
        "Saucepan",
        "Heat-safe bowl",
        "Spoon",
        "Making a Whipped Hand Lotion",
        "½ cup (120 milliliters) coconut Oil",
        "½ cup (115 grams) shea butter",
        "3 tablespoons (67.5 grams) honey",
        "20 to 30 drops essential oil",
        "Glass bowl",
        "Hand mixer, electric mixer, or food processor"
    ],
    "text": " Making a Water-Based Hand Lotion Stir together ¼ cup (60 milliliters) of olive oil and ¼ cup (28 grams) of emulsifying wax. Pour the oil into a glass measuring cup, then add the wax. Stir the two ingredients together until just combined. Heat the oil mixture until the wax melts. You can do this in a pot filled with water over medium heat. You can also heat the mixture in the microwave for about 1 minute. Stir 24 to 36 drops of essential oil into the oil mixture, if desired. You can use any scent you like; rose and lavender are especially popular in hand lotions. You can even use a combination of scents, such as rosemary-lavender or eucalyptus-mint. If you wish to have unscented hand lotion, you can skip this step. Heat 1¼ to 1½ cup (300 to 350 milliliters) of water in the microwave for 1 minute. For a twist, you can use rose water instead. This will have a nice, subtle fragrance to the lotion. Pour the water into the oil mixture. The mixture will be milky-white and liquid-y. Don't worry, however, it will thicken up once it starts to cool down. You should not have to stir the mixture, but if the ingredients aren't coming together, give the mixture a quick stir. Pour the mixture into a mason jar, cover it tightly with a lid, and let it sit overnight. To make the lotion easier to use, consider pouring it into smaller mason jars instead. A great size to work with is 4 ounces (120 milliliters). You can also pour it into a glass soap dispenser so that you can pump it out instead. Use the lotion within 3 to 4 weeks. Because this lotion contains water, it is perishable. Keep it in the fridge, and inspect it for mould or bubbling regularly. It should last about 4 weeks, but it may expire sooner than that. Making an Oil-Based Hand Lotion Set up a double boiler. Fill a saucepan with 2 inches (5.08 centimeters) of water, and place a heat-safe bowl on top. Make sure that the bottom of the bowl does not touch the water. If it does, pour some of the water out. Fill the bowl with ½ cup (120 milliliters) of olive oil and ½ cup (120 milliliters) of coconut oil. This will great the base for your hand lotion. If you do not like olive oil, don't own any, or simply want something more special, try almond oil, grapeseed oil, or jojoba oil instead. Add ¼ cup (36 grams) of beeswax pellets. This will give your lotion that thick consistency. It is also a natural humectant, so it may help keep your skin moisturized. Add 1 teaspoon of vitamin E oil and 1 to 2 tablespoons (15 to 30 grams) of shea butter. The vitamin E oil will help nourish your skin as well as act as a preservative. The shea butter will help lock in moisture and nourish your skin. Melt the ingredients together over medium heat. Stir them occasionally with a spoon as they melt; this helps them melt more evenly. It may take up to 20 minutes for the ingredients to melt. Take the bowl off the saucepan, let the lotion cool for a few minutes, then stir in some essential oil, if desired. Start with 10 drops, then add more as desired. Plan on using between 10 and 20 drops of essential oil. You can use one fragrance, such as lavender, or you can use a combination of 2 to 3 fragrances, such as lemon-mint-eucalyptus. If you want a natural-scented lotion (coconut oil and shea butter), you can skip this step. Pour the lotion into small mason jars. A great size to work with is 4 ounces (120 milliliters). This will make the lotion easier to scoop out. Alternatively, you can pour the lotion into a glass soap dispenser instead. Let the lotion set overnight, then use it. Because the lotion does not contain water, it should last about 6 months. It does not need to be refrigerated, but if it is very hot in your home, you might want to store it in the fridge. Making a Whipped Hand Lotion Assemble a double boiler. Fill a saucepan with 2 inches (5.08 centimeters) of water, and place a heat-safe bowl on top. Make sure that the bottom of the bowl is not touching the surface of the water. If it is, pour some of the water out. Put ½ cup (120 milliliters) of coconut oil and ½ cup (115 grams) of shea butter into the bowl. This will create the base for your lotion. Both coconut oil and shea butter are wonderful for the skin because of how moisturizing and nourishing they are. Add 3 tablespoons (67.5 grams) of honey. Don't add the essential oils just yet; you'll add those in at the very end. Honey is a natural humectant, so it will help attract moisture to your skin. It is also non-perishable, so you don't have to worry about your lotion going bad. Melt the ingredients together over medium heat. Stir the ingredients together from time to time to help them melt. It may take 10 to 20 minutes for everything to melt completely. Take the bowl off the heat and let it cool for 1 to 2 hours in the fridge. The mixture will turn solid as it cools. Don't worry if it looks too thick, however; you will be beating the mixture to give it a light, fluffy texture. Scrape the mixture from the sides of the bowl using a rubber spatula. Keep the mixture in the bowl. You are simply doing this to make it easier to mix later on. Add 20 to 30 drops of essential oil, if desired. Start with just 20 drops, then add more as needed. You can use any type of essential oil you like. It can be one fragrance, such as chamomile or lavender, or a combination of fragrances, such as lavender-rose. Beat the mixture together using a hand-held beater. If you don't have one, you can use an electric mixer or even a food processor. Keep beating the mixture until it turns light and fluffy. Scoop the mixture into a glass jar. If you'd like, you can scoop it into 4-ounce (120-milliliter) mason jars; this will make it easier to scoop out. Because of its light and fluffy texture, this lotion is not recommended for dispenser-type bottles. Use the hand lotion. Because it does not contain any water, it is non-perishable. Nonetheless, try to use it within 6 months. If it gets too soft or starts to melt, store it in the fridge.",
    "sentences": [
        " Making a Water-Based Hand Lotion Stir together ¼ cup (60 milliliters) of olive oil and ¼ cup (28 grams) of emulsifying wax.",
        "Pour the oil into a glass measuring cup, then add the wax.",
        "Stir the two ingredients together until just combined.",
        "Heat the oil mixture until the wax melts.",
        "You can do this in a pot filled with water over medium heat.",
        "You can also heat the mixture in the microwave for about 1 minute.",
        "Stir 24 to 36 drops of essential oil into the oil mixture, if desired.",
        "You can use any scent you like; rose and lavender are especially popular in hand lotions.",
        "You can even use a combination of scents, such as rosemary-lavender or eucalyptus-mint.",
        "If you wish to have unscented hand lotion, you can skip this step.",
        "Heat 1¼ to 1½ cup (300 to 350 milliliters) of water in the microwave for 1 minute.",
        "For a twist, you can use rose water instead.",
        "This will have a nice, subtle fragrance to the lotion.",
        "Pour the water into the oil mixture.",
        "The mixture will be milky-white and liquid-y.",
        "Don't worry, however, it will thicken up once it starts to cool down.",
        "You should not have to stir the mixture, but if the ingredients aren't coming together, give the mixture a quick stir.",
        "Pour the mixture into a mason jar, cover it tightly with a lid, and let it sit overnight.",
        "To make the lotion easier to use, consider pouring it into smaller mason jars instead.",
        "A great size to work with is 4 ounces (120 milliliters).",
        "You can also pour it into a glass soap dispenser so that you can pump it out instead.",
        "Use the lotion within 3 to 4 weeks.",
        "Because this lotion contains water, it is perishable.",
        "Keep it in the fridge, and inspect it for mould or bubbling regularly.",
        "It should last about 4 weeks, but it may expire sooner than that.",
        "Making an Oil-Based Hand Lotion Set up a double boiler.",
        "Fill a saucepan with 2 inches (5.08 centimeters) of water, and place a heat-safe bowl on top.",
        "Make sure that the bottom of the bowl does not touch the water.",
        "If it does, pour some of the water out.",
        "Fill the bowl with ½ cup (120 milliliters) of olive oil and ½ cup (120 milliliters) of coconut oil.",
        "This will great the base for your hand lotion.",
        "If you do not like olive oil, don't own any, or simply want something more special, try almond oil, grapeseed oil, or jojoba oil instead.",
        "Add ¼ cup (36 grams) of beeswax pellets.",
        "This will give your lotion that thick consistency.",
        "It is also a natural humectant, so it may help keep your skin moisturized.",
        "Add 1 teaspoon of vitamin E oil and 1 to 2 tablespoons (15 to 30 grams) of shea butter.",
        "The vitamin E oil will help nourish your skin as well as act as a preservative.",
        "The shea butter will help lock in moisture and nourish your skin.",
        "Melt the ingredients together over medium heat.",
        "Stir them occasionally with a spoon as they melt; this helps them melt more evenly.",
        "It may take up to 20 minutes for the ingredients to melt.",
        "Take the bowl off the saucepan, let the lotion cool for a few minutes, then stir in some essential oil, if desired.",
        "Start with 10 drops, then add more as desired.",
        "Plan on using between 10 and 20 drops of essential oil.",
        "You can use one fragrance, such as lavender, or you can use a combination of 2 to 3 fragrances, such as lemon-mint-eucalyptus.",
        "If you want a natural-scented lotion (coconut oil and shea butter), you can skip this step.",
        "Pour the lotion into small mason jars.",
        "A great size to work with is 4 ounces (120 milliliters).",
        "This will make the lotion easier to scoop out.",
        "Alternatively, you can pour the lotion into a glass soap dispenser instead.",
        "Let the lotion set overnight, then use it.",
        "Because the lotion does not contain water, it should last about 6 months.",
        "It does not need to be refrigerated, but if it is very hot in your home, you might want to store it in the fridge.",
        "Making a Whipped Hand Lotion Assemble a double boiler.",
        "Fill a saucepan with 2 inches (5.08 centimeters) of water, and place a heat-safe bowl on top.",
        "Make sure that the bottom of the bowl is not touching the surface of the water.",
        "If it is, pour some of the water out.",
        "Put ½ cup (120 milliliters) of coconut oil and ½ cup (115 grams) of shea butter into the bowl.",
        "This will create the base for your lotion.",
        "Both coconut oil and shea butter are wonderful for the skin because of how moisturizing and nourishing they are.",
        "Add 3 tablespoons (67.5 grams) of honey.",
        "Don't add the essential oils just yet; you'll add those in at the very end.",
        "Honey is a natural humectant, so it will help attract moisture to your skin.",
        "It is also non-perishable, so you don't have to worry about your lotion going bad.",
        "Melt the ingredients together over medium heat.",
        "Stir the ingredients together from time to time to help them melt.",
        "It may take 10 to 20 minutes for everything to melt completely.",
        "Take the bowl off the heat and let it cool for 1 to 2 hours in the fridge.",
        "The mixture will turn solid as it cools.",
        "Don't worry if it looks too thick, however; you will be beating the mixture to give it a light, fluffy texture.",
        "Scrape the mixture from the sides of the bowl using a rubber spatula.",
        "Keep the mixture in the bowl.",
        "You are simply doing this to make it easier to mix later on.",
        "Add 20 to 30 drops of essential oil, if desired.",
        "Start with just 20 drops, then add more as needed.",
        "You can use any type of essential oil you like.",
        "It can be one fragrance, such as chamomile or lavender, or a combination of fragrances, such as lavender-rose.",
        "Beat the mixture together using a hand-held beater.",
        "If you don't have one, you can use an electric mixer or even a food processor.",
        "Keep beating the mixture until it turns light and fluffy.",
        "Scoop the mixture into a glass jar.",
        "If you'd like, you can scoop it into 4-ounce (120-milliliter) mason jars; this will make it easier to scoop out.",
        "Because of its light and fluffy texture, this lotion is not recommended for dispenser-type bottles.",
        "Use the hand lotion.",
        "Because it does not contain any water, it is non-perishable.",
        "Nonetheless, try to use it within 6 months.",
        "If it gets too soft or starts to melt, store it in the fridge."
    ]
}