{
    "title": "How to Make Candy Bar Wrappers for a Baby Shower",
    "url": "https://www.wikihow.com/Make-Candy-Bar-Wrappers-for-a-Baby-Shower",
    "category_hierarchy": [
        "Family Life",
        "Parenting",
        "Development Stages",
        "Babies and Infants"
    ],
    "methods": [
        {
            "name": "Using Scrapbooking Paper",
            "steps": [
                {
                    "headline": "Purchase scrapbooking paper that matches your baby shower's theme.",
                    "description": "Scrapbooking paper comes in all sorts of fun patterns. If your baby shower has a specific theme, such as jungles or oceans, then buy scrapbooking paper that matches that theme. Alternatively, choose paper with a neutral pattern, such as stripes or polka dots. Solid colors are a good choice too. If you are going with a solid color or a neutral pattern, you could match the color to your baby's gender. If you don't know your baby's gender or wish to keep it a surprise, stick with purple or yellow."
                },
                {
                    "headline": "Cut your paper to the size of the candy's paper wrapper.",
                    "description": "Take the paper wrapper off of your candy bar, but leave the foil wrapper on. Measure the length and width of the paper wrapper, then cut your scrapbooking paper accordingly. If your candy has a single wrapper that's sealed on both ends, cut the paper to 3 times the width and about ⁄2 inch (1.3 cm) shorter. Use a paper cutter or paper slicer. It will make your work quick and easy. The paper needs to be a little shorter than the candy bar so that the foil ends are visible."
                },
                {
                    "headline": "Wrap the chocolate in colored foil paper, if desired.",
                    "description": "Colored foil paper is different from aluminum foil; you can find it in the baking section of a craft store. Set the foil down with the back (paper side) facing you. Place the chocolate face-down on top. Fold the sides of the foil over onto the back of the chocolate, then fold the top and bottom edges down as well. Secure the foil with a strip of tape, if needed. If your chocolate came wrapped in foil leave the original foil on and wrap the new foil around it. It's more hygienic this way. If your chocolate came wrapped in plastic, fold the sealed ends to the back and tape them down first. Wrap the foil paper around the chocolate. Colored foil paper has foil on the front and paper on the back. You can find it online or in the baking section of a craft store. Choose a neutral color, such as silver. Alternatively, match the color to the wrapper: pink, blue, yellow, or purple."
                },
                {
                    "headline": "Place double-sided tape along the top edge of the cut paper.",
                    "description": "Set the cut scrapbooking paper down with the back/blank side facing you. Place a strip of double-sided tape along the top edge of the paper. This will help seal the wrapper and hold it in place."
                },
                {
                    "headline": "Wrap the paper around the chocolate.",
                    "description": "Place the chocolate face-down on top of the paper; make sure that it is centered. Wrap the bottom and top edges of the paper onto the back of the chocolate so that they overlap. Run your finger across the back of the chocolate to seal it. How much the paper overlaps depends on how long you cut the paper. You want it to be snug around the sides of the chocolate. Make sure that you fold the top edge (the one with the tape) down last, otherwise the wrapper won't stay shut."
                },
                {
                    "headline": "Add a homemade label to the front of the candy bar.",
                    "description": "Purchase pre-made labels online or design and print them yourself using a word editing program (i.e. Microsoft Word). Stick the label onto the front of the chocolate bar. If you can't get pre-cut, self-adhesive labels, print them out on regular paper. Cut them out, then secure them to the chocolate bar with double-sides tape. If you have nice handwriting, you can write on the words on the labels yourself. If you don't want to use labels at all, use letter stickers to write a name or word on the chocolate."
                },
                {
                    "headline": "Decorate the chocolate bar further with themed stickers, if desired.",
                    "description": "Choose some stickers that match the theme of the wrapper, then add them to the left or right side of the label. If you have a tiny sticker and a huge candy bar with a big label, you could add the sticker to the corner of the label instead. Stickers shaped like baby rattles and bottles make great choices, but you can use other ones too. You can find lots of stickers in the sticker and scrapbooking section of a craft store. They are often organized by theme."
                }
            ]
        },
        {
            "name": "Using a Computer",
            "steps": [
                {
                    "headline": "Remove the paper wrapper from the chocolate bar and measure it.",
                    "description": "Flip the chocolate bar over and carefully peel open the paper wrapper. Straighten the wrapper out, then measure the length and width. Record this measurement. If your chocolate bar did not come with an outer paper wrapper, measure the width of the chocolate and multiply it by 3. Measure the length and subtract ⁄2 inch (1.3 cm). You want the final paper to be a little narrower than the candy bar so that the foil ends stick out."
                },
                {
                    "headline": "Create a new document on a word editing program.",
                    "description": "Open a word editing program, such as Microsoft Word, and create a new document. Alternatively, open an image editing program, such as Photoshop; make the page size 8 1/2 by 11-inch (22 by 28-cm). Some programs have templates for things like candy wrappers. You can use these too."
                },
                {
                    "headline": "Create a rectangle the size of your wrapper.",
                    "description": "How you do this depends on the type of program that you have. For example, in Microsoft Word, you'll want to open the \"Insert\" tab, then insert a square or rectangle shape. Some programs allow you to input the exact dimensions of the shape. In other programs, you'll have to click and drag the shape. If your rectangle is almost the same length as the width of the paper, orient it horizontally. This way, you can add more rectangles beneath it and save space."
                },
                {
                    "headline": "Copy-paste a background image or fill into the rectangle.",
                    "description": "Find a background pattern that you like, then copy-paste it into your document. Click and drag the sides of the image to resize it until it fits your box. Alternatively, you can fill the box using the program's fill option. If the box is already colored, click on \"Format,\" then select \"No Fill\" to get a blank box. Use a color and pattern that matches your baby shower's color scheme."
                },
                {
                    "headline": "Insert a clip-art frame or clip-art label.",
                    "description": "You can use 1 of the options in your word or image editing program, or you can find the frame online. If you are using an online-frame, copy-paste it into the document, then click and drag on the corners to resize it. You can use any color you want for the frame or label, but white with a dark outline will stand out the best."
                },
                {
                    "headline": "Insert a text box and write your message.",
                    "description": "It can be a simple word, like \"Baby Bar\" or even your baby's name. Once you have written your message, highlight the message, then adjust the font type, size, and color. Use colors that stand out from the design. Black will work the best."
                },
                {
                    "headline": "Copy-paste the finished design to fill the paper.",
                    "description": "Leave a little bit of space between each design so that you have room to cut. Don't worry about filling up multiple pages. Most printers have an option that allows you to print out multiple copies. How many rectangles you manage to fit on 1 page depends on how wide they are."
                },
                {
                    "headline": "Print the wrappers.",
                    "description": "For best results, use a laser printer; this will give you a nice, glossy finish that is similar to store-bought wrappers. If you don't have a laser printer at home, save the file to a USB flash drive, and take it to a print shop instead. How many copies you print depends on how many candy bars you have to cover. It would be a good idea to print a few extra copies in case you mess up, however. Regular printer paper will do just fine. If you don't have a laser printer, try printer paper with a semi-glossy finish (not photo paper)."
                },
                {
                    "headline": "Cut the wrapper with a paper cutter or slicer.",
                    "description": "Make sure that you cut the wrapper just inside the outline to prevent any white from showing. Use a paper cutter or paper slicer to make clean, precise cuts."
                },
                {
                    "headline": "Wrap the chocolate with foil paper, if desired.",
                    "description": "Place the foil paper down with the back (paper) side facing you. Center the chocolate face-down on top of the paper. Fold the sides onto the back of the chocolate, then top the top and bottom edges onto the back of the chocolate too. Secure the flaps with a strip of tape, if needed. Buy silver foil paper, or choose a color that matches the paper wrapper you designed. If your chocolate came with a plastic wrapper, fold the sealed side edges onto the back, then tape them down. If your chocolate came with an outer foil wrapper, leave that on."
                },
                {
                    "headline": "Wrap the paper around the chocolate, then tape it shut.",
                    "description": "Place the paper wrapper over the front of the chocolate. Make sure that the design is centered, then fold the top and bottom edges over onto the back of the candy bar. Tape the top edge to the bottom edge with double-sided tape. The top and bottom edges should overlap. How much they overlap depends on how long the paper is. Make sure that the outer wrapper is snug; you don't want it to slide off!"
                }
            ]
        }
    ],
    "tyn": [
        "Using Scrapbooking Paper",
        "Chocolate bar",
        "Scrapbooking paper",
        "Paper cutter or paper slicer",
        "Labels",
        "Stickers",
        "Double-sided tape",
        "Foil paper (optional)",
        "Using a Computer",
        "Computer",
        "Word or image editing program"
    ],
    "text": " Using Scrapbooking Paper Purchase scrapbooking paper that matches your baby shower's theme. Scrapbooking paper comes in all sorts of fun patterns. If your baby shower has a specific theme, such as jungles or oceans, then buy scrapbooking paper that matches that theme. Alternatively, choose paper with a neutral pattern, such as stripes or polka dots. Solid colors are a good choice too. If you are going with a solid color or a neutral pattern, you could match the color to your baby's gender. If you don't know your baby's gender or wish to keep it a surprise, stick with purple or yellow. Cut your paper to the size of the candy's paper wrapper. Take the paper wrapper off of your candy bar, but leave the foil wrapper on. Measure the length and width of the paper wrapper, then cut your scrapbooking paper accordingly. If your candy has a single wrapper that's sealed on both ends, cut the paper to 3 times the width and about ⁄2 inch (1.3 cm) shorter. Use a paper cutter or paper slicer. It will make your work quick and easy. The paper needs to be a little shorter than the candy bar so that the foil ends are visible. Wrap the chocolate in colored foil paper, if desired. Colored foil paper is different from aluminum foil; you can find it in the baking section of a craft store. Set the foil down with the back (paper side) facing you. Place the chocolate face-down on top. Fold the sides of the foil over onto the back of the chocolate, then fold the top and bottom edges down as well. Secure the foil with a strip of tape, if needed. If your chocolate came wrapped in foil leave the original foil on and wrap the new foil around it. It's more hygienic this way. If your chocolate came wrapped in plastic, fold the sealed ends to the back and tape them down first. Wrap the foil paper around the chocolate. Colored foil paper has foil on the front and paper on the back. You can find it online or in the baking section of a craft store. Choose a neutral color, such as silver. Alternatively, match the color to the wrapper: pink, blue, yellow, or purple. Place double-sided tape along the top edge of the cut paper. Set the cut scrapbooking paper down with the back/blank side facing you. Place a strip of double-sided tape along the top edge of the paper. This will help seal the wrapper and hold it in place. Wrap the paper around the chocolate. Place the chocolate face-down on top of the paper; make sure that it is centered. Wrap the bottom and top edges of the paper onto the back of the chocolate so that they overlap. Run your finger across the back of the chocolate to seal it. How much the paper overlaps depends on how long you cut the paper. You want it to be snug around the sides of the chocolate. Make sure that you fold the top edge (the one with the tape) down last, otherwise the wrapper won't stay shut. Add a homemade label to the front of the candy bar. Purchase pre-made labels online or design and print them yourself using a word editing program (i.e. Microsoft Word). Stick the label onto the front of the chocolate bar. If you can't get pre-cut, self-adhesive labels, print them out on regular paper. Cut them out, then secure them to the chocolate bar with double-sides tape. If you have nice handwriting, you can write on the words on the labels yourself. If you don't want to use labels at all, use letter stickers to write a name or word on the chocolate. Decorate the chocolate bar further with themed stickers, if desired. Choose some stickers that match the theme of the wrapper, then add them to the left or right side of the label. If you have a tiny sticker and a huge candy bar with a big label, you could add the sticker to the corner of the label instead. Stickers shaped like baby rattles and bottles make great choices, but you can use other ones too. You can find lots of stickers in the sticker and scrapbooking section of a craft store. They are often organized by theme. Using a Computer Remove the paper wrapper from the chocolate bar and measure it. Flip the chocolate bar over and carefully peel open the paper wrapper. Straighten the wrapper out, then measure the length and width. Record this measurement. If your chocolate bar did not come with an outer paper wrapper, measure the width of the chocolate and multiply it by 3. Measure the length and subtract ⁄2 inch (1.3 cm). You want the final paper to be a little narrower than the candy bar so that the foil ends stick out. Create a new document on a word editing program. Open a word editing program, such as Microsoft Word, and create a new document. Alternatively, open an image editing program, such as Photoshop; make the page size 8 1/2 by 11-inch (22 by 28-cm). Some programs have templates for things like candy wrappers. You can use these too. Create a rectangle the size of your wrapper. How you do this depends on the type of program that you have. For example, in Microsoft Word, you'll want to open the \"Insert\" tab, then insert a square or rectangle shape. Some programs allow you to input the exact dimensions of the shape. In other programs, you'll have to click and drag the shape. If your rectangle is almost the same length as the width of the paper, orient it horizontally. This way, you can add more rectangles beneath it and save space. Copy-paste a background image or fill into the rectangle. Find a background pattern that you like, then copy-paste it into your document. Click and drag the sides of the image to resize it until it fits your box. Alternatively, you can fill the box using the program's fill option. If the box is already colored, click on \"Format,\" then select \"No Fill\" to get a blank box. Use a color and pattern that matches your baby shower's color scheme. Insert a clip-art frame or clip-art label. You can use 1 of the options in your word or image editing program, or you can find the frame online. If you are using an online-frame, copy-paste it into the document, then click and drag on the corners to resize it. You can use any color you want for the frame or label, but white with a dark outline will stand out the best. Insert a text box and write your message. It can be a simple word, like \"Baby Bar\" or even your baby's name. Once you have written your message, highlight the message, then adjust the font type, size, and color. Use colors that stand out from the design. Black will work the best. Copy-paste the finished design to fill the paper. Leave a little bit of space between each design so that you have room to cut. Don't worry about filling up multiple pages. Most printers have an option that allows you to print out multiple copies. How many rectangles you manage to fit on 1 page depends on how wide they are. Print the wrappers. For best results, use a laser printer; this will give you a nice, glossy finish that is similar to store-bought wrappers. If you don't have a laser printer at home, save the file to a USB flash drive, and take it to a print shop instead. How many copies you print depends on how many candy bars you have to cover. It would be a good idea to print a few extra copies in case you mess up, however. Regular printer paper will do just fine. If you don't have a laser printer, try printer paper with a semi-glossy finish (not photo paper). Cut the wrapper with a paper cutter or slicer. Make sure that you cut the wrapper just inside the outline to prevent any white from showing. Use a paper cutter or paper slicer to make clean, precise cuts. Wrap the chocolate with foil paper, if desired. Place the foil paper down with the back (paper) side facing you. Center the chocolate face-down on top of the paper. Fold the sides onto the back of the chocolate, then top the top and bottom edges onto the back of the chocolate too. Secure the flaps with a strip of tape, if needed. Buy silver foil paper, or choose a color that matches the paper wrapper you designed. If your chocolate came with a plastic wrapper, fold the sealed side edges onto the back, then tape them down. If your chocolate came with an outer foil wrapper, leave that on. Wrap the paper around the chocolate, then tape it shut. Place the paper wrapper over the front of the chocolate. Make sure that the design is centered, then fold the top and bottom edges over onto the back of the candy bar. Tape the top edge to the bottom edge with double-sided tape. The top and bottom edges should overlap. How much they overlap depends on how long the paper is. Make sure that the outer wrapper is snug; you don't want it to slide off!",
    "sentences": [
        " Using Scrapbooking Paper Purchase scrapbooking paper that matches your baby shower's theme.",
        "Scrapbooking paper comes in all sorts of fun patterns.",
        "If your baby shower has a specific theme, such as jungles or oceans, then buy scrapbooking paper that matches that theme.",
        "Alternatively, choose paper with a neutral pattern, such as stripes or polka dots.",
        "Solid colors are a good choice too.",
        "If you are going with a solid color or a neutral pattern, you could match the color to your baby's gender.",
        "If you don't know your baby's gender or wish to keep it a surprise, stick with purple or yellow.",
        "Cut your paper to the size of the candy's paper wrapper.",
        "Take the paper wrapper off of your candy bar, but leave the foil wrapper on.",
        "Measure the length and width of the paper wrapper, then cut your scrapbooking paper accordingly.",
        "If your candy has a single wrapper that's sealed on both ends, cut the paper to 3 times the width and about ⁄2 inch (1.3 cm) shorter.",
        "Use a paper cutter or paper slicer.",
        "It will make your work quick and easy.",
        "The paper needs to be a little shorter than the candy bar so that the foil ends are visible.",
        "Wrap the chocolate in colored foil paper, if desired.",
        "Colored foil paper is different from aluminum foil; you can find it in the baking section of a craft store.",
        "Set the foil down with the back (paper side) facing you.",
        "Place the chocolate face-down on top.",
        "Fold the sides of the foil over onto the back of the chocolate, then fold the top and bottom edges down as well.",
        "Secure the foil with a strip of tape, if needed.",
        "If your chocolate came wrapped in foil leave the original foil on and wrap the new foil around it.",
        "It's more hygienic this way.",
        "If your chocolate came wrapped in plastic, fold the sealed ends to the back and tape them down first.",
        "Wrap the foil paper around the chocolate.",
        "Colored foil paper has foil on the front and paper on the back.",
        "You can find it online or in the baking section of a craft store.",
        "Choose a neutral color, such as silver.",
        "Alternatively, match the color to the wrapper: pink, blue, yellow, or purple.",
        "Place double-sided tape along the top edge of the cut paper.",
        "Set the cut scrapbooking paper down with the back/blank side facing you.",
        "Place a strip of double-sided tape along the top edge of the paper.",
        "This will help seal the wrapper and hold it in place.",
        "Wrap the paper around the chocolate.",
        "Place the chocolate face-down on top of the paper; make sure that it is centered.",
        "Wrap the bottom and top edges of the paper onto the back of the chocolate so that they overlap.",
        "Run your finger across the back of the chocolate to seal it.",
        "How much the paper overlaps depends on how long you cut the paper.",
        "You want it to be snug around the sides of the chocolate.",
        "Make sure that you fold the top edge (the one with the tape) down last, otherwise the wrapper won't stay shut.",
        "Add a homemade label to the front of the candy bar.",
        "Purchase pre-made labels online or design and print them yourself using a word editing program (i.e.",
        "Microsoft Word).",
        "Stick the label onto the front of the chocolate bar.",
        "If you can't get pre-cut, self-adhesive labels, print them out on regular paper.",
        "Cut them out, then secure them to the chocolate bar with double-sides tape.",
        "If you have nice handwriting, you can write on the words on the labels yourself.",
        "If you don't want to use labels at all, use letter stickers to write a name or word on the chocolate.",
        "Decorate the chocolate bar further with themed stickers, if desired.",
        "Choose some stickers that match the theme of the wrapper, then add them to the left or right side of the label.",
        "If you have a tiny sticker and a huge candy bar with a big label, you could add the sticker to the corner of the label instead.",
        "Stickers shaped like baby rattles and bottles make great choices, but you can use other ones too.",
        "You can find lots of stickers in the sticker and scrapbooking section of a craft store.",
        "They are often organized by theme.",
        "Using a Computer Remove the paper wrapper from the chocolate bar and measure it.",
        "Flip the chocolate bar over and carefully peel open the paper wrapper.",
        "Straighten the wrapper out, then measure the length and width.",
        "Record this measurement.",
        "If your chocolate bar did not come with an outer paper wrapper, measure the width of the chocolate and multiply it by 3.",
        "Measure the length and subtract ⁄2 inch (1.3 cm).",
        "You want the final paper to be a little narrower than the candy bar so that the foil ends stick out.",
        "Create a new document on a word editing program.",
        "Open a word editing program, such as Microsoft Word, and create a new document.",
        "Alternatively, open an image editing program, such as Photoshop; make the page size 8 1/2 by 11-inch (22 by 28-cm).",
        "Some programs have templates for things like candy wrappers.",
        "You can use these too.",
        "Create a rectangle the size of your wrapper.",
        "How you do this depends on the type of program that you have.",
        "For example, in Microsoft Word, you'll want to open the \"Insert\" tab, then insert a square or rectangle shape.",
        "Some programs allow you to input the exact dimensions of the shape.",
        "In other programs, you'll have to click and drag the shape.",
        "If your rectangle is almost the same length as the width of the paper, orient it horizontally.",
        "This way, you can add more rectangles beneath it and save space.",
        "Copy-paste a background image or fill into the rectangle.",
        "Find a background pattern that you like, then copy-paste it into your document.",
        "Click and drag the sides of the image to resize it until it fits your box.",
        "Alternatively, you can fill the box using the program's fill option.",
        "If the box is already colored, click on \"Format,\" then select \"No Fill\" to get a blank box.",
        "Use a color and pattern that matches your baby shower's color scheme.",
        "Insert a clip-art frame or clip-art label.",
        "You can use 1 of the options in your word or image editing program, or you can find the frame online.",
        "If you are using an online-frame, copy-paste it into the document, then click and drag on the corners to resize it.",
        "You can use any color you want for the frame or label, but white with a dark outline will stand out the best.",
        "Insert a text box and write your message.",
        "It can be a simple word, like \"Baby Bar\" or even your baby's name.",
        "Once you have written your message, highlight the message, then adjust the font type, size, and color.",
        "Use colors that stand out from the design.",
        "Black will work the best.",
        "Copy-paste the finished design to fill the paper.",
        "Leave a little bit of space between each design so that you have room to cut.",
        "Don't worry about filling up multiple pages.",
        "Most printers have an option that allows you to print out multiple copies.",
        "How many rectangles you manage to fit on 1 page depends on how wide they are.",
        "Print the wrappers.",
        "For best results, use a laser printer; this will give you a nice, glossy finish that is similar to store-bought wrappers.",
        "If you don't have a laser printer at home, save the file to a USB flash drive, and take it to a print shop instead.",
        "How many copies you print depends on how many candy bars you have to cover.",
        "It would be a good idea to print a few extra copies in case you mess up, however.",
        "Regular printer paper will do just fine.",
        "If you don't have a laser printer, try printer paper with a semi-glossy finish (not photo paper).",
        "Cut the wrapper with a paper cutter or slicer.",
        "Make sure that you cut the wrapper just inside the outline to prevent any white from showing.",
        "Use a paper cutter or paper slicer to make clean, precise cuts.",
        "Wrap the chocolate with foil paper, if desired.",
        "Place the foil paper down with the back (paper) side facing you.",
        "Center the chocolate face-down on top of the paper.",
        "Fold the sides onto the back of the chocolate, then top the top and bottom edges onto the back of the chocolate too.",
        "Secure the flaps with a strip of tape, if needed.",
        "Buy silver foil paper, or choose a color that matches the paper wrapper you designed.",
        "If your chocolate came with a plastic wrapper, fold the sealed side edges onto the back, then tape them down.",
        "If your chocolate came with an outer foil wrapper, leave that on.",
        "Wrap the paper around the chocolate, then tape it shut.",
        "Place the paper wrapper over the front of the chocolate.",
        "Make sure that the design is centered, then fold the top and bottom edges over onto the back of the candy bar.",
        "Tape the top edge to the bottom edge with double-sided tape.",
        "The top and bottom edges should overlap.",
        "How much they overlap depends on how long the paper is.",
        "Make sure that the outer wrapper is snug; you don't want it to slide off!"
    ]
}