{
    "title": "How to Draw a Hermit Crab",
    "url": "https://www.wikihow.com/Draw-a-Hermit-Crab",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Drawing"
    ],
    "steps": [
        {
            "headline": "First if you own a hermit crab you want to draw get it ready for its close up.",
            "description": "Clean it and make it look good!"
        },
        {
            "headline": "Be sure you have all the needed supplies.",
            "description": "Have good quality paper, a nicely sharpened pencil and good colored pencils or crayons or markers."
        },
        {
            "headline": "Start with the shell.",
            "description": "Draw a circle with one bottom edge coming in a little. Next draw a swirl in the middle."
        },
        {
            "headline": "In the part of the shell that comes in a little draw two outward curving lines.",
            "description": "Then on the bottom one draw a hermit crab leg. Repeat that and then draw the large pincher."
        },
        {
            "headline": "Under the bottom line again draw a hermit crab leg but only the bottom of it.",
            "description": "Repeat that then draw the feeding pincher. (remember this pincher is much smaller then the large pincher!"
        },
        {
            "headline": "Next draw the eye stalks and eyes (They are pretty much two lines with a circle on on top of them.)",
            "description": ""
        },
        {
            "headline": "After that draw the antennae.",
            "description": "(There are four. The front ones can be drawn as a line with a tiny line pointing up at the end. The other ones are drawn as a line protruding from under the front antennae."
        },
        {
            "headline": "Now that you have finished sketching the hermit crab you can color it however you want!",
            "description": ""
        }
    ],
    "tyn": [
        "Pencil",
        "Colored pencils/crayons/markers(whichever you prefer!)",
        "Paper",
        "Frame (optional)",
        "Hermit crab model (optional)"
    ],
    "text": " First if you own a hermit crab you want to draw get it ready for its close up. Clean it and make it look good! Be sure you have all the needed supplies. Have good quality paper, a nicely sharpened pencil and good colored pencils or crayons or markers. Start with the shell. Draw a circle with one bottom edge coming in a little. Next draw a swirl in the middle. In the part of the shell that comes in a little draw two outward curving lines. Then on the bottom one draw a hermit crab leg. Repeat that and then draw the large pincher. Under the bottom line again draw a hermit crab leg but only the bottom of it. Repeat that then draw the feeding pincher. (remember this pincher is much smaller then the large pincher! Next draw the eye stalks and eyes (They are pretty much two lines with a circle on on top of them.)  After that draw the antennae. (There are four. The front ones can be drawn as a line with a tiny line pointing up at the end. The other ones are drawn as a line protruding from under the front antennae. Now that you have finished sketching the hermit crab you can color it however you want! ",
    "sentences": [
        " First if you own a hermit crab you want to draw get it ready for its close up.",
        "Clean it and make it look good!",
        "Be sure you have all the needed supplies.",
        "Have good quality paper, a nicely sharpened pencil and good colored pencils or crayons or markers.",
        "Start with the shell.",
        "Draw a circle with one bottom edge coming in a little.",
        "Next draw a swirl in the middle.",
        "In the part of the shell that comes in a little draw two outward curving lines.",
        "Then on the bottom one draw a hermit crab leg.",
        "Repeat that and then draw the large pincher.",
        "Under the bottom line again draw a hermit crab leg but only the bottom of it.",
        "Repeat that then draw the feeding pincher.",
        "(remember this pincher is much smaller then the large pincher!",
        "Next draw the eye stalks and eyes (They are pretty much two lines with a circle on on top of them.)",
        "After that draw the antennae.",
        "(There are four.",
        "The front ones can be drawn as a line with a tiny line pointing up at the end.",
        "The other ones are drawn as a line protruding from under the front antennae.",
        "Now that you have finished sketching the hermit crab you can color it however you want!"
    ]
}