{
    "title": "How to Use Skype on an iPhone",
    "url": "https://www.wikihow.com/Use-Skype-on-an-iPhone",
    "category_hierarchy": [
        "Computers and Electronics",
        "Telephones",
        "Smartphones",
        "IPhone"
    ],
    "parts": [
        {
            "name": "Downloading and Installing Skype",
            "steps": [
                {
                    "headline": "Open the App Store.",
                    "description": "It's a blue app that contains a white \"A\" inside a white circle."
                },
                {
                    "headline": "Tap Search.",
                    "description": "It's a magnifying glass icon at the bottom-right of the screen."
                },
                {
                    "headline": "Tap the search field.",
                    "description": "It's at the top of the screen."
                },
                {
                    "headline": "Start typing \"Skype\" in the search field.",
                    "description": ""
                },
                {
                    "headline": "Tap Skype.",
                    "description": "It will appear below the search field as you type."
                },
                {
                    "headline": "Tap GET.",
                    "description": "It's to the right of \"Skype.\""
                },
                {
                    "headline": "Tap INSTALL.",
                    "description": "It appears where \"GET\" had been. If prompted, enter your Apple ID and/or password."
                }
            ]
        },
        {
            "name": "Signing In to Skype",
            "steps": [
                {
                    "headline": "Open the Skype app.",
                    "description": "It's a blue app with a blue S inside a white cloud."
                },
                {
                    "headline": "Enter your username.",
                    "description": "Do so in the field just below the word \"Skype\" near the top of the screen. If you don't have a Skype account, tap Create account at the bottom of the screen. Enter your phone number and a password, or tap Use your email instead if you prefer to sign up with email, then tap Next. Enter your first and last names, then tap Next. Enter your country and birth date, then tap Next. Enter the code sent to your email address or phone number to verify your identity, then tap Next. Enter the security characters on the screen to prove you're not a bot and tap Next. If prompted, enter your phone number, then tap ➲. Enter the code sent to your phone to verify your number, then follow on-screen prompts to continue configuring your account."
                },
                {
                    "headline": "Enter your password.",
                    "description": ""
                },
                {
                    "headline": "Tap Sign In.",
                    "description": "It's the blue button below the password field."
                }
            ]
        },
        {
            "name": "Adding Contacts",
            "steps": [
                {
                    "headline": "Tap Contacts.",
                    "description": "It's a blue address book icon at the bottom-left of the screen."
                },
                {
                    "headline": "Tap the \"Add Contact\" button.",
                    "description": "It's the blue silhouette of a person next to a \"+\" in the upper-right corner of the screen."
                },
                {
                    "headline": "Start typing the name of a contact.",
                    "description": "Do so in the search field near the top of the screen. You can only add contacts who already have Skype accounts. If you'd like to Skype with someone who doesn't have an account, tap Invite friends to Skype and follow the on-screen instructions. To invite people already in your iPhone's Contacts, tap Contacts in Skype and scroll down to the \"Address Book\" section. Tap Invite next to the contact with whom you'd like to Skype."
                },
                {
                    "headline": "Tap a name.",
                    "description": "As you type, suggestions will appear below the search fields. When you see the name of the person you want to add, tap it."
                },
                {
                    "headline": "Tap Send contact request.",
                    "description": "Doing so generates a request that is sent to the contact with whom you want to Skype. Once they accept your request, they'll be added to your \"Contacts\" list."
                }
            ]
        },
        {
            "name": "Making Video Calls",
            "steps": [
                {
                    "headline": "Tap Contacts.",
                    "description": "It's a blue address book icon at the bottom-left of the screen."
                },
                {
                    "headline": "Tap a contact.",
                    "description": "Tap the name of the person you'd like to call."
                },
                {
                    "headline": "Tap the Video Call button.",
                    "description": "It's a blue video camera icon in the upper-right corner of the screen."
                },
                {
                    "headline": "Wait for the call to connect.",
                    "description": "When you're connected to your contact, buttons on the screen allow you to select which iPhone camera you want to use (front/back), mute the call, adjust the volume level, or enter instant messaging (IM) mode."
                },
                {
                    "headline": "Tap the red End Call button to hang up.",
                    "description": ""
                }
            ]
        },
        {
            "name": "To Make a Voice Call",
            "steps": [
                {
                    "headline": "Tap Contacts.",
                    "description": "It's a blue address book icon at the bottom-left of the screen."
                },
                {
                    "headline": "Tap a contact.",
                    "description": "Tap the name of the person you'd like to call."
                },
                {
                    "headline": "Tap the Voice Call button.",
                    "description": "It's a blue telephone icon in the upper-right corner of the screen."
                },
                {
                    "headline": "Wait for the call to connect.",
                    "description": "When connected, your contact’s profile picture appears on the screen above a timer that shows the call's duration. On-screen buttons allow you to switch to a video call, mute the call, turn on speakerphone, or enter IM mode."
                },
                {
                    "headline": "Tap the red End Call button to hang up.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Sending an Instant Message",
            "steps": [
                {
                    "headline": "Tap Contacts.",
                    "description": "It's a blue address book icon at the bottom-left of the screen."
                },
                {
                    "headline": "Tap a contact.",
                    "description": "Tap the name of the person you'd like to message."
                },
                {
                    "headline": "Tap Type a message here.",
                    "description": "It's the text field at the bottom of the screen."
                },
                {
                    "headline": "Type a message.",
                    "description": "Use the keyboard at the bottom of the screen to do so. You can also use the gray buttons below the text field to add to your message:\nTap the \"Photo Gallery\" icon in the left corner below the message field to add an existing picture to a message. Tap the camera icon next to \"Photo Gallery\" to take and send a new picture. Tap the video camera inside a text bubble icon to send a video message. Tap the \"Location\" pin, which looks like a teardrop with a white circle, to share your location. Tap the contact card icon at the right of the menu bar to share contact information."
                },
                {
                    "headline": "Tap the \"Send\" icon.",
                    "description": "It's a white arrow inside a blue circle on the right side of the message field."
                }
            ]
        }
    ],
    "tyn": [
        "The Skype app for iPhone (available from the App Store)",
        "A 3G/4G or Wi-Fi internet connection",
        "A Skype account"
    ],
    "text": " Downloading and Installing Skype Open the App Store. It's a blue app that contains a white \"A\" inside a white circle. Tap Search. It's a magnifying glass icon at the bottom-right of the screen. Tap the search field. It's at the top of the screen. Start typing \"Skype\" in the search field.  Tap Skype. It will appear below the search field as you type. Tap GET. It's to the right of \"Skype.\" Tap INSTALL. It appears where \"GET\" had been. If prompted, enter your Apple ID and/or password. Signing In to Skype Open the Skype app. It's a blue app with a blue S inside a white cloud. Enter your username. Do so in the field just below the word \"Skype\" near the top of the screen. If you don't have a Skype account, tap Create account at the bottom of the screen. Enter your phone number and a password, or tap Use your email instead if you prefer to sign up with email, then tap Next. Enter your first and last names, then tap Next. Enter your country and birth date, then tap Next. Enter the code sent to your email address or phone number to verify your identity, then tap Next. Enter the security characters on the screen to prove you're not a bot and tap Next. If prompted, enter your phone number, then tap ➲. Enter the code sent to your phone to verify your number, then follow on-screen prompts to continue configuring your account. Enter your password.  Tap Sign In. It's the blue button below the password field. Adding Contacts Tap Contacts. It's a blue address book icon at the bottom-left of the screen. Tap the \"Add Contact\" button. It's the blue silhouette of a person next to a \"+\" in the upper-right corner of the screen. Start typing the name of a contact. Do so in the search field near the top of the screen. You can only add contacts who already have Skype accounts. If you'd like to Skype with someone who doesn't have an account, tap Invite friends to Skype and follow the on-screen instructions. To invite people already in your iPhone's Contacts, tap Contacts in Skype and scroll down to the \"Address Book\" section. Tap Invite next to the contact with whom you'd like to Skype. Tap a name. As you type, suggestions will appear below the search fields. When you see the name of the person you want to add, tap it. Tap Send contact request. Doing so generates a request that is sent to the contact with whom you want to Skype. Once they accept your request, they'll be added to your \"Contacts\" list. Making Video Calls Tap Contacts. It's a blue address book icon at the bottom-left of the screen. Tap a contact. Tap the name of the person you'd like to call. Tap the Video Call button. It's a blue video camera icon in the upper-right corner of the screen. Wait for the call to connect. When you're connected to your contact, buttons on the screen allow you to select which iPhone camera you want to use (front/back), mute the call, adjust the volume level, or enter instant messaging (IM) mode. Tap the red End Call button to hang up.  To Make a Voice Call Tap Contacts. It's a blue address book icon at the bottom-left of the screen. Tap a contact. Tap the name of the person you'd like to call. Tap the Voice Call button. It's a blue telephone icon in the upper-right corner of the screen. Wait for the call to connect. When connected, your contact’s profile picture appears on the screen above a timer that shows the call's duration. On-screen buttons allow you to switch to a video call, mute the call, turn on speakerphone, or enter IM mode. Tap the red End Call button to hang up.  Sending an Instant Message Tap Contacts. It's a blue address book icon at the bottom-left of the screen. Tap a contact. Tap the name of the person you'd like to message. Tap Type a message here. It's the text field at the bottom of the screen. Type a message. Use the keyboard at the bottom of the screen to do so. You can also use the gray buttons below the text field to add to your message:\nTap the \"Photo Gallery\" icon in the left corner below the message field to add an existing picture to a message. Tap the camera icon next to \"Photo Gallery\" to take and send a new picture. Tap the video camera inside a text bubble icon to send a video message. Tap the \"Location\" pin, which looks like a teardrop with a white circle, to share your location. Tap the contact card icon at the right of the menu bar to share contact information. Tap the \"Send\" icon. It's a white arrow inside a blue circle on the right side of the message field.",
    "sentences": [
        " Downloading and Installing Skype Open the App Store.",
        "It's a blue app that contains a white \"A\" inside a white circle.",
        "Tap Search.",
        "It's a magnifying glass icon at the bottom-right of the screen.",
        "Tap the search field.",
        "It's at the top of the screen.",
        "Start typing \"Skype\" in the search field.",
        "Tap Skype.",
        "It will appear below the search field as you type.",
        "Tap GET.",
        "It's to the right of \"Skype.\"",
        "Tap INSTALL.",
        "It appears where \"GET\" had been.",
        "If prompted, enter your Apple ID and/or password.",
        "Signing In to Skype Open the Skype app.",
        "It's a blue app with a blue S inside a white cloud.",
        "Enter your username.",
        "Do so in the field just below the word \"Skype\" near the top of the screen.",
        "If you don't have a Skype account, tap Create account at the bottom of the screen.",
        "Enter your phone number and a password, or tap Use your email instead if you prefer to sign up with email, then tap Next.",
        "Enter your first and last names, then tap Next.",
        "Enter your country and birth date, then tap Next.",
        "Enter the code sent to your email address or phone number to verify your identity, then tap Next.",
        "Enter the security characters on the screen to prove you're not a bot and tap Next.",
        "If prompted, enter your phone number, then tap ➲.",
        "Enter the code sent to your phone to verify your number, then follow on-screen prompts to continue configuring your account.",
        "Enter your password.",
        "Tap Sign In.",
        "It's the blue button below the password field.",
        "Adding Contacts Tap Contacts.",
        "It's a blue address book icon at the bottom-left of the screen.",
        "Tap the \"Add Contact\" button.",
        "It's the blue silhouette of a person next to a \"+\" in the upper-right corner of the screen.",
        "Start typing the name of a contact.",
        "Do so in the search field near the top of the screen.",
        "You can only add contacts who already have Skype accounts.",
        "If you'd like to Skype with someone who doesn't have an account, tap Invite friends to Skype and follow the on-screen instructions.",
        "To invite people already in your iPhone's Contacts, tap Contacts in Skype and scroll down to the \"Address Book\" section.",
        "Tap Invite next to the contact with whom you'd like to Skype.",
        "Tap a name.",
        "As you type, suggestions will appear below the search fields.",
        "When you see the name of the person you want to add, tap it.",
        "Tap Send contact request.",
        "Doing so generates a request that is sent to the contact with whom you want to Skype.",
        "Once they accept your request, they'll be added to your \"Contacts\" list.",
        "Making Video Calls Tap Contacts.",
        "It's a blue address book icon at the bottom-left of the screen.",
        "Tap a contact.",
        "Tap the name of the person you'd like to call.",
        "Tap the Video Call button.",
        "It's a blue video camera icon in the upper-right corner of the screen.",
        "Wait for the call to connect.",
        "When you're connected to your contact, buttons on the screen allow you to select which iPhone camera you want to use (front/back), mute the call, adjust the volume level, or enter instant messaging (IM) mode.",
        "Tap the red End Call button to hang up.",
        "To Make a Voice Call Tap Contacts.",
        "It's a blue address book icon at the bottom-left of the screen.",
        "Tap a contact.",
        "Tap the name of the person you'd like to call.",
        "Tap the Voice Call button.",
        "It's a blue telephone icon in the upper-right corner of the screen.",
        "Wait for the call to connect.",
        "When connected, your contact’s profile picture appears on the screen above a timer that shows the call's duration.",
        "On-screen buttons allow you to switch to a video call, mute the call, turn on speakerphone, or enter IM mode.",
        "Tap the red End Call button to hang up.",
        "Sending an Instant Message Tap Contacts.",
        "It's a blue address book icon at the bottom-left of the screen.",
        "Tap a contact.",
        "Tap the name of the person you'd like to message.",
        "Tap Type a message here.",
        "It's the text field at the bottom of the screen.",
        "Type a message.",
        "Use the keyboard at the bottom of the screen to do so.",
        "You can also use the gray buttons below the text field to add to your message:\nTap the \"Photo Gallery\" icon in the left corner below the message field to add an existing picture to a message.",
        "Tap the camera icon next to \"Photo Gallery\" to take and send a new picture.",
        "Tap the video camera inside a text bubble icon to send a video message.",
        "Tap the \"Location\" pin, which looks like a teardrop with a white circle, to share your location.",
        "Tap the contact card icon at the right of the menu bar to share contact information.",
        "Tap the \"Send\" icon.",
        "It's a white arrow inside a blue circle on the right side of the message field."
    ]
}