{
    "title": "How to Make a Metal Forge",
    "url": "https://www.wikihow.com/Make-a-Metal-Forge",
    "category_hierarchy": [
        "Home and Garden",
        "DIY"
    ],
    "steps": [
        {
            "headline": "Determine the working range of the metal you are going to forge or weld.",
            "description": "Iron is forged in the range 1200 F to 2550 F (650 C - 1400 C), brass or bronze at somewhat cooler temperatures."
        },
        {
            "headline": "Choose a fuel for your forge.",
            "description": "Natural gas, propane, or liquefied propane gas are readily available in most locations, but for an authentic, old fashioned forge, coal/coke or charcoal fires would be the first choice."
        },
        {
            "headline": "Design the hearth and fire pit to a size suitable for the project you are going to use it for.",
            "description": "For craft and hobby work, a small pit will be sufficient. If you have ambitions for forging swords or other long weapons, you may find you need a \"deeper\", or larger fire area. For very large heavy forgings, a forging oven with an overhead hoist may be more suitable, but for this discussion, we will look at smaller, hearth-type furnace forges to heat the steel."
        },
        {
            "headline": "Choose the location where you will set up your forge.",
            "description": "If you are going to use it for long term work at frequent intervals, you may want to enclose it in a woodshed or building, but this will require ducting the excessive heat out of the work space, so we will look more along the lines of hobby work, and assembling it in an outdoor area."
        },
        {
            "headline": "Form up a concrete foundation for your forge.",
            "description": "A fairly useful size and configuration might be about 19X29 inches. Install reinforcement bars, and place concrete in the form. Float the concrete flat and fairly smooth."
        },
        {
            "headline": "Lay up about 24 inches (61.0 cm) of brick on this foundation, leaving the interior hollow, like a box.",
            "description": "Leave an opening in the back \"wall\" of this box for removing ash from the fire pit, about 12X12 inches. You may decide later to have a metal door built for this, but that really doesn't matter."
        },
        {
            "headline": "Leave an opening for the forced air supply piping either in the side or front of this box, as well.",
            "description": "You may choose to fashion a bellows assembly or buy an electric blower for this purpose, but for this project, a 4 inch (10.2 cm) cast iron pipe should work for your air duct, regardless of what you use to supply the air."
        },
        {
            "headline": "Fashion a metal pan or fire pit liner to fit over the walls of the brick box you have laid up.",
            "description": "This should have a depression of about 3 or 4 inches (7.6 or 10.2 cm) in the center,  and can be formed out of 12 or 16 gauge stainless steel, or 1/4 inch (10.2 cm) cold rolled steel plate. It must be strong enough to support the fire brick liner or packed clay which is the base for the fire. You will need a hole near the center of the depressed area of the pit liner for the fresh air supply pipe described earlier."
        },
        {
            "headline": "Lay your fire pit floor using fire brick or soapstone brick and mortar mixed with fire clay to withstand the high temperatures of your forge.",
            "description": "You will want one layer of brick to line the fire pit \"floor\" so that the metal pit form does not burn out from the high temperatures. The sides should be laid up with fire brick and mortar to form a ledge to support the work pieces or tongs with which you will hold your workpiece. The working height of this ledge depends on how tall the forge-worker, or smith, is. Waist high is a good average height."
        },
        {
            "headline": "Lay up regular clay brick for your sides in a hearth type configuration if you like, to draft the smoke and heat away from the work ledge and fire pit.",
            "description": "This is not absolutely necessary, but helps keep the temperature more comfortable at the front of the forge."
        },
        {
            "headline": "Allow all of the masonry work to \"cure\" for a reasonable length of time.",
            "description": "Depending on climate, this is usually 28 days. If you are anxious to begin using the forge sooner, build a small \"curing\" fire in the fire pit to temper the masonry before getting it really hot."
        }
    ],
    "tyn": [
        "Regular clay brick.",
        "Mortar",
        "Concrete",
        "Fire clay",
        "Fire brick",
        "metal pipe",
        "sheet steel or stainless steel sheet metal"
    ],
    "text": " Determine the working range of the metal you are going to forge or weld. Iron is forged in the range 1200 F to 2550 F (650 C - 1400 C), brass or bronze at somewhat cooler temperatures. Choose a fuel for your forge. Natural gas, propane, or liquefied propane gas are readily available in most locations, but for an authentic, old fashioned forge, coal/coke or charcoal fires would be the first choice. Design the hearth and fire pit to a size suitable for the project you are going to use it for. For craft and hobby work, a small pit will be sufficient. If you have ambitions for forging swords or other long weapons, you may find you need a \"deeper\", or larger fire area. For very large heavy forgings, a forging oven with an overhead hoist may be more suitable, but for this discussion, we will look at smaller, hearth-type furnace forges to heat the steel. Choose the location where you will set up your forge. If you are going to use it for long term work at frequent intervals, you may want to enclose it in a woodshed or building, but this will require ducting the excessive heat out of the work space, so we will look more along the lines of hobby work, and assembling it in an outdoor area. Form up a concrete foundation for your forge. A fairly useful size and configuration might be about 19X29 inches. Install reinforcement bars, and place concrete in the form. Float the concrete flat and fairly smooth. Lay up about 24 inches (61.0 cm) of brick on this foundation, leaving the interior hollow, like a box. Leave an opening in the back \"wall\" of this box for removing ash from the fire pit, about 12X12 inches. You may decide later to have a metal door built for this, but that really doesn't matter. Leave an opening for the forced air supply piping either in the side or front of this box, as well. You may choose to fashion a bellows assembly or buy an electric blower for this purpose, but for this project, a 4 inch (10.2 cm) cast iron pipe should work for your air duct, regardless of what you use to supply the air. Fashion a metal pan or fire pit liner to fit over the walls of the brick box you have laid up. This should have a depression of about 3 or 4 inches (7.6 or 10.2 cm) in the center,  and can be formed out of 12 or 16 gauge stainless steel, or 1/4 inch (10.2 cm) cold rolled steel plate. It must be strong enough to support the fire brick liner or packed clay which is the base for the fire. You will need a hole near the center of the depressed area of the pit liner for the fresh air supply pipe described earlier. Lay your fire pit floor using fire brick or soapstone brick and mortar mixed with fire clay to withstand the high temperatures of your forge. You will want one layer of brick to line the fire pit \"floor\" so that the metal pit form does not burn out from the high temperatures. The sides should be laid up with fire brick and mortar to form a ledge to support the work pieces or tongs with which you will hold your workpiece. The working height of this ledge depends on how tall the forge-worker, or smith, is. Waist high is a good average height. Lay up regular clay brick for your sides in a hearth type configuration if you like, to draft the smoke and heat away from the work ledge and fire pit. This is not absolutely necessary, but helps keep the temperature more comfortable at the front of the forge. Allow all of the masonry work to \"cure\" for a reasonable length of time. Depending on climate, this is usually 28 days. If you are anxious to begin using the forge sooner, build a small \"curing\" fire in the fire pit to temper the masonry before getting it really hot.",
    "sentences": [
        " Determine the working range of the metal you are going to forge or weld.",
        "Iron is forged in the range 1200 F to 2550 F (650 C - 1400 C), brass or bronze at somewhat cooler temperatures.",
        "Choose a fuel for your forge.",
        "Natural gas, propane, or liquefied propane gas are readily available in most locations, but for an authentic, old fashioned forge, coal/coke or charcoal fires would be the first choice.",
        "Design the hearth and fire pit to a size suitable for the project you are going to use it for.",
        "For craft and hobby work, a small pit will be sufficient.",
        "If you have ambitions for forging swords or other long weapons, you may find you need a \"deeper\", or larger fire area.",
        "For very large heavy forgings, a forging oven with an overhead hoist may be more suitable, but for this discussion, we will look at smaller, hearth-type furnace forges to heat the steel.",
        "Choose the location where you will set up your forge.",
        "If you are going to use it for long term work at frequent intervals, you may want to enclose it in a woodshed or building, but this will require ducting the excessive heat out of the work space, so we will look more along the lines of hobby work, and assembling it in an outdoor area.",
        "Form up a concrete foundation for your forge.",
        "A fairly useful size and configuration might be about 19X29 inches.",
        "Install reinforcement bars, and place concrete in the form.",
        "Float the concrete flat and fairly smooth.",
        "Lay up about 24 inches (61.0 cm) of brick on this foundation, leaving the interior hollow, like a box.",
        "Leave an opening in the back \"wall\" of this box for removing ash from the fire pit, about 12X12 inches.",
        "You may decide later to have a metal door built for this, but that really doesn't matter.",
        "Leave an opening for the forced air supply piping either in the side or front of this box, as well.",
        "You may choose to fashion a bellows assembly or buy an electric blower for this purpose, but for this project, a 4 inch (10.2 cm) cast iron pipe should work for your air duct, regardless of what you use to supply the air.",
        "Fashion a metal pan or fire pit liner to fit over the walls of the brick box you have laid up.",
        "This should have a depression of about 3 or 4 inches (7.6 or 10.2 cm) in the center,  and can be formed out of 12 or 16 gauge stainless steel, or 1/4 inch (10.2 cm) cold rolled steel plate.",
        "It must be strong enough to support the fire brick liner or packed clay which is the base for the fire.",
        "You will need a hole near the center of the depressed area of the pit liner for the fresh air supply pipe described earlier.",
        "Lay your fire pit floor using fire brick or soapstone brick and mortar mixed with fire clay to withstand the high temperatures of your forge.",
        "You will want one layer of brick to line the fire pit \"floor\" so that the metal pit form does not burn out from the high temperatures.",
        "The sides should be laid up with fire brick and mortar to form a ledge to support the work pieces or tongs with which you will hold your workpiece.",
        "The working height of this ledge depends on how tall the forge-worker, or smith, is.",
        "Waist high is a good average height.",
        "Lay up regular clay brick for your sides in a hearth type configuration if you like, to draft the smoke and heat away from the work ledge and fire pit.",
        "This is not absolutely necessary, but helps keep the temperature more comfortable at the front of the forge.",
        "Allow all of the masonry work to \"cure\" for a reasonable length of time.",
        "Depending on climate, this is usually 28 days.",
        "If you are anxious to begin using the forge sooner, build a small \"curing\" fire in the fire pit to temper the masonry before getting it really hot."
    ]
}