{
    "title": "How to Do Your Makeup Like Jade West",
    "url": "https://www.wikihow.com/Do-Your-Makeup-Like-Jade-West",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Celebrities",
        "Celebrity Style"
    ],
    "methods": [
        {
            "name": "Jade West Look #1",
            "steps": [
                {
                    "headline": "Use concealer.",
                    "description": "Concealer is a vital product for this makeup look. You can apply concealer with your fingertips or a foundation brush. Make sure your brushes are not used or clean. Apply to your face, especially on blemishes."
                },
                {
                    "headline": "Apply dark and smoky-colored eye shadows and colors like dark green, black, gray, dark purple, or navy blue.",
                    "description": "Make it smoky and go almost to the brow bone, but not quite."
                },
                {
                    "headline": "Wear black, liquid eyeliner on the upper lid, and black pencil eyeliner on the lower lid.",
                    "description": "Wear the eyeliner straight and occasionally wing out the upper lid liner."
                },
                {
                    "headline": "Wear black mascara.",
                    "description": "You want to add volume to your lashes rather than thicken or lengthen them. Make sure it is dark mascara, and start at the roots of your lashes and work your way up."
                },
                {
                    "headline": "Add some dark lip liner to all of your lips, or just the outer parts of your lips.",
                    "description": "Read below for more lip tips!"
                },
                {
                    "headline": "Add dark lipstick, and sometimes black.",
                    "description": "Be sure to know that some dark lipsticks can be too overwhelming on light skin, but you can add more dark makeup to get an even makeup theme."
                },
                {
                    "headline": "If you want to, you can just wear plain lip gloss.",
                    "description": "Also, you can add lip liner to all of your lips and put some lip gloss over. Stay away from shimmer and glittery glosses. Go for a more subtle, glossy look."
                }
            ]
        },
        {
            "name": "Jade West Look #2",
            "steps": [
                {
                    "headline": "Skip the foundation.",
                    "description": "If you want you want to apply foundation then do so, but Jade doesn't usually wear foundation."
                },
                {
                    "headline": "Apply an eyeshadow base to your eyelids to make your eyeshadow last longer.",
                    "description": "Then apply a grey eyeshadow all over your eyelid. Jade has a smokey eye look, so apply a black eyeshadow like a V-shape in the outer corner."
                },
                {
                    "headline": "Apply black eyeliner in the waterline and the upper eye and bottom eye.",
                    "description": "Then smudge to make that smokey eye."
                },
                {
                    "headline": "Apply two layers of black mascara.",
                    "description": ""
                },
                {
                    "headline": "Apply a tinted lip balm or a lip balm.",
                    "description": ""
                },
                {
                    "headline": "Finished.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Concealer",
        "Eyeshadow",
        "Primer (optional. not in routine)",
        "Eyeliner",
        "Mascara",
        "Lip liner (optional. see above for more)",
        "Lip gloss (optional. see above for more)",
        "Lipstick (optional. see above for more)",
        "Black eyeliner",
        "Black mascara",
        "Black eyeshadow",
        "Grey eyeshadow",
        "Tinted lip balm or a lip balm",
        "Foundation, if needed"
    ],
    "text": " Jade West Look #1 Use concealer. Concealer is a vital product for this makeup look. You can apply concealer with your fingertips or a foundation brush. Make sure your brushes are not used or clean. Apply to your face, especially on blemishes. Apply dark and smoky-colored eye shadows and colors like dark green, black, gray, dark purple, or navy blue. Make it smoky and go almost to the brow bone, but not quite. Wear black, liquid eyeliner on the upper lid, and black pencil eyeliner on the lower lid. Wear the eyeliner straight and occasionally wing out the upper lid liner. Wear black mascara. You want to add volume to your lashes rather than thicken or lengthen them. Make sure it is dark mascara, and start at the roots of your lashes and work your way up. Add some dark lip liner to all of your lips, or just the outer parts of your lips. Read below for more lip tips! Add dark lipstick, and sometimes black. Be sure to know that some dark lipsticks can be too overwhelming on light skin, but you can add more dark makeup to get an even makeup theme. If you want to, you can just wear plain lip gloss. Also, you can add lip liner to all of your lips and put some lip gloss over. Stay away from shimmer and glittery glosses. Go for a more subtle, glossy look. Jade West Look #2 Skip the foundation. If you want you want to apply foundation then do so, but Jade doesn't usually wear foundation. Apply an eyeshadow base to your eyelids to make your eyeshadow last longer. Then apply a grey eyeshadow all over your eyelid. Jade has a smokey eye look, so apply a black eyeshadow like a V-shape in the outer corner. Apply black eyeliner in the waterline and the upper eye and bottom eye. Then smudge to make that smokey eye. Apply two layers of black mascara.  Apply a tinted lip balm or a lip balm.  Finished. ",
    "sentences": [
        " Jade West Look #1 Use concealer.",
        "Concealer is a vital product for this makeup look.",
        "You can apply concealer with your fingertips or a foundation brush.",
        "Make sure your brushes are not used or clean.",
        "Apply to your face, especially on blemishes.",
        "Apply dark and smoky-colored eye shadows and colors like dark green, black, gray, dark purple, or navy blue.",
        "Make it smoky and go almost to the brow bone, but not quite.",
        "Wear black, liquid eyeliner on the upper lid, and black pencil eyeliner on the lower lid.",
        "Wear the eyeliner straight and occasionally wing out the upper lid liner.",
        "Wear black mascara.",
        "You want to add volume to your lashes rather than thicken or lengthen them.",
        "Make sure it is dark mascara, and start at the roots of your lashes and work your way up.",
        "Add some dark lip liner to all of your lips, or just the outer parts of your lips.",
        "Read below for more lip tips!",
        "Add dark lipstick, and sometimes black.",
        "Be sure to know that some dark lipsticks can be too overwhelming on light skin, but you can add more dark makeup to get an even makeup theme.",
        "If you want to, you can just wear plain lip gloss.",
        "Also, you can add lip liner to all of your lips and put some lip gloss over.",
        "Stay away from shimmer and glittery glosses.",
        "Go for a more subtle, glossy look.",
        "Jade West Look #2 Skip the foundation.",
        "If you want you want to apply foundation then do so, but Jade doesn't usually wear foundation.",
        "Apply an eyeshadow base to your eyelids to make your eyeshadow last longer.",
        "Then apply a grey eyeshadow all over your eyelid.",
        "Jade has a smokey eye look, so apply a black eyeshadow like a V-shape in the outer corner.",
        "Apply black eyeliner in the waterline and the upper eye and bottom eye.",
        "Then smudge to make that smokey eye.",
        "Apply two layers of black mascara.",
        "Apply a tinted lip balm or a lip balm.",
        "Finished."
    ]
}