{
    "title": "How to Make a Mother's Day Scrapbook",
    "url": "https://www.wikihow.com/Make-a-Mother%27s-Day-Scrapbook",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Holiday Season",
        "Holiday Crafts"
    ],
    "parts": [
        {
            "name": "Choosing Scrapbook Materials",
            "steps": [
                {
                    "headline": "Choose a color scheme for the scrapbook.",
                    "description": "A color scheme will help your scrapbook look polished and cohesive. You can pick any colors that you want! Don't pick more than three, though, or the color scheme won't be obvious. Create a sentimental vibe with pastels like pink, light blue, and purple. Pick your mom's favorite color. Pick one color and use three different shades of it. For example, light green, regular green, and forest green."
                },
                {
                    "headline": "Pick out a scrapbook at the craft store.",
                    "description": "Head to the scrapbooking section of the craft store. All the good stuff that you need is there! Look through the scrapbooks and choose one that appeals to you. Make sure the scrapbook you choose comes with rings and pages that you can easily add and remove. If you have a color scheme, look for a book that matches. There will be different size options available. Pick a size that you can work with easily and that will accommodate your ideas. If you're having trouble or need help, ask a sales associate for assistance."
                },
                {
                    "headline": "Choose scrapbooking paper that matches your theme.",
                    "description": "The paper is called cardstock and it feels like thick printer paper. The craft store probably has a whole aisle of it with any color you can imagine! You can choose a different kind of paper for every page or use one kind of paper for the whole thing. Don't forget about your color scheme when picking out paper! You might be able to find some stuff for Mother's Day scrapbooks, too. If the scrapbook you picked already comes with paper, skip this part."
                },
                {
                    "headline": "Grab some stickers, stamps, and other decorations for the pages.",
                    "description": "The scrapbooking section will have all kinds of neat stickers to choose from. You can pick stickers of images, words, rhinestones, ribbons, page titles, borders, and a lot more. You may also find premade packs with all the stickers you need for one scrapbook already put together. Look for Mother's Day themed items and decorations that fit your mom's personality or interests. Consider decorations based on the theme of family, as well. If you like ink stamps, look for some of those. Don't forget the ink pad! Continue sticking to your color scheme, if you're using one."
                }
            ]
        },
        {
            "name": "Gathering Photos and Designing the Scrapbook",
            "steps": [
                {
                    "headline": "Gather photos for the scrapbook.",
                    "description": "Look through old photo albums and more recent digital images. Choose family photos, baby pictures, vacation pictures, school pictures, etc. Grab a few candid photos, too! Make sure all of your family members are equally represented in the images. You don't want anyone to feel left out! It's also a good idea to balance the number of casual and event photos. The number of photos you use depends on the size of your scrapbook and what you have available. However, photos are a major component of scrapbooks, so aim to fill up at least half the pages with them. Scan the older photos into your computer, and then put them back where you got them. This will protect the original photographs. Print the scanned images. Print digital images on nice photo paper from an office supply store."
                },
                {
                    "headline": "Gather memorabilia to go in the scrapbook.",
                    "description": "Memorabilia can be stuff like concert tickets, programs from school plays, finger paintings you made in preschool, recipe cards of delicious meals your mom makes, and mementos from family vacations. Memorabilia can take up about 1/4 of your available scrapbook space. More emphasis should be placed on photos, and you want to leave room for poems and other special things, as well. You could also put pressed flowers in the book. Be sure you choose flowers that will lay pretty flat on the page, like daisies, clover flowers, buttercups, and so on. Avoid roses and other bulky flowers."
                },
                {
                    "headline": "Hunt down Mother's Day poems and quotes.",
                    "description": "These can be typed into the computer and printed out or handwritten on the pages. Google \"Mother's Day Poems\" and you will have a lot of options to choose from. Pick one or several that really make you think of your mom and feel meaningful to you. Ask your family members to help you pick. Place your favorite one on the first page, so it will stand out. If you have additional ones, place them throughout the pages wherever you like. Print it out on cardstock once you find the one you want."
                },
                {
                    "headline": "Ask family members to write a special paragraph about your mom.",
                    "description": "This will help make the scrapbook a sentimental keepsake. They can write about their favorite memories, impressions of your mother, amazing things she's done to make them happy, or things they love about her. Give them a piece of cardstock and a marker to write their paragraph. Tell them to practice it on notebook paper first! Don't forget to write your own paragraph, too."
                }
            ]
        },
        {
            "name": "Putting the Scrapbook Together",
            "steps": [
                {
                    "headline": "Distribute all of your materials into separate page piles.",
                    "description": "Get organized before you start your project so you can tackle one page at a time. Have your family members help you decide which order the photos, memorabilia, paragraphs, etc., will appear in the book. Then make separate piles of materials for each of page. Each page can be based on a decade, child, hobby, vacation or other important topic in their life. It's up to you!"
                },
                {
                    "headline": "Assemble the pages of the scrapbook.",
                    "description": "Decide how the elements will appear on each page. Layer your elements and glue them onto the page or use double sided tape to attach them securely. If you bought stickers with page titles like \"Vacation\" and \"Holidays,\" add those to the pages. You can also write the titles yourself at the top of each page with a nice marker. If you used glue, give each page plenty of time to dry before placing them in the scrapbook. If the pages start to curl, place them between large heavy books for about an hour to flatten them back out."
                },
                {
                    "headline": "Add decorations to each page with stickers and stamps.",
                    "description": "Now comes the fun part! Start decorating each page using the stickers and other stuff you got at the craft store. Get as creative as you want with the decorations, but don't add so much that the photos, poems, and memorabilia are obscured."
                },
                {
                    "headline": "Insert blank pages into the back of the scrapbook (optional).",
                    "description": "You can continue to update the scrapbook each Mother's Day as you make more memories as a family. Your mother can also create pages for it, if she likes to scrapbook! Aim for 20 to 30 extra pages so that you can fill up the scrapbook far into the future."
                }
            ]
        }
    ],
    "tyn": [
        "Photographs",
        "Scanner",
        "Ringed scrapbook binder",
        "Scrapbook pages",
        "Memorabilia",
        "Glue or double sided tape",
        "Recipes",
        "Poems/quotes",
        "Printer",
        "Stories about your mother",
        "Scrapbooking titles",
        "Stickers",
        "Glue",
        "Decorative paper",
        "Double-sided tape",
        "Plastic page protectors"
    ],
    "text": " Choosing Scrapbook Materials Choose a color scheme for the scrapbook. A color scheme will help your scrapbook look polished and cohesive. You can pick any colors that you want! Don't pick more than three, though, or the color scheme won't be obvious. Create a sentimental vibe with pastels like pink, light blue, and purple. Pick your mom's favorite color. Pick one color and use three different shades of it. For example, light green, regular green, and forest green. Pick out a scrapbook at the craft store. Head to the scrapbooking section of the craft store. All the good stuff that you need is there! Look through the scrapbooks and choose one that appeals to you. Make sure the scrapbook you choose comes with rings and pages that you can easily add and remove. If you have a color scheme, look for a book that matches. There will be different size options available. Pick a size that you can work with easily and that will accommodate your ideas. If you're having trouble or need help, ask a sales associate for assistance. Choose scrapbooking paper that matches your theme. The paper is called cardstock and it feels like thick printer paper. The craft store probably has a whole aisle of it with any color you can imagine! You can choose a different kind of paper for every page or use one kind of paper for the whole thing. Don't forget about your color scheme when picking out paper! You might be able to find some stuff for Mother's Day scrapbooks, too. If the scrapbook you picked already comes with paper, skip this part. Grab some stickers, stamps, and other decorations for the pages. The scrapbooking section will have all kinds of neat stickers to choose from. You can pick stickers of images, words, rhinestones, ribbons, page titles, borders, and a lot more. You may also find premade packs with all the stickers you need for one scrapbook already put together. Look for Mother's Day themed items and decorations that fit your mom's personality or interests. Consider decorations based on the theme of family, as well. If you like ink stamps, look for some of those. Don't forget the ink pad! Continue sticking to your color scheme, if you're using one. Gathering Photos and Designing the Scrapbook Gather photos for the scrapbook. Look through old photo albums and more recent digital images. Choose family photos, baby pictures, vacation pictures, school pictures, etc. Grab a few candid photos, too! Make sure all of your family members are equally represented in the images. You don't want anyone to feel left out! It's also a good idea to balance the number of casual and event photos. The number of photos you use depends on the size of your scrapbook and what you have available. However, photos are a major component of scrapbooks, so aim to fill up at least half the pages with them. Scan the older photos into your computer, and then put them back where you got them. This will protect the original photographs. Print the scanned images. Print digital images on nice photo paper from an office supply store. Gather memorabilia to go in the scrapbook. Memorabilia can be stuff like concert tickets, programs from school plays, finger paintings you made in preschool, recipe cards of delicious meals your mom makes, and mementos from family vacations. Memorabilia can take up about 1/4 of your available scrapbook space. More emphasis should be placed on photos, and you want to leave room for poems and other special things, as well. You could also put pressed flowers in the book. Be sure you choose flowers that will lay pretty flat on the page, like daisies, clover flowers, buttercups, and so on. Avoid roses and other bulky flowers. Hunt down Mother's Day poems and quotes. These can be typed into the computer and printed out or handwritten on the pages. Google \"Mother's Day Poems\" and you will have a lot of options to choose from. Pick one or several that really make you think of your mom and feel meaningful to you. Ask your family members to help you pick. Place your favorite one on the first page, so it will stand out. If you have additional ones, place them throughout the pages wherever you like. Print it out on cardstock once you find the one you want. Ask family members to write a special paragraph about your mom. This will help make the scrapbook a sentimental keepsake. They can write about their favorite memories, impressions of your mother, amazing things she's done to make them happy, or things they love about her. Give them a piece of cardstock and a marker to write their paragraph. Tell them to practice it on notebook paper first! Don't forget to write your own paragraph, too. Putting the Scrapbook Together Distribute all of your materials into separate page piles. Get organized before you start your project so you can tackle one page at a time. Have your family members help you decide which order the photos, memorabilia, paragraphs, etc., will appear in the book. Then make separate piles of materials for each of page. Each page can be based on a decade, child, hobby, vacation or other important topic in their life. It's up to you! Assemble the pages of the scrapbook. Decide how the elements will appear on each page. Layer your elements and glue them onto the page or use double sided tape to attach them securely. If you bought stickers with page titles like \"Vacation\" and \"Holidays,\" add those to the pages. You can also write the titles yourself at the top of each page with a nice marker. If you used glue, give each page plenty of time to dry before placing them in the scrapbook. If the pages start to curl, place them between large heavy books for about an hour to flatten them back out. Add decorations to each page with stickers and stamps. Now comes the fun part! Start decorating each page using the stickers and other stuff you got at the craft store. Get as creative as you want with the decorations, but don't add so much that the photos, poems, and memorabilia are obscured. Insert blank pages into the back of the scrapbook (optional). You can continue to update the scrapbook each Mother's Day as you make more memories as a family. Your mother can also create pages for it, if she likes to scrapbook! Aim for 20 to 30 extra pages so that you can fill up the scrapbook far into the future.",
    "sentences": [
        " Choosing Scrapbook Materials Choose a color scheme for the scrapbook.",
        "A color scheme will help your scrapbook look polished and cohesive.",
        "You can pick any colors that you want!",
        "Don't pick more than three, though, or the color scheme won't be obvious.",
        "Create a sentimental vibe with pastels like pink, light blue, and purple.",
        "Pick your mom's favorite color.",
        "Pick one color and use three different shades of it.",
        "For example, light green, regular green, and forest green.",
        "Pick out a scrapbook at the craft store.",
        "Head to the scrapbooking section of the craft store.",
        "All the good stuff that you need is there!",
        "Look through the scrapbooks and choose one that appeals to you.",
        "Make sure the scrapbook you choose comes with rings and pages that you can easily add and remove.",
        "If you have a color scheme, look for a book that matches.",
        "There will be different size options available.",
        "Pick a size that you can work with easily and that will accommodate your ideas.",
        "If you're having trouble or need help, ask a sales associate for assistance.",
        "Choose scrapbooking paper that matches your theme.",
        "The paper is called cardstock and it feels like thick printer paper.",
        "The craft store probably has a whole aisle of it with any color you can imagine!",
        "You can choose a different kind of paper for every page or use one kind of paper for the whole thing.",
        "Don't forget about your color scheme when picking out paper!",
        "You might be able to find some stuff for Mother's Day scrapbooks, too.",
        "If the scrapbook you picked already comes with paper, skip this part.",
        "Grab some stickers, stamps, and other decorations for the pages.",
        "The scrapbooking section will have all kinds of neat stickers to choose from.",
        "You can pick stickers of images, words, rhinestones, ribbons, page titles, borders, and a lot more.",
        "You may also find premade packs with all the stickers you need for one scrapbook already put together.",
        "Look for Mother's Day themed items and decorations that fit your mom's personality or interests.",
        "Consider decorations based on the theme of family, as well.",
        "If you like ink stamps, look for some of those.",
        "Don't forget the ink pad!",
        "Continue sticking to your color scheme, if you're using one.",
        "Gathering Photos and Designing the Scrapbook Gather photos for the scrapbook.",
        "Look through old photo albums and more recent digital images.",
        "Choose family photos, baby pictures, vacation pictures, school pictures, etc.",
        "Grab a few candid photos, too!",
        "Make sure all of your family members are equally represented in the images.",
        "You don't want anyone to feel left out!",
        "It's also a good idea to balance the number of casual and event photos.",
        "The number of photos you use depends on the size of your scrapbook and what you have available.",
        "However, photos are a major component of scrapbooks, so aim to fill up at least half the pages with them.",
        "Scan the older photos into your computer, and then put them back where you got them.",
        "This will protect the original photographs.",
        "Print the scanned images.",
        "Print digital images on nice photo paper from an office supply store.",
        "Gather memorabilia to go in the scrapbook.",
        "Memorabilia can be stuff like concert tickets, programs from school plays, finger paintings you made in preschool, recipe cards of delicious meals your mom makes, and mementos from family vacations.",
        "Memorabilia can take up about 1/4 of your available scrapbook space.",
        "More emphasis should be placed on photos, and you want to leave room for poems and other special things, as well.",
        "You could also put pressed flowers in the book.",
        "Be sure you choose flowers that will lay pretty flat on the page, like daisies, clover flowers, buttercups, and so on.",
        "Avoid roses and other bulky flowers.",
        "Hunt down Mother's Day poems and quotes.",
        "These can be typed into the computer and printed out or handwritten on the pages.",
        "Google \"Mother's Day Poems\" and you will have a lot of options to choose from.",
        "Pick one or several that really make you think of your mom and feel meaningful to you.",
        "Ask your family members to help you pick.",
        "Place your favorite one on the first page, so it will stand out.",
        "If you have additional ones, place them throughout the pages wherever you like.",
        "Print it out on cardstock once you find the one you want.",
        "Ask family members to write a special paragraph about your mom.",
        "This will help make the scrapbook a sentimental keepsake.",
        "They can write about their favorite memories, impressions of your mother, amazing things she's done to make them happy, or things they love about her.",
        "Give them a piece of cardstock and a marker to write their paragraph.",
        "Tell them to practice it on notebook paper first!",
        "Don't forget to write your own paragraph, too.",
        "Putting the Scrapbook Together Distribute all of your materials into separate page piles.",
        "Get organized before you start your project so you can tackle one page at a time.",
        "Have your family members help you decide which order the photos, memorabilia, paragraphs, etc., will appear in the book.",
        "Then make separate piles of materials for each of page.",
        "Each page can be based on a decade, child, hobby, vacation or other important topic in their life.",
        "It's up to you!",
        "Assemble the pages of the scrapbook.",
        "Decide how the elements will appear on each page.",
        "Layer your elements and glue them onto the page or use double sided tape to attach them securely.",
        "If you bought stickers with page titles like \"Vacation\" and \"Holidays,\" add those to the pages.",
        "You can also write the titles yourself at the top of each page with a nice marker.",
        "If you used glue, give each page plenty of time to dry before placing them in the scrapbook.",
        "If the pages start to curl, place them between large heavy books for about an hour to flatten them back out.",
        "Add decorations to each page with stickers and stamps.",
        "Now comes the fun part!",
        "Start decorating each page using the stickers and other stuff you got at the craft store.",
        "Get as creative as you want with the decorations, but don't add so much that the photos, poems, and memorabilia are obscured.",
        "Insert blank pages into the back of the scrapbook (optional).",
        "You can continue to update the scrapbook each Mother's Day as you make more memories as a family.",
        "Your mother can also create pages for it, if she likes to scrapbook!",
        "Aim for 20 to 30 extra pages so that you can fill up the scrapbook far into the future."
    ]
}