{
    "title": "How to Color Block Your Nails",
    "url": "https://www.wikihow.com/Color-Block-Your-Nails",
    "category_hierarchy": [
        "Personal Care and Style",
        "Nail Care",
        "Nail Beauty Treatments",
        "Painting Nails",
        "Nail Art",
        "Pattern Nail Art"
    ],
    "methods": [
        {
            "name": "Preparing the Base",
            "steps": [
                {
                    "headline": "Remove all existing nail polish from your nails.",
                    "description": "Use a little nail polish remover on a cotton round to wipe any existing nail polish from your nails. If necessary, clip and file your nails to achieve the desired shape. Then, paint all of your nails with a clear base coat. The base coat will provide a smooth surface for the polish and will also protect your nails from becoming stained by the strong colors. A quick dry base coat that will also double up as a top coat is a good option."
                },
                {
                    "headline": "Choose three contrasting nail polish colors.",
                    "description": "The bolder the color choices, the more your nails will pop! You will also want to make sure that at least two of the nail polishes are fairly heavy, so when you're layering the colors you won't see the base coat underneath. If you really want to add wow factor, think about incorporating a shimmering silver or gold polish into the mix. Good color combos include: pink, silver and red; pink, yellow and blue; gold, green and red; or white, red and purple. But it's really a matter of personal preference!"
                },
                {
                    "headline": "Paint your nails with the lightest color.",
                    "description": "It's important that you always apply the lightest color of the three first. Firstly, a lighter color won't work as well on top of a darker one, and secondly, the light base will allow the other colors to really stand out. Depending on the nail polish, you may need to apply more than one layer of this base color to achieve the desired effect. Once the nail polish is dry, you can apply a layer of clear top coat to add shine to your base color. When painting your nails, try to follow the three stripe rule: first paint a vertical line down the center of your nail, then paint two more lines on either side of the central stripe. If you use broad strokes, this should be enough to cover your whole nail. Remember that it's always better to apply multiple thin layers than one thick layer of polish. This is because the thin coats dry much faster and are less prone to smudging than thick layers."
                }
            ]
        },
        {
            "name": "Color Blocking the Nails",
            "steps": [
                {
                    "headline": "Choose which color blocking method you want to use.",
                    "description": "There are two main ways to color block your nails:\nThe first involves using sticky tape to create clean lines on the nails. This is a very easy method, but it's very important that your base color is completely dry before you apply the tape, otherwise you might ruin the polish. The second method involves painting the color blocks yourself using a very thin art store paint brush (or the nail polish brush itself). This involves less effort than the sticky tape method but requires a very steady hand!"
                },
                {
                    "headline": "Make your first block.",
                    "description": "Now it's time to do your first color block! If you're using sticky tape, tear off a piece approximately an inch long and place the tape on your nail diagonally, sectioning off a part of your nail. If you're using a brush, dip the brush in the second color and carefully paint a diagonal line across your nail, in whatever direction you like. Make this line as straight as you possibly can, otherwise the color blocking will look messy. Do the same thing for each of your nails, whichever method you choose. The diagonal lines should be going in a different direction on each nail -- they shouldn't be uniform. Remember that they will eventually form triangles. If you're using the sticky tape, a good tip is to dab the sticky side against the back of your hand a couple of times before you attach it to your nail. This will remove the excess stickiness and prevent the tape from ripping off your polish."
                },
                {
                    "headline": "Fill in the second color.",
                    "description": "Once you have your outline, you can fill in that section of your nail with the second color. If you're using the tape, fill in the exposed space on your nail, allowing the polish to overlap on the paint slightly. This will give you a really clean line. If you're using the brush, fill in the color below (or above) the line you painted in the previous step, being very careful not to go over the line. Make sure the tape is lying flat against your fingernail, otherwise some polish could creep in underneath and ruin your clean line. Once you have filled in the color, allow the polish to set for 30 seconds before pulling the tape off. Then allow the polish to dry completely. When the second color has dried completely, you can apply another layer of top coat to set the polish and add shine."
                },
                {
                    "headline": "Make the second block.",
                    "description": "Once your nails are completely dry, you can begin working on your second block. If using the tape, follow the same method as before, this time sectioning off a different part of the nail. If using a brush, dip it in your third color and draw another diagonal line, going in the opposite direction from the first line."
                },
                {
                    "headline": "Fill in the third color.",
                    "description": "Fill in your third and final color using the same method as outlined above. If using the tape, allow the paint to dry for 30 seconds before you pull off the tape. If using the brush, make sure to fill in your last color block very carefully to avoid going outside the lines."
                },
                {
                    "headline": "Clean up.",
                    "description": "It's inevitable that you'll get at least some nail polish on your fingers when painting your nails, so take some time to clean it up before you show off your nails. All you need to do is dip a q-tip (preferably one with a pointed end) into some nail polish remover and carefully go around the edges of your finger nails to remove any excess polish. Try to do this as slowly and carefully as possible - you don't want to ruin all of your hard work by accidentally removing the polish on your nails!"
                },
                {
                    "headline": "Finish off with a top coat.",
                    "description": "Once the last color has dried completely, finish off with a final layer of clear top coat to add strength and shine. Your color blocked nails are now ready to show off!"
                },
                {
                    "headline": "Experiment with different colors and shapes.",
                    "description": "Color blocking may take a little practice to get perfect, so while you're at it, why not experiment with lots of different color combinations and patterns? For example, instead of creating triangles on your nails, try making squares! Simply paint your base color, then place the tape (or paint a line) vertically down the middle of each nail. Fill in the second color on the empty side, wait for it to dry, then place another piece of tape (or paint another line) horizontally across the nail. Carefully fill in one half of the exposed nail with a third color, to form two squares on one side of the nail and a rectangle on the other. Another option, which is less time consuming, is to simply paint the tips of your nails a different color from the rest of the nails. Paint your base color as normal, then place a piece of tape near the top of each nail, only leaving the top exposed. Use a darker, contrasting color to fill in the tip, then remove the tape. Like a French manicure -- but with a funky twist!"
                }
            ]
        }
    ],
    "tyn": [
        "Base coat",
        "White polish",
        "Pink (or other color) polish",
        "Purple (or other color) polish",
        "Small paintbrush, or sticky tape",
        "Top coat"
    ],
    "text": " Preparing the Base Remove all existing nail polish from your nails. Use a little nail polish remover on a cotton round to wipe any existing nail polish from your nails. If necessary, clip and file your nails to achieve the desired shape. Then, paint all of your nails with a clear base coat. The base coat will provide a smooth surface for the polish and will also protect your nails from becoming stained by the strong colors. A quick dry base coat that will also double up as a top coat is a good option. Choose three contrasting nail polish colors. The bolder the color choices, the more your nails will pop! You will also want to make sure that at least two of the nail polishes are fairly heavy, so when you're layering the colors you won't see the base coat underneath. If you really want to add wow factor, think about incorporating a shimmering silver or gold polish into the mix. Good color combos include: pink, silver and red; pink, yellow and blue; gold, green and red; or white, red and purple. But it's really a matter of personal preference! Paint your nails with the lightest color. It's important that you always apply the lightest color of the three first. Firstly, a lighter color won't work as well on top of a darker one, and secondly, the light base will allow the other colors to really stand out. Depending on the nail polish, you may need to apply more than one layer of this base color to achieve the desired effect. Once the nail polish is dry, you can apply a layer of clear top coat to add shine to your base color. When painting your nails, try to follow the three stripe rule: first paint a vertical line down the center of your nail, then paint two more lines on either side of the central stripe. If you use broad strokes, this should be enough to cover your whole nail. Remember that it's always better to apply multiple thin layers than one thick layer of polish. This is because the thin coats dry much faster and are less prone to smudging than thick layers. Color Blocking the Nails Choose which color blocking method you want to use. There are two main ways to color block your nails:\nThe first involves using sticky tape to create clean lines on the nails. This is a very easy method, but it's very important that your base color is completely dry before you apply the tape, otherwise you might ruin the polish. The second method involves painting the color blocks yourself using a very thin art store paint brush (or the nail polish brush itself). This involves less effort than the sticky tape method but requires a very steady hand! Make your first block. Now it's time to do your first color block! If you're using sticky tape, tear off a piece approximately an inch long and place the tape on your nail diagonally, sectioning off a part of your nail. If you're using a brush, dip the brush in the second color and carefully paint a diagonal line across your nail, in whatever direction you like. Make this line as straight as you possibly can, otherwise the color blocking will look messy. Do the same thing for each of your nails, whichever method you choose. The diagonal lines should be going in a different direction on each nail -- they shouldn't be uniform. Remember that they will eventually form triangles. If you're using the sticky tape, a good tip is to dab the sticky side against the back of your hand a couple of times before you attach it to your nail. This will remove the excess stickiness and prevent the tape from ripping off your polish. Fill in the second color. Once you have your outline, you can fill in that section of your nail with the second color. If you're using the tape, fill in the exposed space on your nail, allowing the polish to overlap on the paint slightly. This will give you a really clean line. If you're using the brush, fill in the color below (or above) the line you painted in the previous step, being very careful not to go over the line. Make sure the tape is lying flat against your fingernail, otherwise some polish could creep in underneath and ruin your clean line. Once you have filled in the color, allow the polish to set for 30 seconds before pulling the tape off. Then allow the polish to dry completely. When the second color has dried completely, you can apply another layer of top coat to set the polish and add shine. Make the second block. Once your nails are completely dry, you can begin working on your second block. If using the tape, follow the same method as before, this time sectioning off a different part of the nail. If using a brush, dip it in your third color and draw another diagonal line, going in the opposite direction from the first line. Fill in the third color. Fill in your third and final color using the same method as outlined above. If using the tape, allow the paint to dry for 30 seconds before you pull off the tape. If using the brush, make sure to fill in your last color block very carefully to avoid going outside the lines. Clean up. It's inevitable that you'll get at least some nail polish on your fingers when painting your nails, so take some time to clean it up before you show off your nails. All you need to do is dip a q-tip (preferably one with a pointed end) into some nail polish remover and carefully go around the edges of your finger nails to remove any excess polish. Try to do this as slowly and carefully as possible - you don't want to ruin all of your hard work by accidentally removing the polish on your nails! Finish off with a top coat. Once the last color has dried completely, finish off with a final layer of clear top coat to add strength and shine. Your color blocked nails are now ready to show off! Experiment with different colors and shapes. Color blocking may take a little practice to get perfect, so while you're at it, why not experiment with lots of different color combinations and patterns? For example, instead of creating triangles on your nails, try making squares! Simply paint your base color, then place the tape (or paint a line) vertically down the middle of each nail. Fill in the second color on the empty side, wait for it to dry, then place another piece of tape (or paint another line) horizontally across the nail. Carefully fill in one half of the exposed nail with a third color, to form two squares on one side of the nail and a rectangle on the other. Another option, which is less time consuming, is to simply paint the tips of your nails a different color from the rest of the nails. Paint your base color as normal, then place a piece of tape near the top of each nail, only leaving the top exposed. Use a darker, contrasting color to fill in the tip, then remove the tape. Like a French manicure -- but with a funky twist!",
    "sentences": [
        " Preparing the Base Remove all existing nail polish from your nails.",
        "Use a little nail polish remover on a cotton round to wipe any existing nail polish from your nails.",
        "If necessary, clip and file your nails to achieve the desired shape.",
        "Then, paint all of your nails with a clear base coat.",
        "The base coat will provide a smooth surface for the polish and will also protect your nails from becoming stained by the strong colors.",
        "A quick dry base coat that will also double up as a top coat is a good option.",
        "Choose three contrasting nail polish colors.",
        "The bolder the color choices, the more your nails will pop!",
        "You will also want to make sure that at least two of the nail polishes are fairly heavy, so when you're layering the colors you won't see the base coat underneath.",
        "If you really want to add wow factor, think about incorporating a shimmering silver or gold polish into the mix.",
        "Good color combos include: pink, silver and red; pink, yellow and blue; gold, green and red; or white, red and purple.",
        "But it's really a matter of personal preference!",
        "Paint your nails with the lightest color.",
        "It's important that you always apply the lightest color of the three first.",
        "Firstly, a lighter color won't work as well on top of a darker one, and secondly, the light base will allow the other colors to really stand out.",
        "Depending on the nail polish, you may need to apply more than one layer of this base color to achieve the desired effect.",
        "Once the nail polish is dry, you can apply a layer of clear top coat to add shine to your base color.",
        "When painting your nails, try to follow the three stripe rule: first paint a vertical line down the center of your nail, then paint two more lines on either side of the central stripe.",
        "If you use broad strokes, this should be enough to cover your whole nail.",
        "Remember that it's always better to apply multiple thin layers than one thick layer of polish.",
        "This is because the thin coats dry much faster and are less prone to smudging than thick layers.",
        "Color Blocking the Nails Choose which color blocking method you want to use.",
        "There are two main ways to color block your nails:\nThe first involves using sticky tape to create clean lines on the nails.",
        "This is a very easy method, but it's very important that your base color is completely dry before you apply the tape, otherwise you might ruin the polish.",
        "The second method involves painting the color blocks yourself using a very thin art store paint brush (or the nail polish brush itself).",
        "This involves less effort than the sticky tape method but requires a very steady hand!",
        "Make your first block.",
        "Now it's time to do your first color block!",
        "If you're using sticky tape, tear off a piece approximately an inch long and place the tape on your nail diagonally, sectioning off a part of your nail.",
        "If you're using a brush, dip the brush in the second color and carefully paint a diagonal line across your nail, in whatever direction you like.",
        "Make this line as straight as you possibly can, otherwise the color blocking will look messy.",
        "Do the same thing for each of your nails, whichever method you choose.",
        "The diagonal lines should be going in a different direction on each nail -- they shouldn't be uniform.",
        "Remember that they will eventually form triangles.",
        "If you're using the sticky tape, a good tip is to dab the sticky side against the back of your hand a couple of times before you attach it to your nail.",
        "This will remove the excess stickiness and prevent the tape from ripping off your polish.",
        "Fill in the second color.",
        "Once you have your outline, you can fill in that section of your nail with the second color.",
        "If you're using the tape, fill in the exposed space on your nail, allowing the polish to overlap on the paint slightly.",
        "This will give you a really clean line.",
        "If you're using the brush, fill in the color below (or above) the line you painted in the previous step, being very careful not to go over the line.",
        "Make sure the tape is lying flat against your fingernail, otherwise some polish could creep in underneath and ruin your clean line.",
        "Once you have filled in the color, allow the polish to set for 30 seconds before pulling the tape off.",
        "Then allow the polish to dry completely.",
        "When the second color has dried completely, you can apply another layer of top coat to set the polish and add shine.",
        "Make the second block.",
        "Once your nails are completely dry, you can begin working on your second block.",
        "If using the tape, follow the same method as before, this time sectioning off a different part of the nail.",
        "If using a brush, dip it in your third color and draw another diagonal line, going in the opposite direction from the first line.",
        "Fill in the third color.",
        "Fill in your third and final color using the same method as outlined above.",
        "If using the tape, allow the paint to dry for 30 seconds before you pull off the tape.",
        "If using the brush, make sure to fill in your last color block very carefully to avoid going outside the lines.",
        "Clean up.",
        "It's inevitable that you'll get at least some nail polish on your fingers when painting your nails, so take some time to clean it up before you show off your nails.",
        "All you need to do is dip a q-tip (preferably one with a pointed end) into some nail polish remover and carefully go around the edges of your finger nails to remove any excess polish.",
        "Try to do this as slowly and carefully as possible - you don't want to ruin all of your hard work by accidentally removing the polish on your nails!",
        "Finish off with a top coat.",
        "Once the last color has dried completely, finish off with a final layer of clear top coat to add strength and shine.",
        "Your color blocked nails are now ready to show off!",
        "Experiment with different colors and shapes.",
        "Color blocking may take a little practice to get perfect, so while you're at it, why not experiment with lots of different color combinations and patterns?",
        "For example, instead of creating triangles on your nails, try making squares!",
        "Simply paint your base color, then place the tape (or paint a line) vertically down the middle of each nail.",
        "Fill in the second color on the empty side, wait for it to dry, then place another piece of tape (or paint another line) horizontally across the nail.",
        "Carefully fill in one half of the exposed nail with a third color, to form two squares on one side of the nail and a rectangle on the other.",
        "Another option, which is less time consuming, is to simply paint the tips of your nails a different color from the rest of the nails.",
        "Paint your base color as normal, then place a piece of tape near the top of each nail, only leaving the top exposed.",
        "Use a darker, contrasting color to fill in the tip, then remove the tape.",
        "Like a French manicure -- but with a funky twist!"
    ]
}