{
    "title": "How to Make Paper Look Old",
    "url": "https://www.wikihow.com/Make-Paper-Look-Old",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Paper Craft",
        "Papermaking"
    ],
    "methods": [
        {
            "name": "Crumpling and Spritzing",
            "steps": [
                {
                    "headline": "Crumple the paper.",
                    "description": "Take a sheet of paper in your hand and crumple it into a ball. The tighter the ball, the more creases your paper will have."
                },
                {
                    "headline": "Uncrumple the paper and spritz it with water, tea or coffee.",
                    "description": "After uncrumpling the sheet of paper, fill a squirt bottle with your chosen liquid. Then, squirt the paper until the spots you’re looking to shape and color are damp. Note that the liquid you use will give the paper a different look. Water won’t color the paper, but will enable further alterations. Tea will give a slight brown color, while coffee will give the sheet a darker color."
                },
                {
                    "headline": "Shape various types of damage into the paper.",
                    "description": "Now that it is damp, the paper will be easier to shape. Try tearing off edges, removing small circles with your fingernail, or creating tiny wrinkles. This damage simulates the passage of time; the older you want the sheet of paper to look, the more damage you need to include. If you want to make darker, deeper creases, crumple the damp paper again. Be careful not to rip the page in half."
                },
                {
                    "headline": "Lay out the paper to air dry.",
                    "description": "Place the paper on a flat surface, such as a countertop or table. The sheet should completely dry in a few hours. Alternatively, you can use a hair dryer to speed up this process."
                }
            ]
        },
        {
            "name": "Staining and Baking",
            "steps": [
                {
                    "headline": "Choose and brew your solvent.",
                    "description": "To age your paper, you can choose to use coffee for a darker color or tea for a lighter color. You can also affect the color of your paper during the brewing process. If using coffee, you can darken or lighten the color by using more or less coffee grounds. With tea, the resulting shade of your sheet of paper will be affected by how long you leave the tea in the water. A longer infusion will result in a darker shade, while a short infusion will make for a lighter shade. Let your liquid cool before proceeding to the next step."
                },
                {
                    "headline": "Place the paper on a baking or cookie sheet.",
                    "description": "Make sure the paper can fit inside the sheet easily, without going over the edges."
                },
                {
                    "headline": "Preheat the oven to 200ºF (90ºC).",
                    "description": "By preheating your oven at this point, it should reach the desired temperature by the time the paper is ready to be baked."
                },
                {
                    "headline": "Pour the solvent onto the baking sheet.",
                    "description": "Start pouring in a corner of the baking sheet, not directly over the paper. Only pour enough liquid to cover the sheet of paper with a thin film. Don’t be concerned about solvent ending up beneath the paper; it will soak up the liquid beneath it."
                },
                {
                    "headline": "Use a sponge brush to spread the coffee/tea around.",
                    "description": "Here you can be creative with the patterns you create. You can spread the solvent evenly around the sheet if you want a more uniform look. Otherwise, you can spread it unevenly to create more vivid, obvious patterns. If you’d like to create a more vivid, spotty pattern, you can sprinkle coffee grounds on the paper, letting them stand for a few minutes."
                },
                {
                    "headline": "Dab excess liquid with a paper towel.",
                    "description": "Make sure there are no pools of liquid left either on the paper or in the baking sheet. You’re not trying to get the paper completely dry, just making sure there is no unabsorbed liquid sitting on the sheet."
                },
                {
                    "headline": "Modify the paper.",
                    "description": "Before you put the baking sheet and paper in the oven, you can add a few touches to make the paper seem even older while it's damp and easy to manipulate. Tear a thin, jagged strip off the side. Or, dig small holes out of the paper with your fingernail; you can crumple these tiny wads and move them to other parts of the paper for a bumpy, parchment-like look. Additionally, you can press down on the paper with something like a fork to leave imprints."
                },
                {
                    "headline": "Place the baking sheet in the oven for four to seven minutes.",
                    "description": "Ideally, you’ll want to put the sheet on a middle oven rack. Keep an eye on the paper as it bakes. You’ll know the process is complete once the edges start to curl up. The time it takes for this to happen depends on your oven."
                },
                {
                    "headline": "Remove the paper and allow it to cool.",
                    "description": "Using oven mitts, remove the baking sheet from the oven. Give the paper 10 to 15 minutes to cool down before you attempt to write on it."
                }
            ]
        },
        {
            "name": "Using Flame and Heat",
            "steps": [
                {
                    "headline": "Take a sheet of paper over a sink.",
                    "description": "This is important in case you accidentally light the paper on fire; you can just drop it into the sink and douse it in water. For this particular method you should write on the paper after the aging process, to avoid losing some of your work with excessive burning."
                },
                {
                    "headline": "Find a candle or lighter.",
                    "description": "There is no difference in the effectiveness of each source of fire. Simply use whatever is available to you. Avoid using a butane lighter as the flame is too intense for this type of work."
                },
                {
                    "headline": "Run the flame along the paper’s edges.",
                    "description": "Hold the edges of the paper between 1/2 inch (1cm) and 1 inch (2.5cm) above the flame. Move the flame along the edges, going back and forth along the sheet’s perimeter. This will create the darkened look of paper that's been around for a very long time and been damaged by time and circumstance. Do not put it too long on one place by the candle. Don’t let the flame linger on any one spot too long; this could set the whole sheet of paper on fire. As you move the flame long the paper’s edges, make sure you’re moving away from your hand to avoid potential burns."
                },
                {
                    "headline": "Burn small spots into the paper.",
                    "description": "If you want to further damage your sheet of paper, you can burn little holes into it. Again, put the paper around an inch above the flame, this time letting it linger. Pay attention to this spot as it browns and blackens. Once it’s reached the desired color, remove it from the flame. If you want to burn holes into your sheet of paper, leave it above the flame slightly longer. The heat will eventually burn through, and a small flame will catch. Be quick to blow it out. If the paper catches fire quicker than you can blow it out, drop it in the sink and douse it in water."
                }
            ]
        },
        {
            "name": "Burying Paper in the Yard",
            "steps": [
                {
                    "headline": "Dig a hole in your backyard.",
                    "description": "You want this hole just deep enough to fit a tennis ball. No need to damage your yard unnecessarily."
                },
                {
                    "headline": "Crumple the paper into a ball and place it inside the hole.",
                    "description": "Sprinkle the ball of paper with a bit of water; no more than a quarter of a cup. You can rub some dirt onto the paper before you do this; the mud will dirty and smudge the sheet."
                },
                {
                    "headline": "Fill the hole with dirt.",
                    "description": "Make sure the paper is completely covered. The dirt will damage and wear out the paper over time, so you’ll need to ensure a snug fit."
                },
                {
                    "headline": "Retrieve the paper after three to fourteen days.",
                    "description": "The amount of time you wait depends on how old you want the paper to look."
                }
            ]
        }
    ],
    "tyn": [
        "Sheet of paper",
        "Teabag or coffee",
        "Spray bottle",
        "Sponge brush",
        "Baking sheet or pan",
        "Paper towels",
        "Oven",
        "Candle or lighter",
        "Hairdryer"
    ],
    "text": " Crumpling and Spritzing Crumple the paper. Take a sheet of paper in your hand and crumple it into a ball. The tighter the ball, the more creases your paper will have. Uncrumple the paper and spritz it with water, tea or coffee. After uncrumpling the sheet of paper, fill a squirt bottle with your chosen liquid. Then, squirt the paper until the spots you’re looking to shape and color are damp. Note that the liquid you use will give the paper a different look. Water won’t color the paper, but will enable further alterations. Tea will give a slight brown color, while coffee will give the sheet a darker color. Shape various types of damage into the paper. Now that it is damp, the paper will be easier to shape. Try tearing off edges, removing small circles with your fingernail, or creating tiny wrinkles. This damage simulates the passage of time; the older you want the sheet of paper to look, the more damage you need to include. If you want to make darker, deeper creases, crumple the damp paper again. Be careful not to rip the page in half. Lay out the paper to air dry. Place the paper on a flat surface, such as a countertop or table. The sheet should completely dry in a few hours. Alternatively, you can use a hair dryer to speed up this process. Staining and Baking Choose and brew your solvent. To age your paper, you can choose to use coffee for a darker color or tea for a lighter color. You can also affect the color of your paper during the brewing process. If using coffee, you can darken or lighten the color by using more or less coffee grounds. With tea, the resulting shade of your sheet of paper will be affected by how long you leave the tea in the water. A longer infusion will result in a darker shade, while a short infusion will make for a lighter shade. Let your liquid cool before proceeding to the next step. Place the paper on a baking or cookie sheet. Make sure the paper can fit inside the sheet easily, without going over the edges. Preheat the oven to 200ºF (90ºC). By preheating your oven at this point, it should reach the desired temperature by the time the paper is ready to be baked. Pour the solvent onto the baking sheet. Start pouring in a corner of the baking sheet, not directly over the paper. Only pour enough liquid to cover the sheet of paper with a thin film. Don’t be concerned about solvent ending up beneath the paper; it will soak up the liquid beneath it. Use a sponge brush to spread the coffee/tea around. Here you can be creative with the patterns you create. You can spread the solvent evenly around the sheet if you want a more uniform look. Otherwise, you can spread it unevenly to create more vivid, obvious patterns. If you’d like to create a more vivid, spotty pattern, you can sprinkle coffee grounds on the paper, letting them stand for a few minutes. Dab excess liquid with a paper towel. Make sure there are no pools of liquid left either on the paper or in the baking sheet. You’re not trying to get the paper completely dry, just making sure there is no unabsorbed liquid sitting on the sheet. Modify the paper. Before you put the baking sheet and paper in the oven, you can add a few touches to make the paper seem even older while it's damp and easy to manipulate. Tear a thin, jagged strip off the side. Or, dig small holes out of the paper with your fingernail; you can crumple these tiny wads and move them to other parts of the paper for a bumpy, parchment-like look. Additionally, you can press down on the paper with something like a fork to leave imprints. Place the baking sheet in the oven for four to seven minutes. Ideally, you’ll want to put the sheet on a middle oven rack. Keep an eye on the paper as it bakes. You’ll know the process is complete once the edges start to curl up. The time it takes for this to happen depends on your oven. Remove the paper and allow it to cool. Using oven mitts, remove the baking sheet from the oven. Give the paper 10 to 15 minutes to cool down before you attempt to write on it. Using Flame and Heat Take a sheet of paper over a sink. This is important in case you accidentally light the paper on fire; you can just drop it into the sink and douse it in water. For this particular method you should write on the paper after the aging process, to avoid losing some of your work with excessive burning. Find a candle or lighter. There is no difference in the effectiveness of each source of fire. Simply use whatever is available to you. Avoid using a butane lighter as the flame is too intense for this type of work. Run the flame along the paper’s edges. Hold the edges of the paper between 1/2 inch (1cm) and 1 inch (2.5cm) above the flame. Move the flame along the edges, going back and forth along the sheet’s perimeter. This will create the darkened look of paper that's been around for a very long time and been damaged by time and circumstance. Do not put it too long on one place by the candle. Don’t let the flame linger on any one spot too long; this could set the whole sheet of paper on fire. As you move the flame long the paper’s edges, make sure you’re moving away from your hand to avoid potential burns. Burn small spots into the paper. If you want to further damage your sheet of paper, you can burn little holes into it. Again, put the paper around an inch above the flame, this time letting it linger. Pay attention to this spot as it browns and blackens. Once it’s reached the desired color, remove it from the flame. If you want to burn holes into your sheet of paper, leave it above the flame slightly longer. The heat will eventually burn through, and a small flame will catch. Be quick to blow it out. If the paper catches fire quicker than you can blow it out, drop it in the sink and douse it in water. Burying Paper in the Yard Dig a hole in your backyard. You want this hole just deep enough to fit a tennis ball. No need to damage your yard unnecessarily. Crumple the paper into a ball and place it inside the hole. Sprinkle the ball of paper with a bit of water; no more than a quarter of a cup. You can rub some dirt onto the paper before you do this; the mud will dirty and smudge the sheet. Fill the hole with dirt. Make sure the paper is completely covered. The dirt will damage and wear out the paper over time, so you’ll need to ensure a snug fit. Retrieve the paper after three to fourteen days. The amount of time you wait depends on how old you want the paper to look.",
    "sentences": [
        " Crumpling and Spritzing Crumple the paper.",
        "Take a sheet of paper in your hand and crumple it into a ball.",
        "The tighter the ball, the more creases your paper will have.",
        "Uncrumple the paper and spritz it with water, tea or coffee.",
        "After uncrumpling the sheet of paper, fill a squirt bottle with your chosen liquid.",
        "Then, squirt the paper until the spots you’re looking to shape and color are damp.",
        "Note that the liquid you use will give the paper a different look.",
        "Water won’t color the paper, but will enable further alterations.",
        "Tea will give a slight brown color, while coffee will give the sheet a darker color.",
        "Shape various types of damage into the paper.",
        "Now that it is damp, the paper will be easier to shape.",
        "Try tearing off edges, removing small circles with your fingernail, or creating tiny wrinkles.",
        "This damage simulates the passage of time; the older you want the sheet of paper to look, the more damage you need to include.",
        "If you want to make darker, deeper creases, crumple the damp paper again.",
        "Be careful not to rip the page in half.",
        "Lay out the paper to air dry.",
        "Place the paper on a flat surface, such as a countertop or table.",
        "The sheet should completely dry in a few hours.",
        "Alternatively, you can use a hair dryer to speed up this process.",
        "Staining and Baking Choose and brew your solvent.",
        "To age your paper, you can choose to use coffee for a darker color or tea for a lighter color.",
        "You can also affect the color of your paper during the brewing process.",
        "If using coffee, you can darken or lighten the color by using more or less coffee grounds.",
        "With tea, the resulting shade of your sheet of paper will be affected by how long you leave the tea in the water.",
        "A longer infusion will result in a darker shade, while a short infusion will make for a lighter shade.",
        "Let your liquid cool before proceeding to the next step.",
        "Place the paper on a baking or cookie sheet.",
        "Make sure the paper can fit inside the sheet easily, without going over the edges.",
        "Preheat the oven to 200ºF (90ºC).",
        "By preheating your oven at this point, it should reach the desired temperature by the time the paper is ready to be baked.",
        "Pour the solvent onto the baking sheet.",
        "Start pouring in a corner of the baking sheet, not directly over the paper.",
        "Only pour enough liquid to cover the sheet of paper with a thin film.",
        "Don’t be concerned about solvent ending up beneath the paper; it will soak up the liquid beneath it.",
        "Use a sponge brush to spread the coffee/tea around.",
        "Here you can be creative with the patterns you create.",
        "You can spread the solvent evenly around the sheet if you want a more uniform look.",
        "Otherwise, you can spread it unevenly to create more vivid, obvious patterns.",
        "If you’d like to create a more vivid, spotty pattern, you can sprinkle coffee grounds on the paper, letting them stand for a few minutes.",
        "Dab excess liquid with a paper towel.",
        "Make sure there are no pools of liquid left either on the paper or in the baking sheet.",
        "You’re not trying to get the paper completely dry, just making sure there is no unabsorbed liquid sitting on the sheet.",
        "Modify the paper.",
        "Before you put the baking sheet and paper in the oven, you can add a few touches to make the paper seem even older while it's damp and easy to manipulate.",
        "Tear a thin, jagged strip off the side.",
        "Or, dig small holes out of the paper with your fingernail; you can crumple these tiny wads and move them to other parts of the paper for a bumpy, parchment-like look.",
        "Additionally, you can press down on the paper with something like a fork to leave imprints.",
        "Place the baking sheet in the oven for four to seven minutes.",
        "Ideally, you’ll want to put the sheet on a middle oven rack.",
        "Keep an eye on the paper as it bakes.",
        "You’ll know the process is complete once the edges start to curl up.",
        "The time it takes for this to happen depends on your oven.",
        "Remove the paper and allow it to cool.",
        "Using oven mitts, remove the baking sheet from the oven.",
        "Give the paper 10 to 15 minutes to cool down before you attempt to write on it.",
        "Using Flame and Heat Take a sheet of paper over a sink.",
        "This is important in case you accidentally light the paper on fire; you can just drop it into the sink and douse it in water.",
        "For this particular method you should write on the paper after the aging process, to avoid losing some of your work with excessive burning.",
        "Find a candle or lighter.",
        "There is no difference in the effectiveness of each source of fire.",
        "Simply use whatever is available to you.",
        "Avoid using a butane lighter as the flame is too intense for this type of work.",
        "Run the flame along the paper’s edges.",
        "Hold the edges of the paper between 1/2 inch (1cm) and 1 inch (2.5cm) above the flame.",
        "Move the flame along the edges, going back and forth along the sheet’s perimeter.",
        "This will create the darkened look of paper that's been around for a very long time and been damaged by time and circumstance.",
        "Do not put it too long on one place by the candle.",
        "Don’t let the flame linger on any one spot too long; this could set the whole sheet of paper on fire.",
        "As you move the flame long the paper’s edges, make sure you’re moving away from your hand to avoid potential burns.",
        "Burn small spots into the paper.",
        "If you want to further damage your sheet of paper, you can burn little holes into it.",
        "Again, put the paper around an inch above the flame, this time letting it linger.",
        "Pay attention to this spot as it browns and blackens.",
        "Once it’s reached the desired color, remove it from the flame.",
        "If you want to burn holes into your sheet of paper, leave it above the flame slightly longer.",
        "The heat will eventually burn through, and a small flame will catch.",
        "Be quick to blow it out.",
        "If the paper catches fire quicker than you can blow it out, drop it in the sink and douse it in water.",
        "Burying Paper in the Yard Dig a hole in your backyard.",
        "You want this hole just deep enough to fit a tennis ball.",
        "No need to damage your yard unnecessarily.",
        "Crumple the paper into a ball and place it inside the hole.",
        "Sprinkle the ball of paper with a bit of water; no more than a quarter of a cup.",
        "You can rub some dirt onto the paper before you do this; the mud will dirty and smudge the sheet.",
        "Fill the hole with dirt.",
        "Make sure the paper is completely covered.",
        "The dirt will damage and wear out the paper over time, so you’ll need to ensure a snug fit.",
        "Retrieve the paper after three to fourteen days.",
        "The amount of time you wait depends on how old you want the paper to look."
    ]
}