{
    "title": "How to Make a Flame That Does Not Burn",
    "url": "https://www.wikihow.com/Make-a-Flame-That-Does-Not-Burn",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Performing Arts",
        "Magic and Illusion Performance",
        "Magic Tricks",
        "Shock Magic"
    ],
    "steps": [
        {
            "headline": "Prepare a solution of one part alcohol, one part water and little table salt.",
            "description": "Give the solution a magical-sounding name. Do not allow your audience to see the ingredients. Do not leave the solution open long enough to evaporate the alcohol."
        },
        {
            "headline": "Soak a dollar in the solution.",
            "description": ""
        },
        {
            "headline": "Hold the wet dollar up with metal tongs.",
            "description": "Keep away from the bowl of solution."
        },
        {
            "headline": "Light the solution that is on the dollar.",
            "description": ""
        },
        {
            "headline": "The alcohol will ignite.",
            "description": "The water will stay in the paper of the dollar protecting it from the flame."
        }
    ],
    "tyn": [
        "Paper money, cash",
        "Rubbing alcohol",
        "Water",
        "Plain salt",
        "Bowl",
        "Metal tongs",
        "Lighter",
        "Extinguisher"
    ],
    "text": " Prepare a solution of one part alcohol, one part water and little table salt. Give the solution a magical-sounding name. Do not allow your audience to see the ingredients. Do not leave the solution open long enough to evaporate the alcohol. Soak a dollar in the solution.  Hold the wet dollar up with metal tongs. Keep away from the bowl of solution. Light the solution that is on the dollar.  The alcohol will ignite. The water will stay in the paper of the dollar protecting it from the flame.",
    "sentences": [
        " Prepare a solution of one part alcohol, one part water and little table salt.",
        "Give the solution a magical-sounding name.",
        "Do not allow your audience to see the ingredients.",
        "Do not leave the solution open long enough to evaporate the alcohol.",
        "Soak a dollar in the solution.",
        "Hold the wet dollar up with metal tongs.",
        "Keep away from the bowl of solution.",
        "Light the solution that is on the dollar.",
        "The alcohol will ignite.",
        "The water will stay in the paper of the dollar protecting it from the flame."
    ]
}