{
    "title": "How to Make Noni Juice",
    "url": "https://www.wikihow.com/Make-Noni-Juice",
    "category_hierarchy": [
        "Food and Entertaining",
        "Drinks",
        "Juice"
    ],
    "methods": [
        {
            "name": "Traditional Fermented Noni Juice",
            "steps": [
                {
                    "headline": "Sterilize a large container to hold the noni fruits.",
                    "description": "Choose a large jar or container that's at least 4 inches (10 cm) wide and 6 inches (15 cm) tall. Run the container through the dishwasher or wash it with hot, soapy water to sterilize it. Avoid using non-food-grade plastics to store the noni fruits since these can release chemicals into the noni juice. Instead, choose a glass, metal, or food-grade plastic container."
                },
                {
                    "headline": "Pick ripe noni fruit.",
                    "description": "To gather your own noni fruit, look for fruits that are honey-yellow or very pale. Ensure that you don't break the thin branches of the noni plant when you pick the fruit. Pick as many ripe nonis as you need to fill your jar. If ripe noni fruit is available for purchase in your area, you could buy it instead of picking it."
                },
                {
                    "headline": "Rinse and dry the fruit.",
                    "description": "Hold the ripe fruit under cold running water to rinse away any dirt or debris. Then place them in direct sunlight to dry for a few hours or wipe them dry with a clean cloth. It's important to remove as many pathogens from the outside of the fruits as possible before you begin fermentation."
                },
                {
                    "headline": "Fill the container with noni fruits and seal it shut.",
                    "description": "Put the dry noni fruits into the container so it's completely full. Keep in mind that there need to be gaps between the fruits, so there's no need to cut or cram the fruits to fit the space. Screw the lid on the jar or container so it's secure. Sealing the lid will create an airtight space which will prevent contamination."
                },
                {
                    "headline": "Place the jar of fruit in the sunshine for 6 to 8 weeks.",
                    "description": "If weather permits, set the jar outside. If you can't put it outside, place it in a sunny spot in your house such as a windowsill that gets direct sunlight. Leave the fruit to ferment in the jar for up to 2 months. You should see the juice leaking out from the fruit. The jar will fill with liquid that's pale in color, but it will darken over time."
                },
                {
                    "headline": "Strain the noni juice through a filter.",
                    "description": "Since there will pulp and debris mixed in with the juice, you'll have to filter them out. Set a fine mesh strainer over a large bowl. Open the jar and slowly pour the juice through the strainer. The bowl you pour the juice into should be clean and sterile. To remove the most sediment, place silkscreen or cheesecloth in the fine mesh strainer before you pour the juice into it."
                },
                {
                    "headline": "Pasteurize the juice.",
                    "description": "Although you can drink unpasteurized juice, pasteurized juice lasts longer and is safer to drink. To pasteurize noni juice at home, put the open jar of noni juice into a pot of boiling water. The water level should cover that of the juice, but not be so high that it might flow into the jar. Heat the juice until it reaches and stays at 160 °F (71 °C) for 1 full minute. Use an instant-read or candy thermometer to determine the temperature of the juice."
                },
                {
                    "headline": "Test the pH of the juice.",
                    "description": "If the juice looks cloudy and you're concerned that it might be contaminated, check the pH of the noni juice. Buy litmus paper and dip it into the cool noni juice. If the juice is safe to drink, it should have a pH of 3.5 or less. If the pH is higher than 3.5, it's probably contaminated and not safe to drink."
                },
                {
                    "headline": "Seal and store the noni juice.",
                    "description": "Screw the lid onto the jar of juice and keep the juice at room temperature. While you should be able to store and use the noni juice indefinitely, keep it in the refrigerator if you'd like chilled juice. Remember to label the jar so you know what's in it and when you made it. If you're concerned about storing noni juice for a long period of time, you may want to make a new batch after a year or so."
                }
            ]
        },
        {
            "name": "Quick Raw Noni Juice",
            "steps": [
                {
                    "headline": "Select a ripe noni fruit.",
                    "description": "Choose a noni fruit that is white in color. If you're picking the noni fruit, it may still be firm so set it on the counter at room temperature until it's soft to the touch. The fruit will become translucent as it turns ripe. If you're picking your own noni fruit, ensure that you don't snap or break the delicate branches of the plant."
                },
                {
                    "headline": "Rinse the noni fruit and blend it for 1 minute.",
                    "description": "Once the noni fruit is soft, rinse any dirt or debris off the fruit with cool water. Put the noni fruit into a blender and secure the lid. Blend the fruit on low speed until the fruit is completely mashed. If you don't have a blender, put it into a food processor instead. For even riper fruit, you could mash the fruit in a bowl using a wooden spoon."
                },
                {
                    "headline": "Strain the mashed noni fruit.",
                    "description": "Set a fine mesh strainer over a bowl and scoop the mashed fruit into it. Rub the back of a spoon across the fruit to press the noni juice into the bowl. Keep in mind that the fruit won't produce a lot of juice. Discard the noni pulp and seeds or mix the puree with other fruit to create a fruit leather."
                },
                {
                    "headline": "Thin the noni juice with water or juice and drink it.",
                    "description": "Since the noni juice in the bowl will be very thick, you can thin it with liquid if you like. Try mixing in a little water or juice such as grape, apple, or pineapple. Keep in mind that diluting the noni juice will improve the flavor and make it easier to drink. Refrigerate any unused raw noni juice in an airtight container for up to 2 to 3 weeks."
                }
            ]
        }
    ],
    "tyn": [
        "Traditional Fermented Noni Juice",
        "Large jars or containers with lids",
        "Mesh strainer, silkscreen, or cheesecloth",
        "Large pot",
        "Instant-read or candy thermometer",
        "Litmus paper",
        "Quick Raw Noni Juice",
        "Blender or food processor",
        "Spoon",
        "Fine mesh strainer",
        "Serving glass"
    ],
    "text": " Traditional Fermented Noni Juice Sterilize a large container to hold the noni fruits. Choose a large jar or container that's at least 4 inches (10 cm) wide and 6 inches (15 cm) tall. Run the container through the dishwasher or wash it with hot, soapy water to sterilize it. Avoid using non-food-grade plastics to store the noni fruits since these can release chemicals into the noni juice. Instead, choose a glass, metal, or food-grade plastic container. Pick ripe noni fruit. To gather your own noni fruit, look for fruits that are honey-yellow or very pale. Ensure that you don't break the thin branches of the noni plant when you pick the fruit. Pick as many ripe nonis as you need to fill your jar. If ripe noni fruit is available for purchase in your area, you could buy it instead of picking it. Rinse and dry the fruit. Hold the ripe fruit under cold running water to rinse away any dirt or debris. Then place them in direct sunlight to dry for a few hours or wipe them dry with a clean cloth. It's important to remove as many pathogens from the outside of the fruits as possible before you begin fermentation. Fill the container with noni fruits and seal it shut. Put the dry noni fruits into the container so it's completely full. Keep in mind that there need to be gaps between the fruits, so there's no need to cut or cram the fruits to fit the space. Screw the lid on the jar or container so it's secure. Sealing the lid will create an airtight space which will prevent contamination. Place the jar of fruit in the sunshine for 6 to 8 weeks. If weather permits, set the jar outside. If you can't put it outside, place it in a sunny spot in your house such as a windowsill that gets direct sunlight. Leave the fruit to ferment in the jar for up to 2 months. You should see the juice leaking out from the fruit. The jar will fill with liquid that's pale in color, but it will darken over time. Strain the noni juice through a filter. Since there will pulp and debris mixed in with the juice, you'll have to filter them out. Set a fine mesh strainer over a large bowl. Open the jar and slowly pour the juice through the strainer. The bowl you pour the juice into should be clean and sterile. To remove the most sediment, place silkscreen or cheesecloth in the fine mesh strainer before you pour the juice into it. Pasteurize the juice. Although you can drink unpasteurized juice, pasteurized juice lasts longer and is safer to drink. To pasteurize noni juice at home, put the open jar of noni juice into a pot of boiling water. The water level should cover that of the juice, but not be so high that it might flow into the jar. Heat the juice until it reaches and stays at 160 °F (71 °C) for 1 full minute. Use an instant-read or candy thermometer to determine the temperature of the juice. Test the pH of the juice. If the juice looks cloudy and you're concerned that it might be contaminated, check the pH of the noni juice. Buy litmus paper and dip it into the cool noni juice. If the juice is safe to drink, it should have a pH of 3.5 or less. If the pH is higher than 3.5, it's probably contaminated and not safe to drink. Seal and store the noni juice. Screw the lid onto the jar of juice and keep the juice at room temperature. While you should be able to store and use the noni juice indefinitely, keep it in the refrigerator if you'd like chilled juice. Remember to label the jar so you know what's in it and when you made it. If you're concerned about storing noni juice for a long period of time, you may want to make a new batch after a year or so. Quick Raw Noni Juice Select a ripe noni fruit. Choose a noni fruit that is white in color. If you're picking the noni fruit, it may still be firm so set it on the counter at room temperature until it's soft to the touch. The fruit will become translucent as it turns ripe. If you're picking your own noni fruit, ensure that you don't snap or break the delicate branches of the plant. Rinse the noni fruit and blend it for 1 minute. Once the noni fruit is soft, rinse any dirt or debris off the fruit with cool water. Put the noni fruit into a blender and secure the lid. Blend the fruit on low speed until the fruit is completely mashed. If you don't have a blender, put it into a food processor instead. For even riper fruit, you could mash the fruit in a bowl using a wooden spoon. Strain the mashed noni fruit. Set a fine mesh strainer over a bowl and scoop the mashed fruit into it. Rub the back of a spoon across the fruit to press the noni juice into the bowl. Keep in mind that the fruit won't produce a lot of juice. Discard the noni pulp and seeds or mix the puree with other fruit to create a fruit leather. Thin the noni juice with water or juice and drink it. Since the noni juice in the bowl will be very thick, you can thin it with liquid if you like. Try mixing in a little water or juice such as grape, apple, or pineapple. Keep in mind that diluting the noni juice will improve the flavor and make it easier to drink. Refrigerate any unused raw noni juice in an airtight container for up to 2 to 3 weeks.",
    "sentences": [
        " Traditional Fermented Noni Juice Sterilize a large container to hold the noni fruits.",
        "Choose a large jar or container that's at least 4 inches (10 cm) wide and 6 inches (15 cm) tall.",
        "Run the container through the dishwasher or wash it with hot, soapy water to sterilize it.",
        "Avoid using non-food-grade plastics to store the noni fruits since these can release chemicals into the noni juice.",
        "Instead, choose a glass, metal, or food-grade plastic container.",
        "Pick ripe noni fruit.",
        "To gather your own noni fruit, look for fruits that are honey-yellow or very pale.",
        "Ensure that you don't break the thin branches of the noni plant when you pick the fruit.",
        "Pick as many ripe nonis as you need to fill your jar.",
        "If ripe noni fruit is available for purchase in your area, you could buy it instead of picking it.",
        "Rinse and dry the fruit.",
        "Hold the ripe fruit under cold running water to rinse away any dirt or debris.",
        "Then place them in direct sunlight to dry for a few hours or wipe them dry with a clean cloth.",
        "It's important to remove as many pathogens from the outside of the fruits as possible before you begin fermentation.",
        "Fill the container with noni fruits and seal it shut.",
        "Put the dry noni fruits into the container so it's completely full.",
        "Keep in mind that there need to be gaps between the fruits, so there's no need to cut or cram the fruits to fit the space.",
        "Screw the lid on the jar or container so it's secure.",
        "Sealing the lid will create an airtight space which will prevent contamination.",
        "Place the jar of fruit in the sunshine for 6 to 8 weeks.",
        "If weather permits, set the jar outside.",
        "If you can't put it outside, place it in a sunny spot in your house such as a windowsill that gets direct sunlight.",
        "Leave the fruit to ferment in the jar for up to 2 months.",
        "You should see the juice leaking out from the fruit.",
        "The jar will fill with liquid that's pale in color, but it will darken over time.",
        "Strain the noni juice through a filter.",
        "Since there will pulp and debris mixed in with the juice, you'll have to filter them out.",
        "Set a fine mesh strainer over a large bowl.",
        "Open the jar and slowly pour the juice through the strainer.",
        "The bowl you pour the juice into should be clean and sterile.",
        "To remove the most sediment, place silkscreen or cheesecloth in the fine mesh strainer before you pour the juice into it.",
        "Pasteurize the juice.",
        "Although you can drink unpasteurized juice, pasteurized juice lasts longer and is safer to drink.",
        "To pasteurize noni juice at home, put the open jar of noni juice into a pot of boiling water.",
        "The water level should cover that of the juice, but not be so high that it might flow into the jar.",
        "Heat the juice until it reaches and stays at 160 °F (71 °C) for 1 full minute.",
        "Use an instant-read or candy thermometer to determine the temperature of the juice.",
        "Test the pH of the juice.",
        "If the juice looks cloudy and you're concerned that it might be contaminated, check the pH of the noni juice.",
        "Buy litmus paper and dip it into the cool noni juice.",
        "If the juice is safe to drink, it should have a pH of 3.5 or less.",
        "If the pH is higher than 3.5, it's probably contaminated and not safe to drink.",
        "Seal and store the noni juice.",
        "Screw the lid onto the jar of juice and keep the juice at room temperature.",
        "While you should be able to store and use the noni juice indefinitely, keep it in the refrigerator if you'd like chilled juice.",
        "Remember to label the jar so you know what's in it and when you made it.",
        "If you're concerned about storing noni juice for a long period of time, you may want to make a new batch after a year or so.",
        "Quick Raw Noni Juice Select a ripe noni fruit.",
        "Choose a noni fruit that is white in color.",
        "If you're picking the noni fruit, it may still be firm so set it on the counter at room temperature until it's soft to the touch.",
        "The fruit will become translucent as it turns ripe.",
        "If you're picking your own noni fruit, ensure that you don't snap or break the delicate branches of the plant.",
        "Rinse the noni fruit and blend it for 1 minute.",
        "Once the noni fruit is soft, rinse any dirt or debris off the fruit with cool water.",
        "Put the noni fruit into a blender and secure the lid.",
        "Blend the fruit on low speed until the fruit is completely mashed.",
        "If you don't have a blender, put it into a food processor instead.",
        "For even riper fruit, you could mash the fruit in a bowl using a wooden spoon.",
        "Strain the mashed noni fruit.",
        "Set a fine mesh strainer over a bowl and scoop the mashed fruit into it.",
        "Rub the back of a spoon across the fruit to press the noni juice into the bowl.",
        "Keep in mind that the fruit won't produce a lot of juice.",
        "Discard the noni pulp and seeds or mix the puree with other fruit to create a fruit leather.",
        "Thin the noni juice with water or juice and drink it.",
        "Since the noni juice in the bowl will be very thick, you can thin it with liquid if you like.",
        "Try mixing in a little water or juice such as grape, apple, or pineapple.",
        "Keep in mind that diluting the noni juice will improve the flavor and make it easier to drink.",
        "Refrigerate any unused raw noni juice in an airtight container for up to 2 to 3 weeks."
    ]
}