{
    "title": "How to Put a Coin in a Coin Holder",
    "url": "https://www.wikihow.com/Put-a-Coin-in-a-Coin-Holder",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Collecting"
    ],
    "steps": [
        {
            "headline": "Choose your coin and the correct sized holder.",
            "description": "Look for a coin holder that is advertised as \"dust-free\". The paper dust from the cardboard can cause spotting over time."
        },
        {
            "headline": "Place the coin in the holder over the plastic.",
            "description": ""
        },
        {
            "headline": "Fold the holder at the perforation.",
            "description": ""
        },
        {
            "headline": "Hold the top side down.",
            "description": ""
        },
        {
            "headline": "Staple at the bottom of the holder.",
            "description": "Be sure not to staple too close to the coin because the metal can leach chemicals into the coin, and the coin can get scratched when it's being removed. At the same time, you don't want to put the staple so close to the edge that it doesn't hold it in place strongly enough.• Even if your coin holder is self-sealing, the adhesive can wear out over time and cause the holder to pop open, exposing and possibly losing your coin. Use stapling in addition to the adhesive, or consider not using the adhesive at all if you're concerned about its potential damage to the coin.•Use a pair of pliers to gently squeeze and flatten the two prongs of the staple that get folded at the back of the coin holder. This will ease sliding the coin holders in and out of the pockets of 8.5 by 11 inch clear plastic coin holder sheets."
        },
        {
            "headline": "Repeat for all four sides.",
            "description": ""
        },
        {
            "headline": "Write any information about the coin on the front of the holder (year, grade, grading service, mint mark, etc.).",
            "description": "You're done! Happy storing!"
        }
    ],
    "tyn": [
        "Stapler",
        "Coin",
        "Holder",
        "Pliers"
    ],
    "text": " Choose your coin and the correct sized holder. Look for a coin holder that is advertised as \"dust-free\". The paper dust from the cardboard can cause spotting over time. Place the coin in the holder over the plastic.  Fold the holder at the perforation.  Hold the top side down.  Staple at the bottom of the holder. Be sure not to staple too close to the coin because the metal can leach chemicals into the coin, and the coin can get scratched when it's being removed. At the same time, you don't want to put the staple so close to the edge that it doesn't hold it in place strongly enough.• Even if your coin holder is self-sealing, the adhesive can wear out over time and cause the holder to pop open, exposing and possibly losing your coin. Use stapling in addition to the adhesive, or consider not using the adhesive at all if you're concerned about its potential damage to the coin.•Use a pair of pliers to gently squeeze and flatten the two prongs of the staple that get folded at the back of the coin holder. This will ease sliding the coin holders in and out of the pockets of 8.5 by 11 inch clear plastic coin holder sheets. Repeat for all four sides.  Write any information about the coin on the front of the holder (year, grade, grading service, mint mark, etc.). You're done! Happy storing!",
    "sentences": [
        " Choose your coin and the correct sized holder.",
        "Look for a coin holder that is advertised as \"dust-free\".",
        "The paper dust from the cardboard can cause spotting over time.",
        "Place the coin in the holder over the plastic.",
        "Fold the holder at the perforation.",
        "Hold the top side down.",
        "Staple at the bottom of the holder.",
        "Be sure not to staple too close to the coin because the metal can leach chemicals into the coin, and the coin can get scratched when it's being removed.",
        "At the same time, you don't want to put the staple so close to the edge that it doesn't hold it in place strongly enough.• Even if your coin holder is self-sealing, the adhesive can wear out over time and cause the holder to pop open, exposing and possibly losing your coin.",
        "Use stapling in addition to the adhesive, or consider not using the adhesive at all if you're concerned about its potential damage to the coin.•Use a pair of pliers to gently squeeze and flatten the two prongs of the staple that get folded at the back of the coin holder.",
        "This will ease sliding the coin holders in and out of the pockets of 8.5 by 11 inch clear plastic coin holder sheets.",
        "Repeat for all four sides.",
        "Write any information about the coin on the front of the holder (year, grade, grading service, mint mark, etc.).",
        "You're done!",
        "Happy storing!"
    ]
}