{
    "title": "How to Make an Ice Gel Pack",
    "url": "https://www.wikihow.com/Make-an-Ice-Gel-Pack",
    "category_hierarchy": [
        "Health",
        "First Aid and Emergency Health Care",
        "First Aid Kits"
    ],
    "methods": [
        {
            "name": "Using Rubbing Alcohol",
            "steps": [
                {
                    "headline": "Mix the water and rubbing alcohol.",
                    "description": "You can make an ice pack using two parts water and one part alcohol. The alcohol will prevent the water from completely freezing. To start, mix your water and rubbing alcohol together in a mixing bowl. Two parts water to one part alcohol means for every two units of water, there should be one unit of alcohol. For example, if you're using two cups of water, use one cup of alcohol. If you don't have rubbing alcohol, you can pick some up at a drug store. Be sure to keep the rubbing alcohol mixture away from infants and small children. Rubbing alcohol can be dangerous when ingested and may irritate the eyes."
                },
                {
                    "headline": "Add the mixture to a Ziploc bag.",
                    "description": "Choose a Ziploc bag that's the right size for the ice pack you want. Pour the water and alcohol mixture into the bag. Go slowly to avoid spilling any of the mixture. You may want to lay a towel down below where you're adding the water alcohol mixture to catch any that accidentally drips. It's a good idea to double bag for added strength. This will not diminish the effectiveness of the ice pack. Plastic bags should also be kept out of reach of children, and used as part of an ice pack only when supervised. Plastic bags pose a suffocation risk to unattended children."
                },
                {
                    "headline": "Remove any excess air.",
                    "description": "You want to make sure there is no air in the bag before you freeze it. Use your hands to press out any excess air before zipping the bag closed. If you have a vacuum sealer, use this to remove excess air from the bag."
                },
                {
                    "headline": "Refrigerate the bag for 12 hours.",
                    "description": "Place the bag in the refrigerator. In about 12 hours, it should be semi-frozen. You can now use the ice pack to ice anywhere you're sore."
                }
            ]
        },
        {
            "name": "Using Dish Soap",
            "steps": [
                {
                    "headline": "Opt for a colorful dish soap.",
                    "description": "Colorful dish soap is less likely to freeze all the way. It is also harder to mistake colorful dish soap for something edible in the freezer. If you want your gel pack to look like a traditional gel pack, you may want to opt for blue dish soap."
                },
                {
                    "headline": "Fill a Ziploc bag with dish soap.",
                    "description": "You can fill the bag as full as you want it with dish soap. There is no set amount. Simply fill the bag until your ice pack is as big and bulky as you want it. Keep in mind more dish soap can cause a bag to take longer to freeze. If you need your ice pack very soon, opt to use less dish soap."
                },
                {
                    "headline": "Freeze the bag overnight.",
                    "description": "Place your bag in the refrigerator. Allow it to freeze overnight. When you take the gel pack out of the fridge, it should be semi-frozen and ready to use on sore areas of your body."
                }
            ]
        },
        {
            "name": "Using Your Ice Pack Safely",
            "steps": [
                {
                    "headline": "Wrap an ice pack in a cloth before use.",
                    "description": "You should never place an ice pack directly on your skin. This can cause skin irritation due to the extreme cold. Always wrap your ice pack in something like a cloth or paper towel before applying it to your skin."
                },
                {
                    "headline": "Ice your injury in short intervals.",
                    "description": "Time how long you apply the ice pack. You should not leave an ice pack on for extremely long periods of time. In general, the ice pack should stay on for intervals for about 20 to 30 minutes. You should only apply an ice pack up to four times per day."
                },
                {
                    "headline": "See a doctor under certain circumstances.",
                    "description": "Minor soreness and strain can be treated at home with ice and over-the-counter painkillers. However, under certain conditions, you should see a healthcare provider. See a doctor if you notice any of the following:\nSkin changes around the wound like blisters, a blueish color, or whitening of your skin. Burning or numbness when icing your skin."
                }
            ]
        }
    ],
    "tyn": [
        "Water",
        "Rubbing alcohol",
        "Dish soap",
        "Watertight freezer bag, medium size"
    ],
    "text": " Using Rubbing Alcohol Mix the water and rubbing alcohol. You can make an ice pack using two parts water and one part alcohol. The alcohol will prevent the water from completely freezing. To start, mix your water and rubbing alcohol together in a mixing bowl. Two parts water to one part alcohol means for every two units of water, there should be one unit of alcohol. For example, if you're using two cups of water, use one cup of alcohol. If you don't have rubbing alcohol, you can pick some up at a drug store. Be sure to keep the rubbing alcohol mixture away from infants and small children. Rubbing alcohol can be dangerous when ingested and may irritate the eyes. Add the mixture to a Ziploc bag. Choose a Ziploc bag that's the right size for the ice pack you want. Pour the water and alcohol mixture into the bag. Go slowly to avoid spilling any of the mixture. You may want to lay a towel down below where you're adding the water alcohol mixture to catch any that accidentally drips. It's a good idea to double bag for added strength. This will not diminish the effectiveness of the ice pack. Plastic bags should also be kept out of reach of children, and used as part of an ice pack only when supervised. Plastic bags pose a suffocation risk to unattended children. Remove any excess air. You want to make sure there is no air in the bag before you freeze it. Use your hands to press out any excess air before zipping the bag closed. If you have a vacuum sealer, use this to remove excess air from the bag. Refrigerate the bag for 12 hours. Place the bag in the refrigerator. In about 12 hours, it should be semi-frozen. You can now use the ice pack to ice anywhere you're sore. Using Dish Soap Opt for a colorful dish soap. Colorful dish soap is less likely to freeze all the way. It is also harder to mistake colorful dish soap for something edible in the freezer. If you want your gel pack to look like a traditional gel pack, you may want to opt for blue dish soap. Fill a Ziploc bag with dish soap. You can fill the bag as full as you want it with dish soap. There is no set amount. Simply fill the bag until your ice pack is as big and bulky as you want it. Keep in mind more dish soap can cause a bag to take longer to freeze. If you need your ice pack very soon, opt to use less dish soap. Freeze the bag overnight. Place your bag in the refrigerator. Allow it to freeze overnight. When you take the gel pack out of the fridge, it should be semi-frozen and ready to use on sore areas of your body. Using Your Ice Pack Safely Wrap an ice pack in a cloth before use. You should never place an ice pack directly on your skin. This can cause skin irritation due to the extreme cold. Always wrap your ice pack in something like a cloth or paper towel before applying it to your skin. Ice your injury in short intervals. Time how long you apply the ice pack. You should not leave an ice pack on for extremely long periods of time. In general, the ice pack should stay on for intervals for about 20 to 30 minutes. You should only apply an ice pack up to four times per day. See a doctor under certain circumstances. Minor soreness and strain can be treated at home with ice and over-the-counter painkillers. However, under certain conditions, you should see a healthcare provider. See a doctor if you notice any of the following:\nSkin changes around the wound like blisters, a blueish color, or whitening of your skin. Burning or numbness when icing your skin.",
    "sentences": [
        " Using Rubbing Alcohol Mix the water and rubbing alcohol.",
        "You can make an ice pack using two parts water and one part alcohol.",
        "The alcohol will prevent the water from completely freezing.",
        "To start, mix your water and rubbing alcohol together in a mixing bowl.",
        "Two parts water to one part alcohol means for every two units of water, there should be one unit of alcohol.",
        "For example, if you're using two cups of water, use one cup of alcohol.",
        "If you don't have rubbing alcohol, you can pick some up at a drug store.",
        "Be sure to keep the rubbing alcohol mixture away from infants and small children.",
        "Rubbing alcohol can be dangerous when ingested and may irritate the eyes.",
        "Add the mixture to a Ziploc bag.",
        "Choose a Ziploc bag that's the right size for the ice pack you want.",
        "Pour the water and alcohol mixture into the bag.",
        "Go slowly to avoid spilling any of the mixture.",
        "You may want to lay a towel down below where you're adding the water alcohol mixture to catch any that accidentally drips.",
        "It's a good idea to double bag for added strength.",
        "This will not diminish the effectiveness of the ice pack.",
        "Plastic bags should also be kept out of reach of children, and used as part of an ice pack only when supervised.",
        "Plastic bags pose a suffocation risk to unattended children.",
        "Remove any excess air.",
        "You want to make sure there is no air in the bag before you freeze it.",
        "Use your hands to press out any excess air before zipping the bag closed.",
        "If you have a vacuum sealer, use this to remove excess air from the bag.",
        "Refrigerate the bag for 12 hours.",
        "Place the bag in the refrigerator.",
        "In about 12 hours, it should be semi-frozen.",
        "You can now use the ice pack to ice anywhere you're sore.",
        "Using Dish Soap Opt for a colorful dish soap.",
        "Colorful dish soap is less likely to freeze all the way.",
        "It is also harder to mistake colorful dish soap for something edible in the freezer.",
        "If you want your gel pack to look like a traditional gel pack, you may want to opt for blue dish soap.",
        "Fill a Ziploc bag with dish soap.",
        "You can fill the bag as full as you want it with dish soap.",
        "There is no set amount.",
        "Simply fill the bag until your ice pack is as big and bulky as you want it.",
        "Keep in mind more dish soap can cause a bag to take longer to freeze.",
        "If you need your ice pack very soon, opt to use less dish soap.",
        "Freeze the bag overnight.",
        "Place your bag in the refrigerator.",
        "Allow it to freeze overnight.",
        "When you take the gel pack out of the fridge, it should be semi-frozen and ready to use on sore areas of your body.",
        "Using Your Ice Pack Safely Wrap an ice pack in a cloth before use.",
        "You should never place an ice pack directly on your skin.",
        "This can cause skin irritation due to the extreme cold.",
        "Always wrap your ice pack in something like a cloth or paper towel before applying it to your skin.",
        "Ice your injury in short intervals.",
        "Time how long you apply the ice pack.",
        "You should not leave an ice pack on for extremely long periods of time.",
        "In general, the ice pack should stay on for intervals for about 20 to 30 minutes.",
        "You should only apply an ice pack up to four times per day.",
        "See a doctor under certain circumstances.",
        "Minor soreness and strain can be treated at home with ice and over-the-counter painkillers.",
        "However, under certain conditions, you should see a healthcare provider.",
        "See a doctor if you notice any of the following:\nSkin changes around the wound like blisters, a blueish color, or whitening of your skin.",
        "Burning or numbness when icing your skin."
    ]
}