{
    "title": "How to Use a Bottle Sterilizer",
    "url": "https://www.wikihow.com/Use-a-Bottle-Sterilizer",
    "category_hierarchy": [
        "Family Life",
        "Parenting",
        "Development Stages",
        "Babies and Infants"
    ],
    "methods": [
        {
            "name": "Using an Electric Steam Sterilizer",
            "steps": [
                {
                    "headline": "Add the recommended amount of water to the sterilizer.",
                    "description": "Steam sterilizers require the addition of a small amount of water to create steam. Consult your user manual to determine how much water to use. Too little water may not sterilize the bottles properly, but too much could cause the basin to overflow. Check the sterilizer's instructions to see if there is a specific type of water you need to use. Some sterilizers require you to use distilled water instead of tap water to avoid a buildup of mineral deposits inside the sterilizer."
                },
                {
                    "headline": "Clean your bottles and accessories.",
                    "description": "The steam sterilizer kills germs, but will not actually clean off milk or formula residue. Wash your bottles, nipples, and other accessories with warm, soapy water and rinse them thoroughly before you put them into the sterilizer."
                },
                {
                    "headline": "Load the sterilizer.",
                    "description": "Place one bottle upside-down on each prong. Do not attempt to load more bottles into the sterilizer than there are prongs. Most only have room for about six bottles, so if you have more than that, you will need to clean the bottles in batches. If you are interested in sterilizing a larger number of bottles at one time, check the sterilizer’s capacity before purchasing. Some sterilizers will only hold a couple of bottles, while others may hold 9 or more."
                },
                {
                    "headline": "Place the nipples, nipple rings, and caps inside.",
                    "description": "These pieces should be spaced apart enough that they do not touch. If the sterilizer has lower prongs, space the accessories in between these prongs to hold them in place. Make sure that nipples and caps are placed in the sterilizer with their openings facing down. This will allow the steam to enter and sterilize the inside of the nipple or cap more effectively."
                },
                {
                    "headline": "Put the cover on.",
                    "description": "Electric sterilizers work by generating steam. This steam needs to be contained inside the sterilizer to clean the bottles properly. Make sure the cover is on securely before you turn on the sterilizer."
                },
                {
                    "headline": "Turn on the machine.",
                    "description": "The sterilizer should automatically begin heating to a temperature high enough to generate steam and kill most of the bacteria in and on the bottles and nipples. For most electric steam sterilizers, the process takes about 10 minutes, although the time required is variable."
                },
                {
                    "headline": "Remove the bottles when the cycle finishes.",
                    "description": "Do not attempt to remove them until after the sterilizer finishes its cooling cycle. Dry the bottles with a clean dish towel or allow them to air dry. Many electric steam sterilizers will also dry and deodorize the bottles for you. Some electric steam cleaners are designed to keep the bottles sterilized for up to 24 hours, as long as the lid is kept closed during that time. If you don’t want to use the bottles right away, consider leaving them in the sterilizer."
                }
            ]
        },
        {
            "name": "Using a Microwave Steam Sterilizer",
            "steps": [
                {
                    "headline": "Clean your microwave before sterilizing.",
                    "description": "Before using a microwave sterilizer, give your microwave a good scrub with a gentle detergent. Remove any food splatters and greasy buildup on the inside walls, door, top, and bottom."
                },
                {
                    "headline": "Add water to the sterilizer.",
                    "description": "Like electric steam sterilizers, microwave steam sterilizers need water to function. However, microwave sterilizers use heat from your microwave, rather than an internal heating element, to create steam. Consult your user manual to determine how much water to add to your model. Many microwave sterilizers have a removable steamer rack on which to place the bottles and accessories. Remove this before filling with water, and then replace it. Check your user manual to find out if distilled water is recommended for your unit."
                },
                {
                    "headline": "Load the bottles and accessories.",
                    "description": "Make sure the bottles, nipples, and caps are placed open side down so that the steam can enter them from below. Check your manual for specific instructions on how to load the bottles and accessories, as some units may have designated spaces for each part. Never put anything metal in a microwave sterilizer. Your bottles and accessories should be clean before you load them into the sterilizer."
                },
                {
                    "headline": "Close the lid.",
                    "description": "Microwave sterilizers typically come with a plastic lid that is designed to keep the steam inside during sterilization. Make sure that the lid is on securely before starting the process of sterilization."
                },
                {
                    "headline": "Microwave the unit according to the manufacturer's instructions.",
                    "description": "The amount of time required will vary depending on the steamer and the wattage of your microwave. Some units may need no more than 2 minutes in a high-wattage microwave set on “high.” Check the settings on your microwave and consult the manual for your sterilizer to be sure of how much time is needed."
                },
                {
                    "headline": "Allow the unit to cool before removing the bottles and accessories.",
                    "description": "The bottles and accessories will be very hot after you microwave them. The sterilizer will need to cool for at least 2 minutes before it will be safe to handle. Like many electric sterilizers, microwave sterilizers are designed to keep your bottles and accessories sterile for up to 24 hours if the lid is left on."
                }
            ]
        },
        {
            "name": "Using a Cold Water Sterilizer",
            "steps": [
                {
                    "headline": "Fill a clean, food-grade container with tap water.",
                    "description": "Some microwave sterilizers double as cold water sterilizers, but you can use any large food-storage container with a lid for this purpose. Make sure that the container you select is made from a food-grade material. You can purchase large food-grade buckets from most home supply stores. For cold water sterilization, the bottles and nipples need to be submerged. If you are using a microwave sterilizer with a steaming rack, remove the rack before using it as a cold water sterilizer."
                },
                {
                    "headline": "Place the bottles and accessories in the water.",
                    "description": "Place clean bottles, nipples, and any other accessories you wish to sterilize in the water. Allow the bottles and nipples to completely fill with water, and make sure there are no air bubbles trapped inside."
                },
                {
                    "headline": "Add a sterilizing tablet or solution.",
                    "description": "Use a cold water sterilizing solution designed for use with baby bottles and nipples, such as Milton Sterilising Tablets or Dr. Johnson’s Sterilising Fluid. Follow the package directions carefully to determine how much sterilizer to add to your water."
                },
                {
                    "headline": "Use the sterilizer tray to keep everything below the water.",
                    "description": "The weight of the tray can help keep the bottles and accessories beneath the water's surface, ensuring that they are completely sterilized. If you are using a bucket or other food container rather than a specially designed cold water sterilizer, you can weigh the bottles and accessories down with a large plate."
                },
                {
                    "headline": "Consult the manufacturer's instructions for times.",
                    "description": "For most cold water sterilizing solutions, your bottles and accessories should be sterile after soaking for about 15-30 minutes. If you wish to store your bottles in the solution, make sure to change the solution out every 24 hours. Wash your hands thoroughly before taking the bottles out of the solution or use sterile tongs. You do not need to rinse the bottles after sterilizing. However, some babies may dislike the lingering smell and taste of the sterilizer. If you do wish to rinse, boil some water to sterilize it, and use that."
                }
            ]
        }
    ],
    "tyn": [
        "Baby bottles",
        "Bottle sterilizer",
        "Microwave (for microwave steam sterilizers)",
        "Manufacturer’s instructions",
        "Water",
        "Sterilizing tablets or solution (for cold water sterilizers)",
        "Food-grade container or cold water bottle sterilizer"
    ],
    "text": " Using an Electric Steam Sterilizer Add the recommended amount of water to the sterilizer. Steam sterilizers require the addition of a small amount of water to create steam. Consult your user manual to determine how much water to use. Too little water may not sterilize the bottles properly, but too much could cause the basin to overflow. Check the sterilizer's instructions to see if there is a specific type of water you need to use. Some sterilizers require you to use distilled water instead of tap water to avoid a buildup of mineral deposits inside the sterilizer. Clean your bottles and accessories. The steam sterilizer kills germs, but will not actually clean off milk or formula residue. Wash your bottles, nipples, and other accessories with warm, soapy water and rinse them thoroughly before you put them into the sterilizer. Load the sterilizer. Place one bottle upside-down on each prong. Do not attempt to load more bottles into the sterilizer than there are prongs. Most only have room for about six bottles, so if you have more than that, you will need to clean the bottles in batches. If you are interested in sterilizing a larger number of bottles at one time, check the sterilizer’s capacity before purchasing. Some sterilizers will only hold a couple of bottles, while others may hold 9 or more. Place the nipples, nipple rings, and caps inside. These pieces should be spaced apart enough that they do not touch. If the sterilizer has lower prongs, space the accessories in between these prongs to hold them in place. Make sure that nipples and caps are placed in the sterilizer with their openings facing down. This will allow the steam to enter and sterilize the inside of the nipple or cap more effectively. Put the cover on. Electric sterilizers work by generating steam. This steam needs to be contained inside the sterilizer to clean the bottles properly. Make sure the cover is on securely before you turn on the sterilizer. Turn on the machine. The sterilizer should automatically begin heating to a temperature high enough to generate steam and kill most of the bacteria in and on the bottles and nipples. For most electric steam sterilizers, the process takes about 10 minutes, although the time required is variable. Remove the bottles when the cycle finishes. Do not attempt to remove them until after the sterilizer finishes its cooling cycle. Dry the bottles with a clean dish towel or allow them to air dry. Many electric steam sterilizers will also dry and deodorize the bottles for you. Some electric steam cleaners are designed to keep the bottles sterilized for up to 24 hours, as long as the lid is kept closed during that time. If you don’t want to use the bottles right away, consider leaving them in the sterilizer. Using a Microwave Steam Sterilizer Clean your microwave before sterilizing. Before using a microwave sterilizer, give your microwave a good scrub with a gentle detergent. Remove any food splatters and greasy buildup on the inside walls, door, top, and bottom. Add water to the sterilizer. Like electric steam sterilizers, microwave steam sterilizers need water to function. However, microwave sterilizers use heat from your microwave, rather than an internal heating element, to create steam. Consult your user manual to determine how much water to add to your model. Many microwave sterilizers have a removable steamer rack on which to place the bottles and accessories. Remove this before filling with water, and then replace it. Check your user manual to find out if distilled water is recommended for your unit. Load the bottles and accessories. Make sure the bottles, nipples, and caps are placed open side down so that the steam can enter them from below. Check your manual for specific instructions on how to load the bottles and accessories, as some units may have designated spaces for each part. Never put anything metal in a microwave sterilizer. Your bottles and accessories should be clean before you load them into the sterilizer. Close the lid. Microwave sterilizers typically come with a plastic lid that is designed to keep the steam inside during sterilization. Make sure that the lid is on securely before starting the process of sterilization. Microwave the unit according to the manufacturer's instructions. The amount of time required will vary depending on the steamer and the wattage of your microwave. Some units may need no more than 2 minutes in a high-wattage microwave set on “high.” Check the settings on your microwave and consult the manual for your sterilizer to be sure of how much time is needed. Allow the unit to cool before removing the bottles and accessories. The bottles and accessories will be very hot after you microwave them. The sterilizer will need to cool for at least 2 minutes before it will be safe to handle. Like many electric sterilizers, microwave sterilizers are designed to keep your bottles and accessories sterile for up to 24 hours if the lid is left on. Using a Cold Water Sterilizer Fill a clean, food-grade container with tap water. Some microwave sterilizers double as cold water sterilizers, but you can use any large food-storage container with a lid for this purpose. Make sure that the container you select is made from a food-grade material. You can purchase large food-grade buckets from most home supply stores. For cold water sterilization, the bottles and nipples need to be submerged. If you are using a microwave sterilizer with a steaming rack, remove the rack before using it as a cold water sterilizer. Place the bottles and accessories in the water. Place clean bottles, nipples, and any other accessories you wish to sterilize in the water. Allow the bottles and nipples to completely fill with water, and make sure there are no air bubbles trapped inside. Add a sterilizing tablet or solution. Use a cold water sterilizing solution designed for use with baby bottles and nipples, such as Milton Sterilising Tablets or Dr. Johnson’s Sterilising Fluid. Follow the package directions carefully to determine how much sterilizer to add to your water. Use the sterilizer tray to keep everything below the water. The weight of the tray can help keep the bottles and accessories beneath the water's surface, ensuring that they are completely sterilized. If you are using a bucket or other food container rather than a specially designed cold water sterilizer, you can weigh the bottles and accessories down with a large plate. Consult the manufacturer's instructions for times. For most cold water sterilizing solutions, your bottles and accessories should be sterile after soaking for about 15-30 minutes. If you wish to store your bottles in the solution, make sure to change the solution out every 24 hours. Wash your hands thoroughly before taking the bottles out of the solution or use sterile tongs. You do not need to rinse the bottles after sterilizing. However, some babies may dislike the lingering smell and taste of the sterilizer. If you do wish to rinse, boil some water to sterilize it, and use that.",
    "sentences": [
        " Using an Electric Steam Sterilizer Add the recommended amount of water to the sterilizer.",
        "Steam sterilizers require the addition of a small amount of water to create steam.",
        "Consult your user manual to determine how much water to use.",
        "Too little water may not sterilize the bottles properly, but too much could cause the basin to overflow.",
        "Check the sterilizer's instructions to see if there is a specific type of water you need to use.",
        "Some sterilizers require you to use distilled water instead of tap water to avoid a buildup of mineral deposits inside the sterilizer.",
        "Clean your bottles and accessories.",
        "The steam sterilizer kills germs, but will not actually clean off milk or formula residue.",
        "Wash your bottles, nipples, and other accessories with warm, soapy water and rinse them thoroughly before you put them into the sterilizer.",
        "Load the sterilizer.",
        "Place one bottle upside-down on each prong.",
        "Do not attempt to load more bottles into the sterilizer than there are prongs.",
        "Most only have room for about six bottles, so if you have more than that, you will need to clean the bottles in batches.",
        "If you are interested in sterilizing a larger number of bottles at one time, check the sterilizer’s capacity before purchasing.",
        "Some sterilizers will only hold a couple of bottles, while others may hold 9 or more.",
        "Place the nipples, nipple rings, and caps inside.",
        "These pieces should be spaced apart enough that they do not touch.",
        "If the sterilizer has lower prongs, space the accessories in between these prongs to hold them in place.",
        "Make sure that nipples and caps are placed in the sterilizer with their openings facing down.",
        "This will allow the steam to enter and sterilize the inside of the nipple or cap more effectively.",
        "Put the cover on.",
        "Electric sterilizers work by generating steam.",
        "This steam needs to be contained inside the sterilizer to clean the bottles properly.",
        "Make sure the cover is on securely before you turn on the sterilizer.",
        "Turn on the machine.",
        "The sterilizer should automatically begin heating to a temperature high enough to generate steam and kill most of the bacteria in and on the bottles and nipples.",
        "For most electric steam sterilizers, the process takes about 10 minutes, although the time required is variable.",
        "Remove the bottles when the cycle finishes.",
        "Do not attempt to remove them until after the sterilizer finishes its cooling cycle.",
        "Dry the bottles with a clean dish towel or allow them to air dry.",
        "Many electric steam sterilizers will also dry and deodorize the bottles for you.",
        "Some electric steam cleaners are designed to keep the bottles sterilized for up to 24 hours, as long as the lid is kept closed during that time.",
        "If you don’t want to use the bottles right away, consider leaving them in the sterilizer.",
        "Using a Microwave Steam Sterilizer Clean your microwave before sterilizing.",
        "Before using a microwave sterilizer, give your microwave a good scrub with a gentle detergent.",
        "Remove any food splatters and greasy buildup on the inside walls, door, top, and bottom.",
        "Add water to the sterilizer.",
        "Like electric steam sterilizers, microwave steam sterilizers need water to function.",
        "However, microwave sterilizers use heat from your microwave, rather than an internal heating element, to create steam.",
        "Consult your user manual to determine how much water to add to your model.",
        "Many microwave sterilizers have a removable steamer rack on which to place the bottles and accessories.",
        "Remove this before filling with water, and then replace it.",
        "Check your user manual to find out if distilled water is recommended for your unit.",
        "Load the bottles and accessories.",
        "Make sure the bottles, nipples, and caps are placed open side down so that the steam can enter them from below.",
        "Check your manual for specific instructions on how to load the bottles and accessories, as some units may have designated spaces for each part.",
        "Never put anything metal in a microwave sterilizer.",
        "Your bottles and accessories should be clean before you load them into the sterilizer.",
        "Close the lid.",
        "Microwave sterilizers typically come with a plastic lid that is designed to keep the steam inside during sterilization.",
        "Make sure that the lid is on securely before starting the process of sterilization.",
        "Microwave the unit according to the manufacturer's instructions.",
        "The amount of time required will vary depending on the steamer and the wattage of your microwave.",
        "Some units may need no more than 2 minutes in a high-wattage microwave set on “high.” Check the settings on your microwave and consult the manual for your sterilizer to be sure of how much time is needed.",
        "Allow the unit to cool before removing the bottles and accessories.",
        "The bottles and accessories will be very hot after you microwave them.",
        "The sterilizer will need to cool for at least 2 minutes before it will be safe to handle.",
        "Like many electric sterilizers, microwave sterilizers are designed to keep your bottles and accessories sterile for up to 24 hours if the lid is left on.",
        "Using a Cold Water Sterilizer Fill a clean, food-grade container with tap water.",
        "Some microwave sterilizers double as cold water sterilizers, but you can use any large food-storage container with a lid for this purpose.",
        "Make sure that the container you select is made from a food-grade material.",
        "You can purchase large food-grade buckets from most home supply stores.",
        "For cold water sterilization, the bottles and nipples need to be submerged.",
        "If you are using a microwave sterilizer with a steaming rack, remove the rack before using it as a cold water sterilizer.",
        "Place the bottles and accessories in the water.",
        "Place clean bottles, nipples, and any other accessories you wish to sterilize in the water.",
        "Allow the bottles and nipples to completely fill with water, and make sure there are no air bubbles trapped inside.",
        "Add a sterilizing tablet or solution.",
        "Use a cold water sterilizing solution designed for use with baby bottles and nipples, such as Milton Sterilising Tablets or Dr. Johnson’s Sterilising Fluid.",
        "Follow the package directions carefully to determine how much sterilizer to add to your water.",
        "Use the sterilizer tray to keep everything below the water.",
        "The weight of the tray can help keep the bottles and accessories beneath the water's surface, ensuring that they are completely sterilized.",
        "If you are using a bucket or other food container rather than a specially designed cold water sterilizer, you can weigh the bottles and accessories down with a large plate.",
        "Consult the manufacturer's instructions for times.",
        "For most cold water sterilizing solutions, your bottles and accessories should be sterile after soaking for about 15-30 minutes.",
        "If you wish to store your bottles in the solution, make sure to change the solution out every 24 hours.",
        "Wash your hands thoroughly before taking the bottles out of the solution or use sterile tongs.",
        "You do not need to rinse the bottles after sterilizing.",
        "However, some babies may dislike the lingering smell and taste of the sterilizer.",
        "If you do wish to rinse, boil some water to sterilize it, and use that."
    ]
}