{
    "title": "How to Make Rainbow Inspired Body Butter",
    "url": "https://www.wikihow.com/Make-Rainbow-Inspired-Body-Butter",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Handmade Cosmetics"
    ],
    "methods": [
        {
            "name": "Steps",
            "steps": [
                {
                    "headline": "Take 1 and 1/3 of Shea butter in your measuring cups and pack it in.",
                    "description": ""
                },
                {
                    "headline": "Now empty the measured Shea butter into the Pyrex glass cup to melt the butter.",
                    "description": ""
                },
                {
                    "headline": "Place the Pyrex cup into a cooking cup so as to not to burn the butter in the melting process.",
                    "description": ""
                },
                {
                    "headline": "Melt the butter in medium heat.",
                    "description": ""
                },
                {
                    "headline": "After the butter has melted completely, pour it out in a bowl.",
                    "description": ""
                },
                {
                    "headline": "Let it cool for 15 min",
                    "description": ""
                },
                {
                    "headline": "Now measure 1/2 cup of carrier/sweet almond or olive oil and pour it into the melted butter.",
                    "description": ""
                },
                {
                    "headline": "Add 1 teaspoon of Vitamin E oil into the mixture.",
                    "description": "Optional: You can add Crushed oatmeal or corn starch. Optional to make it less greasy: 2 Tablespoon Corn Starch (grocery store), Tapioca Starch (grocery store), or finely milled Oatmeal which I personally prefer because it soothes irritated and itchy skin like poison ivy/oak/sumac, rashes, insect bites, and eczema.﻿ It also soothes prickly heat, chicken pox, hives or sunburn."
                },
                {
                    "headline": "Mix it up!",
                    "description": "Optional again: Add 1-2 TSP of your favorite scented oil."
                },
                {
                    "headline": "Mix it up with a whisker or an electric whisk for 2 min.",
                    "description": ""
                },
                {
                    "headline": "Wait till you see it solidifying a little.",
                    "description": "(partially solidifying)"
                },
                {
                    "headline": "Once you see it solidifying a bit place it in the freezer for 10 to 20 min.",
                    "description": ""
                },
                {
                    "headline": "Now bring out the (almost) frozen mixture and whisk it again with the electric whisker until its whipped enough.",
                    "description": "You will know when it forms peaks on the whisker. When it does, its whisked enough. The procedure is done until and unless you don't want to color it."
                }
            ]
        },
        {
            "name": "Colored Body Butter",
            "steps": [
                {
                    "headline": "Take the whipped mixture unto a bowl.",
                    "description": ""
                },
                {
                    "headline": "Add 1/2 to 1 teaspoon of your favorite rainbow colors i.e water soluble color or soap color.",
                    "description": ""
                },
                {
                    "headline": "Make sure you separate the mixtures into portions into different bowls if you want to have multicolored butter.",
                    "description": "And add the same amount i.e 1/2 or 1 TSP color to each slot and whisk it."
                },
                {
                    "headline": "Now scoop and layer your butter the way to your preference.",
                    "description": "If you want Yellow to be the up-most layer do so. Its all about you!"
                },
                {
                    "headline": "Push down and layer.",
                    "description": ""
                },
                {
                    "headline": "And don't forget to wipe the sides of the container for clear layers.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Recipe can make two 8 oz Jars with a shelf life of 6-8 months:",
        "1 1/3 Cup Shea Butter or use any butter base you like.",
        "1/2 Cup Carrier Oil (Sweet almond oil or olive oil from grocery store)",
        "1 Teaspoon Vitamin E Oil (Natural preservative to extend the self life to 6 to 8 months and can be purchased at the drugstore)",
        "Optional to scent: 1/2-1 Teaspoon Essential Oil or Body Safe Fragrance Oil and you can buy store brand popular scents from Victoria's secret",
        "Optional to color: 1-2 Teaspoon of Water Soluble Colorant or Soap color which will not stain your skin and it's safe to use for face and body",
        "Whisk or electric mixer",
        "Mixing bowl",
        "Pot or Pyrex glass cup to melt butter",
        "Pot to boil water",
        "Spoon",
        "Stove",
        "Measuring cups and spoons",
        "Container to store the body butter and store in a cool place"
    ],
    "text": " Steps Take 1 and 1/3 of Shea butter in your measuring cups and pack it in.  Now empty the measured Shea butter into the Pyrex glass cup to melt the butter.  Place the Pyrex cup into a cooking cup so as to not to burn the butter in the melting process.  Melt the butter in medium heat.  After the butter has melted completely, pour it out in a bowl.  Let it cool for 15 min  Now measure 1/2 cup of carrier/sweet almond or olive oil and pour it into the melted butter.  Add 1 teaspoon of Vitamin E oil into the mixture. Optional: You can add Crushed oatmeal or corn starch. Optional to make it less greasy: 2 Tablespoon Corn Starch (grocery store), Tapioca Starch (grocery store), or finely milled Oatmeal which I personally prefer because it soothes irritated and itchy skin like poison ivy/oak/sumac, rashes, insect bites, and eczema.﻿ It also soothes prickly heat, chicken pox, hives or sunburn. Mix it up! Optional again: Add 1-2 TSP of your favorite scented oil. Mix it up with a whisker or an electric whisk for 2 min.  Wait till you see it solidifying a little. (partially solidifying) Once you see it solidifying a bit place it in the freezer for 10 to 20 min.  Now bring out the (almost) frozen mixture and whisk it again with the electric whisker until its whipped enough. You will know when it forms peaks on the whisker. When it does, its whisked enough. The procedure is done until and unless you don't want to color it. Colored Body Butter Take the whipped mixture unto a bowl.  Add 1/2 to 1 teaspoon of your favorite rainbow colors i.e water soluble color or soap color.  Make sure you separate the mixtures into portions into different bowls if you want to have multicolored butter. And add the same amount i.e 1/2 or 1 TSP color to each slot and whisk it. Now scoop and layer your butter the way to your preference. If you want Yellow to be the up-most layer do so. Its all about you! Push down and layer.  And don't forget to wipe the sides of the container for clear layers. ",
    "sentences": [
        " Steps Take 1 and 1/3 of Shea butter in your measuring cups and pack it in.",
        "Now empty the measured Shea butter into the Pyrex glass cup to melt the butter.",
        "Place the Pyrex cup into a cooking cup so as to not to burn the butter in the melting process.",
        "Melt the butter in medium heat.",
        "After the butter has melted completely, pour it out in a bowl.",
        "Let it cool for 15 min  Now measure 1/2 cup of carrier/sweet almond or olive oil and pour it into the melted butter.",
        "Add 1 teaspoon of Vitamin E oil into the mixture.",
        "Optional: You can add Crushed oatmeal or corn starch.",
        "Optional to make it less greasy: 2 Tablespoon Corn Starch (grocery store), Tapioca Starch (grocery store), or finely milled Oatmeal which I personally prefer because it soothes irritated and itchy skin like poison ivy/oak/sumac, rashes, insect bites, and eczema.﻿ It also soothes prickly heat, chicken pox, hives or sunburn.",
        "Mix it up!",
        "Optional again: Add 1-2 TSP of your favorite scented oil.",
        "Mix it up with a whisker or an electric whisk for 2 min.",
        "Wait till you see it solidifying a little.",
        "(partially solidifying) Once you see it solidifying a bit place it in the freezer for 10 to 20 min.",
        "Now bring out the (almost) frozen mixture and whisk it again with the electric whisker until its whipped enough.",
        "You will know when it forms peaks on the whisker.",
        "When it does, its whisked enough.",
        "The procedure is done until and unless you don't want to color it.",
        "Colored Body Butter Take the whipped mixture unto a bowl.",
        "Add 1/2 to 1 teaspoon of your favorite rainbow colors i.e water soluble color or soap color.",
        "Make sure you separate the mixtures into portions into different bowls if you want to have multicolored butter.",
        "And add the same amount i.e 1/2 or 1 TSP color to each slot and whisk it.",
        "Now scoop and layer your butter the way to your preference.",
        "If you want Yellow to be the up-most layer do so.",
        "Its all about you!",
        "Push down and layer.",
        "And don't forget to wipe the sides of the container for clear layers."
    ]
}