{
    "title": "How to Make a Hamburger Egg Sandwich",
    "url": "https://www.wikihow.com/Make-a-Hamburger-Egg-Sandwich",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Sandwiches and Quick Meals",
        "Meat and Poultry Sandwiches"
    ],
    "parts": [
        {
            "name": "Preparing the Bun and Toppings",
            "steps": [
                {
                    "headline": "Toast the hamburger bun.",
                    "description": "Split the bun in half and toast lightly in the oven or toaster oven."
                },
                {
                    "headline": "Assemble toppings if needed.",
                    "description": "This step is optional as you could just as easily consume this burger with egg by itself and you'll still be happy. Create a cheeseburger. Find a nice slice of cheddar or Swiss to top the burger. Or use two types of cheese for a more tasty variation. Prepare any cold toppings such as lettuce, tomato, pickle or onions. Clean and dice toppings beforehand so you can swiftly put the burger together."
                },
                {
                    "headline": "Find a drinking glass to create a hole in the middle of the hamburger.",
                    "description": "This small hole in the middle of the burger patty is needed for placement of the egg. To make the hole, push a drinking glass into the center of the burger patty and remove the cut middle portion."
                }
            ]
        },
        {
            "name": "Preparing the Hamburger Meat",
            "steps": [
                {
                    "headline": "Flatten the hamburger meat.",
                    "description": "Make sure you have enough meat to not only create the entire burger but also to make a hole in the middle for the egg. Flatten the hamburger meat on top of a piece of parchment paper to avoid having it stick to the countertop. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/47\\/Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\\/v4-459px-Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/47\\/Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\\/v4-759px-Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nCreate a hole in the middle of the hamburger meat with the drinking glass. Spray the drinking glass rim with cooking spray (to stop it sticking to the meat) and press the rim down in the middle of the burger. Remove the glass and lift out the middle portion of the burger to create a hole."
                },
                {
                    "headline": "Season the patty with salt and pepper.",
                    "description": "Lightly add salt, pepper and any other desired seasonings."
                }
            ]
        },
        {
            "name": "Cooking the Hamburger Egg Combination",
            "steps": [
                {
                    "headline": "Place the hamburger in a heated skillet coated with cooking oil.",
                    "description": "Lift the burger from the parchment paper with a spatula in order to keep the burger shape intact."
                },
                {
                    "headline": "Allow the hamburger to cook for a minute.",
                    "description": "Then crack the egg and deposit it gently into the hole in the middle of the burger. Keep the egg in the middle hole and avoid spilling it over the meat."
                },
                {
                    "headline": "Cook the burger until it has browned on one end.",
                    "description": "Flip the burger on the other side and cook. Be careful when flipping the burger so that you don’t disturb the egg, cracking the yolk."
                },
                {
                    "headline": "Add a slice of cheese when the burger is almost completely cooked.",
                    "description": "If you're planning to add the cheese, make sure you do it while the meat is still in the pan. That way, it will melt and blend into the burger."
                }
            ]
        },
        {
            "name": "Finishing the Burger",
            "steps": [
                {
                    "headline": "Season the hamburger bun.",
                    "description": "Consider adding a topping like ketchup, butter, mayonnaise or any other desired condiment."
                },
                {
                    "headline": "Transfer the cooked patty to the toasted hamburger bun.",
                    "description": "Place the opened, prepared bun on a plate and carefully transfer the meat/egg combo from the skillet to the bun."
                },
                {
                    "headline": "Add burger toppings.",
                    "description": "Now is the time to add lettuce, tomato or other cold ingredients. You can also re-top with ketchup or additional condiments."
                },
                {
                    "headline": "Serve warm.",
                    "description": "This burger tastes best when transferred immediately from the pan to your mouth."
                }
            ]
        }
    ],
    "tyn": [
        "Heavy based pan",
        "Spatula",
        "Cooking oil spray"
    ],
    "text": " Preparing the Bun and Toppings Toast the hamburger bun. Split the bun in half and toast lightly in the oven or toaster oven. Assemble toppings if needed. This step is optional as you could just as easily consume this burger with egg by itself and you'll still be happy. Create a cheeseburger. Find a nice slice of cheddar or Swiss to top the burger. Or use two types of cheese for a more tasty variation. Prepare any cold toppings such as lettuce, tomato, pickle or onions. Clean and dice toppings beforehand so you can swiftly put the burger together. Find a drinking glass to create a hole in the middle of the hamburger. This small hole in the middle of the burger patty is needed for placement of the egg. To make the hole, push a drinking glass into the center of the burger patty and remove the cut middle portion. Preparing the Hamburger Meat Flatten the hamburger meat. Make sure you have enough meat to not only create the entire burger but also to make a hole in the middle for the egg. Flatten the hamburger meat on top of a piece of parchment paper to avoid having it stick to the countertop. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/47\\/Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\\/v4-459px-Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/47\\/Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\\/v4-759px-Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nCreate a hole in the middle of the hamburger meat with the drinking glass. Spray the drinking glass rim with cooking spray (to stop it sticking to the meat) and press the rim down in the middle of the burger. Remove the glass and lift out the middle portion of the burger to create a hole. Season the patty with salt and pepper. Lightly add salt, pepper and any other desired seasonings. Cooking the Hamburger Egg Combination Place the hamburger in a heated skillet coated with cooking oil. Lift the burger from the parchment paper with a spatula in order to keep the burger shape intact. Allow the hamburger to cook for a minute. Then crack the egg and deposit it gently into the hole in the middle of the burger. Keep the egg in the middle hole and avoid spilling it over the meat. Cook the burger until it has browned on one end. Flip the burger on the other side and cook. Be careful when flipping the burger so that you don’t disturb the egg, cracking the yolk. Add a slice of cheese when the burger is almost completely cooked. If you're planning to add the cheese, make sure you do it while the meat is still in the pan. That way, it will melt and blend into the burger. Finishing the Burger Season the hamburger bun. Consider adding a topping like ketchup, butter, mayonnaise or any other desired condiment. Transfer the cooked patty to the toasted hamburger bun. Place the opened, prepared bun on a plate and carefully transfer the meat/egg combo from the skillet to the bun. Add burger toppings. Now is the time to add lettuce, tomato or other cold ingredients. You can also re-top with ketchup or additional condiments. Serve warm. This burger tastes best when transferred immediately from the pan to your mouth.",
    "sentences": [
        " Preparing the Bun and Toppings Toast the hamburger bun.",
        "Split the bun in half and toast lightly in the oven or toaster oven.",
        "Assemble toppings if needed.",
        "This step is optional as you could just as easily consume this burger with egg by itself and you'll still be happy.",
        "Create a cheeseburger.",
        "Find a nice slice of cheddar or Swiss to top the burger.",
        "Or use two types of cheese for a more tasty variation.",
        "Prepare any cold toppings such as lettuce, tomato, pickle or onions.",
        "Clean and dice toppings beforehand so you can swiftly put the burger together.",
        "Find a drinking glass to create a hole in the middle of the hamburger.",
        "This small hole in the middle of the burger patty is needed for placement of the egg.",
        "To make the hole, push a drinking glass into the center of the burger patty and remove the cut middle portion.",
        "Preparing the Hamburger Meat Flatten the hamburger meat.",
        "Make sure you have enough meat to not only create the entire burger but also to make a hole in the middle for the egg.",
        "Flatten the hamburger meat on top of a piece of parchment paper to avoid having it stick to the countertop.",
        "{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/47\\/Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\\/v4-459px-Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/47\\/Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\\/v4-759px-Make-a-Hamburger-Egg-Sandwich-Step-6Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nCreate a hole in the middle of the hamburger meat with the drinking glass.",
        "Spray the drinking glass rim with cooking spray (to stop it sticking to the meat) and press the rim down in the middle of the burger.",
        "Remove the glass and lift out the middle portion of the burger to create a hole.",
        "Season the patty with salt and pepper.",
        "Lightly add salt, pepper and any other desired seasonings.",
        "Cooking the Hamburger Egg Combination Place the hamburger in a heated skillet coated with cooking oil.",
        "Lift the burger from the parchment paper with a spatula in order to keep the burger shape intact.",
        "Allow the hamburger to cook for a minute.",
        "Then crack the egg and deposit it gently into the hole in the middle of the burger.",
        "Keep the egg in the middle hole and avoid spilling it over the meat.",
        "Cook the burger until it has browned on one end.",
        "Flip the burger on the other side and cook.",
        "Be careful when flipping the burger so that you don’t disturb the egg, cracking the yolk.",
        "Add a slice of cheese when the burger is almost completely cooked.",
        "If you're planning to add the cheese, make sure you do it while the meat is still in the pan.",
        "That way, it will melt and blend into the burger.",
        "Finishing the Burger Season the hamburger bun.",
        "Consider adding a topping like ketchup, butter, mayonnaise or any other desired condiment.",
        "Transfer the cooked patty to the toasted hamburger bun.",
        "Place the opened, prepared bun on a plate and carefully transfer the meat/egg combo from the skillet to the bun.",
        "Add burger toppings.",
        "Now is the time to add lettuce, tomato or other cold ingredients.",
        "You can also re-top with ketchup or additional condiments.",
        "Serve warm.",
        "This burger tastes best when transferred immediately from the pan to your mouth."
    ]
}