{
    "title": "How to Choose Organic Gardening Supplies",
    "url": "https://www.wikihow.com/Choose-Organic-Gardening-Supplies",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening"
    ],
    "methods": [
        {
            "name": "Reading Organic Certifications and Labels",
            "steps": [
                {
                    "headline": "Research your country’s organic certification organizations.",
                    "description": "Your country may have more than one organization that evaluates the organic content of gardening products. Do some research on these organizations and their standards for certification. In the U.S., organic products may be certified through the USDA National Organic Program (NOP). Independent organizations like OMRI (Organic Materials Review Institute) also evaluate and certify a variety of organic products. In Canada, the Canadian Food Inspection Agency (CIFA) regulates organic products. Third-party organizations such as Ecocert also evaluate sustainable products that can be used for organic growing. In the UK, organic certification is regulated by the Department for Environment, Food, and Rural Affairs (DEFRA). 9 approved evaluating bodies can issue organic certifications. The largest of these are Organic Farmers and Growers and the Soil Association."
                },
                {
                    "headline": "Check the packaging for an organic label.",
                    "description": "When selecting organic products, check the packaging carefully. Even if the product claims to be “organic” or “all natural,” look for a logo or label from a certifying organization such as USDA, OMRI, or Ecocert. The product must meet certain production standards or have a certain percentage of organic content in order to bear these labels. For example, in the U.S., a product must contain at least 95% organic ingredients to legally bear the USDA Organic seal."
                },
                {
                    "headline": "Evaluate the label to determine how much of the content is organic.",
                    "description": "Products labeled “organic” are not necessarily made with 100% organic ingredients. Check the details on the label to be sure. For example, in the U.S.:\nA 100% organic product can be labeled “100 Percent Organic” and/or display the USDA Organic seal. This percentage does not include salt and water. A product can be labeled simply “Organic” as long as it contains at least 95% organic ingredients (not including salt and water). It may also be labeled with the USDA Organic seal. If a product contains at least 70% organic ingredients (excluding salt and water), it can be labeled “Made with organic ingredients” (or similar), but it cannot bear the USDA Organic seal. All organic ingredients must be marked on the ingredient list (e.g., with a *), regardless of the overall percentage of organic content in the product."
                }
            ]
        },
        {
            "name": "Selecting Organic Soils and Fertilizers",
            "steps": [
                {
                    "headline": "Test your soil’s nutrients and pH levels.",
                    "description": "Before buying soil and fertilizer, get a home soil testing kit or take a sample of your soil to a soil lab or garden center for testing. Once you know your soil’s pH (how acidic or alkaline it is) and nutrient content, you will have an easier time choosing plants and amending your soil, if you need to. Most plants prefer a slightly acidic to neutral soil pH of around 6-7. However, some plants, such as azaleas, blueberries, and potatoes, prefer more acidic soils. Research the soil pH needs of the plants you wish to grow. At minimum, all plants need nitrogen (N), phosphorous (P), and potassium (K) to thrive. They also benefit from a variety of other nutrients and trace elements in the soil. Get a testing kit that checks for a range of soil nutrients, or send your soil to a lab that will do a thorough nutrient analysis."
                },
                {
                    "headline": "Purchase organic soil, if necessary.",
                    "description": "If your soil is of very poor quality or will not support the kinds of plants you wish to grow, you can purchase organic gardening soil from a garden center or online retailer. Look for soil that is labeled “Organic” or labeled with an organic certification logo. Organic soil mixes should contain organic matter (such as compost, peat moss, or worm castings) that can encourage microbial activity and provide nutrients for your plants. Most pre-packaged gardening soil is designed to be either used in containers or mixed in with your pre-existing soil. Follow the instructions on the label carefully."
                },
                {
                    "headline": "Amend your soil’s pH with organic materials, if you need to.",
                    "description": "If testing reveals that your soil’s pH is too low or too high for the plants you’re interested in growing, you can add organic materials to the soil to change the pH. For example:\nYou can lower the pH of your soil with sphagnum peat or organic mulch. Raise the pH of your soil with calcium-rich oyster or clam shells, shell marl, dolomite, gypsum, or wood ash. It is preferable to to choose plants that are suited to your native soil rather than trying to amend it."
                },
                {
                    "headline": "Enrich your soil with organic compost.",
                    "description": "Compost encourages healthy microbial activity in your soil and offers nutrients to your plants. When done properly, composting can destroy weed seeds in manure and other organic fertilizers. You can make your own compost in your yard from kitchen scraps, or buy organic compost from a garden center or organic farm in your area. If you buy compost, avoid anything containing “biosolids,” which may include human waste and synthetic chemical pollutants. If you choose to make your own compost, include things like fruit and vegetable scraps, healthy lawn clippings, eggshells, and sawdust from untreated wood. If you want to reduce the potential concentrations of pesticides or other unwanted compounds as much as possible, only use organic food scraps in your compost. Do not attempt to compost with meat, fat, dairy products, leaves or wood from diseased plants, sawdust or wood chips from treated wood, or pet waste."
                },
                {
                    "headline": "Feed your plants with organic fertilizers.",
                    "description": "Organic fertilizers come in both liquid and dry forms. Select your fertilizers based on the needs of your plants and any nutritional deficiencies in your soil. If your soil needs more nitrogen, use urea, feathers, blood meal, bat guano, or composted manure. For a phosphorous boost, apply rock phosphate, bone meal, or colloidal phosphate. Add more potassium to your soil with kelp, wood ash, granite meal, or greensand. You can also buy organic fertilizer blends with different combinations of nutrients. Read the package directions carefully to determine how much fertilizer to apply, and how frequently to apply it."
                },
                {
                    "headline": "Retest your soil a year after making amendments.",
                    "description": "It can take time for soil amendments to take effect. It’s a good idea to retest your soil occasionally to make sure that any deficiencies or problems have been corrected. If you’ve had to make major changes to your soil’s pH or nutrient levels, recheck your soil about a year after making the initial amendments. Even if you didn’t have to make any major changes, keep an eye on the condition of your soil by testing pH and nutrient levels every 3 years."
                }
            ]
        },
        {
            "name": "Buying Organic Plants and Seeds",
            "steps": [
                {
                    "headline": "Look for seed packets bearing an organic certification seal.",
                    "description": "Seeds from organically grown plants are available in most nurseries and garden supply centers. Check the package carefully for a seal from one of your country’s organic certification organizations. For example, if you are in the U.S., look for the “USDA Organic” seal on the seed packet."
                },
                {
                    "headline": "Get organically grown potted plants.",
                    "description": "If you’d rather not grow from seed, you can also purchase established, organically grown plants for your home or garden. Several major seed companies sell certified non-GMO organic plants through mail-order catalogs or through nurseries and garden supply centers. When purchasing plants, look for an organic certification seal on the plant’s label or container. If you're not sure whether a plant you're interested in was organically grown, ask the retailer."
                },
                {
                    "headline": "Buy plants and seeds directly from local suppliers.",
                    "description": "One of the best ways to get organic seeds and plants is to buy locally from a supplier who uses organic growing practices. Do a search for “certified organic seed supplier near me.”\nCheck the supplier’s website for information about their certifications, or call them and ask about their certification status. For example, in the U.S., find out if the supplier is certified through the USDA National Organic Program or OMRI."
                }
            ]
        },
        {
            "name": "Using Sustainable Gardening Practices",
            "steps": [
                {
                    "headline": "Control pests with organic pesticides, traps, and beneficial bugs.",
                    "description": "Plant-eating bugs and other pests are a common problem in gardens, but you don’t have to resort to harsh chemical pesticides to deal with them. Try some of the following gentle methods to repel or eliminate pests:\nSpray infested plants with a combination of water and a mild dish detergent. Use 1 tablespoon (15 ml) of detergent per gallon (3.8 l) of water. Set out beer traps to catch plant-munching snails and slugs. Buy a certified organic pesticide spray from your local garden center. Introduce ladybugs, praying mantises, and other pest-eating bugs into your garden. You can attract them naturally with wildflowers (such as daisies and Queen Anne’s lace) or purchase them at your garden supply store."
                },
                {
                    "headline": "Kill weeds naturally with mulch or organic weed killer.",
                    "description": "Instead of using harsh weed killers that can hurt the desirable plants in your garden and contaminate the environment, try a gentler, more environmentally friendly method. For example, you might:\nSpread a thin layer of newspaper, cardboard, or biodegradable cloth over your planting area, then cover it with 2-4 inches (5-10 cm) of organic mulch to smother weeds and insulate desirable plants. Spray weeds directly with a mixture of white vinegar and dish soap. Purchase an organic weed killer from your local garden center or home supply store. Most of these weed killers are made with natural plant oils, such as neem oil or citrus oil."
                },
                {
                    "headline": "Buy environmentally friendly garden tools.",
                    "description": "In addition to your plants, fertilizers, and pest control supplies, also consider the environmental impact of your tools. Look for products that are reusable, biodegradable, or made from recycled materials. Opt for tools that are mechanical instead of motorized, when you can. For example, you might use:\nTrellises, brooms, and other garden accessories made of sustainable bamboo. Biodegradable planters that can go straight into the ground during planting. Watering cans and other tools made of recycled plastic or other post-consumer recycled materials. Old-fashioned push reel mowers or scythes instead of motorized mowers and weed-whackers. Flea markets, second-hand stores or garage sales are good places to find used gardening tools."
                },
                {
                    "headline": "Water your plants with collected rainwater, if possible.",
                    "description": "Save water and avoid introducing water-treatment chemicals into your garden by collecting water directly from the skies. The easiest way to do this is to connect a rainwater diverter and rain barrel to the drainpipe on your roof. The diverter can send water to 1 or more linked collection barrels. You can buy rain barrels, diverters, and barrel linking kits at most home and garden supply centers. You can also make your own rain barrel. Alternatively, you can make a rain garden, a garden planted in a shallow depression that catches rain water directly from roof gutters, downspouts, or your property’s natural runoff pathways."
                }
            ]
        }
    ],
    "tyn": [
        "Selecting Organic Soils and Fertilizers",
        "Soil samples from your garden",
        "Soil pH and nutrient test kit",
        "Organic garden soil",
        "Organic mulch or sphagnum peat (to lower soil pH)",
        "Clam or oyster shells, shell marl, dolomite, gypsum, or wood ash (to raise soil pH)",
        "Organic composting materials, such as fruit and vegetable scraps, eggshells, lawn clippings, and untreated wood chips",
        "Urea, feathers, blood meal, bat guano, or dried blood (to raise nitrogen levels in your soil)",
        "Rock phosphate, bone meal, or colloidal phosphate (to raise phosphorous levels in your soil)",
        "Kelp, wood ash, granite meal, or greensand (to raise potassium levels in your soil)",
        "Buying Organic Plants and Seeds",
        "Seed packets with an organic certification seal",
        "Potted plants with organic certification labels",
        "Using Sustainable Gardening Practices",
        "Mild dish detergent and water",
        "Beer, yeast, and plastic cups or bottles",
        "Organic pesticide spray",
        "Beneficial garden bugs, such as ladybugs or praying mantises",
        "Newspaper, cardboard, or biodegradable cloth",
        "Organic mulch",
        "White vinegar and dish soap",
        "Organic weed killer (neem oil or citrus oil)",
        "Bamboo garden tools",
        "Biodegradable planters",
        "Garden tools made from recycled materials",
        "Push-reel mower",
        "Rain barrel(s)",
        "Drain pipe diverters"
    ],
    "text": " Reading Organic Certifications and Labels Research your country’s organic certification organizations. Your country may have more than one organization that evaluates the organic content of gardening products. Do some research on these organizations and their standards for certification. In the U.S., organic products may be certified through the USDA National Organic Program (NOP). Independent organizations like OMRI (Organic Materials Review Institute) also evaluate and certify a variety of organic products. In Canada, the Canadian Food Inspection Agency (CIFA) regulates organic products. Third-party organizations such as Ecocert also evaluate sustainable products that can be used for organic growing. In the UK, organic certification is regulated by the Department for Environment, Food, and Rural Affairs (DEFRA). 9 approved evaluating bodies can issue organic certifications. The largest of these are Organic Farmers and Growers and the Soil Association. Check the packaging for an organic label. When selecting organic products, check the packaging carefully. Even if the product claims to be “organic” or “all natural,” look for a logo or label from a certifying organization such as USDA, OMRI, or Ecocert. The product must meet certain production standards or have a certain percentage of organic content in order to bear these labels. For example, in the U.S., a product must contain at least 95% organic ingredients to legally bear the USDA Organic seal. Evaluate the label to determine how much of the content is organic. Products labeled “organic” are not necessarily made with 100% organic ingredients. Check the details on the label to be sure. For example, in the U.S.:\nA 100% organic product can be labeled “100 Percent Organic” and/or display the USDA Organic seal. This percentage does not include salt and water. A product can be labeled simply “Organic” as long as it contains at least 95% organic ingredients (not including salt and water). It may also be labeled with the USDA Organic seal. If a product contains at least 70% organic ingredients (excluding salt and water), it can be labeled “Made with organic ingredients” (or similar), but it cannot bear the USDA Organic seal. All organic ingredients must be marked on the ingredient list (e.g., with a *), regardless of the overall percentage of organic content in the product. Selecting Organic Soils and Fertilizers Test your soil’s nutrients and pH levels. Before buying soil and fertilizer, get a home soil testing kit or take a sample of your soil to a soil lab or garden center for testing. Once you know your soil’s pH (how acidic or alkaline it is) and nutrient content, you will have an easier time choosing plants and amending your soil, if you need to. Most plants prefer a slightly acidic to neutral soil pH of around 6-7. However, some plants, such as azaleas, blueberries, and potatoes, prefer more acidic soils. Research the soil pH needs of the plants you wish to grow. At minimum, all plants need nitrogen (N), phosphorous (P), and potassium (K) to thrive. They also benefit from a variety of other nutrients and trace elements in the soil. Get a testing kit that checks for a range of soil nutrients, or send your soil to a lab that will do a thorough nutrient analysis. Purchase organic soil, if necessary. If your soil is of very poor quality or will not support the kinds of plants you wish to grow, you can purchase organic gardening soil from a garden center or online retailer. Look for soil that is labeled “Organic” or labeled with an organic certification logo. Organic soil mixes should contain organic matter (such as compost, peat moss, or worm castings) that can encourage microbial activity and provide nutrients for your plants. Most pre-packaged gardening soil is designed to be either used in containers or mixed in with your pre-existing soil. Follow the instructions on the label carefully. Amend your soil’s pH with organic materials, if you need to. If testing reveals that your soil’s pH is too low or too high for the plants you’re interested in growing, you can add organic materials to the soil to change the pH. For example:\nYou can lower the pH of your soil with sphagnum peat or organic mulch. Raise the pH of your soil with calcium-rich oyster or clam shells, shell marl, dolomite, gypsum, or wood ash. It is preferable to to choose plants that are suited to your native soil rather than trying to amend it. Enrich your soil with organic compost. Compost encourages healthy microbial activity in your soil and offers nutrients to your plants. When done properly, composting can destroy weed seeds in manure and other organic fertilizers. You can make your own compost in your yard from kitchen scraps, or buy organic compost from a garden center or organic farm in your area. If you buy compost, avoid anything containing “biosolids,” which may include human waste and synthetic chemical pollutants. If you choose to make your own compost, include things like fruit and vegetable scraps, healthy lawn clippings, eggshells, and sawdust from untreated wood. If you want to reduce the potential concentrations of pesticides or other unwanted compounds as much as possible, only use organic food scraps in your compost. Do not attempt to compost with meat, fat, dairy products, leaves or wood from diseased plants, sawdust or wood chips from treated wood, or pet waste. Feed your plants with organic fertilizers. Organic fertilizers come in both liquid and dry forms. Select your fertilizers based on the needs of your plants and any nutritional deficiencies in your soil. If your soil needs more nitrogen, use urea, feathers, blood meal, bat guano, or composted manure. For a phosphorous boost, apply rock phosphate, bone meal, or colloidal phosphate. Add more potassium to your soil with kelp, wood ash, granite meal, or greensand. You can also buy organic fertilizer blends with different combinations of nutrients. Read the package directions carefully to determine how much fertilizer to apply, and how frequently to apply it. Retest your soil a year after making amendments. It can take time for soil amendments to take effect. It’s a good idea to retest your soil occasionally to make sure that any deficiencies or problems have been corrected. If you’ve had to make major changes to your soil’s pH or nutrient levels, recheck your soil about a year after making the initial amendments. Even if you didn’t have to make any major changes, keep an eye on the condition of your soil by testing pH and nutrient levels every 3 years. Buying Organic Plants and Seeds Look for seed packets bearing an organic certification seal. Seeds from organically grown plants are available in most nurseries and garden supply centers. Check the package carefully for a seal from one of your country’s organic certification organizations. For example, if you are in the U.S., look for the “USDA Organic” seal on the seed packet. Get organically grown potted plants. If you’d rather not grow from seed, you can also purchase established, organically grown plants for your home or garden. Several major seed companies sell certified non-GMO organic plants through mail-order catalogs or through nurseries and garden supply centers. When purchasing plants, look for an organic certification seal on the plant’s label or container. If you're not sure whether a plant you're interested in was organically grown, ask the retailer. Buy plants and seeds directly from local suppliers. One of the best ways to get organic seeds and plants is to buy locally from a supplier who uses organic growing practices. Do a search for “certified organic seed supplier near me.”\nCheck the supplier’s website for information about their certifications, or call them and ask about their certification status. For example, in the U.S., find out if the supplier is certified through the USDA National Organic Program or OMRI. Using Sustainable Gardening Practices Control pests with organic pesticides, traps, and beneficial bugs. Plant-eating bugs and other pests are a common problem in gardens, but you don’t have to resort to harsh chemical pesticides to deal with them. Try some of the following gentle methods to repel or eliminate pests:\nSpray infested plants with a combination of water and a mild dish detergent. Use 1 tablespoon (15 ml) of detergent per gallon (3.8 l) of water. Set out beer traps to catch plant-munching snails and slugs. Buy a certified organic pesticide spray from your local garden center. Introduce ladybugs, praying mantises, and other pest-eating bugs into your garden. You can attract them naturally with wildflowers (such as daisies and Queen Anne’s lace) or purchase them at your garden supply store. Kill weeds naturally with mulch or organic weed killer. Instead of using harsh weed killers that can hurt the desirable plants in your garden and contaminate the environment, try a gentler, more environmentally friendly method. For example, you might:\nSpread a thin layer of newspaper, cardboard, or biodegradable cloth over your planting area, then cover it with 2-4 inches (5-10 cm) of organic mulch to smother weeds and insulate desirable plants. Spray weeds directly with a mixture of white vinegar and dish soap. Purchase an organic weed killer from your local garden center or home supply store. Most of these weed killers are made with natural plant oils, such as neem oil or citrus oil. Buy environmentally friendly garden tools. In addition to your plants, fertilizers, and pest control supplies, also consider the environmental impact of your tools. Look for products that are reusable, biodegradable, or made from recycled materials. Opt for tools that are mechanical instead of motorized, when you can. For example, you might use:\nTrellises, brooms, and other garden accessories made of sustainable bamboo. Biodegradable planters that can go straight into the ground during planting. Watering cans and other tools made of recycled plastic or other post-consumer recycled materials. Old-fashioned push reel mowers or scythes instead of motorized mowers and weed-whackers. Flea markets, second-hand stores or garage sales are good places to find used gardening tools. Water your plants with collected rainwater, if possible. Save water and avoid introducing water-treatment chemicals into your garden by collecting water directly from the skies. The easiest way to do this is to connect a rainwater diverter and rain barrel to the drainpipe on your roof. The diverter can send water to 1 or more linked collection barrels. You can buy rain barrels, diverters, and barrel linking kits at most home and garden supply centers. You can also make your own rain barrel. Alternatively, you can make a rain garden, a garden planted in a shallow depression that catches rain water directly from roof gutters, downspouts, or your property’s natural runoff pathways.",
    "sentences": [
        " Reading Organic Certifications and Labels Research your country’s organic certification organizations.",
        "Your country may have more than one organization that evaluates the organic content of gardening products.",
        "Do some research on these organizations and their standards for certification.",
        "In the U.S., organic products may be certified through the USDA National Organic Program (NOP).",
        "Independent organizations like OMRI (Organic Materials Review Institute) also evaluate and certify a variety of organic products.",
        "In Canada, the Canadian Food Inspection Agency (CIFA) regulates organic products.",
        "Third-party organizations such as Ecocert also evaluate sustainable products that can be used for organic growing.",
        "In the UK, organic certification is regulated by the Department for Environment, Food, and Rural Affairs (DEFRA).",
        "9 approved evaluating bodies can issue organic certifications.",
        "The largest of these are Organic Farmers and Growers and the Soil Association.",
        "Check the packaging for an organic label.",
        "When selecting organic products, check the packaging carefully.",
        "Even if the product claims to be “organic” or “all natural,” look for a logo or label from a certifying organization such as USDA, OMRI, or Ecocert.",
        "The product must meet certain production standards or have a certain percentage of organic content in order to bear these labels.",
        "For example, in the U.S., a product must contain at least 95% organic ingredients to legally bear the USDA Organic seal.",
        "Evaluate the label to determine how much of the content is organic.",
        "Products labeled “organic” are not necessarily made with 100% organic ingredients.",
        "Check the details on the label to be sure.",
        "For example, in the U.S.:\nA 100% organic product can be labeled “100 Percent Organic” and/or display the USDA Organic seal.",
        "This percentage does not include salt and water.",
        "A product can be labeled simply “Organic” as long as it contains at least 95% organic ingredients (not including salt and water).",
        "It may also be labeled with the USDA Organic seal.",
        "If a product contains at least 70% organic ingredients (excluding salt and water), it can be labeled “Made with organic ingredients” (or similar), but it cannot bear the USDA Organic seal.",
        "All organic ingredients must be marked on the ingredient list (e.g., with a *), regardless of the overall percentage of organic content in the product.",
        "Selecting Organic Soils and Fertilizers Test your soil’s nutrients and pH levels.",
        "Before buying soil and fertilizer, get a home soil testing kit or take a sample of your soil to a soil lab or garden center for testing.",
        "Once you know your soil’s pH (how acidic or alkaline it is) and nutrient content, you will have an easier time choosing plants and amending your soil, if you need to.",
        "Most plants prefer a slightly acidic to neutral soil pH of around 6-7.",
        "However, some plants, such as azaleas, blueberries, and potatoes, prefer more acidic soils.",
        "Research the soil pH needs of the plants you wish to grow.",
        "At minimum, all plants need nitrogen (N), phosphorous (P), and potassium (K) to thrive.",
        "They also benefit from a variety of other nutrients and trace elements in the soil.",
        "Get a testing kit that checks for a range of soil nutrients, or send your soil to a lab that will do a thorough nutrient analysis.",
        "Purchase organic soil, if necessary.",
        "If your soil is of very poor quality or will not support the kinds of plants you wish to grow, you can purchase organic gardening soil from a garden center or online retailer.",
        "Look for soil that is labeled “Organic” or labeled with an organic certification logo.",
        "Organic soil mixes should contain organic matter (such as compost, peat moss, or worm castings) that can encourage microbial activity and provide nutrients for your plants.",
        "Most pre-packaged gardening soil is designed to be either used in containers or mixed in with your pre-existing soil.",
        "Follow the instructions on the label carefully.",
        "Amend your soil’s pH with organic materials, if you need to.",
        "If testing reveals that your soil’s pH is too low or too high for the plants you’re interested in growing, you can add organic materials to the soil to change the pH.",
        "For example:\nYou can lower the pH of your soil with sphagnum peat or organic mulch.",
        "Raise the pH of your soil with calcium-rich oyster or clam shells, shell marl, dolomite, gypsum, or wood ash.",
        "It is preferable to to choose plants that are suited to your native soil rather than trying to amend it.",
        "Enrich your soil with organic compost.",
        "Compost encourages healthy microbial activity in your soil and offers nutrients to your plants.",
        "When done properly, composting can destroy weed seeds in manure and other organic fertilizers.",
        "You can make your own compost in your yard from kitchen scraps, or buy organic compost from a garden center or organic farm in your area.",
        "If you buy compost, avoid anything containing “biosolids,” which may include human waste and synthetic chemical pollutants.",
        "If you choose to make your own compost, include things like fruit and vegetable scraps, healthy lawn clippings, eggshells, and sawdust from untreated wood.",
        "If you want to reduce the potential concentrations of pesticides or other unwanted compounds as much as possible, only use organic food scraps in your compost.",
        "Do not attempt to compost with meat, fat, dairy products, leaves or wood from diseased plants, sawdust or wood chips from treated wood, or pet waste.",
        "Feed your plants with organic fertilizers.",
        "Organic fertilizers come in both liquid and dry forms.",
        "Select your fertilizers based on the needs of your plants and any nutritional deficiencies in your soil.",
        "If your soil needs more nitrogen, use urea, feathers, blood meal, bat guano, or composted manure.",
        "For a phosphorous boost, apply rock phosphate, bone meal, or colloidal phosphate.",
        "Add more potassium to your soil with kelp, wood ash, granite meal, or greensand.",
        "You can also buy organic fertilizer blends with different combinations of nutrients.",
        "Read the package directions carefully to determine how much fertilizer to apply, and how frequently to apply it.",
        "Retest your soil a year after making amendments.",
        "It can take time for soil amendments to take effect.",
        "It’s a good idea to retest your soil occasionally to make sure that any deficiencies or problems have been corrected.",
        "If you’ve had to make major changes to your soil’s pH or nutrient levels, recheck your soil about a year after making the initial amendments.",
        "Even if you didn’t have to make any major changes, keep an eye on the condition of your soil by testing pH and nutrient levels every 3 years.",
        "Buying Organic Plants and Seeds Look for seed packets bearing an organic certification seal.",
        "Seeds from organically grown plants are available in most nurseries and garden supply centers.",
        "Check the package carefully for a seal from one of your country’s organic certification organizations.",
        "For example, if you are in the U.S., look for the “USDA Organic” seal on the seed packet.",
        "Get organically grown potted plants.",
        "If you’d rather not grow from seed, you can also purchase established, organically grown plants for your home or garden.",
        "Several major seed companies sell certified non-GMO organic plants through mail-order catalogs or through nurseries and garden supply centers.",
        "When purchasing plants, look for an organic certification seal on the plant’s label or container.",
        "If you're not sure whether a plant you're interested in was organically grown, ask the retailer.",
        "Buy plants and seeds directly from local suppliers.",
        "One of the best ways to get organic seeds and plants is to buy locally from a supplier who uses organic growing practices.",
        "Do a search for “certified organic seed supplier near me.”\nCheck the supplier’s website for information about their certifications, or call them and ask about their certification status.",
        "For example, in the U.S., find out if the supplier is certified through the USDA National Organic Program or OMRI.",
        "Using Sustainable Gardening Practices Control pests with organic pesticides, traps, and beneficial bugs.",
        "Plant-eating bugs and other pests are a common problem in gardens, but you don’t have to resort to harsh chemical pesticides to deal with them.",
        "Try some of the following gentle methods to repel or eliminate pests:\nSpray infested plants with a combination of water and a mild dish detergent.",
        "Use 1 tablespoon (15 ml) of detergent per gallon (3.8 l) of water.",
        "Set out beer traps to catch plant-munching snails and slugs.",
        "Buy a certified organic pesticide spray from your local garden center.",
        "Introduce ladybugs, praying mantises, and other pest-eating bugs into your garden.",
        "You can attract them naturally with wildflowers (such as daisies and Queen Anne’s lace) or purchase them at your garden supply store.",
        "Kill weeds naturally with mulch or organic weed killer.",
        "Instead of using harsh weed killers that can hurt the desirable plants in your garden and contaminate the environment, try a gentler, more environmentally friendly method.",
        "For example, you might:\nSpread a thin layer of newspaper, cardboard, or biodegradable cloth over your planting area, then cover it with 2-4 inches (5-10 cm) of organic mulch to smother weeds and insulate desirable plants.",
        "Spray weeds directly with a mixture of white vinegar and dish soap.",
        "Purchase an organic weed killer from your local garden center or home supply store.",
        "Most of these weed killers are made with natural plant oils, such as neem oil or citrus oil.",
        "Buy environmentally friendly garden tools.",
        "In addition to your plants, fertilizers, and pest control supplies, also consider the environmental impact of your tools.",
        "Look for products that are reusable, biodegradable, or made from recycled materials.",
        "Opt for tools that are mechanical instead of motorized, when you can.",
        "For example, you might use:\nTrellises, brooms, and other garden accessories made of sustainable bamboo.",
        "Biodegradable planters that can go straight into the ground during planting.",
        "Watering cans and other tools made of recycled plastic or other post-consumer recycled materials.",
        "Old-fashioned push reel mowers or scythes instead of motorized mowers and weed-whackers.",
        "Flea markets, second-hand stores or garage sales are good places to find used gardening tools.",
        "Water your plants with collected rainwater, if possible.",
        "Save water and avoid introducing water-treatment chemicals into your garden by collecting water directly from the skies.",
        "The easiest way to do this is to connect a rainwater diverter and rain barrel to the drainpipe on your roof.",
        "The diverter can send water to 1 or more linked collection barrels.",
        "You can buy rain barrels, diverters, and barrel linking kits at most home and garden supply centers.",
        "You can also make your own rain barrel.",
        "Alternatively, you can make a rain garden, a garden planted in a shallow depression that catches rain water directly from roof gutters, downspouts, or your property’s natural runoff pathways."
    ]
}