{
    "title": "How to Do a Backbend",
    "url": "https://www.wikihow.com/Do-a-Backbend",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Gymnastics"
    ],
    "parts": [
        {
            "name": "Stretching and Warming Up",
            "steps": [
                {
                    "headline": "Warm up your muscles by jogging, jumping rope or doing jumping jacks.",
                    "description": "Get your blood flowing and your muscles warm to start stretching out."
                },
                {
                    "headline": "Lay out a mat, or find some soft ground.",
                    "description": "Use a yoga or gymnastics mat or a mattress, or clear an area on a soft carpet or rug. Make sure your area is clear of any tripping hazards."
                },
                {
                    "headline": "Stretch your ankles.",
                    "description": "Flex your foot as far back as you can, so the toes are pointing up in the air. Then point your foot down, so the toes are parallel to the floor or, if you’re more flexible, angled slightly towards it. Repeat 10-20 times, then switch feet. Roll out your ankles by sitting and holding an ankle in one hand. Roll your foot in circles several times, then switch feet."
                },
                {
                    "headline": "Do a wrist extensor stretch.",
                    "description": "Extend your arm with your palm facing upwards and elbow straight. Pull your hand down with your other hand. Hold for ten seconds, then repeat with your other wrist. Your wrists will be bending and bearing a lot of your weight in a backbend, so make sure you stretch them well."
                },
                {
                    "headline": "Do a wrist flexor stretch.",
                    "description": "Extend one wrist in front of you with your palm facing away and your fingertips up. Pull your fingers back with your other hand until you feel a nice stretch. Hold for ten seconds and repeat with the other hand."
                },
                {
                    "headline": "Do a cat cow pose.",
                    "description": "This simple yoga pose will open up your chest and back and get you ready for more intense stretches. Start on your hands and knees with your wrists directly below your shoulders. Inhale and drop your belly towards the mat, arching your spine. Exhale and draw your belly into your spine, rounding your back. Repeat 10-15 times."
                },
                {
                    "headline": "Try some deeper yoga poses.",
                    "description": "Get into cobra position by lying with your belly on the floor, placing your hands under your armpits and pushing up, arching your spine and stretching your chest. Try a camel pose by kneeling, placing your hands on your lower back and arching your spine back. If you’re more flexible, give the bow pose a try."
                }
            ]
        },
        {
            "name": "Doing a Bridge",
            "steps": [
                {
                    "headline": "Lie on your back and bend your legs up.",
                    "description": "Place your feet close together on the floor and bend your legs so that your knees are sticking straight up off the ground."
                },
                {
                    "headline": "Place your hands by your head.",
                    "description": "Your fingertips should be pointing towards your shoulders and your palms pushed flat against the floor with your elbows pointing up in the air."
                },
                {
                    "headline": "Push through your shoulders and lift your body.",
                    "description": "Straighten your arms as much as you can. Focus on keeping your core, legs and butt muscles tight. It’s okay if you can’t lift far off the ground yet, or if you need to keep your arms bent. Practice your bridges a couple times a day and you’ll feel yourself grow stronger."
                },
                {
                    "headline": "Lift only your hips off the ground if you can’t push all the way up.",
                    "description": "From your position laying on the floor, place your arms down at your sides. Squeeze your butt and core to lift your hips off the ground."
                },
                {
                    "headline": "Hold the pose for a few seconds, then lower yourself down.",
                    "description": "Bend your arms and slowly lower your body until you’re lying flat on the ground. Give yourself a short rest, then repeat 2-3 more times."
                }
            ]
        },
        {
            "name": "Practicing a Backbend Against a Wall",
            "steps": [
                {
                    "headline": "Take one to two steps away from a blank wall.",
                    "description": "Place your feet about shoulder-width apart from each other."
                },
                {
                    "headline": "Place your palms against your buttocks and push your hips forward.",
                    "description": "Lift and elongate your spine and rib cage. This will allow your spine to stretch out and arch more cleanly."
                },
                {
                    "headline": "Stretch your arms straight up above your head and tilt your head back.",
                    "description": "Reach back far enough with your neck and back so that you can look at the wall."
                },
                {
                    "headline": "Bend your back and place your palms against the wall.",
                    "description": "Keep your elbows straight, your head tipped back and your neck long. Press your hands against the wall. Remember to keep breathing!"
                },
                {
                    "headline": "Walk down as far as you can.",
                    "description": "Continue to keep your elbows straight and breathe evenly."
                },
                {
                    "headline": "Walk your arms back up the wall and straighten from your hips.",
                    "description": "Inhale as you come back to standing. Take your time and lift your head slowly."
                },
                {
                    "headline": "Fall forward gently and touch your toes to stretch out.",
                    "description": "Exhale and bend smoothly from your hips, allowing your back to relax. Take a couple of deep breaths. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRosalind Lutsky\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFormer Gymnastics Coach\t\t\t\t\t\t\t\tRosalind Lutsky worked as a gymnastics coach at SB Gymnastics at Stanford University, coaching children from ages 5-12 years old during her time as a Stanford student. She was a competitive gymnast growing up, and competed for her local gymnastics team in Minnesota. Rosalind Lutsky\t\t\tFormer Gymnastics Coach\t\t\t\tRosalind Lutsky, former gymnastics coach, adds: “One good way to stretch out your back after a bridge is to sit on the floor, hold your knees in your hands, and rock back and forth in a ball.”"
                },
                {
                    "headline": "Step farther from the wall and repeat.",
                    "description": "Placing more room between you and the wall will force you to bend back a little further each time without the wall to support you, getting you closer to a full backbend. Challenge yourself to walk down a little further each time, keeping your elbows straight and breathing evenly."
                }
            ]
        },
        {
            "name": "Doing a Full Backbend",
            "steps": [
                {
                    "headline": "Do a backbend with a spotter supporting your back.",
                    "description": "Ask a friend or parents to place one hand on your lower back and one hand on your stomach. Using the same technique as your wall backbend (minus the wall! ), slowly lower into a backbend with your spotter supporting you. EXPERT TIP\tIt can help to put an elevated mat down on the ground after you graduate from practicing against a wall. Rosalind Lutsky\t\t\t\t\tFormer Gymnastics Coach\t\t\t\t\t\t\t\tRosalind Lutsky worked as a gymnastics coach at SB Gymnastics at Stanford University, coaching children from ages 5-12 years old during her time as a Stanford student. She was a competitive gymnast growing up, and competed for her local gymnastics team in Minnesota. Rosalind LutskyFormer Gymnastics Coach"
                },
                {
                    "headline": "Have your spotter lift you back up.",
                    "description": "Ask them to move both hands to your lower back and slowly raise you back to standing."
                },
                {
                    "headline": "Try a full backbend without a spotter.",
                    "description": "Once you feel comfortable doing a backbend with a spotter, try it on your own. Lift your pelvis and ribs and keep your arms bent and strong behind your head. Keep your feet about shoulder-width apart. As you lower down, look through your arms to spot the floor."
                },
                {
                    "headline": "Breathe evenly and listen to your body.",
                    "description": "If you can’t go down all the way today, take a break and try again later. Take your time and remember the technique you perfected using the wall. If you’re nervous about trying your backbend the first time, place some pillows under your back so you know you have something soft to land on if you fall."
                }
            ]
        },
        {
            "name": "Standing from Your Backbend",
            "steps": [
                {
                    "headline": "Rock back and forth to introduce the movement.",
                    "description": "Push from your hands and roll forward into your toes, then back onto your heels while keeping your head and neck relaxed. As you get more comfortable, peel your hands just slightly off the floor as you rock, which will introduce the lifting motion to your body."
                },
                {
                    "headline": "Tuck your chin against your chest.",
                    "description": "Focus your weight and power in your lower body and core."
                },
                {
                    "headline": "Thrust up with your chest as you rock forward into your feet.",
                    "description": "Let your hands lift from the ground and slowly push yourself up into a standing position. Focus on using your core and quads to stabilize your body. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRosalind Lutsky\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFormer Gymnastics Coach\t\t\t\t\t\t\t\tRosalind Lutsky worked as a gymnastics coach at SB Gymnastics at Stanford University, coaching children from ages 5-12 years old during her time as a Stanford student. She was a competitive gymnast growing up, and competed for her local gymnastics team in Minnesota. Rosalind Lutsky\t\t\tFormer Gymnastics Coach\t\t\t\tRosalind Lutsky, former gymnastics coach, advises: “If you don’t feel comfortable pushing yourself up, it's fine to let yourself down to the ground slowly and lay down. You could even try kicking over if you're feeling confident or have a spotter, as long as you have plenty of space behind you.”"
                }
            ]
        }
    ],
    "tyn": [
        "A spotter",
        "A blank wall",
        "Mattress or yoga mat, or a soft ground surface",
        "[28]",
        "X",
        "Expert Source",
        "Tanya BerensonGymnastics Instructor",
        "Tanya Berenson",
        "Gymnastics Instructor",
        "Expert Interview.  22 May 2020."
    ],
    "text": " Stretching and Warming Up Warm up your muscles by jogging, jumping rope or doing jumping jacks. Get your blood flowing and your muscles warm to start stretching out. Lay out a mat, or find some soft ground. Use a yoga or gymnastics mat or a mattress, or clear an area on a soft carpet or rug. Make sure your area is clear of any tripping hazards. Stretch your ankles. Flex your foot as far back as you can, so the toes are pointing up in the air. Then point your foot down, so the toes are parallel to the floor or, if you’re more flexible, angled slightly towards it. Repeat 10-20 times, then switch feet. Roll out your ankles by sitting and holding an ankle in one hand. Roll your foot in circles several times, then switch feet. Do a wrist extensor stretch. Extend your arm with your palm facing upwards and elbow straight. Pull your hand down with your other hand. Hold for ten seconds, then repeat with your other wrist. Your wrists will be bending and bearing a lot of your weight in a backbend, so make sure you stretch them well. Do a wrist flexor stretch. Extend one wrist in front of you with your palm facing away and your fingertips up. Pull your fingers back with your other hand until you feel a nice stretch. Hold for ten seconds and repeat with the other hand. Do a cat cow pose. This simple yoga pose will open up your chest and back and get you ready for more intense stretches. Start on your hands and knees with your wrists directly below your shoulders. Inhale and drop your belly towards the mat, arching your spine. Exhale and draw your belly into your spine, rounding your back. Repeat 10-15 times. Try some deeper yoga poses. Get into cobra position by lying with your belly on the floor, placing your hands under your armpits and pushing up, arching your spine and stretching your chest. Try a camel pose by kneeling, placing your hands on your lower back and arching your spine back. If you’re more flexible, give the bow pose a try. Doing a Bridge Lie on your back and bend your legs up. Place your feet close together on the floor and bend your legs so that your knees are sticking straight up off the ground. Place your hands by your head. Your fingertips should be pointing towards your shoulders and your palms pushed flat against the floor with your elbows pointing up in the air. Push through your shoulders and lift your body. Straighten your arms as much as you can. Focus on keeping your core, legs and butt muscles tight. It’s okay if you can’t lift far off the ground yet, or if you need to keep your arms bent. Practice your bridges a couple times a day and you’ll feel yourself grow stronger. Lift only your hips off the ground if you can’t push all the way up. From your position laying on the floor, place your arms down at your sides. Squeeze your butt and core to lift your hips off the ground. Hold the pose for a few seconds, then lower yourself down. Bend your arms and slowly lower your body until you’re lying flat on the ground. Give yourself a short rest, then repeat 2-3 more times. Practicing a Backbend Against a Wall Take one to two steps away from a blank wall. Place your feet about shoulder-width apart from each other. Place your palms against your buttocks and push your hips forward. Lift and elongate your spine and rib cage. This will allow your spine to stretch out and arch more cleanly. Stretch your arms straight up above your head and tilt your head back. Reach back far enough with your neck and back so that you can look at the wall. Bend your back and place your palms against the wall. Keep your elbows straight, your head tipped back and your neck long. Press your hands against the wall. Remember to keep breathing! Walk down as far as you can. Continue to keep your elbows straight and breathe evenly. Walk your arms back up the wall and straighten from your hips. Inhale as you come back to standing. Take your time and lift your head slowly. Fall forward gently and touch your toes to stretch out. Exhale and bend smoothly from your hips, allowing your back to relax. Take a couple of deep breaths. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRosalind Lutsky\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFormer Gymnastics Coach\t\t\t\t\t\t\t\tRosalind Lutsky worked as a gymnastics coach at SB Gymnastics at Stanford University, coaching children from ages 5-12 years old during her time as a Stanford student. She was a competitive gymnast growing up, and competed for her local gymnastics team in Minnesota. Rosalind Lutsky\t\t\tFormer Gymnastics Coach\t\t\t\tRosalind Lutsky, former gymnastics coach, adds: “One good way to stretch out your back after a bridge is to sit on the floor, hold your knees in your hands, and rock back and forth in a ball.” Step farther from the wall and repeat. Placing more room between you and the wall will force you to bend back a little further each time without the wall to support you, getting you closer to a full backbend. Challenge yourself to walk down a little further each time, keeping your elbows straight and breathing evenly. Doing a Full Backbend Do a backbend with a spotter supporting your back. Ask a friend or parents to place one hand on your lower back and one hand on your stomach. Using the same technique as your wall backbend (minus the wall! ), slowly lower into a backbend with your spotter supporting you. EXPERT TIP\tIt can help to put an elevated mat down on the ground after you graduate from practicing against a wall. Rosalind Lutsky\t\t\t\t\tFormer Gymnastics Coach\t\t\t\t\t\t\t\tRosalind Lutsky worked as a gymnastics coach at SB Gymnastics at Stanford University, coaching children from ages 5-12 years old during her time as a Stanford student. She was a competitive gymnast growing up, and competed for her local gymnastics team in Minnesota. Rosalind LutskyFormer Gymnastics Coach Have your spotter lift you back up. Ask them to move both hands to your lower back and slowly raise you back to standing. Try a full backbend without a spotter. Once you feel comfortable doing a backbend with a spotter, try it on your own. Lift your pelvis and ribs and keep your arms bent and strong behind your head. Keep your feet about shoulder-width apart. As you lower down, look through your arms to spot the floor. Breathe evenly and listen to your body. If you can’t go down all the way today, take a break and try again later. Take your time and remember the technique you perfected using the wall. If you’re nervous about trying your backbend the first time, place some pillows under your back so you know you have something soft to land on if you fall. Standing from Your Backbend Rock back and forth to introduce the movement. Push from your hands and roll forward into your toes, then back onto your heels while keeping your head and neck relaxed. As you get more comfortable, peel your hands just slightly off the floor as you rock, which will introduce the lifting motion to your body. Tuck your chin against your chest. Focus your weight and power in your lower body and core. Thrust up with your chest as you rock forward into your feet. Let your hands lift from the ground and slowly push yourself up into a standing position. Focus on using your core and quads to stabilize your body. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRosalind Lutsky\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFormer Gymnastics Coach\t\t\t\t\t\t\t\tRosalind Lutsky worked as a gymnastics coach at SB Gymnastics at Stanford University, coaching children from ages 5-12 years old during her time as a Stanford student. She was a competitive gymnast growing up, and competed for her local gymnastics team in Minnesota. Rosalind Lutsky\t\t\tFormer Gymnastics Coach\t\t\t\tRosalind Lutsky, former gymnastics coach, advises: “If you don’t feel comfortable pushing yourself up, it's fine to let yourself down to the ground slowly and lay down. You could even try kicking over if you're feeling confident or have a spotter, as long as you have plenty of space behind you.”",
    "sentences": [
        " Stretching and Warming Up Warm up your muscles by jogging, jumping rope or doing jumping jacks.",
        "Get your blood flowing and your muscles warm to start stretching out.",
        "Lay out a mat, or find some soft ground.",
        "Use a yoga or gymnastics mat or a mattress, or clear an area on a soft carpet or rug.",
        "Make sure your area is clear of any tripping hazards.",
        "Stretch your ankles.",
        "Flex your foot as far back as you can, so the toes are pointing up in the air.",
        "Then point your foot down, so the toes are parallel to the floor or, if you’re more flexible, angled slightly towards it.",
        "Repeat 10-20 times, then switch feet.",
        "Roll out your ankles by sitting and holding an ankle in one hand.",
        "Roll your foot in circles several times, then switch feet.",
        "Do a wrist extensor stretch.",
        "Extend your arm with your palm facing upwards and elbow straight.",
        "Pull your hand down with your other hand.",
        "Hold for ten seconds, then repeat with your other wrist.",
        "Your wrists will be bending and bearing a lot of your weight in a backbend, so make sure you stretch them well.",
        "Do a wrist flexor stretch.",
        "Extend one wrist in front of you with your palm facing away and your fingertips up.",
        "Pull your fingers back with your other hand until you feel a nice stretch.",
        "Hold for ten seconds and repeat with the other hand.",
        "Do a cat cow pose.",
        "This simple yoga pose will open up your chest and back and get you ready for more intense stretches.",
        "Start on your hands and knees with your wrists directly below your shoulders.",
        "Inhale and drop your belly towards the mat, arching your spine.",
        "Exhale and draw your belly into your spine, rounding your back.",
        "Repeat 10-15 times.",
        "Try some deeper yoga poses.",
        "Get into cobra position by lying with your belly on the floor, placing your hands under your armpits and pushing up, arching your spine and stretching your chest.",
        "Try a camel pose by kneeling, placing your hands on your lower back and arching your spine back.",
        "If you’re more flexible, give the bow pose a try.",
        "Doing a Bridge Lie on your back and bend your legs up.",
        "Place your feet close together on the floor and bend your legs so that your knees are sticking straight up off the ground.",
        "Place your hands by your head.",
        "Your fingertips should be pointing towards your shoulders and your palms pushed flat against the floor with your elbows pointing up in the air.",
        "Push through your shoulders and lift your body.",
        "Straighten your arms as much as you can.",
        "Focus on keeping your core, legs and butt muscles tight.",
        "It’s okay if you can’t lift far off the ground yet, or if you need to keep your arms bent.",
        "Practice your bridges a couple times a day and you’ll feel yourself grow stronger.",
        "Lift only your hips off the ground if you can’t push all the way up.",
        "From your position laying on the floor, place your arms down at your sides.",
        "Squeeze your butt and core to lift your hips off the ground.",
        "Hold the pose for a few seconds, then lower yourself down.",
        "Bend your arms and slowly lower your body until you’re lying flat on the ground.",
        "Give yourself a short rest, then repeat 2-3 more times.",
        "Practicing a Backbend Against a Wall Take one to two steps away from a blank wall.",
        "Place your feet about shoulder-width apart from each other.",
        "Place your palms against your buttocks and push your hips forward.",
        "Lift and elongate your spine and rib cage.",
        "This will allow your spine to stretch out and arch more cleanly.",
        "Stretch your arms straight up above your head and tilt your head back.",
        "Reach back far enough with your neck and back so that you can look at the wall.",
        "Bend your back and place your palms against the wall.",
        "Keep your elbows straight, your head tipped back and your neck long.",
        "Press your hands against the wall.",
        "Remember to keep breathing!",
        "Walk down as far as you can.",
        "Continue to keep your elbows straight and breathe evenly.",
        "Walk your arms back up the wall and straighten from your hips.",
        "Inhale as you come back to standing.",
        "Take your time and lift your head slowly.",
        "Fall forward gently and touch your toes to stretch out.",
        "Exhale and bend smoothly from your hips, allowing your back to relax.",
        "Take a couple of deep breaths.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRosalind Lutsky\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFormer Gymnastics Coach\t\t\t\t\t\t\t\tRosalind Lutsky worked as a gymnastics coach at SB Gymnastics at Stanford University, coaching children from ages 5-12 years old during her time as a Stanford student.",
        "She was a competitive gymnast growing up, and competed for her local gymnastics team in Minnesota.",
        "Rosalind Lutsky\t\t\tFormer Gymnastics Coach\t\t\t\tRosalind Lutsky, former gymnastics coach, adds: “One good way to stretch out your back after a bridge is to sit on the floor, hold your knees in your hands, and rock back and forth in a ball.” Step farther from the wall and repeat.",
        "Placing more room between you and the wall will force you to bend back a little further each time without the wall to support you, getting you closer to a full backbend.",
        "Challenge yourself to walk down a little further each time, keeping your elbows straight and breathing evenly.",
        "Doing a Full Backbend Do a backbend with a spotter supporting your back.",
        "Ask a friend or parents to place one hand on your lower back and one hand on your stomach.",
        "Using the same technique as your wall backbend (minus the wall!",
        "), slowly lower into a backbend with your spotter supporting you.",
        "EXPERT TIP\tIt can help to put an elevated mat down on the ground after you graduate from practicing against a wall.",
        "Rosalind Lutsky\t\t\t\t\tFormer Gymnastics Coach\t\t\t\t\t\t\t\tRosalind Lutsky worked as a gymnastics coach at SB Gymnastics at Stanford University, coaching children from ages 5-12 years old during her time as a Stanford student.",
        "She was a competitive gymnast growing up, and competed for her local gymnastics team in Minnesota.",
        "Rosalind LutskyFormer Gymnastics Coach Have your spotter lift you back up.",
        "Ask them to move both hands to your lower back and slowly raise you back to standing.",
        "Try a full backbend without a spotter.",
        "Once you feel comfortable doing a backbend with a spotter, try it on your own.",
        "Lift your pelvis and ribs and keep your arms bent and strong behind your head.",
        "Keep your feet about shoulder-width apart.",
        "As you lower down, look through your arms to spot the floor.",
        "Breathe evenly and listen to your body.",
        "If you can’t go down all the way today, take a break and try again later.",
        "Take your time and remember the technique you perfected using the wall.",
        "If you’re nervous about trying your backbend the first time, place some pillows under your back so you know you have something soft to land on if you fall.",
        "Standing from Your Backbend Rock back and forth to introduce the movement.",
        "Push from your hands and roll forward into your toes, then back onto your heels while keeping your head and neck relaxed.",
        "As you get more comfortable, peel your hands just slightly off the floor as you rock, which will introduce the lifting motion to your body.",
        "Tuck your chin against your chest.",
        "Focus your weight and power in your lower body and core.",
        "Thrust up with your chest as you rock forward into your feet.",
        "Let your hands lift from the ground and slowly push yourself up into a standing position.",
        "Focus on using your core and quads to stabilize your body.",
        "EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRosalind Lutsky\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFormer Gymnastics Coach\t\t\t\t\t\t\t\tRosalind Lutsky worked as a gymnastics coach at SB Gymnastics at Stanford University, coaching children from ages 5-12 years old during her time as a Stanford student.",
        "She was a competitive gymnast growing up, and competed for her local gymnastics team in Minnesota.",
        "Rosalind Lutsky\t\t\tFormer Gymnastics Coach\t\t\t\tRosalind Lutsky, former gymnastics coach, advises: “If you don’t feel comfortable pushing yourself up, it's fine to let yourself down to the ground slowly and lay down.",
        "You could even try kicking over if you're feeling confident or have a spotter, as long as you have plenty of space behind you.”"
    ]
}