{
    "title": "How to Stitch Plastic Canvas",
    "url": "https://www.wikihow.com/Stitch-Plastic-Canvas",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Needlework"
    ],
    "methods": [
        {
            "name": "Mastering Basic Stitches",
            "steps": [
                {
                    "headline": "Execute backstitches.",
                    "description": "Backstitches are created by inserting your needle up through the canvas at even-numbered holes and down through the canvas at odd-numbered holes. This stitch may be any length you desire and go in any direction. On patterns, this stitch appears as “backstitch” or “backst.”\nPull the needle up through the back of the canvas at hole 2. Push the needle down through the top of the canvas at hole 1. Pull the needle up through the back of the canvas at hole 4. Push the needle down through the top of the canvas at hole 3. Repeat."
                },
                {
                    "headline": "Create a continental stitch.",
                    "description": "The continental stitch is used to create horizontal rows of angled stitches. On patterns, this stitch appears as “continental.”\nPull the needle up through the back of the canvas at row 1, hole 2. Insert the needle down through the top of the canvas at row 2, hole 1. Pull the needle up through the back of the canvas at row 1, hole 3. Insert the needle down through the top of the canvas at row 2, hole 2. Pull the needle up through the back of the canvas at row 1, hole 4. Insert the needle down through the top of the canvas at row 2, hole 3. Repeat."
                },
                {
                    "headline": "Generate a reverse continental stitch.",
                    "description": "The reverse continental stitch is sewn from left to right, as opposed to right to left. In patterns, this stitch appears as “reverse continental.”\nPull the needle up through the back of the canvas at row 1, hole 6. Insert the needle down through the top of the canvas at row 2, hole 7. Pull the needle up through the back of the canvas at row 1, hole 5. Insert the needle down through the top of the canvas at row 2, hole 6. Pull the needle up through the back of the canvas at row 1, hole 4. Insert the needle down through the top of the canvas at row 2, hole 5. Repeat."
                },
                {
                    "headline": "Produce a cross stitch.",
                    "description": "A cross stitch looks like an “X.” It is created by making two intersecting diagonally stitches. On patterns it appears as “cross stitch” or “xs.”\nPull the needle up through the back of the canvas at row 2, hole 2. Insert the needle down through the top of the canvas at row 1, hole 1. Pull the needle up through the back of the canvas at row 2, hole 1. Insert the needle down through the top of the canvas at row 1, hole 2."
                },
                {
                    "headline": "Generate a long stitch.",
                    "description": "A long stitch is a series of parallel straight stitches. While each stitch may be a different length, it must cover at least two bars (two grid lines). On patterns this stitch appears as “long stitch.”\nPull the needle up through the back of the canvas at row 1, hole 1. Insert the needle down through the top of the canvas at row 3, hole 1. Pull the needle up through the back of the canvas at row 1, hole 2. Insert the needle down through the top of the canvas at row 3, hole 1. Repeat."
                },
                {
                    "headline": "Execute a running stitch.",
                    "description": "The running stitch is a series of one-bar (one grid line) stitches. On patterns, this stitch appears as “running stitch. Pull the needle up through the back of the canvas at row 1, hole 1. Insert the needle down through the top of the canvas at row 1, hole 2. Pull the needle up through the back of the canvas at row 1, hole 3. Insert the needle down through the top of the canvas at row 1, hole 4. Repeat."
                },
                {
                    "headline": "Create a scotch stitch.",
                    "description": "The scotch stitch is a series of angled stitches that form a square. It is used to cover large areas of plastic canvas. On patterns, this stitch appears as “scotch stitch.”\nPull the needle up through the back of the canvas at row 2, hole 1. Insert the needle down through the top of the canvas at row 1, hole 2. Pull the needle up through the back of the canvas at row 3, hole 1. Insert the needle down through the top of the canvas at row 1, hole 3. Pull the needle up through the back of the canvas at row 4, hole 1. Insert the needle down through the top of the canvas at row 1, hole 4. Pull the needle up through the back of the canvas at row 4, hole 2. Insert the needle down through the top of the canvas at row 2, hole 4. Pull the needle up through the back of the canvas at row 4, hole 3. Insert the needle down through the top of the canvas at row 3, hole 4."
                }
            ]
        },
        {
            "name": "Starting, Finishing, and Connecting Plastic Canvas",
            "steps": [
                {
                    "headline": "Start a row of stitches.",
                    "description": "When you create a plastic canvas, you don't want any loose threads hanging from your masterpiece. To accomplish this, and secure your row of stitches in the process, you need to stitch over the tail. Thread your needle with approximately three feet of yarn or floss. Insert the needle through the backside of the canvas until you are left with a two-inch tail of yarn or floss. Hold the tail against the back of your canvas so that it runs along your stitch line. Execute your stitches over the tail until it is completely covered."
                },
                {
                    "headline": "Finish a row of stitches.",
                    "description": "When you complete a row or rows of stitches, you do not want to mar your creation with a bulky knot or a hanging tail. To create a clean, finish on the back of the canvas:\nFlip the canvas so that its back faces up. Insert your needle and yarn through several completed stitches. Pull the yarn or floss tight. Trim the yarn or floss as close to the canvas as possible."
                },
                {
                    "headline": "Create a fringe edge.",
                    "description": "There are two basic stitches you may use to finish the edges of your plastic canvas: the lark's head knot and the overcast stitch. The lark's head knot is used to create a fringe edge. On patterns this stitch appears as “larks head.”\nInsert the needle through the top of the canvas at an edge hole. Pull the thread or yarn to the left side. Pull the needle up through the back of the canvas at the same hole. Create a loop in the thread or yarn. The loop will hang from the backside of the canvas. Insert the tails through the loop and pull tight. Repeat."
                },
                {
                    "headline": "Create a clean edge.",
                    "description": "If you prefer a clean edge, use an overcast stitch instead of a lark's head knot. On patterns, this stitch appears as “overcast.”\nPull the needle up through the back of the canvas at an edge hole. Wrap the thread or floss tightly against the edge of the canvas. Pull the needle up through the back of the canvas at the neighboring edge hole. Wrap the thread or floss tightly against the edge of the canvas. Repeat. Produce one stitch per hole along the edge and inner corner of the canvas. Create 2 to 3 stitches per hole located on the outside corners."
                },
                {
                    "headline": "Connect pieces of plastic canvas.",
                    "description": "If you need to create a larger canvas, you can stitch together two or more pieces with a whipstitch. In patterns, this stitch appears as “whipstitch.”\nStack your canvas on top of each other so that the edges are flush. Pull the needle up through the two canvases at the top edge hole. Wrap the thread or floss tightly against the edges of the canvas. Insert the needle into the next hole and pull it through. Wrap the thread or floss tightly against the edge of the canvas. Repeat until you reach the bottom of the canvas."
                }
            ]
        },
        {
            "name": "Preparing for Your Project",
            "steps": [
                {
                    "headline": "Select your plastic canvas.",
                    "description": "Plastic canvas is a grid structure formed by a series of holes and bars (gridlines). It comes in a variety of colors (clear or colored), shapes (rectangular or pre-cut shapes), and thicknesses (soft, regular, or stiff). It also comes in 4 different hole counts. 5-count plastic canvas has 25 squares per square inch. This canvas is only available in a clear, rectangular sheet of regular thickness. 7-count plastic canvas has 49 squares per square inch. It is the most common plastic canvas. It is the only count available in a variety of colors, shapes, and all three thicknesses. 10-count plastic canvas has 100 squares per square inch. This count is available in a small selection of colors. It is only available in rectangular sheet of regular thickness. 14-count plastic canvas has 144 squares per square inch. This count is available in clear, black, and white. It is only sold in rectangular sheets of regular thickness."
                },
                {
                    "headline": "Pick out a needle.",
                    "description": "The tapestry needle is most commonly used for plastic canvas work. Tapestry needles are characterized by their large eye and blunt, round tip. The large eye allows your to thread multiple strands of yarn or floss. You will need a different size needle for each plastic canvas count. 7-count requires a size 16 tapestry needle. 10-count requires a size 18 tapestry needle. 14 count requires a size 20 tapestry needle."
                },
                {
                    "headline": "Select yarn or floss.",
                    "description": "In addition to using a different size needle for each count, you will also need to use a different size yarn or thread. While the 5-count requires multiples strands, the others require only one strand. 5-count plastic canvas requires 2 strands of 4-ply worsted wool. 7-count requires 1 strand of 4-ply worsted wool. 10-count requires a 3-ply sport wool, #3 Perle Cotton, or a 12-plies floss. 14-count requires 6-plies floss or a #5 Perle Cotton."
                }
            ]
        }
    ],
    "tyn": [
        "Plastic canvas.",
        "Tapestry needles",
        "Yarn or floss",
        "Pattern",
        "Pair of embroidery scissors"
    ],
    "text": " Mastering Basic Stitches Execute backstitches. Backstitches are created by inserting your needle up through the canvas at even-numbered holes and down through the canvas at odd-numbered holes. This stitch may be any length you desire and go in any direction. On patterns, this stitch appears as “backstitch” or “backst.”\nPull the needle up through the back of the canvas at hole 2. Push the needle down through the top of the canvas at hole 1. Pull the needle up through the back of the canvas at hole 4. Push the needle down through the top of the canvas at hole 3. Repeat. Create a continental stitch. The continental stitch is used to create horizontal rows of angled stitches. On patterns, this stitch appears as “continental.”\nPull the needle up through the back of the canvas at row 1, hole 2. Insert the needle down through the top of the canvas at row 2, hole 1. Pull the needle up through the back of the canvas at row 1, hole 3. Insert the needle down through the top of the canvas at row 2, hole 2. Pull the needle up through the back of the canvas at row 1, hole 4. Insert the needle down through the top of the canvas at row 2, hole 3. Repeat. Generate a reverse continental stitch. The reverse continental stitch is sewn from left to right, as opposed to right to left. In patterns, this stitch appears as “reverse continental.”\nPull the needle up through the back of the canvas at row 1, hole 6. Insert the needle down through the top of the canvas at row 2, hole 7. Pull the needle up through the back of the canvas at row 1, hole 5. Insert the needle down through the top of the canvas at row 2, hole 6. Pull the needle up through the back of the canvas at row 1, hole 4. Insert the needle down through the top of the canvas at row 2, hole 5. Repeat. Produce a cross stitch. A cross stitch looks like an “X.” It is created by making two intersecting diagonally stitches. On patterns it appears as “cross stitch” or “xs.”\nPull the needle up through the back of the canvas at row 2, hole 2. Insert the needle down through the top of the canvas at row 1, hole 1. Pull the needle up through the back of the canvas at row 2, hole 1. Insert the needle down through the top of the canvas at row 1, hole 2. Generate a long stitch. A long stitch is a series of parallel straight stitches. While each stitch may be a different length, it must cover at least two bars (two grid lines). On patterns this stitch appears as “long stitch.”\nPull the needle up through the back of the canvas at row 1, hole 1. Insert the needle down through the top of the canvas at row 3, hole 1. Pull the needle up through the back of the canvas at row 1, hole 2. Insert the needle down through the top of the canvas at row 3, hole 1. Repeat. Execute a running stitch. The running stitch is a series of one-bar (one grid line) stitches. On patterns, this stitch appears as “running stitch. Pull the needle up through the back of the canvas at row 1, hole 1. Insert the needle down through the top of the canvas at row 1, hole 2. Pull the needle up through the back of the canvas at row 1, hole 3. Insert the needle down through the top of the canvas at row 1, hole 4. Repeat. Create a scotch stitch. The scotch stitch is a series of angled stitches that form a square. It is used to cover large areas of plastic canvas. On patterns, this stitch appears as “scotch stitch.”\nPull the needle up through the back of the canvas at row 2, hole 1. Insert the needle down through the top of the canvas at row 1, hole 2. Pull the needle up through the back of the canvas at row 3, hole 1. Insert the needle down through the top of the canvas at row 1, hole 3. Pull the needle up through the back of the canvas at row 4, hole 1. Insert the needle down through the top of the canvas at row 1, hole 4. Pull the needle up through the back of the canvas at row 4, hole 2. Insert the needle down through the top of the canvas at row 2, hole 4. Pull the needle up through the back of the canvas at row 4, hole 3. Insert the needle down through the top of the canvas at row 3, hole 4. Starting, Finishing, and Connecting Plastic Canvas Start a row of stitches. When you create a plastic canvas, you don't want any loose threads hanging from your masterpiece. To accomplish this, and secure your row of stitches in the process, you need to stitch over the tail. Thread your needle with approximately three feet of yarn or floss. Insert the needle through the backside of the canvas until you are left with a two-inch tail of yarn or floss. Hold the tail against the back of your canvas so that it runs along your stitch line. Execute your stitches over the tail until it is completely covered. Finish a row of stitches. When you complete a row or rows of stitches, you do not want to mar your creation with a bulky knot or a hanging tail. To create a clean, finish on the back of the canvas:\nFlip the canvas so that its back faces up. Insert your needle and yarn through several completed stitches. Pull the yarn or floss tight. Trim the yarn or floss as close to the canvas as possible. Create a fringe edge. There are two basic stitches you may use to finish the edges of your plastic canvas: the lark's head knot and the overcast stitch. The lark's head knot is used to create a fringe edge. On patterns this stitch appears as “larks head.”\nInsert the needle through the top of the canvas at an edge hole. Pull the thread or yarn to the left side. Pull the needle up through the back of the canvas at the same hole. Create a loop in the thread or yarn. The loop will hang from the backside of the canvas. Insert the tails through the loop and pull tight. Repeat. Create a clean edge. If you prefer a clean edge, use an overcast stitch instead of a lark's head knot. On patterns, this stitch appears as “overcast.”\nPull the needle up through the back of the canvas at an edge hole. Wrap the thread or floss tightly against the edge of the canvas. Pull the needle up through the back of the canvas at the neighboring edge hole. Wrap the thread or floss tightly against the edge of the canvas. Repeat. Produce one stitch per hole along the edge and inner corner of the canvas. Create 2 to 3 stitches per hole located on the outside corners. Connect pieces of plastic canvas. If you need to create a larger canvas, you can stitch together two or more pieces with a whipstitch. In patterns, this stitch appears as “whipstitch.”\nStack your canvas on top of each other so that the edges are flush. Pull the needle up through the two canvases at the top edge hole. Wrap the thread or floss tightly against the edges of the canvas. Insert the needle into the next hole and pull it through. Wrap the thread or floss tightly against the edge of the canvas. Repeat until you reach the bottom of the canvas. Preparing for Your Project Select your plastic canvas. Plastic canvas is a grid structure formed by a series of holes and bars (gridlines). It comes in a variety of colors (clear or colored), shapes (rectangular or pre-cut shapes), and thicknesses (soft, regular, or stiff). It also comes in 4 different hole counts. 5-count plastic canvas has 25 squares per square inch. This canvas is only available in a clear, rectangular sheet of regular thickness. 7-count plastic canvas has 49 squares per square inch. It is the most common plastic canvas. It is the only count available in a variety of colors, shapes, and all three thicknesses. 10-count plastic canvas has 100 squares per square inch. This count is available in a small selection of colors. It is only available in rectangular sheet of regular thickness. 14-count plastic canvas has 144 squares per square inch. This count is available in clear, black, and white. It is only sold in rectangular sheets of regular thickness. Pick out a needle. The tapestry needle is most commonly used for plastic canvas work. Tapestry needles are characterized by their large eye and blunt, round tip. The large eye allows your to thread multiple strands of yarn or floss. You will need a different size needle for each plastic canvas count. 7-count requires a size 16 tapestry needle. 10-count requires a size 18 tapestry needle. 14 count requires a size 20 tapestry needle. Select yarn or floss. In addition to using a different size needle for each count, you will also need to use a different size yarn or thread. While the 5-count requires multiples strands, the others require only one strand. 5-count plastic canvas requires 2 strands of 4-ply worsted wool. 7-count requires 1 strand of 4-ply worsted wool. 10-count requires a 3-ply sport wool, #3 Perle Cotton, or a 12-plies floss. 14-count requires 6-plies floss or a #5 Perle Cotton.",
    "sentences": [
        " Mastering Basic Stitches Execute backstitches.",
        "Backstitches are created by inserting your needle up through the canvas at even-numbered holes and down through the canvas at odd-numbered holes.",
        "This stitch may be any length you desire and go in any direction.",
        "On patterns, this stitch appears as “backstitch” or “backst.”\nPull the needle up through the back of the canvas at hole 2.",
        "Push the needle down through the top of the canvas at hole 1.",
        "Pull the needle up through the back of the canvas at hole 4.",
        "Push the needle down through the top of the canvas at hole 3.",
        "Repeat.",
        "Create a continental stitch.",
        "The continental stitch is used to create horizontal rows of angled stitches.",
        "On patterns, this stitch appears as “continental.”\nPull the needle up through the back of the canvas at row 1, hole 2.",
        "Insert the needle down through the top of the canvas at row 2, hole 1.",
        "Pull the needle up through the back of the canvas at row 1, hole 3.",
        "Insert the needle down through the top of the canvas at row 2, hole 2.",
        "Pull the needle up through the back of the canvas at row 1, hole 4.",
        "Insert the needle down through the top of the canvas at row 2, hole 3.",
        "Repeat.",
        "Generate a reverse continental stitch.",
        "The reverse continental stitch is sewn from left to right, as opposed to right to left.",
        "In patterns, this stitch appears as “reverse continental.”\nPull the needle up through the back of the canvas at row 1, hole 6.",
        "Insert the needle down through the top of the canvas at row 2, hole 7.",
        "Pull the needle up through the back of the canvas at row 1, hole 5.",
        "Insert the needle down through the top of the canvas at row 2, hole 6.",
        "Pull the needle up through the back of the canvas at row 1, hole 4.",
        "Insert the needle down through the top of the canvas at row 2, hole 5.",
        "Repeat.",
        "Produce a cross stitch.",
        "A cross stitch looks like an “X.” It is created by making two intersecting diagonally stitches.",
        "On patterns it appears as “cross stitch” or “xs.”\nPull the needle up through the back of the canvas at row 2, hole 2.",
        "Insert the needle down through the top of the canvas at row 1, hole 1.",
        "Pull the needle up through the back of the canvas at row 2, hole 1.",
        "Insert the needle down through the top of the canvas at row 1, hole 2.",
        "Generate a long stitch.",
        "A long stitch is a series of parallel straight stitches.",
        "While each stitch may be a different length, it must cover at least two bars (two grid lines).",
        "On patterns this stitch appears as “long stitch.”\nPull the needle up through the back of the canvas at row 1, hole 1.",
        "Insert the needle down through the top of the canvas at row 3, hole 1.",
        "Pull the needle up through the back of the canvas at row 1, hole 2.",
        "Insert the needle down through the top of the canvas at row 3, hole 1.",
        "Repeat.",
        "Execute a running stitch.",
        "The running stitch is a series of one-bar (one grid line) stitches.",
        "On patterns, this stitch appears as “running stitch.",
        "Pull the needle up through the back of the canvas at row 1, hole 1.",
        "Insert the needle down through the top of the canvas at row 1, hole 2.",
        "Pull the needle up through the back of the canvas at row 1, hole 3.",
        "Insert the needle down through the top of the canvas at row 1, hole 4.",
        "Repeat.",
        "Create a scotch stitch.",
        "The scotch stitch is a series of angled stitches that form a square.",
        "It is used to cover large areas of plastic canvas.",
        "On patterns, this stitch appears as “scotch stitch.”\nPull the needle up through the back of the canvas at row 2, hole 1.",
        "Insert the needle down through the top of the canvas at row 1, hole 2.",
        "Pull the needle up through the back of the canvas at row 3, hole 1.",
        "Insert the needle down through the top of the canvas at row 1, hole 3.",
        "Pull the needle up through the back of the canvas at row 4, hole 1.",
        "Insert the needle down through the top of the canvas at row 1, hole 4.",
        "Pull the needle up through the back of the canvas at row 4, hole 2.",
        "Insert the needle down through the top of the canvas at row 2, hole 4.",
        "Pull the needle up through the back of the canvas at row 4, hole 3.",
        "Insert the needle down through the top of the canvas at row 3, hole 4.",
        "Starting, Finishing, and Connecting Plastic Canvas Start a row of stitches.",
        "When you create a plastic canvas, you don't want any loose threads hanging from your masterpiece.",
        "To accomplish this, and secure your row of stitches in the process, you need to stitch over the tail.",
        "Thread your needle with approximately three feet of yarn or floss.",
        "Insert the needle through the backside of the canvas until you are left with a two-inch tail of yarn or floss.",
        "Hold the tail against the back of your canvas so that it runs along your stitch line.",
        "Execute your stitches over the tail until it is completely covered.",
        "Finish a row of stitches.",
        "When you complete a row or rows of stitches, you do not want to mar your creation with a bulky knot or a hanging tail.",
        "To create a clean, finish on the back of the canvas:\nFlip the canvas so that its back faces up.",
        "Insert your needle and yarn through several completed stitches.",
        "Pull the yarn or floss tight.",
        "Trim the yarn or floss as close to the canvas as possible.",
        "Create a fringe edge.",
        "There are two basic stitches you may use to finish the edges of your plastic canvas: the lark's head knot and the overcast stitch.",
        "The lark's head knot is used to create a fringe edge.",
        "On patterns this stitch appears as “larks head.”\nInsert the needle through the top of the canvas at an edge hole.",
        "Pull the thread or yarn to the left side.",
        "Pull the needle up through the back of the canvas at the same hole.",
        "Create a loop in the thread or yarn.",
        "The loop will hang from the backside of the canvas.",
        "Insert the tails through the loop and pull tight.",
        "Repeat.",
        "Create a clean edge.",
        "If you prefer a clean edge, use an overcast stitch instead of a lark's head knot.",
        "On patterns, this stitch appears as “overcast.”\nPull the needle up through the back of the canvas at an edge hole.",
        "Wrap the thread or floss tightly against the edge of the canvas.",
        "Pull the needle up through the back of the canvas at the neighboring edge hole.",
        "Wrap the thread or floss tightly against the edge of the canvas.",
        "Repeat.",
        "Produce one stitch per hole along the edge and inner corner of the canvas.",
        "Create 2 to 3 stitches per hole located on the outside corners.",
        "Connect pieces of plastic canvas.",
        "If you need to create a larger canvas, you can stitch together two or more pieces with a whipstitch.",
        "In patterns, this stitch appears as “whipstitch.”\nStack your canvas on top of each other so that the edges are flush.",
        "Pull the needle up through the two canvases at the top edge hole.",
        "Wrap the thread or floss tightly against the edges of the canvas.",
        "Insert the needle into the next hole and pull it through.",
        "Wrap the thread or floss tightly against the edge of the canvas.",
        "Repeat until you reach the bottom of the canvas.",
        "Preparing for Your Project Select your plastic canvas.",
        "Plastic canvas is a grid structure formed by a series of holes and bars (gridlines).",
        "It comes in a variety of colors (clear or colored), shapes (rectangular or pre-cut shapes), and thicknesses (soft, regular, or stiff).",
        "It also comes in 4 different hole counts.",
        "5-count plastic canvas has 25 squares per square inch.",
        "This canvas is only available in a clear, rectangular sheet of regular thickness.",
        "7-count plastic canvas has 49 squares per square inch.",
        "It is the most common plastic canvas.",
        "It is the only count available in a variety of colors, shapes, and all three thicknesses.",
        "10-count plastic canvas has 100 squares per square inch.",
        "This count is available in a small selection of colors.",
        "It is only available in rectangular sheet of regular thickness.",
        "14-count plastic canvas has 144 squares per square inch.",
        "This count is available in clear, black, and white.",
        "It is only sold in rectangular sheets of regular thickness.",
        "Pick out a needle.",
        "The tapestry needle is most commonly used for plastic canvas work.",
        "Tapestry needles are characterized by their large eye and blunt, round tip.",
        "The large eye allows your to thread multiple strands of yarn or floss.",
        "You will need a different size needle for each plastic canvas count.",
        "7-count requires a size 16 tapestry needle.",
        "10-count requires a size 18 tapestry needle.",
        "14 count requires a size 20 tapestry needle.",
        "Select yarn or floss.",
        "In addition to using a different size needle for each count, you will also need to use a different size yarn or thread.",
        "While the 5-count requires multiples strands, the others require only one strand.",
        "5-count plastic canvas requires 2 strands of 4-ply worsted wool.",
        "7-count requires 1 strand of 4-ply worsted wool.",
        "10-count requires a 3-ply sport wool, #3 Perle Cotton, or a 12-plies floss.",
        "14-count requires 6-plies floss or a #5 Perle Cotton."
    ]
}