{
    "title": "How to Draw Anime Hands",
    "url": "https://www.wikihow.com/Draw-Anime-Hands",
    "category_hierarchy": [
        "Arts and Entertainment",
        "Movies",
        "Filmmaking",
        "Animation",
        "Anime",
        "Drawing Anime",
        "Drawing Anime Characters"
    ],
    "methods": [
        {
            "name": "Drawing an Open-Palm Hand",
            "steps": [
                {
                    "headline": "Form the palm by drawing a rounded rectangle.",
                    "description": "Use light, short strokes as you begin your sketch—there will be plenty of time to make it look more defined later on. Look at your hand for reference and see how one side is a little rounder than the other. Replicate that shape on your paper, completely ignoring your thumb and fingers for now. It can help to study your hand or pictures of hands as you work on your drawing. In anime, female hands tend to be on the smaller and slimmer side, whereas male hands are a bit larger so they look more intimidating."
                },
                {
                    "headline": "Draw 5 circles on the palm where each finger and thumb will be.",
                    "description": "Place the pinky-ring knuckle circle on the edge of the palm. Make it the lowest circle with the ring, middle, and pointer-finger knuckles all placed slightly higher than it. Place the knuckle circles side by side so their edges are touching. To position the thumb:\nWhen drawing the back of the right hand: place the thumb-knuckle circle on the left-hand side of the palm, about halfway down the side or lower. When drawing the front of the right hand: place the thumb-knuckle on the right-hand side of the palm, about halfway down the side or lower. This position is also palm-side up. When drawing the back of the left hand: place the thumb-knuckle on the right-hand side of the palm, about halfway down the side or lower. When drawing the front of the left hand: place the thumb-knuckle on the left-hand side of the palm, about halfway down the side or lower. This is the palm-up position."
                },
                {
                    "headline": "Sketch the fingers based off of the knuckle circles you drew.",
                    "description": "Use the knuckle circles as a reference for where each finger should be positioned on the palm. Draw the middle finger first since it’s the longest, then use that length as a reference for drawing the rest of the fingers. Use short, gentle strokes to form the sides and tips of each finger to establish each one’s general shape. In anime, extended fingers can look like realistic fingers, or they can be longer and more slender than what you see in the real world. Feel free to play around with the proportions so that the aesthetic matches the rest of the character you’re drawing. You could also start by drawing the pointer finger. It’s often about the same length as the palm itself, so that could help you get your proportions right if you want the hand to look realistic."
                },
                {
                    "headline": "Draw the thumb coming out of the bottom circle.",
                    "description": "Make the thumb mostly straight on the outside and slightly curved on the inside so it doesn’t look too stiff. Curve the top edge of the thumb to mirror how your actual thumb looks. If you make a mistake, just erase it and start over. Try making the thumb longer or shorter to see what you like best."
                },
                {
                    "headline": "Make small circles on the fingers to represent the middle and top knuckles.",
                    "description": "Do this to add some visual dimension to the hand you’re drawing—seeing the circles will help you visualize the way fingers bend, which will make it easier to fill in smaller details later on. Make the top-knuckle circles the smallest and the middle-knuckle circles slightly bigger than that. Doing this can also help you see if any of the fingers are skewed in length or spacing."
                },
                {
                    "headline": "Outline the actual hand, including the thumb, fingers, and palm.",
                    "description": "After your general sketch is done, take your pencil and go over the shape of the hand with light, short strokes. Fill out the sides and tops of each finger and continue reinforcing all sides of the palm. If you feel confident, try using a pen or marker for this final outline of the palm and fingers. It will make it easier to erase your sketch lines without losing any of the outline later on. Make sure to wait until the ink is dry before erasing any of the sketch lines so the drawing doesn’t smudge."
                },
                {
                    "headline": "Add shading, wrinkling, and knuckle creases to make the hand lifelike.",
                    "description": "Take a look at your palm and observe all the lines it makes as you move it. You could draw creases where each knuckle should be to show the hand is slightly bent, and you could add palm lines to make it more detailed. Anime hands are usually a little less detailed than “real” hands, so your drawing won’t suffer if you don’t include as much detail. Anime eyes, hair, and clothes are the most detailed parts of any anime drawing."
                },
                {
                    "headline": "Erase the knuckle circles and other interior lines in the palm.",
                    "description": "Use your eraser to carefully remove each circle you drew for the knuckles. You should also erase the line that separates each finger from the palm so that everything is connected. If you used marker or pen, wait for it to dry completely before erasing any lines so your drawing doesn’t smear.Tip: If you accidentally erase part of an actual finger or the palm, just go ahead and sketch it back into place."
                }
            ]
        },
        {
            "name": "Creating Different Gestures",
            "steps": [
                {
                    "headline": "Make a clenched fist.",
                    "description": "Decide if you want to draw a fist viewed from the side, the top, or the bottom. Sketch a rounded rectangle for the palm first, then draw circles where the knuckle for each finger rests on the palm. From there, sketch the shape of each finger so it mimics how it lays on the palm in real life. Keep in mind that fingers often lie flush against each other when you make a fist, so don’t add space between them. Remember to go back in and erase the circles and interior lines once you’re done so that the hand looks as seamless as possible.Tip: Use your hand or a picture for reference—it will be much easier to create the right shape if you have something else to look at! Even from anime character to anime character, you’ll see that the styles are different. Find something you like and mimic it until you can do it on your own."
                },
                {
                    "headline": "Practice drawing a hand holding an object.",
                    "description": "In anime, it’s common for characters to be holding swords, weapons, or other objects, so it’s safe to say at some point you’ll want to be able to draw this. It may take a little extra practice, but once you get the hang of this technique, you’ll feel confident in your drawing abilities! To draw a hand holding something:\nDraw the shape of a palm by making a rounded rectangle. Sketch the fingers and thumb as if you were drawing a closed fist. Add the actual object extending from either side of the fist (it’s okay if you draw over the fingers—you can always erase those lines later). Clean up your sketch by erasing knuckle circles and extra lines and add more definitive pencil strokes to outline the hand and object."
                },
                {
                    "headline": "Draw a relaxed hand hanging down at someone’s side.",
                    "description": "Start by sketching a rounded rectangle to represent the side of the palm. Draw a second smaller rounded rectangle that overlaps the first one to create the base for the thumb. Sketch the thumb and pointer finger; make the tip of the thumb end opposite of the pointer finger’s middle knuckle. Add the tips of the middle, ring, and pinky fingers behind the pointer finger by drawing curved lines that extend toward the thumb. You can do this by practicing drawing the hand on its own, or draw an anime character and practice sketching the hand from there. When the hand is in a naturally relaxed position, you should see 3 or 4 fingers from the side, though just parts of each finger. Study pictures of hands in this position to get a sense of what looks more natural."
                },
                {
                    "headline": "Draw different gestures to become an anime-hand expert.",
                    "description": "Start by mimicking some of your favorite drawings until you can copy them perfectly, and then start creating ones of your own. Practice some of these common gestures so you can create dynamic characters in all kinds of situations:\nPeace sign\nHigh five\nHandshake\nFist clenched at the side\nHand holding a rounded object, like an apple\nThumbs up\nPointing at something"
                }
            ]
        }
    ],
    "tyn": [
        "Drawing an Open-Palm Hand",
        "Paper",
        "Pencil",
        "Eraser",
        "Creating Different Gestures"
    ],
    "text": " Drawing an Open-Palm Hand Form the palm by drawing a rounded rectangle. Use light, short strokes as you begin your sketch—there will be plenty of time to make it look more defined later on. Look at your hand for reference and see how one side is a little rounder than the other. Replicate that shape on your paper, completely ignoring your thumb and fingers for now. It can help to study your hand or pictures of hands as you work on your drawing. In anime, female hands tend to be on the smaller and slimmer side, whereas male hands are a bit larger so they look more intimidating. Draw 5 circles on the palm where each finger and thumb will be. Place the pinky-ring knuckle circle on the edge of the palm. Make it the lowest circle with the ring, middle, and pointer-finger knuckles all placed slightly higher than it. Place the knuckle circles side by side so their edges are touching. To position the thumb:\nWhen drawing the back of the right hand: place the thumb-knuckle circle on the left-hand side of the palm, about halfway down the side or lower. When drawing the front of the right hand: place the thumb-knuckle on the right-hand side of the palm, about halfway down the side or lower. This position is also palm-side up. When drawing the back of the left hand: place the thumb-knuckle on the right-hand side of the palm, about halfway down the side or lower. When drawing the front of the left hand: place the thumb-knuckle on the left-hand side of the palm, about halfway down the side or lower. This is the palm-up position. Sketch the fingers based off of the knuckle circles you drew. Use the knuckle circles as a reference for where each finger should be positioned on the palm. Draw the middle finger first since it’s the longest, then use that length as a reference for drawing the rest of the fingers. Use short, gentle strokes to form the sides and tips of each finger to establish each one’s general shape. In anime, extended fingers can look like realistic fingers, or they can be longer and more slender than what you see in the real world. Feel free to play around with the proportions so that the aesthetic matches the rest of the character you’re drawing. You could also start by drawing the pointer finger. It’s often about the same length as the palm itself, so that could help you get your proportions right if you want the hand to look realistic. Draw the thumb coming out of the bottom circle. Make the thumb mostly straight on the outside and slightly curved on the inside so it doesn’t look too stiff. Curve the top edge of the thumb to mirror how your actual thumb looks. If you make a mistake, just erase it and start over. Try making the thumb longer or shorter to see what you like best. Make small circles on the fingers to represent the middle and top knuckles. Do this to add some visual dimension to the hand you’re drawing—seeing the circles will help you visualize the way fingers bend, which will make it easier to fill in smaller details later on. Make the top-knuckle circles the smallest and the middle-knuckle circles slightly bigger than that. Doing this can also help you see if any of the fingers are skewed in length or spacing. Outline the actual hand, including the thumb, fingers, and palm. After your general sketch is done, take your pencil and go over the shape of the hand with light, short strokes. Fill out the sides and tops of each finger and continue reinforcing all sides of the palm. If you feel confident, try using a pen or marker for this final outline of the palm and fingers. It will make it easier to erase your sketch lines without losing any of the outline later on. Make sure to wait until the ink is dry before erasing any of the sketch lines so the drawing doesn’t smudge. Add shading, wrinkling, and knuckle creases to make the hand lifelike. Take a look at your palm and observe all the lines it makes as you move it. You could draw creases where each knuckle should be to show the hand is slightly bent, and you could add palm lines to make it more detailed. Anime hands are usually a little less detailed than “real” hands, so your drawing won’t suffer if you don’t include as much detail. Anime eyes, hair, and clothes are the most detailed parts of any anime drawing. Erase the knuckle circles and other interior lines in the palm. Use your eraser to carefully remove each circle you drew for the knuckles. You should also erase the line that separates each finger from the palm so that everything is connected. If you used marker or pen, wait for it to dry completely before erasing any lines so your drawing doesn’t smear.Tip: If you accidentally erase part of an actual finger or the palm, just go ahead and sketch it back into place. Creating Different Gestures Make a clenched fist. Decide if you want to draw a fist viewed from the side, the top, or the bottom. Sketch a rounded rectangle for the palm first, then draw circles where the knuckle for each finger rests on the palm. From there, sketch the shape of each finger so it mimics how it lays on the palm in real life. Keep in mind that fingers often lie flush against each other when you make a fist, so don’t add space between them. Remember to go back in and erase the circles and interior lines once you’re done so that the hand looks as seamless as possible.Tip: Use your hand or a picture for reference—it will be much easier to create the right shape if you have something else to look at! Even from anime character to anime character, you’ll see that the styles are different. Find something you like and mimic it until you can do it on your own. Practice drawing a hand holding an object. In anime, it’s common for characters to be holding swords, weapons, or other objects, so it’s safe to say at some point you’ll want to be able to draw this. It may take a little extra practice, but once you get the hang of this technique, you’ll feel confident in your drawing abilities! To draw a hand holding something:\nDraw the shape of a palm by making a rounded rectangle. Sketch the fingers and thumb as if you were drawing a closed fist. Add the actual object extending from either side of the fist (it’s okay if you draw over the fingers—you can always erase those lines later). Clean up your sketch by erasing knuckle circles and extra lines and add more definitive pencil strokes to outline the hand and object. Draw a relaxed hand hanging down at someone’s side. Start by sketching a rounded rectangle to represent the side of the palm. Draw a second smaller rounded rectangle that overlaps the first one to create the base for the thumb. Sketch the thumb and pointer finger; make the tip of the thumb end opposite of the pointer finger’s middle knuckle. Add the tips of the middle, ring, and pinky fingers behind the pointer finger by drawing curved lines that extend toward the thumb. You can do this by practicing drawing the hand on its own, or draw an anime character and practice sketching the hand from there. When the hand is in a naturally relaxed position, you should see 3 or 4 fingers from the side, though just parts of each finger. Study pictures of hands in this position to get a sense of what looks more natural. Draw different gestures to become an anime-hand expert. Start by mimicking some of your favorite drawings until you can copy them perfectly, and then start creating ones of your own. Practice some of these common gestures so you can create dynamic characters in all kinds of situations:\nPeace sign\nHigh five\nHandshake\nFist clenched at the side\nHand holding a rounded object, like an apple\nThumbs up\nPointing at something",
    "sentences": [
        " Drawing an Open-Palm Hand Form the palm by drawing a rounded rectangle.",
        "Use light, short strokes as you begin your sketch—there will be plenty of time to make it look more defined later on.",
        "Look at your hand for reference and see how one side is a little rounder than the other.",
        "Replicate that shape on your paper, completely ignoring your thumb and fingers for now.",
        "It can help to study your hand or pictures of hands as you work on your drawing.",
        "In anime, female hands tend to be on the smaller and slimmer side, whereas male hands are a bit larger so they look more intimidating.",
        "Draw 5 circles on the palm where each finger and thumb will be.",
        "Place the pinky-ring knuckle circle on the edge of the palm.",
        "Make it the lowest circle with the ring, middle, and pointer-finger knuckles all placed slightly higher than it.",
        "Place the knuckle circles side by side so their edges are touching.",
        "To position the thumb:\nWhen drawing the back of the right hand: place the thumb-knuckle circle on the left-hand side of the palm, about halfway down the side or lower.",
        "When drawing the front of the right hand: place the thumb-knuckle on the right-hand side of the palm, about halfway down the side or lower.",
        "This position is also palm-side up.",
        "When drawing the back of the left hand: place the thumb-knuckle on the right-hand side of the palm, about halfway down the side or lower.",
        "When drawing the front of the left hand: place the thumb-knuckle on the left-hand side of the palm, about halfway down the side or lower.",
        "This is the palm-up position.",
        "Sketch the fingers based off of the knuckle circles you drew.",
        "Use the knuckle circles as a reference for where each finger should be positioned on the palm.",
        "Draw the middle finger first since it’s the longest, then use that length as a reference for drawing the rest of the fingers.",
        "Use short, gentle strokes to form the sides and tips of each finger to establish each one’s general shape.",
        "In anime, extended fingers can look like realistic fingers, or they can be longer and more slender than what you see in the real world.",
        "Feel free to play around with the proportions so that the aesthetic matches the rest of the character you’re drawing.",
        "You could also start by drawing the pointer finger.",
        "It’s often about the same length as the palm itself, so that could help you get your proportions right if you want the hand to look realistic.",
        "Draw the thumb coming out of the bottom circle.",
        "Make the thumb mostly straight on the outside and slightly curved on the inside so it doesn’t look too stiff.",
        "Curve the top edge of the thumb to mirror how your actual thumb looks.",
        "If you make a mistake, just erase it and start over.",
        "Try making the thumb longer or shorter to see what you like best.",
        "Make small circles on the fingers to represent the middle and top knuckles.",
        "Do this to add some visual dimension to the hand you’re drawing—seeing the circles will help you visualize the way fingers bend, which will make it easier to fill in smaller details later on.",
        "Make the top-knuckle circles the smallest and the middle-knuckle circles slightly bigger than that.",
        "Doing this can also help you see if any of the fingers are skewed in length or spacing.",
        "Outline the actual hand, including the thumb, fingers, and palm.",
        "After your general sketch is done, take your pencil and go over the shape of the hand with light, short strokes.",
        "Fill out the sides and tops of each finger and continue reinforcing all sides of the palm.",
        "If you feel confident, try using a pen or marker for this final outline of the palm and fingers.",
        "It will make it easier to erase your sketch lines without losing any of the outline later on.",
        "Make sure to wait until the ink is dry before erasing any of the sketch lines so the drawing doesn’t smudge.",
        "Add shading, wrinkling, and knuckle creases to make the hand lifelike.",
        "Take a look at your palm and observe all the lines it makes as you move it.",
        "You could draw creases where each knuckle should be to show the hand is slightly bent, and you could add palm lines to make it more detailed.",
        "Anime hands are usually a little less detailed than “real” hands, so your drawing won’t suffer if you don’t include as much detail.",
        "Anime eyes, hair, and clothes are the most detailed parts of any anime drawing.",
        "Erase the knuckle circles and other interior lines in the palm.",
        "Use your eraser to carefully remove each circle you drew for the knuckles.",
        "You should also erase the line that separates each finger from the palm so that everything is connected.",
        "If you used marker or pen, wait for it to dry completely before erasing any lines so your drawing doesn’t smear.Tip: If you accidentally erase part of an actual finger or the palm, just go ahead and sketch it back into place.",
        "Creating Different Gestures Make a clenched fist.",
        "Decide if you want to draw a fist viewed from the side, the top, or the bottom.",
        "Sketch a rounded rectangle for the palm first, then draw circles where the knuckle for each finger rests on the palm.",
        "From there, sketch the shape of each finger so it mimics how it lays on the palm in real life.",
        "Keep in mind that fingers often lie flush against each other when you make a fist, so don’t add space between them.",
        "Remember to go back in and erase the circles and interior lines once you’re done so that the hand looks as seamless as possible.Tip: Use your hand or a picture for reference—it will be much easier to create the right shape if you have something else to look at!",
        "Even from anime character to anime character, you’ll see that the styles are different.",
        "Find something you like and mimic it until you can do it on your own.",
        "Practice drawing a hand holding an object.",
        "In anime, it’s common for characters to be holding swords, weapons, or other objects, so it’s safe to say at some point you’ll want to be able to draw this.",
        "It may take a little extra practice, but once you get the hang of this technique, you’ll feel confident in your drawing abilities!",
        "To draw a hand holding something:\nDraw the shape of a palm by making a rounded rectangle.",
        "Sketch the fingers and thumb as if you were drawing a closed fist.",
        "Add the actual object extending from either side of the fist (it’s okay if you draw over the fingers—you can always erase those lines later).",
        "Clean up your sketch by erasing knuckle circles and extra lines and add more definitive pencil strokes to outline the hand and object.",
        "Draw a relaxed hand hanging down at someone’s side.",
        "Start by sketching a rounded rectangle to represent the side of the palm.",
        "Draw a second smaller rounded rectangle that overlaps the first one to create the base for the thumb.",
        "Sketch the thumb and pointer finger; make the tip of the thumb end opposite of the pointer finger’s middle knuckle.",
        "Add the tips of the middle, ring, and pinky fingers behind the pointer finger by drawing curved lines that extend toward the thumb.",
        "You can do this by practicing drawing the hand on its own, or draw an anime character and practice sketching the hand from there.",
        "When the hand is in a naturally relaxed position, you should see 3 or 4 fingers from the side, though just parts of each finger.",
        "Study pictures of hands in this position to get a sense of what looks more natural.",
        "Draw different gestures to become an anime-hand expert.",
        "Start by mimicking some of your favorite drawings until you can copy them perfectly, and then start creating ones of your own.",
        "Practice some of these common gestures so you can create dynamic characters in all kinds of situations:\nPeace sign\nHigh five\nHandshake\nFist clenched at the side\nHand holding a rounded object, like an apple\nThumbs up\nPointing at something"
    ]
}