{
    "title": "How to Dress Like a Doctor",
    "url": "https://www.wikihow.com/Dress-Like-a-Doctor",
    "category_hierarchy": [
        "Arts and Entertainment"
    ],
    "steps": [
        {
            "headline": "Find a cute v-neck shirt and matching colored pants to look like scrubs.",
            "description": "Light blue and green are good colors. Remember nurses and surgeons wear scrubs too so add a name badge saying Dr. Jones if you like. If you want real scrubs, find a local store that sells them."
        },
        {
            "headline": "Go to a store to find a first aid kit.",
            "description": "This can imitate things that a doctor might have or carry around. You can also get a pretend one. A stethoscope is a classic item make doctors carry."
        },
        {
            "headline": "Find a lab coat or something to imitate one.",
            "description": "Maybe a long white coat or jacket."
        },
        {
            "headline": "Style your hair like a doctor.",
            "description": "Those with long hair may want to wear their hair back or up."
        },
        {
            "headline": "Put your kit together.",
            "description": "Make it organized well. A doctor should always organized."
        },
        {
            "headline": "Put your clothes on and then the lab coat.",
            "description": "Make sure there are no wrinkles or creases."
        },
        {
            "headline": "Be neat.",
            "description": "A doctor should never be dirty. Cut your nails, comb your hair, brush your teeth, and wash your hands between \"patients\"."
        },
        {
            "headline": "Wear plastic gloves.",
            "description": "Doctors don't like passing germs. They always wear gloves to protect their patents. Find plastic gloves at a pharmacy or Dollar Tree. They are really cheap and you might already have some."
        },
        {
            "headline": "Have a stethoscope around your neck.",
            "description": "Some doctors wear a stethoscope around their necks for fast and easy access. Real stethoscopes are pretty pricey, but fake, plastic, and pretend ones are a few bucks."
        },
        {
            "headline": "Look sophisticated.",
            "description": "Play and act like a doctor. Take some photos acting as a doctor."
        },
        {
            "headline": "Remember lots of doctors go to work in ordinary clothes.",
            "description": "General Practitioners who deal with a wide variety of patients in clinics or health centres usually dress conventionally, like any adult going to work in an office. A doctor in private practice might wear a suit at work and someone who works with children might wear a fun tie, some funky socks or a colorful shirt to bring a little cheer to poorly children."
        }
    ],
    "tyn": [
        "A v-neck shirt",
        "Pants",
        "A ponytail holder, hair clip, etc."
    ],
    "text": " Find a cute v-neck shirt and matching colored pants to look like scrubs. Light blue and green are good colors. Remember nurses and surgeons wear scrubs too so add a name badge saying Dr. Jones if you like. If you want real scrubs, find a local store that sells them. Go to a store to find a first aid kit. This can imitate things that a doctor might have or carry around. You can also get a pretend one. A stethoscope is a classic item make doctors carry. Find a lab coat or something to imitate one. Maybe a long white coat or jacket. Style your hair like a doctor. Those with long hair may want to wear their hair back or up. Put your kit together. Make it organized well. A doctor should always organized. Put your clothes on and then the lab coat. Make sure there are no wrinkles or creases. Be neat. A doctor should never be dirty. Cut your nails, comb your hair, brush your teeth, and wash your hands between \"patients\". Wear plastic gloves. Doctors don't like passing germs. They always wear gloves to protect their patents. Find plastic gloves at a pharmacy or Dollar Tree. They are really cheap and you might already have some. Have a stethoscope around your neck. Some doctors wear a stethoscope around their necks for fast and easy access. Real stethoscopes are pretty pricey, but fake, plastic, and pretend ones are a few bucks. Look sophisticated. Play and act like a doctor. Take some photos acting as a doctor. Remember lots of doctors go to work in ordinary clothes. General Practitioners who deal with a wide variety of patients in clinics or health centres usually dress conventionally, like any adult going to work in an office. A doctor in private practice might wear a suit at work and someone who works with children might wear a fun tie, some funky socks or a colorful shirt to bring a little cheer to poorly children.",
    "sentences": [
        " Find a cute v-neck shirt and matching colored pants to look like scrubs.",
        "Light blue and green are good colors.",
        "Remember nurses and surgeons wear scrubs too so add a name badge saying Dr. Jones if you like.",
        "If you want real scrubs, find a local store that sells them.",
        "Go to a store to find a first aid kit.",
        "This can imitate things that a doctor might have or carry around.",
        "You can also get a pretend one.",
        "A stethoscope is a classic item make doctors carry.",
        "Find a lab coat or something to imitate one.",
        "Maybe a long white coat or jacket.",
        "Style your hair like a doctor.",
        "Those with long hair may want to wear their hair back or up.",
        "Put your kit together.",
        "Make it organized well.",
        "A doctor should always organized.",
        "Put your clothes on and then the lab coat.",
        "Make sure there are no wrinkles or creases.",
        "Be neat.",
        "A doctor should never be dirty.",
        "Cut your nails, comb your hair, brush your teeth, and wash your hands between \"patients\".",
        "Wear plastic gloves.",
        "Doctors don't like passing germs.",
        "They always wear gloves to protect their patents.",
        "Find plastic gloves at a pharmacy or Dollar Tree.",
        "They are really cheap and you might already have some.",
        "Have a stethoscope around your neck.",
        "Some doctors wear a stethoscope around their necks for fast and easy access.",
        "Real stethoscopes are pretty pricey, but fake, plastic, and pretend ones are a few bucks.",
        "Look sophisticated.",
        "Play and act like a doctor.",
        "Take some photos acting as a doctor.",
        "Remember lots of doctors go to work in ordinary clothes.",
        "General Practitioners who deal with a wide variety of patients in clinics or health centres usually dress conventionally, like any adult going to work in an office.",
        "A doctor in private practice might wear a suit at work and someone who works with children might wear a fun tie, some funky socks or a colorful shirt to bring a little cheer to poorly children."
    ]
}