{
    "title": "How to Make a Paper Wreath",
    "url": "https://www.wikihow.com/Make-a-Paper-Wreath",
    "category_hierarchy": [
        "Hobbies and Crafts",
        "Crafts",
        "Decoration Projects",
        "Wreath Projects"
    ],
    "methods": [
        {
            "name": "Making the Wreath Base",
            "steps": [
                {
                    "headline": "Find two different-sized plates to trace around.",
                    "description": "You want a 5 to 6-inch (cc to cc-centimeter) difference between them. The finished wreath will be about the same size as the large plate. You can also use bowls for this instead."
                },
                {
                    "headline": "Trace your plate onto a sheet of poster paper or thin cardboard.",
                    "description": "Place your large plate upside down onto a sheet of poster paper or thin cardboard. Use a pencil or pen to trace around it. Put the plate away when you are done."
                },
                {
                    "headline": "Trace your smaller plate inside of the larger one.",
                    "description": "Place the smaller plate down onto the center of the circle you just drew, and check to see if the thickness of the border suits you. If it is too thin, choose a smaller plate; if it is too thick, choose a bigger plate. Once you are happy with the size, trace around your plate, then put the plate away."
                },
                {
                    "headline": "Cut out the base for your wreath using a craft blade.",
                    "description": "Start by cutting out the larger circle, then the smaller one. When you are done, discard the inner circle so that you are left with a wreath shape. Be sure to work on top of a cutting mat so that you don't ruin your table."
                },
                {
                    "headline": "Paint the wreath base, if needed.",
                    "description": "Chances are, the leaves will be covering most of your wreath base. There may be some gaps, but this should not be a problem if the colors of your wreath base and leaves are similar. If your wreath base contrasts sharply with your leaves, however (ie: you used neon green poster paper for your wreath and your leaves are red and orange), then you might want to paint it to make any gaps less noticeable. You can paint the wreath base using acrylic paint and a paintbrush, or you can spray paint it instead."
                }
            ]
        },
        {
            "name": "Making the Leaves",
            "steps": [
                {
                    "headline": "Draw some leaf shapes onto a sheet of thin cardboard.",
                    "description": "If you don't know how to draw, gather some leaves from outside, and trace their shapes instead. You can also find some leaf outlines online, print them out, and glue them to the cardboard. You only need one of each leaf shape. What shape you use depends on what sort of leaf you are making. For example, holly leaves are perfect for winter, while maple and oak leaves are great for fall."
                },
                {
                    "headline": "Cut your leaf templates out using a craft blade.",
                    "description": "Make sure that you cut on top of a cutting mat so that you don't ruin your table. Also, try to be as neat as possible. This is what the rest of your leaves will look like."
                },
                {
                    "headline": "Use the template to trace leaf shapes onto some paper.",
                    "description": "You can use just about any type of paper for this, including old book pages, scrapbooking paper, wrapping paper, and even construction paper. Consider using some glittered or metallic scrapbooking paper for a few leaves. This will give your wreath a touch of sparkle! Consider using some accent or contrasting colors. For example, if your wreath has lots of blues, greens, and purples, consider adding some gold or bronze accent colors as well."
                },
                {
                    "headline": "Cut your leaves out.",
                    "description": "If you using thin paper, you can stack 2 to 3 sheets of paper, and cut through them at the same time. This will save you lots of time. You can use a pair of scissors for this, but a craft blade will give you the most precision. Keep organized by separating your leaves into piles based on shape. How many leaves you cut will depend on your design, the size of your leaves, and the size of your wreath base."
                },
                {
                    "headline": "Fold your leaves in half lengthwise, then unfold them, to create a crease.",
                    "description": "This will give your leaves some dimension and make them look more organic and realistic. Don't fold glittered paper. It is too thick to fold, and the glitter may fall off."
                },
                {
                    "headline": "Dress up the leaves further, if desired, then let them dry before moving on.",
                    "description": "Your leaves are ready to go at this point, but you can decorate some of them further to make your wreath look more interesting. Avoid decorating all of your leaves, or all those lovely little details you added will be lost. Choose a few leaves, then consider decorating them further with glitter or paint. Listed below are some ideas to get you started:\nDraw veins on some of the leaves with glitter glue. This will make your leaves more interesting to look at. Don't overdo it, however! Outline some of the edges with glitter glue or a metallic pen for a gilded look. Use a sponge and some distressing ink, watercolor, or watered down paint to lightly shade the edges of your leaves. This will give them a distressed look as well as some texture. Be careful not to overdo it, however!"
                }
            ]
        },
        {
            "name": "Putting Everything Together",
            "steps": [
                {
                    "headline": "Glue down several leaves onto your paper wreath base.",
                    "description": "You can use tacky glue, a glue stick, or even hot glue. Leave some gaps between the leaves, but glue them down at different angles. Only put the glue to one side of the crease, so that your leaf still sticks up. If you over the entire back of the leaf with glue, it won't be three-dimensional anymore. Consider starting with your larger, darker-colored leaves. This will lay down the foundation for your wreath, and give you more surface area to work with. If you made any leaves out of gold or sparkly paper, consider gluing those down first."
                },
                {
                    "headline": "Start filling in the gaps with more leaves.",
                    "description": "Use smaller and smaller leaves as you go, and don't forget to overlap some of them. Also, try to place different shapes and colors together. This will make your wreath look more realistic and interesting. If you have scraps of paper left over and some gaps that are too small to fill with leaves, consider cutting some other nature shapes, such as seed pods, pinecones, acorns, and berries. Use these to fill in any tiny gaps."
                },
                {
                    "headline": "Wait for the glue to set or dry.",
                    "description": "How long you wait will depend on what type of glue you used. If you used hot glue, this will only take a few seconds to a few minutes. If you used tacky glue, this could take a few hours."
                },
                {
                    "headline": "Cut a piece of string long enough to hang your wreath.",
                    "description": "How long you cut the string will depend on where you plan on hanging the wreath, and how low you want it to droop down. Choose a string that matches your wreath. For example, if your wreath looks rustic, a piece of yarn or jute cord would look great. If your wreath looks fancy or elegant, consider some satin or velvet ribbon instead."
                },
                {
                    "headline": "Attach the string to your wreath.",
                    "description": "There are lots of ways you can do this, and it all depends on what sort of look you want in the end. For example:\nIf your wreath is thin, simply bring one end of the string through the center hole of the wreath, then tie both ends together to create a loop. If your wreath is thick, turn the wreath over, then hot glue both ends of the string to the back of the wreath; keep the ends a few inches/centimeters apart."
                },
                {
                    "headline": "Hang your wreath from a door or window.",
                    "description": "Because this wreath is made out of paper, it would not be a good idea to hang it over a fireplace mantle. Also, if it snows or rains a lot where you live, remember to take the wreath inside, or the paper will warp."
                }
            ]
        }
    ],
    "tyn": [
        "Large plate",
        "Small plate",
        "Poster paper",
        "Pen or pencil",
        "Craft blade",
        "Scissors",
        "Scrapbooking paper, wrapping paper, or construction paper",
        "Glue",
        "String",
        "Paint (optional)",
        "Glitter (optional)"
    ],
    "text": " Making the Wreath Base Find two different-sized plates to trace around. You want a 5 to 6-inch (cc to cc-centimeter) difference between them. The finished wreath will be about the same size as the large plate. You can also use bowls for this instead. Trace your plate onto a sheet of poster paper or thin cardboard. Place your large plate upside down onto a sheet of poster paper or thin cardboard. Use a pencil or pen to trace around it. Put the plate away when you are done. Trace your smaller plate inside of the larger one. Place the smaller plate down onto the center of the circle you just drew, and check to see if the thickness of the border suits you. If it is too thin, choose a smaller plate; if it is too thick, choose a bigger plate. Once you are happy with the size, trace around your plate, then put the plate away. Cut out the base for your wreath using a craft blade. Start by cutting out the larger circle, then the smaller one. When you are done, discard the inner circle so that you are left with a wreath shape. Be sure to work on top of a cutting mat so that you don't ruin your table. Paint the wreath base, if needed. Chances are, the leaves will be covering most of your wreath base. There may be some gaps, but this should not be a problem if the colors of your wreath base and leaves are similar. If your wreath base contrasts sharply with your leaves, however (ie: you used neon green poster paper for your wreath and your leaves are red and orange), then you might want to paint it to make any gaps less noticeable. You can paint the wreath base using acrylic paint and a paintbrush, or you can spray paint it instead. Making the Leaves Draw some leaf shapes onto a sheet of thin cardboard. If you don't know how to draw, gather some leaves from outside, and trace their shapes instead. You can also find some leaf outlines online, print them out, and glue them to the cardboard. You only need one of each leaf shape. What shape you use depends on what sort of leaf you are making. For example, holly leaves are perfect for winter, while maple and oak leaves are great for fall. Cut your leaf templates out using a craft blade. Make sure that you cut on top of a cutting mat so that you don't ruin your table. Also, try to be as neat as possible. This is what the rest of your leaves will look like. Use the template to trace leaf shapes onto some paper. You can use just about any type of paper for this, including old book pages, scrapbooking paper, wrapping paper, and even construction paper. Consider using some glittered or metallic scrapbooking paper for a few leaves. This will give your wreath a touch of sparkle! Consider using some accent or contrasting colors. For example, if your wreath has lots of blues, greens, and purples, consider adding some gold or bronze accent colors as well. Cut your leaves out. If you using thin paper, you can stack 2 to 3 sheets of paper, and cut through them at the same time. This will save you lots of time. You can use a pair of scissors for this, but a craft blade will give you the most precision. Keep organized by separating your leaves into piles based on shape. How many leaves you cut will depend on your design, the size of your leaves, and the size of your wreath base. Fold your leaves in half lengthwise, then unfold them, to create a crease. This will give your leaves some dimension and make them look more organic and realistic. Don't fold glittered paper. It is too thick to fold, and the glitter may fall off. Dress up the leaves further, if desired, then let them dry before moving on. Your leaves are ready to go at this point, but you can decorate some of them further to make your wreath look more interesting. Avoid decorating all of your leaves, or all those lovely little details you added will be lost. Choose a few leaves, then consider decorating them further with glitter or paint. Listed below are some ideas to get you started:\nDraw veins on some of the leaves with glitter glue. This will make your leaves more interesting to look at. Don't overdo it, however! Outline some of the edges with glitter glue or a metallic pen for a gilded look. Use a sponge and some distressing ink, watercolor, or watered down paint to lightly shade the edges of your leaves. This will give them a distressed look as well as some texture. Be careful not to overdo it, however! Putting Everything Together Glue down several leaves onto your paper wreath base. You can use tacky glue, a glue stick, or even hot glue. Leave some gaps between the leaves, but glue them down at different angles. Only put the glue to one side of the crease, so that your leaf still sticks up. If you over the entire back of the leaf with glue, it won't be three-dimensional anymore. Consider starting with your larger, darker-colored leaves. This will lay down the foundation for your wreath, and give you more surface area to work with. If you made any leaves out of gold or sparkly paper, consider gluing those down first. Start filling in the gaps with more leaves. Use smaller and smaller leaves as you go, and don't forget to overlap some of them. Also, try to place different shapes and colors together. This will make your wreath look more realistic and interesting. If you have scraps of paper left over and some gaps that are too small to fill with leaves, consider cutting some other nature shapes, such as seed pods, pinecones, acorns, and berries. Use these to fill in any tiny gaps. Wait for the glue to set or dry. How long you wait will depend on what type of glue you used. If you used hot glue, this will only take a few seconds to a few minutes. If you used tacky glue, this could take a few hours. Cut a piece of string long enough to hang your wreath. How long you cut the string will depend on where you plan on hanging the wreath, and how low you want it to droop down. Choose a string that matches your wreath. For example, if your wreath looks rustic, a piece of yarn or jute cord would look great. If your wreath looks fancy or elegant, consider some satin or velvet ribbon instead. Attach the string to your wreath. There are lots of ways you can do this, and it all depends on what sort of look you want in the end. For example:\nIf your wreath is thin, simply bring one end of the string through the center hole of the wreath, then tie both ends together to create a loop. If your wreath is thick, turn the wreath over, then hot glue both ends of the string to the back of the wreath; keep the ends a few inches/centimeters apart. Hang your wreath from a door or window. Because this wreath is made out of paper, it would not be a good idea to hang it over a fireplace mantle. Also, if it snows or rains a lot where you live, remember to take the wreath inside, or the paper will warp.",
    "sentences": [
        " Making the Wreath Base Find two different-sized plates to trace around.",
        "You want a 5 to 6-inch (cc to cc-centimeter) difference between them.",
        "The finished wreath will be about the same size as the large plate.",
        "You can also use bowls for this instead.",
        "Trace your plate onto a sheet of poster paper or thin cardboard.",
        "Place your large plate upside down onto a sheet of poster paper or thin cardboard.",
        "Use a pencil or pen to trace around it.",
        "Put the plate away when you are done.",
        "Trace your smaller plate inside of the larger one.",
        "Place the smaller plate down onto the center of the circle you just drew, and check to see if the thickness of the border suits you.",
        "If it is too thin, choose a smaller plate; if it is too thick, choose a bigger plate.",
        "Once you are happy with the size, trace around your plate, then put the plate away.",
        "Cut out the base for your wreath using a craft blade.",
        "Start by cutting out the larger circle, then the smaller one.",
        "When you are done, discard the inner circle so that you are left with a wreath shape.",
        "Be sure to work on top of a cutting mat so that you don't ruin your table.",
        "Paint the wreath base, if needed.",
        "Chances are, the leaves will be covering most of your wreath base.",
        "There may be some gaps, but this should not be a problem if the colors of your wreath base and leaves are similar.",
        "If your wreath base contrasts sharply with your leaves, however (ie: you used neon green poster paper for your wreath and your leaves are red and orange), then you might want to paint it to make any gaps less noticeable.",
        "You can paint the wreath base using acrylic paint and a paintbrush, or you can spray paint it instead.",
        "Making the Leaves Draw some leaf shapes onto a sheet of thin cardboard.",
        "If you don't know how to draw, gather some leaves from outside, and trace their shapes instead.",
        "You can also find some leaf outlines online, print them out, and glue them to the cardboard.",
        "You only need one of each leaf shape.",
        "What shape you use depends on what sort of leaf you are making.",
        "For example, holly leaves are perfect for winter, while maple and oak leaves are great for fall.",
        "Cut your leaf templates out using a craft blade.",
        "Make sure that you cut on top of a cutting mat so that you don't ruin your table.",
        "Also, try to be as neat as possible.",
        "This is what the rest of your leaves will look like.",
        "Use the template to trace leaf shapes onto some paper.",
        "You can use just about any type of paper for this, including old book pages, scrapbooking paper, wrapping paper, and even construction paper.",
        "Consider using some glittered or metallic scrapbooking paper for a few leaves.",
        "This will give your wreath a touch of sparkle!",
        "Consider using some accent or contrasting colors.",
        "For example, if your wreath has lots of blues, greens, and purples, consider adding some gold or bronze accent colors as well.",
        "Cut your leaves out.",
        "If you using thin paper, you can stack 2 to 3 sheets of paper, and cut through them at the same time.",
        "This will save you lots of time.",
        "You can use a pair of scissors for this, but a craft blade will give you the most precision.",
        "Keep organized by separating your leaves into piles based on shape.",
        "How many leaves you cut will depend on your design, the size of your leaves, and the size of your wreath base.",
        "Fold your leaves in half lengthwise, then unfold them, to create a crease.",
        "This will give your leaves some dimension and make them look more organic and realistic.",
        "Don't fold glittered paper.",
        "It is too thick to fold, and the glitter may fall off.",
        "Dress up the leaves further, if desired, then let them dry before moving on.",
        "Your leaves are ready to go at this point, but you can decorate some of them further to make your wreath look more interesting.",
        "Avoid decorating all of your leaves, or all those lovely little details you added will be lost.",
        "Choose a few leaves, then consider decorating them further with glitter or paint.",
        "Listed below are some ideas to get you started:\nDraw veins on some of the leaves with glitter glue.",
        "This will make your leaves more interesting to look at.",
        "Don't overdo it, however!",
        "Outline some of the edges with glitter glue or a metallic pen for a gilded look.",
        "Use a sponge and some distressing ink, watercolor, or watered down paint to lightly shade the edges of your leaves.",
        "This will give them a distressed look as well as some texture.",
        "Be careful not to overdo it, however!",
        "Putting Everything Together Glue down several leaves onto your paper wreath base.",
        "You can use tacky glue, a glue stick, or even hot glue.",
        "Leave some gaps between the leaves, but glue them down at different angles.",
        "Only put the glue to one side of the crease, so that your leaf still sticks up.",
        "If you over the entire back of the leaf with glue, it won't be three-dimensional anymore.",
        "Consider starting with your larger, darker-colored leaves.",
        "This will lay down the foundation for your wreath, and give you more surface area to work with.",
        "If you made any leaves out of gold or sparkly paper, consider gluing those down first.",
        "Start filling in the gaps with more leaves.",
        "Use smaller and smaller leaves as you go, and don't forget to overlap some of them.",
        "Also, try to place different shapes and colors together.",
        "This will make your wreath look more realistic and interesting.",
        "If you have scraps of paper left over and some gaps that are too small to fill with leaves, consider cutting some other nature shapes, such as seed pods, pinecones, acorns, and berries.",
        "Use these to fill in any tiny gaps.",
        "Wait for the glue to set or dry.",
        "How long you wait will depend on what type of glue you used.",
        "If you used hot glue, this will only take a few seconds to a few minutes.",
        "If you used tacky glue, this could take a few hours.",
        "Cut a piece of string long enough to hang your wreath.",
        "How long you cut the string will depend on where you plan on hanging the wreath, and how low you want it to droop down.",
        "Choose a string that matches your wreath.",
        "For example, if your wreath looks rustic, a piece of yarn or jute cord would look great.",
        "If your wreath looks fancy or elegant, consider some satin or velvet ribbon instead.",
        "Attach the string to your wreath.",
        "There are lots of ways you can do this, and it all depends on what sort of look you want in the end.",
        "For example:\nIf your wreath is thin, simply bring one end of the string through the center hole of the wreath, then tie both ends together to create a loop.",
        "If your wreath is thick, turn the wreath over, then hot glue both ends of the string to the back of the wreath; keep the ends a few inches/centimeters apart.",
        "Hang your wreath from a door or window.",
        "Because this wreath is made out of paper, it would not be a good idea to hang it over a fireplace mantle.",
        "Also, if it snows or rains a lot where you live, remember to take the wreath inside, or the paper will warp."
    ]
}