{
    "title": "How to Make Organic Lotion",
    "url": "https://www.wikihow.com/Make-Organic-Lotion",
    "category_hierarchy": [
        "Personal Care and Style",
        "Cosmetics",
        "Handmade Cosmetics"
    ],
    "methods": [
        {
            "name": "Making the Base of Your Lotion",
            "steps": [
                {
                    "headline": "Pour the oil into a Pyrex measuring cup and then add the beeswax.",
                    "description": ""
                },
                {
                    "headline": "Set the Pyrex container in a saucepan.",
                    "description": ""
                },
                {
                    "headline": "Fill the pan with water until it reaches about halfway up the sides of the Pyrex container.",
                    "description": ""
                },
                {
                    "headline": "Heat on the stove.",
                    "description": "When the beeswax melts into the oil, remove the pan from the stove."
                },
                {
                    "headline": "Allow the mixture to cool for a minute, but be careful of the hardening beeswax.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Making the Lotion Creamier",
            "steps": [
                {
                    "headline": "Pour the cup of water into a blender and blend it on high speed.",
                    "description": ""
                },
                {
                    "headline": "By using a small opening in the top of the blender lid, pour your oil/beeswax mixture into the moving water.",
                    "description": "It will start to thicken as you pour the oil."
                }
            ]
        },
        {
            "name": "Finishing Up",
            "steps": [
                {
                    "headline": "Store the lotion.",
                    "description": "Pour the lotion in the blender into glass jars for storing. Make sure to get every last drop in the bottom of the blender!"
                },
                {
                    "headline": "Enjoy!",
                    "description": "This is a cheaper way to make quality oil right from home."
                }
            ]
        }
    ],
    "tyn": [
        "Glass or jar for storing the product",
        "A blender (any type will do)",
        "A Pyrex measuring cup",
        "Stove",
        "Saucepan"
    ],
    "text": " Making the Base of Your Lotion Pour the oil into a Pyrex measuring cup and then add the beeswax.  Set the Pyrex container in a saucepan.  Fill the pan with water until it reaches about halfway up the sides of the Pyrex container.  Heat on the stove. When the beeswax melts into the oil, remove the pan from the stove. Allow the mixture to cool for a minute, but be careful of the hardening beeswax.  Making the Lotion Creamier Pour the cup of water into a blender and blend it on high speed.  By using a small opening in the top of the blender lid, pour your oil/beeswax mixture into the moving water. It will start to thicken as you pour the oil. Finishing Up Store the lotion. Pour the lotion in the blender into glass jars for storing. Make sure to get every last drop in the bottom of the blender! Enjoy! This is a cheaper way to make quality oil right from home.",
    "sentences": [
        " Making the Base of Your Lotion Pour the oil into a Pyrex measuring cup and then add the beeswax.",
        "Set the Pyrex container in a saucepan.",
        "Fill the pan with water until it reaches about halfway up the sides of the Pyrex container.",
        "Heat on the stove.",
        "When the beeswax melts into the oil, remove the pan from the stove.",
        "Allow the mixture to cool for a minute, but be careful of the hardening beeswax.",
        "Making the Lotion Creamier Pour the cup of water into a blender and blend it on high speed.",
        "By using a small opening in the top of the blender lid, pour your oil/beeswax mixture into the moving water.",
        "It will start to thicken as you pour the oil.",
        "Finishing Up Store the lotion.",
        "Pour the lotion in the blender into glass jars for storing.",
        "Make sure to get every last drop in the bottom of the blender!",
        "Enjoy!",
        "This is a cheaper way to make quality oil right from home."
    ]
}