{
    "title": "How to Crush Garlic",
    "url": "https://www.wikihow.com/Crush-Garlic",
    "category_hierarchy": [
        "Food and Entertaining",
        "Herbs and Spices",
        "Garlic"
    ],
    "methods": [
        {
            "name": "Using a Knife",
            "steps": [
                {
                    "headline": "Remove the root.",
                    "description": "Place the garlic clove on a cutting board and use a knife to trim off the tip of the root. Do not cut away too much, or else you will lose good, usable garlic. Only remove the tip. Removing the root end will make it easier to remove the skin later on."
                },
                {
                    "headline": "Place the garlic clove on a cutting board.",
                    "description": "Make sure that it is near the edge of the board, on the side that is nearest to you."
                },
                {
                    "headline": "Place the flat side of a broad knife over the garlic clove.",
                    "description": "Make sure the blade is facing away from your hand."
                },
                {
                    "headline": "Use your hand to press the flat side of the knife against the clove.",
                    "description": "The clove will easily crush under your weight. Use a rocking motion to crush it thoroughly. The sharp blade should face out and away from the hand used to strike the knife. If holding the knife with your right hand, the blade should face right. If holding the knife with your left hand, the blade should face left."
                },
                {
                    "headline": "Peel the skin.",
                    "description": "The skin of the broken clove should be loosened and easy to peel away with your fingers."
                },
                {
                    "headline": "Prepare the garlic for cooking.",
                    "description": "You may crush it further, chop it, or mince it. To make a paste, strike it with the broad side of your knife until a paste forms. You should remove the exposed green shoots in the middle of the garlic clove. These shoots can be plucked out with your fingers. It is recommended that you remove them because they can taste bitter."
                }
            ]
        },
        {
            "name": "Using a Garlic Press",
            "steps": [
                {
                    "headline": "Peel off the skin.",
                    "description": "Trim the root end off the garlic clove to make the skin easier to remove. You can remove the skin in several ways. Press the clove with the heel of your hand. Applying a small amount of pressure to the garlic clove is enough to loosen the skin. Place the heel of your hand over the garlic clove and press down firmly until you feel the skin start to shift. Lift your hand and peel the skin off with your fingers. As described above, another way to loosen the skin is to press the garlic clove with the flat side of a broad knife. Position the side of the knife over the clove with the sharp blade away from your hand. Press firmly or pound slightly against the knife. You do not need to press hard, since you only want to loosen the skin instead of crushing the clove. You could also use a garlic peeler. This is a rubberized tool specifically designed to help you peel garlic. Place the garlic clove inside the tube and press down on the tube with the heel of your hand. Roll the tube back and forth until you hear a \"crunching\" sound. Tilt the tube slightly so that the garlic clove topples out. The skin should already be removed. Another way to peel garlic is to microwave the garlic clove. Place the clove in the microwave and cook for 5 to 10 seconds. The garlic clove will slide out of its skin. You can even peel entire heads or bulbs of garlic this way by putting them in for 15 to 20 seconds. Be aware, however, that this method could make the taste of the garlic slightly less pungent."
                },
                {
                    "headline": "Place the peeled garlic clove into a garlic press.",
                    "description": "Place the garlic inside the basket area of the press. The type of garlic press you use can have an effect on how well the process works. A higher quality press has nubs on it that make clearing garlic out of the holes easier, and you might be able to get more garlic out of each clove as a result. Even a lower quality press will usually be enough to crush the garlic sufficiently, though."
                },
                {
                    "headline": "Squeeze the press closed.",
                    "description": "Press the two handles together, applying as much pressure as you can. Depending on the quality and weight of your press, you may need to exert considerable force. A garlic press made from a heavier material will usually be easier to press together than one made of a light, flimsy material. The garlic that comes through the other side of the press will be crushed."
                }
            ]
        },
        {
            "name": "Using a Stone",
            "steps": [
                {
                    "headline": "Find a smooth stone.",
                    "description": "The stone should be roughly the same size as the palm of your hand. In principle, this works similar to the method of using a kitchen knife. The advantage is that you do not have to use a utensil with a sharp blade, and you can use this method when camping or backpacking. A smooth rock works much better than one with a jagged surface. The more even the surface is, the more evenly the garlic will be crushed."
                },
                {
                    "headline": "Clean the stone.",
                    "description": "Run it through the dishwasher two or three times to make sure that it is thoroughly clean. If you do not have a dishwasher or do not feel comfortable throwing stones in it, you can clean the rock by washing it in a solution of hot water, soap, and a small amount of bleach. Rinse well and dry well."
                },
                {
                    "headline": "Wrap the garlic in wax paper.",
                    "description": "Fold a small sheet of wax paper around the top and bottom of the garlic clove. This step is only optional, technically speaking, but it does help in keeping the process sanitary since the wax paper prevents the rock from coming into direct contact with the garlic. It also makes it easier to collect the crushed garlic afterward."
                },
                {
                    "headline": "Smack the garlic clove with the stone.",
                    "description": "Give the garlic clove a good smack with the stone, just enough to loosen the skin. Be careful as you do this so that you do not accidentally crush your fingers."
                },
                {
                    "headline": "Remove the skin.",
                    "description": "The skin should peel away easily after the first strike."
                },
                {
                    "headline": "Continue crushing the garlic with the stone.",
                    "description": "You can crush the garlic further by continuing to strike it or by grinding it. Crush the garlic by striking it multiple times with the stone. Place the stone over the garlic clove and \"wiggle\" it back and forth, applying strong, even pressure."
                }
            ]
        }
    ],
    "tyn": [
        "Broad kitchen knife",
        "Garlic press",
        "Microwave",
        "Garlic peeler",
        "Flat rock",
        "Wax paper"
    ],
    "text": " Using a Knife Remove the root. Place the garlic clove on a cutting board and use a knife to trim off the tip of the root. Do not cut away too much, or else you will lose good, usable garlic. Only remove the tip. Removing the root end will make it easier to remove the skin later on. Place the garlic clove on a cutting board. Make sure that it is near the edge of the board, on the side that is nearest to you. Place the flat side of a broad knife over the garlic clove. Make sure the blade is facing away from your hand. Use your hand to press the flat side of the knife against the clove. The clove will easily crush under your weight. Use a rocking motion to crush it thoroughly. The sharp blade should face out and away from the hand used to strike the knife. If holding the knife with your right hand, the blade should face right. If holding the knife with your left hand, the blade should face left. Peel the skin. The skin of the broken clove should be loosened and easy to peel away with your fingers. Prepare the garlic for cooking. You may crush it further, chop it, or mince it. To make a paste, strike it with the broad side of your knife until a paste forms. You should remove the exposed green shoots in the middle of the garlic clove. These shoots can be plucked out with your fingers. It is recommended that you remove them because they can taste bitter. Using a Garlic Press Peel off the skin. Trim the root end off the garlic clove to make the skin easier to remove. You can remove the skin in several ways. Press the clove with the heel of your hand. Applying a small amount of pressure to the garlic clove is enough to loosen the skin. Place the heel of your hand over the garlic clove and press down firmly until you feel the skin start to shift. Lift your hand and peel the skin off with your fingers. As described above, another way to loosen the skin is to press the garlic clove with the flat side of a broad knife. Position the side of the knife over the clove with the sharp blade away from your hand. Press firmly or pound slightly against the knife. You do not need to press hard, since you only want to loosen the skin instead of crushing the clove. You could also use a garlic peeler. This is a rubberized tool specifically designed to help you peel garlic. Place the garlic clove inside the tube and press down on the tube with the heel of your hand. Roll the tube back and forth until you hear a \"crunching\" sound. Tilt the tube slightly so that the garlic clove topples out. The skin should already be removed. Another way to peel garlic is to microwave the garlic clove. Place the clove in the microwave and cook for 5 to 10 seconds. The garlic clove will slide out of its skin. You can even peel entire heads or bulbs of garlic this way by putting them in for 15 to 20 seconds. Be aware, however, that this method could make the taste of the garlic slightly less pungent. Place the peeled garlic clove into a garlic press. Place the garlic inside the basket area of the press. The type of garlic press you use can have an effect on how well the process works. A higher quality press has nubs on it that make clearing garlic out of the holes easier, and you might be able to get more garlic out of each clove as a result. Even a lower quality press will usually be enough to crush the garlic sufficiently, though. Squeeze the press closed. Press the two handles together, applying as much pressure as you can. Depending on the quality and weight of your press, you may need to exert considerable force. A garlic press made from a heavier material will usually be easier to press together than one made of a light, flimsy material. The garlic that comes through the other side of the press will be crushed. Using a Stone Find a smooth stone. The stone should be roughly the same size as the palm of your hand. In principle, this works similar to the method of using a kitchen knife. The advantage is that you do not have to use a utensil with a sharp blade, and you can use this method when camping or backpacking. A smooth rock works much better than one with a jagged surface. The more even the surface is, the more evenly the garlic will be crushed. Clean the stone. Run it through the dishwasher two or three times to make sure that it is thoroughly clean. If you do not have a dishwasher or do not feel comfortable throwing stones in it, you can clean the rock by washing it in a solution of hot water, soap, and a small amount of bleach. Rinse well and dry well. Wrap the garlic in wax paper. Fold a small sheet of wax paper around the top and bottom of the garlic clove. This step is only optional, technically speaking, but it does help in keeping the process sanitary since the wax paper prevents the rock from coming into direct contact with the garlic. It also makes it easier to collect the crushed garlic afterward. Smack the garlic clove with the stone. Give the garlic clove a good smack with the stone, just enough to loosen the skin. Be careful as you do this so that you do not accidentally crush your fingers. Remove the skin. The skin should peel away easily after the first strike. Continue crushing the garlic with the stone. You can crush the garlic further by continuing to strike it or by grinding it. Crush the garlic by striking it multiple times with the stone. Place the stone over the garlic clove and \"wiggle\" it back and forth, applying strong, even pressure.",
    "sentences": [
        " Using a Knife Remove the root.",
        "Place the garlic clove on a cutting board and use a knife to trim off the tip of the root.",
        "Do not cut away too much, or else you will lose good, usable garlic.",
        "Only remove the tip.",
        "Removing the root end will make it easier to remove the skin later on.",
        "Place the garlic clove on a cutting board.",
        "Make sure that it is near the edge of the board, on the side that is nearest to you.",
        "Place the flat side of a broad knife over the garlic clove.",
        "Make sure the blade is facing away from your hand.",
        "Use your hand to press the flat side of the knife against the clove.",
        "The clove will easily crush under your weight.",
        "Use a rocking motion to crush it thoroughly.",
        "The sharp blade should face out and away from the hand used to strike the knife.",
        "If holding the knife with your right hand, the blade should face right.",
        "If holding the knife with your left hand, the blade should face left.",
        "Peel the skin.",
        "The skin of the broken clove should be loosened and easy to peel away with your fingers.",
        "Prepare the garlic for cooking.",
        "You may crush it further, chop it, or mince it.",
        "To make a paste, strike it with the broad side of your knife until a paste forms.",
        "You should remove the exposed green shoots in the middle of the garlic clove.",
        "These shoots can be plucked out with your fingers.",
        "It is recommended that you remove them because they can taste bitter.",
        "Using a Garlic Press Peel off the skin.",
        "Trim the root end off the garlic clove to make the skin easier to remove.",
        "You can remove the skin in several ways.",
        "Press the clove with the heel of your hand.",
        "Applying a small amount of pressure to the garlic clove is enough to loosen the skin.",
        "Place the heel of your hand over the garlic clove and press down firmly until you feel the skin start to shift.",
        "Lift your hand and peel the skin off with your fingers.",
        "As described above, another way to loosen the skin is to press the garlic clove with the flat side of a broad knife.",
        "Position the side of the knife over the clove with the sharp blade away from your hand.",
        "Press firmly or pound slightly against the knife.",
        "You do not need to press hard, since you only want to loosen the skin instead of crushing the clove.",
        "You could also use a garlic peeler.",
        "This is a rubberized tool specifically designed to help you peel garlic.",
        "Place the garlic clove inside the tube and press down on the tube with the heel of your hand.",
        "Roll the tube back and forth until you hear a \"crunching\" sound.",
        "Tilt the tube slightly so that the garlic clove topples out.",
        "The skin should already be removed.",
        "Another way to peel garlic is to microwave the garlic clove.",
        "Place the clove in the microwave and cook for 5 to 10 seconds.",
        "The garlic clove will slide out of its skin.",
        "You can even peel entire heads or bulbs of garlic this way by putting them in for 15 to 20 seconds.",
        "Be aware, however, that this method could make the taste of the garlic slightly less pungent.",
        "Place the peeled garlic clove into a garlic press.",
        "Place the garlic inside the basket area of the press.",
        "The type of garlic press you use can have an effect on how well the process works.",
        "A higher quality press has nubs on it that make clearing garlic out of the holes easier, and you might be able to get more garlic out of each clove as a result.",
        "Even a lower quality press will usually be enough to crush the garlic sufficiently, though.",
        "Squeeze the press closed.",
        "Press the two handles together, applying as much pressure as you can.",
        "Depending on the quality and weight of your press, you may need to exert considerable force.",
        "A garlic press made from a heavier material will usually be easier to press together than one made of a light, flimsy material.",
        "The garlic that comes through the other side of the press will be crushed.",
        "Using a Stone Find a smooth stone.",
        "The stone should be roughly the same size as the palm of your hand.",
        "In principle, this works similar to the method of using a kitchen knife.",
        "The advantage is that you do not have to use a utensil with a sharp blade, and you can use this method when camping or backpacking.",
        "A smooth rock works much better than one with a jagged surface.",
        "The more even the surface is, the more evenly the garlic will be crushed.",
        "Clean the stone.",
        "Run it through the dishwasher two or three times to make sure that it is thoroughly clean.",
        "If you do not have a dishwasher or do not feel comfortable throwing stones in it, you can clean the rock by washing it in a solution of hot water, soap, and a small amount of bleach.",
        "Rinse well and dry well.",
        "Wrap the garlic in wax paper.",
        "Fold a small sheet of wax paper around the top and bottom of the garlic clove.",
        "This step is only optional, technically speaking, but it does help in keeping the process sanitary since the wax paper prevents the rock from coming into direct contact with the garlic.",
        "It also makes it easier to collect the crushed garlic afterward.",
        "Smack the garlic clove with the stone.",
        "Give the garlic clove a good smack with the stone, just enough to loosen the skin.",
        "Be careful as you do this so that you do not accidentally crush your fingers.",
        "Remove the skin.",
        "The skin should peel away easily after the first strike.",
        "Continue crushing the garlic with the stone.",
        "You can crush the garlic further by continuing to strike it or by grinding it.",
        "Crush the garlic by striking it multiple times with the stone.",
        "Place the stone over the garlic clove and \"wiggle\" it back and forth, applying strong, even pressure."
    ]
}