{
    "title": "How to Have Fun During a Long Car Ride (Kids)",
    "url": "https://www.wikihow.com/Have-Fun-During-a-Long-Car-Ride-(Kids)",
    "category_hierarchy": [
        "Family Life"
    ],
    "methods": [
        {
            "name": "Activities",
            "steps": [
                {
                    "headline": "Read a book.",
                    "description": "This can work for some, as long as you don't get too carsick. If you feel carsick, stop reading. Get a active book that is full of action -- this should keep you occupied!"
                },
                {
                    "headline": "Take advantage of your technology.",
                    "description": "If you have an iPhone, iPad, or iPod, play games that don't require the Internet! Some good ones are Paintsparkle, talking friends apps, (some talking friends apps require money) including Tom Heart Angela, Talking Larry, (Talking Larry might require money, too), Talking Rex, Talking Lila, and Talking Hippo require money, other recommendations are the Garfield diner app, Pet Puppy, Angry Birds, Hungry Hippo, Zoom, Math Puppy. Watch a movie or two on your digital tablet or portable DVD player."
                },
                {
                    "headline": "Play with some toys.",
                    "description": "If you brought along some stuffed animals, play a game of show them around the outside of the car. You can also play with anything else you may have brought from home, such as dolls, barbies, etc."
                },
                {
                    "headline": "Listen to some music.",
                    "description": "Calming music will help you be Calm in the car rather than listening to rock music. Try classical, hymns, acapella, and more! Play around with different genres."
                },
                {
                    "headline": "Take photos of the view out the window.",
                    "description": ""
                }
            ]
        },
        {
            "name": "Interacting with others",
            "steps": [
                {
                    "headline": "Talk to your family.",
                    "description": "Share stories, remember funny events or memories, or discuss what you're going to do when you arrive at your destination. It will be nice to chat to family on phone so you can catch up what  you missed."
                },
                {
                    "headline": "Play some car games.",
                    "description": "Some great ones are I Spy, naming things you see that starts with each letter of the alphabet, making acronyms for license plates, playing hangman if you have some paper and a pencil or pen. Or anything else you can think of!"
                },
                {
                    "headline": "Sing songs together.",
                    "description": "Put music on through the car stereo and sing along. Or, just sing songs that all of you know. You might even teach your family some new ones. Bring a piece of paper and write down made up song lyrics. Let the kids try to write their own song and sing it to the beat of songs they know."
                }
            ]
        },
        {
            "name": "Refreshing yourself",
            "steps": [
                {
                    "headline": "Get some rest.",
                    "description": "If you're on a long car ride, make sure you take some time to catch up on sleep!"
                },
                {
                    "headline": "Have a snack.",
                    "description": "Make sure you're eating enough, but if it's a super long trip and you're family is stopping for a meal, don't overeat. Also make sure to stay hydrated unless you want a pounding headache."
                },
                {
                    "headline": "Drink water when you feel thirsty.",
                    "description": ""
                }
            ]
        }
    ],
    "tyn": [
        "Some books (optional)",
        "iPad, iPhone, or iPod (optional)",
        "Pillows",
        "Blankets",
        "Toys (optional)",
        "Clothing, both pajama, and daytime clothing",
        "Tooth brushes",
        "Pictures to remind you of home (if you get homesick easily)",
        "Medicine, but be sure to ask your parents first, (just in case you get sick, being sick is no fun)"
    ],
    "text": " Activities Read a book. This can work for some, as long as you don't get too carsick. If you feel carsick, stop reading. Get a active book that is full of action -- this should keep you occupied! Take advantage of your technology. If you have an iPhone, iPad, or iPod, play games that don't require the Internet! Some good ones are Paintsparkle, talking friends apps, (some talking friends apps require money) including Tom Heart Angela, Talking Larry, (Talking Larry might require money, too), Talking Rex, Talking Lila, and Talking Hippo require money, other recommendations are the Garfield diner app, Pet Puppy, Angry Birds, Hungry Hippo, Zoom, Math Puppy. Watch a movie or two on your digital tablet or portable DVD player. Play with some toys. If you brought along some stuffed animals, play a game of show them around the outside of the car. You can also play with anything else you may have brought from home, such as dolls, barbies, etc. Listen to some music. Calming music will help you be Calm in the car rather than listening to rock music. Try classical, hymns, acapella, and more! Play around with different genres. Take photos of the view out the window.  Interacting with others Talk to your family. Share stories, remember funny events or memories, or discuss what you're going to do when you arrive at your destination. It will be nice to chat to family on phone so you can catch up what  you missed. Play some car games. Some great ones are I Spy, naming things you see that starts with each letter of the alphabet, making acronyms for license plates, playing hangman if you have some paper and a pencil or pen. Or anything else you can think of! Sing songs together. Put music on through the car stereo and sing along. Or, just sing songs that all of you know. You might even teach your family some new ones. Bring a piece of paper and write down made up song lyrics. Let the kids try to write their own song and sing it to the beat of songs they know. Refreshing yourself Get some rest. If you're on a long car ride, make sure you take some time to catch up on sleep! Have a snack. Make sure you're eating enough, but if it's a super long trip and you're family is stopping for a meal, don't overeat. Also make sure to stay hydrated unless you want a pounding headache. Drink water when you feel thirsty. ",
    "sentences": [
        " Activities Read a book.",
        "This can work for some, as long as you don't get too carsick.",
        "If you feel carsick, stop reading.",
        "Get a active book that is full of action -- this should keep you occupied!",
        "Take advantage of your technology.",
        "If you have an iPhone, iPad, or iPod, play games that don't require the Internet!",
        "Some good ones are Paintsparkle, talking friends apps, (some talking friends apps require money) including Tom Heart Angela, Talking Larry, (Talking Larry might require money, too), Talking Rex, Talking Lila, and Talking Hippo require money, other recommendations are the Garfield diner app, Pet Puppy, Angry Birds, Hungry Hippo, Zoom, Math Puppy.",
        "Watch a movie or two on your digital tablet or portable DVD player.",
        "Play with some toys.",
        "If you brought along some stuffed animals, play a game of show them around the outside of the car.",
        "You can also play with anything else you may have brought from home, such as dolls, barbies, etc.",
        "Listen to some music.",
        "Calming music will help you be Calm in the car rather than listening to rock music.",
        "Try classical, hymns, acapella, and more!",
        "Play around with different genres.",
        "Take photos of the view out the window.",
        "Interacting with others Talk to your family.",
        "Share stories, remember funny events or memories, or discuss what you're going to do when you arrive at your destination.",
        "It will be nice to chat to family on phone so you can catch up what  you missed.",
        "Play some car games.",
        "Some great ones are I Spy, naming things you see that starts with each letter of the alphabet, making acronyms for license plates, playing hangman if you have some paper and a pencil or pen.",
        "Or anything else you can think of!",
        "Sing songs together.",
        "Put music on through the car stereo and sing along.",
        "Or, just sing songs that all of you know.",
        "You might even teach your family some new ones.",
        "Bring a piece of paper and write down made up song lyrics.",
        "Let the kids try to write their own song and sing it to the beat of songs they know.",
        "Refreshing yourself Get some rest.",
        "If you're on a long car ride, make sure you take some time to catch up on sleep!",
        "Have a snack.",
        "Make sure you're eating enough, but if it's a super long trip and you're family is stopping for a meal, don't overeat.",
        "Also make sure to stay hydrated unless you want a pounding headache.",
        "Drink water when you feel thirsty."
    ]
}