{
    "title": "How to Make Patterned Easter Eggs",
    "url": "https://www.wikihow.com/Make-Patterned-Easter-Eggs",
    "category_hierarchy": [
        "Holidays and Traditions",
        "Easter"
    ],
    "parts": [
        {
            "name": "Preparation",
            "steps": [
                {
                    "headline": "Hard boil eggs and allow them to cool.",
                    "description": "How many eggs you will boil is up to you, but don't boil more than what you have time to dye in one go."
                },
                {
                    "headline": "Find a suitable workspace for dying eggs.",
                    "description": "Although the dye will most likely not stain countertops or floors, it’s best to play it safe by covering the area with newspaper and/or finding a workspace that can handle this activity."
                },
                {
                    "headline": "Mix the dye according to package directions in the bowls.",
                    "description": "If you're supposed to boil the water, wait until it has cooled safely before dipping the eggs in it."
                },
                {
                    "headline": "Cut hosiery or fabric squares measuring approximately 5 to 6 inches (12.5-15cm).",
                    "description": "Check that the eggs will fit in those squares, with allowance left at the ends so you can tie it all together with a rubber band. If using pantyhose, cut a 5 inch (12.5cm) long tube for the egg to slip into, then knot off each end."
                }
            ]
        },
        {
            "name": "Dyeing the Boiled Eggs",
            "steps": [
                {
                    "headline": "Place the already boiled and cooled egg in the middle of the fabric and gather the excess fabric at the top.",
                    "description": "Tie the fabric together using the rubber band."
                },
                {
                    "headline": "Dip the egg into the dye.",
                    "description": "Hold the excess fabric and lower the egg into the dye. Leave the egg in the dye until the color comes through the hosiery."
                },
                {
                    "headline": "Remove the egg from the dye.",
                    "description": "Blot gently with paper towels. Allow the egg to rest on either the paper towel or in the empty egg carton while it’s drying. Leave the fabric intact during the drying process."
                },
                {
                    "headline": "Once the dye has dried, cut the rubber band releasing the egg from the fabric.",
                    "description": "Blot any excess dye, but be careful not to disturb the pattern that has been created."
                },
                {
                    "headline": "Finished.",
                    "description": "Repeat for as many eggs as you'd like to put on display."
                }
            ]
        }
    ],
    "tyn": [
        "Eggs",
        "Boiling water",
        "Egg dye",
        "Patterned hosiery, cheesecloth and/or lace fabric",
        "Paper towel or paper tissues",
        "Small bowls to hold dye",
        "Rubber bands",
        "Scissors",
        "An empty egg carton (optional)"
    ],
    "text": " Preparation Hard boil eggs and allow them to cool. How many eggs you will boil is up to you, but don't boil more than what you have time to dye in one go. Find a suitable workspace for dying eggs. Although the dye will most likely not stain countertops or floors, it’s best to play it safe by covering the area with newspaper and/or finding a workspace that can handle this activity. Mix the dye according to package directions in the bowls. If you're supposed to boil the water, wait until it has cooled safely before dipping the eggs in it. Cut hosiery or fabric squares measuring approximately 5 to 6 inches (12.5-15cm). Check that the eggs will fit in those squares, with allowance left at the ends so you can tie it all together with a rubber band. If using pantyhose, cut a 5 inch (12.5cm) long tube for the egg to slip into, then knot off each end. Dyeing the Boiled Eggs Place the already boiled and cooled egg in the middle of the fabric and gather the excess fabric at the top. Tie the fabric together using the rubber band. Dip the egg into the dye. Hold the excess fabric and lower the egg into the dye. Leave the egg in the dye until the color comes through the hosiery. Remove the egg from the dye. Blot gently with paper towels. Allow the egg to rest on either the paper towel or in the empty egg carton while it’s drying. Leave the fabric intact during the drying process. Once the dye has dried, cut the rubber band releasing the egg from the fabric. Blot any excess dye, but be careful not to disturb the pattern that has been created. Finished. Repeat for as many eggs as you'd like to put on display.",
    "sentences": [
        " Preparation Hard boil eggs and allow them to cool.",
        "How many eggs you will boil is up to you, but don't boil more than what you have time to dye in one go.",
        "Find a suitable workspace for dying eggs.",
        "Although the dye will most likely not stain countertops or floors, it’s best to play it safe by covering the area with newspaper and/or finding a workspace that can handle this activity.",
        "Mix the dye according to package directions in the bowls.",
        "If you're supposed to boil the water, wait until it has cooled safely before dipping the eggs in it.",
        "Cut hosiery or fabric squares measuring approximately 5 to 6 inches (12.5-15cm).",
        "Check that the eggs will fit in those squares, with allowance left at the ends so you can tie it all together with a rubber band.",
        "If using pantyhose, cut a 5 inch (12.5cm) long tube for the egg to slip into, then knot off each end.",
        "Dyeing the Boiled Eggs Place the already boiled and cooled egg in the middle of the fabric and gather the excess fabric at the top.",
        "Tie the fabric together using the rubber band.",
        "Dip the egg into the dye.",
        "Hold the excess fabric and lower the egg into the dye.",
        "Leave the egg in the dye until the color comes through the hosiery.",
        "Remove the egg from the dye.",
        "Blot gently with paper towels.",
        "Allow the egg to rest on either the paper towel or in the empty egg carton while it’s drying.",
        "Leave the fabric intact during the drying process.",
        "Once the dye has dried, cut the rubber band releasing the egg from the fabric.",
        "Blot any excess dye, but be careful not to disturb the pattern that has been created.",
        "Finished.",
        "Repeat for as many eggs as you'd like to put on display."
    ]
}