{
    "title": "How to Be a Snowboarder Girl",
    "url": "https://www.wikihow.com/Be-a-Snowboarder-Girl",
    "category_hierarchy": [
        "Sports and Fitness",
        "Individual Sports",
        "Snowboarding"
    ],
    "methods": [
        {
            "name": "Getting Comfortable on a Board",
            "steps": [
                {
                    "headline": "Come to the mountain prepared.",
                    "description": "Snowboarding is not something you can just run out the door and start practicing. You'll need a fair amount of gear to stay safe, warm, and stylish. While the style part is entirely up to you, there is some essential gear you need to have on hand to board. Remember that when getting dressed you can always remove a layer if you get hot. But a day at the mountain is going to get unpleasant quickly if you're cold and underdressed. The basics you need include:\nSnow pants or a snow bib. A snow jacket, waterproof and well-fit but not tight. It should go past your waist to keep snow out. A crash helmet for protection and warmth. On extra cold days you could put a hat underneath as well. Thermal layers, such as long johns, sports wear, or thick sweaters, underneath the jacket and pants. Thick, warm socks. Many people like a thin pair of moisture-wicking athletic socks under a thicker pair of warm socks. Snow gloves that can be tightened around your wrist to prevent snow from entering (gauntlet cuffs). Skiing or snowboarding goggles, to reduce glare and protect your eyes from particulate matter. Boots and a board, though these can be rented at the mountain if you're new to boarding."
                },
                {
                    "headline": "Rent a pair of boots and a board at your local board shop if you've never snowboarded.",
                    "description": "Nearly all mountains have a rental center as well, and they will fit you to the right board and boots. Snowboarding is not difficult, but it is expensive, so it is best to rent a few boards and try them out as you learn before spending money on a board. There are many different boards and styles on the market, so picking out one now, before you know what you want out of a board, may end up in wasted money. Let the rental center know that you are brand-new to the sport. They will take the time to measure you up, ensuring your first board fits you well."
                },
                {
                    "headline": "Strap your one foot into the front of the board.",
                    "description": "If you're right footed, usually your left foot goes into the front binding of the board so that your toes are pointing to the right. Make sure your heel is all the way back in the binding, then tightly clasp the bindings. Your dominant foot will be used to push you around, much like you were skateboarding, but you will lock it in before you start really snowboarding. If you're confused about what foot to put forward, put on a pair of socks and slide on a wood floor. Or jog up to a set of stairs and see what foot you step up with first. The foot you put forward here should be forward foot on your board. There are a variety of binding styles, but most of them use clasps or buckles and are easy to figure out. For beginners, try and get the bindings angled slightly forward."
                },
                {
                    "headline": "Push yourself to the ski-lift or bunny slope with your non-dominant foot.",
                    "description": "Unless you're taking a break, you will rarely need to unbuckle your front foot. Simple push off your free foot to \"skate\" around the mountain, getting you to the lifts so that you can head down the mountain. If you have a stomp pad, which is a grip-y, small rubber patch in the middle of your board, you can rest your free foot on this if you need to glide down small hills without buckling it."
                },
                {
                    "headline": "Get ready for the lift by bending your knees and shifting your weight back.",
                    "description": "Getting on the lift is a bit intimidating at first, but all you're really doing is letting the lift scoop you up. Once you're in line, just bend your knees slightly, transferring your weight towards your butt like you're about to sit down. Once you feel the lift hit the back of your knees, just drop down like you're about to sit. Many beginner slopes have a \"Magic Carpet\" instead of a lift. This looks like a flattened escalator, and all you do is step on it so that it drags you up the mountain with ease."
                },
                {
                    "headline": "Buckle in your opposite foot on the lift so that you can get off easily.",
                    "description": "While riding up buckle your free foot in, even if it is only lightly. As you approach the top, angle the board so that it faces forward, then simply stand up once the lift reaches the top. The momentum of the lift will push you forward and out of the way, then you can just let yourself glide down the slope at the top of the lift towards the top of the mountain. If you have a stomp pad you can use that instead of buckling the back foot. You might unbuckle again after you've gotten off the lift, then \"skate\" your way to the top of the slope."
                }
            ]
        },
        {
            "name": "Heading Down the Slope",
            "steps": [
                {
                    "headline": "Adopt a comfortable, athletic stance.",
                    "description": "When boarding you want to make sure you are always in full control. While you'll bend and lean as you ride, you need to start all of your movements from a strong and athletic position to really act like a snowboarder girl. To do so:\nBend both knees slightly, like a soccer or basketball player in a defensive stance. Keep your shoulders down and over your feet. Have your spine straight and your torso upright."
                },
                {
                    "headline": "Learn to edge.",
                    "description": "Edging is the most important skill for a snowboarder, and it is simply when you dig one edge of the board into the snow, as this is how you turn and control speed. Most of your time going down the mountain will be spent on edge, so get used to this now. To practice the balance needed for edging:\nShift your weight forward, over your toes. Stand up a bit, like on tip-toes, so that you can feel the heel side of your board picking up. Hold your balance on the edge as long as you can. Switch sides and try it on your heel edge. This can be done on flat ground or gentle, beginner slopes. If you're worried about balance, unbuckle your back foot and use it to catch yourself when you fall."
                },
                {
                    "headline": "Push down on your front foot to head down the slope.",
                    "description": "Once you're comfortable with some edging it's time to ride. Set up on top of the the beginner slope, which is generally wide, slow, and has a large flat bottom to help you stop slowly. A lot of riders like to sit on the edge and bind in, then stand up with the board facing down the hill. Push down on your front foot, like you were smashing a bug, and let gravity do the rest. Keep your athletic stance as you head down the mountain. Knees slightly bent, torso straight, head up. For the first 1-2 runs, don't worry too much about turning. Simply get used to heading down the mountain."
                },
                {
                    "headline": "Practice basic stops.",
                    "description": "As you come down to the end of the mountain, put light pressure on your heel or toe edge. Feel yourself start to turn and slow down. Practice on both edges, using the flatter part near the bottom of the slope for the most comfortable practice. Get used to both edges. How long does it take to stop when on your heel edge? What about your toe edge? As you get comfortable, start edging further and further up the mountain. Edging takes you across the slope, naturally slowing you down, and is the building block of sharper turns."
                },
                {
                    "headline": "Turn by leaning into an edge with your feet and torso.",
                    "description": "Once you feel good edging on both sides, it is time to start turning. As you head down the mountain, lean into the edge you want to turn towards (leaning towards you heel will turn you towards your heel). As you do, rotate your shoulders towards the turn as well, which opens up your body and moves some weight over to the side you're turning. Start on one side of the mountain and practice heading down diagonally, working on this turn as you feel comfortable. Practice on both sides. Once you feel comfortable with both sides, try changing direction. Slowly lean off your heel edge and lean towards your toes, rotating your shoulders along with you."
                },
                {
                    "headline": "Practice until you can edge on a dime.",
                    "description": "As you get more comfortable you'll pick up speed on your turns and stops, quickly shifting from edge to edge. You should be able to zig-zag down the hill eventually, showing that you have the control to turn and stop on a dime. A full stop is just an extreme \"heel-edge.\" You lean so hard into your heel edge, so quickly, that you whip the board around horizontally. This digs the heel edge of your board into the snow to stop it."
                },
                {
                    "headline": "Remember that your first day of boarding is all about comfort, not looking impressive.",
                    "description": "Very few people look good on their first day of boarding. The sport can be incredibly frustrating if you expect to look like a life-long snow bunny on your first runs. Focus, instead, on board comfort, getting used to basic riding, turning, and stopping so that you can move fluidly anywhere on the mountain. The tricks, speed, and flash will only come after you've mastered these basics."
                }
            ]
        },
        {
            "name": "Snowboarding Stylishly",
            "steps": [
                {
                    "headline": "Know that a snowboard girl is simply a girl who snowboards.",
                    "description": "That's it. While the snowboarding world is typically male-dominated, there is nothing special you have to do or wear that makes you a snowboard girl. Just go snowboard. Get to know the trails on your mountain, find a board you love, and spend time out on the snow whenever possible. If you get out there and ride, you're a snowboard girl. Snowboarding is slowly becoming a more accessible culture to join into. That said, most snowboarders still have little time or respect for \"posers,\" or people who wear snowboard styles but never actually board."
                },
                {
                    "headline": "Buy your own board.",
                    "description": "Get an \"all-mountain board\" if you are a beginner. All-mountains can be used for slopes and terrain parks, and they blend speed and maneuverability well. This makes them perfect for new riders. Size: Stand the board up on its end, so that the top reaches between your nose and chin. Directional Twin-Tip Both ends are almost identical, rounded tips. Camber Type: Beginner riders should try a rocker-style board (the profile of the board curves upward) because of the added maneuverability and turning forgiveness."
                },
                {
                    "headline": "Find amazing snowboarding role models.",
                    "description": "There are many amazing women of snowboarding that can carve a mountain with the best men any day. Watching snowboarding and finding women you can look up to is a great way to see snowboard girls in action. Watch the Winter Olympics and X-Games, where snowboarders of both genders are often some of the main attractions. Check snowboard blogs, specifically those revolving around women boarders like Burton Girls."
                },
                {
                    "headline": "Learn some snowboarding styles.",
                    "description": "Though it is almost completely cosmetic, snowboarders and skiers have traditionally worn different styles on the mountain. Snowboard style is directly influenced by skateboarding and street styles, often featuring brighter colors and bold, graffiti/urban-inspired designs. You should, of course, wear what you like, but snowboarders typically aim for alternative or youthful clothing. Snowboarding initially adopted a lot of influences from punks and rock culture but has since involved to include a lot of hip-hop influences. Check out the latest styles from brands like Burton, O'Neill, Thirty Two, and more."
                },
                {
                    "headline": "Avoid makeup on the mountain.",
                    "description": "Snowboard girls aren't there to pose, they are there to ride and enjoy themselves. Makeup is not only unnecessary, as it will be mostly covered up by goggles and hats, it will more than likely be smeared off within 1-2 runs. Sweat, snow, and the occasional fall are going to get you a little dirty, but that's half the fun. Save the makeup for the after party and focus more on your boarding than your looks."
                },
                {
                    "headline": "Watch snowboarding videos to get ideas for tricks, styles, and subculture.",
                    "description": "There is a rich snowboarding culture out there, and most of it is shared through videos and compilations. At one time, this involved sharing and copying old VHS tapes, but today's snowboarding girls can run to YouTube to watch amazing boarders at work. This is the best way to inundate yourself in snowboard culture. Watch and share your favorite videos with friends, try and replicate some of the tricks as you get more advanced and take style tips when you see something you like."
                }
            ]
        }
    ],
    "tyn": [
        "Snowboarding gear"
    ],
    "text": " Getting Comfortable on a Board Come to the mountain prepared. Snowboarding is not something you can just run out the door and start practicing. You'll need a fair amount of gear to stay safe, warm, and stylish. While the style part is entirely up to you, there is some essential gear you need to have on hand to board. Remember that when getting dressed you can always remove a layer if you get hot. But a day at the mountain is going to get unpleasant quickly if you're cold and underdressed. The basics you need include:\nSnow pants or a snow bib. A snow jacket, waterproof and well-fit but not tight. It should go past your waist to keep snow out. A crash helmet for protection and warmth. On extra cold days you could put a hat underneath as well. Thermal layers, such as long johns, sports wear, or thick sweaters, underneath the jacket and pants. Thick, warm socks. Many people like a thin pair of moisture-wicking athletic socks under a thicker pair of warm socks. Snow gloves that can be tightened around your wrist to prevent snow from entering (gauntlet cuffs). Skiing or snowboarding goggles, to reduce glare and protect your eyes from particulate matter. Boots and a board, though these can be rented at the mountain if you're new to boarding. Rent a pair of boots and a board at your local board shop if you've never snowboarded. Nearly all mountains have a rental center as well, and they will fit you to the right board and boots. Snowboarding is not difficult, but it is expensive, so it is best to rent a few boards and try them out as you learn before spending money on a board. There are many different boards and styles on the market, so picking out one now, before you know what you want out of a board, may end up in wasted money. Let the rental center know that you are brand-new to the sport. They will take the time to measure you up, ensuring your first board fits you well. Strap your one foot into the front of the board. If you're right footed, usually your left foot goes into the front binding of the board so that your toes are pointing to the right. Make sure your heel is all the way back in the binding, then tightly clasp the bindings. Your dominant foot will be used to push you around, much like you were skateboarding, but you will lock it in before you start really snowboarding. If you're confused about what foot to put forward, put on a pair of socks and slide on a wood floor. Or jog up to a set of stairs and see what foot you step up with first. The foot you put forward here should be forward foot on your board. There are a variety of binding styles, but most of them use clasps or buckles and are easy to figure out. For beginners, try and get the bindings angled slightly forward. Push yourself to the ski-lift or bunny slope with your non-dominant foot. Unless you're taking a break, you will rarely need to unbuckle your front foot. Simple push off your free foot to \"skate\" around the mountain, getting you to the lifts so that you can head down the mountain. If you have a stomp pad, which is a grip-y, small rubber patch in the middle of your board, you can rest your free foot on this if you need to glide down small hills without buckling it. Get ready for the lift by bending your knees and shifting your weight back. Getting on the lift is a bit intimidating at first, but all you're really doing is letting the lift scoop you up. Once you're in line, just bend your knees slightly, transferring your weight towards your butt like you're about to sit down. Once you feel the lift hit the back of your knees, just drop down like you're about to sit. Many beginner slopes have a \"Magic Carpet\" instead of a lift. This looks like a flattened escalator, and all you do is step on it so that it drags you up the mountain with ease. Buckle in your opposite foot on the lift so that you can get off easily. While riding up buckle your free foot in, even if it is only lightly. As you approach the top, angle the board so that it faces forward, then simply stand up once the lift reaches the top. The momentum of the lift will push you forward and out of the way, then you can just let yourself glide down the slope at the top of the lift towards the top of the mountain. If you have a stomp pad you can use that instead of buckling the back foot. You might unbuckle again after you've gotten off the lift, then \"skate\" your way to the top of the slope. Heading Down the Slope Adopt a comfortable, athletic stance. When boarding you want to make sure you are always in full control. While you'll bend and lean as you ride, you need to start all of your movements from a strong and athletic position to really act like a snowboarder girl. To do so:\nBend both knees slightly, like a soccer or basketball player in a defensive stance. Keep your shoulders down and over your feet. Have your spine straight and your torso upright. Learn to edge. Edging is the most important skill for a snowboarder, and it is simply when you dig one edge of the board into the snow, as this is how you turn and control speed. Most of your time going down the mountain will be spent on edge, so get used to this now. To practice the balance needed for edging:\nShift your weight forward, over your toes. Stand up a bit, like on tip-toes, so that you can feel the heel side of your board picking up. Hold your balance on the edge as long as you can. Switch sides and try it on your heel edge. This can be done on flat ground or gentle, beginner slopes. If you're worried about balance, unbuckle your back foot and use it to catch yourself when you fall. Push down on your front foot to head down the slope. Once you're comfortable with some edging it's time to ride. Set up on top of the the beginner slope, which is generally wide, slow, and has a large flat bottom to help you stop slowly. A lot of riders like to sit on the edge and bind in, then stand up with the board facing down the hill. Push down on your front foot, like you were smashing a bug, and let gravity do the rest. Keep your athletic stance as you head down the mountain. Knees slightly bent, torso straight, head up. For the first 1-2 runs, don't worry too much about turning. Simply get used to heading down the mountain. Practice basic stops. As you come down to the end of the mountain, put light pressure on your heel or toe edge. Feel yourself start to turn and slow down. Practice on both edges, using the flatter part near the bottom of the slope for the most comfortable practice. Get used to both edges. How long does it take to stop when on your heel edge? What about your toe edge? As you get comfortable, start edging further and further up the mountain. Edging takes you across the slope, naturally slowing you down, and is the building block of sharper turns. Turn by leaning into an edge with your feet and torso. Once you feel good edging on both sides, it is time to start turning. As you head down the mountain, lean into the edge you want to turn towards (leaning towards you heel will turn you towards your heel). As you do, rotate your shoulders towards the turn as well, which opens up your body and moves some weight over to the side you're turning. Start on one side of the mountain and practice heading down diagonally, working on this turn as you feel comfortable. Practice on both sides. Once you feel comfortable with both sides, try changing direction. Slowly lean off your heel edge and lean towards your toes, rotating your shoulders along with you. Practice until you can edge on a dime. As you get more comfortable you'll pick up speed on your turns and stops, quickly shifting from edge to edge. You should be able to zig-zag down the hill eventually, showing that you have the control to turn and stop on a dime. A full stop is just an extreme \"heel-edge.\" You lean so hard into your heel edge, so quickly, that you whip the board around horizontally. This digs the heel edge of your board into the snow to stop it. Remember that your first day of boarding is all about comfort, not looking impressive. Very few people look good on their first day of boarding. The sport can be incredibly frustrating if you expect to look like a life-long snow bunny on your first runs. Focus, instead, on board comfort, getting used to basic riding, turning, and stopping so that you can move fluidly anywhere on the mountain. The tricks, speed, and flash will only come after you've mastered these basics. Snowboarding Stylishly Know that a snowboard girl is simply a girl who snowboards. That's it. While the snowboarding world is typically male-dominated, there is nothing special you have to do or wear that makes you a snowboard girl. Just go snowboard. Get to know the trails on your mountain, find a board you love, and spend time out on the snow whenever possible. If you get out there and ride, you're a snowboard girl. Snowboarding is slowly becoming a more accessible culture to join into. That said, most snowboarders still have little time or respect for \"posers,\" or people who wear snowboard styles but never actually board. Buy your own board. Get an \"all-mountain board\" if you are a beginner. All-mountains can be used for slopes and terrain parks, and they blend speed and maneuverability well. This makes them perfect for new riders. Size: Stand the board up on its end, so that the top reaches between your nose and chin. Directional Twin-Tip Both ends are almost identical, rounded tips. Camber Type: Beginner riders should try a rocker-style board (the profile of the board curves upward) because of the added maneuverability and turning forgiveness. Find amazing snowboarding role models. There are many amazing women of snowboarding that can carve a mountain with the best men any day. Watching snowboarding and finding women you can look up to is a great way to see snowboard girls in action. Watch the Winter Olympics and X-Games, where snowboarders of both genders are often some of the main attractions. Check snowboard blogs, specifically those revolving around women boarders like Burton Girls. Learn some snowboarding styles. Though it is almost completely cosmetic, snowboarders and skiers have traditionally worn different styles on the mountain. Snowboard style is directly influenced by skateboarding and street styles, often featuring brighter colors and bold, graffiti/urban-inspired designs. You should, of course, wear what you like, but snowboarders typically aim for alternative or youthful clothing. Snowboarding initially adopted a lot of influences from punks and rock culture but has since involved to include a lot of hip-hop influences. Check out the latest styles from brands like Burton, O'Neill, Thirty Two, and more. Avoid makeup on the mountain. Snowboard girls aren't there to pose, they are there to ride and enjoy themselves. Makeup is not only unnecessary, as it will be mostly covered up by goggles and hats, it will more than likely be smeared off within 1-2 runs. Sweat, snow, and the occasional fall are going to get you a little dirty, but that's half the fun. Save the makeup for the after party and focus more on your boarding than your looks. Watch snowboarding videos to get ideas for tricks, styles, and subculture. There is a rich snowboarding culture out there, and most of it is shared through videos and compilations. At one time, this involved sharing and copying old VHS tapes, but today's snowboarding girls can run to YouTube to watch amazing boarders at work. This is the best way to inundate yourself in snowboard culture. Watch and share your favorite videos with friends, try and replicate some of the tricks as you get more advanced and take style tips when you see something you like.",
    "sentences": [
        " Getting Comfortable on a Board Come to the mountain prepared.",
        "Snowboarding is not something you can just run out the door and start practicing.",
        "You'll need a fair amount of gear to stay safe, warm, and stylish.",
        "While the style part is entirely up to you, there is some essential gear you need to have on hand to board.",
        "Remember that when getting dressed you can always remove a layer if you get hot.",
        "But a day at the mountain is going to get unpleasant quickly if you're cold and underdressed.",
        "The basics you need include:\nSnow pants or a snow bib.",
        "A snow jacket, waterproof and well-fit but not tight.",
        "It should go past your waist to keep snow out.",
        "A crash helmet for protection and warmth.",
        "On extra cold days you could put a hat underneath as well.",
        "Thermal layers, such as long johns, sports wear, or thick sweaters, underneath the jacket and pants.",
        "Thick, warm socks.",
        "Many people like a thin pair of moisture-wicking athletic socks under a thicker pair of warm socks.",
        "Snow gloves that can be tightened around your wrist to prevent snow from entering (gauntlet cuffs).",
        "Skiing or snowboarding goggles, to reduce glare and protect your eyes from particulate matter.",
        "Boots and a board, though these can be rented at the mountain if you're new to boarding.",
        "Rent a pair of boots and a board at your local board shop if you've never snowboarded.",
        "Nearly all mountains have a rental center as well, and they will fit you to the right board and boots.",
        "Snowboarding is not difficult, but it is expensive, so it is best to rent a few boards and try them out as you learn before spending money on a board.",
        "There are many different boards and styles on the market, so picking out one now, before you know what you want out of a board, may end up in wasted money.",
        "Let the rental center know that you are brand-new to the sport.",
        "They will take the time to measure you up, ensuring your first board fits you well.",
        "Strap your one foot into the front of the board.",
        "If you're right footed, usually your left foot goes into the front binding of the board so that your toes are pointing to the right.",
        "Make sure your heel is all the way back in the binding, then tightly clasp the bindings.",
        "Your dominant foot will be used to push you around, much like you were skateboarding, but you will lock it in before you start really snowboarding.",
        "If you're confused about what foot to put forward, put on a pair of socks and slide on a wood floor.",
        "Or jog up to a set of stairs and see what foot you step up with first.",
        "The foot you put forward here should be forward foot on your board.",
        "There are a variety of binding styles, but most of them use clasps or buckles and are easy to figure out.",
        "For beginners, try and get the bindings angled slightly forward.",
        "Push yourself to the ski-lift or bunny slope with your non-dominant foot.",
        "Unless you're taking a break, you will rarely need to unbuckle your front foot.",
        "Simple push off your free foot to \"skate\" around the mountain, getting you to the lifts so that you can head down the mountain.",
        "If you have a stomp pad, which is a grip-y, small rubber patch in the middle of your board, you can rest your free foot on this if you need to glide down small hills without buckling it.",
        "Get ready for the lift by bending your knees and shifting your weight back.",
        "Getting on the lift is a bit intimidating at first, but all you're really doing is letting the lift scoop you up.",
        "Once you're in line, just bend your knees slightly, transferring your weight towards your butt like you're about to sit down.",
        "Once you feel the lift hit the back of your knees, just drop down like you're about to sit.",
        "Many beginner slopes have a \"Magic Carpet\" instead of a lift.",
        "This looks like a flattened escalator, and all you do is step on it so that it drags you up the mountain with ease.",
        "Buckle in your opposite foot on the lift so that you can get off easily.",
        "While riding up buckle your free foot in, even if it is only lightly.",
        "As you approach the top, angle the board so that it faces forward, then simply stand up once the lift reaches the top.",
        "The momentum of the lift will push you forward and out of the way, then you can just let yourself glide down the slope at the top of the lift towards the top of the mountain.",
        "If you have a stomp pad you can use that instead of buckling the back foot.",
        "You might unbuckle again after you've gotten off the lift, then \"skate\" your way to the top of the slope.",
        "Heading Down the Slope Adopt a comfortable, athletic stance.",
        "When boarding you want to make sure you are always in full control.",
        "While you'll bend and lean as you ride, you need to start all of your movements from a strong and athletic position to really act like a snowboarder girl.",
        "To do so:\nBend both knees slightly, like a soccer or basketball player in a defensive stance.",
        "Keep your shoulders down and over your feet.",
        "Have your spine straight and your torso upright.",
        "Learn to edge.",
        "Edging is the most important skill for a snowboarder, and it is simply when you dig one edge of the board into the snow, as this is how you turn and control speed.",
        "Most of your time going down the mountain will be spent on edge, so get used to this now.",
        "To practice the balance needed for edging:\nShift your weight forward, over your toes.",
        "Stand up a bit, like on tip-toes, so that you can feel the heel side of your board picking up.",
        "Hold your balance on the edge as long as you can.",
        "Switch sides and try it on your heel edge.",
        "This can be done on flat ground or gentle, beginner slopes.",
        "If you're worried about balance, unbuckle your back foot and use it to catch yourself when you fall.",
        "Push down on your front foot to head down the slope.",
        "Once you're comfortable with some edging it's time to ride.",
        "Set up on top of the the beginner slope, which is generally wide, slow, and has a large flat bottom to help you stop slowly.",
        "A lot of riders like to sit on the edge and bind in, then stand up with the board facing down the hill.",
        "Push down on your front foot, like you were smashing a bug, and let gravity do the rest.",
        "Keep your athletic stance as you head down the mountain.",
        "Knees slightly bent, torso straight, head up.",
        "For the first 1-2 runs, don't worry too much about turning.",
        "Simply get used to heading down the mountain.",
        "Practice basic stops.",
        "As you come down to the end of the mountain, put light pressure on your heel or toe edge.",
        "Feel yourself start to turn and slow down.",
        "Practice on both edges, using the flatter part near the bottom of the slope for the most comfortable practice.",
        "Get used to both edges.",
        "How long does it take to stop when on your heel edge?",
        "What about your toe edge?",
        "As you get comfortable, start edging further and further up the mountain.",
        "Edging takes you across the slope, naturally slowing you down, and is the building block of sharper turns.",
        "Turn by leaning into an edge with your feet and torso.",
        "Once you feel good edging on both sides, it is time to start turning.",
        "As you head down the mountain, lean into the edge you want to turn towards (leaning towards you heel will turn you towards your heel).",
        "As you do, rotate your shoulders towards the turn as well, which opens up your body and moves some weight over to the side you're turning.",
        "Start on one side of the mountain and practice heading down diagonally, working on this turn as you feel comfortable.",
        "Practice on both sides.",
        "Once you feel comfortable with both sides, try changing direction.",
        "Slowly lean off your heel edge and lean towards your toes, rotating your shoulders along with you.",
        "Practice until you can edge on a dime.",
        "As you get more comfortable you'll pick up speed on your turns and stops, quickly shifting from edge to edge.",
        "You should be able to zig-zag down the hill eventually, showing that you have the control to turn and stop on a dime.",
        "A full stop is just an extreme \"heel-edge.\"",
        "You lean so hard into your heel edge, so quickly, that you whip the board around horizontally.",
        "This digs the heel edge of your board into the snow to stop it.",
        "Remember that your first day of boarding is all about comfort, not looking impressive.",
        "Very few people look good on their first day of boarding.",
        "The sport can be incredibly frustrating if you expect to look like a life-long snow bunny on your first runs.",
        "Focus, instead, on board comfort, getting used to basic riding, turning, and stopping so that you can move fluidly anywhere on the mountain.",
        "The tricks, speed, and flash will only come after you've mastered these basics.",
        "Snowboarding Stylishly Know that a snowboard girl is simply a girl who snowboards.",
        "That's it.",
        "While the snowboarding world is typically male-dominated, there is nothing special you have to do or wear that makes you a snowboard girl.",
        "Just go snowboard.",
        "Get to know the trails on your mountain, find a board you love, and spend time out on the snow whenever possible.",
        "If you get out there and ride, you're a snowboard girl.",
        "Snowboarding is slowly becoming a more accessible culture to join into.",
        "That said, most snowboarders still have little time or respect for \"posers,\" or people who wear snowboard styles but never actually board.",
        "Buy your own board.",
        "Get an \"all-mountain board\" if you are a beginner.",
        "All-mountains can be used for slopes and terrain parks, and they blend speed and maneuverability well.",
        "This makes them perfect for new riders.",
        "Size: Stand the board up on its end, so that the top reaches between your nose and chin.",
        "Directional Twin-Tip Both ends are almost identical, rounded tips.",
        "Camber Type: Beginner riders should try a rocker-style board (the profile of the board curves upward) because of the added maneuverability and turning forgiveness.",
        "Find amazing snowboarding role models.",
        "There are many amazing women of snowboarding that can carve a mountain with the best men any day.",
        "Watching snowboarding and finding women you can look up to is a great way to see snowboard girls in action.",
        "Watch the Winter Olympics and X-Games, where snowboarders of both genders are often some of the main attractions.",
        "Check snowboard blogs, specifically those revolving around women boarders like Burton Girls.",
        "Learn some snowboarding styles.",
        "Though it is almost completely cosmetic, snowboarders and skiers have traditionally worn different styles on the mountain.",
        "Snowboard style is directly influenced by skateboarding and street styles, often featuring brighter colors and bold, graffiti/urban-inspired designs.",
        "You should, of course, wear what you like, but snowboarders typically aim for alternative or youthful clothing.",
        "Snowboarding initially adopted a lot of influences from punks and rock culture but has since involved to include a lot of hip-hop influences.",
        "Check out the latest styles from brands like Burton, O'Neill, Thirty Two, and more.",
        "Avoid makeup on the mountain.",
        "Snowboard girls aren't there to pose, they are there to ride and enjoy themselves.",
        "Makeup is not only unnecessary, as it will be mostly covered up by goggles and hats, it will more than likely be smeared off within 1-2 runs.",
        "Sweat, snow, and the occasional fall are going to get you a little dirty, but that's half the fun.",
        "Save the makeup for the after party and focus more on your boarding than your looks.",
        "Watch snowboarding videos to get ideas for tricks, styles, and subculture.",
        "There is a rich snowboarding culture out there, and most of it is shared through videos and compilations.",
        "At one time, this involved sharing and copying old VHS tapes, but today's snowboarding girls can run to YouTube to watch amazing boarders at work.",
        "This is the best way to inundate yourself in snowboard culture.",
        "Watch and share your favorite videos with friends, try and replicate some of the tricks as you get more advanced and take style tips when you see something you like."
    ]
}