{
    "title": "How to Make Fresh Coconut Chutney in Andhra Style",
    "url": "https://www.wikihow.com/Make-Fresh-Coconut-Chutney-in-Andhra-Style",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "World Cuisines",
        "Indian Cuisine",
        "Indian Style Condiments"
    ],
    "steps": [
        {
            "headline": "Break a fresh coconut into two pieces.",
            "description": "Cut out the pieces from each shell of the coconut."
        },
        {
            "headline": "Put the pieces into a mixer grinder.",
            "description": ""
        },
        {
            "headline": "Add the roasted chana dal into the grinder.",
            "description": "Also add the water, green chilies, curd, tamarind pulp, garlic cloves and salt."
        },
        {
            "headline": "Grind into a paste.",
            "description": ""
        },
        {
            "headline": "Add oil to a frying pan.",
            "description": ""
        },
        {
            "headline": "Split the whole and dried red chilies into two pieces.",
            "description": "Add the pieces to the oil along with the cumin seeds, mustard seeds, white lentils and fenugreek seeds."
        },
        {
            "headline": "Switch off the gas stove or heat source.",
            "description": "Add the curry leaves. Then, sprinkle asafoetida into the mixture."
        },
        {
            "headline": "Add the contents of the ground paste of coconut and green chilies to a glass bowl.",
            "description": ""
        },
        {
            "headline": "Mix the paste and other ingredients together.",
            "description": "Serve. This chutney goes well with dosas, idlis or vadas."
        }
    ],
    "tyn": [
        "A glass bowl to keep the chutney",
        "Mixer grinder",
        "Frying pan"
    ],
    "text": " Break a fresh coconut into two pieces. Cut out the pieces from each shell of the coconut. Put the pieces into a mixer grinder.  Add the roasted chana dal into the grinder. Also add the water, green chilies, curd, tamarind pulp, garlic cloves and salt. Grind into a paste.  Add oil to a frying pan.  Split the whole and dried red chilies into two pieces. Add the pieces to the oil along with the cumin seeds, mustard seeds, white lentils and fenugreek seeds. Switch off the gas stove or heat source. Add the curry leaves. Then, sprinkle asafoetida into the mixture. Add the contents of the ground paste of coconut and green chilies to a glass bowl.  Mix the paste and other ingredients together. Serve. This chutney goes well with dosas, idlis or vadas.",
    "sentences": [
        " Break a fresh coconut into two pieces.",
        "Cut out the pieces from each shell of the coconut.",
        "Put the pieces into a mixer grinder.",
        "Add the roasted chana dal into the grinder.",
        "Also add the water, green chilies, curd, tamarind pulp, garlic cloves and salt.",
        "Grind into a paste.",
        "Add oil to a frying pan.",
        "Split the whole and dried red chilies into two pieces.",
        "Add the pieces to the oil along with the cumin seeds, mustard seeds, white lentils and fenugreek seeds.",
        "Switch off the gas stove or heat source.",
        "Add the curry leaves.",
        "Then, sprinkle asafoetida into the mixture.",
        "Add the contents of the ground paste of coconut and green chilies to a glass bowl.",
        "Mix the paste and other ingredients together.",
        "Serve.",
        "This chutney goes well with dosas, idlis or vadas."
    ]
}