{
    "title": "How to Do Bicycle Crunches",
    "url": "https://www.wikihow.com/Do-Bicycle-Crunches",
    "category_hierarchy": [
        "Sports and Fitness",
        "Personal Fitness",
        "Building Muscle & Strength"
    ],
    "methods": [
        {
            "name": "Getting Into Position",
            "steps": [
                {
                    "headline": "Lie flat on the floor.",
                    "description": "You should be on your back while you extend your legs flat in front of you. Try to relax as you look straight up at the ceiling so you're not holding tension in your shoulders. If it's more comfortable, you can lie on a lightly cushioned surface. For example, lie down on a yoga mat or carpeted floor."
                },
                {
                    "headline": "Place your hands behind your head.",
                    "description": "Spread your elbows wide as you bring your hands behind your head. Lightly touch the back of your head with your fingers and palms.Tip: Avoid interlacing your fingers because you'll be more likely to pull on your neck. This can cause muscle strain or fatigue. If you keep your elbows tucked in, your crunches won't engage your oblique muscles as well."
                },
                {
                    "headline": "Bend your knees up at a 90-degree angle.",
                    "description": "Keep your feet planted on the floor as you bring your knees up so they form the peak of a triangle. Your feet should be flat and about shoulder-width apart on the floor. Your knees shouldn't be knocking together once they're at a 90-degree angle. Instead, keep space between them."
                }
            ]
        },
        {
            "name": "Performing the Bicycle Crunch",
            "steps": [
                {
                    "headline": "Lift your legs up and away from your body.",
                    "description": "Once your knees are bent, lift your feet up so your legs are extended and slightly bent at the knee. Avoid straightening your legs so much that your hamstrings feel tight."
                },
                {
                    "headline": "Bring your right knee to your chest and touch your left elbow to it.",
                    "description": "Twist your torso as you draw in your knee. At the same time, rotate your left elbow to touch your right knee. Your shoulder blades should be raised off the floor so your abs are getting stretched instead of your arms."
                },
                {
                    "headline": "Alternate the crunch by touching the other knee with the opposite elbow.",
                    "description": "Release the crunch and bring your other knee in towards your chest as you touch the opposite elbow to it. Extend the leg that's not tucked in so it's pushed away from your body as though you're pedaling a bike. Once you get the hang of it, you can smoothly rotate your torso as your elbows touch alternating knees."
                },
                {
                    "headline": "Aim for 15 to 20 crunches per set.",
                    "description": "If you're just starting out with bicycle crunches try to do 1 to 2 sets. Then, work your way up to at least 3 or 4 sets of 15 to 20 crunches for a more challenging workout that builds your abs.Tip: Instead of counting crunches, you could also time yourself for sets. For example, 1 set might last between 20 and 60 seconds. It's okay to adjust the number of crunches you perform for each set. For example, you might prefer to start with 10 crunches per set."
                }
            ]
        },
        {
            "name": "Trying Variations",
            "steps": [
                {
                    "headline": "Stand instead of lie down for an easier way to do the bicycle crunch.",
                    "description": "If you feel uncomfortable when you lie on the ground and twist, stay in a standing position. Then, twist your waist and bring the elbow of your arm to the knee of your opposite leg. Lift that leg while you twist to mimic the movements of the bicycle crunch. Repeat this crunch in the opposite direction."
                },
                {
                    "headline": "Keep your knees bent instead of peddling them for a simpler crunch.",
                    "description": "If the traditional bicycle crunch is too hard on your torso, try leaving your feet on the ground so your knees form a 90-degree angle. Then, follow the rotation portion of the crunch so you bring your elbow to the opposite knee.Tip: You can also try simply raising your leg and setting it back down as you rotate the opposite elbow. Remember to keep your fingers loose instead of locking them so you don't pull on your neck."
                },
                {
                    "headline": "Lie on a bench to do bicycle crunches for a more challenging workout.",
                    "description": "To do an elevated bicycle crunch, lie with your back on an exercise bench so your legs are hanging over both sides. Then, pull a knee up towards your chest as you bring your opposite elbow towards the knee. Remember to leave one of your legs touching the floor as you do the crunch. The elevated bicycle crunch is more of a workout for your core muscles since you're doing a deeper stretch."
                },
                {
                    "headline": "Do the bicycle crunch on a half-dome balance ball for an intense stretch.",
                    "description": "Place the flat side of the half-dome ball on the floor and sit on it. Then, lean back so your lower back is supported by the domed part of the ball. Plant your feet on the floor before you perform the bicycle crunch. This will probably feel like a difficult workout because you'll be using your muscles to balance while performing the crunch."
                }
            ]
        }
    ],
    "tyn": [
        "A yoga mat, optional",
        "Half-dome balance ball, optional",
        "Exercise bench, optional"
    ],
    "text": " Getting Into Position Lie flat on the floor. You should be on your back while you extend your legs flat in front of you. Try to relax as you look straight up at the ceiling so you're not holding tension in your shoulders. If it's more comfortable, you can lie on a lightly cushioned surface. For example, lie down on a yoga mat or carpeted floor. Place your hands behind your head. Spread your elbows wide as you bring your hands behind your head. Lightly touch the back of your head with your fingers and palms.Tip: Avoid interlacing your fingers because you'll be more likely to pull on your neck. This can cause muscle strain or fatigue. If you keep your elbows tucked in, your crunches won't engage your oblique muscles as well. Bend your knees up at a 90-degree angle. Keep your feet planted on the floor as you bring your knees up so they form the peak of a triangle. Your feet should be flat and about shoulder-width apart on the floor. Your knees shouldn't be knocking together once they're at a 90-degree angle. Instead, keep space between them. Performing the Bicycle Crunch Lift your legs up and away from your body. Once your knees are bent, lift your feet up so your legs are extended and slightly bent at the knee. Avoid straightening your legs so much that your hamstrings feel tight. Bring your right knee to your chest and touch your left elbow to it. Twist your torso as you draw in your knee. At the same time, rotate your left elbow to touch your right knee. Your shoulder blades should be raised off the floor so your abs are getting stretched instead of your arms. Alternate the crunch by touching the other knee with the opposite elbow. Release the crunch and bring your other knee in towards your chest as you touch the opposite elbow to it. Extend the leg that's not tucked in so it's pushed away from your body as though you're pedaling a bike. Once you get the hang of it, you can smoothly rotate your torso as your elbows touch alternating knees. Aim for 15 to 20 crunches per set. If you're just starting out with bicycle crunches try to do 1 to 2 sets. Then, work your way up to at least 3 or 4 sets of 15 to 20 crunches for a more challenging workout that builds your abs.Tip: Instead of counting crunches, you could also time yourself for sets. For example, 1 set might last between 20 and 60 seconds. It's okay to adjust the number of crunches you perform for each set. For example, you might prefer to start with 10 crunches per set. Trying Variations Stand instead of lie down for an easier way to do the bicycle crunch. If you feel uncomfortable when you lie on the ground and twist, stay in a standing position. Then, twist your waist and bring the elbow of your arm to the knee of your opposite leg. Lift that leg while you twist to mimic the movements of the bicycle crunch. Repeat this crunch in the opposite direction. Keep your knees bent instead of peddling them for a simpler crunch. If the traditional bicycle crunch is too hard on your torso, try leaving your feet on the ground so your knees form a 90-degree angle. Then, follow the rotation portion of the crunch so you bring your elbow to the opposite knee.Tip: You can also try simply raising your leg and setting it back down as you rotate the opposite elbow. Remember to keep your fingers loose instead of locking them so you don't pull on your neck. Lie on a bench to do bicycle crunches for a more challenging workout. To do an elevated bicycle crunch, lie with your back on an exercise bench so your legs are hanging over both sides. Then, pull a knee up towards your chest as you bring your opposite elbow towards the knee. Remember to leave one of your legs touching the floor as you do the crunch. The elevated bicycle crunch is more of a workout for your core muscles since you're doing a deeper stretch. Do the bicycle crunch on a half-dome balance ball for an intense stretch. Place the flat side of the half-dome ball on the floor and sit on it. Then, lean back so your lower back is supported by the domed part of the ball. Plant your feet on the floor before you perform the bicycle crunch. This will probably feel like a difficult workout because you'll be using your muscles to balance while performing the crunch.",
    "sentences": [
        " Getting Into Position Lie flat on the floor.",
        "You should be on your back while you extend your legs flat in front of you.",
        "Try to relax as you look straight up at the ceiling so you're not holding tension in your shoulders.",
        "If it's more comfortable, you can lie on a lightly cushioned surface.",
        "For example, lie down on a yoga mat or carpeted floor.",
        "Place your hands behind your head.",
        "Spread your elbows wide as you bring your hands behind your head.",
        "Lightly touch the back of your head with your fingers and palms.Tip: Avoid interlacing your fingers because you'll be more likely to pull on your neck.",
        "This can cause muscle strain or fatigue.",
        "If you keep your elbows tucked in, your crunches won't engage your oblique muscles as well.",
        "Bend your knees up at a 90-degree angle.",
        "Keep your feet planted on the floor as you bring your knees up so they form the peak of a triangle.",
        "Your feet should be flat and about shoulder-width apart on the floor.",
        "Your knees shouldn't be knocking together once they're at a 90-degree angle.",
        "Instead, keep space between them.",
        "Performing the Bicycle Crunch Lift your legs up and away from your body.",
        "Once your knees are bent, lift your feet up so your legs are extended and slightly bent at the knee.",
        "Avoid straightening your legs so much that your hamstrings feel tight.",
        "Bring your right knee to your chest and touch your left elbow to it.",
        "Twist your torso as you draw in your knee.",
        "At the same time, rotate your left elbow to touch your right knee.",
        "Your shoulder blades should be raised off the floor so your abs are getting stretched instead of your arms.",
        "Alternate the crunch by touching the other knee with the opposite elbow.",
        "Release the crunch and bring your other knee in towards your chest as you touch the opposite elbow to it.",
        "Extend the leg that's not tucked in so it's pushed away from your body as though you're pedaling a bike.",
        "Once you get the hang of it, you can smoothly rotate your torso as your elbows touch alternating knees.",
        "Aim for 15 to 20 crunches per set.",
        "If you're just starting out with bicycle crunches try to do 1 to 2 sets.",
        "Then, work your way up to at least 3 or 4 sets of 15 to 20 crunches for a more challenging workout that builds your abs.Tip: Instead of counting crunches, you could also time yourself for sets.",
        "For example, 1 set might last between 20 and 60 seconds.",
        "It's okay to adjust the number of crunches you perform for each set.",
        "For example, you might prefer to start with 10 crunches per set.",
        "Trying Variations Stand instead of lie down for an easier way to do the bicycle crunch.",
        "If you feel uncomfortable when you lie on the ground and twist, stay in a standing position.",
        "Then, twist your waist and bring the elbow of your arm to the knee of your opposite leg.",
        "Lift that leg while you twist to mimic the movements of the bicycle crunch.",
        "Repeat this crunch in the opposite direction.",
        "Keep your knees bent instead of peddling them for a simpler crunch.",
        "If the traditional bicycle crunch is too hard on your torso, try leaving your feet on the ground so your knees form a 90-degree angle.",
        "Then, follow the rotation portion of the crunch so you bring your elbow to the opposite knee.Tip: You can also try simply raising your leg and setting it back down as you rotate the opposite elbow.",
        "Remember to keep your fingers loose instead of locking them so you don't pull on your neck.",
        "Lie on a bench to do bicycle crunches for a more challenging workout.",
        "To do an elevated bicycle crunch, lie with your back on an exercise bench so your legs are hanging over both sides.",
        "Then, pull a knee up towards your chest as you bring your opposite elbow towards the knee.",
        "Remember to leave one of your legs touching the floor as you do the crunch.",
        "The elevated bicycle crunch is more of a workout for your core muscles since you're doing a deeper stretch.",
        "Do the bicycle crunch on a half-dome balance ball for an intense stretch.",
        "Place the flat side of the half-dome ball on the floor and sit on it.",
        "Then, lean back so your lower back is supported by the domed part of the ball.",
        "Plant your feet on the floor before you perform the bicycle crunch.",
        "This will probably feel like a difficult workout because you'll be using your muscles to balance while performing the crunch."
    ]
}