{
    "title": "How to Make Barbecue Sauce",
    "url": "https://www.wikihow.com/Make-Barbecue-Sauce",
    "category_hierarchy": [
        "Food and Entertaining",
        "Recipes",
        "Jams Preserves and Condiments",
        "Sauces",
        "Barbecue Sauces"
    ],
    "methods": [
        {
            "name": "Cooking Quick Classic Barbecue Sauce",
            "steps": [
                {
                    "headline": "Measure all of the ingredients into a small saucepan.",
                    "description": "You'll need to put 1/2 cup (115 g) of ketchup, 3 tablespoons (44 ml) of water, 1 tablespoon (15 ml) of maple syrup, 2 teaspoons (10 g) of Dijon mustard, 1 teaspoon (4.9 ml) of Worcestershire sauce, 1 teaspoon (4.5 g) of butter, 1/2 teaspoon (1 g) of smoked paprika, 1/2 teaspoon (1.5 g) of onion powder, 1/2 teaspoon (1.5 g) of garlic powder, and 1/4 teaspoon (0.5 g) of ground black pepper into the pan."
                },
                {
                    "headline": "Stir the sauce and turn the burner to medium.",
                    "description": "Stir the sauce to combine the ingredients. Turn the burner to medium heat and continue to stir the sauce so it doesn't stick to the bottom of the pan."
                },
                {
                    "headline": "Simmer the sauce for 3 to 5 minutes.",
                    "description": "Bring the sauce to a gentle bubble and stir it frequently as it cooks. Let the sauce simmer a few minutes so the butter melts and the flavors develop. Use the sauce immediately or refrigerate it in an airtight container for up to 5 days."
                }
            ]
        },
        {
            "name": "Making Kansas City-Style Barbecue Sauce",
            "steps": [
                {
                    "headline": "Sauté the onion for 5 minutes over medium heat.",
                    "description": "Heat 2 tablespoons (28 g) of butter in a medium saucepan. Once the butter melts, stir in 1 small chopped onion and let it cook until it becomes translucent and soft. Stir the onion frequently to prevent it from sticking to the pan."
                },
                {
                    "headline": "Add 3 cloves of garlic and sauté them for 30 seconds.",
                    "description": "Mince the garlic and stir it into the saucepan with the onion. Stir and cook the mixture until the garlic becomes fragrant. Avoid cooking the garlic for more than 30 seconds because it can burn quickly."
                },
                {
                    "headline": "Stir in the ketchup, molasses, sugar, vinegar, mustard, chili, and pepper.",
                    "description": "Add 2 cups (450 g) of ketchup, 1/3 cup (113 g) of molasses, 1/3 cup (65 g) of dark brown sugar, ⁄3 cup (79 ml) of apple cider vinegar, 2 tablespoons (30 g) of yellow mustard, 1 tablespoon (8 g) of chili powder, 1 teaspoon (2 g) of freshly ground black pepper, and 1/2 teaspoon (1 g) of cayenne pepper. Stir the sauce to combine the seasonings."
                },
                {
                    "headline": "Bring the sauce to a boil and let it simmer for 30 minutes.",
                    "description": "Turn the burner to high so the sauce begins to boil vigorously. Then turn the burner down to low so the sauce bubbles very gently. Cook the sauce and stir it frequently until it thickens."
                },
                {
                    "headline": "Blend the Kansas City-style barbecue sauce.",
                    "description": "Turn off the burner and spoon the sauce into a blender. Put the lid on the blender and pulse it until the sauce is completely smooth. Use the sauce immediately or store it in an airtight container in the refrigerator for up to 1 month."
                }
            ]
        },
        {
            "name": "Mixing South Carolina Mustard Barbecue Sauce",
            "steps": [
                {
                    "headline": "Measure the mustard, honey, vinegar, ketchup, sugar, and sauces.",
                    "description": "Put 3/4 cup (187 g) of yellow mustard, 1/2 cup (170 g) of honey, ⁄4 cup (59 ml) of apple cider vinegar, 2 tablespoons (30 g) of ketchup, 1 tablespoon (12.5 g) of brown sugar, 2 teaspoons (9.9 ml) of Worcestershire sauce, and 1 teaspoon (4.9 ml) of hot sauce into a mixing bowl or storage container."
                },
                {
                    "headline": "Mix the sauce ingredients.",
                    "description": "Use a spoon or a whisk to thoroughly combine the barbecue sauce. Ensure that the sugar and sauces are completely incorporated. Break up any lumps of brown sugar."
                },
                {
                    "headline": "Refrigerate the sauce for at least 1 day before using it.",
                    "description": "Cover the bowl or put the sauce into an airtight storage container. Put the sauce in the refrigerator to chill for at least 1 day before you use it. For longer storage, refrigerate the sauce for up to 2 weeks."
                }
            ]
        },
        {
            "name": "Cooking Tangy Texas-Style Barbecue Sauce",
            "steps": [
                {
                    "headline": "Measure all of the ingredients into a saucepan.",
                    "description": "Place 1 3/4 cups (395 g) of ketchup ⁄2 cup (120 ml) plus 2 tablespoons (30 ml) of water, ⁄4 cup (59 ml) plus 1 tablespoon (15 ml) of cider vinegar, ⁄4 cup (59 ml) plus 1 tablespoon (15 ml) of white vinegar, 2 1/4 teaspoons (9 g) of brown sugar, 2 ⁄2 tablespoons (37 ml) of Worcestershire sauce, 1 tablespoon (8 g) of chili powder, 1 tablespoon (6 g) of ground cumin, 1 1/2 teaspoons (7.5 g) of kosher salt, and 1 1/2 teaspoons (3 g) coarse black pepper in the saucepan."
                },
                {
                    "headline": "Stir and heat the sauce over medium.",
                    "description": "Stir the sauce until the sugar is dissolved and heat it until the spices dissolve. Avoid bringing the sauce to a boil or it the sugars could burn."
                },
                {
                    "headline": "Use or store the Texas-Style barbecue sauce.",
                    "description": "Turn off the burner and pour the sauce over sliced or smoked meat. You can also use the sauce like a marinade for flavoring meat or poultry before you cook them. To store the sauce, put it in an airtight container or squeeze bottle and refrigerate it for up to 1 month."
                }
            ]
        },
        {
            "name": "Making White Alabama-Style Barbecue Sauce",
            "steps": [
                {
                    "headline": "Measure the mayo, vinegar, garlic, mustard, horseradish, and seasoning.",
                    "description": "Put 1 1/2 cups (348 g) of mayonnaise, ⁄4 cup (59 ml) of white wine vinegar, 1 clove of minced garlic, 1 tablespoon (6.5 g) of coarse ground pepper, 1 tablespoon (15 g) of spicy brown mustard, 1 teaspoon (4 g) of sugar, 1 teaspoon (5.5 g) of salt, and 2 teaspoons (10 g) of horseradish into a blender. If you don't have a blender, you can use a food processor."
                },
                {
                    "headline": "Pulse the sauce for 1 minute.",
                    "description": "Put the lid on the blender and pulse the sauce off and on for 1 minute so it becomes completely smooth. If you want a thicker sauce, pulse it for less time so it remains chunky."
                },
                {
                    "headline": "Use or store the sauce.",
                    "description": "Spoon the white barbecue sauce over fried chicken or salad. You can also dip French fries into the sauce or store it for later use. Place the white barbecue sauce into an airtight container and refrigerate it for up to 1 week."
                }
            ]
        }
    ],
    "tyn": [
        "Quick Classic Barbecue Sauce",
        "Measuring cups and spoons",
        "Small saucepan",
        "Spoon",
        "Airtight storage container",
        "Kansas City-Style Barbecue Sauce",
        "Knife and cutting board",
        "Medium saucepan",
        "Blender",
        "South Carolina Mustard Barbecue Sauce",
        "Mixing bowl with lid",
        "Spoon or whisk",
        "Tangy Texas-Style Barbecue Sauce",
        "Saucepan",
        "Airtight container or squeeze bottle",
        "White Alabama-Style Barbecue Sauce",
        "Blender or food processor"
    ],
    "text": " Cooking Quick Classic Barbecue Sauce Measure all of the ingredients into a small saucepan. You'll need to put 1/2 cup (115 g) of ketchup, 3 tablespoons (44 ml) of water, 1 tablespoon (15 ml) of maple syrup, 2 teaspoons (10 g) of Dijon mustard, 1 teaspoon (4.9 ml) of Worcestershire sauce, 1 teaspoon (4.5 g) of butter, 1/2 teaspoon (1 g) of smoked paprika, 1/2 teaspoon (1.5 g) of onion powder, 1/2 teaspoon (1.5 g) of garlic powder, and 1/4 teaspoon (0.5 g) of ground black pepper into the pan. Stir the sauce and turn the burner to medium. Stir the sauce to combine the ingredients. Turn the burner to medium heat and continue to stir the sauce so it doesn't stick to the bottom of the pan. Simmer the sauce for 3 to 5 minutes. Bring the sauce to a gentle bubble and stir it frequently as it cooks. Let the sauce simmer a few minutes so the butter melts and the flavors develop. Use the sauce immediately or refrigerate it in an airtight container for up to 5 days. Making Kansas City-Style Barbecue Sauce Sauté the onion for 5 minutes over medium heat. Heat 2 tablespoons (28 g) of butter in a medium saucepan. Once the butter melts, stir in 1 small chopped onion and let it cook until it becomes translucent and soft. Stir the onion frequently to prevent it from sticking to the pan. Add 3 cloves of garlic and sauté them for 30 seconds. Mince the garlic and stir it into the saucepan with the onion. Stir and cook the mixture until the garlic becomes fragrant. Avoid cooking the garlic for more than 30 seconds because it can burn quickly. Stir in the ketchup, molasses, sugar, vinegar, mustard, chili, and pepper. Add 2 cups (450 g) of ketchup, 1/3 cup (113 g) of molasses, 1/3 cup (65 g) of dark brown sugar, ⁄3 cup (79 ml) of apple cider vinegar, 2 tablespoons (30 g) of yellow mustard, 1 tablespoon (8 g) of chili powder, 1 teaspoon (2 g) of freshly ground black pepper, and 1/2 teaspoon (1 g) of cayenne pepper. Stir the sauce to combine the seasonings. Bring the sauce to a boil and let it simmer for 30 minutes. Turn the burner to high so the sauce begins to boil vigorously. Then turn the burner down to low so the sauce bubbles very gently. Cook the sauce and stir it frequently until it thickens. Blend the Kansas City-style barbecue sauce. Turn off the burner and spoon the sauce into a blender. Put the lid on the blender and pulse it until the sauce is completely smooth. Use the sauce immediately or store it in an airtight container in the refrigerator for up to 1 month. Mixing South Carolina Mustard Barbecue Sauce Measure the mustard, honey, vinegar, ketchup, sugar, and sauces. Put 3/4 cup (187 g) of yellow mustard, 1/2 cup (170 g) of honey, ⁄4 cup (59 ml) of apple cider vinegar, 2 tablespoons (30 g) of ketchup, 1 tablespoon (12.5 g) of brown sugar, 2 teaspoons (9.9 ml) of Worcestershire sauce, and 1 teaspoon (4.9 ml) of hot sauce into a mixing bowl or storage container. Mix the sauce ingredients. Use a spoon or a whisk to thoroughly combine the barbecue sauce. Ensure that the sugar and sauces are completely incorporated. Break up any lumps of brown sugar. Refrigerate the sauce for at least 1 day before using it. Cover the bowl or put the sauce into an airtight storage container. Put the sauce in the refrigerator to chill for at least 1 day before you use it. For longer storage, refrigerate the sauce for up to 2 weeks. Cooking Tangy Texas-Style Barbecue Sauce Measure all of the ingredients into a saucepan. Place 1 3/4 cups (395 g) of ketchup ⁄2 cup (120 ml) plus 2 tablespoons (30 ml) of water, ⁄4 cup (59 ml) plus 1 tablespoon (15 ml) of cider vinegar, ⁄4 cup (59 ml) plus 1 tablespoon (15 ml) of white vinegar, 2 1/4 teaspoons (9 g) of brown sugar, 2 ⁄2 tablespoons (37 ml) of Worcestershire sauce, 1 tablespoon (8 g) of chili powder, 1 tablespoon (6 g) of ground cumin, 1 1/2 teaspoons (7.5 g) of kosher salt, and 1 1/2 teaspoons (3 g) coarse black pepper in the saucepan. Stir and heat the sauce over medium. Stir the sauce until the sugar is dissolved and heat it until the spices dissolve. Avoid bringing the sauce to a boil or it the sugars could burn. Use or store the Texas-Style barbecue sauce. Turn off the burner and pour the sauce over sliced or smoked meat. You can also use the sauce like a marinade for flavoring meat or poultry before you cook them. To store the sauce, put it in an airtight container or squeeze bottle and refrigerate it for up to 1 month. Making White Alabama-Style Barbecue Sauce Measure the mayo, vinegar, garlic, mustard, horseradish, and seasoning. Put 1 1/2 cups (348 g) of mayonnaise, ⁄4 cup (59 ml) of white wine vinegar, 1 clove of minced garlic, 1 tablespoon (6.5 g) of coarse ground pepper, 1 tablespoon (15 g) of spicy brown mustard, 1 teaspoon (4 g) of sugar, 1 teaspoon (5.5 g) of salt, and 2 teaspoons (10 g) of horseradish into a blender. If you don't have a blender, you can use a food processor. Pulse the sauce for 1 minute. Put the lid on the blender and pulse the sauce off and on for 1 minute so it becomes completely smooth. If you want a thicker sauce, pulse it for less time so it remains chunky. Use or store the sauce. Spoon the white barbecue sauce over fried chicken or salad. You can also dip French fries into the sauce or store it for later use. Place the white barbecue sauce into an airtight container and refrigerate it for up to 1 week.",
    "sentences": [
        " Cooking Quick Classic Barbecue Sauce Measure all of the ingredients into a small saucepan.",
        "You'll need to put 1/2 cup (115 g) of ketchup, 3 tablespoons (44 ml) of water, 1 tablespoon (15 ml) of maple syrup, 2 teaspoons (10 g) of Dijon mustard, 1 teaspoon (4.9 ml) of Worcestershire sauce, 1 teaspoon (4.5 g) of butter, 1/2 teaspoon (1 g) of smoked paprika, 1/2 teaspoon (1.5 g) of onion powder, 1/2 teaspoon (1.5 g) of garlic powder, and 1/4 teaspoon (0.5 g) of ground black pepper into the pan.",
        "Stir the sauce and turn the burner to medium.",
        "Stir the sauce to combine the ingredients.",
        "Turn the burner to medium heat and continue to stir the sauce so it doesn't stick to the bottom of the pan.",
        "Simmer the sauce for 3 to 5 minutes.",
        "Bring the sauce to a gentle bubble and stir it frequently as it cooks.",
        "Let the sauce simmer a few minutes so the butter melts and the flavors develop.",
        "Use the sauce immediately or refrigerate it in an airtight container for up to 5 days.",
        "Making Kansas City-Style Barbecue Sauce Sauté the onion for 5 minutes over medium heat.",
        "Heat 2 tablespoons (28 g) of butter in a medium saucepan.",
        "Once the butter melts, stir in 1 small chopped onion and let it cook until it becomes translucent and soft.",
        "Stir the onion frequently to prevent it from sticking to the pan.",
        "Add 3 cloves of garlic and sauté them for 30 seconds.",
        "Mince the garlic and stir it into the saucepan with the onion.",
        "Stir and cook the mixture until the garlic becomes fragrant.",
        "Avoid cooking the garlic for more than 30 seconds because it can burn quickly.",
        "Stir in the ketchup, molasses, sugar, vinegar, mustard, chili, and pepper.",
        "Add 2 cups (450 g) of ketchup, 1/3 cup (113 g) of molasses, 1/3 cup (65 g) of dark brown sugar, ⁄3 cup (79 ml) of apple cider vinegar, 2 tablespoons (30 g) of yellow mustard, 1 tablespoon (8 g) of chili powder, 1 teaspoon (2 g) of freshly ground black pepper, and 1/2 teaspoon (1 g) of cayenne pepper.",
        "Stir the sauce to combine the seasonings.",
        "Bring the sauce to a boil and let it simmer for 30 minutes.",
        "Turn the burner to high so the sauce begins to boil vigorously.",
        "Then turn the burner down to low so the sauce bubbles very gently.",
        "Cook the sauce and stir it frequently until it thickens.",
        "Blend the Kansas City-style barbecue sauce.",
        "Turn off the burner and spoon the sauce into a blender.",
        "Put the lid on the blender and pulse it until the sauce is completely smooth.",
        "Use the sauce immediately or store it in an airtight container in the refrigerator for up to 1 month.",
        "Mixing South Carolina Mustard Barbecue Sauce Measure the mustard, honey, vinegar, ketchup, sugar, and sauces.",
        "Put 3/4 cup (187 g) of yellow mustard, 1/2 cup (170 g) of honey, ⁄4 cup (59 ml) of apple cider vinegar, 2 tablespoons (30 g) of ketchup, 1 tablespoon (12.5 g) of brown sugar, 2 teaspoons (9.9 ml) of Worcestershire sauce, and 1 teaspoon (4.9 ml) of hot sauce into a mixing bowl or storage container.",
        "Mix the sauce ingredients.",
        "Use a spoon or a whisk to thoroughly combine the barbecue sauce.",
        "Ensure that the sugar and sauces are completely incorporated.",
        "Break up any lumps of brown sugar.",
        "Refrigerate the sauce for at least 1 day before using it.",
        "Cover the bowl or put the sauce into an airtight storage container.",
        "Put the sauce in the refrigerator to chill for at least 1 day before you use it.",
        "For longer storage, refrigerate the sauce for up to 2 weeks.",
        "Cooking Tangy Texas-Style Barbecue Sauce Measure all of the ingredients into a saucepan.",
        "Place 1 3/4 cups (395 g) of ketchup ⁄2 cup (120 ml) plus 2 tablespoons (30 ml) of water, ⁄4 cup (59 ml) plus 1 tablespoon (15 ml) of cider vinegar, ⁄4 cup (59 ml) plus 1 tablespoon (15 ml) of white vinegar, 2 1/4 teaspoons (9 g) of brown sugar, 2 ⁄2 tablespoons (37 ml) of Worcestershire sauce, 1 tablespoon (8 g) of chili powder, 1 tablespoon (6 g) of ground cumin, 1 1/2 teaspoons (7.5 g) of kosher salt, and 1 1/2 teaspoons (3 g) coarse black pepper in the saucepan.",
        "Stir and heat the sauce over medium.",
        "Stir the sauce until the sugar is dissolved and heat it until the spices dissolve.",
        "Avoid bringing the sauce to a boil or it the sugars could burn.",
        "Use or store the Texas-Style barbecue sauce.",
        "Turn off the burner and pour the sauce over sliced or smoked meat.",
        "You can also use the sauce like a marinade for flavoring meat or poultry before you cook them.",
        "To store the sauce, put it in an airtight container or squeeze bottle and refrigerate it for up to 1 month.",
        "Making White Alabama-Style Barbecue Sauce Measure the mayo, vinegar, garlic, mustard, horseradish, and seasoning.",
        "Put 1 1/2 cups (348 g) of mayonnaise, ⁄4 cup (59 ml) of white wine vinegar, 1 clove of minced garlic, 1 tablespoon (6.5 g) of coarse ground pepper, 1 tablespoon (15 g) of spicy brown mustard, 1 teaspoon (4 g) of sugar, 1 teaspoon (5.5 g) of salt, and 2 teaspoons (10 g) of horseradish into a blender.",
        "If you don't have a blender, you can use a food processor.",
        "Pulse the sauce for 1 minute.",
        "Put the lid on the blender and pulse the sauce off and on for 1 minute so it becomes completely smooth.",
        "If you want a thicker sauce, pulse it for less time so it remains chunky.",
        "Use or store the sauce.",
        "Spoon the white barbecue sauce over fried chicken or salad.",
        "You can also dip French fries into the sauce or store it for later use.",
        "Place the white barbecue sauce into an airtight container and refrigerate it for up to 1 week."
    ]
}